{
    "main_text": "Abduction: The General Idea || The ubiquity of abduction\n1.2 The ubiquity of abduction\n\nThe type of inference exemplified in the cases described at the\nbeginning of this entry will strike most as entirely familiar.\nPhilosophers as well as psychologists tend to agree that abduction is\nfrequently employed in everyday reasoning. Sometimes our reliance on\nabductive reasoning is quite obvious and explicit. But in some daily\npractices, it may be so routine and automatic that it easily goes\nunnoticed. A case in point may be our trust in other people’s\ntestimony, which has been said to rest on abductive reasoning; see\nHarman 1965, Adler 1994, Fricker 1994, and Lipton 1998 for defenses of\nthis claim. For instance, according to Jonathan Adler (1994, 274f),\n“[t]he best explanation for why the informant asserts that\nP is normally that … he believes it for duly responsible\nreasons and … he intends that I shall believe it too,”\nwhich is why we are normally justified in trusting the\ninformant’s testimony. This may well be correct, even though in\ncoming to trust a person’s testimony one does not normally seem\nto be aware of any abductive reasoning going on in one’s mind.\nSimilar remarks may apply to what some hold to be a further, possibly\neven more fundamental, role of abduction in linguistic practice, to\nwit, its role in determining what a speaker means by an utterance.\nSpecifically, it has been argued that decoding utterances is a matter\nof inferring the best explanation of why someone said what he or she\nsaid in the context in which the utterance was made. Even more\nspecifically, authors working in the field of pragmatics have\nsuggested that hearers invoke the Gricean maxims of conversation to\nhelp them work out the best explanation of a speaker’s utterance\nwhenever the semantic content of the utterance is insufficiently\ninformative for the purposes of the conversation, or is too\ninformative, or off-topic, or implausible, or otherwise odd or\ninappropriate; see, for instance, Bach and Harnish 1979 (92f), Dascal\n1979 (167), and Hobbs 2004. As in cases of reliance on speaker\ntestimony, the requisite abductive reasoning would normally seem to\ntake place at a subconscious level.\n\nAbductive reasoning is not limited to everyday contexts. Quite the\ncontrary: philosophers of science have argued that abduction is a\ncornerstone of scientific methodology; see, for instance, Boyd 1981,\n1984, Harré 1986, 1988, Lipton 1991, 2004, and Psillos 1999.\nAccording to Timothy Williamson (2007), “[t]he abductive\nmethodology is the best science provides” and Ernan McMullin\n(1992) even goes so far to call abduction “the inference that\nmakes science.” To illustrate the use of abduction in science,\nwe consider two examples.\n\nAt the beginning of the nineteenth century, it was discovered that the\norbit of Uranus, one of the seven planets known at the time, departed\nfrom the orbit as predicted on the basis of Isaac Newton’s\ntheory of universal gravitation and the auxiliary assumption that\nthere were no further planets in the solar system. One possible\nexplanation was, of course, that Newton’s theory is false. Given\nits great empirical successes for (then) more than two centuries, that\ndid not appear to be a very good explanation. Two astronomers, John\nCouch Adams and Urbain Leverrier, instead suggested (independently of\neach other but almost simultaneously) that there was an eighth, as yet\nundiscovered planet in the solar system; that, they thought, provided\nthe best explanation of Uranus’ deviating orbit. Not much later,\nthis planet, which is now known as “Neptune,” was\ndiscovered.\n\nThe second example concerns what is now commonly regarded to have been\nthe discovery of the electron by the English physicist Joseph John\nThomson. Thomson had conducted experiments on cathode rays in order to\ndetermine whether they are streams of charged particles. He concluded\nthat they are indeed, reasoning as follows:\n\n\nAs the cathode rays carry a charge of negative electricity, are\ndeflected by an electrostatic force as if they were negatively\nelectrified, and are acted on by a magnetic force in just the way in\nwhich this force would act on a negatively electrified body moving\nalong the path of these rays, I can see no escape from the conclusion\nthat they are charges of negative electricity carried by particles of\nmatter. (Thomson, cited in Achinstein 2001, 17)\n\n\nThe conclusion that cathode rays consist of negatively charged\nparticles does not follow logically from the reported experimental\nresults, nor could Thomson draw on any relevant statistical data. That\nnevertheless he could “see no escape from the conclusion”\nis, we may safely assume, because the conclusion is the best—in\nthis case presumably even the only plausible—explanation of his\nresults that he could think of.\n\nMany other examples of scientific uses of abduction have been\ndiscussed in the literature; see, for instance, Harré 1986,\n1988 and Lipton 1991, 2004. Abduction is also said to be the\npredominant mode of reasoning in medical diagnosis: physicians tend to\ngo for the hypothesis that best explains the patient’s symptoms\n(see Josephson and Josephson (eds.) 1994, 9–12; see also\nDragulinescu 2016 on abductive reasoning in the context of\nmedicine).\n\nLast but not least, abduction plays a central role in some important\nphilosophical debates. See Shalkowski 2010 on the place of abduction\nin metaphysics (also Bigelow 2010), Krzyżanowska, Wenmackers, and\nDouven 2014 and Douven 2016a for a possible role of\nabduction in the semantics of conditionals, and Williamson\n2017 for an application of abduction in the philosophy of logic.\nArguably, however, abduction plays its most notable philosophical role\nin epistemology and in the philosophy of science, where it is\nfrequently invoked in objections to so-called underdetermination\narguments. Underdetermination arguments generally start from the\npremise that a number of given hypotheses are empirically equivalent,\nwhich their authors take to mean that the evidence—indeed, any\nevidence we might ever come to possess—is unable to favor one of\nthem over the others. From this, we are supposed to conclude that one\ncan never be warranted in believing any particular one of the\nhypotheses. (This is rough, but it will do for present purposes; see\nDouven 2008 and Stanford 2009, for more detailed accounts of\nunderdetermination arguments.) A famous instance of this type of\nargument is the Cartesian argument for global skepticism, according to\nwhich the hypothesis that reality is more or less the way we\ncustomarily deem it to be is empirically equivalent to a variety of\nso-called skeptical hypotheses (such as that we are beguiled by an\nevil demon, or that we are brains in a vat, connected to a\nsupercomputer; see, e.g., Folina 2016). Similar arguments have been\ngiven in support of scientific antirealism, according to which it will\nnever be warranted for us to choose between empirically equivalent\nrivals concerning what underlies the observable part of reality (van\nFraassen 1980).\n\nResponses to these arguments typically point to the fact that the\nnotion of empirical equivalence at play unduly neglects explanatory\nconsiderations, for instance, by defining the notion strictly in terms\nof hypotheses’ making the same predictions. Those responding\nthen argue that even if some hypotheses make exactly the same\npredictions, one of them may still be a better explanation of the\nphenomena predicted. Thus, if explanatory considerations have a role\nin determining which inferences we are licensed to make—as\naccording to defenders of abduction they have—then we might\nstill be warranted in believing in the truth (or probable truth, or\nsome such, depending—as will be seen below—on the version\nof abduction one assumes) of one of a number of hypotheses that all\nmake the same predictions. Following Bertrand Russell (1912, Ch. 2),\nmany epistemologists have invoked abduction in arguing against\nCartesian skepticism, their key claim being that even though, by\nconstruction, the skeptical hypotheses make the same predictions as\nthe hypothesis that reality is more or less the way we ordinarily take\nit to be, they are not equally good explanations of what they predict;\nin particular, the skeptical hypotheses have been said to be\nconsiderably less simple than the “ordinary world”\nhypothesis. See, among many others, Harman 1973 (Chs. 8 and 11),\nGoldman 1988 (205), Moser 1989 (161), and Vogel 1990, 2005; see\nPargetter 1984 for an abductive response specifically to skepticism\nregarding other minds. Similarly, philosophers of science have argued\nthat we are warranted to believe in Special Relativity Theory as\nopposed to Lorentz’s version of the æther theory. For even\nthough these theories make the same predictions, the former is\nexplanatorily superior to the latter. (Most arguments that have been\ngiven for this claim come down to the contention that Special\nRelativity Theory is ontologically more parsimonious than its\ncompetitor, which postulates the existence of an æther. See\nJanssen 2002 for an excellent discussion of the various reasons\nphilosophers of science have adduced for preferring Einstein’s\ntheory to Lorentz’s.)\n",
    "section_title": "1.2 The ubiquity of abduction",
    "entry_title": "Abduction",
    "hierarchy_title": "Abduction || Abduction: The General Idea || The ubiquity of abduction",
    "tokenized_text": [
        "abduction",
        "general",
        "idea",
        "ubiquity",
        "abduction",
        "ubiquity",
        "abduction",
        "type",
        "inference",
        "exemplified",
        "case",
        "described",
        "beginning",
        "entry",
        "strike",
        "entirely",
        "familiar",
        "philosopher",
        "well",
        "psychologist",
        "tend",
        "agree",
        "abduction",
        "frequently",
        "employed",
        "everyday",
        "reasoning",
        "sometimes",
        "reliance",
        "abductive",
        "reasoning",
        "quite",
        "obvious",
        "explicit",
        "daily",
        "practice",
        "may",
        "routine",
        "automatic",
        "easily",
        "go",
        "unnoticed",
        "case",
        "point",
        "may",
        "trust",
        "people",
        "testimony",
        "said",
        "rest",
        "abductive",
        "reasoning",
        "see",
        "harman",
        "adler",
        "fricker",
        "lipton",
        "defense",
        "claim",
        "instance",
        "according",
        "jonathan",
        "adler",
        "f",
        "best",
        "explanation",
        "informant",
        "asserts",
        "p",
        "normally",
        "belief",
        "duly",
        "responsible",
        "reason",
        "intends",
        "shall",
        "believe",
        "normally",
        "justified",
        "trusting",
        "informant",
        "testimony",
        "may",
        "well",
        "correct",
        "even",
        "though",
        "coming",
        "trust",
        "person",
        "testimony",
        "one",
        "normally",
        "seem",
        "aware",
        "abductive",
        "reasoning",
        "going",
        "one",
        "mind",
        "similar",
        "remark",
        "may",
        "apply",
        "hold",
        "possibly",
        "even",
        "fundamental",
        "role",
        "abduction",
        "linguistic",
        "practice",
        "wit",
        "role",
        "determining",
        "speaker",
        "mean",
        "utterance",
        "specifically",
        "argued",
        "decoding",
        "utterance",
        "matter",
        "inferring",
        "best",
        "explanation",
        "someone",
        "said",
        "said",
        "context",
        "utterance",
        "made",
        "even",
        "specifically",
        "author",
        "working",
        "field",
        "pragmatic",
        "suggested",
        "hearer",
        "invoke",
        "gricean",
        "maxim",
        "conversation",
        "help",
        "work",
        "best",
        "explanation",
        "speaker",
        "utterance",
        "whenever",
        "semantic",
        "content",
        "utterance",
        "insufficiently",
        "informative",
        "purpose",
        "conversation",
        "informative",
        "offtopic",
        "implausible",
        "otherwise",
        "odd",
        "inappropriate",
        "see",
        "instance",
        "bach",
        "harnish",
        "f",
        "dascal",
        "hobbs",
        "case",
        "reliance",
        "speaker",
        "testimony",
        "requisite",
        "abductive",
        "reasoning",
        "would",
        "normally",
        "seem",
        "take",
        "place",
        "subconscious",
        "level",
        "abductive",
        "reasoning",
        "limited",
        "everyday",
        "context",
        "quite",
        "contrary",
        "philosopher",
        "science",
        "argued",
        "abduction",
        "cornerstone",
        "scientific",
        "methodology",
        "see",
        "instance",
        "boyd",
        "harré",
        "lipton",
        "psillos",
        "according",
        "timothy",
        "williamson",
        "abductive",
        "methodology",
        "best",
        "science",
        "provides",
        "ernan",
        "mcmullin",
        "even",
        "go",
        "far",
        "call",
        "abduction",
        "inference",
        "make",
        "science",
        "illustrate",
        "use",
        "abduction",
        "science",
        "consider",
        "two",
        "example",
        "beginning",
        "nineteenth",
        "century",
        "discovered",
        "orbit",
        "uranus",
        "one",
        "seven",
        "planet",
        "known",
        "time",
        "departed",
        "orbit",
        "predicted",
        "basis",
        "isaac",
        "newton",
        "theory",
        "universal",
        "gravitation",
        "auxiliary",
        "assumption",
        "planet",
        "solar",
        "system",
        "one",
        "possible",
        "explanation",
        "course",
        "newton",
        "theory",
        "false",
        "given",
        "great",
        "empirical",
        "success",
        "two",
        "century",
        "appear",
        "good",
        "explanation",
        "two",
        "astronomer",
        "john",
        "couch",
        "adam",
        "urbain",
        "leverrier",
        "instead",
        "suggested",
        "independently",
        "almost",
        "simultaneously",
        "eighth",
        "yet",
        "undiscovered",
        "planet",
        "solar",
        "system",
        "thought",
        "provided",
        "best",
        "explanation",
        "uranus",
        "deviating",
        "orbit",
        "much",
        "later",
        "planet",
        "known",
        "neptune",
        "discovered",
        "second",
        "example",
        "concern",
        "commonly",
        "regarded",
        "discovery",
        "electron",
        "english",
        "physicist",
        "joseph",
        "john",
        "thomson",
        "thomson",
        "conducted",
        "experiment",
        "cathode",
        "ray",
        "order",
        "determine",
        "whether",
        "stream",
        "charged",
        "particle",
        "concluded",
        "indeed",
        "reasoning",
        "follows",
        "cathode",
        "ray",
        "carry",
        "charge",
        "negative",
        "electricity",
        "deflected",
        "electrostatic",
        "force",
        "negatively",
        "electrified",
        "acted",
        "magnetic",
        "force",
        "way",
        "force",
        "would",
        "act",
        "negatively",
        "electrified",
        "body",
        "moving",
        "along",
        "path",
        "ray",
        "see",
        "escape",
        "conclusion",
        "charge",
        "negative",
        "electricity",
        "carried",
        "particle",
        "matter",
        "thomson",
        "cited",
        "achinstein",
        "conclusion",
        "cathode",
        "ray",
        "consist",
        "negatively",
        "charged",
        "particle",
        "follow",
        "logically",
        "reported",
        "experimental",
        "result",
        "could",
        "thomson",
        "draw",
        "relevant",
        "statistical",
        "data",
        "nevertheless",
        "could",
        "see",
        "escape",
        "conclusion",
        "may",
        "safely",
        "assume",
        "conclusion",
        "bestin",
        "case",
        "presumably",
        "even",
        "plausibleexplanation",
        "result",
        "could",
        "think",
        "many",
        "example",
        "scientific",
        "us",
        "abduction",
        "discussed",
        "literature",
        "see",
        "instance",
        "harré",
        "lipton",
        "abduction",
        "also",
        "said",
        "predominant",
        "mode",
        "reasoning",
        "medical",
        "diagnosis",
        "physician",
        "tend",
        "go",
        "hypothesis",
        "best",
        "explains",
        "patient",
        "symptom",
        "see",
        "josephson",
        "josephson",
        "ed",
        "see",
        "also",
        "dragulinescu",
        "abductive",
        "reasoning",
        "context",
        "medicine",
        "last",
        "least",
        "abduction",
        "play",
        "central",
        "role",
        "important",
        "philosophical",
        "debate",
        "see",
        "shalkowski",
        "place",
        "abduction",
        "metaphysics",
        "also",
        "bigelow",
        "krzyżanowska",
        "wenmackers",
        "douven",
        "douven",
        "a",
        "possible",
        "role",
        "abduction",
        "semantics",
        "conditionals",
        "williamson",
        "application",
        "abduction",
        "philosophy",
        "logic",
        "arguably",
        "however",
        "abduction",
        "play",
        "notable",
        "philosophical",
        "role",
        "epistemology",
        "philosophy",
        "science",
        "frequently",
        "invoked",
        "objection",
        "socalled",
        "underdetermination",
        "argument",
        "underdetermination",
        "argument",
        "generally",
        "start",
        "premise",
        "number",
        "given",
        "hypothesis",
        "empirically",
        "equivalent",
        "author",
        "take",
        "mean",
        "evidenceindeed",
        "evidence",
        "might",
        "ever",
        "come",
        "possessis",
        "unable",
        "favor",
        "one",
        "others",
        "supposed",
        "conclude",
        "one",
        "never",
        "warranted",
        "believing",
        "particular",
        "one",
        "hypothesis",
        "rough",
        "present",
        "purpose",
        "see",
        "douven",
        "stanford",
        "detailed",
        "account",
        "underdetermination",
        "argument",
        "famous",
        "instance",
        "type",
        "argument",
        "cartesian",
        "argument",
        "global",
        "skepticism",
        "according",
        "hypothesis",
        "reality",
        "le",
        "way",
        "customarily",
        "deem",
        "empirically",
        "equivalent",
        "variety",
        "socalled",
        "skeptical",
        "hypothesis",
        "beguiled",
        "evil",
        "demon",
        "brain",
        "vat",
        "connected",
        "supercomputer",
        "see",
        "eg",
        "folina",
        "similar",
        "argument",
        "given",
        "support",
        "scientific",
        "antirealism",
        "according",
        "never",
        "warranted",
        "u",
        "choose",
        "empirically",
        "equivalent",
        "rival",
        "concerning",
        "underlies",
        "observable",
        "part",
        "reality",
        "van",
        "fraassen",
        "response",
        "argument",
        "typically",
        "point",
        "fact",
        "notion",
        "empirical",
        "equivalence",
        "play",
        "unduly",
        "neglect",
        "explanatory",
        "consideration",
        "instance",
        "defining",
        "notion",
        "strictly",
        "term",
        "hypothesis",
        "making",
        "prediction",
        "responding",
        "argue",
        "even",
        "hypothesis",
        "make",
        "exactly",
        "prediction",
        "one",
        "may",
        "still",
        "better",
        "explanation",
        "phenomenon",
        "predicted",
        "thus",
        "explanatory",
        "consideration",
        "role",
        "determining",
        "inference",
        "licensed",
        "makeas",
        "according",
        "defender",
        "abduction",
        "havethen",
        "might",
        "still",
        "warranted",
        "believing",
        "truth",
        "probable",
        "truth",
        "dependingas",
        "seen",
        "belowon",
        "version",
        "abduction",
        "one",
        "assumes",
        "one",
        "number",
        "hypothesis",
        "make",
        "prediction",
        "following",
        "bertrand",
        "russell",
        "ch",
        "many",
        "epistemologist",
        "invoked",
        "abduction",
        "arguing",
        "cartesian",
        "skepticism",
        "key",
        "claim",
        "even",
        "though",
        "construction",
        "skeptical",
        "hypothesis",
        "make",
        "prediction",
        "hypothesis",
        "reality",
        "le",
        "way",
        "ordinarily",
        "take",
        "equally",
        "good",
        "explanation",
        "predict",
        "particular",
        "skeptical",
        "hypothesis",
        "said",
        "considerably",
        "le",
        "simple",
        "ordinary",
        "world",
        "hypothesis",
        "see",
        "among",
        "many",
        "others",
        "harman",
        "chs",
        "goldman",
        "moser",
        "vogel",
        "see",
        "pargetter",
        "abductive",
        "response",
        "specifically",
        "skepticism",
        "regarding",
        "mind",
        "similarly",
        "philosopher",
        "science",
        "argued",
        "warranted",
        "believe",
        "special",
        "relativity",
        "theory",
        "opposed",
        "lorentz",
        "version",
        "æther",
        "theory",
        "even",
        "though",
        "theory",
        "make",
        "prediction",
        "former",
        "explanatorily",
        "superior",
        "latter",
        "argument",
        "given",
        "claim",
        "come",
        "contention",
        "special",
        "relativity",
        "theory",
        "ontologically",
        "parsimonious",
        "competitor",
        "postulate",
        "existence",
        "æther",
        "see",
        "janssen",
        "excellent",
        "discussion",
        "various",
        "reason",
        "philosopher",
        "science",
        "adduced",
        "preferring",
        "einstein",
        "theory",
        "lorentz"
    ]
}