{
    "main_text": "The Five Eternal Principles\n2. The Five Eternal Principles\n\nSome reports suggest that al-Rāzī saw his five principles as\nhaving a systematic structure: God and Soul are active and alive,\nmatter passive and non-living, and time and place neither active, nor\npassive, nor alive. But the scheme does not seem to be motivated by\nits ability to satisfy all logical possibilities. Rather,\nal-Rāzī argues specifically for each of the five principles.\nGod’s existence is demonstrated on the basis of the good design\nof the universe; more contentious are the other four.\n\nWhile the Soul is invoked as the source of life in bodies, its primary\nfunction in al-Rāzī’s philosophy is to facilitate a\ndistinctive theodicy. The presence of great suffering in the world,\nalongside the aforementioned good design of that world, shows that it\ncannot have been created directly by God. Furthermore,\nal-Rāzī is concerned with a traditional argument against the\neternity of the universe, namely that a perfectly wise and rational\nGod could not arbitrarily choose a moment for the universe to begin\nexisting. Both problems are solved by postulating a Soul which is\n“foolish” where God is wise. The Soul conceives of a\ndesire or even passion (ʿishq) to be “mixed”\nwith matter, which initiates the process of the world’s\ncreation. God intervenes to make the world as good as it can be, but\nour bodily life is still inevitably full of pain.\n\nOne question that arises here is why God would not prevent the Soul\nfrom mixing with matter, if this is such a bad idea.\nAl-Rāzī’s explanation is that God allows it to happen\nas a learning experience for the Soul (Goodman 1975). God bestows upon\nthe Soul the gift of reason or intellect (ʿaql), and\nSoul can use this to realize that it should be working to free itself\nfrom its unwise bond with matter (Druart 1996). We have reports of\nparables used by al-Rāzī to explain this. A wise father\nmight allow his inexperienced child to venture to a dangerous country,\nbut send with him a good advisor (namely the intellect; Fakhr\nal-Dīn al-Rāzī, FDR: vol. 4, 416). Similarly, a wise\nfather might allow his foolish child to go into an alluring garden\nfull of thorns and stinging insects, so as to teach the child a lesson\n(Abū Ḥātim al-Rāzī, AHR: 18–19). This\ntheodicy points the way towards a conception of our ultimate end,\nnamely to escape from the material world, achieving\n“liberation” through moderate lifestyle and the practice\nof philosophy.\n\nAs for matter, time, and place, these principles are required in order\nthat the universe may be created at all (for an overview see Fakhry\n1968). First, al-Rāzī thinks that there must already be some\nmaterial before the cosmos exists, out of which it is constructed. As\nNāṣir-e Khosraw (NK: 75) complains, al-Rāzī\nbelieved that creation ex nihilo was impossible. He argued\nfor this on the grounds that we constantly see things being produced\nthrough lengthy processes of development, even though instantaneous\nmanifestation would be far easier and involve less suffering: he gives\nthe example of the need for childbirth and growth to maturity. His\npoint is that God would not cause this to happen, if He could just\nmake humans exist from nothing. Time and place are needed for an\nanalogous reason. Time cannot be created, since creation must occur\nat a time, and place cannot be created, because there would\nalready need to be somewhere to put it.\n\nAl-Rāzī’s conception of matter is unusual among\nfalāsifa, that is, thinkers of the Islamic world who\nrespond primarily to the Greek philosophical tradition. More or less\nall of them, from al-Kindī (d. after 870) to\nal-Fārābī (d. 950), Ibn Sīnā (Avicenna, d.\n1037), and Ibn Rushd (Averroes, d. 1198), endorse a broadly\nAristotelian understanding of bodies as potentially subject to\nindefinite division. By contrast, al-Rāzī is an atomist\n(Pines 1936 [1997], Baffioni 1982, Langermann 2009). He believes that\nthe four elements (or possibly five: our sources are not clear as to\nwhether he thinks the heavens are constituted from a distinct fifth\nelement) differ in their properties because of variations in the ratio\nof atoms to void. Thus earth, which has little or no void in it, is\ndark, cold, dense, and moves downward; fire is luminous, hot, subtle,\nand moves upward. Actually these are not strictly\n“elements” but only the most basic compounds of atoms,\nwhich are truly fundamental. Though contemporary Islamic theologians\nwere also atomists (Dhanani 1994), al-Rāzī’s theory\ndiffers from theirs in some respects, and we know that he debated the\ntopic of matter with a theologian named\nal-Miṣmaʿī.\n\nAl-Rāzī referred to atoms as “absolute\n(muṭlaq) matter”, a locution echoed in his\ncharacterizations of the last two principles, namely “absolute\ntime” and “absolute place”. These are also known,\nrespectively, as “eternity (dahr)” or\n“duration (mudda)” and “void\n(khalāʾ)”. As we learn from the report of the\ndebate with Abū Ḥātim, al-Rāzī was concerned\nto stress the independence of time and place from bodies, that is,\nfrom composites of atoms (Abū Ḥātim al-Rāzī,\nAHR: 12). Time in itself is simply eternal duration, with events\n(including the creation of the world) and motions happening within\nthat duration. Similarly, place in itself is an infinite void, into\nwhich the bounded physical cosmos is placed. As already explained,\nvoid also exists (at least at the microscopic level) within the\ncosmos, since its admixture into bodies explains the variation between\nthe elements.\n\nAl-Rāzī’s theories may be usefully contrasted to those\nof Aristotle; we know he was familiar with Aristotle’s\nPhysics because he tells us as much in his Philosophical\nWay of Life. For Aristotle, time and place are dependent or\nsupervenient phenomena: place is the inner boundary of the body that\ncontains the body that is in place, while time is the number of\nmotion. Al-Rāzī by contrast makes space-time independent.\nFor instance he proposed a thought experiment that, if the universe\nwere taken away, its place would remain (a similar idea is proposed by\nPhiloponus in Phys. 574, translated in Philoponus\n CPV:\n 36). However his attitude towards Aristotelian physics is more\nnuanced than straightforward rejection (Adamson 2021: ch.5). For he\naccepts that one may speak of “relative” time and place,\nwhich would be the time and place of a particular motion and\nparticular body, respectively. For example a year would be a\ndemarcated segment of eternal duration that measures the sun’s\nmotion along the ecliptic, while the place of a ball would be the\nlimit of the region of void occupied by the ball. Likewise,\nal-Rāzī includes the Aristotelian elements, earth, water,\nair, fire, and perhaps ether, in his cosmology but does not accept\nthat these are fundamental. As just seen, the real\n“element” that underlies them is atomic.\n\nThus Aristotle managed to articulate genuine principles of physics,\nbut only “relative” ones that need to be understood within\na more basic framework. It was Plato who, in al-Rāzī’s\nopinion, had gotten closest to putting forward that framework.\nAbū Ḥātim says that al-Rāzī told him as\nmuch: “what Plato says is hardly different from what I believe\nconcerning time, and this, according to me, is the best thing that has\nbeen said about it” (Abū Ḥātim\nal-Rāzī, AHR: 13). The text he must have in mind is\nPlato’s Timaeus, which he would have known through the\nintermediary of Galen (see Galen,\n CTP\n for the Arabic translation of his paraphrase of the dialogue). The\nTimaeus likewise postulates a pre-existing matter that is\nformed into the cosmos; it can also be read as suggesting that time\nand place in some sense pre-exist the cosmos. Furthermore, Plato puts\nforward an atomic theory in the Timaeus. In fact,\nal-Rāzī rises to the defense of that theory in Doubts\nabout Galen (al-Rāzī, DG: §15.1-6). So there is\ngood reason to believe that al-Rāzī was modeling his\ncosmology primarily on Plato’s, as he understood it, albeit with\nadjustments.\n\nOn the other hand, Naṣīr-e Khosraw tells us that\nal-Rāzī plagiarized this whole theory from his teacher,\nĪrānshahrī. He is an obscure figure whose works are\nlost, though al-Bīrūnī (d. ca. 1050) does speak of him\nas an expert in astronomy and the diversity of religions. Another\nwitness, Abū l-Maʿālī (fl. 1092), has\nĪrānshahrī claiming to have been a prophet who had\nreceived revelation from an angel, like the Prophet Muhammad did. He\nreports that for Īrānshahrī, all religions put forth a\nsingle teaching, an idea which might be thought to resonate with\nal-Rāzī’s own irenic, rationalist approach to\nrevelation. If Naṣīr-e Khosraw is right to trace the Razian\ncosmology to this shadowy teacher, then perhaps we should think of\nal-Rāzī’s project as a creative fusion of\nĪrānshahri’s ideas and Plato’s.\n",
    "section_title": "2. The Five Eternal Principles",
    "entry_title": "Abu Bakr al-Razi",
    "hierarchy_title": "Abu Bakr al-Razi || The Five Eternal Principles",
    "tokenized_text": [
        "five",
        "eternal",
        "principle",
        "five",
        "eternal",
        "principle",
        "report",
        "suggest",
        "alrāzī",
        "saw",
        "five",
        "principle",
        "systematic",
        "structure",
        "god",
        "soul",
        "active",
        "alive",
        "matter",
        "passive",
        "nonliving",
        "time",
        "place",
        "neither",
        "active",
        "passive",
        "alive",
        "scheme",
        "seem",
        "motivated",
        "ability",
        "satisfy",
        "logical",
        "possibility",
        "rather",
        "alrāzī",
        "argues",
        "specifically",
        "five",
        "principle",
        "god",
        "existence",
        "demonstrated",
        "basis",
        "good",
        "design",
        "universe",
        "contentious",
        "four",
        "soul",
        "invoked",
        "source",
        "life",
        "body",
        "primary",
        "function",
        "alrāzī",
        "philosophy",
        "facilitate",
        "distinctive",
        "theodicy",
        "presence",
        "great",
        "suffering",
        "world",
        "alongside",
        "aforementioned",
        "good",
        "design",
        "world",
        "show",
        "created",
        "directly",
        "god",
        "furthermore",
        "alrāzī",
        "concerned",
        "traditional",
        "argument",
        "eternity",
        "universe",
        "namely",
        "perfectly",
        "wise",
        "rational",
        "god",
        "could",
        "arbitrarily",
        "choose",
        "moment",
        "universe",
        "begin",
        "existing",
        "problem",
        "solved",
        "postulating",
        "soul",
        "foolish",
        "god",
        "wise",
        "soul",
        "conceives",
        "desire",
        "even",
        "passion",
        "ʿishq",
        "mixed",
        "matter",
        "initiate",
        "process",
        "world",
        "creation",
        "god",
        "intervenes",
        "make",
        "world",
        "good",
        "bodily",
        "life",
        "still",
        "inevitably",
        "full",
        "pain",
        "one",
        "question",
        "arises",
        "god",
        "would",
        "prevent",
        "soul",
        "mixing",
        "matter",
        "bad",
        "idea",
        "alrāzī",
        "explanation",
        "god",
        "allows",
        "happen",
        "learning",
        "experience",
        "soul",
        "goodman",
        "god",
        "bestows",
        "upon",
        "soul",
        "gift",
        "reason",
        "intellect",
        "ʿaql",
        "soul",
        "use",
        "realize",
        "working",
        "free",
        "unwise",
        "bond",
        "matter",
        "druart",
        "report",
        "parable",
        "used",
        "alrāzī",
        "explain",
        "wise",
        "father",
        "might",
        "allow",
        "inexperienced",
        "child",
        "venture",
        "dangerous",
        "country",
        "send",
        "good",
        "advisor",
        "namely",
        "intellect",
        "fakhr",
        "aldīn",
        "alrāzī",
        "fdr",
        "vol",
        "similarly",
        "wise",
        "father",
        "might",
        "allow",
        "foolish",
        "child",
        "go",
        "alluring",
        "garden",
        "full",
        "thorn",
        "stinging",
        "insect",
        "teach",
        "child",
        "lesson",
        "abū",
        "ḥātim",
        "alrāzī",
        "ahr",
        "theodicy",
        "point",
        "way",
        "towards",
        "conception",
        "ultimate",
        "end",
        "namely",
        "escape",
        "material",
        "world",
        "achieving",
        "liberation",
        "moderate",
        "lifestyle",
        "practice",
        "philosophy",
        "matter",
        "time",
        "place",
        "principle",
        "required",
        "order",
        "universe",
        "may",
        "created",
        "overview",
        "see",
        "fakhry",
        "first",
        "alrāzī",
        "think",
        "must",
        "already",
        "material",
        "cosmos",
        "exists",
        "constructed",
        "nāṣire",
        "khosraw",
        "nk",
        "complains",
        "alrāzī",
        "believed",
        "creation",
        "ex",
        "nihilo",
        "impossible",
        "argued",
        "ground",
        "constantly",
        "see",
        "thing",
        "produced",
        "lengthy",
        "process",
        "development",
        "even",
        "though",
        "instantaneous",
        "manifestation",
        "would",
        "far",
        "easier",
        "involve",
        "le",
        "suffering",
        "give",
        "example",
        "need",
        "childbirth",
        "growth",
        "maturity",
        "point",
        "god",
        "would",
        "cause",
        "happen",
        "could",
        "make",
        "human",
        "exist",
        "nothing",
        "time",
        "place",
        "needed",
        "analogous",
        "reason",
        "time",
        "created",
        "since",
        "creation",
        "must",
        "occur",
        "time",
        "place",
        "created",
        "would",
        "already",
        "need",
        "somewhere",
        "put",
        "alrāzī",
        "conception",
        "matter",
        "unusual",
        "among",
        "falāsifa",
        "thinker",
        "islamic",
        "world",
        "respond",
        "primarily",
        "greek",
        "philosophical",
        "tradition",
        "le",
        "alkindī",
        "d",
        "alfārābī",
        "d",
        "ibn",
        "sīnā",
        "avicenna",
        "d",
        "ibn",
        "rushd",
        "averroes",
        "d",
        "endorse",
        "broadly",
        "aristotelian",
        "understanding",
        "body",
        "potentially",
        "subject",
        "indefinite",
        "division",
        "contrast",
        "alrāzī",
        "atomist",
        "pine",
        "baffioni",
        "langermann",
        "belief",
        "four",
        "element",
        "possibly",
        "five",
        "source",
        "clear",
        "whether",
        "think",
        "heaven",
        "constituted",
        "distinct",
        "fifth",
        "element",
        "differ",
        "property",
        "variation",
        "ratio",
        "atom",
        "void",
        "thus",
        "earth",
        "little",
        "void",
        "dark",
        "cold",
        "dense",
        "move",
        "downward",
        "fire",
        "luminous",
        "hot",
        "subtle",
        "move",
        "upward",
        "actually",
        "strictly",
        "element",
        "basic",
        "compound",
        "atom",
        "truly",
        "fundamental",
        "though",
        "contemporary",
        "islamic",
        "theologian",
        "also",
        "atomists",
        "dhanani",
        "alrāzī",
        "theory",
        "differs",
        "respect",
        "know",
        "debated",
        "topic",
        "matter",
        "theologian",
        "named",
        "almiṣmaʿī",
        "alrāzī",
        "referred",
        "atom",
        "absolute",
        "muṭlaq",
        "matter",
        "locution",
        "echoed",
        "characterization",
        "last",
        "two",
        "principle",
        "namely",
        "absolute",
        "time",
        "absolute",
        "place",
        "also",
        "known",
        "respectively",
        "eternity",
        "dahr",
        "duration",
        "mudda",
        "void",
        "khalāʾ",
        "learn",
        "report",
        "debate",
        "abū",
        "ḥātim",
        "alrāzī",
        "concerned",
        "stress",
        "independence",
        "time",
        "place",
        "body",
        "composite",
        "atom",
        "abū",
        "ḥātim",
        "alrāzī",
        "ahr",
        "time",
        "simply",
        "eternal",
        "duration",
        "event",
        "including",
        "creation",
        "world",
        "motion",
        "happening",
        "within",
        "duration",
        "similarly",
        "place",
        "infinite",
        "void",
        "bounded",
        "physical",
        "cosmos",
        "placed",
        "already",
        "explained",
        "void",
        "also",
        "exists",
        "least",
        "microscopic",
        "level",
        "within",
        "cosmos",
        "since",
        "admixture",
        "body",
        "explains",
        "variation",
        "element",
        "alrāzī",
        "theory",
        "may",
        "usefully",
        "contrasted",
        "aristotle",
        "know",
        "familiar",
        "aristotle",
        "physic",
        "tell",
        "u",
        "much",
        "philosophical",
        "way",
        "life",
        "aristotle",
        "time",
        "place",
        "dependent",
        "supervenient",
        "phenomenon",
        "place",
        "inner",
        "boundary",
        "body",
        "contains",
        "body",
        "place",
        "time",
        "number",
        "motion",
        "alrāzī",
        "contrast",
        "make",
        "spacetime",
        "independent",
        "instance",
        "proposed",
        "thought",
        "experiment",
        "universe",
        "taken",
        "away",
        "place",
        "would",
        "remain",
        "similar",
        "idea",
        "proposed",
        "philoponus",
        "phys",
        "translated",
        "philoponus",
        "cpv",
        "however",
        "attitude",
        "towards",
        "aristotelian",
        "physic",
        "nuanced",
        "straightforward",
        "rejection",
        "adamson",
        "ch",
        "accepts",
        "one",
        "may",
        "speak",
        "relative",
        "time",
        "place",
        "would",
        "time",
        "place",
        "particular",
        "motion",
        "particular",
        "body",
        "respectively",
        "example",
        "year",
        "would",
        "demarcated",
        "segment",
        "eternal",
        "duration",
        "measure",
        "sun",
        "motion",
        "along",
        "ecliptic",
        "place",
        "ball",
        "would",
        "limit",
        "region",
        "void",
        "occupied",
        "ball",
        "likewise",
        "alrāzī",
        "includes",
        "aristotelian",
        "element",
        "earth",
        "water",
        "air",
        "fire",
        "perhaps",
        "ether",
        "cosmology",
        "accept",
        "fundamental",
        "seen",
        "real",
        "element",
        "underlies",
        "atomic",
        "thus",
        "aristotle",
        "managed",
        "articulate",
        "genuine",
        "principle",
        "physic",
        "relative",
        "one",
        "need",
        "understood",
        "within",
        "basic",
        "framework",
        "plato",
        "alrāzī",
        "opinion",
        "gotten",
        "closest",
        "putting",
        "forward",
        "framework",
        "abū",
        "ḥātim",
        "say",
        "alrāzī",
        "told",
        "much",
        "plato",
        "say",
        "hardly",
        "different",
        "believe",
        "concerning",
        "time",
        "according",
        "best",
        "thing",
        "said",
        "abū",
        "ḥātim",
        "alrāzī",
        "ahr",
        "text",
        "must",
        "mind",
        "plato",
        "timaeus",
        "would",
        "known",
        "intermediary",
        "galen",
        "see",
        "galen",
        "ctp",
        "arabic",
        "translation",
        "paraphrase",
        "dialogue",
        "timaeus",
        "likewise",
        "postulate",
        "preexisting",
        "matter",
        "formed",
        "cosmos",
        "also",
        "read",
        "suggesting",
        "time",
        "place",
        "sense",
        "preexist",
        "cosmos",
        "furthermore",
        "plato",
        "put",
        "forward",
        "atomic",
        "theory",
        "timaeus",
        "fact",
        "alrāzī",
        "rise",
        "defense",
        "theory",
        "doubt",
        "galen",
        "alrāzī",
        "dg",
        "good",
        "reason",
        "believe",
        "alrāzī",
        "modeling",
        "cosmology",
        "primarily",
        "plato",
        "understood",
        "albeit",
        "adjustment",
        "hand",
        "naṣīre",
        "khosraw",
        "tell",
        "u",
        "alrāzī",
        "plagiarized",
        "whole",
        "theory",
        "teacher",
        "īrānshahrī",
        "obscure",
        "figure",
        "whose",
        "work",
        "lost",
        "though",
        "albīrūnī",
        "d",
        "ca",
        "speak",
        "expert",
        "astronomy",
        "diversity",
        "religion",
        "another",
        "witness",
        "abū",
        "lmaʿālī",
        "fl",
        "īrānshahrī",
        "claiming",
        "prophet",
        "received",
        "revelation",
        "angel",
        "like",
        "prophet",
        "muhammad",
        "report",
        "īrānshahrī",
        "religion",
        "put",
        "forth",
        "single",
        "teaching",
        "idea",
        "might",
        "thought",
        "resonate",
        "alrāzī",
        "irenic",
        "rationalist",
        "approach",
        "revelation",
        "naṣīre",
        "khosraw",
        "right",
        "trace",
        "razian",
        "cosmology",
        "shadowy",
        "teacher",
        "perhaps",
        "think",
        "alrāzī",
        "project",
        "creative",
        "fusion",
        "īrānshahri",
        "idea",
        "plato"
    ]
}