{
    "main_text": "Schiller’s Response to Kant’s Aesthetics: Grace, Dignity, and Aesthetic Education || Aesthetic Education and the Achievement of Morality\n8.2 Aesthetic Education and the Achievement of Morality\n\nIn Schiller’s other main philosophical work, the\nletters On the Aesthetic Education of Mankind, he certainly makes a much bolder claim than Kant would ever have countenanced,\nnamely that “it is only through Beauty that man makes his way\nto Freedom” and thus to the achievement of morality and its\nexternal realization in political justice (Aesthetic\nEducation, Second letter, p. 9). Here Schiller implies that the\ncultivation of taste through aesthetic education is a necessary as\nwell as sufficient condition for the achievement of compliance with\nthe ethical and political demands of morality, rather than, as Kant\nheld, merely something that may contribute to moral development. But\nwhen we turn from Schiller’s rhetoric to the details of his argument,\nwe will see that he actually grants aesthetic education a narrower\nrôle in the realization of morality than Kant does.\n\n\nSchiller presents the problem to be solved by aesthetic education in\nseveral ways, but primarily as a political rather than a moral\nproblem. In his Sixth Letter, he offers an influential diagnosis of\nalienation or fragmentation as the characteristic problem of\nmodernity: “we see not merely individuals, but whole classes of\npeople, developing but one part of their potentialities, while of the\nrest, as in stunted growths, only vestigial traces remain.”\n(Aesthetic Education, p. 33). Although this is a problem for\nhuman flourishing generally, and might therefore be considered a moral\nrather than specifically political problem, Schiller’s diagnosis of\nthe source of this problem gives a prominent role to a specifically\npolitical cause. Schiller claims that the complex machinery of the\nstate necessitates the separation of ranks and occupations, rather\nthan claiming, as a Marxist diagnosis of alienation would, that a\nseparation of ranks and occupations that has its source in the\nconditions of production necessitates the complex machinery of the\nstate. In another famous passage, Schiller presents the problem as\nthat of effecting the transition from a less just to a more just state\nwithout killing the patient in the operation:\nThe state should not only respect the objective\nand generic character in its individual subjects; it should also honor\ntheir subjective and specific character, and in extending the\ninvisible realm of morals take care not to depopulate the sensible\nrealm of appearance. (Aesthetic Education, Fourth Letter, p.\n19)\n\n\nThe latter passage leads more directly to\nSchiller’s most general characterization of the problem: striking the\nright balance between the universal and the particular, that is, not\nrealizing the ideal at the cost of individuals nor so focusing on\nindividuals as they currently are that all concern for the ideal is\nlost. Schiller characterizes the tension with which he is concerned through\na number of contrasts: person and condition, the atemporal and the\ntemporal, noumenon and phenomena, form and matter, and so on\n(Eleventh Letter). He posits that we are driven in one direction by\nthe “form drive” and in the other by the “sensuous\ndrive” (Twelfth Letter). He then claims that we need to\ncultivate a new drive, the “play drive” (Fourteenth\nLetter), to bring these two drives, and thus person and condition,\nuniversal and particular, and so on, into proper balance with each\nother, “to preserve the life of sense against the encroachments\nof freedom; and second, to secure the personality against the forces\nof sensation” (Thirteenth Letter).  Schiller’s claim is then\nthat it is the experience of beauty which will induce this balance in\nus, and thus what we need is to be educated to experience beauty. In\npractice, since individuals tend to err in one direction or the\nother, that is, to be driven by principles at the cost of ignoring\nparticulars or to be absorbed in particulars and thus inadequately\nattentive to principles, there will be two types of beauty,\n“energizing” beauty and “relaxing” or\n“melting” beauty, which will either strengthen an\nindividual’s commitment to principle or relax the grip of principle\non an individual, whichever is needed (Seventeenth Letter).\n\n\nThese claims are grandiose and abstract. In a crucial footnote to the\nThirteenth Letter, however, Schiller comes down to earth, and reveals\nthat what he expects from aesthetic education is something quite\nspecific, although for that reason all the more plausible.  What he\nworried about is “the pernicious effect, upon both thought and\naction, of an undue surrender to our sensual nature” on the one\nhand and “the nefarious influence exerted upon our knowledge and\nupon our conduct by a preponderance of rationality” on the\nother. In the realm of scientific inquiry, what we need to learn and\nwhat we can learn from aesthetic experience is not to “thrust\nourselves out upon [nature], with all the impatient anticipations of\nour reason,” without having collected adequate data to support\nour theorizing. In the realm of conduct, thus of the moral generally\nand not just the realm of politics, what we need to learn is to be\nspecifically attentive to the particular circumstances, needs, and\nfeelings of others, and not just to impose our own views upon them.  Schiller’s argument comes down\nto the claim that through the cultivation of our aesthetic sensibility\nwe can learn to be attentive to detail and particularity as well as to\nprinciple and generality, and that being so attentive is a necessary\ncondition for both theoretical and practical success. And it seems\nplausible to suppose that this claim is true, and therefore that\naesthetic education may play a valuable rôle in the theoretical and\npractical development of human beings, in modern society as much as in\nany other. But this is a far cry from any claim that aesthetic\neducation is sufficient for either theoretical or moral\ndevelopment, or even that it is necessary for such\ndevelopment, as the only way to cultivate the necessary\ncombination of sensitivities. In the case of the natural sciences,\nsurely both their general principles and their particular techniques\nof observation must be taught directly, and presumably a well-managed\nscientific education could also teach the student not to project the\nprinciples unchecked by the data. In the case of morals and politics,\nsurely the general principles must be clearly fixed in the mind of\nthose being initiated into the relevant community, as well as a proper\nempathy for the actual circumstances of others; but while perhaps the\nlatter could be cultivated by aesthetic education, presumably it could\nalso be cultivated directly by suitably edifying moral discourses, and\ncertainly the general principles of morality will still have to be\ndirectly taught or elicited.\n\n\nAs we saw in section 7.2, Kant recognizes these limits on the\nsignificance of the cultivation of taste for moral development, but\nalso described a wider variety of ways in which the former could be\nbeneficial for the latter. The contribution to moral development that\nSchiller hopes to derive from aesthetic education is\nessentially cognitive: through the sensitivity to\nparticularity that we acquire from aesthetic education we learn\nto recognize the circumstances, needs, and feelings of others\nand thereby to apply our principles to them appropriately. Kant,\nhowever, holds that aesthetic experience could give us sensible\nconfirmation of the moral truths we already know through pure reason,\nbut it also give us emotional support in our attempt to act as we know\nwe should, although in no case does he argue that the support that\nmorality can get from aesthetic experience is indispensable. Thus,\nalthough Schiller’s essay “On Grace and Dignity” appears\nto argue for a greater rôle for feelings in fulfillment of the demands\nof morality than Kant allows, it is only Kant who insists\nupon moral grounds for striving to realize grace and not just\ndignity. And while Schiller’s letters On Aesthetic Education\ninsist that aesthetic education is a necessary condition for social\njustice, Kant has a broader conception of the contributions\nthat aesthetic experience may make to moral and political development,\nalthough he certainly does not make the cultivation of taste a\nnecessary (let alone sufficient) condition for the realization of\nmorality.\n",
    "section_title": "8.2 Aesthetic Education and the Achievement of Morality",
    "entry_title": "18th Century German Aesthetics",
    "hierarchy_title": "18th Century German Aesthetics || Schiller’s Response to Kant’s Aesthetics: Grace, Dignity, and Aesthetic Education || Aesthetic Education and the Achievement of Morality",
    "tokenized_text": [
        "schiller",
        "response",
        "kant",
        "aesthetic",
        "grace",
        "dignity",
        "aesthetic",
        "education",
        "aesthetic",
        "education",
        "achievement",
        "morality",
        "aesthetic",
        "education",
        "achievement",
        "morality",
        "schiller",
        "main",
        "philosophical",
        "work",
        "letter",
        "aesthetic",
        "education",
        "mankind",
        "certainly",
        "make",
        "much",
        "bolder",
        "claim",
        "kant",
        "would",
        "ever",
        "countenanced",
        "namely",
        "beauty",
        "man",
        "make",
        "way",
        "freedom",
        "thus",
        "achievement",
        "morality",
        "external",
        "realization",
        "political",
        "justice",
        "aesthetic",
        "education",
        "second",
        "letter",
        "p",
        "schiller",
        "implies",
        "cultivation",
        "taste",
        "aesthetic",
        "education",
        "necessary",
        "well",
        "sufficient",
        "condition",
        "achievement",
        "compliance",
        "ethical",
        "political",
        "demand",
        "morality",
        "rather",
        "kant",
        "held",
        "merely",
        "something",
        "may",
        "contribute",
        "moral",
        "development",
        "turn",
        "schiller",
        "rhetoric",
        "detail",
        "argument",
        "see",
        "actually",
        "grant",
        "aesthetic",
        "education",
        "narrower",
        "rôle",
        "realization",
        "morality",
        "kant",
        "schiller",
        "present",
        "problem",
        "solved",
        "aesthetic",
        "education",
        "several",
        "way",
        "primarily",
        "political",
        "rather",
        "moral",
        "problem",
        "sixth",
        "letter",
        "offer",
        "influential",
        "diagnosis",
        "alienation",
        "fragmentation",
        "characteristic",
        "problem",
        "modernity",
        "see",
        "merely",
        "individual",
        "whole",
        "class",
        "people",
        "developing",
        "one",
        "part",
        "potentiality",
        "rest",
        "stunted",
        "growth",
        "vestigial",
        "trace",
        "remain",
        "aesthetic",
        "education",
        "p",
        "although",
        "problem",
        "human",
        "flourishing",
        "generally",
        "might",
        "therefore",
        "considered",
        "moral",
        "rather",
        "specifically",
        "political",
        "problem",
        "schiller",
        "diagnosis",
        "source",
        "problem",
        "give",
        "prominent",
        "role",
        "specifically",
        "political",
        "cause",
        "schiller",
        "claim",
        "complex",
        "machinery",
        "state",
        "necessitates",
        "separation",
        "rank",
        "occupation",
        "rather",
        "claiming",
        "marxist",
        "diagnosis",
        "alienation",
        "would",
        "separation",
        "rank",
        "occupation",
        "source",
        "condition",
        "production",
        "necessitates",
        "complex",
        "machinery",
        "state",
        "another",
        "famous",
        "passage",
        "schiller",
        "present",
        "problem",
        "effecting",
        "transition",
        "le",
        "state",
        "without",
        "killing",
        "patient",
        "operation",
        "state",
        "respect",
        "objective",
        "generic",
        "character",
        "individual",
        "subject",
        "also",
        "honor",
        "subjective",
        "specific",
        "character",
        "extending",
        "invisible",
        "realm",
        "moral",
        "take",
        "care",
        "depopulate",
        "sensible",
        "realm",
        "appearance",
        "aesthetic",
        "education",
        "fourth",
        "letter",
        "p",
        "latter",
        "passage",
        "lead",
        "directly",
        "schiller",
        "general",
        "characterization",
        "problem",
        "striking",
        "right",
        "balance",
        "universal",
        "particular",
        "realizing",
        "ideal",
        "cost",
        "individual",
        "focusing",
        "individual",
        "currently",
        "concern",
        "ideal",
        "lost",
        "schiller",
        "characterizes",
        "tension",
        "concerned",
        "number",
        "contrast",
        "person",
        "condition",
        "atemporal",
        "temporal",
        "noumenon",
        "phenomenon",
        "form",
        "matter",
        "eleventh",
        "letter",
        "posit",
        "driven",
        "one",
        "direction",
        "form",
        "drive",
        "sensuous",
        "drive",
        "twelfth",
        "letter",
        "claim",
        "need",
        "cultivate",
        "new",
        "drive",
        "play",
        "drive",
        "fourteenth",
        "letter",
        "bring",
        "two",
        "drive",
        "thus",
        "person",
        "condition",
        "universal",
        "particular",
        "proper",
        "balance",
        "preserve",
        "life",
        "sense",
        "encroachment",
        "freedom",
        "second",
        "secure",
        "personality",
        "force",
        "sensation",
        "thirteenth",
        "letter",
        "schiller",
        "claim",
        "experience",
        "beauty",
        "induce",
        "balance",
        "u",
        "thus",
        "need",
        "educated",
        "experience",
        "beauty",
        "practice",
        "since",
        "individual",
        "tend",
        "err",
        "one",
        "direction",
        "driven",
        "principle",
        "cost",
        "ignoring",
        "particular",
        "absorbed",
        "particular",
        "thus",
        "inadequately",
        "attentive",
        "principle",
        "two",
        "type",
        "beauty",
        "energizing",
        "beauty",
        "relaxing",
        "melting",
        "beauty",
        "either",
        "strengthen",
        "individual",
        "commitment",
        "principle",
        "relax",
        "grip",
        "principle",
        "individual",
        "whichever",
        "needed",
        "seventeenth",
        "letter",
        "claim",
        "grandiose",
        "abstract",
        "crucial",
        "footnote",
        "thirteenth",
        "letter",
        "however",
        "schiller",
        "come",
        "earth",
        "reveals",
        "expects",
        "aesthetic",
        "education",
        "something",
        "quite",
        "specific",
        "although",
        "reason",
        "plausible",
        "worried",
        "pernicious",
        "effect",
        "upon",
        "thought",
        "action",
        "undue",
        "surrender",
        "sensual",
        "nature",
        "one",
        "hand",
        "nefarious",
        "influence",
        "exerted",
        "upon",
        "knowledge",
        "upon",
        "conduct",
        "preponderance",
        "rationality",
        "realm",
        "scientific",
        "inquiry",
        "need",
        "learn",
        "learn",
        "aesthetic",
        "experience",
        "thrust",
        "upon",
        "nature",
        "impatient",
        "anticipation",
        "reason",
        "without",
        "collected",
        "adequate",
        "data",
        "support",
        "theorizing",
        "realm",
        "conduct",
        "thus",
        "moral",
        "generally",
        "realm",
        "politics",
        "need",
        "learn",
        "specifically",
        "attentive",
        "particular",
        "circumstance",
        "need",
        "feeling",
        "others",
        "impose",
        "view",
        "upon",
        "schiller",
        "argument",
        "come",
        "claim",
        "cultivation",
        "aesthetic",
        "sensibility",
        "learn",
        "attentive",
        "detail",
        "particularity",
        "well",
        "principle",
        "generality",
        "attentive",
        "necessary",
        "condition",
        "theoretical",
        "practical",
        "success",
        "seems",
        "plausible",
        "suppose",
        "claim",
        "true",
        "therefore",
        "aesthetic",
        "education",
        "may",
        "play",
        "valuable",
        "rôle",
        "theoretical",
        "practical",
        "development",
        "human",
        "being",
        "modern",
        "society",
        "much",
        "far",
        "cry",
        "claim",
        "aesthetic",
        "education",
        "sufficient",
        "either",
        "theoretical",
        "moral",
        "development",
        "even",
        "necessary",
        "development",
        "way",
        "cultivate",
        "necessary",
        "combination",
        "sensitivity",
        "case",
        "natural",
        "science",
        "surely",
        "general",
        "principle",
        "particular",
        "technique",
        "observation",
        "must",
        "taught",
        "directly",
        "presumably",
        "wellmanaged",
        "scientific",
        "education",
        "could",
        "also",
        "teach",
        "student",
        "project",
        "principle",
        "unchecked",
        "data",
        "case",
        "moral",
        "politics",
        "surely",
        "general",
        "principle",
        "must",
        "clearly",
        "fixed",
        "mind",
        "initiated",
        "relevant",
        "community",
        "well",
        "proper",
        "empathy",
        "actual",
        "circumstance",
        "others",
        "perhaps",
        "latter",
        "could",
        "cultivated",
        "aesthetic",
        "education",
        "presumably",
        "could",
        "also",
        "cultivated",
        "directly",
        "suitably",
        "edifying",
        "moral",
        "discourse",
        "certainly",
        "general",
        "principle",
        "morality",
        "still",
        "directly",
        "taught",
        "elicited",
        "saw",
        "section",
        "kant",
        "recognizes",
        "limit",
        "significance",
        "cultivation",
        "taste",
        "moral",
        "development",
        "also",
        "described",
        "wider",
        "variety",
        "way",
        "former",
        "could",
        "beneficial",
        "latter",
        "contribution",
        "moral",
        "development",
        "schiller",
        "hope",
        "derive",
        "aesthetic",
        "education",
        "essentially",
        "cognitive",
        "sensitivity",
        "particularity",
        "acquire",
        "aesthetic",
        "education",
        "learn",
        "recognize",
        "circumstance",
        "need",
        "feeling",
        "others",
        "thereby",
        "apply",
        "principle",
        "appropriately",
        "kant",
        "however",
        "hold",
        "aesthetic",
        "experience",
        "could",
        "give",
        "u",
        "sensible",
        "confirmation",
        "moral",
        "truth",
        "already",
        "know",
        "pure",
        "reason",
        "also",
        "give",
        "u",
        "emotional",
        "support",
        "attempt",
        "act",
        "know",
        "although",
        "case",
        "argue",
        "support",
        "morality",
        "get",
        "aesthetic",
        "experience",
        "indispensable",
        "thus",
        "although",
        "schiller",
        "essay",
        "grace",
        "dignity",
        "appears",
        "argue",
        "greater",
        "rôle",
        "feeling",
        "fulfillment",
        "demand",
        "morality",
        "kant",
        "allows",
        "kant",
        "insists",
        "upon",
        "moral",
        "ground",
        "striving",
        "realize",
        "grace",
        "dignity",
        "schiller",
        "letter",
        "aesthetic",
        "education",
        "insist",
        "aesthetic",
        "education",
        "necessary",
        "condition",
        "social",
        "justice",
        "kant",
        "broader",
        "conception",
        "contribution",
        "aesthetic",
        "experience",
        "may",
        "make",
        "moral",
        "political",
        "development",
        "although",
        "certainly",
        "make",
        "cultivation",
        "taste",
        "necessary",
        "let",
        "alone",
        "sufficient",
        "condition",
        "realization",
        "morality"
    ]
}