{
    "main_text": "Salon Culture and Sensibility\n2. Salon Culture and Sensibility\n\nEarly in the Ancien Régime, in 1635, the government of Louis\nXIII, controlled by Cardinal de Richelieu, established the\nAcadémie Française, with the mission of standardizing\nthe French language. Before this institution came into being, there\nhad been literary circles, which later scholars called\nsalons, run by upper-class women and men for their select\nguests, that had fostered the production of new writings and held\ndebates about how to refine the French language. The Académie\nFrançaise brought some of this activity under national\nauthority, granted it royal patronage, and controlled the membership,\nlimiting it to exactly 40 men. Nevertheless, salons continued their\nwork for the next centuries; they continued to patronize emerging\ntalents and exerted a great influence on public reception of the\narts.\n\nSeventeenth-century salon culture developed concepts of taste that\nwere closely aligned with an aristocratic view of politeness and\nsensibility. Cassirer calls this approach “empiricist”\nand, indeed, these ideas were dependent on the senses and the stimuli\nthey received, more than on reason or on conventions of genre.\n\nAn early influential thinker was Dominique Bouhours, a Jesuit and\nfrequent guest at salons who wrote Entretiens d’Ariste et\nd’Eugène, a series of dialogues about good taste. In\nthis work, he deals with the arts, particularly eloquence, but also\nmanners. Bouhours is best known for coining the term je ne sais\nquoi or “I don’t know what”—a special,\nundefinable quality that transcends any rules. His interlocutors evoke\nthe possibility that a work of art could follow all the rules yet fail\nto please, if it lacks that special something. They compare the je\nne sais quoi in the arts to the ineffable in the contemplation of\nnature or in Catholic theology. In another part of his\nEntretiens, Bouhours denounces exaggeration or excessive\nornamentation in language: a common trope in works about rhetoric\nsince Antiquity. His interlocutors apply this idea to\nseventeenth-century Europe when they agree that, with its simplicity\nand modesty, the French language is superior to bombastic Spanish and\neffeminate Italian. These linguistic prejudices indicate to us that\nBouhours was trying to establish the status of France as the cultural\nheir to the Roman empire, in opposition to the two most dominant\ncultures in Europe in his era.\n\nIn Bouhours’ text, politeness and artistic taste are closely\ntied, since it takes a special sense of discernment to perceive\nliterary beauty as well as the right thing to say in a social setting.\nBoth supposedly emanate from the acute sensibility of a refined person\nwho is accustomed to being surrounded by beauty and good manners. The\nclass implications of his ideas about taste are clear to see: only\nthose members of an elite had the instinct for both exquisite\npoliteness and exquisite artistic taste. It denies the possibility\nthat just anyone could receive enough training to reach this level of\nrefinement, an idea that would be shared by later theorists that\nemerged from this salon culture.\n\nThe abbé Dubos, the marquise de Lambert, and Montesquieu, among\nothers, continued this line of thought in the early eighteenth\ncentury. They belonged to a group of acquaintances that frequented the\nsame social circles, including Lambert’s own salon. Because\ntheir reflections on taste were closely tied to their sense of worldly\npoliteness, they shared a disdain for professional critics and any\nsemblance of pedantry. They were less concerned with defining beauty\nand more intent on examining what happens in the mind and body of the\nviewer when she contemplates a pleasing object. Their emphasis on\npleasure and sentiment was sensualist, based on input from the senses;\nin Montesquieu’s case, sensualism becomes frankly\nhedonistic.\n\nJean-Baptiste Dubos, in his Critical Reflections on Poetry,\nPainting, and Music (1719), presents the faculty of taste as a\nsentiment that he calls a sixth sense, disregarding the role of reason\nor of morality, which his contemporary Jean-Pierre Crousaz had\nconsidered important aspects of taste. His work precedes Scottish\nphilosopher Francis Hutcheson’s aesthetic treatise of 1725, in\nwhich he also discusses a sixth sense that perceives beauty. According\nto Dubos, the reception of artistic works happens in the body: we\ntremble, cry, or feel a jolt of surprise when we see a play, for\nexample. He describes how the arts affect our emotions positively,\nwhile admitting that the effect of seeing death depicted in painting\nor theater, for example, is different than if we were to witness a\ndeath in real life. He also goes into great detail to describe how\nclimate affects nations and consequently how it fosters or impedes the\nproliferation of good artists in certain parts of the world. This type\nof thinking began as far back as Hippocrates’s reflections on\nthe effects of climate on national character and extends to Juan\nHuarte’s thoughts on the influence of body temperature on\neloquence and later to Montesquieu’s claims about the way\nclimate determines human behavior and consequently each nation’s\npolitical system. This climate theory is part of Dubos’s idea\nthat artistic perception happens in the body, both for the viewer and\nfor the creator. For him, art is ultimately a means of communication\nfrom body to body.\n\nOne misunderstanding that has arisen about Dubos is the assumption\nthat he democratizes taste, because in some passages of the\nReflections, he states that the “public” and\n“tout le monde” can be susceptible to the proper\nreception of artworks. However, in other passages he explains what he\nmeans by these terms: “tout le monde” does not\nmean “everyone”, as it is usually translated: he in fact\nuses “le monde” to mean high society, also called\n“le beau monde” in the eighteenth century. As for\nthe general public, he explicitly excludes “the lower class of\npeople” from “the public capable of passing judgment on\npoems or pictures” (Dubos, Critical Reflections,\nII:245).\n\nLike Dubos, the marquise de Lambert writes about good taste as a\nsentiment of pleasure, or agrément, in her\nReflections on Taste. A person’s correct judgment\ndepends on her degree of sensibility, and Lambert claims it cannot be\nlearned; instead,\n\n\nNature gives us what we have of it, we never can acquire it, and the\nmore refined Part of the World alone are acquainted with it in any\nDegree of Perfection. (Lambert 1748: 217 [1790: 183])\n\n\nShe disregards definitions of beauty that are based on rules, perhaps\nbecause these can be learned. In fact, she dismisses the concept of\nbeauty from her thoughts on taste and privileges the\n“agréable”, which can be translated as\n“agreeable” or “pleasant”:\n\n\nthough Beauty has Rules, Agreeableness has none. The [beautiful]\nwithout the Agreeable can never give us a delicate Pleasure; the\nAgreeable is the native Subject of Taste, and ’tis thence that\nit pleases us infinitely beyond the [beautiful]; and it is as\narbitrary and variable, even as the Taste itself. (Lambert 1748: 217\n[1790: 184])\n\n\nThe impossibility of establishing definitive parameters for taste is a\ncontinuation of Bouhours’ “je ne sais quoi”, which\nrelies on a sensitive person’s instinctive ability to recognize\nan appropriately pleasing object.\n\nThe marquise de Lambert’s views were echoed in the works of\nother writers of her circle, such as the abbé Trublet and\nCartaud de la Vilate (she also hosted both Anne Dacier and Houdar de\nla Motte). Cartaud de la Vilate places particular emphasis on\ndelicacy, which is\n\n\nan exquisite discernment that nature has placed in certain organs for\nsorting out the different virtues of the objects that pertain to\nsentiment. (Cartaud de la Vilate 1726: 235 [translation by J.\nTsien])\n\n\nThese ideas of inborn sensibility to pleasing artistic objects refute\nthe possibility that taste can be learned.\n\nMontesquieu also examines taste as a function of the viewer’s\nmind, through the filter of the same milieu of worldly refinement. The\nexamples to which he applies his aesthetic ideas are not exclusively\nartistic: he includes activities like flirting, gambling, and social\ndancing, alongside more conventional topics such as architecture, to\ndescribe how the mind perceives pleasure. He explains these ideas in\nhis Essay on Taste, which appears in Diderot and\nd’Alembert’s Encyclopédie under the entry\n“Goût” (1757), an entry which also includes\ntreatises on the same subject by Voltaire and d’Alembert. To\ndescribe what objects please our minds, Montesquieu lists six\nqualities: order, variety, symmetry, contrasts, the ability to provoke\ncuriosity, and the ability to provoke surprise. Each of these\nqualities in excess has a bad effect, he claims, such as a Gothic\ncathedral that offers too much variety and confuses us. On the other\nhand, too much order and symmetry, for example in a long colonnade or\nin a beautiful woman’s face, can bore the onlooker. Like\nLambert, Montesquieu states that he is more interested in pleasure\nthan beauty; as an example, he claims to prefer a woman with irregular\nfeatures who can surprise him to a perfectly beautiful woman. To the\nsix qualities of pleasing objects above, he adds three ways in which\nour minds experience these objects: sensibility, delicacy, and the\nje ne sais quoi. These terms remind us of his allegiance to\nthe Bouhours-Dubos-salon line of thought about taste as a quality\ninherent in certain refined, worldly people.\n",
    "section_title": "2. Salon Culture and Sensibility",
    "entry_title": "18th Century French Aesthetics",
    "hierarchy_title": "18th Century French Aesthetics || Salon Culture and Sensibility",
    "tokenized_text": [
        "salon",
        "culture",
        "sensibility",
        "salon",
        "culture",
        "sensibility",
        "early",
        "ancien",
        "régime",
        "government",
        "louis",
        "xiii",
        "controlled",
        "cardinal",
        "de",
        "richelieu",
        "established",
        "académie",
        "française",
        "mission",
        "standardizing",
        "french",
        "language",
        "institution",
        "came",
        "literary",
        "circle",
        "later",
        "scholar",
        "called",
        "salon",
        "run",
        "upperclass",
        "woman",
        "men",
        "select",
        "guest",
        "fostered",
        "production",
        "new",
        "writing",
        "held",
        "debate",
        "refine",
        "french",
        "language",
        "académie",
        "française",
        "brought",
        "activity",
        "national",
        "authority",
        "granted",
        "royal",
        "patronage",
        "controlled",
        "membership",
        "limiting",
        "exactly",
        "men",
        "nevertheless",
        "salon",
        "continued",
        "work",
        "next",
        "century",
        "continued",
        "patronize",
        "emerging",
        "talent",
        "exerted",
        "great",
        "influence",
        "public",
        "reception",
        "art",
        "seventeenthcentury",
        "salon",
        "culture",
        "developed",
        "concept",
        "taste",
        "closely",
        "aligned",
        "aristocratic",
        "view",
        "politeness",
        "sensibility",
        "cassirer",
        "call",
        "approach",
        "empiricist",
        "indeed",
        "idea",
        "dependent",
        "sens",
        "stimulus",
        "received",
        "reason",
        "convention",
        "genre",
        "early",
        "influential",
        "thinker",
        "dominique",
        "bouhours",
        "jesuit",
        "frequent",
        "guest",
        "salon",
        "wrote",
        "entretiens",
        "ariste",
        "et",
        "eugène",
        "series",
        "dialogue",
        "good",
        "taste",
        "work",
        "deal",
        "art",
        "particularly",
        "eloquence",
        "also",
        "manner",
        "bouhours",
        "best",
        "known",
        "coining",
        "term",
        "je",
        "ne",
        "sais",
        "quoi",
        "know",
        "a",
        "special",
        "undefinable",
        "quality",
        "transcends",
        "rule",
        "interlocutor",
        "evoke",
        "possibility",
        "work",
        "art",
        "could",
        "follow",
        "rule",
        "yet",
        "fail",
        "please",
        "lack",
        "special",
        "something",
        "compare",
        "je",
        "ne",
        "sais",
        "quoi",
        "art",
        "ineffable",
        "contemplation",
        "nature",
        "catholic",
        "theology",
        "another",
        "part",
        "entretiens",
        "bouhours",
        "denounces",
        "exaggeration",
        "excessive",
        "ornamentation",
        "language",
        "common",
        "trope",
        "work",
        "rhetoric",
        "since",
        "antiquity",
        "interlocutor",
        "apply",
        "idea",
        "seventeenthcentury",
        "europe",
        "agree",
        "simplicity",
        "modesty",
        "french",
        "language",
        "superior",
        "bombastic",
        "spanish",
        "effeminate",
        "italian",
        "linguistic",
        "prejudice",
        "indicate",
        "u",
        "bouhours",
        "trying",
        "establish",
        "status",
        "france",
        "cultural",
        "heir",
        "roman",
        "empire",
        "opposition",
        "two",
        "dominant",
        "culture",
        "europe",
        "era",
        "bouhours",
        "text",
        "politeness",
        "artistic",
        "taste",
        "closely",
        "tied",
        "since",
        "take",
        "special",
        "sense",
        "discernment",
        "perceive",
        "literary",
        "beauty",
        "well",
        "right",
        "thing",
        "say",
        "social",
        "setting",
        "supposedly",
        "emanate",
        "acute",
        "sensibility",
        "refined",
        "person",
        "accustomed",
        "surrounded",
        "beauty",
        "good",
        "manner",
        "class",
        "implication",
        "idea",
        "taste",
        "clear",
        "see",
        "member",
        "elite",
        "instinct",
        "exquisite",
        "politeness",
        "exquisite",
        "artistic",
        "taste",
        "denies",
        "possibility",
        "anyone",
        "could",
        "receive",
        "enough",
        "training",
        "reach",
        "level",
        "refinement",
        "idea",
        "would",
        "shared",
        "later",
        "theorist",
        "emerged",
        "salon",
        "culture",
        "abbé",
        "dubos",
        "marquise",
        "de",
        "lambert",
        "montesquieu",
        "among",
        "others",
        "continued",
        "line",
        "thought",
        "early",
        "eighteenth",
        "century",
        "belonged",
        "group",
        "acquaintance",
        "frequented",
        "social",
        "circle",
        "including",
        "lambert",
        "salon",
        "reflection",
        "taste",
        "closely",
        "tied",
        "sense",
        "worldly",
        "politeness",
        "shared",
        "disdain",
        "professional",
        "critic",
        "semblance",
        "pedantry",
        "le",
        "concerned",
        "defining",
        "beauty",
        "intent",
        "examining",
        "happens",
        "mind",
        "body",
        "viewer",
        "contemplates",
        "pleasing",
        "object",
        "emphasis",
        "pleasure",
        "sentiment",
        "sensualist",
        "based",
        "input",
        "sens",
        "montesquieu",
        "case",
        "sensualism",
        "becomes",
        "frankly",
        "hedonistic",
        "jeanbaptiste",
        "dubos",
        "critical",
        "reflection",
        "poetry",
        "painting",
        "music",
        "present",
        "faculty",
        "taste",
        "sentiment",
        "call",
        "sixth",
        "sense",
        "disregarding",
        "role",
        "reason",
        "morality",
        "contemporary",
        "jeanpierre",
        "crousaz",
        "considered",
        "important",
        "aspect",
        "taste",
        "work",
        "precedes",
        "scottish",
        "philosopher",
        "francis",
        "hutcheson",
        "aesthetic",
        "treatise",
        "also",
        "discus",
        "sixth",
        "sense",
        "perceives",
        "beauty",
        "according",
        "dubos",
        "reception",
        "artistic",
        "work",
        "happens",
        "body",
        "tremble",
        "cry",
        "feel",
        "jolt",
        "surprise",
        "see",
        "play",
        "example",
        "describes",
        "art",
        "affect",
        "emotion",
        "positively",
        "admitting",
        "effect",
        "seeing",
        "death",
        "depicted",
        "painting",
        "theater",
        "example",
        "different",
        "witness",
        "death",
        "real",
        "life",
        "also",
        "go",
        "great",
        "detail",
        "describe",
        "climate",
        "affect",
        "nation",
        "consequently",
        "foster",
        "impedes",
        "proliferation",
        "good",
        "artist",
        "certain",
        "part",
        "world",
        "type",
        "thinking",
        "began",
        "far",
        "back",
        "hippocrates",
        "reflection",
        "effect",
        "climate",
        "national",
        "character",
        "extends",
        "juan",
        "huarte",
        "thought",
        "influence",
        "body",
        "temperature",
        "eloquence",
        "later",
        "montesquieu",
        "claim",
        "way",
        "climate",
        "determines",
        "human",
        "behavior",
        "consequently",
        "nation",
        "political",
        "system",
        "climate",
        "theory",
        "part",
        "dubos",
        "idea",
        "artistic",
        "perception",
        "happens",
        "body",
        "viewer",
        "creator",
        "art",
        "ultimately",
        "mean",
        "communication",
        "body",
        "body",
        "one",
        "misunderstanding",
        "arisen",
        "dubos",
        "assumption",
        "democratizes",
        "taste",
        "passage",
        "reflection",
        "state",
        "public",
        "tout",
        "le",
        "monde",
        "susceptible",
        "proper",
        "reception",
        "artwork",
        "however",
        "passage",
        "explains",
        "mean",
        "term",
        "tout",
        "le",
        "monde",
        "mean",
        "everyone",
        "usually",
        "translated",
        "fact",
        "us",
        "le",
        "monde",
        "mean",
        "high",
        "society",
        "also",
        "called",
        "le",
        "beau",
        "monde",
        "eighteenth",
        "century",
        "general",
        "public",
        "explicitly",
        "excludes",
        "lower",
        "class",
        "people",
        "public",
        "capable",
        "passing",
        "judgment",
        "poem",
        "picture",
        "dubos",
        "critical",
        "reflection",
        "ii",
        "like",
        "dubos",
        "marquise",
        "de",
        "lambert",
        "writes",
        "good",
        "taste",
        "sentiment",
        "pleasure",
        "agrément",
        "reflection",
        "taste",
        "person",
        "correct",
        "judgment",
        "depends",
        "degree",
        "sensibility",
        "lambert",
        "claim",
        "learned",
        "instead",
        "nature",
        "give",
        "u",
        "never",
        "acquire",
        "refined",
        "part",
        "world",
        "alone",
        "acquainted",
        "degree",
        "perfection",
        "lambert",
        "disregard",
        "definition",
        "beauty",
        "based",
        "rule",
        "perhaps",
        "learned",
        "fact",
        "dismisses",
        "concept",
        "beauty",
        "thought",
        "taste",
        "privilege",
        "agréable",
        "translated",
        "agreeable",
        "pleasant",
        "though",
        "beauty",
        "rule",
        "agreeableness",
        "none",
        "beautiful",
        "without",
        "agreeable",
        "never",
        "give",
        "u",
        "delicate",
        "pleasure",
        "agreeable",
        "native",
        "subject",
        "taste",
        "ti",
        "thence",
        "plea",
        "u",
        "infinitely",
        "beyond",
        "beautiful",
        "arbitrary",
        "variable",
        "even",
        "taste",
        "lambert",
        "impossibility",
        "establishing",
        "definitive",
        "parameter",
        "taste",
        "continuation",
        "bouhours",
        "je",
        "ne",
        "sais",
        "quoi",
        "relies",
        "sensitive",
        "person",
        "instinctive",
        "ability",
        "recognize",
        "appropriately",
        "pleasing",
        "object",
        "marquise",
        "de",
        "lambert",
        "view",
        "echoed",
        "work",
        "writer",
        "circle",
        "abbé",
        "trublet",
        "cartaud",
        "de",
        "la",
        "vilate",
        "also",
        "hosted",
        "anne",
        "dacier",
        "houdar",
        "de",
        "la",
        "motte",
        "cartaud",
        "de",
        "la",
        "vilate",
        "place",
        "particular",
        "emphasis",
        "delicacy",
        "exquisite",
        "discernment",
        "nature",
        "placed",
        "certain",
        "organ",
        "sorting",
        "different",
        "virtue",
        "object",
        "pertain",
        "sentiment",
        "cartaud",
        "de",
        "la",
        "vilate",
        "translation",
        "j",
        "tsien",
        "idea",
        "inborn",
        "sensibility",
        "pleasing",
        "artistic",
        "object",
        "refute",
        "possibility",
        "taste",
        "learned",
        "montesquieu",
        "also",
        "examines",
        "taste",
        "function",
        "viewer",
        "mind",
        "filter",
        "milieu",
        "worldly",
        "refinement",
        "example",
        "applies",
        "aesthetic",
        "idea",
        "exclusively",
        "artistic",
        "includes",
        "activity",
        "like",
        "flirting",
        "gambling",
        "social",
        "dancing",
        "alongside",
        "conventional",
        "topic",
        "architecture",
        "describe",
        "mind",
        "perceives",
        "pleasure",
        "explains",
        "idea",
        "essay",
        "taste",
        "appears",
        "diderot",
        "alembert",
        "encyclopédie",
        "entry",
        "goût",
        "entry",
        "also",
        "includes",
        "treatise",
        "subject",
        "voltaire",
        "alembert",
        "describe",
        "object",
        "please",
        "mind",
        "montesquieu",
        "list",
        "six",
        "quality",
        "order",
        "variety",
        "symmetry",
        "contrast",
        "ability",
        "provoke",
        "curiosity",
        "ability",
        "provoke",
        "surprise",
        "quality",
        "excess",
        "bad",
        "effect",
        "claim",
        "gothic",
        "cathedral",
        "offer",
        "much",
        "variety",
        "confuses",
        "u",
        "hand",
        "much",
        "order",
        "symmetry",
        "example",
        "long",
        "colonnade",
        "beautiful",
        "woman",
        "face",
        "bore",
        "onlooker",
        "like",
        "lambert",
        "montesquieu",
        "state",
        "interested",
        "pleasure",
        "beauty",
        "example",
        "claim",
        "prefer",
        "woman",
        "irregular",
        "feature",
        "surprise",
        "perfectly",
        "beautiful",
        "woman",
        "six",
        "quality",
        "pleasing",
        "object",
        "add",
        "three",
        "way",
        "mind",
        "experience",
        "object",
        "sensibility",
        "delicacy",
        "je",
        "ne",
        "sais",
        "quoi",
        "term",
        "remind",
        "u",
        "allegiance",
        "bouhoursdubossalon",
        "line",
        "thought",
        "taste",
        "quality",
        "inherent",
        "certain",
        "refined",
        "worldly",
        "people"
    ]
}