{
    "main_text": "Aesthetics and Evolution\n9. Aesthetics and Evolution\n\nTheories of human evolution over the last two million years are\nseverely limited by the very incomplete fossil record and the fact\nthat soft tissue disappears quickly. Given these constraints it is\nsurprising the extent to which cognitive theorising has reached into\nthe very distant past, though its claims are agreed on all hands to be\nhighly provisional. A vital resource has been the study of stone\nartefacts going back two million years or more, artefacts which\npreserve very well and which are available in great quantities. We are\nable to reconstruct a good deal about the methods of their\nconstruction and to speculate in a reasonably informed way on the\ncognitive capacities they require. Based on these speculations\ninnovations in stone tool manufacture have been linked to the\ndevelopment of language (Higuchi et. al. 2009).\n\nAny topic on which aesthetic and evolutionary methods converge is\nlikely to be approached with two questions in mind.\n\nIs the emergence and development of art-making and related\nactivities explainable wholly or very largely in cultural terms, or is\nthere a substantial biological component?\nIs art-making an adaptation or a non-adaptive consequence of\ndevelopments which may themselves have adaptive advantages (or\nsomething else)?\n\n\nIt might be thought that the second question arises only if one\nanswers the first in a way that gives an important explanatory role to\nbiology. But culturally determined “phenotypes” can also\nbe adaptive, maladaptive or neutral. Cooking, certainly a cultural\ninnovation, is highly adaptive and has led to significant change in\ngut size and perhaps in brain size as well (Godfrey-Smith 2013; for\nscepticism concerning the relation to brain size see Cornélio\net al. 2016). Human biological and cultural evolution are closely\nconnected.\n\nOn the question whether there is a role for biological explanation\nwhen it comes to human aesthetic activity, there is a constituency of\nscholars hostile to this idea; they argue that “art” and\n“aesthetic” are notions of recent and essentially western\ninvention, the application of which to other and older cultures is\nmistaken (Gell 1998: 97). Opponents of this view readily grant the\nhuge cultural variability of aesthetic activity. They argue that there\nare enough commonalities between the ways very different cultures\ninvest in the shaping and decoration of objects, in music, dance and\nin story-telling to make it plausible that biology provides both the\ninitial impetus to and a set of constraints on these activities\n(Dutton 2009; Currie 2012). If we thought, as we once did, that these\nactivities could be traced no further back than the cave depictions of\nthe European Upper Paleolithic it would be likely that the aesthetic\nis too late-emerging to have a biological basis. Very recent\ndiscoveries have now suggested a somewhat earlier origin; depictions\nin Indonesia have been given dates prior to 45,000 years ago (Brumm et\nal. 2021). More dramatically, though, the temporal depth of aesthetic\nactivity is vastly increased if we turn our attention to the stone\ntools mentioned above, many of which show a notable symmetry of\nconstruction. Hand axes from the Acheulean industry which arose about\n1.7 million years ago are sometimes too large, small or sharply\npointed to be practical implements and strongly suggest an interest in\nthe display of skilful making that we commonly recognise in, say, the\nart of the European renaissance (see Currie & Zhu 2021 and Gowlett\n2021, both of which in different ways emphasise the importance of\nseeing aesthetic practices emerging in a social context). Some have\nseen these elaborated instruments as products of sexual selection, as\npeacock’s tails are said to be: reliable indicators of the\nmaker’s qualities as a mate (Kohn & Mithen 1999). Another\nview has it that they were indicators of trustworthiness, and hence of\none’s value as a co-operator (Spikins 2012); for criticism of\nboth views see Hiscock 2014.\n\nHand axes are unlike a peacock’s tail in being detached from the\nbody and so may be passed from one person to another—one reason\nto doubt their reliability as signals of any particular agent’s\nsuitability as a mate. Where symmetry of the body itself is at issue\nthat objection does not apply, and bodily and especially facial\nsymmetry has been offered as an example of something evolution has\ntuned our sensibilities to because it is an indicator of health in a\nreproductive partner. However, robust evidence has been hard to find.\nOne recent study did “not support the idea that facial symmetry\nacts as a reliable cue to physiological health” (Pound et al.\n2014; see also Kalick et al. 1998), another that there is\n“little evidence that female appearance predicted health”\n(Foo et al. 2017; this study did support a connection between male\nfacial appearance and fertility). For ethical arguments, supported by\nempirical findings, that we should rethink our standard approach to\nthe aesthetics of human appearances, see Irvin 2017.\n\nIt should be noted that even a very early dating of the emergence of\naesthetic interests does not establish that they have a biological\norigin; the Acheulean period seems to have been marked by high levels\nof planning and organisation that suggest strong social relations\n(Hiscock 2014). In this sense aesthetic activity may be a culturally\nderived “technology”, as writing is, rather than an\nadaptation, as language may be (S. Davies 2012: ch. 10). Could we\naccount, on that hypothesis, for the seeming ease with which young\nchildren take to forms of aesthetic activity such as drawing and\nsinging? By contrast, learning to write is effortful and requires\ngreat investment in pedagogy. Recent work (Heyes 2021) seeks to\nreshape our assumptions about what is learned, arguing that such an\nearly and reliably developing ability as interpersonal understanding\nis really a socially acquired “gadget” (Heyes & Frith\n2014). To add to a complex menu of options we also note that what\nbegins as a gadget or technology might, under certain circumstances\nfall under complete or partial genetic control. This so-called\n“Baldwin effect”, once despised in evolutionary thinking,\nhas attracted interest more recently (Weber & Depew 2003). It\nproposes a mechanism by which acquired characteristics can become\nbiologically heritable, without giving any ground to the Lamarkian\nidea that changes that accrue in an organism’s lifetime can be\npassed directly to the next generation. For example, if advantages\nflow from learning a skill, there may be selective pressure to ease\nthe burden and uncertainty of learning by making the skill, or some of\nits components, innate (Papineau 2005). Given the multiply crossing\npaths between cultural and biological evolution there is little\ndefinite to be said about the origins of aesthetic interests other\nthan that we see evidence for it in human populations more than half a\nmillion years ago.\n\nWe turn now to our second question: Is art-making an adaptation or a\nnon-adaptive consequence of developments which may themselves have\nadaptive advantages? Or something else entirely? Strong and contrary\nviews have been expressed on this question; some have argued that the\ndevelopment of depiction, story-telling and music have been crucial\nfor social bonding (Dissanayake 1992, 2000, 2017) or mate-choice\n(Miller 2000; Dutton 2009; for criticism see, e.g., C. Wilson 2016),\nothers say that the creation of aesthetic artefacts offers no adaptive\nadvantage but that they gained their hold on us because they provide\nrewards to sensory and other mechanisms in the mind that arose for\nquite other purposes (Pinker 1997). From a somewhat different\nperspective it is suggested that we do best by seeing human aesthetic\nactivity as simply the continuation of ubiquitous practices of\nsignalling and manipulation in the world of plants and animals. An\ninteresting feature of this idea is that it replaces the traditional\ndistinction between the aesthetics of artefacts and the aesthetics of\nnature with a distinction between, on the one hand artefacts\nand natural entities such as animal calls and flower\ncolouring, and on the other natural objects such as rocks, sunsets and\nthe night sky which “do not coevolve with sensory evaluations of\nthem” (Prum 2013: 821; see also De Tiège, Verpooten,\n& Braeckman 2021). It is not clear whether we currently know\nenough to decide between the available alternatives (S. Davies 2012:\nch. 12; for the case of fiction, Currie 2020; §7.4). But would\ndeciding whether art-making is adaptive advance the cause of aesthetic\ninquiry? That is doubtful. The question whether art is an adaptation\nconcerns whether the reason we have art now is that it contributed to\nthe fitness of our species. That could be true without it also being\ntrue that art now enriches our lives in any of the ways commonly\nclaimed—giving pleasure, educating our emotions, instructing us\nabout morality. And it is possible that art does now have all those\nadvantages while having been an evolutionary irrelevance. It is also\ntrue that even if art was not originally adaptive, it might have\nbecome adaptive (an “exaptation”) at some stage and might\nbe adaptive now. Different answers may apply to different art forms.\nIt is said that the novel is a particularly appropriate means by which\nto exercise our capacities for empathy and mind reading (Nussbaum\n1990, 1995; Mar and Oatley 2008); perhaps these advantages did not\nappear until the eighteenth or nineteenth centuries. While questions\nabout art posed in evolutionary terms are certainly of scientific\ninterest, what matters to the aesthetician is more likely to be the\nvalues that art currently and historically exemplifies and the ways\nthose values are currently and historically responded to by us.\n",
    "section_title": "9. Aesthetics and Evolution",
    "entry_title": "Aesthetics and Cognitive Science",
    "hierarchy_title": "Aesthetics and Cognitive Science || Aesthetics and Evolution",
    "tokenized_text": [
        "aesthetic",
        "evolution",
        "aesthetic",
        "evolution",
        "theory",
        "human",
        "evolution",
        "last",
        "two",
        "million",
        "year",
        "severely",
        "limited",
        "incomplete",
        "fossil",
        "record",
        "fact",
        "soft",
        "tissue",
        "disappears",
        "quickly",
        "given",
        "constraint",
        "surprising",
        "extent",
        "cognitive",
        "theorising",
        "reached",
        "distant",
        "past",
        "though",
        "claim",
        "agreed",
        "hand",
        "highly",
        "provisional",
        "vital",
        "resource",
        "study",
        "stone",
        "artefact",
        "going",
        "back",
        "two",
        "million",
        "year",
        "artefact",
        "preserve",
        "well",
        "available",
        "great",
        "quantity",
        "able",
        "reconstruct",
        "good",
        "deal",
        "method",
        "construction",
        "speculate",
        "reasonably",
        "informed",
        "way",
        "cognitive",
        "capacity",
        "require",
        "based",
        "speculation",
        "innovation",
        "stone",
        "tool",
        "manufacture",
        "linked",
        "development",
        "language",
        "higuchi",
        "et",
        "al",
        "topic",
        "aesthetic",
        "evolutionary",
        "method",
        "converge",
        "likely",
        "approached",
        "two",
        "question",
        "mind",
        "emergence",
        "development",
        "artmaking",
        "related",
        "activity",
        "explainable",
        "wholly",
        "largely",
        "cultural",
        "term",
        "substantial",
        "biological",
        "component",
        "artmaking",
        "adaptation",
        "nonadaptive",
        "consequence",
        "development",
        "may",
        "adaptive",
        "advantage",
        "something",
        "else",
        "might",
        "thought",
        "second",
        "question",
        "arises",
        "one",
        "answer",
        "first",
        "way",
        "give",
        "important",
        "explanatory",
        "role",
        "biology",
        "culturally",
        "determined",
        "phenotype",
        "also",
        "adaptive",
        "maladaptive",
        "neutral",
        "cooking",
        "certainly",
        "cultural",
        "innovation",
        "highly",
        "adaptive",
        "led",
        "significant",
        "change",
        "gut",
        "size",
        "perhaps",
        "brain",
        "size",
        "well",
        "godfreysmith",
        "scepticism",
        "concerning",
        "relation",
        "brain",
        "size",
        "see",
        "cornélio",
        "et",
        "al",
        "human",
        "biological",
        "cultural",
        "evolution",
        "closely",
        "connected",
        "question",
        "whether",
        "role",
        "biological",
        "explanation",
        "come",
        "human",
        "aesthetic",
        "activity",
        "constituency",
        "scholar",
        "hostile",
        "idea",
        "argue",
        "art",
        "aesthetic",
        "notion",
        "recent",
        "essentially",
        "western",
        "invention",
        "application",
        "older",
        "culture",
        "mistaken",
        "gell",
        "opponent",
        "view",
        "readily",
        "grant",
        "huge",
        "cultural",
        "variability",
        "aesthetic",
        "activity",
        "argue",
        "enough",
        "commonality",
        "way",
        "different",
        "culture",
        "invest",
        "shaping",
        "decoration",
        "object",
        "music",
        "dance",
        "storytelling",
        "make",
        "plausible",
        "biology",
        "provides",
        "initial",
        "impetus",
        "set",
        "constraint",
        "activity",
        "dutton",
        "currie",
        "thought",
        "activity",
        "could",
        "traced",
        "back",
        "cave",
        "depiction",
        "european",
        "upper",
        "paleolithic",
        "would",
        "likely",
        "aesthetic",
        "lateemerging",
        "biological",
        "basis",
        "recent",
        "discovery",
        "suggested",
        "somewhat",
        "earlier",
        "origin",
        "depiction",
        "indonesia",
        "given",
        "date",
        "prior",
        "year",
        "ago",
        "brumm",
        "et",
        "al",
        "dramatically",
        "though",
        "temporal",
        "depth",
        "aesthetic",
        "activity",
        "vastly",
        "increased",
        "turn",
        "attention",
        "stone",
        "tool",
        "mentioned",
        "many",
        "show",
        "notable",
        "symmetry",
        "construction",
        "hand",
        "ax",
        "acheulean",
        "industry",
        "arose",
        "million",
        "year",
        "ago",
        "sometimes",
        "large",
        "small",
        "sharply",
        "pointed",
        "practical",
        "implement",
        "strongly",
        "suggest",
        "interest",
        "display",
        "skilful",
        "making",
        "commonly",
        "recognise",
        "say",
        "art",
        "european",
        "renaissance",
        "see",
        "currie",
        "zhu",
        "gowlett",
        "different",
        "way",
        "emphasise",
        "importance",
        "seeing",
        "aesthetic",
        "practice",
        "emerging",
        "social",
        "context",
        "seen",
        "elaborated",
        "instrument",
        "product",
        "sexual",
        "selection",
        "peacock",
        "tail",
        "said",
        "reliable",
        "indicator",
        "maker",
        "quality",
        "mate",
        "kohn",
        "mithen",
        "another",
        "view",
        "indicator",
        "trustworthiness",
        "hence",
        "one",
        "value",
        "cooperator",
        "spikins",
        "criticism",
        "view",
        "see",
        "hiscock",
        "hand",
        "ax",
        "unlike",
        "peacock",
        "tail",
        "detached",
        "body",
        "may",
        "passed",
        "one",
        "person",
        "anotherone",
        "reason",
        "doubt",
        "reliability",
        "signal",
        "particular",
        "agent",
        "suitability",
        "mate",
        "symmetry",
        "body",
        "issue",
        "objection",
        "apply",
        "bodily",
        "especially",
        "facial",
        "symmetry",
        "offered",
        "example",
        "something",
        "evolution",
        "tuned",
        "sensibility",
        "indicator",
        "health",
        "reproductive",
        "partner",
        "however",
        "robust",
        "evidence",
        "hard",
        "find",
        "one",
        "recent",
        "study",
        "support",
        "idea",
        "facial",
        "symmetry",
        "act",
        "reliable",
        "cue",
        "physiological",
        "health",
        "pound",
        "et",
        "al",
        "see",
        "also",
        "kalick",
        "et",
        "al",
        "another",
        "little",
        "evidence",
        "female",
        "appearance",
        "predicted",
        "health",
        "foo",
        "et",
        "al",
        "study",
        "support",
        "connection",
        "male",
        "facial",
        "appearance",
        "fertility",
        "ethical",
        "argument",
        "supported",
        "empirical",
        "finding",
        "rethink",
        "standard",
        "approach",
        "aesthetic",
        "human",
        "appearance",
        "see",
        "irvin",
        "noted",
        "even",
        "early",
        "dating",
        "emergence",
        "aesthetic",
        "interest",
        "establish",
        "biological",
        "origin",
        "acheulean",
        "period",
        "seems",
        "marked",
        "high",
        "level",
        "planning",
        "organisation",
        "suggest",
        "strong",
        "social",
        "relation",
        "hiscock",
        "sense",
        "aesthetic",
        "activity",
        "may",
        "culturally",
        "derived",
        "technology",
        "writing",
        "rather",
        "adaptation",
        "language",
        "may",
        "s",
        "davy",
        "ch",
        "could",
        "account",
        "hypothesis",
        "seeming",
        "ease",
        "young",
        "child",
        "take",
        "form",
        "aesthetic",
        "activity",
        "drawing",
        "singing",
        "contrast",
        "learning",
        "write",
        "effortful",
        "requires",
        "great",
        "investment",
        "pedagogy",
        "recent",
        "work",
        "heyes",
        "seek",
        "reshape",
        "assumption",
        "learned",
        "arguing",
        "early",
        "reliably",
        "developing",
        "ability",
        "interpersonal",
        "understanding",
        "really",
        "socially",
        "acquired",
        "gadget",
        "heyes",
        "frith",
        "add",
        "complex",
        "menu",
        "option",
        "also",
        "note",
        "begin",
        "gadget",
        "technology",
        "might",
        "certain",
        "circumstance",
        "fall",
        "complete",
        "partial",
        "genetic",
        "control",
        "socalled",
        "baldwin",
        "effect",
        "despised",
        "evolutionary",
        "thinking",
        "attracted",
        "interest",
        "recently",
        "weber",
        "depew",
        "proposes",
        "mechanism",
        "acquired",
        "characteristic",
        "become",
        "biologically",
        "heritable",
        "without",
        "giving",
        "ground",
        "lamarkian",
        "idea",
        "change",
        "accrue",
        "organism",
        "lifetime",
        "passed",
        "directly",
        "next",
        "generation",
        "example",
        "advantage",
        "flow",
        "learning",
        "skill",
        "may",
        "selective",
        "pressure",
        "ease",
        "burden",
        "uncertainty",
        "learning",
        "making",
        "skill",
        "component",
        "innate",
        "papineau",
        "given",
        "multiply",
        "crossing",
        "path",
        "cultural",
        "biological",
        "evolution",
        "little",
        "definite",
        "said",
        "origin",
        "aesthetic",
        "interest",
        "see",
        "evidence",
        "human",
        "population",
        "half",
        "million",
        "year",
        "ago",
        "turn",
        "second",
        "question",
        "artmaking",
        "adaptation",
        "nonadaptive",
        "consequence",
        "development",
        "may",
        "adaptive",
        "advantage",
        "something",
        "else",
        "entirely",
        "strong",
        "contrary",
        "view",
        "expressed",
        "question",
        "argued",
        "development",
        "depiction",
        "storytelling",
        "music",
        "crucial",
        "social",
        "bonding",
        "dissanayake",
        "matechoice",
        "miller",
        "dutton",
        "criticism",
        "see",
        "eg",
        "c",
        "wilson",
        "others",
        "say",
        "creation",
        "aesthetic",
        "artefact",
        "offer",
        "adaptive",
        "advantage",
        "gained",
        "hold",
        "u",
        "provide",
        "reward",
        "sensory",
        "mechanism",
        "mind",
        "arose",
        "quite",
        "purpose",
        "pinker",
        "somewhat",
        "different",
        "perspective",
        "suggested",
        "best",
        "seeing",
        "human",
        "aesthetic",
        "activity",
        "simply",
        "continuation",
        "ubiquitous",
        "practice",
        "signalling",
        "manipulation",
        "world",
        "plant",
        "animal",
        "interesting",
        "feature",
        "idea",
        "replaces",
        "traditional",
        "distinction",
        "aesthetic",
        "artefact",
        "aesthetic",
        "nature",
        "distinction",
        "one",
        "hand",
        "artefact",
        "natural",
        "entity",
        "animal",
        "call",
        "flower",
        "colouring",
        "natural",
        "object",
        "rock",
        "sunset",
        "night",
        "sky",
        "coevolve",
        "sensory",
        "evaluation",
        "prum",
        "see",
        "also",
        "de",
        "tiège",
        "verpooten",
        "braeckman",
        "clear",
        "whether",
        "currently",
        "know",
        "enough",
        "decide",
        "available",
        "alternative",
        "s",
        "davy",
        "ch",
        "case",
        "fiction",
        "currie",
        "would",
        "deciding",
        "whether",
        "artmaking",
        "adaptive",
        "advance",
        "cause",
        "aesthetic",
        "inquiry",
        "doubtful",
        "question",
        "whether",
        "art",
        "adaptation",
        "concern",
        "whether",
        "reason",
        "art",
        "contributed",
        "fitness",
        "specie",
        "could",
        "true",
        "without",
        "also",
        "true",
        "art",
        "enriches",
        "life",
        "way",
        "commonly",
        "claimedgiving",
        "pleasure",
        "educating",
        "emotion",
        "instructing",
        "u",
        "morality",
        "possible",
        "art",
        "advantage",
        "evolutionary",
        "irrelevance",
        "also",
        "true",
        "even",
        "art",
        "originally",
        "adaptive",
        "might",
        "become",
        "adaptive",
        "exaptation",
        "stage",
        "might",
        "adaptive",
        "different",
        "answer",
        "may",
        "apply",
        "different",
        "art",
        "form",
        "said",
        "novel",
        "particularly",
        "appropriate",
        "mean",
        "exercise",
        "capacity",
        "empathy",
        "mind",
        "reading",
        "nussbaum",
        "mar",
        "oatley",
        "perhaps",
        "advantage",
        "appear",
        "eighteenth",
        "nineteenth",
        "century",
        "question",
        "art",
        "posed",
        "evolutionary",
        "term",
        "certainly",
        "scientific",
        "interest",
        "matter",
        "aesthetician",
        "likely",
        "value",
        "art",
        "currently",
        "historically",
        "exemplifies",
        "way",
        "value",
        "currently",
        "historically",
        "responded",
        "u"
    ]
}