{
    "main_text": "Kant: Playing with Truth\n7. Kant: Playing with Truth\n\n\nImmanuel Kant’s only significant work in aesthetics, the Critique\nof the Power of Judgment, came late in his life, at the end of\nthe extraordinary decade in which he had published the Critique of\nPure Reason (1781, revised 1787), the Prolegomena to any\nfuture Metaphysics (1783), the Groundwork for the Metaphysics\nof Morals (1785), the Metaphysical Foundations of Natural\nScience (1786), the Critique of Practical Reason (1788),\nand a host of important essays on history, science, and theology as\nwell as philosophy. Although we take its existence for granted now,\nKant’s third Critique could only have struck its original\naudience as a surprising and puzzling work. It was surprising, because\nthe second critique had not announced a forthcoming third anymore than\nthe first had announced that there would be a second; and it was\npuzzling, because the book not only gives an extended treatment to one\ntopic, namely aesthetic experience and judgment, which Kant had\npreviously denied could be the subject of a science (Critique of\nPure Reason, A 21/B 35–6), but also links that topic with\nanother, namely the teleological judgment of both organisms within\nnature and of nature as a whole, to which Kant had never before linked\nit. Clearly there must have been some revolution in Kant’s conception\nof the tasks of philosophy as well in his assessment of the prospects\nof both aesthetics and teleology. This change in view both made it\nimperative for him and enabled him to write this book, linking two\nsubjects that were not only disparate but that had also previously\nbeen problematic for him, so soon after having completed his\nexhausting labors on the first two critiques.\n\n\nKant does not immediately reveal a profound motivation for the new\nbook in either the first draft of its Introduction, the so-called\n“first introduction” of 1789, or in the Preface or first\nsection of the published Introduction as well as several of its\nsubsequent sections. These are focused on the distinctions among the\nseveral faculties of the mind and the divisions of philosophy. As a\nresult, the introductions make it seem as if Kant has been moved\nprimarily by a pedantic desire for completeness to find a place in his\nsystem for two disciplines, aesthetics and teleology, that had been\ndiscussed by many of his German, British, and French predecessors, but\nthat had apparently not played a large role in his own thought\nheretofore. It seems that the main task of the third Critique\nwill be to introduce the conception of a new class of judgments or new\nuse of the power of judgment, “reflecting”\n(reflektierend) judgment, which will subsume the aesthetic\nand teleological judgment and demonstrate both their affinities with\nand differences from the theoretical judgments analyzed and grounded\nin the first Critique and the moral judgments treated in the\nsecond Critique. However, Kant was driven to connect\naesthetic and teleological judgment by a much more profound and\npowerful motivation than that of mere systematic housekeeping. This\ndeeper motivation is first revealed in the second section of the\npublished Introduction. Here Kant claims that there is a substantive\nand important problem that calls for a third critique, namely that\n\n\nAlthough there is an incalculable gulf fixed between the domain of the\nconcept of nature, as the sensible, and the domain of the concept of\nfreedom, as the supersensible, so that from the former to the latter\n(thus by means of the theoretical use of reason) no transition is\npossible, just as if there were so many different worlds, the first of\nwhich can have no influence on the second: yet the\nlatter should have an influence on the former, namely the\nconcept of freedom should make the end that is imposed by its laws\nreal in the sensible world, and nature must consequently also be able\nto be conceived in such a way that the lawfulness of its form is at\nleast in agreement with the possibility of the ends that are to be\nrealized in it in accordance with the laws of freedom. (CPJ,\nIntroduction, section II, 5:174–5; see also section IX,\n5:195–6)\n\n\n\nThe problem that has apparently not been solved by the earlier two\ncritiques is that of showing that our choice to act in accordance with\nthe moral law, as the fundamental principle of all laws of freedom, a\nchoice that can be free only if it is conceived of as taking place in\na “supersensible” or noumenal realm that is not governed\nby the deterministic laws of “sensible” or phenomenal\nnature, where every event is fully determined by chains of causality\nextending far back beyond any particular choice of any particular\nindividual, must nevertheless be efficacious within that phenomenal\nworld, able to transform the natural world into a “moral\nworld” where people really do act in accordance with the moral\nlaw and the ends that are imposed upon us by that law really can be\nrealized. And the reason for linking aesthetic and teleological\njudgment together in a third critique apparently must be that these\ntwo forms of human experience and judgment together somehow offer a\nsolution to this problem.\n\n\nBut what problem about the efficacy of the laws of freedom in the\nrealm of nature could remain to be solved after the first two\ncritiques? The Critique of Pure Reason had argued that\nalthough we can disprove the possibility of any breach in the\ndeterminism of the natural world and cannot have theoretical knowledge\nof the freedom of our will in the noumenal world, nevertheless we can\ncoherently conceive of the latter. And the Critique of Practical\nReason had argued that we can confidently infer the reality of\nour noumenal freedom to choose to do whatever morality requires of us\nfrom our immediate awareness of our obligation under the moral law\ncombined with the principle that if we ought to do something then we\nmust be able to do it (see Critique of Practical Reason,\n§6, 5:30, and Religion within the Boundaries of Mere\nReason, 6:62, 66–7). The second Critique had also\nargued that since morality imposes an end upon us, namely that of\nrealizing the highest good, the greatest happiness consistent with the\ngreatest virtue, we must believe this to be possible, and thus must\npostulate “a supreme cause of nature having a causality in\nkeeping with the moral disposition” (Critique of Practical\nReason, Dialectic, 5:125; translation from Gregor, p. 240). If\nKant has already established that on the basis of our awareness of our\nobligations under the moral law we can be confident that we have free\nwill and that all of the laws of nature are at least consistent with\nour realization of the ends commanded by the moral law, what more\nneeds to be done in order to throw a bridge between the theoretical\ncognition of nature and the laws of freedom?\n\n\nAs both the second critique and the preceding Groundwork for the\nMetaphysics of Morals make clear, Kant clearly recognizes that in\norder to act morally, we need to (i) understand the moral law and what\nit requires of us; (ii) believe that we are in fact free to choose to\ndo what it requires of us rather than to do what all our other\nmotives, which can be subsumed under the rubric of self-love, might\nsuggest to us; (iii) believe that the objectives that morality imposes\nupon us can actually be achieved, and (iv) have an adequate motivation\nfor our attempt to do what morality requires of us in lieu of the mere\ndesirability of particular goals it might happen to license or even\nimpose in particular circumstances. All of these together constitute\nthe conditions of the possibility of morality. Kant also thinks that\nat one level all these conditions are satisfied by pure practical\nreason itself: (i) the very form of pure practical reason gives us the\nmoral law; (ii) the first “fact” of pure practical reason,\nnamely our consciousness of our obligation under this law, implies the\nreality of our freedom to be moral by means of the principle that we\nmust be able to do what we know we ought to do; (iii) we can postulate\nby pure practical reason alone that the laws of nature are compatible\nwith the demands of morality because both laws ultimately have a\ncommon author; and finally (iv) pure respect for the moral law itself\ncan be a sufficient motivation for us to attempt to carry it out (and\nattempts to do so have “moral worth” only when that is our\nmotivation). But Kant also recognizes that we are sensuous as well as\nrational creatures, and need sensuous as well as rational presentation\nand confirmation of the conditions of the possibility of morality. The\ntask of the third Critique will then be to show how both\naesthetic and teleological experience and judgment provide sensuous\nconfirmation of what we do already know in an abstract way, but also\nneed to feel or make palpable to ourselves, namely the efficacy of our\nfree choice of the fundamental principle of morality in the natural\nworld and the realizability of the objectives which that choice\nimposes upon us, summed up in the concept of the highest\ngood. Specifically, Kant will argue that although in its purest form,\nthe free play of our understanding and imagination that constitutes\nthe experience of natural beauty does not presuppose any\njudgment of moral value, the very fact of the existence of natural\nbeauty appears to confirm that the world is hospitable to our goals,\nespecially our moral goals, while our experiences of natural sublimity\nand artistic beauty both involve the free play of our cognitive\npowers with morally significant ideas, and thus are\ndistinctively aesthetic yet morally significant.\n",
    "section_title": "7. Kant: Playing with Truth",
    "entry_title": "18th Century German Aesthetics",
    "hierarchy_title": "18th Century German Aesthetics || Kant: Playing with Truth",
    "tokenized_text": [
        "kant",
        "playing",
        "truth",
        "kant",
        "playing",
        "truth",
        "immanuel",
        "kant",
        "significant",
        "work",
        "aesthetic",
        "critique",
        "power",
        "judgment",
        "came",
        "late",
        "life",
        "end",
        "extraordinary",
        "decade",
        "published",
        "critique",
        "pure",
        "reason",
        "revised",
        "prolegomenon",
        "future",
        "metaphysics",
        "groundwork",
        "metaphysics",
        "moral",
        "metaphysical",
        "foundation",
        "natural",
        "science",
        "critique",
        "practical",
        "reason",
        "host",
        "important",
        "essay",
        "history",
        "science",
        "theology",
        "well",
        "philosophy",
        "although",
        "take",
        "existence",
        "granted",
        "kant",
        "third",
        "critique",
        "could",
        "struck",
        "original",
        "audience",
        "surprising",
        "puzzling",
        "work",
        "surprising",
        "second",
        "critique",
        "announced",
        "forthcoming",
        "third",
        "anymore",
        "first",
        "announced",
        "would",
        "second",
        "puzzling",
        "book",
        "give",
        "extended",
        "treatment",
        "one",
        "topic",
        "namely",
        "aesthetic",
        "experience",
        "judgment",
        "kant",
        "previously",
        "denied",
        "could",
        "subject",
        "science",
        "critique",
        "pure",
        "reason",
        "b",
        "also",
        "link",
        "topic",
        "another",
        "namely",
        "teleological",
        "judgment",
        "organism",
        "within",
        "nature",
        "nature",
        "whole",
        "kant",
        "never",
        "linked",
        "clearly",
        "must",
        "revolution",
        "kant",
        "conception",
        "task",
        "philosophy",
        "well",
        "assessment",
        "prospect",
        "aesthetic",
        "teleology",
        "change",
        "view",
        "made",
        "imperative",
        "enabled",
        "write",
        "book",
        "linking",
        "two",
        "subject",
        "disparate",
        "also",
        "previously",
        "problematic",
        "soon",
        "completed",
        "exhausting",
        "labor",
        "first",
        "two",
        "critique",
        "kant",
        "immediately",
        "reveal",
        "profound",
        "motivation",
        "new",
        "book",
        "either",
        "first",
        "draft",
        "introduction",
        "socalled",
        "first",
        "introduction",
        "preface",
        "first",
        "section",
        "published",
        "introduction",
        "well",
        "several",
        "subsequent",
        "section",
        "focused",
        "distinction",
        "among",
        "several",
        "faculty",
        "mind",
        "division",
        "philosophy",
        "result",
        "introduction",
        "make",
        "seem",
        "kant",
        "moved",
        "primarily",
        "pedantic",
        "desire",
        "completeness",
        "find",
        "place",
        "system",
        "two",
        "discipline",
        "aesthetic",
        "teleology",
        "discussed",
        "many",
        "german",
        "british",
        "french",
        "predecessor",
        "apparently",
        "played",
        "large",
        "role",
        "thought",
        "heretofore",
        "seems",
        "main",
        "task",
        "third",
        "critique",
        "introduce",
        "conception",
        "new",
        "class",
        "judgment",
        "new",
        "use",
        "power",
        "judgment",
        "reflecting",
        "reflektierend",
        "judgment",
        "subsume",
        "aesthetic",
        "teleological",
        "judgment",
        "demonstrate",
        "affinity",
        "difference",
        "theoretical",
        "judgment",
        "analyzed",
        "grounded",
        "first",
        "critique",
        "moral",
        "judgment",
        "treated",
        "second",
        "critique",
        "however",
        "kant",
        "driven",
        "connect",
        "aesthetic",
        "teleological",
        "judgment",
        "much",
        "profound",
        "powerful",
        "motivation",
        "mere",
        "systematic",
        "housekeeping",
        "deeper",
        "motivation",
        "first",
        "revealed",
        "second",
        "section",
        "published",
        "introduction",
        "kant",
        "claim",
        "substantive",
        "important",
        "problem",
        "call",
        "third",
        "critique",
        "namely",
        "although",
        "incalculable",
        "gulf",
        "fixed",
        "domain",
        "concept",
        "nature",
        "sensible",
        "domain",
        "concept",
        "freedom",
        "supersensible",
        "former",
        "latter",
        "thus",
        "mean",
        "theoretical",
        "use",
        "reason",
        "transition",
        "possible",
        "many",
        "different",
        "world",
        "first",
        "influence",
        "second",
        "yet",
        "latter",
        "influence",
        "former",
        "namely",
        "concept",
        "freedom",
        "make",
        "end",
        "imposed",
        "law",
        "real",
        "sensible",
        "world",
        "nature",
        "must",
        "consequently",
        "also",
        "able",
        "conceived",
        "way",
        "lawfulness",
        "form",
        "least",
        "agreement",
        "possibility",
        "end",
        "realized",
        "accordance",
        "law",
        "freedom",
        "cpj",
        "introduction",
        "section",
        "ii",
        "see",
        "also",
        "section",
        "ix",
        "problem",
        "apparently",
        "solved",
        "earlier",
        "two",
        "critique",
        "showing",
        "choice",
        "act",
        "accordance",
        "moral",
        "law",
        "fundamental",
        "principle",
        "law",
        "freedom",
        "choice",
        "free",
        "conceived",
        "taking",
        "place",
        "supersensible",
        "noumenal",
        "realm",
        "governed",
        "deterministic",
        "law",
        "sensible",
        "phenomenal",
        "nature",
        "every",
        "event",
        "fully",
        "determined",
        "chain",
        "causality",
        "extending",
        "far",
        "back",
        "beyond",
        "particular",
        "choice",
        "particular",
        "individual",
        "must",
        "nevertheless",
        "efficacious",
        "within",
        "phenomenal",
        "world",
        "able",
        "transform",
        "natural",
        "world",
        "moral",
        "world",
        "people",
        "really",
        "act",
        "accordance",
        "moral",
        "law",
        "end",
        "imposed",
        "upon",
        "u",
        "law",
        "really",
        "realized",
        "reason",
        "linking",
        "aesthetic",
        "teleological",
        "judgment",
        "together",
        "third",
        "critique",
        "apparently",
        "must",
        "two",
        "form",
        "human",
        "experience",
        "judgment",
        "together",
        "somehow",
        "offer",
        "solution",
        "problem",
        "problem",
        "efficacy",
        "law",
        "freedom",
        "realm",
        "nature",
        "could",
        "remain",
        "solved",
        "first",
        "two",
        "critique",
        "critique",
        "pure",
        "reason",
        "argued",
        "although",
        "disprove",
        "possibility",
        "breach",
        "determinism",
        "natural",
        "world",
        "theoretical",
        "knowledge",
        "freedom",
        "noumenal",
        "world",
        "nevertheless",
        "coherently",
        "conceive",
        "latter",
        "critique",
        "practical",
        "reason",
        "argued",
        "confidently",
        "infer",
        "reality",
        "noumenal",
        "freedom",
        "choose",
        "whatever",
        "morality",
        "requires",
        "u",
        "immediate",
        "awareness",
        "obligation",
        "moral",
        "law",
        "combined",
        "principle",
        "ought",
        "something",
        "must",
        "able",
        "see",
        "critique",
        "practical",
        "reason",
        "religion",
        "within",
        "boundary",
        "mere",
        "reason",
        "second",
        "critique",
        "also",
        "argued",
        "since",
        "morality",
        "imposes",
        "end",
        "upon",
        "u",
        "namely",
        "realizing",
        "highest",
        "good",
        "greatest",
        "happiness",
        "consistent",
        "greatest",
        "virtue",
        "must",
        "believe",
        "possible",
        "thus",
        "must",
        "postulate",
        "supreme",
        "cause",
        "nature",
        "causality",
        "keeping",
        "moral",
        "disposition",
        "critique",
        "practical",
        "reason",
        "dialectic",
        "translation",
        "gregor",
        "p",
        "kant",
        "already",
        "established",
        "basis",
        "awareness",
        "obligation",
        "moral",
        "law",
        "confident",
        "free",
        "law",
        "nature",
        "least",
        "consistent",
        "realization",
        "end",
        "commanded",
        "moral",
        "law",
        "need",
        "done",
        "order",
        "throw",
        "bridge",
        "theoretical",
        "cognition",
        "nature",
        "law",
        "freedom",
        "second",
        "critique",
        "preceding",
        "groundwork",
        "metaphysics",
        "moral",
        "make",
        "clear",
        "kant",
        "clearly",
        "recognizes",
        "order",
        "act",
        "morally",
        "need",
        "understand",
        "moral",
        "law",
        "requires",
        "u",
        "ii",
        "believe",
        "fact",
        "free",
        "choose",
        "requires",
        "u",
        "rather",
        "motif",
        "subsumed",
        "rubric",
        "selflove",
        "might",
        "suggest",
        "u",
        "iii",
        "believe",
        "objective",
        "morality",
        "imposes",
        "upon",
        "u",
        "actually",
        "achieved",
        "iv",
        "adequate",
        "motivation",
        "attempt",
        "morality",
        "requires",
        "u",
        "lieu",
        "mere",
        "desirability",
        "particular",
        "goal",
        "might",
        "happen",
        "license",
        "even",
        "impose",
        "particular",
        "circumstance",
        "together",
        "constitute",
        "condition",
        "possibility",
        "morality",
        "kant",
        "also",
        "think",
        "one",
        "level",
        "condition",
        "satisfied",
        "pure",
        "practical",
        "reason",
        "form",
        "pure",
        "practical",
        "reason",
        "give",
        "u",
        "moral",
        "law",
        "ii",
        "first",
        "fact",
        "pure",
        "practical",
        "reason",
        "namely",
        "consciousness",
        "obligation",
        "law",
        "implies",
        "reality",
        "freedom",
        "moral",
        "mean",
        "principle",
        "must",
        "able",
        "know",
        "ought",
        "iii",
        "postulate",
        "pure",
        "practical",
        "reason",
        "alone",
        "law",
        "nature",
        "compatible",
        "demand",
        "morality",
        "law",
        "ultimately",
        "common",
        "author",
        "finally",
        "iv",
        "pure",
        "respect",
        "moral",
        "law",
        "sufficient",
        "motivation",
        "u",
        "attempt",
        "carry",
        "attempt",
        "moral",
        "worth",
        "motivation",
        "kant",
        "also",
        "recognizes",
        "sensuous",
        "well",
        "rational",
        "creature",
        "need",
        "sensuous",
        "well",
        "rational",
        "presentation",
        "confirmation",
        "condition",
        "possibility",
        "morality",
        "task",
        "third",
        "critique",
        "show",
        "aesthetic",
        "teleological",
        "experience",
        "judgment",
        "provide",
        "sensuous",
        "confirmation",
        "already",
        "know",
        "abstract",
        "way",
        "also",
        "need",
        "feel",
        "make",
        "palpable",
        "namely",
        "efficacy",
        "free",
        "choice",
        "fundamental",
        "principle",
        "morality",
        "natural",
        "world",
        "realizability",
        "objective",
        "choice",
        "imposes",
        "upon",
        "u",
        "summed",
        "concept",
        "highest",
        "good",
        "specifically",
        "kant",
        "argue",
        "although",
        "purest",
        "form",
        "free",
        "play",
        "understanding",
        "imagination",
        "constitutes",
        "experience",
        "natural",
        "beauty",
        "presuppose",
        "judgment",
        "moral",
        "value",
        "fact",
        "existence",
        "natural",
        "beauty",
        "appears",
        "confirm",
        "world",
        "hospitable",
        "goal",
        "especially",
        "moral",
        "goal",
        "experience",
        "natural",
        "sublimity",
        "artistic",
        "beauty",
        "involve",
        "free",
        "play",
        "cognitive",
        "power",
        "morally",
        "significant",
        "idea",
        "thus",
        "distinctively",
        "aesthetic",
        "yet",
        "morally",
        "significant"
    ]
}