{
    "main_text": "Herder, Sulzer and Herz: Energy, Activity and Truth || Herz\n5.3 Herz\n\nSulzer was clearly significant for successors such as Kant and\nSchiller, both for his emphasis on the free activity of the mind in\naesthetic experience and for his complex rather than simplistic\nposition on the relation between art and morality. One other\nimportant aesthetician of the 1770s was also, like Herder, actually a\nstudent of Kant, but his theory would become an unstated target of\nKant’s criticism rather than a source for him. This is Marcus Herz\n(1747–1803), Herder’s junior by three years. Remembered by\nphilosophers primarily as the respondent at the defense of Kant’s\ninaugural dissertation On the Form and Principles of the Sensible\nand Intelligible World in 1770 and as the recipient of Kant’s\nletters describing his progress on the Critique of Pure\nReason in the following decade, Herz had a significant career of\nhis own, as a physician and medical writer, as a lecturer on\nphilosophy, and as the author not only of the earliest exposition of\nKant’s philosophy, but also of an independent and important work in\naesthetics.\n\n\nHerz was born to a Jewish scribe and his wife in Berlin in 1747, and\nreceived a traditional talmudic education. At the age of fifteen he\nwas sent to apprentice with a Jewish merchant in Königsberg, but at\nnineteen he matriculated at the university in Königsberg (two years\nafter Herder had left) as a medical student—the only university\ncourse open to Jews in Prussia. Medical students were required to\nstudy modern languages, philosophy, and mathematics, and Herz became a\nloyal student of Kant’s, attending his lectures on logic, metaphysics,\nmoral philosophy, natural law, physics, and physical geography. Kant’s\nselection of the Jewish student for the defense of his inaugural\ndissertation in 1770 was not accepted happily by some members of the\nfaculty, but Kant supported Herz then and always remained loyal to\nhim, even as the student’s views diverged from his own. Shortly after\nthe defense of Kant’s dissertation, Herz left Königsberg without a\ndegree but with an introduction from Kant to Moses Mendelssohn. He\nimmediately became a member of Mendelssohn’s circle, and also resumed\nhis medical studies in Berlin, and then from 1772 to 1774 in Halle,\nwhere he received his doctorate. He then returned to Berlin, where he\nwas appointed to the Jewish hospital. He attended Mendelssohn in his\nfinal illness in 1786. Most of Herz’s publications arose from his\nmedical and scientific practice, and included his Letters to\nDoctors in 1777 and 1784; Outline of All Medical\nSciences in 1782, which was adopted as a textbook in Halle; a\ncompanion to his Berlin lectures on Experimental Physics;\nan Essay on Dizziness in 1786; and a controversial\nessay On Early Burial among the Jews in 1787, in which he\nargued against the current practice among Jews of burial on the day of\ndeath on medical grounds, holding that death could not always be\nconclusively determined within such a short period. In 1782, Herz also\nprovided the German translation of Manasseh ben\nIsrael’s Vindication of the Jews, to which Mendelssohn\nprovided the preface that would in turn lead the way to\nhis Jerusalem of the next year; Herz thus played a role in\nthe genesis of that central text. In 1777 he began offering private\nlectures on philosophy in addition to his medical practice, which were\nwell attended. Herz died on January 19, 1803, a year before his teacher Kant.\n\n\nHerz’s two important philosophical works were his Considerations\nfrom Speculative Philosophy (Betrachtungen aus der\nspekulativen Weltweisheit) of 1771 and his Essay on Taste and\nthe Causes of its Variety (Versuch über den Geschmack und die\nUrsachen seiner Verschiedenheit), first published in 1776 and\nthen in an expanded edition in 1790—the same year as\nKant’s Critique of the Power of Judgment.  The contrast\nbetween the two works in aesthetics is interesting, because while some\narguments in Kant’s work can be construed as subtle criticisms of some\nof Herz’s positions, Herz finished even the second edition of his book\nwithout any knowledge of Kant’s criticisms. In general, he remained\ncloser to the Wolffian and Baumgartian theory of beauty and taste that\nhad been transmitted to him through Mendelssohn than to the position\nof his erstwhile teacher Kant, but he also shared Sulzer’s emphasis on\nmental activity and Herder’s emphasis on the social dimension of art\nwhile introducing some novel positions of his own.\n\n\nHerz’s Considerations from Speculative Philosophy, published\nat the age of twenty-four, does not purport to be more than a German\nparaphrase of Kant’s Latin dissertation, but it goes beyond Kant’s\npublished work on a number of points in the treatment of space, time,\nand things in themselves. It also adds a Mendelssohnian argument about\nthe simplicity of the soul, and, most surprisingly, includes a\ndigression on aesthetic judgment that anticipates a central argument\nof his subsequent Essay on Taste. The central arguments of\nthis digression, which comes in Herz’s exposition of Kant’s new theory\nof space and time as the forms of sensibility, are first, that beauty\nis an objective property especially connected to the form of an\nobject, and not a mere sensation or sentiment (Empfindung) in\nthe subject, and second, that there are general principles of\nbeautiful form.  However, form must always be realized in matter, and\nindividuals differ more in their response to matter than to form, so\nthese general principles are objective but not completely determinate,\nthus allowing for differences of taste even though beauty is\nobjective. Kant would subsequently agree that individuals differ in\ntheir response to matter but not to form, but then restrict pure\njudgments of taste to form alone, thus attempting to guarantee\nunanimity of judgments of taste instead of accepting variation as Herz\ndid. Kant’s analysis of pure judgments of taste might thus be seen as\na criticism of Herz’s theory.\n\n\nFive years after the Considerations, Herz developed this\nconception of beauty as objective but yielding only indeterminate\nrules for taste into the far more extensive Essay on Taste.\nHerz begins with what he considers to be a Baumgartian definition of\nbeauty as the appearance of perfection in an object, where perfection\nin turn consists in the unity of a manifold. However, he adds that a\nwork of art also has a Haltung, or expresses an attitude, and\nthat its beauty also depends upon the harmony between the attitude\nexpressed in the work and the goal or purpose of the work. We do not\nattribute purposes to natural objects, he argues, so in their case\nbeauty lies in manifoldness and unity alone, but in human productions\nand therefore in art we always expect and respond to a purpose. Here\nHerz’s analysis anticipates Kant’s differentiation between natural and\nartistic beauty.  He next argues that as natural beauty consists only\nin manifoldness and unity, we respond to it with the play of our\nimagination, which apprehends manifoldness, and reason, which\nrecognizes unity. But as artistic beauty consists in the objective\nfactors of manifoldness, unity, and attitude, the response to artistic\nbeauty depends upon imagination, reason, and the further element of\nfeeling, for response to the attitude of the work. In this analysis,\nHerz stresses that the perception of beauty is not passive, but rather\nactive, because of the rôle of both imagination and reason. He also\nargues that our pleasure in beauty is ultimately due to the activity\nof our mental powers in its perception, activity being the greatest\nsource of our pleasure. Here Herz clearly aligns himself with\nSulzer. Herz then argues that human beings share their basic\ncapacities of imagination, reason, and feeling, but that there are\nnumerous factors that affect how these general faculties function\nconcretely in different individuals and populations. This explains\ndifferences of taste without undermining the metaphysical objectivity\nof beauty: these differences include variations in freedom of thought,\nreligion, morality, material wealth, climate and regime. Here Herz’s\nthought parallels the contemporary thought of Herder.\n\n\nSome of Herz’s most interesting points and his greatest differences\nwith Kant’s theory of taste emerge in the discussion of the influence\nof morality on taste. Herz argues that the enjoyment of beauty\ncontributes to morality in two ways, directly and indirectly. The\nenjoyment of beauty contributes to morality directly because as a\nsource of mental activity it is a source of happiness, and happiness\nis nothing less than the aim of morality. Here again Herz adopts the\nsame positions as Sulzer. Herz takes a different position than Sulzer\non the indirect moral benefits of art, however, arguing not that the\nexperience of art enlivens moral sentiments that we already have from\nour more abstract recognition of general moral precepts, but rather\nthat the cultivation of taste, which happens only in society,\ncontributes to morality indirectly because it generates feelings of\nsociability that can then support our attempts to be moral.  Although\nKant will not mention Herz’s name in the Critique of the Power of\nJudgment, this seems to be the kind of vindication of aesthetic\nexperience that Kant criticizes under the name of an “empirical\ninterest in the beautiful,” holding that morality requires\nan a priori principle rather than mere feelings of\nsociability and can therefore be supported only by an\n“intellectual interest in the beautiful.”\n\n\nFinally, in the appendix to the Essay Herz also argues\nagainst the position of Du Bos that critics have no better rules for\narguing about the merits of works of art than cooks do for arguing\nabout ragouts, a position adopted from Du Bos by Hume and subsequently\nendorsed by Kant. In spite of his recognition of the many factors that\ncreate variability in judgments of taste, Herz thus insisted to the\nend that we can have not just an a priori ideal of agreement\nin taste but rational means for arguing about judgments of taste,\nconsisting in discussion of unity amidst variety on the one hand and\nthe identification of factors leading to disagreement on the other\nhand. In this regard, Herz remained within the ambit of Wolff,\nBaumgarten, and Meier rather than approaching the view of his\ncontemporary Herder. One might nevertheless have expected his emphasis\non the rôle of individual mental activity in aesthetic experience,\nrather than Herder’s emphasis on truth as the basis of aesthetic\nexperience, to have led to the more radical position on the\npossibility of determinate rules for art criticism.\n",
    "section_title": "5.3 Herz",
    "entry_title": "18th Century German Aesthetics",
    "hierarchy_title": "18th Century German Aesthetics || Herder, Sulzer and Herz: Energy, Activity and Truth || Herz",
    "tokenized_text": [
        "herder",
        "sulzer",
        "herz",
        "energy",
        "activity",
        "truth",
        "herz",
        "herz",
        "sulzer",
        "clearly",
        "significant",
        "successor",
        "kant",
        "schiller",
        "emphasis",
        "free",
        "activity",
        "mind",
        "aesthetic",
        "experience",
        "complex",
        "rather",
        "simplistic",
        "position",
        "relation",
        "art",
        "morality",
        "one",
        "important",
        "aesthetician",
        "s",
        "also",
        "like",
        "herder",
        "actually",
        "student",
        "kant",
        "theory",
        "would",
        "become",
        "unstated",
        "target",
        "kant",
        "criticism",
        "rather",
        "source",
        "marcus",
        "herz",
        "herder",
        "junior",
        "three",
        "year",
        "remembered",
        "philosopher",
        "primarily",
        "respondent",
        "defense",
        "kant",
        "inaugural",
        "dissertation",
        "form",
        "principle",
        "sensible",
        "intelligible",
        "world",
        "recipient",
        "kant",
        "letter",
        "describing",
        "progress",
        "critique",
        "pure",
        "reason",
        "following",
        "decade",
        "herz",
        "significant",
        "career",
        "physician",
        "medical",
        "writer",
        "lecturer",
        "philosophy",
        "author",
        "earliest",
        "exposition",
        "kant",
        "philosophy",
        "also",
        "independent",
        "important",
        "work",
        "aesthetic",
        "herz",
        "born",
        "jewish",
        "scribe",
        "wife",
        "berlin",
        "received",
        "traditional",
        "talmudic",
        "education",
        "age",
        "fifteen",
        "sent",
        "apprentice",
        "jewish",
        "merchant",
        "königsberg",
        "nineteen",
        "matriculated",
        "university",
        "königsberg",
        "two",
        "year",
        "herder",
        "left",
        "medical",
        "studentthe",
        "university",
        "course",
        "open",
        "jew",
        "prussia",
        "medical",
        "student",
        "required",
        "study",
        "modern",
        "language",
        "philosophy",
        "mathematics",
        "herz",
        "became",
        "loyal",
        "student",
        "kant",
        "attending",
        "lecture",
        "logic",
        "metaphysics",
        "moral",
        "philosophy",
        "natural",
        "law",
        "physic",
        "physical",
        "geography",
        "kant",
        "selection",
        "jewish",
        "student",
        "defense",
        "inaugural",
        "dissertation",
        "accepted",
        "happily",
        "member",
        "faculty",
        "kant",
        "supported",
        "herz",
        "always",
        "remained",
        "loyal",
        "even",
        "student",
        "view",
        "diverged",
        "shortly",
        "defense",
        "kant",
        "dissertation",
        "herz",
        "left",
        "königsberg",
        "without",
        "degree",
        "introduction",
        "kant",
        "moses",
        "mendelssohn",
        "immediately",
        "became",
        "member",
        "mendelssohn",
        "circle",
        "also",
        "resumed",
        "medical",
        "study",
        "berlin",
        "halle",
        "received",
        "doctorate",
        "returned",
        "berlin",
        "appointed",
        "jewish",
        "hospital",
        "attended",
        "mendelssohn",
        "final",
        "illness",
        "herz",
        "publication",
        "arose",
        "medical",
        "scientific",
        "practice",
        "included",
        "letter",
        "doctor",
        "outline",
        "medical",
        "science",
        "adopted",
        "textbook",
        "halle",
        "companion",
        "berlin",
        "lecture",
        "experimental",
        "physic",
        "essay",
        "dizziness",
        "controversial",
        "essay",
        "early",
        "burial",
        "among",
        "jew",
        "argued",
        "current",
        "practice",
        "among",
        "jew",
        "burial",
        "day",
        "death",
        "medical",
        "ground",
        "holding",
        "death",
        "could",
        "always",
        "conclusively",
        "determined",
        "within",
        "short",
        "period",
        "herz",
        "also",
        "provided",
        "german",
        "translation",
        "manasseh",
        "ben",
        "israel",
        "vindication",
        "jew",
        "mendelssohn",
        "provided",
        "preface",
        "would",
        "turn",
        "lead",
        "way",
        "jerusalem",
        "next",
        "year",
        "herz",
        "thus",
        "played",
        "role",
        "genesis",
        "central",
        "text",
        "began",
        "offering",
        "private",
        "lecture",
        "philosophy",
        "addition",
        "medical",
        "practice",
        "well",
        "attended",
        "herz",
        "died",
        "january",
        "year",
        "teacher",
        "kant",
        "herz",
        "two",
        "important",
        "philosophical",
        "work",
        "consideration",
        "speculative",
        "philosophy",
        "betrachtungen",
        "au",
        "der",
        "spekulativen",
        "weltweisheit",
        "essay",
        "taste",
        "cause",
        "variety",
        "versuch",
        "über",
        "den",
        "geschmack",
        "und",
        "die",
        "ursachen",
        "seiner",
        "verschiedenheit",
        "first",
        "published",
        "expanded",
        "edition",
        "the",
        "year",
        "kant",
        "critique",
        "power",
        "judgment",
        "contrast",
        "two",
        "work",
        "aesthetic",
        "interesting",
        "argument",
        "kant",
        "work",
        "construed",
        "subtle",
        "criticism",
        "herz",
        "position",
        "herz",
        "finished",
        "even",
        "second",
        "edition",
        "book",
        "without",
        "knowledge",
        "kant",
        "criticism",
        "general",
        "remained",
        "closer",
        "wolffian",
        "baumgartian",
        "theory",
        "beauty",
        "taste",
        "transmitted",
        "mendelssohn",
        "position",
        "erstwhile",
        "teacher",
        "kant",
        "also",
        "shared",
        "sulzer",
        "emphasis",
        "mental",
        "activity",
        "herder",
        "emphasis",
        "social",
        "dimension",
        "art",
        "introducing",
        "novel",
        "position",
        "herz",
        "consideration",
        "speculative",
        "philosophy",
        "published",
        "age",
        "twentyfour",
        "purport",
        "german",
        "paraphrase",
        "kant",
        "latin",
        "dissertation",
        "go",
        "beyond",
        "kant",
        "published",
        "work",
        "number",
        "point",
        "treatment",
        "space",
        "time",
        "thing",
        "also",
        "add",
        "mendelssohnian",
        "argument",
        "simplicity",
        "soul",
        "surprisingly",
        "includes",
        "digression",
        "aesthetic",
        "judgment",
        "anticipates",
        "central",
        "argument",
        "subsequent",
        "essay",
        "taste",
        "central",
        "argument",
        "digression",
        "come",
        "herz",
        "exposition",
        "kant",
        "new",
        "theory",
        "space",
        "time",
        "form",
        "sensibility",
        "first",
        "beauty",
        "objective",
        "property",
        "especially",
        "connected",
        "form",
        "object",
        "mere",
        "sensation",
        "sentiment",
        "empfindung",
        "subject",
        "second",
        "general",
        "principle",
        "beautiful",
        "form",
        "however",
        "form",
        "must",
        "always",
        "realized",
        "matter",
        "individual",
        "differ",
        "response",
        "matter",
        "form",
        "general",
        "principle",
        "objective",
        "completely",
        "determinate",
        "thus",
        "allowing",
        "difference",
        "taste",
        "even",
        "though",
        "beauty",
        "objective",
        "kant",
        "would",
        "subsequently",
        "agree",
        "individual",
        "differ",
        "response",
        "matter",
        "form",
        "restrict",
        "pure",
        "judgment",
        "taste",
        "form",
        "alone",
        "thus",
        "attempting",
        "guarantee",
        "unanimity",
        "judgment",
        "taste",
        "instead",
        "accepting",
        "variation",
        "herz",
        "kant",
        "analysis",
        "pure",
        "judgment",
        "taste",
        "might",
        "thus",
        "seen",
        "criticism",
        "herz",
        "theory",
        "five",
        "year",
        "consideration",
        "herz",
        "developed",
        "conception",
        "beauty",
        "objective",
        "yielding",
        "indeterminate",
        "rule",
        "taste",
        "far",
        "extensive",
        "essay",
        "taste",
        "herz",
        "begin",
        "considers",
        "baumgartian",
        "definition",
        "beauty",
        "appearance",
        "perfection",
        "object",
        "perfection",
        "turn",
        "consists",
        "unity",
        "manifold",
        "however",
        "add",
        "work",
        "art",
        "also",
        "haltung",
        "express",
        "attitude",
        "beauty",
        "also",
        "depends",
        "upon",
        "harmony",
        "attitude",
        "expressed",
        "work",
        "goal",
        "purpose",
        "work",
        "attribute",
        "purpose",
        "natural",
        "object",
        "argues",
        "case",
        "beauty",
        "lie",
        "manifoldness",
        "unity",
        "alone",
        "human",
        "production",
        "therefore",
        "art",
        "always",
        "expect",
        "respond",
        "purpose",
        "herz",
        "analysis",
        "anticipates",
        "kant",
        "differentiation",
        "natural",
        "artistic",
        "beauty",
        "next",
        "argues",
        "natural",
        "beauty",
        "consists",
        "manifoldness",
        "unity",
        "respond",
        "play",
        "imagination",
        "apprehends",
        "manifoldness",
        "reason",
        "recognizes",
        "unity",
        "artistic",
        "beauty",
        "consists",
        "objective",
        "factor",
        "manifoldness",
        "unity",
        "attitude",
        "response",
        "artistic",
        "beauty",
        "depends",
        "upon",
        "imagination",
        "reason",
        "element",
        "feeling",
        "response",
        "attitude",
        "work",
        "analysis",
        "herz",
        "stress",
        "perception",
        "beauty",
        "passive",
        "rather",
        "active",
        "rôle",
        "imagination",
        "reason",
        "also",
        "argues",
        "pleasure",
        "beauty",
        "ultimately",
        "due",
        "activity",
        "mental",
        "power",
        "perception",
        "activity",
        "greatest",
        "source",
        "pleasure",
        "herz",
        "clearly",
        "aligns",
        "sulzer",
        "herz",
        "argues",
        "human",
        "being",
        "share",
        "basic",
        "capacity",
        "imagination",
        "reason",
        "feeling",
        "numerous",
        "factor",
        "affect",
        "general",
        "faculty",
        "function",
        "concretely",
        "different",
        "individual",
        "population",
        "explains",
        "difference",
        "taste",
        "without",
        "undermining",
        "metaphysical",
        "objectivity",
        "beauty",
        "difference",
        "include",
        "variation",
        "freedom",
        "thought",
        "religion",
        "morality",
        "material",
        "wealth",
        "climate",
        "regime",
        "herz",
        "thought",
        "parallel",
        "contemporary",
        "thought",
        "herder",
        "herz",
        "interesting",
        "point",
        "greatest",
        "difference",
        "kant",
        "theory",
        "taste",
        "emerge",
        "discussion",
        "influence",
        "morality",
        "taste",
        "herz",
        "argues",
        "enjoyment",
        "beauty",
        "contributes",
        "morality",
        "two",
        "way",
        "directly",
        "indirectly",
        "enjoyment",
        "beauty",
        "contributes",
        "morality",
        "directly",
        "source",
        "mental",
        "activity",
        "source",
        "happiness",
        "happiness",
        "nothing",
        "le",
        "aim",
        "morality",
        "herz",
        "adopts",
        "position",
        "sulzer",
        "herz",
        "take",
        "different",
        "position",
        "sulzer",
        "indirect",
        "moral",
        "benefit",
        "art",
        "however",
        "arguing",
        "experience",
        "art",
        "enlivens",
        "moral",
        "sentiment",
        "already",
        "abstract",
        "recognition",
        "general",
        "moral",
        "precept",
        "rather",
        "cultivation",
        "taste",
        "happens",
        "society",
        "contributes",
        "morality",
        "indirectly",
        "generates",
        "feeling",
        "sociability",
        "support",
        "attempt",
        "moral",
        "although",
        "kant",
        "mention",
        "herz",
        "name",
        "critique",
        "power",
        "judgment",
        "seems",
        "kind",
        "vindication",
        "aesthetic",
        "experience",
        "kant",
        "criticizes",
        "name",
        "empirical",
        "interest",
        "beautiful",
        "holding",
        "morality",
        "requires",
        "priori",
        "principle",
        "rather",
        "mere",
        "feeling",
        "sociability",
        "therefore",
        "supported",
        "intellectual",
        "interest",
        "beautiful",
        "finally",
        "appendix",
        "essay",
        "herz",
        "also",
        "argues",
        "position",
        "du",
        "bos",
        "critic",
        "better",
        "rule",
        "arguing",
        "merit",
        "work",
        "art",
        "cook",
        "arguing",
        "ragout",
        "position",
        "adopted",
        "du",
        "bos",
        "hume",
        "subsequently",
        "endorsed",
        "kant",
        "spite",
        "recognition",
        "many",
        "factor",
        "create",
        "variability",
        "judgment",
        "taste",
        "herz",
        "thus",
        "insisted",
        "end",
        "priori",
        "ideal",
        "agreement",
        "taste",
        "rational",
        "mean",
        "arguing",
        "judgment",
        "taste",
        "consisting",
        "discussion",
        "unity",
        "amidst",
        "variety",
        "one",
        "hand",
        "identification",
        "factor",
        "leading",
        "disagreement",
        "hand",
        "regard",
        "herz",
        "remained",
        "within",
        "ambit",
        "wolff",
        "baumgarten",
        "meier",
        "rather",
        "approaching",
        "view",
        "contemporary",
        "herder",
        "one",
        "might",
        "nevertheless",
        "expected",
        "emphasis",
        "rôle",
        "individual",
        "mental",
        "activity",
        "aesthetic",
        "experience",
        "rather",
        "herder",
        "emphasis",
        "truth",
        "basis",
        "aesthetic",
        "experience",
        "led",
        "radical",
        "position",
        "possibility",
        "determinate",
        "rule",
        "art",
        "criticism"
    ]
}