{
    "main_text": "Internal-Sense Theories || Hutcheson\n1.2 Hutcheson\n\nOn the title page of the first edition of his An Inquiry into the\nOriginal of Our Ideas of Beauty and Virtue (1725), Francis\nHutcheson acknowledges a deep debt to Shaftesbury, announcing that\n“The Principles of the late Earl of Shaftsbury” would be\nexplained and defended therein. But it is open to question whether\nHutcheson overstates his debt. The debt is deepest with regard to the\nnotion of internal sense, but Hutcheson can fairly be said to make\nthis notion his own. That is certainly the judgment of history: anyone\nundertaking to explain, defend, or refute the notion of internal sense\nafter 1725 took himself to be explaining, defending, or refuting the\nprinciples of Dr. Hutcheson.\n\nHutcheson gives one argument for the sensibility, and another for the\ninternality, of the power by which we discern beauty. His argument for\nits sensibility is largely a systematization and amplification of\nShaftesbury’s. That the discernment of beauty is sensible\nfollows from the immediacy, necessity, and disinterestedness of the\narising of the pleasure by which beauty is discerned:\n\nThis superior Power of Perception is justly called a Sense, because of\nits Affinity to the other Senses in this, that the Pleasure does not\narise from any Knowledge of Principles, Proportions, Causes, or the\nUsefulness of the Object; but strikes us at first with the Idea of\nBeauty …. And further, the ideas of Beauty and Harmony, like\nother sensible Ideas, are necessarily pleasant to us, as well as\nimmediately so; neither can any Resolution of our own, nor any\nProspect of Advantage or Disadvantage, vary the Beauty or Deformity of\nan Object. (Hutcheson 1726 [2004, 25])\n\n\nIt is in arguing for the internality of the power of discerning beauty\nthat Hutcheson’s departure from Shaftesbury begins to show.\nShaftesbury, it will be recalled, argues that the discernment of\nbeauty is internal (or mental) on the grounds that the objects of\nbeauty necessarily are: mind alone can discern beauty because mind\nalone is beautiful, external objects managing a degree of beauty only\nby having a bit of mind imprinted on them. But Hutcheson cannot make\nthis argument because he does not think that objects of beauty are\nnecessarily internal. Hutcheson does follow Shaftesbury in\nmaintaining that things are beautiful in virtue of their proportion or\norder (Hutcheson’s preferred and more precise term is\n“uniformity amidst variety”) and he may follow\nShaftesbury in thinking all proportion or order to be the effect of\nmind. But he importantly does not follow Shaftesbury in\ninferring from the premise that things are beautiful owing to the\neffect of mind to the conclusion that mind alone is beautiful.\n\nHutcheson begins his argument for the internality of the power of\ndiscerning beauty by observing that the five external senses are\ninsufficient for that discernment—one could have all five in\nperfect working order and yet be insensible to beauty (Hutcheson\n1726 [2004, 23]). This observation, however, does not seem to show the\ndiscernment of beauty to be internal. It seems to show merely that\nsuch discernment cannot be identified with any known external power.\nBut Hutcheson continues:\n\nThere will appear another Reason perhaps … for calling this\nPower of perceiving Ideas an Internal Sense, from this, that in some\nother Affairs, where our External Senses are not much concern’d,\nwe discern a sort of Beauty, very like, in many respects, to that\nobserv’d in sensible Objects, and accompany’d with like\nPleasure. Such is the Beauty perceiv’d in Theorems, or universal\nTruths, in general Causes …. (Hutcheson 1726 [2004, 24])\n\n\nHere the reasoning is that the power of discerning beauty must be\ninternal because some objects of beauty are. But given that\nHutcheson concedes that many objects of beauty are not internal, the\nproper conclusion seems to be that the power of discerning beauty is\nneither exclusively internal nor exclusively external. In any case,\nthe power of discerning beauty cannot be internal after\nShaftesbury’s manner.\n\nBut after what manner is it internal then? Hutcheson simply never says\nin An Inquiry into the Original of Our Ideas of Beauty and\nVirtue, though he wastes no time supplying this deficiency in the\nimmediately subsequent An Essay on the Nature and Conduct of the\nPassions and Affections (first published in 1727). An internal\nsense, he there clarifies, is one whose ideas arise only if certain\nother ideas have already arisen. Sight is not an internal sense since\nthe arising of the idea of blue, for example, does not depend upon the\nprevious arising of any other idea. But the sense of beauty is\ninternal because the arising of the pleasurable idea of beauty depends\n“upon the previous Reception and Comparison of various sensible\nPerceptions … or intellectual ideas, when we find Uniformity\n… among them” (Hutcheson 1742 [2002, 16]). Another way of\nputting the point is to say that internal senses depend for their\nobjects on the operation of other powers while external senses do not.\nHence in point of internality internal senses are apparently on a par\nwith the powers of reason and memory, for example: unless some other\npower or powers has operated to place an object before the mind, there\nis nothing about which to reason, nothing to remember, and nothing\ninternally to sense. This use of “internal” and\n“external” may be thought misleading, given that it allows\nboth external and internal powers to operate on objects both bodily\nand intellectual, both from within and from without. Hutcheson came to\nagree with this criticism apparently. In later works, he replaces\n“internal” with “reflex” or\n“subsequent” to refer to powers that depend on others for\ntheir objects, and “external” with “direct” or\n“antecedent” to refer to powers that do not. (Hutcheson\n1747, 12–13 and 1744, 48).\n\nThis transformation of Shaftesbury’s notion of an internal sense\nis not the only consequence of Hutcheson’s rejection of the view\nthat mind alone is beautiful. It will be recalled that it is this\nview—or, more particularly, the view that all beauty reduces to\nthe beauty of the divine mind—that undergirds\nShaftesbury’s aesthetic realism and hence his absolutism. But\nHutcheson has neither this nor any substitute view by which to prop up\nan alternative version of realism, and settles hesitantly on a version\nof idealism, and hence relativism, that understands the idea of beauty\non the model of an idea of a Lockean secondary quality:\n\nBeauty, like other Names of sensible Ideas, properly denotes the\nPerception of some Mind; so Cold, Hot, Sweet, Bitter, denote\nSensations in our Minds, to which perhaps there is no resemblance in\nthe Objects, which excite these ideas in us, however we generally\nimagine that there is something in the Object just like our Perception\n…. were there no Mind with a Sense of Beauty to contemplate\nObjects, I see not how they could be call’d beautiful.\n(Hutcheson 1726 [2004, 27])\n\n\nMoreover there seems to be no necessity that the idea of beauty should\narise, as it does, in response to objects having uniformity amidst\nvariety. Had it pleased him to do so, God might have given us a sense\nof beauty responsive to irregularity amidst simplicity (Hutcheson\n1726 [2004, 80]).\n\nBut that God might not have given us a sense of beauty responsive to\nuniformity amidst variety raises the question why he did. Though it is\na question that never arises for Shaftesbury, Hutcheson gives it an\nanswer that narrows the distance between the two. As Shaftesbury had\nfamously stressed, the universe is highly ordered—at least\n“Uniformity, Proportion, and Similitude [are diffused] thro all\nthe Parts of Nature which we can observe” (Hutcheson 1726 [2004,\n81]). In such a universe, “[t]he manner of Knowledge by universal\nTheorems … must be most convenient for Beings of limited\nUnderstanding and Power” (Hutcheson 1726 [2004, 79]). But if such\nis the manner of knowledge most convenient for beings such as us, a\nbenevolent God may be expected to provide some immediate\nmotive—a motive, that is, that does not require that we reflect\non what is most convenient for us—to our pursuit of it. Because\na theorem by nature possesses uniformity amidst variety—a\ntheorem simply is the unification of various particulars under a\nsingle principle (Hutcheson 1726 [2004, 36])—it stands to reason\nthat\n\nthe Author of Nature has determin’d us … to receive from\nuniform Objects the Pleasures of Beauty and Harmony, to excite us to\nthe Pursuit of Knowledge, and to reward us for it. (Hutcheson\n1726 [2004, 99])\n\n\nSo it is in the perception of objects of intellect—theorems,\nnamely—that the internal sense of beauty has its raison\nd’être, and it is by resembling theorems in point of\nuniformity that other objects, including material objects, are\nbeautiful. In this way Hutcheson recovers an element of\nShaftesbury’s theory that had apparently been lost in his\ntransformation of Shaftesbury’s notion of internal\nsense—he recovers a priority of the intellectual over the\nmaterial as object of beauty. This is not to say, however, that\nHutcheson recovers Shaftesbury’s priority exactly.\nShaftesbury’s priority is reductive, having its ground in the\ndistinction he draws between representative and original beauty.\nHutcheson draws no corresponding distinction and so allows\nmaterial objects to be beautiful in their own right.\nThat difference is consequential. If material objects can be\nbeautiful, then the sense by which we find them so must be\ncapable of training outward. If the notion of internal\nsense that Hutcheson took over from Shaftesbury is\nessentially the one we find in Augustine, Plotinus, and Plato,\nthe notion of aesthetic perception that Hutcheson left to us is\nessentially the one we find in Frank Sibley (Sibley\n2001). \n",
    "section_title": "1.2 Hutcheson",
    "entry_title": "18th Century British Aesthetics",
    "hierarchy_title": "18th Century British Aesthetics || Internal-Sense Theories || Hutcheson",
    "tokenized_text": [
        "internalsense",
        "theory",
        "hutcheson",
        "hutcheson",
        "title",
        "page",
        "first",
        "edition",
        "inquiry",
        "original",
        "idea",
        "beauty",
        "virtue",
        "francis",
        "hutcheson",
        "acknowledges",
        "deep",
        "debt",
        "shaftesbury",
        "announcing",
        "principle",
        "late",
        "earl",
        "shaftsbury",
        "would",
        "explained",
        "defended",
        "therein",
        "open",
        "question",
        "whether",
        "hutcheson",
        "overstates",
        "debt",
        "debt",
        "deepest",
        "regard",
        "notion",
        "internal",
        "sense",
        "hutcheson",
        "fairly",
        "said",
        "make",
        "notion",
        "certainly",
        "judgment",
        "history",
        "anyone",
        "undertaking",
        "explain",
        "defend",
        "refute",
        "notion",
        "internal",
        "sense",
        "took",
        "explaining",
        "defending",
        "refuting",
        "principle",
        "dr",
        "hutcheson",
        "hutcheson",
        "give",
        "one",
        "argument",
        "sensibility",
        "another",
        "internality",
        "power",
        "discern",
        "beauty",
        "argument",
        "sensibility",
        "largely",
        "systematization",
        "amplification",
        "shaftesbury",
        "discernment",
        "beauty",
        "sensible",
        "follows",
        "immediacy",
        "necessity",
        "disinterestedness",
        "arising",
        "pleasure",
        "beauty",
        "discerned",
        "superior",
        "power",
        "perception",
        "justly",
        "called",
        "sense",
        "affinity",
        "sens",
        "pleasure",
        "arise",
        "knowledge",
        "principle",
        "proportion",
        "cause",
        "usefulness",
        "object",
        "strike",
        "u",
        "first",
        "idea",
        "beauty",
        "idea",
        "beauty",
        "harmony",
        "like",
        "sensible",
        "idea",
        "necessarily",
        "pleasant",
        "u",
        "well",
        "immediately",
        "neither",
        "resolution",
        "prospect",
        "advantage",
        "disadvantage",
        "vary",
        "beauty",
        "deformity",
        "object",
        "hutcheson",
        "arguing",
        "internality",
        "power",
        "discerning",
        "beauty",
        "hutcheson",
        "departure",
        "shaftesbury",
        "begin",
        "show",
        "shaftesbury",
        "recalled",
        "argues",
        "discernment",
        "beauty",
        "internal",
        "mental",
        "ground",
        "object",
        "beauty",
        "necessarily",
        "mind",
        "alone",
        "discern",
        "beauty",
        "mind",
        "alone",
        "beautiful",
        "external",
        "object",
        "managing",
        "degree",
        "beauty",
        "bit",
        "mind",
        "imprinted",
        "hutcheson",
        "make",
        "argument",
        "think",
        "object",
        "beauty",
        "necessarily",
        "internal",
        "hutcheson",
        "follow",
        "shaftesbury",
        "maintaining",
        "thing",
        "beautiful",
        "virtue",
        "proportion",
        "order",
        "hutcheson",
        "preferred",
        "precise",
        "term",
        "uniformity",
        "amidst",
        "variety",
        "may",
        "follow",
        "shaftesbury",
        "thinking",
        "proportion",
        "order",
        "effect",
        "mind",
        "importantly",
        "follow",
        "shaftesbury",
        "inferring",
        "premise",
        "thing",
        "beautiful",
        "owing",
        "effect",
        "mind",
        "conclusion",
        "mind",
        "alone",
        "beautiful",
        "hutcheson",
        "begin",
        "argument",
        "internality",
        "power",
        "discerning",
        "beauty",
        "observing",
        "five",
        "external",
        "sens",
        "insufficient",
        "discernmentone",
        "could",
        "five",
        "perfect",
        "working",
        "order",
        "yet",
        "insensible",
        "beauty",
        "hutcheson",
        "observation",
        "however",
        "seem",
        "show",
        "discernment",
        "beauty",
        "internal",
        "seems",
        "show",
        "merely",
        "discernment",
        "identified",
        "known",
        "external",
        "power",
        "hutcheson",
        "continues",
        "appear",
        "another",
        "reason",
        "perhaps",
        "calling",
        "power",
        "perceiving",
        "idea",
        "internal",
        "sense",
        "affair",
        "external",
        "sens",
        "much",
        "concern",
        "discern",
        "sort",
        "beauty",
        "like",
        "many",
        "respect",
        "observ",
        "sensible",
        "object",
        "accompany",
        "like",
        "pleasure",
        "beauty",
        "perceiv",
        "theorem",
        "universal",
        "truth",
        "general",
        "cause",
        "hutcheson",
        "reasoning",
        "power",
        "discerning",
        "beauty",
        "must",
        "internal",
        "object",
        "beauty",
        "given",
        "hutcheson",
        "concedes",
        "many",
        "object",
        "beauty",
        "internal",
        "proper",
        "conclusion",
        "seems",
        "power",
        "discerning",
        "beauty",
        "neither",
        "exclusively",
        "internal",
        "exclusively",
        "external",
        "case",
        "power",
        "discerning",
        "beauty",
        "internal",
        "shaftesbury",
        "manner",
        "manner",
        "internal",
        "hutcheson",
        "simply",
        "never",
        "say",
        "inquiry",
        "original",
        "idea",
        "beauty",
        "virtue",
        "though",
        "waste",
        "time",
        "supplying",
        "deficiency",
        "immediately",
        "subsequent",
        "essay",
        "nature",
        "conduct",
        "passion",
        "affection",
        "first",
        "published",
        "internal",
        "sense",
        "clarifies",
        "one",
        "whose",
        "idea",
        "arise",
        "certain",
        "idea",
        "already",
        "arisen",
        "sight",
        "internal",
        "sense",
        "since",
        "arising",
        "idea",
        "blue",
        "example",
        "depend",
        "upon",
        "previous",
        "arising",
        "idea",
        "sense",
        "beauty",
        "internal",
        "arising",
        "pleasurable",
        "idea",
        "beauty",
        "depends",
        "upon",
        "previous",
        "reception",
        "comparison",
        "various",
        "sensible",
        "perception",
        "intellectual",
        "idea",
        "find",
        "uniformity",
        "among",
        "hutcheson",
        "another",
        "way",
        "putting",
        "point",
        "say",
        "internal",
        "sens",
        "depend",
        "object",
        "operation",
        "power",
        "external",
        "sens",
        "hence",
        "point",
        "internality",
        "internal",
        "sens",
        "apparently",
        "par",
        "power",
        "reason",
        "memory",
        "example",
        "unless",
        "power",
        "power",
        "operated",
        "place",
        "object",
        "mind",
        "nothing",
        "reason",
        "nothing",
        "remember",
        "nothing",
        "internally",
        "sense",
        "use",
        "internal",
        "external",
        "may",
        "thought",
        "misleading",
        "given",
        "allows",
        "external",
        "internal",
        "power",
        "operate",
        "object",
        "bodily",
        "intellectual",
        "within",
        "without",
        "hutcheson",
        "came",
        "agree",
        "criticism",
        "apparently",
        "later",
        "work",
        "replaces",
        "internal",
        "reflex",
        "subsequent",
        "refer",
        "power",
        "depend",
        "others",
        "object",
        "external",
        "direct",
        "antecedent",
        "refer",
        "power",
        "hutcheson",
        "transformation",
        "shaftesbury",
        "notion",
        "internal",
        "sense",
        "consequence",
        "hutcheson",
        "rejection",
        "view",
        "mind",
        "alone",
        "beautiful",
        "recalled",
        "viewor",
        "particularly",
        "view",
        "beauty",
        "reduces",
        "beauty",
        "divine",
        "mindthat",
        "undergirds",
        "shaftesbury",
        "aesthetic",
        "realism",
        "hence",
        "absolutism",
        "hutcheson",
        "neither",
        "substitute",
        "view",
        "prop",
        "alternative",
        "version",
        "realism",
        "settle",
        "hesitantly",
        "version",
        "idealism",
        "hence",
        "relativism",
        "understands",
        "idea",
        "beauty",
        "model",
        "idea",
        "lockean",
        "secondary",
        "quality",
        "beauty",
        "like",
        "name",
        "sensible",
        "idea",
        "properly",
        "denotes",
        "perception",
        "mind",
        "cold",
        "hot",
        "sweet",
        "bitter",
        "denote",
        "sensation",
        "mind",
        "perhaps",
        "resemblance",
        "object",
        "excite",
        "idea",
        "u",
        "however",
        "generally",
        "imagine",
        "something",
        "object",
        "like",
        "perception",
        "mind",
        "sense",
        "beauty",
        "contemplate",
        "object",
        "see",
        "could",
        "call",
        "beautiful",
        "hutcheson",
        "moreover",
        "seems",
        "necessity",
        "idea",
        "beauty",
        "arise",
        "response",
        "object",
        "uniformity",
        "amidst",
        "variety",
        "pleased",
        "god",
        "might",
        "given",
        "u",
        "sense",
        "beauty",
        "responsive",
        "irregularity",
        "amidst",
        "simplicity",
        "hutcheson",
        "god",
        "might",
        "given",
        "u",
        "sense",
        "beauty",
        "responsive",
        "uniformity",
        "amidst",
        "variety",
        "raise",
        "question",
        "though",
        "question",
        "never",
        "arises",
        "shaftesbury",
        "hutcheson",
        "give",
        "answer",
        "narrow",
        "distance",
        "two",
        "shaftesbury",
        "famously",
        "stressed",
        "universe",
        "highly",
        "orderedat",
        "least",
        "uniformity",
        "proportion",
        "similitude",
        "diffused",
        "thro",
        "part",
        "nature",
        "observe",
        "hutcheson",
        "universe",
        "manner",
        "knowledge",
        "universal",
        "theorem",
        "must",
        "convenient",
        "being",
        "limited",
        "understanding",
        "power",
        "hutcheson",
        "manner",
        "knowledge",
        "convenient",
        "being",
        "u",
        "benevolent",
        "god",
        "may",
        "expected",
        "provide",
        "immediate",
        "motivea",
        "motive",
        "require",
        "reflect",
        "convenient",
        "usto",
        "pursuit",
        "theorem",
        "nature",
        "posse",
        "uniformity",
        "amidst",
        "varietya",
        "theorem",
        "simply",
        "unification",
        "various",
        "particular",
        "single",
        "principle",
        "hutcheson",
        "it",
        "stand",
        "reason",
        "author",
        "nature",
        "determin",
        "u",
        "receive",
        "uniform",
        "object",
        "pleasure",
        "beauty",
        "harmony",
        "excite",
        "u",
        "pursuit",
        "knowledge",
        "reward",
        "u",
        "hutcheson",
        "perception",
        "object",
        "intellecttheorems",
        "namelythat",
        "internal",
        "sense",
        "beauty",
        "raison",
        "être",
        "resembling",
        "theorem",
        "point",
        "uniformity",
        "object",
        "including",
        "material",
        "object",
        "beautiful",
        "way",
        "hutcheson",
        "recovers",
        "element",
        "shaftesbury",
        "theory",
        "apparently",
        "lost",
        "transformation",
        "shaftesbury",
        "notion",
        "internal",
        "sensehe",
        "recovers",
        "priority",
        "intellectual",
        "material",
        "object",
        "beauty",
        "say",
        "however",
        "hutcheson",
        "recovers",
        "shaftesbury",
        "priority",
        "exactly",
        "shaftesbury",
        "priority",
        "reductive",
        "ground",
        "distinction",
        "draw",
        "representative",
        "original",
        "beauty",
        "hutcheson",
        "draw",
        "corresponding",
        "distinction",
        "allows",
        "material",
        "object",
        "beautiful",
        "right",
        "difference",
        "consequential",
        "material",
        "object",
        "beautiful",
        "sense",
        "find",
        "must",
        "capable",
        "training",
        "outward",
        "notion",
        "internal",
        "sense",
        "hutcheson",
        "took",
        "shaftesbury",
        "essentially",
        "one",
        "find",
        "augustine",
        "plotinus",
        "plato",
        "notion",
        "aesthetic",
        "perception",
        "hutcheson",
        "left",
        "u",
        "essentially",
        "one",
        "find",
        "frank",
        "sibley",
        "sibley"
    ]
}