{
    "main_text": "The Concept of the Aesthetic || Aesthetic Judgment\n2.2 Aesthetic Judgment\n\nThe eighteenth-century debate between rationalists and theorists of\ntaste (or sentimentalists) was primarily a debate over the immediacy\nthesis, i.e., over whether we judge objects to be beautiful by\napplying principles of beauty to them. It was not primarily a debate\nover the existence of principles of beauty, a matter over which\ntheorists of taste might disagree. Kant denied that there are any such\nprinciples (Kant 1790, 101), but both Hutcheson and Hume affirmed\ntheir existence: they maintained that although judgments of beauty are\njudgments of taste and not of reason, taste nevertheless operates\naccording to general principles, which might be discovered through\nempirical investigation (Hutcheson 1725, 28–35; Hume 1757,\n231–233).\n\nIt is tempting to think of recent debate in aesthetics between\nparticularists and generalists as a revival of the eighteenth-century\ndebate between rationalists and theorists of taste. But the accuracy\nof this thought is difficult to gauge. One reason is that it is often\nunclear whether particularists and generalists take themselves merely\nto be debating the existence of aesthetic principles or to be debating\ntheir employment in aesthetic judgment. Another is that, to the degree\nparticularists and generalists take themselves to be debating the\nemployment of aesthetic principles in aesthetic judgment, it is hard\nto know what they can be meaning by ‘aesthetic judgment.’\nIf ‘aesthetic’ still carries its eighteenth-century\nimplication of immediacy, then the question under debate is whether\njudgment that is immediate is immediate. If ‘aesthetic’ no\nlonger carries that implication, then it is hard to know what question\nis under debate because it is hard to know what aesthetic judgment\ncould be. It may be tempting to think that we can simply re-define\n‘aesthetic judgment’ such that it refers to any judgment\nin which an aesthetic property is predicated of an object. But this\nrequires being able to say what an aesthetic property is without\nreference to its being immediately graspable, something no one seems\nto have done. It may seem that we can simply re-define\n‘aesthetic judgment’ such that it refers to any judgment\nin which any property of the class exemplified by beauty is predicated\nof an object. But which class is this? The classes exemplified by\nbeauty are presumably endless, and the difficulty is to specify the\nrelevant class without reference to the immediate graspability of its\nmembers, and that is what no one seems to have done.\n\nHowever we are to sort out the particularist/generalist debate,\nimportant contributions to it include, on the side of particularism,\nArnold Isenberg’s “Critical Communication” (1949)\nFrank Sibley’s “Aesthetic Concepts” (in Sibley 2001)\nand Mary Mothersill’s Beauty Restored (1984) and, on\nthe side of generalism, Monroe Beardsley’s Aesthetics\n(1958) and “On the Generality of Critical Reasons” (1962),\nSibley’s “General Reasons and Criteria in\nAesthetics” (in Sibley 2001), George Dickie’s\nEvaluating Art (1987), Stephen Davies’s “Replies\nto Arguments Suggesting that Critics’ Strong Evaluations Could\nnot be Soundly Deduced” (1995), and John Bender’s\n“General but Defeasible Reasons in Aesthetic Evaluation: The\nGeneralist/Particularist Dispute” (1995). Of these, the papers\nby Isenberg and Sibley have arguably enjoyed the greatest\ninfluence.\n\nIsenberg concedes that we often appeal to descriptive features of\nworks in support of our judgments of their value, and he allows that\nthis may make it seem as if we must be appealing to principles in\nmaking those judgments. If in support of a favorable judgment of some\npainting a critic appeals to the wavelike contour formed by the\nfigures clustered in its foreground, it may seem as if his judgment\nmust involve tacit appeal to the principle that any painting having\nsuch a contour is so much the better. But Isenberg argues that this\ncannot be, since no one agrees to any such principle:\n\nThere is not in all the world’s criticism a single purely\ndescriptive statement concerning which one is prepared to say\nbeforehand, ‘If it is true, I shall like that work so much the\nbetter’ (Isenberg 1949, 338).\n\n\nBut if in appealing to the descriptive features of a work we are not\nacknowledging tacit appeals to principles linking those features to\naesthetic value, what are we doing? Isenberg believes we are offering\n“directions for perceiving” the work, i.e., by singling\nout certain its features, we are “narrow[ing] down the field of\npossible visual orientations” and thereby guiding others in\n“the discrimination of details, the organization of parts, the\ngrouping of discrete objects into patterns” (Isenberg 1949,\n336). In this way we get others to see what we have seen, rather than\ngetting them to infer what we have inferred.\n\nThat Sibley advances a variety of particularism in one paper and a\nvariety of generalism in another will give the appearance of\ninconsistency where there is none: Sibley is a particularist of one\nsort, and with respect to one distinction, and a generalist of another\nsort with respect to another distinction. Isenberg, as noted, is a\nparticularist with respect to the distinction between descriptions and\nverdicts, i.e., he maintains that there are no principles by which we\nmay infer from value-neutral descriptions of works to judgments of\ntheir overall value. Sibley’s particularism and generalism, by\ncontrast, both have to do with judgments falling in between\ndescriptions and verdicts. With respect to a distinction between\ndescriptions and a set of judgments intermediate between descriptions\nand verdicts, Sibley is straightforwardly particularist. With respect\nto a distinction between a set of judgments intermediate between\ndescriptions and verdicts and verdicts, Sibley is a kind of generalist\nand describes himself as such.\n\nSibley’s generalism, as set forth in “General Reasons and\nCriteria in Aesthetics,” begins with the observation that the\nproperties to which we appeal in justification of favorable verdicts\nare not all descriptive or value-neutral. We also appeal to properties\nthat are inherently positive, such as grace, balance, dramatic\nintensity, or comicality. To say that a property is inherently\npositive is not to say that any work having it is so much the better,\nbut rather that its tout court attribution implies value. So\nalthough a work may be made worse on account of its comical elements,\nthe simple claim that a work is good because comical is intelligible\nin a way that the simple claims that a work is good because yellow, or\nbecause it lasts twelve minutes, or because it contains many puns, are\nnot. But if the simple claim that a work is good because comical is\nthus intelligible, comicality is a general criterion for aesthetic\nvalue, and the principle that articulates that generality is true. But\nnone of this casts any doubt on the immediacy thesis, as Sibley\nhimself observes:\n\nI have argued elsewhere that there are no sure-fire rules by which,\nreferring to the neutral and non-aesthetic qualities of things, one\ncan infer that something is balanced, tragic, comic, joyous, and so\non. One has to look and see. Here, equally, at a different level, I am\nsaying that there are no sure-fire mechanical rules or procedures for\ndeciding which qualities are actual defects in the work; one has to\njudge for oneself. (Sibley 2001, 107–108)\n\n\nThe “elsewhere” referred to in the first sentence is\nSibley’s earlier paper, “Aesthetic Concepts,” which\nargues that the application of concepts such as\n‘balanced,’ ‘tragic,’ ‘comic,’ or\n‘joyous’ is not a matter of determining whether the\ndescriptive (i.e., non-aesthetic) conditions for their application are\nmet, but is rather a matter of taste. Hence aesthetic judgments are\nimmediate in something like the way that judgments of color, or of\nflavor, are:\n\nWe see that a book is red by looking, just as we tell that the tea is\nsweet by tasting it. So too, it might be said, we just see (or fail to\nsee) that things are delicate, balanced, and the like. This kind of\ncomparison between the exercise of taste and the use of the five\nsenses is indeed familiar; our use of the word ‘taste’\nitself shows that the comparison is age-old and very natural (Sibley\n2001, 13–14).\n\n\nBut Sibley recognizes—as his eighteenth-century forebears did\nand his formalist contemporaries did not—that important\ndifferences remain between the exercise of taste and the use of the\nfive senses. Central among these is that we offer reasons, or\nsomething like them, in support of our aesthetic judgments: by\ntalking—in particular, by appealing to the descriptive\nproperties on which the aesthetic properties depend—we justify\naesthetic judgments by bringing others to see what we have seen\n(Sibley 2001, 14–19).\n\nIt is unclear to what degree Sibley, beyond seeking to establish that\nthe application of aesthetic concepts is not condition-governed, seeks\nalso to define the term ‘aesthetic’ in terms of their not\nbeing so. It is clearer, perhaps, that he does not succeed in defining\nthe term this way, whatever his intentions. Aesthetic concepts are not\nalone in being non-condition-governed, as Sibley himself recognizes in\ncomparing them with color concepts. But there is also no reason to\nthink them alone in being non-condition-governed while also being\nreason-supportable, since moral concepts, to give one example, at\nleast arguably also have both these features. Isolating the aesthetic\nrequires something more than immediacy, as Kant saw. It requires\nsomething like the Kantian notion of disinterest, or at least\nsomething to play the role played by that notion in Kant’s\ntheory.\n\nGiven the degree to which Kant and Hume continue to influence thinking\nabout aesthetic judgment (or critical judgment, more broadly), given\nthe degree to which Sibley and Isenberg continue to abet that\ninfluence, it is not surprising that the immediacy thesis is now very\nwidely received. The thesis, however, has come under attack, notably\nby Davies (1990) and Bender (1995). (See also Carroll (2009), who\nfollows closely after Davies (1990), and Dorsch (2013) for further\ndiscussion.)\n\nIsenberg, it will be recalled, maintains that if the critic is arguing\nfor her verdict, her argumentation must go something as follows:\n\nArtworks having p are better for having p.\nW is an artwork having p.\nTherefore, W is so much the better for having\np.\n\n\nSince the critical principle expressed in premise 1 is open to\ncounter-example, no matter what property we substitute for p, Isenberg\nconcludes that we cannot plausibly interpret the critic as arguing for\nher verdict. Rather than defend the principle expressed in premise 1,\nDavies and Bender both posit alternative principles, consistent with\nthe fact that no property is good-making in all artworks, which they\nascribe to the critic. Davies proposes that we interpret the critic as\narguing deductively from principles relativized to artistic type, that\nis, from principles holding that artworks of a specific types or\ncategories—Italian Renaissance paintings, romantic symphonies,\nHollywood Westerns, etc.—having p are better for having it\n(Davies 1990, 174). Bender proposes that we interpret the critic as\narguing inductively from principles expressing mere tendencies that\nhold between certain properties and artworks—principles, in\nother words, holding that artworks having p tend to be better for\nhaving it (Bender 1995, 386).\n\nEach proposal has its own weaknesses and strengths. A problem with\nBender’s approach is that critics do not seem to couch their\nverdicts in probabilistic terms. Were a critic to say that a work is\nlikely to be good, or almost certainly good, or even that she has the\nhighest confidence that it must be good, her language would suggest\nthat she had not herself experienced the work, perhaps that she had\njudged the work on the basis of someone else’s testimony, hence\nthat she is no critic at all. We would therefore have good reason to\nprefer Davies’s deductive approach if only we had good reason\nfor thinking that relativizing critical principles to artistic type\nremoved the original threat of counterexample. Though it is clear that\nsuch relativizing reduces the relative number of counterexamples, we\nneed good reason for thinking that it reduces that number to zero, and\nDavies provides no such reason. Bender’s inductive approach, by\ncontrast, cannot be refuted by counterexample, but only by\ncounter-tendency.\n\nIf the critic argues from the truth of a principle to the truth of a\nverdict—as Davies and Bender both contend—it must be\npossible for her to establish the truth of the principle before\nestablishing the truth of the verdict. How might she do this? It seems\nunlikely that mere reflection on the nature of art, or on the natures\nof types of art, could yield up the relevant lists of good- and\nbad-making properties. At least the literature has yet to produce a\npromising account as to how this might be done. Observation therefore\nseems the most promising answer. To say that the critic establishes\nthe truth of critical principles on the basis of observation, however,\nis to say that she establishes a correlation between certain artworks\nshe has already established to be good and certain properties she has\nalready established those works to have. But then any capacity to\nestablish that works are good by inference from principles evidently\ndepends on some capacity to establish that works are good without any\nsuch inference, and the question arises why the critic should prefer\nto do by inference what she can do perfectly well without. The answer\ncannot be that judging by inference from principle yields\nepistemically better results, since a principle based on observations\ncan be no more epistemically sound than the observations on which it\nis based.\n\nNone of this shows that aesthetic or critical judgment could never be\ninferred from principles. It does however suggest that such judgment\nis first and foremost non-inferential, which is what the immediacy\nthesis holds.\n",
    "section_title": "2.2 Aesthetic Judgment",
    "entry_title": "The Concept of the Aesthetic",
    "hierarchy_title": "The Concept of the Aesthetic || The Concept of the Aesthetic || Aesthetic Judgment",
    "tokenized_text": [
        "concept",
        "aesthetic",
        "aesthetic",
        "judgment",
        "aesthetic",
        "judgment",
        "eighteenthcentury",
        "debate",
        "rationalist",
        "theorist",
        "taste",
        "sentimentalist",
        "primarily",
        "debate",
        "immediacy",
        "thesis",
        "ie",
        "whether",
        "judge",
        "object",
        "beautiful",
        "applying",
        "principle",
        "beauty",
        "primarily",
        "debate",
        "existence",
        "principle",
        "beauty",
        "matter",
        "theorist",
        "taste",
        "might",
        "disagree",
        "kant",
        "denied",
        "principle",
        "kant",
        "hutcheson",
        "hume",
        "affirmed",
        "existence",
        "maintained",
        "although",
        "judgment",
        "beauty",
        "judgment",
        "taste",
        "reason",
        "taste",
        "nevertheless",
        "operates",
        "according",
        "general",
        "principle",
        "might",
        "discovered",
        "empirical",
        "investigation",
        "hutcheson",
        "hume",
        "tempting",
        "think",
        "recent",
        "debate",
        "aesthetic",
        "particularists",
        "generalist",
        "revival",
        "eighteenthcentury",
        "debate",
        "rationalist",
        "theorist",
        "taste",
        "accuracy",
        "thought",
        "difficult",
        "gauge",
        "one",
        "reason",
        "often",
        "unclear",
        "whether",
        "particularists",
        "generalist",
        "take",
        "merely",
        "debating",
        "existence",
        "aesthetic",
        "principle",
        "debating",
        "employment",
        "aesthetic",
        "judgment",
        "another",
        "degree",
        "particularists",
        "generalist",
        "take",
        "debating",
        "employment",
        "aesthetic",
        "principle",
        "aesthetic",
        "judgment",
        "hard",
        "know",
        "meaning",
        "aesthetic",
        "judgment",
        "aesthetic",
        "still",
        "carry",
        "eighteenthcentury",
        "implication",
        "immediacy",
        "question",
        "debate",
        "whether",
        "judgment",
        "immediate",
        "immediate",
        "aesthetic",
        "longer",
        "carry",
        "implication",
        "hard",
        "know",
        "question",
        "debate",
        "hard",
        "know",
        "aesthetic",
        "judgment",
        "could",
        "may",
        "tempting",
        "think",
        "simply",
        "redefine",
        "aesthetic",
        "judgment",
        "refers",
        "judgment",
        "aesthetic",
        "property",
        "predicated",
        "object",
        "requires",
        "able",
        "say",
        "aesthetic",
        "property",
        "without",
        "reference",
        "immediately",
        "graspable",
        "something",
        "one",
        "seems",
        "done",
        "may",
        "seem",
        "simply",
        "redefine",
        "aesthetic",
        "judgment",
        "refers",
        "judgment",
        "property",
        "class",
        "exemplified",
        "beauty",
        "predicated",
        "object",
        "class",
        "class",
        "exemplified",
        "beauty",
        "presumably",
        "endless",
        "difficulty",
        "specify",
        "relevant",
        "class",
        "without",
        "reference",
        "immediate",
        "graspability",
        "member",
        "one",
        "seems",
        "done",
        "however",
        "sort",
        "particularistgeneralist",
        "debate",
        "important",
        "contribution",
        "include",
        "side",
        "particularism",
        "arnold",
        "isenberg",
        "critical",
        "communication",
        "frank",
        "sibley",
        "aesthetic",
        "concept",
        "sibley",
        "mary",
        "mothersill",
        "beauty",
        "restored",
        "side",
        "generalism",
        "monroe",
        "beardsley",
        "aesthetic",
        "generality",
        "critical",
        "reason",
        "sibley",
        "general",
        "reason",
        "criterion",
        "aesthetic",
        "sibley",
        "george",
        "dickie",
        "evaluating",
        "art",
        "stephen",
        "davy",
        "reply",
        "argument",
        "suggesting",
        "critic",
        "strong",
        "evaluation",
        "could",
        "soundly",
        "deduced",
        "john",
        "bender",
        "general",
        "defeasible",
        "reason",
        "aesthetic",
        "evaluation",
        "generalistparticularist",
        "dispute",
        "paper",
        "isenberg",
        "sibley",
        "arguably",
        "enjoyed",
        "greatest",
        "influence",
        "isenberg",
        "concedes",
        "often",
        "appeal",
        "descriptive",
        "feature",
        "work",
        "support",
        "judgment",
        "value",
        "allows",
        "may",
        "make",
        "seem",
        "must",
        "appealing",
        "principle",
        "making",
        "judgment",
        "support",
        "favorable",
        "judgment",
        "painting",
        "critic",
        "appeal",
        "wavelike",
        "contour",
        "formed",
        "figure",
        "clustered",
        "foreground",
        "may",
        "seem",
        "judgment",
        "must",
        "involve",
        "tacit",
        "appeal",
        "principle",
        "painting",
        "contour",
        "much",
        "better",
        "isenberg",
        "argues",
        "since",
        "one",
        "agrees",
        "principle",
        "world",
        "criticism",
        "single",
        "purely",
        "descriptive",
        "statement",
        "concerning",
        "one",
        "prepared",
        "say",
        "beforehand",
        "true",
        "shall",
        "like",
        "work",
        "much",
        "better",
        "isenberg",
        "appealing",
        "descriptive",
        "feature",
        "work",
        "acknowledging",
        "tacit",
        "appeal",
        "principle",
        "linking",
        "feature",
        "aesthetic",
        "value",
        "isenberg",
        "belief",
        "offering",
        "direction",
        "perceiving",
        "work",
        "ie",
        "singling",
        "certain",
        "feature",
        "narrow",
        "ing",
        "field",
        "possible",
        "visual",
        "orientation",
        "thereby",
        "guiding",
        "others",
        "discrimination",
        "detail",
        "organization",
        "part",
        "grouping",
        "discrete",
        "object",
        "pattern",
        "isenberg",
        "way",
        "get",
        "others",
        "see",
        "seen",
        "rather",
        "getting",
        "infer",
        "inferred",
        "sibley",
        "advance",
        "variety",
        "particularism",
        "one",
        "paper",
        "variety",
        "generalism",
        "another",
        "give",
        "appearance",
        "inconsistency",
        "none",
        "sibley",
        "particularist",
        "one",
        "sort",
        "respect",
        "one",
        "distinction",
        "generalist",
        "another",
        "sort",
        "respect",
        "another",
        "distinction",
        "isenberg",
        "noted",
        "particularist",
        "respect",
        "distinction",
        "description",
        "verdict",
        "ie",
        "maintains",
        "principle",
        "may",
        "infer",
        "valueneutral",
        "description",
        "work",
        "judgment",
        "overall",
        "value",
        "sibley",
        "particularism",
        "generalism",
        "contrast",
        "judgment",
        "falling",
        "description",
        "verdict",
        "respect",
        "distinction",
        "description",
        "set",
        "judgment",
        "intermediate",
        "description",
        "verdict",
        "sibley",
        "straightforwardly",
        "particularist",
        "respect",
        "distinction",
        "set",
        "judgment",
        "intermediate",
        "description",
        "verdict",
        "verdict",
        "sibley",
        "kind",
        "generalist",
        "describes",
        "sibley",
        "generalism",
        "set",
        "forth",
        "general",
        "reason",
        "criterion",
        "aesthetic",
        "begin",
        "observation",
        "property",
        "appeal",
        "justification",
        "favorable",
        "verdict",
        "descriptive",
        "valueneutral",
        "also",
        "appeal",
        "property",
        "inherently",
        "positive",
        "grace",
        "balance",
        "dramatic",
        "intensity",
        "comicality",
        "say",
        "property",
        "inherently",
        "positive",
        "say",
        "work",
        "much",
        "better",
        "rather",
        "tout",
        "court",
        "attribution",
        "implies",
        "value",
        "although",
        "work",
        "may",
        "made",
        "worse",
        "account",
        "comical",
        "element",
        "simple",
        "claim",
        "work",
        "good",
        "comical",
        "intelligible",
        "way",
        "simple",
        "claim",
        "work",
        "good",
        "yellow",
        "last",
        "twelve",
        "minute",
        "contains",
        "many",
        "pun",
        "simple",
        "claim",
        "work",
        "good",
        "comical",
        "thus",
        "intelligible",
        "comicality",
        "general",
        "criterion",
        "aesthetic",
        "value",
        "principle",
        "articulates",
        "generality",
        "true",
        "none",
        "cast",
        "doubt",
        "immediacy",
        "thesis",
        "sibley",
        "observes",
        "argued",
        "elsewhere",
        "surefire",
        "rule",
        "referring",
        "neutral",
        "nonaesthetic",
        "quality",
        "thing",
        "one",
        "infer",
        "something",
        "balanced",
        "tragic",
        "comic",
        "joyous",
        "one",
        "look",
        "see",
        "equally",
        "different",
        "level",
        "saying",
        "surefire",
        "mechanical",
        "rule",
        "procedure",
        "deciding",
        "quality",
        "actual",
        "defect",
        "work",
        "one",
        "judge",
        "oneself",
        "sibley",
        "elsewhere",
        "referred",
        "first",
        "sentence",
        "sibley",
        "earlier",
        "paper",
        "aesthetic",
        "concept",
        "argues",
        "application",
        "concept",
        "balanced",
        "tragic",
        "comic",
        "joyous",
        "matter",
        "determining",
        "whether",
        "descriptive",
        "ie",
        "nonaesthetic",
        "condition",
        "application",
        "met",
        "rather",
        "matter",
        "taste",
        "hence",
        "aesthetic",
        "judgment",
        "immediate",
        "something",
        "like",
        "way",
        "judgment",
        "color",
        "flavor",
        "see",
        "book",
        "red",
        "looking",
        "tell",
        "tea",
        "sweet",
        "tasting",
        "might",
        "said",
        "see",
        "fail",
        "see",
        "thing",
        "delicate",
        "balanced",
        "like",
        "kind",
        "comparison",
        "exercise",
        "taste",
        "use",
        "five",
        "sens",
        "indeed",
        "familiar",
        "use",
        "word",
        "taste",
        "show",
        "comparison",
        "ageold",
        "natural",
        "sibley",
        "sibley",
        "recognizesas",
        "eighteenthcentury",
        "forebear",
        "formalist",
        "contemporary",
        "notthat",
        "important",
        "difference",
        "remain",
        "exercise",
        "taste",
        "use",
        "five",
        "sens",
        "central",
        "among",
        "offer",
        "reason",
        "something",
        "like",
        "support",
        "aesthetic",
        "judgment",
        "talkingin",
        "particular",
        "appealing",
        "descriptive",
        "property",
        "aesthetic",
        "property",
        "dependwe",
        "justify",
        "aesthetic",
        "judgment",
        "bringing",
        "others",
        "see",
        "seen",
        "sibley",
        "unclear",
        "degree",
        "sibley",
        "beyond",
        "seeking",
        "establish",
        "application",
        "aesthetic",
        "concept",
        "conditiongoverned",
        "seek",
        "also",
        "define",
        "term",
        "aesthetic",
        "term",
        "clearer",
        "perhaps",
        "succeed",
        "defining",
        "term",
        "way",
        "whatever",
        "intention",
        "aesthetic",
        "concept",
        "alone",
        "nonconditiongoverned",
        "sibley",
        "recognizes",
        "comparing",
        "color",
        "concept",
        "also",
        "reason",
        "think",
        "alone",
        "nonconditiongoverned",
        "also",
        "reasonsupportable",
        "since",
        "moral",
        "concept",
        "give",
        "one",
        "example",
        "least",
        "arguably",
        "also",
        "feature",
        "isolating",
        "aesthetic",
        "requires",
        "something",
        "immediacy",
        "kant",
        "saw",
        "requires",
        "something",
        "like",
        "kantian",
        "notion",
        "disinterest",
        "least",
        "something",
        "play",
        "role",
        "played",
        "notion",
        "kant",
        "theory",
        "given",
        "degree",
        "kant",
        "hume",
        "continue",
        "influence",
        "thinking",
        "aesthetic",
        "judgment",
        "critical",
        "judgment",
        "broadly",
        "given",
        "degree",
        "sibley",
        "isenberg",
        "continue",
        "abet",
        "influence",
        "surprising",
        "immediacy",
        "thesis",
        "widely",
        "received",
        "thesis",
        "however",
        "come",
        "attack",
        "notably",
        "davy",
        "bender",
        "see",
        "also",
        "carroll",
        "follows",
        "closely",
        "davy",
        "dorsch",
        "discussion",
        "isenberg",
        "recalled",
        "maintains",
        "critic",
        "arguing",
        "verdict",
        "argumentation",
        "must",
        "go",
        "something",
        "follows",
        "artwork",
        "p",
        "better",
        "p",
        "w",
        "artwork",
        "p",
        "therefore",
        "w",
        "much",
        "better",
        "p",
        "since",
        "critical",
        "principle",
        "expressed",
        "premise",
        "open",
        "counterexample",
        "matter",
        "property",
        "substitute",
        "p",
        "isenberg",
        "concludes",
        "plausibly",
        "interpret",
        "critic",
        "arguing",
        "verdict",
        "rather",
        "defend",
        "principle",
        "expressed",
        "premise",
        "davy",
        "bender",
        "posit",
        "alternative",
        "principle",
        "consistent",
        "fact",
        "property",
        "goodmaking",
        "artwork",
        "ascribe",
        "critic",
        "davy",
        "proposes",
        "interpret",
        "critic",
        "arguing",
        "deductively",
        "principle",
        "relativized",
        "artistic",
        "type",
        "principle",
        "holding",
        "artwork",
        "specific",
        "type",
        "categoriesitalian",
        "renaissance",
        "painting",
        "romantic",
        "symphony",
        "hollywood",
        "western",
        "etchaving",
        "p",
        "better",
        "davy",
        "bender",
        "proposes",
        "interpret",
        "critic",
        "arguing",
        "inductively",
        "principle",
        "expressing",
        "mere",
        "tendency",
        "hold",
        "certain",
        "property",
        "artworksprinciples",
        "word",
        "holding",
        "artwork",
        "p",
        "tend",
        "better",
        "bender",
        "proposal",
        "weakness",
        "strength",
        "problem",
        "bender",
        "approach",
        "critic",
        "seem",
        "couch",
        "verdict",
        "probabilistic",
        "term",
        "critic",
        "say",
        "work",
        "likely",
        "good",
        "almost",
        "certainly",
        "good",
        "even",
        "highest",
        "confidence",
        "must",
        "good",
        "language",
        "would",
        "suggest",
        "experienced",
        "work",
        "perhaps",
        "judged",
        "work",
        "basis",
        "someone",
        "else",
        "testimony",
        "hence",
        "critic",
        "would",
        "therefore",
        "good",
        "reason",
        "prefer",
        "davy",
        "deductive",
        "approach",
        "good",
        "reason",
        "thinking",
        "relativizing",
        "critical",
        "principle",
        "artistic",
        "type",
        "removed",
        "original",
        "threat",
        "counterexample",
        "though",
        "clear",
        "relativizing",
        "reduces",
        "relative",
        "number",
        "counterexample",
        "need",
        "good",
        "reason",
        "thinking",
        "reduces",
        "number",
        "zero",
        "davy",
        "provides",
        "reason",
        "bender",
        "inductive",
        "approach",
        "contrast",
        "refuted",
        "counterexample",
        "countertendency",
        "critic",
        "argues",
        "truth",
        "principle",
        "truth",
        "verdictas",
        "davy",
        "bender",
        "contendit",
        "must",
        "possible",
        "establish",
        "truth",
        "principle",
        "establishing",
        "truth",
        "verdict",
        "might",
        "seems",
        "unlikely",
        "mere",
        "reflection",
        "nature",
        "art",
        "nature",
        "type",
        "art",
        "could",
        "yield",
        "relevant",
        "list",
        "good",
        "badmaking",
        "property",
        "least",
        "literature",
        "yet",
        "produce",
        "promising",
        "account",
        "might",
        "done",
        "observation",
        "therefore",
        "seems",
        "promising",
        "answer",
        "say",
        "critic",
        "establishes",
        "truth",
        "critical",
        "principle",
        "basis",
        "observation",
        "however",
        "say",
        "establishes",
        "correlation",
        "certain",
        "artwork",
        "already",
        "established",
        "good",
        "certain",
        "property",
        "already",
        "established",
        "work",
        "capacity",
        "establish",
        "work",
        "good",
        "inference",
        "principle",
        "evidently",
        "depends",
        "capacity",
        "establish",
        "work",
        "good",
        "without",
        "inference",
        "question",
        "arises",
        "critic",
        "prefer",
        "inference",
        "perfectly",
        "well",
        "without",
        "answer",
        "judging",
        "inference",
        "principle",
        "yield",
        "epistemically",
        "better",
        "result",
        "since",
        "principle",
        "based",
        "observation",
        "epistemically",
        "sound",
        "observation",
        "based",
        "none",
        "show",
        "aesthetic",
        "critical",
        "judgment",
        "could",
        "never",
        "inferred",
        "principle",
        "however",
        "suggest",
        "judgment",
        "first",
        "foremost",
        "noninferential",
        "immediacy",
        "thesis",
        "hold"
    ]
}