{
    "main_text": "Mental aspects of aesthetic experience || Disinterest\n2.5 Disinterest\n\nThe idea that aesthetic experience must be in some way\n“disinterested”—roughly speaking, unconcerned with\nthe way its object could serve further practical purposes—is\ncentral in discussion of aesthetic experience. It is used to\ndistinguish aesthetic experience from close counterpart experiences of\nthe same object, and is thought to capture something essential about\nthe nature of the aesthetic. But philosophers can mean quite different\nthings by “disinterested” (for a brief history, see\nStolnitz 1961).\n\nAnthony Ashley Cooper, the Third Earl of Shaftesbury, is often cited\n(e.g. by Guyer 2004) as the originator of the modern idea of\ndisinterest. However, John Haldane (2013) persuasively traces the idea\nright back to Johannes Scotus Erigena, who wrote in his De\ndivisione naturae that “The sense of sight is abused by\nthose who approach the beauty of visible forms with appetite or\ndesire” (Haldane 2013, p. 30; Erigena, De divisione\nnaturae, IV–V). Some find an ancient ancestor of the idea\nin Aristotle’s ethical writings (see entry on\n“Aristotle’s Aesthetics”).\n\nNonetheless, Shaftesbury (1711) did write of disinterest, and\nillustrated the idea by considering two approaches to a coin: one\naesthetic, which delights just in mere contemplation of its form, and\nthe other practical, which considers what it might purchase. Hutcheson\n(1726 [2004]) followed Shaftesbury in claiming that the pleasure we\ntake in the beautiful is “distinct from that joy which arises\nfrom self-love upon prospect of advantage,” and from any\nprospect of gaining knowledge (in Cahn and Meskin 2007). Hume\n(1739–40 [1987]) is a rare exception amongst eighteenth century\nBritish philosophers in allowing “that a great part of …\nbeauty … is deriv’d from the idea of convenience and\nutility” (2.1.8.2; cf. Santayana 1896, Zemach 1997).\n\nEarly eighteenth century German philosophy of pleasure in perception\nexplicitly classified it as pleasure taken in the perfection of\nsomething perfectly suited to its function (Wolff 1719 [2003]; see\nSection 1.1. above). Moses Mendelssohn (1785 [1979]) retained the\ncentrality of perfection to aesthetic experience, but he also claimed\nthat\n\nWe contemplate the beauty of nature and of art, without the least\narousal of desire, with gratification and satisfaction. It seems to be\na particular mark of beauty that … it pleases, even if we do\nnot possess it, and that is remote from the urge to possess it.\n(Lesson VII, p. 70, translated in Guyer 2020, section on Mendelssohn)\n\n\nIn an essay dedicated to Mendelssohn (“Attempt at a Unification\nof all the Fine Arts and Sciences under the Concept of that which\nis complete in itself” 1785 [1993]), the later aesthetician\nKarl Moritz extended this idea of disinterest to argue that experience\nof the beautiful offers you a way of pleasantly forgetting yourself in\n“unselfish gratification” by thinking of the beautiful\nobject “as something that has been brought forth entirely for\nits own sake, so that it could be something complete in itself”\n(trans. Guyer, p. 545).\n\nIt was Kant’s conception in the Critique of Judgment\n(1789) that cemented the place of disinterestedness in aesthetics, and\nshaped the discourse for the centuries to come. When Kant claimed that\npleasure taken in a representation of a beautiful object (as such) is\n“disinterested,” he meant that this pleasure is\n“indifferent … to the real existence of the object of\nthis representation” (§1–5). In his system, this is\ntantamount to saying that this pleasure is unmediated by any desire\nfor the object (cf. Zangwill 1992). This disinterest\ndistinguishes the pleasure that grounds a judgment of the beautiful\nfrom the pleasure that grounds a judgment of something as merely\n“agreeable.” Under a separate heading (not that of\n“disinterest” per se), Kant added that pleasure in a\nbeautiful object is not based in any attribution of a specific purpose\nto it. He thus distanced himself from predecessors like Wolff.\n\nOne way of interpreting a lack of concern with the “real\nexistence” of the object of an aesthetic experience is to\nunderstand that experience as focused on appearances instead. Edward\nBullough (1957) espoused a version of this view in 1907 lectures at\nCambridge. The idea had a wave of popularity in the\nmid-20th century (Gotshalk 1947, Urmson 1957, Tomas 1959).\nThe view survives in the influential contemporary work of Martin Seel\n(2005, p. 24): “to perceive something in the process of its\nappearing for the sake of its appearing is the focal point of\naesthetic perception, the point at which every exercise of this\nperception is directed.”\n\nA variation of this approach casts aesthetic experience as that which\nis valued or enjoyed “for its own sake,” as opposed to\nvaluing or enjoying it as a means to some further end (cf. Gorodeisky\nand Marcus 2018 on “self-containment,” p. 118). Gary\nIseminger (2006) denies that any aesthetic experience can be\nindividuated purely in terms of how it feels, since what really makes\na state of valued experience aesthetic is a matter of its being valued\njust for its own sake, and valuing is not just a matter of having a\ncertain feeling. In revision of his earlier (1996a, 1996b) account of\naesthetic experience, Jerrold Levinson (2016b) agrees with\nIseminger’s view, except he claims that the evaluative component\nof such appreciation must itself be phenomenological (p.39; cf.\nStecker 2005). Both Iseminger and Levinson treat disinterest in this\nsense as part of what makes aesthetic experience (or appreciation)\naesthetic at all (for objections, see Goodman 1968 [1976] p. 242,\nMeskin 2001, and Carroll 2006).\n\nSome of these views that take aesthetic experience to be valued\n“for its own sake” depart significantly from the Kantian\nconception of disinterest. For instance, Roger Scruton’s (1974)\nconception of the imaginatively inflected perception (e.g.\n“seeing-as”) essential to aesthetic experience can be\nbased on a desire for an object “for no other reason,\nwhere one’s desire is, nonetheless, based on a conception of the\nthing one wants” (p.147).\n\nAnother dominant conception of disinterest in the 20th\ncentury was a conception of a certain “aesthetic attitude”\none can take voluntary with respect to a natural scene or an\nartwork—an attitude which consists in detaching one’s\npractical self from what is perceived in that object. As Zangwill\n(1992) notes, this notion of disinterest is “unKantian” in\nits modification of a stance, attitude, or type of attention,\nrather than pleasure, as disinterested.\n\nIn discussion of sublime natural phenomena, Edward Bullough (1912)\nseems to have been the first to suggest that we can voluntarily put\nour experience “out of gear with our practical, actual\nself” as long as we have a certain amount of\n“distance” from the threatening aspects of these natural\nphenomena (in Cahn and Meskin, 2007, pp. 244). What is important in\nthe form of an object of such aesthetic attention is that it supports\na “marked degree of artificiality” that allows us to take\nthis stance on the object (p.249). This artificiality keeps us engaged\nin a “personal” but “filtered” way with the\nemotions of the object of our experience (p.245).\n\nThe idea that a certain “distance” can make it possible to\nforget the particularities of one’s own practical situation and\nthereby allow fuller “participation” in an object of\naesthetic experience has been attractive to theorists in various\ndistinct research paradigms. Hans-Georg Gadamer (1960 [2005])\nemphasized how “aesthetic distance in a true sense …\nmakes possible a genuine and comprehensive participation in what is\npresented before us” via “self-forgetfulness” (pp.\n124–5). John Dewey (1934 [2007]) wrote that in\n‘esthetic’ experience\n\nThere is no severance of self, no holding of it aloof, but fulness of\nparticipation … so thoroughgoing … that the work of art\nis detached or cut off from the kind of specialized desire that\noperates when we are moved to consume or appropriate a thing\nphysically. (p.262; cf. Beardsley 1958 [1981], pp. 288–291)\n\n\nThis conception of disinterest takes it to be not just compatible with\nbut also supportive of a specialized activity\n(“participation”), and even sometimes takes it to be a\nproduct of a personal decision to engage in a certain kind of way with\nan object of experience.\n\nIn the middle of the 20th century, George Dickie levied a\nfamous objection to this interpretation of disinterest in his paper\n“The Myth of the Aesthetic Attitude” (1964). He wrote:\n\n“disinterestedness” cannot properly be used to refer to a\nspecial kind of attention … [it] is a term which is used to\nmake clear that an action has certain kinds of motives …\nAttending to an object, of course, has its motives but the attending\nitself is not interested or disinterested … although the\nattending may be more or less close. (p.60)\n\n\nProposed cases of wrongly motivated attention, he suggests, are really\njust cases of (degrees of) inattention. Levinson (2016b) disagrees,\narguing that attending is indeed something that you can do with a\nmotive, and that the motive you have in attending affects your\nphenomenology. Nanay (2015) picks up this general point and proposes\nthat specifically aesthetic attention is distributed among\nall the properties of an object (though see Nanay 2016 for\ncomplexities).\n\nLanger’s (1953/2007) distinct objection is that the\n“aesthetic attitude” is too demanding to be an essential\npart of any aesthetic experience whatsoever: “If the groundwork\nof all genuine art experience is really such a sophisticated, rare,\nand artificial attitude, it is something of a miracle that the world\nrecognizes works of art as public treasures at all” (p.324).\n\nThese are objections to the interpretation of disinterest in terms of\na special attitude or attentive stance one can take on an object. They\nare not, as such, objections more generally to the claim that\ndisinterest is an essential or even just a necessary aspect of\naesthetic experience. That latter claim is still widely popular. But\nthere are a few reasonable ways to resist it.\n\nOne concerns the deep personal importance of aesthetic experience.\nNick Riggle (2016) argues that our phenomenal appreciation of beauty\nmust be interested in at least a certain sense in order for it to be\nable to effect the types of personal transformation that it does (cf.\nProust 1913–1927 [2003], Nehamas 2007). Another way to resist\nthe emphasis on disinterest is to note the great variety of aesthetic\nexperiences available to us, especially with the staggering diversity\nof contemporary arts (Adorno 1970 [1997], pp. 10–11).\n",
    "section_title": "2.5 Disinterest",
    "entry_title": "Aesthetic Experience",
    "hierarchy_title": "Aesthetic Experience || Mental aspects of aesthetic experience || Disinterest",
    "tokenized_text": [
        "mental",
        "aspect",
        "aesthetic",
        "experience",
        "disinterest",
        "disinterest",
        "idea",
        "aesthetic",
        "experience",
        "must",
        "way",
        "disinterested",
        "roughly",
        "speaking",
        "unconcerned",
        "way",
        "object",
        "could",
        "serve",
        "practical",
        "purposesis",
        "central",
        "discussion",
        "aesthetic",
        "experience",
        "used",
        "distinguish",
        "aesthetic",
        "experience",
        "close",
        "counterpart",
        "experience",
        "object",
        "thought",
        "capture",
        "something",
        "essential",
        "nature",
        "aesthetic",
        "philosopher",
        "mean",
        "quite",
        "different",
        "thing",
        "disinterested",
        "brief",
        "history",
        "see",
        "stolnitz",
        "anthony",
        "ashley",
        "cooper",
        "third",
        "earl",
        "shaftesbury",
        "often",
        "cited",
        "eg",
        "guyer",
        "originator",
        "modern",
        "idea",
        "disinterest",
        "however",
        "john",
        "haldane",
        "persuasively",
        "trace",
        "idea",
        "right",
        "back",
        "johannes",
        "scotus",
        "erigena",
        "wrote",
        "de",
        "divisione",
        "naturae",
        "sense",
        "sight",
        "abused",
        "approach",
        "beauty",
        "visible",
        "form",
        "appetite",
        "desire",
        "haldane",
        "p",
        "erigena",
        "de",
        "divisione",
        "naturae",
        "ivv",
        "find",
        "ancient",
        "ancestor",
        "idea",
        "aristotle",
        "ethical",
        "writing",
        "see",
        "entry",
        "aristotle",
        "aesthetic",
        "nonetheless",
        "shaftesbury",
        "write",
        "disinterest",
        "illustrated",
        "idea",
        "considering",
        "two",
        "approach",
        "coin",
        "one",
        "aesthetic",
        "delight",
        "mere",
        "contemplation",
        "form",
        "practical",
        "considers",
        "might",
        "purchase",
        "hutcheson",
        "followed",
        "shaftesbury",
        "claiming",
        "pleasure",
        "take",
        "beautiful",
        "distinct",
        "joy",
        "arises",
        "selflove",
        "upon",
        "prospect",
        "advantage",
        "prospect",
        "gaining",
        "knowledge",
        "cahn",
        "meskin",
        "hume",
        "rare",
        "exception",
        "amongst",
        "eighteenth",
        "century",
        "british",
        "philosopher",
        "allowing",
        "great",
        "part",
        "beauty",
        "deriv",
        "idea",
        "convenience",
        "utility",
        "cf",
        "santayana",
        "zemach",
        "early",
        "eighteenth",
        "century",
        "german",
        "philosophy",
        "pleasure",
        "perception",
        "explicitly",
        "classified",
        "pleasure",
        "taken",
        "perfection",
        "something",
        "perfectly",
        "suited",
        "function",
        "wolff",
        "see",
        "section",
        "moses",
        "mendelssohn",
        "retained",
        "centrality",
        "perfection",
        "aesthetic",
        "experience",
        "also",
        "claimed",
        "contemplate",
        "beauty",
        "nature",
        "art",
        "without",
        "least",
        "arousal",
        "desire",
        "gratification",
        "satisfaction",
        "seems",
        "particular",
        "mark",
        "beauty",
        "plea",
        "even",
        "posse",
        "remote",
        "urge",
        "posse",
        "lesson",
        "vii",
        "p",
        "translated",
        "guyer",
        "section",
        "mendelssohn",
        "essay",
        "dedicated",
        "mendelssohn",
        "attempt",
        "unification",
        "fine",
        "art",
        "science",
        "concept",
        "complete",
        "later",
        "aesthetician",
        "karl",
        "moritz",
        "extended",
        "idea",
        "disinterest",
        "argue",
        "experience",
        "beautiful",
        "offer",
        "way",
        "pleasantly",
        "forgetting",
        "unselfish",
        "gratification",
        "thinking",
        "beautiful",
        "object",
        "something",
        "brought",
        "forth",
        "entirely",
        "sake",
        "could",
        "something",
        "complete",
        "trans",
        "guyer",
        "p",
        "kant",
        "conception",
        "critique",
        "judgment",
        "cemented",
        "place",
        "disinterestedness",
        "aesthetic",
        "shaped",
        "discourse",
        "century",
        "come",
        "kant",
        "claimed",
        "pleasure",
        "taken",
        "representation",
        "beautiful",
        "object",
        "disinterested",
        "meant",
        "pleasure",
        "indifferent",
        "real",
        "existence",
        "object",
        "representation",
        "system",
        "tantamount",
        "saying",
        "pleasure",
        "unmediated",
        "desire",
        "object",
        "cf",
        "zangwill",
        "disinterest",
        "distinguishes",
        "pleasure",
        "ground",
        "judgment",
        "beautiful",
        "pleasure",
        "ground",
        "judgment",
        "something",
        "merely",
        "agreeable",
        "separate",
        "heading",
        "disinterest",
        "per",
        "se",
        "kant",
        "added",
        "pleasure",
        "beautiful",
        "object",
        "based",
        "attribution",
        "specific",
        "purpose",
        "thus",
        "distanced",
        "predecessor",
        "like",
        "wolff",
        "one",
        "way",
        "interpreting",
        "lack",
        "concern",
        "real",
        "existence",
        "object",
        "aesthetic",
        "experience",
        "understand",
        "experience",
        "focused",
        "appearance",
        "instead",
        "edward",
        "bullough",
        "espoused",
        "version",
        "view",
        "lecture",
        "cambridge",
        "idea",
        "wave",
        "popularity",
        "midth",
        "century",
        "gotshalk",
        "urmson",
        "tomas",
        "view",
        "survives",
        "influential",
        "contemporary",
        "work",
        "martin",
        "seel",
        "p",
        "perceive",
        "something",
        "process",
        "appearing",
        "sake",
        "appearing",
        "focal",
        "point",
        "aesthetic",
        "perception",
        "point",
        "every",
        "exercise",
        "perception",
        "directed",
        "variation",
        "approach",
        "cast",
        "aesthetic",
        "experience",
        "valued",
        "enjoyed",
        "sake",
        "opposed",
        "valuing",
        "enjoying",
        "mean",
        "end",
        "cf",
        "gorodeisky",
        "marcus",
        "selfcontainment",
        "p",
        "gary",
        "iseminger",
        "denies",
        "aesthetic",
        "experience",
        "individuated",
        "purely",
        "term",
        "feel",
        "since",
        "really",
        "make",
        "state",
        "valued",
        "experience",
        "aesthetic",
        "matter",
        "valued",
        "sake",
        "valuing",
        "matter",
        "certain",
        "feeling",
        "revision",
        "earlier",
        "a",
        "b",
        "account",
        "aesthetic",
        "experience",
        "jerrold",
        "levinson",
        "b",
        "agrees",
        "iseminger",
        "view",
        "except",
        "claim",
        "evaluative",
        "component",
        "appreciation",
        "must",
        "phenomenological",
        "p",
        "cf",
        "stecker",
        "iseminger",
        "levinson",
        "treat",
        "disinterest",
        "sense",
        "part",
        "make",
        "aesthetic",
        "experience",
        "appreciation",
        "aesthetic",
        "objection",
        "see",
        "goodman",
        "p",
        "meskin",
        "carroll",
        "view",
        "take",
        "aesthetic",
        "experience",
        "valued",
        "sake",
        "depart",
        "significantly",
        "kantian",
        "conception",
        "disinterest",
        "instance",
        "roger",
        "scruton",
        "conception",
        "imaginatively",
        "inflected",
        "perception",
        "eg",
        "seeingas",
        "essential",
        "aesthetic",
        "experience",
        "based",
        "desire",
        "object",
        "reason",
        "one",
        "desire",
        "nonetheless",
        "based",
        "conception",
        "thing",
        "one",
        "want",
        "p",
        "another",
        "dominant",
        "conception",
        "disinterest",
        "th",
        "century",
        "conception",
        "certain",
        "aesthetic",
        "attitude",
        "one",
        "take",
        "voluntary",
        "respect",
        "natural",
        "scene",
        "artworkan",
        "attitude",
        "consists",
        "detaching",
        "one",
        "practical",
        "self",
        "perceived",
        "object",
        "zangwill",
        "note",
        "notion",
        "disinterest",
        "unkantian",
        "modification",
        "stance",
        "attitude",
        "type",
        "attention",
        "rather",
        "pleasure",
        "disinterested",
        "discussion",
        "sublime",
        "natural",
        "phenomenon",
        "edward",
        "bullough",
        "seems",
        "first",
        "suggest",
        "voluntarily",
        "put",
        "experience",
        "gear",
        "practical",
        "actual",
        "self",
        "long",
        "certain",
        "amount",
        "distance",
        "threatening",
        "aspect",
        "natural",
        "phenomenon",
        "cahn",
        "meskin",
        "pp",
        "important",
        "form",
        "object",
        "aesthetic",
        "attention",
        "support",
        "marked",
        "degree",
        "artificiality",
        "allows",
        "u",
        "take",
        "stance",
        "object",
        "p",
        "artificiality",
        "keep",
        "u",
        "engaged",
        "personal",
        "filtered",
        "way",
        "emotion",
        "object",
        "experience",
        "p",
        "idea",
        "certain",
        "distance",
        "make",
        "possible",
        "forget",
        "particularity",
        "one",
        "practical",
        "situation",
        "thereby",
        "allow",
        "fuller",
        "participation",
        "object",
        "aesthetic",
        "experience",
        "attractive",
        "theorist",
        "various",
        "distinct",
        "research",
        "paradigm",
        "hansgeorg",
        "gadamer",
        "emphasized",
        "aesthetic",
        "distance",
        "true",
        "sense",
        "make",
        "possible",
        "genuine",
        "comprehensive",
        "participation",
        "presented",
        "u",
        "via",
        "selfforgetfulness",
        "pp",
        "john",
        "dewey",
        "wrote",
        "esthetic",
        "experience",
        "severance",
        "self",
        "holding",
        "aloof",
        "fulness",
        "participation",
        "thoroughgoing",
        "work",
        "art",
        "detached",
        "cut",
        "kind",
        "specialized",
        "desire",
        "operates",
        "moved",
        "consume",
        "appropriate",
        "thing",
        "physically",
        "p",
        "cf",
        "beardsley",
        "pp",
        "conception",
        "disinterest",
        "take",
        "compatible",
        "also",
        "supportive",
        "specialized",
        "activity",
        "participation",
        "even",
        "sometimes",
        "take",
        "product",
        "personal",
        "decision",
        "engage",
        "certain",
        "kind",
        "way",
        "object",
        "experience",
        "middle",
        "th",
        "century",
        "george",
        "dickie",
        "levied",
        "famous",
        "objection",
        "interpretation",
        "disinterest",
        "paper",
        "myth",
        "aesthetic",
        "attitude",
        "wrote",
        "disinterestedness",
        "properly",
        "used",
        "refer",
        "special",
        "kind",
        "attention",
        "term",
        "used",
        "make",
        "clear",
        "action",
        "certain",
        "kind",
        "motif",
        "attending",
        "object",
        "course",
        "motif",
        "attending",
        "interested",
        "disinterested",
        "although",
        "attending",
        "may",
        "le",
        "close",
        "p",
        "proposed",
        "case",
        "wrongly",
        "motivated",
        "attention",
        "suggests",
        "really",
        "case",
        "degree",
        "inattention",
        "levinson",
        "b",
        "disagrees",
        "arguing",
        "attending",
        "indeed",
        "something",
        "motive",
        "motive",
        "attending",
        "affect",
        "phenomenology",
        "nanay",
        "pick",
        "general",
        "point",
        "proposes",
        "specifically",
        "aesthetic",
        "attention",
        "distributed",
        "among",
        "property",
        "object",
        "though",
        "see",
        "nanay",
        "complexity",
        "langer",
        "distinct",
        "objection",
        "aesthetic",
        "attitude",
        "demanding",
        "essential",
        "part",
        "aesthetic",
        "experience",
        "whatsoever",
        "groundwork",
        "genuine",
        "art",
        "experience",
        "really",
        "sophisticated",
        "rare",
        "artificial",
        "attitude",
        "something",
        "miracle",
        "world",
        "recognizes",
        "work",
        "art",
        "public",
        "treasure",
        "p",
        "objection",
        "interpretation",
        "disinterest",
        "term",
        "special",
        "attitude",
        "attentive",
        "stance",
        "one",
        "take",
        "object",
        "objection",
        "generally",
        "claim",
        "disinterest",
        "essential",
        "even",
        "necessary",
        "aspect",
        "aesthetic",
        "experience",
        "latter",
        "claim",
        "still",
        "widely",
        "popular",
        "reasonable",
        "way",
        "resist",
        "one",
        "concern",
        "deep",
        "personal",
        "importance",
        "aesthetic",
        "experience",
        "nick",
        "riggle",
        "argues",
        "phenomenal",
        "appreciation",
        "beauty",
        "must",
        "interested",
        "least",
        "certain",
        "sense",
        "order",
        "able",
        "effect",
        "type",
        "personal",
        "transformation",
        "cf",
        "proust",
        "nehamas",
        "another",
        "way",
        "resist",
        "emphasis",
        "disinterest",
        "note",
        "great",
        "variety",
        "aesthetic",
        "experience",
        "available",
        "u",
        "especially",
        "staggering",
        "diversity",
        "contemporary",
        "art",
        "adorno",
        "pp"
    ]
}