{
    "main_text": "Ethnophilosophy, Unanimity and African Critical Thought\n5. What counts as Sage Philosophy?\n\nAccording to Oruka, Sage Philosophy is “the expressed thoughts\nof wise men and women in any given community and is a way of thinking\nand explaining the world that fluctuates between popular wisdom (well\nknown communal maxims, aphorisms and general common sense truths) and\ndidactic wisdom, an expounded wisdom and a rational thought of some\ngiven individuals within a community” (Sage Philosophy,\np. 28). Oruka, however, had very definite ideas about who qualifies as\na philosophic sage and how such persons are to be distinguished from\nother sages. When asked whether or not philosophy advances knowledge,\nBarasa is quoted as saying: “Yes. Being a rational method of\ninquiry into the real nature of things, philosophy is a means to\nre-examine knowledge and belief” (Sage Philosophy, p.\n150). The tendency to express dissatisfaction with the status quo\nbelief system of their communities is an important critical component\nand a criterion Oruka used to identify sages as philosophical.\nDissatisfaction sometimes motivates the philosophic sage to advance\nthe knowledge that everyone has by subjecting it to scrutiny in order\nto determine its validity and worth. While philosophic sages may still\nshare with others some customary practices and beliefs, or aspects of\nthem, unlike other members of their community, they emphasize rational\nexplanations and justifications of courses of action. They owe greater\nloyalty to reason than to custom for its own sake. As a result, not\nonly are sages often a source of new knowledge, but they are also a\ncatalyst to change within their communities.\n\nIn the example cited above, Mbuya defines communalism in terms of a\nmorality that appeals to the welfare of others as a guide to action.\nHe indicates its goals, and limitations as a principle that aims at\nminimizing socio-economic disparity between the haves and the\nhave-nots. On Oruka’s view, not every member of society carries out\nthese kind of elaborations and conceptual clarifications of the\nprinciples that underlie what the majority live at the pragmatic level\nonly as custom. While he recognizes that there are other indigenous\nsages in African communities, he distinguishes these from philosophic\nsages such as Mbuya and Chaungo, who are committed to critical inquiry\nand to the rational grounding of values and beliefs. Other indigenous\nsages, who may be wise in some sense, but not critically oriented, act\nas repositories of the statements of the beliefs of their communities,\nwhich they have learned and can repeat, or teach, to others exactly as\nthey are supposed to be remembered.\n\nThis lattter group is exemplified by Ogotemmêli, a sage from the\nDogon community in present-day Mali. His teachings were transcribed\nand commented on by the French philosopher and ethnographer Marcel\nGriaule in the now classic text, Conversations with\nOgotemmêli: Introduction to Dogon Religious Ideas (Eng. tr.\n1965), one of the outstanding texts of indigenous African thought.\nOgotemmêli presents the commonly shared knowledge of the Dogon\ncommunity, including not only their very complex theories about the\norigin of the universe and the subsequent development of material and\nnon-material entities in it, but also a startling astronomical system\nthat points to the Dogon’s pre-telescopic knowledge of the Sirius (A\nand B) and their paths across the skies. Yet, despite this pioneer\nscientific and mathematical genius, at no time throughout the entire\npresentation does one encounter Ogotemmêli as a thinker, only as\nthe representative and narrator of the collective memory of his\ncommunity. His own voice is submerged into a communal mode of\nexpression. According to Oruka, the absence of any personal direct\nreflections on the issues at hand qualifies Ogotemmêli only as a\nfolk sage. A folk sage is a highly intelligent and good narrator of\ntraditionally imposed beliefs and myths. He, or she, may explain such\nbeliefs and values with great detail and may even expound on the\nrelation between the mythical representations and the lessons in and\nfor society that they are intended to illustrate. But while the folk\nsage hardly veers off the narrative, by contrast, a philosophic sage\nis a person “of traditional African culture, capable of the\ncritical, second-order type of thinking about the various problems of\nhuman life and nature; persons, that is, who subject beliefs that are\ntraditionally taken for granted to independent rational reexamination\nand who are inclined to accept or reject such beliefs on the authority\nof reason rather than on the basis of a communal or religious\nconsensus” (Sage Philosophy, pp. 5–6).\n\nThe onisegun, deliberately kept anonymous by Hallen and Sodipo for\nreasons of privacy, and who expound and elucidate the traditional\nthought of the Yoruba, are certainly wise and very knowledgeable\npeople. On Oruka’s criteria for philosophic sagacity, however, they\ntoo are only folk sages. They are like Ogotemmêli, whose\npresentation, however complex and amazing in details, is exactly what\nevery wise Dogon person is expected to know (Sage Philosophy,\npp. 9–10). Oruka distinguishes between folk and philosophic\nsages, in terms of those who pursue the rational grounding of beliefs\nand values, as opposed to those who merely narrate them as they appear\nin their commuity’s belief systems.\n\nW. V. O. Quine’s indeterminacy thesis of radical translation presents\na major difficulty for the explanations of the conceptual content and\nmeaning of terms in Yoruba language provided by the onisegun to Hallen\nand Sodipo. Quine attacked the concept of universal propositions and\nmeanings that are frequently assumed by translators to exist across\nall languages. This draws in question the practice of anthropologists\nstudying African belief systems. Following Quine, Hallen argues that\n“Given the cumulative effects of the indeterminacy of\ntranslation between radically different languagaes, an alternative\nexplanation for such inconsistencies could be that translators have\nrecourse to contradiction because they, perhaps unwittingly, have not\nbeen able to arrive at a determinate or precise translation”\n(A Short History of African Philosophy, pp. 37–8).\nFailing to find in non-Western modes of thought precise translations\nof comparable rational expressions in their own languages,\nanthropologists hastened to conclude that the problem must lie with\nthe non-Western modes of thought which appear to lack ways of\naccommodating rational expressions. Yet, Hallen and Sodipo’s own\nconversations with the Yoruba sages illustrate what happens when one\ntries to translate, among others, the English term “know”\ninto Yoruba. The outcome of their comparative analyses shows that our\nconceptual assumptions about reality are often tied to the natural\nlanguages we speak. To be fair, Hallen’s and Sodipo’s work is not a\nsimple description of what the onisegun said. Rather, they attempt to\ntease out what was intended conceptually in a language translated as\nfaithfully as possible into propositions which they contrast with\ncomparable ones in English. Nonetheless, Oruka maintained that any\nsuch use of Western philosophical language to analyze indigenous\nAfrican thought leads to the separation “between an insider in\ntraditional African philosophy and the outsider analyzing or\ndescribing this philosophy in a language of Western thought. Given\nthis, the two cannot really meaningfully express their thought to each\nother and it would be absurd to find that one can be an expert in the\nthought of the other” (Sage Philosophy, p. 15).\nConclusion\n\nIt is not entirely clear what Oruka believed ought to be the\nrelationship between the indigenous philosophic sage and his or her\nWestern-trained counterpart. What is clear from his remarks is that\nthe use of Western philosophers, like Quine or Wittgenstein, for\nexample, as tools for analyzing the conceptual content of African\nmodes of thought has allowed some scholars to champion “what\nthey term ‘African philosophy’ by using terminology given\nin ‘Western philosophy’. None, so far, has given an\naccount of what is to be treated as the language of African\nphilosophy” (Sage Philosophy, p. 15). On this point at\nleast, Oruka seems to position himself away from philosophers such as\nAppiah, Wiredu, and Gyekye. He understood the work of professional\nphilosophers to be distinct from that of the philosophic sages and\nexpressed the wish that they could remain so, as a way of preserving\ntraditions. This idea appears to be implied by his regret that\n“The tragedy for man is that the Western intellectual elite has,\nover the years, successfully imposed its own culture and philosophy\nover the masses. So, British philosophy, for example, is taken to be\nthe texts of Lockes, Humes, Bacons, Russels, etc.” (Sage\nPhilosophy, p. 16). Oruka’s concern with the preservation of\nindigenous thought suggests that he desired to keep the professional\nschool of philosophers separate from that of the philosophic sages to\nensure the preservation of the intellectual integrity, not only of the\nsages, but of the African heritage as a whole. He was concerned that\nthe language of African professional philosophers was too dependent on\nthe Western conceptual lexicon and that its unchecked imposition on\nindigenous conceptual schemes might finally contribute to the demise\nof the latter.\n\nAmong African philosophers, Kwasi Wiredu is particularly sympathetic\nto Oruka’s concerns. Writing on the need for conceptual decolonization\nin African philosophy, Wiredu claims that such a need would mean both\n“avoiding or reversing through a critical conceptual\nself-awareness the unexamined assimilation in our thought (that is, in\nthe thought of contemporary African philosophers) of the conceptual\nframeworks embedded in the foreign philosophical traditions that have\nhad impact on African life and thought…[and] exploiting as much\nas is judicious the resources of our own indigenous conceptual schemes\nin our philosophical meditations on even the most technical problems\nof contemporary philosophy” (Cultural Universals and\nParticulars, p. 136). At the same time, Wiredu agrees with other\nphilosophers like Appiah and Gyekye in insisting that while the\nbeliefs, proverbs, and customs of African cultures should be included\nin the philosophical reflections of the professional, such cultural\nelements of folk knowledge also must be subjected to critical analysis\nand evaluation because, “There is no pretense…that\nrecourse to the African vernacular must result in instantaneous\nphilosophic revelation” (Cultural Universals and\nParticulars, p. 138).\n\nOruka believed that professional African philosophers could interact\nwith their sagacious counterparts, provided there was sufficient room\nfor each to flourish separately. This idea suggests that he desired to\nexpand the location of legitimate philosophical activity beyond the\ninstitutional confines of the academy, which he considered to be\nintricately connected to the colonial legacy. It is in this regard\nthat the idea of African Sage philosophy has provided an important\nintervention in the development of contemporary African philosophy,\naddressing many crucial issues African philosophers continue to face\nin the wider context of postcolonial cultural inquiry, of which\nphilosophy is only a part. Gayatri Chakravorty Spivak in A\nCritique of Postcolonial Reason: Toward a History of a Vanishing\nPresent (1999) has suggested that the self-awareness stage in\npostcolonial theory is largely over and that the formerly colonized\ncultures are settling down to utilizing their respective cultural\nreservoirs without significant attention to the need to reclaim their\nindigenous voices, and without minimizing the need for a continued and\nsustained awareness of the ever-present Eurocentric impositions. This\norientation is displayed, for example, in Wiredu’s independent, but\ncomparative, analyses of Western and African concepts, whose\nwidely-debated epistemological position that “truth is nothing\nbut opinion,” hinges on the contrast between the objectivist\nimplications of the claim “I know that” in English and the\nnon-objectivist implications in the Akan language.\n\nAlong with Wiredu, Hallen and Sodipo also hold that very complex\nphilosophical views are already signaled by many sayings in African\nlanguages, and wait to be teased out through careful analysis and\ninterpretation. Although Oruka’s idea of the sages as philosophically\nsavvy in their own languages raises methodical questions as to whether\nsage philosophy is the property of the professional philosopher, or of\nthe indigenous wise person, and only teased out through the prompting\nof a professional philosopher, Hallen, Sodipo and Wiredu agree with\nhis insistence that the distinguishing marks of African philosophy\nemerge precisely out of analytical involvement by Western-trained\nphilosophers, who raise questions regarding the conceptual\nunderpinnings of indigenous beliefs, values, and languages, and\ncritically examine their meaning and implications. They propose, on\nthis basis, to accommodate both indigenous sages, and Western-trained\nprofessionals, as philosophers.\n",
    "section_title": "5. What counts as Sage Philosophy?",
    "entry_title": "African Sage Philosophy",
    "hierarchy_title": "African Sage Philosophy || Ethnophilosophy, Unanimity and African Critical Thought",
    "tokenized_text": [
        "ethnophilosophy",
        "unanimity",
        "african",
        "critical",
        "thought",
        "count",
        "sage",
        "philosophy",
        "according",
        "oruka",
        "sage",
        "philosophy",
        "expressed",
        "thought",
        "wise",
        "men",
        "woman",
        "given",
        "community",
        "way",
        "thinking",
        "explaining",
        "world",
        "fluctuates",
        "popular",
        "wisdom",
        "well",
        "known",
        "communal",
        "maxim",
        "aphorism",
        "general",
        "common",
        "sense",
        "truth",
        "didactic",
        "wisdom",
        "expounded",
        "wisdom",
        "rational",
        "thought",
        "given",
        "individual",
        "within",
        "community",
        "sage",
        "philosophy",
        "p",
        "oruka",
        "however",
        "definite",
        "idea",
        "qualifies",
        "philosophic",
        "sage",
        "person",
        "distinguished",
        "sage",
        "asked",
        "whether",
        "philosophy",
        "advance",
        "knowledge",
        "barasa",
        "quoted",
        "saying",
        "yes",
        "rational",
        "method",
        "inquiry",
        "real",
        "nature",
        "thing",
        "philosophy",
        "mean",
        "reexamine",
        "knowledge",
        "belief",
        "sage",
        "philosophy",
        "p",
        "tendency",
        "express",
        "dissatisfaction",
        "status",
        "quo",
        "belief",
        "system",
        "community",
        "important",
        "critical",
        "component",
        "criterion",
        "oruka",
        "used",
        "identify",
        "sage",
        "philosophical",
        "dissatisfaction",
        "sometimes",
        "motivates",
        "philosophic",
        "sage",
        "advance",
        "knowledge",
        "everyone",
        "subjecting",
        "scrutiny",
        "order",
        "determine",
        "validity",
        "worth",
        "philosophic",
        "sage",
        "may",
        "still",
        "share",
        "others",
        "customary",
        "practice",
        "belief",
        "aspect",
        "unlike",
        "member",
        "community",
        "emphasize",
        "rational",
        "explanation",
        "justification",
        "course",
        "action",
        "owe",
        "greater",
        "loyalty",
        "reason",
        "custom",
        "sake",
        "result",
        "sage",
        "often",
        "source",
        "new",
        "knowledge",
        "also",
        "catalyst",
        "change",
        "within",
        "community",
        "example",
        "cited",
        "mbuya",
        "defines",
        "communalism",
        "term",
        "morality",
        "appeal",
        "welfare",
        "others",
        "guide",
        "action",
        "indicates",
        "goal",
        "limitation",
        "principle",
        "aim",
        "minimizing",
        "socioeconomic",
        "disparity",
        "have",
        "havenot",
        "oruka",
        "view",
        "every",
        "member",
        "society",
        "carry",
        "kind",
        "elaboration",
        "conceptual",
        "clarification",
        "principle",
        "underlie",
        "majority",
        "live",
        "pragmatic",
        "level",
        "custom",
        "recognizes",
        "indigenous",
        "sage",
        "african",
        "community",
        "distinguishes",
        "philosophic",
        "sage",
        "mbuya",
        "chaungo",
        "committed",
        "critical",
        "inquiry",
        "rational",
        "grounding",
        "value",
        "belief",
        "indigenous",
        "sage",
        "may",
        "wise",
        "sense",
        "critically",
        "oriented",
        "act",
        "repository",
        "statement",
        "belief",
        "community",
        "learned",
        "repeat",
        "teach",
        "others",
        "exactly",
        "supposed",
        "remembered",
        "lattter",
        "group",
        "exemplified",
        "ogotemmêli",
        "sage",
        "dogon",
        "community",
        "presentday",
        "mali",
        "teaching",
        "transcribed",
        "commented",
        "french",
        "philosopher",
        "ethnographer",
        "marcel",
        "griaule",
        "classic",
        "text",
        "conversation",
        "ogotemmêli",
        "introduction",
        "dogon",
        "religious",
        "idea",
        "eng",
        "tr",
        "one",
        "outstanding",
        "text",
        "indigenous",
        "african",
        "thought",
        "ogotemmêli",
        "present",
        "commonly",
        "shared",
        "knowledge",
        "dogon",
        "community",
        "including",
        "complex",
        "theory",
        "origin",
        "universe",
        "subsequent",
        "development",
        "material",
        "nonmaterial",
        "entity",
        "also",
        "startling",
        "astronomical",
        "system",
        "point",
        "dogon",
        "pretelescopic",
        "knowledge",
        "sirius",
        "b",
        "path",
        "across",
        "sky",
        "yet",
        "despite",
        "pioneer",
        "scientific",
        "mathematical",
        "genius",
        "time",
        "throughout",
        "entire",
        "presentation",
        "one",
        "encounter",
        "ogotemmêli",
        "thinker",
        "representative",
        "narrator",
        "collective",
        "memory",
        "community",
        "voice",
        "submerged",
        "communal",
        "mode",
        "expression",
        "according",
        "oruka",
        "absence",
        "personal",
        "direct",
        "reflection",
        "issue",
        "hand",
        "qualifies",
        "ogotemmêli",
        "folk",
        "sage",
        "folk",
        "sage",
        "highly",
        "intelligent",
        "good",
        "narrator",
        "traditionally",
        "imposed",
        "belief",
        "myth",
        "may",
        "explain",
        "belief",
        "value",
        "great",
        "detail",
        "may",
        "even",
        "expound",
        "relation",
        "mythical",
        "representation",
        "lesson",
        "society",
        "intended",
        "illustrate",
        "folk",
        "sage",
        "hardly",
        "veers",
        "narrative",
        "contrast",
        "philosophic",
        "sage",
        "person",
        "traditional",
        "african",
        "culture",
        "capable",
        "critical",
        "secondorder",
        "type",
        "thinking",
        "various",
        "problem",
        "human",
        "life",
        "nature",
        "person",
        "subject",
        "belief",
        "traditionally",
        "taken",
        "granted",
        "independent",
        "rational",
        "reexamination",
        "inclined",
        "accept",
        "reject",
        "belief",
        "authority",
        "reason",
        "rather",
        "basis",
        "communal",
        "religious",
        "consensus",
        "sage",
        "philosophy",
        "pp",
        "onisegun",
        "deliberately",
        "kept",
        "anonymous",
        "hallen",
        "sodipo",
        "reason",
        "privacy",
        "expound",
        "elucidate",
        "traditional",
        "thought",
        "yoruba",
        "certainly",
        "wise",
        "knowledgeable",
        "people",
        "oruka",
        "criterion",
        "philosophic",
        "sagacity",
        "however",
        "folk",
        "sage",
        "like",
        "ogotemmêli",
        "whose",
        "presentation",
        "however",
        "complex",
        "amazing",
        "detail",
        "exactly",
        "every",
        "wise",
        "dogon",
        "person",
        "expected",
        "know",
        "sage",
        "philosophy",
        "pp",
        "oruka",
        "distinguishes",
        "folk",
        "philosophic",
        "sage",
        "term",
        "pursue",
        "rational",
        "grounding",
        "belief",
        "value",
        "opposed",
        "merely",
        "narrate",
        "appear",
        "commuity",
        "belief",
        "system",
        "w",
        "v",
        "o",
        "quine",
        "indeterminacy",
        "thesis",
        "radical",
        "translation",
        "present",
        "major",
        "difficulty",
        "explanation",
        "conceptual",
        "content",
        "meaning",
        "term",
        "yoruba",
        "language",
        "provided",
        "onisegun",
        "hallen",
        "sodipo",
        "quine",
        "attacked",
        "concept",
        "universal",
        "proposition",
        "meaning",
        "frequently",
        "assumed",
        "translator",
        "exist",
        "across",
        "language",
        "draw",
        "question",
        "practice",
        "anthropologist",
        "studying",
        "african",
        "belief",
        "system",
        "following",
        "quine",
        "hallen",
        "argues",
        "given",
        "cumulative",
        "effect",
        "indeterminacy",
        "translation",
        "radically",
        "different",
        "languagaes",
        "alternative",
        "explanation",
        "inconsistency",
        "could",
        "translator",
        "recourse",
        "contradiction",
        "perhaps",
        "unwittingly",
        "able",
        "arrive",
        "determinate",
        "precise",
        "translation",
        "short",
        "history",
        "african",
        "philosophy",
        "pp",
        "failing",
        "find",
        "nonwestern",
        "mode",
        "thought",
        "precise",
        "translation",
        "comparable",
        "rational",
        "expression",
        "language",
        "anthropologist",
        "hastened",
        "conclude",
        "problem",
        "must",
        "lie",
        "nonwestern",
        "mode",
        "thought",
        "appear",
        "lack",
        "way",
        "accommodating",
        "rational",
        "expression",
        "yet",
        "hallen",
        "sodipo",
        "conversation",
        "yoruba",
        "sage",
        "illustrate",
        "happens",
        "one",
        "try",
        "translate",
        "among",
        "others",
        "english",
        "term",
        "know",
        "yoruba",
        "outcome",
        "comparative",
        "analysis",
        "show",
        "conceptual",
        "assumption",
        "reality",
        "often",
        "tied",
        "natural",
        "language",
        "speak",
        "fair",
        "hallen",
        "sodipo",
        "work",
        "simple",
        "description",
        "onisegun",
        "said",
        "rather",
        "attempt",
        "tease",
        "intended",
        "conceptually",
        "language",
        "translated",
        "faithfully",
        "possible",
        "proposition",
        "contrast",
        "comparable",
        "one",
        "english",
        "nonetheless",
        "oruka",
        "maintained",
        "use",
        "western",
        "philosophical",
        "language",
        "analyze",
        "indigenous",
        "african",
        "thought",
        "lead",
        "separation",
        "insider",
        "traditional",
        "african",
        "philosophy",
        "outsider",
        "analyzing",
        "describing",
        "philosophy",
        "language",
        "western",
        "thought",
        "given",
        "two",
        "really",
        "meaningfully",
        "express",
        "thought",
        "would",
        "absurd",
        "find",
        "one",
        "expert",
        "thought",
        "sage",
        "philosophy",
        "p",
        "conclusion",
        "entirely",
        "clear",
        "oruka",
        "believed",
        "ought",
        "relationship",
        "indigenous",
        "philosophic",
        "sage",
        "westerntrained",
        "counterpart",
        "clear",
        "remark",
        "use",
        "western",
        "philosopher",
        "like",
        "quine",
        "wittgenstein",
        "example",
        "tool",
        "analyzing",
        "conceptual",
        "content",
        "african",
        "mode",
        "thought",
        "allowed",
        "scholar",
        "champion",
        "term",
        "african",
        "philosophy",
        "using",
        "terminology",
        "given",
        "western",
        "philosophy",
        "none",
        "far",
        "given",
        "account",
        "treated",
        "language",
        "african",
        "philosophy",
        "sage",
        "philosophy",
        "p",
        "point",
        "least",
        "oruka",
        "seems",
        "position",
        "away",
        "philosopher",
        "appiah",
        "wiredu",
        "gyekye",
        "understood",
        "work",
        "professional",
        "philosopher",
        "distinct",
        "philosophic",
        "sage",
        "expressed",
        "wish",
        "could",
        "remain",
        "way",
        "preserving",
        "tradition",
        "idea",
        "appears",
        "implied",
        "regret",
        "tragedy",
        "man",
        "western",
        "intellectual",
        "elite",
        "year",
        "successfully",
        "imposed",
        "culture",
        "philosophy",
        "mass",
        "british",
        "philosophy",
        "example",
        "taken",
        "text",
        "locke",
        "hume",
        "bacon",
        "russels",
        "etc",
        "sage",
        "philosophy",
        "p",
        "oruka",
        "concern",
        "preservation",
        "indigenous",
        "thought",
        "suggests",
        "desired",
        "keep",
        "professional",
        "school",
        "philosopher",
        "separate",
        "philosophic",
        "sage",
        "ensure",
        "preservation",
        "intellectual",
        "integrity",
        "sage",
        "african",
        "heritage",
        "whole",
        "concerned",
        "language",
        "african",
        "professional",
        "philosopher",
        "dependent",
        "western",
        "conceptual",
        "lexicon",
        "unchecked",
        "imposition",
        "indigenous",
        "conceptual",
        "scheme",
        "might",
        "finally",
        "contribute",
        "demise",
        "latter",
        "among",
        "african",
        "philosopher",
        "kwasi",
        "wiredu",
        "particularly",
        "sympathetic",
        "oruka",
        "concern",
        "writing",
        "need",
        "conceptual",
        "decolonization",
        "african",
        "philosophy",
        "wiredu",
        "claim",
        "need",
        "would",
        "mean",
        "avoiding",
        "reversing",
        "critical",
        "conceptual",
        "selfawareness",
        "unexamined",
        "assimilation",
        "thought",
        "thought",
        "contemporary",
        "african",
        "philosopher",
        "conceptual",
        "framework",
        "embedded",
        "foreign",
        "philosophical",
        "tradition",
        "impact",
        "african",
        "life",
        "thought",
        "exploiting",
        "much",
        "judicious",
        "resource",
        "indigenous",
        "conceptual",
        "scheme",
        "philosophical",
        "meditation",
        "even",
        "technical",
        "problem",
        "contemporary",
        "philosophy",
        "cultural",
        "universal",
        "particular",
        "p",
        "time",
        "wiredu",
        "agrees",
        "philosopher",
        "like",
        "appiah",
        "gyekye",
        "insisting",
        "belief",
        "proverb",
        "custom",
        "african",
        "culture",
        "included",
        "philosophical",
        "reflection",
        "professional",
        "cultural",
        "element",
        "folk",
        "knowledge",
        "also",
        "must",
        "subjected",
        "critical",
        "analysis",
        "evaluation",
        "pretensethat",
        "recourse",
        "african",
        "vernacular",
        "must",
        "result",
        "instantaneous",
        "philosophic",
        "revelation",
        "cultural",
        "universal",
        "particular",
        "p",
        "oruka",
        "believed",
        "professional",
        "african",
        "philosopher",
        "could",
        "interact",
        "sagacious",
        "counterpart",
        "provided",
        "sufficient",
        "room",
        "flourish",
        "separately",
        "idea",
        "suggests",
        "desired",
        "expand",
        "location",
        "legitimate",
        "philosophical",
        "activity",
        "beyond",
        "institutional",
        "confines",
        "academy",
        "considered",
        "intricately",
        "connected",
        "colonial",
        "legacy",
        "regard",
        "idea",
        "african",
        "sage",
        "philosophy",
        "provided",
        "important",
        "intervention",
        "development",
        "contemporary",
        "african",
        "philosophy",
        "addressing",
        "many",
        "crucial",
        "issue",
        "african",
        "philosopher",
        "continue",
        "face",
        "wider",
        "context",
        "postcolonial",
        "cultural",
        "inquiry",
        "philosophy",
        "part",
        "gayatri",
        "chakravorty",
        "spivak",
        "critique",
        "postcolonial",
        "reason",
        "toward",
        "history",
        "vanishing",
        "present",
        "suggested",
        "selfawareness",
        "stage",
        "postcolonial",
        "theory",
        "largely",
        "formerly",
        "colonized",
        "culture",
        "settling",
        "utilizing",
        "respective",
        "cultural",
        "reservoir",
        "without",
        "significant",
        "attention",
        "need",
        "reclaim",
        "indigenous",
        "voice",
        "without",
        "minimizing",
        "need",
        "continued",
        "sustained",
        "awareness",
        "everpresent",
        "eurocentric",
        "imposition",
        "orientation",
        "displayed",
        "example",
        "wiredu",
        "independent",
        "comparative",
        "analysis",
        "western",
        "african",
        "concept",
        "whose",
        "widelydebated",
        "epistemological",
        "position",
        "truth",
        "nothing",
        "opinion",
        "hinge",
        "contrast",
        "objectivist",
        "implication",
        "claim",
        "know",
        "english",
        "nonobjectivist",
        "implication",
        "akan",
        "language",
        "along",
        "wiredu",
        "hallen",
        "sodipo",
        "also",
        "hold",
        "complex",
        "philosophical",
        "view",
        "already",
        "signaled",
        "many",
        "saying",
        "african",
        "language",
        "wait",
        "teased",
        "careful",
        "analysis",
        "interpretation",
        "although",
        "oruka",
        "idea",
        "sage",
        "philosophically",
        "savvy",
        "language",
        "raise",
        "methodical",
        "question",
        "whether",
        "sage",
        "philosophy",
        "property",
        "professional",
        "philosopher",
        "indigenous",
        "wise",
        "person",
        "teased",
        "prompting",
        "professional",
        "philosopher",
        "hallen",
        "sodipo",
        "wiredu",
        "agree",
        "insistence",
        "distinguishing",
        "mark",
        "african",
        "philosophy",
        "emerge",
        "precisely",
        "analytical",
        "involvement",
        "westerntrained",
        "philosopher",
        "raise",
        "question",
        "regarding",
        "conceptual",
        "underpinnings",
        "indigenous",
        "belief",
        "value",
        "language",
        "critically",
        "examine",
        "meaning",
        "implication",
        "propose",
        "basis",
        "accommodate",
        "indigenous",
        "sage",
        "westerntrained",
        "professional",
        "philosopher"
    ]
}