{
    "main_text": "Reading the contemporary—evolving themes || Gender and sexuality\n7.1 Gender and sexuality\n\nOne of the key areas of contemporary interest in Africana\nphilosophy—the study of gender and sexuality—is both\npromising and difficult to summarize. In fact, describing it as a\nsingle area would be unforgivably misleading were it not for the\nexpository constraints of this exercise and for all of the\nqualifications that will soon follow. It is less an area than an array\nof topics and issues that have yet to come into focus as a subfield in\nAfricana philosophy in the way they have elsewhere. A detailed study\nof the reasons for the field’s elusiveness are beyond the scope\nof this entry, but it is worth noting that the most obvious\nfactors—the existence of structures that have historically\ndiscouraged or openly excluded the study of these issues or the\nparticipation of the people most likely to take an interest in\nthem—are among the subjects that researchers in this area take\nup.\n\nThese difficulties notwithstanding, studies of gender and sexuality\nare becoming increasingly prominent in Africana philosophy, thanks in\npart to a thaw in the historically constraining structures mentioned\nabove. The issues driving these studies are not new, however, so one\nway to choose a path through this sprawling territory involves simply\ntracking the impact of some germinal texts and influential authors\nfrom earlier periods. Proceeding in this way will require speeding\npast a version of the important question posed by Saba Fatima and her\ncolleagues (2017): how do the various fields that might implicate or\ntransect Africana studies of gender and sexuality—fields like\ndecolonial feminism, Black queer theory, women of color feminism,\nthird world feminism, Black feminism, and so on—relate to each\nother? Treating this difficulty with the care it deserves is beyond\nthe scope of this project. I will simply stipulate to two assumptions:\nthat the categories “Black” and “Africana”\noverlap sufficiently to justify treating studies of Black gender and\nBlack sexuality as relevant for Africana thought; and that expanding\nthe zone of overlap to include thinkers who might self-identify with\none of the other categories (decolonial, third world, etc.) will\nreveal some useful continuities in the various projects.\n\nOne influential text to consider is Collins’s Black Feminist\nThought. The editors of the journal Ethnic and Racial\nStudies introduce an anniversary symposium on the book by noting\nthat its publication “can be seen as a turning point in the\nstudy of the intersections between race, class and gender… .\nIndeed, in terms of books on race and ethnicity that have been\npublished over recent decades, few, if any, have surpassed it in terms\nof its reach as well as its influence” (Bulmer and Solomos 2015,\n2314). This influence extends well into philosophy, as indicated by\nthe two philosophers, both black feminists, who participated in a 2015\nsymposium otherwise made up of (theory-oriented) social scientists.\nFocusing briefly on their work will provide useful windows onto\nemerging developments in the field.\n\nKristie Dotson and Kathryn Belle testify eloquently in word and deed\nto Collins’s impact on their work, and thereby to Collins’\nimpact on the field. Dotson describes Black Feminist Thought\nas “one of the most comprehensive treatments of knowledge\nproblems and the oppression of black women in the USA to date,”\nand praises the way it “highlights epistemological failures as\nan important layer of oppression” (Dotson 2015, 2323).\nDotson’s research (2012, 2017) draws this (and many other\ninfluences) out in the direction of (among much else) a political\nepistemology that engages vigorously with the conditions that have\nboth excluded Black feminism from philosophy and obscured the\ncoherence and relevance of Black feminist intellectual traditions.\nThis scholarly production is continuous with Dotson’s efforts in\nother spheres, like her work with Kimberlé Crenshaw’s\nAfrican American Policy Forum and the trainings she offers on feminist\npedagogy.\n\nWhile Dotson focuses on the epistemological dimensions of\nCollins’s exercises in “critical social theory”\n(Collins 1989, xiv), Belle focuses on its existential and\nphenomenological dimensions. She explains that Collins’s work\n“underscores the importance of safe spaces for Black women to\nspeak freely as a necessary condition of resistance and\nempowerment” (Belle 2015, 2345). This orientation to agency,\nvoice, and discursive community clearly informs Belle’s work as\na scholar (Davidson, Gines, and Marcano 2010). But it also shapes her\nwork as an institution-builder, most clearly as the driving force\nbehind the Collegium for Black Women Philosophers, which since 2007\nhas aimed, as she puts it, “to create a safe space for Black\nwomen philosophers … to support, encourage and learn from one\nanother” (Belle 2015, 2345).\n\nIf the opportunity to “inherit” the work of Patricia Hill\nCollins (as Dotson [2015] puts it in the title to her piece on\nCollins) has inspired two influential figures in contemporary U.S.\nBlack feminist philosophy, the issues at the heart of another\nauthor’s germinal text help drive another strain in Africana\nphilosophical studies of gender and sexuality. Nigerian sociologist\nOyeronke Oyewumi’s The Invention of Women (1997) helped\nmake her, as Azille Coetzee and Annemie Halsema put it, “one of\nthe most famous and at the same time contested scholars in African\nfeminist thought” (Coetzee and Halsema 2018, 179). Douglas Ficek\nexplains that her “central claim is that gender is not an\nindigenous organizing principle in Yorùbáland, that the\n‘body-reasoning’ and ‘bio-logic’ of the West\nare present neither in the language nor in the epistemology of the\nYorùbá” (Ficek 2006, 543). This view immediately\ninspired considerable pushback, including sustained scrutiny from\nmultiple contributors to the special African feminisms issue of\nQuest: A Journal of African Philosophy that appeared in\n 2006.[6]\n Oyewumi’s arguments still help frame contemporary efforts to\nrethink the role of gender in African life, as evidenced by her\nprominent role in the articles on gender and feminism in the recent\nPalgrave Companion (e.g., du Toit and Coetzee 2017).\n\nLegal theorist Kimberlé Crenshaw has provided another\ncornerstone for ongoing contemporary reflection on gender and\nsexuality, but has important (and underappreciated) implications well\nbeyond these areas. In two germinal articles from 1989 and 1991, she\nintroduced an account of intersectionality that inspired “the\nkind of interdisciplinary and global engagement” that\n“[v]ery few theories have generated” (Carbado et al. 2013,\n303). She says in the second of these articles that she began using\nthe notion of intersectionality “to denote the various ways in\nwhich race and gender interact to shape the multiple dimensions of\nBlack women’s employment experiences” (Crenshaw 1991,\n 1244).[7]\n A cottage industry of commentary and analysis has grown up from this\nsimple beginning, with scholars, artists, critics, and activists\ndebating the meanings and proper uses of\n“intersectionality” nearly as much as they employ it.\nIntersectionality remains a hotly contested notion in part because it\nraises a variety of deeply philosophical questions. Scholars have\nasked, for example, what intersectionality means for theories of\npersonal identity, whether it adequately captures the complexity of\nhuman experience, how it bears on the prospects for coalition\npolitics, why this notion stands out from a family of related, older\nnotions in social theory that do similar work, whether standard\napproaches to intersectionality take Black masculinity seriously\nenough, and much more besides.\n\nThe best way to close this section would be to discuss queer\ntheory’s growing impact on Africana philosophy, but there is\nfrustratingly little to say. Many studies outside of philosophy\nexhibit considerable philosophical depth, starting with the pioneering\nwork of Cathy Cohen in political science and continuing with the work\nof figures like C. Riley\n Snorton.[8]\n I have to this point been willing, on the principled grounds noted\nabove, to put card-carrying philosophers into conversation with\nthinkers outside the discipline; but the size of the gap between work\ninside and outside the field is so stark in this case that it deserves\nspecial comment.\n\nAfricana philosophy has yet to take up in earnest the challenge that\nhas roiled Black studies and related fields over the last decade and a\nhalf. Dwight McBride stated this challenge clearly in 2007:\n\n\nTelling the truths of Black life in the United States requires a\nmultiplicity of voices. It takes voices invested in the stories and\nexperiences of Black men and women; Black heterosexuals and Black\ngays, lesbians, bisexuals, and transgender folk … Black single\nparents … and so very much more. When we allow ourselves to be\nsummed up by sanitized versions of Black life in adherence to a form\nof Black respectability, we tell only part of our story. (McBride\n2007, 438–439)\n\n\nMcBride offers these remarks on the way to calling for a “new\nBlack Studies” that attends more carefully to issues of\nintra-racial diversity. Some version of this call is surely relevant\nfor Africana philosophy. For this reason, forthcoming work by V.\nDenise James and Anika Simpson is particularly welcome in the U.S.\ncontext. (I’ll leave it to commentators with more intimate\nknowledge of other contexts to comment on the promising developments\nelsewhere.) James is working on a philosophical treatment of Audre\nLorde, and Simpson is preparing a study of the way a responsible\nengagement with single black motherhood requires a queering of\nstandard philosophical approaches to family, sexuality, gender, and\npolitical\n life.[9]\n",
    "section_title": "7.1 Gender and sexuality",
    "entry_title": "Contemporary Africana Philosophy",
    "hierarchy_title": "Contemporary Africana Philosophy || Reading the contemporary—evolving themes || Gender and sexuality",
    "tokenized_text": [
        "reading",
        "contemporaryevolving",
        "theme",
        "gender",
        "sexuality",
        "gender",
        "sexuality",
        "one",
        "key",
        "area",
        "contemporary",
        "interest",
        "africana",
        "philosophythe",
        "study",
        "gender",
        "sexualityis",
        "promising",
        "difficult",
        "summarize",
        "fact",
        "describing",
        "single",
        "area",
        "would",
        "unforgivably",
        "misleading",
        "expository",
        "constraint",
        "exercise",
        "qualification",
        "soon",
        "follow",
        "le",
        "area",
        "array",
        "topic",
        "issue",
        "yet",
        "come",
        "focus",
        "subfield",
        "africana",
        "philosophy",
        "way",
        "elsewhere",
        "detailed",
        "study",
        "reason",
        "field",
        "elusiveness",
        "beyond",
        "scope",
        "entry",
        "worth",
        "noting",
        "obvious",
        "factorsthe",
        "existence",
        "structure",
        "historically",
        "discouraged",
        "openly",
        "excluded",
        "study",
        "issue",
        "participation",
        "people",
        "likely",
        "take",
        "interest",
        "themare",
        "among",
        "subject",
        "researcher",
        "area",
        "take",
        "difficulty",
        "notwithstanding",
        "study",
        "gender",
        "sexuality",
        "becoming",
        "increasingly",
        "prominent",
        "africana",
        "philosophy",
        "thanks",
        "part",
        "thaw",
        "historically",
        "constraining",
        "structure",
        "mentioned",
        "issue",
        "driving",
        "study",
        "new",
        "however",
        "one",
        "way",
        "choose",
        "path",
        "sprawling",
        "territory",
        "involves",
        "simply",
        "tracking",
        "impact",
        "germinal",
        "text",
        "influential",
        "author",
        "earlier",
        "period",
        "proceeding",
        "way",
        "require",
        "speeding",
        "past",
        "version",
        "important",
        "question",
        "posed",
        "saba",
        "fatima",
        "colleague",
        "various",
        "field",
        "might",
        "implicate",
        "transect",
        "africana",
        "study",
        "gender",
        "sexualityfields",
        "like",
        "decolonial",
        "feminism",
        "black",
        "queer",
        "theory",
        "woman",
        "color",
        "feminism",
        "third",
        "world",
        "feminism",
        "black",
        "feminism",
        "onrelate",
        "treating",
        "difficulty",
        "care",
        "deserves",
        "beyond",
        "scope",
        "project",
        "simply",
        "stipulate",
        "two",
        "assumption",
        "category",
        "black",
        "africana",
        "overlap",
        "sufficiently",
        "justify",
        "treating",
        "study",
        "black",
        "gender",
        "black",
        "sexuality",
        "relevant",
        "africana",
        "thought",
        "expanding",
        "zone",
        "overlap",
        "include",
        "thinker",
        "might",
        "selfidentify",
        "one",
        "category",
        "decolonial",
        "third",
        "world",
        "etc",
        "reveal",
        "useful",
        "continuity",
        "various",
        "project",
        "one",
        "influential",
        "text",
        "consider",
        "collins",
        "black",
        "feminist",
        "thought",
        "editor",
        "journal",
        "ethnic",
        "racial",
        "study",
        "introduce",
        "anniversary",
        "symposium",
        "book",
        "noting",
        "publication",
        "seen",
        "turning",
        "point",
        "study",
        "intersection",
        "race",
        "class",
        "gender",
        "indeed",
        "term",
        "book",
        "race",
        "ethnicity",
        "published",
        "recent",
        "decade",
        "surpassed",
        "term",
        "reach",
        "well",
        "influence",
        "bulmer",
        "solomos",
        "influence",
        "extends",
        "well",
        "philosophy",
        "indicated",
        "two",
        "philosopher",
        "black",
        "feminist",
        "participated",
        "symposium",
        "otherwise",
        "made",
        "theoryoriented",
        "social",
        "scientist",
        "focusing",
        "briefly",
        "work",
        "provide",
        "useful",
        "window",
        "onto",
        "emerging",
        "development",
        "field",
        "kristie",
        "dotson",
        "kathryn",
        "belle",
        "testify",
        "eloquently",
        "word",
        "deed",
        "collins",
        "impact",
        "work",
        "thereby",
        "collins",
        "impact",
        "field",
        "dotson",
        "describes",
        "black",
        "feminist",
        "thought",
        "one",
        "comprehensive",
        "treatment",
        "knowledge",
        "problem",
        "oppression",
        "black",
        "woman",
        "usa",
        "date",
        "praise",
        "way",
        "highlight",
        "epistemological",
        "failure",
        "important",
        "layer",
        "oppression",
        "dotson",
        "dotson",
        "research",
        "draw",
        "many",
        "influence",
        "direction",
        "among",
        "much",
        "else",
        "political",
        "epistemology",
        "engages",
        "vigorously",
        "condition",
        "excluded",
        "black",
        "feminism",
        "philosophy",
        "obscured",
        "coherence",
        "relevance",
        "black",
        "feminist",
        "intellectual",
        "tradition",
        "scholarly",
        "production",
        "continuous",
        "dotson",
        "effort",
        "sphere",
        "like",
        "work",
        "kimberlé",
        "crenshaw",
        "african",
        "american",
        "policy",
        "forum",
        "training",
        "offer",
        "feminist",
        "pedagogy",
        "dotson",
        "focus",
        "epistemological",
        "dimension",
        "collins",
        "exercise",
        "critical",
        "social",
        "theory",
        "collins",
        "xiv",
        "belle",
        "focus",
        "existential",
        "phenomenological",
        "dimension",
        "explains",
        "collins",
        "work",
        "underscore",
        "importance",
        "safe",
        "space",
        "black",
        "woman",
        "speak",
        "freely",
        "necessary",
        "condition",
        "resistance",
        "empowerment",
        "belle",
        "orientation",
        "agency",
        "voice",
        "discursive",
        "community",
        "clearly",
        "informs",
        "belle",
        "work",
        "scholar",
        "davidson",
        "gines",
        "marcano",
        "also",
        "shape",
        "work",
        "institutionbuilder",
        "clearly",
        "driving",
        "force",
        "behind",
        "collegium",
        "black",
        "woman",
        "philosopher",
        "since",
        "aimed",
        "put",
        "create",
        "safe",
        "space",
        "black",
        "woman",
        "philosopher",
        "support",
        "encourage",
        "learn",
        "one",
        "another",
        "belle",
        "opportunity",
        "inherit",
        "work",
        "patricia",
        "hill",
        "collins",
        "dotson",
        "put",
        "title",
        "piece",
        "collins",
        "inspired",
        "two",
        "influential",
        "figure",
        "contemporary",
        "us",
        "black",
        "feminist",
        "philosophy",
        "issue",
        "heart",
        "another",
        "author",
        "germinal",
        "text",
        "help",
        "drive",
        "another",
        "strain",
        "africana",
        "philosophical",
        "study",
        "gender",
        "sexuality",
        "nigerian",
        "sociologist",
        "oyeronke",
        "oyewumi",
        "invention",
        "woman",
        "helped",
        "make",
        "azille",
        "coetzee",
        "annemie",
        "halsema",
        "put",
        "one",
        "famous",
        "time",
        "contested",
        "scholar",
        "african",
        "feminist",
        "thought",
        "coetzee",
        "halsema",
        "douglas",
        "ficek",
        "explains",
        "central",
        "claim",
        "gender",
        "indigenous",
        "organizing",
        "principle",
        "yorùbáland",
        "bodyreasoning",
        "biologic",
        "west",
        "present",
        "neither",
        "language",
        "epistemology",
        "yorùbá",
        "ficek",
        "view",
        "immediately",
        "inspired",
        "considerable",
        "pushback",
        "including",
        "sustained",
        "scrutiny",
        "multiple",
        "contributor",
        "special",
        "african",
        "feminism",
        "issue",
        "quest",
        "journal",
        "african",
        "philosophy",
        "appeared",
        "oyewumi",
        "argument",
        "still",
        "help",
        "frame",
        "contemporary",
        "effort",
        "rethink",
        "role",
        "gender",
        "african",
        "life",
        "evidenced",
        "prominent",
        "role",
        "article",
        "gender",
        "feminism",
        "recent",
        "palgrave",
        "companion",
        "eg",
        "du",
        "toit",
        "coetzee",
        "legal",
        "theorist",
        "kimberlé",
        "crenshaw",
        "provided",
        "another",
        "cornerstone",
        "ongoing",
        "contemporary",
        "reflection",
        "gender",
        "sexuality",
        "important",
        "underappreciated",
        "implication",
        "well",
        "beyond",
        "area",
        "two",
        "germinal",
        "article",
        "introduced",
        "account",
        "intersectionality",
        "inspired",
        "kind",
        "interdisciplinary",
        "global",
        "engagement",
        "v",
        "ery",
        "theory",
        "generated",
        "carbado",
        "et",
        "al",
        "say",
        "second",
        "article",
        "began",
        "using",
        "notion",
        "intersectionality",
        "denote",
        "various",
        "way",
        "race",
        "gender",
        "interact",
        "shape",
        "multiple",
        "dimension",
        "black",
        "woman",
        "employment",
        "experience",
        "crenshaw",
        "cottage",
        "industry",
        "commentary",
        "analysis",
        "grown",
        "simple",
        "beginning",
        "scholar",
        "artist",
        "critic",
        "activist",
        "debating",
        "meaning",
        "proper",
        "us",
        "intersectionality",
        "nearly",
        "much",
        "employ",
        "intersectionality",
        "remains",
        "hotly",
        "contested",
        "notion",
        "part",
        "raise",
        "variety",
        "deeply",
        "philosophical",
        "question",
        "scholar",
        "asked",
        "example",
        "intersectionality",
        "mean",
        "theory",
        "personal",
        "identity",
        "whether",
        "adequately",
        "capture",
        "complexity",
        "human",
        "experience",
        "bear",
        "prospect",
        "coalition",
        "politics",
        "notion",
        "stand",
        "family",
        "related",
        "older",
        "notion",
        "social",
        "theory",
        "similar",
        "work",
        "whether",
        "standard",
        "approach",
        "intersectionality",
        "take",
        "black",
        "masculinity",
        "seriously",
        "enough",
        "much",
        "besides",
        "best",
        "way",
        "close",
        "section",
        "would",
        "discus",
        "queer",
        "theory",
        "growing",
        "impact",
        "africana",
        "philosophy",
        "frustratingly",
        "little",
        "say",
        "many",
        "study",
        "outside",
        "philosophy",
        "exhibit",
        "considerable",
        "philosophical",
        "depth",
        "starting",
        "pioneering",
        "work",
        "cathy",
        "cohen",
        "political",
        "science",
        "continuing",
        "work",
        "figure",
        "like",
        "c",
        "riley",
        "snorton",
        "point",
        "willing",
        "principled",
        "ground",
        "noted",
        "put",
        "cardcarrying",
        "philosopher",
        "conversation",
        "thinker",
        "outside",
        "discipline",
        "size",
        "gap",
        "work",
        "inside",
        "outside",
        "field",
        "stark",
        "case",
        "deserves",
        "special",
        "comment",
        "africana",
        "philosophy",
        "yet",
        "take",
        "earnest",
        "challenge",
        "roiled",
        "black",
        "study",
        "related",
        "field",
        "last",
        "decade",
        "half",
        "dwight",
        "mcbride",
        "stated",
        "challenge",
        "clearly",
        "telling",
        "truth",
        "black",
        "life",
        "united",
        "state",
        "requires",
        "multiplicity",
        "voice",
        "take",
        "voice",
        "invested",
        "story",
        "experience",
        "black",
        "men",
        "woman",
        "black",
        "heterosexual",
        "black",
        "gay",
        "lesbian",
        "bisexual",
        "transgender",
        "folk",
        "black",
        "single",
        "parent",
        "much",
        "allow",
        "summed",
        "sanitized",
        "version",
        "black",
        "life",
        "adherence",
        "form",
        "black",
        "respectability",
        "tell",
        "part",
        "story",
        "mcbride",
        "mcbride",
        "offer",
        "remark",
        "way",
        "calling",
        "new",
        "black",
        "study",
        "attends",
        "carefully",
        "issue",
        "intraracial",
        "diversity",
        "version",
        "call",
        "surely",
        "relevant",
        "africana",
        "philosophy",
        "reason",
        "forthcoming",
        "work",
        "v",
        "denise",
        "james",
        "anika",
        "simpson",
        "particularly",
        "welcome",
        "us",
        "context",
        "leave",
        "commentator",
        "intimate",
        "knowledge",
        "context",
        "comment",
        "promising",
        "development",
        "elsewhere",
        "james",
        "working",
        "philosophical",
        "treatment",
        "audre",
        "lorde",
        "simpson",
        "preparing",
        "study",
        "way",
        "responsible",
        "engagement",
        "single",
        "black",
        "motherhood",
        "requires",
        "queering",
        "standard",
        "philosophical",
        "approach",
        "family",
        "sexuality",
        "gender",
        "political",
        "life"
    ]
}