{
    "main_text": "De incertitudine et vanitate scientiarum\n5. De occulta philosophia (final draft)\n\nIn De vanitate, Agrippa did not make any explicit recantation\nof his passion for occult sciences (Keefer 1988: 618); he simply\nadmitted that there might have been something wrong in his juvenile\nwork on magic, because of his adolescent curiosity. In fact, the\nrenewal of magic continued to be a central feature of his intellectual\njourney. Between 1530 and 1533, right in the middle of his violent\nbattle against theologians and conservatives, he was preparing De\nocculta philosophia for publication, entrusting his last hope of\na secure financial support to the same work to which he had committed\nhis desire for fame and fortune twenty years earlier. Although in the\nmeantime his religious concerns had deepened, he did not perceive any\nconflict between his involvement in theological debates and his\npersistent interest in the task of rebuilding magic. In his mind, they\nwere two coherent aspects of a single project, as he had already\npointed out in De triplici ratione cognoscendi Deum. There\nAgrippa had made clear that reforming culture on the basis of the\nsolid certainty of God’s illumination also implied regaining\nhumankind’s original perfection and thaumaturgic ability, which\nAdam owned by right before he sinned.\n\nComparison of the 1510 dedication copy, sent by Agrippa to Trithemius\n(MS Würzburg, M.ch.q.50), with the printed final edition (Cologne\n1533), reveals the careful and thorough revision and enlargement to\nwhich the first draft was subjected. The book doubled in length, and\nfresh ideas and references were included. In updating the text,\nAgrippa mostly drew on works consistent with the sources he had\nalready used in drafting the initial version. Between 1510 and 1533,\nhe had studied a number of texts which he had previously been unaware\nof or neglected (Ficino’s commentaries on Plato and on Plotinus;\nGiovanni Pico’s Conclusiones, Heptaplus, and\nDisputationes adversus astrologiam divinatricem; Lodovico\nLazzarelli’s Crater Hermetis; and Gianfrancesco\nPico’s De rerum praenotione) or which had been\npublished in the meantime (some of Erasmus’ writings; Paulus\nRicius’ commentaries on Hebrew writings; Reuchlin’s De\narte cabalistica; and Francesco Giorgio’s De harmonia\nmundi). Agrippa’s vast exploration of books allowed him to\nre-orient his youthful project, providing a definitive justification\nof his aim to restore in full the religious, cognitive, and practical\nscope of ancient magic. This “reformed magic” (magia\nreformata) would not only guarantee to the magus mastery over\nnature and the ability to attract astral and angelic virtues, but\nwould also assure his ascent to the First Principle.\n\nThe revised version of De occulta philosophia offers\nextensive proof of this significant qualitative shift. The original\ntripartite structure was given a new metaphysical structure, which\npowerfully underlined the idea of the cosmos as an epiphany of the\ndivine. Thanks to the influence of Giorgio’s De harmonia\nmundi, Agrippa was able to adopt a radically new approach to\nnatural magic. Now, Book I explicitly contemplates the material world\nas the receptacle of divine and presents the occult virtues as an\nexample of the living links connecting the terrestrial forms to the\nFirst Cause through the chain of the higher intermediaries (stars and\nspiritual essences). The “perfection of both science and\npractice” is guaranteed by the ability to change the impure back\nto the pure, and plurality back to simplicity. In significant\nadditions “on the properties of elements” (chapters\n3–6), William Newman (1982) recognized the description of the\nalchemical reduction of elemental earth to the purity of first matter.\nThere are three orders of elements, corresponding to the three levels\nof being: pure elements, unmixed and incorruptible; compound elements,\nmultiplex, varied and impure, but which can be reduced to “pure\nsimplicity” (pura simplicitas); lastly, decomposed\nelements, convertible into one another. Earth, which confers solidity\non other elements, mixing with them but without changing into them, is\nthe receptacle of every celestial influence, because it is\ncontinuously animated by the virtues conveyed by the\nspiritus: so, earth is “the foundation and mother of\neverything”, because it encloses the seminal virtues of all\ncreation. Therefore, having undergone the process of purification and\nsimplification, it becomes “the purest remedy for restoring and\npreserving us”. The process of universal simplification of the\nelements can be carried out by reducing earth to the original purity\nof the first matter. Newman explained the nature of this process,\nreferring to chapter 4 of Book II, on the power of the number one.\nHere, Agrippa traces the presence of unity in all levels of existence:\nGod in the archetypal world, the anima mundi in the\nintellectual one, the Sun in the heavenly world, the heart in man, and\nLucifer in hell. In the elemental world, the one is the\nphilosopher’s stone, “embodying all wonders”,\nwithout which “neither alchemy, nor natural magic may attain\ntheir perfect end”. Agrippa’s source, as Newman has\npointed out, was a letter in which Trithemius gave a cosmological\ninterpretation of the Hermetic text “Emerald Tablet”\n(Tabula Smaragdina), identifying the alchemical opus\nas the universal “path to the highest unity”\n(Epistolae, pp. 471–73).\n\nBook II introduces a massive quantity of “technical”\nreferences, in some part influenced by the corpus of magical\nmanuscripts which had belonged to Trithemius and which came into\nAgrippa’s possession in 1520. This updating, however, depended\nfor the most part on epistolary exchanges of texts and ideas with his\ncorrespondents. Despite his violent attack on the divinatory arts in\nDe vanitate, he presented here a more comprehensive treatment\nof astrology. After all, magic (although “reformed”) could\nnot dispense with astrology. Occult virtues can be explained only in\nterms of the heavenly qualities conveyed by the rays which emanate\nfrom stars. It is each individual’s horoscope which determines\nhis or her specific powers. Even the relationships of\n“attraction or repulsion” (amicitia vel lis)\nbetween sublunary bodies correspond to the relationships between\ncelestial bodies. Agrippa insistently emphasizes the link connecting\nmagic to astrology, defining the latter as “the much-needed key\nfor all secrets”. In recognizing the pivotal role played by\nastrology, Agrippa seems to contradict his harsh judgment of this\nscience in De vanitate: fallacious conjecture, practiced by\nsuperstitious, ignorant, and mendacious followers. The contradiction\nis only apparent, however. Like any other human science, astrology is\nboth bad and good. It is bad in the hands of those who pass off a\nconjecture as an infallible fact, thus denying man’s freedom and\nthe divine providential design. It is good in the hands of the\nChristian magus, who uses it to reveal that God shines everywhere and\nto benefit his own kind. In the context of Agrippa’s purpose in\nDe occulta philosophia, good (that is, non-deterministic)\nastrology remains the key to rebuilding true Christian magic.\n\nBook III was most affected by Agrippa’s meticulous recasting of\nthe treatise. Through his contact with Latin kabbalistic texts (both,\ntranslations from Hebrew literature as well as works by Christian\nfollowers), Agrippa was able to insert many new chapters: on the\nSephiroth, that is, the ten attributes or emanations\nsurrounding the infinite; on the ten names of God; and on angels and\ndemons. His (second-hand) openness to the Hebrew tradition inspired a\nmore mature approach to a number of essential issues. In particular,\nthe topic that humanity is created “in the image of God”\nbecame a more developed account of the human being as a “small\nworld” (microcosmus). Juxtaposing the original nucleus,\ndrawn from his own unfinished Dialogus de homine\n(Dialogue on Humankind), with selected passages from the\ndoctrine of the Zohar, the most important kabbalistic work\n(via Giorgio’s De harmonia mundi), Agrippa was able to\nelaborate further his cherished doctrine of three parts of human soul.\nSince soul’s three parts (neshama, ruah, and\nnephesch in Hebrew) have different origins and natures, they\nalso have different destinies. After the body’s death, the\nsensitive soul (nephesch, idolum) immediately\ndissolves. Mind (neshama), as the breath of God, is immune\nfrom sin and returns immediately to its abode, reuniting with its\norigin. Reason (ruah), by contrast, must undergo judgment\nwith regard to the choices it has made in life: it will participate in\nthe beatific vision if it has followed the way of the mind; it will be\ndamned and reduced to the status of an evil demon if it has made\nitself a slave of the sensitive soul. In this way, the topic of\nhumankind as created in the image of God assumed a more defined\neschatological meaning. In Agrippa’s view, the Pauline\n“You are the temple of God” (I Corinthians 3:16) meant\nrecognizing the presence of God in each human being—the mind,\nwhich characterizes the peculiar dignity of the microcosmus\nin conformity with humankind’s privilege of being made in the\nimage of God. Interiority became the foundation of the intellectual\nand religious life. The cultural background of the magus must be\nwide-ranging, but his claim to perfection is to be founded on his\nself-consciousness.\n\nThe path to attaining wisdom requires moral and intellectual training\n(dignificatio). Firstly, “natural” perfection\n(dignitas) is needed, that is, the perfect physical and\nmental disposition granted by a favorable horoscope (the same which\nJesus Christ had). Avicenna’s doctrine of the “perfect\nhuman being” (homo perfectus), the prophet, is\nrecognizable here. According to Agrippa, however, those who were not\nborn under this favorable constellation can replace the natural\ndignitas which they lack with an “artificial”\none, using selected foodstuffs, natural remedies, and a proper\nlifestyle. The second requirement is the “merit”\n(dignitas meritoria), that is, the overcoming of corporeal\npassions and sensitive impressions, the recovery of knowledge, and the\nmastery of everything: when reason subjects itself to mind,\nman’s soul becomes a “soul standing and not falling”\n(anima stans et non cadens) and is able to perform miracles\n“by God’s virtue” (in virtute Dei). The\nthird requirement is “godliness” (ars religiosa),\nthat is, the constant and pious practicing of sacred ceremonies, which\nare metaphors and perceptible signs of the transformation worked by\nGod in us. This does not mean the requirement to carry out initiatory\nrituals in order to gain access to esoteric and supra-rational\nmysteries. Agrippa’s appeal to spiritual purification was\nessential precisely because his book made known to everyone the\n‘secrets’ of magic. Only a person who is “perfectly\npious and truly religious”, however, can legitimately perform\n‘true’ and ‘pure’ magic. This is why spiritual\nrebirth (and, hence, magic) is not available to everyone: the divine\nspark which is naturally present in each individual is completely\ninactive in the majority of humankind, whose reason is overwhelmed by\nthe impulses of their senses.\n\nAgrippa’s overall oeuvre may be regarded as an\nuninterrupted meditation on humanity: the meaning of its existence,\nits possibility of gaining not only eternal bliss, but also happiness\non earth. From this point of view, Agrippa may be considered as a\n“humanist theologian” (Van der Poel 1997). Nonetheless, he\nproposed a radical revision of the very idea of theology. It should\nnot be a “subalternating” or higher “science”,\nplaced at the end of a long and complex training, as medieval\nscholastics had done. Instead, theology must be an isagogic, or\nintroductory, knowledge, since its task was to guide Christian people\nin their moral improvement, as well as in their earthly well-being.\nAgrippa’s theology, more than a philosophical treatment of God,\nwas, above all, a serious reflection on humankind, with the goal of\nleading it to self-consciousness and, then, making it fully aware of\nits origin and its final end. Ultimately, Agrippa may be better\ndefined as a “civic theologian”. The specific intentions\nof his works, their literary genres, and the personal background to\ntheir composition are all very different, which to some extent may\nexplain certain inconsistencies between them. Nevertheless, despite\nevery apparent contradiction and ambiguity presented by an impetuous,\npolemical, and very often foolhardy personality such as Agrippa, he\nalways assessed human knowledge (including magic) with respect to its\nawareness of the relationship which binds man to God. The way to truth\nlies not in the rifts between different schools of thought or in\nphilosophical distinctions, but in self-knowledge and\nself-awareness.\n",
    "section_title": "5. De occulta philosophia (final draft)",
    "entry_title": "Heinrich Cornelius Agrippa von Nettesheim",
    "hierarchy_title": "Heinrich Cornelius Agrippa von Nettesheim || De incertitudine et vanitate scientiarum",
    "tokenized_text": [
        "de",
        "incertitudine",
        "et",
        "vanitate",
        "scientiarum",
        "de",
        "occulta",
        "philosophia",
        "final",
        "draft",
        "de",
        "vanitate",
        "agrippa",
        "make",
        "explicit",
        "recantation",
        "passion",
        "occult",
        "science",
        "keefer",
        "simply",
        "admitted",
        "might",
        "something",
        "wrong",
        "juvenile",
        "work",
        "magic",
        "adolescent",
        "curiosity",
        "fact",
        "renewal",
        "magic",
        "continued",
        "central",
        "feature",
        "intellectual",
        "journey",
        "right",
        "middle",
        "violent",
        "battle",
        "theologian",
        "conservative",
        "preparing",
        "de",
        "occulta",
        "philosophia",
        "publication",
        "entrusting",
        "last",
        "hope",
        "secure",
        "financial",
        "support",
        "work",
        "committed",
        "desire",
        "fame",
        "fortune",
        "twenty",
        "year",
        "earlier",
        "although",
        "meantime",
        "religious",
        "concern",
        "deepened",
        "perceive",
        "conflict",
        "involvement",
        "theological",
        "debate",
        "persistent",
        "interest",
        "task",
        "rebuilding",
        "magic",
        "mind",
        "two",
        "coherent",
        "aspect",
        "single",
        "project",
        "already",
        "pointed",
        "de",
        "triplici",
        "ratione",
        "cognoscendi",
        "deum",
        "agrippa",
        "made",
        "clear",
        "reforming",
        "culture",
        "basis",
        "solid",
        "certainty",
        "god",
        "illumination",
        "also",
        "implied",
        "regaining",
        "humankind",
        "original",
        "perfection",
        "thaumaturgic",
        "ability",
        "adam",
        "owned",
        "right",
        "sinned",
        "comparison",
        "dedication",
        "copy",
        "sent",
        "agrippa",
        "trithemius",
        "m",
        "würzburg",
        "mchq",
        "printed",
        "final",
        "edition",
        "cologne",
        "reveals",
        "careful",
        "thorough",
        "revision",
        "enlargement",
        "first",
        "draft",
        "subjected",
        "book",
        "doubled",
        "length",
        "fresh",
        "idea",
        "reference",
        "included",
        "updating",
        "text",
        "agrippa",
        "mostly",
        "drew",
        "work",
        "consistent",
        "source",
        "already",
        "used",
        "drafting",
        "initial",
        "version",
        "studied",
        "number",
        "text",
        "previously",
        "unaware",
        "neglected",
        "ficino",
        "commentary",
        "plato",
        "plotinus",
        "giovanni",
        "pico",
        "conclusiones",
        "heptaplus",
        "disputationes",
        "adversus",
        "astrologiam",
        "divinatricem",
        "lodovico",
        "lazzarelli",
        "crater",
        "hermetis",
        "gianfrancesco",
        "pico",
        "de",
        "rerum",
        "praenotione",
        "published",
        "meantime",
        "erasmus",
        "writing",
        "paulus",
        "ricius",
        "commentary",
        "hebrew",
        "writing",
        "reuchlin",
        "de",
        "arte",
        "cabalistica",
        "francesco",
        "giorgio",
        "de",
        "harmonia",
        "mundi",
        "agrippa",
        "vast",
        "exploration",
        "book",
        "allowed",
        "reorient",
        "youthful",
        "project",
        "providing",
        "definitive",
        "justification",
        "aim",
        "restore",
        "full",
        "religious",
        "cognitive",
        "practical",
        "scope",
        "ancient",
        "magic",
        "reformed",
        "magic",
        "magia",
        "reformata",
        "would",
        "guarantee",
        "magus",
        "mastery",
        "nature",
        "ability",
        "attract",
        "astral",
        "angelic",
        "virtue",
        "would",
        "also",
        "assure",
        "ascent",
        "first",
        "principle",
        "revised",
        "version",
        "de",
        "occulta",
        "philosophia",
        "offer",
        "extensive",
        "proof",
        "significant",
        "qualitative",
        "shift",
        "original",
        "tripartite",
        "structure",
        "given",
        "new",
        "metaphysical",
        "structure",
        "powerfully",
        "underlined",
        "idea",
        "cosmos",
        "epiphany",
        "divine",
        "thanks",
        "influence",
        "giorgio",
        "de",
        "harmonia",
        "mundi",
        "agrippa",
        "able",
        "adopt",
        "radically",
        "new",
        "approach",
        "natural",
        "magic",
        "book",
        "explicitly",
        "contemplates",
        "material",
        "world",
        "receptacle",
        "divine",
        "present",
        "occult",
        "virtue",
        "example",
        "living",
        "link",
        "connecting",
        "terrestrial",
        "form",
        "first",
        "cause",
        "chain",
        "higher",
        "intermediary",
        "star",
        "spiritual",
        "essence",
        "perfection",
        "science",
        "practice",
        "guaranteed",
        "ability",
        "change",
        "impure",
        "back",
        "pure",
        "plurality",
        "back",
        "simplicity",
        "significant",
        "addition",
        "property",
        "element",
        "chapter",
        "william",
        "newman",
        "recognized",
        "description",
        "alchemical",
        "reduction",
        "elemental",
        "earth",
        "purity",
        "first",
        "matter",
        "three",
        "order",
        "element",
        "corresponding",
        "three",
        "level",
        "pure",
        "element",
        "unmixed",
        "incorruptible",
        "compound",
        "element",
        "multiplex",
        "varied",
        "impure",
        "reduced",
        "pure",
        "simplicity",
        "pura",
        "simplicitas",
        "lastly",
        "decomposed",
        "element",
        "convertible",
        "one",
        "another",
        "earth",
        "confers",
        "solidity",
        "element",
        "mixing",
        "without",
        "changing",
        "receptacle",
        "every",
        "celestial",
        "influence",
        "continuously",
        "animated",
        "virtue",
        "conveyed",
        "spiritus",
        "earth",
        "foundation",
        "mother",
        "everything",
        "encloses",
        "seminal",
        "virtue",
        "creation",
        "therefore",
        "undergone",
        "process",
        "purification",
        "simplification",
        "becomes",
        "purest",
        "remedy",
        "restoring",
        "preserving",
        "u",
        "process",
        "universal",
        "simplification",
        "element",
        "carried",
        "reducing",
        "earth",
        "original",
        "purity",
        "first",
        "matter",
        "newman",
        "explained",
        "nature",
        "process",
        "referring",
        "chapter",
        "book",
        "ii",
        "power",
        "number",
        "one",
        "agrippa",
        "trace",
        "presence",
        "unity",
        "level",
        "existence",
        "god",
        "archetypal",
        "world",
        "anima",
        "mundi",
        "intellectual",
        "one",
        "sun",
        "heavenly",
        "world",
        "heart",
        "man",
        "lucifer",
        "hell",
        "elemental",
        "world",
        "one",
        "philosopher",
        "stone",
        "embodying",
        "wonder",
        "without",
        "neither",
        "alchemy",
        "natural",
        "magic",
        "may",
        "attain",
        "perfect",
        "end",
        "agrippa",
        "source",
        "newman",
        "pointed",
        "letter",
        "trithemius",
        "gave",
        "cosmological",
        "interpretation",
        "hermetic",
        "text",
        "emerald",
        "tablet",
        "tabula",
        "smaragdina",
        "identifying",
        "alchemical",
        "opus",
        "universal",
        "path",
        "highest",
        "unity",
        "epistolae",
        "pp",
        "book",
        "ii",
        "introduces",
        "massive",
        "quantity",
        "technical",
        "reference",
        "part",
        "influenced",
        "corpus",
        "magical",
        "manuscript",
        "belonged",
        "trithemius",
        "came",
        "agrippa",
        "possession",
        "updating",
        "however",
        "depended",
        "part",
        "epistolary",
        "exchange",
        "text",
        "idea",
        "correspondent",
        "despite",
        "violent",
        "attack",
        "divinatory",
        "art",
        "de",
        "vanitate",
        "presented",
        "comprehensive",
        "treatment",
        "astrology",
        "magic",
        "although",
        "reformed",
        "could",
        "dispense",
        "astrology",
        "occult",
        "virtue",
        "explained",
        "term",
        "heavenly",
        "quality",
        "conveyed",
        "ray",
        "emanate",
        "star",
        "individual",
        "horoscope",
        "determines",
        "specific",
        "power",
        "even",
        "relationship",
        "attraction",
        "repulsion",
        "amicitia",
        "vel",
        "li",
        "sublunary",
        "body",
        "correspond",
        "relationship",
        "celestial",
        "body",
        "agrippa",
        "insistently",
        "emphasizes",
        "link",
        "connecting",
        "magic",
        "astrology",
        "defining",
        "latter",
        "muchneeded",
        "key",
        "secret",
        "recognizing",
        "pivotal",
        "role",
        "played",
        "astrology",
        "agrippa",
        "seems",
        "contradict",
        "harsh",
        "judgment",
        "science",
        "de",
        "vanitate",
        "fallacious",
        "conjecture",
        "practiced",
        "superstitious",
        "ignorant",
        "mendacious",
        "follower",
        "contradiction",
        "apparent",
        "however",
        "like",
        "human",
        "science",
        "astrology",
        "bad",
        "good",
        "bad",
        "hand",
        "pas",
        "conjecture",
        "infallible",
        "fact",
        "thus",
        "denying",
        "man",
        "freedom",
        "divine",
        "providential",
        "design",
        "good",
        "hand",
        "christian",
        "magus",
        "us",
        "reveal",
        "god",
        "shine",
        "everywhere",
        "benefit",
        "kind",
        "context",
        "agrippa",
        "purpose",
        "de",
        "occulta",
        "philosophia",
        "good",
        "nondeterministic",
        "astrology",
        "remains",
        "key",
        "rebuilding",
        "true",
        "christian",
        "magic",
        "book",
        "iii",
        "affected",
        "agrippa",
        "meticulous",
        "recasting",
        "treatise",
        "contact",
        "latin",
        "kabbalistic",
        "text",
        "translation",
        "hebrew",
        "literature",
        "well",
        "work",
        "christian",
        "follower",
        "agrippa",
        "able",
        "insert",
        "many",
        "new",
        "chapter",
        "sephiroth",
        "ten",
        "attribute",
        "emanation",
        "surrounding",
        "infinite",
        "ten",
        "name",
        "god",
        "angel",
        "demon",
        "secondhand",
        "openness",
        "hebrew",
        "tradition",
        "inspired",
        "mature",
        "approach",
        "number",
        "essential",
        "issue",
        "particular",
        "topic",
        "humanity",
        "created",
        "image",
        "god",
        "became",
        "developed",
        "account",
        "human",
        "small",
        "world",
        "microcosmus",
        "juxtaposing",
        "original",
        "nucleus",
        "drawn",
        "unfinished",
        "dialogus",
        "de",
        "homine",
        "dialogue",
        "humankind",
        "selected",
        "passage",
        "doctrine",
        "zohar",
        "important",
        "kabbalistic",
        "work",
        "via",
        "giorgio",
        "de",
        "harmonia",
        "mundi",
        "agrippa",
        "able",
        "elaborate",
        "cherished",
        "doctrine",
        "three",
        "part",
        "human",
        "soul",
        "since",
        "soul",
        "three",
        "part",
        "neshama",
        "ruah",
        "nephesch",
        "hebrew",
        "different",
        "origin",
        "nature",
        "also",
        "different",
        "destiny",
        "body",
        "death",
        "sensitive",
        "soul",
        "nephesch",
        "idolum",
        "immediately",
        "dissolve",
        "mind",
        "neshama",
        "breath",
        "god",
        "immune",
        "sin",
        "return",
        "immediately",
        "abode",
        "reuniting",
        "origin",
        "reason",
        "ruah",
        "contrast",
        "must",
        "undergo",
        "judgment",
        "regard",
        "choice",
        "made",
        "life",
        "participate",
        "beatific",
        "vision",
        "followed",
        "way",
        "mind",
        "damned",
        "reduced",
        "status",
        "evil",
        "demon",
        "made",
        "slave",
        "sensitive",
        "soul",
        "way",
        "topic",
        "humankind",
        "created",
        "image",
        "god",
        "assumed",
        "defined",
        "eschatological",
        "meaning",
        "agrippa",
        "view",
        "pauline",
        "temple",
        "god",
        "corinthian",
        "meant",
        "recognizing",
        "presence",
        "god",
        "human",
        "beingthe",
        "mind",
        "characterizes",
        "peculiar",
        "dignity",
        "microcosmus",
        "conformity",
        "humankind",
        "privilege",
        "made",
        "image",
        "god",
        "interiority",
        "became",
        "foundation",
        "intellectual",
        "religious",
        "life",
        "cultural",
        "background",
        "magus",
        "must",
        "wideranging",
        "claim",
        "perfection",
        "founded",
        "selfconsciousness",
        "path",
        "attaining",
        "wisdom",
        "requires",
        "moral",
        "intellectual",
        "training",
        "dignificatio",
        "firstly",
        "natural",
        "perfection",
        "dignitas",
        "needed",
        "perfect",
        "physical",
        "mental",
        "disposition",
        "granted",
        "favorable",
        "horoscope",
        "jesus",
        "christ",
        "avicenna",
        "doctrine",
        "perfect",
        "human",
        "homo",
        "perfectus",
        "prophet",
        "recognizable",
        "according",
        "agrippa",
        "however",
        "born",
        "favorable",
        "constellation",
        "replace",
        "natural",
        "dignitas",
        "lack",
        "artificial",
        "one",
        "using",
        "selected",
        "foodstuff",
        "natural",
        "remedy",
        "proper",
        "lifestyle",
        "second",
        "requirement",
        "merit",
        "dignitas",
        "meritoria",
        "overcoming",
        "corporeal",
        "passion",
        "sensitive",
        "impression",
        "recovery",
        "knowledge",
        "mastery",
        "everything",
        "reason",
        "subject",
        "mind",
        "man",
        "soul",
        "becomes",
        "soul",
        "standing",
        "falling",
        "anima",
        "stans",
        "et",
        "non",
        "cadens",
        "able",
        "perform",
        "miracle",
        "god",
        "virtue",
        "virtute",
        "dei",
        "third",
        "requirement",
        "godliness",
        "ar",
        "religiosa",
        "constant",
        "pious",
        "practicing",
        "sacred",
        "ceremony",
        "metaphor",
        "perceptible",
        "sign",
        "transformation",
        "worked",
        "god",
        "u",
        "mean",
        "requirement",
        "carry",
        "initiatory",
        "ritual",
        "order",
        "gain",
        "access",
        "esoteric",
        "suprarational",
        "mystery",
        "agrippa",
        "appeal",
        "spiritual",
        "purification",
        "essential",
        "precisely",
        "book",
        "made",
        "known",
        "everyone",
        "secret",
        "magic",
        "person",
        "perfectly",
        "pious",
        "truly",
        "religious",
        "however",
        "legitimately",
        "perform",
        "true",
        "pure",
        "magic",
        "spiritual",
        "rebirth",
        "hence",
        "magic",
        "available",
        "everyone",
        "divine",
        "spark",
        "naturally",
        "present",
        "individual",
        "completely",
        "inactive",
        "majority",
        "humankind",
        "whose",
        "reason",
        "overwhelmed",
        "impulse",
        "sens",
        "agrippa",
        "overall",
        "oeuvre",
        "may",
        "regarded",
        "uninterrupted",
        "meditation",
        "humanity",
        "meaning",
        "existence",
        "possibility",
        "gaining",
        "eternal",
        "bliss",
        "also",
        "happiness",
        "earth",
        "point",
        "view",
        "agrippa",
        "may",
        "considered",
        "humanist",
        "theologian",
        "van",
        "der",
        "poel",
        "nonetheless",
        "proposed",
        "radical",
        "revision",
        "idea",
        "theology",
        "subalternating",
        "higher",
        "science",
        "placed",
        "end",
        "long",
        "complex",
        "training",
        "medieval",
        "scholastic",
        "done",
        "instead",
        "theology",
        "must",
        "isagogic",
        "introductory",
        "knowledge",
        "since",
        "task",
        "guide",
        "christian",
        "people",
        "moral",
        "improvement",
        "well",
        "earthly",
        "wellbeing",
        "agrippa",
        "theology",
        "philosophical",
        "treatment",
        "god",
        "serious",
        "reflection",
        "humankind",
        "goal",
        "leading",
        "selfconsciousness",
        "making",
        "fully",
        "aware",
        "origin",
        "final",
        "end",
        "ultimately",
        "agrippa",
        "may",
        "better",
        "defined",
        "civic",
        "theologian",
        "specific",
        "intention",
        "work",
        "literary",
        "genre",
        "personal",
        "background",
        "composition",
        "different",
        "extent",
        "may",
        "explain",
        "certain",
        "inconsistency",
        "nevertheless",
        "despite",
        "every",
        "apparent",
        "contradiction",
        "ambiguity",
        "presented",
        "impetuous",
        "polemical",
        "often",
        "foolhardy",
        "personality",
        "agrippa",
        "always",
        "assessed",
        "human",
        "knowledge",
        "including",
        "magic",
        "respect",
        "awareness",
        "relationship",
        "bind",
        "man",
        "god",
        "way",
        "truth",
        "lie",
        "rift",
        "different",
        "school",
        "thought",
        "philosophical",
        "distinction",
        "selfknowledge",
        "selfawareness"
    ]
}