{
    "main_text": "De incertitudine et vanitate scientiarum\n4. De incertitudine et vanitate scientiarum\n\nIt is not possible to establish the extent to which the declamatio\ninvectiva which Agrippa announced to his friend Jean Chapelain in\nSeptember 1526 was really finished at that time. We do know, however,\nthat when Johannes Grapheus published it in 1530, some parts at least\nhad been expanded and reworked, according to Agrippa’s custom\n(Nauert 1965: 108, n. 11; Zambelli 1992: 81, n. 40). The work was\nreprinted many times and was also translated into German (1534),\nItalian (1543), English (1569), French (1582), and Dutch (1651).\n\nRichard Popkin underlined that Agrippa’s declamation does not\ncontain the “serious epistemological analysis” one would\nexpect from a skeptical debate and suggested that it should be\nconsidered as an expression of anti-intellectualism and biblical\nfundamentalism (Popkin 2003: 29). This reading, however, leaves the\nkey question unresolved: such an anti-intellectualism or biblical\nfundamentalism is difficult to reconcile with Agrippa’s\nlong-standing interest in precisely those sciences which by then\nshould have been swept away by the appeal to verbum Dei\n(“word of God”). It is undeniably true that in De\nvanitate the moral angle prevails over the epistemological\ncritique. This is because Agrippa also looked at trades, professions,\npastimes, and social types, none of which were susceptible to\nepistemological analysis. Moreover, when discussing a science, he was\nprimarily interested in focusing on how it was used and on its\nconcrete effects on society, rather than in investigating its methods\nand subjects. Some scholars have identified De vanitate as\nthe result of a profound personal crisis (psychological, religious, or\ncultural), which led Agrippa to a radical criticism of the system of\noccult doctrines and of his own intellectual choices. No doubt, the\ncircumstances of his life between 1526 and 1530 influenced the tone of\nthe work which he was preparing, accentuating its harshness and\ninspiring some of its more polemical and audacious pages. Nonetheless,\nit is unlikely that, all of the sudden, Agrippa abandoned his\nphilosophical convictions, solely because of indignation at the\ntreatment he suffered at the court of Louise of Savoy (Weeks 1993:\n120–24). Likewise, the hypothesis of an intellectual upheaval\n(Keefer 1988: 614–53; Zambelli 2000: 41) remains merely\nconjectural. Agrippa’s supposed disbelief in science (and, above\nall, in astrology and magic) contrasts with his continuing work on\nDe occulta philosophia and with his project for a reform of\nthe magical tradition, based on a new vision of science. It is\nimportant to recognize that there were serious motivations behind his\nfierce attack on the foundations of knowledge. Bowen (1972:\n249–56) and Korkowski (1976: 594–607), reducing De\nvanitate to a simple exercise of rhetoric in the fashionable\nliterary genre of the paradox, correctly outlined the work’s\nformal characteristics; however, they did not sufficiently take into\naccount its philosophical intentions and turned its subversive\nimplications into something quite inoffensive. De vanitate\nproposed a reform project, one which was broader, more complex, and\nmore radical than that of its model, Erasmus’ Praise of\nFolly (Laus stultitiae).\n\nAgrippa’s aim was to pass judgment on the condition, methods,\nand practitioners of the philosophical and theological schools which\ndominated his time. His verdict is undoubtedly very severe. He\nbelieved that contemporary culture, lost in useless sophisms, was no\nlonger able to fulfill its task of educating Christian people and\npromoting their spiritual well-being. The social fabric had become\ntorn by corruption, by political and religious struggles, and by\nheresies and superstitions. He did not, however, intend De\nvanitate to be merely destructive. His aim was also to propose a\ncultural alternative, delineating a different philosophical approach,\ncapable of forming a new intellectual élite, who would be\nseriously interested in the moral and religious progress of human\ncommunity.\n\nCertainly, the most striking aspect of the declamatio is its\ncritical stance. The all-encompassing polemical parade emphasizes that\nhuman “inventions” (inventiones)—grammar as\nwell as dance, theology as well as hunting, ethics as well as dice\ngames—are nothing more than opinions, devoid of coherence and\nstability, and irreparably harmful to support the spiritual health of\nbelievers. The discord which divides practitioners of each branch of\nscience attests to the intrinsic weakness of the findings of natural\nreason, which proceeds by conjectures, subject to refutation.\nEverything reason devises and carries out, relying on its own strength\nalone, is fallacious, useless, and damaging: “the structure of\nthe sciences is so risky and unstable that it is much safer not to\nknow anything than to have knowledge” (1, p. 5). The happiest\nlife is the life of the ignorant.\n\nThe usual compilation of discordant opinions of philosophers was\npartly shaped by texts of the ancient skeptics; but for the most part\nAgrippa made use of more recent sources: Ficino, Reuchlin, and\nFrancesco Giorgio Veneto. There are no quotations from Gianfrancesco\nPico’s Examen vanitatis doctrinae gentium, the first\ndetailed reading of the work of Sextus Empiricus (Schmitt 1967:\n237–42). This significant omission suggests that Agrippa did not\nagree with the skeptical fideism expressed by Gianfrancesco. De\nvanitate did not, in fact, question the human ability to know\ncauses. Rather, it questioned the capacity of Aristotelian\nepistemology to account for the nature of things. In chapter 7,\nAgrippa states that knowledge based on sense perception is not able to\nguarantee a sure and truthful experience, since the senses are\nfallible; nor does it succeed in revealing the causes and properties\nof phenomena or in knowing what is only intelligible, since this\nescapes the grasp of the senses. Not all human knowledge was open to\nquestion, however. Instead, Agrippa, by proving that a sense-based\ntheory of knowledge cannot produce science, intended to introduce\nanother epistemology, one which he regarded as the foundation for true\nknowledge. So, in chapter 52, “On the Soul”, he did not\nuphold even the façade of skepticism. “Demonic\nAristotle” (daemoniacus Aristoteles) made the soul\ndependent on the nature of the body, defining it as “the first\nperfection of a natural body possessing organs, which potentially has\nlife” (Aristotle, De anima II.1). “Divine\nPlato” (divinus ille Plato) aligned himself with those\nphilosophers (Zoroaster, Hermes, and Orpheus) who had defined the soul\nas a divine substance: the “product of an incorporeal\nmaker” and dependent “solely on the power of its efficient\ncause, not on the bowels of matter” (52, pp. 109–10). Agrippa\nnoted the disagreement between Aristotle and Plato on this subject,\nnot in order to lead his readers to a skeptical “suspension of\njudgment” (epoché). Rather, he intentionally\ncontrasted two different models of rationality, explicitly weighing up\ntheir value. At least on this matter, the “ancient\ntheology” (prisca theologia) and the Platonic school\nwere found to be consistent with the criterion of truth, the Holy\nScriptures.\n\nThe real intentions of De vanitate have to be extracted from\ndeep inside the text, hidden beneath more polemical and provocative\nstatements. The sciences of their own accord “do not procure for\nus any divine felicity which transcends the capacity of man, except\nperhaps that felicity which the serpent promised to our\nancestors”; but in itself “every science is both bad and\ngood” and deserves whatever praise “it can derive from the\nprobity of its possessor” (1, p. 21). Agrippa appropriated here\nthe Aristotelian principle of the ethical neutrality of science: it is\nthe spiritual attitude of the knower, his “integrity”\n(probitas), which constitutes the moral criterion of the\ndiscipline and ensures good or bad usage. From the cultural point of\nview, the destructive action of skepticism puts an end to the\ndiscussion between the schools by eliminating one of the two\ncontenders, that is, all philosophers whose doctrines are built on the\nfoundation of sensory experience. From the pedagogical point of view,\nhowever, skepticism is no more than a preliminary training. Systematic\ndebate about sensory representations and the suspension of judgment\nconcerning the appearances of the material world free the soul from\nfalse opinions, demonstrating the inadequacy of empiricism and\ndirecting the search for truth towards the intelligible.\n\nPurification leads to a new spiritual attitude, which makes the\nphilosopher capable of undertaking the route to true knowledge. Truth,\nin fact, is grasped only by turning inwards, to the mind, where God\nimplanted the innate ideas when he created the soul. Agrippa’s\nacceptance of the Neoplatonic theory of knowledge is positively\nexpressed in the final peroration of De vanitate, when he\ninvites his readers to abandon the schools of the sophists in order to\nregain awareness of the cognitive inheritance to which every soul has\nan original entitlement. Agrippa refers to the Academics alongside\nHoly Scripture to support the idea that human beings have an innate\nrealm of knowledge, which needs to be recovered by means of a suitable\npaideia, or program of education. The return to original\nperfection is an ‘illumination’—not a mystical\nillumination, but an intellectual one: the reminiscence and\nre-appropriation of self-knowledge. Ultimately, illumination is the\nknowledge of the self as “mind” (mens) or\n“intellect” (intellectus).\n\nIn this sense, Agrippa defines faith as the “foundation of\nreason” (fundamentum rationis), that is, the criterion,\nguarantee, and firm basis of human knowledge. Revelation is without\ndoubt the absolute and complete expression of truth; but it originates\nfrom the same source as the contents of the mind, on which the\nactivity of reason is dependent. Since God is the sole source of\ntruth, the tradition of faith is homogeneous with philosophical\ncontemplation, which finds its justification in revelation. Through\ndivine will, rationality and its higher level of “spiritual\nintelligence” are able to establish a relationship of\ncontinuity. For this reason, rational science and all its practical\napplications gain authenticity and legitimacy if they develop within a\ntheological framework. This does not mean that reason has to draw its\ncontents directly from Scripture. Rather, it means that the contents\nof science, procured by the exercise of reason, are “true”\nwhen they do not contradict divine design, do not hinder the spiritual\nprogress of the Christian, and contribute to the good of humanity and\nthe world. Certainly, the architect will not seek technical\ninstructions for how to put up his building in the Bible. Instead, he\nand those who commission him need to seek in it an indication of the\n“manner” (modus) and “end”\n(finis) of this discipline. Architecture would be an art and\nscience “extraordinarily necessary and beautiful” in\nitself and capable of making a large contribution to the well-being of\nthe civil community, if humankind had not rendered it vain and noxious\nby their excessive use of it “for the simple exhibition of the\nriches” and by heedlessly destroying the natural\nsurroundings.\n\nIn De vanitate, Agrippa does not put faith in opposition to\nscience or the Holy Scriptures in opposition to human books. He\ninstead puts Aristotelian philosophy, worldly science and the source\nof unbelief in opposition to “Platonic” philosophy, the\nmodel of a Christian “science in the word of God”\n(scientia in verbo Dei). With this expression, Agrippa refers\nto a religiously orientated science: a science which can move freely\nin the sphere of the “visible manifestations of God”\n(visibilia Dei) in order to know his “invisible\nessentials” (invisibilia) and to trace the beginning\nand origin of everything. He does this in the awareness of the harmony\nbetween faith and reason, which scholastic Aristotelian philosophy had\ndisowned, infecting the world with a plague of “petty\nsyllogisms” (ratiunculae), sophisms, and impertinent\nquestions about God. There is, in sum, a ‘divine’ path to\nknowledge, which Plato and the ancient theologians founded on God and\nwhich deals with God. And there is a “demonic” path, which\nAristotle constituted merely on human abilities and which deals with\nlower things: it is demonic, because it renews and perpetuates the sin\nof Adam, inspired by Satan and his proud ambition to make himself\nequal to the creator in the knowledge of good and evil.\n\nAgrippa’s distinction between different forms of\nrationality—valued differently according to their basis and\ntheir final point of view—allows us to regard his declamatio\ninvectiva as not belonging to a true and proper profession of\nskepticism, of general anti-intellectualism, or of rigorous fideism.\nInstead, it can be realigned with the anti-Aristotelian and\nanti-scholastic critiques of Ficino, Reuchlin, and Giorgio. Agrippa\ndid not propose abandonment in God in the undifferentiated\nindifference of “neither this one nor that one” advocated\nby Sextus Empiricus. In his view, skepticism constituted an exercise\nin education, necessary for pointing the way towards the apprehension\nof truth. In the final digression, “In Praise of the Ass”,\nAgrippa seemingly invites his readers to put down the baggage of the\nhuman sciences and return to being “naked and simple\nasses”, and thus newly capable of carrying on their own backs\nthe mysteries of divine wisdom, like the ass which carried Jesus into\nJerusalem. This ironic exhortation is polemical: those who must be\nsubjected to metamorphosis into an ass are the “noble doctors in\nsciences”, professing a purely human (or rather, demonic)\nscience. For scholastic theologians, the motto “To know nothing\nis the happiest life” (nihil scire foelicissima vita)\nis valid, since “there is nothing more fatal than a science\nstuffed with impiety” (1, p. 4). Philosophy should be a\nreligious progress—or, rather, a regressus, a return to\nthe source of being.\n",
    "section_title": "4. De incertitudine et vanitate scientiarum",
    "entry_title": "Heinrich Cornelius Agrippa von Nettesheim",
    "hierarchy_title": "Heinrich Cornelius Agrippa von Nettesheim || De incertitudine et vanitate scientiarum",
    "tokenized_text": [
        "de",
        "incertitudine",
        "et",
        "vanitate",
        "scientiarum",
        "de",
        "incertitudine",
        "et",
        "vanitate",
        "scientiarum",
        "possible",
        "establish",
        "extent",
        "declamatio",
        "invectiva",
        "agrippa",
        "announced",
        "friend",
        "jean",
        "chapelain",
        "september",
        "really",
        "finished",
        "time",
        "know",
        "however",
        "johannes",
        "grapheus",
        "published",
        "part",
        "least",
        "expanded",
        "reworked",
        "according",
        "agrippa",
        "custom",
        "nauert",
        "n",
        "zambelli",
        "n",
        "work",
        "reprinted",
        "many",
        "time",
        "also",
        "translated",
        "german",
        "italian",
        "english",
        "french",
        "dutch",
        "richard",
        "popkin",
        "underlined",
        "agrippa",
        "declamation",
        "contain",
        "serious",
        "epistemological",
        "analysis",
        "one",
        "would",
        "expect",
        "skeptical",
        "debate",
        "suggested",
        "considered",
        "expression",
        "antiintellectualism",
        "biblical",
        "fundamentalism",
        "popkin",
        "reading",
        "however",
        "leaf",
        "key",
        "question",
        "unresolved",
        "antiintellectualism",
        "biblical",
        "fundamentalism",
        "difficult",
        "reconcile",
        "agrippa",
        "longstanding",
        "interest",
        "precisely",
        "science",
        "swept",
        "away",
        "appeal",
        "verbum",
        "dei",
        "word",
        "god",
        "undeniably",
        "true",
        "de",
        "vanitate",
        "moral",
        "angle",
        "prevails",
        "epistemological",
        "critique",
        "agrippa",
        "also",
        "looked",
        "trade",
        "profession",
        "pastime",
        "social",
        "type",
        "none",
        "susceptible",
        "epistemological",
        "analysis",
        "moreover",
        "discussing",
        "science",
        "primarily",
        "interested",
        "focusing",
        "used",
        "concrete",
        "effect",
        "society",
        "rather",
        "investigating",
        "method",
        "subject",
        "scholar",
        "identified",
        "de",
        "vanitate",
        "result",
        "profound",
        "personal",
        "crisis",
        "psychological",
        "religious",
        "cultural",
        "led",
        "agrippa",
        "radical",
        "criticism",
        "system",
        "occult",
        "doctrine",
        "intellectual",
        "choice",
        "doubt",
        "circumstance",
        "life",
        "influenced",
        "tone",
        "work",
        "preparing",
        "accentuating",
        "harshness",
        "inspiring",
        "polemical",
        "audacious",
        "page",
        "nonetheless",
        "unlikely",
        "sudden",
        "agrippa",
        "abandoned",
        "philosophical",
        "conviction",
        "solely",
        "indignation",
        "treatment",
        "suffered",
        "court",
        "louise",
        "savoy",
        "week",
        "likewise",
        "hypothesis",
        "intellectual",
        "upheaval",
        "keefer",
        "zambelli",
        "remains",
        "merely",
        "conjectural",
        "agrippa",
        "supposed",
        "disbelief",
        "science",
        "astrology",
        "magic",
        "contrast",
        "continuing",
        "work",
        "de",
        "occulta",
        "philosophia",
        "project",
        "reform",
        "magical",
        "tradition",
        "based",
        "new",
        "vision",
        "science",
        "important",
        "recognize",
        "serious",
        "motivation",
        "behind",
        "fierce",
        "attack",
        "foundation",
        "knowledge",
        "bowen",
        "korkowski",
        "reducing",
        "de",
        "vanitate",
        "simple",
        "exercise",
        "rhetoric",
        "fashionable",
        "literary",
        "genre",
        "paradox",
        "correctly",
        "outlined",
        "work",
        "formal",
        "characteristic",
        "however",
        "sufficiently",
        "take",
        "account",
        "philosophical",
        "intention",
        "turned",
        "subversive",
        "implication",
        "something",
        "quite",
        "inoffensive",
        "de",
        "vanitate",
        "proposed",
        "reform",
        "project",
        "one",
        "broader",
        "complex",
        "radical",
        "model",
        "erasmus",
        "praise",
        "folly",
        "laus",
        "stultitiae",
        "agrippa",
        "aim",
        "pas",
        "judgment",
        "condition",
        "method",
        "practitioner",
        "philosophical",
        "theological",
        "school",
        "dominated",
        "time",
        "verdict",
        "undoubtedly",
        "severe",
        "believed",
        "contemporary",
        "culture",
        "lost",
        "useless",
        "sophism",
        "longer",
        "able",
        "fulfill",
        "task",
        "educating",
        "christian",
        "people",
        "promoting",
        "spiritual",
        "wellbeing",
        "social",
        "fabric",
        "become",
        "torn",
        "corruption",
        "political",
        "religious",
        "struggle",
        "heresy",
        "superstition",
        "however",
        "intend",
        "de",
        "vanitate",
        "merely",
        "destructive",
        "aim",
        "also",
        "propose",
        "cultural",
        "alternative",
        "delineating",
        "different",
        "philosophical",
        "approach",
        "capable",
        "forming",
        "new",
        "intellectual",
        "élite",
        "would",
        "seriously",
        "interested",
        "moral",
        "religious",
        "progress",
        "human",
        "community",
        "certainly",
        "striking",
        "aspect",
        "declamatio",
        "critical",
        "stance",
        "allencompassing",
        "polemical",
        "parade",
        "emphasizes",
        "human",
        "invention",
        "inventiones",
        "grammar",
        "well",
        "dance",
        "theology",
        "well",
        "hunting",
        "ethic",
        "well",
        "dice",
        "gamesare",
        "nothing",
        "opinion",
        "devoid",
        "coherence",
        "stability",
        "irreparably",
        "harmful",
        "support",
        "spiritual",
        "health",
        "believer",
        "discord",
        "divide",
        "practitioner",
        "branch",
        "science",
        "attests",
        "intrinsic",
        "weakness",
        "finding",
        "natural",
        "reason",
        "proceeds",
        "conjecture",
        "subject",
        "refutation",
        "everything",
        "reason",
        "devise",
        "carry",
        "relying",
        "strength",
        "alone",
        "fallacious",
        "useless",
        "damaging",
        "structure",
        "science",
        "risky",
        "unstable",
        "much",
        "safer",
        "know",
        "anything",
        "knowledge",
        "p",
        "happiest",
        "life",
        "life",
        "ignorant",
        "usual",
        "compilation",
        "discordant",
        "opinion",
        "philosopher",
        "partly",
        "shaped",
        "text",
        "ancient",
        "skeptic",
        "part",
        "agrippa",
        "made",
        "use",
        "recent",
        "source",
        "ficino",
        "reuchlin",
        "francesco",
        "giorgio",
        "veneto",
        "quotation",
        "gianfrancesco",
        "pico",
        "examen",
        "vanitatis",
        "doctrinae",
        "gentium",
        "first",
        "detailed",
        "reading",
        "work",
        "sextus",
        "empiricus",
        "schmitt",
        "significant",
        "omission",
        "suggests",
        "agrippa",
        "agree",
        "skeptical",
        "fideism",
        "expressed",
        "gianfrancesco",
        "de",
        "vanitate",
        "fact",
        "question",
        "human",
        "ability",
        "know",
        "cause",
        "rather",
        "questioned",
        "capacity",
        "aristotelian",
        "epistemology",
        "account",
        "nature",
        "thing",
        "chapter",
        "agrippa",
        "state",
        "knowledge",
        "based",
        "sense",
        "perception",
        "able",
        "guarantee",
        "sure",
        "truthful",
        "experience",
        "since",
        "sens",
        "fallible",
        "succeed",
        "revealing",
        "cause",
        "property",
        "phenomenon",
        "knowing",
        "intelligible",
        "since",
        "escape",
        "grasp",
        "sens",
        "human",
        "knowledge",
        "open",
        "question",
        "however",
        "instead",
        "agrippa",
        "proving",
        "sensebased",
        "theory",
        "knowledge",
        "produce",
        "science",
        "intended",
        "introduce",
        "another",
        "epistemology",
        "one",
        "regarded",
        "foundation",
        "true",
        "knowledge",
        "chapter",
        "soul",
        "uphold",
        "even",
        "façade",
        "skepticism",
        "demonic",
        "aristotle",
        "daemoniacus",
        "aristoteles",
        "made",
        "soul",
        "dependent",
        "nature",
        "body",
        "defining",
        "first",
        "perfection",
        "natural",
        "body",
        "possessing",
        "organ",
        "potentially",
        "life",
        "aristotle",
        "de",
        "anima",
        "ii",
        "divine",
        "plato",
        "divinus",
        "ille",
        "plato",
        "aligned",
        "philosopher",
        "zoroaster",
        "hermes",
        "orpheus",
        "defined",
        "soul",
        "divine",
        "substance",
        "product",
        "incorporeal",
        "maker",
        "dependent",
        "solely",
        "power",
        "efficient",
        "cause",
        "bowel",
        "matter",
        "pp",
        "agrippa",
        "noted",
        "disagreement",
        "aristotle",
        "plato",
        "subject",
        "order",
        "lead",
        "reader",
        "skeptical",
        "suspension",
        "judgment",
        "epoché",
        "rather",
        "intentionally",
        "contrasted",
        "two",
        "different",
        "model",
        "rationality",
        "explicitly",
        "weighing",
        "value",
        "least",
        "matter",
        "ancient",
        "theology",
        "prisca",
        "theologia",
        "platonic",
        "school",
        "found",
        "consistent",
        "criterion",
        "truth",
        "holy",
        "scripture",
        "real",
        "intention",
        "de",
        "vanitate",
        "extracted",
        "deep",
        "inside",
        "text",
        "hidden",
        "beneath",
        "polemical",
        "provocative",
        "statement",
        "science",
        "accord",
        "procure",
        "u",
        "divine",
        "felicity",
        "transcends",
        "capacity",
        "man",
        "except",
        "perhaps",
        "felicity",
        "serpent",
        "promised",
        "ancestor",
        "every",
        "science",
        "bad",
        "good",
        "deserves",
        "whatever",
        "praise",
        "derive",
        "probity",
        "possessor",
        "p",
        "agrippa",
        "appropriated",
        "aristotelian",
        "principle",
        "ethical",
        "neutrality",
        "science",
        "spiritual",
        "attitude",
        "knower",
        "integrity",
        "probitas",
        "constitutes",
        "moral",
        "criterion",
        "discipline",
        "ensures",
        "good",
        "bad",
        "usage",
        "cultural",
        "point",
        "view",
        "destructive",
        "action",
        "skepticism",
        "put",
        "end",
        "discussion",
        "school",
        "eliminating",
        "one",
        "two",
        "contender",
        "philosopher",
        "whose",
        "doctrine",
        "built",
        "foundation",
        "sensory",
        "experience",
        "pedagogical",
        "point",
        "view",
        "however",
        "skepticism",
        "preliminary",
        "training",
        "systematic",
        "debate",
        "sensory",
        "representation",
        "suspension",
        "judgment",
        "concerning",
        "appearance",
        "material",
        "world",
        "free",
        "soul",
        "false",
        "opinion",
        "demonstrating",
        "inadequacy",
        "empiricism",
        "directing",
        "search",
        "truth",
        "towards",
        "intelligible",
        "purification",
        "lead",
        "new",
        "spiritual",
        "attitude",
        "make",
        "philosopher",
        "capable",
        "undertaking",
        "route",
        "true",
        "knowledge",
        "truth",
        "fact",
        "grasped",
        "turning",
        "inwards",
        "mind",
        "god",
        "implanted",
        "innate",
        "idea",
        "created",
        "soul",
        "agrippa",
        "acceptance",
        "neoplatonic",
        "theory",
        "knowledge",
        "positively",
        "expressed",
        "final",
        "peroration",
        "de",
        "vanitate",
        "invite",
        "reader",
        "abandon",
        "school",
        "sophist",
        "order",
        "regain",
        "awareness",
        "cognitive",
        "inheritance",
        "every",
        "soul",
        "original",
        "entitlement",
        "agrippa",
        "refers",
        "academic",
        "alongside",
        "holy",
        "scripture",
        "support",
        "idea",
        "human",
        "being",
        "innate",
        "realm",
        "knowledge",
        "need",
        "recovered",
        "mean",
        "suitable",
        "paideia",
        "program",
        "education",
        "return",
        "original",
        "perfection",
        "illumination",
        "not",
        "mystical",
        "illumination",
        "intellectual",
        "one",
        "reminiscence",
        "reappropriation",
        "selfknowledge",
        "ultimately",
        "illumination",
        "knowledge",
        "self",
        "mind",
        "men",
        "intellect",
        "intellectus",
        "sense",
        "agrippa",
        "defines",
        "faith",
        "foundation",
        "reason",
        "fundamentum",
        "rationis",
        "criterion",
        "guarantee",
        "firm",
        "basis",
        "human",
        "knowledge",
        "revelation",
        "without",
        "doubt",
        "absolute",
        "complete",
        "expression",
        "truth",
        "originates",
        "source",
        "content",
        "mind",
        "activity",
        "reason",
        "dependent",
        "since",
        "god",
        "sole",
        "source",
        "truth",
        "tradition",
        "faith",
        "homogeneous",
        "philosophical",
        "contemplation",
        "find",
        "justification",
        "revelation",
        "divine",
        "rationality",
        "higher",
        "level",
        "spiritual",
        "intelligence",
        "able",
        "establish",
        "relationship",
        "continuity",
        "reason",
        "rational",
        "science",
        "practical",
        "application",
        "gain",
        "authenticity",
        "legitimacy",
        "develop",
        "within",
        "theological",
        "framework",
        "mean",
        "reason",
        "draw",
        "content",
        "directly",
        "scripture",
        "rather",
        "mean",
        "content",
        "science",
        "procured",
        "exercise",
        "reason",
        "true",
        "contradict",
        "divine",
        "design",
        "hinder",
        "spiritual",
        "progress",
        "christian",
        "contribute",
        "good",
        "humanity",
        "world",
        "certainly",
        "architect",
        "seek",
        "technical",
        "instruction",
        "put",
        "building",
        "bible",
        "instead",
        "commission",
        "need",
        "seek",
        "indication",
        "manner",
        "modus",
        "end",
        "finis",
        "discipline",
        "architecture",
        "would",
        "art",
        "science",
        "extraordinarily",
        "necessary",
        "beautiful",
        "capable",
        "making",
        "large",
        "contribution",
        "wellbeing",
        "civil",
        "community",
        "humankind",
        "rendered",
        "vain",
        "noxious",
        "excessive",
        "use",
        "simple",
        "exhibition",
        "rich",
        "heedlessly",
        "destroying",
        "natural",
        "surroundings",
        "de",
        "vanitate",
        "agrippa",
        "put",
        "faith",
        "opposition",
        "science",
        "holy",
        "scripture",
        "opposition",
        "human",
        "book",
        "instead",
        "put",
        "aristotelian",
        "philosophy",
        "worldly",
        "science",
        "source",
        "unbelief",
        "opposition",
        "platonic",
        "philosophy",
        "model",
        "christian",
        "science",
        "word",
        "god",
        "scientia",
        "verbo",
        "dei",
        "expression",
        "agrippa",
        "refers",
        "religiously",
        "orientated",
        "science",
        "science",
        "move",
        "freely",
        "sphere",
        "visible",
        "manifestation",
        "god",
        "visibilia",
        "dei",
        "order",
        "know",
        "invisible",
        "essential",
        "invisibilia",
        "trace",
        "beginning",
        "origin",
        "everything",
        "awareness",
        "harmony",
        "faith",
        "reason",
        "scholastic",
        "aristotelian",
        "philosophy",
        "disowned",
        "infecting",
        "world",
        "plague",
        "petty",
        "syllogism",
        "ratiunculae",
        "sophism",
        "impertinent",
        "question",
        "god",
        "sum",
        "divine",
        "path",
        "knowledge",
        "plato",
        "ancient",
        "theologian",
        "founded",
        "god",
        "deal",
        "god",
        "demonic",
        "path",
        "aristotle",
        "constituted",
        "merely",
        "human",
        "ability",
        "deal",
        "lower",
        "thing",
        "demonic",
        "renews",
        "perpetuates",
        "sin",
        "adam",
        "inspired",
        "satan",
        "proud",
        "ambition",
        "make",
        "equal",
        "creator",
        "knowledge",
        "good",
        "evil",
        "agrippa",
        "distinction",
        "different",
        "form",
        "rationalityvalued",
        "differently",
        "according",
        "basis",
        "final",
        "point",
        "viewallows",
        "u",
        "regard",
        "declamatio",
        "invectiva",
        "belonging",
        "true",
        "proper",
        "profession",
        "skepticism",
        "general",
        "antiintellectualism",
        "rigorous",
        "fideism",
        "instead",
        "realigned",
        "antiaristotelian",
        "antischolastic",
        "critique",
        "ficino",
        "reuchlin",
        "giorgio",
        "agrippa",
        "propose",
        "abandonment",
        "god",
        "undifferentiated",
        "indifference",
        "neither",
        "one",
        "one",
        "advocated",
        "sextus",
        "empiricus",
        "view",
        "skepticism",
        "constituted",
        "exercise",
        "education",
        "necessary",
        "pointing",
        "way",
        "towards",
        "apprehension",
        "truth",
        "final",
        "digression",
        "praise",
        "as",
        "agrippa",
        "seemingly",
        "invite",
        "reader",
        "put",
        "baggage",
        "human",
        "science",
        "return",
        "naked",
        "simple",
        "ass",
        "thus",
        "newly",
        "capable",
        "carrying",
        "back",
        "mystery",
        "divine",
        "wisdom",
        "like",
        "as",
        "carried",
        "jesus",
        "jerusalem",
        "ironic",
        "exhortation",
        "polemical",
        "must",
        "subjected",
        "metamorphosis",
        "as",
        "noble",
        "doctor",
        "science",
        "professing",
        "purely",
        "human",
        "rather",
        "demonic",
        "science",
        "scholastic",
        "theologian",
        "motto",
        "know",
        "nothing",
        "happiest",
        "life",
        "nihil",
        "scire",
        "foelicissima",
        "vita",
        "valid",
        "since",
        "nothing",
        "fatal",
        "science",
        "stuffed",
        "impiety",
        "p",
        "philosophy",
        "religious",
        "progressor",
        "rather",
        "regressus",
        "return",
        "source"
    ]
}