{
    "main_text": "Life and Works\n1. Life and Works\n\nFakhr al-Dīn al-Rāzī’s life was shaped by the\npolitical situation in central Asia in the generations just before the\nMongol conquest of that region. He was born in the Persian city of\nRayy, near modern-day Tehran, in 1149 CE (544 of the Muslim calendar).\nThe name “Rāzī” refers to this birthplace,\nleading to potential confusion with other philosophers from Rayy,\nincluding the earlier Abū Bakr al-Rāzī (d. 920) and the\nlater Quṭb al-Dīn al-Rāzī (d.1364). Fakhr\nal-Dīn did not stay in Rayy, but traveled widely throughout\nPersia and central Asia for the rest of his life in search of\neducation, patronage, and worthy intellectual opponents. In fact, he\ndid not need to venture far for his initial education. His father was\nan expert in Islamic theology and law, a second-generation student of\nthe major Ashʿarite thinker al-Juwaynī (d.1085). Thus the\nyoung Fakhr al-Dīn was from early on trained in the rational\ntheology (kalām) of the Ashʿarite school and the\nlegal system of his father’s Shāfiʿī school. He\nwent on to study in Nishapur, where he first encountered the works of\nal-Fārābī (d.950–51) and Ibn Sīnā\n(Avicenna, d.1037). Responding to the latter would become the central\nproject of his own philosophical career. At Marāgha, he studied\nwith the teacher Majd al-Dīn al-Jīlī (d. after 1175).\nAl-Suhrawardī (d. 1191), the famous founder of the\n“Illuminationist” philosophical tradition, was also a\nstudent of al-Jīlī’s.\n\nThe mature career of Fakhr al-Dīn has been divided into three\nphases in a recent detailed overview of his life (Griffel 2021:\n264–303; see also Street 1997, Griffel 2007, Altaş 2013a\nand 2013b, Shihadeh 2022). These phases were marked by patronage\nrelationships with two political powers who were vying for dominance\nin central Asia, the Khwārazm-Shāhs and the Ghūrids.\nFakhr al-Dīn first enjoyed the support of the\nKhwārazm-Shāhs for about two decades, before joining the\nGhūrids in 1197 after a military defeat of the\nKhwārazm-Shāhs at the hands of the Ghūrids. By all\naccounts this led to great wealth and standing, as Fakhr al-Dīn\nbecame an ornament to the Ghūrid court and a close companion and\nteacher of the sultan Ghiyāth al-Dīn (d.1203). This did not\nmean he could stay above the political fray, though. He was accused of\nlingering loyalty to the enemies of the court and was also involved in\na religious rivalry between Ashʿarism and the more literalist,\nless rationalist Karrāmite theological movement. His travels in\nTransoxania seeking out debates with other jurists and theologians\nhave similarly been explained as an attempt to promote Ashʿarite\nkalām against Maturīdī opponents, and\nShāfiʿī legal thought against Hanbalī opponents\n(for his legal thought see, e.g., Opwis 2012, Başoğlu 2014).\nIn a record of these encounters around the year 1186, called\nDebates (Munāẓarāṭ), Fakhr\nal-Dīn presents himself as “the only respectable scholar\namong a swarm of dimwits” (Griffel 2021: 296; for this work see\nKholeif 1966). At the end of his life, we see a third phase of\npatronage as he rejoins the Khwārazm-Shāhs after they take\nthe city of Herat from the Ghūrids. Fakhr al-Dīn died two\nyears later in that city, in 1210 CE (606 of the Muslim calendar).\n\nDespite his extensive travels and political maneuvering, Fakhr\nal-Dīn found time to compose a startlingly large body of work.\nMany will associate his name most immediately with his titanic\nGreat Commentary on the Quran (also called Keys to the\nHidden: Mafāṭih al-ghayb). The modern\nprinting runs to no fewer than 32 volumes (here it is almost\nobligatory to cite Ibn Taymiyya’s barb that the work\n“contains everything apart from exegesis of the Quran”).\nFakhr al-Dīn wrote extensively on law, theology, and\n“occult sciences” like magic and astrology. As can be\nlearned from studies of his Quranic commentary (Jaffer 2015) and a\ntreatise of his on the occult disciplines (Noble 2021), every work of\nFakhr al-Dīn al-Rāzī can be profitably read with his\nphilosophical interests in mind. But in this overview we will largely\nrestrict our focus to the theological-philosophical treatises that are\nof most evident importance for the historian of philosophy. Scholars\nsometimes refer to these as summae, which suggests a parallel\nwith Latin scholastic works like those by Thomas Aquinas. The\ncomparison is not misleading, insofar as Fakhr al-Dīn was\navowedly a theologian, but one who pursued philosophical problems at\nlength and with great sophistication.\n\nA couple of problems confront anyone who is trying to come to grips\nwith his writings in this area. First, the sheer quantity of material.\nHis first summa, entitled Eastern Points of Investigation\non Metaphysics and Physics (al-Mabāḥith\nal-mashriqiyya fī ʿilm al-ilāhiyyāt\nwa-l-ṭabīʿiyyāt) is more than 1200 pages\nlong in the modern printing. His final summa, written in his\nfinal years and arguably best representing his own views on a wide\nrange of topics, is the similarly titled Exalted Topics of Inquiry\nwithin Divine Science (al-Maṭālib\nal-ʿāliya min al-ʿilm al-ilāhī) and is\nprinted in nine books bound in five volumes. In between these two\nworks we have, among other texts, the shorter but highly innovative\nand influential Mulakhkhaṣ al-ḥikma (Epitome\nof Philosophy) and not one but two exegetical works devoted to\nIbn Sīnā’s Pointers and Reminders\n(al-Ishārāt wa-l-tanbīhāt), a critical\nabridgment from 1201 (Lubab al-Ishārāt) and an\nearlier, and very extensive, line-by-line critical commentary\n(Sharḥ al-Ishārāt).\n\nFakhr al-Dīn’s decision to devote such a detailed\ncommentary to a work by Ibn Sīnā is historically revealing.\nWhile his contemporary Sharaf al-Dīn al-Masʿūdī\n(d. before 1204) did compose a set of Doubts\n(Shukūk) on the same text, the commentary of\nal-Rāzī on al-Ishārāt seems to be the\nfirst lemmatized exegesis of an Arabic philosophical work (see also\nWisnovsky 2013, Shihadeh 2014 and 2017), as had been devoted to\nAristotle in late antiquity and earlier Arabic philosophy. Even a\ncasual perusal of Fakhr al-Dīn’s corpus makes clear that he\nhas identified Ibn Sīnā as the chief representative of\nfalsafa, a word which is most naturally translated\n“philosophy” (since it is likewise derived from the Greek\nphilosophia) but which really has a narrower meaning in this\nperiod, since it is so closely tied to Ibn Sīnā’s\ndistinctive teachings. To be a faylasūf is to uphold\nsuch doctrines as the necessary and eternal emanation of the universe\nfrom God. (A more generic word for the discussion of such issues,\nwithout any particular doctrinal commitment, would be\nḥikma, literally meaning “wisdom”; see\nGriffel 2021.) While Fakhr al-Dīn follows his famous predecessor\nand fellow Ashʿarite al-Ghazālī (d. 1111) in targeting\nIbn Sīnā as the outstanding exponent of falsafa, he\ndoes not go along with al-Ghazālī’s idea that the\nfalāsifa were heretics and apostates from Islam.\n\nInstead, he seems to welcome the powerful challenge posed by Ibn\nSīnā’s thought, since it gives him something worthy of\nhis own considerable critical acumen and helps him to map out the wide\nrange of issues tackled in his summae. These fall into the\ndomains of logic, physics, psychology, ethics, and above all,\nmetaphysics (general survey in Zarkān 1963). Indeed Fakhr\nal-Dīn used metaphysics to restructure the curriculum of the\nsciences, something we especially see in his Mulakhkhaṣ\n(Eichner 2007, 2009). This work adopts a new arrangement, which would\nbe influential on later thinkers. Fakhr al-Dīn first tackles\nlogic, then “generalities (al-umūr\nal-ʿāmma)”, then natural philosophy, and finally\nphilosophical theology. The second and fourth parts of the project\ncorrespond to what is called general and special metaphysics in the\nLatin scholastic tradition, and the parallel does not end there. Like\nDuns Scotus, Fakhr al-Dīn offers an analysis of existence (the\ncentral case of a metaphysical “generality”) by way of\ndisjunction, e.g., existence may be one or many, necessary or\ncontingent, infinite or finite, self-sufficient or dependent, etc.\nWhile these contrasts are largely drawn from Ibn Sīnā, Fakhr\nal-Dīn innovates with his systematic use of the disjunctions to\nstructure general metaphysics. This also means, as we will see below,\nthat his discussions of metaphysics are by no means restricted to\nraising and answering questions about God, as we might expect from a\n“theologian”.\n\nIn fact, while Fakhr al-Dīn’s Ashʿarite sympathies are\noften evident, and he does also write works that summarize\nkalām teachings, he is not consistent in taking a clear\nstance in favor of Ashʿarite kalām and against\nAvicennan falsafa. Instead, the really stable feature of his\nwork is a method that is, again, reminiscent of Latin scholasticism\nand its genre of disputed questions. His various summae are\norganized into topics for inquiry (hence the use of words like\nmabāḥith and maṭālib in the\ntitles of the works), with arguments considered for and against every\nconceivable stance that could be adopted on each topic. (The famous\nSufi poet al-Rūmī compared this approach to “tearing\nscience apart like bread and feeding it to the birds”.) The fact\nthat no actual historical figure or school has adopted a possible\nposition will not prevent Fakhr al-Dīn from considering it.\n\nBy using this “dialectical” procedure (Wisnovsky 2004,\nShihadeh 2005, Griffel 2011) Fakhr al-Dīn is able to stand in\njudgment over the whole historical tradition leading up to him.\nAlongside Ibn Sīnā and other philosophers, notably the\nslightly earlier Abū l-Barakāt al-Baghdādī (d.\n1160s), the kalām tradition supplies him with a stock of\npositions and arguments to rehearse and critique. He will thus\nfrequently refer in the third person to “theologians\n(mutakallimūn)”, as if this were a group that does\nnot include him. The upshot is that Fakhr al-Dīn puts himself\nforward as the arbiter in debates that span the\nfalsafa-kalām divide. If he is not consistent in\nadopting one or another teaching himself (many times, a lengthy\ninvestigation in his works ends with only a brief statement of the\nlikeliest answer, or none at all, followed with a pious “but God\nknows best”), this is perhaps because the exhaustive method of\ntesting arguments and doctrines is more important to him than the\nassertion of any one doctrine.\n",
    "section_title": "1. Life and Works",
    "entry_title": "Fakhr al-Din al-Razi",
    "hierarchy_title": "Fakhr al-Din al-Razi || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "fakhr",
        "aldīn",
        "alrāzī",
        "life",
        "shaped",
        "political",
        "situation",
        "central",
        "asia",
        "generation",
        "mongol",
        "conquest",
        "region",
        "born",
        "persian",
        "city",
        "rayy",
        "near",
        "modernday",
        "tehran",
        "ce",
        "muslim",
        "calendar",
        "name",
        "rāzī",
        "refers",
        "birthplace",
        "leading",
        "potential",
        "confusion",
        "philosopher",
        "rayy",
        "including",
        "earlier",
        "abū",
        "bakr",
        "alrāzī",
        "d",
        "later",
        "quṭb",
        "aldīn",
        "alrāzī",
        "d",
        "fakhr",
        "aldīn",
        "stay",
        "rayy",
        "traveled",
        "widely",
        "throughout",
        "persia",
        "central",
        "asia",
        "rest",
        "life",
        "search",
        "education",
        "patronage",
        "worthy",
        "intellectual",
        "opponent",
        "fact",
        "need",
        "venture",
        "far",
        "initial",
        "education",
        "father",
        "expert",
        "islamic",
        "theology",
        "law",
        "secondgeneration",
        "student",
        "major",
        "ashʿarite",
        "thinker",
        "aljuwaynī",
        "d",
        "thus",
        "young",
        "fakhr",
        "aldīn",
        "early",
        "trained",
        "rational",
        "theology",
        "kalām",
        "ashʿarite",
        "school",
        "legal",
        "system",
        "father",
        "shāfiʿī",
        "school",
        "went",
        "study",
        "nishapur",
        "first",
        "encountered",
        "work",
        "alfārābī",
        "d",
        "ibn",
        "sīnā",
        "avicenna",
        "d",
        "responding",
        "latter",
        "would",
        "become",
        "central",
        "project",
        "philosophical",
        "career",
        "marāgha",
        "studied",
        "teacher",
        "majd",
        "aldīn",
        "aljīlī",
        "d",
        "alsuhrawardī",
        "d",
        "famous",
        "founder",
        "illuminationist",
        "philosophical",
        "tradition",
        "also",
        "student",
        "aljīlī",
        "mature",
        "career",
        "fakhr",
        "aldīn",
        "divided",
        "three",
        "phase",
        "recent",
        "detailed",
        "overview",
        "life",
        "griffel",
        "see",
        "also",
        "street",
        "griffel",
        "altaş",
        "a",
        "b",
        "shihadeh",
        "phase",
        "marked",
        "patronage",
        "relationship",
        "two",
        "political",
        "power",
        "vying",
        "dominance",
        "central",
        "asia",
        "khwārazmshāhs",
        "ghūrids",
        "fakhr",
        "aldīn",
        "first",
        "enjoyed",
        "support",
        "khwārazmshāhs",
        "two",
        "decade",
        "joining",
        "ghūrids",
        "military",
        "defeat",
        "khwārazmshāhs",
        "hand",
        "ghūrids",
        "account",
        "led",
        "great",
        "wealth",
        "standing",
        "fakhr",
        "aldīn",
        "became",
        "ornament",
        "ghūrid",
        "court",
        "close",
        "companion",
        "teacher",
        "sultan",
        "ghiyāth",
        "aldīn",
        "d",
        "mean",
        "could",
        "stay",
        "political",
        "fray",
        "though",
        "accused",
        "lingering",
        "loyalty",
        "enemy",
        "court",
        "also",
        "involved",
        "religious",
        "rivalry",
        "ashʿarism",
        "literalist",
        "le",
        "rationalist",
        "karrāmite",
        "theological",
        "movement",
        "travel",
        "transoxania",
        "seeking",
        "debate",
        "jurist",
        "theologian",
        "similarly",
        "explained",
        "attempt",
        "promote",
        "ashʿarite",
        "kalām",
        "maturīdī",
        "opponent",
        "shāfiʿī",
        "legal",
        "thought",
        "hanbalī",
        "opponent",
        "legal",
        "thought",
        "see",
        "eg",
        "opwis",
        "başoğlu",
        "record",
        "encounter",
        "around",
        "year",
        "called",
        "debate",
        "munāẓarāṭ",
        "fakhr",
        "aldīn",
        "present",
        "respectable",
        "scholar",
        "among",
        "swarm",
        "dimwit",
        "griffel",
        "work",
        "see",
        "kholeif",
        "end",
        "life",
        "see",
        "third",
        "phase",
        "patronage",
        "rejoins",
        "khwārazmshāhs",
        "take",
        "city",
        "herat",
        "ghūrids",
        "fakhr",
        "aldīn",
        "died",
        "two",
        "year",
        "later",
        "city",
        "ce",
        "muslim",
        "calendar",
        "despite",
        "extensive",
        "travel",
        "political",
        "maneuvering",
        "fakhr",
        "aldīn",
        "found",
        "time",
        "compose",
        "startlingly",
        "large",
        "body",
        "work",
        "many",
        "associate",
        "name",
        "immediately",
        "titanic",
        "great",
        "commentary",
        "quran",
        "also",
        "called",
        "key",
        "hidden",
        "mafāṭih",
        "alghayb",
        "modern",
        "printing",
        "run",
        "fewer",
        "volume",
        "almost",
        "obligatory",
        "cite",
        "ibn",
        "taymiyya",
        "barb",
        "work",
        "contains",
        "everything",
        "apart",
        "exegesis",
        "quran",
        "fakhr",
        "aldīn",
        "wrote",
        "extensively",
        "law",
        "theology",
        "occult",
        "science",
        "like",
        "magic",
        "astrology",
        "learned",
        "study",
        "quranic",
        "commentary",
        "jaffer",
        "treatise",
        "occult",
        "discipline",
        "noble",
        "every",
        "work",
        "fakhr",
        "aldīn",
        "alrāzī",
        "profitably",
        "read",
        "philosophical",
        "interest",
        "mind",
        "overview",
        "largely",
        "restrict",
        "focus",
        "theologicalphilosophical",
        "treatise",
        "evident",
        "importance",
        "historian",
        "philosophy",
        "scholar",
        "sometimes",
        "refer",
        "summae",
        "suggests",
        "parallel",
        "latin",
        "scholastic",
        "work",
        "like",
        "thomas",
        "aquinas",
        "comparison",
        "misleading",
        "insofar",
        "fakhr",
        "aldīn",
        "avowedly",
        "theologian",
        "one",
        "pursued",
        "philosophical",
        "problem",
        "length",
        "great",
        "sophistication",
        "couple",
        "problem",
        "confront",
        "anyone",
        "trying",
        "come",
        "grip",
        "writing",
        "area",
        "first",
        "sheer",
        "quantity",
        "material",
        "first",
        "summa",
        "entitled",
        "eastern",
        "point",
        "investigation",
        "metaphysics",
        "physic",
        "almabāḥith",
        "almashriqiyya",
        "fī",
        "ʿilm",
        "alilāhiyyāt",
        "walṭabīʿiyyāt",
        "page",
        "long",
        "modern",
        "printing",
        "final",
        "summa",
        "written",
        "final",
        "year",
        "arguably",
        "best",
        "representing",
        "view",
        "wide",
        "range",
        "topic",
        "similarly",
        "titled",
        "exalted",
        "topic",
        "inquiry",
        "within",
        "divine",
        "science",
        "almaṭālib",
        "alʿāliya",
        "min",
        "alʿilm",
        "alilāhī",
        "printed",
        "nine",
        "book",
        "bound",
        "five",
        "volume",
        "two",
        "work",
        "among",
        "text",
        "shorter",
        "highly",
        "innovative",
        "influential",
        "mulakhkhaṣ",
        "alḥikma",
        "epitome",
        "philosophy",
        "one",
        "two",
        "exegetical",
        "work",
        "devoted",
        "ibn",
        "sīnā",
        "pointer",
        "reminder",
        "alishārāt",
        "waltanbīhāt",
        "critical",
        "abridgment",
        "lubab",
        "alishārāt",
        "earlier",
        "extensive",
        "linebyline",
        "critical",
        "commentary",
        "sharḥ",
        "alishārāt",
        "fakhr",
        "aldīn",
        "decision",
        "devote",
        "detailed",
        "commentary",
        "work",
        "ibn",
        "sīnā",
        "historically",
        "revealing",
        "contemporary",
        "sharaf",
        "aldīn",
        "almasʿūdī",
        "d",
        "compose",
        "set",
        "doubt",
        "shukūk",
        "text",
        "commentary",
        "alrāzī",
        "alishārāt",
        "seems",
        "first",
        "lemmatized",
        "exegesis",
        "arabic",
        "philosophical",
        "work",
        "see",
        "also",
        "wisnovsky",
        "shihadeh",
        "devoted",
        "aristotle",
        "late",
        "antiquity",
        "earlier",
        "arabic",
        "philosophy",
        "even",
        "casual",
        "perusal",
        "fakhr",
        "aldīn",
        "corpus",
        "make",
        "clear",
        "identified",
        "ibn",
        "sīnā",
        "chief",
        "representative",
        "falsafa",
        "word",
        "naturally",
        "translated",
        "philosophy",
        "since",
        "likewise",
        "derived",
        "greek",
        "philosophia",
        "really",
        "narrower",
        "meaning",
        "period",
        "since",
        "closely",
        "tied",
        "ibn",
        "sīnā",
        "distinctive",
        "teaching",
        "faylasūf",
        "uphold",
        "doctrine",
        "necessary",
        "eternal",
        "emanation",
        "universe",
        "god",
        "generic",
        "word",
        "discussion",
        "issue",
        "without",
        "particular",
        "doctrinal",
        "commitment",
        "would",
        "ḥikma",
        "literally",
        "meaning",
        "wisdom",
        "see",
        "griffel",
        "fakhr",
        "aldīn",
        "follows",
        "famous",
        "predecessor",
        "fellow",
        "ashʿarite",
        "alghazālī",
        "d",
        "targeting",
        "ibn",
        "sīnā",
        "outstanding",
        "exponent",
        "falsafa",
        "go",
        "along",
        "alghazālī",
        "idea",
        "falāsifa",
        "heretic",
        "apostate",
        "islam",
        "instead",
        "seems",
        "welcome",
        "powerful",
        "challenge",
        "posed",
        "ibn",
        "sīnā",
        "thought",
        "since",
        "give",
        "something",
        "worthy",
        "considerable",
        "critical",
        "acumen",
        "help",
        "map",
        "wide",
        "range",
        "issue",
        "tackled",
        "summae",
        "fall",
        "domain",
        "logic",
        "physic",
        "psychology",
        "ethic",
        "metaphysics",
        "general",
        "survey",
        "zarkān",
        "indeed",
        "fakhr",
        "aldīn",
        "used",
        "metaphysics",
        "restructure",
        "curriculum",
        "science",
        "something",
        "especially",
        "see",
        "mulakhkhaṣ",
        "eichner",
        "work",
        "adopts",
        "new",
        "arrangement",
        "would",
        "influential",
        "later",
        "thinker",
        "fakhr",
        "aldīn",
        "first",
        "tackle",
        "logic",
        "generality",
        "alumūr",
        "alʿāmma",
        "natural",
        "philosophy",
        "finally",
        "philosophical",
        "theology",
        "second",
        "fourth",
        "part",
        "project",
        "correspond",
        "called",
        "general",
        "special",
        "metaphysics",
        "latin",
        "scholastic",
        "tradition",
        "parallel",
        "end",
        "like",
        "dun",
        "scotus",
        "fakhr",
        "aldīn",
        "offer",
        "analysis",
        "existence",
        "central",
        "case",
        "metaphysical",
        "generality",
        "way",
        "disjunction",
        "eg",
        "existence",
        "may",
        "one",
        "many",
        "necessary",
        "contingent",
        "infinite",
        "finite",
        "selfsufficient",
        "dependent",
        "etc",
        "contrast",
        "largely",
        "drawn",
        "ibn",
        "sīnā",
        "fakhr",
        "aldīn",
        "innovates",
        "systematic",
        "use",
        "disjunction",
        "structure",
        "general",
        "metaphysics",
        "also",
        "mean",
        "see",
        "discussion",
        "metaphysics",
        "mean",
        "restricted",
        "raising",
        "answering",
        "question",
        "god",
        "might",
        "expect",
        "theologian",
        "fact",
        "fakhr",
        "aldīn",
        "ashʿarite",
        "sympathy",
        "often",
        "evident",
        "also",
        "write",
        "work",
        "summarize",
        "kalām",
        "teaching",
        "consistent",
        "taking",
        "clear",
        "stance",
        "favor",
        "ashʿarite",
        "kalām",
        "avicennan",
        "falsafa",
        "instead",
        "really",
        "stable",
        "feature",
        "work",
        "method",
        "reminiscent",
        "latin",
        "scholasticism",
        "genre",
        "disputed",
        "question",
        "various",
        "summae",
        "organized",
        "topic",
        "inquiry",
        "hence",
        "use",
        "word",
        "like",
        "mabāḥith",
        "maṭālib",
        "title",
        "work",
        "argument",
        "considered",
        "every",
        "conceivable",
        "stance",
        "could",
        "adopted",
        "topic",
        "famous",
        "sufi",
        "poet",
        "alrūmī",
        "compared",
        "approach",
        "tearing",
        "science",
        "apart",
        "like",
        "bread",
        "feeding",
        "bird",
        "fact",
        "actual",
        "historical",
        "figure",
        "school",
        "adopted",
        "possible",
        "position",
        "prevent",
        "fakhr",
        "aldīn",
        "considering",
        "using",
        "dialectical",
        "procedure",
        "wisnovsky",
        "shihadeh",
        "griffel",
        "fakhr",
        "aldīn",
        "able",
        "stand",
        "judgment",
        "whole",
        "historical",
        "tradition",
        "leading",
        "alongside",
        "ibn",
        "sīnā",
        "philosopher",
        "notably",
        "slightly",
        "earlier",
        "abū",
        "lbarakāt",
        "albaghdādī",
        "d",
        "s",
        "kalām",
        "tradition",
        "supply",
        "stock",
        "position",
        "argument",
        "rehearse",
        "critique",
        "thus",
        "frequently",
        "refer",
        "third",
        "person",
        "theologian",
        "mutakallimūn",
        "group",
        "include",
        "upshot",
        "fakhr",
        "aldīn",
        "put",
        "forward",
        "arbiter",
        "debate",
        "span",
        "falsafakalām",
        "divide",
        "consistent",
        "adopting",
        "one",
        "another",
        "teaching",
        "many",
        "time",
        "lengthy",
        "investigation",
        "work",
        "end",
        "brief",
        "statement",
        "likeliest",
        "answer",
        "none",
        "followed",
        "pious",
        "god",
        "know",
        "best",
        "perhaps",
        "exhaustive",
        "method",
        "testing",
        "argument",
        "doctrine",
        "important",
        "assertion",
        "one",
        "doctrine"
    ]
}