{
    "main_text": "The Soul and its Faculties\n2. The Soul and its Faculties\n\nIn The Virtuous City al-Fārābī devotes an\nentire chapter to the faculties of the human soul, from the most basic\nand lowest, namely nutrition, to the most perfect and highest, that\nis, the rational or intellective faculty (al-Fārābī VC:\n164–175). Nutrition is shared among plants, animals and human\nbeings; next there is a group of faculties, the external senses\n(touch, taste, smell, hearing, and sight). Animals and human being\nshare these senses. Along with these sensitive faculties there is also\nthe appetitive faculty through which humans and animals experience\ndesire or aversion towards the objects they perceive through the\nsenses. Then, proceeding with the internal senses, there is the\nimaginative faculty whose function is to retain the sensible\nimpressions when these are no longer present to the external senses.\nThis faculty also has the capacity to combine sensibles with each\nother, to connect and disconnect them in different compositions and\ndivisions, some of them being false, and some true\n(al-Fārābī VC: 168–169). The imaginative faculty\nis also linked to the appetitive faculty given that it is possible to\ndesire imaginative representations. The role of this faculty in human\ncognition is particularly relevant and is given separate attention in\nthe next section. Last and highest in al-Fārābī’s\naccount is the rational or intellective faculty\n(‘aql).\n\nAl-Fārābī gives a complete explanation of the way in\nwhich all the faculties of the soul work together. Each faculty has a\nruling organ and others that are auxiliaries and subordinates\n(al-Fārābī VC: 174–187). He holds that the ruling\norgan in the human body is the heart; the brain is a secondary ruling\norgan subordinated to the heart; however, all the other organs and\nlimbs are subordinated to the brain. The heart rules every faculty\nthrough subordinate organs and limbs. Thus, the ruling organ of\nnutrition is the heart and the subordinates are the other organs that\nintervene in the process of nutrition, that is, the stomach, the\nliver, the spleen, etc. The faculty of sensation is explained\nfollowing the same model: the heart rules sensation, and its\nsubordinates or auxiliaries are the five senses whose function is to\napprehend sensibles. The imaginative faculty is located in the heart\nand has no auxiliaries distributed in other organs, but it controls\nwhat is provided by the five senses. According to\nal-Fārābī, the imaginative faculty is able to separate\nand connect what is provided by the five senses in different ways,\nsometimes attaining an image in agreement with what has been\nperceived, sometimes something different (al-Fārābī VC:\n168–169). Concerning the rational faculty,\nal-Fārābī explains that it is also located in the heart\nand has neither auxiliaries nor subordinates, but rules the other\nfaculties, namely, the imaginative, the sensitive, and the nutritive\n(al-Fārābī VC: 169–171).\n\nThe appetitive faculty makes the will (irāda) arise once\nthe sensitive, the imaginative, or the rational faculties have\napprehended something. Appetite, according to\nal-Fārābī, may be towards knowing or doing a thing,\neither with the whole body or with some limb or organ. The auxiliaries\nand subordinates of this faculty are, therefore, all the organs\ninvolved in the motion of the body. In other words, the limbs, nerves,\nand muscles spread throughout the body serve as instruments and\nsubordinates of the appetitive faculty (al-Fārābī VC:\n170–171).\n\nNotice that al-Fārābī is following Aristotle according\nto whom the heart is the center of the biological and even perceptive\ncapacities of animals and human beings. The heart is relevant because\nit is the source of innate heat or the vital innate spirit, which\nspreads through the blood vessels sustaining and preserving all the\nparts of the body. The second major organ, the brain, regulates the\nheat disseminated by the heart (al-Fārābī VC:\n176–177). This innate heat is the principle of life. This\nbiological account helps explain the origin and nature of the soul. In\nthe previous section I explained al-Fārābī’s\nunderstanding of the origin and composition of matter and its relation\nto the form. When referring specifically to the conformity of the\nhuman body and the origin of the rational soul,\nal-Fārābī holds that the conformity of this kind of\nbody with its corresponding set of faculties is only possible when the\nheat of the heart reaches a certain temperature.\n\nFollowing Aristotle, al-Fārābī explains the role of the\nreproductive faculty (al-Fārābī VC: 186–197) in\nthe origin of the body and the soul. He holds that the female prepares\nthe matter while the male prepares the form. Once again, he insists on\nthe centrality of the heart, which provides the matter of the living\nbeing through the womb and the form through the organ that generates\nthe semen. The semen, once entering the womb, finds inside of it the\nblood that had been previously prepared by the womb in order to\nreceive the human form contained in the semen. The semen in turn\nendows this blood with a capacity that enables the blood to move and\nstart forming the different organs that make up the human body. Hence,\nthe blood from the womb serves as the matter that receives the human\nform contained in the semen, which is to say that the semen serves as\nthe rennet by which the milk is curdled. Just as the rennet is that by\nvirtue of which fresh milk curdles, while not being part of the\ncurdled milk nor of its matter, so it happens with the semen, which is\nnot part of the clogged blood or of its matter. Hence, the embryo is\nconstituted in the same way that fresh milk is curdled by the action\nof the curdling principle, that is, the rennet.\n\nWhen the blood in the womb receives the form from the semen, the first\nthing that arises is precisely the heart (al-Fārābī VC:\n186–187). The other organs in the body emerge only once the rest\nof the faculties, beginning with the nutritive faculty, are present in\nthe heart. The developing organs include those that are endowed with\nspecifically female or male procreative faculties. Therefore, male and\nfemale individuals share all organs but those with reproductive\nfunctions and, similarly, both share all the faculties of the soul,\nthat is, the sensitive, the imaginative, and the rational faculties\n(al-Fārābī VC: 196–197).\n\nAll of this detailed biological discussion helps explain the emergence\nof the perceptive faculties in animals and human beings. Both have\nsensation so that they can receive the impressions produced by\nexternal objects and, through the imaginative faculty, they can retain\nsensibles while no longer being in contact with the exterior world.\nAnimals are able to react to the external world because they possess\nsensation and imagination, so they can experience pleasure and pain,\nor detect those situations that are damaging or dangerous for them. In\nthe case of human beings, in addition to the imaginative faculty, the\nrational faculty is essential for cognition: human cognition is\ncharacterized not by the mere attainment of sensible forms but,\nrather, by the attainment of intelligibles. Furthermore, it is the\nfaculty through which human beings attain the sciences and the arts,\nand through which they are able to discern between good habits and\ngood deeds from those that are bad. By this faculty humans are able to\nreflect on whether something should be done and they can recognize\nwhat is useful, pleasant, and harmful (al-Fārābī VC:\n165).\n\nThe rational faculty is both theoretical and practical\n(al-Fārābī KS: 32–33; PR: 29–31). In its\ntheoretical aspect, the rational faculty allows humans to attain the\nknowledge of things that are in a certain way and cannot be otherwise;\nthat is, humans are not able to act upon them or alter them. For\nexample, we cannot do anything to alter the fact that three is an odd\nnumber and four an even number (al-Fārābī SA: §7,\n15–16). In contrast, in its practical aspect, the rational\nfaculty deals with those things humans can act upon and alter. In this\npractical dimension, the rational faculty involves skills and\ncalculation. Skills refer to acquired abilities for practicing\nactivities such as carpentry, farming, medicine, or sailing, while\ncalculation is related to those situations where we need to deliberate\nabout something we want to do, when we want to do it, whether it is\npossible to do it and, if possible, how it should be done\n(al-Fārābī VC: 208–209; SA: §7,\n15–16).\n\nAs can be seen, the rational faculty is responsible for human\ncognition in all its aspects. However, though al-Fārābī\ngives much importance to this faculty, he also devotes much attention\nto the imaginative faculty in itself and its interactions with the\nrational faculty. The two following sections review in more detail the\nrole of the imaginative and the rational or intellective faculties in\nhuman cognition, respectively.\n",
    "section_title": "2. The Soul and its Faculties",
    "entry_title": "al-Farabi’s Psychology and Epistemology",
    "hierarchy_title": "al-Farabi’s Psychology and Epistemology || The Soul and its Faculties",
    "tokenized_text": [
        "soul",
        "faculty",
        "soul",
        "faculty",
        "virtuous",
        "city",
        "alfārābī",
        "devotes",
        "entire",
        "chapter",
        "faculty",
        "human",
        "soul",
        "basic",
        "lowest",
        "namely",
        "nutrition",
        "perfect",
        "highest",
        "rational",
        "intellective",
        "faculty",
        "alfārābī",
        "vc",
        "nutrition",
        "shared",
        "among",
        "plant",
        "animal",
        "human",
        "being",
        "next",
        "group",
        "faculty",
        "external",
        "sens",
        "touch",
        "taste",
        "smell",
        "hearing",
        "sight",
        "animal",
        "human",
        "share",
        "sens",
        "along",
        "sensitive",
        "faculty",
        "also",
        "appetitive",
        "faculty",
        "human",
        "animal",
        "experience",
        "desire",
        "aversion",
        "towards",
        "object",
        "perceive",
        "sens",
        "proceeding",
        "internal",
        "sens",
        "imaginative",
        "faculty",
        "whose",
        "function",
        "retain",
        "sensible",
        "impression",
        "longer",
        "present",
        "external",
        "sens",
        "faculty",
        "also",
        "capacity",
        "combine",
        "sensibles",
        "connect",
        "disconnect",
        "different",
        "composition",
        "division",
        "false",
        "true",
        "alfārābī",
        "vc",
        "imaginative",
        "faculty",
        "also",
        "linked",
        "appetitive",
        "faculty",
        "given",
        "possible",
        "desire",
        "imaginative",
        "representation",
        "role",
        "faculty",
        "human",
        "cognition",
        "particularly",
        "relevant",
        "given",
        "separate",
        "attention",
        "next",
        "section",
        "last",
        "highest",
        "alfārābī",
        "account",
        "rational",
        "intellective",
        "faculty",
        "aql",
        "alfārābī",
        "give",
        "complete",
        "explanation",
        "way",
        "faculty",
        "soul",
        "work",
        "together",
        "faculty",
        "ruling",
        "organ",
        "others",
        "auxiliary",
        "subordinate",
        "alfārābī",
        "vc",
        "hold",
        "ruling",
        "organ",
        "human",
        "body",
        "heart",
        "brain",
        "secondary",
        "ruling",
        "organ",
        "subordinated",
        "heart",
        "however",
        "organ",
        "limb",
        "subordinated",
        "brain",
        "heart",
        "rule",
        "every",
        "faculty",
        "subordinate",
        "organ",
        "limb",
        "thus",
        "ruling",
        "organ",
        "nutrition",
        "heart",
        "subordinate",
        "organ",
        "intervene",
        "process",
        "nutrition",
        "stomach",
        "liver",
        "spleen",
        "etc",
        "faculty",
        "sensation",
        "explained",
        "following",
        "model",
        "heart",
        "rule",
        "sensation",
        "subordinate",
        "auxiliary",
        "five",
        "sens",
        "whose",
        "function",
        "apprehend",
        "sensibles",
        "imaginative",
        "faculty",
        "located",
        "heart",
        "auxiliary",
        "distributed",
        "organ",
        "control",
        "provided",
        "five",
        "sens",
        "according",
        "alfārābī",
        "imaginative",
        "faculty",
        "able",
        "separate",
        "connect",
        "provided",
        "five",
        "sens",
        "different",
        "way",
        "sometimes",
        "attaining",
        "image",
        "agreement",
        "perceived",
        "sometimes",
        "something",
        "different",
        "alfārābī",
        "vc",
        "concerning",
        "rational",
        "faculty",
        "alfārābī",
        "explains",
        "also",
        "located",
        "heart",
        "neither",
        "auxiliary",
        "subordinate",
        "rule",
        "faculty",
        "namely",
        "imaginative",
        "sensitive",
        "nutritive",
        "alfārābī",
        "vc",
        "appetitive",
        "faculty",
        "make",
        "irāda",
        "arise",
        "sensitive",
        "imaginative",
        "rational",
        "faculty",
        "apprehended",
        "something",
        "appetite",
        "according",
        "alfārābī",
        "may",
        "towards",
        "knowing",
        "thing",
        "either",
        "whole",
        "body",
        "limb",
        "organ",
        "auxiliary",
        "subordinate",
        "faculty",
        "therefore",
        "organ",
        "involved",
        "motion",
        "body",
        "word",
        "limb",
        "nerve",
        "muscle",
        "spread",
        "throughout",
        "body",
        "serve",
        "instrument",
        "subordinate",
        "appetitive",
        "faculty",
        "alfārābī",
        "vc",
        "notice",
        "alfārābī",
        "following",
        "aristotle",
        "according",
        "heart",
        "center",
        "biological",
        "even",
        "perceptive",
        "capacity",
        "animal",
        "human",
        "being",
        "heart",
        "relevant",
        "source",
        "innate",
        "heat",
        "vital",
        "innate",
        "spirit",
        "spread",
        "blood",
        "vessel",
        "sustaining",
        "preserving",
        "part",
        "body",
        "second",
        "major",
        "organ",
        "brain",
        "regulates",
        "heat",
        "disseminated",
        "heart",
        "alfārābī",
        "vc",
        "innate",
        "heat",
        "principle",
        "life",
        "biological",
        "account",
        "help",
        "explain",
        "origin",
        "nature",
        "soul",
        "previous",
        "section",
        "explained",
        "alfārābī",
        "understanding",
        "origin",
        "composition",
        "matter",
        "relation",
        "form",
        "referring",
        "specifically",
        "conformity",
        "human",
        "body",
        "origin",
        "rational",
        "soul",
        "alfārābī",
        "hold",
        "conformity",
        "kind",
        "body",
        "corresponding",
        "set",
        "faculty",
        "possible",
        "heat",
        "heart",
        "reach",
        "certain",
        "temperature",
        "following",
        "aristotle",
        "alfārābī",
        "explains",
        "role",
        "reproductive",
        "faculty",
        "alfārābī",
        "vc",
        "origin",
        "body",
        "soul",
        "hold",
        "female",
        "prepares",
        "matter",
        "male",
        "prepares",
        "form",
        "insists",
        "centrality",
        "heart",
        "provides",
        "matter",
        "living",
        "womb",
        "form",
        "organ",
        "generates",
        "semen",
        "semen",
        "entering",
        "womb",
        "find",
        "inside",
        "blood",
        "previously",
        "prepared",
        "womb",
        "order",
        "receive",
        "human",
        "form",
        "contained",
        "semen",
        "semen",
        "turn",
        "endows",
        "blood",
        "capacity",
        "enables",
        "blood",
        "move",
        "start",
        "forming",
        "different",
        "organ",
        "make",
        "human",
        "body",
        "hence",
        "blood",
        "womb",
        "serf",
        "matter",
        "receives",
        "human",
        "form",
        "contained",
        "semen",
        "say",
        "semen",
        "serf",
        "rennet",
        "milk",
        "curdled",
        "rennet",
        "virtue",
        "fresh",
        "milk",
        "curdles",
        "part",
        "curdled",
        "milk",
        "matter",
        "happens",
        "semen",
        "part",
        "clogged",
        "blood",
        "matter",
        "hence",
        "embryo",
        "constituted",
        "way",
        "fresh",
        "milk",
        "curdled",
        "action",
        "curdling",
        "principle",
        "rennet",
        "blood",
        "womb",
        "receives",
        "form",
        "semen",
        "first",
        "thing",
        "arises",
        "precisely",
        "heart",
        "alfārābī",
        "vc",
        "organ",
        "body",
        "emerge",
        "rest",
        "faculty",
        "beginning",
        "nutritive",
        "faculty",
        "present",
        "heart",
        "developing",
        "organ",
        "include",
        "endowed",
        "specifically",
        "female",
        "male",
        "procreative",
        "faculty",
        "therefore",
        "male",
        "female",
        "individual",
        "share",
        "organ",
        "reproductive",
        "function",
        "similarly",
        "share",
        "faculty",
        "soul",
        "sensitive",
        "imaginative",
        "rational",
        "faculty",
        "alfārābī",
        "vc",
        "detailed",
        "biological",
        "discussion",
        "help",
        "explain",
        "emergence",
        "perceptive",
        "faculty",
        "animal",
        "human",
        "being",
        "sensation",
        "receive",
        "impression",
        "produced",
        "external",
        "object",
        "imaginative",
        "faculty",
        "retain",
        "sensibles",
        "longer",
        "contact",
        "exterior",
        "world",
        "animal",
        "able",
        "react",
        "external",
        "world",
        "posse",
        "sensation",
        "imagination",
        "experience",
        "pleasure",
        "pain",
        "detect",
        "situation",
        "damaging",
        "dangerous",
        "case",
        "human",
        "being",
        "addition",
        "imaginative",
        "faculty",
        "rational",
        "faculty",
        "essential",
        "cognition",
        "human",
        "cognition",
        "characterized",
        "mere",
        "attainment",
        "sensible",
        "form",
        "rather",
        "attainment",
        "intelligibles",
        "furthermore",
        "faculty",
        "human",
        "being",
        "attain",
        "science",
        "art",
        "able",
        "discern",
        "good",
        "habit",
        "good",
        "deed",
        "bad",
        "faculty",
        "human",
        "able",
        "reflect",
        "whether",
        "something",
        "done",
        "recognize",
        "useful",
        "pleasant",
        "harmful",
        "alfārābī",
        "vc",
        "rational",
        "faculty",
        "theoretical",
        "practical",
        "alfārābī",
        "k",
        "pr",
        "theoretical",
        "aspect",
        "rational",
        "faculty",
        "allows",
        "human",
        "attain",
        "knowledge",
        "thing",
        "certain",
        "way",
        "otherwise",
        "human",
        "able",
        "act",
        "upon",
        "alter",
        "example",
        "anything",
        "alter",
        "fact",
        "three",
        "odd",
        "number",
        "four",
        "even",
        "number",
        "alfārābī",
        "sa",
        "contrast",
        "practical",
        "aspect",
        "rational",
        "faculty",
        "deal",
        "thing",
        "human",
        "act",
        "upon",
        "alter",
        "practical",
        "dimension",
        "rational",
        "faculty",
        "involves",
        "skill",
        "calculation",
        "skill",
        "refer",
        "acquired",
        "ability",
        "practicing",
        "activity",
        "carpentry",
        "farming",
        "medicine",
        "sailing",
        "calculation",
        "related",
        "situation",
        "need",
        "deliberate",
        "something",
        "want",
        "want",
        "whether",
        "possible",
        "possible",
        "done",
        "alfārābī",
        "vc",
        "sa",
        "seen",
        "rational",
        "faculty",
        "responsible",
        "human",
        "cognition",
        "aspect",
        "however",
        "though",
        "alfārābī",
        "give",
        "much",
        "importance",
        "faculty",
        "also",
        "devotes",
        "much",
        "attention",
        "imaginative",
        "faculty",
        "interaction",
        "rational",
        "faculty",
        "two",
        "following",
        "section",
        "review",
        "detail",
        "role",
        "imaginative",
        "rational",
        "intellective",
        "faculty",
        "human",
        "cognition",
        "respectively"
    ]
}