{
    "main_text": "The Problem of Moral Reason\n3. The Problem of Moral Reason\n\n\nThe central issue running through all of these concerns of Crummell's\nderives from the nature of moral reason itself. He describes the\nstructure of the human psyche as consisting of instinct, passion, and\nreason, with reason taking priority over the other two. Reason is a\n“universal and native sentiment,” a “deep-felt\nknowledge,” and “reflexive recognition of truth,”\nall of which are “spontaneous” abilities, contrasted with\nthe externally conditioned instinct and passion (“Eulogy for\nThomas Sidney” (July 1840) [AC], 3). Spontaneous reason is opposed to reason that\ncomes from efforts to exert “intellectual and moral\npowers.” Hence the need for educational and religious training,\nhe thought, the aim of which was to allow the individual agent\n“to perceive intuitively ‘those awful truths, those\neternal principles.’ ” His view of moral reason takes\nas morally exemplary the well-honed natural intuition of timeless\nmoral principles.\n\n\nPlato is an easy antecedent to identify in his thinking, as Crummell\nbiographers Gregory Rigsby and Wilson Jeremiah Moses both attest. But\nCrummell's emphasis on spontaneous, unconflicted reason also evokes\nAristotelian themes. That makes it a challenge to situate him in the\nhistory of philosophy.\n\n\nPlato held a view about moral thinking that depended on seeing the\nobjects of moral thought as abstract, pre-existing entities. One can\nalready see in Crummell's Natural Rights Argument (discussed above) a\nstrong Platonic streak. It clearly continues here in his idea that\nmoral agents intuit timeless principles. Plato pursued this idea far\nenough to conclude that such principles, as unchanging, were precisely\nthe sorts of entities that could underwrite moral conversation and\nreflection. In fact, without them moral action and thinking would be\nunstable and constantly shifting—as he would put it, becoming\nwhat it might finally be, but not actually being that\nthing. Fortunately on the Platonic approach, timeless abstract moral\nprinciples always are, and so never need to be further\nstabilized or justified.\n\n\nBut Crummell's approach evokes Aristotle as well. The Aristotelian\nelements are especially distinctive, given that Aristotle's thinking\nabout morality was so strongly driven by his attempts to repair (what\nhe regarded as) flaws in Plato's thinking. Aristotle thought that\nmorality could not be theorized about since it is, by its nature, practical. That is, we work out what we need to do in our\nmoral lives, and even though we think about what that\ninvolves, our goal is not merely to gain understanding of some abstract\nmoral principle, but to do some action.\n\n\nAristotle thus took the habits of moral character very\nseriously—much more so than the theoretical deliberations of the\nPlatonist—an emphasis Crummell seems to share in his admiration of his\nfriend Sidney. He admires him for his naturalness at moral life,\nrequiring no effort to intuit the morally relevant features of a\nsituation. After all, if effort is required, then one does not yet have\nthe habits of virtue, thus coming up short on the Aristotelian metric.\nIf Sidney is thus admirable for lacking any weakness of will, it is\neasy to suppose that effort-driven reason is a mark of such weakness,\nand hence something to be avoided (or at best tolerated) until moral\nexcellence is achieved. Crummell's view thus seems less a Platonic\nideal of moral excellence than an Aristotelian tolerance of moral\nfailure. This is apt given the compromised agency that any observer\nwould discern in the moral condition of enslaved blacks. What Crummell\nadmired in Sidney is his working out of the two, a kind of excellence\nin the face of compromised agency.\n\n\nCrummell's notion depends on the existence of a set of fundamental\nprinciples. Deeply unsettled moral situations, in which competing\nconsiderations press on the choices actual individuals make, demand\nthat the principled individual discern the moral signal in all the\nnoise. His central idea is that reason cuts through to the principles\nthemselves, even if moral and mental effort is required to get clarity\nabout those principles. He takes providence to make that clarity and\nprogress possible. Hence his view is less dependent on the unsettled\nnature of situations in producing the moral dialectic, and instead\nderives from the tracking of a fundamental principle.\n\n\nCrummell is acutely aware that the linguistic resources of a moral\nagent help determine how fully they can reason morally and thus be\ncapable of the agency that draws on the principles he\ndescribes. Though he is grossly unfair to the West African language\nGrebo, his argument that it is logically inadequate to serve the\nrational needs of blacks in Liberia who speak it offers an instructive\naccount of the interplay between language and thought. There is little\nhe likes about Grebo: it is “harsh, abrupt, energetic, and\nindistinct in enunciation,” he says, “meagre in point of\nwords” and “abound[ing] with inarticulate nasal and\nguttural sounds” (“The English Language in Liberia”\n[FA], 19). It “possess[es] few inflections and\ngrammatical forms” and hence is “exceedingly difficult of\nacquisition.” He feels he cannot urge Liberians to continue to\nspeak Grebo instead of English, given his conclusions that it is\nplagued by “lowness of ideas, with brutal and vindictive\nsentiments” and with “principles” that show a\npredominance of “animal propensities.” This is a disaster,\nhe writes, since (on this description) it can support few moral\nconcepts or distinctions, let alone concepts germane to justice and\npolitics, or even “truths of a personal, present deity”\nand “God's moral government.” His theoretical worries\nconcern what the “principles” of a natural-language\nvariety are that account for its various logical capacities, such as\nexpressibility and generativity.\n\n\nCrummell does not think he is being prejudicial here, despite the\nextreme linguistic bias any modern-day reader would take him to be\ndisplaying. He relies on John L. Wilson's description of\nGrebo—something of a standard ethnography of his day—and so to a\ngreat extent is engaging in a positivistic rather than impressionistic\naccount of Grebo. Of course, any present-day language study would rely\non descriptions systematically developed from the judgments of native\nspeakers rather than non-native observations. And his positivism has\nits theoretical basis in arguments familiar from John Locke's\nphilosophy of language. Words are the names of thoughts, and so\narticulations in language are in effect mnemonic devices for thinking.\nHis regard for reason would certainly lead him to emphasize a\npriori concepts, but the theoretical assumptions are largely due\nto Locke.\n\n\nLocke's philosophy of language—which he shared in its broad\noutlines with predecessors Hobbes and Descartes—holds that thoughts in\nthe mind, whether they are innate (he thought they mostly were not) or\ncaused by the sensations we have, are the primary support for the words\nin our language. When we utter a word, we do so because that word\nmeans the idea we have in mind when we utter it. The Grebo\nanalysis that Crummell offers takes Lockean philosophy seriously, in\nthat if Grebo has “defects,” it is because it is not able\nto preserve the word-idea relationship in moral contexts. Though this\nprejudice about Grebo is unfounded, the theory driving the prejudice\nenjoyed wide acceptance.\n\n\nIt is tempting to see Crummell's philosophy of language in terms of\nHumboldt's work in the decades prior on comparative grammars rather\nthan Locke's empiricist semantics. Humboldt compared linguistic\nvarieties in order to discover patterns across those variations, the\nidea being that linguistic universals occur throughout human\nexperience, if only we can capture the common patterns. Crummell can\nthus be read as Humboldtian, albeit an illiberal and intolerant one.\nThat may turn out to be a productive reading, but little historical\nevidence has yet been uncovered to show that Crummell knew of\nHumboldt.\n\n\nIn any case, his theoretical commitments led him to be suspicious of\nGrebo's ability to support moral discourse, since he thinks it is\nunreliable. The situation is especially urgent for the kinds of\npre-existing principles that form the (abstract, unchanging) objects\nof moral conversation. For those are a priori by\nnature—they exist independently of the experiences about which\nwe might converse.  As such, there is that much greater a burden on\nmoral language for a Lockean like Crummell, since a speaker could not\nrely on their sensations to support the language they are using. They\nneed to have strong powers of memory as part of their faculty of\nreason, recalling the timeless a priori principles to be\napplied to these current facts. (Plato makes a similar point\nin The Republic, observing the importance of memory in moral\nreasoning and philosophy, especially in the training of the guardian\nclass.) This helps inform his view that blacks ought to adopt English\nas a remedy for the linguistic “defects” he thinks plagues\nGrebo. The ability of English to preserve the complex logical\nstructure of abstract moral reasoning (given its syntactic and\nsemantic structure) recommends it, as well as its infinite\nproductivity.\n\n\nA broader question arises here. By concentrating on purported\ndeficits of rationality of Africans in particular, and blacks in\ngeneral, as opposed to examining its causes (say, slavery and race\ndiscrimination), isn't the analysis misplaced? After all, if the causes\nof diminished cognitive resources are political and historical, then\nany proposed remedy would presumably have to offset (if not remove)\nthose causes. One could go even further (as Crummell easily could) and\nargue that if cognitive resources are diminished due to\nmorally pernicious causes, then moral progress will\nbe stymied unless and until a just accounting of those causes has been\nmade, and remedies are carried out.\n\n\nOne could read Crummell's various arguments about posterity and\nmoral change (below), as well as his case for black civil rights\n(above), as a vindication of this idea. He may be interpreted as making\na moral case for black progress and civilization precisely as\na moral offset to the moral harm that has plagued blacks. But the\nsticking point in that interpretation would be his understanding of\nlanguage and cognition. If his goal is to provide a moral counterweight\nto discrimination and its effects, it seems he hasn't pursued it\nthrough all of its effects—specifically those that concern cognition\nand linguistic ability. He is quite unsparing in his analysis of civil\nrights; why wouldn't he also articulate his case in terms of language\nand reasoning, if that was his real purpose? And the complaint implicit\nin the question stands as a criticism.\n\n\nIt may be that Crummell thought moral criticism of this sort was\nappropriate, but doubted that cognitive deficit could be due to such an\noppressive history. Rarely did he ascribe any black shortcoming to\nlingering effects of slavery, other than in the very broadest of terms.\nIt is likely, given how much is presently understood about\nenvironmental factors in linguistic development, and how little was\nknown then, that it didn't seem plausible to him to think there was any\ncausal connection between slavery and cognitive resources.\n\n\nWhatever the right interpretation, his view of the nature of\ncivilization will figure into his thinking. Crummell saw each\ngeneration as having an obligation to posterity, namely, to contribute\nto civilization, much the way a farmer has to work the soil to produce\na harvest; failure to do so leads to the death of the land, so to\nspeak, and the same is true for civilization. To contribute, though,\nrequires resources (cognitive and linguistic ones included), cultivated\nin a public discourse that makes value and meaning, held among common\npeople, from which intellectuals emerge and draw. (This anticipates Du\nBois' “talented tenth” idea.) Crummell thought blacks, devastated by\nslavery, were severely incapacitated and hence couldn't produce in the\ngeneral population the seeds for that intellectual emergence and\ncivilization. One response could be to assign blame for this woeful\nstate of affairs, as just discussed. Crummell would certainly not\ndisagree that hindrances to blacks led to this cultural derailment and\nsubsequent defect (as he saw it). But his concern was with the\nresources themselves: how could blacks regroup and make up lost ground?\nHence his preoccupation with the cognitive resources rather than with\naccusation and protest. (The activist Douglass provides a ready\ncontrast.)\n\n\nWhile language-deficiency theories have since been discredited,\nCrummell's language analysis remains valuable for its attempt to\ndescribe the work that the deep features of the grammar of the\ncolloquial English commanded by American blacks play in reasoning and\ndiscourse.\n",
    "section_title": "3. The Problem of Moral Reason",
    "entry_title": "Alexander Crummell",
    "hierarchy_title": "Alexander Crummell || The Problem of Moral Reason",
    "tokenized_text": [
        "problem",
        "moral",
        "reason",
        "problem",
        "moral",
        "reason",
        "central",
        "issue",
        "running",
        "concern",
        "crummell",
        "s",
        "derives",
        "nature",
        "moral",
        "reason",
        "describes",
        "structure",
        "human",
        "psyche",
        "consisting",
        "instinct",
        "passion",
        "reason",
        "reason",
        "taking",
        "priority",
        "two",
        "reason",
        "universal",
        "native",
        "sentiment",
        "deepfelt",
        "knowledge",
        "reflexive",
        "recognition",
        "truth",
        "spontaneous",
        "ability",
        "contrasted",
        "externally",
        "conditioned",
        "instinct",
        "passion",
        "eulogy",
        "thomas",
        "sidney",
        "july",
        "ac",
        "spontaneous",
        "reason",
        "opposed",
        "reason",
        "come",
        "effort",
        "exert",
        "intellectual",
        "moral",
        "powers",
        "hence",
        "need",
        "educational",
        "religious",
        "training",
        "thought",
        "aim",
        "allow",
        "individual",
        "agent",
        "perceive",
        "intuitively",
        "awful",
        "truth",
        "eternal",
        "principles",
        "view",
        "moral",
        "reason",
        "take",
        "morally",
        "exemplary",
        "wellhoned",
        "natural",
        "intuition",
        "timeless",
        "moral",
        "principle",
        "plato",
        "easy",
        "antecedent",
        "identify",
        "thinking",
        "crummell",
        "biographer",
        "gregory",
        "rigsby",
        "wilson",
        "jeremiah",
        "moses",
        "attest",
        "crummell",
        "s",
        "emphasis",
        "spontaneous",
        "unconflicted",
        "reason",
        "also",
        "evokes",
        "aristotelian",
        "theme",
        "make",
        "challenge",
        "situate",
        "history",
        "philosophy",
        "plato",
        "held",
        "view",
        "moral",
        "thinking",
        "depended",
        "seeing",
        "object",
        "moral",
        "thought",
        "abstract",
        "preexisting",
        "entity",
        "one",
        "already",
        "see",
        "crummell",
        "s",
        "natural",
        "right",
        "argument",
        "discussed",
        "strong",
        "platonic",
        "streak",
        "clearly",
        "continues",
        "idea",
        "moral",
        "agent",
        "intuit",
        "timeless",
        "principle",
        "plato",
        "pursued",
        "idea",
        "far",
        "enough",
        "conclude",
        "principle",
        "unchanging",
        "precisely",
        "sort",
        "entity",
        "could",
        "underwrite",
        "moral",
        "conversation",
        "reflection",
        "fact",
        "without",
        "moral",
        "action",
        "thinking",
        "would",
        "unstable",
        "constantly",
        "shiftingas",
        "would",
        "put",
        "becoming",
        "might",
        "finally",
        "actually",
        "thing",
        "fortunately",
        "platonic",
        "approach",
        "timeless",
        "abstract",
        "moral",
        "principle",
        "always",
        "never",
        "need",
        "stabilized",
        "justified",
        "crummell",
        "s",
        "approach",
        "evokes",
        "aristotle",
        "well",
        "aristotelian",
        "element",
        "especially",
        "distinctive",
        "given",
        "aristotle",
        "s",
        "thinking",
        "morality",
        "strongly",
        "driven",
        "attempt",
        "repair",
        "regarded",
        "flaw",
        "plato",
        "s",
        "thinking",
        "aristotle",
        "thought",
        "morality",
        "could",
        "theorized",
        "since",
        "nature",
        "practical",
        "work",
        "need",
        "moral",
        "life",
        "even",
        "though",
        "think",
        "involves",
        "goal",
        "merely",
        "gain",
        "understanding",
        "abstract",
        "moral",
        "principle",
        "action",
        "aristotle",
        "thus",
        "took",
        "habit",
        "moral",
        "character",
        "seriouslymuch",
        "theoretical",
        "deliberation",
        "platonistan",
        "emphasis",
        "crummell",
        "seems",
        "share",
        "admiration",
        "friend",
        "sidney",
        "admires",
        "naturalness",
        "moral",
        "life",
        "requiring",
        "effort",
        "intuit",
        "morally",
        "relevant",
        "feature",
        "situation",
        "effort",
        "required",
        "one",
        "yet",
        "habit",
        "virtue",
        "thus",
        "coming",
        "short",
        "aristotelian",
        "metric",
        "sidney",
        "thus",
        "admirable",
        "lacking",
        "weakness",
        "easy",
        "suppose",
        "effortdriven",
        "reason",
        "mark",
        "weakness",
        "hence",
        "something",
        "avoided",
        "best",
        "tolerated",
        "moral",
        "excellence",
        "achieved",
        "crummell",
        "s",
        "view",
        "thus",
        "seems",
        "le",
        "platonic",
        "ideal",
        "moral",
        "excellence",
        "aristotelian",
        "tolerance",
        "moral",
        "failure",
        "apt",
        "given",
        "compromised",
        "agency",
        "observer",
        "would",
        "discern",
        "moral",
        "condition",
        "enslaved",
        "black",
        "crummell",
        "admired",
        "sidney",
        "working",
        "two",
        "kind",
        "excellence",
        "face",
        "compromised",
        "agency",
        "crummell",
        "s",
        "notion",
        "depends",
        "existence",
        "set",
        "fundamental",
        "principle",
        "deeply",
        "unsettled",
        "moral",
        "situation",
        "competing",
        "consideration",
        "press",
        "choice",
        "actual",
        "individual",
        "make",
        "demand",
        "principled",
        "individual",
        "discern",
        "moral",
        "signal",
        "noise",
        "central",
        "idea",
        "reason",
        "cut",
        "principle",
        "even",
        "moral",
        "mental",
        "effort",
        "required",
        "get",
        "clarity",
        "principle",
        "take",
        "providence",
        "make",
        "clarity",
        "progress",
        "possible",
        "hence",
        "view",
        "le",
        "dependent",
        "unsettled",
        "nature",
        "situation",
        "producing",
        "moral",
        "dialectic",
        "instead",
        "derives",
        "tracking",
        "fundamental",
        "principle",
        "crummell",
        "acutely",
        "aware",
        "linguistic",
        "resource",
        "moral",
        "agent",
        "help",
        "determine",
        "fully",
        "reason",
        "morally",
        "thus",
        "capable",
        "agency",
        "draw",
        "principle",
        "describes",
        "though",
        "grossly",
        "unfair",
        "west",
        "african",
        "language",
        "grebo",
        "argument",
        "logically",
        "inadequate",
        "serve",
        "rational",
        "need",
        "black",
        "liberia",
        "speak",
        "offer",
        "instructive",
        "account",
        "interplay",
        "language",
        "thought",
        "little",
        "like",
        "grebo",
        "harsh",
        "abrupt",
        "energetic",
        "indistinct",
        "enunciation",
        "say",
        "meagre",
        "point",
        "word",
        "abound",
        "ing",
        "inarticulate",
        "nasal",
        "guttural",
        "sound",
        "english",
        "language",
        "liberia",
        "fa",
        "posse",
        "e",
        "inflection",
        "grammatical",
        "form",
        "hence",
        "exceedingly",
        "difficult",
        "acquisition",
        "feel",
        "urge",
        "liberian",
        "continue",
        "speak",
        "grebo",
        "instead",
        "english",
        "given",
        "conclusion",
        "plagued",
        "lowness",
        "idea",
        "brutal",
        "vindictive",
        "sentiment",
        "principle",
        "show",
        "predominance",
        "animal",
        "propensities",
        "disaster",
        "writes",
        "since",
        "description",
        "support",
        "moral",
        "concept",
        "distinction",
        "let",
        "alone",
        "concept",
        "germane",
        "justice",
        "politics",
        "even",
        "truth",
        "personal",
        "present",
        "deity",
        "god",
        "s",
        "moral",
        "government",
        "theoretical",
        "worry",
        "concern",
        "principle",
        "naturallanguage",
        "variety",
        "account",
        "various",
        "logical",
        "capacity",
        "expressibility",
        "generativity",
        "crummell",
        "think",
        "prejudicial",
        "despite",
        "extreme",
        "linguistic",
        "bias",
        "modernday",
        "reader",
        "would",
        "take",
        "displaying",
        "relies",
        "john",
        "l",
        "wilson",
        "s",
        "description",
        "grebosomething",
        "standard",
        "ethnography",
        "dayand",
        "great",
        "extent",
        "engaging",
        "positivistic",
        "rather",
        "impressionistic",
        "account",
        "grebo",
        "course",
        "presentday",
        "language",
        "study",
        "would",
        "rely",
        "description",
        "systematically",
        "developed",
        "judgment",
        "native",
        "speaker",
        "rather",
        "nonnative",
        "observation",
        "positivism",
        "theoretical",
        "basis",
        "argument",
        "familiar",
        "john",
        "locke",
        "s",
        "philosophy",
        "language",
        "word",
        "name",
        "thought",
        "articulation",
        "language",
        "effect",
        "mnemonic",
        "device",
        "thinking",
        "regard",
        "reason",
        "would",
        "certainly",
        "lead",
        "emphasize",
        "priori",
        "concept",
        "theoretical",
        "assumption",
        "largely",
        "due",
        "locke",
        "locke",
        "s",
        "philosophy",
        "languagewhich",
        "shared",
        "broad",
        "outline",
        "predecessor",
        "hobbes",
        "descartesholds",
        "thought",
        "mind",
        "whether",
        "innate",
        "thought",
        "mostly",
        "caused",
        "sensation",
        "primary",
        "support",
        "word",
        "language",
        "utter",
        "word",
        "word",
        "mean",
        "idea",
        "mind",
        "utter",
        "grebo",
        "analysis",
        "crummell",
        "offer",
        "take",
        "lockean",
        "philosophy",
        "seriously",
        "grebo",
        "defect",
        "able",
        "preserve",
        "wordidea",
        "relationship",
        "moral",
        "context",
        "though",
        "prejudice",
        "grebo",
        "unfounded",
        "theory",
        "driving",
        "prejudice",
        "enjoyed",
        "wide",
        "acceptance",
        "tempting",
        "see",
        "crummell",
        "s",
        "philosophy",
        "language",
        "term",
        "humboldt",
        "s",
        "work",
        "decade",
        "prior",
        "comparative",
        "grammar",
        "rather",
        "locke",
        "s",
        "empiricist",
        "semantics",
        "humboldt",
        "compared",
        "linguistic",
        "variety",
        "order",
        "discover",
        "pattern",
        "across",
        "variation",
        "idea",
        "linguistic",
        "universal",
        "occur",
        "throughout",
        "human",
        "experience",
        "capture",
        "common",
        "pattern",
        "crummell",
        "thus",
        "read",
        "humboldtian",
        "albeit",
        "illiberal",
        "intolerant",
        "one",
        "may",
        "turn",
        "productive",
        "reading",
        "little",
        "historical",
        "evidence",
        "yet",
        "uncovered",
        "show",
        "crummell",
        "knew",
        "humboldt",
        "case",
        "theoretical",
        "commitment",
        "led",
        "suspicious",
        "grebo",
        "s",
        "ability",
        "support",
        "moral",
        "discourse",
        "since",
        "think",
        "unreliable",
        "situation",
        "especially",
        "urgent",
        "kind",
        "preexisting",
        "principle",
        "form",
        "abstract",
        "unchanging",
        "object",
        "moral",
        "conversation",
        "priori",
        "naturethey",
        "exist",
        "independently",
        "experience",
        "might",
        "converse",
        "much",
        "greater",
        "burden",
        "moral",
        "language",
        "lockean",
        "like",
        "crummell",
        "since",
        "speaker",
        "could",
        "rely",
        "sensation",
        "support",
        "language",
        "using",
        "need",
        "strong",
        "power",
        "memory",
        "part",
        "faculty",
        "reason",
        "recalling",
        "timeless",
        "priori",
        "principle",
        "applied",
        "current",
        "fact",
        "plato",
        "make",
        "similar",
        "point",
        "republic",
        "observing",
        "importance",
        "memory",
        "moral",
        "reasoning",
        "philosophy",
        "especially",
        "training",
        "guardian",
        "class",
        "help",
        "inform",
        "view",
        "black",
        "ought",
        "adopt",
        "english",
        "remedy",
        "linguistic",
        "defect",
        "think",
        "plague",
        "grebo",
        "ability",
        "english",
        "preserve",
        "complex",
        "logical",
        "structure",
        "abstract",
        "moral",
        "reasoning",
        "given",
        "syntactic",
        "semantic",
        "structure",
        "recommends",
        "well",
        "infinite",
        "productivity",
        "broader",
        "question",
        "arises",
        "concentrating",
        "purported",
        "deficit",
        "rationality",
        "african",
        "particular",
        "black",
        "general",
        "opposed",
        "examining",
        "cause",
        "say",
        "slavery",
        "race",
        "discrimination",
        "nt",
        "analysis",
        "misplaced",
        "cause",
        "diminished",
        "cognitive",
        "resource",
        "political",
        "historical",
        "proposed",
        "remedy",
        "would",
        "presumably",
        "offset",
        "remove",
        "cause",
        "one",
        "could",
        "go",
        "even",
        "crummell",
        "easily",
        "could",
        "argue",
        "cognitive",
        "resource",
        "diminished",
        "due",
        "morally",
        "pernicious",
        "cause",
        "moral",
        "progress",
        "stymied",
        "unless",
        "accounting",
        "cause",
        "made",
        "remedy",
        "carried",
        "one",
        "could",
        "read",
        "crummell",
        "s",
        "various",
        "argument",
        "posterity",
        "moral",
        "change",
        "well",
        "case",
        "black",
        "civil",
        "right",
        "vindication",
        "idea",
        "may",
        "interpreted",
        "making",
        "moral",
        "case",
        "black",
        "progress",
        "civilization",
        "precisely",
        "moral",
        "offset",
        "moral",
        "harm",
        "plagued",
        "black",
        "sticking",
        "point",
        "interpretation",
        "would",
        "understanding",
        "language",
        "cognition",
        "goal",
        "provide",
        "moral",
        "counterweight",
        "discrimination",
        "effect",
        "seems",
        "nt",
        "pursued",
        "effectsspecifically",
        "concern",
        "cognition",
        "linguistic",
        "ability",
        "quite",
        "unsparing",
        "analysis",
        "civil",
        "right",
        "would",
        "nt",
        "also",
        "articulate",
        "case",
        "term",
        "language",
        "reasoning",
        "real",
        "purpose",
        "complaint",
        "implicit",
        "question",
        "stand",
        "criticism",
        "may",
        "crummell",
        "thought",
        "moral",
        "criticism",
        "sort",
        "appropriate",
        "doubted",
        "cognitive",
        "deficit",
        "could",
        "due",
        "oppressive",
        "history",
        "rarely",
        "ascribe",
        "black",
        "shortcoming",
        "lingering",
        "effect",
        "slavery",
        "broadest",
        "term",
        "likely",
        "given",
        "much",
        "presently",
        "understood",
        "environmental",
        "factor",
        "linguistic",
        "development",
        "little",
        "known",
        "nt",
        "seem",
        "plausible",
        "think",
        "causal",
        "connection",
        "slavery",
        "cognitive",
        "resource",
        "whatever",
        "right",
        "interpretation",
        "view",
        "nature",
        "civilization",
        "figure",
        "thinking",
        "crummell",
        "saw",
        "generation",
        "obligation",
        "posterity",
        "namely",
        "contribute",
        "civilization",
        "much",
        "way",
        "farmer",
        "work",
        "soil",
        "produce",
        "harvest",
        "failure",
        "lead",
        "death",
        "land",
        "speak",
        "true",
        "civilization",
        "contribute",
        "though",
        "requires",
        "resource",
        "cognitive",
        "linguistic",
        "one",
        "included",
        "cultivated",
        "public",
        "discourse",
        "make",
        "value",
        "meaning",
        "held",
        "among",
        "common",
        "people",
        "intellectual",
        "emerge",
        "draw",
        "anticipates",
        "du",
        "bois",
        "talented",
        "tenth",
        "idea",
        "crummell",
        "thought",
        "black",
        "devastated",
        "slavery",
        "severely",
        "incapacitated",
        "hence",
        "could",
        "nt",
        "produce",
        "general",
        "population",
        "seed",
        "intellectual",
        "emergence",
        "civilization",
        "one",
        "response",
        "could",
        "assign",
        "blame",
        "woeful",
        "state",
        "affair",
        "discussed",
        "crummell",
        "would",
        "certainly",
        "disagree",
        "hindrance",
        "black",
        "led",
        "cultural",
        "derailment",
        "subsequent",
        "defect",
        "saw",
        "concern",
        "resource",
        "could",
        "black",
        "regroup",
        "make",
        "lost",
        "ground",
        "hence",
        "preoccupation",
        "cognitive",
        "resource",
        "rather",
        "accusation",
        "protest",
        "activist",
        "douglas",
        "provides",
        "ready",
        "contrast",
        "languagedeficiency",
        "theory",
        "since",
        "discredited",
        "crummell",
        "s",
        "language",
        "analysis",
        "remains",
        "valuable",
        "attempt",
        "describe",
        "work",
        "deep",
        "feature",
        "grammar",
        "colloquial",
        "english",
        "commanded",
        "american",
        "black",
        "play",
        "reasoning",
        "discourse"
    ]
}