{
    "main_text": "Life\n1. Life\n\nLouis Althusser was born on October 16th, 1918 in Bir\nMourad Raïs (formerly Birmandreis), a suburb of Algiers.\nHailing from Alsace on his father’s side of the family, his\ngrandparents were French citizens who had chosen to settle in\nAlgeria. At the time of his birth, Althusser’s father was a\nlieutenant in the French Military. After this service was up, his\nfather returned to Algiers and to his work as a banker. By all\naccounts save for the retrospective ones contained in his\nautobiographies, Althusser’s early childhood in North Africa was\na contented one. There he enjoyed the comforts of the Mediterranean\nenvironment as well as those provided by an extended and stable\npetit-bourgeois family.\n\nIn 1930, his father’s work moved the family to Marseille. Always\na good pupil, Althusser excelled in his studies and became active in\nthe Scouts. In 1936, the family moved again, this time to Lyon. There,\nAlthusser was enrolled in the prestigious Lycée du Parc. At the\nLycée, he began taking classes in order to prepare for the\ncompetitive entrance exams to France’s grandes\nécoles. Raised in an observant family, Althusser was\nparticularly influenced by professors of a distinctly Catholic\ntendency. These included the philosophers Jean Guitton and Jean\nLacroix as well as the historian Joseph Hours. In 1937, while still at\nthe Lycée, Althusser joined the Catholic youth group\nJeunesse étudiantes chrétiennes. This interest\nin Catholicism and his participation in Catholic organizations would\ncontinue even after Althusser joined the Communist Party in 1948. The\nsimultaneous enthusiasm that Althusser showed in Lyon for Royalist\npolitics did not last the war.\n\nIn 1939, Althusser performed well enough on the national entrance\nexaminations to be admitted to the École Normale\nSupérieure (ENS) in Paris. However, before the school year\nbegan, he was mobilized into the army. Soon thereafter, he was\ncaptured in Vannes along with the rest of his artillery regiment. He\nspent the remainder of the war as a prisoner of war at a camp in\nNorthern Germany. In his autobiographical writings, Althusser credits\nthe experiences of solidarity, political action, and community that he\nfound in the camp as opening him up to the idea of communism. Indeed,\nhis prison writings collected as Journal de captivité,\nStalag XA 1940–1945 evidence these experiences. They also\nprovide evidence of the cycles of deep depression that began for\nAlthusser in 1938 and that would mark him for the rest of his\nlife.\n\nAt the end of the war and following his release from the P.O.W. camp\nin 1945, Althusser took his place at the ENS. Now 27 years old, he\nbegan the program of study that was to prepare him for the\nagrégation, the competitive examination which\nqualifies one to teach philosophy in French secondary schools and that\nis often the gateway to doctoral study and university employment.\nPerhaps not surprisingly for a young man who had just spent half a\ndecade in a prison camp, much happened during the three years he spent\npreparing for the exam and working on his Master’s thesis.\nThough still involved in Catholic groups and still seeing himself as a\nChristian, the movements that Althusser associated with after the war\nwere leftist in their politics and, intellectually, he made a move to\nembrace and synthesize Christian and Marxist thought. This synthesis\nand his first published works were informed by a reading of\n19th Century German idealist philosophy, especially Hegel\nand Marx, as well as by progressive Christian thinkers associated with\nthe group Jeunesse de l’Église. Indeed, it was\n19th Century German Idealism with which he was most engaged\nduring his period of study at the ENS. In line with this interest (one\nshared with many other French intellectuals at the time), Althusser\nobtained his diplôme d’études\nsupérieures in 1947 for a work directed by Gaston\nBachelard and titled “On Content in the Thought of G.W.F.\nHegel.” In 1948, he passed his agrégation,\ncoming in first on the written portion of the exam and second on the\noral. After this showing, Althusser was offered and accepted the post\nof agrégé répétiteur (director of\nstudies) at the ENS whose responsibility it was to help students\nprepare for their own agrégations. In this capacity,\nhe began offering courses and tutorials on particular topics in\nphilosophy and on particular figures from the history of philosophy.\nAs he retained this responsibility for more than thirty years and\nworked with some of the brightest thinkers that France produced during\nthis time (including Alain Badiou, Pierre Bourdieu, and Michel\nFoucault), through his teaching Althusser left a deep and lasting\nimpression on a generation of French philosophers and on French\nphilosophy.\n\nIn addition to inaugurating his extended association with the ENS, the\nfirst few years spent in Paris after the war saw Althusser begin three\nother long-lasting relationships. The first of these was with the\nFrench Communist Party, the second with his companion and eventual\nwife, Hélène Rytmann-Légotien, and the third with\nFrench psychiatry. Begun to treat recurrent bouts of depression, this\nlast affiliation continued for the rest of his life and included\nfrequent hospitalization as well as the most aggressive treatments\npost-war French psychiatry had to offer such as electroconvulsive\ntherapy, narco-analysis, and psychoanalysis.\n\nThe second relationship begun by Althusser was little happier and no\nless dependent than the first. At its outset, Althusser’s bond\nwith Rytmann-Légotien was complicated by his almost\ntotal inexperience with women and by her being eight years older than\nhim. It was also made difficult by the vast differences in their\nexperience of the world and by her relationship with the Communist\nParty. Whereas Althusser had known only home, school, and P.O.W.\ncamp, Rytmann-Légotien had traveled widely and had long\nbeen active in literary and radical circles. At the time the two met,\nshe was also embroiled in a dispute with the Party over her role in\nthe resistance during World War II.\n\nThough Althusser was not yet a Party member, like many of his\ngeneration, he emerged from the War deeply sympathetic to its moral\naims. His interest in Party politics and involvement with Party\nmembers grew during his time as a student at the ENS. However, the\nENS’ suspicion of communists as well\nas Rytmann-Légotien’s troubles with the Party\ncomplicated Althusser’s relationship with each of these\ninstitutions. Nonetheless, shortly after being offered the post of\nagrégé répétiteur (and thus safe\nfrom being bypassed for the position due to his membership), Althusser\njoined the Communist Party. For the next few years, Althusser tried to\nadvance the aims of the Communist Party as well as the goal of getting\nHélène Rytmann-Légotien accepted back into it. He\ndid so by being a good militant (going to cell meetings, distributing\ntracts, etc), by re-starting a Marxist study group at the ENS (the\nCercle Politzer), and by making inquiries into\nHélène Rytmann-Légotien’s wartime\nactivities in the hopes of clearing her name. By his own account, he\nmade a terrible activist and he also failed to rehabilitate\nher reputation. Nonetheless, his relationship with the Party and\nwith his future wife deepened during this period.\n\nDuring the 1950s, Althusser lived two lives that were only somewhat\ninter-related: one was that of a successful, if somewhat obscure\nacademic philosopher and pedagogue and the other that of a loyal\nCommunist Party Member. This is not to say that Althusser was\npolitically inactive at the school or that his communism did not\ninfluence his philosophical work. On the contrary, Althusser recruited\ncolleagues and students to the Party and worked closely with the\ncommunist cell based at the ENS. In addition, at mid-decade, he\npublished a few introductions to Marxist philosophy. However, in his\nteaching and advising, he mostly avoided bringing in Marxist\nphilosophy and Communist politics. Instead, he catered to student\ninterest and to the demands of each new agrégation by\nengaging closely with classic philosophical texts and with\ncontemporary philosophy and social science. Further, the bulk of his\nscholarship was on 18th Century political philosophy.\nIndeed, the only book-length study Althusser published during his\nlifetime was a work on Montesquieu, which appeared at the end of the\ndecade. At the ENS, Althusser’s professionalism as well as his\nability to think institutionally was rewarded in 1954 with a promotion\nto secrétaire de l’école\nlittéraire, a post where he had some responsibility for\nthe management and direction of the school.\n\nIt would have surprised no one if Althusser had continued to influence\nFrench political and philosophical life subtly, through the students\nthat he mentored, through his scholarship on the history of political\nphilosophy, through the colloquia among philosophers, scientists, and\nhistorians that he organized, and through his routine work as a Party\nmember. However, in 1961, with an essay titled “On the Young\nMarx,” Althusser aggressively entered into a heated debate about\nthe continuity of Marx’s oeuvre and about what constitutes the\ncore of Marxist philosophy. Appearing at a time of crisis in the\nFrench Communist Party’s direction and seeming to offer a\n“scientific” alternative to Stalinism and to the humanist\nrevisions of Marxism then being proffered, the theoretical viewpoint\noffered by Althusser gained adherents. Invigorated by this recognition\nand by the possibility that theoretical work might actually change\nCommunist Party practice, Althusser began to publish regularly on\nMarxist philosophy. These essays occasioned much public discussion and\nphilosophical activity both in France and abroad. At the same time as\nthese essays began creating a stir, Althusser changed his teaching\nstyle at the ENS and began to offer collaborative seminars where he\nand his students attempted a “return to Marx” and to\nMarx’s original texts. In 1965, the fruit of one of these\nseminars was published as Reading Capital. That same year,\nthe essays on Marxist theory that had made such a sensation were\ncollected and published in the volume For Marx. Amplifying\nthese books’ collective impact well beyond the realm of\nintra-party discussion was the general trend in literary and social\nscientific theory labeled “structuralism” and with which\nAlthusser’s re-reading of Marx was identified.\n\nAt mid-decade, Althusser seized on these works’ popularity and\nthe fact that his arguments had created a faction within the French\nCommunist Party composed mostly of young intelligentsia to try and\nforce change. This gambit to have the Party directed by theorists\nrather than by a Central Committee, whose Stalinism remained\nentrenched and who believed in the organic wisdom of the worker, met\nwith little success. At the most, he succeeded in carving out some\nautonomy for theoretical reflection within the Party. Even though it\nis his most well-known intervention, this was not the first attempt by\nAlthusser to try and influence the Party (he had tried once before\nduring the mid 1950s from his position as cell leader at the ENS) and\nit would not be his last. While he lost much of the student support\nthat his work had created when he remained silent during the\n“revolutionary” events of May 1968 (he was in a\npsychiatric hospital at the time), he campaigned once more to\ninfluence the Party during the mid 1970s. This intervention occurred\nin response to the French Communist Party’s decision to abandon\ntraditional Marxist-Leninist aspects of its platform so as to better\nally itself with the Socialist Party. Though Althusser’s\nposition was well publicized and found its supporters, in the end, his\narguments were unable to motivate the Party’s rank-and-file such\nthat its leadership would reconsider its decision.\n\nDuring the decades in which he became internationally known for his\nre-thinking of Marxist philosophy, Althusser continued in his post at\nthe ENS. There he took on increasing institutional responsibility\nwhile continuing to edit and, with François Maspero, to publish\nhis own work and that of others in the series Théorie.\nIn 1975, Althusser acquired the right to direct research on the basis\nof his previously published work. Shortly after this recognition, he\nmarried his longtime companion, Hélène\nRytmann-Légotien.\n\nFollowing the French Left’s and the Communist Party’s\nelectoral defeats in the 1978 elections, Althusser’s bouts of\ndepression became more severe and more frequent. In November 1980,\nafter a painful surgery and another bout of mental illness, which saw\nhim hospitalized for most of the summer and whose symptoms continued\nafter his return to the ENS in the fall, Althusser strangled his wife.\nBefore he could be arrested for the murder, he was sent to a mental\nhospital. Later, when an examining magistrate came to inform him of\nthe crime of which he was accused, Althusser was in so fragile a\nmental state that he could not understand the charges or the process\nto which he was to be submitted and he was left at the hospital. After\nan examination, a panel of psychiatrists concluded that Althusser was\nsuffering at the time of the murder from severe depression and\niatrogenic hallucinations. Citing a French law (since changed), which\nstates that “there is neither crime nor delict where the suspect\nwas in a state of dementia at the time of the action,” the\nmagistrate in charge of Althusser’s case decided that there were\nno grounds on which to pursue prosecution.\n\nThe last ten years of Althusser’s life were spent in and out of\nmental hospitals and at the apartment in Paris’ 20th\narrondissement where he had planned to retire. During this period, he\nwas visited by a few loyal friends and kept up some correspondences.\nGiven his mental state, his frequent institutionalizations, his\nanomie, and the drugs he was prescribed, these were not very\nproductive years. However, at mid-decade, he did find the energy to\nre-visit some of his old work and to attempt to construct from it an\nexplicit metaphysics. He also managed to write an autobiography, a\ntext he averred was intended to provide the explanation for the murder\nof his wife that he was never able to provide in court. Both texts\nonly appeared posthumously. When his mental and physical health\ndeteriorated again in 1987, Althusser went to live at a psychiatric\nhospital in La Verrière, a village to the west of Paris. There,\non the 22nd of October, 1990, he died of a heart attack\n",
    "section_title": "1. Life",
    "entry_title": "Louis Althusser",
    "hierarchy_title": "Louis Althusser || Life",
    "tokenized_text": [
        "life",
        "life",
        "louis",
        "althusser",
        "born",
        "october",
        "th",
        "bir",
        "mourad",
        "raïs",
        "formerly",
        "birmandreis",
        "suburb",
        "algiers",
        "hailing",
        "alsace",
        "father",
        "side",
        "family",
        "grandparent",
        "french",
        "citizen",
        "chosen",
        "settle",
        "algeria",
        "time",
        "birth",
        "althusser",
        "father",
        "lieutenant",
        "french",
        "military",
        "service",
        "father",
        "returned",
        "algiers",
        "work",
        "banker",
        "account",
        "save",
        "retrospective",
        "one",
        "contained",
        "autobiography",
        "althusser",
        "early",
        "childhood",
        "north",
        "africa",
        "contented",
        "one",
        "enjoyed",
        "comfort",
        "mediterranean",
        "environment",
        "well",
        "provided",
        "extended",
        "stable",
        "petitbourgeois",
        "family",
        "father",
        "work",
        "moved",
        "family",
        "marseille",
        "always",
        "good",
        "pupil",
        "althusser",
        "excelled",
        "study",
        "became",
        "active",
        "scout",
        "family",
        "moved",
        "time",
        "lyon",
        "althusser",
        "enrolled",
        "prestigious",
        "lycée",
        "du",
        "parc",
        "lycée",
        "began",
        "taking",
        "class",
        "order",
        "prepare",
        "competitive",
        "entrance",
        "exam",
        "france",
        "grandes",
        "écoles",
        "raised",
        "observant",
        "family",
        "althusser",
        "particularly",
        "influenced",
        "professor",
        "distinctly",
        "catholic",
        "tendency",
        "included",
        "philosopher",
        "jean",
        "guitton",
        "jean",
        "lacroix",
        "well",
        "historian",
        "joseph",
        "hour",
        "still",
        "lycée",
        "althusser",
        "joined",
        "catholic",
        "youth",
        "group",
        "jeunesse",
        "étudiantes",
        "chrétiennes",
        "interest",
        "catholicism",
        "participation",
        "catholic",
        "organization",
        "would",
        "continue",
        "even",
        "althusser",
        "joined",
        "communist",
        "party",
        "simultaneous",
        "enthusiasm",
        "althusser",
        "showed",
        "lyon",
        "royalist",
        "politics",
        "last",
        "war",
        "althusser",
        "performed",
        "well",
        "enough",
        "national",
        "entrance",
        "examination",
        "admitted",
        "école",
        "normale",
        "supérieure",
        "en",
        "paris",
        "however",
        "school",
        "year",
        "began",
        "mobilized",
        "army",
        "soon",
        "thereafter",
        "captured",
        "vannes",
        "along",
        "rest",
        "artillery",
        "regiment",
        "spent",
        "remainder",
        "war",
        "prisoner",
        "war",
        "camp",
        "northern",
        "germany",
        "autobiographical",
        "writing",
        "althusser",
        "credit",
        "experience",
        "solidarity",
        "political",
        "action",
        "community",
        "found",
        "camp",
        "opening",
        "idea",
        "communism",
        "indeed",
        "prison",
        "writing",
        "collected",
        "journal",
        "de",
        "captivité",
        "stalag",
        "xa",
        "evidence",
        "experience",
        "also",
        "provide",
        "evidence",
        "cycle",
        "deep",
        "depression",
        "began",
        "althusser",
        "would",
        "mark",
        "rest",
        "life",
        "end",
        "war",
        "following",
        "release",
        "pow",
        "camp",
        "althusser",
        "took",
        "place",
        "en",
        "year",
        "old",
        "began",
        "program",
        "study",
        "prepare",
        "agrégation",
        "competitive",
        "examination",
        "qualifies",
        "one",
        "teach",
        "philosophy",
        "french",
        "secondary",
        "school",
        "often",
        "gateway",
        "doctoral",
        "study",
        "university",
        "employment",
        "perhaps",
        "surprisingly",
        "young",
        "man",
        "spent",
        "half",
        "decade",
        "prison",
        "camp",
        "much",
        "happened",
        "three",
        "year",
        "spent",
        "preparing",
        "exam",
        "working",
        "master",
        "thesis",
        "though",
        "still",
        "involved",
        "catholic",
        "group",
        "still",
        "seeing",
        "christian",
        "movement",
        "althusser",
        "associated",
        "war",
        "leftist",
        "politics",
        "intellectually",
        "made",
        "move",
        "embrace",
        "synthesize",
        "christian",
        "marxist",
        "thought",
        "synthesis",
        "first",
        "published",
        "work",
        "informed",
        "reading",
        "th",
        "century",
        "german",
        "idealist",
        "philosophy",
        "especially",
        "hegel",
        "marx",
        "well",
        "progressive",
        "christian",
        "thinker",
        "associated",
        "group",
        "jeunesse",
        "de",
        "l",
        "église",
        "indeed",
        "th",
        "century",
        "german",
        "idealism",
        "engaged",
        "period",
        "study",
        "en",
        "line",
        "interest",
        "one",
        "shared",
        "many",
        "french",
        "intellectual",
        "time",
        "althusser",
        "obtained",
        "diplôme",
        "études",
        "supérieures",
        "work",
        "directed",
        "gaston",
        "bachelard",
        "titled",
        "content",
        "thought",
        "gwf",
        "hegel",
        "passed",
        "agrégation",
        "coming",
        "first",
        "written",
        "portion",
        "exam",
        "second",
        "oral",
        "showing",
        "althusser",
        "offered",
        "accepted",
        "post",
        "agrégé",
        "répétiteur",
        "director",
        "study",
        "en",
        "whose",
        "responsibility",
        "help",
        "student",
        "prepare",
        "agrégations",
        "capacity",
        "began",
        "offering",
        "course",
        "tutorial",
        "particular",
        "topic",
        "philosophy",
        "particular",
        "figure",
        "history",
        "philosophy",
        "retained",
        "responsibility",
        "thirty",
        "year",
        "worked",
        "brightest",
        "thinker",
        "france",
        "produced",
        "time",
        "including",
        "alain",
        "badiou",
        "pierre",
        "bourdieu",
        "michel",
        "foucault",
        "teaching",
        "althusser",
        "left",
        "deep",
        "lasting",
        "impression",
        "generation",
        "french",
        "philosopher",
        "french",
        "philosophy",
        "addition",
        "inaugurating",
        "extended",
        "association",
        "en",
        "first",
        "year",
        "spent",
        "paris",
        "war",
        "saw",
        "althusser",
        "begin",
        "three",
        "longlasting",
        "relationship",
        "first",
        "french",
        "communist",
        "party",
        "second",
        "companion",
        "eventual",
        "wife",
        "hélène",
        "rytmannlégotien",
        "third",
        "french",
        "psychiatry",
        "begun",
        "treat",
        "recurrent",
        "bout",
        "depression",
        "last",
        "affiliation",
        "continued",
        "rest",
        "life",
        "included",
        "frequent",
        "hospitalization",
        "well",
        "aggressive",
        "treatment",
        "postwar",
        "french",
        "psychiatry",
        "offer",
        "electroconvulsive",
        "therapy",
        "narcoanalysis",
        "psychoanalysis",
        "second",
        "relationship",
        "begun",
        "althusser",
        "little",
        "happier",
        "le",
        "dependent",
        "first",
        "outset",
        "althusser",
        "bond",
        "rytmannlégotien",
        "complicated",
        "almost",
        "total",
        "inexperience",
        "woman",
        "eight",
        "year",
        "older",
        "also",
        "made",
        "difficult",
        "vast",
        "difference",
        "experience",
        "world",
        "relationship",
        "communist",
        "party",
        "whereas",
        "althusser",
        "known",
        "home",
        "school",
        "pow",
        "camp",
        "rytmannlégotien",
        "traveled",
        "widely",
        "long",
        "active",
        "literary",
        "radical",
        "circle",
        "time",
        "two",
        "met",
        "also",
        "embroiled",
        "dispute",
        "party",
        "role",
        "resistance",
        "world",
        "war",
        "ii",
        "though",
        "althusser",
        "yet",
        "party",
        "member",
        "like",
        "many",
        "generation",
        "emerged",
        "war",
        "deeply",
        "sympathetic",
        "moral",
        "aim",
        "interest",
        "party",
        "politics",
        "involvement",
        "party",
        "member",
        "grew",
        "time",
        "student",
        "en",
        "however",
        "en",
        "suspicion",
        "communist",
        "well",
        "rytmannlégotien",
        "trouble",
        "party",
        "complicated",
        "althusser",
        "relationship",
        "institution",
        "nonetheless",
        "shortly",
        "offered",
        "post",
        "agrégé",
        "répétiteur",
        "thus",
        "safe",
        "bypassed",
        "position",
        "due",
        "membership",
        "althusser",
        "joined",
        "communist",
        "party",
        "next",
        "year",
        "althusser",
        "tried",
        "advance",
        "aim",
        "communist",
        "party",
        "well",
        "goal",
        "getting",
        "hélène",
        "rytmannlégotien",
        "accepted",
        "back",
        "good",
        "militant",
        "going",
        "cell",
        "meeting",
        "distributing",
        "tract",
        "etc",
        "restarting",
        "marxist",
        "study",
        "group",
        "en",
        "cercle",
        "politzer",
        "making",
        "inquiry",
        "hélène",
        "rytmannlégotien",
        "wartime",
        "activity",
        "hope",
        "clearing",
        "name",
        "account",
        "made",
        "terrible",
        "activist",
        "also",
        "failed",
        "rehabilitate",
        "reputation",
        "nonetheless",
        "relationship",
        "party",
        "future",
        "wife",
        "deepened",
        "period",
        "s",
        "althusser",
        "lived",
        "two",
        "life",
        "somewhat",
        "interrelated",
        "one",
        "successful",
        "somewhat",
        "obscure",
        "academic",
        "philosopher",
        "pedagogue",
        "loyal",
        "communist",
        "party",
        "member",
        "say",
        "althusser",
        "politically",
        "inactive",
        "school",
        "communism",
        "influence",
        "philosophical",
        "work",
        "contrary",
        "althusser",
        "recruited",
        "colleague",
        "student",
        "party",
        "worked",
        "closely",
        "communist",
        "cell",
        "based",
        "en",
        "addition",
        "middecade",
        "published",
        "introduction",
        "marxist",
        "philosophy",
        "however",
        "teaching",
        "advising",
        "mostly",
        "avoided",
        "bringing",
        "marxist",
        "philosophy",
        "communist",
        "politics",
        "instead",
        "catered",
        "student",
        "interest",
        "demand",
        "new",
        "agrégation",
        "engaging",
        "closely",
        "classic",
        "philosophical",
        "text",
        "contemporary",
        "philosophy",
        "social",
        "science",
        "bulk",
        "scholarship",
        "th",
        "century",
        "political",
        "philosophy",
        "indeed",
        "booklength",
        "study",
        "althusser",
        "published",
        "lifetime",
        "work",
        "montesquieu",
        "appeared",
        "end",
        "decade",
        "en",
        "althusser",
        "professionalism",
        "well",
        "ability",
        "think",
        "institutionally",
        "rewarded",
        "promotion",
        "secrétaire",
        "de",
        "l",
        "école",
        "littéraire",
        "post",
        "responsibility",
        "management",
        "direction",
        "school",
        "would",
        "surprised",
        "one",
        "althusser",
        "continued",
        "influence",
        "french",
        "political",
        "philosophical",
        "life",
        "subtly",
        "student",
        "mentored",
        "scholarship",
        "history",
        "political",
        "philosophy",
        "colloquium",
        "among",
        "philosopher",
        "scientist",
        "historian",
        "organized",
        "routine",
        "work",
        "party",
        "member",
        "however",
        "essay",
        "titled",
        "young",
        "marx",
        "althusser",
        "aggressively",
        "entered",
        "heated",
        "debate",
        "continuity",
        "marx",
        "oeuvre",
        "constitutes",
        "core",
        "marxist",
        "philosophy",
        "appearing",
        "time",
        "crisis",
        "french",
        "communist",
        "party",
        "direction",
        "seeming",
        "offer",
        "scientific",
        "alternative",
        "stalinism",
        "humanist",
        "revision",
        "marxism",
        "proffered",
        "theoretical",
        "viewpoint",
        "offered",
        "althusser",
        "gained",
        "adherent",
        "invigorated",
        "recognition",
        "possibility",
        "theoretical",
        "work",
        "might",
        "actually",
        "change",
        "communist",
        "party",
        "practice",
        "althusser",
        "began",
        "publish",
        "regularly",
        "marxist",
        "philosophy",
        "essay",
        "occasioned",
        "much",
        "public",
        "discussion",
        "philosophical",
        "activity",
        "france",
        "abroad",
        "time",
        "essay",
        "began",
        "creating",
        "stir",
        "althusser",
        "changed",
        "teaching",
        "style",
        "en",
        "began",
        "offer",
        "collaborative",
        "seminar",
        "student",
        "attempted",
        "return",
        "marx",
        "marx",
        "original",
        "text",
        "fruit",
        "one",
        "seminar",
        "published",
        "reading",
        "capital",
        "year",
        "essay",
        "marxist",
        "theory",
        "made",
        "sensation",
        "collected",
        "published",
        "volume",
        "marx",
        "amplifying",
        "book",
        "collective",
        "impact",
        "well",
        "beyond",
        "realm",
        "intraparty",
        "discussion",
        "general",
        "trend",
        "literary",
        "social",
        "scientific",
        "theory",
        "labeled",
        "structuralism",
        "althusser",
        "rereading",
        "marx",
        "identified",
        "middecade",
        "althusser",
        "seized",
        "work",
        "popularity",
        "fact",
        "argument",
        "created",
        "faction",
        "within",
        "french",
        "communist",
        "party",
        "composed",
        "mostly",
        "young",
        "intelligentsia",
        "try",
        "force",
        "change",
        "gambit",
        "party",
        "directed",
        "theorist",
        "rather",
        "central",
        "committee",
        "whose",
        "stalinism",
        "remained",
        "entrenched",
        "believed",
        "organic",
        "wisdom",
        "worker",
        "met",
        "little",
        "success",
        "succeeded",
        "carving",
        "autonomy",
        "theoretical",
        "reflection",
        "within",
        "party",
        "even",
        "though",
        "wellknown",
        "intervention",
        "first",
        "attempt",
        "althusser",
        "try",
        "influence",
        "party",
        "tried",
        "mid",
        "s",
        "position",
        "cell",
        "leader",
        "en",
        "would",
        "last",
        "lost",
        "much",
        "student",
        "support",
        "work",
        "created",
        "remained",
        "silent",
        "revolutionary",
        "event",
        "may",
        "psychiatric",
        "hospital",
        "time",
        "campaigned",
        "influence",
        "party",
        "mid",
        "s",
        "intervention",
        "occurred",
        "response",
        "french",
        "communist",
        "party",
        "decision",
        "abandon",
        "traditional",
        "marxistleninist",
        "aspect",
        "platform",
        "better",
        "ally",
        "socialist",
        "party",
        "though",
        "althusser",
        "position",
        "well",
        "publicized",
        "found",
        "supporter",
        "end",
        "argument",
        "unable",
        "motivate",
        "party",
        "rankandfile",
        "leadership",
        "would",
        "reconsider",
        "decision",
        "decade",
        "became",
        "internationally",
        "known",
        "rethinking",
        "marxist",
        "philosophy",
        "althusser",
        "continued",
        "post",
        "en",
        "took",
        "increasing",
        "institutional",
        "responsibility",
        "continuing",
        "edit",
        "françois",
        "maspero",
        "publish",
        "work",
        "others",
        "series",
        "théorie",
        "althusser",
        "acquired",
        "right",
        "direct",
        "research",
        "basis",
        "previously",
        "published",
        "work",
        "shortly",
        "recognition",
        "married",
        "longtime",
        "companion",
        "hélène",
        "rytmannlégotien",
        "following",
        "french",
        "left",
        "communist",
        "party",
        "electoral",
        "defeat",
        "election",
        "althusser",
        "bout",
        "depression",
        "became",
        "severe",
        "frequent",
        "november",
        "painful",
        "surgery",
        "another",
        "bout",
        "mental",
        "illness",
        "saw",
        "hospitalized",
        "summer",
        "whose",
        "symptom",
        "continued",
        "return",
        "en",
        "fall",
        "althusser",
        "strangled",
        "wife",
        "could",
        "arrested",
        "murder",
        "sent",
        "mental",
        "hospital",
        "later",
        "examining",
        "magistrate",
        "came",
        "inform",
        "crime",
        "accused",
        "althusser",
        "fragile",
        "mental",
        "state",
        "could",
        "understand",
        "charge",
        "process",
        "submitted",
        "left",
        "hospital",
        "examination",
        "panel",
        "psychiatrist",
        "concluded",
        "althusser",
        "suffering",
        "time",
        "murder",
        "severe",
        "depression",
        "iatrogenic",
        "hallucination",
        "citing",
        "french",
        "law",
        "since",
        "changed",
        "state",
        "neither",
        "crime",
        "delict",
        "suspect",
        "state",
        "dementia",
        "time",
        "action",
        "magistrate",
        "charge",
        "althusser",
        "case",
        "decided",
        "ground",
        "pursue",
        "prosecution",
        "last",
        "ten",
        "year",
        "althusser",
        "life",
        "spent",
        "mental",
        "hospital",
        "apartment",
        "paris",
        "th",
        "arrondissement",
        "planned",
        "retire",
        "period",
        "visited",
        "loyal",
        "friend",
        "kept",
        "correspondence",
        "given",
        "mental",
        "state",
        "frequent",
        "institutionalizations",
        "anomie",
        "drug",
        "prescribed",
        "productive",
        "year",
        "however",
        "middecade",
        "find",
        "energy",
        "revisit",
        "old",
        "work",
        "attempt",
        "construct",
        "explicit",
        "metaphysics",
        "also",
        "managed",
        "write",
        "autobiography",
        "text",
        "averred",
        "intended",
        "provide",
        "explanation",
        "murder",
        "wife",
        "never",
        "able",
        "provide",
        "court",
        "text",
        "appeared",
        "posthumously",
        "mental",
        "physical",
        "health",
        "deteriorated",
        "althusser",
        "went",
        "live",
        "psychiatric",
        "hospital",
        "la",
        "verrière",
        "village",
        "west",
        "paris",
        "nd",
        "october",
        "died",
        "heart",
        "attack"
    ]
}