{
    "main_text": "Being and Categories\n2. Being and Categories\n\nThe point of departure of every realist interpretation of the\nCategories is the notion of being (ens) in its\nrelationship to the ten categories, as Realists considered the\ncategorial table to be a division of beings. Like Burley, Alyngton\naffirms that (i) the division into categories is first of all a\ndivision of things existing outside the mind, and only secondarily of\nthe mental concepts and spoken or written terms which signify them,\nand (ii) things belonging to one categorial field are really distinct\nfrom those belonging to another—for instance, substances are\nreally distinct from quantities, qualities, and relations, quantities\nare really distinct from substances, qualities, and relations, and so\non (In Cat., cap. de numero et sufficientia\npraedicamentorum, Conti pp. 251, 252–53).\n\nUnfortunately Alyngton does not define being; yet, what he says about\n(1) the subject of the Categories (the real categorial being\nwhich can be signified by simple expressions, namely terms (In\nCat., cap. de numero et sufficientia praedicamentorum ,\np. 252), and (2) analogy (In Cat., cap. de\naequivocis, ms. London, Lambeth Palace 393, fol. 70r–v)\nseems to entail that, like Wyclif, he also thinks of being as a sort\nof an extramental reality proper to everything (God and creatures;\nsubstances and accidents; universal and individual items; things,\ncollections of things, and states of affairs) according to different\nmodes and degrees.\n\nIn the thirteenth and fourteenth centuries, all the realist authors,\nwith the only notable exception of Duns Scotus, regarded categorial\nitems as composed of two main aspects: the inner nature or essence,\nand their peculiar mode of being or of being predicated (modi\nessendi vel praedicandi). They maintained that the categorial\ntable divides categorial items according to their modes of being (or\nof being predicated) and not according to their inner natures (or\nessences). In particular, Thomas Aquinas (Sententia super\nMetaphysicam, liber V, lectio 9) based his method of finding the\nten Aristotelian categories on the differences of modes of being\npredicated, and recognized three fundamental modes of being\npredicated: essentially, proper to substances, when the predication\nindicates what a given thing is; accidentally, proper to quantities,\nqualities, and relatives, when the predication indicates that\nsomething inheres in a subject; and externally, proper to the\nremaining six categories, when the predication indicates that\nsomething which does not inhere in the subject nevertheless affects\nit. On the contrary Albert the Great (Liber de\npraedicamentis, tr. I, cap. 7) and Simon of Faversham\n(Quaestiones super librum Praedicamentorum, q. 12) based\ntheir method of finding the categories on the differences of modes of\nbeing. They admitted two fundamental modes of being: being by itself,\nproper to substance; and being in something else, proper to the nine\ngenera of accidents. The latter was subdivided into being in something\nelse absolutely, proper to quantities and qualities, and being in\nsomething else in virtue of a relation to a third thing (esse ad\naliud), proper to the remaining seven categories. Walter Burley,\nwhose last commentary on the Categories is, along with\nWyclif’s De ente praedicamentali, the main source of\nAlyngton’s commentary on the Categories, recalled two\nways of deducing the ten Aristotelian categories, both based on the\nvarious levels of similarity among their own modes of being. Alyngton\nfollows very closely Burley’s first way of deriving the ten\ncategories. In his opinion, there are two fundamental modes of being\nproper to things: being by itself, which characterizes substances, and\nbeing or inhering in something else, which characterizes accidents.\nThe latter is subdivided into three less general modes: being in\nsomething else in virtue of its matter; being in something else in\nvirtue of its form; and being in something else in virtue of the whole\ncomposite. Something can inhere in something else in virtue of its\nmatter, form, and composite according to three different ways: from\ninside (ab intrinseco), from outside (ab\nextrinseco), and partially from inside and partially from outside\n(partim ab intrinseco et partim ab extrinseco). If something\nis in something else in virtue of its matter and from inside, then it\nis a quantity; if from outside, it is a where; if partially from\ninside and partially from outside, it is an affection. If something is\nin something else in virtue of its form and from inside, then it is a\nquality; if from outside, it is when (quando vel\nquandalitas); if partially from inside and partially from\noutside, it is an action. If something is in something else in virtue\nof the whole composite and from inside, then it is a relation; if from\noutside, it is a possession (habitus); if partially from\ninside and partially from outside, it is a position (In Cat.,\ncap. de numero et sufficientia praedicamentorum, pp.\n252–53).\n\nAlyngton’s choice implies an anti-reductionist approach to the\nmatter, which is confirmed by the solution of the problem of what\nproperly falls into the categorial fields. According to the standard\nrealist conception, not only the accidental forms, such as whiteness,\nbut also the compounds they cause when inhering in substances, such as\na white-thing (album), fall into the categories. Burley\nthought that whilst the accidental forms properly fall into the\ncategories, the aggregates made up from a substance and an accidental\nform do not, since they are beings per accidens, wanting in\nreal unity. In his opinion, such an aggregate may be said to fall into\na certain category, the category into which its accidental form falls,\nonly by reduction, in virtue of the accidental form itself. On the\ncontrary, Wyclif maintained that the aggregates built up by a\nsubstance and an accidental form fall per accidens into both\nthe category of substance and the category which the accidental form\nat issue belongs to (cf. Wyclif, De ente praedicamentali,\ncap. 1, pp. 3–4). Alyngton combines in an original way the two\nslightly different opinions of Burley and Wyclif. He affirms that a\nthing can be said to belong to a category in a threefold way: by\nitself, by accident (per accidens), and by reduction (per\nreductionem). Something is in a category by itself if and only if\nthe highest genus of that category is predicated by itself and and\ndirectly (in recto) of it (In Cat., cap. de\nnumero et sufficientia praedicamentorum, p. 259). In other words,\nif and only if the highest genus of that category is one of the\nconstitutive elements of the essence of the thing at issue. Accidental\nforms belong per se to the nine categories of accidents\n(In Cat., cap. de relativis, p. 300). Something is\nin a category by accident if and only if it is an aggregate from a\nsubstance and an accidental form. Such aggregates belong per accidens\nboth to the category of substance and to the category in which its\naccidental form is by itself (In Cat., cap. de numero et\nsufficientia praedicamentorum, p. 259; and cap. de\nrelativis, p. 300). Something can be in a category by reduction\nin two different ways: in a broad sense (large) and in a\nstrict sense (stricte). Something is in a category by\nreduction large if and only if it is an aggregate, and the\nhighest genus of a certain category is predicated only indirectly of\nit. Something is in a category by reduction stricte if and\nonly if it is not an aggregate, and, (a) like differences, it is a\ncomponent of the reality of a thing which is in a category by itself,\nbut the highest genus of that category is not predicated of it; or (b)\nit is the privation correlated to a certain property which, in turn,\nis in a category by itself; or (c), like extra-categorial principle\nsuch as God, the unity, and the point, it somehow instantiates the\nmode of being proper to a certain categorial field, but the highest\ngenus of that category is not one of the constitutive elements of the\nessence of that thing (In Cat., cap. de numero et\nsufficientia praedicamentorum, pp. 259–60).\n\nFundamental to Alyngton’s deduction of the categories and\nsolution of the problem of what falls into the categorial fields (and\nhow) is a close isomorphism between language (mental, written, and\nspoken) and the world. Like Burley and Wyclif, he was firmly convinced\nthat our thought is modelled on reality itself, so that it reproduces\nreality in all its elements, levels, and inner relations. Therefore,\none of the best ways of understanding the world lay for him in an\naccurate investigation of our notions and conceptual schemes, as they\nshow the structure of the world. A logical consequence of this\nconviction was his strong propensity towards reification: he\nhypostatises the notion of being and considers equivocity, analogy,\nand univocity not only as semantic relations between terms and things,\nbut also as real relations between extra-mental items (In\nCat., cap. de aequivocis, ms. London, Lambeth Palace\n393, fols. 69v–70r).\n\nAccording to the common interpretation of the opening passage of the\nCategories, equivocal terms are correlated with more than one\nconcept and refer to a multiplicity of things sharing different\nnatures, whereas univocal terms are correlated with only one concept\nand refer to a multiplicity of things sharing one and the same nature.\nIn his last commentary on the Physics (after 1324), Burley\nhad maintained that the term ‘being’ is at the same time\nunivocal and equivocal with respect to the categories, as a single\nconcept corresponds to it (broadly speaking univocity), but the\ncategorial items share it in different ways, according to a hierarchy\nof value (broadly speaking equivocity)—see his Expositio in\nlibros octo Physicorum, lib. I, tr. 2, cap. 1, ed. Venice 1501,\nfols. 12vb-13ra. In turn, Wyclif had admitted three main types of\nequivocity: by chance (a casu), analogical, and generic, the\nsecond of which applies to the relationship between being and\ncategories (De ente praedicamentali, cap. 2). Alyngton\nrecognises four main kinds of equivocity: by chance; deliberate (a\nconsilio); analogical; and generic. Equivocals by chance are\nthose things that just happen to have the same name, but with\ndifferent meanings and/or reasons for imposing the name. Those things\nare deliberate equivocals which have distinct natures but the same\nname, and are subordinated to different but correlated concepts. Those\nthings are analogical which share the nature signified by their common\nname in various degrees and/or ways. Generic equivocals are those\nthings which share the same generic nature in the same way, but have\ndistinct specific natures of different absolute value (In\nCat., cap. de aequivocis, fol. 70r-v). So, within\nAlyngton’s system, what differentiates analogy from univocity is\nthe way in which a certain nature (or property) is shared by a set of\nthings: analogous things share it according to different degrees\n(secundum magis et minus, or secundum prius et\nposterius), univocal things share it all in the same manner and\nto the same degree (In Cat., cap. de univocis, fol.\n71v). Alyngton argues that being is not a sort of genus in relation to\nthe ten categories, since it does not manifest their essence, nor is\nit predicated univocally of them; being is analogous in relation to\nthe ten categories. It is the basic stuff of the metaphysical\nstructure of each reality, which possesses it in accordance with its\nown nature and level in the hierarchy of essences (In Cat.,\ncap. de numero et sufficientia praedicamentorum, pp.\n255–56).\n",
    "section_title": "2. Being and Categories",
    "entry_title": "Robert Alyngton",
    "hierarchy_title": "Robert Alyngton || Being and Categories",
    "tokenized_text": [
        "category",
        "category",
        "point",
        "departure",
        "every",
        "realist",
        "interpretation",
        "category",
        "notion",
        "en",
        "relationship",
        "ten",
        "category",
        "realist",
        "considered",
        "categorial",
        "table",
        "division",
        "being",
        "like",
        "burley",
        "alyngton",
        "affirms",
        "division",
        "category",
        "first",
        "division",
        "thing",
        "existing",
        "outside",
        "mind",
        "secondarily",
        "mental",
        "concept",
        "spoken",
        "written",
        "term",
        "signify",
        "ii",
        "thing",
        "belonging",
        "one",
        "categorial",
        "field",
        "really",
        "distinct",
        "belonging",
        "anotherfor",
        "instance",
        "substance",
        "really",
        "distinct",
        "quantity",
        "quality",
        "relation",
        "quantity",
        "really",
        "distinct",
        "substance",
        "quality",
        "relation",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "conti",
        "pp",
        "unfortunately",
        "alyngton",
        "define",
        "yet",
        "say",
        "subject",
        "category",
        "real",
        "categorial",
        "signified",
        "simple",
        "expression",
        "namely",
        "term",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "p",
        "analogy",
        "cat",
        "cap",
        "de",
        "aequivocis",
        "ms",
        "london",
        "lambeth",
        "palace",
        "fol",
        "rv",
        "seems",
        "entail",
        "like",
        "wyclif",
        "also",
        "think",
        "sort",
        "extramental",
        "reality",
        "proper",
        "everything",
        "god",
        "creature",
        "substance",
        "accident",
        "universal",
        "individual",
        "item",
        "thing",
        "collection",
        "thing",
        "state",
        "affair",
        "according",
        "different",
        "mode",
        "degree",
        "thirteenth",
        "fourteenth",
        "century",
        "realist",
        "author",
        "notable",
        "exception",
        "dun",
        "scotus",
        "regarded",
        "categorial",
        "item",
        "composed",
        "two",
        "main",
        "aspect",
        "inner",
        "nature",
        "essence",
        "peculiar",
        "mode",
        "predicated",
        "modi",
        "essendi",
        "vel",
        "praedicandi",
        "maintained",
        "categorial",
        "table",
        "divide",
        "categorial",
        "item",
        "according",
        "mode",
        "predicated",
        "according",
        "inner",
        "nature",
        "essence",
        "particular",
        "thomas",
        "aquinas",
        "sententia",
        "super",
        "metaphysicam",
        "liber",
        "v",
        "lectio",
        "based",
        "method",
        "finding",
        "ten",
        "aristotelian",
        "category",
        "difference",
        "mode",
        "predicated",
        "recognized",
        "three",
        "fundamental",
        "mode",
        "predicated",
        "essentially",
        "proper",
        "substance",
        "predication",
        "indicates",
        "given",
        "thing",
        "accidentally",
        "proper",
        "quantity",
        "quality",
        "relative",
        "predication",
        "indicates",
        "something",
        "inheres",
        "subject",
        "externally",
        "proper",
        "remaining",
        "six",
        "category",
        "predication",
        "indicates",
        "something",
        "inhere",
        "subject",
        "nevertheless",
        "affect",
        "contrary",
        "albert",
        "great",
        "liber",
        "de",
        "praedicamentis",
        "tr",
        "cap",
        "simon",
        "faversham",
        "quaestiones",
        "super",
        "librum",
        "praedicamentorum",
        "q",
        "based",
        "method",
        "finding",
        "category",
        "difference",
        "mode",
        "admitted",
        "two",
        "fundamental",
        "mode",
        "proper",
        "substance",
        "something",
        "else",
        "proper",
        "nine",
        "genus",
        "accident",
        "latter",
        "subdivided",
        "something",
        "else",
        "absolutely",
        "proper",
        "quantity",
        "quality",
        "something",
        "else",
        "virtue",
        "relation",
        "third",
        "thing",
        "esse",
        "ad",
        "aliud",
        "proper",
        "remaining",
        "seven",
        "category",
        "walter",
        "burley",
        "whose",
        "last",
        "commentary",
        "category",
        "along",
        "wyclif",
        "de",
        "ente",
        "praedicamentali",
        "main",
        "source",
        "alyngton",
        "commentary",
        "category",
        "recalled",
        "two",
        "way",
        "deducing",
        "ten",
        "aristotelian",
        "category",
        "based",
        "various",
        "level",
        "similarity",
        "among",
        "mode",
        "alyngton",
        "follows",
        "closely",
        "burley",
        "first",
        "way",
        "deriving",
        "ten",
        "category",
        "opinion",
        "two",
        "fundamental",
        "mode",
        "proper",
        "thing",
        "characterizes",
        "substance",
        "inhering",
        "something",
        "else",
        "characterizes",
        "accident",
        "latter",
        "subdivided",
        "three",
        "le",
        "general",
        "mode",
        "something",
        "else",
        "virtue",
        "matter",
        "something",
        "else",
        "virtue",
        "form",
        "something",
        "else",
        "virtue",
        "whole",
        "composite",
        "something",
        "inhere",
        "something",
        "else",
        "virtue",
        "matter",
        "form",
        "composite",
        "according",
        "three",
        "different",
        "way",
        "inside",
        "ab",
        "intrinseco",
        "outside",
        "ab",
        "extrinseco",
        "partially",
        "inside",
        "partially",
        "outside",
        "partim",
        "ab",
        "intrinseco",
        "et",
        "partim",
        "ab",
        "extrinseco",
        "something",
        "something",
        "else",
        "virtue",
        "matter",
        "inside",
        "quantity",
        "outside",
        "partially",
        "inside",
        "partially",
        "outside",
        "affection",
        "something",
        "something",
        "else",
        "virtue",
        "form",
        "inside",
        "quality",
        "outside",
        "quando",
        "vel",
        "quandalitas",
        "partially",
        "inside",
        "partially",
        "outside",
        "action",
        "something",
        "something",
        "else",
        "virtue",
        "whole",
        "composite",
        "inside",
        "relation",
        "outside",
        "possession",
        "habitus",
        "partially",
        "inside",
        "partially",
        "outside",
        "position",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "pp",
        "alyngton",
        "choice",
        "implies",
        "antireductionist",
        "approach",
        "matter",
        "confirmed",
        "solution",
        "problem",
        "properly",
        "fall",
        "categorial",
        "field",
        "according",
        "standard",
        "realist",
        "conception",
        "accidental",
        "form",
        "whiteness",
        "also",
        "compound",
        "cause",
        "inhering",
        "substance",
        "whitething",
        "album",
        "fall",
        "category",
        "burley",
        "thought",
        "whilst",
        "accidental",
        "form",
        "properly",
        "fall",
        "category",
        "aggregate",
        "made",
        "substance",
        "accidental",
        "form",
        "since",
        "being",
        "per",
        "accidens",
        "wanting",
        "real",
        "unity",
        "opinion",
        "aggregate",
        "may",
        "said",
        "fall",
        "certain",
        "category",
        "category",
        "accidental",
        "form",
        "fall",
        "reduction",
        "virtue",
        "accidental",
        "form",
        "contrary",
        "wyclif",
        "maintained",
        "aggregate",
        "built",
        "substance",
        "accidental",
        "form",
        "fall",
        "per",
        "accidens",
        "category",
        "substance",
        "category",
        "accidental",
        "form",
        "issue",
        "belongs",
        "cf",
        "wyclif",
        "de",
        "ente",
        "praedicamentali",
        "cap",
        "pp",
        "alyngton",
        "combine",
        "original",
        "way",
        "two",
        "slightly",
        "different",
        "opinion",
        "burley",
        "wyclif",
        "affirms",
        "thing",
        "said",
        "belong",
        "category",
        "threefold",
        "way",
        "accident",
        "per",
        "accidens",
        "reduction",
        "per",
        "reductionem",
        "something",
        "category",
        "highest",
        "genus",
        "category",
        "predicated",
        "directly",
        "recto",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "p",
        "word",
        "highest",
        "genus",
        "category",
        "one",
        "constitutive",
        "element",
        "essence",
        "thing",
        "issue",
        "accidental",
        "form",
        "belong",
        "per",
        "se",
        "nine",
        "category",
        "accident",
        "cat",
        "cap",
        "de",
        "relativis",
        "p",
        "something",
        "category",
        "accident",
        "aggregate",
        "substance",
        "accidental",
        "form",
        "aggregate",
        "belong",
        "per",
        "accidens",
        "category",
        "substance",
        "category",
        "accidental",
        "form",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "p",
        "cap",
        "de",
        "relativis",
        "p",
        "something",
        "category",
        "reduction",
        "two",
        "different",
        "way",
        "broad",
        "sense",
        "large",
        "strict",
        "sense",
        "stricte",
        "something",
        "category",
        "reduction",
        "large",
        "aggregate",
        "highest",
        "genus",
        "certain",
        "category",
        "predicated",
        "indirectly",
        "something",
        "category",
        "reduction",
        "stricte",
        "aggregate",
        "like",
        "difference",
        "component",
        "reality",
        "thing",
        "category",
        "highest",
        "genus",
        "category",
        "predicated",
        "b",
        "privation",
        "correlated",
        "certain",
        "property",
        "turn",
        "category",
        "c",
        "like",
        "extracategorial",
        "principle",
        "god",
        "unity",
        "point",
        "somehow",
        "instantiates",
        "mode",
        "proper",
        "certain",
        "categorial",
        "field",
        "highest",
        "genus",
        "category",
        "one",
        "constitutive",
        "element",
        "essence",
        "thing",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "pp",
        "fundamental",
        "alyngton",
        "deduction",
        "category",
        "solution",
        "problem",
        "fall",
        "categorial",
        "field",
        "close",
        "isomorphism",
        "language",
        "mental",
        "written",
        "spoken",
        "world",
        "like",
        "burley",
        "wyclif",
        "firmly",
        "convinced",
        "thought",
        "modelled",
        "reality",
        "reproduces",
        "reality",
        "element",
        "level",
        "inner",
        "relation",
        "therefore",
        "one",
        "best",
        "way",
        "understanding",
        "world",
        "lay",
        "accurate",
        "investigation",
        "notion",
        "conceptual",
        "scheme",
        "show",
        "structure",
        "world",
        "logical",
        "consequence",
        "conviction",
        "strong",
        "propensity",
        "towards",
        "reification",
        "hypostatises",
        "notion",
        "considers",
        "equivocity",
        "analogy",
        "univocity",
        "semantic",
        "relation",
        "term",
        "thing",
        "also",
        "real",
        "relation",
        "extramental",
        "item",
        "cat",
        "cap",
        "de",
        "aequivocis",
        "ms",
        "london",
        "lambeth",
        "palace",
        "fols",
        "vr",
        "according",
        "common",
        "interpretation",
        "opening",
        "passage",
        "category",
        "equivocal",
        "term",
        "correlated",
        "one",
        "concept",
        "refer",
        "multiplicity",
        "thing",
        "sharing",
        "different",
        "nature",
        "whereas",
        "univocal",
        "term",
        "correlated",
        "one",
        "concept",
        "refer",
        "multiplicity",
        "thing",
        "sharing",
        "one",
        "nature",
        "last",
        "commentary",
        "physic",
        "burley",
        "maintained",
        "term",
        "time",
        "univocal",
        "equivocal",
        "respect",
        "category",
        "single",
        "concept",
        "corresponds",
        "broadly",
        "speaking",
        "univocity",
        "categorial",
        "item",
        "share",
        "different",
        "way",
        "according",
        "hierarchy",
        "value",
        "broadly",
        "speaking",
        "equivocity",
        "see",
        "expositio",
        "libros",
        "octo",
        "physicorum",
        "lib",
        "tr",
        "cap",
        "ed",
        "venice",
        "fols",
        "vbra",
        "turn",
        "wyclif",
        "admitted",
        "three",
        "main",
        "type",
        "equivocity",
        "chance",
        "casu",
        "analogical",
        "generic",
        "second",
        "applies",
        "relationship",
        "category",
        "de",
        "ente",
        "praedicamentali",
        "cap",
        "alyngton",
        "recognises",
        "four",
        "main",
        "kind",
        "equivocity",
        "chance",
        "deliberate",
        "consilio",
        "analogical",
        "generic",
        "equivocals",
        "chance",
        "thing",
        "happen",
        "name",
        "different",
        "meaning",
        "andor",
        "reason",
        "imposing",
        "name",
        "thing",
        "deliberate",
        "equivocals",
        "distinct",
        "nature",
        "name",
        "subordinated",
        "different",
        "correlated",
        "concept",
        "thing",
        "analogical",
        "share",
        "nature",
        "signified",
        "common",
        "name",
        "various",
        "degree",
        "andor",
        "way",
        "generic",
        "equivocals",
        "thing",
        "share",
        "generic",
        "nature",
        "way",
        "distinct",
        "specific",
        "nature",
        "different",
        "absolute",
        "value",
        "cat",
        "cap",
        "de",
        "aequivocis",
        "fol",
        "rv",
        "within",
        "alyngton",
        "system",
        "differentiates",
        "analogy",
        "univocity",
        "way",
        "certain",
        "nature",
        "property",
        "shared",
        "set",
        "thing",
        "analogous",
        "thing",
        "share",
        "according",
        "different",
        "degree",
        "secundum",
        "magi",
        "et",
        "minus",
        "secundum",
        "prius",
        "et",
        "posterius",
        "univocal",
        "thing",
        "share",
        "manner",
        "degree",
        "cat",
        "cap",
        "de",
        "univocis",
        "fol",
        "v",
        "alyngton",
        "argues",
        "sort",
        "genus",
        "relation",
        "ten",
        "category",
        "since",
        "manifest",
        "essence",
        "predicated",
        "univocally",
        "analogous",
        "relation",
        "ten",
        "category",
        "basic",
        "stuff",
        "metaphysical",
        "structure",
        "reality",
        "posse",
        "accordance",
        "nature",
        "level",
        "hierarchy",
        "essence",
        "cat",
        "cap",
        "de",
        "numero",
        "et",
        "sufficientia",
        "praedicamentorum",
        "pp"
    ]
}