{
    "main_text": "Types of Ambiguity || Other Interesting Cases\n3.4 Other Interesting Cases\n3.4.1 Pros Hen Ambiguity\n\nAristotle noticed in Metaphysics Γ2 that some words are related\nin meaning but subtly distinct in what they imply. He thought that\n‘being’ was like this and he illustrates his point with\nexamples such as ‘health’:\n\n\nThere are many senses in which a thing may be said to\n‘be’, but all that ‘is’ is related to one\ncentral point, one definite kind of thing, and is not said to\n‘be’ by a mere ambiguity. Everything which is healthy is\nrelated to health, one thing in the sense that it preserves health,\nanother in the sense that it produces it, another in the sense that it\nis a symptom of health, another because it is capable of it.\n(Metaphysics Γ2)\n\n\nThe idea here is that there are words like ‘health’ (and,\nif Aristotle is right, ‘being’) that are ambiguous between\na ‘primary’ sense of ‘healthy’ is that which\napplies to things that can enjoy health, such as people, dogs, plants,\nand perhaps corporations but also a ‘secondary’ sense that\ninvolves promoting or signaling the presence of health in the primary\nsense.  For example, your diet may be healthy not because it is\nfailing to suffer from a disease but because it promotes your\nhealth. Your doctor may tell you that you have healthy urine on\naccount of it being a positive indication of your health. This\nambiguity is special in that the derivative senses of\n‘health’ are all defined in terms of the more primary\nsense of ‘health’.  The linguistic context doesn’t always\nsettle which sense of is at play: ‘dogs are healthy pets’\ncan both mean that dogs tend to be themselves healthy and that dogs\ntend to promote health in their owners.\n3.4.2 Collective-Distributive Ambiguity\n\nAnother interesting ambiguity is the collective-distributive ambiguity that\noccurs in the case of some predicates with certain quantificational or\nconjunctive antecedents. Consider:\n\nThe politicians lifted the piano.\nSam and Jess brokered deals.\n\n\n(27) enjoys a collective reading on which the piano lifting is true of\nthe politicians collectively but not true of any particular politician\nand a similar ambiguity is present in (28). They also have\ndistributive readings involving as many liftings of the piano as there\nwere politicians and at least two different deal brokerings\nrespectively. See section (4.1) for relevant considerations.\n3.4.3 Ellipsis and Complement Ambiguity\n\nAn interesting case of ambiguity comes from ellipsis. The following is\nclearly ambiguous:\n\nJohn loves his mother and Bill does too.\n\n\nWe’ve already discussed the bound/unbound ambiguity inherent in\n‘John loves his mother’. Consider the bound reading of the\nfirst sentence. Now, on that reading, there are still two\ninterpretations of the second sentence to deal with: one on which Bill\nloves John’s mother and one on which Bill loves his own. This\nambiguity has been given the regrettable name ‘strict-sloppy\nidentity’ and seems to be the result of what ‘does\ntoo’ is short form for. There is a long-standing debate over\nwhether the mechanism is primarily one of copying over at LF (Fiengo\nand May 1994), the result of expressing a lambda-abstracted predicate\n(Sag, 1976; Williams, 1977) or the result of centering on a discourse\nreferent (see Hardt and Stone 1997). Ambiguities can arise from words that\naren’t written or said as well as from ones that are.\n\nSimilar ambiguities come up in cases such as:\n\nSam loves Jess more than Jason.\n\n\n(30) can mean either that Sam loves Jess more than he loves Jason or\nthat Sam loves Jess more than Jason loves Jess. This ambiguity arises\nfrom phrasal and clausal comparatives: the phrasal comparative of\n‘more than’ takes a noun phrase and relates Jess and Jason\n(effectively saying that the degree to which Sam loves Jess exceeds\nthe degree to which he loves Jason). On the other hand, one can read\n(30) as involving ellipsis in which ‘loves Jess’ is\nstripped from the complement of Jason and left sotto\nvoce.\n3.4.4 Flexible Types\n\nMontague (Montague 1973) held to a policy of holding fixed the\nsemantic type of lexical items by their category, so that names,\nfalling in the same category as quantifier phrases, were assigned the\nsame type as quantifier phrases. Otherwise, he reasoned, there would\nbe a type mismatch when we conjoined names and quantifier phrases.\nOthers, however, have been content to posit ambiguities in type for\none and the same expression. Thus, we may posit that\n‘John’, when the word occurs alone, is of type\n⟨e⟩ (entity referring) but when conjoined with\n‘every man’, it is of type\n⟨⟨e,t⟩,t⟩ (a function\nfrom functions to truth values) just like quantifier phrases. The\nsemantics is carefully rigged so as not to make a truth-conditional\ndifference; but there is ambiguity nonetheless in what names literally\nexpress.\n\nThere are alternatives. We could retain the univocality of names and\ntreat ‘and’ as flexible in type depending on its\narguments. We could also treat ‘and’ as a type-shifter.\nSimilar considerations hold for verb phrases. Whether or not there is\nan ambiguity present in such cases is likely to be determined by very\nhigh level considerations, not by competent speakers ability to detect\na difference in intuitive meaning.\n3.4.5 Generic vs. Non-Generic Readings\n\nSome terms are ambiguous between a generic and non-generic reading,\nand the sentences they play into are similarly ambiguous between the\ntwo readings. For example:\n\nDinosaurs ate kelp. (Carlson 1982: p. 163)\n\n\n(31) is clearly ambiguous between a generic reading (equivalent\nroughly to ‘dinosaurs were kelp-eaters’) and a\nnon-generic, episodic reading (equivalent to ‘there were some\ndinosaurs that ate some kelp’). The ambiguity can be located\nwith certain predicates as well:\n\nJohn ate breakfast with a gold fork.\n\n\nThe habitual reading (describing how John favored utensil for eating\nbreakfast) vs. the episodic reading (describing a particular breakfast\nJohn ate) is evident in (32).\n3.4.6 Inchoative Alternations\n\nThe following sentences are obviously related:\n\nI broke the vase.\nThe vase broke.\n\n\n‘Broke’ and other words like it (e.g.,\n‘boiled’) have double lives as transitive and intransitive\nverbs. This could encourage one to posit an ambiguity (or a polysemy)\nsince the putative lexical entries are closely related. However, that\nwould be awfully quick: another approach is to take words like\n‘broke’ as playing two distinct syntactic roles\nunivocally, where the root ‘broke’ is a monadic predicate\nof events. Another is to take ‘broke’ to be univocal and\nallow the object to move into subject position. Whether or not the\nterm is ambiguous lexically depends a great deal on which theory of\nthe inchoative turns out to be right.\n3.4.7 Granularity\n\nYet another systematic (seeming) ambiguity corresponds roughly\nto the type-token distinction that philosophers cherish, though it is\nmore general. Philosophers have noticed that (35) is ambiguous between\na type and a token reading:\n\nI paid for the same car.\n\n\n(35) can express a complaint that a car was paid for twice or the\nclaim that I now own a car that is like yours. How closely they have\nto correspond in similarity is an open question. But interestingly,\nthe two senses cannot always be accessed felicitously:\n\n?I skidded on ice and hit the same car.\n\n\nOne cannot read (36) as saying, say, that my Honda hit another Honda.\nIt’s tempting to think that ‘same’ is the culprit,\nallowing for sameness across different levels of grain from the very\nfine to the very coarse. The phenomenon is quite wide-spread, however\n(See Hobbs 1985).\n3.4.8 Count/Mass Nouns\n\nAnother ambiguity, though perhaps best thought\nof as polysemy due to the similarity of the meanings, concerns count\nnouns like ‘(one) chicken’ and mass nouns like, say, ‘(a lot of)\nchicken’. David Lewis used the idea of a universal grinder (reported\nby Pelletier in his (1975)) to suggest that we can make sense of mass\nuses of substantive count nouns – apply the imaginary grinder to,\nsay, three guitars and you can then make sense of:\n\nThere was guitar all over the floor.\n\n\nThe possibility of grinding out mass nouns with the universal grinder\nis limited to predicates that refer to things we can imagine being\ngrindable in their extensions – it’s hard to see how one\ngets a mass interpretation of ‘melody’ by grinding. The\napplicability of the universal grinder, moreover, is not\nlinguistically universal in its ability to imbue one and the same noun\nwith a mass interpretation.  The count/mass distinction concerns, in\npart, whether nouns supply a criterion for counting (explaining why\ncount nouns play well with numerical determiners). Thus, continuing\nour example of ground guitars, notice that (38) doesn’t entail\nand isn’t entailed by (39):\n\nJohn picked up more guitars than Sarah.\nJohn picked up more guitar than Sarah.\n\n\nThis doesn’t hold for, say ‘footwear’ and\n‘shoes’ where owing more shoes entails owning more\nfootwear and vice versa. See Doetjes (2011) for discussion.\n3.4.9 Discourse Relations\n\nMuch recent work has gone into trying to give informative\nexplanations of the oddity of discourses such as:\n\n?Raskolnikov killed Alyona. The tacos at Lalos are delicious.\n A standard Gricean response to this oddity is that (40) is odd\nbecause the second sentence fails to be relevant to the first, and\nthus uncooperative (unless the speaker wants to signal a hidden\nconnection between the tacos and the murder). This seems like a\npromising start but the injunction to be relevant fails to provide\nenough theoretical options to explain other transitions between\nsentences. For example (due to Hobbs 1979):\n\n\nPeter picked the lock. He learned how from Jason.\nPeter picked the lock and he learned how from Jason.\n An utterance (41) strongly conveys the information that Jason’s\nteaching Peter is what explains the lock picking. No such inference\nseems available in (42), in which the learning to lock pick seems\n(strangely) to temporally follow the lock picking. It’s difficult to\nsee how the period vs. ‘and’ distinction could be responsible for\nthis. Moreover, much empirical work has been done to show that the\nmanner in which we interpret sentences as connected in a discourse\neffects how we resolve the reference of anaphora. For example (Smyth\n(1994)):\n\n\nPhil tickled Stanley, and Liz poked him.\n\n\nClearly, the ‘him’ in (43) can be interpreted as Phil\nor Stanley. But, crucially, how you interpret ‘him’ will\ndepend on how you connect the two sentences. On the one hand, the\ninterpretation of ‘him’ as referring to Phil goes hand in\nhand with a causal relation – its was the tickling that caused\nthe poking (known as a result relation. Interpreting\n‘him’ as referring to Stanley suggests goes hand in hand\nwith a parallel relation. Of course the inference is defeasible\n– one can always break the connection between discourse relation\nand pronoun resolution in a manner that looks much like cancellation\nfor Griceans (‘…Liz poked him, I mean, Phil, for\nunrelated reasons’). But the point is that the search for\ndiscourse relations that help settle pronominal reference is good\nevidence that the discourse relations are part of your linguistic\nknowledge, not just a reflect of cooperative conversation and maxim\nfollowing or flaunting.  The study of discourse relations has\nflourished into a large literature in the last 20 years but the\nrelevant point for us is that it looks like (43) is ambiguous as a\ndiscourse. This type of ambiguity is fairly novel and much work is\nstill needed to get clear on the number and nature of possible\nrelations that provide the possible resolutions of ambiguities like\n(41).\n\n",
    "section_title": "3.4 Other Interesting Cases",
    "entry_title": "Ambiguity",
    "hierarchy_title": "Ambiguity || Types of Ambiguity || Other Interesting Cases",
    "tokenized_text": [
        "type",
        "ambiguity",
        "interesting",
        "case",
        "interesting",
        "case",
        "pro",
        "hen",
        "ambiguity",
        "aristotle",
        "noticed",
        "metaphysics",
        "γ",
        "word",
        "related",
        "meaning",
        "subtly",
        "distinct",
        "imply",
        "thought",
        "like",
        "illustrates",
        "point",
        "example",
        "health",
        "many",
        "sens",
        "thing",
        "may",
        "said",
        "related",
        "one",
        "central",
        "point",
        "one",
        "definite",
        "kind",
        "thing",
        "said",
        "mere",
        "ambiguity",
        "everything",
        "healthy",
        "related",
        "health",
        "one",
        "thing",
        "sense",
        "preserve",
        "health",
        "another",
        "sense",
        "produce",
        "another",
        "sense",
        "symptom",
        "health",
        "another",
        "capable",
        "metaphysics",
        "γ",
        "idea",
        "word",
        "like",
        "health",
        "aristotle",
        "right",
        "ambiguous",
        "primary",
        "sense",
        "healthy",
        "applies",
        "thing",
        "enjoy",
        "health",
        "people",
        "dog",
        "plant",
        "perhaps",
        "corporation",
        "also",
        "secondary",
        "sense",
        "involves",
        "promoting",
        "signaling",
        "presence",
        "health",
        "primary",
        "sense",
        "example",
        "diet",
        "may",
        "healthy",
        "failing",
        "suffer",
        "disease",
        "promotes",
        "health",
        "doctor",
        "may",
        "tell",
        "healthy",
        "urine",
        "account",
        "positive",
        "indication",
        "health",
        "ambiguity",
        "special",
        "derivative",
        "sens",
        "health",
        "defined",
        "term",
        "primary",
        "sense",
        "health",
        "linguistic",
        "context",
        "always",
        "settle",
        "sense",
        "play",
        "dog",
        "healthy",
        "pet",
        "mean",
        "dog",
        "tend",
        "healthy",
        "dog",
        "tend",
        "promote",
        "health",
        "owner",
        "collectivedistributive",
        "ambiguity",
        "another",
        "interesting",
        "ambiguity",
        "collectivedistributive",
        "ambiguity",
        "occurs",
        "case",
        "predicate",
        "certain",
        "quantificational",
        "conjunctive",
        "antecedent",
        "consider",
        "politician",
        "lifted",
        "piano",
        "sam",
        "jess",
        "brokered",
        "deal",
        "enjoys",
        "collective",
        "reading",
        "piano",
        "lifting",
        "true",
        "politician",
        "collectively",
        "true",
        "particular",
        "politician",
        "similar",
        "ambiguity",
        "present",
        "also",
        "distributive",
        "reading",
        "involving",
        "many",
        "liftings",
        "piano",
        "politician",
        "least",
        "two",
        "different",
        "deal",
        "brokerings",
        "respectively",
        "see",
        "section",
        "relevant",
        "consideration",
        "ellipsis",
        "complement",
        "ambiguity",
        "interesting",
        "case",
        "ambiguity",
        "come",
        "ellipsis",
        "following",
        "clearly",
        "ambiguous",
        "john",
        "love",
        "mother",
        "bill",
        "already",
        "discussed",
        "boundunbound",
        "ambiguity",
        "inherent",
        "john",
        "love",
        "mother",
        "consider",
        "bound",
        "reading",
        "first",
        "sentence",
        "reading",
        "still",
        "two",
        "interpretation",
        "second",
        "sentence",
        "deal",
        "one",
        "bill",
        "love",
        "john",
        "mother",
        "one",
        "bill",
        "love",
        "ambiguity",
        "given",
        "regrettable",
        "name",
        "strictsloppy",
        "identity",
        "seems",
        "result",
        "short",
        "form",
        "longstanding",
        "debate",
        "whether",
        "mechanism",
        "primarily",
        "one",
        "copying",
        "lf",
        "fiengo",
        "may",
        "result",
        "expressing",
        "lambdaabstracted",
        "predicate",
        "sag",
        "williams",
        "result",
        "centering",
        "discourse",
        "referent",
        "see",
        "hardt",
        "stone",
        "ambiguity",
        "arise",
        "word",
        "written",
        "said",
        "well",
        "one",
        "similar",
        "ambiguity",
        "come",
        "case",
        "sam",
        "love",
        "jess",
        "jason",
        "mean",
        "either",
        "sam",
        "love",
        "jess",
        "love",
        "jason",
        "sam",
        "love",
        "jess",
        "jason",
        "love",
        "jess",
        "ambiguity",
        "arises",
        "phrasal",
        "clausal",
        "comparative",
        "phrasal",
        "comparative",
        "take",
        "noun",
        "phrase",
        "relates",
        "jess",
        "jason",
        "effectively",
        "saying",
        "degree",
        "sam",
        "love",
        "jess",
        "exceeds",
        "degree",
        "love",
        "jason",
        "hand",
        "one",
        "read",
        "involving",
        "ellipsis",
        "love",
        "jess",
        "stripped",
        "complement",
        "jason",
        "left",
        "sotto",
        "voce",
        "flexible",
        "type",
        "montague",
        "montague",
        "held",
        "policy",
        "holding",
        "fixed",
        "semantic",
        "type",
        "lexical",
        "item",
        "category",
        "name",
        "falling",
        "category",
        "quantifier",
        "phrase",
        "assigned",
        "type",
        "quantifier",
        "phrase",
        "otherwise",
        "reasoned",
        "would",
        "type",
        "mismatch",
        "conjoined",
        "name",
        "quantifier",
        "phrase",
        "others",
        "however",
        "content",
        "posit",
        "ambiguity",
        "type",
        "one",
        "expression",
        "thus",
        "may",
        "posit",
        "john",
        "word",
        "occurs",
        "alone",
        "type",
        "e",
        "entity",
        "referring",
        "conjoined",
        "every",
        "man",
        "type",
        "e",
        "t",
        "t",
        "function",
        "function",
        "truth",
        "value",
        "like",
        "quantifier",
        "phrase",
        "semantics",
        "carefully",
        "rigged",
        "make",
        "truthconditional",
        "difference",
        "ambiguity",
        "nonetheless",
        "name",
        "literally",
        "express",
        "alternative",
        "could",
        "retain",
        "univocality",
        "name",
        "treat",
        "flexible",
        "type",
        "depending",
        "argument",
        "could",
        "also",
        "treat",
        "typeshifter",
        "similar",
        "consideration",
        "hold",
        "verb",
        "phrase",
        "whether",
        "ambiguity",
        "present",
        "case",
        "likely",
        "determined",
        "high",
        "level",
        "consideration",
        "competent",
        "speaker",
        "ability",
        "detect",
        "difference",
        "intuitive",
        "meaning",
        "generic",
        "vs",
        "nongeneric",
        "reading",
        "term",
        "ambiguous",
        "generic",
        "nongeneric",
        "reading",
        "sentence",
        "play",
        "similarly",
        "ambiguous",
        "two",
        "reading",
        "example",
        "dinosaur",
        "ate",
        "kelp",
        "carlson",
        "p",
        "clearly",
        "ambiguous",
        "generic",
        "reading",
        "equivalent",
        "roughly",
        "dinosaur",
        "kelpeaters",
        "nongeneric",
        "episodic",
        "reading",
        "equivalent",
        "dinosaur",
        "ate",
        "kelp",
        "ambiguity",
        "located",
        "certain",
        "predicate",
        "well",
        "john",
        "ate",
        "breakfast",
        "gold",
        "fork",
        "habitual",
        "reading",
        "describing",
        "john",
        "favored",
        "utensil",
        "eating",
        "breakfast",
        "vs",
        "episodic",
        "reading",
        "describing",
        "particular",
        "breakfast",
        "john",
        "ate",
        "evident",
        "inchoative",
        "alternation",
        "following",
        "sentence",
        "obviously",
        "related",
        "broke",
        "vase",
        "vase",
        "broke",
        "broke",
        "word",
        "like",
        "eg",
        "boiled",
        "double",
        "life",
        "transitive",
        "intransitive",
        "verb",
        "could",
        "encourage",
        "one",
        "posit",
        "ambiguity",
        "polysemy",
        "since",
        "putative",
        "lexical",
        "entry",
        "closely",
        "related",
        "however",
        "would",
        "awfully",
        "quick",
        "another",
        "approach",
        "take",
        "word",
        "like",
        "broke",
        "playing",
        "two",
        "distinct",
        "syntactic",
        "role",
        "univocally",
        "root",
        "broke",
        "monadic",
        "predicate",
        "event",
        "another",
        "take",
        "broke",
        "univocal",
        "allow",
        "object",
        "move",
        "subject",
        "position",
        "whether",
        "term",
        "ambiguous",
        "lexically",
        "depends",
        "great",
        "deal",
        "theory",
        "inchoative",
        "turn",
        "right",
        "granularity",
        "yet",
        "another",
        "systematic",
        "seeming",
        "ambiguity",
        "corresponds",
        "roughly",
        "typetoken",
        "distinction",
        "philosopher",
        "cherish",
        "though",
        "general",
        "philosopher",
        "noticed",
        "ambiguous",
        "type",
        "token",
        "reading",
        "paid",
        "car",
        "express",
        "complaint",
        "car",
        "paid",
        "twice",
        "claim",
        "car",
        "like",
        "closely",
        "correspond",
        "similarity",
        "open",
        "question",
        "interestingly",
        "two",
        "sens",
        "always",
        "accessed",
        "felicitously",
        "skidded",
        "ice",
        "hit",
        "car",
        "one",
        "read",
        "saying",
        "say",
        "honda",
        "hit",
        "another",
        "honda",
        "tempting",
        "think",
        "culprit",
        "allowing",
        "sameness",
        "across",
        "different",
        "level",
        "grain",
        "fine",
        "coarse",
        "phenomenon",
        "quite",
        "widespread",
        "however",
        "see",
        "hobbs",
        "countmass",
        "noun",
        "another",
        "ambiguity",
        "though",
        "perhaps",
        "best",
        "thought",
        "polysemy",
        "due",
        "similarity",
        "meaning",
        "concern",
        "count",
        "noun",
        "like",
        "one",
        "chicken",
        "mass",
        "noun",
        "like",
        "say",
        "lot",
        "chicken",
        "david",
        "lewis",
        "used",
        "idea",
        "universal",
        "grinder",
        "reported",
        "pelletier",
        "suggest",
        "make",
        "sense",
        "mass",
        "us",
        "substantive",
        "count",
        "noun",
        "apply",
        "imaginary",
        "grinder",
        "say",
        "three",
        "guitar",
        "make",
        "sense",
        "guitar",
        "floor",
        "possibility",
        "grinding",
        "mass",
        "noun",
        "universal",
        "grinder",
        "limited",
        "predicate",
        "refer",
        "thing",
        "imagine",
        "grindable",
        "extension",
        "hard",
        "see",
        "one",
        "get",
        "mass",
        "interpretation",
        "melody",
        "grinding",
        "applicability",
        "universal",
        "grinder",
        "moreover",
        "linguistically",
        "universal",
        "ability",
        "imbue",
        "one",
        "noun",
        "mass",
        "interpretation",
        "countmass",
        "distinction",
        "concern",
        "part",
        "whether",
        "noun",
        "supply",
        "criterion",
        "counting",
        "explaining",
        "count",
        "noun",
        "play",
        "well",
        "numerical",
        "determiner",
        "thus",
        "continuing",
        "example",
        "ground",
        "guitar",
        "notice",
        "entail",
        "entailed",
        "john",
        "picked",
        "guitar",
        "sarah",
        "john",
        "picked",
        "guitar",
        "sarah",
        "hold",
        "say",
        "footwear",
        "shoe",
        "owing",
        "shoe",
        "entail",
        "owning",
        "footwear",
        "vice",
        "versa",
        "see",
        "doetjes",
        "discussion",
        "discourse",
        "relation",
        "much",
        "recent",
        "work",
        "gone",
        "trying",
        "give",
        "informative",
        "explanation",
        "oddity",
        "discourse",
        "raskolnikov",
        "killed",
        "alyona",
        "taco",
        "lalos",
        "delicious",
        "standard",
        "gricean",
        "response",
        "oddity",
        "odd",
        "second",
        "sentence",
        "fails",
        "relevant",
        "first",
        "thus",
        "uncooperative",
        "unless",
        "speaker",
        "want",
        "signal",
        "hidden",
        "connection",
        "taco",
        "murder",
        "seems",
        "like",
        "promising",
        "start",
        "injunction",
        "relevant",
        "fails",
        "provide",
        "enough",
        "theoretical",
        "option",
        "explain",
        "transition",
        "sentence",
        "example",
        "due",
        "hobbs",
        "peter",
        "picked",
        "lock",
        "learned",
        "jason",
        "peter",
        "picked",
        "lock",
        "learned",
        "jason",
        "utterance",
        "strongly",
        "conveys",
        "information",
        "jason",
        "teaching",
        "peter",
        "explains",
        "lock",
        "picking",
        "inference",
        "seems",
        "available",
        "learning",
        "lock",
        "pick",
        "seems",
        "strangely",
        "temporally",
        "follow",
        "lock",
        "picking",
        "difficult",
        "see",
        "period",
        "vs",
        "distinction",
        "could",
        "responsible",
        "moreover",
        "much",
        "empirical",
        "work",
        "done",
        "show",
        "manner",
        "interpret",
        "sentence",
        "connected",
        "discourse",
        "effect",
        "resolve",
        "reference",
        "anaphora",
        "example",
        "smyth",
        "phil",
        "tickled",
        "stanley",
        "liz",
        "poked",
        "clearly",
        "interpreted",
        "phil",
        "stanley",
        "crucially",
        "interpret",
        "depend",
        "connect",
        "two",
        "sentence",
        "one",
        "hand",
        "interpretation",
        "referring",
        "phil",
        "go",
        "hand",
        "hand",
        "causal",
        "relation",
        "tickling",
        "caused",
        "poking",
        "known",
        "result",
        "relation",
        "interpreting",
        "referring",
        "stanley",
        "suggests",
        "go",
        "hand",
        "hand",
        "parallel",
        "relation",
        "course",
        "inference",
        "defeasible",
        "one",
        "always",
        "break",
        "connection",
        "discourse",
        "relation",
        "pronoun",
        "resolution",
        "manner",
        "look",
        "much",
        "like",
        "cancellation",
        "griceans",
        "liz",
        "poked",
        "mean",
        "phil",
        "unrelated",
        "reason",
        "point",
        "search",
        "discourse",
        "relation",
        "help",
        "settle",
        "pronominal",
        "reference",
        "good",
        "evidence",
        "discourse",
        "relation",
        "part",
        "linguistic",
        "knowledge",
        "reflect",
        "cooperative",
        "conversation",
        "maxim",
        "following",
        "flaunting",
        "study",
        "discourse",
        "relation",
        "flourished",
        "large",
        "literature",
        "last",
        "year",
        "relevant",
        "point",
        "u",
        "look",
        "like",
        "ambiguous",
        "discourse",
        "type",
        "ambiguity",
        "fairly",
        "novel",
        "much",
        "work",
        "still",
        "needed",
        "get",
        "clear",
        "number",
        "nature",
        "possible",
        "relation",
        "provide",
        "possible",
        "resolution",
        "ambiguity",
        "like"
    ]
}