{
    "main_text": "Thomas Aquinas\n6. Thomas Aquinas\n\nDespite the vast modern literature devoted to Aquinas’s theory\nof analogy, he has very little to say about analogy as such. He uses a\ngeneral division into equivocal, univocal, and analogical uses of\nterms, and he presents both of the threefold divisions of analogy\nmentioned in the previous section, but he offers no prolonged\ndiscussion, and he writes as if he is simply using the divisions,\ndefinitions, and examples with which everyone is familiar. His\nimportance lies in the way he used this standard material to present\nan account of the divine names, or how it is we can meaningfully use\nsuch words as ‘good’ and ‘wise’ of God.\n\nThe background to this account has to be understood in terms of\nAquinas’s theology and metaphysics. Three doctrines are\nparticularly important. First, there is the distinction between being\nexistent, good, wise, and so on, essentially, and being existent,\ngood, wise, and so on, by participation. God is whatever he is\nessentially, and as a result he is existence itself, goodness itself,\nwisdom itself. Creatures are existent, good, wise, only by sharing in\nGod’s existence, goodness, and wisdom, and this sharing has\nthree features. It involves a separation between the creature and what\nthe creature has; it involves a deficient similarity to God; and it is\nbased on a causal relation. What is essentially existent or good is\nthe cause of what has existence or goodness by participation. Second,\nthere is the general doctrine of causality according to which every\nagent produces something like itself. Agent causality and similarity\ncannot be separated. Third, there is Aquinas’s belief that we\nare indeed entitled to claim that God is existent, good, wise, and so\non, even though we cannot know his essence.\n\nAgainst this background, Aquinas asks how we are to interpret the\ndivine names. He argues that they cannot be purely equivocal, for we\ncould not then make intelligible claims about God. Nor can they be\npurely univocal, for God’s manner of existence and his\nrelationship to his properties are sufficiently different from ours\nthat the words must be used in somewhat different senses. Hence, the\nwords we use of God must be analogical, used in different but related\nsenses. To be more precise, it seems that such words as\n‘good’ and ‘wise’ must involve a relationship\nto one prior reality, and they must be predicated in a prior and a\nposterior sense, for these are the marks of analogical terms.\n\nNonetheless, the divine names do not function exactly like ordinary\nanalogical terms such as ‘healthy’. We need to begin by\nmaking use of the distinction between the thing signified (a nature or\nproperty) and the mode of signifying. All the words we use have a\ncreaturely mode of signifying in that they imply time and composition,\nneither of which can pertain to God. When speaking of God, we must\nrecognize this fact, and attempt to discount it. To say “God is\ngood” is not to imply that God has a separable property,\ngoodness, and that he has it in a temporally limited way. God is\neternally identical to goodness itself. But even when we have\ndiscounted the creaturely mode of signifying, we are left with the\nfact that God’s goodness is not like our goodness. \n\nOne major controversy over Aquinas’s writings concerns the variation\nin his writings over the roles analogy of attribution and analogy of\nproportionality (or analogy in the Greek sense). In his early\nwritings, Aquinas questioned whether the standard account of the\nanalogy of attribution was sufficient for his purposes. In his\ncommentary on the Sentences, he suggests that there is one\nkind of analogy in which the analogical term is used in a prior and a\nposterior sense, and another kind of analogy, the analogy of\nimitation, which applies to God and creatures. In his De\nveritate, he argues that the analogy of attribution involves a\ndeterminate relation, which cannot hold between God and creatures, and\nthat the analogy of proportionality must be used for the divine names.\nWe must compare the relation between God and his properties to the\nrelation between creatures and their properties. It has been argued\nthat Aquinas discovered that this solution was deeply flawed, given\nthat the problem of divine names arises precisely because the\nrelationship of God to his properties is so radically different from\nour relation to our properties. Accordingly, in his later discussions\nof the divine names, notably in the Summa contra gentiles and\nthe Summa theologiae, Aquinas returns to the analogy of\nattribution, but links it much more closely with his doctrines of\ncausal similitude. Montagnes has pointed\nout that Aquinas came to place much greater\nemphasis on agent causation, the active transmission of properties\nfrom God to creatures, than on exemplar causality, the\ncreature’s passive reflection or imitation of God’s\nproperties. In this context, Aquinas makes considerable use of his\nontological distinction between univocal causes, whose effects are\nfully like them, and non-univocal causes, whose effects are not fully\nlike them. God is an analogical cause, and this is the reality that\nunderlies our use of analogical language. Other scholars, notably\nHochschild, have argued that Aquinas never abandons the doctrine of\nthe De Veritate. Citing passages in the Summa\nTheologiae that explicitly employ analogy of proportionality,\nHochschild argues that Aquinas appeals to one or another\nclassification of analogy based on the dialectical context of his\nremarks. Where the context calls for addressing the causal\nrelationship between God and creatures, Aquinas appeals to\nclassifications of analogy of attribution. Where the context calls for\naddressing the formal structure of the similarity between God and\ncreatures, Aquinas appeals to analogy of proportionality. Hochschild\nargues furthermore that there is an asymmetrical relationship between\nanalogy of proportionality and the forms of analogy of attribution\nthat involve cause and effect relationships between analogates.\nAnalogy of proportionality can occur with or without causal\nrelationships between the analogates. (E.g. There is an analogy of\nproportionality between the intellect’s act of seeing and the eye’s\nact of seeing, but no causal relationship between them.) However,\ncause and effect relationships between analogates in an analogy of\nattribution always presuppose an analogy of proportionality as the\nformal structure of the similarity between the analogate that is the\ncause and the analogate that is the effect. \n\nAnother controversy over Aquinas’s writings on analogy concerns\nhis explicit statements in some passages (notably in\nthe Summa Theologiae) that one analogate is included in\nthe definition of the other analogate or analogates. Specifically, the\nanalogate of which the term is said in a prior way must be\nincluded in the definition of the posterior analogate or analogates,\njust as the definition of healthy food includes a reference to the\nhealthiness of an animal. There are two grounds for the\ncontroversy. One is that Aquinas also explicitly denies (notably\nin the De Veritate) that the rule that one analogate\nappears in the definition of the others applies to cases of names said\nof God and creatures. Another ground is that it is simply difficult to\nsee how the rule could apply to names said of God and creatures given\nAquinas’s insistence (including in the Summa Theologiae) that\nthese names are not said of God only by relation to creatures nor are\nthey said of creatures only by relation to God. One proposed solution\nto the difficulty of fitting the definition of a name as said of God\ninto the definition of a name as said of a creature draws on Aquinas’s\ndoctrine of participation through agent causality.\nAlthough the reference to God in the definition\nof the creature is not direct or explicit, it\noccurs through our recognition that when\nhumans are said to be good, this means that they have a participated\ngoodness which must be caused by that which is goodness itself. The\nnature of this causal relation between God and creature\nexplains the sense in which terms are said in a prior way of God.\nSo as far as imposition is concerned, terms are\ngiven their signification on the basis of creaturely effects, and,\nbefore we learn about God, we may think that their prior use is to\nrefer to creaturely perfections. However, when we come to know God as\nthe first cause and fully perfect being, we recognize that their prior\napplication is to God. The sixteenth-century Thomist Francis Sylvester of\nFerrara proposes that the naming of the creature by reference to God\ninvolves a distinct act of imposition of signification upon a name\nfrom the original act of imposition. A merit of this approach is\nthat it helps us to explain Aquinas’s insistence on\nthe distinction between the analogy of many-to-one and the analogy of\none-to-another. In the first case, both food and medicine are said to\nbe healthy because each is related to something else, the health of an\nanimal. In the second case, food is said to be healthy because of its\nrelation to the health of an animal. Only the second kind of analogy\napplies to the divine names, for no non-metaphorical name that we\napply to God can ever be explained in terms of something other than\nGod. Our use of divine names has to reflect God’s absolute\npriority.\n",
    "section_title": "6. Thomas Aquinas",
    "entry_title": "Medieval Theories of Analogy",
    "hierarchy_title": "Medieval Theories of Analogy || Thomas Aquinas",
    "tokenized_text": [
        "thomas",
        "aquinas",
        "thomas",
        "aquinas",
        "despite",
        "vast",
        "modern",
        "literature",
        "devoted",
        "aquinas",
        "theory",
        "analogy",
        "little",
        "say",
        "analogy",
        "us",
        "general",
        "division",
        "equivocal",
        "univocal",
        "analogical",
        "us",
        "term",
        "present",
        "threefold",
        "division",
        "analogy",
        "mentioned",
        "previous",
        "section",
        "offer",
        "prolonged",
        "discussion",
        "writes",
        "simply",
        "using",
        "division",
        "definition",
        "example",
        "everyone",
        "familiar",
        "importance",
        "lie",
        "way",
        "used",
        "standard",
        "material",
        "present",
        "account",
        "divine",
        "name",
        "meaningfully",
        "use",
        "word",
        "good",
        "wise",
        "god",
        "background",
        "account",
        "understood",
        "term",
        "aquinas",
        "theology",
        "metaphysics",
        "three",
        "doctrine",
        "particularly",
        "important",
        "first",
        "distinction",
        "existent",
        "good",
        "wise",
        "essentially",
        "existent",
        "good",
        "wise",
        "participation",
        "god",
        "whatever",
        "essentially",
        "result",
        "existence",
        "goodness",
        "wisdom",
        "creature",
        "existent",
        "good",
        "wise",
        "sharing",
        "god",
        "existence",
        "goodness",
        "wisdom",
        "sharing",
        "three",
        "feature",
        "involves",
        "separation",
        "creature",
        "creature",
        "involves",
        "deficient",
        "similarity",
        "god",
        "based",
        "causal",
        "relation",
        "essentially",
        "existent",
        "good",
        "cause",
        "existence",
        "goodness",
        "participation",
        "second",
        "general",
        "doctrine",
        "causality",
        "according",
        "every",
        "agent",
        "produce",
        "something",
        "like",
        "agent",
        "causality",
        "similarity",
        "separated",
        "third",
        "aquinas",
        "belief",
        "indeed",
        "entitled",
        "claim",
        "god",
        "existent",
        "good",
        "wise",
        "even",
        "though",
        "know",
        "essence",
        "background",
        "aquinas",
        "asks",
        "interpret",
        "divine",
        "name",
        "argues",
        "purely",
        "equivocal",
        "could",
        "make",
        "intelligible",
        "claim",
        "god",
        "purely",
        "univocal",
        "god",
        "manner",
        "existence",
        "relationship",
        "property",
        "sufficiently",
        "different",
        "word",
        "must",
        "used",
        "somewhat",
        "different",
        "sens",
        "hence",
        "word",
        "use",
        "god",
        "must",
        "analogical",
        "used",
        "different",
        "related",
        "sens",
        "precise",
        "seems",
        "word",
        "good",
        "wise",
        "must",
        "involve",
        "relationship",
        "one",
        "prior",
        "reality",
        "must",
        "predicated",
        "prior",
        "posterior",
        "sense",
        "mark",
        "analogical",
        "term",
        "nonetheless",
        "divine",
        "name",
        "function",
        "exactly",
        "like",
        "ordinary",
        "analogical",
        "term",
        "healthy",
        "need",
        "begin",
        "making",
        "use",
        "distinction",
        "thing",
        "signified",
        "nature",
        "property",
        "mode",
        "signifying",
        "word",
        "use",
        "creaturely",
        "mode",
        "signifying",
        "imply",
        "time",
        "composition",
        "neither",
        "pertain",
        "god",
        "speaking",
        "god",
        "must",
        "recognize",
        "fact",
        "attempt",
        "discount",
        "say",
        "god",
        "good",
        "imply",
        "god",
        "separable",
        "property",
        "goodness",
        "temporally",
        "limited",
        "way",
        "god",
        "eternally",
        "identical",
        "goodness",
        "even",
        "discounted",
        "creaturely",
        "mode",
        "signifying",
        "left",
        "fact",
        "god",
        "goodness",
        "like",
        "goodness",
        "one",
        "major",
        "controversy",
        "aquinas",
        "writing",
        "concern",
        "variation",
        "writing",
        "role",
        "analogy",
        "attribution",
        "analogy",
        "proportionality",
        "analogy",
        "greek",
        "sense",
        "early",
        "writing",
        "aquinas",
        "questioned",
        "whether",
        "standard",
        "account",
        "analogy",
        "attribution",
        "sufficient",
        "purpose",
        "commentary",
        "sentence",
        "suggests",
        "one",
        "kind",
        "analogy",
        "analogical",
        "term",
        "used",
        "prior",
        "posterior",
        "sense",
        "another",
        "kind",
        "analogy",
        "analogy",
        "imitation",
        "applies",
        "god",
        "creature",
        "de",
        "veritate",
        "argues",
        "analogy",
        "attribution",
        "involves",
        "determinate",
        "relation",
        "hold",
        "god",
        "creature",
        "analogy",
        "proportionality",
        "must",
        "used",
        "divine",
        "name",
        "must",
        "compare",
        "relation",
        "god",
        "property",
        "relation",
        "creature",
        "property",
        "argued",
        "aquinas",
        "discovered",
        "solution",
        "deeply",
        "flawed",
        "given",
        "problem",
        "divine",
        "name",
        "arises",
        "precisely",
        "relationship",
        "god",
        "property",
        "radically",
        "different",
        "relation",
        "property",
        "accordingly",
        "later",
        "discussion",
        "divine",
        "name",
        "notably",
        "summa",
        "contra",
        "gentile",
        "summa",
        "theologiae",
        "aquinas",
        "return",
        "analogy",
        "attribution",
        "link",
        "much",
        "closely",
        "doctrine",
        "causal",
        "similitude",
        "montagnes",
        "pointed",
        "aquinas",
        "came",
        "place",
        "much",
        "greater",
        "emphasis",
        "agent",
        "causation",
        "active",
        "transmission",
        "property",
        "god",
        "creature",
        "exemplar",
        "causality",
        "creature",
        "passive",
        "reflection",
        "imitation",
        "god",
        "property",
        "context",
        "aquinas",
        "make",
        "considerable",
        "use",
        "ontological",
        "distinction",
        "univocal",
        "cause",
        "whose",
        "effect",
        "fully",
        "like",
        "nonunivocal",
        "cause",
        "whose",
        "effect",
        "fully",
        "like",
        "god",
        "analogical",
        "cause",
        "reality",
        "underlies",
        "use",
        "analogical",
        "language",
        "scholar",
        "notably",
        "hochschild",
        "argued",
        "aquinas",
        "never",
        "abandon",
        "doctrine",
        "de",
        "veritate",
        "citing",
        "passage",
        "summa",
        "theologiae",
        "explicitly",
        "employ",
        "analogy",
        "proportionality",
        "hochschild",
        "argues",
        "aquinas",
        "appeal",
        "one",
        "another",
        "classification",
        "analogy",
        "based",
        "dialectical",
        "context",
        "remark",
        "context",
        "call",
        "addressing",
        "causal",
        "relationship",
        "god",
        "creature",
        "aquinas",
        "appeal",
        "classification",
        "analogy",
        "attribution",
        "context",
        "call",
        "addressing",
        "formal",
        "structure",
        "similarity",
        "god",
        "creature",
        "aquinas",
        "appeal",
        "analogy",
        "proportionality",
        "hochschild",
        "argues",
        "furthermore",
        "asymmetrical",
        "relationship",
        "analogy",
        "proportionality",
        "form",
        "analogy",
        "attribution",
        "involve",
        "cause",
        "effect",
        "relationship",
        "analogates",
        "analogy",
        "proportionality",
        "occur",
        "without",
        "causal",
        "relationship",
        "analogates",
        "eg",
        "analogy",
        "proportionality",
        "intellect",
        "act",
        "seeing",
        "eye",
        "act",
        "seeing",
        "causal",
        "relationship",
        "however",
        "cause",
        "effect",
        "relationship",
        "analogates",
        "analogy",
        "attribution",
        "always",
        "presuppose",
        "analogy",
        "proportionality",
        "formal",
        "structure",
        "similarity",
        "analogate",
        "cause",
        "analogate",
        "effect",
        "another",
        "controversy",
        "aquinas",
        "writing",
        "analogy",
        "concern",
        "explicit",
        "statement",
        "passage",
        "notably",
        "summa",
        "theologiae",
        "one",
        "analogate",
        "included",
        "definition",
        "analogate",
        "analogates",
        "specifically",
        "analogate",
        "term",
        "said",
        "prior",
        "way",
        "must",
        "included",
        "definition",
        "posterior",
        "analogate",
        "analogates",
        "definition",
        "healthy",
        "food",
        "includes",
        "reference",
        "healthiness",
        "animal",
        "two",
        "ground",
        "controversy",
        "one",
        "aquinas",
        "also",
        "explicitly",
        "denies",
        "notably",
        "de",
        "veritate",
        "rule",
        "one",
        "analogate",
        "appears",
        "definition",
        "others",
        "applies",
        "case",
        "name",
        "said",
        "god",
        "creature",
        "another",
        "ground",
        "simply",
        "difficult",
        "see",
        "rule",
        "could",
        "apply",
        "name",
        "said",
        "god",
        "creature",
        "given",
        "aquinas",
        "insistence",
        "including",
        "summa",
        "theologiae",
        "name",
        "said",
        "god",
        "relation",
        "creature",
        "said",
        "creature",
        "relation",
        "god",
        "one",
        "proposed",
        "solution",
        "difficulty",
        "fitting",
        "definition",
        "name",
        "said",
        "god",
        "definition",
        "name",
        "said",
        "creature",
        "draw",
        "aquinas",
        "doctrine",
        "participation",
        "agent",
        "causality",
        "although",
        "reference",
        "god",
        "definition",
        "creature",
        "direct",
        "explicit",
        "occurs",
        "recognition",
        "human",
        "said",
        "good",
        "mean",
        "participated",
        "goodness",
        "must",
        "caused",
        "goodness",
        "nature",
        "causal",
        "relation",
        "god",
        "creature",
        "explains",
        "sense",
        "term",
        "said",
        "prior",
        "way",
        "god",
        "far",
        "imposition",
        "concerned",
        "term",
        "given",
        "signification",
        "basis",
        "creaturely",
        "effect",
        "learn",
        "god",
        "may",
        "think",
        "prior",
        "use",
        "refer",
        "creaturely",
        "perfection",
        "however",
        "come",
        "know",
        "god",
        "first",
        "cause",
        "fully",
        "perfect",
        "recognize",
        "prior",
        "application",
        "god",
        "sixteenthcentury",
        "thomist",
        "francis",
        "sylvester",
        "ferrara",
        "proposes",
        "naming",
        "creature",
        "reference",
        "god",
        "involves",
        "distinct",
        "act",
        "imposition",
        "signification",
        "upon",
        "name",
        "original",
        "act",
        "imposition",
        "merit",
        "approach",
        "help",
        "u",
        "explain",
        "aquinas",
        "insistence",
        "distinction",
        "analogy",
        "manytoone",
        "analogy",
        "onetoanother",
        "first",
        "case",
        "food",
        "medicine",
        "said",
        "healthy",
        "related",
        "something",
        "else",
        "health",
        "animal",
        "second",
        "case",
        "food",
        "said",
        "healthy",
        "relation",
        "health",
        "animal",
        "second",
        "kind",
        "analogy",
        "applies",
        "divine",
        "name",
        "nonmetaphorical",
        "name",
        "apply",
        "god",
        "ever",
        "explained",
        "term",
        "something",
        "god",
        "use",
        "divine",
        "name",
        "reflect",
        "god",
        "absolute",
        "priority"
    ]
}