{
    "main_text": "Anarchism in Political Philosophy || Individualism, Libertarianism, and Socialist Anarchism\n2.4 Individualism, Libertarianism, and Socialist Anarchism\n\nForms of anarchism also differ in terms of the content of the theory,\nthe focal point of the anarchist critique, and the imagined practical\nimpact of anarchism. Socialist forms of anarchism include communist\nanarchism associated with Kropotkin and communitarian anarchism (see\nClark 2013). The socialist approach focuses on the development of\nsocial and communal groups, which are supposed to thrive outside of\nhierarchical and centralized political structures. Individualist forms\nof anarchism include some forms of libertarianism or\nanarcho-capitalism as well as egoistically oriented antinomianism and\nnon-conformism. The individualistic focus rejects group identity and\nideas about social/communal good, while remaining firmly rooted in\nmoral claims about the autonomy of the individual (see Casey\n2012).\n\nIndividualistic anarchism is historically associated with ideas found\nin Stirner who said, “every state is a despotism” (Stirner\n1844 [1995: 175]). He argued that there was no duty to obey the state\nand the law because the law and the state impair self-development and\nself-will. The state seeks to tame our desires and along with the\nchurch it undermines self-enjoyment and the development of unique\nindividuality. Stirner is even critical of social organizations and\npolitical parties. While not denying that an individual could\naffiliate with such organizations, he maintains that the individual\nretains rights and identity against the party or social organization:\nhe embraces the party; but he ought not allow himself to be\n“embraced and taken up by the party” (Stirner 1844 [1995:\n211]). Individualist anarchism has often been attributed to a variety\nof thinkers including Josiah Warren, Benjamin Tucker, and Thoreau.\n\nIndividualist anarchism also seems to have something in common with\negoism of the sort associated with Ayn Rand. But Rand dismissed\nanarchism as “a naïve floating abstraction” that\ncould not exist in reality; and she argued that governments properly\nexisted to defend people’s rights (Rand 1964). A more robust\nsort of pro-capitalist anarchism has been defended by Murray Rothbard,\nwho rejects “left-wing anarchism” of the sort he\nassociates with communism, while applauding the individualist\nanarchism of Tucker (Rothbard 2008). Rothbard continues to explain\nthat since anarchism has usually been considered as being primarily a\nleft-wing communist phenomenon, libertarianism should be distinguished\nfrom anarchism by calling it “non-archism” (Rothbard\n2008). A related term has been employed in the literature,\n“min-archism”, which has been used to describe the minimal\nstate that libertarians allow (see Machan 2002). Libertarians are\nstill individualists, who emphasize the importance of individual\nliberty, even though they disagree with full-blown anarchists about\nthe degree to which state power can be justified.\n\nIt is worth considering here, the complexity of the notion of liberty\nunder consideration by appealing to Isaiah Berlin’s well-known\ndistinction between negative and positive liberty (Berlin 1969). Some\nindividualist anarchists appear to focus on negative liberty, i.e.,\nfreedom from constraint, authority, and domination. But anarchism has\nalso been concerned with community and the social good. In this sense,\nanarchists are focused on something like positive liberty and concerned\nwith creating and sustaining the social conditions necessary for\nactualizing human flourishing. In this regard, anarchists have also\noffered theories of institutional rules and social structures that are\nnon-authoritarian. This may sound paradoxical (i.e., that anarchists\nespouse rules and structures at all). But Prichard has argued that\nanarchists are also interested in “freedom within” institutions and\nsocial structures. According to Prichard rather than focusing on\nstate-authority, anarchist institutions will be be open-ended\nprocesses that are complex and non-linear (Prichard 2018).\n\nWe see then, that individualist anarchism that focuses only on\nnegative liberty is often rejected by anarchists who are interested in\nreconceiving community and restructuring society along more\negalitarian lines. Indeed, individualistic anarchism has been\ncriticized as merely a matter of “lifestyle” (criticized\nin Bookchin 1995), which focuses on dress, behavior, and other\nindividualistic choices and preferences. Bookchin and other critics of\nlifestyle individualism will argue that mere non-conformism does very\nlittle to change the status quo and overturn structures of domination\nand authority. Nor does non-conformism and lifestyle anarchism work to\ncreate and sustain systems that affirm liberty and equality. But\ndefenders of lifestyle non-conformism will argue that there is value\nin opting out of cultural norms and demonstrating contempt for\nconformity through individual lifestyle choices.\n\nA more robust form of individualist anarchism will focus on key values\nsuch as autonomy and self-determination, asserting the primacy of the\nindividual over and against social groups as a matter of rights.\nIndividualist anarchists can admit that collective action is important\nand that voluntary cooperation among individuals can result in\nbeneficial and autonomy preserving community. Remaining disputes will\nconsider whether what results from individual cooperation is a form of\ncapitalism or a form of social sharing or communism. Libertarian\nanarchists or anarcho-capitalists will defend free market ideas based\nupon individual choices in trading and producing goods for market.\n\nOn the other hand, socialist or communistically oriented anarchism\nwill focus more on a sharing economy. This could be a large form of\nmutualism or something local and concrete like the sharing of family\nlife or the traditional potlatch. But these ideas remain anarchist to\nthe extent that they want to avoid centralized control and the\ndevelopment of hierarchical structures of domination. Unlike\nstate-centered communism of the sort developed by Marxists, anarchist\ncommunism advocates decentralization. The motto of this approach comes\nfrom Kropotkin: “all for all”. In The Conquest of\nBread (1892) Kropotkin criticizes monopolistic centralization\nthat prevents people from gaining access to socially generated wealth.\nThe solution is “all for all”: “What we proclaim is\nthe Right to Well-Being: Well-Being for All!” (Kropotkin 1892\n[1995: 20]). The communist idea that all humans should enjoy the\nfruits of the collective human product shares something with the\nMarxist idea of “to each according to his need” (Marx\n1875). But Kropotkin argues for the need to evolve beyond centralized\ncommunist control—what he criticizes as mere\n“collectivism”—and toward anarchist communism:\n\n\nAnarchy leads to communism, and communism to anarchy, both alike being\nexpressions of the predominant tendency in modern societies, the\npursuit of equality. (Kropotkin 1892 [1995: 31])\n\n\nKropotkin argues that the communal impulse already exists and that the\nadvances in social wealth made possible by the development of\nindividualistic capitalism make it likely that we will develop in the\ndirection of communal sharing. He argues that the tendency of history\nis away from centralized power and toward equality and\nliberty—and toward the abolition of the state. Kropotkin’s\ncommunist anarchism is based upon some historical and empirical\nclaims: about whether things can actually be arranged more\nsatisfactorily without state intervention; and about whether states\nreally do personify injustice and oppression. Libertarianism and\nanarcho-capitalism also think that the free market will work to\nadequately maximize human well-being and help individuals to realize\ntheir own autonomy. But for the socialist and communist anarchists,\nthe question of individual self-realization is less important than the\nidea of social development. Kropotkin’s “all for\nall” indicates a moral and ontological focus that is different\nfrom what we find among the individualists.\n\nSocialist and communally focused forms of anarchism emphasize the\nimportance of social groups. For example, families can be viewed as\nanarchic structures of social cooperation and solidarity. A social\nanarchist would be critical of hierarchical and domineering forms of\nfamily organization (for example, patriarchal family structure). But\nsocial anarchists will emphasize the point that human identity and\nflourishing occur within extended social structures—so long as\nit remains a free and self-determining community.\n\nThe tension between individualist and socialist anarchism comes to a\nhead when considering the question of the degree to which an\nindividual ought to be subordinated to the community. One problem for\nso-called “communitarian” theories of social and political\nlife is that they can result in the submergence of individuals into\nthe communal identity. Individualists will want to struggle against\nthis assault upon autonomy and individual identity. Communalists may\nrespond, as Clark does, by claiming that the ideal of a genuine\ncommunity of autonomous individuals remains a hoped for dream of an\n“impossible community” (Clark 2013). On the other hand\ncommunally focused theorists will point out that individual human\nbeings cannot exist outside of communal structures: we are social\nanimals who flourish and survive in communities. Thus radical\nindividualism also remains a dream—and as more politically\noriented anarchists will point out, individualism undermines the\npossibility of organized political action, which implies that\nindividualist anarchists will be unable to successfully resist\npolitical structures of domination.\n",
    "section_title": "2.4 Individualism, Libertarianism, and Socialist Anarchism",
    "entry_title": "Anarchism",
    "hierarchy_title": "Anarchism || Anarchism in Political Philosophy || Individualism, Libertarianism, and Socialist Anarchism",
    "tokenized_text": [
        "anarchism",
        "political",
        "philosophy",
        "individualism",
        "libertarianism",
        "socialist",
        "anarchism",
        "individualism",
        "libertarianism",
        "socialist",
        "anarchism",
        "form",
        "anarchism",
        "also",
        "differ",
        "term",
        "content",
        "theory",
        "focal",
        "point",
        "anarchist",
        "critique",
        "imagined",
        "practical",
        "impact",
        "anarchism",
        "socialist",
        "form",
        "anarchism",
        "include",
        "communist",
        "anarchism",
        "associated",
        "kropotkin",
        "communitarian",
        "anarchism",
        "see",
        "clark",
        "socialist",
        "approach",
        "focus",
        "development",
        "social",
        "communal",
        "group",
        "supposed",
        "thrive",
        "outside",
        "hierarchical",
        "centralized",
        "political",
        "structure",
        "individualist",
        "form",
        "anarchism",
        "include",
        "form",
        "libertarianism",
        "anarchocapitalism",
        "well",
        "egoistically",
        "oriented",
        "antinomianism",
        "nonconformism",
        "individualistic",
        "focus",
        "reject",
        "group",
        "identity",
        "idea",
        "socialcommunal",
        "good",
        "remaining",
        "firmly",
        "rooted",
        "moral",
        "claim",
        "autonomy",
        "individual",
        "see",
        "casey",
        "individualistic",
        "anarchism",
        "historically",
        "associated",
        "idea",
        "found",
        "stirner",
        "said",
        "every",
        "state",
        "despotism",
        "stirner",
        "argued",
        "duty",
        "obey",
        "state",
        "law",
        "law",
        "state",
        "impair",
        "selfdevelopment",
        "selfwill",
        "state",
        "seek",
        "tame",
        "desire",
        "along",
        "church",
        "undermines",
        "selfenjoyment",
        "development",
        "unique",
        "individuality",
        "stirner",
        "even",
        "critical",
        "social",
        "organization",
        "political",
        "party",
        "denying",
        "individual",
        "could",
        "affiliate",
        "organization",
        "maintains",
        "individual",
        "retains",
        "right",
        "identity",
        "party",
        "social",
        "organization",
        "embrace",
        "party",
        "ought",
        "allow",
        "embraced",
        "taken",
        "party",
        "stirner",
        "individualist",
        "anarchism",
        "often",
        "attributed",
        "variety",
        "thinker",
        "including",
        "josiah",
        "warren",
        "benjamin",
        "tucker",
        "thoreau",
        "individualist",
        "anarchism",
        "also",
        "seems",
        "something",
        "common",
        "egoism",
        "sort",
        "associated",
        "ayn",
        "rand",
        "rand",
        "dismissed",
        "anarchism",
        "naïve",
        "floating",
        "abstraction",
        "could",
        "exist",
        "reality",
        "argued",
        "government",
        "properly",
        "existed",
        "defend",
        "people",
        "right",
        "rand",
        "robust",
        "sort",
        "procapitalist",
        "anarchism",
        "defended",
        "murray",
        "rothbard",
        "reject",
        "leftwing",
        "anarchism",
        "sort",
        "associate",
        "communism",
        "applauding",
        "individualist",
        "anarchism",
        "tucker",
        "rothbard",
        "rothbard",
        "continues",
        "explain",
        "since",
        "anarchism",
        "usually",
        "considered",
        "primarily",
        "leftwing",
        "communist",
        "phenomenon",
        "libertarianism",
        "distinguished",
        "anarchism",
        "calling",
        "nonarchism",
        "rothbard",
        "related",
        "term",
        "employed",
        "literature",
        "minarchism",
        "used",
        "describe",
        "minimal",
        "state",
        "libertarian",
        "allow",
        "see",
        "machan",
        "libertarian",
        "still",
        "individualist",
        "emphasize",
        "importance",
        "individual",
        "liberty",
        "even",
        "though",
        "disagree",
        "fullblown",
        "anarchist",
        "degree",
        "state",
        "power",
        "justified",
        "worth",
        "considering",
        "complexity",
        "notion",
        "liberty",
        "consideration",
        "appealing",
        "isaiah",
        "berlin",
        "wellknown",
        "distinction",
        "negative",
        "positive",
        "liberty",
        "berlin",
        "individualist",
        "anarchist",
        "appear",
        "focus",
        "negative",
        "liberty",
        "ie",
        "freedom",
        "constraint",
        "authority",
        "domination",
        "anarchism",
        "also",
        "concerned",
        "community",
        "social",
        "good",
        "sense",
        "anarchist",
        "focused",
        "something",
        "like",
        "positive",
        "liberty",
        "concerned",
        "creating",
        "sustaining",
        "social",
        "condition",
        "necessary",
        "actualizing",
        "human",
        "flourishing",
        "regard",
        "anarchist",
        "also",
        "offered",
        "theory",
        "institutional",
        "rule",
        "social",
        "structure",
        "nonauthoritarian",
        "may",
        "sound",
        "paradoxical",
        "ie",
        "anarchist",
        "espouse",
        "rule",
        "structure",
        "prichard",
        "argued",
        "anarchist",
        "also",
        "interested",
        "freedom",
        "within",
        "institution",
        "social",
        "structure",
        "according",
        "prichard",
        "rather",
        "focusing",
        "stateauthority",
        "anarchist",
        "institution",
        "openended",
        "process",
        "complex",
        "nonlinear",
        "prichard",
        "see",
        "individualist",
        "anarchism",
        "focus",
        "negative",
        "liberty",
        "often",
        "rejected",
        "anarchist",
        "interested",
        "reconceiving",
        "community",
        "restructuring",
        "society",
        "along",
        "egalitarian",
        "line",
        "indeed",
        "individualistic",
        "anarchism",
        "criticized",
        "merely",
        "matter",
        "lifestyle",
        "criticized",
        "bookchin",
        "focus",
        "dress",
        "behavior",
        "individualistic",
        "choice",
        "preference",
        "bookchin",
        "critic",
        "lifestyle",
        "individualism",
        "argue",
        "mere",
        "nonconformism",
        "little",
        "change",
        "status",
        "quo",
        "overturn",
        "structure",
        "domination",
        "authority",
        "nonconformism",
        "lifestyle",
        "anarchism",
        "work",
        "create",
        "sustain",
        "system",
        "affirm",
        "liberty",
        "equality",
        "defender",
        "lifestyle",
        "nonconformism",
        "argue",
        "value",
        "opting",
        "cultural",
        "norm",
        "demonstrating",
        "contempt",
        "conformity",
        "individual",
        "lifestyle",
        "choice",
        "robust",
        "form",
        "individualist",
        "anarchism",
        "focus",
        "key",
        "value",
        "autonomy",
        "selfdetermination",
        "asserting",
        "primacy",
        "individual",
        "social",
        "group",
        "matter",
        "right",
        "individualist",
        "anarchist",
        "admit",
        "collective",
        "action",
        "important",
        "voluntary",
        "cooperation",
        "among",
        "individual",
        "result",
        "beneficial",
        "autonomy",
        "preserving",
        "community",
        "remaining",
        "dispute",
        "consider",
        "whether",
        "result",
        "individual",
        "cooperation",
        "form",
        "capitalism",
        "form",
        "social",
        "sharing",
        "communism",
        "libertarian",
        "anarchist",
        "anarchocapitalists",
        "defend",
        "free",
        "market",
        "idea",
        "based",
        "upon",
        "individual",
        "choice",
        "trading",
        "producing",
        "good",
        "market",
        "hand",
        "socialist",
        "communistically",
        "oriented",
        "anarchism",
        "focus",
        "sharing",
        "economy",
        "could",
        "large",
        "form",
        "mutualism",
        "something",
        "local",
        "concrete",
        "like",
        "sharing",
        "family",
        "life",
        "traditional",
        "potlatch",
        "idea",
        "remain",
        "anarchist",
        "extent",
        "want",
        "avoid",
        "centralized",
        "control",
        "development",
        "hierarchical",
        "structure",
        "domination",
        "unlike",
        "statecentered",
        "communism",
        "sort",
        "developed",
        "marxist",
        "anarchist",
        "communism",
        "advocate",
        "decentralization",
        "motto",
        "approach",
        "come",
        "kropotkin",
        "conquest",
        "bread",
        "kropotkin",
        "criticizes",
        "monopolistic",
        "centralization",
        "prevents",
        "people",
        "gaining",
        "access",
        "socially",
        "generated",
        "wealth",
        "solution",
        "proclaim",
        "right",
        "wellbeing",
        "wellbeing",
        "kropotkin",
        "communist",
        "idea",
        "human",
        "enjoy",
        "fruit",
        "collective",
        "human",
        "product",
        "share",
        "something",
        "marxist",
        "idea",
        "according",
        "need",
        "marx",
        "kropotkin",
        "argues",
        "need",
        "evolve",
        "beyond",
        "centralized",
        "communist",
        "controlwhat",
        "criticizes",
        "mere",
        "collectivism",
        "and",
        "toward",
        "anarchist",
        "communism",
        "anarchy",
        "lead",
        "communism",
        "communism",
        "anarchy",
        "alike",
        "expression",
        "predominant",
        "tendency",
        "modern",
        "society",
        "pursuit",
        "equality",
        "kropotkin",
        "kropotkin",
        "argues",
        "communal",
        "impulse",
        "already",
        "exists",
        "advance",
        "social",
        "wealth",
        "made",
        "possible",
        "development",
        "individualistic",
        "capitalism",
        "make",
        "likely",
        "develop",
        "direction",
        "communal",
        "sharing",
        "argues",
        "tendency",
        "history",
        "away",
        "centralized",
        "power",
        "toward",
        "equality",
        "libertyand",
        "toward",
        "abolition",
        "state",
        "kropotkin",
        "communist",
        "anarchism",
        "based",
        "upon",
        "historical",
        "empirical",
        "claim",
        "whether",
        "thing",
        "actually",
        "arranged",
        "satisfactorily",
        "without",
        "state",
        "intervention",
        "whether",
        "state",
        "really",
        "personify",
        "injustice",
        "oppression",
        "libertarianism",
        "anarchocapitalism",
        "also",
        "think",
        "free",
        "market",
        "work",
        "adequately",
        "maximize",
        "human",
        "wellbeing",
        "help",
        "individual",
        "realize",
        "autonomy",
        "socialist",
        "communist",
        "anarchist",
        "question",
        "individual",
        "selfrealization",
        "le",
        "important",
        "idea",
        "social",
        "development",
        "kropotkin",
        "indicates",
        "moral",
        "ontological",
        "focus",
        "different",
        "find",
        "among",
        "individualist",
        "socialist",
        "communally",
        "focused",
        "form",
        "anarchism",
        "emphasize",
        "importance",
        "social",
        "group",
        "example",
        "family",
        "viewed",
        "anarchic",
        "structure",
        "social",
        "cooperation",
        "solidarity",
        "social",
        "anarchist",
        "would",
        "critical",
        "hierarchical",
        "domineering",
        "form",
        "family",
        "organization",
        "example",
        "patriarchal",
        "family",
        "structure",
        "social",
        "anarchist",
        "emphasize",
        "point",
        "human",
        "identity",
        "flourishing",
        "occur",
        "within",
        "extended",
        "social",
        "structuresso",
        "long",
        "remains",
        "free",
        "selfdetermining",
        "community",
        "tension",
        "individualist",
        "socialist",
        "anarchism",
        "come",
        "head",
        "considering",
        "question",
        "degree",
        "individual",
        "ought",
        "subordinated",
        "community",
        "one",
        "problem",
        "socalled",
        "communitarian",
        "theory",
        "social",
        "political",
        "life",
        "result",
        "submergence",
        "individual",
        "communal",
        "identity",
        "individualist",
        "want",
        "struggle",
        "assault",
        "upon",
        "autonomy",
        "individual",
        "identity",
        "communalists",
        "may",
        "respond",
        "clark",
        "claiming",
        "ideal",
        "genuine",
        "community",
        "autonomous",
        "individual",
        "remains",
        "hoped",
        "dream",
        "impossible",
        "community",
        "clark",
        "hand",
        "communally",
        "focused",
        "theorist",
        "point",
        "individual",
        "human",
        "being",
        "exist",
        "outside",
        "communal",
        "structure",
        "social",
        "animal",
        "flourish",
        "survive",
        "community",
        "thus",
        "radical",
        "individualism",
        "also",
        "remains",
        "dreamand",
        "politically",
        "oriented",
        "anarchist",
        "point",
        "individualism",
        "undermines",
        "possibility",
        "organized",
        "political",
        "action",
        "implies",
        "individualist",
        "anarchist",
        "unable",
        "successfully",
        "resist",
        "political",
        "structure",
        "domination"
    ]
}