{
    "main_text": "Specific Fields || Metaphysics\n5.2 Metaphysics\n\nNonetheless, a traditional form of metaphysics did make a resurgence\nin the last quarter of the century in the work of Anderson’s\nstudent, D. M. Armstrong. Armstrong accepts against Anderson that the\nnature of space and time is a matter for scientific investigation, as\nis the identification of real properties – Anderson’s view\nof three-dimensional space and one-dimensional time as\n“ontological bed-rock”, for example, simply cannot be\nsustained (Armstrong, introduction to STC). But he\nfinds real interest in Anderson’s conception of the categories,\nas elaborated in the lectures on Samuel Alexander, recently published\nas Space, Time and the Categories: Lectures on Metaphysics\n(STC – published from typescript lectures in\nArmstrong’s possession and originally presented in\n1949–50). In his introduction to these lectures, Armstrong\nwrites:\n\nThe categories of being dive so deep that though quantum physics and\nother physics may have interesting things to say to philosophy –\nin particular whether causation is in fact deterministic – the\nissues are not susceptible of being resolved at the level of\nexperimental science, yet seem to be real issues. Science may be able\nto cast light on whether causation is irreducibly statistical or not,\nbut how can it decide what causation is in itself? Is it just a\nuniversal or statistical regularity? Or is it something deeper in the\nnature of things? What of the properties and quantities in which\nscience inevitably traffics? Are they just concepts in our minds, or\nsomethings in the objects that our concepts merely reflect?\n(STC, x)\n\n\nIn these lectures Anderson systematically derived the number of\ncategories and their ordering from the nature of the proposition and\nits subject-predicate structure. The result was a scheme of 13\ncategories, laid out in Hegel-like “succession” organized\nin three groups with the categories of Universality and Quantity\nacting as “link categories” in the two transitions between\nthe groups.\n\n\n(Reproduced from Space, Time and the Categories, with the\npermission of Sydney University Press.)\n\n\nArmstrong concludes:\n\n[W]ith this scheme, John Anderson joins a very distinguished line of\nphilosophers who have presented us with a set of categories. We have\nfirst Plato (the doctrine of Highest Kinds in his dialogue The\nSophist), then Aristotle, Kant, Hegel, and Samuel Alexander.\n(STC, xiii)\n\n\nDespite his appreciation of Hegel, Anderson thought that Kant had laid\n“the foundations for a logic of things as historical” and\nhere “Hegel can be regarded only as reactionary”\n(EMP, 83). Kant had shown that the objects of science\nare just the objects of observation, that “matter” is\nsomething we perceive and not something lying behind our perceptions.\nKant’s answer to Hume was that things perceived are connected\nwith one another; they pass through and affect one another in various\nways because they are related in space and time. We are aware of such\nrelations in being aware of anything at all. But Anderson insists\nagainst Kant that relations are known on the same level as the\nrelated. Kant was still subject to the assumptions of\nrepresentationalism, and thought of the objects of science as mere\nphenomena. Kant viewed space and time as forms of intuition under\nwhich we must experience the world. He viewed the categories such as\ncausality and substance as forms of understanding under which we must\nunderstand the world. Things-in-themselves are not given to us in\nexperience, and so remain beyond our cognitive grasp. In this way Kant\nset up an untenable division in reality between phenomena and\nthings-in-themselves, and along with this division the idea that our\nthoughts, practices and forms of inquiry in some way create or\nconstitute the reality we inhabit, act upon and investigate. Anderson,\nfollowing Samuel Alexander, proposed a realist alternative such that\nspace and time would be considered not as forms of intuition, but as\nforms of being, the categories not as forms of understanding but as\ncategories of being, categories under which all being must fall. On\nsuch a proposal we can recognise the objects of science as\nthings-in-themselves.\n\nAnderson claimed to have avoided the pitfalls of traditional\nmetaphysical questions concerning the reality of universals through\nhis account of the proposition (cf., “‘Universals’\nand Occurrences”, EMP). H. O. Mounce has\nsuggested that Anderson’s realism may not be able to avoid the\nissue. In particular, his account of universals is in danger of\ncollapsing into nominalism on the question of whether the directly\nperceived relation (say, of causality) is on separate occasions\none and the same (for Mounce, anything less than complete\nidentity would be a retreat to nominalism – Mounce 1989). Mounce\nsuggests that Anderson may not be able to hold off a Humean challenge\nhere. He would be drawn back to a familiar realist-nominalist debate\non the nature of universals, which may explain why Armstrong’s\nphilosophy takes seriously Plato’s question of the one and the\nmany as the starting point for metaphysical reflection (Armstrong\n1997). From a Quinean perspective, however, Armstrong’s\nmetaphysics, despite its improved scientific credentials, remains\nattentive to old school pseudo-questions (Quine 1953). (Michael Devitt\nexplicitly associates Armstrong with Quine’s parody of the\ntraditional Scottish metaphysician “McX” in Devitt\n2010.)\n\nFor his more empirically-minded students, Anderson’s logic\nseemed to rely upon an unwelcome element of a priorism. Any\nweakening of our confidence in Anderson’s identification of\nlogic and ontology, for example, would critically undermine\nsignificant components of the position. First, it would no longer be\nclear that things spoken of together must exist in the same way\n– the notion of a single level of being would become a matter\nfor investigation (what kinds of differences exist) rather than\ndetermined by general principle (Mackie 1985). Regarding his social\nthought, the importance of individuals’ behaviour in explaining\nthe nature and operation of social movements and institutions would\nrequire investigation, rather than a pronouncement based purely on\ngeneral grounds. Again, Anderson’s rejection of the rationalist\nview that there must be simple or ultimate units upon which\ncomplex things can be built would not lead without further argument to\nthe view that there cannot be such simple parts or totalities\n(Mackie 1985).\n\nAccording to Anderson, David Hume’s skepticism was a direct\nresult of his inability to work out a logic, to create a coherent\naccount of existence. But his mentor at Edinburgh, Norman Kemp Smith,\nhad long argued that Hume’s importance was in demonstrating the\nfactual limits of all logic. If Hume had failed to work out a logic to\nAnderson’s satisfaction this was because in his view\nphilosophers should resist the temptation of this kind of\n“systematic working out” altogether (Davie 1977).\nHume’s reservations about a “systematic working out”\nhave emerged in another form with the “linguistic\nreturn” proposed by Huw Price, who became the first\nappointment to the Challis Chair of Philosophy within a united\ndepartment at Sydney since the split of 1974. Price describes the\nproject as a “linguistic retooling of metaphysics” (Price\n2011, p. 18) and the attempt specifically to avoid Mackie’s\n“placement” issue which arises from an obsession with the\nrepresentational aspect of language (although Mackie himself regarded\nthis with Anderson as an ontological issue – see section 5.4\nbelow). On Price’s view plurality exists in the world of an\nentirely familiar kind: a plurality of ways of talking and ways of\nbehaviour which don’t need to be mirrored in an ontology of any\nkind.\n\nIt has been observed that Anderson’s most prominent students\naccepted in fact very little of his system. It is still the case that\ntheir most fundamental philosophical commitments can be traced to the\nboldness of Anderson’s position. And Armstrong suggests that the\nphilosopher at some point can only outline his or her most basic\ncommitments. Stephen Mumford summarises Armstrong’s own position as\nfollows: no God, no non-spatial minds, no abstract\nentities beyond space-time, no Platonic forms or realm of universals;\nan austere ontology without transcendent universals, realm of numbers,\ntranscendent standards of value, timeless propositions, non-existent\nobjects, possibilia, possible worlds, abstract classes (Mumford 2007\np. 5). Armstrong diverges from Anderson in his emphasis upon\nscientific naturalism, in the position that the world is to be\ncompletely described in terms of a completed physics. What properties\nexist will ultimately be determined solely by science, and the results\nwill inevitably seem counter-intuitive within the perspective of\nAristotelian common sense. But for Armstrong this scientific view can\nbe reconciled with a form of metaphysical realism derived from\nAnderson’s teaching which takes universals to exist immanently\nrather than in a transcendent realm; which takes the world to contain\nnothing but particulars having properties and being related to each\nother; which takes the world to be nothing but a single\nspatio-temporal system; which regards reality as a world of states of\naffairs conceived as particulars bearing properties; which insists\nthat states of affairs are the smallest units of existence since\nneither particulars nor universals are capable of independent\nexistence. \n",
    "section_title": "5.2 Metaphysics",
    "entry_title": "John Anderson",
    "hierarchy_title": "John Anderson || Specific Fields || Metaphysics",
    "tokenized_text": [
        "specific",
        "field",
        "metaphysics",
        "metaphysics",
        "nonetheless",
        "traditional",
        "form",
        "metaphysics",
        "make",
        "resurgence",
        "last",
        "quarter",
        "century",
        "work",
        "anderson",
        "student",
        "d",
        "m",
        "armstrong",
        "armstrong",
        "accepts",
        "anderson",
        "nature",
        "space",
        "time",
        "matter",
        "scientific",
        "investigation",
        "identification",
        "real",
        "property",
        "anderson",
        "view",
        "threedimensional",
        "space",
        "onedimensional",
        "time",
        "ontological",
        "bedrock",
        "example",
        "simply",
        "sustained",
        "armstrong",
        "introduction",
        "stc",
        "find",
        "real",
        "interest",
        "anderson",
        "conception",
        "category",
        "elaborated",
        "lecture",
        "samuel",
        "alexander",
        "recently",
        "published",
        "space",
        "time",
        "category",
        "lecture",
        "metaphysics",
        "stc",
        "published",
        "typescript",
        "lecture",
        "armstrong",
        "possession",
        "originally",
        "presented",
        "introduction",
        "lecture",
        "armstrong",
        "writes",
        "category",
        "dive",
        "deep",
        "though",
        "quantum",
        "physic",
        "physic",
        "may",
        "interesting",
        "thing",
        "say",
        "philosophy",
        "particular",
        "whether",
        "causation",
        "fact",
        "deterministic",
        "issue",
        "susceptible",
        "resolved",
        "level",
        "experimental",
        "science",
        "yet",
        "seem",
        "real",
        "issue",
        "science",
        "may",
        "able",
        "cast",
        "light",
        "whether",
        "causation",
        "irreducibly",
        "statistical",
        "decide",
        "causation",
        "universal",
        "statistical",
        "regularity",
        "something",
        "deeper",
        "nature",
        "thing",
        "property",
        "quantity",
        "science",
        "inevitably",
        "traffic",
        "concept",
        "mind",
        "somethings",
        "object",
        "concept",
        "merely",
        "reflect",
        "stc",
        "x",
        "lecture",
        "anderson",
        "systematically",
        "derived",
        "number",
        "category",
        "ordering",
        "nature",
        "proposition",
        "subjectpredicate",
        "structure",
        "result",
        "scheme",
        "category",
        "laid",
        "hegellike",
        "succession",
        "organized",
        "three",
        "group",
        "category",
        "universality",
        "quantity",
        "acting",
        "link",
        "category",
        "two",
        "transition",
        "group",
        "reproduced",
        "space",
        "time",
        "category",
        "permission",
        "sydney",
        "university",
        "press",
        "armstrong",
        "concludes",
        "w",
        "ith",
        "scheme",
        "john",
        "anderson",
        "join",
        "distinguished",
        "line",
        "philosopher",
        "presented",
        "u",
        "set",
        "category",
        "first",
        "plato",
        "doctrine",
        "highest",
        "kind",
        "dialogue",
        "sophist",
        "aristotle",
        "kant",
        "hegel",
        "samuel",
        "alexander",
        "stc",
        "xiii",
        "despite",
        "appreciation",
        "hegel",
        "anderson",
        "thought",
        "kant",
        "laid",
        "foundation",
        "logic",
        "thing",
        "historical",
        "hegel",
        "regarded",
        "reactionary",
        "emp",
        "kant",
        "shown",
        "object",
        "science",
        "object",
        "observation",
        "matter",
        "something",
        "perceive",
        "something",
        "lying",
        "behind",
        "perception",
        "kant",
        "answer",
        "hume",
        "thing",
        "perceived",
        "connected",
        "one",
        "another",
        "pas",
        "affect",
        "one",
        "another",
        "various",
        "way",
        "related",
        "space",
        "time",
        "aware",
        "relation",
        "aware",
        "anything",
        "anderson",
        "insists",
        "kant",
        "relation",
        "known",
        "level",
        "related",
        "kant",
        "still",
        "subject",
        "assumption",
        "representationalism",
        "thought",
        "object",
        "science",
        "mere",
        "phenomenon",
        "kant",
        "viewed",
        "space",
        "time",
        "form",
        "intuition",
        "must",
        "experience",
        "world",
        "viewed",
        "category",
        "causality",
        "substance",
        "form",
        "understanding",
        "must",
        "understand",
        "world",
        "thingsinthemselves",
        "given",
        "u",
        "experience",
        "remain",
        "beyond",
        "cognitive",
        "grasp",
        "way",
        "kant",
        "set",
        "untenable",
        "division",
        "reality",
        "phenomenon",
        "thingsinthemselves",
        "along",
        "division",
        "idea",
        "thought",
        "practice",
        "form",
        "inquiry",
        "way",
        "create",
        "constitute",
        "reality",
        "inhabit",
        "act",
        "upon",
        "investigate",
        "anderson",
        "following",
        "samuel",
        "alexander",
        "proposed",
        "realist",
        "alternative",
        "space",
        "time",
        "would",
        "considered",
        "form",
        "intuition",
        "form",
        "category",
        "form",
        "understanding",
        "category",
        "category",
        "must",
        "fall",
        "proposal",
        "recognise",
        "object",
        "science",
        "thingsinthemselves",
        "anderson",
        "claimed",
        "avoided",
        "pitfall",
        "traditional",
        "metaphysical",
        "question",
        "concerning",
        "reality",
        "universal",
        "account",
        "proposition",
        "cf",
        "universal",
        "occurrence",
        "emp",
        "h",
        "o",
        "mounce",
        "suggested",
        "anderson",
        "realism",
        "may",
        "able",
        "avoid",
        "issue",
        "particular",
        "account",
        "universal",
        "danger",
        "collapsing",
        "nominalism",
        "question",
        "whether",
        "directly",
        "perceived",
        "relation",
        "say",
        "causality",
        "separate",
        "occasion",
        "one",
        "mounce",
        "anything",
        "le",
        "complete",
        "identity",
        "would",
        "retreat",
        "nominalism",
        "mounce",
        "mounce",
        "suggests",
        "anderson",
        "may",
        "able",
        "hold",
        "humean",
        "challenge",
        "would",
        "drawn",
        "back",
        "familiar",
        "realistnominalist",
        "debate",
        "nature",
        "universal",
        "may",
        "explain",
        "armstrong",
        "philosophy",
        "take",
        "seriously",
        "plato",
        "question",
        "one",
        "many",
        "starting",
        "point",
        "metaphysical",
        "reflection",
        "armstrong",
        "quinean",
        "perspective",
        "however",
        "armstrong",
        "metaphysics",
        "despite",
        "improved",
        "scientific",
        "credential",
        "remains",
        "attentive",
        "old",
        "school",
        "pseudoquestions",
        "quine",
        "michael",
        "devitt",
        "explicitly",
        "associate",
        "armstrong",
        "quine",
        "parody",
        "traditional",
        "scottish",
        "metaphysician",
        "mcx",
        "devitt",
        "empiricallyminded",
        "student",
        "anderson",
        "logic",
        "seemed",
        "rely",
        "upon",
        "unwelcome",
        "element",
        "priorism",
        "weakening",
        "confidence",
        "anderson",
        "identification",
        "logic",
        "ontology",
        "example",
        "would",
        "critically",
        "undermine",
        "significant",
        "component",
        "position",
        "first",
        "would",
        "longer",
        "clear",
        "thing",
        "spoken",
        "together",
        "must",
        "exist",
        "way",
        "notion",
        "single",
        "level",
        "would",
        "become",
        "matter",
        "investigation",
        "kind",
        "difference",
        "exist",
        "rather",
        "determined",
        "general",
        "principle",
        "mackie",
        "regarding",
        "social",
        "thought",
        "importance",
        "individual",
        "behaviour",
        "explaining",
        "nature",
        "operation",
        "social",
        "movement",
        "institution",
        "would",
        "require",
        "investigation",
        "rather",
        "pronouncement",
        "based",
        "purely",
        "general",
        "ground",
        "anderson",
        "rejection",
        "rationalist",
        "view",
        "must",
        "simple",
        "ultimate",
        "unit",
        "upon",
        "complex",
        "thing",
        "built",
        "would",
        "lead",
        "without",
        "argument",
        "view",
        "simple",
        "part",
        "totality",
        "mackie",
        "according",
        "anderson",
        "david",
        "hume",
        "skepticism",
        "direct",
        "result",
        "inability",
        "work",
        "logic",
        "create",
        "coherent",
        "account",
        "existence",
        "mentor",
        "edinburgh",
        "norman",
        "kemp",
        "smith",
        "long",
        "argued",
        "hume",
        "importance",
        "demonstrating",
        "factual",
        "limit",
        "logic",
        "hume",
        "failed",
        "work",
        "logic",
        "anderson",
        "satisfaction",
        "view",
        "philosopher",
        "resist",
        "temptation",
        "kind",
        "systematic",
        "working",
        "altogether",
        "davie",
        "hume",
        "reservation",
        "systematic",
        "working",
        "emerged",
        "another",
        "form",
        "linguistic",
        "return",
        "proposed",
        "huw",
        "price",
        "became",
        "first",
        "appointment",
        "challis",
        "chair",
        "philosophy",
        "within",
        "united",
        "department",
        "sydney",
        "since",
        "split",
        "price",
        "describes",
        "project",
        "linguistic",
        "retooling",
        "metaphysics",
        "price",
        "p",
        "attempt",
        "specifically",
        "avoid",
        "mackie",
        "placement",
        "issue",
        "arises",
        "obsession",
        "representational",
        "aspect",
        "language",
        "although",
        "mackie",
        "regarded",
        "anderson",
        "ontological",
        "issue",
        "see",
        "section",
        "price",
        "view",
        "plurality",
        "exists",
        "world",
        "entirely",
        "familiar",
        "kind",
        "plurality",
        "way",
        "talking",
        "way",
        "behaviour",
        "need",
        "mirrored",
        "ontology",
        "kind",
        "observed",
        "anderson",
        "prominent",
        "student",
        "accepted",
        "fact",
        "little",
        "system",
        "still",
        "case",
        "fundamental",
        "philosophical",
        "commitment",
        "traced",
        "boldness",
        "anderson",
        "position",
        "armstrong",
        "suggests",
        "philosopher",
        "point",
        "outline",
        "basic",
        "commitment",
        "stephen",
        "mumford",
        "summarises",
        "armstrong",
        "position",
        "follows",
        "god",
        "nonspatial",
        "mind",
        "abstract",
        "entity",
        "beyond",
        "spacetime",
        "platonic",
        "form",
        "realm",
        "universal",
        "austere",
        "ontology",
        "without",
        "transcendent",
        "universal",
        "realm",
        "number",
        "transcendent",
        "standard",
        "value",
        "timeless",
        "proposition",
        "nonexistent",
        "object",
        "possibilia",
        "possible",
        "world",
        "abstract",
        "class",
        "mumford",
        "p",
        "armstrong",
        "diverges",
        "anderson",
        "emphasis",
        "upon",
        "scientific",
        "naturalism",
        "position",
        "world",
        "completely",
        "described",
        "term",
        "completed",
        "physic",
        "property",
        "exist",
        "ultimately",
        "determined",
        "solely",
        "science",
        "result",
        "inevitably",
        "seem",
        "counterintuitive",
        "within",
        "perspective",
        "aristotelian",
        "common",
        "sense",
        "armstrong",
        "scientific",
        "view",
        "reconciled",
        "form",
        "metaphysical",
        "realism",
        "derived",
        "anderson",
        "teaching",
        "take",
        "universal",
        "exist",
        "immanently",
        "rather",
        "transcendent",
        "realm",
        "take",
        "world",
        "contain",
        "nothing",
        "particular",
        "property",
        "related",
        "take",
        "world",
        "nothing",
        "single",
        "spatiotemporal",
        "system",
        "regard",
        "reality",
        "world",
        "state",
        "affair",
        "conceived",
        "particular",
        "bearing",
        "property",
        "insists",
        "state",
        "affair",
        "smallest",
        "unit",
        "existence",
        "since",
        "neither",
        "particular",
        "universal",
        "capable",
        "independent",
        "existence"
    ]
}