{
    "main_text": "Cooper’s Doctoral Thesis: L’attitude de la France à l’égard de l’esclavage pendant la revolution\n4. Cooper’s Doctoral Thesis: L’attitude de la France à l’égard de l’esclavage pendant la revolution\n\n\nCooper’s dissertation provides insights and analyses pertinent\nto social and political philosophy, critical philosophy of race, as\nwell as critical interpretations of French Enlightenment. Like\nVoice, this text by Cooper warrants an extensive overview\nbecause it has remained almost wholly overlooked by philosophers. In\nL’attitude de la France à l’égard de\nl’esclavage pendant la revolution, Cooper succeeds in\nresituating racial oppression, colonialism, and slavery as issues\ncentral to rather than tangential to the French and Haitian\nRevolutions. Her topic was motivated by several observations\nincluding comments from French President Poincaré—which to her\nseemed significant to France’s attitude about racial equality, as\nwell as the erection of a monument in Dakar, “A la Gloire de l\nArmée Noirse” (VAJC, 324). Additionally, Cooper was\nresearching “the Franco Japanese Treaty of 1896—The\nNaturalization of France: a) for Japanese, b) Hindus, c) Negroes, and\nof course the discussions of the National Assemblies during the French\nRevolution; the writings and speeches of and about La\nSociété des Amis des Noir—l’Abbe Gregoire\nand others” (VAJC, 324).\n\n\nTo these interests and influences, Cooper adds her avid reading of\nLe Monde Noir (or La Revue du Monde Noir) and\ncontributions from thinkers such as Franz Boas, Jean Finot, Author de\nGobineau, along with discourses from Alphanse de Lamartine and his\ndrama Toussaint L’Ouverture. La Revue du Monde\nNoir, launched in October 1931, was conceptualized at the Clamart\nsalon (located in the Paris apartment of Jane and Paulette Nardal) and\nmanaged by the Nardal sisters along with Léo Sajous, Clara\nShepard, and Louis-Jean Finot. An original issue of La\nRevue du Monde Noir is in Cooper’s archived papers at Howard\nUniversity’s Moorland-Springarn Center. Priced at 7 francs\n50 or 30 cents U.S., the issue contains such contributions as\n“Race Equality” by Louis-Jean Finot, “The Creole\nRace” by Maître Jean-Louis, a poem by Claude McKay, and\n“A Negro Woman speaks at Cambridge and Geneva” by Paulette\nNardal.\n\n\nThe introduction to Cooper’s thesis outlines the origins of the\ninstitution of “Negro slave trade,” which was\n“founded on the abuse of power…and maintained by\nviolence” (SFHR, 31). Cooper discusses the impact of the slave\ntrade on mortality rates of the enslaved (e.g. through the middle\npassage) along with the ways in which slavery and colonialism\nunderdeveloped the continent of Africa while enriching the Spanish,\nPortuguese, Iberian peoples, the United States, England and\nFrance—among others. She highlights the harms of slavery for\nboth the slavers and the enslaved while also underscoring the\nprominent role of slavery in the colonial system. In France in\nparticular she asserts, “the colonists, the rich merchants, had\ntoo much to gain from the shameful traffic in slaves to be willing\neven to consider the possibility of suppressing slavery. Since the\ntime of Colbert, too many French ports had been developed and enriched\nby the trade” (SFHR, 37). The struggle against slavery and the\nopposing interests of the colonists against the Blacks would have been\none-sided in the interest of the colonist, Cooper asserts, if not for\nthe establishment of the Friends of the Blacks by Brissot,\nSièyes, and Condorcet in 1787, (SFHR, 37).\n\n\nAgainst this background, in the first chapter of the thesis Cooper\ndetails the prosperity of the French colonies, especially Santo\nDomingo, on the eve of the Revolution (“The Social Conditions of\nthe French-American Colonies; the Class Structure”). She\ndescribes the various classes including the “petite blancs”\n(lower middle class whites), “mulatto class” (sometimes\nrather well educated and extremely desirous of affirming their equality\nwith whites), “colored men” (a term used by the petit\nblancs that included both those with a mixture of the white race and\nthe black race, as well as the pure Negro natives of Africa or the\ncolonies), and “freed men” (who were generally poor and who\nwere almost as jealous of the mulattos as of the whites), (SFHR,\n44–45). \n\n\nFrom here Cooper details the geography of Santo Domingo and the\nconflicts (including slave revolts and the violence of the colonial and\nslave systems) that contributed to the white colonists of Santo Domingo\napproaching the National Assembly of France. Disturbed about the\ninfluence of the Society of the Friends of the Blacks, the colonists\nestablished an adversarial group called the Massiac Club, which claimed\nthe right to be represented in the National Assembly. The\nunexpected result was the increased visibility of the colonial problem\nfor the public, which actually strengthened the position of the Friends\nof the Blacks concerning the problem of human liberty and equality\nbetween the races, (SFHR, 48–49). Cooper states, “Thus the\nFriends of the Blacks profited from the admission of the deputies of\nSanto Domingo to draw attention toward the great problem of equality of\nthe races, and to the concurrent problem of the suppression of\nslavery” (SFHR, 53). Another outcome of this debate was\nthe question of the principle of colonial representation—the idea\nthat the colonies are a part of the national territory of France, not\njust lands to be exploited, (SFHR, 56).\n\n\nIn Chapter Two, Cooper describes the formation of “The\nAmerican Colonists”—a committee of colored men organized\nby “the elder Raimond, Jacques and Vincent Ogé”\n(SFHR, 59). They sought the admission of a deputy to represent\nthem in the Constituent Assembly and demanded “the absolute\nequality of colored men and free Negroes with white colonists”\n(SFHR, 60). This reopened debates about the problem of equality\nof the races in the colonies and raised “A graver question, that\nof the abolition of the trade and slavery” (SFHR, 60). In\naddition to considering the “fate of the blacks” there are\nalso the other events of the Revolution in France including Bastille,\nthe Declaration of the Rights of Man and Citizen, and the height of the\nreign of terror, (SFHR, 61). Cooper asserts, “It is certain\nthat if the whites had adopted a more conciliatory attitude toward the\nfree mulattos many disasters could have been avoided” (SFHR,\n63). But the colonist joined forces with the Massiac Club to\nprevent the emancipation of slaves and to establish a force in the\ncolonies that could resist any legislation against slavery. The\nresult was, in part, the establishment of a Colonial Committee that\nwould centralize colonial questions in the hands of a few and remove\nthem from the Friends of the Blacks, (SFHR, 65). Cooper is clear\nthat financial concerns outweighed ideals about freedom and racial\nequality. She argues that the establishment of this Colonial\nCommittee was indicative of the necessity to “slow down a\nrevolutionary moment menacing the whole of the West Indies”\ncoupled with a desire to protect the financial interests and national\nwealth of France insofar as “trade with Santo Domingo represented\ntwo thirds of the total trade of France” (SFHR, 66).\n\n\nThe Friends of the Blacks were “prepared to sacrifice\neverything for the success of their cause,” and the Massaic Club\ncolonialists “were just as dedicated to their detestable\ncause” (SFHR, 71). Barnave presented a decree (March\n1790), which contained the principle that the colonies were to provide\ntheir own constitution, thereby ending arbitrary administration. \nThe colonists then demanded independence, but “Without making any\ndistinction between the whites and the colored men, without even\nmentioning one or the other, they contented themselves in the famous\nArticle IV, with conferring civil rights upon ‘all property\nowners of twenty-five years of age,’ who possessed real estate,\nor lacking such property, had been domiciled in and had contributed to\nthe parish for two years” (SFHR, 71). Cooper notes that\nthe ambiguity of the article allowed landholding mulattoes to hope that\nthese civil rights applied to them “without assuring them any\nbenefit” (SFHR, 72). Furthermore, colored men in Paris\nwere alarmed by the silence of the decree on their particular\nrights. Just as mulattos were seeking the same rights as whites,\nBlacks would go on to claim the same rights as mulattos. The\nresult of the decree was resistance and insurrection. “In\nspite of all of these measures,” Cooper notes, “it was in\nvain that the Constituent Assembly and its Colonial Committee had hoped\nto save the colonies from danger of insurrections,” (SFHR, 77). \nThe decree of May 15, 1791 which accorded political rights to mulattoes\nborn of free parents and recognizing them as active citizens was a\ndefeat for the colonists, yet they refused to comply with it (SFHR,\n80). The white colonists revolted, the decree was retracted\n(though not altogether annulled), and the Friends of the Blacks and the\nJacobin Club were brought closer together.\n\n\nIn the third chapter Cooper documents the various Civil Commissions\nsent to Santo Domingo along with the resulting reports and decrees that\nfollowed with those visits. White colonists continued to act in\nopen opposition to any semblance of political equality (which they\nfeared might also lead to social equality) for mulattoes (SFHR,\n88). She notes, “…April 4th a new\nNational Law annulled the Constitutional Decree of September\n24th, 1791, conferred upon colored men and free Negroes\nequal political rights with whites, and ordered a new election, more in\naccord with principles of equality, of the colonial and parochial\nassemblies which had been reinvigorated by then to enforce the new Law\nthe [a]ssembly provided for the appointment of three new Civil\nCommissioners having dictatorial powers and supported by a sufficient\nmilitary force” (SFHR, 88).\n\n\nIn time the Commissioners “let the blacks do as they\nwished,” emancipation was proclaimed in the West and in the\nSouth, “Negroes everywhere refused to work, and economic\nconditions worsened to the extent that insubordination\nincreased” (SFHR, 95–97). In examining the correspondence\nof this particular period, Cooper notes the descriptions of\ninsurrections and loss of property, and the seemingly secondary\nattention to the question of slavery. She asserts, “Thus we\nfind one more argument in support of the idea, which inevitably grows\nstronger as one reads so many convincing documents, that the question\nof the emancipation of the slaves had only been considered and embraced\nby a few enthusiasts, idealists like Brissot and his friends…who\nhad only seen a problem to be resolved by humanity and theory where in\nfact a thorough practical preparation was necessary” (SFHR,\n98).\n\n\nCooper also outlines the events leading up to the rise in power of\nToussaint Louverture (whom she describes as “a grand\nfigure” “intelligent and capable” and “endowed\nwith a strong personality that towered over those of his\ncompanions” (SFHR, 101). A leader able to “see and\nforesee,” Louverture sent Sonthoax back to France followed by\nHédouville and Raimond. In a campaign against Rigaurd for\npower, Louverture facilitated massacres of mulattoes in the North\nand eventually “made himself master of all the Spanish\nterritory” (SFHR, 106). Expecting a strong response from\nFrance and Napoleon, Louverture forced Blacks back to work to increase\nthe prosperity of the island and “permitted no revolt, finishing\noff insurrectionists swiftly…” (SFHR, 108). In the\nend, Louverture would be sent to France where he died on April 7, 1803. Napoleon went on to reestablish slavery\nand slave trade in the French colonies. Cooper observes,\n“In truth, it seems that Napoleon never gave more than absent\nminded thoughts to the obviously complicated problem presented by that\ntoo distant island” (SFHR, 111). A new “war of\nextermination” broke out against the “last vestiges of the\nwhite race at Santo Domingo” (SFHR, 111). \nLouverture’s successor Dessallines declared the island\nindependent and restored the Indian name of Haiti “so that there\nwould no longer be reminders of the European occupation” (SFHR,\n111).\n\n\nIn her conclusion, Cooper reflects on the various factors that\ncomplicated the entire situation from the economic conditions in\nrevolutionary France to the issue of slavery and the problem of\nrace—a problem that was not simply Black and white, but also\ninvolved “the intermediate mulatto,” and finally, a\npolitical problem, (SFHR, 114). Cooper describes the political problem\nin this way, “The change in regime was not accepted in these\ndistant countries as it should have been, because it was not\nunderstood. The majority of the colonists remained royalists. And\nso did the blacks. A war of parties was added to the war of\nraces” (SFHR, 114).\n",
    "section_title": "4. Cooper’s Doctoral Thesis: L’attitude de la France à l’égard de l’esclavage pendant la revolution",
    "entry_title": "Anna Julia Cooper",
    "hierarchy_title": "Anna Julia Cooper || Cooper’s Doctoral Thesis: L’attitude de la France à l’égard de l’esclavage pendant la revolution",
    "tokenized_text": [
        "cooper",
        "doctoral",
        "thesis",
        "l",
        "attitude",
        "de",
        "la",
        "france",
        "à",
        "l",
        "égard",
        "de",
        "l",
        "esclavage",
        "pendant",
        "la",
        "revolution",
        "cooper",
        "doctoral",
        "thesis",
        "l",
        "attitude",
        "de",
        "la",
        "france",
        "à",
        "l",
        "égard",
        "de",
        "l",
        "esclavage",
        "pendant",
        "la",
        "revolution",
        "cooper",
        "dissertation",
        "provides",
        "insight",
        "analysis",
        "pertinent",
        "social",
        "political",
        "philosophy",
        "critical",
        "philosophy",
        "race",
        "well",
        "critical",
        "interpretation",
        "french",
        "enlightenment",
        "like",
        "voice",
        "text",
        "cooper",
        "warrant",
        "extensive",
        "overview",
        "remained",
        "almost",
        "wholly",
        "overlooked",
        "philosopher",
        "l",
        "attitude",
        "de",
        "la",
        "france",
        "à",
        "l",
        "égard",
        "de",
        "l",
        "esclavage",
        "pendant",
        "la",
        "revolution",
        "cooper",
        "succeeds",
        "resituating",
        "racial",
        "oppression",
        "colonialism",
        "slavery",
        "issue",
        "central",
        "rather",
        "tangential",
        "french",
        "haitian",
        "revolution",
        "topic",
        "motivated",
        "several",
        "observation",
        "including",
        "comment",
        "french",
        "president",
        "poincaréwhich",
        "seemed",
        "significant",
        "france",
        "attitude",
        "racial",
        "equality",
        "well",
        "erection",
        "monument",
        "dakar",
        "la",
        "gloire",
        "de",
        "l",
        "armée",
        "noirse",
        "vajc",
        "additionally",
        "cooper",
        "researching",
        "franco",
        "japanese",
        "treaty",
        "the",
        "naturalization",
        "france",
        "japanese",
        "b",
        "hindu",
        "c",
        "negro",
        "course",
        "discussion",
        "national",
        "assembly",
        "french",
        "revolution",
        "writing",
        "speech",
        "la",
        "société",
        "de",
        "amis",
        "de",
        "noirl",
        "abbe",
        "gregoire",
        "others",
        "vajc",
        "interest",
        "influence",
        "cooper",
        "add",
        "avid",
        "reading",
        "le",
        "monde",
        "noir",
        "la",
        "revue",
        "du",
        "monde",
        "noir",
        "contribution",
        "thinker",
        "franz",
        "boa",
        "jean",
        "finot",
        "author",
        "de",
        "gobineau",
        "along",
        "discourse",
        "alphanse",
        "de",
        "lamartine",
        "drama",
        "toussaint",
        "l",
        "ouverture",
        "la",
        "revue",
        "du",
        "monde",
        "noir",
        "launched",
        "october",
        "conceptualized",
        "clamart",
        "salon",
        "located",
        "paris",
        "apartment",
        "jane",
        "paulette",
        "nardal",
        "managed",
        "nardal",
        "sister",
        "along",
        "léo",
        "sajous",
        "clara",
        "shepard",
        "louisjean",
        "finot",
        "original",
        "issue",
        "la",
        "revue",
        "du",
        "monde",
        "noir",
        "cooper",
        "archived",
        "paper",
        "howard",
        "university",
        "moorlandspringarn",
        "center",
        "priced",
        "franc",
        "cent",
        "us",
        "issue",
        "contains",
        "contribution",
        "race",
        "equality",
        "louisjean",
        "finot",
        "creole",
        "race",
        "maître",
        "jeanlouis",
        "poem",
        "claude",
        "mckay",
        "negro",
        "woman",
        "speaks",
        "cambridge",
        "geneva",
        "paulette",
        "nardal",
        "introduction",
        "cooper",
        "thesis",
        "outline",
        "origin",
        "institution",
        "negro",
        "slave",
        "trade",
        "founded",
        "abuse",
        "powerand",
        "maintained",
        "violence",
        "sfhr",
        "cooper",
        "discus",
        "impact",
        "slave",
        "trade",
        "mortality",
        "rate",
        "enslaved",
        "eg",
        "middle",
        "passage",
        "along",
        "way",
        "slavery",
        "colonialism",
        "underdeveloped",
        "continent",
        "africa",
        "enriching",
        "spanish",
        "portuguese",
        "iberian",
        "people",
        "united",
        "state",
        "england",
        "franceamong",
        "others",
        "highlight",
        "harm",
        "slavery",
        "slaver",
        "enslaved",
        "also",
        "underscoring",
        "prominent",
        "role",
        "slavery",
        "colonial",
        "system",
        "france",
        "particular",
        "asserts",
        "colonist",
        "rich",
        "merchant",
        "much",
        "gain",
        "shameful",
        "traffic",
        "slave",
        "willing",
        "even",
        "consider",
        "possibility",
        "suppressing",
        "slavery",
        "since",
        "time",
        "colbert",
        "many",
        "french",
        "port",
        "developed",
        "enriched",
        "trade",
        "sfhr",
        "struggle",
        "slavery",
        "opposing",
        "interest",
        "colonist",
        "black",
        "would",
        "onesided",
        "interest",
        "colonist",
        "cooper",
        "asserts",
        "establishment",
        "friend",
        "black",
        "brissot",
        "sièyes",
        "condorcet",
        "sfhr",
        "background",
        "first",
        "chapter",
        "thesis",
        "cooper",
        "detail",
        "prosperity",
        "french",
        "colony",
        "especially",
        "santo",
        "domingo",
        "eve",
        "revolution",
        "social",
        "condition",
        "frenchamerican",
        "colony",
        "class",
        "structure",
        "describes",
        "various",
        "class",
        "including",
        "petite",
        "blanc",
        "lower",
        "middle",
        "class",
        "white",
        "mulatto",
        "class",
        "sometimes",
        "rather",
        "well",
        "educated",
        "extremely",
        "desirous",
        "affirming",
        "equality",
        "white",
        "colored",
        "men",
        "term",
        "used",
        "petit",
        "blanc",
        "included",
        "mixture",
        "white",
        "race",
        "black",
        "race",
        "well",
        "pure",
        "negro",
        "native",
        "africa",
        "colony",
        "freed",
        "men",
        "generally",
        "poor",
        "almost",
        "jealous",
        "mulatto",
        "white",
        "sfhr",
        "cooper",
        "detail",
        "geography",
        "santo",
        "domingo",
        "conflict",
        "including",
        "slave",
        "revolt",
        "violence",
        "colonial",
        "slave",
        "system",
        "contributed",
        "white",
        "colonist",
        "santo",
        "domingo",
        "approaching",
        "national",
        "assembly",
        "france",
        "disturbed",
        "influence",
        "society",
        "friend",
        "black",
        "colonist",
        "established",
        "adversarial",
        "group",
        "called",
        "massiac",
        "club",
        "claimed",
        "right",
        "represented",
        "national",
        "assembly",
        "unexpected",
        "result",
        "increased",
        "visibility",
        "colonial",
        "problem",
        "public",
        "actually",
        "strengthened",
        "position",
        "friend",
        "black",
        "concerning",
        "problem",
        "human",
        "liberty",
        "equality",
        "race",
        "sfhr",
        "cooper",
        "state",
        "thus",
        "friend",
        "black",
        "profited",
        "admission",
        "deputy",
        "santo",
        "domingo",
        "draw",
        "attention",
        "toward",
        "great",
        "problem",
        "equality",
        "race",
        "concurrent",
        "problem",
        "suppression",
        "slavery",
        "sfhr",
        "another",
        "outcome",
        "debate",
        "question",
        "principle",
        "colonial",
        "representationthe",
        "idea",
        "colony",
        "part",
        "national",
        "territory",
        "france",
        "land",
        "exploited",
        "sfhr",
        "chapter",
        "two",
        "cooper",
        "describes",
        "formation",
        "american",
        "colonist",
        "a",
        "committee",
        "colored",
        "men",
        "organized",
        "elder",
        "raimond",
        "jacques",
        "vincent",
        "ogé",
        "sfhr",
        "sought",
        "admission",
        "deputy",
        "represent",
        "constituent",
        "assembly",
        "demanded",
        "absolute",
        "equality",
        "colored",
        "men",
        "free",
        "negro",
        "white",
        "colonist",
        "sfhr",
        "reopened",
        "debate",
        "problem",
        "equality",
        "race",
        "colony",
        "raised",
        "graver",
        "question",
        "abolition",
        "trade",
        "slavery",
        "sfhr",
        "addition",
        "considering",
        "fate",
        "black",
        "also",
        "event",
        "revolution",
        "france",
        "including",
        "bastille",
        "declaration",
        "right",
        "man",
        "citizen",
        "height",
        "reign",
        "terror",
        "sfhr",
        "cooper",
        "asserts",
        "certain",
        "white",
        "adopted",
        "conciliatory",
        "attitude",
        "toward",
        "free",
        "mulatto",
        "many",
        "disaster",
        "could",
        "avoided",
        "sfhr",
        "colonist",
        "joined",
        "force",
        "massiac",
        "club",
        "prevent",
        "emancipation",
        "slave",
        "establish",
        "force",
        "colony",
        "could",
        "resist",
        "legislation",
        "slavery",
        "result",
        "part",
        "establishment",
        "colonial",
        "committee",
        "would",
        "centralize",
        "colonial",
        "question",
        "hand",
        "remove",
        "friend",
        "black",
        "sfhr",
        "cooper",
        "clear",
        "financial",
        "concern",
        "outweighed",
        "ideal",
        "freedom",
        "racial",
        "equality",
        "argues",
        "establishment",
        "colonial",
        "committee",
        "indicative",
        "necessity",
        "slow",
        "revolutionary",
        "moment",
        "menacing",
        "whole",
        "west",
        "indie",
        "coupled",
        "desire",
        "protect",
        "financial",
        "interest",
        "national",
        "wealth",
        "france",
        "insofar",
        "trade",
        "santo",
        "domingo",
        "represented",
        "two",
        "third",
        "total",
        "trade",
        "france",
        "sfhr",
        "friend",
        "black",
        "prepared",
        "sacrifice",
        "everything",
        "success",
        "cause",
        "massaic",
        "club",
        "colonialist",
        "dedicated",
        "detestable",
        "cause",
        "sfhr",
        "barnave",
        "presented",
        "decree",
        "march",
        "contained",
        "principle",
        "colony",
        "provide",
        "constitution",
        "thereby",
        "ending",
        "arbitrary",
        "administration",
        "colonist",
        "demanded",
        "independence",
        "without",
        "making",
        "distinction",
        "white",
        "colored",
        "men",
        "without",
        "even",
        "mentioning",
        "one",
        "contented",
        "famous",
        "article",
        "iv",
        "conferring",
        "civil",
        "right",
        "upon",
        "property",
        "owner",
        "twentyfive",
        "year",
        "age",
        "possessed",
        "real",
        "estate",
        "lacking",
        "property",
        "domiciled",
        "contributed",
        "parish",
        "two",
        "year",
        "sfhr",
        "cooper",
        "note",
        "ambiguity",
        "article",
        "allowed",
        "landholding",
        "mulatto",
        "hope",
        "civil",
        "right",
        "applied",
        "without",
        "assuring",
        "benefit",
        "sfhr",
        "furthermore",
        "colored",
        "men",
        "paris",
        "alarmed",
        "silence",
        "decree",
        "particular",
        "right",
        "mulatto",
        "seeking",
        "right",
        "white",
        "black",
        "would",
        "go",
        "claim",
        "right",
        "mulatto",
        "result",
        "decree",
        "resistance",
        "insurrection",
        "spite",
        "measure",
        "cooper",
        "note",
        "vain",
        "constituent",
        "assembly",
        "colonial",
        "committee",
        "hoped",
        "save",
        "colony",
        "danger",
        "insurrection",
        "sfhr",
        "decree",
        "may",
        "accorded",
        "political",
        "right",
        "mulatto",
        "born",
        "free",
        "parent",
        "recognizing",
        "active",
        "citizen",
        "defeat",
        "colonist",
        "yet",
        "refused",
        "comply",
        "sfhr",
        "white",
        "colonist",
        "revolted",
        "decree",
        "retracted",
        "though",
        "altogether",
        "annulled",
        "friend",
        "black",
        "jacobin",
        "club",
        "brought",
        "closer",
        "together",
        "third",
        "chapter",
        "cooper",
        "document",
        "various",
        "civil",
        "commission",
        "sent",
        "santo",
        "domingo",
        "along",
        "resulting",
        "report",
        "decree",
        "followed",
        "visit",
        "white",
        "colonist",
        "continued",
        "act",
        "open",
        "opposition",
        "semblance",
        "political",
        "equality",
        "feared",
        "might",
        "also",
        "lead",
        "social",
        "equality",
        "mulatto",
        "sfhr",
        "note",
        "april",
        "th",
        "new",
        "national",
        "law",
        "annulled",
        "constitutional",
        "decree",
        "september",
        "th",
        "conferred",
        "upon",
        "colored",
        "men",
        "free",
        "negro",
        "equal",
        "political",
        "right",
        "white",
        "ordered",
        "new",
        "election",
        "accord",
        "principle",
        "equality",
        "colonial",
        "parochial",
        "assembly",
        "reinvigorated",
        "enforce",
        "new",
        "law",
        "ssembly",
        "provided",
        "appointment",
        "three",
        "new",
        "civil",
        "commissioner",
        "dictatorial",
        "power",
        "supported",
        "sufficient",
        "military",
        "force",
        "sfhr",
        "time",
        "commissioner",
        "let",
        "black",
        "wished",
        "emancipation",
        "proclaimed",
        "west",
        "south",
        "negro",
        "everywhere",
        "refused",
        "work",
        "economic",
        "condition",
        "worsened",
        "extent",
        "insubordination",
        "increased",
        "sfhr",
        "examining",
        "correspondence",
        "particular",
        "period",
        "cooper",
        "note",
        "description",
        "insurrection",
        "loss",
        "property",
        "seemingly",
        "secondary",
        "attention",
        "question",
        "slavery",
        "asserts",
        "thus",
        "find",
        "one",
        "argument",
        "support",
        "idea",
        "inevitably",
        "grows",
        "stronger",
        "one",
        "read",
        "many",
        "convincing",
        "document",
        "question",
        "emancipation",
        "slave",
        "considered",
        "embraced",
        "enthusiast",
        "idealist",
        "like",
        "brissot",
        "friendswho",
        "seen",
        "problem",
        "resolved",
        "humanity",
        "theory",
        "fact",
        "thorough",
        "practical",
        "preparation",
        "necessary",
        "sfhr",
        "cooper",
        "also",
        "outline",
        "event",
        "leading",
        "rise",
        "power",
        "toussaint",
        "louverture",
        "describes",
        "grand",
        "figure",
        "intelligent",
        "capable",
        "endowed",
        "strong",
        "personality",
        "towered",
        "companion",
        "sfhr",
        "leader",
        "able",
        "see",
        "foresee",
        "louverture",
        "sent",
        "sonthoax",
        "back",
        "france",
        "followed",
        "hédouville",
        "raimond",
        "campaign",
        "rigaurd",
        "power",
        "louverture",
        "facilitated",
        "massacre",
        "mulatto",
        "north",
        "eventually",
        "made",
        "master",
        "spanish",
        "territory",
        "sfhr",
        "expecting",
        "strong",
        "response",
        "france",
        "napoleon",
        "louverture",
        "forced",
        "black",
        "back",
        "work",
        "increase",
        "prosperity",
        "island",
        "permitted",
        "revolt",
        "finishing",
        "insurrectionist",
        "swiftly",
        "sfhr",
        "end",
        "louverture",
        "would",
        "sent",
        "france",
        "died",
        "april",
        "napoleon",
        "went",
        "reestablish",
        "slavery",
        "slave",
        "trade",
        "french",
        "colony",
        "cooper",
        "observes",
        "truth",
        "seems",
        "napoleon",
        "never",
        "gave",
        "absent",
        "minded",
        "thought",
        "obviously",
        "complicated",
        "problem",
        "presented",
        "distant",
        "island",
        "sfhr",
        "new",
        "war",
        "extermination",
        "broke",
        "last",
        "vestige",
        "white",
        "race",
        "santo",
        "domingo",
        "sfhr",
        "louverture",
        "successor",
        "dessallines",
        "declared",
        "island",
        "independent",
        "restored",
        "indian",
        "name",
        "haiti",
        "would",
        "longer",
        "reminder",
        "european",
        "occupation",
        "sfhr",
        "conclusion",
        "cooper",
        "reflects",
        "various",
        "factor",
        "complicated",
        "entire",
        "situation",
        "economic",
        "condition",
        "revolutionary",
        "france",
        "issue",
        "slavery",
        "problem",
        "racea",
        "problem",
        "simply",
        "black",
        "white",
        "also",
        "involved",
        "intermediate",
        "mulatto",
        "finally",
        "political",
        "problem",
        "sfhr",
        "cooper",
        "describes",
        "political",
        "problem",
        "way",
        "change",
        "regime",
        "accepted",
        "distant",
        "country",
        "understood",
        "majority",
        "colonist",
        "remained",
        "royalist",
        "black",
        "war",
        "party",
        "added",
        "war",
        "race",
        "sfhr"
    ]
}