{
    "main_text": "Epistemology\n3. Epistemology\n\n\nAcademic skepticism arose out of the debate, initiated by Arcesilaus,\nabout the nature and possibility of knowledge between the Academy and\nrival schools of philosophy, chiefly the Stoics. The Academy’s method\nof argument was, in the first instance at least, dialectical. Their\nmodel was Socrates as depicted in Plato’s Socratic dialogues, where he\nputs questions to his interlocutors and deduces conclusions unwelcome\nto them from their replies. Following Socrates’ example, the Academics\ntook their premises from the doctrines of their Stoic opponents or\nfrom assumptions that the Stoics could reject only at a high cost in\nplausibility. By arguing in this way, the Academics hoped to enhance\ntheir and their opponents’ understanding of the issues and, if\npossible, to progress towards the discovery of the truth that would\nresolve the question in contention. The difficulties that the\nAcademics uncovered in this way were, then, in large part internal to\ntheir interlocutors’ position, and, in drawing them out, the Academics\ndid not necessarily commit themselves to a position of their own.\n\n\nStoic epistemology attempts to show how it is possible for human\nbeings to attain wisdom, which the Stoics take to be a condition\nentirely free of opinion, i.e., false or insecure judgment (see the \nsection on Logic in the entry on\n Stoicism).  For this to be possible, they\nmaintain, there must be a criterion of truth (see Striker 1990). In\ntheir theory, it is what they called a cognitive impression that plays\nthis part.  This they define as an impression from what is, stamped\nand impressed in exact accordance with what is, and such as could not\nbe from what is not (cf. Annas 1990, Frede 1999, Sedley 2002).\nCognitive impressions, then, are true impressions which are, in\naddition, distinguished by a special character belongs only to true\nimpressions (though not to all of them) and which enables human beings\nto discriminate cognitive from non-cognitive impressions. In the\nparadigm case, which the definition has in view, cognitive impressions\nare perceptual, but in a broader sense of the term, non-perceptual\nimpressions that afford an equally secure grasp of their contents can\nalso be called cognitive. According to the Stoics, by confining assent\nto cognitive impressions, it is possible to avoid error entirely.\n\n\nThe existence of the special character alleged to distinguish\ncognitive impressions from other impressions was the principal target\nof the Academics’ arguments (see Section 3 of the entry on\n Carneades). \n If such impressions do not exist, it follows immediately in the\ncontext of Stoic epistemology that nothing can be known. On the basis\nof this result and the Stoic doctrine that the wise, i.e., human\nbeings as they ought to be, do not hold (mere) opinions\n(S.E. M 7.155–7), the Academics went on to argue that one\nought to suspend judgement about all matters.\n\n\nThese two doctrines—that nothing can be known, or a claim\nthat implied it in the Stoic context, and that one ought to suspend\njudgment—make up the skeptical Academic position, in the sense\nof the position put forward and defended by Academics if not\nnecessarily endorsed by them. The Stoics, followed by Antiochus in his\ndogmatic phase, argued that this position is self-refuting since to\nadopt a position is to assent to its component doctrines and assent is\nimpossible without taking oneself to know. The Stoics also argued,\nagain followed by Antiochus, that the skepticism called for by the\nAcademics’ arguments was a practical impossibility since action\nis impossible without assent.\n\n\nEven though, as previously noted, the Academics were not necessarily\ncommitted to the skeptical position, they defended the possibility of\na life of committed skepticism in order to prevent the Stoics from\nescaping the difficulties raised for their position indirectly by\nmeans of these anti-skeptical arguments.  Arcesilaus made a start, but\nit was Carneades, his successor in the 2nd century B.C.E., who did the\nmost, and who was responsible for the version of the defense with\nwhich Antiochus was familiar.\n\n\nCarneades argued that, in the absence of cognitive impressions, a\nbasis for action and inquiry could be found in so-called probable\nimpressions (from probabilis, meaning that which lends itself\nto or invites approval, Cicero’s Latin for the Greek\npithanos, meaning persuasive) (see Section 3 of the entry\n on Carneades).\n \n\n\nBuilding on this account of probable impressions, Carneades defended\ntwo views about assent. According to one proposal, the wise\nperson will always withhold assent, but will be able to act and\ninquire by following or using probable impressions in a way that does\nnot amount to assent, and so does not involve holding opinions about\nanything (Acad. 2.59, 99, 108). According to the second, the\nwise person will assent to what is probable and so form opinions, but\nprovisionally and on the understanding that he may be wrong\n(Acad. 2.59, 67, 78, 112).\n\n\nIt is a matter of controversy whether Carneades went beyond putting\nthese views forward for the sake of argument and actually subscribed\nto one of them. It appears, however, that some of his successors\nendorsed one or both of the skeptical doctrines. One tendency, led by\nClitomachus, Carneades’ student and eventual successor as scholarch,\nfavored what we may call a radical skeptical position embracing both\ndoctrines. Though Clitomachus rejected assent, he accepted Carneades’\nproposal that we could follow or use impressions without assenting to\nthem and adopted this attitude toward, among other impressions, the\nskeptical doctrines that nothing can be known and that one ought\ntherefore suspend judgment (Acad. 2.109–10). The other\ntendency endorsed a moderate or mitigated form of skepticism. Though\nit accepted the first skeptical doctrine, namely that nothing can be\nknown, this tendency permitted the wise to form opinions by assenting\nto non-cognitive impressions so long as they are sufficiently probable\nand the assent given to them is bestowed in the provisional spirit of\nCarneades’ second proposal. And this tendency took the opinion that\nnothing can be known to be among the impressions to which one should\nassent in this way. The appearance of paradox dissolves when one\nrealizes that in accepting that one does not know anything one is not\ntaking oneself to know this, but only opining that it is highly\nprobable. The most prominent proponent of this view was Antiochus’\nteacher, Philo, and it is this mitigated form of Academic skepticism\nthat Antiochus defended before his conversion to dogmatism.\n\n\nWe are informed about Antiochus’ case against Academic\nskepticism by Cicero’s Academica, substantial parts of which\nhave survived intact. Antiochus seems to have followed the Stoics, who\nproduced a substantial literature defending their position and\nattacking the Academy’s probabilistic alternative, but also to have\nadded some elements of his own to the argument (cf. Striker 1997). He\ndefended the veracity of the senses. He seems to have argued that in\norder even to possess a concept of the truth we must indisputably\napprehend some truths in a way that is possible only if there are\ncognitive impressions (Acad. 2.33). He argued that probable\nimpressions are a wholly inadequate substitute for cognitive\nimpressions (Acad. 2.35–6), so that the charge that by\nabolishing the cognitive impression (as they think) the Academics\ndeprive human beings of a basis for action stands\n(Acad. 2.31, 33, 54, 62, 102–3, 110). And he argued that, in\nmaintaining the skeptical position, the Academics must take themselves\nto know at least one thing, viz., that nothing can be known\n(Acad. 2.28–9, 109; cf.  Burnyeat 1997).\n\n\nThere is one more twist in the story, however. After removing to Rome,\nPhilo published a pair of books – the so-called Roman Books –\nwhich, when they came to Antiochus’ attention in Alexandria, seemed to\nhim to represent a radical and intellectually untenable departure from\nhis teacher’s previous position. This was the occasion for\nthe Sosus, which contained a stinging riposte to Philo’s new\nideas. In opposition to Antiochus’ view that there were two Academies,\nan Old and a New, Philo maintained that there had only ever been\none. But he now held that the Academics from Plato to Philo himself\nwere not united by their skepticism, as we have seen some Academics\nbelieved. Rather they had never been skeptics because they had never\nmeant to challenge the possibility of knowledge. Philo did not deny\nthat Arcesilaus and Carneades had argued against the existence of\ncognitive impressions. Rather, he now maintained that these arguments\nshowed, and were always intended to show, not that cognition or\napprehension is impossible, but that it is impossible on the Stoic\nconception of apprehension, which is therefore mistaken\n(Acad. 2.18; S.E. PH 1.235).\n\n\nPhilo’s Roman innovation, then, was to reject the Stoic account of\nknowledge while continuing to accept his predecessors’ arguments that\nthe requirement that cognitive impressions be set apart from other\nimpressions by a special character cannot be satisfied (cf. Barnes\n1989, 70–76).  For there to be knowledge, he now held, it was\nenough that there be impressions which are true and accurately formed\n(Cicero Acad. 2.18). It is not hard to see why Antiochus was\ndisturbed, for, if this is right, Philo was the legitimate heir of a\nsingle unbroken Academic tradition stretching back to Plato in which\nthere was no place for alien Stoic doctrines. Cicero, who is our\nprincipal source, chose not to recount the details of this controversy\n(Acad. 2.12). But we know that Antiochus argued that, by\nabandoning the full Stoic account of cognition and its commitment to\ncognitive impressions satisfying the complete Stoic definition, Philo\nsucceeded only in bringing about the result he most wanted to avoid,\nnamely that knowledge is impossible (Acad. 2.18). Presumably\nAntiochus drew on the case he had already brought against Academic\nprobabilism to argue that impressions which fail to satisfy the full\nStoic definition of the cognitive impression cannot provide a basis\nfor judgment of any kind let alone judgments of the kind that deserve\nto be called knowledge.\n",
    "section_title": "3. Epistemology",
    "entry_title": "Antiochus of Ascalon",
    "hierarchy_title": "Antiochus of Ascalon || Epistemology",
    "tokenized_text": [
        "epistemology",
        "epistemology",
        "academic",
        "skepticism",
        "arose",
        "debate",
        "initiated",
        "arcesilaus",
        "nature",
        "possibility",
        "knowledge",
        "academy",
        "rival",
        "school",
        "philosophy",
        "chiefly",
        "stoic",
        "academy",
        "method",
        "argument",
        "first",
        "instance",
        "least",
        "dialectical",
        "model",
        "socrates",
        "depicted",
        "plato",
        "socratic",
        "dialogue",
        "put",
        "question",
        "interlocutor",
        "deduces",
        "conclusion",
        "unwelcome",
        "reply",
        "following",
        "socrates",
        "example",
        "academic",
        "took",
        "premise",
        "doctrine",
        "stoic",
        "opponent",
        "assumption",
        "stoic",
        "could",
        "reject",
        "high",
        "cost",
        "plausibility",
        "arguing",
        "way",
        "academic",
        "hoped",
        "enhance",
        "opponent",
        "understanding",
        "issue",
        "possible",
        "progress",
        "towards",
        "discovery",
        "truth",
        "would",
        "resolve",
        "question",
        "contention",
        "difficulty",
        "academic",
        "uncovered",
        "way",
        "large",
        "part",
        "internal",
        "interlocutor",
        "position",
        "drawing",
        "academic",
        "necessarily",
        "commit",
        "position",
        "stoic",
        "epistemology",
        "attempt",
        "show",
        "possible",
        "human",
        "being",
        "attain",
        "wisdom",
        "stoic",
        "take",
        "condition",
        "entirely",
        "free",
        "opinion",
        "ie",
        "false",
        "insecure",
        "judgment",
        "see",
        "section",
        "logic",
        "entry",
        "stoicism",
        "possible",
        "maintain",
        "must",
        "criterion",
        "truth",
        "see",
        "striker",
        "theory",
        "called",
        "cognitive",
        "impression",
        "play",
        "part",
        "define",
        "impression",
        "stamped",
        "impressed",
        "exact",
        "accordance",
        "could",
        "cf",
        "anna",
        "frede",
        "sedley",
        "cognitive",
        "impression",
        "true",
        "impression",
        "addition",
        "distinguished",
        "special",
        "character",
        "belongs",
        "true",
        "impression",
        "though",
        "enables",
        "human",
        "being",
        "discriminate",
        "cognitive",
        "noncognitive",
        "impression",
        "paradigm",
        "case",
        "definition",
        "view",
        "cognitive",
        "impression",
        "perceptual",
        "broader",
        "sense",
        "term",
        "nonperceptual",
        "impression",
        "afford",
        "equally",
        "secure",
        "grasp",
        "content",
        "also",
        "called",
        "cognitive",
        "according",
        "stoic",
        "confining",
        "assent",
        "cognitive",
        "impression",
        "possible",
        "avoid",
        "error",
        "entirely",
        "existence",
        "special",
        "character",
        "alleged",
        "distinguish",
        "cognitive",
        "impression",
        "impression",
        "principal",
        "target",
        "academic",
        "argument",
        "see",
        "section",
        "entry",
        "carneades",
        "impression",
        "exist",
        "follows",
        "immediately",
        "context",
        "stoic",
        "epistemology",
        "nothing",
        "known",
        "basis",
        "result",
        "stoic",
        "doctrine",
        "wise",
        "ie",
        "human",
        "being",
        "ought",
        "hold",
        "mere",
        "opinion",
        "se",
        "academic",
        "went",
        "argue",
        "one",
        "ought",
        "suspend",
        "judgement",
        "matter",
        "two",
        "doctrinesthat",
        "nothing",
        "known",
        "claim",
        "implied",
        "stoic",
        "context",
        "one",
        "ought",
        "suspend",
        "judgmentmake",
        "skeptical",
        "academic",
        "position",
        "sense",
        "position",
        "put",
        "forward",
        "defended",
        "academic",
        "necessarily",
        "endorsed",
        "stoic",
        "followed",
        "antiochus",
        "dogmatic",
        "phase",
        "argued",
        "position",
        "selfrefuting",
        "since",
        "adopt",
        "position",
        "assent",
        "component",
        "doctrine",
        "assent",
        "impossible",
        "without",
        "taking",
        "oneself",
        "know",
        "stoic",
        "also",
        "argued",
        "followed",
        "antiochus",
        "skepticism",
        "called",
        "academic",
        "argument",
        "practical",
        "impossibility",
        "since",
        "action",
        "impossible",
        "without",
        "assent",
        "even",
        "though",
        "previously",
        "noted",
        "academic",
        "necessarily",
        "committed",
        "skeptical",
        "position",
        "defended",
        "possibility",
        "life",
        "committed",
        "skepticism",
        "order",
        "prevent",
        "stoic",
        "escaping",
        "difficulty",
        "raised",
        "position",
        "indirectly",
        "mean",
        "antiskeptical",
        "argument",
        "arcesilaus",
        "made",
        "start",
        "carneades",
        "successor",
        "nd",
        "century",
        "bce",
        "responsible",
        "version",
        "defense",
        "antiochus",
        "familiar",
        "carneades",
        "argued",
        "absence",
        "cognitive",
        "impression",
        "basis",
        "action",
        "inquiry",
        "could",
        "found",
        "socalled",
        "probable",
        "impression",
        "probabilis",
        "meaning",
        "lends",
        "invite",
        "approval",
        "cicero",
        "latin",
        "greek",
        "pithanos",
        "meaning",
        "persuasive",
        "see",
        "section",
        "entry",
        "carneades",
        "building",
        "account",
        "probable",
        "impression",
        "carneades",
        "defended",
        "two",
        "view",
        "assent",
        "according",
        "one",
        "proposal",
        "wise",
        "person",
        "always",
        "withhold",
        "assent",
        "able",
        "act",
        "inquire",
        "following",
        "using",
        "probable",
        "impression",
        "way",
        "amount",
        "assent",
        "involve",
        "holding",
        "opinion",
        "anything",
        "acad",
        "according",
        "second",
        "wise",
        "person",
        "assent",
        "probable",
        "form",
        "opinion",
        "provisionally",
        "understanding",
        "may",
        "wrong",
        "acad",
        "matter",
        "controversy",
        "whether",
        "carneades",
        "went",
        "beyond",
        "putting",
        "view",
        "forward",
        "sake",
        "argument",
        "actually",
        "subscribed",
        "one",
        "appears",
        "however",
        "successor",
        "endorsed",
        "one",
        "skeptical",
        "doctrine",
        "one",
        "tendency",
        "led",
        "clitomachus",
        "carneades",
        "student",
        "eventual",
        "successor",
        "scholarch",
        "favored",
        "may",
        "call",
        "radical",
        "skeptical",
        "position",
        "embracing",
        "doctrine",
        "though",
        "clitomachus",
        "rejected",
        "assent",
        "accepted",
        "carneades",
        "proposal",
        "could",
        "follow",
        "use",
        "impression",
        "without",
        "assenting",
        "adopted",
        "attitude",
        "toward",
        "among",
        "impression",
        "skeptical",
        "doctrine",
        "nothing",
        "known",
        "one",
        "ought",
        "therefore",
        "suspend",
        "judgment",
        "acad",
        "tendency",
        "endorsed",
        "moderate",
        "mitigated",
        "form",
        "skepticism",
        "though",
        "accepted",
        "first",
        "skeptical",
        "doctrine",
        "namely",
        "nothing",
        "known",
        "tendency",
        "permitted",
        "wise",
        "form",
        "opinion",
        "assenting",
        "noncognitive",
        "impression",
        "long",
        "sufficiently",
        "probable",
        "assent",
        "given",
        "bestowed",
        "provisional",
        "spirit",
        "carneades",
        "second",
        "proposal",
        "tendency",
        "took",
        "opinion",
        "nothing",
        "known",
        "among",
        "impression",
        "one",
        "assent",
        "way",
        "appearance",
        "paradox",
        "dissolve",
        "one",
        "realizes",
        "accepting",
        "one",
        "know",
        "anything",
        "one",
        "taking",
        "oneself",
        "know",
        "opining",
        "highly",
        "probable",
        "prominent",
        "proponent",
        "view",
        "antiochus",
        "teacher",
        "philo",
        "mitigated",
        "form",
        "academic",
        "skepticism",
        "antiochus",
        "defended",
        "conversion",
        "dogmatism",
        "informed",
        "antiochus",
        "case",
        "academic",
        "skepticism",
        "cicero",
        "academica",
        "substantial",
        "part",
        "survived",
        "intact",
        "antiochus",
        "seems",
        "followed",
        "stoic",
        "produced",
        "substantial",
        "literature",
        "defending",
        "position",
        "attacking",
        "academy",
        "probabilistic",
        "alternative",
        "also",
        "added",
        "element",
        "argument",
        "cf",
        "striker",
        "defended",
        "veracity",
        "sens",
        "seems",
        "argued",
        "order",
        "even",
        "posse",
        "concept",
        "truth",
        "must",
        "indisputably",
        "apprehend",
        "truth",
        "way",
        "possible",
        "cognitive",
        "impression",
        "acad",
        "argued",
        "probable",
        "impression",
        "wholly",
        "inadequate",
        "substitute",
        "cognitive",
        "impression",
        "acad",
        "charge",
        "abolishing",
        "cognitive",
        "impression",
        "think",
        "academic",
        "deprive",
        "human",
        "being",
        "basis",
        "action",
        "stand",
        "acad",
        "argued",
        "maintaining",
        "skeptical",
        "position",
        "academic",
        "must",
        "take",
        "know",
        "least",
        "one",
        "thing",
        "viz",
        "nothing",
        "known",
        "acad",
        "cf",
        "burnyeat",
        "one",
        "twist",
        "story",
        "however",
        "removing",
        "rome",
        "philo",
        "published",
        "pair",
        "book",
        "socalled",
        "roman",
        "book",
        "came",
        "antiochus",
        "attention",
        "alexandria",
        "seemed",
        "represent",
        "radical",
        "intellectually",
        "untenable",
        "departure",
        "teacher",
        "previous",
        "position",
        "occasion",
        "sosus",
        "contained",
        "stinging",
        "riposte",
        "philo",
        "new",
        "idea",
        "opposition",
        "antiochus",
        "view",
        "two",
        "academy",
        "old",
        "new",
        "philo",
        "maintained",
        "ever",
        "one",
        "held",
        "academic",
        "plato",
        "philo",
        "united",
        "skepticism",
        "seen",
        "academic",
        "believed",
        "rather",
        "never",
        "skeptic",
        "never",
        "meant",
        "challenge",
        "possibility",
        "knowledge",
        "philo",
        "deny",
        "arcesilaus",
        "carneades",
        "argued",
        "existence",
        "cognitive",
        "impression",
        "rather",
        "maintained",
        "argument",
        "showed",
        "always",
        "intended",
        "show",
        "cognition",
        "apprehension",
        "impossible",
        "impossible",
        "stoic",
        "conception",
        "apprehension",
        "therefore",
        "mistaken",
        "acad",
        "se",
        "ph",
        "philo",
        "roman",
        "innovation",
        "reject",
        "stoic",
        "account",
        "knowledge",
        "continuing",
        "accept",
        "predecessor",
        "argument",
        "requirement",
        "cognitive",
        "impression",
        "set",
        "apart",
        "impression",
        "special",
        "character",
        "satisfied",
        "cf",
        "barnes",
        "knowledge",
        "held",
        "enough",
        "impression",
        "true",
        "accurately",
        "formed",
        "cicero",
        "acad",
        "hard",
        "see",
        "antiochus",
        "disturbed",
        "right",
        "philo",
        "legitimate",
        "heir",
        "single",
        "unbroken",
        "academic",
        "tradition",
        "stretching",
        "back",
        "plato",
        "place",
        "alien",
        "stoic",
        "doctrine",
        "cicero",
        "principal",
        "source",
        "chose",
        "recount",
        "detail",
        "controversy",
        "acad",
        "know",
        "antiochus",
        "argued",
        "abandoning",
        "full",
        "stoic",
        "account",
        "cognition",
        "commitment",
        "cognitive",
        "impression",
        "satisfying",
        "complete",
        "stoic",
        "definition",
        "philo",
        "succeeded",
        "bringing",
        "result",
        "wanted",
        "avoid",
        "namely",
        "knowledge",
        "impossible",
        "acad",
        "presumably",
        "antiochus",
        "drew",
        "case",
        "already",
        "brought",
        "academic",
        "probabilism",
        "argue",
        "impression",
        "fail",
        "satisfy",
        "full",
        "stoic",
        "definition",
        "cognitive",
        "impression",
        "provide",
        "basis",
        "judgment",
        "kind",
        "let",
        "alone",
        "judgment",
        "kind",
        "deserve",
        "called",
        "knowledge"
    ]
}