{
    "main_text": "Morality\n5. Morality\n\n\nRosmini’s ethical philosophy springs directly from the analysis\nsummarised in the previous section. For him, ‘the human being is a\nknowing and feeling subject whose will, as supreme principle of\nactivity, provides the basis of the incommunicable individuality that\nconstitutes each real human nature as a person’ (Life, p.\n26). ‘Person’, as supreme principle, is also the subject of\nmoral activity, and is to be distinguished from all those habits and\nacts within human beings which take place without the necessary\nintervention of the person or, at most, effect the person indirectly.\nFor example, a good pianist is not necessarily a good person. Morality\ndeals necessarily with what people do as persons, with what affects\nthemselves as subjects who cannot step aside from the truth they know\nwithout violating their adherence to truth. Rosmini deals with ethics,\nthe science of morality, in his Principles of Ethics and in\nComparative and Critical History of Systems dealing with the\nPrinciple of Morality. The History first offers an\noverview of systems which throughout history deny morality, or make it\nimpossible, or provide it with a subjective foundation. It then moves\non to summarise the objective view expressed by philosophers and\ndeveloped by Rosmini in Principles of Ethics .\n5.1 Moral Obligation\n\n\nThis view, as stated by Rosmini, depends upon what he sees as a\nself-evident principle that cannot be denied by any sane person. We are\nbound, he says, to acknowledge (recognise) what we know for what we\nknow it to be. Granted that knowledge, according to Rosmini, is\nco-terminus with truth, never with error, it is clear that Rosmini’s\naffirmation depends upon the self-evident need to affirm what one\nknows. This, in turn, is an act by which the human subject is elevated,\nat a reflective level, to the level of the truth which, already known\nin the essential idea of being, is as sublime as being itself. On the\nother hand, to deny what one knows is equivalent to stepping into\nnon-being, the antithesis of dignity. In more philosophical terms,\nRosmini maintains that the principle he enunciates, in which every\nother moral dictate is implicitly included, may be characterised as\nfollows: it expresses moral essence because it calls for agreement\nbetween the intellective act of the will and the ideal and real\nentities of things known; it is simple and as such able to be\nparticipated by every moral activity; it is evident because it is\nnothing more than an expression of the principle of contradiction; it\nis universal because all moral effects, denoted through external\nactions, depend upon it; it is supreme because it offers no possibility\nof further investigation; it provides the foundation for the\nrecognition of the human subject as an essentially moral being, that\nis, one who, through the innate presence of the idea of being and the\nprinciple of will, is furnished with the object of morality and\nessential adherence to it. Finally, Rosmini’s distinction between the\nsubject and object of morality opens a way, according to him, between\nthe extremes of ethical theory. On the one hand, the limitation of the\nhuman subject provides for the possibility of moral error; on the\nother, the necessity and immutability of the object, the idea of being,\nfurnish morality with its undeniable sense of obligation. It is a fatal\nbut all too frequent mistake, Rosmini contends, to attribute\ncharacteristics proper to the subject (fallibility, error, and so on)\nto the object, and characteristics of the object (necessity,\nimmutability and so on) to the subject.\n5.2 Moral Good\n\n\nA way is now present to describe adequately the nature of moral good\nas opposed to eudemonological good. That which is good is desirable,\nbut what is desirable may either be desirable in itself, that is, as it\nstands in the order of being, or simply desirable in so far it is good,\nor imagined as good, for the individual. Moral good, says Rosmini, is\nfound when the will adheres to what is good according to the order of\nbeing; eudemonological or utilitarian good is what is desired as good\nfor the individual, without reference to what is good in itself. Human\ndignity is preserved only when, through an act of will, individuals\nadhering in practice to beings as they are in their order, implicitly\nadhere to the whole of being and to their presence in that order.\nImmorality, by which entities are appreciated or desired but not in\ntheir known order and thus not as they are, implies an essential\nrebellion against the order of being and thus against being itself.\nSelf-imposed human indignity can go no lower than this.\n5.3 Conscience\n\n\nHaving dealt with the nature of morality and moral obligation,\nRosmini turns his attention to conscience. He himself admits that such\na treatise is almost universally neglected by philosophers, and feels\nhimself constrained to justify such a study, which he undertakes with\nan almost inevitable admixture of religious and theological elements.\nNevertheless, it is not difficult to filter the philosophical\nprinciples in his work from characteristics proper to the faith he\nprofesses. This is especially apparent in his approach to the nature of\nconscience, an area in which his views first prompted the dissension’s\nbetween him and some of his co-religionists that would go on until the\nend of his life. Rosmini defines conscience as a ‘speculative\njudgement that a person makes about the morality of his practical\njudgement’ (C19), that is, a judgement by which\nindividuals come to know the moral value of their actions without\nnecessarily acting upon it.\n\n\nSeveral consequences can be drawn from this. First, morality in the\nindividual is prior to conscience, and can be present without\nconscience; second, conscience can be mistaken (it is possible to form\na incorrect notion of the moral value of one’s own action); third, it\ndoes not follow that conscience, once formed, will give rise to action\nin the person who forms it; fourth, conscience, if incorrect in its\njudgement, must as far as possible be reformed. Conscience, therefore,\nis only an adequate guide to morality when it provides accurate\ninformation of the moral state of a subject’s past, present or future\naction. In the light of these affirmations, it is possible to see how\nRosmini lays the groundwork for overcoming the dilemma posed by the\nquestion: must conscience always be followed? While it is certain that\nthe dictates of conscience can never be morally disregarded, it is\nequally certain that a deliberately misleading act of conscience cannot\nmorally be followed. Sometimes, therefore, it will be morally\nimperative to correct conscience, which is always possible through\nproper reflection on the moral value of the human act posited or about\nto be posited by the individual. Rosmini goes on to distinguish between\nproblems about conscience and problems connected with the formation of\nconscience. In fact, conscience, according to him, is not present as\nlong as judgement is suspended about the moral value of an individual’s\nown action. Difficulties at this point are connected with the formation\nof the judgement, not with the judgement itself.\n",
    "section_title": "5. Morality",
    "entry_title": "Antonio Rosmini",
    "hierarchy_title": "Antonio Rosmini || Morality",
    "tokenized_text": [
        "morality",
        "morality",
        "rosmini",
        "ethical",
        "philosophy",
        "spring",
        "directly",
        "analysis",
        "summarised",
        "previous",
        "section",
        "human",
        "knowing",
        "feeling",
        "subject",
        "whose",
        "supreme",
        "principle",
        "activity",
        "provides",
        "basis",
        "incommunicable",
        "individuality",
        "constitutes",
        "real",
        "human",
        "nature",
        "person",
        "life",
        "p",
        "person",
        "supreme",
        "principle",
        "also",
        "subject",
        "moral",
        "activity",
        "distinguished",
        "habit",
        "act",
        "within",
        "human",
        "being",
        "take",
        "place",
        "without",
        "necessary",
        "intervention",
        "person",
        "effect",
        "person",
        "indirectly",
        "example",
        "good",
        "pianist",
        "necessarily",
        "good",
        "person",
        "morality",
        "deal",
        "necessarily",
        "people",
        "person",
        "affect",
        "subject",
        "step",
        "aside",
        "truth",
        "know",
        "without",
        "violating",
        "adherence",
        "truth",
        "rosmini",
        "deal",
        "ethic",
        "science",
        "morality",
        "principle",
        "ethic",
        "comparative",
        "critical",
        "history",
        "system",
        "dealing",
        "principle",
        "morality",
        "history",
        "first",
        "offer",
        "overview",
        "system",
        "throughout",
        "history",
        "deny",
        "morality",
        "make",
        "impossible",
        "provide",
        "subjective",
        "foundation",
        "move",
        "summarise",
        "objective",
        "view",
        "expressed",
        "philosopher",
        "developed",
        "rosmini",
        "principle",
        "ethic",
        "moral",
        "obligation",
        "view",
        "stated",
        "rosmini",
        "depends",
        "upon",
        "see",
        "selfevident",
        "principle",
        "denied",
        "sane",
        "person",
        "bound",
        "say",
        "acknowledge",
        "recognise",
        "know",
        "know",
        "granted",
        "knowledge",
        "according",
        "rosmini",
        "coterminus",
        "truth",
        "never",
        "error",
        "clear",
        "rosmini",
        "affirmation",
        "depends",
        "upon",
        "selfevident",
        "need",
        "affirm",
        "one",
        "know",
        "turn",
        "act",
        "human",
        "subject",
        "elevated",
        "reflective",
        "level",
        "level",
        "truth",
        "already",
        "known",
        "essential",
        "idea",
        "sublime",
        "hand",
        "deny",
        "one",
        "know",
        "equivalent",
        "stepping",
        "nonbeing",
        "antithesis",
        "dignity",
        "philosophical",
        "term",
        "rosmini",
        "maintains",
        "principle",
        "enunciates",
        "every",
        "moral",
        "dictate",
        "implicitly",
        "included",
        "may",
        "characterised",
        "follows",
        "express",
        "moral",
        "essence",
        "call",
        "agreement",
        "intellective",
        "act",
        "ideal",
        "real",
        "entity",
        "thing",
        "known",
        "simple",
        "able",
        "participated",
        "every",
        "moral",
        "activity",
        "evident",
        "nothing",
        "expression",
        "principle",
        "contradiction",
        "universal",
        "moral",
        "effect",
        "denoted",
        "external",
        "action",
        "depend",
        "upon",
        "supreme",
        "offer",
        "possibility",
        "investigation",
        "provides",
        "foundation",
        "recognition",
        "human",
        "subject",
        "essentially",
        "moral",
        "one",
        "innate",
        "presence",
        "idea",
        "principle",
        "furnished",
        "object",
        "morality",
        "essential",
        "adherence",
        "finally",
        "rosmini",
        "distinction",
        "subject",
        "object",
        "morality",
        "open",
        "way",
        "according",
        "extreme",
        "ethical",
        "theory",
        "one",
        "hand",
        "limitation",
        "human",
        "subject",
        "provides",
        "possibility",
        "moral",
        "error",
        "necessity",
        "immutability",
        "object",
        "idea",
        "furnish",
        "morality",
        "undeniable",
        "sense",
        "obligation",
        "fatal",
        "frequent",
        "mistake",
        "rosmini",
        "contends",
        "attribute",
        "characteristic",
        "proper",
        "subject",
        "fallibility",
        "error",
        "object",
        "characteristic",
        "object",
        "necessity",
        "immutability",
        "subject",
        "moral",
        "good",
        "way",
        "present",
        "describe",
        "adequately",
        "nature",
        "moral",
        "good",
        "opposed",
        "eudemonological",
        "good",
        "good",
        "desirable",
        "desirable",
        "may",
        "either",
        "desirable",
        "stand",
        "order",
        "simply",
        "desirable",
        "far",
        "good",
        "imagined",
        "good",
        "individual",
        "moral",
        "good",
        "say",
        "rosmini",
        "found",
        "adheres",
        "good",
        "according",
        "order",
        "eudemonological",
        "utilitarian",
        "good",
        "desired",
        "good",
        "individual",
        "without",
        "reference",
        "good",
        "human",
        "dignity",
        "preserved",
        "act",
        "individual",
        "adhering",
        "practice",
        "being",
        "order",
        "implicitly",
        "adhere",
        "whole",
        "presence",
        "order",
        "immorality",
        "entity",
        "appreciated",
        "desired",
        "known",
        "order",
        "thus",
        "implies",
        "essential",
        "rebellion",
        "order",
        "thus",
        "selfimposed",
        "human",
        "indignity",
        "go",
        "lower",
        "conscience",
        "dealt",
        "nature",
        "morality",
        "moral",
        "obligation",
        "rosmini",
        "turn",
        "attention",
        "conscience",
        "admits",
        "treatise",
        "almost",
        "universally",
        "neglected",
        "philosopher",
        "feel",
        "constrained",
        "justify",
        "study",
        "undertakes",
        "almost",
        "inevitable",
        "admixture",
        "religious",
        "theological",
        "element",
        "nevertheless",
        "difficult",
        "filter",
        "philosophical",
        "principle",
        "work",
        "characteristic",
        "proper",
        "faith",
        "professes",
        "especially",
        "apparent",
        "approach",
        "nature",
        "conscience",
        "area",
        "view",
        "first",
        "prompted",
        "dissension",
        "coreligionists",
        "would",
        "go",
        "end",
        "life",
        "rosmini",
        "defines",
        "conscience",
        "speculative",
        "judgement",
        "person",
        "make",
        "morality",
        "practical",
        "judgement",
        "c",
        "judgement",
        "individual",
        "come",
        "know",
        "moral",
        "value",
        "action",
        "without",
        "necessarily",
        "acting",
        "upon",
        "several",
        "consequence",
        "drawn",
        "first",
        "morality",
        "individual",
        "prior",
        "conscience",
        "present",
        "without",
        "conscience",
        "second",
        "conscience",
        "mistaken",
        "possible",
        "form",
        "incorrect",
        "notion",
        "moral",
        "value",
        "one",
        "action",
        "third",
        "follow",
        "conscience",
        "formed",
        "give",
        "rise",
        "action",
        "person",
        "form",
        "fourth",
        "conscience",
        "incorrect",
        "judgement",
        "must",
        "far",
        "possible",
        "reformed",
        "conscience",
        "therefore",
        "adequate",
        "guide",
        "morality",
        "provides",
        "accurate",
        "information",
        "moral",
        "state",
        "subject",
        "past",
        "present",
        "future",
        "action",
        "light",
        "affirmation",
        "possible",
        "see",
        "rosmini",
        "lay",
        "groundwork",
        "overcoming",
        "dilemma",
        "posed",
        "question",
        "must",
        "conscience",
        "always",
        "followed",
        "certain",
        "dictate",
        "conscience",
        "never",
        "morally",
        "disregarded",
        "equally",
        "certain",
        "deliberately",
        "misleading",
        "act",
        "conscience",
        "morally",
        "followed",
        "sometimes",
        "therefore",
        "morally",
        "imperative",
        "correct",
        "conscience",
        "always",
        "possible",
        "proper",
        "reflection",
        "moral",
        "value",
        "human",
        "act",
        "posited",
        "posited",
        "individual",
        "rosmini",
        "go",
        "distinguish",
        "problem",
        "conscience",
        "problem",
        "connected",
        "formation",
        "conscience",
        "fact",
        "conscience",
        "according",
        "present",
        "long",
        "judgement",
        "suspended",
        "moral",
        "value",
        "individual",
        "action",
        "difficulty",
        "point",
        "connected",
        "formation",
        "judgement",
        "judgement"
    ]
}