{
    "main_text": "What is the nature of a priori justification? || Rational intuitions or insights as the bases of a priori justification\n4.4 Rational intuitions or insights as the bases of a priori justification\n\nSuppose a priori justification rests on output (evidence)\nfrom some nonexperiential source. What sort of evidence could\nthat be? A standard answer is that intuition, or rational insight, is\nthe basis of a priori justification. And what are intuitions,\nor rational insights?\n\nAs we’ve seen, Malmgren distinguishes between intuitions and\nintuitive judgments, where an intuition is a distinctive type of\nmental state that can justify a judgment (2011: 267–268). But\nnot everyone means the same thing by “intuition”. In\nThinking, Fast and Slow, Daniel Kahneman argues that\nintuitions often lead us to accept false beliefs. He offers Herbert\nSimon’s definition of an intuition, “Intuition is nothing\nmore and nothing less than recognition [of some cue stored in\nmemory]” (2011: 11, 237). But Kahneman is thinking of fast,\nautomatic, immediate judgments when he writes of intuitions and\nintuitive judgments based on them. He often thinks of them as issuing\nfrom “gut feelings”, as in his example of “the chief\ninvestment officer of a large financial firm” who decided to\ninvest tens of millions of dollars in Ford Stock after recently\nattending an auto show where Ford vehicles were on display (2011: 12).\nAnd he describes an intuitive answer as “the first one that\ncomes to mind” (2011: 6). Elijah Chudnoff has a different\nconception of intuitions because he thinks that “there are\nhard-won intuitions which take deliberate effort to have” and\nother intuitions that require an expert to guide a person before she\ncan have them (Chudnoff forthcoming).\n\nPhilosophers do not mean what Kahneman means when they refer to the\nintuitions people typically have when considering Gettier cases and\nthe other paradigmatic cases listed above. While intuitions are\nnon-inferential, some can appear only after much reflection and effort\n(see, again, Chudnoff forthcoming). Nor are they what George Bealer\nmeans by a “physical intuition”, such as the one that\nfounds the intuitive judgment that a house undermined will fall\n(Bealer 1992: 102; 1998: 207, 211). They are some sort of intellectual\nseeming (Bealer) or rational insight (BonJour). For Bealer and\nBonJour, taken in the broadest sense, intuitions are non-inferential\nin that they are not the conclusion of some piece of reasoning. For\nChudnoff, intuitions can be produced by reasoning though their\njustificatory force does not come from that reasoning. The reasoning\njust leads you to a proposition that seems true in itself. Like\nsensations, intuitions must be occurrent, and so are unlike beliefs,\nwhich need not be. You can have a belief that P while not\nconsidering P, but you cannot have an intuition that P\nwhile not considering P. \n\nWhen it is a matter of perception, in the Mueller-Lyer figure the line\nwith the arrowheads pointing inward appears longer than the\none with them pointing outward even if you know it is not really\nlonger. To some people at least, in the Monty Hall example it\nseems that there is a 50-50 chance that the grand prize is\nbehind either of the two doors that are left unopened after Monty has\nopened one of them, even though they know that the probability it is\nbehind the door the contestant did not choose is 2/3 (see Russell\n2010: 464, for the Monty Hall example). So intuitions are a type of\nappearing; physical and philosophical intuitions have this in common.\nGeorge Bealer characterizes a rational intuition as an\nintellectual seeming that some proposition is\nnecessarily, or possibly, true (Bealer 1998:\n207–208). He contrasts this with the physical intuition that a\nhouse undermined will fall which is not about what is necessarily or\npossibly true. Also, philosophical intuitions are based solely on\nunderstanding the proposition which is their object while physical\nintuitions are based on understanding something about the physical\nworld. Bealer contrasts intuitions with “judgments, guesses, and\nhunches” (1998: 210–211), common sense, belief, and even\nan inclination to believe (1998: 208–209). And, of course, they\nare not just “gut feelings”, which are not based solely on\nunderstanding some proposition,\n\nLaurence BonJour thinks that a rational insight is an immediate,\nnon-inferential grasp, apprehension, or “seeing” that some\nproposition is necessarily true (BonJour 1998: 106). He goes on to\nargue that a proposition’s appearing to be necessarily\ntrue is the foundation of a priori justification, because he\nwants to allow that such justification can be fallible and defeasible.\nSo for BonJour it is apparent rational insights that are the\nevidence on which a priori justification rests, not rational\ninsights themselves (1998: 112–113, 1998: §§4.5, 4.6).\nAfter publishing In Defense of Pure Reason (1998), and in\nresponse to comments by Paul Boghossian (2001), BonJour wrote that\nthese appearances are not propositional, that is, they are not\nappearances that something is the case (BonJour 2001a:\n677–678). In this respect, they are unlike beliefs and more like\nperceptual sensations.\n\nJohn Hawthorne questions whether apparent rational insights or\nrational intuitions as understood by BonJour and Bealer, respectively,\nprovide evidence for the beliefs which are based on them. He assumes\nthat these intellectual seemings manifest themselves to inner\nconsciousness “by a special kind of phenomenology”\n(Hawthorne 2013: 215). He then wonders whether any of the following\nwould provide evidence: a seeming without the relevant phenomenology\nhe calls Glow, a seeming with a Glow of which the person is unaware\n(if this is even possible), a seeming with a known Glow which is\nunreliable. He seems to think that good answers to these questions\nwould require abandoning the “internalist mandate” that\ndrives these views that “allow only that which is\n‘accessible’ from the inside to count as relevant to\njustification” (Hawthorne 2013: 216). As we’ve seen,\nChudnoff thinks that intuitions have a distinctive phenomenology that\nprovides reason to believe that the propositions which are their\nobjects are true (2011b, esp. secs. 6 & 7); others think that they\nneed not have a distinctive phenomenology (Sosa 2013; Boghossian\nforthcomingb). One might maintain that at least in certain\ncircumstance, being in the mental state with the relevant\nphenomenology necessarily gives you prima facie reason to\nbelieve the proposition consideration of which caused that intuition,\nthat is, gives you a reason to believe that proposition even though\nthat reason might be undermined or overridden by further\nconsiderations.\n\nFurther, Bealer may have an answer for those who think that\nreliability is a necessary condition of justification because he\nargues that intellectual seemings are necessarily reliable when had in\ncertain conditions. He calls his view modal reliabilism (1998:\n215–217), which holds that a certain kind of concept possession\n(namely, full understanding of the concept) in ideal conditions\nguarantees the sort of reliability that some think evidence requires.\nOn this view, it does not matter what, if any, phenomenology is\nassociated with the relevant intellectual seemings (cf. Sosa 2013).\nWhat matters is whether the person fully understands the relevant\nconcepts involved. That could even be the basis for justification of\nintuitive mathematical judgments that are not\naccompanied by any intuitions with Glow (a possibility\nmentioned by Hawthorne above (2013: 217)). So a defender of views like\nBonjour’s and Bealer’s can answer Hawthorne’s\nquestions by arguing that the relevant intuitions or insights are\nreliable whether they are accompanied by Glows, unknown Glows, or no\nGlows at all.\n\nThose who hold that intuitions can justify because they are based on\nthe understanding think, for instance, that our understanding the\nconcept knowledge is the source of our intuition that a correct lucky\nguess is not knowledge. Hawthorne’s criticisms of basing a\npriori justification on the understanding (as Boghossian\nforthcomingb proposes) is that there seem to be instances of a\npriori justification that require skill in “sophisticated\nproof techniques that are quite obviously not preconditions of\nanything in the domain” (Hawthorne 2013: 213). For instance,\nsophisticated proof techniques were required to prove Fermat’s\nLast Theorem even though it is easy to understand what the theorem\nsays, namely, that the equation \\(x^n + y^n = z^n\\) has no solutions\nwhen n is a positive integer greater than two. A possible\nresponse to this objection is to expand the notion of enabling\nexperiences to include those needed to acquire intellectual\nskills which are needed to employ intellectual seemings in reasoning\n(see, secs.\n 4.1\n above and\n 4.5\n below) and are different from perceptual skills. But possessing those\ntechniques without also understanding the connections between the\npremises would not yield justification. It is possible to hold that\nthe important difference between a priori and a\nposteriori justification is that once the concepts and the\nrelevant techniques are acquired, nothing more is needed for\na priori justification (that is the sense in which a\npriori justification is independent of experience), but further\nexperience is needed for a posteriori justification. Further,\nHawthorne’s criticism seems not to affect whether intellectual\nintuitions that are evoked by thought experiments (as in standard\nGettier cases) can provide evidence since no special techniques are\nrequired there.\n\nWhile Hawthorne questions whether intuitions provide any evidence for\nor against philosophical theories, Brian Weatherson grants that they\ndo but questions how much evidential weight they have. Gettier\nexamples are taken by many to be a conclusive refutation of the view\nthat having a justified true belief is sufficient for knowledge, but\nnot by Weatherson. He says, \n\n\nIn short, the true theory of knowledge is the one that does best at\n(a) accounting for as many as possible of our intuitions about\nknowledge while (b) remaining systematic. (2003: 7) \n\n\nHe thinks that it may be best to accept the JTB theory of knowledge\neven in the face of Gettier examples if no other systematic theory of\nknowledge is available. Systematic theories should not have too many\nunacceptable (that is, counterintuitive) theoretical consequences,\nshould involve the analysis of a theoretically significant concept in\ntheoretically significant terms, and should be simple (2003:\n8–9). Weatherson says that, \n\n\nWhile a theory can be reformist, it can’t be revolutionary. A\ntheory that disagreed with virtually all intuitions about possible\ncases is, for that reason, false.\n\n\nStopped Clock is a case in which a person correctly believes\nthat the time is, say, 1:00 p.m. on the basis of looking at a clock\nthat reads 1:00 o’clock, and which he is justified in thinking\nis working properly. However, the clock stopped working exactly\ntwenty-four hours earlier. Still, that person has a justified true\nbelief that it is 1:00 p.m. Sheep is a case where a jokester\nfarmer breeds poodles to look like sheep, and grooms them so they are\nindistinguishable from real sheep. He puts them in his field for\ntourists to see, and his real sheep are in that field but out of sight\nbehind some large boulders where he feeds them. Jones drives by and\nforms the justified true belief that there are sheep in the field. It\nseems that the intuitions that knowledge is absent, but JTB present,\nin Stopped Clock and Sheep are enough to make it\nreasonable to reject the JTB theory of knowledge. A few really strong\nintuitions seem enough by themselves to make it reasonable to reject a\ntheory. Contra Weatherson, reasonable rejection does not require that\nthe theory disagree with virtually all intuitions.\nTheoretical virtues are not enough to overcome such intuitive\nshortcomings even if there is not a competing virtuous theoretical\nanalysis available. \n\nA promising account of a priori justification in terms of a\nnonexperiential source of evidence is one that sees\nintellectual intuition, rational insight, or apparent\nrational insight, as providing the relevant a priori evidence\nwith its source being reason. This rational capacity is not some\nspecial faculty of intuition analogous, say, to sight, which is a\nsource of empirical evidence. One function of reason involves\n“seeing” how evidence supports a conclusion, and\nin deductive reasoning, “seeing” how conclusions\nfollow from premises. This same ability is exercised when\nreason “sees” that some proposition is true, or\nnecessarily true, simply in virtue of the person’s understanding\nthe proposition. However, this intellectual “seeing” need\nnot have distinctive conscious qualities, qualia, associated with it,\nunlike perceptual seeing, which does. Apparent rational\ninsights need not be accompanied by appearances, if\n“appearances” necessarily involve qualia. The metaphor of\n“seeing” logical connections or that certain propositions\nare true should not mislead us into thinking that there is a special,\nquasi-perceptual faculty along with sight, touch, hearing, etc. It is\nplausible to hold that reason can “grasp” and\n“see” without there being any analogue to having certain\ntouch or visual sensations. (In several essays, Chudnoff disagrees:\n2011a, 2011b.)\n",
    "section_title": "4.4 Rational intuitions or insights as the bases of a priori justification",
    "entry_title": "A Priori Justification and Knowledge",
    "hierarchy_title": "A Priori Justification and Knowledge || What is the nature of a priori justification? || Rational intuitions or insights as the bases of a priori justification",
    "tokenized_text": [
        "nature",
        "priori",
        "justification",
        "rational",
        "intuition",
        "insight",
        "base",
        "priori",
        "justification",
        "rational",
        "intuition",
        "insight",
        "base",
        "priori",
        "justification",
        "suppose",
        "priori",
        "justification",
        "rest",
        "output",
        "evidence",
        "nonexperiential",
        "source",
        "sort",
        "evidence",
        "could",
        "standard",
        "answer",
        "intuition",
        "rational",
        "insight",
        "basis",
        "priori",
        "justification",
        "intuition",
        "rational",
        "insight",
        "seen",
        "malmgren",
        "distinguishes",
        "intuition",
        "intuitive",
        "judgment",
        "intuition",
        "distinctive",
        "type",
        "mental",
        "state",
        "justify",
        "judgment",
        "everyone",
        "mean",
        "thing",
        "intuition",
        "thinking",
        "fast",
        "slow",
        "daniel",
        "kahneman",
        "argues",
        "intuition",
        "often",
        "lead",
        "u",
        "accept",
        "false",
        "belief",
        "offer",
        "herbert",
        "simon",
        "definition",
        "intuition",
        "intuition",
        "nothing",
        "nothing",
        "le",
        "recognition",
        "cue",
        "stored",
        "memory",
        "kahneman",
        "thinking",
        "fast",
        "automatic",
        "immediate",
        "judgment",
        "writes",
        "intuition",
        "intuitive",
        "judgment",
        "based",
        "often",
        "think",
        "issuing",
        "gut",
        "feeling",
        "example",
        "chief",
        "investment",
        "officer",
        "large",
        "financial",
        "firm",
        "decided",
        "invest",
        "ten",
        "million",
        "dollar",
        "ford",
        "stock",
        "recently",
        "attending",
        "auto",
        "show",
        "ford",
        "vehicle",
        "display",
        "describes",
        "intuitive",
        "answer",
        "first",
        "one",
        "come",
        "mind",
        "elijah",
        "chudnoff",
        "different",
        "conception",
        "intuition",
        "think",
        "hardwon",
        "intuition",
        "take",
        "deliberate",
        "effort",
        "intuition",
        "require",
        "expert",
        "guide",
        "person",
        "chudnoff",
        "forthcoming",
        "philosopher",
        "mean",
        "kahneman",
        "mean",
        "refer",
        "intuition",
        "people",
        "typically",
        "considering",
        "gettier",
        "case",
        "paradigmatic",
        "case",
        "listed",
        "intuition",
        "noninferential",
        "appear",
        "much",
        "reflection",
        "effort",
        "see",
        "chudnoff",
        "forthcoming",
        "george",
        "bealer",
        "mean",
        "physical",
        "intuition",
        "one",
        "found",
        "intuitive",
        "judgment",
        "house",
        "undermined",
        "fall",
        "bealer",
        "sort",
        "intellectual",
        "seeming",
        "bealer",
        "rational",
        "insight",
        "bonjour",
        "bealer",
        "bonjour",
        "taken",
        "broadest",
        "sense",
        "intuition",
        "noninferential",
        "conclusion",
        "piece",
        "reasoning",
        "chudnoff",
        "intuition",
        "produced",
        "reasoning",
        "though",
        "justificatory",
        "force",
        "come",
        "reasoning",
        "reasoning",
        "lead",
        "proposition",
        "seems",
        "true",
        "like",
        "sensation",
        "intuition",
        "must",
        "occurrent",
        "unlike",
        "belief",
        "need",
        "belief",
        "p",
        "considering",
        "p",
        "intuition",
        "p",
        "considering",
        "p",
        "matter",
        "perception",
        "muellerlyer",
        "figure",
        "line",
        "arrowhead",
        "pointing",
        "inward",
        "appears",
        "longer",
        "one",
        "pointing",
        "outward",
        "even",
        "know",
        "really",
        "longer",
        "people",
        "least",
        "monty",
        "hall",
        "example",
        "seems",
        "chance",
        "grand",
        "prize",
        "behind",
        "either",
        "two",
        "door",
        "left",
        "unopened",
        "monty",
        "opened",
        "one",
        "even",
        "though",
        "know",
        "probability",
        "behind",
        "door",
        "contestant",
        "choose",
        "see",
        "russell",
        "monty",
        "hall",
        "example",
        "intuition",
        "type",
        "appearing",
        "physical",
        "philosophical",
        "intuition",
        "common",
        "george",
        "bealer",
        "characterizes",
        "rational",
        "intuition",
        "intellectual",
        "seeming",
        "proposition",
        "necessarily",
        "possibly",
        "true",
        "bealer",
        "contrast",
        "physical",
        "intuition",
        "house",
        "undermined",
        "fall",
        "necessarily",
        "possibly",
        "true",
        "also",
        "philosophical",
        "intuition",
        "based",
        "solely",
        "understanding",
        "proposition",
        "object",
        "physical",
        "intuition",
        "based",
        "understanding",
        "something",
        "physical",
        "world",
        "bealer",
        "contrast",
        "intuition",
        "judgment",
        "guess",
        "hunch",
        "common",
        "sense",
        "belief",
        "even",
        "inclination",
        "believe",
        "course",
        "gut",
        "feeling",
        "based",
        "solely",
        "understanding",
        "proposition",
        "laurence",
        "bonjour",
        "think",
        "rational",
        "insight",
        "immediate",
        "noninferential",
        "grasp",
        "apprehension",
        "seeing",
        "proposition",
        "necessarily",
        "true",
        "bonjour",
        "go",
        "argue",
        "proposition",
        "appearing",
        "necessarily",
        "true",
        "foundation",
        "priori",
        "justification",
        "want",
        "allow",
        "justification",
        "fallible",
        "defeasible",
        "bonjour",
        "apparent",
        "rational",
        "insight",
        "evidence",
        "priori",
        "justification",
        "rest",
        "rational",
        "insight",
        "publishing",
        "defense",
        "pure",
        "reason",
        "response",
        "comment",
        "paul",
        "boghossian",
        "bonjour",
        "wrote",
        "appearance",
        "propositional",
        "appearance",
        "something",
        "case",
        "bonjour",
        "a",
        "respect",
        "unlike",
        "belief",
        "like",
        "perceptual",
        "sensation",
        "john",
        "hawthorne",
        "question",
        "whether",
        "apparent",
        "rational",
        "insight",
        "rational",
        "intuition",
        "understood",
        "bonjour",
        "bealer",
        "respectively",
        "provide",
        "evidence",
        "belief",
        "based",
        "assumes",
        "intellectual",
        "seemings",
        "manifest",
        "inner",
        "consciousness",
        "special",
        "kind",
        "phenomenology",
        "hawthorne",
        "wonder",
        "whether",
        "following",
        "would",
        "provide",
        "evidence",
        "seeming",
        "without",
        "relevant",
        "phenomenology",
        "call",
        "glow",
        "seeming",
        "glow",
        "person",
        "unaware",
        "even",
        "possible",
        "seeming",
        "known",
        "glow",
        "unreliable",
        "seems",
        "think",
        "good",
        "answer",
        "question",
        "would",
        "require",
        "abandoning",
        "internalist",
        "mandate",
        "drive",
        "view",
        "allow",
        "accessible",
        "inside",
        "count",
        "relevant",
        "justification",
        "hawthorne",
        "seen",
        "chudnoff",
        "think",
        "intuition",
        "distinctive",
        "phenomenology",
        "provides",
        "reason",
        "believe",
        "proposition",
        "object",
        "true",
        "b",
        "esp",
        "sec",
        "others",
        "think",
        "need",
        "distinctive",
        "phenomenology",
        "sosa",
        "boghossian",
        "forthcomingb",
        "one",
        "might",
        "maintain",
        "least",
        "certain",
        "circumstance",
        "mental",
        "state",
        "relevant",
        "phenomenology",
        "necessarily",
        "give",
        "prima",
        "facie",
        "reason",
        "believe",
        "proposition",
        "consideration",
        "caused",
        "intuition",
        "give",
        "reason",
        "believe",
        "proposition",
        "even",
        "though",
        "reason",
        "might",
        "undermined",
        "overridden",
        "consideration",
        "bealer",
        "may",
        "answer",
        "think",
        "reliability",
        "necessary",
        "condition",
        "justification",
        "argues",
        "intellectual",
        "seemings",
        "necessarily",
        "reliable",
        "certain",
        "condition",
        "call",
        "view",
        "modal",
        "reliabilism",
        "hold",
        "certain",
        "kind",
        "concept",
        "possession",
        "namely",
        "full",
        "understanding",
        "concept",
        "ideal",
        "condition",
        "guarantee",
        "sort",
        "reliability",
        "think",
        "evidence",
        "requires",
        "view",
        "matter",
        "phenomenology",
        "associated",
        "relevant",
        "intellectual",
        "seemings",
        "cf",
        "sosa",
        "matter",
        "whether",
        "person",
        "fully",
        "understands",
        "relevant",
        "concept",
        "involved",
        "could",
        "even",
        "basis",
        "justification",
        "intuitive",
        "mathematical",
        "judgment",
        "accompanied",
        "intuition",
        "glow",
        "possibility",
        "mentioned",
        "hawthorne",
        "defender",
        "view",
        "like",
        "bonjour",
        "bealer",
        "answer",
        "hawthorne",
        "question",
        "arguing",
        "relevant",
        "intuition",
        "insight",
        "reliable",
        "whether",
        "accompanied",
        "glow",
        "unknown",
        "glow",
        "glow",
        "hold",
        "intuition",
        "justify",
        "based",
        "understanding",
        "think",
        "instance",
        "understanding",
        "concept",
        "knowledge",
        "source",
        "intuition",
        "correct",
        "lucky",
        "guess",
        "knowledge",
        "hawthorne",
        "criticism",
        "basing",
        "priori",
        "justification",
        "understanding",
        "boghossian",
        "forthcomingb",
        "proposes",
        "seem",
        "instance",
        "priori",
        "justification",
        "require",
        "skill",
        "sophisticated",
        "proof",
        "technique",
        "quite",
        "obviously",
        "precondition",
        "anything",
        "domain",
        "hawthorne",
        "instance",
        "sophisticated",
        "proof",
        "technique",
        "required",
        "prove",
        "fermat",
        "last",
        "theorem",
        "even",
        "though",
        "easy",
        "understand",
        "theorem",
        "say",
        "namely",
        "equation",
        "xn",
        "yn",
        "zn",
        "solution",
        "n",
        "positive",
        "integer",
        "greater",
        "two",
        "possible",
        "response",
        "objection",
        "expand",
        "notion",
        "enabling",
        "experience",
        "include",
        "needed",
        "acquire",
        "intellectual",
        "skill",
        "needed",
        "employ",
        "intellectual",
        "seemings",
        "reasoning",
        "see",
        "sec",
        "different",
        "perceptual",
        "skill",
        "possessing",
        "technique",
        "without",
        "also",
        "understanding",
        "connection",
        "premise",
        "would",
        "yield",
        "justification",
        "possible",
        "hold",
        "important",
        "difference",
        "priori",
        "posteriori",
        "justification",
        "concept",
        "relevant",
        "technique",
        "acquired",
        "nothing",
        "needed",
        "priori",
        "justification",
        "sense",
        "priori",
        "justification",
        "independent",
        "experience",
        "experience",
        "needed",
        "posteriori",
        "justification",
        "hawthorne",
        "criticism",
        "seems",
        "affect",
        "whether",
        "intellectual",
        "intuition",
        "evoked",
        "thought",
        "experiment",
        "standard",
        "gettier",
        "case",
        "provide",
        "evidence",
        "since",
        "special",
        "technique",
        "required",
        "hawthorne",
        "question",
        "whether",
        "intuition",
        "provide",
        "evidence",
        "philosophical",
        "theory",
        "brian",
        "weatherson",
        "grant",
        "question",
        "much",
        "evidential",
        "weight",
        "gettier",
        "example",
        "taken",
        "many",
        "conclusive",
        "refutation",
        "view",
        "justified",
        "true",
        "belief",
        "sufficient",
        "knowledge",
        "weatherson",
        "say",
        "short",
        "true",
        "theory",
        "knowledge",
        "one",
        "best",
        "accounting",
        "many",
        "possible",
        "intuition",
        "knowledge",
        "b",
        "remaining",
        "systematic",
        "think",
        "may",
        "best",
        "accept",
        "jtb",
        "theory",
        "knowledge",
        "even",
        "face",
        "gettier",
        "example",
        "systematic",
        "theory",
        "knowledge",
        "available",
        "systematic",
        "theory",
        "many",
        "unacceptable",
        "counterintuitive",
        "theoretical",
        "consequence",
        "involve",
        "analysis",
        "theoretically",
        "significant",
        "concept",
        "theoretically",
        "significant",
        "term",
        "simple",
        "weatherson",
        "say",
        "theory",
        "reformist",
        "revolutionary",
        "theory",
        "disagreed",
        "virtually",
        "intuition",
        "possible",
        "case",
        "reason",
        "false",
        "stopped",
        "clock",
        "case",
        "person",
        "correctly",
        "belief",
        "time",
        "say",
        "pm",
        "basis",
        "looking",
        "clock",
        "read",
        "clock",
        "justified",
        "thinking",
        "working",
        "properly",
        "however",
        "clock",
        "stopped",
        "working",
        "exactly",
        "twentyfour",
        "hour",
        "earlier",
        "still",
        "person",
        "justified",
        "true",
        "belief",
        "pm",
        "sheep",
        "case",
        "jokester",
        "farmer",
        "breed",
        "poodle",
        "look",
        "like",
        "sheep",
        "groom",
        "indistinguishable",
        "real",
        "sheep",
        "put",
        "field",
        "tourist",
        "see",
        "real",
        "sheep",
        "field",
        "sight",
        "behind",
        "large",
        "boulder",
        "feed",
        "jones",
        "drive",
        "form",
        "justified",
        "true",
        "belief",
        "sheep",
        "field",
        "seems",
        "intuition",
        "knowledge",
        "absent",
        "jtb",
        "present",
        "stopped",
        "clock",
        "sheep",
        "enough",
        "make",
        "reasonable",
        "reject",
        "jtb",
        "theory",
        "knowledge",
        "really",
        "strong",
        "intuition",
        "seem",
        "enough",
        "make",
        "reasonable",
        "reject",
        "theory",
        "contra",
        "weatherson",
        "reasonable",
        "rejection",
        "require",
        "theory",
        "disagree",
        "virtually",
        "intuition",
        "theoretical",
        "virtue",
        "enough",
        "overcome",
        "intuitive",
        "shortcoming",
        "even",
        "competing",
        "virtuous",
        "theoretical",
        "analysis",
        "available",
        "promising",
        "account",
        "priori",
        "justification",
        "term",
        "nonexperiential",
        "source",
        "evidence",
        "one",
        "see",
        "intellectual",
        "intuition",
        "rational",
        "insight",
        "apparent",
        "rational",
        "insight",
        "providing",
        "relevant",
        "priori",
        "evidence",
        "source",
        "reason",
        "rational",
        "capacity",
        "special",
        "faculty",
        "intuition",
        "analogous",
        "say",
        "sight",
        "source",
        "empirical",
        "evidence",
        "one",
        "function",
        "reason",
        "involves",
        "seeing",
        "evidence",
        "support",
        "conclusion",
        "deductive",
        "reasoning",
        "seeing",
        "conclusion",
        "follow",
        "premise",
        "ability",
        "exercised",
        "reason",
        "see",
        "proposition",
        "true",
        "necessarily",
        "true",
        "simply",
        "virtue",
        "person",
        "understanding",
        "proposition",
        "however",
        "intellectual",
        "seeing",
        "need",
        "distinctive",
        "conscious",
        "quality",
        "qualia",
        "associated",
        "unlike",
        "perceptual",
        "seeing",
        "apparent",
        "rational",
        "insight",
        "need",
        "accompanied",
        "appearance",
        "appearance",
        "necessarily",
        "involve",
        "qualia",
        "metaphor",
        "seeing",
        "logical",
        "connection",
        "certain",
        "proposition",
        "true",
        "mislead",
        "u",
        "thinking",
        "special",
        "quasiperceptual",
        "faculty",
        "along",
        "sight",
        "touch",
        "hearing",
        "etc",
        "plausible",
        "hold",
        "reason",
        "grasp",
        "see",
        "without",
        "analogue",
        "certain",
        "touch",
        "visual",
        "sensation",
        "several",
        "essay",
        "chudnoff",
        "disagrees",
        "a",
        "b"
    ]
}