{
    "main_text": "Will and Freedom\n7. Will and Freedom\n\nThe immaterial human mind, as Aquinas understands it, is not just the\nintellect. The mind is an ensemble of three discrete powers, agent and\npossible intellect working in conjunction with the will. The rise of\nthe will as a faculty of the soul is a distinctively medieval idea,\nbut has strong roots in Augustine and, before him, in late\n Stoicism.\n These late-ancient sources had ascribed a prominent role in human\nagency to desire (appetitus) or volition (voluntas),\nand particularly to those desires that we endorse as our own, and\nwhich thus give rise to voluntary action. Among these earlier authors,\nour will is conceived of as something that we need to control, if we\nare to lead our lives as we should. By Aquinas’s time, however,\nthe will (voluntas) had come to be identified not just as a\npower of the soul but as the power that is principally in control of\nhuman agency, directing both our thoughts and our actions. Thus,\nwhereas Augustine and\n Boethius\n had wondered about how we have free choice (liberum\narbitrium) over our wills, Aquinas identifies the two, concluding\nthat “the will and free choice are not two powers, but\none” (ST 1a 83.4c). He was by no means the first to\nconceive of the power of will in this way, but the cogency and\ninfluence of his account ensured that this framework would dominate\nlater discussions.\n\nThe will is one of three appetitive powers within us, distinguished\nfrom the irascible and concupiscible powers in being not a sensual\nappetite, the source of the passions (King 1998; Miner 2009), but a\nrational appetite, the source of voluntary agency. Its\nrationality consists in the way it is coordinate with intellect,\ntaking as its inputs the intellect’s practical judgments\nregarding what is to be done. Since the will’s function is\nstrictly appetitive, it cannot render its own practical judgments, and\nto that extent can act only on the basis of intellect: “every\nchoice and actual will within us is immediately caused by an\nintelligible apprehension” (SCG III.85.3). But that is\nby no means to say that the will is determined by the\nintellect’s judgment, because ultimately our will has the power\nto control what we think about: “the will moves both itself and\nall other capacities. For I think when I want to, and likewise I use\nall my other capacities and dispositions because I want to”\n(Quest. on Evil 6c). To be sure, by its very nature, the will\ncan desire only what is presented to it as a good (ST 1a2ae\n8.1). Accordingly, since our ultimate happiness (beatitudo)\nis good in every respect, “human beings have an appetite of\nnecessity for happiness” (ST 1a2ae 10.2c; see\n§8.1). But, with regard to any specific course of action, there\nare always multiple perspectives from which the situation can be\njudged, and the will can control how we think about\nthings—whether, for instance, we decide to focus on how\nrewarding a thing would be or on how tiring it would be. Even in the\ncase of our ultimate happiness, moreover, the will can choose not to\nthink about it, and so even in that extreme case the will’s\nchoices are not necessitated. On this basis Aquinas adamantly insists\non human freedom of choice, and treats claims that the will is\nnecessitated as “contrary to the faith and subverting all of the\nprinciples of moral philosophy” (Quest. on Evil\n6c).\n\nUp to this point, Aquinas’s position is fairly clear. There has\nbeen considerable controversy over the centuries, however, regarding\nwhether Aquinas wants to go further and characterize the will’s\nagency as\n nondeterministic—as\n its being, in other words, a first and undetermined cause of free\naction. Within a few years of his death, after the\n Condemnation of 1277,\n views of this sort came to dominate scholastic philosophy, yielding a\nbroad consensus that held until the rise of seventeenth-century\nanti-scholasticism. Readers of Aquinas have been sharply divided,\nhowever, over where he fits into that history. At first glance it\nmight seem obvious that Aquinas is an opponent of determinism, given\nhis adamant opposition to the will’s being necessitated. Yet\nAquinas writes at a time at which the governing form of\nAristotelianism, drawn from the Arabic tradition of Ibn Sīnā\nand Ibn Rushd, is explicitly deterministic. In general, Aquinas\nstrives where he can to harmonize the faith with the mainstream of\nphilosophical opinion, and here in particular he shows signs of\nendorsing causal determinism as applied to the created world. Thus he\nascribes to Ibn Rushd (“the Commentator”) the doctrine\nthat “from that which is open both ways (ad utrumlibet)\nno action follows, unless it is inclined one way by something\nelse” (ST 1a 19.3 obj. 5). He hastens to reject this\nprinciple when applied to God, who is able to determine freely\nGod’s own choices. But outside the case of God he accepts the\nprinciple: “a cause that is of itself contingent must be\ndetermined to its effect by something external” (ibid., ad 5).\nAccordingly, he explicitly insists that the will’s freedom does\nnot require it to be its own first cause. Instead, he characterizes\nthe will’s operations as entwined over time with the operation\nof intellect, running backward through an agent’s history, with\none cause preceding another, all the way back to God’s initial\ncreation of the human soul (Quest. on Evil 6, ST 1a\n83.1 ad 3, ST 1a2ae 9.4c). This insistence on determining\ncauses might seem to fit well with his strict conception of\n divine providence:\n\nEverything that happens here, insofar as it is brought back to the\nfirst divine cause, is found to be ordered rather than to exist\naccidentally, even if in comparison to other causes it is found to\nexist accidentally. This is why the Catholic faith says that nothing\nin the world happens aimlessly or fortuitously, and that all things\nare subject to divine providence. (Comm. Metaphys. VI.3.26;\nsee Goris 1997)\n\n\nOn this reading of Aquinas, causal determinism fits with God’s\npreordained plan for the universe, and freedom is thus compatible with\nboth causal and theological determinism (Hause 1997; Kenny 1993 ch. 6;\nLoughran 1999; Pasnau 2002 ch. 7; Shanley 2007).\n\nMany scholars, however, have denied that Aquinas is any sort of\ncompatibilist. That there is room for doubt is suggested in a passage\nthat, at first, looks to support a compatibilist account:\n\nFreedom does not necessarily require that what is free be the first\ncause of itself, just as one thing’s being the cause of another\ndoes not require that it be the first cause of that other. God, then,\nis the first cause, moving both natural and voluntary causes. And just\nas his moving natural causes does not take away from their acts’\nbeing natural, so his moving voluntary causes does not take away from\ntheir actions’ being voluntary. Instead, he makes this be so for\nthem, because he works within each thing in accord with its own\ncharacter. (ST 1a 83.1 ad 3)\n\n\nAlthough the passage begins in a way that looks friendly to causal\ndeterminism, the passage goes on to suggest the situation is more\ncomplicated. For although God is the first cause of our voluntary\nactions, God’s efficacy there is different from how it is with\nnatural causes: God somehow acts on the will in a way that “does\nnot take away” from its voluntariness. And Aquinas takes just\nthe same line in explaining how divine providence is consistent with\nhuman freedom (ST 1a 23.6c; SCG III.72–73;\nComm. Metaphys. VI.3.30–32; Comm. De interp.\nI.14.22).\n\nAmong those who think that Aquinas’s God leaves room for\nindeterministic human agency, there remains a fundamental difference\nof opinion. Some (e.g., Stump 2003 ch. 9) think that such freedom, for\nAquinas, requires only that the will be an ultimate source, a first\ncreaturely cause. Others think that, in addition to this, Aquinas\nfurther requires the leeway to choose among alternative possibilities\n(e.g., Hoffmann and Michon 2017). Either way, a libertarian reading of\nAquinas is likely to stress his claim that the will is a self-mover:\n“Just as the will moves other capacities, so it also moves\nitself” (Quest. on Evil 6c; Gallagher 1994). This is an\nidea, moreover, that Aquinas had urged from his very first discussion\nof free choice in his Sentences commentary, where he argued\nthat free choice is possessed only by beings who “determine for\nthemselves their end and their action toward that end”\n(Sentences II.25.1c). In some sense, then, the will is free\nbecause it is self-determining. This distinguishes it from natural,\nnon-voluntary agents, whose determination comes from without.\nAquinas’s focus on the will’s role in such\nself-determination—a tendency that becomes more prominent in his\nlater works—makes it reasonable to include him in the\nthirteenth-century movement away from ancient intellectualism and\ntoward a voluntaristic conception of human nature. In emphasizing the\nwill’s overarching control, Aquinas can appeal to the critical\nimportance of the will’s various operations and dispositions.\nThe act of love, foundational to any Christian ethics, is an operation\nof will. The dispositions of justice and charity—the central\nvirtues of philosophy and theology, respectively—are both\nvirtues of the will. But it is not clear that Aquinas goes so\nfar—as\n Peter John Olivi,\n Henry of Ghent, and Scotus, among many others, soon would—as to\nexempt the will from the determinism that was agreed to characterize\nthe rest of the natural world. There remains a lively debate among\nscholars over this issue.\n",
    "section_title": "7. Will and Freedom",
    "entry_title": "Thomas Aquinas",
    "hierarchy_title": "Thomas Aquinas || Will and Freedom",
    "tokenized_text": [
        "freedom",
        "freedom",
        "immaterial",
        "human",
        "mind",
        "aquinas",
        "understands",
        "intellect",
        "mind",
        "ensemble",
        "three",
        "discrete",
        "power",
        "agent",
        "possible",
        "intellect",
        "working",
        "conjunction",
        "rise",
        "faculty",
        "soul",
        "distinctively",
        "medieval",
        "idea",
        "strong",
        "root",
        "augustine",
        "late",
        "stoicism",
        "lateancient",
        "source",
        "ascribed",
        "prominent",
        "role",
        "human",
        "agency",
        "desire",
        "appetitus",
        "volition",
        "voluntas",
        "particularly",
        "desire",
        "endorse",
        "thus",
        "give",
        "rise",
        "voluntary",
        "action",
        "among",
        "earlier",
        "author",
        "conceived",
        "something",
        "need",
        "control",
        "lead",
        "life",
        "aquinas",
        "time",
        "however",
        "voluntas",
        "come",
        "identified",
        "power",
        "soul",
        "power",
        "principally",
        "control",
        "human",
        "agency",
        "directing",
        "thought",
        "action",
        "thus",
        "whereas",
        "augustine",
        "boethius",
        "wondered",
        "free",
        "choice",
        "liberum",
        "arbitrium",
        "will",
        "aquinas",
        "identifies",
        "two",
        "concluding",
        "free",
        "choice",
        "two",
        "power",
        "one",
        "st",
        "a",
        "c",
        "mean",
        "first",
        "conceive",
        "power",
        "way",
        "cogency",
        "influence",
        "account",
        "ensured",
        "framework",
        "would",
        "dominate",
        "later",
        "discussion",
        "one",
        "three",
        "appetitive",
        "power",
        "within",
        "u",
        "distinguished",
        "irascible",
        "concupiscible",
        "power",
        "sensual",
        "appetite",
        "source",
        "passion",
        "king",
        "miner",
        "rational",
        "appetite",
        "source",
        "voluntary",
        "agency",
        "rationality",
        "consists",
        "way",
        "coordinate",
        "intellect",
        "taking",
        "input",
        "intellect",
        "practical",
        "judgment",
        "regarding",
        "done",
        "since",
        "function",
        "strictly",
        "appetitive",
        "render",
        "practical",
        "judgment",
        "extent",
        "act",
        "basis",
        "intellect",
        "every",
        "choice",
        "actual",
        "within",
        "u",
        "immediately",
        "caused",
        "intelligible",
        "apprehension",
        "scg",
        "iii",
        "mean",
        "say",
        "determined",
        "intellect",
        "judgment",
        "ultimately",
        "power",
        "control",
        "think",
        "move",
        "capacity",
        "think",
        "want",
        "likewise",
        "use",
        "capacity",
        "disposition",
        "want",
        "quest",
        "evil",
        "c",
        "sure",
        "nature",
        "desire",
        "presented",
        "good",
        "st",
        "aae",
        "accordingly",
        "since",
        "ultimate",
        "happiness",
        "beatitudo",
        "good",
        "every",
        "respect",
        "human",
        "being",
        "appetite",
        "necessity",
        "happiness",
        "st",
        "aae",
        "c",
        "see",
        "regard",
        "specific",
        "course",
        "action",
        "always",
        "multiple",
        "perspective",
        "situation",
        "judged",
        "control",
        "think",
        "thingswhether",
        "instance",
        "decide",
        "focus",
        "rewarding",
        "thing",
        "would",
        "tiring",
        "would",
        "even",
        "case",
        "ultimate",
        "happiness",
        "moreover",
        "choose",
        "think",
        "even",
        "extreme",
        "case",
        "choice",
        "necessitated",
        "basis",
        "aquinas",
        "adamantly",
        "insists",
        "human",
        "freedom",
        "choice",
        "treat",
        "claim",
        "necessitated",
        "contrary",
        "faith",
        "subverting",
        "principle",
        "moral",
        "philosophy",
        "quest",
        "evil",
        "c",
        "point",
        "aquinas",
        "position",
        "fairly",
        "clear",
        "considerable",
        "controversy",
        "century",
        "however",
        "regarding",
        "whether",
        "aquinas",
        "want",
        "go",
        "characterize",
        "agency",
        "nondeterministicas",
        "word",
        "first",
        "undetermined",
        "cause",
        "free",
        "action",
        "within",
        "year",
        "death",
        "condemnation",
        "view",
        "sort",
        "came",
        "dominate",
        "scholastic",
        "philosophy",
        "yielding",
        "broad",
        "consensus",
        "held",
        "rise",
        "seventeenthcentury",
        "antischolasticism",
        "reader",
        "aquinas",
        "sharply",
        "divided",
        "however",
        "fit",
        "history",
        "first",
        "glance",
        "might",
        "seem",
        "obvious",
        "aquinas",
        "opponent",
        "determinism",
        "given",
        "adamant",
        "opposition",
        "necessitated",
        "yet",
        "aquinas",
        "writes",
        "time",
        "governing",
        "form",
        "aristotelianism",
        "drawn",
        "arabic",
        "tradition",
        "ibn",
        "sīnā",
        "ibn",
        "rushd",
        "explicitly",
        "deterministic",
        "general",
        "aquinas",
        "strives",
        "harmonize",
        "faith",
        "mainstream",
        "philosophical",
        "opinion",
        "particular",
        "show",
        "sign",
        "endorsing",
        "causal",
        "determinism",
        "applied",
        "created",
        "world",
        "thus",
        "ascribes",
        "ibn",
        "rushd",
        "commentator",
        "doctrine",
        "open",
        "way",
        "ad",
        "utrumlibet",
        "action",
        "follows",
        "unless",
        "inclined",
        "one",
        "way",
        "something",
        "else",
        "st",
        "a",
        "obj",
        "hastens",
        "reject",
        "principle",
        "applied",
        "god",
        "able",
        "determine",
        "freely",
        "god",
        "choice",
        "outside",
        "case",
        "god",
        "accepts",
        "principle",
        "cause",
        "contingent",
        "must",
        "determined",
        "effect",
        "something",
        "external",
        "ibid",
        "ad",
        "accordingly",
        "explicitly",
        "insists",
        "freedom",
        "require",
        "first",
        "cause",
        "instead",
        "characterizes",
        "operation",
        "entwined",
        "time",
        "operation",
        "intellect",
        "running",
        "backward",
        "agent",
        "history",
        "one",
        "cause",
        "preceding",
        "another",
        "way",
        "back",
        "god",
        "initial",
        "creation",
        "human",
        "soul",
        "quest",
        "evil",
        "st",
        "a",
        "ad",
        "st",
        "aae",
        "c",
        "insistence",
        "determining",
        "cause",
        "might",
        "seem",
        "fit",
        "well",
        "strict",
        "conception",
        "divine",
        "providence",
        "everything",
        "happens",
        "insofar",
        "brought",
        "back",
        "first",
        "divine",
        "cause",
        "found",
        "ordered",
        "rather",
        "exist",
        "accidentally",
        "even",
        "comparison",
        "cause",
        "found",
        "exist",
        "accidentally",
        "catholic",
        "faith",
        "say",
        "nothing",
        "world",
        "happens",
        "aimlessly",
        "fortuitously",
        "thing",
        "subject",
        "divine",
        "providence",
        "comm",
        "metaphys",
        "vi",
        "see",
        "goris",
        "reading",
        "aquinas",
        "causal",
        "determinism",
        "fit",
        "god",
        "preordained",
        "plan",
        "universe",
        "freedom",
        "thus",
        "compatible",
        "causal",
        "theological",
        "determinism",
        "hause",
        "kenny",
        "ch",
        "loughran",
        "pasnau",
        "ch",
        "shanley",
        "many",
        "scholar",
        "however",
        "denied",
        "aquinas",
        "sort",
        "compatibilist",
        "room",
        "doubt",
        "suggested",
        "passage",
        "first",
        "look",
        "support",
        "compatibilist",
        "account",
        "freedom",
        "necessarily",
        "require",
        "free",
        "first",
        "cause",
        "one",
        "thing",
        "cause",
        "another",
        "require",
        "first",
        "cause",
        "god",
        "first",
        "cause",
        "moving",
        "natural",
        "voluntary",
        "cause",
        "moving",
        "natural",
        "cause",
        "take",
        "away",
        "act",
        "natural",
        "moving",
        "voluntary",
        "cause",
        "take",
        "away",
        "action",
        "voluntary",
        "instead",
        "make",
        "work",
        "within",
        "thing",
        "accord",
        "character",
        "st",
        "a",
        "ad",
        "although",
        "passage",
        "begin",
        "way",
        "look",
        "friendly",
        "causal",
        "determinism",
        "passage",
        "go",
        "suggest",
        "situation",
        "complicated",
        "although",
        "god",
        "first",
        "cause",
        "voluntary",
        "action",
        "god",
        "efficacy",
        "different",
        "natural",
        "cause",
        "god",
        "somehow",
        "act",
        "way",
        "take",
        "away",
        "voluntariness",
        "aquinas",
        "take",
        "line",
        "explaining",
        "divine",
        "providence",
        "consistent",
        "human",
        "freedom",
        "st",
        "a",
        "c",
        "scg",
        "iii",
        "comm",
        "metaphys",
        "vi",
        "comm",
        "de",
        "interp",
        "i",
        "among",
        "think",
        "aquinas",
        "god",
        "leaf",
        "room",
        "indeterministic",
        "human",
        "agency",
        "remains",
        "fundamental",
        "difference",
        "opinion",
        "eg",
        "stump",
        "ch",
        "think",
        "freedom",
        "aquinas",
        "requires",
        "ultimate",
        "source",
        "first",
        "creaturely",
        "cause",
        "others",
        "think",
        "addition",
        "aquinas",
        "requires",
        "leeway",
        "choose",
        "among",
        "alternative",
        "possibility",
        "eg",
        "hoffmann",
        "michon",
        "either",
        "way",
        "libertarian",
        "reading",
        "aquinas",
        "likely",
        "stress",
        "claim",
        "selfmover",
        "move",
        "capacity",
        "also",
        "move",
        "quest",
        "evil",
        "c",
        "gallagher",
        "idea",
        "moreover",
        "aquinas",
        "urged",
        "first",
        "discussion",
        "free",
        "choice",
        "sentence",
        "commentary",
        "argued",
        "free",
        "choice",
        "possessed",
        "being",
        "determine",
        "end",
        "action",
        "toward",
        "end",
        "sentence",
        "iic",
        "sense",
        "free",
        "selfdetermining",
        "distinguishes",
        "natural",
        "nonvoluntary",
        "agent",
        "whose",
        "determination",
        "come",
        "without",
        "aquinas",
        "focus",
        "role",
        "selfdeterminationa",
        "tendency",
        "becomes",
        "prominent",
        "later",
        "worksmakes",
        "reasonable",
        "include",
        "thirteenthcentury",
        "movement",
        "away",
        "ancient",
        "intellectualism",
        "toward",
        "voluntaristic",
        "conception",
        "human",
        "nature",
        "emphasizing",
        "overarching",
        "control",
        "aquinas",
        "appeal",
        "critical",
        "importance",
        "various",
        "operation",
        "disposition",
        "act",
        "love",
        "foundational",
        "christian",
        "ethic",
        "operation",
        "disposition",
        "justice",
        "charitythe",
        "central",
        "virtue",
        "philosophy",
        "theology",
        "respectivelyare",
        "virtue",
        "clear",
        "aquinas",
        "go",
        "faras",
        "peter",
        "john",
        "olivi",
        "henry",
        "ghent",
        "scotus",
        "among",
        "many",
        "others",
        "soon",
        "wouldas",
        "exempt",
        "determinism",
        "agreed",
        "characterize",
        "rest",
        "natural",
        "world",
        "remains",
        "lively",
        "debate",
        "among",
        "scholar",
        "issue"
    ]
}