{
    "main_text": "Falsafa: Neoplatonized Aristotelianism in the Islamic World || The Definition and Form of Motion\n2.1 The Definition and Form of Motion\n\nThe above provides a very general outline of one of the prominent\nintellectual approaches to natural philosophy in the Arabic-speaking\nworld of the medieval period. The second major tradition of natural\nphilosophy, falsafa, had its origin in Aristotle’s physical\nwritings and the Graeco-Arabic commentary tradition that arose up\n around them.[4]\n Since natural philosophy, at least as it occurred in the\nGreek scientific tradition, is the study of natures, and natures are\ncauses of motion or change, understanding what motion is and the\nconditions necessary for motions within a broadly Aristotelian\nframework was the primary focus of natural philosophers working in the\nfalsafa tradition. Aristotle himself had defined motion as\n“the entelekheia of potential insofar as it is\nsuch” (Physics, III 1). One of the exegetical issues\nwith which earlier Greek commentaries struggled was how to understand\nthe enigmatic term entelekheia in Aristotle’s definition, a\nterm it would seem that Aristotle himself coined. Some argued that\nentelekheia must refer to a progression or process towards\nsome end or perfection. Others argued that entelekheia must\nrefer in some sense to the completed actuality of some partial end or\nperfection. The dispute in the ancient world, then, settled upon\nwhether entelekheia is itself a process term or not. If\nentelekheia is a process term then it is clear how\nAristotle’s definition of motion describes a process, but it does so\nby assuming a process term in the definition, whereas Aristotle’s\ndefinition of motion was intended to provide the most basic account of\nwhat a process is and so should not presuppose a process. If\nentelekheia is not a process term, then Aristotle’s\ndefinition avoids circularity, but it is no longer clear how it\ndescribes a process, since a completion or perfection is the end of a\nprocess, not a process itself. The above roughly presents a key\nphilosophical debate surrounding Aristotle’s definition of motion as\nit reached Arabic-speaking\n philosophers.[5]\n\nPart of this terminological issue was resolved by the Arabic\ntranslation of Aristotle’s Physics itself; for there\nAristotle’s definition is rendered “motion is the perfection\n(kamāl) of what is in potency inasmuch as it is such,”\nwhere the translation of entelekheia as\n‘perfection’ would decidedly bias Arabic-speaking\nAristotelians against the process interpretation of that term. Thus\nthe primary issue for these philosophers involved explaining how\nAristotle’s definition of motion actually describes a process. Perhaps\nthe most sophisticated solution to this issue was that of Avicenna,\nwho in effect argued for motion at an instant (Avicenna 2009, II.1,\n4–6; Hasnawi 2001; McGinnis\n 2006a).[6]\n Avicenna begins his analysis by distinguishing two senses of motion,\none of which might be termed ‘traversal-motion’ and the\nother ‘intermedial-motion’. Traversal-motion occurs when\none observes an object in two different, opposing states, for example,\nbeing here and then being there. Now in the world, a\nmoving object is not simultaneously partially here and partially there\nduring its motion. Consequently, in the world, motion is not some\ncontinuous thing that at any moment actually extends between here and\nthere in the way that the distance continuously extends between two\npoints; rather, the relation between these two states is impressed\nupon the mind, and it is this mental impression that gives rise to the\nidea of traversal-motion, that is, the idea of motion as a continuous\nextended magnitude.\n\nAs for intermedial-motion, that is, the motion that exists\nextra-mentally, here is where Avicenna’s novel analysis of motion at\nan instant comes to play. He first notes that the perfection in\nquestion in Aristotle’s definition could not refer either to the\nstarting point or to the ending point of the motion, since in the\nfirst case the motion has not yet begun and in the second case the\nmotion is already completed. Thus the perfection must refer to some\nperfection of the moving object while it is in an intermediate state\nbetween these two extremes. So, for example, an object moving between\nx and z is not in motion at either x or\nz, but only while it is in the space between x and\nz. That intermediate state, in turn, could refer either to\nthe whole continuous medium between the two extremes or to a point.\nSo, again, the intermediary state might refer to the whole of the\nmotion along the entire continuous distance between x and\nz or to the moving object’s being at one or another single\npoint along the distance, as for example, y. Avicenna next\nobserved that at every instant during a moving object’s continuous\nmotion it is moving, and yet there is no instant at which the whole of\nthe motion exists as some extended magnitude. Thus the perfection in\nthe definition of motion must refer to the perfection of the moving\nthing at one or another point between the starting and ending points,\nalbeit, as the moving thing is at that point for only an instant. It\nis the very fact that the moving object is only at the intermediate\npoint for precisely an instant that guarantees that the object is\nundergoing motion; for should it remain at some point for more than an\ninstant, and so for a period of time, the object would in fact be at\nrest at that point.\n\nNot all were pleased with Avicenna’s interpretation of Aristotle’s\ndefinition of motion and some authors challenged not merely Avicenna\nbut even the need for Aristotle’s own recondite definition of motion\nin term of an entelekheia. Such an attitude was certainly the\ncase in the Islamic East during the period immediately following\nAvicenna as witnessed in the works of Abū l-Barakāt al-Baghdādī (d.\n1165) and Fakhr al-Dīn al-Rāzī (d. 1209). Abū l-Barakāt, although part\nof the falsafa tradition, was also a critical reader of both\nAristotle and Avicenna, whereas Fakhr al-Dīn al-Rāzī, while working\nwithin the kalām tradition seriously engaged the philosophers\nand even wrote a commentary on one of Avicenna’s shorter philosophical\nencyclopedias. They preferred to define motion as a gradual or\nnot-all-at-once emergence from potency to act. Avicenna himself had\nconsidered this definition but found it wanting. Specifically,\nAvicenna complained that this definition is ultimately circular\n(Avicenna, 2009, II.1, 3). Thus he noted that gradual/not-all-at-once\nare understood in terms of time, and time, following Aristotle, is\ndefined in terms of motion, namely, as the measure of motion\nwith respect to before an after. Consequently, complains Avicenna, an\nunderstanding of time requires that one already understand motion, but\nthe suggested understanding of motion appeals to an understanding of\ntime. In response to this objection, Abū l-Barakāt noted that both\nAristotle (Posterior Analytics, 1.13, 78a22–b32) and\nAvicenna (Kitāb al-burhān, III.2, 202–3) recognize a\ndifference between something’s being better known to us and\nbeing better known by nature. Something is better known to\nus, if it is a matter of direct sensible observation, whereas it is\nbetter known by nature if one grasps the underlying causal\nexplanation. The standard example is drawn from the observation that\nwhat is near does not twinkle, and the planets do not twinkling. Thus\nAristotle and Avicenna observe that from the fact that the planets do\nnot twinkle (a fact better known to us) one can infer that the planets\nare near. One can then convert this conclusion and use it a\ndemonstration that causally explains why the planets do not twinkle,\nnamely, because they are near (now a fact better known by nature). The\nappearance of circularity is purportedly illusory, since in the two\ninferences, the premises are not being used in the same way: in one\ncase the premise explains something better known to us and in the\nother something better known by nature. Whether one accepts Aristotle\nand Avicenna’s analysis is less important than that both of them\nseemed committed to it, and Abū l-Barakāt exploits this fact. He\nargues that the supposed circularity underlying defining motion in\nterms of the gradual emergence from potency to actuality is nothing\nmore than a case of a conversion from something better-known-to-us to\nsomething better-known-by-nature.\n\ntime-better-known-to-us ↠ motion\nmotion ↠ time-better-known-by-nature\n\n\nFakhr al-Dīn al-Rāzī in his al-Mabāḥith al-mashriqiyya,\nmoreover, approvingly repeats Abū l-Barakāt’s suggestion:\n\n\nConceptualizing the true nature of “all-at-once,”\n“not-all-at-once” and “gradual” are all\nprimitive conceptualizations owing to the aid of sensation. Sure, we\nunderstand that these things are known only by reason of the now and\ntime, but that requires a demonstration. It is possible that the true\nnature of motion is known by these things, and thereafter motion fixes\na knowledge of time and the now, which are reasons for those first\nthings’ being conceptualized, but in that case no circle is entailed.\nThis is a fine answer. (ar-Rāzī, Fakhr al-Dīn, 1990, vol. 1, 670)\n\n\nAl-Rāzī’s idea, like Abū l-Barakāt’s, is that notions like all-at-once\nand gradual are known immediately through sensation. While it is true\nthat time and the now, respectively, provide the basis in reality for\nour perceptions of things emerging gradually or all-at-once, such a\nrelation must be demonstrated and is not immediate. Since the notions\nof gradual and all-at-once are immediate, they can provide us with the\ntrue nature of what motion is. Having identified what motion is, one\ncan use it then to define time and so explain the gradual and the\nlike.\n\nAbū l-Barakāt and al-Rāzī’s definition of motion was in turn picked up\nby the polymath, Athīr al-Dīn al-Abharī (d. 1262 or 1265), who used it\nin his highly successful textbook of natural philosophy, Hidayat\nal-ḥikma. The definition would be common at least until it was\nchallenged by the great Shia philosopher and theologian, Mullā Ṣadrā\n(d. 1636). Drawing on Avicenna’s earlier account of motion, which\nMullā Ṣadrā defends at least in his Sharḥ al-Hidaya (Mullā Ṣadrā, 2001, 103–105), he reminds his reader that motion is\nitself an equivocal term and is said in no less than two ways:\ntraversal-motion and intermedial-motion. Abū l-Barakāt and Fakhr\nal-Dīn al-Rāzī’s rejoinder to Avicenna’s original charge of\ncircularity works, observes Mullā Ṣadrā, only if the sense of motion\nis the same in the two converted premises. They are not maintains\nMullā Ṣadrā. While it is true that time-better-know-to-us can be used\nto understand motion, the motion in question is traversal-motion, that\nis, the idea of motion that, according to Avicenna, exists only\nmentally. In contrast, the sense of motion used to explain the nature\nof time is not traversal-motion but intermedial-motion, that is, the\nextra-mental motion that exists in the world. Thus the actual premises\nare not those noted by Abū l-Barakāt and Fakhr al-Dīn al-Rāzī, but the\nfollowing two:\n\ntime-better-know-to-us ↠ traversal-motion\nintermedial-motion ↠ time-better-known-by-nature\n\n\nThe conversion thus does not go through, since none of the terms in\nthe two premises are common. Mullā Sạdrā then concludes his account of\nmotion by repeating and defending Avicenna’s idea that the form of\nmotion as it exists in the world involves motion at an instant, and it\nis this account that comes to predominate in the Muslim East\n(certainly Muslim India) until at least as late as the 1850s. (For a discussion of Avicenna’s conception of motion and the post-Avicennan reception of that definition see McGinnis (2018).)\n",
    "section_title": "2.1 The Definition and Form of Motion",
    "entry_title": "Arabic and Islamic Natural Philosophy and Natural Science",
    "hierarchy_title": "Arabic and Islamic Natural Philosophy and Natural Science || Falsafa: Neoplatonized Aristotelianism in the Islamic World || The Definition and Form of Motion",
    "tokenized_text": [
        "falsafa",
        "neoplatonized",
        "aristotelianism",
        "islamic",
        "world",
        "definition",
        "form",
        "motion",
        "definition",
        "form",
        "motion",
        "provides",
        "general",
        "outline",
        "one",
        "prominent",
        "intellectual",
        "approach",
        "natural",
        "philosophy",
        "arabicspeaking",
        "world",
        "medieval",
        "period",
        "second",
        "major",
        "tradition",
        "natural",
        "philosophy",
        "falsafa",
        "origin",
        "aristotle",
        "physical",
        "writing",
        "graecoarabic",
        "commentary",
        "tradition",
        "arose",
        "around",
        "since",
        "natural",
        "philosophy",
        "least",
        "occurred",
        "greek",
        "scientific",
        "tradition",
        "study",
        "nature",
        "nature",
        "cause",
        "motion",
        "change",
        "understanding",
        "motion",
        "condition",
        "necessary",
        "motion",
        "within",
        "broadly",
        "aristotelian",
        "framework",
        "primary",
        "focus",
        "natural",
        "philosopher",
        "working",
        "falsafa",
        "tradition",
        "aristotle",
        "defined",
        "motion",
        "entelekheia",
        "potential",
        "insofar",
        "physic",
        "iii",
        "one",
        "exegetical",
        "issue",
        "earlier",
        "greek",
        "commentary",
        "struggled",
        "understand",
        "enigmatic",
        "term",
        "entelekheia",
        "aristotle",
        "definition",
        "term",
        "would",
        "seem",
        "aristotle",
        "coined",
        "argued",
        "entelekheia",
        "must",
        "refer",
        "progression",
        "process",
        "towards",
        "end",
        "perfection",
        "others",
        "argued",
        "entelekheia",
        "must",
        "refer",
        "sense",
        "completed",
        "actuality",
        "partial",
        "end",
        "perfection",
        "dispute",
        "ancient",
        "world",
        "settled",
        "upon",
        "whether",
        "entelekheia",
        "process",
        "term",
        "entelekheia",
        "process",
        "term",
        "clear",
        "aristotle",
        "definition",
        "motion",
        "describes",
        "process",
        "assuming",
        "process",
        "term",
        "definition",
        "whereas",
        "aristotle",
        "definition",
        "motion",
        "intended",
        "provide",
        "basic",
        "account",
        "process",
        "presuppose",
        "process",
        "entelekheia",
        "process",
        "term",
        "aristotle",
        "definition",
        "avoids",
        "circularity",
        "longer",
        "clear",
        "describes",
        "process",
        "since",
        "completion",
        "perfection",
        "end",
        "process",
        "process",
        "roughly",
        "present",
        "key",
        "philosophical",
        "debate",
        "surrounding",
        "aristotle",
        "definition",
        "motion",
        "reached",
        "arabicspeaking",
        "philosopher",
        "part",
        "terminological",
        "issue",
        "resolved",
        "arabic",
        "translation",
        "aristotle",
        "physic",
        "aristotle",
        "definition",
        "rendered",
        "motion",
        "perfection",
        "kamāl",
        "potency",
        "inasmuch",
        "translation",
        "entelekheia",
        "perfection",
        "would",
        "decidedly",
        "bias",
        "arabicspeaking",
        "aristotelian",
        "process",
        "interpretation",
        "term",
        "thus",
        "primary",
        "issue",
        "philosopher",
        "involved",
        "explaining",
        "aristotle",
        "definition",
        "motion",
        "actually",
        "describes",
        "process",
        "perhaps",
        "sophisticated",
        "solution",
        "issue",
        "avicenna",
        "effect",
        "argued",
        "motion",
        "instant",
        "avicenna",
        "ii",
        "hasnawi",
        "mcginnis",
        "a",
        "avicenna",
        "begin",
        "analysis",
        "distinguishing",
        "two",
        "sens",
        "motion",
        "one",
        "might",
        "termed",
        "traversalmotion",
        "intermedialmotion",
        "traversalmotion",
        "occurs",
        "one",
        "observes",
        "object",
        "two",
        "different",
        "opposing",
        "state",
        "example",
        "world",
        "moving",
        "object",
        "simultaneously",
        "partially",
        "partially",
        "motion",
        "consequently",
        "world",
        "motion",
        "continuous",
        "thing",
        "moment",
        "actually",
        "extends",
        "way",
        "distance",
        "continuously",
        "extends",
        "two",
        "point",
        "rather",
        "relation",
        "two",
        "state",
        "impressed",
        "upon",
        "mind",
        "mental",
        "impression",
        "give",
        "rise",
        "idea",
        "traversalmotion",
        "idea",
        "motion",
        "continuous",
        "extended",
        "magnitude",
        "intermedialmotion",
        "motion",
        "exists",
        "extramentally",
        "avicenna",
        "novel",
        "analysis",
        "motion",
        "instant",
        "come",
        "play",
        "first",
        "note",
        "perfection",
        "question",
        "aristotle",
        "definition",
        "could",
        "refer",
        "either",
        "starting",
        "point",
        "ending",
        "point",
        "motion",
        "since",
        "first",
        "case",
        "motion",
        "yet",
        "begun",
        "second",
        "case",
        "motion",
        "already",
        "completed",
        "thus",
        "perfection",
        "must",
        "refer",
        "perfection",
        "moving",
        "object",
        "intermediate",
        "state",
        "two",
        "extreme",
        "example",
        "object",
        "moving",
        "x",
        "z",
        "motion",
        "either",
        "x",
        "z",
        "space",
        "x",
        "z",
        "intermediate",
        "state",
        "turn",
        "could",
        "refer",
        "either",
        "whole",
        "continuous",
        "medium",
        "two",
        "extreme",
        "point",
        "intermediary",
        "state",
        "might",
        "refer",
        "whole",
        "motion",
        "along",
        "entire",
        "continuous",
        "distance",
        "x",
        "z",
        "moving",
        "object",
        "one",
        "another",
        "single",
        "point",
        "along",
        "distance",
        "example",
        "y",
        "avicenna",
        "next",
        "observed",
        "every",
        "instant",
        "moving",
        "object",
        "continuous",
        "motion",
        "moving",
        "yet",
        "instant",
        "whole",
        "motion",
        "exists",
        "extended",
        "magnitude",
        "thus",
        "perfection",
        "definition",
        "motion",
        "must",
        "refer",
        "perfection",
        "moving",
        "thing",
        "one",
        "another",
        "point",
        "starting",
        "ending",
        "point",
        "albeit",
        "moving",
        "thing",
        "point",
        "instant",
        "fact",
        "moving",
        "object",
        "intermediate",
        "point",
        "precisely",
        "instant",
        "guarantee",
        "object",
        "undergoing",
        "motion",
        "remain",
        "point",
        "instant",
        "period",
        "time",
        "object",
        "would",
        "fact",
        "rest",
        "point",
        "pleased",
        "avicenna",
        "interpretation",
        "aristotle",
        "definition",
        "motion",
        "author",
        "challenged",
        "merely",
        "avicenna",
        "even",
        "need",
        "aristotle",
        "recondite",
        "definition",
        "motion",
        "term",
        "entelekheia",
        "attitude",
        "certainly",
        "case",
        "islamic",
        "east",
        "period",
        "immediately",
        "following",
        "avicenna",
        "witnessed",
        "work",
        "abū",
        "lbarakāt",
        "albaghdādī",
        "d",
        "fakhr",
        "aldīn",
        "alrāzī",
        "d",
        "abū",
        "lbarakāt",
        "although",
        "part",
        "falsafa",
        "tradition",
        "also",
        "critical",
        "reader",
        "aristotle",
        "avicenna",
        "whereas",
        "fakhr",
        "aldīn",
        "alrāzī",
        "working",
        "within",
        "kalām",
        "tradition",
        "seriously",
        "engaged",
        "philosopher",
        "even",
        "wrote",
        "commentary",
        "one",
        "avicenna",
        "shorter",
        "philosophical",
        "encyclopedia",
        "preferred",
        "define",
        "motion",
        "gradual",
        "notallatonce",
        "emergence",
        "potency",
        "act",
        "avicenna",
        "considered",
        "definition",
        "found",
        "wanting",
        "specifically",
        "avicenna",
        "complained",
        "definition",
        "ultimately",
        "circular",
        "avicenna",
        "ii",
        "thus",
        "noted",
        "gradualnotallatonce",
        "understood",
        "term",
        "time",
        "time",
        "following",
        "aristotle",
        "defined",
        "term",
        "motion",
        "namely",
        "measure",
        "motion",
        "respect",
        "consequently",
        "complains",
        "avicenna",
        "understanding",
        "time",
        "requires",
        "one",
        "already",
        "understand",
        "motion",
        "suggested",
        "understanding",
        "motion",
        "appeal",
        "understanding",
        "time",
        "response",
        "objection",
        "abū",
        "lbarakāt",
        "noted",
        "aristotle",
        "posterior",
        "analytics",
        "ab",
        "avicenna",
        "kitāb",
        "alburhān",
        "iii",
        "recognize",
        "difference",
        "something",
        "better",
        "known",
        "u",
        "better",
        "known",
        "nature",
        "something",
        "better",
        "known",
        "u",
        "matter",
        "direct",
        "sensible",
        "observation",
        "whereas",
        "better",
        "known",
        "nature",
        "one",
        "grasp",
        "underlying",
        "causal",
        "explanation",
        "standard",
        "example",
        "drawn",
        "observation",
        "near",
        "twinkle",
        "planet",
        "twinkling",
        "thus",
        "aristotle",
        "avicenna",
        "observe",
        "fact",
        "planet",
        "twinkle",
        "fact",
        "better",
        "known",
        "u",
        "one",
        "infer",
        "planet",
        "near",
        "one",
        "convert",
        "conclusion",
        "use",
        "demonstration",
        "causally",
        "explains",
        "planet",
        "twinkle",
        "namely",
        "near",
        "fact",
        "better",
        "known",
        "nature",
        "appearance",
        "circularity",
        "purportedly",
        "illusory",
        "since",
        "two",
        "inference",
        "premise",
        "used",
        "way",
        "one",
        "case",
        "premise",
        "explains",
        "something",
        "better",
        "known",
        "u",
        "something",
        "better",
        "known",
        "nature",
        "whether",
        "one",
        "accepts",
        "aristotle",
        "avicenna",
        "analysis",
        "le",
        "important",
        "seemed",
        "committed",
        "abū",
        "lbarakāt",
        "exploit",
        "fact",
        "argues",
        "supposed",
        "circularity",
        "underlying",
        "defining",
        "motion",
        "term",
        "gradual",
        "emergence",
        "potency",
        "actuality",
        "nothing",
        "case",
        "conversion",
        "something",
        "betterknowntous",
        "something",
        "betterknownbynature",
        "timebetterknowntous",
        "motion",
        "motion",
        "timebetterknownbynature",
        "fakhr",
        "aldīn",
        "alrāzī",
        "almabāhith",
        "almashriqiyya",
        "moreover",
        "approvingly",
        "repeat",
        "abū",
        "lbarakāt",
        "suggestion",
        "conceptualizing",
        "true",
        "nature",
        "allatonce",
        "notallatonce",
        "gradual",
        "primitive",
        "conceptualization",
        "owing",
        "aid",
        "sensation",
        "sure",
        "understand",
        "thing",
        "known",
        "reason",
        "time",
        "requires",
        "demonstration",
        "possible",
        "true",
        "nature",
        "motion",
        "known",
        "thing",
        "thereafter",
        "motion",
        "fix",
        "knowledge",
        "time",
        "reason",
        "first",
        "thing",
        "conceptualized",
        "case",
        "circle",
        "entailed",
        "fine",
        "answer",
        "arrāzī",
        "fakhr",
        "aldīn",
        "vol",
        "alrāzī",
        "idea",
        "like",
        "abū",
        "lbarakāt",
        "notion",
        "like",
        "allatonce",
        "gradual",
        "known",
        "immediately",
        "sensation",
        "true",
        "time",
        "respectively",
        "provide",
        "basis",
        "reality",
        "perception",
        "thing",
        "emerging",
        "gradually",
        "allatonce",
        "relation",
        "must",
        "demonstrated",
        "immediate",
        "since",
        "notion",
        "gradual",
        "allatonce",
        "immediate",
        "provide",
        "u",
        "true",
        "nature",
        "motion",
        "identified",
        "motion",
        "one",
        "use",
        "define",
        "time",
        "explain",
        "gradual",
        "like",
        "abū",
        "lbarakāt",
        "alrāzī",
        "definition",
        "motion",
        "turn",
        "picked",
        "polymath",
        "athīr",
        "aldīn",
        "alabharī",
        "d",
        "used",
        "highly",
        "successful",
        "textbook",
        "natural",
        "philosophy",
        "hidayat",
        "alhikma",
        "definition",
        "would",
        "common",
        "least",
        "challenged",
        "great",
        "shia",
        "philosopher",
        "theologian",
        "mullā",
        "sadrā",
        "d",
        "drawing",
        "avicenna",
        "earlier",
        "account",
        "motion",
        "mullā",
        "sadrā",
        "defends",
        "least",
        "sharh",
        "alhidaya",
        "mullā",
        "sadrā",
        "reminds",
        "reader",
        "motion",
        "equivocal",
        "term",
        "said",
        "le",
        "two",
        "way",
        "traversalmotion",
        "intermedialmotion",
        "abū",
        "lbarakāt",
        "fakhr",
        "aldīn",
        "alrāzī",
        "rejoinder",
        "avicenna",
        "original",
        "charge",
        "circularity",
        "work",
        "observes",
        "mullā",
        "sadrā",
        "sense",
        "motion",
        "two",
        "converted",
        "premise",
        "maintains",
        "mullā",
        "sadrā",
        "true",
        "timebetterknowtous",
        "used",
        "understand",
        "motion",
        "motion",
        "question",
        "traversalmotion",
        "idea",
        "motion",
        "according",
        "avicenna",
        "exists",
        "mentally",
        "contrast",
        "sense",
        "motion",
        "used",
        "explain",
        "nature",
        "time",
        "traversalmotion",
        "intermedialmotion",
        "extramental",
        "motion",
        "exists",
        "world",
        "thus",
        "actual",
        "premise",
        "noted",
        "abū",
        "lbarakāt",
        "fakhr",
        "aldīn",
        "alrāzī",
        "following",
        "two",
        "timebetterknowtous",
        "traversalmotion",
        "intermedialmotion",
        "timebetterknownbynature",
        "conversion",
        "thus",
        "go",
        "since",
        "none",
        "term",
        "two",
        "premise",
        "common",
        "mullā",
        "sadrā",
        "concludes",
        "account",
        "motion",
        "repeating",
        "defending",
        "avicenna",
        "idea",
        "form",
        "motion",
        "exists",
        "world",
        "involves",
        "motion",
        "instant",
        "account",
        "come",
        "predominate",
        "muslim",
        "east",
        "certainly",
        "muslim",
        "india",
        "least",
        "late",
        "s",
        "discussion",
        "avicenna",
        "conception",
        "motion",
        "postavicennan",
        "reception",
        "definition",
        "see",
        "mcginnis"
    ]
}