{
    "main_text": "The Problem of evil\n5. The Problem of evil\n\nOne of the important problems for Abrahamic religions is to explain\nthe presence of evil given the assumption that an all-wise, all-just,\nall-powerful and all-loving God created and is continuously conserving\nthe world. Modern philosophical discussions of the so-called problem\nof evil frequently focus on whether the presence of evil provides\nevidence against the existence of such a God, and so against classical\nmonotheism more generally. In contrast, for medieval Muslim\nphilosophers and theologians, the existence of God was never in\nquestion. Instead, ‘the problem’ of evil for these\nthinkers is a cluster of related issues, not the least of which is\n“What is evil?” and “Is our world the best possible\nworld?” Additionally, these thinkers wanted to reconcile the\ndivine attributes with the presence of evil or to determine which of\nthe divine attributes, particularly between divine justice and\nGod’s omnipotence, trumps the others.\n\nOne strategy for explaining the presence of evil was to emphasize\nGod’s transcendence and sovereignty over the universe.\nConsidering human actions, we judge that some cases of causing others\npain are justified, e.g., in disciplining someone or administering\njustice, while others are not, e.g., gratuitous violence. Given the\nbelief that God created the universe and controls the course of events\nin the world, how can we explain the suffering that animals,\nespecially humans, undergo? In this regard, some argued that the\nethical rules applicable among humans are not applicable to God.\nSupporters of this account, predeterminists (jabriyya),\nemphasize that the relation between God and the universe is one\nbetween property and owner. Just as a person can do what he wants with\nhis property, so also God has the right to treat his property in\nwhatever way he wants (ʿAbd al-Jabbār SUK: 483–5).\nAbū al-Ḥasan ʿAlī b. Ismāʿīl\nal-Ashʿarī (d. 935/6), founder of the Ashʿarite\ntheological school, seems to have defended such a position at an early\nstage in his career. He highlights God’s absolute control over\nthe course of events in the world (Ashʿarī EIF: 50–1).\nThus, the suffering that affects animals and humans, does not need any\nfurther justification, since the universe is God’s property and\nGod can treat creatures the way he pleases. He can punish an innocent\nperson and can hold people responsible to do that which they cannot do\n(Ashʿarī EIF: 111–13).\n\nInstead of emphasizing God’s sovereignty over creation, another\napproach, which is usually associated with Muʿtazilite\ntheologians, is to consider if there is any reason that justifies an\ninstance of suffering independent of whether the cause of that\nsuffering is God or a human agent (see Hourani 1971 and Vasalou 2008).\nIf one understands evil as unjustified suffering, then in such cases\nof suffering where there is a valid justification—like a certain\nderived benefit or as punishment—the suffering cannot be\nconsidered evil, at least not in the sense of unjustified suffering\n(ʿAbd al-Jabbār SUK: 485–6). Consequently, in\nconsidering whether some case of suffering is evil, one must take into\naccount, not only the conditions of the agent, that is, whether God or\na creature caused it, but also whether there are justifying reasons\nfor the suffering. Since God is good and just, there must be reasons\njustifying any instance of suffering that is traced back to the divine\naction—excluding human free actions. Muʿtazilite\ntheologians identified some of these reason as compensation\n(ʿiwaḍ), admonition (ʿibr),\npunishment, some kind of benefit (maṣlaḥa) or\neven grace (luṭf) (ʿAbd al-Jabbār SUK:\n487–9 and Ibn al-Malāhimī al-Fāʾiq,\n261–74). Thus, the Muʿtazilite theologians argued that the\nexistence of suffering in the world is compatible with the goodness,\ngenerosity and justice of God.\n\nThe standards by which Muʿtazilite theologians evaluate what is\ngood and just is the same for both God and humans. Their objective\nstandard of goodness and justice had further implications about the\npresence of evil in our world. One notable implication is that God\nmust do what is best (aṣlaḥ). Initially certain\nMuʿtazilites maintained that God must do what is best only in\nreligious matters, namely, commands and prohibitions (Ibn Mattawayh\nal-Tadhkira, II, 332–3, 360). Ultimately, most\nMuʿtazilite theologians came to agree that since God is generous\nand good, he does what is best in all his actions, whether religious\nmatters or creating and ordering the universe (Ibn\nal-Malāhimī al-Fāʾiq, 119 and ʿAbd\nal-Jabbār al-Aṣlaḥ: XIV, 53). Consequently,\neven if the Muʿtazilite theologians do not emphasize this\nimplication, for them this world is the best possible world.\n\nThe Neoplatonic-inspired philosophers, like Fārābī and\nIbn Sīnā, had yet another strategy to explain the presence\nof evil, which Ibn Sīnā exemplifies well\n(Fārābī al-Taʿlīqāt, §39\nand Avicenna MetaH: 9.6, 339–47). Ibn Sīnā takes up\nthe problem of evil within the context of divine providence (see above\n §3.2.1).\n The question is how can the existence of evil in the universe be\nexplained, if the whole universe emanates from an absolutely good God?\nFollowing the Neoplatonist tradition, he associates goodness with\nexistence or being and evil with non-being or the imperfection of\nbeing proper to a thing. Since evil is in a sense a non-thing, and the\nnon-existent does not have a cause, it is a category mistake to ask\nwhat is the cause of evil absolutely speaking or to suggest that God\ncauses. it.\n\nStill, Ibn Sīnā recognizes that some apparent evils, most\nnotably suffering, cannot simply be reduced to imperfections and the\nprivation of a proper existence. There are events, or conditions, that\nactively can cause suffering. Ibn Sīnā argues that evil as\nsuffering is applicable only to a small part of the whole universe,\nand yet is indispensable to that part, a ‘necessary evil’,\nif you will. This part of the universe consists of things that are\nsubject to generation and corruption. The sphere of generation and\ncorruption, according to Neoplatonic cosmology, is limited to the\nEarth, its inhabitants and the immediate atmosphere enveloping the\nEarth. Thus, in order for there to be absolutely no evil in the entire\ncosmos the sphere of generation and corruption either would have\nneeded not to exist or to be deprived of the properties that make\ngenerable and corruptible things what they are. Divine providence\nprecludes both options, Ibn Sīnā argues, for roughly the\nsame reason in both cases, namely, the universe overall would be less\ngood than it actually is, even given the presence of some evil. An\nexample drawn from Ibn Sīnā clarifies his point. Certainly,\na poor man who loses his family and possessions to a fire, suffers an\nevil. Yet the fact that fire is essentially hot, so as to cook flesh\nand to burn wood, is in itself good. Likewise, that wood and flesh are\nessentially such as to be cooked by fire are in themselves good. To\neliminate fire’s power to burn and the powers by which wood and\nflesh are cooked is to eliminate those very things. Thus, to eliminate\nthe possibility of this kind of suffering would be to eliminate an\nentire class of existents, namely, those subject to generation and\ncorruption. Consequently, an entire class of objective good in the\nuniverse would be lost, and so make the world overall less good. For\nIbn Sīnā, such a loss is simply incompatible with his\nconception of divine providence, God is ultimately the source of an\norder that is the most perfectly possible commensurate with the chain\nof all possible existents.\n\nWhile both Ibn Sīnā’s and the Muʿtazilite\nexplanations of the presence of evil imply that God has created the\nbest possible world, neither explicitly make this claim in their\nworks. It was Ghazālī, who explicitly argued that the actual\nworld is the best of all possible worlds (see Ormsby 1984). “In\nthe realm of the possible”, Ghazālī assures us,\n\n\nthere is nothing at all more wondrously beautiful than [this world]\nnor more complete nor more perfect (laysa fī-l-imkān\nabdaʿ aṣlan aḥsana minhu wa lā atamma wa lā\nakmala)\n\n\nor as it was popularized in the rhyming couplet,\n\n\nIn the realm of all the possible, nothing than what is is more\nwonderful. (laysa fī-l-imkān abdaʿ mimmā\nkān) (Ghazālī FDU: 45–6 and\nGhazālī Forty Principles, 259)\n\n\nThe imperfection that we see in the world is a result of the limits of\nour knowledge. The reason that this must be the best possible world is\nbecause if a better universe were possible and God did not create it,\nyet could have created it, he would have been miserly; however, God is\nomnibenevolent, and so this claim must be false. If God did not create\nthis purportedly better possible world because he could not do so,\nthen God would be impotent in some respect; however, God is\nomnipotent, and so this claim must be false. In short, none of these\nor similar options for explaining a less than optimal world are\nacceptable, for they all impugn God’s majesty. To be sure,\nGhazālī is not claiming that there is no evil in the world;\nrather, for him, evil, as imperfection and suffering, is an essential\ningredient of the perfection of the world. While we might not fully\nrecognize how certain specific cases of evil contribute to the\nworld’s overall perfection, nonetheless, those very\nimperfections can help one appreciate the contrasting good in the\nworld. Thus the actual universe, with the evil included in it, is the\nbest possible universe.\n",
    "section_title": "5. The Problem of evil",
    "entry_title": "Arabic and Islamic Philosophy of Religion",
    "hierarchy_title": "Arabic and Islamic Philosophy of Religion || The Problem of evil",
    "tokenized_text": [
        "problem",
        "evil",
        "problem",
        "evil",
        "one",
        "important",
        "problem",
        "abrahamic",
        "religion",
        "explain",
        "presence",
        "evil",
        "given",
        "assumption",
        "allwise",
        "alljust",
        "allpowerful",
        "allloving",
        "god",
        "created",
        "continuously",
        "conserving",
        "world",
        "modern",
        "philosophical",
        "discussion",
        "socalled",
        "problem",
        "evil",
        "frequently",
        "focus",
        "whether",
        "presence",
        "evil",
        "provides",
        "evidence",
        "existence",
        "god",
        "classical",
        "monotheism",
        "generally",
        "contrast",
        "medieval",
        "muslim",
        "philosopher",
        "theologian",
        "existence",
        "god",
        "never",
        "question",
        "instead",
        "problem",
        "evil",
        "thinker",
        "cluster",
        "related",
        "issue",
        "least",
        "evil",
        "world",
        "best",
        "possible",
        "world",
        "additionally",
        "thinker",
        "wanted",
        "reconcile",
        "divine",
        "attribute",
        "presence",
        "evil",
        "determine",
        "divine",
        "attribute",
        "particularly",
        "divine",
        "justice",
        "god",
        "omnipotence",
        "trump",
        "others",
        "one",
        "strategy",
        "explaining",
        "presence",
        "evil",
        "emphasize",
        "god",
        "transcendence",
        "sovereignty",
        "universe",
        "considering",
        "human",
        "action",
        "judge",
        "case",
        "causing",
        "others",
        "pain",
        "justified",
        "eg",
        "disciplining",
        "someone",
        "administering",
        "justice",
        "others",
        "eg",
        "gratuitous",
        "violence",
        "given",
        "belief",
        "god",
        "created",
        "universe",
        "control",
        "course",
        "event",
        "world",
        "explain",
        "suffering",
        "animal",
        "especially",
        "human",
        "undergo",
        "regard",
        "argued",
        "ethical",
        "rule",
        "applicable",
        "among",
        "human",
        "applicable",
        "god",
        "supporter",
        "account",
        "predeterminists",
        "jabriyya",
        "emphasize",
        "relation",
        "god",
        "universe",
        "one",
        "property",
        "owner",
        "person",
        "want",
        "property",
        "also",
        "god",
        "right",
        "treat",
        "property",
        "whatever",
        "way",
        "want",
        "ʿabd",
        "aljabbār",
        "suk",
        "abū",
        "alḥasan",
        "ʿalī",
        "b",
        "ismāʿīl",
        "alashʿarī",
        "d",
        "founder",
        "ashʿarite",
        "theological",
        "school",
        "seems",
        "defended",
        "position",
        "early",
        "stage",
        "career",
        "highlight",
        "god",
        "absolute",
        "control",
        "course",
        "event",
        "world",
        "ashʿarī",
        "eif",
        "thus",
        "suffering",
        "affect",
        "animal",
        "human",
        "need",
        "justification",
        "since",
        "universe",
        "god",
        "property",
        "god",
        "treat",
        "creature",
        "way",
        "plea",
        "punish",
        "innocent",
        "person",
        "hold",
        "people",
        "responsible",
        "ashʿarī",
        "eif",
        "instead",
        "emphasizing",
        "god",
        "sovereignty",
        "creation",
        "another",
        "approach",
        "usually",
        "associated",
        "muʿtazilite",
        "theologian",
        "consider",
        "reason",
        "justifies",
        "instance",
        "suffering",
        "independent",
        "whether",
        "cause",
        "suffering",
        "god",
        "human",
        "agent",
        "see",
        "hourani",
        "vasalou",
        "one",
        "understands",
        "evil",
        "unjustified",
        "suffering",
        "case",
        "suffering",
        "valid",
        "justificationlike",
        "certain",
        "derived",
        "benefit",
        "punishmentthe",
        "suffering",
        "considered",
        "evil",
        "least",
        "sense",
        "unjustified",
        "suffering",
        "ʿabd",
        "aljabbār",
        "suk",
        "consequently",
        "considering",
        "whether",
        "case",
        "suffering",
        "evil",
        "one",
        "must",
        "take",
        "account",
        "condition",
        "agent",
        "whether",
        "god",
        "creature",
        "caused",
        "also",
        "whether",
        "justifying",
        "reason",
        "suffering",
        "since",
        "god",
        "good",
        "must",
        "reason",
        "justifying",
        "instance",
        "suffering",
        "traced",
        "back",
        "divine",
        "actionexcluding",
        "human",
        "free",
        "action",
        "muʿtazilite",
        "theologian",
        "identified",
        "reason",
        "compensation",
        "ʿiwaḍ",
        "admonition",
        "ʿibr",
        "punishment",
        "kind",
        "benefit",
        "maṣlaḥa",
        "even",
        "grace",
        "luṭf",
        "ʿabd",
        "aljabbār",
        "suk",
        "ibn",
        "almalāhimī",
        "alfāʾiq",
        "thus",
        "muʿtazilite",
        "theologian",
        "argued",
        "existence",
        "suffering",
        "world",
        "compatible",
        "goodness",
        "generosity",
        "justice",
        "god",
        "standard",
        "muʿtazilite",
        "theologian",
        "evaluate",
        "good",
        "god",
        "human",
        "objective",
        "standard",
        "goodness",
        "justice",
        "implication",
        "presence",
        "evil",
        "world",
        "one",
        "notable",
        "implication",
        "god",
        "must",
        "best",
        "aṣlaḥ",
        "initially",
        "certain",
        "muʿtazilites",
        "maintained",
        "god",
        "must",
        "best",
        "religious",
        "matter",
        "namely",
        "command",
        "prohibition",
        "ibn",
        "mattawayh",
        "altadhkira",
        "ii",
        "ultimately",
        "muʿtazilite",
        "theologian",
        "came",
        "agree",
        "since",
        "god",
        "generous",
        "good",
        "best",
        "action",
        "whether",
        "religious",
        "matter",
        "creating",
        "ordering",
        "universe",
        "ibn",
        "almalāhimī",
        "alfāʾiq",
        "ʿabd",
        "aljabbār",
        "alaṣlaḥ",
        "xiv",
        "consequently",
        "even",
        "muʿtazilite",
        "theologian",
        "emphasize",
        "implication",
        "world",
        "best",
        "possible",
        "world",
        "neoplatonicinspired",
        "philosopher",
        "like",
        "fārābī",
        "ibn",
        "sīnā",
        "yet",
        "another",
        "strategy",
        "explain",
        "presence",
        "evil",
        "ibn",
        "sīnā",
        "exemplifies",
        "well",
        "fārābī",
        "altaʿlīqāt",
        "avicenna",
        "metah",
        "ibn",
        "sīnā",
        "take",
        "problem",
        "evil",
        "within",
        "context",
        "divine",
        "providence",
        "see",
        "question",
        "existence",
        "evil",
        "universe",
        "explained",
        "whole",
        "universe",
        "emanates",
        "absolutely",
        "good",
        "god",
        "following",
        "neoplatonist",
        "tradition",
        "associate",
        "goodness",
        "existence",
        "evil",
        "nonbeing",
        "imperfection",
        "proper",
        "thing",
        "since",
        "evil",
        "sense",
        "nonthing",
        "nonexistent",
        "cause",
        "category",
        "mistake",
        "ask",
        "cause",
        "evil",
        "absolutely",
        "speaking",
        "suggest",
        "god",
        "cause",
        "still",
        "ibn",
        "sīnā",
        "recognizes",
        "apparent",
        "evil",
        "notably",
        "suffering",
        "simply",
        "reduced",
        "imperfection",
        "privation",
        "proper",
        "existence",
        "event",
        "condition",
        "actively",
        "cause",
        "suffering",
        "ibn",
        "sīnā",
        "argues",
        "evil",
        "suffering",
        "applicable",
        "small",
        "part",
        "whole",
        "universe",
        "yet",
        "indispensable",
        "part",
        "necessary",
        "evil",
        "part",
        "universe",
        "consists",
        "thing",
        "subject",
        "generation",
        "corruption",
        "sphere",
        "generation",
        "corruption",
        "according",
        "neoplatonic",
        "cosmology",
        "limited",
        "earth",
        "inhabitant",
        "immediate",
        "atmosphere",
        "enveloping",
        "earth",
        "thus",
        "order",
        "absolutely",
        "evil",
        "entire",
        "cosmos",
        "sphere",
        "generation",
        "corruption",
        "either",
        "would",
        "needed",
        "exist",
        "deprived",
        "property",
        "make",
        "generable",
        "corruptible",
        "thing",
        "divine",
        "providence",
        "precludes",
        "option",
        "ibn",
        "sīnā",
        "argues",
        "roughly",
        "reason",
        "case",
        "namely",
        "universe",
        "overall",
        "would",
        "le",
        "good",
        "actually",
        "even",
        "given",
        "presence",
        "evil",
        "example",
        "drawn",
        "ibn",
        "sīnā",
        "clarifies",
        "point",
        "certainly",
        "poor",
        "man",
        "loses",
        "family",
        "possession",
        "fire",
        "suffers",
        "evil",
        "yet",
        "fact",
        "fire",
        "essentially",
        "hot",
        "cook",
        "flesh",
        "burn",
        "wood",
        "good",
        "likewise",
        "wood",
        "flesh",
        "essentially",
        "cooked",
        "fire",
        "good",
        "eliminate",
        "fire",
        "power",
        "burn",
        "power",
        "wood",
        "flesh",
        "cooked",
        "eliminate",
        "thing",
        "thus",
        "eliminate",
        "possibility",
        "kind",
        "suffering",
        "would",
        "eliminate",
        "entire",
        "class",
        "existents",
        "namely",
        "subject",
        "generation",
        "corruption",
        "consequently",
        "entire",
        "class",
        "objective",
        "good",
        "universe",
        "would",
        "lost",
        "make",
        "world",
        "overall",
        "le",
        "good",
        "ibn",
        "sīnā",
        "loss",
        "simply",
        "incompatible",
        "conception",
        "divine",
        "providence",
        "god",
        "ultimately",
        "source",
        "order",
        "perfectly",
        "possible",
        "commensurate",
        "chain",
        "possible",
        "existents",
        "ibn",
        "sīnā",
        "muʿtazilite",
        "explanation",
        "presence",
        "evil",
        "imply",
        "god",
        "created",
        "best",
        "possible",
        "world",
        "neither",
        "explicitly",
        "make",
        "claim",
        "work",
        "ghazālī",
        "explicitly",
        "argued",
        "actual",
        "world",
        "best",
        "possible",
        "world",
        "see",
        "ormsby",
        "realm",
        "possible",
        "ghazālī",
        "assures",
        "u",
        "nothing",
        "wondrously",
        "beautiful",
        "world",
        "complete",
        "perfect",
        "laysa",
        "fīlimkān",
        "abdaʿ",
        "aṣlan",
        "aḥsana",
        "minhu",
        "wa",
        "lā",
        "atamma",
        "wa",
        "lā",
        "akmala",
        "popularized",
        "rhyming",
        "couplet",
        "realm",
        "possible",
        "nothing",
        "wonderful",
        "laysa",
        "fīlimkān",
        "abdaʿ",
        "mimmā",
        "kān",
        "ghazālī",
        "fdu",
        "ghazālī",
        "forty",
        "principle",
        "imperfection",
        "see",
        "world",
        "result",
        "limit",
        "knowledge",
        "reason",
        "must",
        "best",
        "possible",
        "world",
        "better",
        "universe",
        "possible",
        "god",
        "create",
        "yet",
        "could",
        "created",
        "would",
        "miserly",
        "however",
        "god",
        "omnibenevolent",
        "claim",
        "must",
        "false",
        "god",
        "create",
        "purportedly",
        "better",
        "possible",
        "world",
        "could",
        "god",
        "would",
        "impotent",
        "respect",
        "however",
        "god",
        "omnipotent",
        "claim",
        "must",
        "false",
        "short",
        "none",
        "similar",
        "option",
        "explaining",
        "le",
        "optimal",
        "world",
        "acceptable",
        "impugn",
        "god",
        "majesty",
        "sure",
        "ghazālī",
        "claiming",
        "evil",
        "world",
        "rather",
        "evil",
        "imperfection",
        "suffering",
        "essential",
        "ingredient",
        "perfection",
        "world",
        "might",
        "fully",
        "recognize",
        "certain",
        "specific",
        "case",
        "evil",
        "contribute",
        "world",
        "overall",
        "perfection",
        "nonetheless",
        "imperfection",
        "help",
        "one",
        "appreciate",
        "contrasting",
        "good",
        "world",
        "thus",
        "actual",
        "universe",
        "evil",
        "included",
        "best",
        "possible",
        "universe"
    ]
}