{
    "main_text": "Ontology of Mathematics || What Mathematical Objects Are\n1.2 What Mathematical Objects Are\n\nNow that we know what mathematical objects are not for Muslim\nphilosophers, we must thus ask what they are. In his\nMetaphysics (VI.1, 1026a13–19) Aristotle classifies\ndifferent theoretical sciences based on the ontological status of the\nobjects they study (Cleary 1994). Aristotle’s main criteria for\ndistinguishing different sciences from each other are the extent and\nqualification of the association of the subject-matter of the sciences\nwith movement and materiality. Employing a similar approach, in his\nThe Aims of Aristotle’s Metaphysics (Maqāla\nfī aghrāḍ kitāb mā baʿd\nal-ṭabīʿa), al-Fārābī (d. 950)\nargues that the subject matters of mathematics—i.e.,\nmathematical objects—are abstracted (mujarrad) from\nmatter in estimation (wahm) but not in the extramental world.\nOn the one hand, mathematical objects are different from the objects\nthat metaphysics studies because the latter objects are fully detached\nfrom matter both in estimation and in the extramental world. On the\nother hand, mathematical objects are different from the sensible\nphysical objects because they cannot be separated from matter, either\nin estimation or in the extramental world. Thus, mathematics occupies\nan intermediate position between metaphysics and physics. The\nassociation of mathematical objects with matter is stronger than that\nof the objects of metaphysics but weaker than that of the objects of\nphysics. (The original Arabic of al-Fārābī’s book\ncan be found in al-Fārābi 1890: 34–38, and Kiankhah\n2015: 147–57. For two English translations, see Bertolacci 2006:\n66–72, and McGinnis & Reisman 2007: 78–81.)\n\nIn his Enumeration of the Sciences\n(ʾIḥṣāʾ al-ʿulūm),\nal-Fārābī puts forward a more detailed discussion of\nthe ontology of mathematics. He distinguishes applied/practical\n(ʿamalī) mathematics from pure/theoretical\n(naẓarī) mathematics. The objects of applied\narithmetic are numbers as they are associated with sensible things.\nApplied arithmetic considers the number of sensible things existing in\nthe material world. By contrast, pure arithmetic considers an absolute\nconception of number and plurality. It studies numbers that are\nabstracted from all the numbered things in the sensible world.\nSimilarly, applied geometry considers the geometrical properties of\nspecific physical objects, whereas pure geometry deals with\ngeometrical shapes regardless of whether or not they are attached to\nspecific physical objects (al-Fārābi [Enum]: chap. 3;\nEndress 2003: 139–40).\n\nFollowing the main line of al-Fārābī’s approach,\nAvicenna develops a more detailed discussion of the division of the\nsciences (Marmura 1980; Gutas 2003) according to which mathematical\nobjects exist in the extramental world in association with determinate\nspecies of matter (e.g., wood, gold, etc.). Through the function of\nthe faculty of estimation, mathematical objects can be abstracted in\nthe mind from the specific species of matter they are attached to in\nthe extramental world. Nevertheless, they must still be conceived as\nmaterial things. In other words, mathematical objects in the mind are\nseparate from determinate species of matter, though not from\nmateriality itself (Avicenna [MPh]: chap. I.2; Di Vincenzo 2021:\n20–27). Avicenna argues that numbers (aʿdād)\nand magnitudes (maqādīr)—as the most general\nrepresentatives of the objects of arithmetic and geometry,\nrespectively—are accidents (aʿrāḍ) and\nproperties of physical objects existing in the sensible world\n(Avicenna [MPh]: chap. III.3–4). Neither numbers nor magnitudes\nhave independent immaterial subsistence in the extramental world.\nMagnitudes (or geometrical shapes, to be more specific) cannot be\ndetached from materiality even in the mind (Avicenna [MPh]: chap.\nIII.4 sec.2 and VII.2, sec. 21). By contrast, numbers can be\nconsidered fully separate from matter and materiality. Nevertheless,\nsuch a consideration of numbers is metaphysical, rather than\nmathematical (Endress 2003: 142; Zarepour 2016: sec. 4). Numbers,\ninasmuch as they are subject to mathematical studies, must be\nreceptive to decrease and increase. Therefore, even in the mind, they\nmust be conceived as properties of material things (Avicenna [MPh]:\nchap. I.3, secs. 17–19). In sum, mathematical objects exist in\nthe extramental world as the properties of physical things constituted\nof determinate species of matter. Mathematical objects can be\nabstracted from these determinate species of matter in the mind. But\nthey must still be thought of as properties of material things.\nOtherwise, they cannot be the subject of mathematical studies.\nAvicenna’s discussion of the roles of the faculty of estimation\nand the process of abstraction in mathematical studies has been\ninterpreted in two different ways. Some scholars (McGinnis 2006; 2017;\nArdeshir 2008; Fazlıoğlu 2014; Tahiri 2016; 2018) think that\nmathematical objects are in the first place mental objects, and\nabstraction is a mechanism for constructing mathematical objects.\nAttributing a literalist view to Avicenna, some others (Marmura 1980;\n2005; Zarepour 2016; 2021; McGinnis 2019) argue that mathematical\nobjects literally exist in the physical world and abstraction is a\ncognitive process for grasping mathematical concepts, rather than\nproducing mathematical objects. These different interpretations remind\nus of the contrast between the literalist (Mueller 1970; 1990) and the\nabstractionist (Lear 1982; Hussey 1991) readings of Aristotle’s\nontology of mathematics. The most obvious objection to the literalist\nview is that, unlike physical objects, which are inexact and\nimperfect, mathematical objects seem to be perfect and exact (or\nidealized). For instance, it seems that there exists no perfectly\ncircular physical object whose circumference is not (at least to a\nmodest extent) serrated. To rebut this objection against the\nliteralist reading of Avicenna’s ontology of mathematics, it has\nbeen argued that he endorses the existence of perfect mathematical\nobjects in the physical world (Zarepour 2016: sec. 5; 2021: sec.\n4).\n\nThis is probably due to the emphasis of Avicenna and\nal-Fārābī on the role of estimation (wahm) in\nconceiving mathematical objects that, in post-Avicennian philosophy,\nmathematics is often referred to as an estimative (wahmī\nor mawhūm) science (Pines 1974). Before or contemporary\nwith Avicenna, many Muslim thinkers had emphasized that mathematical\nobjects exist, in one way or another, in the physical world. For\ninstance, in The Book of Instruction (Kitāb\nal-tafhīm ([Instr]), al-Bīrūnī (d. ~1048)\ndefends an account of the nature of mathematical objects which seems\nto have strong affinities with the literalist reading of Avicenna\n(Samian 2011; 2014). In the same vein, Ibn al-Haytham (d. 1040), in\nthe first pages of his Resolution of Doubts (Ḥall\nshukūk, [Doubts]), argues that geometrical objects exist in\nthe sensible world. They can be abstracted from matter through the\nactivity of the faculty of imagination (takhayyul), whose\nfunction in Ibn al-Haytham’s theory of mind is very similar to\nthe function of estimation in Avicenna’s psychology. However, by\ncontrast with Avicenna and Aristotle (De anima\n428a5–18), Ibn al-Haytham thinks that imagined forms, that are\nabstracted from physical objects, have a more real existence. For him,\nthe real (ḥaqīqī) existence of mathematical\nobjects is instantiated in imagination and distinction\n(tamyīz)—another cognitive faculty in Ibn\nal-Haytham’s philosophy of mind, which plays a crucial role in\ngrasping universal concepts through the mediation of imagined forms.\n(See Ighbariah & Wagner 2018: secs. 79–81. R. Rashed [1993:\n2:8–19] believes that there were two different Muslim thinkers\nnamed ‘Ibn al-Haytham’. Sabra [1998; 2003] rejects\nRashed’s view and here I follow Sabra’s position.)\n\nIn post-Avicennian philosophy, the claim that mathematical objects are\nmental (or estimative or imaginative) became the most popular view and\nwas increasingly emphasized by different thinkers. The inclination\ntowards this approach was partially due to powerful criticisms of\nAvicenna’s account of the ontology of mathematics. For instance,\nSuhrawardī offered strong objections to the existence of numbers\nin the physical world as accidents of sensible things. Consider a\ngroup of four individuals. Avicenna thinks that four-ness\n(ʾarbaʿīya) is an accident of these four\npersons. But Suhrawardī finds it untenable. He argues that\n\n\neither ‘four-ness’ must be complete in each one of the\nindividuals, which is not the case, or else there must be something of\nfour-ness in each one, which can only be the unity. Therefore, either\nthe totality of four-ness must have no locus other than the intellect,\nor else neither four-ness nor anything of four-ness can be in each\none. On this latter supposition, too, four-ness is only in the\nintellect. (Suhrawardī The Philosophy of Illumination\n[1999: 48])\n\n\nHe believes that it is only our mind which can impose a unity to a\nplurality of four distinct sensible entities. There is nothing in the\nextramental world which can naturally bind four detached things in\nsuch a way that they collectively accept the accident of four-ness.\nThus, for Suhrawardī numbers (and mathematical objects in\ngeneral) are only mind-dependent (iʿtibārī)\nthings (Ziai 1990: 108; Walbridge 2000: 63 and 78–79). A similar\nline of argument is developed by Mullā Ṣadrā (d.\n1640). He accepts that there are pluralities in the extramental world.\nBut he insists that it is only through the activity of our mind that a\ngroup of distinct objects can be considered a unity. There is nothing\nin the extramental world which bestows unity to an arbitrary group of\ndistinct objects (Mullā Ṣadrā, Al-Shawāhid\nal-rubūbīya, [1982: 65]). This line of argument against\nthe consideration of numbers as properties of physical objects reminds\nus of Frege’s criticism of this idea (Frege 1884: §§\n21–25).\n\nA turning point in the rendition of mathematical objects as mental\nobjects is to appeal to the notion of nafs al-ʾamr to\ndescribe the ontological status of mathematical objects and to clarify\nthe nature of the truth-makers of mathematical propositions. The\nphrase ‘nafs al-ʾamr’ literally means\nthe thing itself. But its technical content is hard to\ncapture in translation. Although this phrase also appears in\nAvicenna’s writings, it is probably Naṣīr al-Dīn\nal-Ṭūsī (d. 1274) who used the phrase for the first\ntime in a technical and theory-laden sense. Different philosophers\nhave understood this phrase as referring to different things including\ndivine knowledge, the Active Intellect, the realm of ideas, etc.\n(Kaş 2021; Spiker 2021). The significance of the theory of\nnafs al-ʾamr for the philosophy of mathematics is that\nit may enable us to preserve judgment-realism even without\nobject-realism. Some philosophers (e.g., Sayyid al-Sharīf\nal-Jurjānī, d. 1413) have used this theory to show that\nalthough mathematical objects are merely estimative\n(wahmī) and have no mind-independent existence,\nmathematical judgments are certain (yaqīnī), and\ntheir truth-values are mind-independent. In other words, regarding\nmathematics, judgment-realism can still be defended even when\nobject-realism is rejected (Fazlıoğlu 2014; Hasan 2017).\n\nAnother important issue pertinent to the ontology of mathematics is\nthe nature of algebraic objects. An algebraic unknown (or, an\nalgebraic variable, as we call it today) can indifferently refer to\neither a number or a geometrical magnitude. So, the nature of an\nalgebraic object is not the same as either numbers or geometrical\nshapes. Unfortunately, the hybrid ontology of this special type of\nmathematical objects has rarely (if at all) been discussed as an\nontology different from those of numbers and magnitudes. But it has\nbeen argued that the familiarity of philosophers such as\nal-Fārābī and Avicenna with the algebraic theory put\nforward by al-Khwārizmī (d. 850) in his Kitāb\nal-jabr wa al-muqābala inspired them to develop a general\nontology of things (ashyāʾ) that is neither\nPlatonic nor Aristotelian (R. Rashed 1984a; 2008; 2015: 716–18;\n2018).\n",
    "section_title": "1.2 What Mathematical Objects Are",
    "entry_title": "Arabic and Islamic Philosophy of Mathematics",
    "hierarchy_title": "Arabic and Islamic Philosophy of Mathematics || Ontology of Mathematics || What Mathematical Objects Are",
    "tokenized_text": [
        "ontology",
        "mathematics",
        "mathematical",
        "object",
        "mathematical",
        "object",
        "know",
        "mathematical",
        "object",
        "muslim",
        "philosopher",
        "must",
        "thus",
        "ask",
        "metaphysics",
        "vi",
        "a",
        "aristotle",
        "classifies",
        "different",
        "theoretical",
        "science",
        "based",
        "ontological",
        "status",
        "object",
        "study",
        "cleary",
        "aristotle",
        "main",
        "criterion",
        "distinguishing",
        "different",
        "science",
        "extent",
        "qualification",
        "association",
        "subjectmatter",
        "science",
        "movement",
        "materiality",
        "employing",
        "similar",
        "approach",
        "aim",
        "aristotle",
        "metaphysics",
        "maqāla",
        "fī",
        "aghrāḍ",
        "kitāb",
        "mā",
        "baʿd",
        "alṭabīʿa",
        "alfārābī",
        "d",
        "argues",
        "subject",
        "matter",
        "mathematicsie",
        "mathematical",
        "objectsare",
        "abstracted",
        "mujarrad",
        "matter",
        "estimation",
        "wahm",
        "extramental",
        "world",
        "one",
        "hand",
        "mathematical",
        "object",
        "different",
        "object",
        "metaphysics",
        "study",
        "latter",
        "object",
        "fully",
        "detached",
        "matter",
        "estimation",
        "extramental",
        "world",
        "hand",
        "mathematical",
        "object",
        "different",
        "sensible",
        "physical",
        "object",
        "separated",
        "matter",
        "either",
        "estimation",
        "extramental",
        "world",
        "thus",
        "mathematics",
        "occupies",
        "intermediate",
        "position",
        "metaphysics",
        "physic",
        "association",
        "mathematical",
        "object",
        "matter",
        "stronger",
        "object",
        "metaphysics",
        "weaker",
        "object",
        "physic",
        "original",
        "arabic",
        "alfārābī",
        "book",
        "found",
        "alfārābi",
        "kiankhah",
        "two",
        "english",
        "translation",
        "see",
        "bertolacci",
        "mcginnis",
        "reisman",
        "enumeration",
        "science",
        "ʾiḥṣāʾ",
        "alʿulūm",
        "alfārābī",
        "put",
        "forward",
        "detailed",
        "discussion",
        "ontology",
        "mathematics",
        "distinguishes",
        "appliedpractical",
        "ʿamalī",
        "mathematics",
        "puretheoretical",
        "naẓarī",
        "mathematics",
        "object",
        "applied",
        "arithmetic",
        "number",
        "associated",
        "sensible",
        "thing",
        "applied",
        "arithmetic",
        "considers",
        "number",
        "sensible",
        "thing",
        "existing",
        "material",
        "world",
        "contrast",
        "pure",
        "arithmetic",
        "considers",
        "absolute",
        "conception",
        "number",
        "plurality",
        "study",
        "number",
        "abstracted",
        "numbered",
        "thing",
        "sensible",
        "world",
        "similarly",
        "applied",
        "geometry",
        "considers",
        "geometrical",
        "property",
        "specific",
        "physical",
        "object",
        "whereas",
        "pure",
        "geometry",
        "deal",
        "geometrical",
        "shape",
        "regardless",
        "whether",
        "attached",
        "specific",
        "physical",
        "object",
        "alfārābi",
        "enum",
        "chap",
        "endress",
        "following",
        "main",
        "line",
        "alfārābī",
        "approach",
        "avicenna",
        "develops",
        "detailed",
        "discussion",
        "division",
        "science",
        "marmura",
        "gutas",
        "according",
        "mathematical",
        "object",
        "exist",
        "extramental",
        "world",
        "association",
        "determinate",
        "specie",
        "matter",
        "eg",
        "wood",
        "gold",
        "etc",
        "function",
        "faculty",
        "estimation",
        "mathematical",
        "object",
        "abstracted",
        "mind",
        "specific",
        "specie",
        "matter",
        "attached",
        "extramental",
        "world",
        "nevertheless",
        "must",
        "still",
        "conceived",
        "material",
        "thing",
        "word",
        "mathematical",
        "object",
        "mind",
        "separate",
        "determinate",
        "specie",
        "matter",
        "though",
        "materiality",
        "avicenna",
        "mph",
        "chap",
        "i",
        "di",
        "vincenzo",
        "avicenna",
        "argues",
        "number",
        "aʿdād",
        "magnitude",
        "maqādīr",
        "as",
        "general",
        "representative",
        "object",
        "arithmetic",
        "geometry",
        "respectivelyare",
        "accident",
        "aʿrāḍ",
        "property",
        "physical",
        "object",
        "existing",
        "sensible",
        "world",
        "avicenna",
        "mph",
        "chap",
        "iii",
        "neither",
        "number",
        "magnitude",
        "independent",
        "immaterial",
        "subsistence",
        "extramental",
        "world",
        "magnitude",
        "geometrical",
        "shape",
        "specific",
        "detached",
        "materiality",
        "even",
        "mind",
        "avicenna",
        "mph",
        "chap",
        "iii",
        "sec",
        "vii",
        "sec",
        "contrast",
        "number",
        "considered",
        "fully",
        "separate",
        "matter",
        "materiality",
        "nevertheless",
        "consideration",
        "number",
        "metaphysical",
        "rather",
        "mathematical",
        "endress",
        "zarepour",
        "sec",
        "number",
        "inasmuch",
        "subject",
        "mathematical",
        "study",
        "must",
        "receptive",
        "decrease",
        "increase",
        "therefore",
        "even",
        "mind",
        "must",
        "conceived",
        "property",
        "material",
        "thing",
        "avicenna",
        "mph",
        "chap",
        "i",
        "sec",
        "sum",
        "mathematical",
        "object",
        "exist",
        "extramental",
        "world",
        "property",
        "physical",
        "thing",
        "constituted",
        "determinate",
        "specie",
        "matter",
        "mathematical",
        "object",
        "abstracted",
        "determinate",
        "specie",
        "matter",
        "mind",
        "must",
        "still",
        "thought",
        "property",
        "material",
        "thing",
        "otherwise",
        "subject",
        "mathematical",
        "study",
        "avicenna",
        "discussion",
        "role",
        "faculty",
        "estimation",
        "process",
        "abstraction",
        "mathematical",
        "study",
        "interpreted",
        "two",
        "different",
        "way",
        "scholar",
        "mcginnis",
        "ardeshir",
        "fazlıoğlu",
        "tahiri",
        "think",
        "mathematical",
        "object",
        "first",
        "place",
        "mental",
        "object",
        "abstraction",
        "mechanism",
        "constructing",
        "mathematical",
        "object",
        "attributing",
        "literalist",
        "view",
        "avicenna",
        "others",
        "marmura",
        "zarepour",
        "mcginnis",
        "argue",
        "mathematical",
        "object",
        "literally",
        "exist",
        "physical",
        "world",
        "abstraction",
        "cognitive",
        "process",
        "grasping",
        "mathematical",
        "concept",
        "rather",
        "producing",
        "mathematical",
        "object",
        "different",
        "interpretation",
        "remind",
        "u",
        "contrast",
        "literalist",
        "mueller",
        "abstractionist",
        "lear",
        "hussey",
        "reading",
        "aristotle",
        "ontology",
        "mathematics",
        "obvious",
        "objection",
        "literalist",
        "view",
        "unlike",
        "physical",
        "object",
        "inexact",
        "imperfect",
        "mathematical",
        "object",
        "seem",
        "perfect",
        "exact",
        "idealized",
        "instance",
        "seems",
        "exists",
        "perfectly",
        "circular",
        "physical",
        "object",
        "whose",
        "circumference",
        "least",
        "modest",
        "extent",
        "serrated",
        "rebut",
        "objection",
        "literalist",
        "reading",
        "avicenna",
        "ontology",
        "mathematics",
        "argued",
        "endorses",
        "existence",
        "perfect",
        "mathematical",
        "object",
        "physical",
        "world",
        "zarepour",
        "sec",
        "sec",
        "probably",
        "due",
        "emphasis",
        "avicenna",
        "alfārābī",
        "role",
        "estimation",
        "wahm",
        "conceiving",
        "mathematical",
        "object",
        "postavicennian",
        "philosophy",
        "mathematics",
        "often",
        "referred",
        "estimative",
        "wahmī",
        "mawhūm",
        "science",
        "pine",
        "contemporary",
        "avicenna",
        "many",
        "muslim",
        "thinker",
        "emphasized",
        "mathematical",
        "object",
        "exist",
        "one",
        "way",
        "another",
        "physical",
        "world",
        "instance",
        "book",
        "instruction",
        "kitāb",
        "altafhīm",
        "instr",
        "albīrūnī",
        "d",
        "defends",
        "account",
        "nature",
        "mathematical",
        "object",
        "seems",
        "strong",
        "affinity",
        "literalist",
        "reading",
        "avicenna",
        "samian",
        "vein",
        "ibn",
        "alhaytham",
        "d",
        "first",
        "page",
        "resolution",
        "doubt",
        "ḥall",
        "shukūk",
        "doubt",
        "argues",
        "geometrical",
        "object",
        "exist",
        "sensible",
        "world",
        "abstracted",
        "matter",
        "activity",
        "faculty",
        "imagination",
        "takhayyul",
        "whose",
        "function",
        "ibn",
        "alhaytham",
        "theory",
        "mind",
        "similar",
        "function",
        "estimation",
        "avicenna",
        "psychology",
        "however",
        "contrast",
        "avicenna",
        "aristotle",
        "de",
        "anima",
        "a",
        "ibn",
        "alhaytham",
        "think",
        "imagined",
        "form",
        "abstracted",
        "physical",
        "object",
        "real",
        "existence",
        "real",
        "ḥaqīqī",
        "existence",
        "mathematical",
        "object",
        "instantiated",
        "imagination",
        "distinction",
        "tamyīz",
        "another",
        "cognitive",
        "faculty",
        "ibn",
        "alhaytham",
        "philosophy",
        "mind",
        "play",
        "crucial",
        "role",
        "grasping",
        "universal",
        "concept",
        "mediation",
        "imagined",
        "form",
        "see",
        "ighbariah",
        "wagner",
        "sec",
        "r",
        "rashed",
        "belief",
        "two",
        "different",
        "muslim",
        "thinker",
        "named",
        "ibn",
        "alhaytham",
        "sabra",
        "reject",
        "rashed",
        "view",
        "follow",
        "sabra",
        "position",
        "postavicennian",
        "philosophy",
        "claim",
        "mathematical",
        "object",
        "mental",
        "estimative",
        "imaginative",
        "became",
        "popular",
        "view",
        "increasingly",
        "emphasized",
        "different",
        "thinker",
        "inclination",
        "towards",
        "approach",
        "partially",
        "due",
        "powerful",
        "criticism",
        "avicenna",
        "account",
        "ontology",
        "mathematics",
        "instance",
        "suhrawardī",
        "offered",
        "strong",
        "objection",
        "existence",
        "number",
        "physical",
        "world",
        "accident",
        "sensible",
        "thing",
        "consider",
        "group",
        "four",
        "individual",
        "avicenna",
        "think",
        "fourness",
        "ʾarbaʿīya",
        "accident",
        "four",
        "person",
        "suhrawardī",
        "find",
        "untenable",
        "argues",
        "either",
        "fourness",
        "must",
        "complete",
        "one",
        "individual",
        "case",
        "else",
        "must",
        "something",
        "fourness",
        "one",
        "unity",
        "therefore",
        "either",
        "totality",
        "fourness",
        "must",
        "locus",
        "intellect",
        "else",
        "neither",
        "fourness",
        "anything",
        "fourness",
        "one",
        "latter",
        "supposition",
        "fourness",
        "intellect",
        "suhrawardī",
        "philosophy",
        "illumination",
        "belief",
        "mind",
        "impose",
        "unity",
        "plurality",
        "four",
        "distinct",
        "sensible",
        "entity",
        "nothing",
        "extramental",
        "world",
        "naturally",
        "bind",
        "four",
        "detached",
        "thing",
        "way",
        "collectively",
        "accept",
        "accident",
        "fourness",
        "thus",
        "suhrawardī",
        "number",
        "mathematical",
        "object",
        "general",
        "minddependent",
        "iʿtibārī",
        "thing",
        "ziai",
        "walbridge",
        "similar",
        "line",
        "argument",
        "developed",
        "mullā",
        "ṣadrā",
        "d",
        "accepts",
        "plurality",
        "extramental",
        "world",
        "insists",
        "activity",
        "mind",
        "group",
        "distinct",
        "object",
        "considered",
        "unity",
        "nothing",
        "extramental",
        "world",
        "bestows",
        "unity",
        "arbitrary",
        "group",
        "distinct",
        "object",
        "mullā",
        "ṣadrā",
        "alshawāhid",
        "alrubūbīya",
        "line",
        "argument",
        "consideration",
        "number",
        "property",
        "physical",
        "object",
        "reminds",
        "u",
        "frege",
        "criticism",
        "idea",
        "frege",
        "turning",
        "point",
        "rendition",
        "mathematical",
        "object",
        "mental",
        "object",
        "appeal",
        "notion",
        "nafs",
        "alʾamr",
        "describe",
        "ontological",
        "status",
        "mathematical",
        "object",
        "clarify",
        "nature",
        "truthmakers",
        "mathematical",
        "proposition",
        "phrase",
        "nafs",
        "alʾamr",
        "literally",
        "mean",
        "thing",
        "technical",
        "content",
        "hard",
        "capture",
        "translation",
        "although",
        "phrase",
        "also",
        "appears",
        "avicenna",
        "writing",
        "probably",
        "naṣīr",
        "aldīn",
        "alṭūsī",
        "d",
        "used",
        "phrase",
        "first",
        "time",
        "technical",
        "theoryladen",
        "sense",
        "different",
        "philosopher",
        "understood",
        "phrase",
        "referring",
        "different",
        "thing",
        "including",
        "divine",
        "knowledge",
        "active",
        "intellect",
        "realm",
        "idea",
        "etc",
        "kaş",
        "spiker",
        "significance",
        "theory",
        "nafs",
        "alʾamr",
        "philosophy",
        "mathematics",
        "may",
        "enable",
        "u",
        "preserve",
        "judgmentrealism",
        "even",
        "without",
        "objectrealism",
        "philosopher",
        "eg",
        "sayyid",
        "alsharīf",
        "aljurjānī",
        "d",
        "used",
        "theory",
        "show",
        "although",
        "mathematical",
        "object",
        "merely",
        "estimative",
        "wahmī",
        "mindindependent",
        "existence",
        "mathematical",
        "judgment",
        "certain",
        "yaqīnī",
        "truthvalues",
        "mindindependent",
        "word",
        "regarding",
        "mathematics",
        "judgmentrealism",
        "still",
        "defended",
        "even",
        "objectrealism",
        "rejected",
        "fazlıoğlu",
        "hasan",
        "another",
        "important",
        "issue",
        "pertinent",
        "ontology",
        "mathematics",
        "nature",
        "algebraic",
        "object",
        "algebraic",
        "unknown",
        "algebraic",
        "variable",
        "call",
        "today",
        "indifferently",
        "refer",
        "either",
        "number",
        "geometrical",
        "magnitude",
        "nature",
        "algebraic",
        "object",
        "either",
        "number",
        "geometrical",
        "shape",
        "unfortunately",
        "hybrid",
        "ontology",
        "special",
        "type",
        "mathematical",
        "object",
        "rarely",
        "discussed",
        "ontology",
        "different",
        "number",
        "magnitude",
        "argued",
        "familiarity",
        "philosopher",
        "alfārābī",
        "avicenna",
        "algebraic",
        "theory",
        "put",
        "forward",
        "alkhwārizmī",
        "d",
        "kitāb",
        "aljabr",
        "wa",
        "almuqābala",
        "inspired",
        "develop",
        "general",
        "ontology",
        "thing",
        "ashyāʾ",
        "neither",
        "platonic",
        "aristotelian",
        "r",
        "rashed",
        "a"
    ]
}