{
    "main_text": "Arendt’s Conception of Modernity\n3. Arendt’s Conception of Modernity\n\n\nIn her major philosophical work, The Human Condition, and in\nsome of the essays collected in Between Past and Future,\nArendt articulated a fairly negative conception of modernity. In these\nwritings Arendt is primarily concerned with the losses incurred as a\nresult of the eclipse of tradition, religion, and authority, but she\noffers a number of illuminating suggestions with respect to the\nresources that the modern age can still provide to address questions\nof meaning, identity, and value.\n\n\nFor Arendt modernity is characterized by the loss of the\nworld, by which she means the restriction or elimination of the\npublic sphere of action and speech in favor of the private world of\nintrospection and the private pursuit of economic interests. Modernity\nis the age of mass society, of the rise of the social out of\na previous distinction between the public and the private, and of the\nvictory of animal laborans over homo faber and the\nclassical conception of man as zoon politikon. Modernity is\nthe age of bureaucratic administration and anonymous labor, rather\nthan politics and action, of elite domination and the manipulation of\npublic opinion. It is the age when totalitarian forms of government,\nsuch as Nazism and Stalinism, have emerged as a result of the\ninstitutionalization of terror and violence. It is the age where\nhistory as a “natural process” has replaced history as a\nfabric of actions and events, where homogeneity and conformity have\nreplaced plurality and freedom, and where isolation and loneliness\nhave eroded human solidarity and all spontaneous forms of living\ntogether.  Modernity is the age where the past no longer carries any\ncertainty of evaluation, where individuals, having lost their\ntraditional standards and values, must search for new grounds of human\ncommunity as such.\n\n\nThis is Arendt’s vision of modernity, a vision which, at first sight,\nappears quite stark and unredeeming. It is worth pointing out,\nhowever, that Arendt’s negative appraisal of modernity was shaped by\nher experience of totalitarianism in the twentieth century, and that\nher work provides a number of important insights that may help us to\naddress certain problematic features of the modern age. In her\npolitical writings, and especially in The Origins of\nTotalitarianism, Arendt claimed that the phenomenon of\ntotalitarianism has broken the continuity of Occidental history, and\nhas rendered meaningless most of our moral and political categories.\nThe break in our tradition has become irrevocable after the tragic\nevents of the twentieth century and the triumph of totalitarian\nmovements East and West. In the form of Stalinism and Nazism,\ntotalitarianism has exploded the established categories of political\nthought and the accepted standards of moral judgment, and has thereby\nbroken the continuity of our history. Faced with the tragic events of\nthe Holocaust and the Gulag, we can no longer go back to traditional\nconcepts and values, so as to explain the unprecedented by means of\nprecedents, or to understand the monstrous by means of the familiar.\nThe burden of our time must be faced without the aid of tradition, or\nas Arendt once put it, “without a bannister” (RPW, 336).\nOur inherited concepts and criteria for judgment have been dissolved\nunder the impact of modern political events, and the task now is to\nre-establish the meaning of the past outside the framework of any\ntradition, since none have retained their original validity. It is the\npast, then, and not tradition, that Arendt attempts to preserve from\nthe rupture in modern time-consciousness. Only by reappropriating the\npast by means of what Arendt called “the deadly impact of new\nthoughts” (MDT, 201) can we hope to restore meaning to the\npresent and throw some light on the contemporary situation.\n\n\nThe hermeneutic strategy that Arendt employed to re-establish a link\nwith the past is indebted to both Walter Benjamin and Martin\nHeidegger.  From Benjamin she took the idea of a fragmentary\nhistoriography, one that seeks to identify the moments of rupture,\ndisplacement and dislocation in history. Such fragmentary\nhistoriography enables one to recover the lost potentials of the past\nin the hope that they may find actualization in the present. From\nHeidegger she took the idea of a deconstructive reading of the Western\nphilosophical tradition, one that seeks to uncover the original\nmeaning of our categories and to liberate them from the distorting\nincrustations of tradition. Such deconstructive hermeneutics enables\none to recover those primordial experiences (Urphaenomene)\nwhich have been occluded or forgotten by the philosophical tradition,\nand thereby to recover the lost origins of our philosophical concepts\nand categories.\n\n\nBy relying on these two hermeneutic strategies Arendt hopes to redeem\nfrom the past its lost or “forgotten treasure,” that is,\nthose fragments from the past that might still be of significance to\nus. In her view it is no longer possible, after the collapse of\ntradition, to save the past as a whole; the task, rather, is to redeem\nfrom oblivion those elements of the past that are still able to\nilluminate our situation. To re-establish a linkage with the past is\nnot an antiquarian exercise; on the contrary, without the critical\nreappropriation of the past our temporal horizon becomes disrupted,\nour experience precarious, and our identity more fragile. In Arendt’s\nview, then, it is necessary to redeem from the past those moments\nworth preserving, to save those fragments from past treasures that are\nsignificant for us. Only by means of this critical reappropriation can\nwe discover the past anew, endow it with relevance and meaning for the\npresent, and make it a source of inspiration for the future.\n\n\nThis critical reappropriation is facilitated, in part, by the fact\nthat after the rupture in modern time-consciousness the past may\n“open up to us with unexpected freshness and tell us things no\none has yet had ears to hear” (BPF, 94). The breakdown of\ntradition may in fact provide the great chance to look upon the past\n“with eyes undistorted by any tradition, with a directness which\nhas disappeared from Occidental reading and hearing ever since Roman\ncivilization submitted to the authority of Greek thought” (BPF,\n28–9).\n\n\nArendt’s return to the original experience of the Greek polis\nrepresents, in this sense, an attempt to break the fetters of a\nworn-out tradition and to rediscover a past over which tradition has\nno longer a claim. Against tradition Arendt sets the criterion of\ngenuineness, against the authoritative that which is forgotten,\nconcealed, or displaced at the margins of history. Only by operating\nagainst the grain of traditionalism and the claims of conventional\nhistoriography can the past be made meaningful again, provide sources\nof illumination for the present, and yield its treasures to those who\nsearch for them with “new thoughts” and saving acts of\nremembrance.\n\n\nArendt articulates her conception of modernity around a number of key\nfeatures: these are world alienation, earth\nalienation, the rise of the social, and the victory of\nanimal laborans. World alienation refers to the loss of an\nintersubjectively constituted world of experience and action by means\nof which we establish our self-identity and an adequate sense of\nreality. Earth alienation refers to the attempt to escape from the\nconfines of the earth; spurred by modern science and technology, we\nhave searched for ways to overcome our earth-bound condition by\nsetting out on the exploration of space, by attempting to recreate\nlife under laboratory conditions, and by trying to extend our given\nlife-span. The rise of the social refers to the expansion of the\nmarket economy from the early modern period and the ever increasing\naccumulation of capital and social wealth. With the rise of the social\neverything has become an object of production and consumption, of\nacquisition and exchange; moreover, its constant expansion has\nresulted in the blurring of the distinction between the private and\nthe public. The victory of animal laborans refers to the\ntriumph of the values of labor over those of homo faber and\nof man as zoon politikon. All the values characteristic of\nthe world of fabrication — permanence, stability, durability\n— as well as those characteristic of the world of action and\nspeech — freedom, plurality, solidarity — are sacrificed\nin favor of the values of life, productivity and abundance.\n\n\nArendt identifies two main stages in the emergence of modernity: the\nfirst, from the sixteenth to the nineteenth century, corresponds to\nworld alienation and the rise of the social, the second, from the\nbeginning of the twentieth century, corresponds to earth alienation and\nthe victory of animal laborans. She also identifies a number\nof causes: the discovery of America and the corresponding shrinking of\nthe earth, the waves of expropriation started during the Reformation,\nthe invention of the telescope challenging the adequacy of the senses,\nthe rise of modern science and philosophy and subsequently of a\nconception of man as part of a process of Nature and History, and the\nexpansion of the realm of the economy, of the production and\naccumulation of social wealth.\n\n\nArendt’s interpretation of modernity can be criticized on a\nnumber of grounds. We focus attention here on two categories employed\nby Arendt, those of nature, and the social. With\nrespect to the category of nature, Arendt oscillates between two\ncontrasting accounts. According to the first account, the modern age,\nby elevating labor, the most natural of human activities, to the\nhighest position within the vita activa, has brought us too\nclose to nature. Instead of building and preserving the human artifice\nand creating public spaces for action and deliberation, we are reduced\nto engage in the activity of sheer survival and in the production of\nthings that are by definition perishable. According to the second\naccount, however, the modern age is characterized by a growing\nartificiality, by the rejection of anything that is not\nman-made. Arendt cites the fact that natural processes, including that\nof life itself, have been recreated artificially by means of\nscientific experiment, that our natural environment has been\nextensively transformed and in some instances entirely replaced by\ntechnology, and that we have searched for ways to overcome our natural\ncondition as earth-bound creatures by setting out on the exploration\nof space and envisaging the possibility of inhabiting other\nplanets. All this leads to a situation where nothing around us will be\na naturally given event, object, or process, but will instead be the\nproduct of our instruments and the will to refashion the world in our\nimage.\n\n\nThese two accounts are difficult to reconcile, since in the former we\nhave nature intruding upon and even destroying the human artifice,\nwhile in the latter we have art (techne) expanding upon and\nreplacing everything natural or merely given. The result is to endow\nnature with an ambiguous status, since in the former case the victory\nof animal laborans indicates our subjection to natural\nprocesses, while in the latter case the expansion of scientific\nknowledge and of technological mastery indicates the overcoming of all\nnatural limits. The modern world would thus appear to be too natural\nand too artificial, too much under the dominance of labor and the\nlife-process of the species, as well as too much under the dominance\nof techne.\n\n\nWith respect to the second category, that of the social, Arendt was\nunable to account for certain important features of the modern\nworld. Arendt identifies the social with all those activities formerly\nrestricted to the private sphere of the household and having to do\nwith the necessities of life. Her claim is that, with the tremendous\nexpansion of the economy from the end of the eighteenth century, all\nsuch activities have taken over the public realm and transformed it\ninto a sphere for the satisfaction of our material needs. Society has\nthus invaded and conquered the public realm, turning it into a\nfunction of what previously were private needs and concerns, and has\nthereby destroyed the boundary separating the public and the\nprivate. Arendt also claims that with the expansion of the social\nrealm the tripartite division of human activities has been undermined\nto the point of becoming meaningless. In her view, once the social\nrealm has established its monopoly, the distinction between labor,\nwork and action is lost, since every effort is now expended on\nreproducing our material conditions of existence. Obsessed with life,\nproductivity, and consumption, we have turned into a society of\nlaborers and jobholders who no longer appreciate the values associated\nwith work, nor those associated with action.\n\n\nFrom this brief account it is clear that Arendt’s concept of the\nsocial plays a crucial role in her assessment of modernity. However\nsome have argued that this may have led her to a series of\nquestionable judgments:\n\nIn the first place, Arendt’s characterization of the social\nis overly restricted. She claims that the social is the realm of\nlabor, of biological and material necessity, of the reproduction of\nour condition of existence.  She also claims that the rise of the\nsocial coincides with the expansion of the economy from the end of the\neighteenth century.  However, having identified the social with the\ngrowth of the economy in the past two centuries, Arendt cannot\ncharacterize it in terms of a subsistence model of simple reproduction.\n(See Benhabib 2003, Ch. 6; Bernstein 1986, Ch. 9; Hansen 1993, Ch. 3;\nParekh 1981, Ch. 8.)\nSecondly, Arendt’s identification of the\nsocial with the activities of the household is responsible for a major\nshortcoming in her analysis of the economy. She is, in fact, unable to\nacknowledge that a modern capitalist economy constitutes a structure\nof power with a highly asymmetric distribution of costs and\nrewards. By relying on the misleading analogy of the household, she\nmaintains that all questions pertaining to the economy are\npre-political, and thus ignores the crucial question of economic power\nand exploitation. (See Bernstein 1986, Ch. 9; Hansen 1993, Ch. 3; Parekh\n1981, Ch. 8; Pitkin 1998; Pitkin 1994, Ch. 10, Hinchman and Hinchman;\nWolin 1994, Ch. 11, Hinchman and Hinchman.)\nFinally, by insisting on a strict separation between the private\nand the public, and between the social and the political, she is\nunable to account for the essential connection between these spheres\nand the struggles to redraw their boundaries.  Today many so-called\nprivate issues have become public concerns, and the struggle for\njustice and equal rights has extended into many spheres. By insulating\nthe political sphere from the concerns of the social, and by\nmaintaining a strict distinction between the public and the private,\nArendt is unable to account for some of the most important\nachievements of modernity — the extension of justice and equal\nrights, and the redrawing of the boundaries between the public and the\nprivate. (See Benhabib 2003, Ch. 6; Bernstein 1986, Ch. 9; Dietz 2002,\nCh. 5; Pitkin 1998; Pitkin 1995, Ch. 3, Honig; Zaretsky 1997, Ch. 8,\nCalhoun and McGowan.)\n\n",
    "section_title": "3. Arendt’s Conception of Modernity",
    "entry_title": "Hannah Arendt",
    "hierarchy_title": "Hannah Arendt || Arendt’s Conception of Modernity",
    "tokenized_text": [
        "arendt",
        "conception",
        "modernity",
        "arendt",
        "conception",
        "modernity",
        "major",
        "philosophical",
        "work",
        "human",
        "condition",
        "essay",
        "collected",
        "past",
        "future",
        "arendt",
        "articulated",
        "fairly",
        "negative",
        "conception",
        "modernity",
        "writing",
        "arendt",
        "primarily",
        "concerned",
        "loss",
        "incurred",
        "result",
        "eclipse",
        "tradition",
        "religion",
        "authority",
        "offer",
        "number",
        "illuminating",
        "suggestion",
        "respect",
        "resource",
        "modern",
        "age",
        "still",
        "provide",
        "address",
        "question",
        "meaning",
        "identity",
        "value",
        "arendt",
        "modernity",
        "characterized",
        "loss",
        "world",
        "mean",
        "restriction",
        "elimination",
        "public",
        "sphere",
        "action",
        "speech",
        "favor",
        "private",
        "world",
        "introspection",
        "private",
        "pursuit",
        "economic",
        "interest",
        "modernity",
        "age",
        "mass",
        "society",
        "rise",
        "social",
        "previous",
        "distinction",
        "public",
        "private",
        "victory",
        "animal",
        "laborans",
        "homo",
        "faber",
        "classical",
        "conception",
        "man",
        "zoon",
        "politikon",
        "modernity",
        "age",
        "bureaucratic",
        "administration",
        "anonymous",
        "labor",
        "rather",
        "politics",
        "action",
        "elite",
        "domination",
        "manipulation",
        "public",
        "opinion",
        "age",
        "totalitarian",
        "form",
        "government",
        "nazism",
        "stalinism",
        "emerged",
        "result",
        "institutionalization",
        "terror",
        "violence",
        "age",
        "history",
        "natural",
        "process",
        "replaced",
        "history",
        "fabric",
        "action",
        "event",
        "homogeneity",
        "conformity",
        "replaced",
        "plurality",
        "freedom",
        "isolation",
        "loneliness",
        "eroded",
        "human",
        "solidarity",
        "spontaneous",
        "form",
        "living",
        "together",
        "modernity",
        "age",
        "past",
        "longer",
        "carry",
        "certainty",
        "evaluation",
        "individual",
        "lost",
        "traditional",
        "standard",
        "value",
        "must",
        "search",
        "new",
        "ground",
        "human",
        "community",
        "arendt",
        "vision",
        "modernity",
        "vision",
        "first",
        "sight",
        "appears",
        "quite",
        "stark",
        "unredeeming",
        "worth",
        "pointing",
        "however",
        "arendt",
        "negative",
        "appraisal",
        "modernity",
        "shaped",
        "experience",
        "totalitarianism",
        "twentieth",
        "century",
        "work",
        "provides",
        "number",
        "important",
        "insight",
        "may",
        "help",
        "u",
        "address",
        "certain",
        "problematic",
        "feature",
        "modern",
        "age",
        "political",
        "writing",
        "especially",
        "origin",
        "totalitarianism",
        "arendt",
        "claimed",
        "phenomenon",
        "totalitarianism",
        "broken",
        "continuity",
        "occidental",
        "history",
        "rendered",
        "meaningless",
        "moral",
        "political",
        "category",
        "break",
        "tradition",
        "become",
        "irrevocable",
        "tragic",
        "event",
        "twentieth",
        "century",
        "triumph",
        "totalitarian",
        "movement",
        "east",
        "west",
        "form",
        "stalinism",
        "nazism",
        "totalitarianism",
        "exploded",
        "established",
        "category",
        "political",
        "thought",
        "accepted",
        "standard",
        "moral",
        "judgment",
        "thereby",
        "broken",
        "continuity",
        "history",
        "faced",
        "tragic",
        "event",
        "holocaust",
        "gulag",
        "longer",
        "go",
        "back",
        "traditional",
        "concept",
        "value",
        "explain",
        "unprecedented",
        "mean",
        "precedent",
        "understand",
        "monstrous",
        "mean",
        "familiar",
        "burden",
        "time",
        "must",
        "faced",
        "without",
        "aid",
        "tradition",
        "arendt",
        "put",
        "without",
        "bannister",
        "rpw",
        "inherited",
        "concept",
        "criterion",
        "judgment",
        "dissolved",
        "impact",
        "modern",
        "political",
        "event",
        "task",
        "reestablish",
        "meaning",
        "past",
        "outside",
        "framework",
        "tradition",
        "since",
        "none",
        "retained",
        "original",
        "validity",
        "past",
        "tradition",
        "arendt",
        "attempt",
        "preserve",
        "rupture",
        "modern",
        "timeconsciousness",
        "reappropriating",
        "past",
        "mean",
        "arendt",
        "called",
        "deadly",
        "impact",
        "new",
        "thought",
        "mdt",
        "hope",
        "restore",
        "meaning",
        "present",
        "throw",
        "light",
        "contemporary",
        "situation",
        "hermeneutic",
        "strategy",
        "arendt",
        "employed",
        "reestablish",
        "link",
        "past",
        "indebted",
        "walter",
        "benjamin",
        "martin",
        "heidegger",
        "benjamin",
        "took",
        "idea",
        "fragmentary",
        "historiography",
        "one",
        "seek",
        "identify",
        "moment",
        "rupture",
        "displacement",
        "dislocation",
        "history",
        "fragmentary",
        "historiography",
        "enables",
        "one",
        "recover",
        "lost",
        "potential",
        "past",
        "hope",
        "may",
        "find",
        "actualization",
        "present",
        "heidegger",
        "took",
        "idea",
        "deconstructive",
        "reading",
        "western",
        "philosophical",
        "tradition",
        "one",
        "seek",
        "uncover",
        "original",
        "meaning",
        "category",
        "liberate",
        "distorting",
        "incrustation",
        "tradition",
        "deconstructive",
        "hermeneutics",
        "enables",
        "one",
        "recover",
        "primordial",
        "experience",
        "urphaenomene",
        "occluded",
        "forgotten",
        "philosophical",
        "tradition",
        "thereby",
        "recover",
        "lost",
        "origin",
        "philosophical",
        "concept",
        "category",
        "relying",
        "two",
        "hermeneutic",
        "strategy",
        "arendt",
        "hope",
        "redeem",
        "past",
        "lost",
        "forgotten",
        "treasure",
        "fragment",
        "past",
        "might",
        "still",
        "significance",
        "u",
        "view",
        "longer",
        "possible",
        "collapse",
        "tradition",
        "save",
        "past",
        "whole",
        "task",
        "rather",
        "redeem",
        "oblivion",
        "element",
        "past",
        "still",
        "able",
        "illuminate",
        "situation",
        "reestablish",
        "linkage",
        "past",
        "antiquarian",
        "exercise",
        "contrary",
        "without",
        "critical",
        "reappropriation",
        "past",
        "temporal",
        "horizon",
        "becomes",
        "disrupted",
        "experience",
        "precarious",
        "identity",
        "fragile",
        "arendt",
        "view",
        "necessary",
        "redeem",
        "past",
        "moment",
        "worth",
        "preserving",
        "save",
        "fragment",
        "past",
        "treasure",
        "significant",
        "u",
        "mean",
        "critical",
        "reappropriation",
        "discover",
        "past",
        "anew",
        "endow",
        "relevance",
        "meaning",
        "present",
        "make",
        "source",
        "inspiration",
        "future",
        "critical",
        "reappropriation",
        "facilitated",
        "part",
        "fact",
        "rupture",
        "modern",
        "timeconsciousness",
        "past",
        "may",
        "open",
        "u",
        "unexpected",
        "freshness",
        "tell",
        "u",
        "thing",
        "one",
        "yet",
        "ear",
        "hear",
        "bpf",
        "breakdown",
        "tradition",
        "may",
        "fact",
        "provide",
        "great",
        "chance",
        "look",
        "upon",
        "past",
        "eye",
        "undistorted",
        "tradition",
        "directness",
        "disappeared",
        "occidental",
        "reading",
        "hearing",
        "ever",
        "since",
        "roman",
        "civilization",
        "submitted",
        "authority",
        "greek",
        "thought",
        "bpf",
        "arendt",
        "return",
        "original",
        "experience",
        "greek",
        "polis",
        "represents",
        "sense",
        "attempt",
        "break",
        "fetter",
        "wornout",
        "tradition",
        "rediscover",
        "past",
        "tradition",
        "longer",
        "claim",
        "tradition",
        "arendt",
        "set",
        "criterion",
        "genuineness",
        "authoritative",
        "forgotten",
        "concealed",
        "displaced",
        "margin",
        "history",
        "operating",
        "grain",
        "traditionalism",
        "claim",
        "conventional",
        "historiography",
        "past",
        "made",
        "meaningful",
        "provide",
        "source",
        "illumination",
        "present",
        "yield",
        "treasure",
        "search",
        "new",
        "thought",
        "saving",
        "act",
        "remembrance",
        "arendt",
        "articulates",
        "conception",
        "modernity",
        "around",
        "number",
        "key",
        "feature",
        "world",
        "alienation",
        "earth",
        "alienation",
        "rise",
        "social",
        "victory",
        "animal",
        "laborans",
        "world",
        "alienation",
        "refers",
        "loss",
        "intersubjectively",
        "constituted",
        "world",
        "experience",
        "action",
        "mean",
        "establish",
        "selfidentity",
        "adequate",
        "sense",
        "reality",
        "earth",
        "alienation",
        "refers",
        "attempt",
        "escape",
        "confines",
        "earth",
        "spurred",
        "modern",
        "science",
        "technology",
        "searched",
        "way",
        "overcome",
        "earthbound",
        "condition",
        "setting",
        "exploration",
        "space",
        "attempting",
        "recreate",
        "life",
        "laboratory",
        "condition",
        "trying",
        "extend",
        "given",
        "lifespan",
        "rise",
        "social",
        "refers",
        "expansion",
        "market",
        "economy",
        "early",
        "modern",
        "period",
        "ever",
        "increasing",
        "accumulation",
        "capital",
        "social",
        "wealth",
        "rise",
        "social",
        "everything",
        "become",
        "object",
        "production",
        "consumption",
        "acquisition",
        "exchange",
        "moreover",
        "constant",
        "expansion",
        "resulted",
        "blurring",
        "distinction",
        "private",
        "public",
        "victory",
        "animal",
        "laborans",
        "refers",
        "triumph",
        "value",
        "labor",
        "homo",
        "faber",
        "man",
        "zoon",
        "politikon",
        "value",
        "characteristic",
        "world",
        "fabrication",
        "permanence",
        "stability",
        "durability",
        "well",
        "characteristic",
        "world",
        "action",
        "speech",
        "freedom",
        "plurality",
        "solidarity",
        "sacrificed",
        "favor",
        "value",
        "life",
        "productivity",
        "abundance",
        "arendt",
        "identifies",
        "two",
        "main",
        "stage",
        "emergence",
        "modernity",
        "first",
        "sixteenth",
        "nineteenth",
        "century",
        "corresponds",
        "world",
        "alienation",
        "rise",
        "social",
        "second",
        "beginning",
        "twentieth",
        "century",
        "corresponds",
        "earth",
        "alienation",
        "victory",
        "animal",
        "laborans",
        "also",
        "identifies",
        "number",
        "cause",
        "discovery",
        "america",
        "corresponding",
        "shrinking",
        "earth",
        "wave",
        "expropriation",
        "started",
        "reformation",
        "invention",
        "telescope",
        "challenging",
        "adequacy",
        "sens",
        "rise",
        "modern",
        "science",
        "philosophy",
        "subsequently",
        "conception",
        "man",
        "part",
        "process",
        "nature",
        "history",
        "expansion",
        "realm",
        "economy",
        "production",
        "accumulation",
        "social",
        "wealth",
        "arendt",
        "interpretation",
        "modernity",
        "criticized",
        "number",
        "ground",
        "focus",
        "attention",
        "two",
        "category",
        "employed",
        "arendt",
        "nature",
        "social",
        "respect",
        "category",
        "nature",
        "arendt",
        "oscillates",
        "two",
        "contrasting",
        "account",
        "according",
        "first",
        "account",
        "modern",
        "age",
        "elevating",
        "labor",
        "natural",
        "human",
        "activity",
        "highest",
        "position",
        "within",
        "vita",
        "activa",
        "brought",
        "u",
        "close",
        "nature",
        "instead",
        "building",
        "preserving",
        "human",
        "artifice",
        "creating",
        "public",
        "space",
        "action",
        "deliberation",
        "reduced",
        "engage",
        "activity",
        "sheer",
        "survival",
        "production",
        "thing",
        "definition",
        "perishable",
        "according",
        "second",
        "account",
        "however",
        "modern",
        "age",
        "characterized",
        "growing",
        "artificiality",
        "rejection",
        "anything",
        "manmade",
        "arendt",
        "cite",
        "fact",
        "natural",
        "process",
        "including",
        "life",
        "recreated",
        "artificially",
        "mean",
        "scientific",
        "experiment",
        "natural",
        "environment",
        "extensively",
        "transformed",
        "instance",
        "entirely",
        "replaced",
        "technology",
        "searched",
        "way",
        "overcome",
        "natural",
        "condition",
        "earthbound",
        "creature",
        "setting",
        "exploration",
        "space",
        "envisaging",
        "possibility",
        "inhabiting",
        "planet",
        "lead",
        "situation",
        "nothing",
        "around",
        "u",
        "naturally",
        "given",
        "event",
        "object",
        "process",
        "instead",
        "product",
        "instrument",
        "refashion",
        "world",
        "image",
        "two",
        "account",
        "difficult",
        "reconcile",
        "since",
        "former",
        "nature",
        "intruding",
        "upon",
        "even",
        "destroying",
        "human",
        "artifice",
        "latter",
        "art",
        "techne",
        "expanding",
        "upon",
        "replacing",
        "everything",
        "natural",
        "merely",
        "given",
        "result",
        "endow",
        "nature",
        "ambiguous",
        "status",
        "since",
        "former",
        "case",
        "victory",
        "animal",
        "laborans",
        "indicates",
        "subjection",
        "natural",
        "process",
        "latter",
        "case",
        "expansion",
        "scientific",
        "knowledge",
        "technological",
        "mastery",
        "indicates",
        "overcoming",
        "natural",
        "limit",
        "modern",
        "world",
        "would",
        "thus",
        "appear",
        "natural",
        "artificial",
        "much",
        "dominance",
        "labor",
        "lifeprocess",
        "specie",
        "well",
        "much",
        "dominance",
        "techne",
        "respect",
        "second",
        "category",
        "social",
        "arendt",
        "unable",
        "account",
        "certain",
        "important",
        "feature",
        "modern",
        "world",
        "arendt",
        "identifies",
        "social",
        "activity",
        "formerly",
        "restricted",
        "private",
        "sphere",
        "household",
        "necessity",
        "life",
        "claim",
        "tremendous",
        "expansion",
        "economy",
        "end",
        "eighteenth",
        "century",
        "activity",
        "taken",
        "public",
        "realm",
        "transformed",
        "sphere",
        "satisfaction",
        "material",
        "need",
        "society",
        "thus",
        "invaded",
        "conquered",
        "public",
        "realm",
        "turning",
        "function",
        "previously",
        "private",
        "need",
        "concern",
        "thereby",
        "destroyed",
        "boundary",
        "separating",
        "public",
        "private",
        "arendt",
        "also",
        "claim",
        "expansion",
        "social",
        "realm",
        "tripartite",
        "division",
        "human",
        "activity",
        "undermined",
        "point",
        "becoming",
        "meaningless",
        "view",
        "social",
        "realm",
        "established",
        "monopoly",
        "distinction",
        "labor",
        "work",
        "action",
        "lost",
        "since",
        "every",
        "effort",
        "expended",
        "reproducing",
        "material",
        "condition",
        "existence",
        "obsessed",
        "life",
        "productivity",
        "consumption",
        "turned",
        "society",
        "laborer",
        "jobholder",
        "longer",
        "appreciate",
        "value",
        "associated",
        "work",
        "associated",
        "action",
        "brief",
        "account",
        "clear",
        "arendt",
        "concept",
        "social",
        "play",
        "crucial",
        "role",
        "assessment",
        "modernity",
        "however",
        "argued",
        "may",
        "led",
        "series",
        "questionable",
        "judgment",
        "first",
        "place",
        "arendt",
        "characterization",
        "social",
        "overly",
        "restricted",
        "claim",
        "social",
        "realm",
        "labor",
        "biological",
        "material",
        "necessity",
        "reproduction",
        "condition",
        "existence",
        "also",
        "claim",
        "rise",
        "social",
        "coincides",
        "expansion",
        "economy",
        "end",
        "eighteenth",
        "century",
        "however",
        "identified",
        "social",
        "growth",
        "economy",
        "past",
        "two",
        "century",
        "arendt",
        "characterize",
        "term",
        "subsistence",
        "model",
        "simple",
        "reproduction",
        "see",
        "benhabib",
        "ch",
        "bernstein",
        "ch",
        "hansen",
        "ch",
        "parekh",
        "ch",
        "secondly",
        "arendt",
        "identification",
        "social",
        "activity",
        "household",
        "responsible",
        "major",
        "shortcoming",
        "analysis",
        "economy",
        "fact",
        "unable",
        "acknowledge",
        "modern",
        "capitalist",
        "economy",
        "constitutes",
        "structure",
        "power",
        "highly",
        "asymmetric",
        "distribution",
        "cost",
        "reward",
        "relying",
        "misleading",
        "analogy",
        "household",
        "maintains",
        "question",
        "pertaining",
        "economy",
        "prepolitical",
        "thus",
        "ignores",
        "crucial",
        "question",
        "economic",
        "power",
        "exploitation",
        "see",
        "bernstein",
        "ch",
        "hansen",
        "ch",
        "parekh",
        "ch",
        "pitkin",
        "pitkin",
        "ch",
        "hinchman",
        "hinchman",
        "wolin",
        "ch",
        "hinchman",
        "hinchman",
        "finally",
        "insisting",
        "strict",
        "separation",
        "private",
        "public",
        "social",
        "political",
        "unable",
        "account",
        "essential",
        "connection",
        "sphere",
        "struggle",
        "redraw",
        "boundary",
        "today",
        "many",
        "socalled",
        "private",
        "issue",
        "become",
        "public",
        "concern",
        "struggle",
        "justice",
        "equal",
        "right",
        "extended",
        "many",
        "sphere",
        "insulating",
        "political",
        "sphere",
        "concern",
        "social",
        "maintaining",
        "strict",
        "distinction",
        "public",
        "private",
        "arendt",
        "unable",
        "account",
        "important",
        "achievement",
        "modernity",
        "extension",
        "justice",
        "equal",
        "right",
        "redrawing",
        "boundary",
        "public",
        "private",
        "see",
        "benhabib",
        "ch",
        "bernstein",
        "ch",
        "dietz",
        "ch",
        "pitkin",
        "pitkin",
        "ch",
        "honig",
        "zaretsky",
        "ch",
        "calhoun",
        "mcgowan"
    ]
}