{
    "main_text": "The Four Causes\n2. The Four Causes\n\nIn the Posterior Analytics, Aristotle places the following\ncrucial condition on proper knowledge: we think we have knowledge of a\nthing only when we have grasped its cause (APost. I 2, 71 b\n9–11. Cf. APost. II 11, 94 a 20). That proper knowledge\nis knowledge of the cause is repeated in the Physics: we\nthink we do not have knowledge of a thing until we have grasped its\nwhy, that is to say, its cause (Phys. II 3, 194 b\n17–20). Since Aristotle obviously conceives of a causal\ninvestigation as the search for an answer to a why-question, and a\nwhy-question is a request for an explanation, it can be useful to\nthink of a cause as a certain type of explanation.\n\nThis last statement calls for a few words of elaboration. To be sure,\nnot all why-questions are requests for an explanation that identifies\na cause, let alone a cause in the particular sense envisioned by\nAristotle. Still, Aristotle is clearly committed to the view that\ngiving the relevant causes is necessary and sufficient for offering a\nscientific explanation. His conception of a cause has both a\nmetaphysical and an epistemological  component. Part\nof the challenge for us is to do justice to both components. Following\na recent suggestion, we may say that “causes are not ways in\nwhich we explain things, except derivatively, in virtue of the fact\nthat they are ways in which some elements of the natural world explain\nothers.” (Stein 2012a: 705)\n\nIn Physics II 3 and Metaphysics V 2, Aristotle\noffers his general account of the four causes. This account is general\nin the sense that it applies to everything that requires an\nexplanation, including artistic production and human action. Here\nAristotle recognizes four different explanatory roles that a thing can\nplay. As a result, there are four different (kinds of) causes :\n\nThe material cause or that which is given in reply to the\nquestion “What is it made out of?” What is singled out in\nthe answer need not be material objects such as bricks, stones, or\nplanks. By Aristotle’s lights, A and B are the material cause of\nthe syllable BA.\nThe formal cause or that which is given in reply to the\nquestion “\"What is it?”. What is singled out in the answer\nis the essence or the what-it-is-to-be something.\nThe efficient cause or that which is given in reply to\nthe question: “Where does change (or motion) come from?”.\nWhat is singled out in the answer is the whence of change (or\nmotion).\nThe final cause is that which is given in reply to the\nquestion: “What is its good?”. What is singled out in\nthe answer is that for the sake of which something is done or takes\nplace.\n\n\nAll the four (kinds of) causes may enter in a non-coincidental way in\nthe explanation of something. Consider the production of an artifact\nlike a bronze statue. The bronze enters in the explanation of the\nproduction of the statue as the material cause. Note that the\nbronze is not only the material out of which the statue is made but it\nis also the subject of change, that is, the thing that undergoes the\nchange and results in a statue. The bronze is melted and poured in\norder to acquire a new shape, the shape of the statue. This shape\nenters in the explanation of the production of the statue as the\nformal cause. However, an adequate explanation of the production\nof a statue requires also a reference to the efficient cause\nor the principle that produces the statue. For Aristotle, this\nprinciple is the art of bronze-casting the statue (Phys. II\n3, 195 a 6–8. Cf. Metaph. V 2, 1013 b 6–9).\n\nThis result is mildly surprising and requires a few words of\nelaboration. There is no doubt that the art of bronze-casting resides\nin an individual artisan who is responsible for the production of the\nstatue. According to Aristotle, however, all the artisan does in the\nproduction of the statue is the manifestation of specific knowledge.\nThis knowledge, not the artisan who has mastered it, is the salient\nexplanatory factor that one should pick as the most accurate\nspecification of the efficient cause (Phys. II 3, 195 b\n21–25). \n\nBy picking the art, not the artisan, Aristotle is not just trying to\nprovide an explanation for the production of the statue which is not\ndependent upon the desires, beliefs, and intentions of the individual\nartisan; rather, he is trying to offer an entirely different type of\nexplanation–namely, an explanation that does not make a\nreference (implicit or explicit) to desires, beliefs, and intentions.\nMore directly, the art of bronze-casting the statue enters in the\nexplanation as the efficient cause because it helps us to understand\nwhat it takes to produce a statue; that is to say, what steps are\nrequired to produce a statue starting from a piece of bronze.\n\nThe question for us is this: can an explanation of the kind outlined\nabove be given without reference to the final outcome of the\nproduction, namely the statue? The answer is emphatically\n“no”. A model is made for producing the statue. A mold is\nprepared for producing the statue. The bronze is melted and poured for\nproducing the statue. Both the prior and the subsequent stage are for\nthe sake of a certain end, the production of the statue. Clearly, the\nstatue enters in the explanation of each step of the artistic\nproduction as the final cause or that for the sake of which\neverything in the production process is done.\n\nIn thinking about the four causes, we have come to understand that\nAristotle offers a teleological explanation of the production\nof a bronze statue; that is to say, an explanation that makes a\nreference to the telos or end of the process. Moreover, a\nteleological explanation of the type sketched above does not crucially\ndepend upon the application of psychological concepts such as desires,\nbeliefs, and intentions. This is important because artistic production\nprovides Aristotle with a teleological model for the study of natural\nprocesses, whose explanation does not involve beliefs, desires,\nintentions, or anything of this sort. Some have objected that\nAristotle explains natural process on the basis of an inappropriately\npsychological teleological model; that is to say, a teleological model\nthat involves a purposive agent who is somehow sensitive to the end.\nThis objection can be met if the artistic model is understood in\nnon-psychological terms. In other words, Aristotle does not\npsychologize nature because his study of the natural world is based on\na teleological model that is consciously free from psychological\nfactors. (For a philosophically-minded reflection on the role that\nartistic production plays in developing an explanatory model for the\nstudy of nature, see Broadie 1987, pp. 35–50.)\n\nBy insisting on the art of bronze-casting as the most accurate\nefficient cause of the production of the statue, Aristotle does not\nmean to preclude an appeal to the beliefs and desires of the\nindividual artisan. On the contrary, there are cases where the\nindividual realization of the art obviously enters in the explanation\nof the bronze statue. For example, one may be interested in a\nparticular bronze statue because that statue is the great achievement\nof an artisan who has not only mastered the art but has also applied\nit with a distinctive style. In this case it is perfectly appropriate\nto make reference to the beliefs and desires of the artisan. Aristotle\nseems to make room for this case when he says that we should look\n“for general causes of general things and for particular causes\nof particular things” (Phys. II 3, 195 b 25–26).\nNote, however, that the idiosyncrasies that may be important in\nstudying a particular bronze statue as the great achievement of an\nindividual artisan may be extraneous to a more central (and more\ninteresting, at least for Aristotle) case. To understand why let us\nfocus on the study of nature. When the student of nature is concerned\nwith the explanation of a natural phenomenon like the formation of\nsharp teeth in the front and broad molars in the back of the mouth,\nthe student of nature is concerned with what is typical about\nthat phenomenon. In other words, the student of nature is expected to\nprovide an explanation of why certain animals typically have\na certain dental arrangement. We shall return to this example in due\ncourse. For the time being, it is important to emphasize this\nimportant feature of the explanatory project attempted by Aristotle; a\nfeature that we must keep in mind in trying to understand his theory\nof causality. This theory has in fact been developed primarily (but\nnot exclusively) for the study of nature.\n\nSo far we have been looking at what Aristotle calls intrinsic\ncauses, where “intrinsic” is a translation of the\nGreek kath’hauton. However, Aristotle contrasts these\n(kinds of) causes with the coincidental ones, where\n“coincidental” is a translation of the Greek kata\nsumbebêkos.\n\nThis distinction can be appreciated by reflecting on our example of\nbronze-casting a statue. We have seen that the whence of motion is the\nartisan insofar as this person has mastered the art of bronze-casting\na statue. By Aristotle’s light, the art of bronze-casting\ninsofar as is present in the artisan is the most accurate description\nof the efficient cause of the statue. This is also an intrinsic\nefficient cause of the statue. However, the person who is\nresponsible for bronze-casting the statue may be described in many\nother ways. For example, this person may be described as a woman, the\nsister of X, or the daughter of Y. Aristotle makes\nit very clear that these descriptions, important as they are, are not\nrelevant when it comes to giving the efficient cause of the statue\nbecause they do not enter in an explanatory relationship with the\nfinal outcome of the production process brings about, namely the\nbronze statue. In other words, saying that the daughter of X\nproduced the bronze statue does not convey any information as to how\nthe statue has come into being. In other words, this description is\nextrinsic to the production process. It just so happens, by\ncoincidence, that the artisan is the daughter of X or the\nsister of Y.\n\nThe distinction between intrinsic and coincidental causes helps us\nunderscore that the Aristotelian causes are expected to have\nexplanatory power.\n",
    "section_title": "2. The Four Causes",
    "entry_title": "Aristotle on Causality",
    "hierarchy_title": "Aristotle on Causality || The Four Causes",
    "tokenized_text": [
        "four",
        "cause",
        "four",
        "cause",
        "posterior",
        "analytics",
        "aristotle",
        "place",
        "following",
        "crucial",
        "condition",
        "proper",
        "knowledge",
        "think",
        "knowledge",
        "thing",
        "grasped",
        "cause",
        "apost",
        "b",
        "cf",
        "apost",
        "ii",
        "proper",
        "knowledge",
        "knowledge",
        "cause",
        "repeated",
        "physic",
        "think",
        "knowledge",
        "thing",
        "grasped",
        "say",
        "cause",
        "phys",
        "ii",
        "b",
        "since",
        "aristotle",
        "obviously",
        "conceives",
        "causal",
        "investigation",
        "search",
        "answer",
        "whyquestion",
        "whyquestion",
        "request",
        "explanation",
        "useful",
        "think",
        "cause",
        "certain",
        "type",
        "explanation",
        "last",
        "statement",
        "call",
        "word",
        "elaboration",
        "sure",
        "whyquestions",
        "request",
        "explanation",
        "identifies",
        "cause",
        "let",
        "alone",
        "cause",
        "particular",
        "sense",
        "envisioned",
        "aristotle",
        "still",
        "aristotle",
        "clearly",
        "committed",
        "view",
        "giving",
        "relevant",
        "cause",
        "necessary",
        "sufficient",
        "offering",
        "scientific",
        "explanation",
        "conception",
        "cause",
        "metaphysical",
        "epistemological",
        "component",
        "part",
        "challenge",
        "u",
        "justice",
        "component",
        "following",
        "recent",
        "suggestion",
        "may",
        "say",
        "cause",
        "way",
        "explain",
        "thing",
        "except",
        "derivatively",
        "virtue",
        "fact",
        "way",
        "element",
        "natural",
        "world",
        "explain",
        "others",
        "stein",
        "a",
        "physic",
        "ii",
        "metaphysics",
        "v",
        "aristotle",
        "offer",
        "general",
        "account",
        "four",
        "cause",
        "account",
        "general",
        "sense",
        "applies",
        "everything",
        "requires",
        "explanation",
        "including",
        "artistic",
        "production",
        "human",
        "action",
        "aristotle",
        "recognizes",
        "four",
        "different",
        "explanatory",
        "role",
        "thing",
        "play",
        "result",
        "four",
        "different",
        "kind",
        "cause",
        "material",
        "cause",
        "given",
        "reply",
        "question",
        "made",
        "singled",
        "answer",
        "need",
        "material",
        "object",
        "brick",
        "stone",
        "plank",
        "aristotle",
        "light",
        "b",
        "material",
        "cause",
        "syllable",
        "ba",
        "formal",
        "cause",
        "given",
        "reply",
        "question",
        "singled",
        "answer",
        "essence",
        "whatitistobe",
        "something",
        "efficient",
        "cause",
        "given",
        "reply",
        "question",
        "change",
        "motion",
        "come",
        "singled",
        "answer",
        "whence",
        "change",
        "motion",
        "final",
        "cause",
        "given",
        "reply",
        "question",
        "good",
        "singled",
        "answer",
        "sake",
        "something",
        "done",
        "take",
        "place",
        "four",
        "kind",
        "cause",
        "may",
        "enter",
        "noncoincidental",
        "way",
        "explanation",
        "something",
        "consider",
        "production",
        "artifact",
        "like",
        "bronze",
        "statue",
        "bronze",
        "enters",
        "explanation",
        "production",
        "statue",
        "material",
        "cause",
        "note",
        "bronze",
        "material",
        "statue",
        "made",
        "also",
        "subject",
        "change",
        "thing",
        "undergoes",
        "change",
        "result",
        "statue",
        "bronze",
        "melted",
        "poured",
        "order",
        "acquire",
        "new",
        "shape",
        "shape",
        "statue",
        "shape",
        "enters",
        "explanation",
        "production",
        "statue",
        "formal",
        "cause",
        "however",
        "adequate",
        "explanation",
        "production",
        "statue",
        "requires",
        "also",
        "reference",
        "efficient",
        "cause",
        "principle",
        "produce",
        "statue",
        "aristotle",
        "principle",
        "art",
        "bronzecasting",
        "statue",
        "phys",
        "ii",
        "cf",
        "metaph",
        "v",
        "b",
        "result",
        "mildly",
        "surprising",
        "requires",
        "word",
        "elaboration",
        "doubt",
        "art",
        "bronzecasting",
        "resides",
        "individual",
        "artisan",
        "responsible",
        "production",
        "statue",
        "according",
        "aristotle",
        "however",
        "artisan",
        "production",
        "statue",
        "manifestation",
        "specific",
        "knowledge",
        "knowledge",
        "artisan",
        "mastered",
        "salient",
        "explanatory",
        "factor",
        "one",
        "pick",
        "accurate",
        "specification",
        "efficient",
        "cause",
        "phys",
        "ii",
        "b",
        "picking",
        "art",
        "artisan",
        "aristotle",
        "trying",
        "provide",
        "explanation",
        "production",
        "statue",
        "dependent",
        "upon",
        "desire",
        "belief",
        "intention",
        "individual",
        "artisan",
        "rather",
        "trying",
        "offer",
        "entirely",
        "different",
        "type",
        "explanationnamely",
        "explanation",
        "make",
        "reference",
        "implicit",
        "explicit",
        "desire",
        "belief",
        "intention",
        "directly",
        "art",
        "bronzecasting",
        "statue",
        "enters",
        "explanation",
        "efficient",
        "cause",
        "help",
        "u",
        "understand",
        "take",
        "produce",
        "statue",
        "say",
        "step",
        "required",
        "produce",
        "statue",
        "starting",
        "piece",
        "bronze",
        "question",
        "u",
        "explanation",
        "kind",
        "outlined",
        "given",
        "without",
        "reference",
        "final",
        "outcome",
        "production",
        "namely",
        "statue",
        "answer",
        "emphatically",
        "model",
        "made",
        "producing",
        "statue",
        "mold",
        "prepared",
        "producing",
        "statue",
        "bronze",
        "melted",
        "poured",
        "producing",
        "statue",
        "prior",
        "subsequent",
        "stage",
        "sake",
        "certain",
        "end",
        "production",
        "statue",
        "clearly",
        "statue",
        "enters",
        "explanation",
        "step",
        "artistic",
        "production",
        "final",
        "cause",
        "sake",
        "everything",
        "production",
        "process",
        "done",
        "thinking",
        "four",
        "cause",
        "come",
        "understand",
        "aristotle",
        "offer",
        "teleological",
        "explanation",
        "production",
        "bronze",
        "statue",
        "say",
        "explanation",
        "make",
        "reference",
        "telos",
        "end",
        "process",
        "moreover",
        "teleological",
        "explanation",
        "type",
        "sketched",
        "crucially",
        "depend",
        "upon",
        "application",
        "psychological",
        "concept",
        "desire",
        "belief",
        "intention",
        "important",
        "artistic",
        "production",
        "provides",
        "aristotle",
        "teleological",
        "model",
        "study",
        "natural",
        "process",
        "whose",
        "explanation",
        "involve",
        "belief",
        "desire",
        "intention",
        "anything",
        "sort",
        "objected",
        "aristotle",
        "explains",
        "natural",
        "process",
        "basis",
        "inappropriately",
        "psychological",
        "teleological",
        "model",
        "say",
        "teleological",
        "model",
        "involves",
        "purposive",
        "agent",
        "somehow",
        "sensitive",
        "end",
        "objection",
        "met",
        "artistic",
        "model",
        "understood",
        "nonpsychological",
        "term",
        "word",
        "aristotle",
        "psychologize",
        "nature",
        "study",
        "natural",
        "world",
        "based",
        "teleological",
        "model",
        "consciously",
        "free",
        "psychological",
        "factor",
        "philosophicallyminded",
        "reflection",
        "role",
        "artistic",
        "production",
        "play",
        "developing",
        "explanatory",
        "model",
        "study",
        "nature",
        "see",
        "broadie",
        "pp",
        "insisting",
        "art",
        "bronzecasting",
        "accurate",
        "efficient",
        "cause",
        "production",
        "statue",
        "aristotle",
        "mean",
        "preclude",
        "appeal",
        "belief",
        "desire",
        "individual",
        "artisan",
        "contrary",
        "case",
        "individual",
        "realization",
        "art",
        "obviously",
        "enters",
        "explanation",
        "bronze",
        "statue",
        "example",
        "one",
        "may",
        "interested",
        "particular",
        "bronze",
        "statue",
        "statue",
        "great",
        "achievement",
        "artisan",
        "mastered",
        "art",
        "also",
        "applied",
        "distinctive",
        "style",
        "case",
        "perfectly",
        "appropriate",
        "make",
        "reference",
        "belief",
        "desire",
        "artisan",
        "aristotle",
        "seems",
        "make",
        "room",
        "case",
        "say",
        "look",
        "general",
        "cause",
        "general",
        "thing",
        "particular",
        "cause",
        "particular",
        "thing",
        "phys",
        "ii",
        "b",
        "note",
        "however",
        "idiosyncrasy",
        "may",
        "important",
        "studying",
        "particular",
        "bronze",
        "statue",
        "great",
        "achievement",
        "individual",
        "artisan",
        "may",
        "extraneous",
        "central",
        "interesting",
        "least",
        "aristotle",
        "case",
        "understand",
        "let",
        "u",
        "focus",
        "study",
        "nature",
        "student",
        "nature",
        "concerned",
        "explanation",
        "natural",
        "phenomenon",
        "like",
        "formation",
        "sharp",
        "teeth",
        "front",
        "broad",
        "molar",
        "back",
        "mouth",
        "student",
        "nature",
        "concerned",
        "typical",
        "phenomenon",
        "word",
        "student",
        "nature",
        "expected",
        "provide",
        "explanation",
        "certain",
        "animal",
        "typically",
        "certain",
        "dental",
        "arrangement",
        "shall",
        "return",
        "example",
        "due",
        "course",
        "time",
        "important",
        "emphasize",
        "important",
        "feature",
        "explanatory",
        "project",
        "attempted",
        "aristotle",
        "feature",
        "must",
        "keep",
        "mind",
        "trying",
        "understand",
        "theory",
        "causality",
        "theory",
        "fact",
        "developed",
        "primarily",
        "exclusively",
        "study",
        "nature",
        "far",
        "looking",
        "aristotle",
        "call",
        "intrinsic",
        "cause",
        "intrinsic",
        "translation",
        "greek",
        "kath",
        "hauton",
        "however",
        "aristotle",
        "contrast",
        "kind",
        "cause",
        "coincidental",
        "one",
        "coincidental",
        "translation",
        "greek",
        "kata",
        "sumbebêkos",
        "distinction",
        "appreciated",
        "reflecting",
        "example",
        "bronzecasting",
        "statue",
        "seen",
        "whence",
        "motion",
        "artisan",
        "insofar",
        "person",
        "mastered",
        "art",
        "bronzecasting",
        "statue",
        "aristotle",
        "light",
        "art",
        "bronzecasting",
        "insofar",
        "present",
        "artisan",
        "accurate",
        "description",
        "efficient",
        "cause",
        "statue",
        "also",
        "intrinsic",
        "efficient",
        "cause",
        "statue",
        "however",
        "person",
        "responsible",
        "bronzecasting",
        "statue",
        "may",
        "described",
        "many",
        "way",
        "example",
        "person",
        "may",
        "described",
        "woman",
        "sister",
        "x",
        "daughter",
        "y",
        "aristotle",
        "make",
        "clear",
        "description",
        "important",
        "relevant",
        "come",
        "giving",
        "efficient",
        "cause",
        "statue",
        "enter",
        "explanatory",
        "relationship",
        "final",
        "outcome",
        "production",
        "process",
        "brings",
        "namely",
        "bronze",
        "statue",
        "word",
        "saying",
        "daughter",
        "x",
        "produced",
        "bronze",
        "statue",
        "convey",
        "information",
        "statue",
        "come",
        "word",
        "description",
        "extrinsic",
        "production",
        "process",
        "happens",
        "coincidence",
        "artisan",
        "daughter",
        "x",
        "sister",
        "y",
        "distinction",
        "intrinsic",
        "coincidental",
        "cause",
        "help",
        "u",
        "underscore",
        "aristotelian",
        "cause",
        "expected",
        "explanatory",
        "power"
    ]
}