{
    "main_text": "General Theory of Constitutions and Citizenship\n3. General Theory of Constitutions and Citizenship\n\nAristotle states, “The politician and lawgiver is wholly\noccupied with the city-state, and the constitution is a certain way of\norganizing those who inhabit the city-state” (III.1.1274b36–8).\nHis general theory of constitutions is set forth in Politics\nIII. He begins with a definition of the citizen\n(politês), since the city-state is by nature a\ncollective entity, a multitude of citizens. Citizens are distinguished\nfrom other inhabitants, such as resident aliens and slaves; and even\nchildren and seniors are not unqualified citizens (nor are most\nordinary workers). After further analysis he defines the citizen as a\nperson who has the right (exousia) to participate in\ndeliberative or judicial office (1275b18–21). In Athens, for\nexample, citizens had the right to attend the assembly, the council,\nand other bodies, or to sit on juries. The Athenian system differed\nfrom a modern representative democracy in that the citizens were more\ndirectly involved in governing. Although full citizenship tended to be\nrestricted in the Greek city-states (with women, slaves, foreigners,\nand some others excluded), the citizens were more deeply enfranchised\nthan in modern representative democracies because they were more\ndirectly involved in governing. This is reflected in Aristotle’s\ndefinition of the citizen (without qualification). Further, he defines\nthe city-state (in the unqualified sense) as a multitude of such\ncitizens which is adequate for a self-sufficient life\n(1275b20–21).\n\nAristotle defines the constitution (politeia) as a way of\norganizing the offices of the city-state, particularly the sovereign\noffice (III.6.1278b8–10; cf. IV.1.1289a15–18). The\nconstitution thus defines the governing body, which takes different\nforms: for example, in a democracy it is the people, and in an\noligarchy it is a select few (the wealthy or well born). Before\nattempting to distinguish and evaluate various constitutions Aristotle\nconsiders two questions. First, why does a city-state come into being?\nHe recalls the thesis, defended in Politics I.2, that human\nbeings are by nature political animals, who naturally want to live\ntogether. For a further discussion of this topic, see the following\nsupplementary document:\n\nSupplement: Political Naturalism\n\n\nAristotle then adds, “The common advantage also brings them\ntogether insofar as they each attain the noble life. This is above all\nthe end for all both in common and separately”\n(III.6.1278b19–24). Second, what are the different forms of rule\nby which one individual or group can rule over another? Aristotle\ndistinguishes several types of rule, based on the nature of the soul\nof the ruler and of the subject. He first considers despotic rule,\nwhich is exemplified in the master-slave relationship. Aristotle\nthinks that this form of rule is justified in the case of natural\nslaves who (he asserts without evidence) lack a deliberative faculty\nand thus need a natural master to direct them (I.13.1260a12; slavery\nis defended at length in Politics I.4–8). Although a\nnatural slave allegedly benefits from having a master, despotic rule\nis still primarily for the sake of the master and only incidentally\nfor the slave (III.6.1278b32–7). (Aristotle provides no argument\nfor this: if some persons are congenitally incapable of governing\nthemselves, why should they not be ruled primarily for their own\nsakes?) He next considers paternal and marital rule, which he also\nviews as defensible: “the male is by nature more capable of\nleadership than the female, unless he is constituted in some way\ncontrary to nature, and the elder and perfect [is by nature more\ncapable of leadership] than the younger and imperfect”\n(I.12.1259a39–b4).\n\nAristotle is persuasive when he argues that children need adult\nsupervision because their rationality is “imperfect”\n(ateles) or immature. But he is unconvincing to modern\nreaders when he alleges (without substantiation) that, although women\nhave a deliberative faculty, it is “without authority”\n(akuron), so that females require male supervision\n(I.13.1260a13–14). (Aristotle’s arguments about slaves and women\nappear so weak that some commentators take them to be ironic. However,\nwhat is obvious to a modern reader need not have been so to an ancient\nGreek, so that it is not necessary to suppose Aristotle’s\ndiscussion is disingenuous.) It is noteworthy, however, that paternal\nand marital rule are properly practiced for the sake of the ruled (for\nthe sake of the child and of the wife respectively), just as arts like\nmedicine or gymnastics are practiced for the sake of the patient\n(III.6.1278b37–1279a1). In this respect they resemble political\nrule, which is the form of rule appropriate when the ruler and the\nsubject have equal and similar rational capacities. This is\nexemplified by naturally equal citizens who take turns at ruling for\none another’s advantage (1279a8–13). This sets the stage for the\nfundamental claim of Aristotle’s constitutional theory:\n“constitutions which aim at the common advantage are correct and\njust without qualification, whereas those which aim only at the\nadvantage of the rulers are deviant and unjust, because they involve\ndespotic rule which is inappropriate for a community of free\npersons” (1279a17–21).\n\nThe distinction between correct and deviant constitutions is combined\nwith the observation that the government may consist of one person, a\nfew, or a multitude. Hence, there are six possible constitutional\nforms (Politics III.7):\n\n\n\n \nCorrect\nDeviant \n\nOne Ruler\nKingship\nTyranny \n\nFew Rulers\nAristocracy\nOligarchy \n\nMany Rulers\nPolity\nDemocracy  \n\n\nThis six-fold classification (which is doubtless adapted from Plato’s\nStatesman 302c–d) sets the stage for Aristotle’s inquiry into\nthe best constitution, although it is modified in various ways\nthroughout the Politics. For example, he observes that the\ndominant class in oligarchy (literally rule of the oligoi,\ni.e., few) is typically the wealthy, whereas in democracy (literally\nrule of the dêmos, i.e., people) it is the poor, so\nthat these economic classes should be included in the definition of\nthese forms (see Politics III.8, IV.4, and VI.2 for\nalternative accounts). Also, polity is later characterized as a kind\nof “mixed” constitution typified by rule of the\n“middle” group of citizens, a moderately wealthy class\nbetween the rich and poor (Politics IV.11).\n\nAristotle’s constitutional theory is based on his theory of justice,\nwhich is expounded in Nicomachean Ethics book V. Aristotle\ndistinguishes two different but related senses of\n“justice” — universal and particular — both of\nwhich play an important role in his constitutional theory. Firstly, in\nthe universal sense “justice” means\n“lawfulness” and is concerned with the common advantage and\nhappiness of the political community (NE\nV.1.1129b11–19, cf. Pol. III.12.1282b16–17). The\nconception of universal justice undergirds the distinction between\ncorrect (just) and deviant (unjust) constitutions. But what exactly\nthe “common advantage” (koinê sumpheron)\nentails is a matter of scholarly controversy. Some passages imply that\njustice involves the advantage of all the citizens; for example, every\ncitizen of the best constitution has a just claim to private property\nand to an education (Pol. VII.9.1329a23–4,\n13.1332a32–8). But Aristotle also allows that it might be\n“in a way” just to ostracize powerful citizens even when\nthey have not been convicted of any crimes (III.13.1284b15–20).\nWhether Aristotle understands the common advantage as safeguarding the\ninterests of each and every citizen has a bearing on whether and to\nwhat extent he anticipates what moderns would understand as a theory\nof individual rights. (See Fred Miller and Richard Kraut for differing\ninterpretations.)\n\nSecondly, in the particular sense “justice” means\n“equality” or “fairness”, and this includes\ndistributive justice, according to which different individuals have\njust claims to shares of some common asset such as property. Aristotle\nanalyzes arguments for and against the different constitutions as\ndifferent applications of the principle of distributive justice\n(III.9.1280a7–22). Everyone agrees, he says, that justice\ninvolves treating equal persons equally, and treating unequal persons\nunequally, but they do not agree on the standard by which individuals\nare deemed to be equally (or unequally) meritorious or deserving. He\nassumes his own analysis of distributive justice set forth in\nNicomachean Ethics V.3: Justice requires that benefits be\ndistributed to individuals in proportion to their merit or desert. The\noligarchs mistakenly think that those who are superior in wealth\nshould also have superior political rights, whereas the democrats hold\nthat those who are equal in free birth should also have equal\npolitical rights. Both of these conceptions of political justice are\nmistaken in Aristotle’s view, because they assume a false conception\nof the ultimate end of the city-state. The city-state is neither a\nbusiness enterprise to maximize wealth (as the oligarchs suppose) nor\nan association to promote liberty and equality (as the democrats\nmaintain). Instead, Aristotle argues, “the good life is the end\nof the city-state,” that is, a life consisting of noble actions\n(1280b39–1281a4). Hence, the correct conception of justice is\naristocratic, assigning political rights to those who make a full\ncontribution to the political community, that is, to those with virtue\nas well as property and freedom (1281a4–8). This is what\nAristotle understands by an “aristocratic” constitution:\nliterally, the rule of the aristoi, i.e., best persons.\nAristotle explores the implications of this argument in the remainder\nof Politics III, considering the rival claims of the rule of\nlaw and the rule of a supremely virtuous individual. Here absolute\nkingship is a limiting case of aristocracy. Again, in books VII-VIII,\nAristotle describes the ideal constitution in which the citizens are\nfully virtuous.\n\nAlthough justice is in Aristotle’s view  the foremost\npolitical virtue (Pol. III.9.1283a38–40), the other great\nsocial virtue, friendship, should not be overlooked, because the two\nvirtues work hand in hand to secure every sort of association\n(EN VIII.9.1159b26–7). Justice enables the citizens of a\ncity-state to share peacefully in the benefits and burdens of\ncooperation, while friendship holds them together and prevents them\nfrom breaking up into warring factions (cf. Pol.\nII.4.1262b7–9). Friends are expected to treat each other justly, but\nfriendship goes beyond justice because it is a complex mutual bond in\nwhich individuals choose the good for others and trust that others are\nchoosing the good for them (cf. EE VII.2.1236a14–15, b2–3;\nEN VIII.2.1155b34–3.1156a10). Because choosing the good for\none another is essential to friendship and there are three different\nways in which something can be called ‘good’ for a human\nbeing—virtuous (i.e., good without qualification), useful, or\npleasant—there are three types of friendship: hedonistic,\nutilitarian, and virtuous. Political (or civic) friendship is a\nspecies of utilitarian friendship, and it is the most important form\nof utilitarian friendship because the polis is the greatest community.\nOpposed to political friendship is enmity, which leads to faction or\ncivil war (stasis) or even to political revolution and the\nbreakup of the polis, as discussed in Book V of the Politics.\nAristotle offers general accounts of political or civic friendship as\npart of his general theory of friendship in EE VII.10 and\nEN VIII.9–12.\n",
    "section_title": "3. General Theory of Constitutions and Citizenship",
    "entry_title": "Aristotle’s Political Theory",
    "hierarchy_title": "Aristotle’s Political Theory || General Theory of Constitutions and Citizenship",
    "tokenized_text": [
        "general",
        "theory",
        "constitution",
        "citizenship",
        "general",
        "theory",
        "constitution",
        "citizenship",
        "aristotle",
        "state",
        "politician",
        "lawgiver",
        "wholly",
        "occupied",
        "citystate",
        "constitution",
        "certain",
        "way",
        "organizing",
        "inhabit",
        "citystate",
        "iiib",
        "general",
        "theory",
        "constitution",
        "set",
        "forth",
        "politics",
        "iii",
        "begin",
        "definition",
        "citizen",
        "politês",
        "since",
        "citystate",
        "nature",
        "collective",
        "entity",
        "multitude",
        "citizen",
        "citizen",
        "distinguished",
        "inhabitant",
        "resident",
        "alien",
        "slave",
        "even",
        "child",
        "senior",
        "unqualified",
        "citizen",
        "ordinary",
        "worker",
        "analysis",
        "defines",
        "citizen",
        "person",
        "right",
        "exousia",
        "participate",
        "deliberative",
        "judicial",
        "office",
        "b",
        "athens",
        "example",
        "citizen",
        "right",
        "attend",
        "assembly",
        "council",
        "body",
        "sit",
        "jury",
        "athenian",
        "system",
        "differed",
        "modern",
        "representative",
        "democracy",
        "citizen",
        "directly",
        "involved",
        "governing",
        "although",
        "full",
        "citizenship",
        "tended",
        "restricted",
        "greek",
        "citystate",
        "woman",
        "slave",
        "foreigner",
        "others",
        "excluded",
        "citizen",
        "deeply",
        "enfranchised",
        "modern",
        "representative",
        "democracy",
        "directly",
        "involved",
        "governing",
        "reflected",
        "aristotle",
        "definition",
        "citizen",
        "without",
        "qualification",
        "defines",
        "citystate",
        "unqualified",
        "sense",
        "multitude",
        "citizen",
        "adequate",
        "selfsufficient",
        "life",
        "b",
        "aristotle",
        "defines",
        "constitution",
        "politeia",
        "way",
        "organizing",
        "office",
        "citystate",
        "particularly",
        "sovereign",
        "office",
        "iiib",
        "cf",
        "iva",
        "constitution",
        "thus",
        "defines",
        "governing",
        "body",
        "take",
        "different",
        "form",
        "example",
        "democracy",
        "people",
        "oligarchy",
        "select",
        "wealthy",
        "well",
        "born",
        "attempting",
        "distinguish",
        "evaluate",
        "various",
        "constitution",
        "aristotle",
        "considers",
        "two",
        "question",
        "first",
        "citystate",
        "come",
        "recall",
        "thesis",
        "defended",
        "politics",
        "i",
        "human",
        "being",
        "nature",
        "political",
        "animal",
        "naturally",
        "want",
        "live",
        "together",
        "discussion",
        "topic",
        "see",
        "following",
        "supplementary",
        "document",
        "supplement",
        "political",
        "naturalism",
        "aristotle",
        "add",
        "common",
        "advantage",
        "also",
        "brings",
        "together",
        "insofar",
        "attain",
        "noble",
        "life",
        "end",
        "common",
        "separately",
        "iiib",
        "second",
        "different",
        "form",
        "rule",
        "one",
        "individual",
        "group",
        "rule",
        "another",
        "aristotle",
        "distinguishes",
        "several",
        "type",
        "rule",
        "based",
        "nature",
        "soul",
        "ruler",
        "subject",
        "first",
        "considers",
        "despotic",
        "rule",
        "exemplified",
        "masterslave",
        "relationship",
        "aristotle",
        "think",
        "form",
        "rule",
        "justified",
        "case",
        "natural",
        "slave",
        "asserts",
        "without",
        "evidence",
        "lack",
        "deliberative",
        "faculty",
        "thus",
        "need",
        "natural",
        "master",
        "direct",
        "ia",
        "slavery",
        "defended",
        "length",
        "politics",
        "i",
        "although",
        "natural",
        "slave",
        "allegedly",
        "benefit",
        "master",
        "despotic",
        "rule",
        "still",
        "primarily",
        "sake",
        "master",
        "incidentally",
        "slave",
        "iiib",
        "aristotle",
        "provides",
        "argument",
        "person",
        "congenitally",
        "incapable",
        "governing",
        "ruled",
        "primarily",
        "sake",
        "next",
        "considers",
        "paternal",
        "marital",
        "rule",
        "also",
        "view",
        "defensible",
        "male",
        "nature",
        "capable",
        "leadership",
        "female",
        "unless",
        "constituted",
        "way",
        "contrary",
        "nature",
        "elder",
        "perfect",
        "nature",
        "capable",
        "leadership",
        "younger",
        "imperfect",
        "iab",
        "aristotle",
        "persuasive",
        "argues",
        "child",
        "need",
        "adult",
        "supervision",
        "rationality",
        "imperfect",
        "ateles",
        "immature",
        "unconvincing",
        "modern",
        "reader",
        "alleges",
        "without",
        "substantiation",
        "although",
        "woman",
        "deliberative",
        "faculty",
        "without",
        "authority",
        "akuron",
        "female",
        "require",
        "male",
        "supervision",
        "ia",
        "aristotle",
        "argument",
        "slave",
        "woman",
        "appear",
        "weak",
        "commentator",
        "take",
        "ironic",
        "however",
        "obvious",
        "modern",
        "reader",
        "need",
        "ancient",
        "greek",
        "necessary",
        "suppose",
        "aristotle",
        "discussion",
        "disingenuous",
        "noteworthy",
        "however",
        "paternal",
        "marital",
        "rule",
        "properly",
        "practiced",
        "sake",
        "ruled",
        "sake",
        "child",
        "wife",
        "respectively",
        "art",
        "like",
        "medicine",
        "gymnastics",
        "practiced",
        "sake",
        "patient",
        "iiiba",
        "respect",
        "resemble",
        "political",
        "rule",
        "form",
        "rule",
        "appropriate",
        "ruler",
        "subject",
        "equal",
        "similar",
        "rational",
        "capacity",
        "exemplified",
        "naturally",
        "equal",
        "citizen",
        "take",
        "turn",
        "ruling",
        "one",
        "another",
        "advantage",
        "a",
        "set",
        "stage",
        "fundamental",
        "claim",
        "aristotle",
        "constitutional",
        "theory",
        "constitution",
        "aim",
        "common",
        "advantage",
        "correct",
        "without",
        "qualification",
        "whereas",
        "aim",
        "advantage",
        "ruler",
        "deviant",
        "unjust",
        "involve",
        "despotic",
        "rule",
        "inappropriate",
        "community",
        "free",
        "person",
        "a",
        "distinction",
        "correct",
        "deviant",
        "constitution",
        "combined",
        "observation",
        "government",
        "may",
        "consist",
        "one",
        "person",
        "multitude",
        "hence",
        "six",
        "possible",
        "constitutional",
        "form",
        "politics",
        "iii",
        "correct",
        "deviant",
        "one",
        "ruler",
        "kingship",
        "tyranny",
        "ruler",
        "aristocracy",
        "oligarchy",
        "many",
        "ruler",
        "polity",
        "democracy",
        "sixfold",
        "classification",
        "doubtless",
        "adapted",
        "plato",
        "statesman",
        "cd",
        "set",
        "stage",
        "aristotle",
        "inquiry",
        "best",
        "constitution",
        "although",
        "modified",
        "various",
        "way",
        "throughout",
        "politics",
        "example",
        "observes",
        "dominant",
        "class",
        "oligarchy",
        "literally",
        "rule",
        "oligoi",
        "ie",
        "typically",
        "wealthy",
        "whereas",
        "democracy",
        "literally",
        "rule",
        "dêmos",
        "ie",
        "people",
        "poor",
        "economic",
        "class",
        "included",
        "definition",
        "form",
        "see",
        "politics",
        "iii",
        "iv",
        "vi",
        "alternative",
        "account",
        "also",
        "polity",
        "later",
        "characterized",
        "kind",
        "mixed",
        "constitution",
        "typified",
        "rule",
        "middle",
        "group",
        "citizen",
        "moderately",
        "wealthy",
        "class",
        "rich",
        "poor",
        "politics",
        "iv",
        "aristotle",
        "constitutional",
        "theory",
        "based",
        "theory",
        "justice",
        "expounded",
        "nicomachean",
        "ethic",
        "book",
        "v",
        "aristotle",
        "distinguishes",
        "two",
        "different",
        "related",
        "sens",
        "justice",
        "universal",
        "particular",
        "play",
        "important",
        "role",
        "constitutional",
        "theory",
        "firstly",
        "universal",
        "sense",
        "justice",
        "mean",
        "lawfulness",
        "concerned",
        "common",
        "advantage",
        "happiness",
        "political",
        "community",
        "ne",
        "vb",
        "cf",
        "pol",
        "iiib",
        "conception",
        "universal",
        "justice",
        "undergirds",
        "distinction",
        "correct",
        "deviant",
        "unjust",
        "constitution",
        "exactly",
        "common",
        "advantage",
        "koinê",
        "sumpheron",
        "entail",
        "matter",
        "scholarly",
        "controversy",
        "passage",
        "imply",
        "justice",
        "involves",
        "advantage",
        "citizen",
        "example",
        "every",
        "citizen",
        "best",
        "constitution",
        "claim",
        "private",
        "property",
        "education",
        "pol",
        "viia",
        "a",
        "aristotle",
        "also",
        "allows",
        "might",
        "way",
        "ostracize",
        "powerful",
        "citizen",
        "even",
        "convicted",
        "crime",
        "iiib",
        "whether",
        "aristotle",
        "understands",
        "common",
        "advantage",
        "safeguarding",
        "interest",
        "every",
        "citizen",
        "bearing",
        "whether",
        "extent",
        "anticipates",
        "modern",
        "would",
        "understand",
        "theory",
        "individual",
        "right",
        "see",
        "fred",
        "miller",
        "richard",
        "kraut",
        "differing",
        "interpretation",
        "secondly",
        "particular",
        "sense",
        "justice",
        "mean",
        "equality",
        "fairness",
        "includes",
        "distributive",
        "justice",
        "according",
        "different",
        "individual",
        "claim",
        "share",
        "common",
        "asset",
        "property",
        "aristotle",
        "analyzes",
        "argument",
        "different",
        "constitution",
        "different",
        "application",
        "principle",
        "distributive",
        "justice",
        "iiia",
        "everyone",
        "agrees",
        "say",
        "justice",
        "involves",
        "treating",
        "equal",
        "person",
        "equally",
        "treating",
        "unequal",
        "person",
        "unequally",
        "agree",
        "standard",
        "individual",
        "deemed",
        "equally",
        "unequally",
        "meritorious",
        "deserving",
        "assumes",
        "analysis",
        "distributive",
        "justice",
        "set",
        "forth",
        "nicomachean",
        "ethic",
        "v",
        "justice",
        "requires",
        "benefit",
        "distributed",
        "individual",
        "proportion",
        "merit",
        "desert",
        "oligarch",
        "mistakenly",
        "think",
        "superior",
        "wealth",
        "also",
        "superior",
        "political",
        "right",
        "whereas",
        "democrat",
        "hold",
        "equal",
        "free",
        "birth",
        "also",
        "equal",
        "political",
        "right",
        "conception",
        "political",
        "justice",
        "mistaken",
        "aristotle",
        "view",
        "assume",
        "false",
        "conception",
        "ultimate",
        "end",
        "citystate",
        "citystate",
        "neither",
        "business",
        "enterprise",
        "maximize",
        "wealth",
        "oligarch",
        "suppose",
        "association",
        "promote",
        "liberty",
        "equality",
        "democrat",
        "maintain",
        "instead",
        "aristotle",
        "argues",
        "good",
        "life",
        "end",
        "citystate",
        "life",
        "consisting",
        "noble",
        "action",
        "ba",
        "hence",
        "correct",
        "conception",
        "justice",
        "aristocratic",
        "assigning",
        "political",
        "right",
        "make",
        "full",
        "contribution",
        "political",
        "community",
        "virtue",
        "well",
        "property",
        "freedom",
        "a",
        "aristotle",
        "understands",
        "aristocratic",
        "constitution",
        "literally",
        "rule",
        "aristoi",
        "ie",
        "best",
        "person",
        "aristotle",
        "explores",
        "implication",
        "argument",
        "remainder",
        "politics",
        "iii",
        "considering",
        "rival",
        "claim",
        "rule",
        "law",
        "rule",
        "supremely",
        "virtuous",
        "individual",
        "absolute",
        "kingship",
        "limiting",
        "case",
        "aristocracy",
        "book",
        "viiviii",
        "aristotle",
        "describes",
        "ideal",
        "constitution",
        "citizen",
        "fully",
        "virtuous",
        "although",
        "justice",
        "aristotle",
        "view",
        "foremost",
        "political",
        "virtue",
        "pol",
        "iiia",
        "great",
        "social",
        "virtue",
        "friendship",
        "overlooked",
        "two",
        "virtue",
        "work",
        "hand",
        "hand",
        "secure",
        "every",
        "sort",
        "association",
        "en",
        "viiib",
        "justice",
        "enables",
        "citizen",
        "citystate",
        "share",
        "peacefully",
        "benefit",
        "burden",
        "cooperation",
        "friendship",
        "hold",
        "together",
        "prevents",
        "breaking",
        "warring",
        "faction",
        "cf",
        "pol",
        "iib",
        "friend",
        "expected",
        "treat",
        "justly",
        "friendship",
        "go",
        "beyond",
        "justice",
        "complex",
        "mutual",
        "bond",
        "individual",
        "choose",
        "good",
        "others",
        "trust",
        "others",
        "choosing",
        "good",
        "cf",
        "ee",
        "viia",
        "b",
        "en",
        "viiiba",
        "choosing",
        "good",
        "one",
        "another",
        "essential",
        "friendship",
        "three",
        "different",
        "way",
        "something",
        "called",
        "good",
        "human",
        "beingvirtuous",
        "ie",
        "good",
        "without",
        "qualification",
        "useful",
        "pleasantthere",
        "three",
        "type",
        "friendship",
        "hedonistic",
        "utilitarian",
        "virtuous",
        "political",
        "civic",
        "friendship",
        "specie",
        "utilitarian",
        "friendship",
        "important",
        "form",
        "utilitarian",
        "friendship",
        "polis",
        "greatest",
        "community",
        "opposed",
        "political",
        "friendship",
        "enmity",
        "lead",
        "faction",
        "civil",
        "war",
        "stasis",
        "even",
        "political",
        "revolution",
        "breakup",
        "polis",
        "discussed",
        "book",
        "v",
        "politics",
        "aristotle",
        "offer",
        "general",
        "account",
        "political",
        "civic",
        "friendship",
        "part",
        "general",
        "theory",
        "friendship",
        "ee",
        "vii",
        "en",
        "viii"
    ]
}