{
    "main_text": "Intellectual Virtues\n6. Intellectual Virtues\n\nSince Aristotle often calls attention to the imprecision of ethical\ntheory (see e.g. 1104a1–7), it comes as a surprise to many\nreaders of the Ethics that he begins Book VI with the\nadmission that his earlier statements about the mean need\nsupplementation because they are not yet clear (saphes). In\nevery practical discipline, the expert aims at a mark and uses right\nreason to avoid the twin extremes of excess and deficiency. But what\nis this right reason, and by what standard (horos) is it to\nbe determined? Aristotle says that unless we answer that question, we\nwill be none the wiser—just as a student of medicine will have\nfailed to master his subject if he can only say that the right\nmedicines to administer are the ones that are prescribed by medical\nexpertise, but has no standard other than this (1138b18–34).\n\nIt is not easy to understand the point Aristotle is making here. Has\nhe not already told us that there can be no complete theoretical guide\nto ethics, that the best one can hope for is that in particular\nsituations one’s ethical habits and practical wisdom will help\none determine what to do? Furthermore, Aristotle nowhere announces, in\nthe remainder of Book VI, that we have achieved the greater degree of\naccuracy that he seems to be looking for. The rest of this Book is a\ndiscussion of the various kinds of intellectual virtues: theoretical\nwisdom, science (epistêmê), intuitive\nunderstanding (nous), practical wisdom, and craft expertise.\nAristotle explains what each of these states of mind is, draws various\ncontrasts among them, and takes up various questions that can be\nraised about their usefulness. At no point does he explicitly return\nto the question he raised at the beginning of Book VI; he never says,\n“and now we have the standard of right reason that we were\nlooking for”. Nor is it easy to see how his discussion of these\nfive intellectual virtues can bring greater precision to the doctrine\nof the mean.\n\nWe can make some progress towards solving this problem if we remind\nourselves that at the beginning of the Ethics, Aristotle\ndescribes his inquiry as an attempt to develop a better understanding\nof what our ultimate aim should be. The sketchy answer he gives in\nBook I is that happiness consists in virtuous activity. In Books II\nthrough V, he describes the virtues of the part of the soul that is\nrational in that it can be attentive to reason, even though it is not\ncapable of deliberating. But precisely because these virtues are\nrational only in this derivative way, they are a less important\ncomponent of our ultimate end than is the intellectual\nvirtue—practical wisdom—with which they are integrated. If\nwhat we know about virtue is only what is said in Books II through V,\nthen our grasp of our ultimate end is radically incomplete, because we\nstill have not studied the intellectual virtue that enables us to\nreason well in any given situation. One of the things, at least,\ntowards which Aristotle is gesturing, as he begins Book VI, is\npractical wisdom. This state of mind has not yet been analyzed, and\nthat is one reason why he complains that his account of our ultimate\nend is not yet clear enough.\n\nBut is practical wisdom the only ingredient of our ultimate end that\nhas not yet been sufficiently discussed? Book VI discusses five\nintellectual virtues, not just practical wisdom, but it is clear that\nat least one of these—craft knowledge—is considered only\nin order to provide a contrast with the others. Aristotle is not\nrecommending that his readers make this intellectual virtue part of\ntheir ultimate aim. But what of the remaining three: science,\nintuitive understanding, and the virtue that combines them,\ntheoretical wisdom? Are these present in Book VI only in order to\nprovide a contrast with practical wisdom, or is Aristotle saying that\nthese too must be components of our goal? He does not fully address\nthis issue, but it is evident from several of his remarks in Book VI\nthat he takes theoretical wisdom to be a more valuable state of mind\nthan practical wisdom.\n\n\nIt is strange if someone thinks that politics or practical wisdom is\nthe most excellent kind of knowledge, unless man is the best thing in\nthe cosmos. (1141a20–22)\n\n\nHe says that theoretical wisdom produces happiness by being a part of\nvirtue (1144a3–6), and that practical wisdom looks to the\ndevelopment of theoretical wisdom, and issues commands for its sake\n(1145a8–11). So it is clear that exercising theoretical wisdom\nis a more important component of our ultimate goal than practical\nwisdom.\n\nEven so, it may still seem perplexing that these two intellectual\nvirtues, either separately or collectively, should somehow fill a gap\nin the doctrine of the mean. Having read Book VI and completed our\nstudy of what these two forms of wisdom are, how are we better able to\nsucceed in finding the mean in particular situations?\n\nThe answer to this question may be that Aristotle does not intend Book\nVI to provide a full answer to that question, but rather to serve as a\nprolegomenon to an answer. For it is only near the end of Book X that\nhe presents a full discussion of the relative merits of these two\nkinds of intellectual virtue, and comments on the different degrees to\nwhich each needs to be provided with resources. In X.7–8, he\nargues that the happiest kind of life is that of a\nphilosopher—someone who exercises, over a long period of time,\nthe virtue of theoretical wisdom, and has sufficient resources for\ndoing so. (We will discuss these chapters more fully in section 10\nbelow.) One of his reasons for thinking that such a life is superior\nto the second-best kind of life—that of a political leader,\nsomeone who devotes himself to the exercise of practical rather than\ntheoretical wisdom—is that it requires less external equipment\n(1178a23–b7). Aristotle has already made it clear in his\ndiscussion of the ethical virtues that someone who is greatly honored\nby his community and commands large financial resources is in a\nposition to exercise a higher order of ethical virtue than is someone\nwho receives few honors and has little property. The virtue of\nmagnificence is superior to mere liberality, and similarly greatness\nof soul is a higher excellence than the ordinary virtue that has to do\nwith honor. (These qualities are discussed in IV.1–4.) The\ngrandest expression of ethical virtue requires great political power,\nbecause it is the political leader who is in a position to do the\ngreatest amount of good for the community. The person who chooses to\nlead a political life, and who aims at the fullest expression of\npractical wisdom, has a standard for deciding what level of resources\nhe needs: he should have friends, property, and honors in sufficient\nquantities to allow his practical wisdom to express itself without\nimpediment. But if one chooses instead the life of a philosopher, then\none will look to a different standard—the fullest expression of\ntheoretical wisdom—and one will need a smaller supply of these\nresources.\n\nThis enables us to see how Aristotle’s treatment of the\nintellectual virtues does give greater content and precision to the\ndoctrine of the mean. The best standard is the one adopted by the\nphilosopher; the second-best is the one adopted by the political\nleader. In either case, it is the exercise of an intellectual virtue\nthat provides a guideline for making important quantitative decisions.\nThis supplement to the doctrine of the mean is fully compatible with\nAristotle’s thesis that no set of rules, no matter how long and\ndetailed, obviates the need for deliberative and ethical virtue. If\none chooses the life of a philosopher, one should keep the level of\none’s resources high enough to secure the leisure necessary for\nsuch a life, but not so high that one’s external equipment\nbecomes a burden and a distraction rather than an aid to living well.\nThat gives one a firmer idea of how to hit the mean, but it still\nleaves the details to be worked out. The philosopher will need to\ndetermine, in particular situations, where justice lies, how to spend\nwisely, when to meet or avoid a danger, and so on. All of the normal\ndifficulties of ethical life remain, and they can be solved only by\nmeans of a detailed understanding of the particulars of each\nsituation. Having philosophy as one’s ultimate aim does not put\nan end to the need for developing and exercising practical wisdom and\nthe ethical virtues.\n",
    "section_title": "6. Intellectual Virtues",
    "entry_title": "Aristotle’s Ethics",
    "hierarchy_title": "Aristotle’s Ethics || Intellectual Virtues",
    "tokenized_text": [
        "intellectual",
        "virtue",
        "intellectual",
        "virtue",
        "since",
        "aristotle",
        "often",
        "call",
        "attention",
        "imprecision",
        "ethical",
        "theory",
        "see",
        "eg",
        "a",
        "come",
        "surprise",
        "many",
        "reader",
        "ethic",
        "begin",
        "book",
        "vi",
        "admission",
        "earlier",
        "statement",
        "mean",
        "need",
        "supplementation",
        "yet",
        "clear",
        "saphes",
        "every",
        "practical",
        "discipline",
        "expert",
        "aim",
        "mark",
        "us",
        "right",
        "reason",
        "avoid",
        "twin",
        "extreme",
        "excess",
        "deficiency",
        "right",
        "reason",
        "standard",
        "horos",
        "determined",
        "aristotle",
        "say",
        "unless",
        "answer",
        "question",
        "none",
        "wiserjust",
        "student",
        "medicine",
        "failed",
        "master",
        "subject",
        "say",
        "right",
        "medicine",
        "administer",
        "one",
        "prescribed",
        "medical",
        "expertise",
        "standard",
        "b",
        "easy",
        "understand",
        "point",
        "aristotle",
        "making",
        "already",
        "told",
        "u",
        "complete",
        "theoretical",
        "guide",
        "ethic",
        "best",
        "one",
        "hope",
        "particular",
        "situation",
        "one",
        "ethical",
        "habit",
        "practical",
        "wisdom",
        "help",
        "one",
        "determine",
        "furthermore",
        "aristotle",
        "nowhere",
        "announces",
        "remainder",
        "book",
        "vi",
        "achieved",
        "greater",
        "degree",
        "accuracy",
        "seems",
        "looking",
        "rest",
        "book",
        "discussion",
        "various",
        "kind",
        "intellectual",
        "virtue",
        "theoretical",
        "wisdom",
        "science",
        "epistêmê",
        "intuitive",
        "understanding",
        "nous",
        "practical",
        "wisdom",
        "craft",
        "expertise",
        "aristotle",
        "explains",
        "state",
        "mind",
        "draw",
        "various",
        "contrast",
        "among",
        "take",
        "various",
        "question",
        "raised",
        "usefulness",
        "point",
        "explicitly",
        "return",
        "question",
        "raised",
        "beginning",
        "book",
        "vi",
        "never",
        "say",
        "standard",
        "right",
        "reason",
        "looking",
        "easy",
        "see",
        "discussion",
        "five",
        "intellectual",
        "virtue",
        "bring",
        "greater",
        "precision",
        "doctrine",
        "mean",
        "make",
        "progress",
        "towards",
        "solving",
        "problem",
        "remind",
        "beginning",
        "ethic",
        "aristotle",
        "describes",
        "inquiry",
        "attempt",
        "develop",
        "better",
        "understanding",
        "ultimate",
        "aim",
        "sketchy",
        "answer",
        "give",
        "book",
        "happiness",
        "consists",
        "virtuous",
        "activity",
        "book",
        "ii",
        "v",
        "describes",
        "virtue",
        "part",
        "soul",
        "rational",
        "attentive",
        "reason",
        "even",
        "though",
        "capable",
        "deliberating",
        "precisely",
        "virtue",
        "rational",
        "derivative",
        "way",
        "le",
        "important",
        "component",
        "ultimate",
        "end",
        "intellectual",
        "virtuepractical",
        "wisdomwith",
        "integrated",
        "know",
        "virtue",
        "said",
        "book",
        "ii",
        "v",
        "grasp",
        "ultimate",
        "end",
        "radically",
        "incomplete",
        "still",
        "studied",
        "intellectual",
        "virtue",
        "enables",
        "u",
        "reason",
        "well",
        "given",
        "situation",
        "one",
        "thing",
        "least",
        "towards",
        "aristotle",
        "gesturing",
        "begin",
        "book",
        "vi",
        "practical",
        "wisdom",
        "state",
        "mind",
        "yet",
        "analyzed",
        "one",
        "reason",
        "complains",
        "account",
        "ultimate",
        "end",
        "yet",
        "clear",
        "enough",
        "practical",
        "wisdom",
        "ingredient",
        "ultimate",
        "end",
        "yet",
        "sufficiently",
        "discussed",
        "book",
        "vi",
        "discus",
        "five",
        "intellectual",
        "virtue",
        "practical",
        "wisdom",
        "clear",
        "least",
        "one",
        "thesecraft",
        "knowledgeis",
        "considered",
        "order",
        "provide",
        "contrast",
        "others",
        "aristotle",
        "recommending",
        "reader",
        "make",
        "intellectual",
        "virtue",
        "part",
        "ultimate",
        "aim",
        "remaining",
        "three",
        "science",
        "intuitive",
        "understanding",
        "virtue",
        "combine",
        "theoretical",
        "wisdom",
        "present",
        "book",
        "vi",
        "order",
        "provide",
        "contrast",
        "practical",
        "wisdom",
        "aristotle",
        "saying",
        "must",
        "component",
        "goal",
        "fully",
        "address",
        "issue",
        "evident",
        "several",
        "remark",
        "book",
        "vi",
        "take",
        "theoretical",
        "wisdom",
        "valuable",
        "state",
        "mind",
        "practical",
        "wisdom",
        "strange",
        "someone",
        "think",
        "politics",
        "practical",
        "wisdom",
        "excellent",
        "kind",
        "knowledge",
        "unless",
        "man",
        "best",
        "thing",
        "cosmos",
        "a",
        "say",
        "theoretical",
        "wisdom",
        "produce",
        "happiness",
        "part",
        "virtue",
        "a",
        "practical",
        "wisdom",
        "look",
        "development",
        "theoretical",
        "wisdom",
        "issue",
        "command",
        "sake",
        "a",
        "clear",
        "exercising",
        "theoretical",
        "wisdom",
        "important",
        "component",
        "ultimate",
        "goal",
        "practical",
        "wisdom",
        "even",
        "may",
        "still",
        "seem",
        "perplexing",
        "two",
        "intellectual",
        "virtue",
        "either",
        "separately",
        "collectively",
        "somehow",
        "fill",
        "gap",
        "doctrine",
        "mean",
        "read",
        "book",
        "vi",
        "completed",
        "study",
        "two",
        "form",
        "wisdom",
        "better",
        "able",
        "succeed",
        "finding",
        "mean",
        "particular",
        "situation",
        "answer",
        "question",
        "may",
        "aristotle",
        "intend",
        "book",
        "vi",
        "provide",
        "full",
        "answer",
        "question",
        "rather",
        "serve",
        "prolegomenon",
        "answer",
        "near",
        "end",
        "book",
        "x",
        "present",
        "full",
        "discussion",
        "relative",
        "merit",
        "two",
        "kind",
        "intellectual",
        "virtue",
        "comment",
        "different",
        "degree",
        "need",
        "provided",
        "resource",
        "x",
        "argues",
        "happiest",
        "kind",
        "life",
        "philosophersomeone",
        "exercise",
        "long",
        "period",
        "time",
        "virtue",
        "theoretical",
        "wisdom",
        "sufficient",
        "resource",
        "discus",
        "chapter",
        "fully",
        "section",
        "one",
        "reason",
        "thinking",
        "life",
        "superior",
        "secondbest",
        "kind",
        "lifethat",
        "political",
        "leader",
        "someone",
        "devotes",
        "exercise",
        "practical",
        "rather",
        "theoretical",
        "wisdomis",
        "requires",
        "le",
        "external",
        "equipment",
        "ab",
        "aristotle",
        "already",
        "made",
        "clear",
        "discussion",
        "ethical",
        "virtue",
        "someone",
        "greatly",
        "honored",
        "community",
        "command",
        "large",
        "financial",
        "resource",
        "position",
        "exercise",
        "higher",
        "order",
        "ethical",
        "virtue",
        "someone",
        "receives",
        "honor",
        "little",
        "property",
        "virtue",
        "magnificence",
        "superior",
        "mere",
        "liberality",
        "similarly",
        "greatness",
        "soul",
        "higher",
        "excellence",
        "ordinary",
        "virtue",
        "honor",
        "quality",
        "discussed",
        "iv",
        "grandest",
        "expression",
        "ethical",
        "virtue",
        "requires",
        "great",
        "political",
        "power",
        "political",
        "leader",
        "position",
        "greatest",
        "amount",
        "good",
        "community",
        "person",
        "chooses",
        "lead",
        "political",
        "life",
        "aim",
        "fullest",
        "expression",
        "practical",
        "wisdom",
        "standard",
        "deciding",
        "level",
        "resource",
        "need",
        "friend",
        "property",
        "honor",
        "sufficient",
        "quantity",
        "allow",
        "practical",
        "wisdom",
        "express",
        "without",
        "impediment",
        "one",
        "chooses",
        "instead",
        "life",
        "philosopher",
        "one",
        "look",
        "different",
        "standardthe",
        "fullest",
        "expression",
        "theoretical",
        "wisdomand",
        "one",
        "need",
        "smaller",
        "supply",
        "resource",
        "enables",
        "u",
        "see",
        "aristotle",
        "treatment",
        "intellectual",
        "virtue",
        "give",
        "greater",
        "content",
        "precision",
        "doctrine",
        "mean",
        "best",
        "standard",
        "one",
        "adopted",
        "philosopher",
        "secondbest",
        "one",
        "adopted",
        "political",
        "leader",
        "either",
        "case",
        "exercise",
        "intellectual",
        "virtue",
        "provides",
        "guideline",
        "making",
        "important",
        "quantitative",
        "decision",
        "supplement",
        "doctrine",
        "mean",
        "fully",
        "compatible",
        "aristotle",
        "thesis",
        "set",
        "rule",
        "matter",
        "long",
        "detailed",
        "obviates",
        "need",
        "deliberative",
        "ethical",
        "virtue",
        "one",
        "chooses",
        "life",
        "philosopher",
        "one",
        "keep",
        "level",
        "one",
        "resource",
        "high",
        "enough",
        "secure",
        "leisure",
        "necessary",
        "life",
        "high",
        "one",
        "external",
        "equipment",
        "becomes",
        "burden",
        "distraction",
        "rather",
        "aid",
        "living",
        "well",
        "give",
        "one",
        "firmer",
        "idea",
        "hit",
        "mean",
        "still",
        "leaf",
        "detail",
        "worked",
        "philosopher",
        "need",
        "determine",
        "particular",
        "situation",
        "justice",
        "lie",
        "spend",
        "wisely",
        "meet",
        "avoid",
        "danger",
        "normal",
        "difficulty",
        "ethical",
        "life",
        "remain",
        "solved",
        "mean",
        "detailed",
        "understanding",
        "particular",
        "situation",
        "philosophy",
        "one",
        "ultimate",
        "aim",
        "put",
        "end",
        "need",
        "developing",
        "exercising",
        "practical",
        "wisdom",
        "ethical",
        "virtue"
    ]
}