{
    "main_text": "The Pre-History of the Commentary Tradition: The Fortune of the Categories in the 1st century BCE\n2. The Pre-History of the Commentary Tradition: The Fortune of the Categories in the 1st century BCE\n\nThe critical engagement with Aristotle that began toward the end of\nthe Hellenistic age and continued throughout the centuries that\nfollowed was directed to works such as the Categories, which\nhad been largely ignored in the preceding centuries. This engagement\npresupposes the availability of Aristotle’s writings in a form\nthat suited the interests and needs of the time. Although the\ninformation in our possession is slim, it strongly suggests that an\nintense editorial activity took place in the 1st century\nBCE. Apellicon of Teos, a bibliophile rather than a philosopher, seems\nto have produced copies of Aristotle’s works in the 90s (Strabo,\nGeo. XIII I 54); Tyrannion of Amisus, a grammarian and\nenthusiast of Aristotle (philaristotelês), who had\naccess to Apellicon’s books, may have done the same in the 60s\n(but our sources do not say that he edited the works of Aristotle;\nthey only say that he “put in order the books of\nAristotle”; Strabo, Geo. XIII I 54; Plutarch,\nSulla 26 468 B-C). According to the tradition, these\neditorial labors were surpassed by that of Andronicus of Rhodes, who\nis credited with the production of the first reliable edition of\nAristotle; an edition that exercised an enormous influence on the\nPost-Hellenistic return to Aristotle. More information on Andronicus\nand his putative edition of Aristotle is available in the\n\nSupplement on Andronicus of Rhodes.\n\n\nIn reality, Andronicus could not be entirely responsible for the\nrevival of interest in the philosophy of Aristotle. This revival was,\nat least in part, independent of him. Moreover, a close study of the\nfortune that the Categories enjoyed in this context suggests\nthat the return to Aristotle took different forms and involved a great\nvariety of exegetical positions not necessarily related to one\nanother. Finally, the return to Aristotle did not necessarily involve\neither the acceptance of the views stated by Aristotle or their\ncodification in the form of a commentary. In short, there was no\northodoxy in the Aristotelian tradition at this early stage\n(pace Moraux 1973, pages xii–xx, especially\nxvi–xvii).\n\nWe have the names of five ancient interpreters (palaioi\nexêgêtai) of the Categories whose activity\nis placed in the 1st century BCE: Andronicus, Boethus,\nAthenodorus, Ariston, and Eudorus (Simplicius, In Cat.\n159.32–33). It is likely that, of these five philosophers, only\nBoethus of Sidon wrote a commentary on the Categories.\nBoethus’ activity can be dated to the second half of the\n1st century BCE. Simplicius contrasts his\n“word-by-word exegesis” to that of Andronicus, who is said\n“to have paraphrased the Categories” (Simplicius,\nIn Cat. 29.28–30.5). We cannot exclude that Simplicius\nprojected his own literary conventions onto Andronicus and Boethus,\nand that by his own standards Boethus and Andronicus were\nengaged in two different exegetical exercises. On the one hand, there\nis some clear evidence that Andronicus did rephrase and clarify\nAristotle’s text in order to extract Aristotle’s\nintentions. On the other hand, there is no reason to think that\nAndronicus wrote in the style that will later be codified as\nparaphrase. Themistius was the champion of this particular form of\nexegesis in antiquity. Themistius does not give\nus names of predecessors. His silence is open to different\ninterpretations: either Themistius did not know of Andronicus’\nwork on the Categories or this work was not written in the\nstyle of a paraphrase. Fortunately, it is not essential for us to\nestablish whether or not Andronicus was the first paraphraser of\nAristotle. What matters is that his style of exegesis was perceived as\ndifferent from that of Boethus. Unlike Andronicus, Boethus was engaged\nin an in-depth examination of whole book of the Categories in\nthe form of a word-by-word commentary. Boethus was highly regarded in\nantiquity. Simplicius refers to him as “the amazing\nBoethus” (In Cat. 1.18), “the noble\nBoethus” (In Cat. 379.32), and prizes “the\nsharpness of his mind” (In Cat. 1.23 and 434.18).\nExcept for a few testimonies, his commentary has not survived. From\nthese few testimonies, however, it is clear that Boethus concerned\nhimself with the difficulties that the Stoics raised against\nAristotle’s Categories. The Stoics attacked the\nCategories on the assumption that this treatise is on\nlanguage and about linguistic expressions. They argued that as a\ntreatise on language and about linguistic expressions the\nCategories was incomplete. Boethus resisted this reading of\nthe Categories and anticipated a line of interpretation that\nwas then followed, among others, by Porphyry. \n\nBoethus’ defense of the Categories documents that this\ntreatise was intensely read and studied, and not only among\nphilosophers friendly to Aristotle. The Stoic philosopher Athenodorus\nis credited with a book (Simplicius, In Cat. 86.22) or books\n(Porphyry, In Cat. 62.25–26) significantly entitled\nAgainst Aristotle’s Categories. We know very little\nabout Athenodorus. If he is the same person as Athenodorus of\nTarsus, who was a friend and adviser of the Emperor Augustus and was\nappointed by him as governor of Taurus, then Athenodorus was active in\nthe second half of the 1st century BCE. There is no\ncompelling reason to think that his critique of the\nCategories was written in the form of a commentary.\nAthenodorus could have been content with offering a series of\nobjections and difficulties, just as the Platonist Lucius and\nNicostratus would do more than a hundred years later (Simplicius,\nIn Cat 1.18–20: “Others have chosen simply to\npresent a series of difficulties (aporiai) arising from the\ntext, which is what has been done by Lucius, and after him by\nNicostratus, who took over for himself the job of Lucius”).\n\nThe temptation to credit all ancient interpreters of the\nCategories with a commentary must be resisted also in the\ncase of Eudorus of Alexandria. It is generally assumed that Eudorus\nflourished in the middle of the first century BCE. Simplicius is not\ncontent to enumerate Eudorus among the ancient interpreters of the\nCategories. He preserves nine testimonies in which Eudorus\ntook issue with Aristotle. But no inference about the form of his\nliterary production is possible. The only safe inference is that the\nstudy of the Categories was not confined to the school of\nAristotle. In fact, Eudorus was not a Peripatetic philosopher.\nSimplicius refers to him as the “Academic Eudorus” (In\nCat. 187.10).\n\nThe last name on list of ancient interpreters of the\nCategories is that of Ariston of Alexandria. From Cicero\n(Lucullus §§ 11–12), we learn that Ariston\nwas among the learned men who attended the conversations that took\nplace in Alexandria in 87 BCE between Heraclitus of Tyrus, a former\nstudent of Clitomachus and Philo of Larissa, and Antiochus of Ascalon.\nCicero depicts Ariston as a pupil of Antiochus. That Ariston was a\npupil of Antiochus is confirmed by the Index Academicorum, a\nhistory of the Academy written by Philodemus in the 1st\ncentury BCE. There, we are told that Antiochus “took over\n<the Academy>” (XXXIV 34 Dorandi). A list of his students\nis also given. The list includes the names of Aristus,\nAntiochus’ brother; Ariston and Dio of Alexandria; and Cratippus\nof Pergamum (XXXV 1–6 Dorandi). What immediately follows is\nextremely interesting: “Ariston of Alexandria and Cratippus of\nPegamum deserted the Academy and turned Peripatetic” (XXXV\n10–16 Dorandi). We are not told the reasons for their defection\nto Peripatetic philosophy. In the case of Ariston it is also difficult\nto see what this defection really involved. From the information in\nour possession we can only say that he wrote about the\nCategories. But there is no evidence that Ariston wrote in\nthe form of a commentary. His case is significantly different from\nthat of Andronicus and Boethus. Andronicus and Boethus made an attempt\nto organise, clarify, and indeed defend, the philosophy of Aristotle.\nThis does not seem to apply to Ariston. His name is never related to\nthose of Andronicus and Boethus. In addition, there is no evidence\nthat Ariston was aware of the existence of Andronicus and Boethus, or\nthat he was influenced by their works or their activity as interpreters of\nAristotle. That the edition of Andronicus played a role in the\nconversion of Ariston to the philosophy of Aristotle is merely a\nconjecture.\n\nThere is a wealth of information in the subsequent commentary\ntradition about the early (that is, 1st century BCE)\nreception of the Categories. Even the expert reader is often\nleft wondering how best to organize it. The reader of this entry will\nfind a useful presentation of the extant evidence in a recent\nmonograph produced by Michael Griffin (Griffin 2015, to be read along\nwith the critical comments offered in Falcon 2018 and Menn 2018;\nwith a response by Griffin in Griffin 2020). According to Griffin,\nAndronicus of Rhodes played a key role in the Post-Hellenistic surge\nof interest in Aristotle’Categories. Andronicus placed\nthe Categories at the outset of his catalogue\n(pinakes) of Aristotle’s writings. He saw in this\ntreatise a useful introduction to Aristotle’s theory of\npredication, aimed at (absolute) beginners in Aristotelian logic. In\nthe end, what Andronicus thought of the Categories did not\nmatter; what mattered was the place that he assigned to this work in\nhis pinakes. The prominence assigned to the work in his\npinakes contributed to attract attention to an hitherto\nobscure work.\n\nWhat do we learn from the rich and complex story of the early\nreception of Aristotle’s Categories? We learn that the\nreturn to Aristotle attracted thinkers with a diverse philosophical\nbackground and a different philosophical agenda. We also learn that\ntheir critical engagement with Aristotle resulted in a few creative\nreadings of the Categories. To the extent that those readings\ncan be reconstructed, they do not take us any closer to\nAristotle’s original intentions. More directly, and more boldly:\nthere existed, and still exists, a gap between\nAristotle’Categories and all his interpreters. This gap\nopened up early on in the Hellenistic times. As a result, all his\nsubsequent (that is, Post-Hellenistic) interpreters struggled to close\nthis gap. Early interpreters of the Categories such as\nAndronicus of Rhodes and Boethus of Sidon are no exception to the rule.\nTheir efforts, just like ours, had a mixed success at best. In the\nend, Aristotle’Categories was then, and still remains\nnow, an elusive work.\n",
    "section_title": "2. The Pre-History of the Commentary Tradition: The Fortune of the Categories in the 1st century BCE",
    "entry_title": "Commentators on Aristotle",
    "hierarchy_title": "Commentators on Aristotle || The Pre-History of the Commentary Tradition: The Fortune of the Categories in the 1st century BCE",
    "tokenized_text": [
        "prehistory",
        "commentary",
        "tradition",
        "fortune",
        "category",
        "st",
        "century",
        "bce",
        "prehistory",
        "commentary",
        "tradition",
        "fortune",
        "category",
        "st",
        "century",
        "bce",
        "critical",
        "engagement",
        "aristotle",
        "began",
        "toward",
        "end",
        "hellenistic",
        "age",
        "continued",
        "throughout",
        "century",
        "followed",
        "directed",
        "work",
        "category",
        "largely",
        "ignored",
        "preceding",
        "century",
        "engagement",
        "presupposes",
        "availability",
        "aristotle",
        "writing",
        "form",
        "suited",
        "interest",
        "need",
        "time",
        "although",
        "information",
        "possession",
        "slim",
        "strongly",
        "suggests",
        "intense",
        "editorial",
        "activity",
        "took",
        "place",
        "st",
        "century",
        "bce",
        "apellicon",
        "teos",
        "bibliophile",
        "rather",
        "philosopher",
        "seems",
        "produced",
        "copy",
        "aristotle",
        "work",
        "strabo",
        "geo",
        "xiii",
        "tyrannion",
        "amisus",
        "grammarian",
        "enthusiast",
        "aristotle",
        "philaristotelês",
        "access",
        "apellicon",
        "book",
        "may",
        "done",
        "source",
        "say",
        "edited",
        "work",
        "aristotle",
        "say",
        "put",
        "order",
        "book",
        "aristotle",
        "strabo",
        "geo",
        "xiii",
        "plutarch",
        "sulla",
        "bc",
        "according",
        "tradition",
        "editorial",
        "labor",
        "surpassed",
        "andronicus",
        "rhodes",
        "credited",
        "production",
        "first",
        "reliable",
        "edition",
        "aristotle",
        "edition",
        "exercised",
        "enormous",
        "influence",
        "posthellenistic",
        "return",
        "aristotle",
        "information",
        "andronicus",
        "putative",
        "edition",
        "aristotle",
        "available",
        "supplement",
        "andronicus",
        "rhodes",
        "reality",
        "andronicus",
        "could",
        "entirely",
        "responsible",
        "revival",
        "interest",
        "philosophy",
        "aristotle",
        "revival",
        "least",
        "part",
        "independent",
        "moreover",
        "close",
        "study",
        "fortune",
        "category",
        "enjoyed",
        "context",
        "suggests",
        "return",
        "aristotle",
        "took",
        "different",
        "form",
        "involved",
        "great",
        "variety",
        "exegetical",
        "position",
        "necessarily",
        "related",
        "one",
        "another",
        "finally",
        "return",
        "aristotle",
        "necessarily",
        "involve",
        "either",
        "acceptance",
        "view",
        "stated",
        "aristotle",
        "codification",
        "form",
        "commentary",
        "short",
        "orthodoxy",
        "aristotelian",
        "tradition",
        "early",
        "stage",
        "pace",
        "moraux",
        "page",
        "xiixx",
        "especially",
        "xvixvii",
        "name",
        "five",
        "ancient",
        "interpreter",
        "palaioi",
        "exêgêtai",
        "category",
        "whose",
        "activity",
        "placed",
        "st",
        "century",
        "bce",
        "andronicus",
        "boethus",
        "athenodorus",
        "ariston",
        "eudorus",
        "simplicius",
        "cat",
        "likely",
        "five",
        "philosopher",
        "boethus",
        "sidon",
        "wrote",
        "commentary",
        "category",
        "boethus",
        "activity",
        "dated",
        "second",
        "half",
        "st",
        "century",
        "bce",
        "simplicius",
        "contrast",
        "wordbyword",
        "exegesis",
        "andronicus",
        "said",
        "paraphrased",
        "category",
        "simplicius",
        "cat",
        "exclude",
        "simplicius",
        "projected",
        "literary",
        "convention",
        "onto",
        "andronicus",
        "boethus",
        "standard",
        "boethus",
        "andronicus",
        "engaged",
        "two",
        "different",
        "exegetical",
        "exercise",
        "one",
        "hand",
        "clear",
        "evidence",
        "andronicus",
        "rephrase",
        "clarify",
        "aristotle",
        "text",
        "order",
        "extract",
        "aristotle",
        "intention",
        "hand",
        "reason",
        "think",
        "andronicus",
        "wrote",
        "style",
        "later",
        "codified",
        "paraphrase",
        "themistius",
        "champion",
        "particular",
        "form",
        "exegesis",
        "antiquity",
        "themistius",
        "give",
        "u",
        "name",
        "predecessor",
        "silence",
        "open",
        "different",
        "interpretation",
        "either",
        "themistius",
        "know",
        "andronicus",
        "work",
        "category",
        "work",
        "written",
        "style",
        "paraphrase",
        "fortunately",
        "essential",
        "u",
        "establish",
        "whether",
        "andronicus",
        "first",
        "paraphraser",
        "aristotle",
        "matter",
        "style",
        "exegesis",
        "perceived",
        "different",
        "boethus",
        "unlike",
        "andronicus",
        "boethus",
        "engaged",
        "indepth",
        "examination",
        "whole",
        "book",
        "category",
        "form",
        "wordbyword",
        "commentary",
        "boethus",
        "highly",
        "regarded",
        "antiquity",
        "simplicius",
        "refers",
        "amazing",
        "boethus",
        "cat",
        "noble",
        "boethus",
        "cat",
        "prize",
        "sharpness",
        "mind",
        "cat",
        "except",
        "testimony",
        "commentary",
        "survived",
        "testimony",
        "however",
        "clear",
        "boethus",
        "concerned",
        "difficulty",
        "stoic",
        "raised",
        "aristotle",
        "category",
        "stoic",
        "attacked",
        "category",
        "assumption",
        "treatise",
        "language",
        "linguistic",
        "expression",
        "argued",
        "treatise",
        "language",
        "linguistic",
        "expression",
        "category",
        "incomplete",
        "boethus",
        "resisted",
        "reading",
        "category",
        "anticipated",
        "line",
        "interpretation",
        "followed",
        "among",
        "others",
        "porphyry",
        "boethus",
        "defense",
        "category",
        "document",
        "treatise",
        "intensely",
        "read",
        "studied",
        "among",
        "philosopher",
        "friendly",
        "aristotle",
        "stoic",
        "philosopher",
        "athenodorus",
        "credited",
        "book",
        "simplicius",
        "cat",
        "book",
        "porphyry",
        "cat",
        "significantly",
        "entitled",
        "aristotle",
        "category",
        "know",
        "little",
        "athenodorus",
        "person",
        "athenodorus",
        "tarsus",
        "friend",
        "adviser",
        "emperor",
        "augustus",
        "appointed",
        "governor",
        "taurus",
        "athenodorus",
        "active",
        "second",
        "half",
        "st",
        "century",
        "bce",
        "compelling",
        "reason",
        "think",
        "critique",
        "category",
        "written",
        "form",
        "commentary",
        "athenodorus",
        "could",
        "content",
        "offering",
        "series",
        "objection",
        "difficulty",
        "platonist",
        "lucius",
        "nicostratus",
        "would",
        "hundred",
        "year",
        "later",
        "simplicius",
        "cat",
        "others",
        "chosen",
        "simply",
        "present",
        "series",
        "difficulty",
        "aporiai",
        "arising",
        "text",
        "done",
        "lucius",
        "nicostratus",
        "took",
        "job",
        "lucius",
        "temptation",
        "credit",
        "ancient",
        "interpreter",
        "category",
        "commentary",
        "must",
        "resisted",
        "also",
        "case",
        "eudorus",
        "alexandria",
        "generally",
        "assumed",
        "eudorus",
        "flourished",
        "middle",
        "first",
        "century",
        "bce",
        "simplicius",
        "content",
        "enumerate",
        "eudorus",
        "among",
        "ancient",
        "interpreter",
        "category",
        "preserve",
        "nine",
        "testimony",
        "eudorus",
        "took",
        "issue",
        "aristotle",
        "inference",
        "form",
        "literary",
        "production",
        "possible",
        "safe",
        "inference",
        "study",
        "category",
        "confined",
        "school",
        "aristotle",
        "fact",
        "eudorus",
        "peripatetic",
        "philosopher",
        "simplicius",
        "refers",
        "academic",
        "eudorus",
        "cat",
        "last",
        "name",
        "list",
        "ancient",
        "interpreter",
        "category",
        "ariston",
        "alexandria",
        "cicero",
        "lucullus",
        "learn",
        "ariston",
        "among",
        "learned",
        "men",
        "attended",
        "conversation",
        "took",
        "place",
        "alexandria",
        "bce",
        "heraclitus",
        "tyrus",
        "former",
        "student",
        "clitomachus",
        "philo",
        "larissa",
        "antiochus",
        "ascalon",
        "cicero",
        "depicts",
        "ariston",
        "pupil",
        "antiochus",
        "ariston",
        "pupil",
        "antiochus",
        "confirmed",
        "index",
        "academicorum",
        "history",
        "academy",
        "written",
        "philodemus",
        "st",
        "century",
        "bce",
        "told",
        "antiochus",
        "took",
        "academy",
        "xxxiv",
        "dorandi",
        "list",
        "student",
        "also",
        "given",
        "list",
        "includes",
        "name",
        "aristus",
        "antiochus",
        "brother",
        "ariston",
        "dio",
        "alexandria",
        "cratippus",
        "pergamum",
        "xxxv",
        "dorandi",
        "immediately",
        "follows",
        "extremely",
        "interesting",
        "ariston",
        "alexandria",
        "cratippus",
        "pegamum",
        "deserted",
        "academy",
        "turned",
        "peripatetic",
        "xxxv",
        "dorandi",
        "told",
        "reason",
        "defection",
        "peripatetic",
        "philosophy",
        "case",
        "ariston",
        "also",
        "difficult",
        "see",
        "defection",
        "really",
        "involved",
        "information",
        "possession",
        "say",
        "wrote",
        "category",
        "evidence",
        "ariston",
        "wrote",
        "form",
        "commentary",
        "case",
        "significantly",
        "different",
        "andronicus",
        "boethus",
        "andronicus",
        "boethus",
        "made",
        "attempt",
        "organise",
        "clarify",
        "indeed",
        "defend",
        "philosophy",
        "aristotle",
        "seem",
        "apply",
        "ariston",
        "name",
        "never",
        "related",
        "andronicus",
        "boethus",
        "addition",
        "evidence",
        "ariston",
        "aware",
        "existence",
        "andronicus",
        "boethus",
        "influenced",
        "work",
        "activity",
        "interpreter",
        "aristotle",
        "edition",
        "andronicus",
        "played",
        "role",
        "conversion",
        "ariston",
        "philosophy",
        "aristotle",
        "merely",
        "conjecture",
        "wealth",
        "information",
        "subsequent",
        "commentary",
        "tradition",
        "early",
        "st",
        "century",
        "bce",
        "reception",
        "category",
        "even",
        "expert",
        "reader",
        "often",
        "left",
        "wondering",
        "best",
        "organize",
        "reader",
        "entry",
        "find",
        "useful",
        "presentation",
        "extant",
        "evidence",
        "recent",
        "monograph",
        "produced",
        "michael",
        "griffin",
        "griffin",
        "read",
        "along",
        "critical",
        "comment",
        "offered",
        "falcon",
        "menn",
        "response",
        "griffin",
        "griffin",
        "according",
        "griffin",
        "andronicus",
        "rhodes",
        "played",
        "key",
        "role",
        "posthellenistic",
        "surge",
        "interest",
        "aristotle",
        "category",
        "andronicus",
        "placed",
        "category",
        "outset",
        "catalogue",
        "pinakes",
        "aristotle",
        "writing",
        "saw",
        "treatise",
        "useful",
        "introduction",
        "aristotle",
        "theory",
        "predication",
        "aimed",
        "absolute",
        "beginner",
        "aristotelian",
        "logic",
        "end",
        "andronicus",
        "thought",
        "category",
        "matter",
        "mattered",
        "place",
        "assigned",
        "work",
        "pinakes",
        "prominence",
        "assigned",
        "work",
        "pinakes",
        "contributed",
        "attract",
        "attention",
        "hitherto",
        "obscure",
        "work",
        "learn",
        "rich",
        "complex",
        "story",
        "early",
        "reception",
        "aristotle",
        "category",
        "learn",
        "return",
        "aristotle",
        "attracted",
        "thinker",
        "diverse",
        "philosophical",
        "background",
        "different",
        "philosophical",
        "agenda",
        "also",
        "learn",
        "critical",
        "engagement",
        "aristotle",
        "resulted",
        "creative",
        "reading",
        "category",
        "extent",
        "reading",
        "reconstructed",
        "take",
        "u",
        "closer",
        "aristotle",
        "original",
        "intention",
        "directly",
        "boldly",
        "existed",
        "still",
        "exists",
        "gap",
        "aristotle",
        "category",
        "interpreter",
        "gap",
        "opened",
        "early",
        "hellenistic",
        "time",
        "result",
        "subsequent",
        "posthellenistic",
        "interpreter",
        "struggled",
        "close",
        "gap",
        "early",
        "interpreter",
        "category",
        "andronicus",
        "rhodes",
        "boethus",
        "sidon",
        "exception",
        "rule",
        "effort",
        "like",
        "mixed",
        "success",
        "best",
        "end",
        "aristotle",
        "category",
        "still",
        "remains",
        "elusive",
        "work"
    ]
}