{
    "main_text": "\n\nThe term “aesthetics”, though deriving from the Greek\n(aisthetikos meaning “related to sense\nexperience”), is a modern one, forged by Baumgarten as the title\nof his main book (Aesthetica, 1750). Only later did it come\nto name an entire field of philosophical research. Aristotle does not\nuse that term. But after Plato, he does use the word\nmimêtikê (that is, literally, the art of\nproducing a mimesis), and since he considers mimesis\nto be the most general term (or the genus) of all instances (or\nspecies) that we consider “art”, like painting, sculpture,\nmusic, poetry, or dance, such a word would probably have been well\nsuited to such an inquiry into (what we call) “works of\nart”. But the fact is that he did not write any such book as a\n“Treatise on mimêtikê”. Instead, the\nmain treatise he wrote bears the name of Poêtikê,\nthat is, literally, “the art of composing poetry” which\nmainly focuses on tragedy in its first “book” which we can\nstill read, and on comedy, in its second, which is now\n lost.[1]\n Nowadays known as the Poetics, this treatise was never\npublished or properly edited by Aristotle himself (and may have mainly\nconsisted of “teaching notes”); like the other treatises\nthat have come down to us, it remained inside his philosophical\nschool, the Lyceum (among, that is, his so-called\n“esoteric” works). But Aristotle also published, as\n“exoteric works” (that is, writings that were circulating\noutside of the Lyceum), various books on poetry, notably a book\nentitled “On Poets”, and another “Homeric\nProblems” (both of which we can still read a few fragments of)\nand even a (now entirely lost) catalogue of the tragedies and comedies\nthat were put on stage in Athenian festivals, recording those which\nwon which prize. Thus, poetry, and especially dramatic poetry and\ntheater, rather than art in general, were apparently Aristotle’s\nchief concern.\n\nIt is probably the case that Aristotle considered tragedy and comedy\nto be paradigmatic works of art, which constituted the most attractive\nand exciting parts of the civic and religious festivals that were such\nimportant events in the lives of most Athenians and, more generally,\nof the people of Greek cities. But he also dedicated almost an entire\nbook to music (book VIII of the Politics), and it is to be\nnoted that his followers did likewise: in addition to his own books on\npoetry and comedy, Theophrastus wrote a work on music in three books\n(all lost, except for a few fragments), and Aristoxenus is the author\nof important treatises on music that we still (partly) have. On the\nother hand, before Aristotle Plato had expressed quite strong views on\nart generally speaking, and not only on poetry or music; in book X of\nthe Republic, Socrates embarks on a critical review of\nmimesis as a whole, where mimetic art quite generally is at stake.\nSince it is difficult not to take Aristotle as responding to\nPlato’s critique of the arts in one way or another, it is quite\nnatural to suppose that he also had some views on art in general, and\nnot only on poetry or music.\n\nBut perhaps the main reason why one should seriously consider\nAristotle as having general aesthetic views comes from an\nextraordinary passage which is too rarely quoted in Aristotelian\nscholarship. In one passage of the Eudemian Ethics\n(EE), Aristotle insists that the pleasurable experience\n(paschein) of contemplating a statue or listening to music\nhas nothing to do with the pleasure that is at stake in the lack of\nself-control (akrasia, or what we usually call\n“weakness of will”): \n\n\nno one would be considered to be unself-controlled for gazing at a\nbeautiful statue or a beautiful horse or human, or listening to\nsomeone singing, without any desire to eat or drink or have sex, but\njust to gaze at beautiful objects or listen to the singing—any\nmore than those who were spellbound by the Sirens would. (EE\nIII 2.1230b25–35) \n\n\nWhen people look at beautiful statues or persons, or listen to music\nwithout any other desire than the desire for such gazing or listening,\nthey enjoy all these things “for their intrinsic\nqualities” and not “for their incidental\nassociations” (or “accidentally”, kata\nsymbebêkos). Only humans can enjoy such experiences, not\nanimals; a lion can enjoy seeing a gazelle only as a potential meal\nand never for its beauty (Nicomachean Ethics (NE)\nIII 13.1118a22–23). And the same goes for the sense of smell,\nAristotle adds, quoting a witty saying by the musician Stratonicos:\nwhile a meal “smells delicious”, a flagrant flower\n“smells beautiful” (EE III\n2.1231a11–12).\n\nIt can hardly be denied that this passage points to what we nowadays\ncall an “aesthetic disinterestedness”, which implies the\nidea of a pleasurable experience that is typically human, one which\npays attention to the object itself and its intrinsic qualities. And,\none may add, it also points to the idea of judging the quality of the\nthing that is gazed at or listened to. And indeed, in another passage\nfrom the Nicomachean Ethics, Aristotle clearly implies this:\n\n\n\nA virtuous person, as a virtuous person, takes pleasure in\n[others’] actions that express moral virtues, and is upset by\nactions caused by moral vices, just as a musician enjoys beautiful\nsongs but finds bad ones painful. (NE IX 9.1170a8–11)\n\n\n\nThe virtuous person rejoices in someone else’s performing a\nmorally good act thanks to her knowledge of what virtue consists in.\nThe pleasurable experience a musician gets from music is primarily a\nsensory one linked to her faculty of hearing, to be sure, but also\nderives, as in the case of morality, from her musical knowledge. In\nother words, having experience and knowledge of music, or any kind of\nart, allows one to be a good judge of music, or any kind of art\n—that is to say what we would call a person of\n“aesthetic” taste. The goal of building and transmitting\nsuch knowledge in order to help his readers to become good judges\ncould be considered the main reason why Aristotle wrote about art.\n\nThe following presentation reviews some of the most central topics we\nfind in the works Aristotle dedicated to (what we call) art. The\nPoetics is of course our main entry into this, but his\npublished works were actually the only works that were available\noutside his school throughout antiquity; most probably,\nnon-Aristotelian philosophers from Philodemus to the late\nneo-Platonists only had access to those works, and not to the\nPoetics. In modern scholarship, those works are usually\nmarginalized if not dismissed, on the grounds that they do not seem to\nreflect any deep philosophical insight. And, indeed, they were\naddressed to a general public. But (as we shall see), nothing\nindicates that the philosophically less elaborated views of On\nPoets would have been totally different from those in the\nPoetics, and in the latter work Aristotle does not hesitate\nto refer to the former. And the same goes for the Homeric\nProblems: chapter 25 of the Poetics seems to reformulate\nin a more abstract way the principles from which Aristotle discussed\nnumerous examples of interpretive problems in that work. It is\ntherefore a plausible hypothesis that Aristotle wanted to provide a\nbroader public an echo of what he was teaching his philosophy\nstudents. Aristotle often recommends that we begin with more evident,\nconcrete views before aiming at more sophisticated, deeper insights.\nLet us follow this methodological recommendation, and begin with the\ntwo published works.\n\nCaveat lector. Before we get into the heart of our topic, a\nwarning. The Poetics is one of the works from the ancient\nworld that has elicited the most controversies, and it still does. As\neverybody knows, the word katharsis has more than any other\nmade the greatest quantity of ink flow from the Renaissance onwards\n(when the treatise was rediscovered). But it is no exaggeration to say\nthat almost every page, if not every sentence, of the Poetics\nhas been interpreted in different ways, and so have many more general\nthemes as well, such as the problem of who the treatise is addressed\nto, its general aim or, quite simply, its overall significance. The\nGreek text has not only been rather poorly transmitted (and it is\nstill subject to many philological disputes among specialists), but it\nis also extremely dense and convoluted, and many terms are actually\nrather vague or ambiguous, and therefore subject to various possible\ninterpretations (and translations). The reader of this general\npresentation should thus be warned that, like any other presentation\nof the Poetics, it is based on a (hopefully coherent) series\nof interpretive choices; some of the other main interpretive choices\nwill be briefly described, or flagged in the\n notes.[2]\n",
    "section_title": "Preamble",
    "entry_title": "Aristotle’s Aesthetics",
    "hierarchy_title": "Aristotle’s Aesthetics || Preamble",
    "tokenized_text": [
        "term",
        "aesthetic",
        "though",
        "deriving",
        "greek",
        "aisthetikos",
        "meaning",
        "related",
        "sense",
        "experience",
        "modern",
        "one",
        "forged",
        "baumgarten",
        "title",
        "main",
        "book",
        "aesthetica",
        "later",
        "come",
        "name",
        "entire",
        "field",
        "philosophical",
        "research",
        "aristotle",
        "use",
        "term",
        "plato",
        "use",
        "word",
        "mimêtikê",
        "literally",
        "art",
        "producing",
        "mimesis",
        "since",
        "considers",
        "mimesis",
        "general",
        "term",
        "genus",
        "instance",
        "specie",
        "consider",
        "art",
        "like",
        "painting",
        "sculpture",
        "music",
        "poetry",
        "dance",
        "word",
        "would",
        "probably",
        "well",
        "suited",
        "inquiry",
        "call",
        "work",
        "art",
        "fact",
        "write",
        "book",
        "treatise",
        "mimêtikê",
        "instead",
        "main",
        "treatise",
        "wrote",
        "bear",
        "name",
        "poêtikê",
        "literally",
        "art",
        "composing",
        "poetry",
        "mainly",
        "focus",
        "tragedy",
        "first",
        "book",
        "still",
        "read",
        "comedy",
        "second",
        "lost",
        "nowadays",
        "known",
        "poetics",
        "treatise",
        "never",
        "published",
        "properly",
        "edited",
        "aristotle",
        "may",
        "mainly",
        "consisted",
        "teaching",
        "note",
        "like",
        "treatise",
        "come",
        "u",
        "remained",
        "inside",
        "philosophical",
        "school",
        "lyceum",
        "among",
        "socalled",
        "esoteric",
        "work",
        "aristotle",
        "also",
        "published",
        "exoteric",
        "work",
        "writing",
        "circulating",
        "outside",
        "lyceum",
        "various",
        "book",
        "poetry",
        "notably",
        "book",
        "entitled",
        "poet",
        "another",
        "homeric",
        "problem",
        "still",
        "read",
        "fragment",
        "even",
        "entirely",
        "lost",
        "catalogue",
        "tragedy",
        "comedy",
        "put",
        "stage",
        "athenian",
        "festival",
        "recording",
        "prize",
        "thus",
        "poetry",
        "especially",
        "dramatic",
        "poetry",
        "theater",
        "rather",
        "art",
        "general",
        "apparently",
        "aristotle",
        "chief",
        "concern",
        "probably",
        "case",
        "aristotle",
        "considered",
        "tragedy",
        "comedy",
        "paradigmatic",
        "work",
        "art",
        "constituted",
        "attractive",
        "exciting",
        "part",
        "civic",
        "religious",
        "festival",
        "important",
        "event",
        "life",
        "athenian",
        "generally",
        "people",
        "greek",
        "city",
        "also",
        "dedicated",
        "almost",
        "entire",
        "book",
        "music",
        "book",
        "viii",
        "politics",
        "noted",
        "follower",
        "likewise",
        "addition",
        "book",
        "poetry",
        "comedy",
        "theophrastus",
        "wrote",
        "work",
        "music",
        "three",
        "book",
        "lost",
        "except",
        "fragment",
        "aristoxenus",
        "author",
        "important",
        "treatise",
        "music",
        "still",
        "partly",
        "hand",
        "aristotle",
        "plato",
        "expressed",
        "quite",
        "strong",
        "view",
        "art",
        "generally",
        "speaking",
        "poetry",
        "music",
        "book",
        "x",
        "republic",
        "socrates",
        "embarks",
        "critical",
        "review",
        "mimesis",
        "whole",
        "mimetic",
        "art",
        "quite",
        "generally",
        "stake",
        "since",
        "difficult",
        "take",
        "aristotle",
        "responding",
        "plato",
        "critique",
        "art",
        "one",
        "way",
        "another",
        "quite",
        "natural",
        "suppose",
        "also",
        "view",
        "art",
        "general",
        "poetry",
        "music",
        "perhaps",
        "main",
        "reason",
        "one",
        "seriously",
        "consider",
        "aristotle",
        "general",
        "aesthetic",
        "view",
        "come",
        "extraordinary",
        "passage",
        "rarely",
        "quoted",
        "aristotelian",
        "scholarship",
        "one",
        "passage",
        "eudemian",
        "ethic",
        "ee",
        "aristotle",
        "insists",
        "pleasurable",
        "experience",
        "paschein",
        "contemplating",
        "statue",
        "listening",
        "music",
        "nothing",
        "pleasure",
        "stake",
        "lack",
        "selfcontrol",
        "akrasia",
        "usually",
        "call",
        "weakness",
        "one",
        "would",
        "considered",
        "unselfcontrolled",
        "gazing",
        "beautiful",
        "statue",
        "beautiful",
        "horse",
        "human",
        "listening",
        "someone",
        "singing",
        "without",
        "desire",
        "eat",
        "drink",
        "sex",
        "gaze",
        "beautiful",
        "object",
        "listen",
        "singingany",
        "spellbound",
        "siren",
        "would",
        "ee",
        "iii",
        "b",
        "people",
        "look",
        "beautiful",
        "statue",
        "person",
        "listen",
        "music",
        "without",
        "desire",
        "desire",
        "gazing",
        "listening",
        "enjoy",
        "thing",
        "intrinsic",
        "quality",
        "incidental",
        "association",
        "accidentally",
        "kata",
        "symbebêkos",
        "human",
        "enjoy",
        "experience",
        "animal",
        "lion",
        "enjoy",
        "seeing",
        "gazelle",
        "potential",
        "meal",
        "never",
        "beauty",
        "nicomachean",
        "ethic",
        "ne",
        "iii",
        "a",
        "go",
        "sense",
        "smell",
        "aristotle",
        "add",
        "quoting",
        "witty",
        "saying",
        "musician",
        "stratonicos",
        "meal",
        "smell",
        "delicious",
        "flagrant",
        "flower",
        "smell",
        "beautiful",
        "ee",
        "iii",
        "a",
        "hardly",
        "denied",
        "passage",
        "point",
        "nowadays",
        "call",
        "aesthetic",
        "disinterestedness",
        "implies",
        "idea",
        "pleasurable",
        "experience",
        "typically",
        "human",
        "one",
        "pay",
        "attention",
        "object",
        "intrinsic",
        "quality",
        "one",
        "may",
        "add",
        "also",
        "point",
        "idea",
        "judging",
        "quality",
        "thing",
        "gazed",
        "listened",
        "indeed",
        "another",
        "passage",
        "nicomachean",
        "ethic",
        "aristotle",
        "clearly",
        "implies",
        "virtuous",
        "person",
        "virtuous",
        "person",
        "take",
        "pleasure",
        "others",
        "action",
        "express",
        "moral",
        "virtue",
        "upset",
        "action",
        "caused",
        "moral",
        "vice",
        "musician",
        "enjoys",
        "beautiful",
        "song",
        "find",
        "bad",
        "one",
        "painful",
        "ne",
        "ix",
        "a",
        "virtuous",
        "person",
        "rejoices",
        "someone",
        "else",
        "performing",
        "morally",
        "good",
        "act",
        "thanks",
        "knowledge",
        "virtue",
        "consists",
        "pleasurable",
        "experience",
        "musician",
        "get",
        "music",
        "primarily",
        "sensory",
        "one",
        "linked",
        "faculty",
        "hearing",
        "sure",
        "also",
        "derives",
        "case",
        "morality",
        "musical",
        "knowledge",
        "word",
        "experience",
        "knowledge",
        "music",
        "kind",
        "art",
        "allows",
        "one",
        "good",
        "judge",
        "music",
        "kind",
        "art",
        "that",
        "say",
        "would",
        "call",
        "person",
        "aesthetic",
        "taste",
        "goal",
        "building",
        "transmitting",
        "knowledge",
        "order",
        "help",
        "reader",
        "become",
        "good",
        "judge",
        "could",
        "considered",
        "main",
        "reason",
        "aristotle",
        "wrote",
        "art",
        "following",
        "presentation",
        "review",
        "central",
        "topic",
        "find",
        "work",
        "aristotle",
        "dedicated",
        "call",
        "art",
        "poetics",
        "course",
        "main",
        "entry",
        "published",
        "work",
        "actually",
        "work",
        "available",
        "outside",
        "school",
        "throughout",
        "antiquity",
        "probably",
        "nonaristotelian",
        "philosopher",
        "philodemus",
        "late",
        "neoplatonists",
        "access",
        "work",
        "poetics",
        "modern",
        "scholarship",
        "work",
        "usually",
        "marginalized",
        "dismissed",
        "ground",
        "seem",
        "reflect",
        "deep",
        "philosophical",
        "insight",
        "indeed",
        "addressed",
        "general",
        "public",
        "shall",
        "see",
        "nothing",
        "indicates",
        "philosophically",
        "le",
        "elaborated",
        "view",
        "poet",
        "would",
        "totally",
        "different",
        "poetics",
        "latter",
        "work",
        "aristotle",
        "hesitate",
        "refer",
        "former",
        "go",
        "homeric",
        "problem",
        "chapter",
        "poetics",
        "seems",
        "reformulate",
        "abstract",
        "way",
        "principle",
        "aristotle",
        "discussed",
        "numerous",
        "example",
        "interpretive",
        "problem",
        "work",
        "therefore",
        "plausible",
        "hypothesis",
        "aristotle",
        "wanted",
        "provide",
        "broader",
        "public",
        "echo",
        "teaching",
        "philosophy",
        "student",
        "aristotle",
        "often",
        "recommends",
        "begin",
        "evident",
        "concrete",
        "view",
        "aiming",
        "sophisticated",
        "deeper",
        "insight",
        "let",
        "u",
        "follow",
        "methodological",
        "recommendation",
        "begin",
        "two",
        "published",
        "work",
        "caveat",
        "lector",
        "get",
        "heart",
        "topic",
        "warning",
        "poetics",
        "one",
        "work",
        "ancient",
        "world",
        "elicited",
        "controversy",
        "still",
        "everybody",
        "know",
        "word",
        "katharsis",
        "made",
        "greatest",
        "quantity",
        "ink",
        "flow",
        "renaissance",
        "onwards",
        "treatise",
        "rediscovered",
        "exaggeration",
        "say",
        "almost",
        "every",
        "page",
        "every",
        "sentence",
        "poetics",
        "interpreted",
        "different",
        "way",
        "many",
        "general",
        "theme",
        "well",
        "problem",
        "treatise",
        "addressed",
        "general",
        "aim",
        "quite",
        "simply",
        "overall",
        "significance",
        "greek",
        "text",
        "rather",
        "poorly",
        "transmitted",
        "still",
        "subject",
        "many",
        "philological",
        "dispute",
        "among",
        "specialist",
        "also",
        "extremely",
        "dense",
        "convoluted",
        "many",
        "term",
        "actually",
        "rather",
        "vague",
        "ambiguous",
        "therefore",
        "subject",
        "various",
        "possible",
        "interpretation",
        "translation",
        "reader",
        "general",
        "presentation",
        "thus",
        "warned",
        "like",
        "presentation",
        "poetics",
        "based",
        "hopefully",
        "coherent",
        "series",
        "interpretive",
        "choice",
        "main",
        "interpretive",
        "choice",
        "briefly",
        "described",
        "flagged",
        "note"
    ]
}