{
    "main_text": "Pleasure\n8. Pleasure\n\nAristotle frequently emphasizes the importance of pleasure to human\nlife and therefore to his study of how we should live (see for example\n1099a7–20 and 1104b3–1105a16), but his full-scale\nexamination of the nature and value of pleasure is found in two\nplaces: VII.11–14 and X.1–5. It is odd that pleasure\nreceives two lengthy treatments; no other topic in the Ethics\nis revisited in this way. Book VII of the Nicomachean Ethics\nis identical to Book VI of the Eudemian Ethics; for unknown\nreasons, the editor of the former decided to include within it both\nthe treatment of pleasure that is unique to that work (X.1–5)\nand the study that is common to both treatises (VII.11–14). The\ntwo accounts are broadly similar. They agree about the value of\npleasure, defend a theory about its nature, and oppose competing\ntheories. Aristotle holds that a happy life must include pleasure, and\nhe therefore opposes those who argue that pleasure is by its nature\nbad. He insists that there are other pleasures besides those of the\nsenses, and that the best pleasures are the ones experienced by\nvirtuous people who have sufficient resources for excellent\nactivity.\n\nBook VII offers a brief account of what pleasure is and is not. It is\nnot a process but an unimpeded activity of a natural state\n(1153a7–17). Aristotle does not elaborate on what a natural\nstate is, but he obviously has in mind the healthy condition of the\nbody, especially its sense faculties, and the virtuous condition of\nthe soul. Little is said about what it is for an activity to be\nunimpeded, but Aristotle does remind us that virtuous activity is\nimpeded by the absence of a sufficient supply of external goods\n(1153b17–19). One might object that people who are sick or who\nhave moral deficiencies can experience pleasure, even though Aristotle\ndoes not take them to be in a natural state. He has two strategies for\nresponding. First, when a sick person experiences some degree of\npleasure as he is being restored to health, the pleasure he is feeling\nis caused by the fact that he is no longer completely ill. Some small\npart of him is in a natural state and is acting without impediment\n(1152b35–6). Second, Aristotle is willing to say that what seems\npleasant to some people may in fact not be pleasant (1152b31–2),\njust as what tastes bitter to an unhealthy palate may not be bitter.\nTo call something a pleasure is not only to report a state of mind but\nalso to endorse it to others. Aristotle’s analysis of the nature\nof pleasure is not meant to apply to every case in which something\nseems pleasant to someone, but only to activities that really are\npleasures. All of these are unimpeded activities of a natural\nstate.\n\nIt follows from this conception of pleasure that every instance of\npleasure must be good to some extent. For how could an unimpeded\nactivity of a natural state be bad or a matter of indifference? On the\nother hand, Aristotle does not mean to imply that every pleasure\nshould be chosen. He briefly mentions the point that pleasures compete\nwith each other, so that the enjoyment of one kind of activity impedes\nother activities that cannot be carried out at the same time\n(1153a20–22). His point is simply that although some pleasures\nmay be good, they are not worth choosing when they interfere with\nother activities that are far better. This point is developed more\nfully in Ethics X.5.\n\nFurthermore, Aristotle’s analysis allows him to speak of certain\npleasures as “bad without qualification”\n(1152b26–33), even though pleasure is the unimpeded activity of\na natural state. To call a pleasure “bad without\nqualification” is to insist that it should be avoided, but allow\nthat nonetheless it should be chosen in constraining circumstances.\nThe pleasure of recovering from an illness, for example, is bad\nwithout qualification—meaning that it is not one of the\npleasures one would ideally choose, if one could completely control\none’s circumstances. Although it really is a pleasure and so\nsomething can be said in its favor, it is so inferior to other goods\nthat ideally one ought to forego it. Nonetheless, it is a pleasure\nworth having—if one adds the qualification that it is only worth\nhaving in undesirable circumstances. The pleasure of recovering from\nan illness is good, because some small part of oneself is in a natural\nstate and is acting without impediment; but it can also be called bad,\nif what one means by this is that one should avoid getting into a\nsituation in which one experiences that pleasure.\n\nAristotle indicates several times in VII.11–14 that merely to\nsay that pleasure is a good does not do it enough justice; he\nalso wants to say that the highest good is a pleasure. Here he is\ninfluenced by an idea expressed in the opening line of the\nEthics: the good is that at which all things aim. In VII.13,\nhe hints at the idea that all living things imitate the contemplative\nactivity of god (1153b31–2). Plants and non-human animals seek\nto reproduce themselves because that is their way of participating in\nan unending series, and this is the closest they can come to the\nceaseless thinking of the unmoved mover. Aristotle makes this point in\nseveral of his works (see for example De Anima\n415a23–b7), and in Ethics X.7–8 he gives a full\ndefense of the idea that the happiest human life resembles the life of\na divine being. He conceives of god as a being who continually enjoys\na “single and simple pleasure” (1154b26)—the\npleasure of pure thought—whereas human beings, because of their\ncomplexity, grow weary of whatever they do. He will elaborate on these\npoints in X.8; in VII.11–14, he appeals to his conception of\ndivine activity only in order to defend the thesis that our highest\ngood consists in a certain kind of pleasure. Human happiness does not\nconsist in every kind of pleasure, but it does consist in one kind of\npleasure—the pleasure felt by a human being who engages in\ntheoretical activity and thereby imitates the pleasurable thinking of\ngod.\n\nBook X offers a much more elaborate account of what pleasure is and\nwhat it is not. It is not a process, because processes go through\ndevelopmental stages: building a temple is a process because the\ntemple is not present all at once, but only comes into being through\nstages that unfold over time. By contrast, pleasure, like seeing and\nmany other activities, is not something that comes into existence\nthrough a developmental process. If I am enjoying a conversation, for\nexample, I do not need to wait until it is finished in order to feel\npleased; I take pleasure in the activity all along the way. The\ndefining nature of pleasure is that it is an activity that accompanies\nother activities, and in some sense brings them to completion.\nPleasure occurs when something within us, having been brought into\ngood condition, is activated in relation to an external object that is\nalso in good condition. The pleasure of drawing, for example, requires\nboth the development of drawing ability and an object of attention\nthat is worth drawing.\n\nThe conception of pleasure that Aristotle develops in Book X is\nobviously closely related to the analysis he gives in Book VII. But\nthe theory proposed in the later Book brings out a point that had\nreceived too little attention earlier: pleasure is by its nature\nsomething that accompanies something else. It is not enough to say\nthat it is what happens when we are in good condition and are active\nin unimpeded circumstances; one must add to that point the further\nidea that pleasure plays a certain role in complementing something\nother than itself. Drawing well and the pleasure of drawing well\nalways occur together, and so they are easy to confuse, but\nAristotle’s analysis in Book X emphasizes the importance of\nmaking this distinction.\n\nHe says that pleasure completes the activity that it accompanies, but\nthen adds, mysteriously, that it completes the activity in the manner\nof an end that is added on. In the translation of W.D. Ross, it\n“supervenes as the bloom of youth does on those in the flower of\ntheir age” (1174b33). It is unclear what thought is being\nexpressed here, but perhaps Aristotle is merely trying to avoid a\npossible misunderstanding: when he says that pleasure completes an\nactivity, he does not mean that the activity it accompanies is in some\nway defective, and that the pleasure improves the activity by removing\nthis defect. Aristotle’s language is open to that\nmisinterpretation because the verb that is translated\n“complete” (teleein) can also mean\n“perfect”. The latter might be taken to mean that the\nactivity accompanied by pleasure has not yet reached a sufficiently\nhigh level of excellence, and that the role of pleasure is to bring it\nto the point of perfection. Aristotle does not deny that when we take\npleasure in an activity we get better at it, but when he says that\npleasure completes an activity by supervening on it, like the bloom\nthat accompanies those who have achieved the highest point of physical\nbeauty, his point is that the activity complemented by pleasure is\nalready perfect, and the pleasure that accompanies it is a bonus that\nserves no further purpose. Taking pleasure in an activity does help us\nimprove at it, but enjoyment does not cease when perfection is\nachieved—on the contrary, that is when pleasure is at its peak.\nThat is when it reveals most fully what it is: an added bonus that\ncrowns our achievement.\n\nIt is clear, at any rate, that in Book X Aristotle gives a fuller\naccount of what pleasure is than he had in Book VII. We should take\nnote of a further difference between these two discussions: In Book X,\nhe makes the point that pleasure is a good but not\nthe good. He cites and endorses an argument given by Plato in\nthe Philebus: If we imagine a life filled with pleasure and\nthen mentally add wisdom to it, the result is made more desirable. But\nthe good is something that cannot be improved upon in this way.\nTherefore pleasure is not the good (1172b23–35). By contrast, in\nBook VII Aristotle strongly implies that the pleasure of contemplation\nis the good, because in one way or another all living beings\naim at this sort of pleasure. Aristotle observes in Book X that what\nall things aim at is good (1172b35–1173a1); significantly, he\nfalls short of endorsing the argument that since all aim at pleasure,\nit must be the good.\n\nBook VII makes the point that pleasures interfere with each other, and\nso even if all kinds of pleasures are good, it does not follow that\nall of them are worth choosing. One must make a selection among\npleasures by determining which are better. But how is one to make this\nchoice? Book VII does not say, but in Book X, Aristotle holds that the\nselection of pleasures is not to be made with reference to pleasure\nitself, but with reference to the activities they accompany.\n\n\nSince activities differ with respect to goodness and badness, some\nbeing worth choosing, others worth avoiding, and others neither, the\nsame is true of pleasures as well. (1175b24–6)\n\n\nAristotle’s statement implies that in order to determine whether\n(for example) the pleasure of virtuous activity is more desirable than\nthat of eating, we are not to attend to the pleasures themselves but\nto the activities with which we are pleased. A pleasure’s\ngoodness derives from the goodness of its associated activity. And\nsurely the reason why pleasure is not the criterion to which we should\nlook in making these decisions is that it is not the good. The\nstandard we should use in making comparisons between rival options is\nvirtuous activity, because that has been shown to be identical to\nhappiness.\n\nThat is why Aristotle says that what is judged pleasant by a good man\nreally is pleasant, because the good man is the measure of things\n(1176a15–19). He does not mean that the way to lead our lives is\nto search for a good man and continually rely on him to tell us what\nis pleasurable. Rather, his point is that there is no way of telling\nwhat is genuinely pleasurable (and therefore what is most pleasurable)\nunless we already have some other standard of value. Aristotle’s\ndiscussion of pleasure thus helps confirm his initial hypothesis that\nto live our lives well we must focus on one sort of good above all\nothers: virtuous activity. It is the good in terms of which all other\ngoods must be understood. Aristotle’s analysis of friendship\nsupports the same conclusion.\n",
    "section_title": "8. Pleasure",
    "entry_title": "Aristotle’s Ethics",
    "hierarchy_title": "Aristotle’s Ethics || Pleasure",
    "tokenized_text": [
        "pleasure",
        "pleasure",
        "aristotle",
        "frequently",
        "emphasizes",
        "importance",
        "pleasure",
        "human",
        "life",
        "therefore",
        "study",
        "live",
        "see",
        "example",
        "a",
        "ba",
        "fullscale",
        "examination",
        "nature",
        "value",
        "pleasure",
        "found",
        "two",
        "place",
        "vii",
        "x",
        "odd",
        "pleasure",
        "receives",
        "two",
        "lengthy",
        "treatment",
        "topic",
        "ethic",
        "revisited",
        "way",
        "book",
        "vii",
        "nicomachean",
        "ethic",
        "identical",
        "book",
        "vi",
        "eudemian",
        "ethic",
        "unknown",
        "reason",
        "editor",
        "former",
        "decided",
        "include",
        "within",
        "treatment",
        "pleasure",
        "unique",
        "work",
        "x",
        "study",
        "common",
        "treatise",
        "vii",
        "two",
        "account",
        "broadly",
        "similar",
        "agree",
        "value",
        "pleasure",
        "defend",
        "theory",
        "nature",
        "oppose",
        "competing",
        "theory",
        "aristotle",
        "hold",
        "happy",
        "life",
        "must",
        "include",
        "pleasure",
        "therefore",
        "opposes",
        "argue",
        "pleasure",
        "nature",
        "bad",
        "insists",
        "pleasure",
        "besides",
        "sens",
        "best",
        "pleasure",
        "one",
        "experienced",
        "virtuous",
        "people",
        "sufficient",
        "resource",
        "excellent",
        "activity",
        "book",
        "vii",
        "offer",
        "brief",
        "account",
        "pleasure",
        "process",
        "unimpeded",
        "activity",
        "natural",
        "state",
        "a",
        "aristotle",
        "elaborate",
        "natural",
        "state",
        "obviously",
        "mind",
        "healthy",
        "condition",
        "body",
        "especially",
        "sense",
        "faculty",
        "virtuous",
        "condition",
        "soul",
        "little",
        "said",
        "activity",
        "unimpeded",
        "aristotle",
        "remind",
        "u",
        "virtuous",
        "activity",
        "impeded",
        "absence",
        "sufficient",
        "supply",
        "external",
        "good",
        "b",
        "one",
        "might",
        "object",
        "people",
        "sick",
        "moral",
        "deficiency",
        "experience",
        "pleasure",
        "even",
        "though",
        "aristotle",
        "take",
        "natural",
        "state",
        "two",
        "strategy",
        "responding",
        "first",
        "sick",
        "person",
        "experience",
        "degree",
        "pleasure",
        "restored",
        "health",
        "pleasure",
        "feeling",
        "caused",
        "fact",
        "longer",
        "completely",
        "ill",
        "small",
        "part",
        "natural",
        "state",
        "acting",
        "without",
        "impediment",
        "b",
        "second",
        "aristotle",
        "willing",
        "say",
        "seems",
        "pleasant",
        "people",
        "may",
        "fact",
        "pleasant",
        "b",
        "taste",
        "bitter",
        "unhealthy",
        "palate",
        "may",
        "bitter",
        "call",
        "something",
        "pleasure",
        "report",
        "state",
        "mind",
        "also",
        "endorse",
        "others",
        "aristotle",
        "analysis",
        "nature",
        "pleasure",
        "meant",
        "apply",
        "every",
        "case",
        "something",
        "seems",
        "pleasant",
        "someone",
        "activity",
        "really",
        "pleasure",
        "unimpeded",
        "activity",
        "natural",
        "state",
        "follows",
        "conception",
        "pleasure",
        "every",
        "instance",
        "pleasure",
        "must",
        "good",
        "extent",
        "could",
        "unimpeded",
        "activity",
        "natural",
        "state",
        "bad",
        "matter",
        "indifference",
        "hand",
        "aristotle",
        "mean",
        "imply",
        "every",
        "pleasure",
        "chosen",
        "briefly",
        "mention",
        "point",
        "pleasure",
        "compete",
        "enjoyment",
        "one",
        "kind",
        "activity",
        "impedes",
        "activity",
        "carried",
        "time",
        "a",
        "point",
        "simply",
        "although",
        "pleasure",
        "may",
        "good",
        "worth",
        "choosing",
        "interfere",
        "activity",
        "far",
        "better",
        "point",
        "developed",
        "fully",
        "ethic",
        "x",
        "furthermore",
        "aristotle",
        "analysis",
        "allows",
        "speak",
        "certain",
        "pleasure",
        "bad",
        "without",
        "qualification",
        "b",
        "even",
        "though",
        "pleasure",
        "unimpeded",
        "activity",
        "natural",
        "state",
        "call",
        "pleasure",
        "bad",
        "without",
        "qualification",
        "insist",
        "avoided",
        "allow",
        "nonetheless",
        "chosen",
        "constraining",
        "circumstance",
        "pleasure",
        "recovering",
        "illness",
        "example",
        "bad",
        "without",
        "qualificationmeaning",
        "one",
        "pleasure",
        "one",
        "would",
        "ideally",
        "choose",
        "one",
        "could",
        "completely",
        "control",
        "one",
        "circumstance",
        "although",
        "really",
        "pleasure",
        "something",
        "said",
        "favor",
        "inferior",
        "good",
        "ideally",
        "one",
        "ought",
        "forego",
        "nonetheless",
        "pleasure",
        "worth",
        "havingif",
        "one",
        "add",
        "qualification",
        "worth",
        "undesirable",
        "circumstance",
        "pleasure",
        "recovering",
        "illness",
        "good",
        "small",
        "part",
        "oneself",
        "natural",
        "state",
        "acting",
        "without",
        "impediment",
        "also",
        "called",
        "bad",
        "one",
        "mean",
        "one",
        "avoid",
        "getting",
        "situation",
        "one",
        "experience",
        "pleasure",
        "aristotle",
        "indicates",
        "several",
        "time",
        "vii",
        "merely",
        "say",
        "pleasure",
        "good",
        "enough",
        "justice",
        "also",
        "want",
        "say",
        "highest",
        "good",
        "pleasure",
        "influenced",
        "idea",
        "expressed",
        "opening",
        "line",
        "ethic",
        "good",
        "thing",
        "aim",
        "vii",
        "hint",
        "idea",
        "living",
        "thing",
        "imitate",
        "contemplative",
        "activity",
        "god",
        "b",
        "plant",
        "nonhuman",
        "animal",
        "seek",
        "reproduce",
        "way",
        "participating",
        "unending",
        "series",
        "closest",
        "come",
        "ceaseless",
        "thinking",
        "unmoved",
        "mover",
        "aristotle",
        "make",
        "point",
        "several",
        "work",
        "see",
        "example",
        "de",
        "anima",
        "ab",
        "ethic",
        "x",
        "give",
        "full",
        "defense",
        "idea",
        "happiest",
        "human",
        "life",
        "resembles",
        "life",
        "divine",
        "conceives",
        "god",
        "continually",
        "enjoys",
        "single",
        "simple",
        "pleasure",
        "b",
        "the",
        "pleasure",
        "pure",
        "thoughtwhereas",
        "human",
        "being",
        "complexity",
        "grow",
        "weary",
        "whatever",
        "elaborate",
        "point",
        "x",
        "vii",
        "appeal",
        "conception",
        "divine",
        "activity",
        "order",
        "defend",
        "thesis",
        "highest",
        "good",
        "consists",
        "certain",
        "kind",
        "pleasure",
        "human",
        "happiness",
        "consist",
        "every",
        "kind",
        "pleasure",
        "consist",
        "one",
        "kind",
        "pleasurethe",
        "pleasure",
        "felt",
        "human",
        "engages",
        "theoretical",
        "activity",
        "thereby",
        "imitates",
        "pleasurable",
        "thinking",
        "god",
        "book",
        "x",
        "offer",
        "much",
        "elaborate",
        "account",
        "pleasure",
        "process",
        "process",
        "go",
        "developmental",
        "stage",
        "building",
        "temple",
        "process",
        "temple",
        "present",
        "come",
        "stage",
        "unfold",
        "time",
        "contrast",
        "pleasure",
        "like",
        "seeing",
        "many",
        "activity",
        "something",
        "come",
        "existence",
        "developmental",
        "process",
        "enjoying",
        "conversation",
        "example",
        "need",
        "wait",
        "finished",
        "order",
        "feel",
        "pleased",
        "take",
        "pleasure",
        "activity",
        "along",
        "way",
        "defining",
        "nature",
        "pleasure",
        "activity",
        "accompanies",
        "activity",
        "sense",
        "brings",
        "completion",
        "pleasure",
        "occurs",
        "something",
        "within",
        "u",
        "brought",
        "good",
        "condition",
        "activated",
        "relation",
        "external",
        "object",
        "also",
        "good",
        "condition",
        "pleasure",
        "drawing",
        "example",
        "requires",
        "development",
        "drawing",
        "ability",
        "object",
        "attention",
        "worth",
        "drawing",
        "conception",
        "pleasure",
        "aristotle",
        "develops",
        "book",
        "x",
        "obviously",
        "closely",
        "related",
        "analysis",
        "give",
        "book",
        "vii",
        "theory",
        "proposed",
        "later",
        "book",
        "brings",
        "point",
        "received",
        "little",
        "attention",
        "earlier",
        "pleasure",
        "nature",
        "something",
        "accompanies",
        "something",
        "else",
        "enough",
        "say",
        "happens",
        "good",
        "condition",
        "active",
        "unimpeded",
        "circumstance",
        "one",
        "must",
        "add",
        "point",
        "idea",
        "pleasure",
        "play",
        "certain",
        "role",
        "complementing",
        "something",
        "drawing",
        "well",
        "pleasure",
        "drawing",
        "well",
        "always",
        "occur",
        "together",
        "easy",
        "confuse",
        "aristotle",
        "analysis",
        "book",
        "x",
        "emphasizes",
        "importance",
        "making",
        "distinction",
        "say",
        "pleasure",
        "completes",
        "activity",
        "accompanies",
        "add",
        "mysteriously",
        "completes",
        "activity",
        "manner",
        "end",
        "added",
        "translation",
        "wd",
        "ross",
        "supervenes",
        "bloom",
        "youth",
        "flower",
        "age",
        "b",
        "unclear",
        "thought",
        "expressed",
        "perhaps",
        "aristotle",
        "merely",
        "trying",
        "avoid",
        "possible",
        "misunderstanding",
        "say",
        "pleasure",
        "completes",
        "activity",
        "mean",
        "activity",
        "accompanies",
        "way",
        "defective",
        "pleasure",
        "improves",
        "activity",
        "removing",
        "defect",
        "aristotle",
        "language",
        "open",
        "misinterpretation",
        "verb",
        "translated",
        "complete",
        "teleein",
        "also",
        "mean",
        "perfect",
        "latter",
        "might",
        "taken",
        "mean",
        "activity",
        "accompanied",
        "pleasure",
        "yet",
        "reached",
        "sufficiently",
        "high",
        "level",
        "excellence",
        "role",
        "pleasure",
        "bring",
        "point",
        "perfection",
        "aristotle",
        "deny",
        "take",
        "pleasure",
        "activity",
        "get",
        "better",
        "say",
        "pleasure",
        "completes",
        "activity",
        "supervening",
        "like",
        "bloom",
        "accompanies",
        "achieved",
        "highest",
        "point",
        "physical",
        "beauty",
        "point",
        "activity",
        "complemented",
        "pleasure",
        "already",
        "perfect",
        "pleasure",
        "accompanies",
        "bonus",
        "serf",
        "purpose",
        "taking",
        "pleasure",
        "activity",
        "help",
        "u",
        "improve",
        "enjoyment",
        "cease",
        "perfection",
        "achievedon",
        "contrary",
        "pleasure",
        "peak",
        "reveals",
        "fully",
        "added",
        "bonus",
        "crown",
        "achievement",
        "clear",
        "rate",
        "book",
        "x",
        "aristotle",
        "give",
        "fuller",
        "account",
        "pleasure",
        "book",
        "vii",
        "take",
        "note",
        "difference",
        "two",
        "discussion",
        "book",
        "x",
        "make",
        "point",
        "pleasure",
        "good",
        "good",
        "cite",
        "endorses",
        "argument",
        "given",
        "plato",
        "philebus",
        "imagine",
        "life",
        "filled",
        "pleasure",
        "mentally",
        "add",
        "wisdom",
        "result",
        "made",
        "desirable",
        "good",
        "something",
        "improved",
        "upon",
        "way",
        "therefore",
        "pleasure",
        "good",
        "b",
        "contrast",
        "book",
        "vii",
        "aristotle",
        "strongly",
        "implies",
        "pleasure",
        "contemplation",
        "good",
        "one",
        "way",
        "another",
        "living",
        "being",
        "aim",
        "sort",
        "pleasure",
        "aristotle",
        "observes",
        "book",
        "x",
        "thing",
        "aim",
        "good",
        "ba",
        "significantly",
        "fall",
        "short",
        "endorsing",
        "argument",
        "since",
        "aim",
        "pleasure",
        "must",
        "good",
        "book",
        "vii",
        "make",
        "point",
        "pleasure",
        "interfere",
        "even",
        "kind",
        "pleasure",
        "good",
        "follow",
        "worth",
        "choosing",
        "one",
        "must",
        "make",
        "selection",
        "among",
        "pleasure",
        "determining",
        "better",
        "one",
        "make",
        "choice",
        "book",
        "vii",
        "say",
        "book",
        "x",
        "aristotle",
        "hold",
        "selection",
        "pleasure",
        "made",
        "reference",
        "pleasure",
        "reference",
        "activity",
        "accompany",
        "since",
        "activity",
        "differ",
        "respect",
        "goodness",
        "badness",
        "worth",
        "choosing",
        "others",
        "worth",
        "avoiding",
        "others",
        "neither",
        "true",
        "pleasure",
        "well",
        "b",
        "aristotle",
        "statement",
        "implies",
        "order",
        "determine",
        "whether",
        "example",
        "pleasure",
        "virtuous",
        "activity",
        "desirable",
        "eating",
        "attend",
        "pleasure",
        "activity",
        "pleased",
        "pleasure",
        "goodness",
        "derives",
        "goodness",
        "associated",
        "activity",
        "surely",
        "reason",
        "pleasure",
        "criterion",
        "look",
        "making",
        "decision",
        "good",
        "standard",
        "use",
        "making",
        "comparison",
        "rival",
        "option",
        "virtuous",
        "activity",
        "shown",
        "identical",
        "happiness",
        "aristotle",
        "say",
        "judged",
        "pleasant",
        "good",
        "man",
        "really",
        "pleasant",
        "good",
        "man",
        "measure",
        "thing",
        "a",
        "mean",
        "way",
        "lead",
        "life",
        "search",
        "good",
        "man",
        "continually",
        "rely",
        "tell",
        "u",
        "pleasurable",
        "rather",
        "point",
        "way",
        "telling",
        "genuinely",
        "pleasurable",
        "therefore",
        "pleasurable",
        "unless",
        "already",
        "standard",
        "value",
        "aristotle",
        "discussion",
        "pleasure",
        "thus",
        "help",
        "confirm",
        "initial",
        "hypothesis",
        "live",
        "life",
        "well",
        "must",
        "focus",
        "one",
        "sort",
        "good",
        "others",
        "virtuous",
        "activity",
        "good",
        "term",
        "good",
        "must",
        "understood",
        "aristotle",
        "analysis",
        "friendship",
        "support",
        "conclusion"
    ]
}