{
    "main_text": "The Poetics: How to Understand Poetry ? || Comedy\n4. Music and the Value of Art\n\nWhat is the value of poetry, or art more generally? Neither in the\nPoetics nor in the published works on poetry does Aristotle\nseem to be bothered by that question. But since this is yet another\nperplexing question for us, many scholars have been tempted to supply\nan ethical answer. Interpreting the katharsis clause in this\nway has been one major way of satisfying the urge to answer this\nquestion. But even without relying on that admittedly controversial\nphrase, other ethically tinged answers have been offered. For example,\nwhy can’t we read tragedies as providing us an attractive way to\ndevelop a typically “emotional understanding” of important\nethical features, such as the importance of being moved by other\npeople’s misfortunes (Halliwell 1986, 2002)? Or, more\nspecifically, shouldn’t tragedies allow for imagining ethical\nsituations that would help spectators illuminate issues linked to\ntheir use of practical wisdom (Frede 1992; Belfiore 1992; Donini\n 2004)?[11]\n There is certainly much to say in favor of such readings, especially\nif one focuses on, say, Antigone or Philoctetes. But\nwhen Aristotle mentions these plays, he does not at all give the\nimpression that he takes them to be paradigmatic of the genre (In the\nPoetics, he mentions the former in the framework of a\ncritique of the quite untragic way Sophocles has depicted Haemon, who\ndid not dare to kill his father Creon: 14, 1454a1–2; as to the\nlatter, one verse of Euripides’ lost play is quoted for the\nappropriate use of a rare verb: Poetics 22,\n1458b22–24). Instead, the two plays that he seems to take as\nparadigmatic (and to which he refers the most) are Sophocles’\nOedipus-Rex and Euripides’ Iphigenia in\nTauris. Certainly, Oedipus-Rex can easily be read as\nproviding a kind of insight into the deep miseries a human being can\nbe subjected to; but one may fairly doubt that it might really help\npeople in their use of practical wisdom. As to Iphigenia in\nTauris, it would require a tremendous battery of arguments to\npersuade modern readers that they should read it in a either such\nway—and it is no surprise that no scholar has attempted to do\nso!\n\nMore generally, there are at least two main rebuttals to be made\nagainst such ethical readings of the Poetics (and presumably\nAristotle’s aesthetics in\n general).[12]\n First, what then about comedy? When he mentions a possible positive\nuse of comedy, Plato proposes that virtuous citizens watch them for a\nbetter grasp of what vices look like: “We must learn to\nrecognizes buffoonery in order to avoid doing or saying anything\nridiculous out of ignorance” (Laws VII 816e). It is\ntelling that Aristotle never mentions such an odd suggestion: how can\nwe possibly learn about vice while we are enjoying the jokes and\ngaffes that pepper comedic plots? A second reply comes from what\nAristotle says about music in Politics VIII. There, he begins\nby repeating faithfully what Plato had proposed: since music can\nrepresent virtues like courage, children must learn to play it and it\nis through enjoying singing and playing such music that they will\nsubconsciously come to enjoy those virtues. But then, in a second\ninstance, Aristotle vigorously, if implicitly, opposes Plato. In the\nLaws, Plato very much insists that adult citizens of Magnesia\nmust continue singing and dancing in order to bolster their virtues\n(II 664d). Aristotle is no less insistent that once adults, the\ncitizens of his ideal city stop singing and playing music and instead\nhire professional musicians and enjoy listening to them during their\n“free time” (VIII 6, 1340b35–39).\n\n“Free time” or “leisure”\n(scholê) is a key concept (on this, see Too 1998; Heath\n2014; and Ferrari 2019). It does not mean the pause or the rest one\ntakes from work; it is a time, or a mode of life, where activities are\nenjoyed for themselves. In the Nicomachean Ethics, it is at\nthe core of the argument for the primacy of theoretical activity:\nwhile contemplation is typically a leisured activity, political\nactivities constitute the non-leisured life, one which is meant to\nachieve practical goals (X 8, 1177b4–24). And in\nPolitics VII-VIII, when defending his own proposal as how\norganize a perfect city, Aristotle goes as far as saying: “To be\nable to enjoy leisure rightly is the principle of everything”\n(VIII 3, 1337b31–32). In the case of music, Aristotle makes it\nclear that if music can be listened to for the practical purpose of\nrelaxation (a little bit like our ambient music), or fostering virtue\n(as children must do), music can also be listened to for its own sake,\njust for the sake of enjoying it. Here Aristotle seems to be repeating\nwhat he says in the passage of the Eudemian Ethics already\nquoted, but he adds something we do not find there: music “for\nthe sake of leisure” is characterized as a music “for the\nsake of intelligence (phronêsis)” (VIII\n5, 1339a14–26).\n\nUnfortunately, Aristotle does not spell out what exactly he means by\nthat, and the phrase has been variously interpreted. Again, some\nscholars have proposed an ethical reading: the intelligence involved\nwould amount to the practical intelligence, or wisdom (which is\ntypically called phronêsis), that is required in any\nmoral action. Thus, by listening to music that depicts, or\n“represents”, say, courage, one may better understand what\ncourage is. Despite its seeming natural, this reading contradicts what\nAristotle repeats in those same pages: moral, or political, action is\nfundamentally a non-leisured activity (ascholia). It would be\nodd then if Aristotle were recommending such a leisured use of music\nwhile aiming to describe how to manage non-leisured moral life!\nAnother theme that is also repeated in those pages should give us a\nbetter clue: the final aim of learning how to sing and play an\ninstrument is to help these future citizens become “good\njudges” of music (VIII 6, 1340b35–39). In the\nLaws, Plato also used that phrase, and meant by it that adult\ncitizens should be able to recognize morally good from morally bad\nsongs, and thus enable them to decide which songs must be sung in\nMagnesia (II 669a-670c). There is no reason to believe Aristotle would\nhave endorsed such a strong ethical-cum-political agenda. Instead, it\nis very likely that by “judging”, Aristotle just means\nthat by having the first-hand experience of playing music, citizens\nwill be able to judge and appreciate the good quality of music. And,\nas all musical connoisseurs know, such an appreciation is both\nperceptual (as we do enjoy listening to sounds and rhythm) and also\nsomehow intellectual: a connoisseur, that is, equally enjoys how well\nor inventively a piece of music is\n constructed.[13]\n\nAdmittedly, all of this is absent from the Poetics, where the\nword “leisure” does not even appear. But when in the\nPolitics, he presents his conception of a music that should\nbe listened to and appreciated for its own sake, it is surprising that\nAristotle gives as justification the example of Homer, and cites\nseveral verses from the Odyssey: besides music for relaxation\nand moral education, there is \n\n\nmusic for a life spent in leisure, which is the very reason why people\nbring it in. They give it a place among the leisure time that they\nthink befits free people. That is why Homer wrote these verses:\n[…] “They invite the bard who charms them all”. And\nelsewhere, Odysseus says that the best way to spend one’s life\nis in view when men are rejoicing: “the guests sit in a row in\nthe room to listen to the bard”. (VIII 3, 1338a21–30) \n\n\nOf course, Aristotle must have been aware that the bard is the one who\nsings poetry, whether lyric or epic, with the accompaniment of the\nlyre. This argument therefore implies that it is actually the\nlistening and appreciation of performed poetry that must constitute\nsuch a leisured activity. And since in the Poetics, tragedy\nand comedy are presented as poetic forms that are more valuable than\nepic or lyric poetry, Aristotle must also have considered attending\ntragic and comic plays as part of these leisured activities, or more\ngenerally of what he calls in that passage of the Politics, a\n“free life”, that is a life of free citizens (not of\nslaves), but also a life that in which time is spent enjoying music or\npoetry for their own sake.\n\nIn the case of music, Aristotle strongly recommends that children\nlearn how to play an instrument (actually, the lyre) so that once\nadults they will be able to fully enjoy beautiful songs since they\nwill have become able to “judge the beautiful songs” and\ntherefore “enjoy them for themselves” (Pol. VIII\n6, 1340b38–39). This is also the case for visual arts: children,\nAristotle proposes, should learn how to draw images in order to be\nable “to contemplate the beauty of bodies”\n(1338a40–b2). In both cases, their pleasure can be taken along\nthe lines in which Aristotle defines pleasure in his Nicomachean\nEthics: it is the unimpeded activity, or\n“activation”, of their natural capacity, or faculty, of\nhearing and seeing respectively. But Aristotle importantly adds:\n“when it comes to the best possible object” to be heard or\nseen (NE 10.4, 1174b14–23). We therefore need to learn\nhow to judge how good the objects of our listening or seeing are. And\nonce we have learned this, we can fully enjoy pieces of music and\npaintings or sculptures that we know are those that best suit our\nrespective faculties. \n\nAristotle never makes such a suggestion in the case of poetry; and\nindeed, if one holds that poetry is a matter of exceptional natural\ngift, as Aristotle does, it would be odd to propose that every child\nshould practice composing poetry. One might then perhaps take his\nwritings on poetry offered as a sort of late education on such\nartworks. Through their reading of either the Poetics (if\nthey get the chance of enrolling in the Lyceum) or Aristotle’s\npublished works, people can become such connoisseurs of poetry, and\nenjoy it fully too. \n\nIt is often claimed that the ancients did not value artworks in the\nways we moderns do. Ancient Greek theater, which includes poetry,\nscene painting and music, the argument goes, is only one moment of\nreligious festivals where a whole city came to unite in shared\nactivities and values. And despite all his critiques of the theater,\nfor which he coined the despising word “theatrocracy”\n(Laws III 701a), Plato nevertheless emphasized that the right\nsorts of poetry and music should play a crucial role in the moral\neducation of youth. But Aristotle seems very much unconcerned about\nthe religious and political context of theater performances; and it is\ntelling that he doesn’t say anything worth noticing about the\nrole of the gods in the tragedies. (Actually, these elements are even\na matter of reproach that classicists often make against\n him![14])\n And he vividly opposes a complete subjection of art to any other\nuseful objective: “To search everywhere for what is useful is\ntotally inappropriate for those who are great in soul and free”\n(Pol. VIII 3, 1338b2–4). In other words, if indeed it\nmay be useful to listen to some sorts of music for educational or\ntherapeutic purposes, music can, and should, also be enjoyed for\nitself, and the same goes for painting and poetry. To be sure, by\nthemselves, the objects of mimesis may not be worthy. But even the\nlowest animals, as Aristotle states in the preface of his Parts of\nAnimals, do offer “extraordinary pleasures to those who are\nable to know their causes and are naturally gifted for philosophical\nunderstanding” (I 5, 645a9–10). In the case of animals and\nplants, we admire the way “artistic nature”\n(dêmiourgêsasa phusis) has built them. In the\ncase of artworks, \n\n\nwe enjoy gazing at likenesses of animals because we are at the same\ntime contemplating how artistic craft (dêmiourgêsasa\ntechnê), whether painting or sculpture, has produced them;\n(645a11–12) \n\n\nthat is, when we are connoisseurs of art. True, as Aristotle also says\nin that preface, divine beings such as celestial bodies and unmoved\ngods are much more worthy objects to contemplate (mostly because they\nare eternal). And indeed, as he repeats in his Nicomachean\nEthics and Politics, philosophical contemplation, which\nculminates in exercising our intellect towards such divine objects, is\nthe highest activity one can attain. But such philosophical\ncontemplation, whether it comes to these divine entities or to the\ncauses of the animals and plants, is deemed to remain for the\n“naturally gifted for philosophical understanding” which\nare few, as Aristotle seems to admit with regret. By contrast,\nprovided one gets the right artistic education leading to\nconnoisseurship, contemplating art can be part and parcel of\neveryone’s happiness (or typically human flourishing:\neudaimonia). \n",
    "section_title": "4. Music and the Value of Art",
    "entry_title": "Aristotle’s Aesthetics",
    "hierarchy_title": "Aristotle’s Aesthetics || The Poetics: How to Understand Poetry ? || Comedy",
    "tokenized_text": [
        "poetics",
        "understand",
        "poetry",
        "comedy",
        "music",
        "value",
        "art",
        "value",
        "poetry",
        "art",
        "generally",
        "neither",
        "poetics",
        "published",
        "work",
        "poetry",
        "aristotle",
        "seem",
        "bothered",
        "question",
        "since",
        "yet",
        "another",
        "perplexing",
        "question",
        "u",
        "many",
        "scholar",
        "tempted",
        "supply",
        "ethical",
        "answer",
        "interpreting",
        "katharsis",
        "clause",
        "way",
        "one",
        "major",
        "way",
        "satisfying",
        "urge",
        "answer",
        "question",
        "even",
        "without",
        "relying",
        "admittedly",
        "controversial",
        "phrase",
        "ethically",
        "tinged",
        "answer",
        "offered",
        "example",
        "read",
        "tragedy",
        "providing",
        "u",
        "attractive",
        "way",
        "develop",
        "typically",
        "emotional",
        "understanding",
        "important",
        "ethical",
        "feature",
        "importance",
        "moved",
        "people",
        "misfortune",
        "halliwell",
        "specifically",
        "tragedy",
        "allow",
        "imagining",
        "ethical",
        "situation",
        "would",
        "help",
        "spectator",
        "illuminate",
        "issue",
        "linked",
        "use",
        "practical",
        "wisdom",
        "frede",
        "belfiore",
        "donini",
        "certainly",
        "much",
        "say",
        "favor",
        "reading",
        "especially",
        "one",
        "focus",
        "say",
        "antigone",
        "philoctetes",
        "aristotle",
        "mention",
        "play",
        "give",
        "impression",
        "take",
        "paradigmatic",
        "genre",
        "poetics",
        "mention",
        "former",
        "framework",
        "critique",
        "quite",
        "untragic",
        "way",
        "sophocles",
        "depicted",
        "haemon",
        "dare",
        "kill",
        "father",
        "creon",
        "a",
        "latter",
        "one",
        "verse",
        "euripides",
        "lost",
        "play",
        "quoted",
        "appropriate",
        "use",
        "rare",
        "verb",
        "poetics",
        "b",
        "instead",
        "two",
        "play",
        "seems",
        "take",
        "paradigmatic",
        "refers",
        "sophocles",
        "oedipusrex",
        "euripides",
        "iphigenia",
        "tauris",
        "certainly",
        "oedipusrex",
        "easily",
        "read",
        "providing",
        "kind",
        "insight",
        "deep",
        "misery",
        "human",
        "subjected",
        "one",
        "may",
        "fairly",
        "doubt",
        "might",
        "really",
        "help",
        "people",
        "use",
        "practical",
        "wisdom",
        "iphigenia",
        "tauris",
        "would",
        "require",
        "tremendous",
        "battery",
        "argument",
        "persuade",
        "modern",
        "reader",
        "read",
        "either",
        "wayand",
        "surprise",
        "scholar",
        "attempted",
        "generally",
        "least",
        "two",
        "main",
        "rebuttal",
        "made",
        "ethical",
        "reading",
        "poetics",
        "presumably",
        "aristotle",
        "aesthetic",
        "general",
        "first",
        "comedy",
        "mention",
        "possible",
        "positive",
        "use",
        "comedy",
        "plato",
        "proposes",
        "virtuous",
        "citizen",
        "watch",
        "better",
        "grasp",
        "vice",
        "look",
        "like",
        "must",
        "learn",
        "recognizes",
        "buffoonery",
        "order",
        "avoid",
        "saying",
        "anything",
        "ridiculous",
        "ignorance",
        "law",
        "vii",
        "e",
        "telling",
        "aristotle",
        "never",
        "mention",
        "odd",
        "suggestion",
        "possibly",
        "learn",
        "vice",
        "enjoying",
        "joke",
        "gaffe",
        "pepper",
        "comedic",
        "plot",
        "second",
        "reply",
        "come",
        "aristotle",
        "say",
        "music",
        "politics",
        "viii",
        "begin",
        "repeating",
        "faithfully",
        "plato",
        "proposed",
        "since",
        "music",
        "represent",
        "virtue",
        "like",
        "courage",
        "child",
        "must",
        "learn",
        "play",
        "enjoying",
        "singing",
        "playing",
        "music",
        "subconsciously",
        "come",
        "enjoy",
        "virtue",
        "second",
        "instance",
        "aristotle",
        "vigorously",
        "implicitly",
        "opposes",
        "plato",
        "law",
        "plato",
        "much",
        "insists",
        "adult",
        "citizen",
        "magnesia",
        "must",
        "continue",
        "singing",
        "dancing",
        "order",
        "bolster",
        "virtue",
        "ii",
        "d",
        "aristotle",
        "le",
        "insistent",
        "adult",
        "citizen",
        "ideal",
        "city",
        "stop",
        "singing",
        "playing",
        "music",
        "instead",
        "hire",
        "professional",
        "musician",
        "enjoy",
        "listening",
        "free",
        "time",
        "viii",
        "b",
        "free",
        "time",
        "leisure",
        "scholê",
        "key",
        "concept",
        "see",
        "heath",
        "ferrari",
        "mean",
        "pause",
        "rest",
        "one",
        "take",
        "work",
        "time",
        "mode",
        "life",
        "activity",
        "enjoyed",
        "nicomachean",
        "ethic",
        "core",
        "argument",
        "primacy",
        "theoretical",
        "activity",
        "contemplation",
        "typically",
        "leisured",
        "activity",
        "political",
        "activity",
        "constitute",
        "nonleisured",
        "life",
        "one",
        "meant",
        "achieve",
        "practical",
        "goal",
        "x",
        "b",
        "politics",
        "viiviii",
        "defending",
        "proposal",
        "organize",
        "perfect",
        "city",
        "aristotle",
        "go",
        "far",
        "saying",
        "able",
        "enjoy",
        "leisure",
        "rightly",
        "principle",
        "everything",
        "viii",
        "b",
        "case",
        "music",
        "aristotle",
        "make",
        "clear",
        "music",
        "listened",
        "practical",
        "purpose",
        "relaxation",
        "little",
        "bit",
        "like",
        "ambient",
        "music",
        "fostering",
        "virtue",
        "child",
        "must",
        "music",
        "also",
        "listened",
        "sake",
        "sake",
        "enjoying",
        "aristotle",
        "seems",
        "repeating",
        "say",
        "passage",
        "eudemian",
        "ethic",
        "already",
        "quoted",
        "add",
        "something",
        "find",
        "music",
        "sake",
        "leisure",
        "characterized",
        "music",
        "sake",
        "intelligence",
        "phronêsis",
        "viii",
        "a",
        "unfortunately",
        "aristotle",
        "spell",
        "exactly",
        "mean",
        "phrase",
        "variously",
        "interpreted",
        "scholar",
        "proposed",
        "ethical",
        "reading",
        "intelligence",
        "involved",
        "would",
        "amount",
        "practical",
        "intelligence",
        "wisdom",
        "typically",
        "called",
        "phronêsis",
        "required",
        "moral",
        "action",
        "thus",
        "listening",
        "music",
        "depicts",
        "represents",
        "say",
        "courage",
        "one",
        "may",
        "better",
        "understand",
        "courage",
        "despite",
        "seeming",
        "natural",
        "reading",
        "contradicts",
        "aristotle",
        "repeat",
        "page",
        "moral",
        "political",
        "action",
        "fundamentally",
        "nonleisured",
        "activity",
        "ascholia",
        "would",
        "odd",
        "aristotle",
        "recommending",
        "leisured",
        "use",
        "music",
        "aiming",
        "describe",
        "manage",
        "nonleisured",
        "moral",
        "life",
        "another",
        "theme",
        "also",
        "repeated",
        "page",
        "give",
        "u",
        "better",
        "clue",
        "final",
        "aim",
        "learning",
        "sing",
        "play",
        "instrument",
        "help",
        "future",
        "citizen",
        "become",
        "good",
        "judge",
        "music",
        "viii",
        "b",
        "law",
        "plato",
        "also",
        "used",
        "phrase",
        "meant",
        "adult",
        "citizen",
        "able",
        "recognize",
        "morally",
        "good",
        "morally",
        "bad",
        "song",
        "thus",
        "enable",
        "decide",
        "song",
        "must",
        "sung",
        "magnesia",
        "ii",
        "ac",
        "reason",
        "believe",
        "aristotle",
        "would",
        "endorsed",
        "strong",
        "ethicalcumpolitical",
        "agenda",
        "instead",
        "likely",
        "judging",
        "aristotle",
        "mean",
        "firsthand",
        "experience",
        "playing",
        "music",
        "citizen",
        "able",
        "judge",
        "appreciate",
        "good",
        "quality",
        "music",
        "musical",
        "connoisseur",
        "know",
        "appreciation",
        "perceptual",
        "enjoy",
        "listening",
        "sound",
        "rhythm",
        "also",
        "somehow",
        "intellectual",
        "connoisseur",
        "equally",
        "enjoys",
        "well",
        "inventively",
        "piece",
        "music",
        "constructed",
        "admittedly",
        "absent",
        "poetics",
        "word",
        "leisure",
        "even",
        "appear",
        "politics",
        "present",
        "conception",
        "music",
        "listened",
        "appreciated",
        "sake",
        "surprising",
        "aristotle",
        "give",
        "justification",
        "example",
        "homer",
        "cite",
        "several",
        "verse",
        "odyssey",
        "besides",
        "music",
        "relaxation",
        "moral",
        "education",
        "music",
        "life",
        "spent",
        "leisure",
        "reason",
        "people",
        "bring",
        "give",
        "place",
        "among",
        "leisure",
        "time",
        "think",
        "befits",
        "free",
        "people",
        "homer",
        "wrote",
        "verse",
        "invite",
        "bard",
        "charm",
        "elsewhere",
        "odysseus",
        "say",
        "best",
        "way",
        "spend",
        "one",
        "life",
        "view",
        "men",
        "rejoicing",
        "guest",
        "sit",
        "row",
        "room",
        "listen",
        "bard",
        "viii",
        "a",
        "course",
        "aristotle",
        "must",
        "aware",
        "bard",
        "one",
        "sings",
        "poetry",
        "whether",
        "lyric",
        "epic",
        "accompaniment",
        "lyre",
        "argument",
        "therefore",
        "implies",
        "actually",
        "listening",
        "appreciation",
        "performed",
        "poetry",
        "must",
        "constitute",
        "leisured",
        "activity",
        "since",
        "poetics",
        "tragedy",
        "comedy",
        "presented",
        "poetic",
        "form",
        "valuable",
        "epic",
        "lyric",
        "poetry",
        "aristotle",
        "must",
        "also",
        "considered",
        "attending",
        "tragic",
        "comic",
        "play",
        "part",
        "leisured",
        "activity",
        "generally",
        "call",
        "passage",
        "politics",
        "free",
        "life",
        "life",
        "free",
        "citizen",
        "slave",
        "also",
        "life",
        "time",
        "spent",
        "enjoying",
        "music",
        "poetry",
        "sake",
        "case",
        "music",
        "aristotle",
        "strongly",
        "recommends",
        "child",
        "learn",
        "play",
        "instrument",
        "actually",
        "lyre",
        "adult",
        "able",
        "fully",
        "enjoy",
        "beautiful",
        "song",
        "since",
        "become",
        "able",
        "judge",
        "beautiful",
        "song",
        "therefore",
        "enjoy",
        "pol",
        "viii",
        "b",
        "also",
        "case",
        "visual",
        "art",
        "child",
        "aristotle",
        "proposes",
        "learn",
        "draw",
        "image",
        "order",
        "able",
        "contemplate",
        "beauty",
        "body",
        "ab",
        "case",
        "pleasure",
        "taken",
        "along",
        "line",
        "aristotle",
        "defines",
        "pleasure",
        "nicomachean",
        "ethic",
        "unimpeded",
        "activity",
        "activation",
        "natural",
        "capacity",
        "faculty",
        "hearing",
        "seeing",
        "respectively",
        "aristotle",
        "importantly",
        "add",
        "come",
        "best",
        "possible",
        "object",
        "heard",
        "seen",
        "ne",
        "b",
        "therefore",
        "need",
        "learn",
        "judge",
        "good",
        "object",
        "listening",
        "seeing",
        "learned",
        "fully",
        "enjoy",
        "piece",
        "music",
        "painting",
        "sculpture",
        "know",
        "best",
        "suit",
        "respective",
        "faculty",
        "aristotle",
        "never",
        "make",
        "suggestion",
        "case",
        "poetry",
        "indeed",
        "one",
        "hold",
        "poetry",
        "matter",
        "exceptional",
        "natural",
        "gift",
        "aristotle",
        "would",
        "odd",
        "propose",
        "every",
        "child",
        "practice",
        "composing",
        "poetry",
        "one",
        "might",
        "perhaps",
        "take",
        "writing",
        "poetry",
        "offered",
        "sort",
        "late",
        "education",
        "artwork",
        "reading",
        "either",
        "poetics",
        "get",
        "chance",
        "enrolling",
        "lyceum",
        "aristotle",
        "published",
        "work",
        "people",
        "become",
        "connoisseur",
        "poetry",
        "enjoy",
        "fully",
        "often",
        "claimed",
        "ancient",
        "value",
        "artwork",
        "way",
        "modern",
        "ancient",
        "greek",
        "theater",
        "includes",
        "poetry",
        "scene",
        "painting",
        "music",
        "argument",
        "go",
        "one",
        "moment",
        "religious",
        "festival",
        "whole",
        "city",
        "came",
        "unite",
        "shared",
        "activity",
        "value",
        "despite",
        "critique",
        "theater",
        "coined",
        "despising",
        "word",
        "theatrocracy",
        "law",
        "iii",
        "a",
        "plato",
        "nevertheless",
        "emphasized",
        "right",
        "sort",
        "poetry",
        "music",
        "play",
        "crucial",
        "role",
        "moral",
        "education",
        "youth",
        "aristotle",
        "seems",
        "much",
        "unconcerned",
        "religious",
        "political",
        "context",
        "theater",
        "performance",
        "telling",
        "say",
        "anything",
        "worth",
        "noticing",
        "role",
        "god",
        "tragedy",
        "actually",
        "element",
        "even",
        "matter",
        "reproach",
        "classicist",
        "often",
        "make",
        "vividly",
        "opposes",
        "complete",
        "subjection",
        "art",
        "useful",
        "objective",
        "search",
        "everywhere",
        "useful",
        "totally",
        "inappropriate",
        "great",
        "soul",
        "free",
        "pol",
        "viii",
        "b",
        "word",
        "indeed",
        "may",
        "useful",
        "listen",
        "sort",
        "music",
        "educational",
        "therapeutic",
        "purpose",
        "music",
        "also",
        "enjoyed",
        "go",
        "painting",
        "poetry",
        "sure",
        "object",
        "mimesis",
        "may",
        "worthy",
        "even",
        "lowest",
        "animal",
        "aristotle",
        "state",
        "preface",
        "part",
        "animal",
        "offer",
        "extraordinary",
        "pleasure",
        "able",
        "know",
        "cause",
        "naturally",
        "gifted",
        "philosophical",
        "understanding",
        "a",
        "case",
        "animal",
        "plant",
        "admire",
        "way",
        "artistic",
        "nature",
        "dêmiourgêsasa",
        "phusis",
        "built",
        "case",
        "artwork",
        "enjoy",
        "gazing",
        "likeness",
        "animal",
        "time",
        "contemplating",
        "artistic",
        "craft",
        "dêmiourgêsasa",
        "technê",
        "whether",
        "painting",
        "sculpture",
        "produced",
        "a",
        "connoisseur",
        "art",
        "true",
        "aristotle",
        "also",
        "say",
        "preface",
        "divine",
        "being",
        "celestial",
        "body",
        "unmoved",
        "god",
        "much",
        "worthy",
        "object",
        "contemplate",
        "mostly",
        "eternal",
        "indeed",
        "repeat",
        "nicomachean",
        "ethic",
        "politics",
        "philosophical",
        "contemplation",
        "culminates",
        "exercising",
        "intellect",
        "towards",
        "divine",
        "object",
        "highest",
        "activity",
        "one",
        "attain",
        "philosophical",
        "contemplation",
        "whether",
        "come",
        "divine",
        "entity",
        "cause",
        "animal",
        "plant",
        "deemed",
        "remain",
        "naturally",
        "gifted",
        "philosophical",
        "understanding",
        "aristotle",
        "seems",
        "admit",
        "regret",
        "contrast",
        "provided",
        "one",
        "get",
        "right",
        "artistic",
        "education",
        "leading",
        "connoisseurship",
        "contemplating",
        "art",
        "part",
        "parcel",
        "everyone",
        "happiness",
        "typically",
        "human",
        "flourishing",
        "eudaimonia"
    ]
}