{
    "main_text": "Aristotle’s Philosophy of Science\n2. Aristotle’s Philosophy of Science\n\nIn sections 4, 5 and 6, we will explore the ways in which Aristotle\nsystematically organizes and explains an extraordinary body of\ninformation about animal anatomy, physiology and development. But\nAristotle was able to accomplish what he did in zoology because he had\ngiven a great deal of thought to the nature of scientific inquiry. How\ndoes one progress from the superficial and unorganized state of\neveryday experience toward organized scientific knowledge? To answer\nthis question, you need a concept of the goal to be achieved, and\nAristotle developed such a concept in his Prior and\nPosterior Analytics (henceforth abbreviated as APr.\nand APo., respectively). The goal of scientific inquiry, he\nargued, was a system of concepts and propositions organized\nhierarchically, ultimately resting on knowledge of the essential\nnatures of the objects of study and certain other necessary first\nprinciples. These definitions and principles form the basis of causal\nexplanations of all the other universal truths within the domain of\nstudy. Those other universal truths should identify attributes\nbelonging to a subject per se, in virtue of that\nsubject’s nature. The example he uses when he introduces his\naccount of scientific demonstration to illustrate such propositions is\nfrom geometry: having interior angles equal to two right angles\nbelongs to all and only triangles in virtue of their being triangles\n(APo. I 4, 5). This attribute belongs to all\nequilateral triangles as well—not, however, because\nthey are equilateral, but because they are triangles. Thus\nscientific knowledge of such a proposition, knowledge that displays\nthe reason why any triangle has this property, must explain why this\nproperty belongs to triangles as such. The explanation, of\ncourse, will appeal to the essential character of three-sided\nrectilinear plane figures, i.e. to what it is to be a triangle.\n\nThe second book of the Posterior Analytics discusses\nhow to achieve this goal of scientific knowledge, one central\nconcern being how knowledge of essences, expressed in definitions, is\nrelated to explanations expressed in the form of causal\ndemonstrations. Plato had formulated a famous paradox of inquiry in\nhis dialogue Meno: either you know the object of your\ninquiry, in which case inquiry is unnecessary; or you don’t know\nthe object of your inquiry, in which case inquiry is impossible\n(Meno 80d5-e5). Aristotle reminds us of this paradox in the\nfirst chapter of the Posterior Analytics, but his full\nsolution only emerges in book II. There, he argues that perceptual\nexperience gives us a grasp of the target of inquiry that, though it\ndoes not count as scientific knowledge, does serve to direct further\ninquiry. He begins the discussion by presenting us with a claim about\nhow objects of inquiry are linked to objects of scientific\nknowledge.\n\nThe things about which we inquire are equal in number to the things we\nknow scientifically. We inquire about four things: the fact,\nthe reason why, if something is, what something\nis. (APo. II 1, 89b23–25)\n\n\nAristotle conceives of these four inquiries as paired, and\nthere is a natural sequence in each pair. Knowing that some\nstate of affairs is the case, we can inquire into the reason why it is\nthe case.\n\nWhen we know the fact we inquire about the reason\nwhy (e.g., knowing that it is eclipsed or that\nthe earth moves, we inquire into the reason why it is\neclipsed or why the earth moves). (APo. II 1,\n89b29–31)\n\n\nSimilarly, if we conclude an inquiry into whether something exists, we\ncan go on to investigate its nature, what it is.\n\nAnd having come to know that it is, we inquire what\nit is (e.g.: Then what is a god? Or what is a man?). (APo. II\n1, 89b34–35)\n\n\nThe examples reveal a distinction that structures much of the\ndiscussion for the next ten chapters. For it looks as if\n‘factual’ inquiries concern whether some attribute belongs\nto some subject (movement to the earth, eclipse to the moon), and the\nsearch for the reason why will be a search for the causal explanation\nof the attribute belonging to that subject. By contrast, it looks like\nthe move from ‘if’ to ‘what’ is a move from\nestablishing the existence of some subject (‘god’,\n‘man’) to establishing what it is.\n\nHowever, the distinction is not, it turns out, so clear-cut. Having\nbegun to illustrate the distinction between inquiry if or\nwhether something is and what it is with the\nquestion ‘whether there is or is not a centaur or a god’,\nhe then characterizes the knowledge achieved as ‘knowing\nthat it is’. And in the second chapter, he begins to\nlink the two sequences of inquiry by means of his syllogistic concept\nof “middle term,” the term that is common to the two\npremises in a syllogistic proof.\n\nThus it results that in all our research we seek either\nif there is a middle term or what the middle term is. For the\nmiddle term is the cause, and this is in every case what is\nsought. (APo. II 2, 90a7–9)\n\n\nThat is, in any valid syllogistic inference, the middle term shared by\nthe premises is the warrant for the conclusion. In scientific\nexplanation, however, the middle term must also identify the\ncause of the fact given in the conclusion—what that term\nidentifies is the causal link between the subject and attribute. To\nuse another of his common examples, if we seek to explain the periodic\nsound of noise in the clouds, the middle term must identify the cause\nof the connection between that noise and those clouds. Moreover, on\nAristotle’s account of the relationship between causal\ndemonstration and scientific definition, knowing the cause of\nthunder is at the same time knowing the essence of thunder,\nwhat thunder really is.\n\nThere is a difference between saying why it thunders and what thunder\nis. In the one case you will say: Because the fire is extinguished in\nthe clouds. But: What is thunder?—A noise of fire being\nextinguished in the clouds. Hence the same account is given in\ndifferent ways: in one way it is a continuous demonstration, in the\nother a definition. (APo. II 10, 94a4–8)\n\n\nIn the APo., Aristotle returns regularly to such standard\nexamples of natural phenomena as thunder and eclipses—but he\nalso, and importantly, provides an extended biological example, the\nseasonal loss of leaves in broad-leafed\n plants.[2]\n In ch. 16, Aristotle imagines an inquiry that begins with questions\nsuch as ‘Why do fig trees and grape vines lose their\nleaves?’. The model answer is ‘Because they are both\nbroad-leafed.’ That is, the inquiry seeks some other feature,\ncommon to both kinds, related to the target of inquiry, the\nseasonal loss of leaves. The ‘because’ is, however,\npreliminary—it is best to see being broad-leafed as a step\ntoward causal explanation. Chapter 17 picks up the example, in the\ncontext of arguing that basic scientific inquiry seeks, wherever\npossible, co-extensive predications, which those between leaf\nloss and fig trees, or leaf loss and grape vines, are not. The\ncandidate major premise, however—‘Whatever is broad-leafed\nloses its leaves’—does identify a co-extensive\nrelationship between subject and predicate. It may thus serve as a\nproper scientific explanandum, and ‘broad-leafed’\ncan serve to identify a kind, all and only the members of which lose\ntheir\n leaves.[3]\n Thus, the middle term of the preliminary explanation becomes the\nsubject of a more basic, co-extensive predication. The cause\nof broad-leafed trees losing their leaves will, then, be something\nmore fundamental about broad-leafed trees, here identified as the\nsolidification of moisture at the leaf juncture, which can thus serve\nas the middle term in a causal explanation of this fact. But it will\nalso serve as part of a definition of leaf loss.\n\nThe middle is the account of the first major term [i.e. the predicate\nin the conclusion], for which reason all the sciences come about\nthrough definition. (APo. II 17, 99a22–23)\n\n\nThat is, we will have, if our research goes well, an account of what\nloss of leaves is. Along the way a process of identifying the kind,\nall and only the members of which will lose their leaves due to sap\ncoagulation, is assumed. Yet the Analytics provides no\nsystematic discussion about whether there are general criteria for\nidentifying these basic scientific kinds. As we will see, this is the\ntopic of one of the most interesting sections of On the Parts of\nAnimals, book I.\n\nThere are two quite different questions we need to ask about how these\nideas about inquiry and explanation in the Analytics are\nrelated to Aristotle’s investigations of animals: first, how is\nthe philosophy of biology presented in PA I related\nto the general account of explanation, definition and inquiry in the\nPosterior\n Analytics[4];\n and second, to what extent do the treatises reporting his actual\ninvestigations of animals conform either to his general account of\nscientific knowledge and inquiry in APo., or to the norms\nregarding the study of animals laid down in PA I. The\nremainder of this entry will be organized around these two\nquestions.\n",
    "section_title": "2. Aristotle’s Philosophy of Science",
    "entry_title": "Aristotle’s Biology",
    "hierarchy_title": "Aristotle’s Biology || Aristotle’s Philosophy of Science",
    "tokenized_text": [
        "aristotle",
        "philosophy",
        "science",
        "aristotle",
        "philosophy",
        "science",
        "section",
        "explore",
        "way",
        "aristotle",
        "systematically",
        "organizes",
        "explains",
        "extraordinary",
        "body",
        "information",
        "animal",
        "anatomy",
        "physiology",
        "development",
        "aristotle",
        "able",
        "accomplish",
        "zoology",
        "given",
        "great",
        "deal",
        "thought",
        "nature",
        "scientific",
        "inquiry",
        "one",
        "progress",
        "superficial",
        "unorganized",
        "state",
        "everyday",
        "experience",
        "toward",
        "organized",
        "scientific",
        "knowledge",
        "answer",
        "question",
        "need",
        "concept",
        "goal",
        "achieved",
        "aristotle",
        "developed",
        "concept",
        "prior",
        "posterior",
        "analytics",
        "henceforth",
        "abbreviated",
        "apr",
        "apo",
        "respectively",
        "goal",
        "scientific",
        "inquiry",
        "argued",
        "system",
        "concept",
        "proposition",
        "organized",
        "hierarchically",
        "ultimately",
        "resting",
        "knowledge",
        "essential",
        "nature",
        "object",
        "study",
        "certain",
        "necessary",
        "first",
        "principle",
        "definition",
        "principle",
        "form",
        "basis",
        "causal",
        "explanation",
        "universal",
        "truth",
        "within",
        "domain",
        "study",
        "universal",
        "truth",
        "identify",
        "attribute",
        "belonging",
        "subject",
        "per",
        "se",
        "virtue",
        "subject",
        "nature",
        "example",
        "us",
        "introduces",
        "account",
        "scientific",
        "demonstration",
        "illustrate",
        "proposition",
        "geometry",
        "interior",
        "angle",
        "equal",
        "two",
        "right",
        "angle",
        "belongs",
        "triangle",
        "virtue",
        "triangle",
        "apo",
        "attribute",
        "belongs",
        "equilateral",
        "triangle",
        "wellnot",
        "however",
        "equilateral",
        "triangle",
        "thus",
        "scientific",
        "knowledge",
        "proposition",
        "knowledge",
        "display",
        "reason",
        "triangle",
        "property",
        "must",
        "explain",
        "property",
        "belongs",
        "triangle",
        "explanation",
        "course",
        "appeal",
        "essential",
        "character",
        "threesided",
        "rectilinear",
        "plane",
        "figure",
        "ie",
        "triangle",
        "second",
        "book",
        "posterior",
        "analytics",
        "discus",
        "achieve",
        "goal",
        "scientific",
        "knowledge",
        "one",
        "central",
        "concern",
        "knowledge",
        "essence",
        "expressed",
        "definition",
        "related",
        "explanation",
        "expressed",
        "form",
        "causal",
        "demonstration",
        "plato",
        "formulated",
        "famous",
        "paradox",
        "inquiry",
        "dialogue",
        "meno",
        "either",
        "know",
        "object",
        "inquiry",
        "case",
        "inquiry",
        "unnecessary",
        "know",
        "object",
        "inquiry",
        "case",
        "inquiry",
        "impossible",
        "meno",
        "de",
        "aristotle",
        "reminds",
        "u",
        "paradox",
        "first",
        "chapter",
        "posterior",
        "analytics",
        "full",
        "solution",
        "emerges",
        "book",
        "ii",
        "argues",
        "perceptual",
        "experience",
        "give",
        "u",
        "grasp",
        "target",
        "inquiry",
        "though",
        "count",
        "scientific",
        "knowledge",
        "serve",
        "direct",
        "inquiry",
        "begin",
        "discussion",
        "presenting",
        "u",
        "claim",
        "object",
        "inquiry",
        "linked",
        "object",
        "scientific",
        "knowledge",
        "thing",
        "inquire",
        "equal",
        "number",
        "thing",
        "know",
        "scientifically",
        "inquire",
        "four",
        "thing",
        "fact",
        "reason",
        "something",
        "something",
        "apo",
        "ii",
        "b",
        "aristotle",
        "conceives",
        "four",
        "inquiry",
        "paired",
        "natural",
        "sequence",
        "pair",
        "knowing",
        "state",
        "affair",
        "case",
        "inquire",
        "reason",
        "case",
        "know",
        "fact",
        "inquire",
        "reason",
        "eg",
        "knowing",
        "eclipsed",
        "earth",
        "move",
        "inquire",
        "reason",
        "eclipsed",
        "earth",
        "move",
        "apo",
        "ii",
        "b",
        "similarly",
        "conclude",
        "inquiry",
        "whether",
        "something",
        "exists",
        "go",
        "investigate",
        "nature",
        "come",
        "know",
        "inquire",
        "eg",
        "god",
        "man",
        "apo",
        "ii",
        "b",
        "example",
        "reveal",
        "distinction",
        "structure",
        "much",
        "discussion",
        "next",
        "ten",
        "chapter",
        "look",
        "factual",
        "inquiry",
        "concern",
        "whether",
        "attribute",
        "belongs",
        "subject",
        "movement",
        "earth",
        "eclipse",
        "moon",
        "search",
        "reason",
        "search",
        "causal",
        "explanation",
        "attribute",
        "belonging",
        "subject",
        "contrast",
        "look",
        "like",
        "move",
        "move",
        "establishing",
        "existence",
        "subject",
        "god",
        "man",
        "establishing",
        "however",
        "distinction",
        "turn",
        "clearcut",
        "begun",
        "illustrate",
        "distinction",
        "inquiry",
        "whether",
        "something",
        "question",
        "whether",
        "centaur",
        "god",
        "characterizes",
        "knowledge",
        "achieved",
        "knowing",
        "second",
        "chapter",
        "begin",
        "link",
        "two",
        "sequence",
        "inquiry",
        "mean",
        "syllogistic",
        "concept",
        "middle",
        "term",
        "term",
        "common",
        "two",
        "premise",
        "syllogistic",
        "proof",
        "thus",
        "result",
        "research",
        "seek",
        "either",
        "middle",
        "term",
        "middle",
        "term",
        "middle",
        "term",
        "cause",
        "every",
        "case",
        "sought",
        "apo",
        "ii",
        "a",
        "valid",
        "syllogistic",
        "inference",
        "middle",
        "term",
        "shared",
        "premise",
        "warrant",
        "conclusion",
        "scientific",
        "explanation",
        "however",
        "middle",
        "term",
        "must",
        "also",
        "identify",
        "cause",
        "fact",
        "given",
        "conclusionwhat",
        "term",
        "identifies",
        "causal",
        "link",
        "subject",
        "attribute",
        "use",
        "another",
        "common",
        "example",
        "seek",
        "explain",
        "periodic",
        "sound",
        "noise",
        "cloud",
        "middle",
        "term",
        "must",
        "identify",
        "cause",
        "connection",
        "noise",
        "cloud",
        "moreover",
        "aristotle",
        "account",
        "relationship",
        "causal",
        "demonstration",
        "scientific",
        "definition",
        "knowing",
        "cause",
        "thunder",
        "time",
        "knowing",
        "essence",
        "thunder",
        "thunder",
        "really",
        "difference",
        "saying",
        "thunder",
        "thunder",
        "one",
        "case",
        "say",
        "fire",
        "extinguished",
        "cloud",
        "thunder",
        "a",
        "noise",
        "fire",
        "extinguished",
        "cloud",
        "hence",
        "account",
        "given",
        "different",
        "way",
        "one",
        "way",
        "continuous",
        "demonstration",
        "definition",
        "apo",
        "ii",
        "a",
        "apo",
        "aristotle",
        "return",
        "regularly",
        "standard",
        "example",
        "natural",
        "phenomenon",
        "thunder",
        "eclipsesbut",
        "also",
        "importantly",
        "provides",
        "extended",
        "biological",
        "example",
        "seasonal",
        "loss",
        "leaf",
        "broadleafed",
        "plant",
        "ch",
        "aristotle",
        "imago",
        "inquiry",
        "begin",
        "question",
        "fig",
        "tree",
        "grape",
        "vine",
        "lose",
        "leaf",
        "model",
        "answer",
        "broadleafed",
        "inquiry",
        "seek",
        "feature",
        "common",
        "kind",
        "related",
        "target",
        "inquiry",
        "seasonal",
        "loss",
        "leaf",
        "however",
        "preliminaryit",
        "best",
        "see",
        "broadleafed",
        "step",
        "toward",
        "causal",
        "explanation",
        "chapter",
        "pick",
        "example",
        "context",
        "arguing",
        "basic",
        "scientific",
        "inquiry",
        "seek",
        "wherever",
        "possible",
        "coextensive",
        "predication",
        "leaf",
        "loss",
        "fig",
        "tree",
        "leaf",
        "loss",
        "grape",
        "vine",
        "candidate",
        "major",
        "premise",
        "however",
        "whatever",
        "broadleafed",
        "loses",
        "leaf",
        "does",
        "identify",
        "coextensive",
        "relationship",
        "subject",
        "predicate",
        "may",
        "thus",
        "serve",
        "proper",
        "scientific",
        "explanandum",
        "broadleafed",
        "serve",
        "identify",
        "kind",
        "member",
        "lose",
        "leaf",
        "thus",
        "middle",
        "term",
        "preliminary",
        "explanation",
        "becomes",
        "subject",
        "basic",
        "coextensive",
        "predication",
        "cause",
        "broadleafed",
        "tree",
        "losing",
        "leaf",
        "something",
        "fundamental",
        "broadleafed",
        "tree",
        "identified",
        "solidification",
        "moisture",
        "leaf",
        "juncture",
        "thus",
        "serve",
        "middle",
        "term",
        "causal",
        "explanation",
        "fact",
        "also",
        "serve",
        "part",
        "definition",
        "leaf",
        "loss",
        "middle",
        "account",
        "first",
        "major",
        "term",
        "ie",
        "predicate",
        "conclusion",
        "reason",
        "science",
        "come",
        "definition",
        "apo",
        "ii",
        "a",
        "research",
        "go",
        "well",
        "account",
        "loss",
        "leaf",
        "along",
        "way",
        "process",
        "identifying",
        "kind",
        "member",
        "lose",
        "leaf",
        "due",
        "sap",
        "coagulation",
        "assumed",
        "yet",
        "analytics",
        "provides",
        "systematic",
        "discussion",
        "whether",
        "general",
        "criterion",
        "identifying",
        "basic",
        "scientific",
        "kind",
        "see",
        "topic",
        "one",
        "interesting",
        "section",
        "part",
        "animal",
        "book",
        "i",
        "two",
        "quite",
        "different",
        "question",
        "need",
        "ask",
        "idea",
        "inquiry",
        "explanation",
        "analytics",
        "related",
        "aristotle",
        "investigation",
        "animal",
        "first",
        "philosophy",
        "biology",
        "presented",
        "pa",
        "related",
        "general",
        "account",
        "explanation",
        "definition",
        "inquiry",
        "posterior",
        "analytics",
        "second",
        "extent",
        "treatise",
        "reporting",
        "actual",
        "investigation",
        "animal",
        "conform",
        "either",
        "general",
        "account",
        "scientific",
        "knowledge",
        "inquiry",
        "apo",
        "norm",
        "regarding",
        "study",
        "animal",
        "laid",
        "pa",
        "i",
        "remainder",
        "entry",
        "organized",
        "around",
        "two",
        "question"
    ]
}