{
    "main_text": "On Poets: How to Judge Poetry?\n1. On Poets: How to Judge Poetry?\n\nThis work, a dialogue in three books, was apparently quite widely read\nin the ancient world. While the Poetics seems to have\nreceived no echo in antiquity, On Poets seems to have\nacquired the status of a reference work on Aristotle’s\naesthetics; the fragments that we have come from a wide array of\nsources, including Philodemus, Ps-Plutarch, Athenaeus, Diogenes\nLaertius, Macrobius, and Proclus. Many fragments deal with\nentertaining stories such as the birth and death of Homer, or the\npresentation of the rivalries between the poets. However, it would be\na mistake to draw the conclusion that the whole work would have\nconsisted of such stories without any theoretical background.\nActually, two topics that are crucial in the Poetics seem to\nhave been central in On Poets as well: mimesis and\nthe shortcomings of poets.\n\nWhen opening the Poetics, the reader is struck by the\nrepetition of the word mimêsis (and the verb\nmimeisthai), to the point that it defines what is (what we\ncall) a work of art. Very roughly, one might say that the word\nmimêsis has both a static, or “pictorial”\naspect, and a “dynamic”, or “theatrical”\naspect. According to its “pictorial” aspect,\nmimêsis designates the fact that in such and such\nmimetic work, the receiver recognizes a resemblance. In the\nPoetics, Aristotle gives us a very telling example in evoking\na painting or a sculpture in front of which the beholder recognizes,\nabout a character represented, that “such and such a character\nis so-and-so” (4, 1448b17). According to its\n“dynamic” aspect, it is rather the behavior of the one who\nmakes a mimêsis, which may range from the mimicking of\nnoises or gestures to theater enactment. In Latin,\nmimêsis was rendered as imitatio, which indeed\ncould include both meanings; but the English “imitation”\nhardly works, and perhaps the best solution after all is to keep the\nGreek term, transliterated as “mimesis”\n(“representation”, or “depiction”, works for\nthe first connotation, but hardly for the second). Of course, often\nthe use of the word, especially in poetry, includes both connotations:\na play is a mimesis both in the sense of an enactment of some\nactions that are made by the characters of the play, and we can also\nrecognize them as being the actions of such-and-such characters.\nTraditionally, a poetic work was defined in its opposition to prose,\nby versification (see, e.g., Gorgias’ definition of poetry:\n“I consider and call poetry every speech that possesses\nmeter”, Helen 8). Aristotle opposes that idea, on the\ngrounds that it does not allow us to understand the specificity of a\npoetic work, by giving the example of Empedocles “who has\nnothing in common with Homer except for the metric form”\n(Poetics 1, 1447b17–18): we do not infer from the fact\nthat Empedocles writes in the same kind of verses as Homer that his\nwork is epic poetry! What distinguishes Homer from Empedocles is that\nthe former wrote a mimetic work, whereas Empedocles is a\n“philosopher of nature” (phusiologos, b19), who\ndid not compose a mimesis. This concern is also to be found\nin On Poets, where Aristotle asks this question: \n\n\nAre we not going to say that even though not in verse, the so-called\nmimes of Sophron are works in prose and works of representation, and\nthat the same goes for the dialogues of Alexameneus of Teos, which\nwere written before the Socratic dialogues? (Janko 2011, F44a) \n\n\nSince such written dialogues are meant to be a mimesis of\ndialogues that did, or rather might have taken place, they too must be\nconsidered as a kind of poetry (or what we would call literature).\nAthenaeus, who quotes that question, interprets this as an attack\nagainst Plato: \n\n\nWhile in the Republic Plato expelled Homer and mimetic\npoetry, he himself wrote his dialogues in mimetic form, and he is not\neven the inventor of that genre: before him, Alexamenus of Teos and\nSotion invented that type of work in prose. (Janko 2011, F44a) \n\n\nWe cannot say whether Aristotle also intended this to be an attack\nagainst Plato; and it is important to note that we do not find\nanything like an explicit rebuttal of Plato’s views in the\nfragments we have, but it is difficult not to see in the quoted\nquestion at least a certain irony against Plato’s critique of\nmimesis.\n\nThe first century BC Epicurean philosopher Philodemus wrote a treatise\nalso called On Poetry in which he seems to offer quotations\nor perhaps summaries of some passages of On Poets. What\nAristotle seemed to have focused on is the nature of poetry, and the\nimportance of mimesis (Janko 2011, F4: “mimêsis\nhas been posited as essential to the art of poetry”). And he\nseems to have clearly stated that mimesis, at least in the case of\npoetry, involves people in action (Janko 2011, F6a: Poets\n“depict the actions of people acting…”), and that\nthis action must be complete (Janko 2011, F45: “The poet is a\nrepresenter of a complete action”), all of which will be\nelaborated upon in the Poetics.\n\nThe second theme that seems to have been central to this dialogue is\nthat of the shortcomings of poets. It is on this theme that Aristotle\nrefers to his dialogue in the Poetics, where he analyzed,\nAristotle puts it, the “many mistakes” that poets can make\n\n\n\nwith regard to what affects the reactions of the public which are\nnecessarily connected to the art of poetic composition. (15,\n1454b15–18) \n\n\nThis sentence has often seemed cryptic. But we find an example of such\na mistake in one of our fragments. It is a passage from the later\nRoman author Macrobius, who quotes an excerpt in Greek assuming that\nhe is quoting Aristotle’s words (ipsa Aristotelis\nverba), and where we see Aristotle denouncing an error of\nEuripides, who in one of his plays states that Aetolian warriors\nfought without sandals on their left foot. It is an error because\nthose warriors habitually fought without sandals on their right foot.\nAs benign as it may seem from a historical point of view, it is a deep\nflaw if one considers the impact on spectators. Imagine that\nspectators realize the error in a theater setting: the scene would no\nlonger be tragic, and the error would become comical and provoke\nlaughter.\n\nThis topic is not at all marginal. On the contrary, pointing out the\nmistakes that poets, even the best ones, commit should help us readers\ntell the difference between good and bad poetry (or at least good and\nbad passages or scenes in a poem or play), that is, to make us\n“critical” readers of poetry, or watchers of theater\nplays. It is the first century AD rhetorician Dio Chrysostom who\nreports a tradition according to which Aristotle was “at the\norigin of literary criticism (kritikê)” (Janko\n2011, T4). By that, he surely meant primarily the work of scholars\nsuch as Aristarchus of Samothrace, which consisted in commenting on\nHomer’s epics, or of those who commented on Aristophanes; but\nsuch kinds of works made sense only if one supposes that\ndiscriminating or judging (which is the core meaning of the verb\nkrinein) the qualities and defects of such and such a\nliterary work is what is at stake. And that activity, as we can see\nfrom On Poets, was not a domain reserved to the academic\nhappy few. Rather, every educated person could be expected to engage\nin such critical assessment. In his Protagoras, Plato makes\nthe famous sophist state: \n\n\nIn my opinion, the most important part of a man’s education\nconsists in being proficient in poetry, that is, in being able to\nunderstand, in the productions of poets, those that are correctly made\nand those that are not, in knowing how to distinguish between them,\nand in knowing how to give an account of these judgments, if asked.\n(338e–339a) \n\n\nPlato certainly mocks such a claim, just as, in the Ion, he\nmocks the rhapsode who believes he possesses a “science of\npoetry” or a “technique of poetic composition” (in\n532c, Plato equivalently uses the words technê and\nepistêmê poiêtikê, or simply\npoiêtikê). In writing a “Treatise on poetic\ncomposition” (Peri poiêtikês), we can\nhypothesize that, unlike Plato, Aristotle followed the path indicated\nby Protagoras. And in publishing a more accessible work such as On\nPoets, Aristotle seems to take it for granted that every person\nshould be offered the opportunity to become a good judge of poetry so\nthat she can better appreciate the value of the poetry she reads or\nthe plays she regularly goes to see in the theater.\n [3]\n (Note that in Aristotle’s time, many tragic and comic authors\nwere still writing numerous plays, and that several of the plays of\nAeschylus, Sophocles, or Euripides were available in book form, and\nwere also regularly staged in Athens and elsewhere in the Greek\nworld).\n",
    "section_title": "1. On Poets: How to Judge Poetry?",
    "entry_title": "Aristotle’s Aesthetics",
    "hierarchy_title": "Aristotle’s Aesthetics || On Poets: How to Judge Poetry?",
    "tokenized_text": [
        "poet",
        "judge",
        "poetry",
        "poet",
        "judge",
        "poetry",
        "work",
        "dialogue",
        "three",
        "book",
        "apparently",
        "quite",
        "widely",
        "read",
        "ancient",
        "world",
        "poetics",
        "seems",
        "received",
        "echo",
        "antiquity",
        "poet",
        "seems",
        "acquired",
        "status",
        "reference",
        "work",
        "aristotle",
        "aesthetic",
        "fragment",
        "come",
        "wide",
        "array",
        "source",
        "including",
        "philodemus",
        "psplutarch",
        "athenaeus",
        "diogenes",
        "laertius",
        "macrobius",
        "proclus",
        "many",
        "fragment",
        "deal",
        "entertaining",
        "story",
        "birth",
        "death",
        "homer",
        "presentation",
        "rivalry",
        "poet",
        "however",
        "would",
        "mistake",
        "draw",
        "conclusion",
        "whole",
        "work",
        "would",
        "consisted",
        "story",
        "without",
        "theoretical",
        "background",
        "actually",
        "two",
        "topic",
        "crucial",
        "poetics",
        "seem",
        "central",
        "poet",
        "well",
        "mimesis",
        "shortcoming",
        "poet",
        "opening",
        "poetics",
        "reader",
        "struck",
        "repetition",
        "word",
        "mimêsis",
        "verb",
        "mimeisthai",
        "point",
        "defines",
        "call",
        "work",
        "art",
        "roughly",
        "one",
        "might",
        "say",
        "word",
        "mimêsis",
        "static",
        "pictorial",
        "aspect",
        "dynamic",
        "theatrical",
        "aspect",
        "according",
        "pictorial",
        "aspect",
        "mimêsis",
        "designates",
        "fact",
        "mimetic",
        "work",
        "receiver",
        "recognizes",
        "resemblance",
        "poetics",
        "aristotle",
        "give",
        "u",
        "telling",
        "example",
        "evoking",
        "painting",
        "sculpture",
        "front",
        "beholder",
        "recognizes",
        "character",
        "represented",
        "character",
        "soandso",
        "b",
        "according",
        "dynamic",
        "aspect",
        "rather",
        "behavior",
        "one",
        "make",
        "mimêsis",
        "may",
        "range",
        "mimicking",
        "noise",
        "gesture",
        "theater",
        "enactment",
        "latin",
        "mimêsis",
        "rendered",
        "imitatio",
        "indeed",
        "could",
        "include",
        "meaning",
        "english",
        "imitation",
        "hardly",
        "work",
        "perhaps",
        "best",
        "solution",
        "keep",
        "greek",
        "term",
        "transliterated",
        "mimesis",
        "representation",
        "depiction",
        "work",
        "first",
        "connotation",
        "hardly",
        "second",
        "course",
        "often",
        "use",
        "word",
        "especially",
        "poetry",
        "includes",
        "connotation",
        "play",
        "mimesis",
        "sense",
        "enactment",
        "action",
        "made",
        "character",
        "play",
        "also",
        "recognize",
        "action",
        "suchandsuch",
        "character",
        "traditionally",
        "poetic",
        "work",
        "defined",
        "opposition",
        "prose",
        "versification",
        "see",
        "eg",
        "gorgias",
        "definition",
        "poetry",
        "consider",
        "call",
        "poetry",
        "every",
        "speech",
        "posse",
        "meter",
        "helen",
        "aristotle",
        "opposes",
        "idea",
        "ground",
        "allow",
        "u",
        "understand",
        "specificity",
        "poetic",
        "work",
        "giving",
        "example",
        "empedocles",
        "nothing",
        "common",
        "homer",
        "except",
        "metric",
        "form",
        "poetics",
        "b",
        "infer",
        "fact",
        "empedocles",
        "writes",
        "kind",
        "verse",
        "homer",
        "work",
        "epic",
        "poetry",
        "distinguishes",
        "homer",
        "empedocles",
        "former",
        "wrote",
        "mimetic",
        "work",
        "whereas",
        "empedocles",
        "philosopher",
        "nature",
        "phusiologos",
        "b",
        "compose",
        "mimesis",
        "concern",
        "also",
        "found",
        "poet",
        "aristotle",
        "asks",
        "question",
        "going",
        "say",
        "even",
        "though",
        "verse",
        "socalled",
        "mime",
        "sophron",
        "work",
        "prose",
        "work",
        "representation",
        "go",
        "dialogue",
        "alexameneus",
        "teos",
        "written",
        "socratic",
        "dialogue",
        "janko",
        "fa",
        "since",
        "written",
        "dialogue",
        "meant",
        "mimesis",
        "dialogue",
        "rather",
        "might",
        "taken",
        "place",
        "must",
        "considered",
        "kind",
        "poetry",
        "would",
        "call",
        "literature",
        "athenaeus",
        "quote",
        "question",
        "interprets",
        "attack",
        "plato",
        "republic",
        "plato",
        "expelled",
        "homer",
        "mimetic",
        "poetry",
        "wrote",
        "dialogue",
        "mimetic",
        "form",
        "even",
        "inventor",
        "genre",
        "alexamenus",
        "teos",
        "sotion",
        "invented",
        "type",
        "work",
        "prose",
        "janko",
        "fa",
        "say",
        "whether",
        "aristotle",
        "also",
        "intended",
        "attack",
        "plato",
        "important",
        "note",
        "find",
        "anything",
        "like",
        "explicit",
        "rebuttal",
        "plato",
        "view",
        "fragment",
        "difficult",
        "see",
        "quoted",
        "question",
        "least",
        "certain",
        "irony",
        "plato",
        "critique",
        "mimesis",
        "first",
        "century",
        "bc",
        "epicurean",
        "philosopher",
        "philodemus",
        "wrote",
        "treatise",
        "also",
        "called",
        "poetry",
        "seems",
        "offer",
        "quotation",
        "perhaps",
        "summary",
        "passage",
        "poet",
        "aristotle",
        "seemed",
        "focused",
        "nature",
        "poetry",
        "importance",
        "mimesis",
        "janko",
        "f",
        "mimêsis",
        "posited",
        "essential",
        "art",
        "poetry",
        "seems",
        "clearly",
        "stated",
        "mimesis",
        "least",
        "case",
        "poetry",
        "involves",
        "people",
        "action",
        "janko",
        "fa",
        "poet",
        "depict",
        "action",
        "people",
        "acting",
        "action",
        "must",
        "complete",
        "janko",
        "f",
        "poet",
        "representer",
        "complete",
        "action",
        "elaborated",
        "upon",
        "poetics",
        "second",
        "theme",
        "seems",
        "central",
        "dialogue",
        "shortcoming",
        "poet",
        "theme",
        "aristotle",
        "refers",
        "dialogue",
        "poetics",
        "analyzed",
        "aristotle",
        "put",
        "many",
        "mistake",
        "poet",
        "make",
        "regard",
        "affect",
        "reaction",
        "public",
        "necessarily",
        "connected",
        "art",
        "poetic",
        "composition",
        "b",
        "sentence",
        "often",
        "seemed",
        "cryptic",
        "find",
        "example",
        "mistake",
        "one",
        "fragment",
        "passage",
        "later",
        "roman",
        "author",
        "macrobius",
        "quote",
        "excerpt",
        "greek",
        "assuming",
        "quoting",
        "aristotle",
        "word",
        "ipsa",
        "aristotelis",
        "verba",
        "see",
        "aristotle",
        "denouncing",
        "error",
        "euripides",
        "one",
        "play",
        "state",
        "aetolian",
        "warrior",
        "fought",
        "without",
        "sandal",
        "left",
        "foot",
        "error",
        "warrior",
        "habitually",
        "fought",
        "without",
        "sandal",
        "right",
        "foot",
        "benign",
        "may",
        "seem",
        "historical",
        "point",
        "view",
        "deep",
        "flaw",
        "one",
        "considers",
        "impact",
        "spectator",
        "imagine",
        "spectator",
        "realize",
        "error",
        "theater",
        "setting",
        "scene",
        "would",
        "longer",
        "tragic",
        "error",
        "would",
        "become",
        "comical",
        "provoke",
        "laughter",
        "topic",
        "marginal",
        "contrary",
        "pointing",
        "mistake",
        "poet",
        "even",
        "best",
        "one",
        "commit",
        "help",
        "u",
        "reader",
        "tell",
        "difference",
        "good",
        "bad",
        "poetry",
        "least",
        "good",
        "bad",
        "passage",
        "scene",
        "poem",
        "play",
        "make",
        "u",
        "critical",
        "reader",
        "poetry",
        "watcher",
        "theater",
        "play",
        "first",
        "century",
        "ad",
        "rhetorician",
        "dio",
        "chrysostom",
        "report",
        "tradition",
        "according",
        "aristotle",
        "origin",
        "literary",
        "criticism",
        "kritikê",
        "janko",
        "t",
        "surely",
        "meant",
        "primarily",
        "work",
        "scholar",
        "aristarchus",
        "samothrace",
        "consisted",
        "commenting",
        "homer",
        "epic",
        "commented",
        "aristophanes",
        "kind",
        "work",
        "made",
        "sense",
        "one",
        "supposes",
        "discriminating",
        "judging",
        "core",
        "meaning",
        "verb",
        "krinein",
        "quality",
        "defect",
        "literary",
        "work",
        "stake",
        "activity",
        "see",
        "poet",
        "domain",
        "reserved",
        "academic",
        "happy",
        "rather",
        "every",
        "educated",
        "person",
        "could",
        "expected",
        "engage",
        "critical",
        "assessment",
        "protagoras",
        "plato",
        "make",
        "famous",
        "sophist",
        "state",
        "opinion",
        "important",
        "part",
        "man",
        "education",
        "consists",
        "proficient",
        "poetry",
        "able",
        "understand",
        "production",
        "poet",
        "correctly",
        "made",
        "knowing",
        "distinguish",
        "knowing",
        "give",
        "account",
        "judgment",
        "asked",
        "ea",
        "plato",
        "certainly",
        "mock",
        "claim",
        "ion",
        "mock",
        "rhapsode",
        "belief",
        "posse",
        "science",
        "poetry",
        "technique",
        "poetic",
        "composition",
        "c",
        "plato",
        "equivalently",
        "us",
        "word",
        "technê",
        "epistêmê",
        "poiêtikê",
        "simply",
        "poiêtikê",
        "writing",
        "treatise",
        "poetic",
        "composition",
        "peri",
        "poiêtikês",
        "hypothesize",
        "unlike",
        "plato",
        "aristotle",
        "followed",
        "path",
        "indicated",
        "protagoras",
        "publishing",
        "accessible",
        "work",
        "poet",
        "aristotle",
        "seems",
        "take",
        "granted",
        "every",
        "person",
        "offered",
        "opportunity",
        "become",
        "good",
        "judge",
        "poetry",
        "better",
        "appreciate",
        "value",
        "poetry",
        "read",
        "play",
        "regularly",
        "go",
        "see",
        "theater",
        "note",
        "aristotle",
        "time",
        "many",
        "tragic",
        "comic",
        "author",
        "still",
        "writing",
        "numerous",
        "play",
        "several",
        "play",
        "aeschylus",
        "sophocles",
        "euripides",
        "available",
        "book",
        "form",
        "also",
        "regularly",
        "staged",
        "athens",
        "elsewhere",
        "greek",
        "world"
    ]
}