{
    "main_text": "Arnauld and Malebranche || Two themes in Arnauld’s criticism of the Treatise of Nature and Grace\n4.2 Two themes in Arnauld’s criticism of the Treatise of Nature and Grace\n\nArnauld thought that Malebranche’s position was dangerous, and\nthat if accepted it would have ruinous consequences for the Catholic\nfaith. He was “furious,” as Denis Moreau has aptly said,\n“and decided to leave nothing standing in a philosophy that\nclearly frightened him” (Moreau 1999, 240). Here only the\ngeneral lines of Arnauld’s attack are set forth. First, two\npervasive themes in Arnauld’s criticism are described: (1) that\nMalebranche often did not proceed by the proper method of either\nphilosophy or theology; and (2) that Malebranche speaks of God in\nanthropomorphic terms, as if He were subject to the limitations of a\nhuman\n agent.[20]\n Then Arnauld’s criticisms of Malebranche’s position that\nGod acts by “general volitions” will be discussed.\n\n1. Throughout Réflexions, beginning with the\n“Avant-Propos” to the work, Arnauld challenges Malebranche\nto make clear whether his claims are based on reason or on Scripture\nand\n tradition.[21]\n He had mounted this sort of challenge even earlier, in\nIdeas:\n\nHe does not say that he learned those grand maxims on which all of\nthat [Treatise of Nature and Grace] turns by the revelation\nof God: that if God wills to act externally, it is because He\nwills to obtain an honor worthy of Himself; that He acts by the\nsimplest ways; that He does not act by particular volitions; but by\ngeneral volitions which are determined by occasional causes\n(Ideas, 174).\n\n\nNor could all of those maxims be demonstrated, in Malebranche’s\nsense of the term. For Malebranche says that only necessary truths can\nbe demonstrated, and yet he admits that God does sometimes act by\nparticular volitions, namely, when He performs miracles. Hence\nMalebranche himself would have to admit that the third maxim, at\nleast, is not demonstrable. In Arnauld’s view, Malebranche came\nto accept such principles because he thought they made God more\nloveable and hence were favorable to the cause of religion. In this\nway Malebranche introduces, on the basis of religious considerations,\nprinciples that are not found in Scripture and tradition.\n\nArnauld thought that this unholy introduction of religion into what\nought to be treated as philosophical questions began with\nMalebranche’s theory of ideas, according to which “we see\nall things in God.” Thus, in the “Conclusion” of his\nDéfense contre la Réponse au livre des vraies et des\nfausses Idées (OA, 38, 367–668; hereinafter\nDéfense), Arnauld takes up “two or three\nobjections” that might be raised against Ideas. The\nsecond objection is one that had been raised by Nicole: “I could\nhave avoided this philosophical topic [of the nature of ideas] so as\nnot to interrupt what I had begun to write about the Treatise of\nNature and Grace.” In reply, Arnauld says,\n\nWhat was at the outset a question of philosophy … is not such\nfor [Malebranche]. For him it is a question of theology, very sublime\nand very elevated. He considers it a religious duty to devote his\nwhole mind to its defense. He finds it bad that others should disagree\nwith him, and even says that anyone who is not of his opinion must be\n‘either an unenlightened philosopher or a man insensitive to his\nduties.’ Thus he has changed the form of the dispute. He has\ninvolved religion, and has become so devoted to his novel thoughts as\nto hold that anyone who does not approve of them lacks respect for the\nwisdom of God Himself. (Défense, OA, 38:666)\n\n\nIn Arnauld’s direct attack on TNG, he says again and\nagain that Malebranche relies on principles that have neither a proper\ntheological basis in Scripture and tradition, nor a proper\nphilosophical basis in reason. Clearly he thought that this criticism\napplied as well to Malebranche’s theory of ideas. But if Arnauld\ntook seriously the remark at the beginning of the Logic,\n“The reflections we can make on our ideas are perhaps the most\nimportant part of logic, since they are the foundation of everything\nelse,” he may well have thought that Malebranche’s theory\nof ideas was an important source of the confusion of theology with\nphilosophy that plagues TNG. That, in turn, would help\nexplain his decision to begin his attack on TNG with a\ntreatise on the nature of\n ideas.[22]\n\n2. Arnauld agreed with Malebranche that God’s will is\nreasonable, but he disagreed with Malebranche’s way of\nconceiving God’s\n reasonableness.[23]\n In both Book I and Book II of Réflexions, he tries to\nshow that Malebranche conceives of God’s reasonableness as if it\nwere the reasonableness of a human being. In the second chapter of\nBook I, he reports a series of arguments given by Malebranche early in\nTNG for the conclusion that God acts in the order of nature\nonly by general volitions. These arguments, says Arnauld, are\n“only comparisons with men, which … cannot prove anything\nwith regard to God; or popular thoughts not worthy … of a\nphilosopher” (OA, 39:188). For example, Malebranche\nsays that God decides to create that which can be produced and\nconserved by the simplest laws because he is an excellent workman, and\n“an excellent workman … does not do by complicated ways\nwhat he could carry out by simpler ones” (TNG,\nOM, 5:28). Arnauld objects that there is no similarity\nbetween an excellent human workman and God,\n\nsince all the ways of executing His plans are equally easy for Him,\nand ‘His power,’ as the author [Malebranche] recognizes,\n‘makes Him so much the master of all things, and so independent\nof help from elsewhere, that it suffices that He will, in order for\nHis volitions to be carried out’ (OA, 39:189–90).\n\n\nHence God’s volitions are not based on reasoning about the means\nto achieve a desired end.\n\nBook II of Réflexions, which deals with God’s\nway of acting in the order of grace, opens with a related criticism.\nArnauld begins by analyzing a line of thought that Malebranche\npresents in the Troisième Eclaircissement to\nTNG (OA, 39:425–51). The line of thought\nbegins with two claims: that “God can act only for Himself. If\nHe wills to act, it is because He wills to procure an honor worthy of\nHimself” and that “God can receive an honor worthy of\nHimself only from Himself.” Yet I am created, so I must be able\nto render to God an honor worthy of Him. This I can do, says\nMalebranche, only by becoming a part of the Church, of which the\nIncarnate Second Person of the Trinity is the cornerstone. More\ngenerally, “God’s great plan is to build in His own honor\na spiritual temple, of which Jesus Christ is the cornerstone …\nHis plan is that this Temple should be as large and perfect as\npossible.” Malebranche then draws an important conclusion:\n\nGod wills that all men enter into this spiritual building, to enlarge\nit. God wills that all men be saved … God also hopes\nthat men will merit outstanding degrees of glory: His will is our\nsanctification. (OM, 5:183)\n\n\nBut although God wants the salvation and sanctification of all men,\n“He loves His wisdom infinitely more,” and His wisdom\nrequires that He act in the way that is wisest and most worthy of\nHimself, that is, in “general, constant and uniform way,”\nwith the result that “He does not save all men, although He\ntruly wills that they all be saved” (OM, 5:185).\n\nArnauld has much to say against that line of thought, and he begins be\nattacking its very first step, the claim that God “can act\nexternally only in order to procure an honor worthy of Himself”\n(OA,\n 39:428–40).[24]\n He objects that this is not a proper way to speak about an infinitely\nperfect being. Once again, Malebranche is guilty of anthropomorphism.\nFor he says, in effect,\n\nthat [God] could resolve to create me, me and the other creatures,\nonly for some advantage He wanted to obtain for Himself by creating\nus…. That is how [Malebranche] lowers [God], by claiming that\nHe cannot decide to create anything externally, except to procure an\nhonor worthy of Himself. (OA, 39:429)\n\n\nArnauld goes on to contrast Malebranche’s way of describing\nGod’s creation with that of St. Thomas, who say that the reason\nGod creates is that His goodness tends to overflow and communicate\nitself to other\n things.[25]\n\nArnauld also says that to speak about God as consulting His\nwisdom before acting is to speak about God as one would about a human\nbeing who wills an end and is thereby caused to will the means to that\nend (OA, 39:432). It is to compare God to a man who consults\nhis wisdom about everything he wants to do “as if he were afraid\nof not acting well, and his will needed to be ruled by something other\nthan itself in order to do only what is good” (OA,\n39:599–600). “Is it an expression of rigorous\nexactitude to say of God that He consults His wisdom,\nand that is how it comes about that everything He wills is\nwise,” Arnauld asks,\n\nas if the word consult is suitable for an infinitely perfect\nbeing when one professes not to speak in popular language? As if God\nneeded to consult His wisdom so that what He wills should be wise? As\nif His will were not His wisdom? As if everything He wills were not\nessentially wise, by virtue of the fact that He wills it?\n(OA, 39:578)\n\n\nGod’s will is not a force that needs to be tamed. The truth,\naccording to Arnauld, is that it is impossible that God should have an\nactual (sincere) will for something that is not in fact wise.\n\nIn a related criticism, Arnauld chides Malebranche for allowing\n“very little freedom and indifference” in God’s\ncreative action. Arnauld quotes Malebranche:\n\nAssuming that God wills to produce outside of Himself a work worthy of\nHimself, He is not indifferent in the choice; He\nought to produce the most perfect work possible by relation to the\nsimplicity of the ways by which He acts; He owes it to Himself to\nfollow the rules of his wisdom. (Quoted by Arnauld at\nRéflexions, OA, 39:598, from TNG,\nOM, 5: 110).\n\n\nMalebranche tries to save for God at least freedom and indifference\nwith regard to creating or not creating. But Arnauld suggests that\nthis move is ruled out by “the way in which he conceives\nGod’s action,” for supposedly, on Malebranche’s\nview, God would consult His wisdom before deciding whether to create\nor not, and just as His wisdom advises Him to create this world rather\nthan a less perfect one, assuming that the two could be created in an\nequally simple way, His wisdom would also advise Him that it is better\nto create than not to create (OA,\n 39:599–600).[26]\n",
    "section_title": "4.2 Two themes in Arnauld’s criticism of the Treatise of Nature and Grace",
    "entry_title": "Antoine Arnauld",
    "hierarchy_title": "Antoine Arnauld || Arnauld and Malebranche || Two themes in Arnauld’s criticism of the Treatise of Nature and Grace",
    "tokenized_text": [
        "arnauld",
        "malebranche",
        "two",
        "theme",
        "arnauld",
        "criticism",
        "treatise",
        "nature",
        "grace",
        "two",
        "theme",
        "arnauld",
        "criticism",
        "treatise",
        "nature",
        "grace",
        "arnauld",
        "thought",
        "malebranche",
        "position",
        "dangerous",
        "accepted",
        "would",
        "ruinous",
        "consequence",
        "catholic",
        "faith",
        "furious",
        "denis",
        "moreau",
        "aptly",
        "said",
        "decided",
        "leave",
        "nothing",
        "standing",
        "philosophy",
        "clearly",
        "frightened",
        "moreau",
        "general",
        "line",
        "arnauld",
        "attack",
        "set",
        "forth",
        "first",
        "two",
        "pervasive",
        "theme",
        "arnauld",
        "criticism",
        "described",
        "malebranche",
        "often",
        "proceed",
        "proper",
        "method",
        "either",
        "philosophy",
        "theology",
        "malebranche",
        "speaks",
        "god",
        "anthropomorphic",
        "term",
        "subject",
        "limitation",
        "human",
        "agent",
        "arnauld",
        "criticism",
        "malebranche",
        "position",
        "god",
        "act",
        "general",
        "volition",
        "discussed",
        "throughout",
        "réflexions",
        "beginning",
        "avantpropos",
        "work",
        "arnauld",
        "challenge",
        "malebranche",
        "make",
        "clear",
        "whether",
        "claim",
        "based",
        "reason",
        "scripture",
        "tradition",
        "mounted",
        "sort",
        "challenge",
        "even",
        "earlier",
        "idea",
        "say",
        "learned",
        "grand",
        "maxim",
        "treatise",
        "nature",
        "grace",
        "turn",
        "revelation",
        "god",
        "god",
        "will",
        "act",
        "externally",
        "will",
        "obtain",
        "honor",
        "worthy",
        "act",
        "simplest",
        "way",
        "act",
        "particular",
        "volition",
        "general",
        "volition",
        "determined",
        "occasional",
        "cause",
        "idea",
        "could",
        "maxim",
        "demonstrated",
        "malebranche",
        "sense",
        "term",
        "malebranche",
        "say",
        "necessary",
        "truth",
        "demonstrated",
        "yet",
        "admits",
        "god",
        "sometimes",
        "act",
        "particular",
        "volition",
        "namely",
        "performs",
        "miracle",
        "hence",
        "malebranche",
        "would",
        "admit",
        "third",
        "maxim",
        "least",
        "demonstrable",
        "arnauld",
        "view",
        "malebranche",
        "came",
        "accept",
        "principle",
        "thought",
        "made",
        "god",
        "loveable",
        "hence",
        "favorable",
        "cause",
        "religion",
        "way",
        "malebranche",
        "introduces",
        "basis",
        "religious",
        "consideration",
        "principle",
        "found",
        "scripture",
        "tradition",
        "arnauld",
        "thought",
        "unholy",
        "introduction",
        "religion",
        "ought",
        "treated",
        "philosophical",
        "question",
        "began",
        "malebranche",
        "theory",
        "idea",
        "according",
        "see",
        "thing",
        "god",
        "thus",
        "conclusion",
        "défense",
        "contre",
        "la",
        "réponse",
        "au",
        "livre",
        "de",
        "vraies",
        "et",
        "de",
        "fausses",
        "idées",
        "oa",
        "hereinafter",
        "défense",
        "arnauld",
        "take",
        "two",
        "three",
        "objection",
        "might",
        "raised",
        "idea",
        "second",
        "objection",
        "one",
        "raised",
        "nicole",
        "could",
        "avoided",
        "philosophical",
        "topic",
        "nature",
        "idea",
        "interrupt",
        "begun",
        "write",
        "treatise",
        "nature",
        "grace",
        "reply",
        "arnauld",
        "say",
        "outset",
        "question",
        "philosophy",
        "malebranche",
        "question",
        "theology",
        "sublime",
        "elevated",
        "considers",
        "religious",
        "duty",
        "devote",
        "whole",
        "mind",
        "defense",
        "find",
        "bad",
        "others",
        "disagree",
        "even",
        "say",
        "anyone",
        "opinion",
        "must",
        "either",
        "unenlightened",
        "philosopher",
        "man",
        "insensitive",
        "duties",
        "thus",
        "changed",
        "form",
        "dispute",
        "involved",
        "religion",
        "become",
        "devoted",
        "novel",
        "thought",
        "hold",
        "anyone",
        "approve",
        "lack",
        "respect",
        "wisdom",
        "god",
        "défense",
        "oa",
        "arnauld",
        "direct",
        "attack",
        "tng",
        "say",
        "malebranche",
        "relies",
        "principle",
        "neither",
        "proper",
        "theological",
        "basis",
        "scripture",
        "tradition",
        "proper",
        "philosophical",
        "basis",
        "reason",
        "clearly",
        "thought",
        "criticism",
        "applied",
        "well",
        "malebranche",
        "theory",
        "idea",
        "arnauld",
        "took",
        "seriously",
        "remark",
        "beginning",
        "logic",
        "reflection",
        "make",
        "idea",
        "perhaps",
        "important",
        "part",
        "logic",
        "since",
        "foundation",
        "everything",
        "else",
        "may",
        "well",
        "thought",
        "malebranche",
        "theory",
        "idea",
        "important",
        "source",
        "confusion",
        "theology",
        "philosophy",
        "plague",
        "tng",
        "turn",
        "would",
        "help",
        "explain",
        "decision",
        "begin",
        "attack",
        "tng",
        "treatise",
        "nature",
        "idea",
        "arnauld",
        "agreed",
        "malebranche",
        "god",
        "reasonable",
        "disagreed",
        "malebranche",
        "way",
        "conceiving",
        "god",
        "reasonableness",
        "book",
        "book",
        "ii",
        "réflexions",
        "try",
        "show",
        "malebranche",
        "conceives",
        "god",
        "reasonableness",
        "reasonableness",
        "human",
        "second",
        "chapter",
        "book",
        "report",
        "series",
        "argument",
        "given",
        "malebranche",
        "early",
        "tng",
        "conclusion",
        "god",
        "act",
        "order",
        "nature",
        "general",
        "volition",
        "argument",
        "say",
        "arnauld",
        "comparison",
        "men",
        "prove",
        "anything",
        "regard",
        "god",
        "popular",
        "thought",
        "worthy",
        "philosopher",
        "oa",
        "example",
        "malebranche",
        "say",
        "god",
        "decides",
        "create",
        "produced",
        "conserved",
        "simplest",
        "law",
        "excellent",
        "workman",
        "excellent",
        "workman",
        "complicated",
        "way",
        "could",
        "carry",
        "simpler",
        "one",
        "tng",
        "om",
        "arnauld",
        "object",
        "similarity",
        "excellent",
        "human",
        "workman",
        "god",
        "since",
        "way",
        "executing",
        "plan",
        "equally",
        "easy",
        "power",
        "author",
        "malebranche",
        "recognizes",
        "make",
        "much",
        "master",
        "thing",
        "independent",
        "help",
        "elsewhere",
        "suffices",
        "order",
        "volition",
        "carried",
        "oa",
        "hence",
        "god",
        "volition",
        "based",
        "reasoning",
        "mean",
        "achieve",
        "desired",
        "end",
        "book",
        "ii",
        "réflexions",
        "deal",
        "god",
        "way",
        "acting",
        "order",
        "grace",
        "open",
        "related",
        "criticism",
        "arnauld",
        "begin",
        "analyzing",
        "line",
        "thought",
        "malebranche",
        "present",
        "troisième",
        "eclaircissement",
        "tng",
        "oa",
        "line",
        "thought",
        "begin",
        "two",
        "claim",
        "god",
        "act",
        "will",
        "act",
        "will",
        "procure",
        "honor",
        "worthy",
        "god",
        "receive",
        "honor",
        "worthy",
        "himself",
        "yet",
        "created",
        "must",
        "able",
        "render",
        "god",
        "honor",
        "worthy",
        "say",
        "malebranche",
        "becoming",
        "part",
        "church",
        "incarnate",
        "second",
        "person",
        "trinity",
        "cornerstone",
        "generally",
        "god",
        "great",
        "plan",
        "build",
        "honor",
        "spiritual",
        "temple",
        "jesus",
        "christ",
        "cornerstone",
        "plan",
        "temple",
        "large",
        "perfect",
        "possible",
        "malebranche",
        "draw",
        "important",
        "conclusion",
        "god",
        "will",
        "men",
        "enter",
        "spiritual",
        "building",
        "enlarge",
        "god",
        "will",
        "men",
        "saved",
        "god",
        "also",
        "hope",
        "men",
        "merit",
        "outstanding",
        "degree",
        "glory",
        "sanctification",
        "om",
        "although",
        "god",
        "want",
        "salvation",
        "sanctification",
        "men",
        "love",
        "wisdom",
        "infinitely",
        "wisdom",
        "requires",
        "act",
        "way",
        "wisest",
        "worthy",
        "general",
        "constant",
        "uniform",
        "way",
        "result",
        "save",
        "men",
        "although",
        "truly",
        "will",
        "saved",
        "om",
        "arnauld",
        "much",
        "say",
        "line",
        "thought",
        "begin",
        "attacking",
        "first",
        "step",
        "claim",
        "god",
        "act",
        "externally",
        "order",
        "procure",
        "honor",
        "worthy",
        "oa",
        "object",
        "proper",
        "way",
        "speak",
        "infinitely",
        "perfect",
        "malebranche",
        "guilty",
        "anthropomorphism",
        "say",
        "effect",
        "god",
        "could",
        "resolve",
        "create",
        "creature",
        "advantage",
        "wanted",
        "obtain",
        "creating",
        "us",
        "malebranche",
        "lower",
        "god",
        "claiming",
        "decide",
        "create",
        "anything",
        "externally",
        "except",
        "procure",
        "honor",
        "worthy",
        "oa",
        "arnauld",
        "go",
        "contrast",
        "malebranche",
        "way",
        "describing",
        "god",
        "creation",
        "st",
        "thomas",
        "say",
        "reason",
        "god",
        "creates",
        "goodness",
        "tends",
        "overflow",
        "communicate",
        "thing",
        "arnauld",
        "also",
        "say",
        "speak",
        "god",
        "consulting",
        "wisdom",
        "acting",
        "speak",
        "god",
        "one",
        "would",
        "human",
        "will",
        "end",
        "thereby",
        "caused",
        "mean",
        "end",
        "oa",
        "compare",
        "god",
        "man",
        "consults",
        "wisdom",
        "everything",
        "want",
        "afraid",
        "acting",
        "well",
        "needed",
        "ruled",
        "something",
        "order",
        "good",
        "oa",
        "expression",
        "rigorous",
        "exactitude",
        "say",
        "god",
        "consults",
        "wisdom",
        "come",
        "everything",
        "will",
        "wise",
        "arnauld",
        "asks",
        "word",
        "consult",
        "suitable",
        "infinitely",
        "perfect",
        "one",
        "professes",
        "speak",
        "popular",
        "language",
        "god",
        "needed",
        "consult",
        "wisdom",
        "will",
        "wise",
        "wisdom",
        "everything",
        "will",
        "essentially",
        "wise",
        "virtue",
        "fact",
        "will",
        "oa",
        "god",
        "force",
        "need",
        "tamed",
        "truth",
        "according",
        "arnauld",
        "impossible",
        "god",
        "actual",
        "sincere",
        "something",
        "fact",
        "wise",
        "related",
        "criticism",
        "arnauld",
        "chides",
        "malebranche",
        "allowing",
        "little",
        "freedom",
        "indifference",
        "god",
        "creative",
        "action",
        "arnauld",
        "quote",
        "malebranche",
        "assuming",
        "god",
        "will",
        "produce",
        "outside",
        "work",
        "worthy",
        "indifferent",
        "choice",
        "ought",
        "produce",
        "perfect",
        "work",
        "possible",
        "relation",
        "simplicity",
        "way",
        "act",
        "owes",
        "follow",
        "rule",
        "wisdom",
        "quoted",
        "arnauld",
        "réflexions",
        "oa",
        "tng",
        "om",
        "malebranche",
        "try",
        "save",
        "god",
        "least",
        "freedom",
        "indifference",
        "regard",
        "creating",
        "creating",
        "arnauld",
        "suggests",
        "move",
        "ruled",
        "way",
        "conceives",
        "god",
        "action",
        "supposedly",
        "malebranche",
        "view",
        "god",
        "would",
        "consult",
        "wisdom",
        "deciding",
        "whether",
        "create",
        "wisdom",
        "advises",
        "create",
        "world",
        "rather",
        "le",
        "perfect",
        "one",
        "assuming",
        "two",
        "could",
        "created",
        "equally",
        "simple",
        "way",
        "wisdom",
        "would",
        "also",
        "advise",
        "better",
        "create",
        "create",
        "oa"
    ]
}