{
    "main_text": "Skepticism about Definitions || Skepticisms inspired by views of concepts, history, Marxism, feminism\n3.1 Skepticisms inspired by views of concepts, history, Marxism, feminism\n\n\nA common family of arguments, inspired by Wittgenstein’s\nfamous remarks about games (Wittgenstein 1953), has it that the\nphenomena of art are, by their nature, too diverse to admit of the\nunification that a satisfactory definition strives for, or that a\ndefinition of art, were there to be such a thing, would exert a\nstifling influence on artistic creativity. One expression of this\nimpulse is Weitz’s Open Concept Argument: any concept is\nopen if a case can be imagined which would call for some sort of\ndecision on our part to extend the use of the concept to cover it, or\nto close the concept and invent a new one to deal with the new case;\nall open concepts are indefinable; and there are cases calling for a\ndecision about whether to extend or close the concept of art. Hence art\nis indefinable (Weitz 1956). Against this it is claimed that\nchange does not, in general, rule out the preservation of identity over\ntime, that decisions about concept-expansion may be principled rather\nthan capricious, and that nothing bars a definition of art from\nincorporating a novelty requirement.\n\n\nA second sort of argument, less common today than in the\nheyday of a certain form of extreme Wittgensteinianism, urges that the\nconcepts that make up the stuff of most definitions of art\n(expressiveness, form) are embedded in general philosophical theories\nwhich incorporate traditional metaphysics and epistemology. But since\ntraditional metaphysics and epistemology are prime instances of\nlanguage gone on conceptually confused holiday, definitions of art\nshare in the conceptual confusions of traditional\nphilosophy (Tilghman 1984).\n\n\nA third sort of argument, more historically inflected than the first,\ntakes off from an influential study by the historian of philosophy\nPaul Kristeller, in which he argued that the modern system of the five\nmajor arts [painting, sculpture, architecture, poetry, and music]\nwhich underlies all modern aesthetics … is of comparatively\nrecent origin and did not assume definite shape before the eighteenth\ncentury, although it had many ingredients which go back to classical,\nmediaeval, and Renaissance thought. (Kristeller, 1951) Since that list of five arts is\nsomewhat arbitrary, and since even those five do not share a single\ncommon nature, but rather are united, at best, only by several\noverlapping features, and since the number of art forms has increased\nsince the eighteenth century, Kristeller’s work may be taken to\nsuggest that our concept of art differs from that of the eighteenth\ncentury. As a matter of historical fact, there simply is no stable\ndefiniendum for a definition of art to capture.\n\n\nA fourth sort of argument suggests that a definition of art stating\nindividually necessary and jointly sufficient conditions for a thing to\nbe an artwork, is likely to be discoverable only if cognitive science\nmakes it plausible to think that humans categorize things in terms of\nnecessary and sufficient conditions. But, the argument continues,\ncognitive science actually supports the view that the structure of\nconcepts mirrors the way humans categorize things – which is with\nrespect to their similarity to prototypes (or exemplars), and not in\nterms of necessary and sufficient conditions. So the quest for a\ndefinition of art that states individually necessary and jointly\nsufficient conditions is misguided and not likely to succeed (Dean\n2003). Against this it has been urged that psychological theories\nof concepts like the prototype theory and its relatives can provide at\nbest an account of how people in fact classify things, but not\nan account of correct classifications of extra-psychological\nphenomena, and that, even if relevant, prototype theory and other\npsychological theories of concepts are at present too controversial to\ndraw substantive philosophical morals from (Rey 1983; Adajian 2005).\n\n\nA fifth argument against defining art, with a normative tinge that is\npsychologistic rather than sociopolitical, takes the fact that there\nis no philosophical consensus about the definition of art as reason to\nhold that no unitary concept of art exists.  Concepts of art, like all\nconcepts, after all, should be used for the purpose(s) they best\nserve.  But not all concepts of art serve all purposes equally\nwell. So not all art concepts should be used for the same purposes.\nArt should be defined only if there is a unitary concept of art that\nserves all of art’s various purposes – historical,\nconventional, aesthetic, appreciative, communicative, and so on.  So,\nsince there is no purpose-independent use of the concept of art, art\nshould not be defined (Mag Uidhir and Magnus 2011; cf. Meskin 2008).\nIn response, it is noted that some account of what makes various\nconcepts of art concepts of art is still required; this\nleaves open the possibility of some degree of unity beneath the\napparent multiplicity. The fact (if it is one) that different concepts\nof art are used for different purposes does not itself imply that they\nare not connected in ordered, to-some-degree systematic ways.  The\nrelation between (say) the historical concept of art and the\nappreciative concept of art is not an accidental, unsystematic\nrelation, like that between river banks and savings banks, but is\nsomething like the relation between Socrates’ healthiness and\nthe healthiness of Socrates’ diet.  That is, it is not evident\nthat there exist a mere arbitrary heap or disjunction of art concepts,\nconstituting an unsystematic patchwork. Perhaps there is a single\nconcept of art with different facets that interlock in an ordered way,\nor else a multiplicity of concepts that constitute a unity because one\nis at the core, and the others depend asymmetrically on it. (The last\nis an instance of core-dependent homonymy; see the entry on\n Aristotle, section on Essentialism and\nHomonymy.) Multiplicity alone doesn’t entail pluralism.\n\nA sixth, broadly Marxian sort of objection rejects the project of\ndefining art as an unwitting (and confused) expression of a harmful\nideology. On this view, the search for a definition of art\npresupposes, wrongly, that the concept of the aesthetic is a\ncreditable one. But since the concept of the aesthetic necessarily\ninvolves the equally bankrupt concept of disinterestedness, its use\nadvances the illusion that what is most real about things can and\nshould be grasped or contemplated without attending to the social and\neconomic conditions of their production. Definitions of art,\nconsequently, spuriously confer ontological dignity and respectability\non social phenomena that probably in fact call more properly for\nrigorous social criticism and change. Their real function is\nideological, not philosophical (Eagleton 1990).\n\n\nSeventh, the members of a complex of skeptically-flavored arguments,\nfrom feminist philosophy of art, begin with premises to the effect\nthat art and art-related concepts and practices have been\nsystematically skewed by sex or gender.  Such premises are supported\nby a variety of considerations. (a) The artworks the Western artistic\ncanon recognizes as great are dominated by male-centered perspectives\nand stereotypes, and almost all the artists the canon recognizes as\ngreat are men – unsurprisingly, given economic, social, and\ninstitutional impediments that prevented women from making art at all.\nMoreover, the concept of genius developed historically in such a way\nas to exclude women artists (Battersby, 1989, Korsmeyer 2004). (b) The\nfine arts’ focus on purely aesthetic, non-utilitarian value resulted\nin the marginalization as mere “crafts” of items of considerable\naesthetic interest made and used by women for domestic practical\npurposes.  Moreover, because all aesthetic judgments are situated and\nparticular, there can be no such thing as disinterested taste.  If\nthere is no such thing as disinterested taste, then it is hard to see\nhow there could be universal standards of aesthetic excellence.  The\nnon-existence of universal standards of aesthetic excellence\nundermines the idea of an artistic canon (and with it the project of\ndefining art).  Art as historically constituted, and art-related\npractices and concepts, then, reflect views and practices that\npresuppose and perpetuate the subordination of women.  The data that\ndefinitions of art are supposed to explain are biased, corrupt and\nincomplete. As a consequence, present definitions of art,\nincorporating or presupposing as they do a framework that incorporates\na history of systematically biased, hierarchical, fragmentary, and\nmistaken understandings of art and art-related phenomena and concepts,\nmay be so androcentric as to be untenable. Some theorists have\nsuggested that different genders have systematically unique artistic\nstyles, methods, or modes of appreciating and valuing art.  If so,\nthen a separate canon and gynocentric definitions of art are indicated\n(Battersby 1989, Frueh 1991).  In any case, in the face of these\nfacts, the project of defining art in anything like the traditional\nway is to be regarded with suspicion (Brand, 2000).\n\n\nAn eighth argument sort of skeptical argument concludes that, insofar\nas almost all contemporary definitions foreground the nature of\nartworks, rather than the individual arts to which\n(most? all?) artworks belong, they are philosophically unproductive\n(Lopes, \n2014).[2]\n The grounds for this conclusion concern disagreements among standard\ndefinitions as to the artistic status of entities whose status is for\ntheoretical reasons unclear – e.g., things like ordinary bottleracks\n(Duchamp’s Bottlerack) and silence (John Cage’s 4′33″).\nIf these hard cases are artworks, what makes them so, given their\napparent lack of any of the traditional properties of artworks? Are,\nthey, at best, marginal cases?  On the other hand, if they are not\nartworks, then why have generations of experts – art historians,\ncritics, and collectors – classified them as such? And to whom else\nshould one look to determine the true nature of art? (There are, it is\nclaimed, few or no empirical studies of art full stop, though\nempirical studies of the individual arts abound.) Such disputes\ninevitably end in stalemate. Stalemate results because (a) standard\nartwork-focused definitions of art endorse different criteria of\ntheory choice, and (b) on the basis of their preferred criteria,\nappeal to incompatible intuitions about the status of such\ntheoretically-vexed cases.  In consequence, disagreements between\nstandard definitions of art that foreground artworks are\nunresolvable. To avoid this stalemate, an alternative definitional\nstrategy that foregrounds the arts rather than individual artworks, is\nindicated. (See section 4.5.)\n",
    "section_title": "3.1 Skepticisms inspired by views of concepts, history, Marxism, feminism",
    "entry_title": "The Definition of Art",
    "hierarchy_title": "The Definition of Art || Skepticism about Definitions || Skepticisms inspired by views of concepts, history, Marxism, feminism",
    "tokenized_text": [
        "skepticism",
        "definition",
        "skepticism",
        "inspired",
        "view",
        "concept",
        "history",
        "marxism",
        "feminism",
        "skepticism",
        "inspired",
        "view",
        "concept",
        "history",
        "marxism",
        "feminism",
        "common",
        "family",
        "argument",
        "inspired",
        "wittgenstein",
        "famous",
        "remark",
        "game",
        "wittgenstein",
        "phenomenon",
        "art",
        "nature",
        "diverse",
        "admit",
        "unification",
        "satisfactory",
        "definition",
        "strives",
        "definition",
        "art",
        "thing",
        "would",
        "exert",
        "stifling",
        "influence",
        "artistic",
        "creativity",
        "one",
        "expression",
        "impulse",
        "weitz",
        "open",
        "concept",
        "argument",
        "concept",
        "open",
        "case",
        "imagined",
        "would",
        "call",
        "sort",
        "decision",
        "part",
        "extend",
        "use",
        "concept",
        "cover",
        "close",
        "concept",
        "invent",
        "new",
        "one",
        "deal",
        "new",
        "case",
        "open",
        "concept",
        "indefinable",
        "case",
        "calling",
        "decision",
        "whether",
        "extend",
        "close",
        "concept",
        "art",
        "hence",
        "art",
        "indefinable",
        "weitz",
        "claimed",
        "change",
        "general",
        "rule",
        "preservation",
        "identity",
        "time",
        "decision",
        "conceptexpansion",
        "may",
        "principled",
        "rather",
        "capricious",
        "nothing",
        "bar",
        "definition",
        "art",
        "incorporating",
        "novelty",
        "requirement",
        "second",
        "sort",
        "argument",
        "le",
        "common",
        "today",
        "heyday",
        "certain",
        "form",
        "extreme",
        "wittgensteinianism",
        "urge",
        "concept",
        "make",
        "stuff",
        "definition",
        "art",
        "expressiveness",
        "form",
        "embedded",
        "general",
        "philosophical",
        "theory",
        "incorporate",
        "traditional",
        "metaphysics",
        "epistemology",
        "since",
        "traditional",
        "metaphysics",
        "epistemology",
        "prime",
        "instance",
        "language",
        "gone",
        "conceptually",
        "confused",
        "holiday",
        "definition",
        "art",
        "share",
        "conceptual",
        "confusion",
        "traditional",
        "philosophy",
        "tilghman",
        "third",
        "sort",
        "argument",
        "historically",
        "inflected",
        "first",
        "take",
        "influential",
        "study",
        "historian",
        "philosophy",
        "paul",
        "kristeller",
        "argued",
        "modern",
        "system",
        "five",
        "major",
        "art",
        "painting",
        "sculpture",
        "architecture",
        "poetry",
        "music",
        "underlies",
        "modern",
        "aesthetic",
        "comparatively",
        "recent",
        "origin",
        "assume",
        "definite",
        "shape",
        "eighteenth",
        "century",
        "although",
        "many",
        "ingredient",
        "go",
        "back",
        "classical",
        "mediaeval",
        "renaissance",
        "thought",
        "kristeller",
        "since",
        "list",
        "five",
        "art",
        "somewhat",
        "arbitrary",
        "since",
        "even",
        "five",
        "share",
        "single",
        "common",
        "nature",
        "rather",
        "united",
        "best",
        "several",
        "overlapping",
        "feature",
        "since",
        "number",
        "art",
        "form",
        "increased",
        "since",
        "eighteenth",
        "century",
        "kristeller",
        "work",
        "may",
        "taken",
        "suggest",
        "concept",
        "art",
        "differs",
        "eighteenth",
        "century",
        "matter",
        "historical",
        "fact",
        "simply",
        "stable",
        "definiendum",
        "definition",
        "art",
        "capture",
        "fourth",
        "sort",
        "argument",
        "suggests",
        "definition",
        "art",
        "stating",
        "individually",
        "necessary",
        "jointly",
        "sufficient",
        "condition",
        "thing",
        "artwork",
        "likely",
        "discoverable",
        "cognitive",
        "science",
        "make",
        "plausible",
        "think",
        "human",
        "categorize",
        "thing",
        "term",
        "necessary",
        "sufficient",
        "condition",
        "argument",
        "continues",
        "cognitive",
        "science",
        "actually",
        "support",
        "view",
        "structure",
        "concept",
        "mirror",
        "way",
        "human",
        "categorize",
        "thing",
        "respect",
        "similarity",
        "prototype",
        "exemplar",
        "term",
        "necessary",
        "sufficient",
        "condition",
        "quest",
        "definition",
        "art",
        "state",
        "individually",
        "necessary",
        "jointly",
        "sufficient",
        "condition",
        "misguided",
        "likely",
        "succeed",
        "dean",
        "urged",
        "psychological",
        "theory",
        "concept",
        "like",
        "prototype",
        "theory",
        "relative",
        "provide",
        "best",
        "account",
        "people",
        "fact",
        "classify",
        "thing",
        "account",
        "correct",
        "classification",
        "extrapsychological",
        "phenomenon",
        "even",
        "relevant",
        "prototype",
        "theory",
        "psychological",
        "theory",
        "concept",
        "present",
        "controversial",
        "draw",
        "substantive",
        "philosophical",
        "moral",
        "rey",
        "adajian",
        "fifth",
        "argument",
        "defining",
        "art",
        "normative",
        "tinge",
        "psychologistic",
        "rather",
        "sociopolitical",
        "take",
        "fact",
        "philosophical",
        "consensus",
        "definition",
        "art",
        "reason",
        "hold",
        "unitary",
        "concept",
        "art",
        "exists",
        "concept",
        "art",
        "like",
        "concept",
        "used",
        "purpose",
        "best",
        "serve",
        "concept",
        "art",
        "serve",
        "purpose",
        "equally",
        "well",
        "art",
        "concept",
        "used",
        "purpose",
        "art",
        "defined",
        "unitary",
        "concept",
        "art",
        "serf",
        "art",
        "various",
        "purpose",
        "historical",
        "conventional",
        "aesthetic",
        "appreciative",
        "communicative",
        "since",
        "purposeindependent",
        "use",
        "concept",
        "art",
        "art",
        "defined",
        "mag",
        "uidhir",
        "magnus",
        "cf",
        "meskin",
        "response",
        "noted",
        "account",
        "make",
        "various",
        "concept",
        "art",
        "concept",
        "art",
        "still",
        "required",
        "leaf",
        "open",
        "possibility",
        "degree",
        "unity",
        "beneath",
        "apparent",
        "multiplicity",
        "fact",
        "one",
        "different",
        "concept",
        "art",
        "used",
        "different",
        "purpose",
        "imply",
        "connected",
        "ordered",
        "tosomedegree",
        "systematic",
        "way",
        "relation",
        "say",
        "historical",
        "concept",
        "art",
        "appreciative",
        "concept",
        "art",
        "accidental",
        "unsystematic",
        "relation",
        "like",
        "river",
        "bank",
        "saving",
        "bank",
        "something",
        "like",
        "relation",
        "socrates",
        "healthiness",
        "healthiness",
        "socrates",
        "diet",
        "evident",
        "exist",
        "mere",
        "arbitrary",
        "heap",
        "disjunction",
        "art",
        "concept",
        "constituting",
        "unsystematic",
        "patchwork",
        "perhaps",
        "single",
        "concept",
        "art",
        "different",
        "facet",
        "interlock",
        "ordered",
        "way",
        "else",
        "multiplicity",
        "concept",
        "constitute",
        "unity",
        "one",
        "core",
        "others",
        "depend",
        "asymmetrically",
        "last",
        "instance",
        "coredependent",
        "homonymy",
        "see",
        "entry",
        "aristotle",
        "section",
        "essentialism",
        "homonymy",
        "multiplicity",
        "alone",
        "entail",
        "pluralism",
        "sixth",
        "broadly",
        "marxian",
        "sort",
        "objection",
        "reject",
        "project",
        "defining",
        "art",
        "unwitting",
        "confused",
        "expression",
        "harmful",
        "ideology",
        "view",
        "search",
        "definition",
        "art",
        "presupposes",
        "wrongly",
        "concept",
        "aesthetic",
        "creditable",
        "one",
        "since",
        "concept",
        "aesthetic",
        "necessarily",
        "involves",
        "equally",
        "bankrupt",
        "concept",
        "disinterestedness",
        "use",
        "advance",
        "illusion",
        "real",
        "thing",
        "grasped",
        "contemplated",
        "without",
        "attending",
        "social",
        "economic",
        "condition",
        "production",
        "definition",
        "art",
        "consequently",
        "spuriously",
        "confer",
        "ontological",
        "dignity",
        "respectability",
        "social",
        "phenomenon",
        "probably",
        "fact",
        "call",
        "properly",
        "rigorous",
        "social",
        "criticism",
        "change",
        "real",
        "function",
        "ideological",
        "philosophical",
        "eagleton",
        "seventh",
        "member",
        "complex",
        "skepticallyflavored",
        "argument",
        "feminist",
        "philosophy",
        "art",
        "begin",
        "premise",
        "effect",
        "art",
        "artrelated",
        "concept",
        "practice",
        "systematically",
        "skewed",
        "sex",
        "gender",
        "premise",
        "supported",
        "variety",
        "consideration",
        "artwork",
        "western",
        "artistic",
        "canon",
        "recognizes",
        "great",
        "dominated",
        "malecentered",
        "perspective",
        "stereotype",
        "almost",
        "artist",
        "canon",
        "recognizes",
        "great",
        "men",
        "unsurprisingly",
        "given",
        "economic",
        "social",
        "institutional",
        "impediment",
        "prevented",
        "woman",
        "making",
        "art",
        "moreover",
        "concept",
        "genius",
        "developed",
        "historically",
        "way",
        "exclude",
        "woman",
        "artist",
        "battersby",
        "korsmeyer",
        "b",
        "fine",
        "art",
        "focus",
        "purely",
        "aesthetic",
        "nonutilitarian",
        "value",
        "resulted",
        "marginalization",
        "mere",
        "craft",
        "item",
        "considerable",
        "aesthetic",
        "interest",
        "made",
        "used",
        "woman",
        "domestic",
        "practical",
        "purpose",
        "moreover",
        "aesthetic",
        "judgment",
        "situated",
        "particular",
        "thing",
        "disinterested",
        "taste",
        "thing",
        "disinterested",
        "taste",
        "hard",
        "see",
        "could",
        "universal",
        "standard",
        "aesthetic",
        "excellence",
        "nonexistence",
        "universal",
        "standard",
        "aesthetic",
        "excellence",
        "undermines",
        "idea",
        "artistic",
        "canon",
        "project",
        "defining",
        "art",
        "art",
        "historically",
        "constituted",
        "artrelated",
        "practice",
        "concept",
        "reflect",
        "view",
        "practice",
        "presuppose",
        "perpetuate",
        "subordination",
        "woman",
        "data",
        "definition",
        "art",
        "supposed",
        "explain",
        "biased",
        "corrupt",
        "incomplete",
        "consequence",
        "present",
        "definition",
        "art",
        "incorporating",
        "presupposing",
        "framework",
        "incorporates",
        "history",
        "systematically",
        "biased",
        "hierarchical",
        "fragmentary",
        "mistaken",
        "understanding",
        "art",
        "artrelated",
        "phenomenon",
        "concept",
        "may",
        "androcentric",
        "untenable",
        "theorist",
        "suggested",
        "different",
        "gender",
        "systematically",
        "unique",
        "artistic",
        "style",
        "method",
        "mode",
        "appreciating",
        "valuing",
        "art",
        "separate",
        "canon",
        "gynocentric",
        "definition",
        "art",
        "indicated",
        "battersby",
        "frueh",
        "case",
        "face",
        "fact",
        "project",
        "defining",
        "art",
        "anything",
        "like",
        "traditional",
        "way",
        "regarded",
        "suspicion",
        "brand",
        "eighth",
        "argument",
        "sort",
        "skeptical",
        "argument",
        "concludes",
        "insofar",
        "almost",
        "contemporary",
        "definition",
        "foreground",
        "nature",
        "artwork",
        "rather",
        "individual",
        "art",
        "artwork",
        "belong",
        "philosophically",
        "unproductive",
        "lope",
        "ground",
        "conclusion",
        "concern",
        "disagreement",
        "among",
        "standard",
        "definition",
        "artistic",
        "status",
        "entity",
        "whose",
        "status",
        "theoretical",
        "reason",
        "unclear",
        "eg",
        "thing",
        "like",
        "ordinary",
        "bottleracks",
        "duchamp",
        "bottlerack",
        "silence",
        "john",
        "cage",
        "hard",
        "case",
        "artwork",
        "make",
        "given",
        "apparent",
        "lack",
        "traditional",
        "property",
        "artwork",
        "best",
        "marginal",
        "case",
        "hand",
        "artwork",
        "generation",
        "expert",
        "art",
        "historian",
        "critic",
        "collector",
        "classified",
        "else",
        "one",
        "look",
        "determine",
        "true",
        "nature",
        "art",
        "claimed",
        "empirical",
        "study",
        "art",
        "full",
        "stop",
        "though",
        "empirical",
        "study",
        "individual",
        "art",
        "abound",
        "dispute",
        "inevitably",
        "end",
        "stalemate",
        "stalemate",
        "result",
        "standard",
        "artworkfocused",
        "definition",
        "art",
        "endorse",
        "different",
        "criterion",
        "theory",
        "choice",
        "b",
        "basis",
        "preferred",
        "criterion",
        "appeal",
        "incompatible",
        "intuition",
        "status",
        "theoreticallyvexed",
        "case",
        "consequence",
        "disagreement",
        "standard",
        "definition",
        "art",
        "foreground",
        "artwork",
        "unresolvable",
        "avoid",
        "stalemate",
        "alternative",
        "definitional",
        "strategy",
        "foreground",
        "art",
        "rather",
        "individual",
        "artwork",
        "indicated",
        "see",
        "section"
    ]
}