{
    "main_text": "Contemporary Definitions || Hybrid (Disjunctive) Definitions\n4.5 Hybrid (Disjunctive) Definitions\n\n\nHybrid definitions characteristically disjoin at least one\ninstitutional component with at least one aesthetic component, aiming\nthereby to accommodate both more traditional art and avant-garde art\nthat appears to lack any significant aesthetic dimension.  (Such\ndefinitions could also be classified as institutional, on the grounds\nthat they make provenance sufficient for being a work of art.) Hence\nthey inherit a feature of conventionalist definitions: in appealing to\nart institutions, artworlds, arts, art functions, and so on, they\neither include substantive accounts of what it is to be an\nartinstitution/world/genre/-form/function, or are\nuninformatively circular.\n\n\nOne such disjunctive definition, Longworth and Scarantino’s, adapts\nGaut’s list of ten clustering properties, where that list (see 3.5\nabove) includes institutional properties (e.g., belonging to an\nestablished art form) and traditional ones (e.g., possessing positive\naesthetic properties); see also Longworth and Scarantino 2010. The\ncore idea is that art is defined by a disjunction of minimally\nsufficient and disjunctively necessary conditions; to say that a\ndisjunct is a minimally sufficient constitutive condition for\nart-hood, is to say that every proper subset of it is insufficient for\nart-hood. An account of what it is for a concept to have disjunctive\ndefining conditions is also supplied.  The definition of art itself is\nas follows: ∃Z∃Y (Art iff (Z ∨\nY)), where (a) Z and Y, formed from properties on\nGaut’s cluster list, are either non-empty conjunctions or non-empty\ndisjunctions of conjunctions or individual properties; (b) there is\nsome indeterminacy over exactly which disjuncts are sufficient; (c)\nZ does not entail Y and Y does not entail\nZ; (d) Z does not entail Art and Y does not\nentail Art. Instantiation of either Z or Y suffices for\nart-hood; something can be art only if at least one of Z,\nY is instantiated; and the third condition is included to\nprevent the definition from collapsing into a classical one. The\naccount of what it is for concept C to have disjunctive\ndefining conditions is as follows: C iff (Z ∨\nY), where (i) Z and Y are non-empty conjunctions\nor non-empty disjunctions of conjunctions or individual properties;\n(ii) Z does not entail Y and Y does not entail\nZ; (iii) Z does not entail C and Y does not\nentail C. A worry concerns condition (iii): as written, it seems to\nrender the account of disjunctive defining conditions\nself-contradictory.  For if Z and Y are each minimally\nsufficient for C, it is impossible that Z does not\nentail C and that Y does not entail C. If so,\nthen nothing can satisfy the conditions said to be necessary and\nsufficient for a concept to have disjunctive defining conditions.\n\n\nA second disjunctive hybrid definition, with an historical cast,\nRobert Stecker’s historical functionalism, holds that an item is an\nartwork at time t, where t is not earlier than the\ntime at which the item is made, if and only if it is in one of the\ncentral art forms at t and is made with the intention of\nfulfilling a function art has at t or it is an artifact that\nachieves excellence in achieving such a function (Stecker 2005).  A\nquestion for Stecker’s view is whether or not it provides an adequate\naccount of what it is for a function to be an art function, and\nwhether, consequently, it can accommodate anti-aesthetic or\nnon-aesthetic art. The grounds given for thinking that it can are\nthat, while art’s original functions were aesthetic, those functions,\nand the intentions with which art is made, can change in unforeseeable\nways. Moreover, aesthetic properties are not always preeminent in\nart’s predecessor concepts (Stecker 2000). A worry is that if the\noperative assumption is that if x belongs to a predecessor\ntradition of T then x belongs to T, the\npossibility is not ruled out that if, for example, the tradition of\nmagic is a predecessor tradition of the scientific tradition, then\nentities that belong to the magic tradition but lacking any of the\nstandard hallmarks of science are scientific entities.\n\n\nA third hybrid definition, also disjunctive, is the cladistic\ndefinition defended by Stephen Davies.  who holds that something is\nart (a) if it shows excellence of skill and achievement in realizing\nsignificant aesthetic goals, and either doing so is its primary,\nidentifying function or doing so makes a vital contribution to the\nrealization of its primary, identifying function, or (b) if it falls\nunder an art genre or art form established and publicly recognized\nwithin an art tradition, or (c) if it is intended by its\nmaker/presenter to be art and its maker/presenter does what is\nnecessary and appropriate to realizing that intention (Davies, 2015).\n(In biology, a clade is a segment in the tree of life: a group\nof organisms and the common ancestor they share.) Artworlds are to be\ncharacterized in terms of their origins: they begin with prehistoric\nart ancestors, and grow into artworlds. Hence all artworks occupy a\nline of descent from their prehistoric art ancestors; that line of\ndescent comprises an art tradition that grows into an artworld.  So\nthe definition is bottom-up and resolutely anthropocentric. A worry:\nthe view seems to entail that art traditions can undergo any changes\nwhatsoever and remain art traditions, since, no matter how distant,\nevery occupant of the right line of descent is part of the art\ntradition. This seems to amount to saying that as long as they remain\ntraditions at all, art traditions cannot die. Whether art is immortal\nin this sense seems open to question.  A second worry is that the\nrequirement that every art tradition and artworld stand in some line\nof descent from prehistoric humanoids makes it in principle impossible\nfor any nonhuman species to make art, as long as that species fails to\noccupy the right location in the tree of life. While the\nepistemological challenges that identifying artworks made by nonhumans\nmight pose could be very considerable, this consequence of the\ncladistic definition’s emphasis on lineage rather than traits raises a\nconcern about excessively insularity.\n\nA fourth hybrid definition is the “buck-passing” view of Lopes, which\nattempts an escape from the stalemate between artwork-focused\ndefinitions over avant-garde anti-aesthetic cases by adopting a\nstrategy that shifts the focus of the definition of art away from\nartworks.  The strategy is to recenter philosophical efforts on\ndifferent problems, which require attention anyway: (a) the problem of\ngiving an account of each individual art, and (b) the problem of\ndefining what it is to be an art, the latter by giving an account of\nthe larger class of normative/appreciative kinds to which the arts\n(and some non-arts) belong. For, given definitions of the individual\narts, and a definition of what it is to be an art, if every artwork\nbelongs to at least one art (if it belongs to no existing art, then it\npioneers a new art), then a definition of artwork falls out: x\nis a work of art if and only if x is a work of K, where K is an\nart (Lopes 2014). When fully spelled out, the definition is\ndisjunctive: x is a work of art if and only if x is a\nwork belonging to art1 or x is a work belonging to\nart2 or x is a work belonging to art3\n…. Most of the explanatory work is done by the theories of the\nindividual arts, since, given the assumption that every artwork\nbelongs to at least one art, possession of theories of the individual\narts would be necessary and sufficient for settling the artistic or\nnon-artistic status of any hard case, once it is determined what art a\ngiven work belongs to. As to what makes a practice an art, Lopes’\npreferred answer seems to be institutionalism of a Dickiean variety:\nan art is an institution in which artists (persons who participate\nwith understanding in the making of artworks) make artworks to be\npresented to an artworld public. (Lopes 2014, Dickie 1984) Thus, on\nthis view, it is arbitrary which activities are artworld systems:\nthere is no deeper answer to the question of what makes music an art\nthan that it has the right institutional\n structure.[4] \nSo it is arbitrary which activities are arts. Two worries. First, the\nkey claim that every work of art belonging to no extant art pioneers a\nnew art may be defended on the grounds that any reason to say that a\nwork belonging to no extant artform is an artwork is a reason to say\nthat it pioneers a new artform.  In response, it is noted that the\nquestion of whether or not a thing belongs to an art arises only when,\nand because, there is a prior reason for thinking that the thing is an\nartwork.  So it seems that what it is to be an artwork is prior, in\nsome sense, to what it is to be an art.  Second, on the buck-passing\ntheory’s institutional theory of the arts, which activities are arts\nis arbitrary.  This raises a version of the question that was raised\nabout the cladistic definition’s ability to account for the existence\nof art outside our (Hominin) tradition.  Suppose the connection\nbetween a practice’s traits and its status as an art are wholly\ncontingent. Then the fact that a practice in another culture that\nalthough not part of our tradition had most of the traits of one of\nour own arts would be no reason to think that practice was an art, and\nno reason to think that the objects belonging to it were artworks. It\nis not clear that we are really so in the dark when it comes to\ndetermining whether practices in alien cultures or traditions are\narts. \n",
    "section_title": "4.5 Hybrid (Disjunctive) Definitions",
    "entry_title": "The Definition of Art",
    "hierarchy_title": "The Definition of Art || Contemporary Definitions || Hybrid (Disjunctive) Definitions",
    "tokenized_text": [
        "contemporary",
        "definition",
        "hybrid",
        "disjunctive",
        "definition",
        "hybrid",
        "disjunctive",
        "definition",
        "hybrid",
        "definition",
        "characteristically",
        "disjoin",
        "least",
        "one",
        "institutional",
        "component",
        "least",
        "one",
        "aesthetic",
        "component",
        "aiming",
        "thereby",
        "accommodate",
        "traditional",
        "art",
        "avantgarde",
        "art",
        "appears",
        "lack",
        "significant",
        "aesthetic",
        "dimension",
        "definition",
        "could",
        "also",
        "classified",
        "institutional",
        "ground",
        "make",
        "provenance",
        "sufficient",
        "work",
        "art",
        "hence",
        "inherit",
        "feature",
        "conventionalist",
        "definition",
        "appealing",
        "art",
        "institution",
        "artworlds",
        "art",
        "art",
        "function",
        "either",
        "include",
        "substantive",
        "account",
        "artinstitutionworldgenreformfunction",
        "uninformatively",
        "circular",
        "one",
        "disjunctive",
        "definition",
        "longworth",
        "scarantino",
        "adapts",
        "gaut",
        "list",
        "ten",
        "clustering",
        "property",
        "list",
        "see",
        "includes",
        "institutional",
        "property",
        "eg",
        "belonging",
        "established",
        "art",
        "form",
        "traditional",
        "one",
        "eg",
        "possessing",
        "positive",
        "aesthetic",
        "property",
        "see",
        "also",
        "longworth",
        "scarantino",
        "core",
        "idea",
        "art",
        "defined",
        "disjunction",
        "minimally",
        "sufficient",
        "disjunctively",
        "necessary",
        "condition",
        "say",
        "disjunct",
        "minimally",
        "sufficient",
        "constitutive",
        "condition",
        "arthood",
        "say",
        "every",
        "proper",
        "subset",
        "insufficient",
        "arthood",
        "account",
        "concept",
        "disjunctive",
        "defining",
        "condition",
        "also",
        "supplied",
        "definition",
        "art",
        "follows",
        "zy",
        "art",
        "iff",
        "z",
        "z",
        "formed",
        "property",
        "gaut",
        "cluster",
        "list",
        "either",
        "nonempty",
        "conjunction",
        "nonempty",
        "disjunction",
        "conjunction",
        "individual",
        "property",
        "b",
        "indeterminacy",
        "exactly",
        "disjuncts",
        "sufficient",
        "c",
        "z",
        "entail",
        "entail",
        "z",
        "z",
        "entail",
        "art",
        "entail",
        "art",
        "instantiation",
        "either",
        "z",
        "suffices",
        "arthood",
        "something",
        "art",
        "least",
        "one",
        "z",
        "instantiated",
        "third",
        "condition",
        "included",
        "prevent",
        "definition",
        "collapsing",
        "classical",
        "one",
        "account",
        "concept",
        "c",
        "disjunctive",
        "defining",
        "condition",
        "follows",
        "c",
        "iff",
        "z",
        "z",
        "nonempty",
        "conjunction",
        "nonempty",
        "disjunction",
        "conjunction",
        "individual",
        "property",
        "ii",
        "z",
        "entail",
        "entail",
        "z",
        "iii",
        "z",
        "entail",
        "c",
        "entail",
        "c",
        "worry",
        "concern",
        "condition",
        "iii",
        "written",
        "seems",
        "render",
        "account",
        "disjunctive",
        "defining",
        "condition",
        "selfcontradictory",
        "z",
        "minimally",
        "sufficient",
        "c",
        "impossible",
        "z",
        "entail",
        "c",
        "entail",
        "c",
        "nothing",
        "satisfy",
        "condition",
        "said",
        "necessary",
        "sufficient",
        "concept",
        "disjunctive",
        "defining",
        "condition",
        "second",
        "disjunctive",
        "hybrid",
        "definition",
        "historical",
        "cast",
        "robert",
        "stecker",
        "historical",
        "functionalism",
        "hold",
        "item",
        "artwork",
        "time",
        "earlier",
        "time",
        "item",
        "made",
        "one",
        "central",
        "art",
        "form",
        "made",
        "intention",
        "fulfilling",
        "function",
        "art",
        "artifact",
        "achieves",
        "excellence",
        "achieving",
        "function",
        "stecker",
        "question",
        "stecker",
        "view",
        "whether",
        "provides",
        "adequate",
        "account",
        "function",
        "art",
        "function",
        "whether",
        "consequently",
        "accommodate",
        "antiaesthetic",
        "nonaesthetic",
        "art",
        "ground",
        "given",
        "thinking",
        "art",
        "original",
        "function",
        "aesthetic",
        "function",
        "intention",
        "art",
        "made",
        "change",
        "unforeseeable",
        "way",
        "moreover",
        "aesthetic",
        "property",
        "always",
        "preeminent",
        "art",
        "predecessor",
        "concept",
        "stecker",
        "worry",
        "operative",
        "assumption",
        "x",
        "belongs",
        "predecessor",
        "tradition",
        "x",
        "belongs",
        "possibility",
        "ruled",
        "example",
        "tradition",
        "magic",
        "predecessor",
        "tradition",
        "scientific",
        "tradition",
        "entity",
        "belong",
        "magic",
        "tradition",
        "lacking",
        "standard",
        "hallmark",
        "science",
        "scientific",
        "entity",
        "third",
        "hybrid",
        "definition",
        "also",
        "disjunctive",
        "cladistic",
        "definition",
        "defended",
        "stephen",
        "davy",
        "hold",
        "something",
        "art",
        "show",
        "excellence",
        "skill",
        "achievement",
        "realizing",
        "significant",
        "aesthetic",
        "goal",
        "either",
        "primary",
        "identifying",
        "function",
        "make",
        "vital",
        "contribution",
        "realization",
        "primary",
        "identifying",
        "function",
        "b",
        "fall",
        "art",
        "genre",
        "art",
        "form",
        "established",
        "publicly",
        "recognized",
        "within",
        "art",
        "tradition",
        "c",
        "intended",
        "makerpresenter",
        "art",
        "makerpresenter",
        "necessary",
        "appropriate",
        "realizing",
        "intention",
        "davy",
        "biology",
        "clade",
        "segment",
        "tree",
        "life",
        "group",
        "organism",
        "common",
        "ancestor",
        "share",
        "artworlds",
        "characterized",
        "term",
        "origin",
        "begin",
        "prehistoric",
        "art",
        "ancestor",
        "grow",
        "artworlds",
        "hence",
        "artwork",
        "occupy",
        "line",
        "descent",
        "prehistoric",
        "art",
        "ancestor",
        "line",
        "descent",
        "comprises",
        "art",
        "tradition",
        "grows",
        "artworld",
        "definition",
        "bottomup",
        "resolutely",
        "anthropocentric",
        "worry",
        "view",
        "seems",
        "entail",
        "art",
        "tradition",
        "undergo",
        "change",
        "whatsoever",
        "remain",
        "art",
        "tradition",
        "since",
        "matter",
        "distant",
        "every",
        "occupant",
        "right",
        "line",
        "descent",
        "part",
        "art",
        "tradition",
        "seems",
        "amount",
        "saying",
        "long",
        "remain",
        "tradition",
        "art",
        "tradition",
        "die",
        "whether",
        "art",
        "immortal",
        "sense",
        "seems",
        "open",
        "question",
        "second",
        "worry",
        "requirement",
        "every",
        "art",
        "tradition",
        "artworld",
        "stand",
        "line",
        "descent",
        "prehistoric",
        "humanoid",
        "make",
        "principle",
        "impossible",
        "nonhuman",
        "specie",
        "make",
        "art",
        "long",
        "specie",
        "fails",
        "occupy",
        "right",
        "location",
        "tree",
        "life",
        "epistemological",
        "challenge",
        "identifying",
        "artwork",
        "made",
        "nonhumans",
        "might",
        "pose",
        "could",
        "considerable",
        "consequence",
        "cladistic",
        "definition",
        "emphasis",
        "lineage",
        "rather",
        "trait",
        "raise",
        "concern",
        "excessively",
        "insularity",
        "fourth",
        "hybrid",
        "definition",
        "buckpassing",
        "view",
        "lope",
        "attempt",
        "escape",
        "stalemate",
        "artworkfocused",
        "definition",
        "avantgarde",
        "antiaesthetic",
        "case",
        "adopting",
        "strategy",
        "shift",
        "focus",
        "definition",
        "art",
        "away",
        "artwork",
        "strategy",
        "recenter",
        "philosophical",
        "effort",
        "different",
        "problem",
        "require",
        "attention",
        "anyway",
        "problem",
        "giving",
        "account",
        "individual",
        "art",
        "b",
        "problem",
        "defining",
        "art",
        "latter",
        "giving",
        "account",
        "larger",
        "class",
        "normativeappreciative",
        "kind",
        "art",
        "nonarts",
        "belong",
        "given",
        "definition",
        "individual",
        "art",
        "definition",
        "art",
        "every",
        "artwork",
        "belongs",
        "least",
        "one",
        "art",
        "belongs",
        "existing",
        "art",
        "pioneer",
        "new",
        "art",
        "definition",
        "artwork",
        "fall",
        "x",
        "work",
        "art",
        "x",
        "work",
        "k",
        "k",
        "art",
        "lope",
        "fully",
        "spelled",
        "definition",
        "disjunctive",
        "x",
        "work",
        "art",
        "x",
        "work",
        "belonging",
        "art",
        "x",
        "work",
        "belonging",
        "art",
        "x",
        "work",
        "belonging",
        "art",
        "explanatory",
        "work",
        "done",
        "theory",
        "individual",
        "art",
        "since",
        "given",
        "assumption",
        "every",
        "artwork",
        "belongs",
        "least",
        "one",
        "art",
        "possession",
        "theory",
        "individual",
        "art",
        "would",
        "necessary",
        "sufficient",
        "settling",
        "artistic",
        "nonartistic",
        "status",
        "hard",
        "case",
        "determined",
        "art",
        "given",
        "work",
        "belongs",
        "make",
        "practice",
        "art",
        "lope",
        "preferred",
        "answer",
        "seems",
        "institutionalism",
        "dickiean",
        "variety",
        "art",
        "institution",
        "artist",
        "person",
        "participate",
        "understanding",
        "making",
        "artwork",
        "make",
        "artwork",
        "presented",
        "artworld",
        "public",
        "lope",
        "dickie",
        "thus",
        "view",
        "arbitrary",
        "activity",
        "artworld",
        "system",
        "deeper",
        "answer",
        "question",
        "make",
        "music",
        "art",
        "right",
        "institutional",
        "structure",
        "arbitrary",
        "activity",
        "art",
        "two",
        "worry",
        "first",
        "key",
        "claim",
        "every",
        "work",
        "art",
        "belonging",
        "extant",
        "art",
        "pioneer",
        "new",
        "art",
        "may",
        "defended",
        "ground",
        "reason",
        "say",
        "work",
        "belonging",
        "extant",
        "artform",
        "artwork",
        "reason",
        "say",
        "pioneer",
        "new",
        "artform",
        "response",
        "noted",
        "question",
        "whether",
        "thing",
        "belongs",
        "art",
        "arises",
        "prior",
        "reason",
        "thinking",
        "thing",
        "artwork",
        "seems",
        "artwork",
        "prior",
        "sense",
        "art",
        "second",
        "buckpassing",
        "theory",
        "institutional",
        "theory",
        "art",
        "activity",
        "art",
        "arbitrary",
        "raise",
        "version",
        "question",
        "raised",
        "cladistic",
        "definition",
        "ability",
        "account",
        "existence",
        "art",
        "outside",
        "hominin",
        "tradition",
        "suppose",
        "connection",
        "practice",
        "trait",
        "status",
        "art",
        "wholly",
        "contingent",
        "fact",
        "practice",
        "another",
        "culture",
        "although",
        "part",
        "tradition",
        "trait",
        "one",
        "art",
        "would",
        "reason",
        "think",
        "practice",
        "art",
        "reason",
        "think",
        "object",
        "belonging",
        "artwork",
        "clear",
        "really",
        "dark",
        "come",
        "determining",
        "whether",
        "practice",
        "alien",
        "culture",
        "tradition",
        "art"
    ]
}