{
    "main_text": "Philosophical AI\n7. Philosophical AI\n\nNotice that the heading for this section isn’t Philosophy\nof AI. We’ll get to that category momentarily. (For now\nit can be identified with the attempt to answer such questions as\nwhether artificial agents created in AI can ever reach the full\nheights of human intelligence.) Philosophical AI is AI, not\nphilosophy; but it’s AI rooted in and flowing from, philosophy.\nFor example, one could engage, using the tools and techniques of\nphilosophy, a paradox, work out a proposed solution, and then proceed\nto a step that is surely optional for philosophers: expressing the\nsolution in terms that can be translated into a computer program that,\nwhen executed, allows an artificial agent to surmount concrete\ninstances of the original\n paradox.[37]\n Before we ostensively characterize Philosophical AI of this sort\ncourtesy of a particular research program, let us consider first the\nview that AI is in fact simply philosophy, or a part thereof. \n\nDaniel Dennett (1979) has famously claimed not just that there are\nparts of AI intimately bound up with philosophy, but that AI\nis philosophy (and psychology, at least of the cognitive\nsort). (He has made a parallel claim about Artificial Life (Dennett\n1998)). This view will turn out to be incorrect, but the reasons why\nit’s wrong will prove illuminating, and our discussion will pave\nthe way for a discussion of Philosophical AI. \n\nWhat does Dennett say, exactly? This: \n\nI want to claim that AI is better viewed as sharing with traditional\nepistemology the status of being a most general, most abstract asking\nof the top-down question: how is knowledge possible? (Dennett 1979,\n60)\n\n\nElsewhere he says his view is that AI should be viewed “as a\nmost abstract inquiry into the possibility of intelligence or\nknowledge” (Dennett 1979, 64). \n\nIn short, Dennett holds that AI is the attempt to explain\nintelligence, not by studying the brain in the hopes of identifying\ncomponents to which cognition can be reduced, and not by engineering\nsmall information-processing units from which one can build in\nbottom-up fashion to high-level cognitive processes, but rather by\n– and this is why he says the approach is top-down\n– designing and implementing abstract algorithms that capture\ncognition. Leaving aside the fact that, at least starting in the early\n1980s, AI includes an approach that is in some sense bottom-up (see\nthe neurocomputational paradigm discussed above, in\n Non-Logicist AI: A Summary;\n and see, specifically, Granger’s (2004a, 2004b) work,\nhyperlinked in text immediately above, a specific counterexample), a\nfatal flaw infects Dennett’s view. Dennett sees the potential\nflaw, as reflected in: \n\nIt has seemed to some philosophers that AI cannot plausibly be so\nconstrued because it takes on an additional burden: it restricts\nitself to mechanistic solutions, and hence its domain is not\nthe Kantian domain of all possible modes of intelligence, but just all\npossible mechanistically realizable modes of intelligence. This, it is\nclaimed, would beg the question against vitalists, dualists, and other\nanti-mechanists. (Dennett 1979, 61)\n\n\nDennett has a ready answer to this objection. He writes: \n\nBut … the mechanism requirement of AI is not an additional\nconstraint of any moment, for if psychology is possible at all, and if\nChurch’s thesis is true, the constraint of mechanism is no more\nsevere than the constraint against begging the question in psychology,\nand who would wish to evade that? (Dennett 1979, 61)\n\n\nUnfortunately, this is acutely problematic; and examination of the\nproblems throws light on the nature of AI. \n\nFirst, insofar as philosophy and psychology are concerned with the\nnature of mind, they aren’t in the least trammeled by the\npresupposition that mentation consists in computation. AI, at least of\nthe “Strong” variety (we’ll discuss\n“Strong” versus “Weak” AI\n below)\n is indeed an attempt to substantiate, through engineering certain\nimpressive artifacts, the thesis that intelligence is at bottom\ncomputational (at the level of Turing machines and their equivalents,\ne.g., Register machines). So there is a philosophical claim, for sure.\nBut this doesn’t make AI philosophy, any more than some of the\ndeeper, more aggressive claims of some physicists (e.g., that the\n universe is ultimately digital in nature)\n make their field philosophy. Philosophy of physics certainly\nentertains the proposition that the physical universe can be\nperfectly modeled in digital terms (in a series of cellular automata,\ne.g.), but of course philosophy of physics can’t be\nidentified with this doctrine. \n\nSecond, we now know well (and those familiar with the relevant formal\nterrain knew at the time of Dennett’s writing) that information\nprocessing can exceed standard computation, that is, can exceed\ncomputation at and below the level of what a Turing machine can muster\n(Turing-computation, we shall say). (Such information\nprocessing is known as hypercomputation, a term coined by\nphilosopher Jack Copeland, who has himself defined such machines\n(e.g., Copeland 1998). The first machines capable of hypercomputation\nwere trial-and-error machines, introduced in the same famous\nissue of the Journal of Symbolic Logic (Gold 1965; Putnam\n1965). A new hypercomputer is the infinite time Turing machine\n(Hamkins & Lewis 2000).) Dennett’s appeal to Church’s\nthesis thus flies in the face of the mathematical facts: some\nvarieties of information processing exceed standard computation (or\nTuring-computation). Church’s thesis, or more precisely, the\nChurch-Turing thesis, is the view that a function \\(f\\) is effectively\ncomputable if and only if \\(f\\) is Turing-computable (i.e., some\nTuring machine can compute \\(f\\)). Thus, this thesis has nothing to\nsay about information processing that is more demanding than what a\nTuring machine can achieve. (Put another way, there is no\ncounter-example to CTT to be automatically found in an\ninformation-processing device capable of feats beyond the reach of\nTMs.) For all philosophy and psychology know, intelligence, even if\ntied to information processing, exceeds what is Turing-computational\nor\n Turing-mechanical.[38]\n This is especially true because philosophy and psychology, unlike AI,\nare in no way fundamentally charged with engineering artifacts, which\nmakes the physical realizability of hypercomputation irrelevant from\ntheir perspectives. Therefore, contra Dennett, to consider AI\nas psychology or philosophy is to commit a serious error, precisely\nbecause so doing would box these fields into only a speck of the\nentire space of functions from the natural numbers (including tuples\ntherefrom) to the natural numbers. (Only a tiny portion of the\nfunctions in this space are Turing-computable.) AI is without question\nmuch, much narrower than this pair of fields. Of course, it’s\npossible that AI could be replaced by a field devoted not to building\ncomputational artifacts by writing computer programs and running them\non embodied Turing machines. But this new field, by definition, would\nnot be AI. Our exploration of AIMA and other textbooks provide\ndirect empirical confirmation of this. \n\nThird, most AI researchers and developers, in point of fact, are\nsimply concerned with building useful, profitable artifacts, and\ndon’t spend much time reflecting upon the kinds of abstract\ndefinitions of intelligence explored in this entry (e.g.,\n What Exactly is AI?).\n \n\nThough AI isn’t philosophy, there are certainly ways of doing\nreal implementation-focussed AI of the highest caliber that are\nintimately bound up with philosophy. The best way to demonstrate this\nis to simply present such research and development, or at least a\nrepresentative example thereof. While there have been many examples of\nsuch work, the most prominent example in AI is John Pollock’s\nOSCAR project, which stretched over a considerable portion of his\nlifetime. For a detailed presentation and further discussion, see\nthe\n\nSupplement on the OSCAR Project.\n\n\nIt’s important to note at this juncture that the OSCAR project,\nand the information processing that underlies it, are without question\nat once philosophy and technical AI. Given that the work in\nquestion has appeared in the pages of Artificial Intelligence,\na first-rank journal devoted to that field, and not to philosophy,\nthis is undeniable (see, e.g., Pollock 2001, 1992). This point is\nimportant because while it’s certainly appropriate, in the\npresent venue, to emphasize connections between AI and philosophy,\nsome readers may suspect that this emphasis is contrived: they may\nsuspect that the truth of the matter is that page after page of AI\njournals are filled with narrow, technical content far from\nphilosophy. Many such papers do exist. But we must distinguish between\nwritings designed to present the nature of AI, and its core methods\nand goals, versus writings designed to present progress on specific\ntechnical issues. \n\nWritings in the latter category are more often than not quite narrow,\nbut, as the example of Pollock shows, sometimes these specific issues\nare inextricably linked to philosophy. And of course Pollock’s\nwork is a representative example (albeit the most substantive one).\nOne could just as easily have selected work by folks who don’t\nhappen to also produce straight philosophy. For example, for an entire\nbook written within the confines of AI and computer science, but which\nis epistemic logic in action in many ways, suitable for use in\nseminars on that topic, see (Fagin et al. 2004). (It is hard to find\ntechnical work that isn’t bound up with philosophy in some\ndirect way. E.g., AI research on learning is all intimately bound up\nwith philosophical treatments of induction, of how genuinely new\nconcepts not simply defined in terms of prior ones can be learned. One\npossible partial answer offered by AI is inductive logic\nprogramming, discussed in Chapter 19 of AIMA.) \n\nWhat of writings in the former category? Writings in this category,\nwhile by definition in AI venues, not philosophy ones, are nonetheless\nphilosophical. Most textbooks include plenty of material that falls\ninto this latter category, and hence they include discussion of the\nphilosophical nature of AI (e.g., that AI is aimed at building\nartificial intelligences, and that’s why, after all, it’s\ncalled ‘AI’). \n",
    "section_title": "7. Philosophical AI",
    "entry_title": "Artificial Intelligence",
    "hierarchy_title": "Artificial Intelligence || Philosophical AI",
    "tokenized_text": [
        "philosophical",
        "ai",
        "philosophical",
        "ai",
        "notice",
        "heading",
        "section",
        "philosophy",
        "ai",
        "get",
        "category",
        "momentarily",
        "identified",
        "attempt",
        "answer",
        "question",
        "whether",
        "artificial",
        "agent",
        "created",
        "ai",
        "ever",
        "reach",
        "full",
        "height",
        "human",
        "intelligence",
        "philosophical",
        "ai",
        "ai",
        "philosophy",
        "ai",
        "rooted",
        "flowing",
        "philosophy",
        "example",
        "one",
        "could",
        "engage",
        "using",
        "tool",
        "technique",
        "philosophy",
        "paradox",
        "work",
        "proposed",
        "solution",
        "proceed",
        "step",
        "surely",
        "optional",
        "philosopher",
        "expressing",
        "solution",
        "term",
        "translated",
        "computer",
        "program",
        "executed",
        "allows",
        "artificial",
        "agent",
        "surmount",
        "concrete",
        "instance",
        "original",
        "paradox",
        "ostensively",
        "characterize",
        "philosophical",
        "ai",
        "sort",
        "courtesy",
        "particular",
        "research",
        "program",
        "let",
        "u",
        "consider",
        "first",
        "view",
        "ai",
        "fact",
        "simply",
        "philosophy",
        "part",
        "thereof",
        "daniel",
        "dennett",
        "famously",
        "claimed",
        "part",
        "ai",
        "intimately",
        "bound",
        "philosophy",
        "ai",
        "philosophy",
        "psychology",
        "least",
        "cognitive",
        "sort",
        "made",
        "parallel",
        "claim",
        "artificial",
        "life",
        "dennett",
        "view",
        "turn",
        "incorrect",
        "reason",
        "wrong",
        "prove",
        "illuminating",
        "discussion",
        "pave",
        "way",
        "discussion",
        "philosophical",
        "ai",
        "dennett",
        "say",
        "exactly",
        "want",
        "claim",
        "ai",
        "better",
        "viewed",
        "sharing",
        "traditional",
        "epistemology",
        "status",
        "general",
        "abstract",
        "asking",
        "topdown",
        "question",
        "knowledge",
        "possible",
        "dennett",
        "elsewhere",
        "say",
        "view",
        "ai",
        "viewed",
        "abstract",
        "inquiry",
        "possibility",
        "intelligence",
        "knowledge",
        "dennett",
        "short",
        "dennett",
        "hold",
        "ai",
        "attempt",
        "explain",
        "intelligence",
        "studying",
        "brain",
        "hope",
        "identifying",
        "component",
        "cognition",
        "reduced",
        "engineering",
        "small",
        "informationprocessing",
        "unit",
        "one",
        "build",
        "bottomup",
        "fashion",
        "highlevel",
        "cognitive",
        "process",
        "rather",
        "say",
        "approach",
        "topdown",
        "designing",
        "implementing",
        "abstract",
        "algorithm",
        "capture",
        "cognition",
        "leaving",
        "aside",
        "fact",
        "least",
        "starting",
        "early",
        "s",
        "ai",
        "includes",
        "approach",
        "sense",
        "bottomup",
        "see",
        "neurocomputational",
        "paradigm",
        "discussed",
        "nonlogicist",
        "ai",
        "summary",
        "see",
        "specifically",
        "granger",
        "a",
        "b",
        "work",
        "hyperlinked",
        "text",
        "immediately",
        "specific",
        "counterexample",
        "fatal",
        "flaw",
        "infects",
        "dennett",
        "view",
        "dennett",
        "see",
        "potential",
        "flaw",
        "reflected",
        "seemed",
        "philosopher",
        "ai",
        "plausibly",
        "construed",
        "take",
        "additional",
        "burden",
        "restricts",
        "mechanistic",
        "solution",
        "hence",
        "domain",
        "kantian",
        "domain",
        "possible",
        "mode",
        "intelligence",
        "possible",
        "mechanistically",
        "realizable",
        "mode",
        "intelligence",
        "claimed",
        "would",
        "beg",
        "question",
        "vitalist",
        "dualist",
        "antimechanists",
        "dennett",
        "dennett",
        "ready",
        "answer",
        "objection",
        "writes",
        "mechanism",
        "requirement",
        "ai",
        "additional",
        "constraint",
        "moment",
        "psychology",
        "possible",
        "church",
        "thesis",
        "true",
        "constraint",
        "mechanism",
        "severe",
        "constraint",
        "begging",
        "question",
        "psychology",
        "would",
        "wish",
        "evade",
        "dennett",
        "unfortunately",
        "acutely",
        "problematic",
        "examination",
        "problem",
        "throw",
        "light",
        "nature",
        "ai",
        "first",
        "insofar",
        "philosophy",
        "psychology",
        "concerned",
        "nature",
        "mind",
        "least",
        "trammeled",
        "presupposition",
        "mentation",
        "consists",
        "computation",
        "ai",
        "least",
        "strong",
        "variety",
        "discus",
        "strong",
        "versus",
        "weak",
        "ai",
        "indeed",
        "attempt",
        "substantiate",
        "engineering",
        "certain",
        "impressive",
        "artifact",
        "thesis",
        "intelligence",
        "bottom",
        "computational",
        "level",
        "turing",
        "machine",
        "equivalent",
        "eg",
        "register",
        "machine",
        "philosophical",
        "claim",
        "sure",
        "make",
        "ai",
        "philosophy",
        "deeper",
        "aggressive",
        "claim",
        "physicist",
        "eg",
        "universe",
        "ultimately",
        "digital",
        "nature",
        "make",
        "field",
        "philosophy",
        "philosophy",
        "physic",
        "certainly",
        "entertains",
        "proposition",
        "physical",
        "universe",
        "perfectly",
        "modeled",
        "digital",
        "term",
        "series",
        "cellular",
        "automaton",
        "eg",
        "course",
        "philosophy",
        "physic",
        "identified",
        "doctrine",
        "second",
        "know",
        "well",
        "familiar",
        "relevant",
        "formal",
        "terrain",
        "knew",
        "time",
        "dennett",
        "writing",
        "information",
        "processing",
        "exceed",
        "standard",
        "computation",
        "exceed",
        "computation",
        "level",
        "turing",
        "machine",
        "muster",
        "turingcomputation",
        "shall",
        "say",
        "information",
        "processing",
        "known",
        "hypercomputation",
        "term",
        "coined",
        "philosopher",
        "jack",
        "copeland",
        "defined",
        "machine",
        "eg",
        "copeland",
        "first",
        "machine",
        "capable",
        "hypercomputation",
        "trialanderror",
        "machine",
        "introduced",
        "famous",
        "issue",
        "journal",
        "symbolic",
        "logic",
        "gold",
        "putnam",
        "new",
        "hypercomputer",
        "infinite",
        "time",
        "turing",
        "machine",
        "hamkins",
        "lewis",
        "dennett",
        "appeal",
        "church",
        "thesis",
        "thus",
        "fly",
        "face",
        "mathematical",
        "fact",
        "variety",
        "information",
        "processing",
        "exceed",
        "standard",
        "computation",
        "turingcomputation",
        "church",
        "thesis",
        "precisely",
        "churchturing",
        "thesis",
        "view",
        "function",
        "f",
        "effectively",
        "computable",
        "f",
        "turingcomputable",
        "ie",
        "turing",
        "machine",
        "compute",
        "f",
        "thus",
        "thesis",
        "nothing",
        "say",
        "information",
        "processing",
        "demanding",
        "turing",
        "machine",
        "achieve",
        "put",
        "another",
        "way",
        "counterexample",
        "ctt",
        "automatically",
        "found",
        "informationprocessing",
        "device",
        "capable",
        "feat",
        "beyond",
        "reach",
        "tm",
        "philosophy",
        "psychology",
        "know",
        "intelligence",
        "even",
        "tied",
        "information",
        "processing",
        "exceeds",
        "turingcomputational",
        "turingmechanical",
        "especially",
        "true",
        "philosophy",
        "psychology",
        "unlike",
        "ai",
        "way",
        "fundamentally",
        "charged",
        "engineering",
        "artifact",
        "make",
        "physical",
        "realizability",
        "hypercomputation",
        "irrelevant",
        "perspective",
        "therefore",
        "contra",
        "dennett",
        "consider",
        "ai",
        "psychology",
        "philosophy",
        "commit",
        "serious",
        "error",
        "precisely",
        "would",
        "box",
        "field",
        "speck",
        "entire",
        "space",
        "function",
        "natural",
        "number",
        "including",
        "tuples",
        "therefrom",
        "natural",
        "number",
        "tiny",
        "portion",
        "function",
        "space",
        "turingcomputable",
        "ai",
        "without",
        "question",
        "much",
        "much",
        "narrower",
        "pair",
        "field",
        "course",
        "possible",
        "ai",
        "could",
        "replaced",
        "field",
        "devoted",
        "building",
        "computational",
        "artifact",
        "writing",
        "computer",
        "program",
        "running",
        "embodied",
        "turing",
        "machine",
        "new",
        "field",
        "definition",
        "would",
        "ai",
        "exploration",
        "aima",
        "textbook",
        "provide",
        "direct",
        "empirical",
        "confirmation",
        "third",
        "ai",
        "researcher",
        "developer",
        "point",
        "fact",
        "simply",
        "concerned",
        "building",
        "useful",
        "profitable",
        "artifact",
        "spend",
        "much",
        "time",
        "reflecting",
        "upon",
        "kind",
        "abstract",
        "definition",
        "intelligence",
        "explored",
        "entry",
        "eg",
        "exactly",
        "ai",
        "though",
        "ai",
        "philosophy",
        "certainly",
        "way",
        "real",
        "implementationfocussed",
        "ai",
        "highest",
        "caliber",
        "intimately",
        "bound",
        "philosophy",
        "best",
        "way",
        "demonstrate",
        "simply",
        "present",
        "research",
        "development",
        "least",
        "representative",
        "example",
        "thereof",
        "many",
        "example",
        "work",
        "prominent",
        "example",
        "ai",
        "john",
        "pollock",
        "oscar",
        "project",
        "stretched",
        "considerable",
        "portion",
        "lifetime",
        "detailed",
        "presentation",
        "discussion",
        "see",
        "supplement",
        "oscar",
        "project",
        "important",
        "note",
        "juncture",
        "oscar",
        "project",
        "information",
        "processing",
        "underlies",
        "without",
        "question",
        "philosophy",
        "technical",
        "ai",
        "given",
        "work",
        "question",
        "appeared",
        "page",
        "artificial",
        "intelligence",
        "firstrank",
        "journal",
        "devoted",
        "field",
        "philosophy",
        "undeniable",
        "see",
        "eg",
        "pollock",
        "point",
        "important",
        "certainly",
        "appropriate",
        "present",
        "venue",
        "emphasize",
        "connection",
        "ai",
        "philosophy",
        "reader",
        "may",
        "suspect",
        "emphasis",
        "contrived",
        "may",
        "suspect",
        "truth",
        "matter",
        "page",
        "page",
        "ai",
        "journal",
        "filled",
        "narrow",
        "technical",
        "content",
        "far",
        "philosophy",
        "many",
        "paper",
        "exist",
        "must",
        "distinguish",
        "writing",
        "designed",
        "present",
        "nature",
        "ai",
        "core",
        "method",
        "goal",
        "versus",
        "writing",
        "designed",
        "present",
        "progress",
        "specific",
        "technical",
        "issue",
        "writing",
        "latter",
        "category",
        "often",
        "quite",
        "narrow",
        "example",
        "pollock",
        "show",
        "sometimes",
        "specific",
        "issue",
        "inextricably",
        "linked",
        "philosophy",
        "course",
        "pollock",
        "work",
        "representative",
        "example",
        "albeit",
        "substantive",
        "one",
        "one",
        "could",
        "easily",
        "selected",
        "work",
        "folk",
        "happen",
        "also",
        "produce",
        "straight",
        "philosophy",
        "example",
        "entire",
        "book",
        "written",
        "within",
        "confines",
        "ai",
        "computer",
        "science",
        "epistemic",
        "logic",
        "action",
        "many",
        "way",
        "suitable",
        "use",
        "seminar",
        "topic",
        "see",
        "fagin",
        "et",
        "al",
        "hard",
        "find",
        "technical",
        "work",
        "bound",
        "philosophy",
        "direct",
        "way",
        "eg",
        "ai",
        "research",
        "learning",
        "intimately",
        "bound",
        "philosophical",
        "treatment",
        "induction",
        "genuinely",
        "new",
        "concept",
        "simply",
        "defined",
        "term",
        "prior",
        "one",
        "learned",
        "one",
        "possible",
        "partial",
        "answer",
        "offered",
        "ai",
        "inductive",
        "logic",
        "programming",
        "discussed",
        "chapter",
        "aima",
        "writing",
        "former",
        "category",
        "writing",
        "category",
        "definition",
        "ai",
        "venue",
        "philosophy",
        "one",
        "nonetheless",
        "philosophical",
        "textbook",
        "include",
        "plenty",
        "material",
        "fall",
        "latter",
        "category",
        "hence",
        "include",
        "discussion",
        "philosophical",
        "nature",
        "ai",
        "eg",
        "ai",
        "aimed",
        "building",
        "artificial",
        "intelligence",
        "called",
        "ai"
    ]
}