{
    "main_text": "Epistemology || Knowing Artifacts\n3.3 Thinking and Acting With Artifacts\n\nArtifacts are not only objects of knowledge; they are also involved in\ncognition itself. No one disputes that humans use artifacts in their\ncognitive practices—we do our sums on paper or with electronic\ndevices; and memory aids from individual grocery lists to monuments\nenshrining cultural memory are ubiquitous. But in recent years a\nloosely interconnected collection of approaches has characterized\nartifacts as much more intimately involved in these processes than\nmere use might suggest. Rather than trying to sort out the complex\nfamily resemblances among embodied, enactive, situated, distributed\nand extended approaches to cognition (Sutton 2006; Wilson & Clark\n2009), we can more profitably focus on some representative studies of\nthe way artifacts contribute to cognition in this family of\nviews.\n\nIn a seminal paper, Andy Clark and David Chalmers (1998) propose the\nradical thesis that the mind extends beyond the brain and the body,\nright out into the environment. In their now famous illustration, two\ncharacters, Inga and Otto, hear about an interesting exhibition at the\nMuseum of Modern Art. Inga is neurotypical. She recalls the address of\nthe museum and travels there. Otto, on the other hand, has\nAlzheimer’s disease. Because he forgets things so easily, he\nmaintains a notebook with the addresses of places he is wont to visit.\nHe looks up the address of the museum and travels there. The moral of\nthis illustration is the so-called Parity Principle.\n\n\nIf, as we confront some task, a part of the world functions as a\nprocess which, were it done in the head, we would have no\nhesitation in recognizing as part of the cognitive process, then that\npart of the world is (so we claim) part of the cognitive process.\n(Clark & Chalmers 1998, 8)\n\n\nThis claim is intended as a thesis in the metaphysics of mind, but it\nfunctions equally well as a thesis about the epistemic status of\nartifacts. In Otto’s case—and it is clear Clark and\nChalmers intend it not as an exceptional case, but as a particularly\nstriking instance of a commonplace one—the notebook is cognitive\nin its own right. It is an essential element of a widely individuated\ncognitive process, not a cognitively neutral tool used by an\nencapsulated cognizer. Critics of the extended mind thesis have been,\nif not legion, extremely persistent (Menary 2010). But they have\nfocused mostly on the disconcerting metaphysical implications, rather\nthan on the equally significant implications about cognition. John\nSutton (2010) anticipates the metaphysical tendentiousness of the\nParity Principle giving way to the important work of understanding the\ncomplementarity of inner and outer processes in cognition which is\nhighlighted by the extended mind thesis. Individuating cognitive\nprocesses widely, so that the unit of investigation is not the\nmind/brain but cognitive systems comprising tightly coupled artifacts,\npeople, built environments and natural environments, is a viable\nproject in its own right, and one that was underway in many quarters\nbefore the extended mind thesis was proposed.\n\nThe locus classicus is Edwin Hutchins’ Cognition in\nthe Wild (1995). Hutchins preserves the traditional understanding\nof cognition as computation—that is, the manipulation of\nrepresentations. But he argues that this computation takes place not\nin individual heads, but distributed across systems of individuals,\nartifacts, and other environmental structures. Hutchins works out his\ntheory of distributed cognition in the context of a magisterial study\nof navigation aboard a US Navy ship. He shows that the representations\nand transformations thereof required for navigation are propagated\nacross a complex system of charts, logs, instruments and cooperating\nhumans, no one of whom is either directing the process or in\npossession of all the knowledge the system uses or produces.\nHutchins’ own studies typically involve cognition in\ntechnologically sophisticated workplaces. But other researchers in the\ndistributed cognition vein apply the theory to more easily accessible\neveryday situations. David Kirsh (1995) argues that we use the\nplacement of artifacts in the surrounding space to simplify our\ncognitive lives in various ways. For example, baggers in a grocery\nstore will first group different types of items—large, heavy,\nfragile, and so on—on the checkout counter before starting to\npack the bags. This simplifies the cognitive task of spotting the\nlarge heavy items you need for the bottom of the bag, or the medium\nsized boxed items you need to fill in spaces half way up. Similarly,\nsomeone preparing to bake a cake will often array all the ingredients\non the kitchen counter first, thus minimizing the possibility that any\nwill be left out in the heat of the moment. The general point,\nemphasized across the board by proponents of situated cognition, is\nthat artifacts and other environmental structures\n“scaffold” cognition, changing the nature of cognitive\ntasks in important ways that typically make them more tractable (Lave\n1988; Donald 1991; Clark 1997; Kirsh 2009; Michaelian & Sutton\n2013).\n\nCognition is intimately bound up with action on any construal, but the\nsituated cognition framework makes it even more difficult to tease\nthem apart. On a more traditional view, the emphasis is on how\ncognition shapes action. But on the situated cognition family of\nviews, the emphasis is on how bodily activity antecedently shapes\ncognition, and indeed the mind in general (Gallagher 2005). Since\nhuman action typically involves the making and manipulation of\nartifacts, they, too, contribute to this mind-shaping process\n(Malafouris 2013). But artifacts shape action and patterns of behavior\nin the first instance. Some writers have focused on this\naction-shaping aspect of artifacts rather than on the\ncognition-shaping aspect. The locus classicus in this case is\nMichel Foucault’s (1975 [1977]) Discipline and Punish.\nOn Foucault’s view, human action is substantially shaped by the\nvery layout of the built environment and the specifics of the smaller\nartifacts that furnish it, not—as we naively tend to\nassume—primarily by the interpersonal relationships of the\ninhabitants. The most obvious examples seem innocuous. In chair\ncultures, for instance, people sit upright and off the floor to eat\nmeals, while in non-chair cultures such as Japan they sit in various\npostures—depending on the social situation—on cushions on\nthe floor. But Foucault focuses on less innocuous examples such as\nprisons, which shape action in ways that manifest the exercise of\nsocial power. He contrasts the dungeon model, in which behavior is\ntemporarily shaped simply by sheer physical control over the\nprisoners’ freedom of movement, with the Panopticon model, in\nwhich the prisoners are kept under constant surveillance by invisible\nobservers, prompting them to shape their own behavior in various\nhabitual ways that survive the term of their imprisonment. This\nensures a kind of continuing social control not available under the\ndungeon model. Foucault’s further point is that this\n“disciplinary” model is now pervasive in social\ninstitutions from education to workplace to health care to the\n“smart” home. Related themes surface in Bruno\nLatour’s (1994; 1999) technical mediation theory. On his\nview, agency is not a property of individual humans, but rather of\ncollectives of “actants”—humans and nonhumans\nrelated to each other in specific, systematic ways. In contemporary\nwestern culture, the non-human actants are typically artifacts.\nLatour’s telling illustration starts with the well-known dispute\nbetween gun control advocates, who insist that “guns kill”\nand the National Rifle Association, which insists that “people\nkill”. Against both of these positions, Latour argues that the\nagent who kills is neither the gun nor the person, but a composite\nperson-gun (or gun-person). Neither the person nor the gun remains the\nsame in this relational context as they were before. Moreover, Latour\nargues, the relationship is symmetrical. Just as humans have\nintentions that enable them to enlist specific artifacts, artifacts\nhave “scripts”—features of their design that enable\nthem to enlist humans, facilitating certain behaviors and inhibiting\nothers. Both Foucault and Latour tend to study the phenomena of human\naction in large-scale, institutional contexts—prisons and\nhospitals in the case of Foucault, scientific laboratories and\ntransportation systems in the case of the actor-network theory\npioneered by Latour and others. But there are also a number of writers\nwho focus on the role of artifacts in small-scale, everyday contexts.\nTim Ingold (2013), for example, focuses on skilled practice,\nparticularly in the context of making things, from stone tools to\nbaskets to paintings. His work shows that the generation of\nartifactual structure is as much due to the nature of the materials\nused as to any intention or plan on the part of the maker. Moreover,\nthe nature of the materials and the tools used structure the activity\nof making itself. In a similar vein, Beth Preston (2013) argues that\nhuman action is more a matter of improvisation than planning, and that\nthe continuously evolving structure of improvisatory action owes much\nto the opportunities artifacts afford. Furthermore, it is in\ninteraction with artifacts in daily life that we develop the purposes\nand behavior patterns appropriate to them. Thus, having started with a\ntraditional definition of “artifact” that emphasizes the\ndependence of artifacts on human intentions and purposes, the\nepistemology of artifacts brings us back around to a view that\nemphasizes instead the dependence of human cognition and action on\nartifacts.\n",
    "section_title": "3.3 Thinking and Acting With Artifacts",
    "entry_title": "Artifact",
    "hierarchy_title": "Artifact || Epistemology || Knowing Artifacts",
    "tokenized_text": [
        "epistemology",
        "knowing",
        "artifact",
        "thinking",
        "acting",
        "artifact",
        "artifact",
        "object",
        "knowledge",
        "also",
        "involved",
        "cognition",
        "one",
        "dispute",
        "human",
        "use",
        "artifact",
        "cognitive",
        "practiceswe",
        "sum",
        "paper",
        "electronic",
        "device",
        "memory",
        "aid",
        "individual",
        "grocery",
        "list",
        "monument",
        "enshrining",
        "cultural",
        "memory",
        "ubiquitous",
        "recent",
        "year",
        "loosely",
        "interconnected",
        "collection",
        "approach",
        "characterized",
        "artifact",
        "much",
        "intimately",
        "involved",
        "process",
        "mere",
        "use",
        "might",
        "suggest",
        "rather",
        "trying",
        "sort",
        "complex",
        "family",
        "resemblance",
        "among",
        "embodied",
        "enactive",
        "situated",
        "distributed",
        "extended",
        "approach",
        "cognition",
        "sutton",
        "wilson",
        "clark",
        "profitably",
        "focus",
        "representative",
        "study",
        "way",
        "artifact",
        "contribute",
        "cognition",
        "family",
        "view",
        "seminal",
        "paper",
        "andy",
        "clark",
        "david",
        "chalmers",
        "propose",
        "radical",
        "thesis",
        "mind",
        "extends",
        "beyond",
        "brain",
        "body",
        "right",
        "environment",
        "famous",
        "illustration",
        "two",
        "character",
        "inga",
        "otto",
        "hear",
        "interesting",
        "exhibition",
        "museum",
        "modern",
        "art",
        "inga",
        "neurotypical",
        "recall",
        "address",
        "museum",
        "travel",
        "otto",
        "hand",
        "alzheimer",
        "disease",
        "forgets",
        "thing",
        "easily",
        "maintains",
        "notebook",
        "address",
        "place",
        "wont",
        "visit",
        "look",
        "address",
        "museum",
        "travel",
        "moral",
        "illustration",
        "socalled",
        "parity",
        "principle",
        "confront",
        "task",
        "part",
        "world",
        "function",
        "process",
        "done",
        "head",
        "would",
        "hesitation",
        "recognizing",
        "part",
        "cognitive",
        "process",
        "part",
        "world",
        "claim",
        "part",
        "cognitive",
        "process",
        "clark",
        "chalmers",
        "claim",
        "intended",
        "thesis",
        "metaphysics",
        "mind",
        "function",
        "equally",
        "well",
        "thesis",
        "epistemic",
        "status",
        "artifact",
        "otto",
        "caseand",
        "clear",
        "clark",
        "chalmers",
        "intend",
        "exceptional",
        "case",
        "particularly",
        "striking",
        "instance",
        "commonplace",
        "onethe",
        "notebook",
        "cognitive",
        "right",
        "essential",
        "element",
        "widely",
        "individuated",
        "cognitive",
        "process",
        "cognitively",
        "neutral",
        "tool",
        "used",
        "encapsulated",
        "cognizer",
        "critic",
        "extended",
        "mind",
        "thesis",
        "legion",
        "extremely",
        "persistent",
        "menary",
        "focused",
        "mostly",
        "disconcerting",
        "metaphysical",
        "implication",
        "rather",
        "equally",
        "significant",
        "implication",
        "cognition",
        "john",
        "sutton",
        "anticipates",
        "metaphysical",
        "tendentiousness",
        "parity",
        "principle",
        "giving",
        "way",
        "important",
        "work",
        "understanding",
        "complementarity",
        "inner",
        "outer",
        "process",
        "cognition",
        "highlighted",
        "extended",
        "mind",
        "thesis",
        "individuating",
        "cognitive",
        "process",
        "widely",
        "unit",
        "investigation",
        "mindbrain",
        "cognitive",
        "system",
        "comprising",
        "tightly",
        "coupled",
        "artifact",
        "people",
        "built",
        "environment",
        "natural",
        "environment",
        "viable",
        "project",
        "right",
        "one",
        "underway",
        "many",
        "quarter",
        "extended",
        "mind",
        "thesis",
        "proposed",
        "locus",
        "classicus",
        "edwin",
        "hutchins",
        "cognition",
        "wild",
        "hutchins",
        "preserve",
        "traditional",
        "understanding",
        "cognition",
        "computationthat",
        "manipulation",
        "representation",
        "argues",
        "computation",
        "take",
        "place",
        "individual",
        "head",
        "distributed",
        "across",
        "system",
        "individual",
        "artifact",
        "environmental",
        "structure",
        "hutchins",
        "work",
        "theory",
        "distributed",
        "cognition",
        "context",
        "magisterial",
        "study",
        "navigation",
        "aboard",
        "u",
        "navy",
        "ship",
        "show",
        "representation",
        "transformation",
        "thereof",
        "required",
        "navigation",
        "propagated",
        "across",
        "complex",
        "system",
        "chart",
        "log",
        "instrument",
        "cooperating",
        "human",
        "one",
        "either",
        "directing",
        "process",
        "possession",
        "knowledge",
        "system",
        "us",
        "produce",
        "hutchins",
        "study",
        "typically",
        "involve",
        "cognition",
        "technologically",
        "sophisticated",
        "workplace",
        "researcher",
        "distributed",
        "cognition",
        "vein",
        "apply",
        "theory",
        "easily",
        "accessible",
        "everyday",
        "situation",
        "david",
        "kirsh",
        "argues",
        "use",
        "placement",
        "artifact",
        "surrounding",
        "space",
        "simplify",
        "cognitive",
        "life",
        "various",
        "way",
        "example",
        "bagger",
        "grocery",
        "store",
        "first",
        "group",
        "different",
        "type",
        "itemslarge",
        "heavy",
        "fragile",
        "onon",
        "checkout",
        "counter",
        "starting",
        "pack",
        "bag",
        "simplifies",
        "cognitive",
        "task",
        "spotting",
        "large",
        "heavy",
        "item",
        "need",
        "bottom",
        "bag",
        "medium",
        "sized",
        "boxed",
        "item",
        "need",
        "fill",
        "space",
        "half",
        "way",
        "similarly",
        "someone",
        "preparing",
        "bake",
        "cake",
        "often",
        "array",
        "ingredient",
        "kitchen",
        "counter",
        "first",
        "thus",
        "minimizing",
        "possibility",
        "left",
        "heat",
        "moment",
        "general",
        "point",
        "emphasized",
        "across",
        "board",
        "proponent",
        "situated",
        "cognition",
        "artifact",
        "environmental",
        "structure",
        "scaffold",
        "cognition",
        "changing",
        "nature",
        "cognitive",
        "task",
        "important",
        "way",
        "typically",
        "make",
        "tractable",
        "lave",
        "donald",
        "clark",
        "kirsh",
        "michaelian",
        "sutton",
        "cognition",
        "intimately",
        "bound",
        "action",
        "construal",
        "situated",
        "cognition",
        "framework",
        "make",
        "even",
        "difficult",
        "tease",
        "apart",
        "traditional",
        "view",
        "emphasis",
        "cognition",
        "shape",
        "action",
        "situated",
        "cognition",
        "family",
        "view",
        "emphasis",
        "bodily",
        "activity",
        "antecedently",
        "shape",
        "cognition",
        "indeed",
        "mind",
        "general",
        "gallagher",
        "since",
        "human",
        "action",
        "typically",
        "involves",
        "making",
        "manipulation",
        "artifact",
        "contribute",
        "mindshaping",
        "process",
        "malafouris",
        "artifact",
        "shape",
        "action",
        "pattern",
        "behavior",
        "first",
        "instance",
        "writer",
        "focused",
        "actionshaping",
        "aspect",
        "artifact",
        "rather",
        "cognitionshaping",
        "aspect",
        "locus",
        "classicus",
        "case",
        "michel",
        "foucault",
        "discipline",
        "punish",
        "foucault",
        "view",
        "human",
        "action",
        "substantially",
        "shaped",
        "layout",
        "built",
        "environment",
        "specific",
        "smaller",
        "artifact",
        "furnish",
        "notas",
        "naively",
        "tend",
        "assumeprimarily",
        "interpersonal",
        "relationship",
        "inhabitant",
        "obvious",
        "example",
        "seem",
        "innocuous",
        "chair",
        "culture",
        "instance",
        "people",
        "sit",
        "upright",
        "floor",
        "eat",
        "meal",
        "nonchair",
        "culture",
        "japan",
        "sit",
        "various",
        "posturesdepending",
        "social",
        "situationon",
        "cushion",
        "floor",
        "foucault",
        "focus",
        "le",
        "innocuous",
        "example",
        "prison",
        "shape",
        "action",
        "way",
        "manifest",
        "exercise",
        "social",
        "power",
        "contrast",
        "dungeon",
        "model",
        "behavior",
        "temporarily",
        "shaped",
        "simply",
        "sheer",
        "physical",
        "control",
        "prisoner",
        "freedom",
        "movement",
        "panopticon",
        "model",
        "prisoner",
        "kept",
        "constant",
        "surveillance",
        "invisible",
        "observer",
        "prompting",
        "shape",
        "behavior",
        "various",
        "habitual",
        "way",
        "survive",
        "term",
        "imprisonment",
        "ensures",
        "kind",
        "continuing",
        "social",
        "control",
        "available",
        "dungeon",
        "model",
        "foucault",
        "point",
        "disciplinary",
        "model",
        "pervasive",
        "social",
        "institution",
        "education",
        "workplace",
        "health",
        "care",
        "smart",
        "home",
        "related",
        "theme",
        "surface",
        "bruno",
        "latour",
        "technical",
        "mediation",
        "theory",
        "view",
        "agency",
        "property",
        "individual",
        "human",
        "rather",
        "collective",
        "actants",
        "humans",
        "nonhumans",
        "related",
        "specific",
        "systematic",
        "way",
        "contemporary",
        "western",
        "culture",
        "nonhuman",
        "actants",
        "typically",
        "artifact",
        "latour",
        "telling",
        "illustration",
        "start",
        "wellknown",
        "dispute",
        "gun",
        "control",
        "advocate",
        "insist",
        "gun",
        "kill",
        "national",
        "rifle",
        "association",
        "insists",
        "people",
        "kill",
        "position",
        "latour",
        "argues",
        "agent",
        "kill",
        "neither",
        "gun",
        "person",
        "composite",
        "persongun",
        "gunperson",
        "neither",
        "person",
        "gun",
        "remains",
        "relational",
        "context",
        "moreover",
        "latour",
        "argues",
        "relationship",
        "symmetrical",
        "human",
        "intention",
        "enable",
        "enlist",
        "specific",
        "artifact",
        "artifact",
        "script",
        "features",
        "design",
        "enable",
        "enlist",
        "human",
        "facilitating",
        "certain",
        "behavior",
        "inhibiting",
        "others",
        "foucault",
        "latour",
        "tend",
        "study",
        "phenomenon",
        "human",
        "action",
        "largescale",
        "institutional",
        "contextsprisons",
        "hospital",
        "case",
        "foucault",
        "scientific",
        "laboratory",
        "transportation",
        "system",
        "case",
        "actornetwork",
        "theory",
        "pioneered",
        "latour",
        "others",
        "also",
        "number",
        "writer",
        "focus",
        "role",
        "artifact",
        "smallscale",
        "everyday",
        "context",
        "tim",
        "ingold",
        "example",
        "focus",
        "skilled",
        "practice",
        "particularly",
        "context",
        "making",
        "thing",
        "stone",
        "tool",
        "basket",
        "painting",
        "work",
        "show",
        "generation",
        "artifactual",
        "structure",
        "much",
        "due",
        "nature",
        "material",
        "used",
        "intention",
        "plan",
        "part",
        "maker",
        "moreover",
        "nature",
        "material",
        "tool",
        "used",
        "structure",
        "activity",
        "making",
        "similar",
        "vein",
        "beth",
        "preston",
        "argues",
        "human",
        "action",
        "matter",
        "improvisation",
        "planning",
        "continuously",
        "evolving",
        "structure",
        "improvisatory",
        "action",
        "owes",
        "much",
        "opportunity",
        "artifact",
        "afford",
        "furthermore",
        "interaction",
        "artifact",
        "daily",
        "life",
        "develop",
        "purpose",
        "behavior",
        "pattern",
        "appropriate",
        "thus",
        "started",
        "traditional",
        "definition",
        "artifact",
        "emphasizes",
        "dependence",
        "artifact",
        "human",
        "intention",
        "purpose",
        "epistemology",
        "artifact",
        "brings",
        "u",
        "back",
        "around",
        "view",
        "emphasizes",
        "instead",
        "dependence",
        "human",
        "cognition",
        "action",
        "artifact"
    ]
}