{
    "main_text": "Definition\n1. Definition\n\nA standard philosophical definition of\n“artifact”—often assumed even when not explicitly\nstated—is that artifacts are objects made intentionally, in\norder to accomplish some purpose (Hilpinen 1992; 2011). This\ndefinition is rooted ultimately in Aristotle’s distinction\nbetween things that exist by nature and things that exist by craft\n(Metaphysics 1033a ff., Nicomachean Ethics 1140a\nff., Physics 192b ff.). Those that exist by nature have their\norigin in themselves, whereas those that exist by craft have their\norigin in the craftsperson—specifically, in the form of the\nthing as it exists in the mind of the maker. Both Aristotle and his\ncontemporary descendants are primarily concerned to distinguish\nartifacts from objects that occur naturally, without any human\nintervention.\n\nOn this standard definition, artifacts must satisfy three conditions.\nThey must be intentionally produced, thus ruling out unintended\nby-products of intentional actions, such as the shavings that result\nfrom woodcarving, as well as all naturally occurring objects, such as\nsalamanders and stars. They must involve modification of materials,\nthus ruling out naturally occurring objects even when used\nintentionally for a purpose, such as sticks thrown to amuse your dog.\nAnd they must be produced for a purpose. This rules out intentionally\nmodified objects that are nevertheless not intended to accomplish any\nfurther goal, such as the scraps produced when you intentionally, but\nfor no particular reason, tear up a piece of paper before throwing it\naway. Presumably, then, these three conditions are intended to be\nindividually necessary and jointly sufficient to distinguish artifacts\nfrom naturally occurring objects.\n\nThree remarks about this definition are in order. First, it does not\nrule out the possibility that at least some things made by non-human\nanimals are artifacts. Spider webs do have a purpose, for instance,\nand are clearly made rather than naturally occurring. But we may\nhesitate to attribute intention to the spiders, given the instinctive\nnature of their web-weaving behavior. Beavers, on the other hand,\nmight be thought to intentionally construct dams in order to create\nponds. This implication of the standard definition fits well with the\nburgeoning evidence for sophisticated cognition among non-human\nanimals in general, and their ability to manufacture and use tools and\nother structures in particular (Shumaker, Walkup, & Beck 2011;\nGould & Gould 2007). This is an important area of research in\nethology and comparative psychology. However, for the purposes of this\narticle we will focus on human artifacts.\n\nSecond, many things we would not ordinarily label as artifacts in\nEnglish might nevertheless count under this definition. We usually\nreserve the term “artifact” for tangible, durable objects\nsuch as an archaeologist might unearth. But objects made intentionally\nfor a purpose include many that are ephemeral or abstract. Candidates\ninclude musical performances (Dipert 1993), belief systems\n(Hilpinen 1995), actions and languages (Evnine 2016), software (Irmak\n2012), normativity (Frugé 2022), establishments such as\nrestaurants (Korman 2020), and artifact types (Reicher\n2022). \n\nFinally, this definition is peculiar to philosophers (Hilpinen 2011;\nDipert 2014). In other disciplines the concern is more to investigate\ncognition and behavior involving objects quite generally, without\ncarving out a domain of artifacts having special ontological status.\nPsychologists, for instance, are interested in how children develop\ncategorizations of things, including artifacts as opposed to\nnon-artifacts. But there is some evidence that notions of intention or\nfunction enter into this development only at quite a late stage, and\nthat young children make relevant distinctions more on the basis of\nperceptual features such as shape or movement patterns (Keil, Greif,\n& Kerner 2007). Thus the standard philosophical definition of\n“artifact” might well be more of a hindrance than a help\nin the context of such investigations. Archaeologists and\nanthropologists, on the other hand, are concerned with the roles\nobjects play in cultural processes quite generally. From this point of\nview, a discarded flint chip is just as important as the hide scraper\nfrom which it was struck, because debitage analysis—the study of\nsuch chips and other production debris—is invaluable for\nreconstructing knapping techniques and other aspects of production\nprocesses, including their cognitive underpinnings (Shott 2015; Schick\n& Toth 1993). Similarly, a sharp-edged shell used without\nmodification as a hide scraper is just as important as the\npurpose-made flint scraper for understanding the culture in question.\nIn these disciplines “artifact” tends to be absorbed into\n“material culture”—a much broader category—and\nis usually understood to include anything made and/or used by\nhumans (Preston 2013; Kipfer 2007). As the examples above demonstrate,\nthe making need not be intentional and the use need not involve\nmodification of the object used. And if any objects of cultural\nsignificance are devoid of purpose or function, that condition of the\nphilosophical definition, too, would fall by the wayside.\nConsequently, as the anthropologist Daniel Miller notes:\n\n\nThere is little point in attempting to distinguish systematically\nbetween a natural world and an artefactual one, except when we are\nconcerned with the ways in which terms such as “natural”\nmay have particular consequences or entailments, as when a commodity\nin the shops is labelled “natural” simply because a single\ningredient, such as a chemical dye, has been deleted, or when\nsomething as apparently natural as radiation is taken to be\nantithetical to true “nature”. (Miller 1994, 398)\n\n\nFrom the perspective of other disciplines, then, the philosophical\ninsistence on a strict definition of “artifact” aimed at a\nbright-line distinction between naturally occurring objects and\nartifacts may well appear parochial.\n\nThis extra-disciplinary observation points us directly to the central\nproblem for the standard philosophical definition of\n“artifact”. Along all three definitional dimensions we\nencounter a continuum of cases (Koslicki 2018; Grandy 2007;\nSperber 2007). Paths, for example, are often created unintentionally\njust in virtue of people repeatedly traveling along the same straight\nline between points A and B—your kitchen and\nyour vegetable garden, say. But what is the point of saying that such\na path is not an artifact, whereas an identical one that was created\nintentionally by exactly the same process is? Moreover, what would it\ntake to make the erstwhile non-artifactual path into an artifact?\nWould it be enough to notice and approve it? Or would I have to\nintentionally maintain it, by sweeping it clean of leaves, for\ninstance?\n\nSimilar difficulties arise with regard to modification, which is\nclearly a matter of degree. If I bring an attractive shell home from a\nwalk on the beach and put it to use as a paperweight, does the\ntransport count as modification? If not, would washing the shell\nbefore using it be enough? Or polishing it to bring out the color of\nits markings? A further complication is that many uses to which\nnaturally occurring objects are put cause modifications. An unmodified\nstone used as a hammer soon acquires a spherical shape (Schick &\nToth 1993, 130 ff.). At what point did it first count as\nmodified, since even the first strike would break off some fragments?\nOr do these use-induced modifications not count for satisfying the\ndefinition at all? If not, why not? The stone is certainly being used\nintentionally for a purpose, so the rest of the definition is\nsatisfied.\n\nFinally, Dan Sperber (2007) argues that even function is continuous\nbetween nature and culture. He begins with the observation that what\nhe calls biological artifacts—domesticated plants and animals,\nfor the most part—have both biological and cultural functions.\nBut they carry out their cultural functions in virtue of carrying out\ntheir biological functions, and vice versa. Take seedless\ngrapes. Their seedlessness might seem to make them purely artifactual,\nsince the reproductive function of the fruit appears to be lost along\nwith the seeds. But in fact, Sperber argues, the fruit retains the\nbiological function of attracting us to eat the fruit and then spread\nthe plant—not by dispersing seeds, as with seeded grapes, but by\npropagating the grapevines vegetatively. This coincidence of\nbiological and cultural functions in domesticates shows that far from\nbeing the locus of a divide between nature and culture, the realm of\ndomestication is the locus of their imperceptible merger.\n\nSperber concludes that “artifact” as a theoretical term\ncannot be usefully defined, as any attempt to do so will be\nfrustrated by the continua detailed above. We may call this the\ncontinuum problem. This concern is echoed by Kathrin Koslicki (2018),\nwho notes that the common reliance on creators’ intentional activity\nto distinguish artifacts from naturally occurring objects inevitably\nleaves us with objects such as unintended by-products and naturally\noccurring objects pressed into service for human purposes which\ndo not seem to fall readily into either category. She does not\nthink that current approaches in metaphysics have the resources\nto deal with such puzzles about artifacts, and concludes that further\ndevelopment of these approaches is necessary. For\nSperber—whose training is in anthropology—the lesson is\nthat the social sciences simply do not need “artifact” as\na term of art. But philosophers, and some other social scientists,\nhave reacted to the continuum problem by doubling down on their\nclassification efforts. Risto Hilpinen (2011), following the\nanthropologist Wendell Oswalt (1973; 1976), uses the term\n“naturefact” for naturally occurring objects used\nintentionally, but without modification, for some purpose. Naturefacts\nthus lie between naturally occurring objects and artifacts on the\ncontinuum. Hilpinen also suggests that what he calls\n“residue”—modified but unintended by-products of\nproductive activity, such as sawdust—are a conceptually distinct\ncategory of objects also lying somewhere between artifacts and\nnaturally occurring objects. (A terminological note: in archaeology,\n“naturefact” is more usually used to mean an object that\nis in fact the result of purely natural processes, but is difficult to\ndistinguish from an intentionally modified object. This is a problem\nthat bedevils paleoarchaeologists studying stone tools, in particular\n(Schnurrenberger & Bryan 1985). Archaeologists also\nsometimes distinguish artifacts from ecofacts—organic or\ninorganic remains of archaeological significance that have undergone\nno, or minimal, modification by humans, such as animal bones, stored\ngrain, pollen, charcoal, and the like. Naturefacts and residues in\nHilpinen’s sense are usually included in the ecofact\ncategory.)\n\nRandall Dipert (1993) proposes a slightly different, triadic\nclassification.\n\nInstruments—naturally occurring objects that have been\nintentionally used for a purpose, but not modified, such as stones\nused as hammers.\nTools—intentionally modified instruments, such as stones\nshaped and polished for use as hammers.\nArtifacts—tools intended to be recognized as tools, such as\nclaw hammers made from standard materials and with a standardized,\neasily recognizable shape.\n\n\nThis continuum problem for artifacts is really just a version of a\nwell-known problem besetting classification schemes in the natural and\nsocial sciences. The traditional assumption was that classification is\nan exclusively ontological operation. What we are doing, it is often\nsaid, is carving the world at its joints. On this assumption, a\ncontinuum is a problem because it suggests that there are no joints to\nguide our carving efforts. A continuum is thus incompatible with\nclassification schemes understood as grounded solely in objective\nfeatures of the world, and with essentialist understandings of natural\nkinds. We can, of course, carve the continuum up any way we like, but\nthis must be understood as in part a pragmatic operation, not a\nstrictly ontological one reflecting only the fixed essences of things.\nThis problem has loomed large in discussions of natural kinds in\nphilosophy of science, as bothersome continua are increasingly\nidentified in both natural and social sciences. Muhammad Khalidi\n(2013, Chapter 5) details cases in the chemical, biological,\nphysiological and social sciences where widely accepted kinds are\n“fuzzy”, or have graded membership, for instance. In\nresponse, he advocates an account of natural kinds that incorporates\nthe influence of human interests and epistemic concerns, while still\ninsisting that these interests and concerns are constrained by\nobjective features of the world identifiable by science.\nKhalidi’s account joins a growing list of non-essentialist\naccounts of natural kinds, according to which kinds are real, but\ntheir reality does not require that they be defined in total isolation\nfrom human beings, their activities, interests, epistemic projects,\npragmatic concerns, and so on (Dupré 1993; Boyd 1999; Reydon\n2014; Kendig 2016).\n\nUnderstood in this way, classification schemes such as those proposed\nby Hilpinen and Dipert could, in principle, constitute a perfectly\nadequate response to the continuum problem. It would, of course, be\nnice to have a commonly accepted scheme in philosophy—or better\nyet, a scheme shared with the other disciplines that study artifacts\nand material culture. But even failing that, classification schemes\ngrounded in clear methodological considerations would be helpful, even\nif the methodological considerations varied from scheme to scheme.\nUnfortunately, it appears that the main consideration driving the\nschemes proposed so far is merely the desire to shore up the\ntraditional ontological distinction between artifacts and naturally\noccurring objects. This leaves the methodological challenge voiced by\nSperber and Miller unanswered. What do we need this distinction for?\nDoes it help us understand how objects function in human life and\nculture, or does it actually hinder this understanding? If the latter,\nwould other distinctions serve us better? The continuum problem does\nnot, pace Sperber, prove that there are no good\nmethodological considerations in favor of maintaining the ontological\ndivide between artifacts and naturally occurring objects. But in light\nof the “epistemological” (Reydon 2014) or\n“practice” (Kendig 2016) turn in the recent literature on\nnatural kinds, it does show that we cannot assume that\n“artifact” itself is a pure, natural kind, identifiable on\nontological grounds alone. In short, there is no guarantee that the\nstandard definition of “artifact” with which we started\nthis section expresses anything like a traditional essence. We are\nthus left with more questions than answers in the matter of\ndefinition.\n",
    "section_title": "1. Definition",
    "entry_title": "Artifact",
    "hierarchy_title": "Artifact || Definition",
    "tokenized_text": [
        "definition",
        "definition",
        "standard",
        "philosophical",
        "definition",
        "artifact",
        "often",
        "assumed",
        "even",
        "explicitly",
        "statedis",
        "artifact",
        "object",
        "made",
        "intentionally",
        "order",
        "accomplish",
        "purpose",
        "hilpinen",
        "definition",
        "rooted",
        "ultimately",
        "aristotle",
        "distinction",
        "thing",
        "exist",
        "nature",
        "thing",
        "exist",
        "craft",
        "metaphysics",
        "a",
        "ff",
        "nicomachean",
        "ethic",
        "a",
        "ff",
        "physic",
        "b",
        "ff",
        "exist",
        "nature",
        "origin",
        "whereas",
        "exist",
        "craft",
        "origin",
        "craftspersonspecifically",
        "form",
        "thing",
        "exists",
        "mind",
        "maker",
        "aristotle",
        "contemporary",
        "descendant",
        "primarily",
        "concerned",
        "distinguish",
        "artifact",
        "object",
        "occur",
        "naturally",
        "without",
        "human",
        "intervention",
        "standard",
        "definition",
        "artifact",
        "must",
        "satisfy",
        "three",
        "condition",
        "must",
        "intentionally",
        "produced",
        "thus",
        "ruling",
        "unintended",
        "byproduct",
        "intentional",
        "action",
        "shaving",
        "result",
        "woodcarving",
        "well",
        "naturally",
        "occurring",
        "object",
        "salamander",
        "star",
        "must",
        "involve",
        "modification",
        "material",
        "thus",
        "ruling",
        "naturally",
        "occurring",
        "object",
        "even",
        "used",
        "intentionally",
        "purpose",
        "stick",
        "thrown",
        "amuse",
        "dog",
        "must",
        "produced",
        "purpose",
        "rule",
        "intentionally",
        "modified",
        "object",
        "nevertheless",
        "intended",
        "accomplish",
        "goal",
        "scrap",
        "produced",
        "intentionally",
        "particular",
        "reason",
        "tear",
        "piece",
        "paper",
        "throwing",
        "away",
        "presumably",
        "three",
        "condition",
        "intended",
        "individually",
        "necessary",
        "jointly",
        "sufficient",
        "distinguish",
        "artifact",
        "naturally",
        "occurring",
        "object",
        "three",
        "remark",
        "definition",
        "order",
        "first",
        "rule",
        "possibility",
        "least",
        "thing",
        "made",
        "nonhuman",
        "animal",
        "artifact",
        "spider",
        "web",
        "purpose",
        "instance",
        "clearly",
        "made",
        "rather",
        "naturally",
        "occurring",
        "may",
        "hesitate",
        "attribute",
        "intention",
        "spider",
        "given",
        "instinctive",
        "nature",
        "webweaving",
        "behavior",
        "beaver",
        "hand",
        "might",
        "thought",
        "intentionally",
        "construct",
        "dam",
        "order",
        "create",
        "pond",
        "implication",
        "standard",
        "definition",
        "fit",
        "well",
        "burgeoning",
        "evidence",
        "sophisticated",
        "cognition",
        "among",
        "nonhuman",
        "animal",
        "general",
        "ability",
        "manufacture",
        "use",
        "tool",
        "structure",
        "particular",
        "shumaker",
        "walkup",
        "beck",
        "gould",
        "gould",
        "important",
        "area",
        "research",
        "ethology",
        "comparative",
        "psychology",
        "however",
        "purpose",
        "article",
        "focus",
        "human",
        "artifact",
        "second",
        "many",
        "thing",
        "would",
        "ordinarily",
        "label",
        "artifact",
        "english",
        "might",
        "nevertheless",
        "count",
        "definition",
        "usually",
        "reserve",
        "term",
        "artifact",
        "tangible",
        "durable",
        "object",
        "archaeologist",
        "might",
        "unearth",
        "object",
        "made",
        "intentionally",
        "purpose",
        "include",
        "many",
        "ephemeral",
        "abstract",
        "candidate",
        "include",
        "musical",
        "performance",
        "dipert",
        "belief",
        "system",
        "hilpinen",
        "action",
        "language",
        "evnine",
        "software",
        "irmak",
        "normativity",
        "frugé",
        "establishment",
        "restaurant",
        "korman",
        "artifact",
        "type",
        "reicher",
        "finally",
        "definition",
        "peculiar",
        "philosopher",
        "hilpinen",
        "dipert",
        "discipline",
        "concern",
        "investigate",
        "cognition",
        "behavior",
        "involving",
        "object",
        "quite",
        "generally",
        "without",
        "carving",
        "domain",
        "artifact",
        "special",
        "ontological",
        "status",
        "psychologist",
        "instance",
        "interested",
        "child",
        "develop",
        "categorization",
        "thing",
        "including",
        "artifact",
        "opposed",
        "nonartifacts",
        "evidence",
        "notion",
        "intention",
        "function",
        "enter",
        "development",
        "quite",
        "late",
        "stage",
        "young",
        "child",
        "make",
        "relevant",
        "distinction",
        "basis",
        "perceptual",
        "feature",
        "shape",
        "movement",
        "pattern",
        "keil",
        "greif",
        "kerner",
        "thus",
        "standard",
        "philosophical",
        "definition",
        "artifact",
        "might",
        "well",
        "hindrance",
        "help",
        "context",
        "investigation",
        "archaeologist",
        "anthropologist",
        "hand",
        "concerned",
        "role",
        "object",
        "play",
        "cultural",
        "process",
        "quite",
        "generally",
        "point",
        "view",
        "discarded",
        "flint",
        "chip",
        "important",
        "hide",
        "scraper",
        "struck",
        "debitage",
        "analysisthe",
        "study",
        "chip",
        "production",
        "debrisis",
        "invaluable",
        "reconstructing",
        "knapping",
        "technique",
        "aspect",
        "production",
        "process",
        "including",
        "cognitive",
        "underpinnings",
        "shott",
        "schick",
        "toth",
        "similarly",
        "sharpedged",
        "shell",
        "used",
        "without",
        "modification",
        "hide",
        "scraper",
        "important",
        "purposemade",
        "flint",
        "scraper",
        "understanding",
        "culture",
        "question",
        "discipline",
        "artifact",
        "tends",
        "absorbed",
        "material",
        "culture",
        "a",
        "much",
        "broader",
        "categoryand",
        "usually",
        "understood",
        "include",
        "anything",
        "made",
        "andor",
        "used",
        "human",
        "preston",
        "kipfer",
        "example",
        "demonstrate",
        "making",
        "need",
        "intentional",
        "use",
        "need",
        "involve",
        "modification",
        "object",
        "used",
        "object",
        "cultural",
        "significance",
        "devoid",
        "purpose",
        "function",
        "condition",
        "philosophical",
        "definition",
        "would",
        "fall",
        "wayside",
        "consequently",
        "anthropologist",
        "daniel",
        "miller",
        "note",
        "little",
        "point",
        "attempting",
        "distinguish",
        "systematically",
        "natural",
        "world",
        "artefactual",
        "one",
        "except",
        "concerned",
        "way",
        "term",
        "natural",
        "may",
        "particular",
        "consequence",
        "entailment",
        "commodity",
        "shop",
        "labelled",
        "natural",
        "simply",
        "single",
        "ingredient",
        "chemical",
        "dye",
        "deleted",
        "something",
        "apparently",
        "natural",
        "radiation",
        "taken",
        "antithetical",
        "true",
        "nature",
        "miller",
        "perspective",
        "discipline",
        "philosophical",
        "insistence",
        "strict",
        "definition",
        "artifact",
        "aimed",
        "brightline",
        "distinction",
        "naturally",
        "occurring",
        "object",
        "artifact",
        "may",
        "well",
        "appear",
        "parochial",
        "extradisciplinary",
        "observation",
        "point",
        "u",
        "directly",
        "central",
        "problem",
        "standard",
        "philosophical",
        "definition",
        "artifact",
        "along",
        "three",
        "definitional",
        "dimension",
        "encounter",
        "continuum",
        "case",
        "koslicki",
        "grandy",
        "sperber",
        "path",
        "example",
        "often",
        "created",
        "unintentionally",
        "virtue",
        "people",
        "repeatedly",
        "traveling",
        "along",
        "straight",
        "line",
        "point",
        "byour",
        "kitchen",
        "vegetable",
        "garden",
        "say",
        "point",
        "saying",
        "path",
        "artifact",
        "whereas",
        "identical",
        "one",
        "created",
        "intentionally",
        "exactly",
        "process",
        "moreover",
        "would",
        "take",
        "make",
        "erstwhile",
        "nonartifactual",
        "path",
        "artifact",
        "would",
        "enough",
        "notice",
        "approve",
        "would",
        "intentionally",
        "maintain",
        "sweeping",
        "clean",
        "leaf",
        "instance",
        "similar",
        "difficulty",
        "arise",
        "regard",
        "modification",
        "clearly",
        "matter",
        "degree",
        "bring",
        "attractive",
        "shell",
        "home",
        "walk",
        "beach",
        "put",
        "use",
        "paperweight",
        "transport",
        "count",
        "modification",
        "would",
        "washing",
        "shell",
        "using",
        "enough",
        "polishing",
        "bring",
        "color",
        "marking",
        "complication",
        "many",
        "us",
        "naturally",
        "occurring",
        "object",
        "put",
        "cause",
        "modification",
        "unmodified",
        "stone",
        "used",
        "hammer",
        "soon",
        "acquires",
        "spherical",
        "shape",
        "schick",
        "toth",
        "ff",
        "point",
        "first",
        "count",
        "modified",
        "since",
        "even",
        "first",
        "strike",
        "would",
        "break",
        "fragment",
        "useinduced",
        "modification",
        "count",
        "satisfying",
        "definition",
        "stone",
        "certainly",
        "used",
        "intentionally",
        "purpose",
        "rest",
        "definition",
        "satisfied",
        "finally",
        "dan",
        "sperber",
        "argues",
        "even",
        "function",
        "continuous",
        "nature",
        "culture",
        "begin",
        "observation",
        "call",
        "biological",
        "artifactsdomesticated",
        "plant",
        "animal",
        "parthave",
        "biological",
        "cultural",
        "function",
        "carry",
        "cultural",
        "function",
        "virtue",
        "carrying",
        "biological",
        "function",
        "vice",
        "versa",
        "take",
        "seedless",
        "grape",
        "seedlessness",
        "might",
        "seem",
        "make",
        "purely",
        "artifactual",
        "since",
        "reproductive",
        "function",
        "fruit",
        "appears",
        "lost",
        "along",
        "seed",
        "fact",
        "sperber",
        "argues",
        "fruit",
        "retains",
        "biological",
        "function",
        "attracting",
        "u",
        "eat",
        "fruit",
        "spread",
        "plantnot",
        "dispersing",
        "seed",
        "seeded",
        "grape",
        "propagating",
        "grapevine",
        "vegetatively",
        "coincidence",
        "biological",
        "cultural",
        "function",
        "domesticates",
        "show",
        "far",
        "locus",
        "divide",
        "nature",
        "culture",
        "realm",
        "domestication",
        "locus",
        "imperceptible",
        "merger",
        "sperber",
        "concludes",
        "artifact",
        "theoretical",
        "term",
        "usefully",
        "defined",
        "attempt",
        "frustrated",
        "continuum",
        "detailed",
        "may",
        "call",
        "continuum",
        "problem",
        "concern",
        "echoed",
        "kathrin",
        "koslicki",
        "note",
        "common",
        "reliance",
        "creator",
        "intentional",
        "activity",
        "distinguish",
        "artifact",
        "naturally",
        "occurring",
        "object",
        "inevitably",
        "leaf",
        "u",
        "object",
        "unintended",
        "byproduct",
        "naturally",
        "occurring",
        "object",
        "pressed",
        "service",
        "human",
        "purpose",
        "seem",
        "fall",
        "readily",
        "either",
        "category",
        "think",
        "current",
        "approach",
        "metaphysics",
        "resource",
        "deal",
        "puzzle",
        "artifact",
        "concludes",
        "development",
        "approach",
        "necessary",
        "sperberwhose",
        "training",
        "anthropologythe",
        "lesson",
        "social",
        "science",
        "simply",
        "need",
        "artifact",
        "term",
        "art",
        "philosopher",
        "social",
        "scientist",
        "reacted",
        "continuum",
        "problem",
        "doubling",
        "classification",
        "effort",
        "risto",
        "hilpinen",
        "following",
        "anthropologist",
        "wendell",
        "oswalt",
        "us",
        "term",
        "naturefact",
        "naturally",
        "occurring",
        "object",
        "used",
        "intentionally",
        "without",
        "modification",
        "purpose",
        "naturefacts",
        "thus",
        "lie",
        "naturally",
        "occurring",
        "object",
        "artifact",
        "continuum",
        "hilpinen",
        "also",
        "suggests",
        "call",
        "residue",
        "modified",
        "unintended",
        "byproduct",
        "productive",
        "activity",
        "sawdustare",
        "conceptually",
        "distinct",
        "category",
        "object",
        "also",
        "lying",
        "somewhere",
        "artifact",
        "naturally",
        "occurring",
        "object",
        "terminological",
        "note",
        "archaeology",
        "naturefact",
        "usually",
        "used",
        "mean",
        "object",
        "fact",
        "result",
        "purely",
        "natural",
        "process",
        "difficult",
        "distinguish",
        "intentionally",
        "modified",
        "object",
        "problem",
        "bedevils",
        "paleoarchaeologists",
        "studying",
        "stone",
        "tool",
        "particular",
        "schnurrenberger",
        "bryan",
        "archaeologist",
        "also",
        "sometimes",
        "distinguish",
        "artifact",
        "ecofactsorganic",
        "inorganic",
        "remains",
        "archaeological",
        "significance",
        "undergone",
        "minimal",
        "modification",
        "human",
        "animal",
        "bone",
        "stored",
        "grain",
        "pollen",
        "charcoal",
        "like",
        "naturefacts",
        "residue",
        "hilpinen",
        "sense",
        "usually",
        "included",
        "ecofact",
        "category",
        "randall",
        "dipert",
        "proposes",
        "slightly",
        "different",
        "triadic",
        "classification",
        "instrumentsnaturally",
        "occurring",
        "object",
        "intentionally",
        "used",
        "purpose",
        "modified",
        "stone",
        "used",
        "hammer",
        "toolsintentionally",
        "modified",
        "instrument",
        "stone",
        "shaped",
        "polished",
        "use",
        "hammer",
        "artifactstools",
        "intended",
        "recognized",
        "tool",
        "claw",
        "hammer",
        "made",
        "standard",
        "material",
        "standardized",
        "easily",
        "recognizable",
        "shape",
        "continuum",
        "problem",
        "artifact",
        "really",
        "version",
        "wellknown",
        "problem",
        "besetting",
        "classification",
        "scheme",
        "natural",
        "social",
        "science",
        "traditional",
        "assumption",
        "classification",
        "exclusively",
        "ontological",
        "operation",
        "often",
        "said",
        "carving",
        "world",
        "joint",
        "assumption",
        "continuum",
        "problem",
        "suggests",
        "joint",
        "guide",
        "carving",
        "effort",
        "continuum",
        "thus",
        "incompatible",
        "classification",
        "scheme",
        "understood",
        "grounded",
        "solely",
        "objective",
        "feature",
        "world",
        "essentialist",
        "understanding",
        "natural",
        "kind",
        "course",
        "carve",
        "continuum",
        "way",
        "like",
        "must",
        "understood",
        "part",
        "pragmatic",
        "operation",
        "strictly",
        "ontological",
        "one",
        "reflecting",
        "fixed",
        "essence",
        "thing",
        "problem",
        "loomed",
        "large",
        "discussion",
        "natural",
        "kind",
        "philosophy",
        "science",
        "bothersome",
        "continuum",
        "increasingly",
        "identified",
        "natural",
        "social",
        "science",
        "muhammad",
        "khalidi",
        "chapter",
        "detail",
        "case",
        "chemical",
        "biological",
        "physiological",
        "social",
        "science",
        "widely",
        "accepted",
        "kind",
        "fuzzy",
        "graded",
        "membership",
        "instance",
        "response",
        "advocate",
        "account",
        "natural",
        "kind",
        "incorporates",
        "influence",
        "human",
        "interest",
        "epistemic",
        "concern",
        "still",
        "insisting",
        "interest",
        "concern",
        "constrained",
        "objective",
        "feature",
        "world",
        "identifiable",
        "science",
        "khalidi",
        "account",
        "join",
        "growing",
        "list",
        "nonessentialist",
        "account",
        "natural",
        "kind",
        "according",
        "kind",
        "real",
        "reality",
        "require",
        "defined",
        "total",
        "isolation",
        "human",
        "being",
        "activity",
        "interest",
        "epistemic",
        "project",
        "pragmatic",
        "concern",
        "dupré",
        "boyd",
        "reydon",
        "kendig",
        "understood",
        "way",
        "classification",
        "scheme",
        "proposed",
        "hilpinen",
        "dipert",
        "could",
        "principle",
        "constitute",
        "perfectly",
        "adequate",
        "response",
        "continuum",
        "problem",
        "would",
        "course",
        "nice",
        "commonly",
        "accepted",
        "scheme",
        "philosophyor",
        "better",
        "yet",
        "scheme",
        "shared",
        "discipline",
        "study",
        "artifact",
        "material",
        "culture",
        "even",
        "failing",
        "classification",
        "scheme",
        "grounded",
        "clear",
        "methodological",
        "consideration",
        "would",
        "helpful",
        "even",
        "methodological",
        "consideration",
        "varied",
        "scheme",
        "scheme",
        "unfortunately",
        "appears",
        "main",
        "consideration",
        "driving",
        "scheme",
        "proposed",
        "far",
        "merely",
        "desire",
        "shore",
        "traditional",
        "ontological",
        "distinction",
        "artifact",
        "naturally",
        "occurring",
        "object",
        "leaf",
        "methodological",
        "challenge",
        "voiced",
        "sperber",
        "miller",
        "unanswered",
        "need",
        "distinction",
        "help",
        "u",
        "understand",
        "object",
        "function",
        "human",
        "life",
        "culture",
        "actually",
        "hinder",
        "understanding",
        "latter",
        "would",
        "distinction",
        "serve",
        "u",
        "better",
        "continuum",
        "problem",
        "pace",
        "sperber",
        "prove",
        "good",
        "methodological",
        "consideration",
        "favor",
        "maintaining",
        "ontological",
        "divide",
        "artifact",
        "naturally",
        "occurring",
        "object",
        "light",
        "epistemological",
        "reydon",
        "practice",
        "kendig",
        "turn",
        "recent",
        "literature",
        "natural",
        "kind",
        "show",
        "assume",
        "artifact",
        "pure",
        "natural",
        "kind",
        "identifiable",
        "ontological",
        "ground",
        "alone",
        "short",
        "guarantee",
        "standard",
        "definition",
        "artifact",
        "started",
        "section",
        "express",
        "anything",
        "like",
        "traditional",
        "essence",
        "thus",
        "left",
        "question",
        "answer",
        "matter",
        "definition"
    ]
}