{
    "main_text": "Epistemology || Knowing Artifacts\n3.2 Knowing Artifacts\n\nVogel’s position on environmental ethics resonates in an\ninteresting way with a much earlier dispute about\nreference—specifically, about whether our capacity to refer to\ndifferent kinds of artifacts is grounded in a definite description of\nwhat being a member of that kind requires, or rather in a historical\nconnection to a “baptismal” event in which someone slapped\na label on something and declared that label henceforth applicable to\nthings of that sort. Hilary Putnam (1975) famously favors the\nbaptismal account for both natural kinds and artifact kinds. Steven\nSchwartz (1978) challenges Putnam’s account in the case of\nartifacts. He agrees with Putnam that the “baptismal”\naccount is correct for natural kinds, because they have hidden natures\nto which we are not necessarily privy. Thus if we are to refer to\nnatural objects reliably at all, it cannot be by way of definite\ndescription. But artifacts, Schwartz says, have publicly accessible\nnatures based on form and function, so reference to them is grounded\nin description rather than a baptismal event. Amie Thomasson\n(2003; 2007b) carves out a nuanced position based on her view\nthat the intentions and concepts of human makers are constitutive of\nartifact kinds\n (Section 2.2\n above). If so, then some makers are in an epistemically privileged\nposition with regard to given artifacts, and so do refer to them in\nvirtue of having a substantive concept of what being an artifact of\nthat kind involves. Thomasson acknowledges that most speakers are not\nin this epistemically privileged position. Users are not, and even\nmany who qualify as makers in the causal sense—workers on a\nproduction line, for instance—may not be. So Thomasson’s\nview, unlike Schwartz’s, is not a return to a purely descriptive\ntheory of reference for artifact terms, but rather a hybrid theory.\nHilary Kornblith (2007) argues against Thomasson that she has still\nnot demonstrated any essential connection between makers’\nsubstantive concepts of artifacts and reference. On the one hand, in\ncases where a type of artifact is no longer used for the purpose the\nmaker intended, the users’ concept would seem decisive. On the\nother hand, having the concept is arguably the result of familiarity\nwith the artifact rather than any special semantic capacity enjoyed by\nmakers. Similarly, Kornblith (1980) argues against Schwartz that the\nfunction of artifacts is not necessarily accessible—a problem\nfaced frequently by archaeologists, for instance—and thus that\neven in cases of objects where the form and function are familiar, it\nis not this familiarity that grounds the ability to refer. The\nbaptismal account of reference therefore must apply to both artifacts\nand natural objects, just as Putnam said. Such semantic parity between\nartifacts and natural objects, which rejects any privilege for\nmakers’ intentions, echoes Vogel’s view that artifacts and\nnatural objects are equally “wild”, because artifacts\noutrun their makers’ intentions in practice, just as surely as\nnatural objects outrun human intentions in principle.\n\nMuch of the epistemology of artifacts is, in the first instance, the\nprovince of cognitive psychology, not philosophy. Artifact kinds, for\ninstance, can be approached from the side of psychology rather than\nmetaphysics, yielding theories about the psychological mechanisms by\nmeans of which we group artifacts together, apart from any question of\nwhether these groupings represent reality (Malt & Sloman 2007a).\nIn an influential article, Paul Bloom (1996) argues that we cannot\ncategorize artifacts based on form, use, or function. Form and use are\nboth too variable to be reliable. Beanbag chairs do not look much like\nother chairs, and even if every flatiron in existence were currently\nbeing used as a doorstop, we would not want to categorize them as\ndoorstops. Experiments show that even intended function is neither\nnecessary nor sufficient for categorization (Malt & Johnson 1992).\nVary the form of something sufficiently, and people will decline to\ncategorize it as a chair even if it is made to be sat on. On the other\nhand, present them with something that looks like a chair but is made\nto be a plant stand, and they will still categorize it as a chair. In\nresponse, Bloom proposes an intentional-historical theory, according\nto which categorization of artifacts depends on our being able to\ninfer that an artifact was successfully made with the intention that\nit belong to a particular category. Form and use are good grounds for\nsuch inferences, and this explains our intuition that these factors\nhave something to do with how we categorize artifacts. So if something\nlooks like a chair and we regularly observe people sitting on it, we\nreasonably infer it was made with the intention that it be a chair,\nand we categorize it accordingly. (Bloom’s view is clearly\nancestral to Amie Thomasson’s account of artifact kinds\n (Section 2.2),\n but he is concerned only to explain how we group artifacts, and does\nnot claim, as Thomasson does, that makers’ intentions and\nconcepts are ontologically constitutive of artifact kinds.) Barbara\nMalt and Eric Johnson (1998) criticize Bloom for failing to make clear\neither why we would need to resort to creator’s intention to\ncategorize artifacts, or exactly how we might assess that intention.\nMore recently, Malt and Steven Sloman (2007a; 2007b) have argued\nthat the kind of essentialist approach represented by Bloom’s\ntheory is misguided, and have proposed an alternative, pragmatic\napproach. In a series of experiments, they show that artifact\ncategorization is sensitive to communicative goals in specific\nsituations. Creators’ intentions are important with regard to\nsome goals and situations; unimportant with regard to others. If this\napproach is on the right track, artifact kinds are not psychologically\nstable or clearly demarcated groupings. Moreover, this raises the\npossibility that “categorization” itself is not a\npsychological natural kind. It may be that this label is used for what\nis actually a heterogeneous collection of processes.\n\nDevelopmental issues with regard to our concepts of\n“artifact” and specific kinds of artifacts also loom large\nin cognitive psychology. As philosophers might anticipate, the\nunderlying general issue is between empiricist and nativist approaches\nto concept acquisition. But the now vast experimental literature on\nchild development means that theories in this area are both numerous\nand highly sophisticated. An empiricist-oriented theory that stands\nout is Jean Mandler’s (2004; 2007) comprehensive perceptual\nmeaning analysis view, according to which children construct abstract\nimage schemas on the basis of their perceptual experience, especially\ntheir experience of motion. Since artifacts and animals move in\ncharacteristically different ways, the first level of differentiation\nthese image schemas provide is vague, global concepts of these two\ntypes of objects. Mandler holds that there is no good reason to think\nthese concepts are innate, nor is there any good reason to think that\nthe perceptual meaning analysis mechanisms that produce them are\ndomain specific. All that is innate, on her view, is a domain-general\nmechanism that enables the child to analyze her perceptual input.\nMandler’s work also indicates that artifacts may be first\ndifferentiated into indoor and outdoor, and only then into more\nspecific kinds such as furniture and kitchen utensils, on the one\nhand, and vehicles and buildings, on the other. The nativist\nalternative to Mandler’s theory is best represented by Susan\nCarey’s equally comprehensive “core cognition”\ntheory. Carey (2009, 194–196) has a characteristically\nnativist critique of Mandler. On the face of it, Mandler’s image\nschemas represent features of motion and the paths motions describe\nthrough space. However, Carey argues, there is no explanation of how\nthe child gets from these representations to a representation of\nagency, for example. No matter how distinctive the motions of animals,\nthey do not by themselves yield concepts of intention, attention, or\ngoal-directedness. On Carey’s view, these concepts must be\ninnate in the form of “core knowledge” (Spelke 2000), or\n“core cognition”, as Carey prefers to call it in her more\nrecent work. Core cognition is characterized by innate,\ndomain-specific mechanisms for the analysis of perceptual input,\ndesigned by natural selection to construct domain-specific\nrepresentations of the world, such as intention in the agent domain,\nor causality in the object domain. Both of these domains of core\ncognition are essential for the development of artifact concepts,\nbecause on Carey’s view (Kelemen & Carey 2007) we\nconceptualize artifacts as objects that have been intentionally\ndesigned to carry out a specific function. The developmental issue,\nthen, boils down to the question of whether we can construct artifact\nconcepts with only a single, domain-general mechanism for analyzing\nperceptual input, or whether we need at least two domain-specific\nmechanisms with quite different output.\n",
    "section_title": "3.2 Knowing Artifacts",
    "entry_title": "Artifact",
    "hierarchy_title": "Artifact || Epistemology || Knowing Artifacts",
    "tokenized_text": [
        "epistemology",
        "knowing",
        "artifact",
        "knowing",
        "artifact",
        "vogel",
        "position",
        "environmental",
        "ethic",
        "resonates",
        "interesting",
        "way",
        "much",
        "earlier",
        "dispute",
        "referencespecifically",
        "whether",
        "capacity",
        "refer",
        "different",
        "kind",
        "artifact",
        "grounded",
        "definite",
        "description",
        "member",
        "kind",
        "requires",
        "rather",
        "historical",
        "connection",
        "baptismal",
        "event",
        "someone",
        "slapped",
        "label",
        "something",
        "declared",
        "label",
        "henceforth",
        "applicable",
        "thing",
        "sort",
        "hilary",
        "putnam",
        "famously",
        "favor",
        "baptismal",
        "account",
        "natural",
        "kind",
        "artifact",
        "kind",
        "steven",
        "schwartz",
        "challenge",
        "putnam",
        "account",
        "case",
        "artifact",
        "agrees",
        "putnam",
        "baptismal",
        "account",
        "correct",
        "natural",
        "kind",
        "hidden",
        "nature",
        "necessarily",
        "privy",
        "thus",
        "refer",
        "natural",
        "object",
        "reliably",
        "way",
        "definite",
        "description",
        "artifact",
        "schwartz",
        "say",
        "publicly",
        "accessible",
        "nature",
        "based",
        "form",
        "function",
        "reference",
        "grounded",
        "description",
        "rather",
        "baptismal",
        "event",
        "amie",
        "thomasson",
        "b",
        "carves",
        "nuanced",
        "position",
        "based",
        "view",
        "intention",
        "concept",
        "human",
        "maker",
        "constitutive",
        "artifact",
        "kind",
        "section",
        "maker",
        "epistemically",
        "privileged",
        "position",
        "regard",
        "given",
        "artifact",
        "refer",
        "virtue",
        "substantive",
        "concept",
        "artifact",
        "kind",
        "involves",
        "thomasson",
        "acknowledges",
        "speaker",
        "epistemically",
        "privileged",
        "position",
        "user",
        "even",
        "many",
        "qualify",
        "maker",
        "causal",
        "senseworkers",
        "production",
        "line",
        "instancemay",
        "thomasson",
        "view",
        "unlike",
        "schwartz",
        "return",
        "purely",
        "descriptive",
        "theory",
        "reference",
        "artifact",
        "term",
        "rather",
        "hybrid",
        "theory",
        "hilary",
        "kornblith",
        "argues",
        "thomasson",
        "still",
        "demonstrated",
        "essential",
        "connection",
        "maker",
        "substantive",
        "concept",
        "artifact",
        "reference",
        "one",
        "hand",
        "case",
        "type",
        "artifact",
        "longer",
        "used",
        "purpose",
        "maker",
        "intended",
        "user",
        "concept",
        "would",
        "seem",
        "decisive",
        "hand",
        "concept",
        "arguably",
        "result",
        "familiarity",
        "artifact",
        "rather",
        "special",
        "semantic",
        "capacity",
        "enjoyed",
        "maker",
        "similarly",
        "kornblith",
        "argues",
        "schwartz",
        "function",
        "artifact",
        "necessarily",
        "accessiblea",
        "problem",
        "faced",
        "frequently",
        "archaeologist",
        "instanceand",
        "thus",
        "even",
        "case",
        "object",
        "form",
        "function",
        "familiar",
        "familiarity",
        "ground",
        "ability",
        "refer",
        "baptismal",
        "account",
        "reference",
        "therefore",
        "must",
        "apply",
        "artifact",
        "natural",
        "object",
        "putnam",
        "said",
        "semantic",
        "parity",
        "artifact",
        "natural",
        "object",
        "reject",
        "privilege",
        "maker",
        "intention",
        "echo",
        "vogel",
        "view",
        "artifact",
        "natural",
        "object",
        "equally",
        "wild",
        "artifact",
        "outrun",
        "maker",
        "intention",
        "practice",
        "surely",
        "natural",
        "object",
        "outrun",
        "human",
        "intention",
        "principle",
        "much",
        "epistemology",
        "artifact",
        "first",
        "instance",
        "province",
        "cognitive",
        "psychology",
        "philosophy",
        "artifact",
        "kind",
        "instance",
        "approached",
        "side",
        "psychology",
        "rather",
        "metaphysics",
        "yielding",
        "theory",
        "psychological",
        "mechanism",
        "mean",
        "group",
        "artifact",
        "together",
        "apart",
        "question",
        "whether",
        "grouping",
        "represent",
        "reality",
        "malt",
        "sloman",
        "a",
        "influential",
        "article",
        "paul",
        "bloom",
        "argues",
        "categorize",
        "artifact",
        "based",
        "form",
        "use",
        "function",
        "form",
        "use",
        "variable",
        "reliable",
        "beanbag",
        "chair",
        "look",
        "much",
        "like",
        "chair",
        "even",
        "every",
        "flatiron",
        "existence",
        "currently",
        "used",
        "doorstop",
        "would",
        "want",
        "categorize",
        "doorstop",
        "experiment",
        "show",
        "even",
        "intended",
        "function",
        "neither",
        "necessary",
        "sufficient",
        "categorization",
        "malt",
        "johnson",
        "vary",
        "form",
        "something",
        "sufficiently",
        "people",
        "decline",
        "categorize",
        "chair",
        "even",
        "made",
        "sat",
        "hand",
        "present",
        "something",
        "look",
        "like",
        "chair",
        "made",
        "plant",
        "stand",
        "still",
        "categorize",
        "chair",
        "response",
        "bloom",
        "proposes",
        "intentionalhistorical",
        "theory",
        "according",
        "categorization",
        "artifact",
        "depends",
        "able",
        "infer",
        "artifact",
        "successfully",
        "made",
        "intention",
        "belong",
        "particular",
        "category",
        "form",
        "use",
        "good",
        "ground",
        "inference",
        "explains",
        "intuition",
        "factor",
        "something",
        "categorize",
        "artifact",
        "something",
        "look",
        "like",
        "chair",
        "regularly",
        "observe",
        "people",
        "sitting",
        "reasonably",
        "infer",
        "made",
        "intention",
        "chair",
        "categorize",
        "accordingly",
        "bloom",
        "view",
        "clearly",
        "ancestral",
        "amie",
        "thomasson",
        "account",
        "artifact",
        "kind",
        "section",
        "concerned",
        "explain",
        "group",
        "artifact",
        "claim",
        "thomasson",
        "maker",
        "intention",
        "concept",
        "ontologically",
        "constitutive",
        "artifact",
        "kind",
        "barbara",
        "malt",
        "eric",
        "johnson",
        "criticize",
        "bloom",
        "failing",
        "make",
        "clear",
        "either",
        "would",
        "need",
        "resort",
        "creator",
        "intention",
        "categorize",
        "artifact",
        "exactly",
        "might",
        "ass",
        "intention",
        "recently",
        "malt",
        "steven",
        "sloman",
        "a",
        "b",
        "argued",
        "kind",
        "essentialist",
        "approach",
        "represented",
        "bloom",
        "theory",
        "misguided",
        "proposed",
        "alternative",
        "pragmatic",
        "approach",
        "series",
        "experiment",
        "show",
        "artifact",
        "categorization",
        "sensitive",
        "communicative",
        "goal",
        "specific",
        "situation",
        "creator",
        "intention",
        "important",
        "regard",
        "goal",
        "situation",
        "unimportant",
        "regard",
        "others",
        "approach",
        "right",
        "track",
        "artifact",
        "kind",
        "psychologically",
        "stable",
        "clearly",
        "demarcated",
        "grouping",
        "moreover",
        "raise",
        "possibility",
        "categorization",
        "psychological",
        "natural",
        "kind",
        "may",
        "label",
        "used",
        "actually",
        "heterogeneous",
        "collection",
        "process",
        "developmental",
        "issue",
        "regard",
        "concept",
        "artifact",
        "specific",
        "kind",
        "artifact",
        "also",
        "loom",
        "large",
        "cognitive",
        "psychology",
        "philosopher",
        "might",
        "anticipate",
        "underlying",
        "general",
        "issue",
        "empiricist",
        "nativist",
        "approach",
        "concept",
        "acquisition",
        "vast",
        "experimental",
        "literature",
        "child",
        "development",
        "mean",
        "theory",
        "area",
        "numerous",
        "highly",
        "sophisticated",
        "empiricistoriented",
        "theory",
        "stand",
        "jean",
        "mandler",
        "comprehensive",
        "perceptual",
        "meaning",
        "analysis",
        "view",
        "according",
        "child",
        "construct",
        "abstract",
        "image",
        "schema",
        "basis",
        "perceptual",
        "experience",
        "especially",
        "experience",
        "motion",
        "since",
        "artifact",
        "animal",
        "move",
        "characteristically",
        "different",
        "way",
        "first",
        "level",
        "differentiation",
        "image",
        "schema",
        "provide",
        "vague",
        "global",
        "concept",
        "two",
        "type",
        "object",
        "mandler",
        "hold",
        "good",
        "reason",
        "think",
        "concept",
        "innate",
        "good",
        "reason",
        "think",
        "perceptual",
        "meaning",
        "analysis",
        "mechanism",
        "produce",
        "domain",
        "specific",
        "innate",
        "view",
        "domaingeneral",
        "mechanism",
        "enables",
        "child",
        "analyze",
        "perceptual",
        "input",
        "mandler",
        "work",
        "also",
        "indicates",
        "artifact",
        "may",
        "first",
        "differentiated",
        "indoor",
        "outdoor",
        "specific",
        "kind",
        "furniture",
        "kitchen",
        "utensil",
        "one",
        "hand",
        "vehicle",
        "building",
        "nativist",
        "alternative",
        "mandler",
        "theory",
        "best",
        "represented",
        "susan",
        "carey",
        "equally",
        "comprehensive",
        "core",
        "cognition",
        "theory",
        "carey",
        "characteristically",
        "nativist",
        "critique",
        "mandler",
        "face",
        "mandler",
        "image",
        "schema",
        "represent",
        "feature",
        "motion",
        "path",
        "motion",
        "describe",
        "space",
        "however",
        "carey",
        "argues",
        "explanation",
        "child",
        "get",
        "representation",
        "representation",
        "agency",
        "example",
        "matter",
        "distinctive",
        "motion",
        "animal",
        "yield",
        "concept",
        "intention",
        "attention",
        "goaldirectedness",
        "carey",
        "view",
        "concept",
        "must",
        "innate",
        "form",
        "core",
        "knowledge",
        "spelke",
        "core",
        "cognition",
        "carey",
        "prefers",
        "call",
        "recent",
        "work",
        "core",
        "cognition",
        "characterized",
        "innate",
        "domainspecific",
        "mechanism",
        "analysis",
        "perceptual",
        "input",
        "designed",
        "natural",
        "selection",
        "construct",
        "domainspecific",
        "representation",
        "world",
        "intention",
        "agent",
        "domain",
        "causality",
        "object",
        "domain",
        "domain",
        "core",
        "cognition",
        "essential",
        "development",
        "artifact",
        "concept",
        "carey",
        "view",
        "kelemen",
        "carey",
        "conceptualize",
        "artifact",
        "object",
        "intentionally",
        "designed",
        "carry",
        "specific",
        "function",
        "developmental",
        "issue",
        "boil",
        "question",
        "whether",
        "construct",
        "artifact",
        "concept",
        "single",
        "domaingeneral",
        "mechanism",
        "analyzing",
        "perceptual",
        "input",
        "whether",
        "need",
        "least",
        "two",
        "domainspecific",
        "mechanism",
        "quite",
        "different",
        "output"
    ]
}