{
    "main_text": "Metaphysics || Individuation among Beings: Minds, Bodies, and Mind-Body Unions\n1.2 Individuation among Beings: Minds, Bodies, and Mind-Body Unions\n\nThroughout her texts, Astell is concerned with giving an account of\nhow created beings are individuated from each other. Ultimately, she\nmaintains that there are four kinds of created beings: minds, bodies,\nmind–body unions, and the particles that compose bodies.\n\nAbout finite minds considered on their own, Astell holds that God\ncreates minds with intrinsic differences. She gives a number of\nreasons for this view. One has to do with the relationships that God\nwants minds to have with each other: humans form community only if\ntheir minds have different intellectual capacities. Another concerns\nthe relationship between created minds and God: minds were made to\ncontemplate and enjoy God, and God needs their adoration and love. But\neach mind is limited and, thus, can only love God by adoring a limited\namount of his works. So God creates many minds, each with an ability\nto understand a specific collection of truths, and in this way all of\nhis creation is attended to (Astell SP, 144–146,\n154–155).\n\nThough Astell discusses minds as if they are sometimes isolated from\nbodies, holding that human beings are mind–body unions, she\nnotes that we cannot comprehend the connection between the mind and\nbody: “We know and feel the Union between our Soul and Body, but\nwho amongst us sees so clearly, as to find out with Certitude and\nExactness, the secret ties which unite two such different Substances,\nor how they are able to act upon each other?” (148) The union\nbetween the mind and body is mysterious; though we “know and\nfeel” it, we do not have perfect knowledge of it or of how the\nmind and body interact causally. In Christian Religion,\nAstell presents this same position by way of a parallel between, on\nthe one hand, our lack of knowledge of the mind–body union, and,\non the other hand, our lack of knowledge about the relation between\nGod and humans: “Again, tho’ I do not understand the\nPhilosophy of the Union between the Divine and Human Nature; (neither\ndo I comprehend the Vital Union between my Soul and Body, nor how and\nin what manner they are joyn’d, tho’ I am sure that so it\nis) …” (Astell 1705, 51 [section 62]). (See section 2.2\nfor an additional discussion of these passages.)\n\nAstell presents an array of points about how mind–body unions\ndiffer from each other with respect to their abilities. At one point,\nshe writes that perhaps activity in this lifetime is the cause:\n\nFor as the Diligent-hand maketh Rich, whil’st the Slothful and\nProdigal come to nothing, so the Use of our Powers improves and\nEncreases them, and the most Observing and Considerate is the Wisest\nPerson: For she lays up in her Mind as in a Store-house, ready to\nproduce on all Occasions, a Clear and Simple Idea of every Object that\nhas at any time presented itself. And perhaps the difference between\none Womans Reason and anothers may consist only in this, that the one\nhas amass’d a greater number of such Ideas than the other, and\ndispos’d them more Orderly in her Understanding so that they are\nat hand, ready to be apply’d to those Complex Ideas whose\nAgreement or Disagreement cannot be found out by the means of some of\n‘em. (Astell SP, 175–176)\n\n\nA second possible cause of the variety among human abilities is rooted\nin God’s creation—God makes some minds with larger\n“capacities” than others: “The Primary Cause of this\nis that Limitation which all Created Minds are Subject to, which\nLimitation appears more visible in some than in others, …\nbecause some Minds are endow’d by their Creator with a larger\nCapacity than the rest…” (159). This point about capacity\nis discussed in greater detail in section 2.2 below. In brief, Astell\nholds a distinction between “just” and\n“capacious” thinking. Whereas she describes just thinking\nas equally distributed among people in that everyone has the same\nability to think in harmonious and well-ordered manners, she describes\n“capacious” thinking as unevenly distributed among people\nin that some people have more time and training to attain the vast\namounts empirical knowledge that go into this kind of mental\nactivity.\n\nA third possible cause of the variety of human abilities is the one\nfamiliar to rationalist philosophers, namely that bodies impede minds\nfrom having perfect ideas, for “the Indisposition of the Bodily\nOrgans… cramps and contracts the Operations of the Mind”\n(159). Also: “For did we consider what we Are, that Humane\nNature consists in the Union of a Rational Soul with a Mortal Body,\nthat the Body very often Clogs the Mind in its noblest Operations,\nespecially when indulg’d” (210). Here Astell valorizes the\nmind over the body. The following passage illustrates another way\nAstell emphasizes this point:\n\nFor I question not but that we shoul’d be convinc’d that\nthe Body is the Instrument of the Mind and no more, that it is of such\na much Inferiour Nature, and therefore ought to be kept in such a Case\nas to be ready on all occasions to serve the Mind. That the true and\nproper Pleasure of Human Nature consists in the exercise of that\nDominion which the Soul has over the Body, in governing every Passion\nand Motion according to Right Reason, by which we most truly pursue\nthe real good of both, it being a mistake as well of our Duty as our\nHappiness to consider either part of us singly, so as to neglect what\nis due to the other. For if we disregard the Body wholly, we pretend\nto live like Angels whilst we are but Mortals; and if we prefer or\nequal it to the Mind we degenerate into Brutes. (Astell SP,\n210–1)\n\n\nWhereas the body has merely an “instrumental” role with\nrespect to the mind, the mind has “dominion” over the\nbody, and a governing role over the passions. Humans should correctly\nemploy their minds and bodies so that their humanness does not\ndegenerate into brutishness, or so that they do not presumptuously\nconduct their lives as if they were angels.\n\nAstell’s account of the mind–body union allows her to\nargue against the popular view of the period about women, according to\nwhich women do not demonstrate the same kinds of intellectual\nabilities as do men because women are inherently more closely united\nto their bodies than are men. Equipped with the rationalist account of\nthe mind–body union, Astell can show that much of the uniformity\nof women’s inabilities is rooted not in the nature of their\nsouls, but rather arises because of social practices that have\nimproperly directed their attentions. Thus the difference between the\nabilities of women and men should be explained not metaphysically, but\nepistemologically. For this reason, discussion of this issue is left\nto section 3.2 of this entry.\n\nIn addition to developing an account of the mind–body union,\nAstell also maintains that the mind and body are “really\ndistinct.” Here she again sees how this view is useful to people\nin their spiritual growth. When people realize that the mind and body\nare really distinct from each other, they will also realize that the\nmind is immortal. That is, they will realize that it has a\n“future state” beyond this “present life.”\nWhen they reflect on this future state, they will be prompted to want\na “happy eternity, by knowing and doing the will of our\nmaker.” In this way, God will become more important to them.\n(Astell 1705, CR 246–247 [section 256]).\n\nIn presenting her account of the real distinction between the mind and\nbody in Christian Religion, Astell demonstrates first that\nthe mind is immaterial; then she uses this result to show that it is\nimmortal. Her argument is thus: she maintains that the mind is\nimmaterial in that it has no parts, and so is indivisible; given that\nit is indivisible, it is incorruptible, and therefore immortal (247\n[section 257]). Having ruled out the natural annihilation of minds,\nAstell turns to the question of whether God would supernaturally\nannihilate minds. She argues that he would not, for God does nothing\nin vain, thus he would not create something only to annihilate it\n(248–249 [sections 257–258]).\n\nWithin her discussion about the immortality of minds, Astell contrasts\nminds with bodies, and she also contrasts different kinds of bodies\nwith each other. In doing so, she explains that human bodies and other\nphysical objects have parts, that is, particles that make them up. As\nbeings with parts, human bodies and physical objects are\n“perishable,” corruptible. There are several things to say\nabout these corruptible beings in contrast with the particles that\nmake them up. First, the particles that make up the corruptible beings\nare not themselves corruptible. That is, they do not go in and out of\nbeing as they do not have parts. But the corruptible beings do come in\nand out of being when those particles that make them up change in\ntheir configurations. She writes:\n\nBecause, tho’ this System of Bones, Flesh, and Skin, &.\nwhich I call my body, shall within Threescore Years; and this Wood\nwhich is now upon the Fire, shall in an Hour or two; and all other\nMaterial Beings shall in their proper Seasons be no more; yet not the\nleast Particle doth totally perish. (Astell 1705, 247–248\n[section 257])\n\n\nShe continues to describe the individuality of corruptible beings:\n\nSo that a Being is Mortal and Corruptible, or ceases to Be, when those\nparts of which it consists, and whose particular Composition and\nFigure is that which denominates it this or that\nBeing, and which distinguishes it from all other Beings, are no longer\nthus or United, but ceasing to appear under their first Texture and\nFigure, are therefore very properly said to Be no more. (Astell 1705,\n248 [section 257])\n\n\nNotice here that Astell is talking about how we\n“denominate” corruptible beings as “this or\nthat” kind of being. In addition, note that in explaining\nthis denomination, she is not merely talking about objective features\nof objects. Though she mentions “Composition and Figure,”\nwhich seem like objective features, she is writes about how these\n“Textures” appear. These qualifications give\nreason for viewing Astell as holding that a body’s individuality\nis based at least in part on how perceivers regard it and thus warrant\nus to consider Astell as a kind of phenomenalist about the\nindividuation of bodies. This kind of view not entail that perceivers\nare the sources of beings, for it is consistent with the position that\nGod is the ultimate source of all beings, whether they are human\nbeings, pieces of wood, or the small particles that compose these\nmortal beings. Rather, on this view, the existence of each of these\nbeings depends first and foremost on God, even though perceivers may\nplay a role in assigning them some aspects of their individuality.\n\n\nAstell discusses additional related issues that are hotly contested in\nthe period. For example, she offers proof of the real distinction\nbetween the mind and body is based on the claims that the nature of\nthe mind is thought and the nature of the body is extension\n(249–252 [sections 259–261]). (Her view can be compared to\nDescartes’s; see Atherton, 1993.) In addition, she uses her\naccount of the real distinction between the mind and body to show that\nmatter does not think. (Here she likely has in mind Locke’s view\nabout the possibility of thinking matter; see Bryson (1988), Squadrito\n(1987; 1991), Taylor (2001), O’Neill (1998a, 528–529), and\nBroad (2002a, 151–153), who discuss these arguments in\ndetail.)\n",
    "section_title": "1.2 Individuation among Beings: Minds, Bodies, and Mind-Body Unions",
    "entry_title": "Mary Astell",
    "hierarchy_title": "Mary Astell || Metaphysics || Individuation among Beings: Minds, Bodies, and Mind-Body Unions",
    "tokenized_text": [
        "metaphysics",
        "individuation",
        "among",
        "being",
        "mind",
        "body",
        "mindbody",
        "union",
        "individuation",
        "among",
        "being",
        "mind",
        "body",
        "mindbody",
        "union",
        "throughout",
        "text",
        "astell",
        "concerned",
        "giving",
        "account",
        "created",
        "being",
        "individuated",
        "ultimately",
        "maintains",
        "four",
        "kind",
        "created",
        "being",
        "mind",
        "body",
        "mindbody",
        "union",
        "particle",
        "compose",
        "body",
        "finite",
        "mind",
        "considered",
        "astell",
        "hold",
        "god",
        "creates",
        "mind",
        "intrinsic",
        "difference",
        "give",
        "number",
        "reason",
        "view",
        "one",
        "relationship",
        "god",
        "want",
        "mind",
        "human",
        "form",
        "community",
        "mind",
        "different",
        "intellectual",
        "capacity",
        "another",
        "concern",
        "relationship",
        "created",
        "mind",
        "god",
        "mind",
        "made",
        "contemplate",
        "enjoy",
        "god",
        "god",
        "need",
        "adoration",
        "love",
        "mind",
        "limited",
        "thus",
        "love",
        "god",
        "adoring",
        "limited",
        "amount",
        "work",
        "god",
        "creates",
        "many",
        "mind",
        "ability",
        "understand",
        "specific",
        "collection",
        "truth",
        "way",
        "creation",
        "attended",
        "astell",
        "sp",
        "though",
        "astell",
        "discus",
        "mind",
        "sometimes",
        "isolated",
        "body",
        "holding",
        "human",
        "being",
        "mindbody",
        "union",
        "note",
        "comprehend",
        "connection",
        "mind",
        "body",
        "know",
        "feel",
        "union",
        "soul",
        "body",
        "amongst",
        "u",
        "see",
        "clearly",
        "find",
        "certitude",
        "exactness",
        "secret",
        "tie",
        "unite",
        "two",
        "different",
        "substance",
        "able",
        "act",
        "upon",
        "union",
        "mind",
        "body",
        "mysterious",
        "though",
        "know",
        "feel",
        "perfect",
        "knowledge",
        "mind",
        "body",
        "interact",
        "causally",
        "christian",
        "religion",
        "astell",
        "present",
        "position",
        "way",
        "parallel",
        "one",
        "hand",
        "lack",
        "knowledge",
        "mindbody",
        "union",
        "hand",
        "lack",
        "knowledge",
        "relation",
        "god",
        "human",
        "tho",
        "understand",
        "philosophy",
        "union",
        "divine",
        "human",
        "nature",
        "neither",
        "comprehend",
        "vital",
        "union",
        "soul",
        "body",
        "manner",
        "joyn",
        "tho",
        "sure",
        "astell",
        "section",
        "see",
        "section",
        "additional",
        "discussion",
        "passage",
        "astell",
        "present",
        "array",
        "point",
        "mindbody",
        "union",
        "differ",
        "respect",
        "ability",
        "one",
        "point",
        "writes",
        "perhaps",
        "activity",
        "lifetime",
        "cause",
        "diligenthand",
        "maketh",
        "rich",
        "whil",
        "st",
        "slothful",
        "prodigal",
        "come",
        "nothing",
        "use",
        "power",
        "improves",
        "encreases",
        "observing",
        "considerate",
        "wisest",
        "person",
        "lay",
        "mind",
        "storehouse",
        "ready",
        "produce",
        "occasion",
        "clear",
        "simple",
        "idea",
        "every",
        "object",
        "time",
        "presented",
        "perhaps",
        "difference",
        "one",
        "woman",
        "reason",
        "anothers",
        "may",
        "consist",
        "one",
        "amass",
        "greater",
        "number",
        "idea",
        "dispos",
        "orderly",
        "understanding",
        "hand",
        "ready",
        "apply",
        "complex",
        "idea",
        "whose",
        "agreement",
        "disagreement",
        "found",
        "mean",
        "em",
        "astell",
        "sp",
        "second",
        "possible",
        "cause",
        "variety",
        "among",
        "human",
        "ability",
        "rooted",
        "god",
        "creationgod",
        "make",
        "mind",
        "larger",
        "capacity",
        "others",
        "primary",
        "cause",
        "limitation",
        "created",
        "mind",
        "subject",
        "limitation",
        "appears",
        "visible",
        "others",
        "mind",
        "endow",
        "creator",
        "larger",
        "capacity",
        "rest",
        "point",
        "capacity",
        "discussed",
        "greater",
        "detail",
        "section",
        "brief",
        "astell",
        "hold",
        "distinction",
        "capacious",
        "thinking",
        "whereas",
        "describes",
        "thinking",
        "equally",
        "distributed",
        "among",
        "people",
        "everyone",
        "ability",
        "think",
        "harmonious",
        "wellordered",
        "manner",
        "describes",
        "capacious",
        "thinking",
        "unevenly",
        "distributed",
        "among",
        "people",
        "people",
        "time",
        "training",
        "attain",
        "vast",
        "amount",
        "empirical",
        "knowledge",
        "go",
        "kind",
        "mental",
        "activity",
        "third",
        "possible",
        "cause",
        "variety",
        "human",
        "ability",
        "one",
        "familiar",
        "rationalist",
        "philosopher",
        "namely",
        "body",
        "impede",
        "mind",
        "perfect",
        "idea",
        "indisposition",
        "bodily",
        "organs",
        "cramp",
        "contract",
        "operation",
        "mind",
        "also",
        "consider",
        "humane",
        "nature",
        "consists",
        "union",
        "rational",
        "soul",
        "mortal",
        "body",
        "body",
        "often",
        "clog",
        "mind",
        "noblest",
        "operation",
        "especially",
        "indulg",
        "astell",
        "valorizes",
        "mind",
        "body",
        "following",
        "passage",
        "illustrates",
        "another",
        "way",
        "astell",
        "emphasizes",
        "point",
        "question",
        "shoul",
        "convinc",
        "body",
        "instrument",
        "mind",
        "much",
        "inferiour",
        "nature",
        "therefore",
        "ought",
        "kept",
        "case",
        "ready",
        "occasion",
        "serve",
        "mind",
        "true",
        "proper",
        "pleasure",
        "human",
        "nature",
        "consists",
        "exercise",
        "dominion",
        "soul",
        "body",
        "governing",
        "every",
        "passion",
        "motion",
        "according",
        "right",
        "reason",
        "truly",
        "pursue",
        "real",
        "good",
        "mistake",
        "well",
        "duty",
        "happiness",
        "consider",
        "either",
        "part",
        "u",
        "singly",
        "neglect",
        "due",
        "disregard",
        "body",
        "wholly",
        "pretend",
        "live",
        "like",
        "angel",
        "whilst",
        "mortal",
        "prefer",
        "equal",
        "mind",
        "degenerate",
        "brute",
        "astell",
        "sp",
        "whereas",
        "body",
        "merely",
        "instrumental",
        "role",
        "respect",
        "mind",
        "mind",
        "dominion",
        "body",
        "governing",
        "role",
        "passion",
        "human",
        "correctly",
        "employ",
        "mind",
        "body",
        "humanness",
        "degenerate",
        "brutishness",
        "presumptuously",
        "conduct",
        "life",
        "angel",
        "astell",
        "account",
        "mindbody",
        "union",
        "allows",
        "argue",
        "popular",
        "view",
        "period",
        "woman",
        "according",
        "woman",
        "demonstrate",
        "kind",
        "intellectual",
        "ability",
        "men",
        "woman",
        "inherently",
        "closely",
        "united",
        "body",
        "men",
        "equipped",
        "rationalist",
        "account",
        "mindbody",
        "union",
        "astell",
        "show",
        "much",
        "uniformity",
        "woman",
        "inability",
        "rooted",
        "nature",
        "soul",
        "rather",
        "arises",
        "social",
        "practice",
        "improperly",
        "directed",
        "attention",
        "thus",
        "difference",
        "ability",
        "woman",
        "men",
        "explained",
        "metaphysically",
        "epistemologically",
        "reason",
        "discussion",
        "issue",
        "left",
        "section",
        "entry",
        "addition",
        "developing",
        "account",
        "mindbody",
        "union",
        "astell",
        "also",
        "maintains",
        "mind",
        "body",
        "really",
        "distinct",
        "see",
        "view",
        "useful",
        "people",
        "spiritual",
        "growth",
        "people",
        "realize",
        "mind",
        "body",
        "really",
        "distinct",
        "also",
        "realize",
        "mind",
        "immortal",
        "realize",
        "future",
        "state",
        "beyond",
        "present",
        "life",
        "reflect",
        "future",
        "state",
        "prompted",
        "want",
        "happy",
        "eternity",
        "knowing",
        "maker",
        "way",
        "god",
        "become",
        "important",
        "astell",
        "cr",
        "section",
        "presenting",
        "account",
        "real",
        "distinction",
        "mind",
        "body",
        "christian",
        "religion",
        "astell",
        "demonstrates",
        "first",
        "mind",
        "immaterial",
        "us",
        "result",
        "show",
        "immortal",
        "argument",
        "thus",
        "maintains",
        "mind",
        "immaterial",
        "part",
        "indivisible",
        "given",
        "indivisible",
        "incorruptible",
        "therefore",
        "immortal",
        "section",
        "ruled",
        "natural",
        "annihilation",
        "mind",
        "astell",
        "turn",
        "question",
        "whether",
        "god",
        "would",
        "supernaturally",
        "annihilate",
        "mind",
        "argues",
        "would",
        "god",
        "nothing",
        "vain",
        "thus",
        "would",
        "create",
        "something",
        "annihilate",
        "section",
        "within",
        "discussion",
        "immortality",
        "mind",
        "astell",
        "contrast",
        "mind",
        "body",
        "also",
        "contrast",
        "different",
        "kind",
        "body",
        "explains",
        "human",
        "body",
        "physical",
        "object",
        "part",
        "particle",
        "make",
        "being",
        "part",
        "human",
        "body",
        "physical",
        "object",
        "perishable",
        "corruptible",
        "several",
        "thing",
        "say",
        "corruptible",
        "being",
        "contrast",
        "particle",
        "make",
        "first",
        "particle",
        "make",
        "corruptible",
        "being",
        "corruptible",
        "go",
        "part",
        "corruptible",
        "being",
        "come",
        "particle",
        "make",
        "change",
        "configuration",
        "writes",
        "tho",
        "system",
        "bone",
        "flesh",
        "skin",
        "call",
        "body",
        "shall",
        "within",
        "threescore",
        "year",
        "wood",
        "upon",
        "fire",
        "shall",
        "hour",
        "two",
        "material",
        "being",
        "shall",
        "proper",
        "season",
        "yet",
        "least",
        "particle",
        "doth",
        "totally",
        "perish",
        "astell",
        "section",
        "continues",
        "describe",
        "individuality",
        "corruptible",
        "being",
        "mortal",
        "corruptible",
        "cease",
        "part",
        "consists",
        "whose",
        "particular",
        "composition",
        "figure",
        "denominates",
        "distinguishes",
        "being",
        "longer",
        "thus",
        "united",
        "ceasing",
        "appear",
        "first",
        "texture",
        "figure",
        "therefore",
        "properly",
        "said",
        "astell",
        "section",
        "notice",
        "astell",
        "talking",
        "denominate",
        "corruptible",
        "being",
        "kind",
        "addition",
        "note",
        "explaining",
        "denomination",
        "merely",
        "talking",
        "objective",
        "feature",
        "object",
        "though",
        "mention",
        "composition",
        "figure",
        "seem",
        "like",
        "objective",
        "feature",
        "writes",
        "texture",
        "appear",
        "qualification",
        "give",
        "reason",
        "viewing",
        "astell",
        "holding",
        "body",
        "individuality",
        "based",
        "least",
        "part",
        "perceiver",
        "regard",
        "thus",
        "warrant",
        "u",
        "consider",
        "astell",
        "kind",
        "phenomenalist",
        "individuation",
        "body",
        "kind",
        "view",
        "entail",
        "perceiver",
        "source",
        "being",
        "consistent",
        "position",
        "god",
        "ultimate",
        "source",
        "being",
        "whether",
        "human",
        "being",
        "piece",
        "wood",
        "small",
        "particle",
        "compose",
        "mortal",
        "being",
        "rather",
        "view",
        "existence",
        "being",
        "depends",
        "first",
        "foremost",
        "god",
        "even",
        "though",
        "perceiver",
        "may",
        "play",
        "role",
        "assigning",
        "aspect",
        "individuality",
        "astell",
        "discus",
        "additional",
        "related",
        "issue",
        "hotly",
        "contested",
        "period",
        "example",
        "offer",
        "proof",
        "real",
        "distinction",
        "mind",
        "body",
        "based",
        "claim",
        "nature",
        "mind",
        "thought",
        "nature",
        "body",
        "extension",
        "section",
        "view",
        "compared",
        "descartes",
        "see",
        "atherton",
        "addition",
        "us",
        "account",
        "real",
        "distinction",
        "mind",
        "body",
        "show",
        "matter",
        "think",
        "likely",
        "mind",
        "locke",
        "view",
        "possibility",
        "thinking",
        "matter",
        "see",
        "bryson",
        "squadrito",
        "taylor",
        "neill",
        "a",
        "broad",
        "a",
        "discus",
        "argument",
        "detail"
    ]
}