{
    "main_text": "Method: Philosophy of Education\n3. Method: Philosophy of Education\n\nOne thread that runs through rationalist philosophies concerns the\nrelation between knowledge and method. Methods are pedagogical\nstrategies that lead novices from confusion to knowledge (clarity). As\nlong as novices are confused, it is because they lack a method that\nleads them from their particular forms of confusion to knowledge. The\njob of the philosopher is to understand the confusions and to devise a\nmethod that will support the novices on their journeys (see Nelson\n2005). For example, Plato explains how the body confuses the soul, and\nhe illustrates how the dialectic can lead his interlocutor to grasp\nthe forms. Descartes agrees with Plato about the body’s\nconfusion of the soul, adding that scholastic teachings lead to\nfurther confusion, especially in that they reinforce childhood\nprejudice, which is rooted in an overemphasis on the senses. His\nfamous method of doubt is one instantiation of his general account of\nmethod, encapsulated in the four rules he presents in Part II of\nDiscourse on the Method (AT VI 18–9; CSM I 20). In\nDiscourse on the Method and Meditations on First\nPhilosophy, the meditator utilizes the method of doubt so she can\nmove from confusion and obscurity to clarity and distinctness. This\nissue relates to epistemology (because it is about knowledge, see\nsection 2) and ethics (insofar as confusion and knowledge inform moral\nagency and action, see section 4).\n\nLike Plato and Descartes, Astell provides an explanation of the\nnovice’s initial confusion and offers a method that can be\nemployed to resolve the condition. In doing so, she focuses on the\ntrajectory of a very specific group of female novices, namely the\n“Ladies” she names in the title of her text A Serious\nProposal to the Ladies. These are the gentry and noble women of\nher social circle, women who are predominantly English and likely\nidentify as White, which is a new racial category just being\nconstructed during Astell’s century. Thus, Astell is not\ntheorizing the condition of all women, for she is not talking\nabout, for example, the women of various races and national origins\nwhom she and her peers paid, indentured, and/or enslaved to serve\nthem, both at home and abroad (see Perry, 1986, 253–62, for a\ndiscussion of the ways in which Astell’s patrons were involved\nin colonialist ventures). In what follows, the women Astell is\ntheorizing are referred to in ways that continue to make it clear that\nthey were a specific group of women—they were, for example,\n“Astell’s novices,” “the women of\nAstell’s intended audience,” or (simply) the\n“Ladies.”\n\nAstell theorizes what is specific about her novice’s initial\nconfusions and she constructs a method tailored specifically for them.\nIn doing so, she theorizes some of the political issues about power\nthat are intertwined with how these epistemic problems arise, and she\nalso theorizes how they can be resolved. Note that Astell theorizes\n“some” of the political issues. On the one hand, she\naddresses how these women are disadvantaged and dominated by men of\ntheir rank and race, as well as by the institutions that support these\nmen. But on the other hand, she does not theorize the ways in which\nthese women themselves—herself included—were advantaged\nand elevated by their gender, sexuality, race, rank, and national\norigin, as well as by the colonial institutions that supported Astell\nand her audience. That is, Astell is theorizing her own and her\naudience’s domination by men, but not these women’s\nprivilege.\n\nAs Astell sees it, the problem that faces her novice is that this\nwoman has a diseased mind as the result of social conditioning in a\nhierarchy that disadvantages her because of (what we today call) her\ngender. This diseased mind manifests in part as a particular skeptical\npredicament: she has a radical doubt about her nature, for she\nbelieves God made her with a degraded reason and a natural pride and\nvanity. That is, she adopts the prejudice that she is incapable of\nimproving because she sees herself as naturally proud and vain (Astell\nSP, 58, 62). Gripped with this skeptical predicament, she has no\ndesire to improve her mind, and she lacks an ability to understand her\nperfections, which would otherwise guide her in living a virtuous life\n(80–1, 200, 202, 228). Thus she develops an account of (what has\nbeen called by Sowaal [2007, 2016]) the Women’s Defective\nNature Prejudice, and develops strategies for how to resolve it\n(see sections 3.1 and 3.2). (See Forbes for how this view of prejudice\nconnects with contemporary feminism.)\n\nAnother way Astell frames the problem facing the women of her audience\nis in terms of an account of the passions. She maintains that all\n“Rational Natures” have within them both generosity and a\nstriving for perfection (62). Here we assume she is using the term\n‘generosity’ in the Cartesian sense. Descartes writes:\n\nThe first consists in his knowing that nothing truly belongs to him\nbut this freedom to dispose his volitions, and that he ought to be\npraised or blamed for no other reason than his using this freedom well\nor badly. The second consists in his feeling within himself a firm and\nconstant resolution to use it well—that is, never to lack the\nwill to undertake and carry out whatever he judges to be best. To do\nthat is to pursue virtue in a perfect manner. (AT 11 445–6; CSM\nI 364)\n\n\nFor our purposes, this passage can be glossed in the following manner:\na person has generosity when she realizes that she is merely her will\nand she has the resolution to use it well. For Descartes, generosity\nis both a passion and a virtue. It is the keystone passion in that\nwhen one has it, one does not have vices. This is so because vices\nrest on a misunderstanding of what one is and what one’s goods\nare. (See Sowaal 2017 for a longer discussion of Astell on\ngenerosity.)\n\nAstell explains that because the women of her audience are not\nprovided with effective educations in the knowledge of what things\nexist and what their properties are (that is, an education in\nmetaphysics), they do not develop the knowledge of what they truly are\n(their wills), nor do they develop the resolution to use their wills\nwell. Instead, they focus on creating physical perfection and also on\nthe praises that accompany it. Thus they develop vanity and pride, the\n“feminine vices” (Astell SP, 62–64).\n\nUltimately, Astell has in mind two goals regarding the transformation\nof the women she addresses: one for their “temporal”\nlifetimes, one for their “eternal” lifetimes, namely their\nsalvation.\n\nFor this lifetime: these women need to gain “empire” over\ntheir selves. Indeed, Astell employs the term ‘empire’\nmany times in Serious Proposal to mean self-control (56, 58,\n72, 86). Of course, for Astell, this empire is the result of divine\ngrace (not human effort), which may be occasioned when a person\nengages in spiritual practices of surrender. (See Kotva for a\ndiscussion of effort and grace in the early modern period.)\n\nWith respect to salvation: these women need to learn to separate their\nminds from their bodies while on earth. If they do not learn to\nperfect their rational capacities by forming clear and distinct\nperceptions—thereby polishing their innate ideas and ordering\nand employing them correctly—, then they will not be able to\nseparate their minds from their bodies when they die, and their souls\nwill not reach heaven. She writes:\n\nAnd since our Happiness in the next World, depends so far on those\ndispositions which we carry along with us out of this, that without a\nright habitude and temper of mind we are not capable of Felicity; and\nseeing our Beatitude consists in the contemplation of the divine Truth\nand Beauty, as well as in the fruition of his Goodness, can Ignorance\nbe a fit preparative for Heaven? Is’t likely that she whose\nUnderstanding has been busied about nothing but froth and trifles,\nshou’d be capable of delighting her self in noble and sublime\nTruths? (80–81)\n\n\nIn this way Astell’s rationalist education remedies a practical\nproblem of the individuation of the body and soul at death by\nsuggesting a path for a specific group of women. This elucidates the\nkind of education Astell promotes: it is not preparation for a career\nas a doctor, lawyer, curate, or scientist; nor is it the precursor to\nwhat we today call a “liberal education.” Instead it is an\neducation that teaches the women of her rank and race how to cultivate\nintellectual enjoyment and perfection, and ultimately generosity and\nvirtue.\n\nAstell recognizes that these women need to employ a method to aid them\nin these practices that will prepare them for grace. These women have\nbeen raised to be idle and to concern themselves with frivolous\nthings. When they seek to better themselves, they do not know how to\ndo so, and so they are quickly discouraged: “they want [lack]\nthe method of doing it; they know not how to look into their Souls, or\nif they do, they find so many disorders to be rectified, so many wants\nto be supplied, that frightened with the difficulty of the world they\nlay aside the thoughts of undertaking it” (124).\n\nAstell offers two proposals for the education of the women she\ndirectly addresses and seeks to teach. One takes place at a\nwomen’s monastery she calls the Religious Retirement, the other\ncan be done outside such an institution.\n",
    "section_title": "3. Method: Philosophy of Education",
    "entry_title": "Mary Astell",
    "hierarchy_title": "Mary Astell || Method: Philosophy of Education",
    "tokenized_text": [
        "method",
        "philosophy",
        "education",
        "method",
        "philosophy",
        "education",
        "one",
        "thread",
        "run",
        "rationalist",
        "philosophy",
        "concern",
        "relation",
        "knowledge",
        "method",
        "method",
        "pedagogical",
        "strategy",
        "lead",
        "novice",
        "confusion",
        "knowledge",
        "clarity",
        "long",
        "novice",
        "confused",
        "lack",
        "method",
        "lead",
        "particular",
        "form",
        "confusion",
        "knowledge",
        "job",
        "philosopher",
        "understand",
        "confusion",
        "devise",
        "method",
        "support",
        "novice",
        "journey",
        "see",
        "nelson",
        "example",
        "plato",
        "explains",
        "body",
        "confuses",
        "soul",
        "illustrates",
        "dialectic",
        "lead",
        "interlocutor",
        "grasp",
        "form",
        "descartes",
        "agrees",
        "plato",
        "body",
        "confusion",
        "soul",
        "adding",
        "scholastic",
        "teaching",
        "lead",
        "confusion",
        "especially",
        "reinforce",
        "childhood",
        "prejudice",
        "rooted",
        "overemphasis",
        "sens",
        "famous",
        "method",
        "doubt",
        "one",
        "instantiation",
        "general",
        "account",
        "method",
        "encapsulated",
        "four",
        "rule",
        "present",
        "part",
        "ii",
        "discourse",
        "method",
        "vi",
        "csm",
        "discourse",
        "method",
        "meditation",
        "first",
        "philosophy",
        "meditator",
        "utilizes",
        "method",
        "doubt",
        "move",
        "confusion",
        "obscurity",
        "clarity",
        "distinctness",
        "issue",
        "relates",
        "epistemology",
        "knowledge",
        "see",
        "section",
        "ethic",
        "insofar",
        "confusion",
        "knowledge",
        "inform",
        "moral",
        "agency",
        "action",
        "see",
        "section",
        "like",
        "plato",
        "descartes",
        "astell",
        "provides",
        "explanation",
        "novice",
        "initial",
        "confusion",
        "offer",
        "method",
        "employed",
        "resolve",
        "condition",
        "focus",
        "trajectory",
        "specific",
        "group",
        "female",
        "novice",
        "namely",
        "lady",
        "name",
        "title",
        "text",
        "serious",
        "proposal",
        "lady",
        "gentry",
        "noble",
        "woman",
        "social",
        "circle",
        "woman",
        "predominantly",
        "english",
        "likely",
        "identify",
        "white",
        "new",
        "racial",
        "category",
        "constructed",
        "astell",
        "century",
        "thus",
        "astell",
        "theorizing",
        "condition",
        "woman",
        "talking",
        "example",
        "woman",
        "various",
        "race",
        "national",
        "origin",
        "peer",
        "paid",
        "indentured",
        "andor",
        "enslaved",
        "serve",
        "home",
        "abroad",
        "see",
        "perry",
        "discussion",
        "way",
        "astell",
        "patron",
        "involved",
        "colonialist",
        "venture",
        "follows",
        "woman",
        "astell",
        "theorizing",
        "referred",
        "way",
        "continue",
        "make",
        "clear",
        "specific",
        "group",
        "womenthey",
        "example",
        "astell",
        "novice",
        "woman",
        "astell",
        "intended",
        "audience",
        "simply",
        "ladies",
        "astell",
        "theorizes",
        "specific",
        "novice",
        "initial",
        "confusion",
        "construct",
        "method",
        "tailored",
        "specifically",
        "theorizes",
        "political",
        "issue",
        "power",
        "intertwined",
        "epistemic",
        "problem",
        "arise",
        "also",
        "theorizes",
        "resolved",
        "note",
        "astell",
        "theorizes",
        "political",
        "issue",
        "one",
        "hand",
        "address",
        "woman",
        "disadvantaged",
        "dominated",
        "men",
        "rank",
        "race",
        "well",
        "institution",
        "support",
        "men",
        "hand",
        "theorize",
        "way",
        "woman",
        "themselvesherself",
        "includedwere",
        "advantaged",
        "elevated",
        "gender",
        "sexuality",
        "race",
        "rank",
        "national",
        "origin",
        "well",
        "colonial",
        "institution",
        "supported",
        "astell",
        "audience",
        "astell",
        "theorizing",
        "audience",
        "domination",
        "men",
        "woman",
        "privilege",
        "astell",
        "see",
        "problem",
        "face",
        "novice",
        "woman",
        "diseased",
        "mind",
        "result",
        "social",
        "conditioning",
        "hierarchy",
        "disadvantage",
        "today",
        "call",
        "gender",
        "diseased",
        "mind",
        "manifest",
        "part",
        "particular",
        "skeptical",
        "predicament",
        "radical",
        "doubt",
        "nature",
        "belief",
        "god",
        "made",
        "degraded",
        "reason",
        "natural",
        "pride",
        "vanity",
        "adopts",
        "prejudice",
        "incapable",
        "improving",
        "see",
        "naturally",
        "proud",
        "vain",
        "astell",
        "sp",
        "gripped",
        "skeptical",
        "predicament",
        "desire",
        "improve",
        "mind",
        "lack",
        "ability",
        "understand",
        "perfection",
        "would",
        "otherwise",
        "guide",
        "living",
        "virtuous",
        "life",
        "thus",
        "develops",
        "account",
        "called",
        "sowaal",
        "woman",
        "defective",
        "nature",
        "prejudice",
        "develops",
        "strategy",
        "resolve",
        "see",
        "section",
        "see",
        "forbes",
        "view",
        "prejudice",
        "connects",
        "contemporary",
        "feminism",
        "another",
        "way",
        "astell",
        "frame",
        "problem",
        "facing",
        "woman",
        "audience",
        "term",
        "account",
        "passion",
        "maintains",
        "rational",
        "nature",
        "within",
        "generosity",
        "striving",
        "perfection",
        "assume",
        "using",
        "term",
        "generosity",
        "cartesian",
        "sense",
        "descartes",
        "writes",
        "first",
        "consists",
        "knowing",
        "nothing",
        "truly",
        "belongs",
        "freedom",
        "dispose",
        "volition",
        "ought",
        "praised",
        "blamed",
        "reason",
        "using",
        "freedom",
        "well",
        "badly",
        "second",
        "consists",
        "feeling",
        "within",
        "firm",
        "constant",
        "resolution",
        "use",
        "wellthat",
        "never",
        "lack",
        "undertake",
        "carry",
        "whatever",
        "judge",
        "best",
        "pursue",
        "virtue",
        "perfect",
        "manner",
        "csm",
        "purpose",
        "passage",
        "glossed",
        "following",
        "manner",
        "person",
        "generosity",
        "realizes",
        "merely",
        "resolution",
        "use",
        "well",
        "descartes",
        "generosity",
        "passion",
        "virtue",
        "keystone",
        "passion",
        "one",
        "one",
        "vice",
        "vice",
        "rest",
        "misunderstanding",
        "one",
        "one",
        "good",
        "see",
        "sowaal",
        "longer",
        "discussion",
        "astell",
        "generosity",
        "astell",
        "explains",
        "woman",
        "audience",
        "provided",
        "effective",
        "education",
        "knowledge",
        "thing",
        "exist",
        "property",
        "education",
        "metaphysics",
        "develop",
        "knowledge",
        "truly",
        "will",
        "develop",
        "resolution",
        "use",
        "will",
        "well",
        "instead",
        "focus",
        "creating",
        "physical",
        "perfection",
        "also",
        "praise",
        "accompany",
        "thus",
        "develop",
        "vanity",
        "pride",
        "feminine",
        "vice",
        "astell",
        "sp",
        "ultimately",
        "astell",
        "mind",
        "two",
        "goal",
        "regarding",
        "transformation",
        "woman",
        "address",
        "one",
        "temporal",
        "lifetime",
        "one",
        "eternal",
        "lifetime",
        "namely",
        "salvation",
        "lifetime",
        "woman",
        "need",
        "gain",
        "empire",
        "self",
        "indeed",
        "astell",
        "employ",
        "term",
        "empire",
        "many",
        "time",
        "serious",
        "proposal",
        "mean",
        "selfcontrol",
        "course",
        "astell",
        "empire",
        "result",
        "divine",
        "grace",
        "human",
        "effort",
        "may",
        "occasioned",
        "person",
        "engages",
        "spiritual",
        "practice",
        "surrender",
        "see",
        "kotva",
        "discussion",
        "effort",
        "grace",
        "early",
        "modern",
        "period",
        "respect",
        "salvation",
        "woman",
        "need",
        "learn",
        "separate",
        "mind",
        "body",
        "earth",
        "learn",
        "perfect",
        "rational",
        "capacity",
        "forming",
        "clear",
        "distinct",
        "perceptionsthereby",
        "polishing",
        "innate",
        "idea",
        "ordering",
        "employing",
        "correctly",
        "able",
        "separate",
        "mind",
        "body",
        "die",
        "soul",
        "reach",
        "heaven",
        "writes",
        "since",
        "happiness",
        "next",
        "world",
        "depends",
        "far",
        "disposition",
        "carry",
        "along",
        "u",
        "without",
        "right",
        "habitude",
        "temper",
        "mind",
        "capable",
        "felicity",
        "seeing",
        "beatitude",
        "consists",
        "contemplation",
        "divine",
        "truth",
        "beauty",
        "well",
        "fruition",
        "goodness",
        "ignorance",
        "fit",
        "preparative",
        "heaven",
        "likely",
        "whose",
        "understanding",
        "busied",
        "nothing",
        "froth",
        "trifle",
        "shou",
        "capable",
        "delighting",
        "self",
        "noble",
        "sublime",
        "truth",
        "way",
        "astell",
        "rationalist",
        "education",
        "remedy",
        "practical",
        "problem",
        "individuation",
        "body",
        "soul",
        "death",
        "suggesting",
        "path",
        "specific",
        "group",
        "woman",
        "elucidates",
        "kind",
        "education",
        "astell",
        "promotes",
        "preparation",
        "career",
        "doctor",
        "lawyer",
        "curate",
        "scientist",
        "precursor",
        "today",
        "call",
        "liberal",
        "education",
        "instead",
        "education",
        "teach",
        "woman",
        "rank",
        "race",
        "cultivate",
        "intellectual",
        "enjoyment",
        "perfection",
        "ultimately",
        "generosity",
        "virtue",
        "astell",
        "recognizes",
        "woman",
        "need",
        "employ",
        "method",
        "aid",
        "practice",
        "prepare",
        "grace",
        "woman",
        "raised",
        "idle",
        "concern",
        "frivolous",
        "thing",
        "seek",
        "better",
        "know",
        "quickly",
        "discouraged",
        "want",
        "lack",
        "method",
        "know",
        "look",
        "soul",
        "find",
        "many",
        "disorder",
        "rectified",
        "many",
        "want",
        "supplied",
        "frightened",
        "difficulty",
        "world",
        "lay",
        "aside",
        "thought",
        "undertaking",
        "astell",
        "offer",
        "two",
        "proposal",
        "education",
        "woman",
        "directly",
        "address",
        "seek",
        "teach",
        "one",
        "take",
        "place",
        "woman",
        "monastery",
        "call",
        "religious",
        "retirement",
        "done",
        "outside",
        "institution"
    ]
}