{
    "main_text": "Two Arguments for Local Atheism || The Decisive Evidence Argument\n6.3 The Decisive Evidence Argument\n\nNotice that the general strategy of the particular version of the low\npriors argument discussed above is to find an alternative to\nomni-theism that is much less specific than omni-theism (and\npartly for that reason much more probable intrinsically),\nwhile at the same time having enough content of the right sort to fit\nthe totality of the relevant data at least as well as theism does. In\nother words, the goal is to find a runner like source physicalism that\nbegins the race with a large head start and thus wins by a large\nmargin because it runs the race for supporting evidence and thus for\nprobability at roughly the same speed as omni-theism does. This\ndoesn’t show that source physicalism is probable (a “large\nmargin” in this context means a large ratio of one probability\nto another, not a large difference between the probabilities), because\nthere may be even better runners in the race; it does, however, show\nthat omni-theism loses the race by a large margin and thus is very\nprobably false.\n\nAn alternative strategy is to find a runner that begins the race tied\nwith omni-theism, but runs the race for evidential support much faster\nthan omni-theism does, thus once again winning the race by a margin\nthat is sufficiently large for the rest of the argument to go through.\nA good name for an argument pursuing this second strategy is the\n“decisive evidence argument”. The choice of alternative\nhypothesis is crucial here just as it was in the low priors argument.\nOne promising choice is “aesthetic deism”. (Another would\nbe a more detailed version of source physicalism that, unlike source\nphysicalism in general, makes the relevant data antecedently much more\nprobable than theism does.) In order to help ensure that omni-theism\nand aesthetic deism begin the race at the same starting\nline—that is, have the same intrinsic\nprobability—“aesthetic deism” is best defined in\nsuch a way that it is almost identical to omni-theism. Thus, it may be\nstipulated that, like omni-theism, aesthetic deism implies that an\neternal, non-physical, omnipotent, and omniscient being created the\nphysical world. The only difference, then, between the God of\nomni-theism and the deity of aesthetic deism is what motivates them.\nAn omni-theistic God would be morally perfect and so strongly\nmotivated by considerations of the well-being of sentient creatures.\nAn aesthetic deistic God, on the other hand, would prioritize\naesthetic goods over moral ones. While such a being would want a\nbeautiful universe, perhaps the best metaphor here is not that of a\ncosmic artist, but instead that of a cosmic playwright: an\nauthor of nature who wants above all to write an interesting\nstory.\n\nAs everyone knows, good stories never begin with the line “and\nthey lived happily ever after”, and that line is the last line\nof any story that contains it. Further, containing such a line is\nhardly necessary for a story to be good. If aesthetic deism is true,\nthen it may very well be true that, “all the world’s a\nstage, and all the men and women merely players”\n(emphasis added). In any case, the hypothesis of aesthetic deism makes\n“predictions” about the condition of sentient beings in\nthe world that are very different from the ones that the hypothesis of\nomni-theism makes. After all, what makes a good story good is often\nsome intense struggle between good and evil, and all good stories\ncontain some mixture of benefit and harm. This suggests that the\nobserved mixture of good and evil in our world decisively favors\naesthetic deism over omni-theism. And if that’s right, then\naesthetic deism pulls far ahead of omni-theism in the race for\nprobability, thereby proving that omni-theism is very improbable.\n\nHere is one possible formulation of this argument:\n\n\n(1)Aesthetic\ndeism is at least as probable intrinsically as\nomni-theism.\n\n\n(2)The\ntotal evidence excluding “the data of good and evil” does\nnot favor omni-theism over aesthetic deism.\n\n\n(3)Given\nthe total evidence excluding the data of good and evil, the data of\ngood and evil strongly favor aesthetic deism over\nomni-theism.\n It follows from (1), (2), and (3) that\n\n\n(4)Aesthetic\ndeism is many times more probable than\nomni-theism.\n It follows from (4) that\n\n\n(5)Omni-theism\nis very probably false.\n It follows from (5) that\n\n\n(6)Atheism\n(understood here as the denial of omni-theism) is very probably\ntrue.\n\n\n\nSteps (4)–(6) of this argument are the same as steps\n(3)–(5) of the low priors argument except that “source\nphysicalism” in step (3) of the low priors argument is replaced\nby “aesthetic deism” in step (4) of the decisive evidence\nargument. This makes no difference as far as the inference from step\n(4) to step (5) is concerned. That inference, like the inferences from\nsteps (1)–(3) to step (4) and from step (5) to step (6), is\nclearly correct. The key question, then, is whether premises (1), (2),\nand (3) are all true.\n\nIn spite of the nearly complete overlap between omni-theism and\naesthetic deism, Richard Swinburne (2004: 96–109) would\nchallenge premise\n (1)\n on the grounds that aesthetic deism, unlike omni-theism, must posit a\nbad desire to account for why the deity does not do what is morally\nbest. Omni-theism need not do this, according to Swinburne, because\nwhat is morally best just is what is overall best, and thus an\nomniscient being will of necessity do what is morally best so long as\nit has no desires other than the desires it has simply by virtue of\nknowing what the best thing to do is in any given situation. This\nchallenge depends, however, on a highly questionable motivational\nintellectualism: it succeeds only if merely believing that an action\nis good entails a desire to do it. On most theories of motivation,\nthere is a logical gap between the intellect and desire. If such a gap\nexists, then it would seem that omni-theism is no more probable\nintrinsically than aesthetic deism.\n\nIt’s hard to think of a plausible challenge to premise\n (2)\n because, at least when it comes to the usual evidence taken to favor\ntheism over competing hypotheses like naturalism, aesthetic deism\naccounts for that evidence at least as well as omni-theism does. For\nexample, a deity interested in good narrative would want a world that\nis complex and yet ordered, that contains beauty, consciousness,\nintelligence, and moral agency. Perhaps there is more reason to expect\nthe existence of libertarian free will on omni-theism than on\naesthetic deism; but unless one starts from the truth of omni-theism,\nthere seems to be little reason to believe that we have such freedom.\nAnd even if one takes seriously introspective or other non-theological\nevidence for libertarian free will, it is not difficult to construct a\n“de-odicy” here: a good explanation in terms of aesthetic\ndeism either of the existence of libertarian free will or of why there\nis apparently strong but ultimately misleading evidence for its\nexistence. For example, if open theists are right that not even an\nomniscient being can know with certainty what (libertarian) free\nchoices will be made in the future, then aesthetic deism could account\nfor libertarian free will and other sorts of indeterminacy by claiming\nthat a story with genuine surprises is better than one that is\ncompletely predictable. Alternatively, what might be important for the\nstory is only that the characters think they have free will, not that\nthey really have it.\n\nFinally, there is premise\n (3),\n which asserts that the data of good and evil decisively favors\naesthetic deism over theism. In this context, the “data of good\nand evil” include everything we know about how sentient beings,\nincluding humans, are benefitted or harmed. A full discussion of this\npremise is not possible here, but recognition of its plausibility\nappears to be as old as the problem of evil itself. Consider, for\nexample, the Book of Job, whose protagonist, a righteous man who\nsuffers horrifically, accuses God of lacking sufficient commitment to\nthe moral value of justice. The vast majority of commentators agree\nthat God does not directly respond to Job’s charge. Instead,\nspeaking out of the whirlwind, He describes His design of the cosmos\nand of the animal kingdom in a way clearly intended to emphasize His\npower and the grandeur of His creation. Were it not for theological\nworries about God’s moral perfection, the most natural\ninterpretation of this part of the story would be either that God\nagrees with Job’s charge that He is unjust or that God denies\nthat Job can sensibly apply terms like “just” and\n“unjust” to Him because He and Job are not members of any\nshared moral community (Morriston forthcoming; for an opposing view,\nsee Stump 2010: chapter 9). This is why Job’s first response to\nGod’s speech (before capitulating in his second response) is\njust to refuse to repeat his (unanswered) accusation. On this\ninterpretation, the creator that confronts Job is not the God he\nexpected and definitely not the God of omni-theism, but rather a being\nmuch more like the deity of aesthetic deism.\n\nThose who claim that a God might allow evil because it is the\ninevitable result of the universe being governed by laws of nature\nalso lend support, though unintentionally, to the idea that, if there\nis an author of nature, then that being is more likely motivated by\naesthetic concerns than moral ones. For example, it may be that\nproducing a universe governed by a few laws expressible as elegant\nmathematical equations is an impressive accomplishment, not just\nbecause of the wisdom and power required for such a task, but also\nbecause of the aesthetic value of such a universe. That value may very\nwell depend, however, on the creator’s choosing not to intervene\nregularly in nature to protect His creatures from harm.\n\nMuch of the aesthetic value of the animal kingdom may also depend on\nits being the result of a long evolutionary process driven by\nmechanisms like natural selection. As Darwin (1859) famously said in\nthe last lines of On the Origin of Species by Means of Natural\nSelection,\n\n\nThere is grandeur in this view of life, with its several powers,\nhaving been originally breathed into a few forms or into one; and\nthat, whilst this planet has gone cycling on according to the fixed\nlaw of gravity, from so simple a beginning endless forms most\nbeautiful and wonderful have been, and are being evolved.\n\n\nUnfortunately, such a process, if it is to produce sentient life, may\nalso entail much suffering and countless early deaths. One\nquestionable assumption of some natural order theodicists is to think\nthat such connections between aesthetic goods and suffering provide a\nmoral justification for God’s allowing horrific\nsuffering. It is arguably far more plausible that in such a scenario\nthe value of preventing horrendous suffering would, from a moral point\nof view, far outweigh the value of regularity, sublimity, and\nnarrative. If so, then a morally perfect God would not trade\nthe former for the latter though a deity motivated primarily by\naesthetic reasons no doubt would.\n\nTo summarize, nearly everyone agrees that the world contains both\ngoods and evils. Pleasure and pain, love and hate, achievement and\nfailure, flourishing and languishing, and virtue and vice all exist in\ngreat abundance. In spite of that, some see signs of cosmic teleology.\nThose who defend the version of the decisive evidence argument stated\nabove need not deny the teleology. They do need to show that it is far\neasier to make sense of the “strange mixture of good and ill,\nwhich appears in life” (Hume Dialogues, XI, 14) when\nthat teleology is interpreted as amoral instead of as moral (cf.\nMulgan 2015 and Murphy 2017) and in particular when it is interpreted\nas directed towards aesthetic ends instead of towards moral ends.\n",
    "section_title": "6.3 The Decisive Evidence Argument",
    "entry_title": "Atheism and Agnosticism",
    "hierarchy_title": "Atheism and Agnosticism || Two Arguments for Local Atheism || The Decisive Evidence Argument",
    "tokenized_text": [
        "two",
        "argument",
        "local",
        "atheism",
        "decisive",
        "evidence",
        "argument",
        "decisive",
        "evidence",
        "argument",
        "notice",
        "general",
        "strategy",
        "particular",
        "version",
        "low",
        "prior",
        "argument",
        "discussed",
        "find",
        "alternative",
        "omnitheism",
        "much",
        "le",
        "specific",
        "omnitheism",
        "partly",
        "reason",
        "much",
        "probable",
        "intrinsically",
        "time",
        "enough",
        "content",
        "right",
        "sort",
        "fit",
        "totality",
        "relevant",
        "data",
        "least",
        "well",
        "theism",
        "word",
        "goal",
        "find",
        "runner",
        "like",
        "source",
        "physicalism",
        "begin",
        "race",
        "large",
        "head",
        "start",
        "thus",
        "win",
        "large",
        "margin",
        "run",
        "race",
        "supporting",
        "evidence",
        "thus",
        "probability",
        "roughly",
        "speed",
        "omnitheism",
        "show",
        "source",
        "physicalism",
        "probable",
        "large",
        "margin",
        "context",
        "mean",
        "large",
        "ratio",
        "one",
        "probability",
        "another",
        "large",
        "difference",
        "probability",
        "may",
        "even",
        "better",
        "runner",
        "race",
        "however",
        "show",
        "omnitheism",
        "loses",
        "race",
        "large",
        "margin",
        "thus",
        "probably",
        "false",
        "alternative",
        "strategy",
        "find",
        "runner",
        "begin",
        "race",
        "tied",
        "omnitheism",
        "run",
        "race",
        "evidential",
        "support",
        "much",
        "faster",
        "omnitheism",
        "thus",
        "winning",
        "race",
        "margin",
        "sufficiently",
        "large",
        "rest",
        "argument",
        "go",
        "good",
        "name",
        "argument",
        "pursuing",
        "second",
        "strategy",
        "decisive",
        "evidence",
        "argument",
        "choice",
        "alternative",
        "hypothesis",
        "crucial",
        "low",
        "prior",
        "argument",
        "one",
        "promising",
        "choice",
        "aesthetic",
        "deism",
        "another",
        "would",
        "detailed",
        "version",
        "source",
        "physicalism",
        "unlike",
        "source",
        "physicalism",
        "general",
        "make",
        "relevant",
        "data",
        "antecedently",
        "much",
        "probable",
        "theism",
        "order",
        "help",
        "ensure",
        "omnitheism",
        "aesthetic",
        "deism",
        "begin",
        "race",
        "starting",
        "linethat",
        "intrinsic",
        "probability",
        "aesthetic",
        "deism",
        "best",
        "defined",
        "way",
        "almost",
        "identical",
        "omnitheism",
        "thus",
        "may",
        "stipulated",
        "like",
        "omnitheism",
        "aesthetic",
        "deism",
        "implies",
        "eternal",
        "nonphysical",
        "omnipotent",
        "omniscient",
        "created",
        "physical",
        "world",
        "difference",
        "god",
        "omnitheism",
        "deity",
        "aesthetic",
        "deism",
        "motivates",
        "omnitheistic",
        "god",
        "would",
        "morally",
        "perfect",
        "strongly",
        "motivated",
        "consideration",
        "wellbeing",
        "sentient",
        "creature",
        "aesthetic",
        "deistic",
        "god",
        "hand",
        "would",
        "prioritize",
        "aesthetic",
        "good",
        "moral",
        "one",
        "would",
        "want",
        "beautiful",
        "universe",
        "perhaps",
        "best",
        "metaphor",
        "cosmic",
        "artist",
        "instead",
        "cosmic",
        "playwright",
        "author",
        "nature",
        "want",
        "write",
        "interesting",
        "story",
        "everyone",
        "know",
        "good",
        "story",
        "never",
        "begin",
        "line",
        "lived",
        "happily",
        "ever",
        "line",
        "last",
        "line",
        "story",
        "contains",
        "containing",
        "line",
        "hardly",
        "necessary",
        "story",
        "good",
        "aesthetic",
        "deism",
        "true",
        "may",
        "well",
        "true",
        "world",
        "stage",
        "men",
        "woman",
        "merely",
        "player",
        "emphasis",
        "added",
        "case",
        "hypothesis",
        "aesthetic",
        "deism",
        "make",
        "prediction",
        "condition",
        "sentient",
        "being",
        "world",
        "different",
        "one",
        "hypothesis",
        "omnitheism",
        "make",
        "make",
        "good",
        "story",
        "good",
        "often",
        "intense",
        "struggle",
        "good",
        "evil",
        "good",
        "story",
        "contain",
        "mixture",
        "benefit",
        "harm",
        "suggests",
        "observed",
        "mixture",
        "good",
        "evil",
        "world",
        "decisively",
        "favor",
        "aesthetic",
        "deism",
        "omnitheism",
        "right",
        "aesthetic",
        "deism",
        "pull",
        "far",
        "ahead",
        "omnitheism",
        "race",
        "probability",
        "thereby",
        "proving",
        "omnitheism",
        "improbable",
        "one",
        "possible",
        "formulation",
        "argument",
        "aesthetic",
        "deism",
        "least",
        "probable",
        "intrinsically",
        "omnitheism",
        "total",
        "evidence",
        "excluding",
        "data",
        "good",
        "evil",
        "favor",
        "omnitheism",
        "aesthetic",
        "deism",
        "given",
        "total",
        "evidence",
        "excluding",
        "data",
        "good",
        "evil",
        "data",
        "good",
        "evil",
        "strongly",
        "favor",
        "aesthetic",
        "deism",
        "omnitheism",
        "follows",
        "aesthetic",
        "deism",
        "many",
        "time",
        "probable",
        "omnitheism",
        "follows",
        "omnitheism",
        "probably",
        "false",
        "follows",
        "atheism",
        "understood",
        "denial",
        "omnitheism",
        "probably",
        "true",
        "step",
        "argument",
        "step",
        "low",
        "prior",
        "argument",
        "except",
        "source",
        "physicalism",
        "step",
        "low",
        "prior",
        "argument",
        "replaced",
        "aesthetic",
        "deism",
        "step",
        "decisive",
        "evidence",
        "argument",
        "make",
        "difference",
        "far",
        "inference",
        "step",
        "step",
        "concerned",
        "inference",
        "like",
        "inference",
        "step",
        "step",
        "step",
        "step",
        "clearly",
        "correct",
        "key",
        "question",
        "whether",
        "premise",
        "true",
        "spite",
        "nearly",
        "complete",
        "overlap",
        "omnitheism",
        "aesthetic",
        "deism",
        "richard",
        "swinburne",
        "would",
        "challenge",
        "premise",
        "ground",
        "aesthetic",
        "deism",
        "unlike",
        "omnitheism",
        "must",
        "posit",
        "bad",
        "desire",
        "account",
        "deity",
        "morally",
        "best",
        "omnitheism",
        "need",
        "according",
        "swinburne",
        "morally",
        "best",
        "overall",
        "best",
        "thus",
        "omniscient",
        "necessity",
        "morally",
        "best",
        "long",
        "desire",
        "desire",
        "simply",
        "virtue",
        "knowing",
        "best",
        "thing",
        "given",
        "situation",
        "challenge",
        "depends",
        "however",
        "highly",
        "questionable",
        "motivational",
        "intellectualism",
        "succeeds",
        "merely",
        "believing",
        "action",
        "good",
        "entail",
        "desire",
        "theory",
        "motivation",
        "logical",
        "gap",
        "intellect",
        "desire",
        "gap",
        "exists",
        "would",
        "seem",
        "omnitheism",
        "probable",
        "intrinsically",
        "aesthetic",
        "deism",
        "hard",
        "think",
        "plausible",
        "challenge",
        "premise",
        "least",
        "come",
        "usual",
        "evidence",
        "taken",
        "favor",
        "theism",
        "competing",
        "hypothesis",
        "like",
        "naturalism",
        "aesthetic",
        "deism",
        "account",
        "evidence",
        "least",
        "well",
        "omnitheism",
        "example",
        "deity",
        "interested",
        "good",
        "narrative",
        "would",
        "want",
        "world",
        "complex",
        "yet",
        "ordered",
        "contains",
        "beauty",
        "consciousness",
        "intelligence",
        "moral",
        "agency",
        "perhaps",
        "reason",
        "expect",
        "existence",
        "libertarian",
        "free",
        "omnitheism",
        "aesthetic",
        "deism",
        "unless",
        "one",
        "start",
        "truth",
        "omnitheism",
        "seems",
        "little",
        "reason",
        "believe",
        "freedom",
        "even",
        "one",
        "take",
        "seriously",
        "introspective",
        "nontheological",
        "evidence",
        "libertarian",
        "free",
        "difficult",
        "construct",
        "deodicy",
        "good",
        "explanation",
        "term",
        "aesthetic",
        "deism",
        "either",
        "existence",
        "libertarian",
        "free",
        "apparently",
        "strong",
        "ultimately",
        "misleading",
        "evidence",
        "existence",
        "example",
        "open",
        "theist",
        "right",
        "even",
        "omniscient",
        "know",
        "certainty",
        "libertarian",
        "free",
        "choice",
        "made",
        "future",
        "aesthetic",
        "deism",
        "could",
        "account",
        "libertarian",
        "free",
        "sort",
        "indeterminacy",
        "claiming",
        "story",
        "genuine",
        "surprise",
        "better",
        "one",
        "completely",
        "predictable",
        "alternatively",
        "might",
        "important",
        "story",
        "character",
        "think",
        "free",
        "really",
        "finally",
        "premise",
        "asserts",
        "data",
        "good",
        "evil",
        "decisively",
        "favor",
        "aesthetic",
        "deism",
        "theism",
        "context",
        "data",
        "good",
        "evil",
        "include",
        "everything",
        "know",
        "sentient",
        "being",
        "including",
        "human",
        "benefitted",
        "harmed",
        "full",
        "discussion",
        "premise",
        "possible",
        "recognition",
        "plausibility",
        "appears",
        "old",
        "problem",
        "evil",
        "consider",
        "example",
        "book",
        "job",
        "whose",
        "protagonist",
        "righteous",
        "man",
        "suffers",
        "horrifically",
        "accuses",
        "god",
        "lacking",
        "sufficient",
        "commitment",
        "moral",
        "value",
        "justice",
        "vast",
        "majority",
        "commentator",
        "agree",
        "god",
        "directly",
        "respond",
        "job",
        "charge",
        "instead",
        "speaking",
        "whirlwind",
        "describes",
        "design",
        "cosmos",
        "animal",
        "kingdom",
        "way",
        "clearly",
        "intended",
        "emphasize",
        "power",
        "grandeur",
        "creation",
        "theological",
        "worry",
        "god",
        "moral",
        "perfection",
        "natural",
        "interpretation",
        "part",
        "story",
        "would",
        "either",
        "god",
        "agrees",
        "job",
        "charge",
        "unjust",
        "god",
        "denies",
        "job",
        "sensibly",
        "apply",
        "term",
        "like",
        "unjust",
        "job",
        "member",
        "shared",
        "moral",
        "community",
        "morriston",
        "forthcoming",
        "opposing",
        "view",
        "see",
        "stump",
        "chapter",
        "job",
        "first",
        "response",
        "god",
        "speech",
        "capitulating",
        "second",
        "response",
        "refuse",
        "repeat",
        "unanswered",
        "accusation",
        "interpretation",
        "creator",
        "confronts",
        "job",
        "god",
        "expected",
        "definitely",
        "god",
        "omnitheism",
        "rather",
        "much",
        "like",
        "deity",
        "aesthetic",
        "deism",
        "claim",
        "god",
        "might",
        "allow",
        "evil",
        "inevitable",
        "result",
        "universe",
        "governed",
        "law",
        "nature",
        "also",
        "lend",
        "support",
        "though",
        "unintentionally",
        "idea",
        "author",
        "nature",
        "likely",
        "motivated",
        "aesthetic",
        "concern",
        "moral",
        "one",
        "example",
        "may",
        "producing",
        "universe",
        "governed",
        "law",
        "expressible",
        "elegant",
        "mathematical",
        "equation",
        "impressive",
        "accomplishment",
        "wisdom",
        "power",
        "required",
        "task",
        "also",
        "aesthetic",
        "value",
        "universe",
        "value",
        "may",
        "well",
        "depend",
        "however",
        "creator",
        "choosing",
        "intervene",
        "regularly",
        "nature",
        "protect",
        "creature",
        "harm",
        "much",
        "aesthetic",
        "value",
        "animal",
        "kingdom",
        "may",
        "also",
        "depend",
        "result",
        "long",
        "evolutionary",
        "process",
        "driven",
        "mechanism",
        "like",
        "natural",
        "selection",
        "darwin",
        "famously",
        "said",
        "last",
        "line",
        "origin",
        "specie",
        "mean",
        "natural",
        "selection",
        "grandeur",
        "view",
        "life",
        "several",
        "power",
        "originally",
        "breathed",
        "form",
        "one",
        "whilst",
        "planet",
        "gone",
        "cycling",
        "according",
        "fixed",
        "law",
        "gravity",
        "simple",
        "beginning",
        "endless",
        "form",
        "beautiful",
        "wonderful",
        "evolved",
        "unfortunately",
        "process",
        "produce",
        "sentient",
        "life",
        "may",
        "also",
        "entail",
        "much",
        "suffering",
        "countless",
        "early",
        "death",
        "one",
        "questionable",
        "assumption",
        "natural",
        "order",
        "theodicists",
        "think",
        "connection",
        "aesthetic",
        "good",
        "suffering",
        "provide",
        "moral",
        "justification",
        "god",
        "allowing",
        "horrific",
        "suffering",
        "arguably",
        "far",
        "plausible",
        "scenario",
        "value",
        "preventing",
        "horrendous",
        "suffering",
        "would",
        "moral",
        "point",
        "view",
        "far",
        "outweigh",
        "value",
        "regularity",
        "sublimity",
        "narrative",
        "morally",
        "perfect",
        "god",
        "would",
        "trade",
        "former",
        "latter",
        "though",
        "deity",
        "motivated",
        "primarily",
        "aesthetic",
        "reason",
        "doubt",
        "would",
        "summarize",
        "nearly",
        "everyone",
        "agrees",
        "world",
        "contains",
        "good",
        "evil",
        "pleasure",
        "pain",
        "love",
        "hate",
        "achievement",
        "failure",
        "flourishing",
        "languishing",
        "virtue",
        "vice",
        "exist",
        "great",
        "abundance",
        "spite",
        "see",
        "sign",
        "cosmic",
        "teleology",
        "defend",
        "version",
        "decisive",
        "evidence",
        "argument",
        "stated",
        "need",
        "deny",
        "teleology",
        "need",
        "show",
        "far",
        "easier",
        "make",
        "sense",
        "strange",
        "mixture",
        "good",
        "ill",
        "appears",
        "life",
        "hume",
        "dialogue",
        "xi",
        "teleology",
        "interpreted",
        "amoral",
        "instead",
        "moral",
        "cf",
        "mulgan",
        "murphy",
        "particular",
        "interpreted",
        "directed",
        "towards",
        "aesthetic",
        "end",
        "instead",
        "towards",
        "moral",
        "end"
    ]
}