{
    "main_text": "Two Arguments for Local Atheism || The Low Priors Argument\n6.2 The Low Priors Argument\n\nThe basic idea behind the low priors argument is that, even if the\nagnostic is right that, when it comes to God’s existence, the\nevidence is ambiguous or absent altogether, what follows is not that\ntheism has a middling probability all things considered, but instead\nthat theism is very probably false. This is said to follow because\ntheism starts out with a very low probability before taking into\naccount any evidence. (“Evidence” in this context refers\nto factors extrinsic to a hypothesis that raise or lower its\nprobability.) Since ambiguous or absent evidence has no effect on that\nprior or intrinsic probability, the posterior or all-things-considered\nprobability of theism is also very low. If, however, theism is very\nprobably false, then atheism must be very probably true and this\nimplies (according to the defender of the argument) that atheistic\nbelief is justified. (This last alleged implication is examined in\nsection 7.)\n\nThis sort of argument is very relevant to the issue of which of\natheism and theism is the appropriate “default” position.\nIf theism has a sufficiently low intrinsic probability, then atheism\nis arguably the correct default position in the sense that ambiguous\nor absent evidence will justify, not suspending judgment on the issue\nof God’s existence, but instead believing that God does not\nexist. This is why Le Poidevin’s argument for agnosticism\nincludes, not just a premise asserting that the relevant evidence is\nambiguous, but also one asserting that, at least in the case of\nversatile theism, we are in the dark when it comes to the issue of\nwhich of theism and atheism has a higher intrinsic probability.\nUnfortunately, much discussion of the issue of which position is the\ncorrect “default position” or of who has the “burden\nof proof” gets sidetracked by bad analogies to Santa Claus,\nflying spaghetti monsters, and Bertrand Russell’s ([1952] 1997)\nfamous china teapot in elliptical orbit around the sun (see Garvey\n2010 and van Inwagen 2012 for criticism of some of these analogies).\nThe low priors argument implicitly addresses this important issue in a\nmuch more sophisticated and promising way.\n\nIn the version of the low priors argument formulated below, the basic\napproach described above is improved by comparing omni-theism, not\nsimply to its denial, but instead to a more specific atheistic\nhypothesis called “source physicalism”. Unlike ontological\nphysicalism, source physicalism is a claim about the source of mental\nentities, not about their nature. Source physicalists, whether they\nare ontological physicalists or ontological dualists, believe that the\nphysical world existed before the mental world and caused the mental\nworld to come into existence, which implies that all mental entities\nare causally dependent on physical entities. Further, even if they are\nontological dualists, source physicalists need not claim that mental\nentities never cause physical entities or other mental entities, but\nthey must claim that there would be no mental entities were it not for\nthe prior existence (and causal powers) of one or more physical\nentities. The argument proceeds as follows:\n\n\n(1)The\ntotal evidence does not favor omni-theism over source\nphysicalism.\n\n\n(2)Source\nphysicalism is many times more probable intrinsically than\nomni-theism.\n It follows from (1) and (2) that\n\n\n(3)Source\nphysicalism is many times more probable than omni-theism.\n It follows from (3) that\n\n\n(4)Omni-theism\nis very probably false.\n It follows from (4) that\n\n\n(5)Atheism\n(understood here as the denial of omni-theism) is very probably\ntrue.\n\n\n\nOnly the argument’s two premises—steps (1) and\n(2)—are controversial. The other steps in the argument all\nclearly follow from previous steps.\n\nA thorough examination of the arguments for and against premise (1) is\nobviously impossible here, but it is worth mentioning that a defense\nof this premise need not claim that the known facts typically thought\nby natural theologians to favor omni-theism over competing hypotheses\nlike source physicalism have no force. Instead, it could be claimed\nthat whatever force they have is offset at least to some significant\ndegree by more specific facts favoring source physicalism over\nomni-theism. Natural theologians routinely ignore these more specific\nfacts and thus appear to commit what might be called “the\nfallacy of understated evidence”. More precisely, the point is\nthis. Even when natural theologians successfully identify some general\nfact about a topic that is more probable given omni-theism than given\nsource physicalism, they ignore other more specific facts about that\nsame topic, facts that, given the general fact, appear to be\nsignificantly more probable given source physicalism than given\nomni-theism.\n\nFor example, even if omni-theism is supported by the general fact that\nthe universe is complex, one should not ignore the more specific fact,\ndiscovered by scientists, that underlying this complexity at the level\nat which we experience the universe, is a much simpler early universe\nfrom which this complexity arose, and also a much simpler contemporary\nuniverse at the micro-level, one consisting of a relatively small\nnumber of different kinds of particles all of which exist in one of a\nrelatively small number of different states. In short, it is important\nto take into account, not just the general fact that the universe that\nwe directly experience with our senses is extremely complex, but also\nthe more specific fact that two sorts of hidden simplicity within the\nuniverse can explain that complexity. Given that a complex universe\nexists, this more specific fact is exactly what one would expect on\nsource physicalism, because, as the best natural theologians (e.g.,\nSwinburne 2004) say, the complexity of the universe cries out for\nexplanation in terms of something simpler. There is, however, no\nreason at all to expect this more specific fact on omni-theism since,\nif those same natural theologians are correct, then a simple God\nprovides a simple explanation for the observed complexity of the\nuniverse whether or not that complexity is also explained by any\nsimpler mediate physical causes.\n\nAnother example concerns consciousness. Its existence really does seem\nto be more likely given omni-theism than given source physicalism (and\nthus to raise the ratio of the probability of omni-theism to the\nprobability of source physicalism). But we know a lot more about\nconsciousness than just that it exists. We also know, thanks in part\nto the relatively new discipline of neuroscience, that conscious\nstates in general and even the very integrity of our personalities,\nnot to mention the apparent unity of the self, are dependent to a very\nhigh degree on physical events occurring in the brain. Given the\ngeneral fact that consciousness exists, we have reason on source\nphysicalism that we do not have on theism to expect these more\nspecific facts. Given theism, it would not be surprising at all if our\nminds were more independent of the brain than they in fact are. After\nall, if omni-theism is true, then at least one mind, God’s, does\nnot depend at all on anything physical. Thus, when the available\nevidence about consciousness is fully stated, it is far from clear\nthat it significantly favors omni-theism.\n\nSimilar problems threaten to undermine appeals to\nfine-tuning—that is, appeals to the fact that a number of\napparently independent physical parameters have values that, while not\nfixed by current physical theory, nevertheless happen to fall within a\nrelatively narrow “life-permitting” range assuming no\nchanges to other parameters. Arguably, given that fine-tuning is\nrequired for intelligent life and that an omni-God has reason to\ncreate intelligent life, we have more reason to expect fine-tuning on\nomni-theism than on source physicalism. Given such fine-tuning,\nhowever, it is far more surprising on omni-theism than on source\nphysicalism that our universe is not teeming with intelligent life and\nthat the most impressive intelligent organisms we know to exist are\nmerely human: self-centered and aggressive primates who far too often\nkill, rape, and torture each other.\n\nIn fairness to omni-theism, however, most of those humans are moral\nagents and many have religious experiences apparently of God. The\nproblem is that, while the existence of moral agents is\n“predicted” by omni-theism better than by source\nphysicalism, it is also true that, given their existence, the variety\nand frequency of easily avoidable conditions that promote morally bad\nbehavior and that severely limit the freedom, agency, and autonomy of\ncountless human beings are much more likely on source physicalism. And\nwhile religious experiences apparently of God are no doubt more to be\nexpected if an omni-God exists than if human beings are the product of\nblind physical forces, it is also true that, given that such\nexperiences do occur, various facts about their distribution that\nshould be surprising to theists are exactly what one would expect on\nsource physicalism, such as the fact that many people never have them\nand the fact that those who do have them almost always have either a\nprior belief in God or extensive exposure to a theistic religion.\n\nIt seems, then, that when it comes to evidence favoring omni-theism\nover source physicalism, the Lord giveth and the Lord taketh away.\nFurther, when combined with the fact that what we know about the level\nof well-being of sentient beings and the extent of their suffering is\narguably vastly more probable on source physicalism than on theism, a\nvery strong though admittedly controversial case for premise\n (1)\n can be made.\n\nWhat about premise\n (2)?\n Again, a serious case can be made for its truth. Such a case first\ncompares source physicalism, not to omni-theism, but to its opposite,\nsource idealism. Source idealists believe that the mental world\nexisted before the physical world and caused the physical world to\ncome into existence. This view is consistent with both ontological\nidealism and ontological dualism, and also with physical entities\nhaving both physical and mental effects. It entails, however, that all\nphysical entities are, ultimately, causally dependent on one or more\nmental entities, and so is not consistent with ontological\nphysicalism. The symmetry of source physicalism and source idealism is\na good pro tanto reason to believe they are equally probable\nintrinsically. They are equally specific, they have the same\nontological commitments, neither can be formulated more elegantly than\nthe other, and each appears to be equally coherent and equally\nintelligible. They differ on the issue of what is causally dependent\non what, but if Hume is right and causal dependence relations can only\nbe discovered by observation and not a priori, then that\nwon’t affect the intrinsic probabilities of the two\nhypotheses.\n\nOmni-theism, however, is a very specific version of source idealism;\nit entails that source idealism is true but goes far beyond source\nidealism by making a number of very specific claims about the sort of\n“mental world” that produced the physical world. For\nexample, it adds the claim that a single mind created the physical\nuniverse and that this mind is not just powerful but specifically\nomnipotent and not just knowledgeable but specifically omniscient. In\naddition, it presupposes a number of controversial metaphysical and\nmeta-ethical claims by asserting in addition that this being is both\neternal and objectively morally perfect. If any of these specific\nclaims and presuppositions is false, then omni-theism is false. Thus,\nomni-theism is a very specific and thus intrinsically very risky form\nof source idealism, and thus is many times less probable intrinsically\nthan source idealism. Therefore, if, as argued above, source\nphysicalism and source idealism are equally probable intrinsically,\nthen it follows that premise\n (2)\n is true: source physicalism is many times more probable intrinsically\nthan omni-theism.\n",
    "section_title": "6.2 The Low Priors Argument",
    "entry_title": "Atheism and Agnosticism",
    "hierarchy_title": "Atheism and Agnosticism || Two Arguments for Local Atheism || The Low Priors Argument",
    "tokenized_text": [
        "two",
        "argument",
        "local",
        "atheism",
        "low",
        "prior",
        "argument",
        "low",
        "prior",
        "argument",
        "basic",
        "idea",
        "behind",
        "low",
        "prior",
        "argument",
        "even",
        "agnostic",
        "right",
        "come",
        "god",
        "existence",
        "evidence",
        "ambiguous",
        "absent",
        "altogether",
        "follows",
        "theism",
        "middling",
        "probability",
        "thing",
        "considered",
        "instead",
        "theism",
        "probably",
        "false",
        "said",
        "follow",
        "theism",
        "start",
        "low",
        "probability",
        "taking",
        "account",
        "evidence",
        "evidence",
        "context",
        "refers",
        "factor",
        "extrinsic",
        "hypothesis",
        "raise",
        "lower",
        "probability",
        "since",
        "ambiguous",
        "absent",
        "evidence",
        "effect",
        "prior",
        "intrinsic",
        "probability",
        "posterior",
        "allthingsconsidered",
        "probability",
        "theism",
        "also",
        "low",
        "however",
        "theism",
        "probably",
        "false",
        "atheism",
        "must",
        "probably",
        "true",
        "implies",
        "according",
        "defender",
        "argument",
        "atheistic",
        "belief",
        "justified",
        "last",
        "alleged",
        "implication",
        "examined",
        "section",
        "sort",
        "argument",
        "relevant",
        "issue",
        "atheism",
        "theism",
        "appropriate",
        "default",
        "position",
        "theism",
        "sufficiently",
        "low",
        "intrinsic",
        "probability",
        "atheism",
        "arguably",
        "correct",
        "default",
        "position",
        "sense",
        "ambiguous",
        "absent",
        "evidence",
        "justify",
        "suspending",
        "judgment",
        "issue",
        "god",
        "existence",
        "instead",
        "believing",
        "god",
        "exist",
        "le",
        "poidevin",
        "argument",
        "agnosticism",
        "includes",
        "premise",
        "asserting",
        "relevant",
        "evidence",
        "ambiguous",
        "also",
        "one",
        "asserting",
        "least",
        "case",
        "versatile",
        "theism",
        "dark",
        "come",
        "issue",
        "theism",
        "atheism",
        "higher",
        "intrinsic",
        "probability",
        "unfortunately",
        "much",
        "discussion",
        "issue",
        "position",
        "correct",
        "default",
        "position",
        "burden",
        "proof",
        "get",
        "sidetracked",
        "bad",
        "analogy",
        "santa",
        "claus",
        "flying",
        "spaghetti",
        "monster",
        "bertrand",
        "russell",
        "famous",
        "china",
        "teapot",
        "elliptical",
        "orbit",
        "around",
        "sun",
        "see",
        "garvey",
        "van",
        "inwagen",
        "criticism",
        "analogy",
        "low",
        "prior",
        "argument",
        "implicitly",
        "address",
        "important",
        "issue",
        "much",
        "sophisticated",
        "promising",
        "way",
        "version",
        "low",
        "prior",
        "argument",
        "formulated",
        "basic",
        "approach",
        "described",
        "improved",
        "comparing",
        "omnitheism",
        "simply",
        "denial",
        "instead",
        "specific",
        "atheistic",
        "hypothesis",
        "called",
        "source",
        "physicalism",
        "unlike",
        "ontological",
        "physicalism",
        "source",
        "physicalism",
        "claim",
        "source",
        "mental",
        "entity",
        "nature",
        "source",
        "physicalists",
        "whether",
        "ontological",
        "physicalists",
        "ontological",
        "dualist",
        "believe",
        "physical",
        "world",
        "existed",
        "mental",
        "world",
        "caused",
        "mental",
        "world",
        "come",
        "existence",
        "implies",
        "mental",
        "entity",
        "causally",
        "dependent",
        "physical",
        "entity",
        "even",
        "ontological",
        "dualist",
        "source",
        "physicalists",
        "need",
        "claim",
        "mental",
        "entity",
        "never",
        "cause",
        "physical",
        "entity",
        "mental",
        "entity",
        "must",
        "claim",
        "would",
        "mental",
        "entity",
        "prior",
        "existence",
        "causal",
        "power",
        "one",
        "physical",
        "entity",
        "argument",
        "proceeds",
        "follows",
        "total",
        "evidence",
        "favor",
        "omnitheism",
        "source",
        "physicalism",
        "source",
        "physicalism",
        "many",
        "time",
        "probable",
        "intrinsically",
        "omnitheism",
        "follows",
        "source",
        "physicalism",
        "many",
        "time",
        "probable",
        "omnitheism",
        "follows",
        "omnitheism",
        "probably",
        "false",
        "follows",
        "atheism",
        "understood",
        "denial",
        "omnitheism",
        "probably",
        "true",
        "argument",
        "two",
        "premisessteps",
        "are",
        "controversial",
        "step",
        "argument",
        "clearly",
        "follow",
        "previous",
        "step",
        "thorough",
        "examination",
        "argument",
        "premise",
        "obviously",
        "impossible",
        "worth",
        "mentioning",
        "defense",
        "premise",
        "need",
        "claim",
        "known",
        "fact",
        "typically",
        "thought",
        "natural",
        "theologian",
        "favor",
        "omnitheism",
        "competing",
        "hypothesis",
        "like",
        "source",
        "physicalism",
        "force",
        "instead",
        "could",
        "claimed",
        "whatever",
        "force",
        "offset",
        "least",
        "significant",
        "degree",
        "specific",
        "fact",
        "favoring",
        "source",
        "physicalism",
        "omnitheism",
        "natural",
        "theologian",
        "routinely",
        "ignore",
        "specific",
        "fact",
        "thus",
        "appear",
        "commit",
        "might",
        "called",
        "fallacy",
        "understated",
        "evidence",
        "precisely",
        "point",
        "even",
        "natural",
        "theologian",
        "successfully",
        "identify",
        "general",
        "fact",
        "topic",
        "probable",
        "given",
        "omnitheism",
        "given",
        "source",
        "physicalism",
        "ignore",
        "specific",
        "fact",
        "topic",
        "fact",
        "given",
        "general",
        "fact",
        "appear",
        "significantly",
        "probable",
        "given",
        "source",
        "physicalism",
        "given",
        "omnitheism",
        "example",
        "even",
        "omnitheism",
        "supported",
        "general",
        "fact",
        "universe",
        "complex",
        "one",
        "ignore",
        "specific",
        "fact",
        "discovered",
        "scientist",
        "underlying",
        "complexity",
        "level",
        "experience",
        "universe",
        "much",
        "simpler",
        "early",
        "universe",
        "complexity",
        "arose",
        "also",
        "much",
        "simpler",
        "contemporary",
        "universe",
        "microlevel",
        "one",
        "consisting",
        "relatively",
        "small",
        "number",
        "different",
        "kind",
        "particle",
        "exist",
        "one",
        "relatively",
        "small",
        "number",
        "different",
        "state",
        "short",
        "important",
        "take",
        "account",
        "general",
        "fact",
        "universe",
        "directly",
        "experience",
        "sens",
        "extremely",
        "complex",
        "also",
        "specific",
        "fact",
        "two",
        "sort",
        "hidden",
        "simplicity",
        "within",
        "universe",
        "explain",
        "complexity",
        "given",
        "complex",
        "universe",
        "exists",
        "specific",
        "fact",
        "exactly",
        "one",
        "would",
        "expect",
        "source",
        "physicalism",
        "best",
        "natural",
        "theologian",
        "eg",
        "swinburne",
        "say",
        "complexity",
        "universe",
        "cry",
        "explanation",
        "term",
        "something",
        "simpler",
        "however",
        "reason",
        "expect",
        "specific",
        "fact",
        "omnitheism",
        "since",
        "natural",
        "theologian",
        "correct",
        "simple",
        "god",
        "provides",
        "simple",
        "explanation",
        "observed",
        "complexity",
        "universe",
        "whether",
        "complexity",
        "also",
        "explained",
        "simpler",
        "mediate",
        "physical",
        "cause",
        "another",
        "example",
        "concern",
        "consciousness",
        "existence",
        "really",
        "seem",
        "likely",
        "given",
        "omnitheism",
        "given",
        "source",
        "physicalism",
        "thus",
        "raise",
        "ratio",
        "probability",
        "omnitheism",
        "probability",
        "source",
        "physicalism",
        "know",
        "lot",
        "consciousness",
        "exists",
        "also",
        "know",
        "thanks",
        "part",
        "relatively",
        "new",
        "discipline",
        "neuroscience",
        "conscious",
        "state",
        "general",
        "even",
        "integrity",
        "personality",
        "mention",
        "apparent",
        "unity",
        "self",
        "dependent",
        "high",
        "degree",
        "physical",
        "event",
        "occurring",
        "brain",
        "given",
        "general",
        "fact",
        "consciousness",
        "exists",
        "reason",
        "source",
        "physicalism",
        "theism",
        "expect",
        "specific",
        "fact",
        "given",
        "theism",
        "would",
        "surprising",
        "mind",
        "independent",
        "brain",
        "fact",
        "omnitheism",
        "true",
        "least",
        "one",
        "mind",
        "god",
        "depend",
        "anything",
        "physical",
        "thus",
        "available",
        "evidence",
        "consciousness",
        "fully",
        "stated",
        "far",
        "clear",
        "significantly",
        "favor",
        "omnitheism",
        "similar",
        "problem",
        "threaten",
        "undermine",
        "appeal",
        "finetuningthat",
        "appeal",
        "fact",
        "number",
        "apparently",
        "independent",
        "physical",
        "parameter",
        "value",
        "fixed",
        "current",
        "physical",
        "theory",
        "nevertheless",
        "happen",
        "fall",
        "within",
        "relatively",
        "narrow",
        "lifepermitting",
        "range",
        "assuming",
        "change",
        "parameter",
        "arguably",
        "given",
        "finetuning",
        "required",
        "intelligent",
        "life",
        "omnigod",
        "reason",
        "create",
        "intelligent",
        "life",
        "reason",
        "expect",
        "finetuning",
        "omnitheism",
        "source",
        "physicalism",
        "given",
        "finetuning",
        "however",
        "far",
        "surprising",
        "omnitheism",
        "source",
        "physicalism",
        "universe",
        "teeming",
        "intelligent",
        "life",
        "impressive",
        "intelligent",
        "organism",
        "know",
        "exist",
        "merely",
        "human",
        "selfcentered",
        "aggressive",
        "primate",
        "far",
        "often",
        "kill",
        "rape",
        "torture",
        "fairness",
        "omnitheism",
        "however",
        "human",
        "moral",
        "agent",
        "many",
        "religious",
        "experience",
        "apparently",
        "god",
        "problem",
        "existence",
        "moral",
        "agent",
        "predicted",
        "omnitheism",
        "better",
        "source",
        "physicalism",
        "also",
        "true",
        "given",
        "existence",
        "variety",
        "frequency",
        "easily",
        "avoidable",
        "condition",
        "promote",
        "morally",
        "bad",
        "behavior",
        "severely",
        "limit",
        "freedom",
        "agency",
        "autonomy",
        "countless",
        "human",
        "being",
        "much",
        "likely",
        "source",
        "physicalism",
        "religious",
        "experience",
        "apparently",
        "god",
        "doubt",
        "expected",
        "omnigod",
        "exists",
        "human",
        "being",
        "product",
        "blind",
        "physical",
        "force",
        "also",
        "true",
        "given",
        "experience",
        "occur",
        "various",
        "fact",
        "distribution",
        "surprising",
        "theist",
        "exactly",
        "one",
        "would",
        "expect",
        "source",
        "physicalism",
        "fact",
        "many",
        "people",
        "never",
        "fact",
        "almost",
        "always",
        "either",
        "prior",
        "belief",
        "god",
        "extensive",
        "exposure",
        "theistic",
        "religion",
        "seems",
        "come",
        "evidence",
        "favoring",
        "omnitheism",
        "source",
        "physicalism",
        "lord",
        "giveth",
        "lord",
        "taketh",
        "away",
        "combined",
        "fact",
        "know",
        "level",
        "wellbeing",
        "sentient",
        "being",
        "extent",
        "suffering",
        "arguably",
        "vastly",
        "probable",
        "source",
        "physicalism",
        "theism",
        "strong",
        "though",
        "admittedly",
        "controversial",
        "case",
        "premise",
        "made",
        "premise",
        "serious",
        "case",
        "made",
        "truth",
        "case",
        "first",
        "compare",
        "source",
        "physicalism",
        "omnitheism",
        "opposite",
        "source",
        "idealism",
        "source",
        "idealist",
        "believe",
        "mental",
        "world",
        "existed",
        "physical",
        "world",
        "caused",
        "physical",
        "world",
        "come",
        "existence",
        "view",
        "consistent",
        "ontological",
        "idealism",
        "ontological",
        "dualism",
        "also",
        "physical",
        "entity",
        "physical",
        "mental",
        "effect",
        "entail",
        "however",
        "physical",
        "entity",
        "ultimately",
        "causally",
        "dependent",
        "one",
        "mental",
        "entity",
        "consistent",
        "ontological",
        "physicalism",
        "symmetry",
        "source",
        "physicalism",
        "source",
        "idealism",
        "good",
        "pro",
        "tanto",
        "reason",
        "believe",
        "equally",
        "probable",
        "intrinsically",
        "equally",
        "specific",
        "ontological",
        "commitment",
        "neither",
        "formulated",
        "elegantly",
        "appears",
        "equally",
        "coherent",
        "equally",
        "intelligible",
        "differ",
        "issue",
        "causally",
        "dependent",
        "hume",
        "right",
        "causal",
        "dependence",
        "relation",
        "discovered",
        "observation",
        "priori",
        "affect",
        "intrinsic",
        "probability",
        "two",
        "hypothesis",
        "omnitheism",
        "however",
        "specific",
        "version",
        "source",
        "idealism",
        "entail",
        "source",
        "idealism",
        "true",
        "go",
        "far",
        "beyond",
        "source",
        "idealism",
        "making",
        "number",
        "specific",
        "claim",
        "sort",
        "mental",
        "world",
        "produced",
        "physical",
        "world",
        "example",
        "add",
        "claim",
        "single",
        "mind",
        "created",
        "physical",
        "universe",
        "mind",
        "powerful",
        "specifically",
        "omnipotent",
        "knowledgeable",
        "specifically",
        "omniscient",
        "addition",
        "presupposes",
        "number",
        "controversial",
        "metaphysical",
        "metaethical",
        "claim",
        "asserting",
        "addition",
        "eternal",
        "objectively",
        "morally",
        "perfect",
        "specific",
        "claim",
        "presupposition",
        "false",
        "omnitheism",
        "false",
        "thus",
        "omnitheism",
        "specific",
        "thus",
        "intrinsically",
        "risky",
        "form",
        "source",
        "idealism",
        "thus",
        "many",
        "time",
        "le",
        "probable",
        "intrinsically",
        "source",
        "idealism",
        "therefore",
        "argued",
        "source",
        "physicalism",
        "source",
        "idealism",
        "equally",
        "probable",
        "intrinsically",
        "follows",
        "premise",
        "true",
        "source",
        "physicalism",
        "many",
        "time",
        "probable",
        "intrinsically",
        "omnitheism"
    ]
}