{
    "main_text": "Ancient Greek Atomism || Leucippus and Democritus\n2.1 Leucippus and Democritus\n\nLeucippus (5th c. BCE) is usually credited with inventing atomism in\nthe Greek tradition. According to a passing remark by the geographer\nStrabo, Posidonius (1st c. BCE Stoic philosopher) reported\nthat ancient Greek atomism can be traced back to a figure known as\nMoschus or Mochus of Sidon, who lived at the time of the Trojan wars.\nThis report was given credence in the seventeenth century: the\nCambridge Platonist Henry More traced the origins of ancient atomism\nback, via Pythagoras and Moschus, to Moses. This theologically\nmotivated view appealed to those who saw revelation as the source of\nall truth and wanted to trace ancient Greek ideas to Biblical sources.\nAn ancient Greek source commenting on the travels of Democritus\ncredits his mathematical interests to time spent among Egyptian\ngeometers and suggests that he may have learned from the philosophers\nof India.\n\nIn 1877, Tannéry argued that Zeno of Elea’s arguments\nabout divisibility would make most sense if formulated in response to\nan atomist theory supposedly held by some early Pythagoreans.\nTannéry’s thesis has been thoroughly challenged since\nthen: most scholars instead consider atomism to be one of a number of\npositions formulated in response to the arguments of Parmenides and\nZeno (first half of the fifth century).\n\nLittle is known about Leucippus, while the ideas of his student\nDemocritus—who is said to have taken over and systematized his\nteacher’s theory—are known from a large number of reports\nand fragments quoted by others. These early atomists theorized that\nthe two fundamental and oppositely characterized constituents of the\nnatural world are indivisible bodies—atoms—and void. The\nlatter is described simply as nothing, or as the negation of being.\nAtoms were said to be intrinsically unchangeable; they can move about\nin the void and combine into different clusters, which give rise to\nthe macroscopic bodies of the perceived world. Because all macroscopic\nobjects are in fact combinations of atoms, everything in the world of\nour experience is transitory and subject to dissolution while the\natoms themselves persist through all time.\n\nAccording to Aristotle’s presentation (On Generation and\nCorruption I 8), the motivation for the first postulation of\nindivisible bodies is to answer a metaphysical puzzle about the\npossibility of change and multiplicity. Parmenides had argued that any\ndifferentiation or change in Being implies that ‘what is\nnot’ either is or comes to be. Although there are problems in\ninterpreting Parmenides’ precise meaning, he was understood to\nhave raised a problem about how change can be possible without\nsomething coming from nothing. Several Presocratics formulated, in\nresponse, philosophical systems in which change is not considered to\nrequire something coming into being from complete nonexistence, but\nrather the arrangement of pre-existing elements into new combinations.\nThe atomists held that, the atoms are unchangeable and contain no\ninternal differentiation of a sort that would allow for division.\n\nBy positing indivisible bodies, the atomists were also thought to be\nanswering Zeno’s paradoxes about the impossibility of motion.\nZeno had argued that, if magnitudes can be divided to infinity, it\nwould be impossible for motion to occur. The problem seems to be that\na body moving would have to traverse an infinite number of spaces in a\nfinite time. By supposing that the atoms form the lowest limit to\ndivision, the atomists escape from this dilemma: a total space\ntraversed has only a finite number of parts. As it is unclear whether\nthe earliest atomists understood the atoms to be physically or\ntheoretically indivisible, they may not have made the distinction.\nMakin’s argument that atomic indivisibility is based on the\nhomogeneity of substance and not smallness explains why Democritus\nallowed for the possibility of even very large atoms (Makin 1993,\n55).\n\nAtoms can differ in size, shape, order and position; they move about\nin the void, and—depending on their shape—some can\ntemporarily bond with one another by means of tiny hooks and barbs on\ntheir surfaces. Thus the shape of individual atoms affects the\nmacroscopic texture of clusters of atoms, which may be fluid and\nyielding or firm and resistant, depending on the amount of void space\nbetween and the coalescence of the atomic shapes. The texture of\nsurfaces and the relative density and fragility of different materials\nare also accounted for by the same means. Atoms cannot fuse, but\nrather repel one another when they collide. Observations about the\ntendencies of bodies bumping one another were frequently exploited to\nexplain the apparently patterned motions of macroscopic bodies in the\nvisible world.\n\nThe atomists accounted for perception by means of films of atoms\nsloughed off from their surfaces by external objects, and entering and\nimpacting the sense organs. They tried to account for all sensible\neffects by means of contact, and regarded all sense perceptions as\ncaused by the properties of the atoms making up the films acting on\nthe atoms of animals’ sense organs. Perceptions of color are\ncaused by the ‘turning’ or position of the atoms; tastes\nare caused by the shape of the atoms contacting the tongue, e.g.,\nbitter tastes by the tearing caused by sharp atoms; feelings of heat\nare ascribed to friction. Heat itself is said to be caused by the\nadmixture of tiny fire atoms. Democritus considered thought to be a\nmaterial process involving the local rearrangement of bodies, just as\nmuch as is perception.\n\nA famous quotation from Democritus distinguishes between perceived\nproperties like colors and tastes, which exist only ‘by\nconvention,’ in contrast to the reality, which is atoms and\nvoid. However, he apparently recognized an epistemological problem for\nan empiricist philosophy that nonetheless regards the objects of sense\nas unreal. In another famous quotation, the senses accuse the mind of\noverthrowing them, although mind is dependent on the senses. The\naccusation is that, by developing an atomist theory that undermines\nthe basis for confidence in sense perception, thought has in effect\nundercut its own foundation on knowledge gained through the senses.\nDemocritus sometimes seems to doubt or deny the possibility of\nknowledge.\n\nThe early Greek atomists try to account for the formation of the\nnatural world by means of their simple ontology of atoms and void\nalone. Leucippus held that there are an infinite number of atoms\nmoving for all time in an infinite void, and that these can form into\ncosmic systems or kosmoi by means of a whirling motion which\nrandomly establishes itself in a large enough cluster of atoms. It is\ncontroversial whether atoms are thought to have weight as an intrinsic\nproperty, causing them all to fall in some given direction, or whether\nweight is simply a tendency for atoms (which otherwise move in any and\nevery direction, except when struck) to move towards the centre of a\nsystem, created by the whirling of the cosmic vortices. When a vortex\nis formed, it creates a membrane of atoms at its outer edge, and the\nouter band of atoms catches fire, forming a sun and stars. These\nkosmoi are impermanent, and are not accounted for by purpose\nor design. The earth is described as a flat cylindrical drum at the\ncenter of our cosmos.\n\nSpecies are not regarded as permanent abstract forms, but as chance\ncombinations of atoms. Living things are regarded as having a\npsychê or principle of life; this is identified with\nfiery atoms. Organisms are thought to reproduce by means of seed:\nDemocritus seems to have held that both parents produce seeds composed\nof fragments from each organ of their body. Whichever of the parts\ndrawn from the relevant organ of the parents predominates in the new\nmixture determines which characteristics are inherited by the\noffspring. Democritus is reported to have given an account of the\norigin of human beings from the earth. He is also said to be the\nfounder of a kind of cultural anthropology (Cole 1967), since his\naccount of the origin of the cosmos includes an account of the origin\nof human institutions, including language and social and political\norganization.\n\nA large group of reports about Democritus’ views concern ethical\nmaxims: some scholars have tried to regard these as systematic or\ndependent on atomist physics, while others doubt the closeness of the\nconnection. Because several maxims stress the value of\n‘cheerfulness,’ Democritus is sometimes portrayed as\n‘the laughing philosopher.’ The frequent association\nbetween hedonism and atomism may stem from the denial of any source of\ngood other than immediate experience; the tendency to reduce\nexperience to the rubbing together of atoms may have contributed to\nthe impression that atomists are preoccupied with physical\npleasure.\n",
    "section_title": "2.1 Leucippus and Democritus",
    "entry_title": "Ancient Atomism",
    "hierarchy_title": "Ancient Atomism || Ancient Greek Atomism || Leucippus and Democritus",
    "tokenized_text": [
        "ancient",
        "greek",
        "atomism",
        "leucippus",
        "democritus",
        "leucippus",
        "democritus",
        "leucippus",
        "th",
        "c",
        "bce",
        "usually",
        "credited",
        "inventing",
        "atomism",
        "greek",
        "tradition",
        "according",
        "passing",
        "remark",
        "geographer",
        "strabo",
        "posidonius",
        "st",
        "c",
        "bce",
        "stoic",
        "philosopher",
        "reported",
        "ancient",
        "greek",
        "atomism",
        "traced",
        "back",
        "figure",
        "known",
        "moschus",
        "mochus",
        "sidon",
        "lived",
        "time",
        "trojan",
        "war",
        "report",
        "given",
        "credence",
        "seventeenth",
        "century",
        "cambridge",
        "platonist",
        "henry",
        "traced",
        "origin",
        "ancient",
        "atomism",
        "back",
        "via",
        "pythagoras",
        "moschus",
        "moses",
        "theologically",
        "motivated",
        "view",
        "appealed",
        "saw",
        "revelation",
        "source",
        "truth",
        "wanted",
        "trace",
        "ancient",
        "greek",
        "idea",
        "biblical",
        "source",
        "ancient",
        "greek",
        "source",
        "commenting",
        "travel",
        "democritus",
        "credit",
        "mathematical",
        "interest",
        "time",
        "spent",
        "among",
        "egyptian",
        "geometer",
        "suggests",
        "may",
        "learned",
        "philosopher",
        "india",
        "tannéry",
        "argued",
        "zeno",
        "elea",
        "argument",
        "divisibility",
        "would",
        "make",
        "sense",
        "formulated",
        "response",
        "atomist",
        "theory",
        "supposedly",
        "held",
        "early",
        "pythagoreans",
        "tannéry",
        "thesis",
        "thoroughly",
        "challenged",
        "since",
        "scholar",
        "instead",
        "consider",
        "atomism",
        "one",
        "number",
        "position",
        "formulated",
        "response",
        "argument",
        "parmenides",
        "zeno",
        "first",
        "half",
        "fifth",
        "century",
        "little",
        "known",
        "leucippus",
        "idea",
        "student",
        "democrituswho",
        "said",
        "taken",
        "systematized",
        "teacher",
        "theoryare",
        "known",
        "large",
        "number",
        "report",
        "fragment",
        "quoted",
        "others",
        "early",
        "atomists",
        "theorized",
        "two",
        "fundamental",
        "oppositely",
        "characterized",
        "constituent",
        "natural",
        "world",
        "indivisible",
        "bodiesatomsand",
        "void",
        "latter",
        "described",
        "simply",
        "nothing",
        "negation",
        "atom",
        "said",
        "intrinsically",
        "unchangeable",
        "move",
        "void",
        "combine",
        "different",
        "cluster",
        "give",
        "rise",
        "macroscopic",
        "body",
        "perceived",
        "world",
        "macroscopic",
        "object",
        "fact",
        "combination",
        "atom",
        "everything",
        "world",
        "experience",
        "transitory",
        "subject",
        "dissolution",
        "atom",
        "persist",
        "time",
        "according",
        "aristotle",
        "presentation",
        "generation",
        "corruption",
        "motivation",
        "first",
        "postulation",
        "indivisible",
        "body",
        "answer",
        "metaphysical",
        "puzzle",
        "possibility",
        "change",
        "multiplicity",
        "parmenides",
        "argued",
        "differentiation",
        "change",
        "implies",
        "either",
        "come",
        "although",
        "problem",
        "interpreting",
        "parmenides",
        "precise",
        "meaning",
        "understood",
        "raised",
        "problem",
        "change",
        "possible",
        "without",
        "something",
        "coming",
        "nothing",
        "several",
        "presocratics",
        "formulated",
        "response",
        "philosophical",
        "system",
        "change",
        "considered",
        "require",
        "something",
        "coming",
        "complete",
        "nonexistence",
        "rather",
        "arrangement",
        "preexisting",
        "element",
        "new",
        "combination",
        "atomists",
        "held",
        "atom",
        "unchangeable",
        "contain",
        "internal",
        "differentiation",
        "sort",
        "would",
        "allow",
        "division",
        "positing",
        "indivisible",
        "body",
        "atomists",
        "also",
        "thought",
        "answering",
        "zeno",
        "paradox",
        "impossibility",
        "motion",
        "zeno",
        "argued",
        "magnitude",
        "divided",
        "infinity",
        "would",
        "impossible",
        "motion",
        "occur",
        "problem",
        "seems",
        "body",
        "moving",
        "would",
        "traverse",
        "infinite",
        "number",
        "space",
        "finite",
        "time",
        "supposing",
        "atom",
        "form",
        "lowest",
        "limit",
        "division",
        "atomists",
        "escape",
        "dilemma",
        "total",
        "space",
        "traversed",
        "finite",
        "number",
        "part",
        "unclear",
        "whether",
        "earliest",
        "atomists",
        "understood",
        "atom",
        "physically",
        "theoretically",
        "indivisible",
        "may",
        "made",
        "distinction",
        "makin",
        "argument",
        "atomic",
        "indivisibility",
        "based",
        "homogeneity",
        "substance",
        "smallness",
        "explains",
        "democritus",
        "allowed",
        "possibility",
        "even",
        "large",
        "atom",
        "makin",
        "atom",
        "differ",
        "size",
        "shape",
        "order",
        "position",
        "move",
        "void",
        "anddepending",
        "shapesome",
        "temporarily",
        "bond",
        "one",
        "another",
        "mean",
        "tiny",
        "hook",
        "barb",
        "surface",
        "thus",
        "shape",
        "individual",
        "atom",
        "affect",
        "macroscopic",
        "texture",
        "cluster",
        "atom",
        "may",
        "fluid",
        "yielding",
        "firm",
        "resistant",
        "depending",
        "amount",
        "void",
        "space",
        "coalescence",
        "atomic",
        "shape",
        "texture",
        "surface",
        "relative",
        "density",
        "fragility",
        "different",
        "material",
        "also",
        "accounted",
        "mean",
        "atom",
        "fuse",
        "rather",
        "repel",
        "one",
        "another",
        "collide",
        "observation",
        "tendency",
        "body",
        "bumping",
        "one",
        "another",
        "frequently",
        "exploited",
        "explain",
        "apparently",
        "patterned",
        "motion",
        "macroscopic",
        "body",
        "visible",
        "world",
        "atomists",
        "accounted",
        "perception",
        "mean",
        "film",
        "atom",
        "sloughed",
        "surface",
        "external",
        "object",
        "entering",
        "impacting",
        "sense",
        "organ",
        "tried",
        "account",
        "sensible",
        "effect",
        "mean",
        "contact",
        "regarded",
        "sense",
        "perception",
        "caused",
        "property",
        "atom",
        "making",
        "film",
        "acting",
        "atom",
        "animal",
        "sense",
        "organ",
        "perception",
        "color",
        "caused",
        "turning",
        "position",
        "atom",
        "taste",
        "caused",
        "shape",
        "atom",
        "contacting",
        "tongue",
        "eg",
        "bitter",
        "taste",
        "tearing",
        "caused",
        "sharp",
        "atom",
        "feeling",
        "heat",
        "ascribed",
        "friction",
        "heat",
        "said",
        "caused",
        "admixture",
        "tiny",
        "fire",
        "atom",
        "democritus",
        "considered",
        "thought",
        "material",
        "process",
        "involving",
        "local",
        "rearrangement",
        "body",
        "much",
        "perception",
        "famous",
        "quotation",
        "democritus",
        "distinguishes",
        "perceived",
        "property",
        "like",
        "color",
        "taste",
        "exist",
        "convention",
        "contrast",
        "reality",
        "atom",
        "void",
        "however",
        "apparently",
        "recognized",
        "epistemological",
        "problem",
        "empiricist",
        "philosophy",
        "nonetheless",
        "regard",
        "object",
        "sense",
        "unreal",
        "another",
        "famous",
        "quotation",
        "sens",
        "accuse",
        "mind",
        "overthrowing",
        "although",
        "mind",
        "dependent",
        "sens",
        "accusation",
        "developing",
        "atomist",
        "theory",
        "undermines",
        "basis",
        "confidence",
        "sense",
        "perception",
        "thought",
        "effect",
        "undercut",
        "foundation",
        "knowledge",
        "gained",
        "sens",
        "democritus",
        "sometimes",
        "seems",
        "doubt",
        "deny",
        "possibility",
        "knowledge",
        "early",
        "greek",
        "atomists",
        "try",
        "account",
        "formation",
        "natural",
        "world",
        "mean",
        "simple",
        "ontology",
        "atom",
        "void",
        "alone",
        "leucippus",
        "held",
        "infinite",
        "number",
        "atom",
        "moving",
        "time",
        "infinite",
        "void",
        "form",
        "cosmic",
        "system",
        "kosmoi",
        "mean",
        "whirling",
        "motion",
        "randomly",
        "establishes",
        "large",
        "enough",
        "cluster",
        "atom",
        "controversial",
        "whether",
        "atom",
        "thought",
        "weight",
        "intrinsic",
        "property",
        "causing",
        "fall",
        "given",
        "direction",
        "whether",
        "weight",
        "simply",
        "tendency",
        "atom",
        "otherwise",
        "move",
        "every",
        "direction",
        "except",
        "struck",
        "move",
        "towards",
        "centre",
        "system",
        "created",
        "whirling",
        "cosmic",
        "vortex",
        "vortex",
        "formed",
        "creates",
        "membrane",
        "atom",
        "outer",
        "edge",
        "outer",
        "band",
        "atom",
        "catch",
        "fire",
        "forming",
        "sun",
        "star",
        "kosmoi",
        "impermanent",
        "accounted",
        "purpose",
        "design",
        "earth",
        "described",
        "flat",
        "cylindrical",
        "drum",
        "center",
        "cosmos",
        "specie",
        "regarded",
        "permanent",
        "abstract",
        "form",
        "chance",
        "combination",
        "atom",
        "living",
        "thing",
        "regarded",
        "psychê",
        "principle",
        "life",
        "identified",
        "fiery",
        "atom",
        "organism",
        "thought",
        "reproduce",
        "mean",
        "seed",
        "democritus",
        "seems",
        "held",
        "parent",
        "produce",
        "seed",
        "composed",
        "fragment",
        "organ",
        "body",
        "whichever",
        "part",
        "drawn",
        "relevant",
        "organ",
        "parent",
        "predominates",
        "new",
        "mixture",
        "determines",
        "characteristic",
        "inherited",
        "offspring",
        "democritus",
        "reported",
        "given",
        "account",
        "origin",
        "human",
        "being",
        "earth",
        "also",
        "said",
        "founder",
        "kind",
        "cultural",
        "anthropology",
        "cole",
        "since",
        "account",
        "origin",
        "cosmos",
        "includes",
        "account",
        "origin",
        "human",
        "institution",
        "including",
        "language",
        "social",
        "political",
        "organization",
        "large",
        "group",
        "report",
        "democritus",
        "view",
        "concern",
        "ethical",
        "maxim",
        "scholar",
        "tried",
        "regard",
        "systematic",
        "dependent",
        "atomist",
        "physic",
        "others",
        "doubt",
        "closeness",
        "connection",
        "several",
        "maxim",
        "stress",
        "value",
        "cheerfulness",
        "democritus",
        "sometimes",
        "portrayed",
        "laughing",
        "philosopher",
        "frequent",
        "association",
        "hedonism",
        "atomism",
        "may",
        "stem",
        "denial",
        "source",
        "good",
        "immediate",
        "experience",
        "tendency",
        "reduce",
        "experience",
        "rubbing",
        "together",
        "atom",
        "may",
        "contributed",
        "impression",
        "atomists",
        "preoccupied",
        "physical",
        "pleasure"
    ]
}