{
    "main_text": "Theories of Attention || Spotlight Theories\n2.7 Spotlight Theories\n\nWhereas bottleneck metaphors have traditionally guided the\ntheories that attempt to locate the cognitive resources that operate\nonly on attended stimuli, it has been spotlight metaphors\nthat have guided the theories that attempt to say which features of a\nstimulus determine whether attention is being paid to that stimulus at\nany given moment (e.g., Watchel, 1967; Woodman and Luck, 1999; see\nFernandez-Duque and Johnson, 2002, for discussion). The idea suggested\nby the spotlight metaphor is that a stimulus’s location\nultimately determines whether or not that stimulus receives attention:\nthe point here is not to deny that one can pay attention to something\non account of it being brightly coloured, or on account of it being\ninteresting. The point is, instead, that one pays attention to\nbrightly coloured or interesting things only by directing one’s\nattention to the location of those things.\n\nOne can easily see why the spotlight metaphor has been appealing. If\nwe are presented with an array of differently coloured shapes,\nappearing and disappearing in various places, then there will be any\nnumber of attention-demanding tasks that we might perform regarding\nthat array. Some tasks might require us to attend to whatever is going\non at the top of the screen, others might require us to attend to all\nthe red shapes, or to all the triangles, or to something else. Some of\nthese ways of attending seem to be more basic than others. It seems,\nfor example, that attending to things in the top part of the screen\nmight be a primitive task, whereas attending to the triangles could\nnot be primitive in the same way: we cannot simply attend to\nthe triangles. If we want to attend to the triangles, we need first to\nwork out where the triangles are. If, on the other hand, we\nwant to attend to the things in the top part of the screen we do not\nneed to work out whether they are triangles. It is therefore plausible\nthat when we attend to the triangles we do so by attending to\ntheir locations. In this sense attending on the basis of location\nseems to be more basic than attending on the basis of shape.\n\nThe idea that attending to a location is more basic than attending to\na shape might tempt one to think that attending on the basis of\nlocation is absolutely basic, so that attention is always and only\nallocated on the basis of location. If that were right then a theory\nof the spatial allocation of attention—a theory about the moving\nand focusing of an ‘attentional spotlight’—would be\na large and central component in an account of how attention works.\nThis would be good news for those who want to give a single unified\ntheory of attention, and it would be good news for the scientific\nproject of explaining attention more generally, since\nattention’s spotlight-like behaviours are some of its best\nunderstood aspects (see Logan, 1996).\n\nThere are reasons to think that location does play a special role in\nthe allocation of attention, as the spotlight metaphor suggests. But\nthe role of location in the allocation of attention is probably not as\nstraightforward as would be required by the most parsimonious of\nspotlight-based theories. Location does have a special role to play\nhere, but (1) location is not the only property to have such a role,\nand (2) the role of location is more complicated than a simple\nspotlight metaphor suggests.\n\nEmpirical debates about the direction of the spotlight of attention\nhave focussed mostly on the second of these points. An important\nsource of data here is case studies contrasting the different patterns\nof attention failure that are shown by different unilateral neglect\npatients. Such studies suggest that various frames of reference are\ninvolved in the spatial allocation of attention (Behrmann and Tipper,\n1999). This indicates that there is no single map of\nlocations determining which items get attention: attention is\nsometimes allocated on the basis of location in egocentric space,\nsometimes on the basis of location in more complex frames of reference\n(a point that was among those raised by Allport, in his influential\ncritique of the Broadbentian debates (see Allport, 1992, p. 197)).\n\nThere are also some well-known experimental effects suggesting that\nattention is allocated, not on the basis of straightforward spatial\ncoordinates, but in ways that are constrained by the distribution of\nobjects in space. The classic work in this area is John\nDuncan’s demonstration that attention shifts more readily\nbetween two locations that fall within the bounds of a single object\nthan between equidistant locations that are separated by an object\nboundary (Duncan, 1984). Equally important here are findings from\nexperiments using three-dimensional stimuli, and using virtual\nthree-dimensional displays. These studies suggest that experimental\nparticipants are unable to differentially attend to depths in an empty\nspace, but that these participants start to be able to shift their\nattention forwards and backward (to a place in front of or behind the\npoint that their eyes are fixating) when the relevant locations are\nones in which there are objects (see Yantis, 1998).\n\nThese converging sources of data indicate that the spotlight of\nattention is not allocated simply on the basis of coordinates in any\nsingle spatial frame of reference. That is an important finding for\nthose attempting to localize mechanisms for the allocation of\nattention within the brain (since different brain areas differ in\ntheir mapping of space, and in their representation of spatial\ninformation about the objects within it). It has been influential in\nleading psychologists to turn away from simple spotlight metaphors. It\nshould be noted, however, that these findings do not threaten the core\nof the idea that was suggested by the spotlight metaphor: the facts\nabout what a person is attending to might still supervene on the facts\nabout where that person is attending, even if quite numerous\nand sometimes complex factors are responsible for determining which\nlocation that is.\n\nOther effects are somewhat more damaging for a pure spotlight view,\nalthough they also stop short of refuting it entirely. The\nmore-than-merely-spatial complexity of the way in which attention is\nallocated has been nicely demonstrated in a series of experiments by\nDwight Kravitz and Marlene Behrmann (Kravitz and Behrmann, 2011). The\nparticipants in these experiments have their attention cued by a brief\nstimulus that is presented at one end of a shape that is shown on a\ncomputer screen. This shape might be a simple rectangle, a rectangle\nwith bulbous ends, or a more complex ‘H’ or\n‘h’ shape. It is presented alongside another shape, which\nin some cases has the same shape and colour, and in other cases is\ndifferent. The resulting allocation of attention is then probed by\nmeasuring the reaction times to stimuli that are presented on and near\nthese objects. Kravitz and Behrmann find that all the different\nproperties of their stimuli interact to determine the way in\nwhich attention is allocated to the screen on which those stimuli\nappear. Most strikingly of all, they find a difference in the\nallocation of attention between trials in which the shapes on the\nscreen are an upper and a lower case ‘H’, and trials in\nwhich the shapes are an upper case H and number 4, even though this\nnumber 4 shape is exactly the same as the lower case h, but presented\nupside down. Such findings suggest that attention, even when triggered\nby a simple spatial cue, is not allocated merely on the basis of\nlocation, but also on the basis of shape, colour, and arbitrary\nlearned meaning.\n\nThe discovery that attention can preferentially modulate the\nprocessing of stimuli on account of their colours, shapes, and\nmeanings does not prevent us from maintaining that the location of a\nstimulus has a special role to play in the process by which attention\nis allocated to it. More than one line of research in psychology has\nsought to identify some one representation in the brain in which items\nare encoded in a way that determines the extent to which attention\nwill be allocated to them. In the longest established of these lines\nof research—beginning with the work of Koch and Ullman\n(1985)—this representation has been taken to be a map,\nin some quite literal sense of ‘map’: the representation\nis taken to be one in which every location in some region is\nrepresented, and the representation of these locations is taken to be\nin some format that immediately encodes the spatial relations between\nthem. Every object that is represented is taken to be represented as\nbeing at some location, and the properties assigned to these located\nobjects are taken to determine the likelihood that attention will be\npaid to the location that the objects occupy. According to the theory\nthat postulates these ‘salience maps’, location does play\na unique role in determining the way in which attention is allocated,\ndespite the fact that other properties also contribute to that\nallocation.\n\nIn more recent treatments of this idea (Pessoa, 2013) such maps are\ntaken to include representations, not merely of the objective\nproperties that give an item salience, but also of subjective\nproperties, such as emotional-valence and\ncurrent-motivational-relevance. The more we think of these maps as\nbeing augmented with additional, non-spatial information, the less\nspotlight-like the allocation of attention represented in them will\nseem to be, but, provided the representation in question is still\nunderstood to be map-like, location can still be understood to have an\nimportant role, and perhaps even a uniquely important one.\n\nDebates about the role of such maps, and about the variety of\nsubjective and objective properties that are represented within them,\nmay have some wide-ranging philosophical consequences, concerning more\nthan just the aptness of the spotlight metaphor. Aaron Henry has\nsuggested that the viability of some recent philosophical theories\ndepends on the outcome of these debates. Since the recent\nphilosophical theories of attention have tended to emphasize the role\nof agency in attention, they face potential counterexamples from\ninstances of involuntary attention. Henry suggests that the threat of\nsuch counterexamples can be defused if the mechanisms of involuntary\nattention capture are understood to involve attention being allocated\non the basis of a map in which the agent’s own priorities for\naction are represented (Henry, 2017).\n\nAlthough the psychological debates about salience maps are ongoing, an\nargument against pure spotlight views can also be made on more\ntraditional, phenomenological grounds. A pure spotlight theory,\naccording to which attention is always allocated on the basis of\nlocation, seems unable to account for the sort of case that Hermann\nvon Helmholtz and William James were concerned with (see section\n 1.5).\n There is, as their example suggests, a difference between attending\nto the pitch of a note and attending to its timbre, or to its\novertones. This difference in attention does not seem to correspond to\nany difference in the location attended. Nor does any purely\nlocation-based theory of attention allocation seem able to account for\nthe sort attention that one must pay in order to perform a time-based\ntask, such as finding out which of a group of shapes appears on screen\nfor longest. Such temporal aspects of attention have been a relatively\nlate addition to the psychological research agenda (see the papers\ncollected in Nobre and Coull, 2010). The research concerning them is\nbeginning to reveal a diverse range of effects, with a range of\nsimilarly diverse neural underpinnings (Nobre and van Ede, 2018). Some\nphilosophical work has been devoted to the exploration of these\ntemporal aspects of attention (see Phillips, 2011), but it is work\nthat has tended to address questions that further our understanding of\nthe experience and perception of time, without attempting to\ncontribute directly to our philosophical understanding of attention\nitself (see the entry on\n The Experience and Perception of Time).\n\nSince some shifts of attention are not shifts in the location\nattended, a theory of the factors that determine which locations a\nsubject is attending to cannot tell us the whole story about the\nallocation of attention. It might nonetheless be a central component\nin a theory of some of attention’s forms (see Wright and Ward,\n2008).\n",
    "section_title": "2.7 Spotlight Theories",
    "entry_title": "Attention",
    "hierarchy_title": "Attention || Theories of Attention || Spotlight Theories",
    "tokenized_text": [
        "theory",
        "attention",
        "spotlight",
        "theory",
        "spotlight",
        "theory",
        "whereas",
        "bottleneck",
        "metaphor",
        "traditionally",
        "guided",
        "theory",
        "attempt",
        "locate",
        "cognitive",
        "resource",
        "operate",
        "attended",
        "stimulus",
        "spotlight",
        "metaphor",
        "guided",
        "theory",
        "attempt",
        "say",
        "feature",
        "stimulus",
        "determine",
        "whether",
        "attention",
        "paid",
        "stimulus",
        "given",
        "moment",
        "eg",
        "watchel",
        "woodman",
        "luck",
        "see",
        "fernandezduque",
        "johnson",
        "discussion",
        "idea",
        "suggested",
        "spotlight",
        "metaphor",
        "stimulus",
        "location",
        "ultimately",
        "determines",
        "whether",
        "stimulus",
        "receives",
        "attention",
        "point",
        "deny",
        "one",
        "pay",
        "attention",
        "something",
        "account",
        "brightly",
        "coloured",
        "account",
        "interesting",
        "point",
        "instead",
        "one",
        "pay",
        "attention",
        "brightly",
        "coloured",
        "interesting",
        "thing",
        "directing",
        "one",
        "attention",
        "location",
        "thing",
        "one",
        "easily",
        "see",
        "spotlight",
        "metaphor",
        "appealing",
        "presented",
        "array",
        "differently",
        "coloured",
        "shape",
        "appearing",
        "disappearing",
        "various",
        "place",
        "number",
        "attentiondemanding",
        "task",
        "might",
        "perform",
        "regarding",
        "array",
        "task",
        "might",
        "require",
        "u",
        "attend",
        "whatever",
        "going",
        "top",
        "screen",
        "others",
        "might",
        "require",
        "u",
        "attend",
        "red",
        "shape",
        "triangle",
        "something",
        "else",
        "way",
        "attending",
        "seem",
        "basic",
        "others",
        "seems",
        "example",
        "attending",
        "thing",
        "top",
        "part",
        "screen",
        "might",
        "primitive",
        "task",
        "whereas",
        "attending",
        "triangle",
        "could",
        "primitive",
        "way",
        "simply",
        "attend",
        "triangle",
        "want",
        "attend",
        "triangle",
        "need",
        "first",
        "work",
        "triangle",
        "hand",
        "want",
        "attend",
        "thing",
        "top",
        "part",
        "screen",
        "need",
        "work",
        "whether",
        "triangle",
        "therefore",
        "plausible",
        "attend",
        "triangle",
        "attending",
        "location",
        "sense",
        "attending",
        "basis",
        "location",
        "seems",
        "basic",
        "attending",
        "basis",
        "shape",
        "idea",
        "attending",
        "location",
        "basic",
        "attending",
        "shape",
        "might",
        "tempt",
        "one",
        "think",
        "attending",
        "basis",
        "location",
        "absolutely",
        "basic",
        "attention",
        "always",
        "allocated",
        "basis",
        "location",
        "right",
        "theory",
        "spatial",
        "allocation",
        "attentiona",
        "theory",
        "moving",
        "focusing",
        "attentional",
        "spotlight",
        "would",
        "large",
        "central",
        "component",
        "account",
        "attention",
        "work",
        "would",
        "good",
        "news",
        "want",
        "give",
        "single",
        "unified",
        "theory",
        "attention",
        "would",
        "good",
        "news",
        "scientific",
        "project",
        "explaining",
        "attention",
        "generally",
        "since",
        "attention",
        "spotlightlike",
        "behaviour",
        "best",
        "understood",
        "aspect",
        "see",
        "logan",
        "reason",
        "think",
        "location",
        "play",
        "special",
        "role",
        "allocation",
        "attention",
        "spotlight",
        "metaphor",
        "suggests",
        "role",
        "location",
        "allocation",
        "attention",
        "probably",
        "straightforward",
        "would",
        "required",
        "parsimonious",
        "spotlightbased",
        "theory",
        "location",
        "special",
        "role",
        "play",
        "location",
        "property",
        "role",
        "role",
        "location",
        "complicated",
        "simple",
        "spotlight",
        "metaphor",
        "suggests",
        "empirical",
        "debate",
        "direction",
        "spotlight",
        "attention",
        "focussed",
        "mostly",
        "second",
        "point",
        "important",
        "source",
        "data",
        "case",
        "study",
        "contrasting",
        "different",
        "pattern",
        "attention",
        "failure",
        "shown",
        "different",
        "unilateral",
        "neglect",
        "patient",
        "study",
        "suggest",
        "various",
        "frame",
        "reference",
        "involved",
        "spatial",
        "allocation",
        "attention",
        "behrmann",
        "tipper",
        "indicates",
        "single",
        "map",
        "location",
        "determining",
        "item",
        "get",
        "attention",
        "attention",
        "sometimes",
        "allocated",
        "basis",
        "location",
        "egocentric",
        "space",
        "sometimes",
        "basis",
        "location",
        "complex",
        "frame",
        "reference",
        "point",
        "among",
        "raised",
        "allport",
        "influential",
        "critique",
        "broadbentian",
        "debate",
        "see",
        "allport",
        "p",
        "also",
        "wellknown",
        "experimental",
        "effect",
        "suggesting",
        "attention",
        "allocated",
        "basis",
        "straightforward",
        "spatial",
        "coordinate",
        "way",
        "constrained",
        "distribution",
        "object",
        "space",
        "classic",
        "work",
        "area",
        "john",
        "duncan",
        "demonstration",
        "attention",
        "shift",
        "readily",
        "two",
        "location",
        "fall",
        "within",
        "bound",
        "single",
        "object",
        "equidistant",
        "location",
        "separated",
        "object",
        "boundary",
        "duncan",
        "equally",
        "important",
        "finding",
        "experiment",
        "using",
        "threedimensional",
        "stimulus",
        "using",
        "virtual",
        "threedimensional",
        "display",
        "study",
        "suggest",
        "experimental",
        "participant",
        "unable",
        "differentially",
        "attend",
        "depth",
        "empty",
        "space",
        "participant",
        "start",
        "able",
        "shift",
        "attention",
        "forward",
        "backward",
        "place",
        "front",
        "behind",
        "point",
        "eye",
        "fixating",
        "relevant",
        "location",
        "one",
        "object",
        "see",
        "yantis",
        "converging",
        "source",
        "data",
        "indicate",
        "spotlight",
        "attention",
        "allocated",
        "simply",
        "basis",
        "coordinate",
        "single",
        "spatial",
        "frame",
        "reference",
        "important",
        "finding",
        "attempting",
        "localize",
        "mechanism",
        "allocation",
        "attention",
        "within",
        "brain",
        "since",
        "different",
        "brain",
        "area",
        "differ",
        "mapping",
        "space",
        "representation",
        "spatial",
        "information",
        "object",
        "within",
        "influential",
        "leading",
        "psychologist",
        "turn",
        "away",
        "simple",
        "spotlight",
        "metaphor",
        "noted",
        "however",
        "finding",
        "threaten",
        "core",
        "idea",
        "suggested",
        "spotlight",
        "metaphor",
        "fact",
        "person",
        "attending",
        "might",
        "still",
        "supervene",
        "fact",
        "person",
        "attending",
        "even",
        "quite",
        "numerous",
        "sometimes",
        "complex",
        "factor",
        "responsible",
        "determining",
        "location",
        "effect",
        "somewhat",
        "damaging",
        "pure",
        "spotlight",
        "view",
        "although",
        "also",
        "stop",
        "short",
        "refuting",
        "entirely",
        "morethanmerelyspatial",
        "complexity",
        "way",
        "attention",
        "allocated",
        "nicely",
        "demonstrated",
        "series",
        "experiment",
        "dwight",
        "kravitz",
        "marlene",
        "behrmann",
        "kravitz",
        "behrmann",
        "participant",
        "experiment",
        "attention",
        "cued",
        "brief",
        "stimulus",
        "presented",
        "one",
        "end",
        "shape",
        "shown",
        "computer",
        "screen",
        "shape",
        "might",
        "simple",
        "rectangle",
        "rectangle",
        "bulbous",
        "end",
        "complex",
        "h",
        "h",
        "shape",
        "presented",
        "alongside",
        "another",
        "shape",
        "case",
        "shape",
        "colour",
        "case",
        "different",
        "resulting",
        "allocation",
        "attention",
        "probed",
        "measuring",
        "reaction",
        "time",
        "stimulus",
        "presented",
        "near",
        "object",
        "kravitz",
        "behrmann",
        "find",
        "different",
        "property",
        "stimulus",
        "interact",
        "determine",
        "way",
        "attention",
        "allocated",
        "screen",
        "stimulus",
        "appear",
        "strikingly",
        "find",
        "difference",
        "allocation",
        "attention",
        "trial",
        "shape",
        "screen",
        "upper",
        "lower",
        "case",
        "h",
        "trial",
        "shape",
        "upper",
        "case",
        "h",
        "number",
        "even",
        "though",
        "number",
        "shape",
        "exactly",
        "lower",
        "case",
        "h",
        "presented",
        "upside",
        "finding",
        "suggest",
        "attention",
        "even",
        "triggered",
        "simple",
        "spatial",
        "cue",
        "allocated",
        "merely",
        "basis",
        "location",
        "also",
        "basis",
        "shape",
        "colour",
        "arbitrary",
        "learned",
        "meaning",
        "discovery",
        "attention",
        "preferentially",
        "modulate",
        "processing",
        "stimulus",
        "account",
        "colour",
        "shape",
        "meaning",
        "prevent",
        "u",
        "maintaining",
        "location",
        "stimulus",
        "special",
        "role",
        "play",
        "process",
        "attention",
        "allocated",
        "one",
        "line",
        "research",
        "psychology",
        "sought",
        "identify",
        "one",
        "representation",
        "brain",
        "item",
        "encoded",
        "way",
        "determines",
        "extent",
        "attention",
        "allocated",
        "longest",
        "established",
        "line",
        "researchbeginning",
        "work",
        "koch",
        "ullman",
        "this",
        "representation",
        "taken",
        "map",
        "quite",
        "literal",
        "sense",
        "map",
        "representation",
        "taken",
        "one",
        "every",
        "location",
        "region",
        "represented",
        "representation",
        "location",
        "taken",
        "format",
        "immediately",
        "encodes",
        "spatial",
        "relation",
        "every",
        "object",
        "represented",
        "taken",
        "represented",
        "location",
        "property",
        "assigned",
        "located",
        "object",
        "taken",
        "determine",
        "likelihood",
        "attention",
        "paid",
        "location",
        "object",
        "occupy",
        "according",
        "theory",
        "postulate",
        "salience",
        "map",
        "location",
        "play",
        "unique",
        "role",
        "determining",
        "way",
        "attention",
        "allocated",
        "despite",
        "fact",
        "property",
        "also",
        "contribute",
        "allocation",
        "recent",
        "treatment",
        "idea",
        "pessoa",
        "map",
        "taken",
        "include",
        "representation",
        "merely",
        "objective",
        "property",
        "give",
        "item",
        "salience",
        "also",
        "subjective",
        "property",
        "emotionalvalence",
        "currentmotivationalrelevance",
        "think",
        "map",
        "augmented",
        "additional",
        "nonspatial",
        "information",
        "le",
        "spotlightlike",
        "allocation",
        "attention",
        "represented",
        "seem",
        "provided",
        "representation",
        "question",
        "still",
        "understood",
        "maplike",
        "location",
        "still",
        "understood",
        "important",
        "role",
        "perhaps",
        "even",
        "uniquely",
        "important",
        "one",
        "debate",
        "role",
        "map",
        "variety",
        "subjective",
        "objective",
        "property",
        "represented",
        "within",
        "may",
        "wideranging",
        "philosophical",
        "consequence",
        "concerning",
        "aptness",
        "spotlight",
        "metaphor",
        "aaron",
        "henry",
        "suggested",
        "viability",
        "recent",
        "philosophical",
        "theory",
        "depends",
        "outcome",
        "debate",
        "since",
        "recent",
        "philosophical",
        "theory",
        "attention",
        "tended",
        "emphasize",
        "role",
        "agency",
        "attention",
        "face",
        "potential",
        "counterexample",
        "instance",
        "involuntary",
        "attention",
        "henry",
        "suggests",
        "threat",
        "counterexample",
        "defused",
        "mechanism",
        "involuntary",
        "attention",
        "capture",
        "understood",
        "involve",
        "attention",
        "allocated",
        "basis",
        "map",
        "agent",
        "priority",
        "action",
        "represented",
        "henry",
        "although",
        "psychological",
        "debate",
        "salience",
        "map",
        "ongoing",
        "argument",
        "pure",
        "spotlight",
        "view",
        "also",
        "made",
        "traditional",
        "phenomenological",
        "ground",
        "pure",
        "spotlight",
        "theory",
        "according",
        "attention",
        "always",
        "allocated",
        "basis",
        "location",
        "seems",
        "unable",
        "account",
        "sort",
        "case",
        "hermann",
        "von",
        "helmholtz",
        "william",
        "james",
        "concerned",
        "see",
        "section",
        "example",
        "suggests",
        "difference",
        "attending",
        "pitch",
        "note",
        "attending",
        "timbre",
        "overtone",
        "difference",
        "attention",
        "seem",
        "correspond",
        "difference",
        "location",
        "attended",
        "purely",
        "locationbased",
        "theory",
        "attention",
        "allocation",
        "seem",
        "able",
        "account",
        "sort",
        "attention",
        "one",
        "must",
        "pay",
        "order",
        "perform",
        "timebased",
        "task",
        "finding",
        "group",
        "shape",
        "appears",
        "screen",
        "longest",
        "temporal",
        "aspect",
        "attention",
        "relatively",
        "late",
        "addition",
        "psychological",
        "research",
        "agenda",
        "see",
        "paper",
        "collected",
        "nobre",
        "coull",
        "research",
        "concerning",
        "beginning",
        "reveal",
        "diverse",
        "range",
        "effect",
        "range",
        "similarly",
        "diverse",
        "neural",
        "underpinnings",
        "nobre",
        "van",
        "ede",
        "philosophical",
        "work",
        "devoted",
        "exploration",
        "temporal",
        "aspect",
        "attention",
        "see",
        "phillips",
        "work",
        "tended",
        "address",
        "question",
        "understanding",
        "experience",
        "perception",
        "time",
        "without",
        "attempting",
        "contribute",
        "directly",
        "philosophical",
        "understanding",
        "attention",
        "see",
        "entry",
        "experience",
        "perception",
        "time",
        "since",
        "shift",
        "attention",
        "shift",
        "location",
        "attended",
        "theory",
        "factor",
        "determine",
        "location",
        "subject",
        "attending",
        "tell",
        "u",
        "whole",
        "story",
        "allocation",
        "attention",
        "might",
        "nonetheless",
        "central",
        "component",
        "theory",
        "attention",
        "form",
        "see",
        "wright",
        "ward"
    ]
}