{
    "main_text": "Critique of the Revolution\n4. Critique of the Revolution\n\n Rehberg's critique of revolutionary ideology was based upon his\ngeneral skepticism toward reason.  He worked out his criticisms\ngradually and on scattered occasions from 1789 to 1792 in his reviews\nfor the Allgemeine Literatur Zeitung. He later revised and\ncollected these reviews, publishing them in 1793 under the title\nUntersuchungen über die Französische\n Revolution.[37]\n This work stands as one of the best\nGerman critiques of the French Revolution.  In fundamental respects it\nlaid the groundwork for German conservatism.  Its significance was\nimmediately recognized by Fichte, who devoted much effort to its\nrefutation in his Beiträge zur Berichtigung der Urteile des\nPublikums über die französische Revolution.  \n\n For Rehberg, the Revolution was a failed experiment in idealism, a\nmisguided attempt by French radicals to recreate society and state\naccording to the principles of reason.  There lay a fundamental\nfallacy behind this experiment: the belief that the principles of\nreason are guidelines for concrete political practice, that they are\nblueprints to reconstruct all society and the state.  It was this\nbelief, Rehberg argues, that sanctioned the frenzy of destruction\nbehind the Revolution, the eagerness to abolish all the traditional\npolitical institutions of France.  Since the French radicals believed\nthat the principles of reason mandate a specific kind of constitution,\nand since traditional French institutions were very far from that\nideal, they held that these institutions are contrary to\nreason, so that it was obligatory to abolish them.  The chief fallacy\nbehind revolutionary ideology, therefore, was its\nhyperrationalism, its belief that reason by itself dictates\npolitical practice.  Hence Rehberg made it his chief business to\nexpose this fallacy.  In his many writings on the Revolution he argued\nemphatically and repeatedly that reason has no such powers.  Although\nhe accepted that pure reason does determine the general principles of\nmorality, he denied that it is by itself sufficient to dictate\npolitical\n practice.[38]\n Reason by itself demands only that\nour principles are just and universal, applying without exception to\neveryone alike; but such principles are indifferent regarding the\nspecific form of a constitution; they determine nothing about\nwhich laws are just and universal in the specific circumstances\nof a country.  On their own, the general principles of reason are\nconsistent with monarchy, democracy or aristocracy.  Which form of\ngovernment is best can be determined by experience alone, by seeing which\nlaws have the greatest utility under specific circumstances.  \n\n It was one of Rehberg's central themes that the gap between theory\nand practice, between general principle and specific constitution, has\nto be bridged by judgment.  Judgment is the special faculty and\nprovince of the statesman.  Its task is to determine how best to apply\nthe principles of reason under specific circumstances.  It should\nnever be confused simply with reason, the intellectual power of\ndetermining general rules; for, as Kant taught in the first\n Kritik,[39]\n judgment is that faculty that determines\nthe application of rules and therefore does not stand under any rule\nitself.  Judgment, however, is no easy task: there are many ways of\napplying the same principles; and the consequences of applying them\nhave to be weighed against one another.  Judgment is a faculty that\nimproves with age and experience, and that sometimes requires\ntechnical expertise. The shortcoming of the French radicals is that\nthey had underestimated judgment as they had overestimated reason.\nThey assumed that each principle involves the criterion for its\napplication, and that it should be applied in just one unique way,\nregardless of the circumstances.  \n\n Recognizing the role of judgment in politics means for Rehberg\nthat another fundamental tenet of revolutionary ideology collapses:\nthe principle of the autonomy of reason, i.e., the belief that each\nindividual alone has the power and right to determine how to act in\nthe state (15-17). Rousseau and Kant are right to claim that reason is\ninalienable, and that each individual is sovereign in having the power\nand right to ascertain general moral principles.  But this does not\ngive them, Rehberg argued, the power and right to determine how to\napply these principles in specific circumstances.  Since knowing how\nto apply these principles is a matter of judgment, and since judgment\ndepends on experience and expertise, only a few qualified individuals\nwill be able to determine the best form of a constitution and the laws\nof a country.  Hence, in these cases, the individual should alienate\nhis powers of judgment to those who are more qualified.  Rehberg's\nadvocacy of the role of judgment in politics thus became the basis for\nhis defense of elite rule.  \n\n A central pillar of Rehberg's conservatism was his defense of\ntradition.  The basis for that defense was, again, his critique of\nreason.  Since reason by itself cannot determine the specific form of\na constitution, it never lays down a mandate to abolish the\nestablished institutions of a country, and so it is permissible for\nthe statesman to follow tradition.  Sometimes, Rehberg argued, it is\nnot only permissable but also obligatory for the\nstatesman to respect the traditions and established institutions of a\n country.[40]\n A state is the product of the history of its\npeople, of the experience of many generations; and each\ngeneration lays down the foundations on which another must build.\nWhat our forefathers built grew out of the unique circumstances of the\ncountry, and it has gradually adapted to them; to abolish it would\nleave us nothing to build upon and make it necessary to create ex\nnihilo.  Rehberg's defense of tradition and precedent went even\nfurther: he argued that many of our social and moral obligations are\nthemselves essentially historical, arising from inheritance.  No state\ncould persist for long, he argued, if future generations did not take\nover the obligations of past generations, or if children did not\nassume the duties of their parents (52-53).  It was therefore a\nfundamental rule of civil society that children inherit the duties and\nresponsibilities of their parents.  Rehberg knew that this was a\nsomewhat harsh doctrine, because it would mean accepting inequalities\nfrom birth and aristocratic privileges; yet he insisted upon it all\nthe same: “Human beings in\ncivil society must be compelled to honor what their parents promised\nand began.  No state could exist for long if children and other heirs\nwere not made to take the place where the deceased once stood.  Who\nwould want to enter into commitments when the uncertain death of one\nof the committed parties released them of all obligations?”\n(52)\n\n Given Rehberg's critique of rationalism and his respect for\ntradition, his reaction to social contract doctrine should not be\nsurprising.  He condemned it in the sharpest terms.  This doctrine not\nonly assumed that every individual has the power to judge political\naffairs, but it also seemed to absolve him from all traditional\nresponsibilities and obligations.  The social contract doctrine\nfalsely holds, he argued, that we enter society and the state at will,\nas if we were born free and had some natural criterion by which to\njudge them; but we are born into society and the state, and the\ncriteria by which we judge things are formed by them.  We must give up\nthe assumption, he insisted, that civil rights belong to people by\nnature; ranks and rights are inherited and depend upon the place in\nsociety into which we are born (62).\n\n Rehberg saw the chief inspiration for French radicalism in the\nseductive and paradoxical writings of Jean Jacques Rousseau (6, 21).\nIt was Rousseau who first advanced the principle of the autonomy of\nreason, and who made reason alone the touchstone of political\nlegitimacy.  His doctrine of the general will meant that every\npolitical principle should be tested in the light of reason, or\naccording to what an ideally rational person would will.  Rehberg\nfound irresolvable ambiguities in Rousseau's doctrine, which, he\nclaimed, made its application to the political world impossible.\nRousseau's distinction between the general will and the will of all\nmade it clear that it was not possible to determine the general will\nsimply by what people happen to want; the general will was understood\nby Rousseau to be a norm that determines what everyone ought to will.\nBut how is it possible to determine what everyone ought to will?  And,\nmore importantly, who is to determine it?  The ambiguities of\nRosseau's doctrine made it ripe for exploitation by Jacobin\nideologues, who felt justified in “forcing people to be\nfree”.\n\n Another source of revolutionary ideology that became the special\ntarget of Rehberg's wrath was physiocratic doctrine.  Though this\ndoctrine was often associated with absolutism, Rehberg still saw it as\na basic influence on radical thinking.  He especially disliked what he\ntook to be the physiocrats' leading principle: that everyone should\nhave the right to do whatever they want as long as they do not\ninterfere with anyone else.  Such a principle laid down the path\ntoward “a very crude egoism”.  If this were made the\ngoverning principle of civil society, he argued, then people would\nrecognize no obligations other than to leave others alone; the whole\nculture of social virtue would disappear (25-26).  The physiocratic\nsystem also leads to materialism, he believed, because it values\neverything according to its utility, its ability to satisfy our basic\nneeds.  People will regard themselves as machines, who work to eat and eat only to work more\n(27).  Since they show no immediate profit, there will be no point in\ndeveloping our higher powers or in cultivating the arts (28).\n",
    "section_title": "4. Critique of the Revolution",
    "entry_title": "August Wilhelm Rehberg",
    "hierarchy_title": "August Wilhelm Rehberg || Critique of the Revolution",
    "tokenized_text": [
        "critique",
        "revolution",
        "critique",
        "revolution",
        "rehberg",
        "s",
        "critique",
        "revolutionary",
        "ideology",
        "based",
        "upon",
        "general",
        "skepticism",
        "toward",
        "reason",
        "worked",
        "criticism",
        "gradually",
        "scattered",
        "occasion",
        "review",
        "allgemeine",
        "literatur",
        "zeitung",
        "later",
        "revised",
        "collected",
        "review",
        "publishing",
        "title",
        "untersuchungen",
        "über",
        "die",
        "französische",
        "revolution",
        "work",
        "stand",
        "one",
        "best",
        "german",
        "critique",
        "french",
        "revolution",
        "fundamental",
        "respect",
        "laid",
        "groundwork",
        "german",
        "conservatism",
        "significance",
        "immediately",
        "recognized",
        "fichte",
        "devoted",
        "much",
        "effort",
        "refutation",
        "beiträge",
        "zur",
        "berichtigung",
        "der",
        "urteile",
        "de",
        "publikums",
        "über",
        "die",
        "französische",
        "revolution",
        "rehberg",
        "revolution",
        "failed",
        "experiment",
        "idealism",
        "misguided",
        "attempt",
        "french",
        "radical",
        "recreate",
        "society",
        "state",
        "according",
        "principle",
        "reason",
        "lay",
        "fundamental",
        "fallacy",
        "behind",
        "experiment",
        "belief",
        "principle",
        "reason",
        "guideline",
        "concrete",
        "political",
        "practice",
        "blueprint",
        "reconstruct",
        "society",
        "state",
        "belief",
        "rehberg",
        "argues",
        "sanctioned",
        "frenzy",
        "destruction",
        "behind",
        "revolution",
        "eagerness",
        "abolish",
        "traditional",
        "political",
        "institution",
        "france",
        "since",
        "french",
        "radical",
        "believed",
        "principle",
        "reason",
        "mandate",
        "specific",
        "kind",
        "constitution",
        "since",
        "traditional",
        "french",
        "institution",
        "far",
        "ideal",
        "held",
        "institution",
        "contrary",
        "reason",
        "obligatory",
        "abolish",
        "chief",
        "fallacy",
        "behind",
        "revolutionary",
        "ideology",
        "therefore",
        "hyperrationalism",
        "belief",
        "reason",
        "dictate",
        "political",
        "practice",
        "hence",
        "rehberg",
        "made",
        "chief",
        "business",
        "expose",
        "fallacy",
        "many",
        "writing",
        "revolution",
        "argued",
        "emphatically",
        "repeatedly",
        "reason",
        "power",
        "although",
        "accepted",
        "pure",
        "reason",
        "determine",
        "general",
        "principle",
        "morality",
        "denied",
        "sufficient",
        "dictate",
        "political",
        "practice",
        "reason",
        "demand",
        "principle",
        "universal",
        "applying",
        "without",
        "exception",
        "everyone",
        "alike",
        "principle",
        "indifferent",
        "regarding",
        "specific",
        "form",
        "constitution",
        "determine",
        "nothing",
        "law",
        "universal",
        "specific",
        "circumstance",
        "country",
        "general",
        "principle",
        "reason",
        "consistent",
        "monarchy",
        "democracy",
        "aristocracy",
        "form",
        "government",
        "best",
        "determined",
        "experience",
        "alone",
        "seeing",
        "law",
        "greatest",
        "utility",
        "specific",
        "circumstance",
        "one",
        "rehberg",
        "s",
        "central",
        "theme",
        "gap",
        "theory",
        "practice",
        "general",
        "principle",
        "specific",
        "constitution",
        "bridged",
        "judgment",
        "judgment",
        "special",
        "faculty",
        "province",
        "statesman",
        "task",
        "determine",
        "best",
        "apply",
        "principle",
        "reason",
        "specific",
        "circumstance",
        "never",
        "confused",
        "simply",
        "reason",
        "intellectual",
        "power",
        "determining",
        "general",
        "rule",
        "kant",
        "taught",
        "first",
        "kritik",
        "judgment",
        "faculty",
        "determines",
        "application",
        "rule",
        "therefore",
        "stand",
        "rule",
        "judgment",
        "however",
        "easy",
        "task",
        "many",
        "way",
        "applying",
        "principle",
        "consequence",
        "applying",
        "weighed",
        "one",
        "another",
        "judgment",
        "faculty",
        "improves",
        "age",
        "experience",
        "sometimes",
        "requires",
        "technical",
        "expertise",
        "shortcoming",
        "french",
        "radical",
        "underestimated",
        "judgment",
        "overestimated",
        "reason",
        "assumed",
        "principle",
        "involves",
        "criterion",
        "application",
        "applied",
        "one",
        "unique",
        "way",
        "regardless",
        "circumstance",
        "recognizing",
        "role",
        "judgment",
        "politics",
        "mean",
        "rehberg",
        "another",
        "fundamental",
        "tenet",
        "revolutionary",
        "ideology",
        "collapse",
        "principle",
        "autonomy",
        "reason",
        "ie",
        "belief",
        "individual",
        "alone",
        "power",
        "right",
        "determine",
        "act",
        "state",
        "rousseau",
        "kant",
        "right",
        "claim",
        "reason",
        "inalienable",
        "individual",
        "sovereign",
        "power",
        "right",
        "ascertain",
        "general",
        "moral",
        "principle",
        "give",
        "rehberg",
        "argued",
        "power",
        "right",
        "determine",
        "apply",
        "principle",
        "specific",
        "circumstance",
        "since",
        "knowing",
        "apply",
        "principle",
        "matter",
        "judgment",
        "since",
        "judgment",
        "depends",
        "experience",
        "expertise",
        "qualified",
        "individual",
        "able",
        "determine",
        "best",
        "form",
        "constitution",
        "law",
        "country",
        "hence",
        "case",
        "individual",
        "alienate",
        "power",
        "judgment",
        "qualified",
        "rehberg",
        "s",
        "advocacy",
        "role",
        "judgment",
        "politics",
        "thus",
        "became",
        "basis",
        "defense",
        "elite",
        "rule",
        "central",
        "pillar",
        "rehberg",
        "s",
        "conservatism",
        "defense",
        "tradition",
        "basis",
        "defense",
        "critique",
        "reason",
        "since",
        "reason",
        "determine",
        "specific",
        "form",
        "constitution",
        "never",
        "lay",
        "mandate",
        "abolish",
        "established",
        "institution",
        "country",
        "permissible",
        "statesman",
        "follow",
        "tradition",
        "sometimes",
        "rehberg",
        "argued",
        "permissable",
        "also",
        "obligatory",
        "statesman",
        "respect",
        "tradition",
        "established",
        "institution",
        "country",
        "state",
        "product",
        "history",
        "people",
        "experience",
        "many",
        "generation",
        "generation",
        "lay",
        "foundation",
        "another",
        "must",
        "build",
        "forefather",
        "built",
        "grew",
        "unique",
        "circumstance",
        "country",
        "gradually",
        "adapted",
        "abolish",
        "would",
        "leave",
        "u",
        "nothing",
        "build",
        "upon",
        "make",
        "necessary",
        "create",
        "ex",
        "nihilo",
        "rehberg",
        "s",
        "defense",
        "tradition",
        "precedent",
        "went",
        "even",
        "argued",
        "many",
        "social",
        "moral",
        "obligation",
        "essentially",
        "historical",
        "arising",
        "inheritance",
        "state",
        "could",
        "persist",
        "long",
        "argued",
        "future",
        "generation",
        "take",
        "obligation",
        "past",
        "generation",
        "child",
        "assume",
        "duty",
        "parent",
        "therefore",
        "fundamental",
        "rule",
        "civil",
        "society",
        "child",
        "inherit",
        "duty",
        "responsibility",
        "parent",
        "rehberg",
        "knew",
        "somewhat",
        "harsh",
        "doctrine",
        "would",
        "mean",
        "accepting",
        "inequality",
        "birth",
        "aristocratic",
        "privilege",
        "yet",
        "insisted",
        "upon",
        "human",
        "being",
        "civil",
        "society",
        "must",
        "compelled",
        "honor",
        "parent",
        "promised",
        "began",
        "state",
        "could",
        "exist",
        "long",
        "child",
        "heir",
        "made",
        "take",
        "place",
        "deceased",
        "stood",
        "would",
        "want",
        "enter",
        "commitment",
        "uncertain",
        "death",
        "one",
        "committed",
        "party",
        "released",
        "obligation",
        "given",
        "rehberg",
        "s",
        "critique",
        "rationalism",
        "respect",
        "tradition",
        "reaction",
        "social",
        "contract",
        "doctrine",
        "surprising",
        "condemned",
        "sharpest",
        "term",
        "doctrine",
        "assumed",
        "every",
        "individual",
        "power",
        "judge",
        "political",
        "affair",
        "also",
        "seemed",
        "absolve",
        "traditional",
        "responsibility",
        "obligation",
        "social",
        "contract",
        "doctrine",
        "falsely",
        "hold",
        "argued",
        "enter",
        "society",
        "state",
        "born",
        "free",
        "natural",
        "criterion",
        "judge",
        "born",
        "society",
        "state",
        "criterion",
        "judge",
        "thing",
        "formed",
        "must",
        "give",
        "assumption",
        "insisted",
        "civil",
        "right",
        "belong",
        "people",
        "nature",
        "rank",
        "right",
        "inherited",
        "depend",
        "upon",
        "place",
        "society",
        "born",
        "rehberg",
        "saw",
        "chief",
        "inspiration",
        "french",
        "radicalism",
        "seductive",
        "paradoxical",
        "writing",
        "jean",
        "jacques",
        "rousseau",
        "rousseau",
        "first",
        "advanced",
        "principle",
        "autonomy",
        "reason",
        "made",
        "reason",
        "alone",
        "touchstone",
        "political",
        "legitimacy",
        "doctrine",
        "general",
        "meant",
        "every",
        "political",
        "principle",
        "tested",
        "light",
        "reason",
        "according",
        "ideally",
        "rational",
        "person",
        "would",
        "rehberg",
        "found",
        "irresolvable",
        "ambiguity",
        "rousseau",
        "s",
        "doctrine",
        "claimed",
        "made",
        "application",
        "political",
        "world",
        "impossible",
        "rousseau",
        "s",
        "distinction",
        "general",
        "made",
        "clear",
        "possible",
        "determine",
        "general",
        "simply",
        "people",
        "happen",
        "want",
        "general",
        "understood",
        "rousseau",
        "norm",
        "determines",
        "everyone",
        "ought",
        "possible",
        "determine",
        "everyone",
        "ought",
        "importantly",
        "determine",
        "ambiguity",
        "rosseau",
        "s",
        "doctrine",
        "made",
        "ripe",
        "exploitation",
        "jacobin",
        "ideologue",
        "felt",
        "justified",
        "forcing",
        "people",
        "free",
        "another",
        "source",
        "revolutionary",
        "ideology",
        "became",
        "special",
        "target",
        "rehberg",
        "s",
        "wrath",
        "physiocratic",
        "doctrine",
        "though",
        "doctrine",
        "often",
        "associated",
        "absolutism",
        "rehberg",
        "still",
        "saw",
        "basic",
        "influence",
        "radical",
        "thinking",
        "especially",
        "disliked",
        "took",
        "physiocrats",
        "leading",
        "principle",
        "everyone",
        "right",
        "whatever",
        "want",
        "long",
        "interfere",
        "anyone",
        "else",
        "principle",
        "laid",
        "path",
        "toward",
        "crude",
        "egoism",
        "made",
        "governing",
        "principle",
        "civil",
        "society",
        "argued",
        "people",
        "would",
        "recognize",
        "obligation",
        "leave",
        "others",
        "alone",
        "whole",
        "culture",
        "social",
        "virtue",
        "would",
        "disappear",
        "physiocratic",
        "system",
        "also",
        "lead",
        "materialism",
        "believed",
        "value",
        "everything",
        "according",
        "utility",
        "ability",
        "satisfy",
        "basic",
        "need",
        "people",
        "regard",
        "machine",
        "work",
        "eat",
        "eat",
        "work",
        "since",
        "show",
        "immediate",
        "profit",
        "point",
        "developing",
        "higher",
        "power",
        "cultivating",
        "art"
    ]
}