{
    "main_text": "Cognition and Reality: Conceptualism and the esse apparens\n4. Intuitive and Abstractive Cognition and the Limits of Human Cognitive Abilities\n\nJohn Duns Scotus, who introduced the distinction between intuitive and\nabstractive cognition, took the view that intuitive and abstractive\ncognition were distinct because they had different objects. Thus, for\nScotus, we have an abstractive cognition of an object when it is not\ndirectly present to us, on account of there being some intervening\nrepresentation; an intuitive cognition can only come about when the\nobject of cognition is existing and directly present to us. For\nScotus, then, intuitive cognition carries along with it the guarantee\nthat the object of cognition exists; not so for abstractive cognition.\n(See Tachau 1988, esp. pp. 68–81; Dumont 1989; Pini 2014.) It is\nwell known that William Ockham took exception to this view, holding\nthat we can, in certain extraordinary (i.e. supernatural) cases, have\nintuitive cognition of non-existent objects. Auriol too objects to\nScotus’ view.\n\nFor Auriol, in contrast to Scotus, intuitive cognition is possible\nwhether the object of cognition is present or absent. Likewise, an\nabstractive cognition of an object that is actually present is\npossible. The distinction between intuitive and abstractive cognition\ndoes not depend on the object at all; the very same object can be\ncognized in both an intuitive and an abstractive way. According to\nAuriol, whether we are having the one type of cognition or the other\ndepends exclusively on the characteristics of the cognition that we\nare having, how the object appears to us. Auriol says explicitly that\nintuitive and abstractive cognition are in fact simply two\nfundamentally different ways that the esse apparens created\nby the cognitive faculties can appear to us: “abstractive and\nintuitive cognition differ … for there are two modes of formal\nappearance … by which things appear objectively” (trans.\nPasnau 2002, p. 201, n. 111). In order to illustrate this, Auriol\nclaims that ocular cognition, i.e. the sense of sight, is fully\nintuitive, while imaginary cognition, i.e. cognizing something through\nthe internal sense of the imagination, is fully abstractive. This is\nthe governing metaphor in Auriol’s attempt to distinguish the\ntwo types of cognition: sight is intuitive, imagination is\nabstractive. Thus, describing sensory cognition, Auriol gives four\ntraits that together enable us to determine whether any particular\ncognition is intuitive or abstractive. First, an intuitive cognition\nis characterized by being immediate or direct, as\nwhen we see an object before us. Not so abstractive or imaginary\ncognition; it is mediate, requiring some type of discursive process.\nAuriol gives the following example: an astronomer sitting in his room\ncan predict an eclipse through calculation, and he can even imagine it\non that basis, but this is something entirely different from seeing\nthe eclipse directly. A second characteristic of ocular or intuitive\ncognition is the presentness of the object. The object of an\nintuitive cognition seems to be present (whether it actually is or\nnot), whereas the object of an abstractive cognition does not have\nthis appearance of presence. Take the astronomer again. He can imagine\nthe eclipse, but in the very act of doing so he knows that the eclipse\nis not present before him. The third and fourth characteristics that\nAuriol mentions are roughly equivalent: an intuitive cognition carries\nwith it the actualization and existence of its\nobject; not so an imaginary, abstractive cognition. The astronomer can\nimagine an eclipse, and even imagine an eclipse taking place right\nnow, but again, the very fact that he is imagining the eclipse bears\nwith it the recognition that it is not in fact actualized and\nexisting. Auriol sums up:\n\nTherefore, it is rightly said that an intuitive cognition is a direct\ncognition as opposed to a discursive one, that it is present as\nopposed to the absent mode in which the imagination reaches even\ntoward things that are present, and that it actualizes the object and\nposits its existence, since it makes the object’s real existence\nand actual position appear, even if the object does not exist. And in\ncontrast it is clear that an imaginary cognition lacks and abstracts\nfrom these four conditions. It extends to its object neither directly\nnor presently, nor by actualizing or positing existence, even if one\nimagines the object to exist and be actual and even if it is present.\n(trans. Pasnau 2002, pp. 206–07, n. 109).\n\n\n(The most complete discussion of Auriol on intuitive and abstractive\ncognition is Boehner 1949; for the background and reception of\nAuriol’s view, see particularly Tachau 1988; for a translation\ninto English of Auriol’s major text on intuitive and abstractive\ncognition, his Scriptum, Prologue (aka Prooemium), q. 2, see\nPasnau 2002, pp. 178–218.)\n\nThus, what is central to Auriol’s distinction between intuitive\nand abstractive cognition is the character of the cognition as it\nappears to us. The distinction between them is phenomenologically\ndetermined. As mentioned above, in this way Auriol rejected\nScotus’ view that intuitive cognitions are only of objects\npresent and existing. Auriol’s rejection of Scotus’\ndistinction between intuitive and abstractive cognition takes as one\nof its starting points several “experiences” that recall\nthe experiences he employed to show that the senses put the object of\nsensitive cognition into esse apparens. For example, upon\nlooking directly at the sun or any other luminous object, an\nafterimage appears; thus a vision of the sun remains in the eye even\nwhen the object itself is absent. In dreams, we can experience sights,\nsounds, and tactile sensations, in the real absence of the objects of\nsensation. Persons who are deceived by illusions often see things that\nare not really there. In all of these sensations the object appears to\nbe actually present and existing, when it is not. Auriol concludes\nthat we can have an intuitive sensory cognition of non-existent\nobjects.\n\nThat was the characterization of intuitive sensory cognition\nas opposed to abstractive cognition. What about intellectual\ncognition? Auriol makes clear that the human intellect can have\nintuitive cognition. To show this he first appeals to the Principle of\nHierarchy mentioned above: because the lower faculties, the senses,\ncan have intuitive cognition, therefore it is certain that the higher\nfaculty, intellect, can have intuitive cognition, since it is more\nnoble than the abstractive cognition that we know the intellect does\nhave. Moreover, on the basis of a famous passage from St. Paul’s\nI Corinthians (13:12 “For now we see in a mirror dimly,\nbut then face to face”), Auriol maintains that we are assured\nthat the beatific vision of God is an intuitive intellectual\ncognition.\n\nAlthough intuitive cognition is possible for an intellect,\nAuriol, in contrast to William Ockham, nevertheless denies that we\nexperience intuitive cognition in this life. Because the\nintellect of the wayfarer (viator — the person in this\nlife) is dependent upon the senses and their cognition of particulars,\nAuriol denies that we can have (or at least that we can know that we\nhave) intellectual cognition with the direct and present, ocular-like\ncognition that is characteristic of intuitive cognition. Auriol says:\n“Thus each of these cognitions should be posited within\nintellect, although we do not experience intuitive cognition in this\nlife because of its conjunction with sensory intuition” (trans.\nPasnau 2002, pp. 210–11, n. 121.) Intuitive intellectual\ncognition is reserved for the angels and for the blessed in heaven,\nunencumbered by bodily senses. All of our intellectual cognition in\nthis life is characterized by the discursivity and mediacy that is the\nmark of an abstractive cognition.\n\nAbove, it was mentioned that Auriol seems ultimately to be best\ndescribed as a reliabilist; he does not question that, given normal\nconditions, our God-given cognitive faculties work as they should and\nthat they are self-correcting. He does not seem to have been concerned\nabout possible skeptical ramifications of his theory of esse\napparens. But with this said, by denying that human beings in\nthis life have intuitive intellectual cognition, he set the stage for\nsomewhat strictly limiting human intellectual abilities in his\nphilosophy.\n\nThis last point explains some interesting features of Auriol’s\nattitude towards human knowledge. In particular, despite the fact that\nAuriol maintains that God could give a person in this life an\nabstractive cognition of the divine essence, and that this abstractive\ncognition would be able to serve as the basis for demonstrative\nknowledge of all articles of the Christian faith (Scriptum,\nPrologue, q. 2, ed. Buytaert, vol. 1, pp. 211–14; trans. Pasnau\n2002, p. 213, n. 130 and p. 214, n. 133), nevertheless Auriol often\nexhibits a noticeable pessimism when it comes to human cognitive\nabilities. Thus, Auriol argues at length that in this life we are\nunable to decide such issues as whether the universe is eternal or\ncreated in time. (We know, of course, through Scripture that the world\nis not eternal, but we could never decisively prove this by means of\nunaided human reason.) Auriol argues that this is the case because we\ndo not have direct intellectual cognition of, e.g., temporal instants;\nsuch cognition would allow us to resolve this problem. (See esp.\nNielsen 1996, esp. pp. 223–26, 232–35, 239–41; see\nalso Nielsen 1999.) Here we see that Auriol’s rejection of\nintuitive intellectual cognition in this life lies at the heart of a\nsomewhat pessimistic view of the reach of human reason: we do not have\ndirect intuitive knowledge of the world (much less of God), only\nindirect abstractive knowledge, and this places fairly strict\nlimitations on just what our intellect can achieve unaided. The\ndisembodied soul of the blessed, having direct intuitive intellectual\ncognition, will fare much better.\n\nAuriol’s theory of human intellectual cognition of singulars\nalso shows the influence of his rejection of intuitive intellectual\ncognition in this life. Auriol is explicit that universal concepts\n(formed through the Aristotelian process of abstraction) always appear\nto us as abstractive cognitions, since what is universal abstracts\nfrom any presentness and directness of the object of cognition (see\ne.g. Scriptum, Prologue, q. 2, ed. Buytaert, p. 206, n. 111,\nl. 87, Pasnau 2002, p. 207; cf. Friedman 1997, pp. 310–14).\nThere were, however, a number of members of the Franciscan order,\nincluding John Duns Scotus, who was sometimes understood by\ncontemporaries to have claimed that singulars could be cognized as\nsingular by the intellect. (On this aspect of Scotus thought see,\ne.g., Boler 1982, esp. Pini 2008.) Auriol rejects this Franciscan\ntradition; because true intuitive intellectual cognition is barred to\nus in this lifetime, we can have no direct intellectual cognition of\nsingulars at all. Auriol maintains in his theory of intellectual\ncognition of singulars that we only form concepts of singulars through\nthe mediation of the senses and by means of a discursive process. (By\nrecognizing that the senses are now sensing a singular, the intellect\ncan reason that a singular must now exist and be present, but we have\nno direct intellectual knowledge or concept of any singular.) Auriol\nexplicitly claims, however, that angels and the blessed, lacking\nbodies and bodily senses, would have direct intellectual cognition of\nsingulars, just as God does by seeing his own essence. (On\nAuriol’s theory, see Friedman 2000.) A mild pessimism about\nhuman cognitive abilities is thus systemic in Auriol’s thought,\nand has its most clear expression in his claim that we do not\nexperience intuitive intellectual cognition in this life.\n",
    "section_title": "4. Intuitive and Abstractive Cognition and the Limits of Human Cognitive Abilities",
    "entry_title": "Peter Auriol",
    "hierarchy_title": "Peter Auriol || Cognition and Reality: Conceptualism and the esse apparens",
    "tokenized_text": [
        "cognition",
        "reality",
        "conceptualism",
        "esse",
        "apparens",
        "intuitive",
        "abstractive",
        "cognition",
        "limit",
        "human",
        "cognitive",
        "ability",
        "john",
        "dun",
        "scotus",
        "introduced",
        "distinction",
        "intuitive",
        "abstractive",
        "cognition",
        "took",
        "view",
        "intuitive",
        "abstractive",
        "cognition",
        "distinct",
        "different",
        "object",
        "thus",
        "scotus",
        "abstractive",
        "cognition",
        "object",
        "directly",
        "present",
        "u",
        "account",
        "intervening",
        "representation",
        "intuitive",
        "cognition",
        "come",
        "object",
        "cognition",
        "existing",
        "directly",
        "present",
        "u",
        "scotus",
        "intuitive",
        "cognition",
        "carry",
        "along",
        "guarantee",
        "object",
        "cognition",
        "exists",
        "abstractive",
        "cognition",
        "see",
        "tachau",
        "esp",
        "pp",
        "dumont",
        "pini",
        "well",
        "known",
        "william",
        "ockham",
        "took",
        "exception",
        "view",
        "holding",
        "certain",
        "extraordinary",
        "ie",
        "supernatural",
        "case",
        "intuitive",
        "cognition",
        "nonexistent",
        "object",
        "auriol",
        "object",
        "scotus",
        "view",
        "auriol",
        "contrast",
        "scotus",
        "intuitive",
        "cognition",
        "possible",
        "whether",
        "object",
        "cognition",
        "present",
        "absent",
        "likewise",
        "abstractive",
        "cognition",
        "object",
        "actually",
        "present",
        "possible",
        "distinction",
        "intuitive",
        "abstractive",
        "cognition",
        "depend",
        "object",
        "object",
        "cognized",
        "intuitive",
        "abstractive",
        "way",
        "according",
        "auriol",
        "whether",
        "one",
        "type",
        "cognition",
        "depends",
        "exclusively",
        "characteristic",
        "cognition",
        "object",
        "appears",
        "u",
        "auriol",
        "say",
        "explicitly",
        "intuitive",
        "abstractive",
        "cognition",
        "fact",
        "simply",
        "two",
        "fundamentally",
        "different",
        "way",
        "esse",
        "apparens",
        "created",
        "cognitive",
        "faculty",
        "appear",
        "u",
        "abstractive",
        "intuitive",
        "cognition",
        "differ",
        "two",
        "mode",
        "formal",
        "appearance",
        "thing",
        "appear",
        "objectively",
        "trans",
        "pasnau",
        "p",
        "n",
        "order",
        "illustrate",
        "auriol",
        "claim",
        "ocular",
        "cognition",
        "ie",
        "sense",
        "sight",
        "fully",
        "intuitive",
        "imaginary",
        "cognition",
        "ie",
        "cognizing",
        "something",
        "internal",
        "sense",
        "imagination",
        "fully",
        "abstractive",
        "governing",
        "metaphor",
        "auriol",
        "attempt",
        "distinguish",
        "two",
        "type",
        "cognition",
        "sight",
        "intuitive",
        "imagination",
        "abstractive",
        "thus",
        "describing",
        "sensory",
        "cognition",
        "auriol",
        "give",
        "four",
        "trait",
        "together",
        "enable",
        "u",
        "determine",
        "whether",
        "particular",
        "cognition",
        "intuitive",
        "abstractive",
        "first",
        "intuitive",
        "cognition",
        "characterized",
        "immediate",
        "direct",
        "see",
        "object",
        "u",
        "abstractive",
        "imaginary",
        "cognition",
        "mediate",
        "requiring",
        "type",
        "discursive",
        "process",
        "auriol",
        "give",
        "following",
        "example",
        "astronomer",
        "sitting",
        "room",
        "predict",
        "eclipse",
        "calculation",
        "even",
        "imagine",
        "basis",
        "something",
        "entirely",
        "different",
        "seeing",
        "eclipse",
        "directly",
        "second",
        "characteristic",
        "ocular",
        "intuitive",
        "cognition",
        "presentness",
        "object",
        "object",
        "intuitive",
        "cognition",
        "seems",
        "present",
        "whether",
        "actually",
        "whereas",
        "object",
        "abstractive",
        "cognition",
        "appearance",
        "presence",
        "take",
        "astronomer",
        "imagine",
        "eclipse",
        "act",
        "know",
        "eclipse",
        "present",
        "third",
        "fourth",
        "characteristic",
        "auriol",
        "mention",
        "roughly",
        "equivalent",
        "intuitive",
        "cognition",
        "carry",
        "actualization",
        "existence",
        "object",
        "imaginary",
        "abstractive",
        "cognition",
        "astronomer",
        "imagine",
        "eclipse",
        "even",
        "imagine",
        "eclipse",
        "taking",
        "place",
        "right",
        "fact",
        "imagining",
        "eclipse",
        "bear",
        "recognition",
        "fact",
        "actualized",
        "existing",
        "auriol",
        "sum",
        "therefore",
        "rightly",
        "said",
        "intuitive",
        "cognition",
        "direct",
        "cognition",
        "opposed",
        "discursive",
        "one",
        "present",
        "opposed",
        "absent",
        "mode",
        "imagination",
        "reach",
        "even",
        "toward",
        "thing",
        "present",
        "actualizes",
        "object",
        "posit",
        "existence",
        "since",
        "make",
        "object",
        "real",
        "existence",
        "actual",
        "position",
        "appear",
        "even",
        "object",
        "exist",
        "contrast",
        "clear",
        "imaginary",
        "cognition",
        "lack",
        "abstract",
        "four",
        "condition",
        "extends",
        "object",
        "neither",
        "directly",
        "presently",
        "actualizing",
        "positing",
        "existence",
        "even",
        "one",
        "imago",
        "object",
        "exist",
        "actual",
        "even",
        "present",
        "trans",
        "pasnau",
        "pp",
        "n",
        "complete",
        "discussion",
        "auriol",
        "intuitive",
        "abstractive",
        "cognition",
        "boehner",
        "background",
        "reception",
        "auriol",
        "view",
        "see",
        "particularly",
        "tachau",
        "translation",
        "english",
        "auriol",
        "major",
        "text",
        "intuitive",
        "abstractive",
        "cognition",
        "scriptum",
        "prologue",
        "aka",
        "prooemium",
        "q",
        "see",
        "pasnau",
        "pp",
        "thus",
        "central",
        "auriol",
        "distinction",
        "intuitive",
        "abstractive",
        "cognition",
        "character",
        "cognition",
        "appears",
        "u",
        "distinction",
        "phenomenologically",
        "determined",
        "mentioned",
        "way",
        "auriol",
        "rejected",
        "scotus",
        "view",
        "intuitive",
        "cognition",
        "object",
        "present",
        "existing",
        "auriol",
        "rejection",
        "scotus",
        "distinction",
        "intuitive",
        "abstractive",
        "cognition",
        "take",
        "one",
        "starting",
        "point",
        "several",
        "experience",
        "recall",
        "experience",
        "employed",
        "show",
        "sens",
        "put",
        "object",
        "sensitive",
        "cognition",
        "esse",
        "apparens",
        "example",
        "upon",
        "looking",
        "directly",
        "sun",
        "luminous",
        "object",
        "afterimage",
        "appears",
        "thus",
        "vision",
        "sun",
        "remains",
        "eye",
        "even",
        "object",
        "absent",
        "dream",
        "experience",
        "sight",
        "sound",
        "tactile",
        "sensation",
        "real",
        "absence",
        "object",
        "sensation",
        "person",
        "deceived",
        "illusion",
        "often",
        "see",
        "thing",
        "really",
        "sensation",
        "object",
        "appears",
        "actually",
        "present",
        "existing",
        "auriol",
        "concludes",
        "intuitive",
        "sensory",
        "cognition",
        "nonexistent",
        "object",
        "characterization",
        "intuitive",
        "sensory",
        "cognition",
        "opposed",
        "abstractive",
        "cognition",
        "intellectual",
        "cognition",
        "auriol",
        "make",
        "clear",
        "human",
        "intellect",
        "intuitive",
        "cognition",
        "show",
        "first",
        "appeal",
        "principle",
        "hierarchy",
        "mentioned",
        "lower",
        "faculty",
        "sens",
        "intuitive",
        "cognition",
        "therefore",
        "certain",
        "higher",
        "faculty",
        "intellect",
        "intuitive",
        "cognition",
        "since",
        "noble",
        "abstractive",
        "cognition",
        "know",
        "intellect",
        "moreover",
        "basis",
        "famous",
        "passage",
        "st",
        "paul",
        "corinthian",
        "see",
        "mirror",
        "dimly",
        "face",
        "face",
        "auriol",
        "maintains",
        "assured",
        "beatific",
        "vision",
        "god",
        "intuitive",
        "intellectual",
        "cognition",
        "although",
        "intuitive",
        "cognition",
        "possible",
        "intellect",
        "auriol",
        "contrast",
        "william",
        "ockham",
        "nevertheless",
        "denies",
        "experience",
        "intuitive",
        "cognition",
        "life",
        "intellect",
        "wayfarer",
        "viator",
        "person",
        "life",
        "dependent",
        "upon",
        "sens",
        "cognition",
        "particular",
        "auriol",
        "denies",
        "least",
        "know",
        "intellectual",
        "cognition",
        "direct",
        "present",
        "ocularlike",
        "cognition",
        "characteristic",
        "intuitive",
        "cognition",
        "auriol",
        "say",
        "thus",
        "cognition",
        "posited",
        "within",
        "intellect",
        "although",
        "experience",
        "intuitive",
        "cognition",
        "life",
        "conjunction",
        "sensory",
        "intuition",
        "trans",
        "pasnau",
        "pp",
        "n",
        "intuitive",
        "intellectual",
        "cognition",
        "reserved",
        "angel",
        "blessed",
        "heaven",
        "unencumbered",
        "bodily",
        "sens",
        "intellectual",
        "cognition",
        "life",
        "characterized",
        "discursivity",
        "mediacy",
        "mark",
        "abstractive",
        "cognition",
        "mentioned",
        "auriol",
        "seems",
        "ultimately",
        "best",
        "described",
        "reliabilist",
        "question",
        "given",
        "normal",
        "condition",
        "godgiven",
        "cognitive",
        "faculty",
        "work",
        "selfcorrecting",
        "seem",
        "concerned",
        "possible",
        "skeptical",
        "ramification",
        "theory",
        "esse",
        "apparens",
        "said",
        "denying",
        "human",
        "being",
        "life",
        "intuitive",
        "intellectual",
        "cognition",
        "set",
        "stage",
        "somewhat",
        "strictly",
        "limiting",
        "human",
        "intellectual",
        "ability",
        "philosophy",
        "last",
        "point",
        "explains",
        "interesting",
        "feature",
        "auriol",
        "attitude",
        "towards",
        "human",
        "knowledge",
        "particular",
        "despite",
        "fact",
        "auriol",
        "maintains",
        "god",
        "could",
        "give",
        "person",
        "life",
        "abstractive",
        "cognition",
        "divine",
        "essence",
        "abstractive",
        "cognition",
        "would",
        "able",
        "serve",
        "basis",
        "demonstrative",
        "knowledge",
        "article",
        "christian",
        "faith",
        "scriptum",
        "prologue",
        "q",
        "ed",
        "buytaert",
        "vol",
        "pp",
        "trans",
        "pasnau",
        "p",
        "n",
        "p",
        "n",
        "nevertheless",
        "auriol",
        "often",
        "exhibit",
        "noticeable",
        "pessimism",
        "come",
        "human",
        "cognitive",
        "ability",
        "thus",
        "auriol",
        "argues",
        "length",
        "life",
        "unable",
        "decide",
        "issue",
        "whether",
        "universe",
        "eternal",
        "created",
        "time",
        "know",
        "course",
        "scripture",
        "world",
        "eternal",
        "could",
        "never",
        "decisively",
        "prove",
        "mean",
        "unaided",
        "human",
        "reason",
        "auriol",
        "argues",
        "case",
        "direct",
        "intellectual",
        "cognition",
        "eg",
        "temporal",
        "instant",
        "cognition",
        "would",
        "allow",
        "u",
        "resolve",
        "problem",
        "see",
        "esp",
        "nielsen",
        "esp",
        "pp",
        "see",
        "also",
        "nielsen",
        "see",
        "auriol",
        "rejection",
        "intuitive",
        "intellectual",
        "cognition",
        "life",
        "lie",
        "heart",
        "somewhat",
        "pessimistic",
        "view",
        "reach",
        "human",
        "reason",
        "direct",
        "intuitive",
        "knowledge",
        "world",
        "much",
        "le",
        "god",
        "indirect",
        "abstractive",
        "knowledge",
        "place",
        "fairly",
        "strict",
        "limitation",
        "intellect",
        "achieve",
        "unaided",
        "disembodied",
        "soul",
        "blessed",
        "direct",
        "intuitive",
        "intellectual",
        "cognition",
        "fare",
        "much",
        "better",
        "auriol",
        "theory",
        "human",
        "intellectual",
        "cognition",
        "singular",
        "also",
        "show",
        "influence",
        "rejection",
        "intuitive",
        "intellectual",
        "cognition",
        "life",
        "auriol",
        "explicit",
        "universal",
        "concept",
        "formed",
        "aristotelian",
        "process",
        "abstraction",
        "always",
        "appear",
        "u",
        "abstractive",
        "cognition",
        "since",
        "universal",
        "abstract",
        "presentness",
        "directness",
        "object",
        "cognition",
        "see",
        "eg",
        "scriptum",
        "prologue",
        "q",
        "ed",
        "buytaert",
        "p",
        "n",
        "l",
        "pasnau",
        "p",
        "cf",
        "friedman",
        "pp",
        "however",
        "number",
        "member",
        "franciscan",
        "order",
        "including",
        "john",
        "dun",
        "scotus",
        "sometimes",
        "understood",
        "contemporary",
        "claimed",
        "singular",
        "could",
        "cognized",
        "singular",
        "intellect",
        "aspect",
        "scotus",
        "thought",
        "see",
        "eg",
        "boler",
        "esp",
        "pini",
        "auriol",
        "reject",
        "franciscan",
        "tradition",
        "true",
        "intuitive",
        "intellectual",
        "cognition",
        "barred",
        "u",
        "lifetime",
        "direct",
        "intellectual",
        "cognition",
        "singular",
        "auriol",
        "maintains",
        "theory",
        "intellectual",
        "cognition",
        "singular",
        "form",
        "concept",
        "singular",
        "mediation",
        "sens",
        "mean",
        "discursive",
        "process",
        "recognizing",
        "sens",
        "sensing",
        "singular",
        "intellect",
        "reason",
        "singular",
        "must",
        "exist",
        "present",
        "direct",
        "intellectual",
        "knowledge",
        "concept",
        "singular",
        "auriol",
        "explicitly",
        "claim",
        "however",
        "angel",
        "blessed",
        "lacking",
        "body",
        "bodily",
        "sens",
        "would",
        "direct",
        "intellectual",
        "cognition",
        "singular",
        "god",
        "seeing",
        "essence",
        "auriol",
        "theory",
        "see",
        "friedman",
        "mild",
        "pessimism",
        "human",
        "cognitive",
        "ability",
        "thus",
        "systemic",
        "auriol",
        "thought",
        "clear",
        "expression",
        "claim",
        "experience",
        "intuitive",
        "intellectual",
        "cognition",
        "life"
    ]
}