{
    "main_text": "Biographical Sketch\n1. Biographical Sketch\n\n\nAlfred Jules Ayer was born in London on October 29, 1910. His mother,\nReine, was descended from Dutch Jews, whilst his father, Jules Louis\nCypress Ayer, came from a Swiss Calvinist background. As recounted in\nRogers 1999, Ayer was a precocious but mischievous child, and so was\nsent to boarding school (outside Eastbourne) at the age of seven, from\nwhich he won a scholarship to Eton in 1923. There he impressed his\npeers with his intelligence and competitiveness, the latter trait\nmanifesting itself in the way he played games. Ayer nevertheless felt\nan ‘outsider’, and it is clear that his fellow-students\ndid not warm to him, perhaps due to the excessive zeal with which he\nattempted to convert them to atheism.  Feeling ‘an\noutsider’ was something that remained with him all his life. At\nthe age of sixteen he specialized in classics and at the same time\nstarted reading some philosophy. Bertrand Russell’s\nSceptical Essays made an impression, particularly Russell’s\nargument for the claim that it is undesirable to believe a proposition\nwhen there is no ground for believing its truth.  Ayer said that this\nremained a motto for him throughout his philosophical career (see\nRogers 1999, 45). At the same time a reading of G.E. Moore’s Principia\nEthica also had a lasting effect, particularly Moore’s\narticulation of the Naturalistic Fallacy.\n\n\nThe Easter before leaving Eton, Ayer spent some time in Paris, where he\nmet Renee Lees, whom he subsequently married (in 1933). The following\nyear (1929) he won a classics scholarship to Christ Church, Oxford,\nwhere he studied both Greek and philosophy, one of his tutors being\nGilbert Ryle. It was Ryle who suggested that Ayer read Ludwig Wittgenstein’s\nTractatus Logico-Philosophicus, a work that immediately\nimpressed him. Ryle was also instrumental in getting Ayer to go to\nVienna in 1933 to study with Moritz Schlick, then leader of the\ninfluential Vienna Circle of philosophers, scientists and other\nintellectuals, joining W. V. O. Quine in being one of only two\nvisitors to be members of the Vienna Circle. His philosophical\nexperience in Vienna was somewhat limited by his uncertain knowledge\nof German, but he knew enough to pick up the basic tenets of logical\npositivism.\n\n\nAfter leaving Vienna, Ayer lectured for a short time at Christ Church,\nwhere in 1935 he was elected to a five-year research fellowship. In\nthe same year he finished LTL, which caused a great deal of\ncontroversy and debate, partly for its sweeping dismissal of\nmetaphysics, but especially for the metaethical emotivism Ayer\nchampioned in one of its most notorious chapters. During the next few\nyears, Ayer worked at defending and refining some of the positions\nadopted in LTL, not least at meetings in Oxford with Isaiah\nBerlin, Stuart Hampshire, and J.L.  Austin; the confrontations with\nAustin were to prove long-lasting. The product of this refining\nprocess was the book Foundations of Empirical Knowledge.\nDuring this time he also enjoyed life to the full; he was a good\ndancer, once confessing that he would have preferred to be a\ntap-dancer rather than a professional philosopher, but had given up on\nthe idea when he recognized that he would never be as good as Fred\nAstaire. His marriage to Renee started to disintegrate; Ayer had\nnumerous affairs, and Renee formed an enduring relationship with\nStuart Hampshire.\n\n\nIn the immediate pre-war years, Ayer had become passionate about\npolitics. He supported the Republican side in Spain, flirted with\njoining the Communist Party, but instead became an active member of\nthe Labour Party. When war was declared he joined the Welsh Guards\n(and was helped to do so by Gilbert Ryle). He worked for a while in\nCambridge interrogating prisoners, then was sent to America to join a\nsecret service mission, one which seemed to involve gathering\ninformation about Fascist sympathizers in America. Whilst in New York\nhe reviewed films for the Nation, fathered a daughter (Sheila\nGraham was the mother), and made a record with Lauren Bacall. On being\nrepatriated to England, Ayer found himself given the job of helping\nwith the organization of the French resistance movements in\nLondon. Shortly after the war he was posted to Paris, where he took\nthe opportunity to study French existentialism, writing articles on\nSartre and Camus in Horizon.\n\n\nOn his release from Army service Ayer accepted the offer of a tutorial\nfellowship at Wadham College, Oxford, but was there only a short while\nbefore becoming the Grote Professor of Philosophy at University\nCollege, London, at the age of 36. He quickly appointed Hampshire to a\nlectureship (making up for having cited Hampshire as co-respondent in\nhis divorce from Renee), then Richard Wollheim. The department grew\nand became a thriving philosophical center.  Ayer also ventured into\nthe world of radio, being involved in many BBC Third Programme\nbroadcasts, including panel discussions with the scientists Zuckerman,\nHuxley and Medawar, and a famous debate with the Jesuit priest\nFrederick Copleston on the existence of God. Later he became a regular\nperformer on BBC television’s “The Brains Trust”. In\n1948 he lectured at Bard College in New York, but it proved to be an\nunhappy experience. Back in London C.E.M. Joad had published an\narticle in the\nNew Statesman arguing that LTL was responsible for\ncreating an environment in which Fascism flourished, and Time\nmagazine published an unflattering short article claiming that Ayer\ntaught his students that “That man is good to support his\nmother” was a meaningless statement (Rogers 1999,\np. 232). On his return to Europe he started a hectic schedule of\nlecture tours, visiting France, Belgium, Italy, Sweden, Denmark, Peru,\nChile, Uruguay, and Brazil, all in the early 1950s.\n\n\nIn 1958 Ayer took the opportunity to return to Oxford as Wykeham\nProfessor of Logic. He later said that this decision was made in order\nto combat the growing influence of Austin, who had made a point of\nattacking Ayer’s views on perception. Austin was, however, soon\nto die, making Ayer’s ‘sacrifice’ of his life in\nLondon somewhat pointless. Not that it was completely sacrificed; he\nbi-located, spending long weekends in London with his second wife, Dee\nWells, and at most three nights in New College during the week. He\ncontinued to travel widely: China, Russia, India, and Pakistan were\nadded to the itinerary. He also continued his political activity,\ncontinuing to support the Labour Party, campaigning against British\ninvolvement in Vietnam, and being at one time Vice-President of the\nSociety for the Reform of the Abortion Law, Chairman of the Campaign\nAgainst Racial Discrimination in Sport, and President of the\nHomosexual Law Reform Society. His support for the decriminalization\nof homosexual behavior, he once quipped, could not be thought by\nanyone acquainted with him to involve a vested interest. Ayer’s\nsupport for the Labour Party came to an end with the formation of the\nSocial Democratic Party in 1981. His support for the SDP was a protest\nat the leftward trend of the Labour Party, and particularly its\nanti-Europeanism.\n\n\nThe arrangement of spending long weekends in London and some of the\nworking week in Oxford added to Ayer’s turbulent domestic\nlife. In 1963 he and Dee Wells had a son, Nicholas, of whom Ayer said,\n“My love for this child has been a dominating factor in the\nremainder of my life” (Rogers 1999, 278.) He formed a relationship\nwith Vanessa Lawson, whom he would see whilst in Oxford. During this\ntime, Ayer continued to be philosophically productive,\ndoing some of his most original work. The Origins of\nPragmatism was published in 1968, following this Russell and\nMoore: the Analytical Heritage (the product of the William James\nlectures he delivered at Harvard in 1970), and Probability and\nEvidence (the Dewey lectures delivered at Columbia University in\n1970). Shortly thereafter came Russell, a small paperback,\nand The Central Questions of Philosophy (1973, originally\ngiven as the Gifford Lectures at the University of St. Andrews), in\nwhich he elaborated on the sophisticated realism first put forward in\nThe Origins of Pragmatism. He visited Canada on a couple of\noccasions, giving the Gilbert Ryle lectures at Trent University (1979)\nresulting in his book on Hume, and the Whidden lectures at McMaster\n(1983) giving rise to Freedom and Morality.\n\n\nShortly after being divorced from Dee Wells, Ayer married Vanessa\nLawson in 1982. Shortly before that Renee, his first wife, had died\n(1980), followed by Valerie, their daughter, who died suddenly of\nHodgkin’s disease in 1981. Tragically Vanessa was to die of liver\ncancer in 1985, leaving Ayer grief-stricken. He himself had a close\nencounter with death, being ‘technically’ dead for a few\nminutes after choking on a piece of smoked salmon. On reviving he\nreported his experience whilst ‘dead’ in such a way as to\nprovide fodder for those who thought the famous atheist had recanted\nand found God. He moved quickly to dispel these rumours. By this time\nhe had become something of a philosophical Grand Old Man, with volumes\npublished in his honour, and a full-length critical study by John\nFoster in the prestigious Routledge “arguments of the\nphilosophers” series. He spent most of the remaining couple of\nyears responding to articles that were to appear in the Ayer volume in\nthe Library of Living Philosophers series, edited by L.E. Hahn. He\nremarried Dee Wells, but not long afterwards Ayer was admitted to\nhospital with a collapsed lung in the early summer of 1989 and died on the\n27th, June.\n\n\nAyer wrote two autobiographies, Part of My Life, and More\nof My Life. His circle of friends included many famous and\ninfluential people; the following (in no particular order) is only a\nbrief list. Cyril Connolly, Graham Greene, George Orwell, ee cummings\nand his wife Marianne, Meyer Schapiro, Arthur Koestler, Bertrand\nRussell, Stephen Spender, W.H. Auden, Philip Toynbee, Isaiah Berlin,\nHugh Gaitskell, Roy Jenkins, Michael Foot, Richard Crossman, Jonathan\nMiller, Angus Wilson, Alan Bennett, Alice Thomas Ellis, Joan Fontaine,\nIris Murdoch, V.S. Pritchett, and Christopher Hitchens. He believed,\nmaybe truly, that the character of George Moore in Tom\nStoppard’s play Jumpers was modeled on him. Ayer was a\nvain man whose vanity was part of his considerable charm. He made a\ndistinction between vanity and egotism; an egotist, he said, thought\nhe should have more medals, whilst a vain person just enjoyed showing\noff the medals he had. Among the many ‘medals’ given to\nAyer were his knighthood, Fellow of the British Academy, honorary\nmember of the American Academy of Arts and Sciences, Member of the\nBulgarian Order of Cyril and Methodius, 1st class, and\nChevalier of the Légion d’honneur.\n",
    "section_title": "1. Biographical Sketch",
    "entry_title": "Alfred Jules Ayer",
    "hierarchy_title": "Alfred Jules Ayer || Biographical Sketch",
    "tokenized_text": [
        "biographical",
        "sketch",
        "biographical",
        "sketch",
        "alfred",
        "jules",
        "ayer",
        "born",
        "london",
        "october",
        "mother",
        "reine",
        "descended",
        "dutch",
        "jew",
        "whilst",
        "father",
        "jules",
        "louis",
        "cypress",
        "ayer",
        "came",
        "swiss",
        "calvinist",
        "background",
        "recounted",
        "rogers",
        "ayer",
        "precocious",
        "mischievous",
        "child",
        "sent",
        "boarding",
        "school",
        "outside",
        "eastbourne",
        "age",
        "seven",
        "scholarship",
        "eton",
        "impressed",
        "peer",
        "intelligence",
        "competitiveness",
        "latter",
        "trait",
        "manifesting",
        "way",
        "played",
        "game",
        "ayer",
        "nevertheless",
        "felt",
        "outsider",
        "clear",
        "fellowstudents",
        "warm",
        "perhaps",
        "due",
        "excessive",
        "zeal",
        "attempted",
        "convert",
        "atheism",
        "feeling",
        "outsider",
        "something",
        "remained",
        "life",
        "age",
        "sixteen",
        "specialized",
        "classic",
        "time",
        "started",
        "reading",
        "philosophy",
        "bertrand",
        "russell",
        "sceptical",
        "essay",
        "made",
        "impression",
        "particularly",
        "russell",
        "argument",
        "claim",
        "undesirable",
        "believe",
        "proposition",
        "ground",
        "believing",
        "truth",
        "ayer",
        "said",
        "remained",
        "motto",
        "throughout",
        "philosophical",
        "career",
        "see",
        "rogers",
        "time",
        "reading",
        "ge",
        "moore",
        "principia",
        "ethica",
        "also",
        "lasting",
        "effect",
        "particularly",
        "moore",
        "articulation",
        "naturalistic",
        "fallacy",
        "easter",
        "leaving",
        "eton",
        "ayer",
        "spent",
        "time",
        "paris",
        "met",
        "renee",
        "lee",
        "subsequently",
        "married",
        "following",
        "year",
        "classic",
        "scholarship",
        "christ",
        "church",
        "oxford",
        "studied",
        "greek",
        "philosophy",
        "one",
        "tutor",
        "gilbert",
        "ryle",
        "ryle",
        "suggested",
        "ayer",
        "read",
        "ludwig",
        "wittgenstein",
        "tractatus",
        "logicophilosophicus",
        "work",
        "immediately",
        "impressed",
        "ryle",
        "also",
        "instrumental",
        "getting",
        "ayer",
        "go",
        "vienna",
        "study",
        "moritz",
        "schlick",
        "leader",
        "influential",
        "vienna",
        "circle",
        "philosopher",
        "scientist",
        "intellectual",
        "joining",
        "w",
        "v",
        "o",
        "quine",
        "one",
        "two",
        "visitor",
        "member",
        "vienna",
        "circle",
        "philosophical",
        "experience",
        "vienna",
        "somewhat",
        "limited",
        "uncertain",
        "knowledge",
        "german",
        "knew",
        "enough",
        "pick",
        "basic",
        "tenet",
        "logical",
        "positivism",
        "leaving",
        "vienna",
        "ayer",
        "lectured",
        "short",
        "time",
        "christ",
        "church",
        "elected",
        "fiveyear",
        "research",
        "fellowship",
        "year",
        "finished",
        "ltl",
        "caused",
        "great",
        "deal",
        "controversy",
        "debate",
        "partly",
        "sweeping",
        "dismissal",
        "metaphysics",
        "especially",
        "metaethical",
        "emotivism",
        "ayer",
        "championed",
        "one",
        "notorious",
        "chapter",
        "next",
        "year",
        "ayer",
        "worked",
        "defending",
        "refining",
        "position",
        "adopted",
        "ltl",
        "least",
        "meeting",
        "oxford",
        "isaiah",
        "berlin",
        "stuart",
        "hampshire",
        "jl",
        "austin",
        "confrontation",
        "austin",
        "prove",
        "longlasting",
        "product",
        "refining",
        "process",
        "book",
        "foundation",
        "empirical",
        "knowledge",
        "time",
        "also",
        "enjoyed",
        "life",
        "full",
        "good",
        "dancer",
        "confessing",
        "would",
        "preferred",
        "tapdancer",
        "rather",
        "professional",
        "philosopher",
        "given",
        "idea",
        "recognized",
        "would",
        "never",
        "good",
        "fred",
        "astaire",
        "marriage",
        "renee",
        "started",
        "disintegrate",
        "ayer",
        "numerous",
        "affair",
        "renee",
        "formed",
        "enduring",
        "relationship",
        "stuart",
        "hampshire",
        "immediate",
        "prewar",
        "year",
        "ayer",
        "become",
        "passionate",
        "politics",
        "supported",
        "republican",
        "side",
        "spain",
        "flirted",
        "joining",
        "communist",
        "party",
        "instead",
        "became",
        "active",
        "member",
        "labour",
        "party",
        "war",
        "declared",
        "joined",
        "welsh",
        "guard",
        "helped",
        "gilbert",
        "ryle",
        "worked",
        "cambridge",
        "interrogating",
        "prisoner",
        "sent",
        "america",
        "join",
        "secret",
        "service",
        "mission",
        "one",
        "seemed",
        "involve",
        "gathering",
        "information",
        "fascist",
        "sympathizer",
        "america",
        "whilst",
        "new",
        "york",
        "reviewed",
        "film",
        "nation",
        "fathered",
        "daughter",
        "sheila",
        "graham",
        "mother",
        "made",
        "record",
        "lauren",
        "bacall",
        "repatriated",
        "england",
        "ayer",
        "found",
        "given",
        "job",
        "helping",
        "organization",
        "french",
        "resistance",
        "movement",
        "london",
        "shortly",
        "war",
        "posted",
        "paris",
        "took",
        "opportunity",
        "study",
        "french",
        "existentialism",
        "writing",
        "article",
        "sartre",
        "camus",
        "horizon",
        "release",
        "army",
        "service",
        "ayer",
        "accepted",
        "offer",
        "tutorial",
        "fellowship",
        "wadham",
        "college",
        "oxford",
        "short",
        "becoming",
        "grote",
        "professor",
        "philosophy",
        "university",
        "college",
        "london",
        "age",
        "quickly",
        "appointed",
        "hampshire",
        "lectureship",
        "making",
        "cited",
        "hampshire",
        "corespondent",
        "divorce",
        "renee",
        "richard",
        "wollheim",
        "department",
        "grew",
        "became",
        "thriving",
        "philosophical",
        "center",
        "ayer",
        "also",
        "ventured",
        "world",
        "radio",
        "involved",
        "many",
        "bbc",
        "third",
        "programme",
        "broadcast",
        "including",
        "panel",
        "discussion",
        "scientist",
        "zuckerman",
        "huxley",
        "medawar",
        "famous",
        "debate",
        "jesuit",
        "priest",
        "frederick",
        "copleston",
        "existence",
        "god",
        "later",
        "became",
        "regular",
        "performer",
        "bbc",
        "television",
        "brain",
        "trust",
        "lectured",
        "bard",
        "college",
        "new",
        "york",
        "proved",
        "unhappy",
        "experience",
        "back",
        "london",
        "cem",
        "joad",
        "published",
        "article",
        "new",
        "statesman",
        "arguing",
        "ltl",
        "responsible",
        "creating",
        "environment",
        "fascism",
        "flourished",
        "time",
        "magazine",
        "published",
        "unflattering",
        "short",
        "article",
        "claiming",
        "ayer",
        "taught",
        "student",
        "man",
        "good",
        "support",
        "mother",
        "meaningless",
        "statement",
        "rogers",
        "p",
        "return",
        "europe",
        "started",
        "hectic",
        "schedule",
        "lecture",
        "tour",
        "visiting",
        "france",
        "belgium",
        "italy",
        "sweden",
        "denmark",
        "peru",
        "chile",
        "uruguay",
        "brazil",
        "early",
        "s",
        "ayer",
        "took",
        "opportunity",
        "return",
        "oxford",
        "wykeham",
        "professor",
        "logic",
        "later",
        "said",
        "decision",
        "made",
        "order",
        "combat",
        "growing",
        "influence",
        "austin",
        "made",
        "point",
        "attacking",
        "ayer",
        "view",
        "perception",
        "austin",
        "however",
        "soon",
        "die",
        "making",
        "ayer",
        "sacrifice",
        "life",
        "london",
        "somewhat",
        "pointless",
        "completely",
        "sacrificed",
        "bilocated",
        "spending",
        "long",
        "weekend",
        "london",
        "second",
        "wife",
        "dee",
        "well",
        "three",
        "night",
        "new",
        "college",
        "week",
        "continued",
        "travel",
        "widely",
        "china",
        "russia",
        "india",
        "pakistan",
        "added",
        "itinerary",
        "also",
        "continued",
        "political",
        "activity",
        "continuing",
        "support",
        "labour",
        "party",
        "campaigning",
        "british",
        "involvement",
        "vietnam",
        "one",
        "time",
        "vicepresident",
        "society",
        "reform",
        "abortion",
        "law",
        "chairman",
        "campaign",
        "racial",
        "discrimination",
        "sport",
        "president",
        "homosexual",
        "law",
        "reform",
        "society",
        "support",
        "decriminalization",
        "homosexual",
        "behavior",
        "quipped",
        "could",
        "thought",
        "anyone",
        "acquainted",
        "involve",
        "vested",
        "interest",
        "ayer",
        "support",
        "labour",
        "party",
        "came",
        "end",
        "formation",
        "social",
        "democratic",
        "party",
        "support",
        "sdp",
        "protest",
        "leftward",
        "trend",
        "labour",
        "party",
        "particularly",
        "antieuropeanism",
        "arrangement",
        "spending",
        "long",
        "weekend",
        "london",
        "working",
        "week",
        "oxford",
        "added",
        "ayer",
        "turbulent",
        "domestic",
        "life",
        "dee",
        "well",
        "son",
        "nicholas",
        "ayer",
        "said",
        "love",
        "child",
        "dominating",
        "factor",
        "remainder",
        "life",
        "rogers",
        "formed",
        "relationship",
        "vanessa",
        "lawson",
        "would",
        "see",
        "whilst",
        "oxford",
        "time",
        "ayer",
        "continued",
        "philosophically",
        "productive",
        "original",
        "work",
        "origin",
        "pragmatism",
        "published",
        "following",
        "russell",
        "moore",
        "analytical",
        "heritage",
        "product",
        "william",
        "james",
        "lecture",
        "delivered",
        "harvard",
        "probability",
        "evidence",
        "dewey",
        "lecture",
        "delivered",
        "columbia",
        "university",
        "shortly",
        "thereafter",
        "came",
        "russell",
        "small",
        "paperback",
        "central",
        "question",
        "philosophy",
        "originally",
        "given",
        "gifford",
        "lecture",
        "university",
        "st",
        "andrew",
        "elaborated",
        "sophisticated",
        "realism",
        "first",
        "put",
        "forward",
        "origin",
        "pragmatism",
        "visited",
        "canada",
        "couple",
        "occasion",
        "giving",
        "gilbert",
        "ryle",
        "lecture",
        "trent",
        "university",
        "resulting",
        "book",
        "hume",
        "whidden",
        "lecture",
        "mcmaster",
        "giving",
        "rise",
        "freedom",
        "morality",
        "shortly",
        "divorced",
        "dee",
        "well",
        "ayer",
        "married",
        "vanessa",
        "lawson",
        "shortly",
        "renee",
        "first",
        "wife",
        "died",
        "followed",
        "valerie",
        "daughter",
        "died",
        "suddenly",
        "hodgkin",
        "disease",
        "tragically",
        "vanessa",
        "die",
        "liver",
        "cancer",
        "leaving",
        "ayer",
        "griefstricken",
        "close",
        "encounter",
        "death",
        "technically",
        "dead",
        "minute",
        "choking",
        "piece",
        "smoked",
        "salmon",
        "reviving",
        "reported",
        "experience",
        "whilst",
        "dead",
        "way",
        "provide",
        "fodder",
        "thought",
        "famous",
        "atheist",
        "recanted",
        "found",
        "god",
        "moved",
        "quickly",
        "dispel",
        "rumour",
        "time",
        "become",
        "something",
        "philosophical",
        "grand",
        "old",
        "man",
        "volume",
        "published",
        "honour",
        "fulllength",
        "critical",
        "study",
        "john",
        "foster",
        "prestigious",
        "routledge",
        "argument",
        "philosopher",
        "series",
        "spent",
        "remaining",
        "couple",
        "year",
        "responding",
        "article",
        "appear",
        "ayer",
        "volume",
        "library",
        "living",
        "philosopher",
        "series",
        "edited",
        "le",
        "hahn",
        "remarried",
        "dee",
        "well",
        "long",
        "afterwards",
        "ayer",
        "admitted",
        "hospital",
        "collapsed",
        "lung",
        "early",
        "summer",
        "died",
        "th",
        "june",
        "ayer",
        "wrote",
        "two",
        "autobiography",
        "part",
        "life",
        "life",
        "circle",
        "friend",
        "included",
        "many",
        "famous",
        "influential",
        "people",
        "following",
        "particular",
        "order",
        "brief",
        "list",
        "cyril",
        "connolly",
        "graham",
        "greene",
        "george",
        "orwell",
        "ee",
        "cummings",
        "wife",
        "marianne",
        "meyer",
        "schapiro",
        "arthur",
        "koestler",
        "bertrand",
        "russell",
        "stephen",
        "spender",
        "wh",
        "auden",
        "philip",
        "toynbee",
        "isaiah",
        "berlin",
        "hugh",
        "gaitskell",
        "roy",
        "jenkins",
        "michael",
        "foot",
        "richard",
        "crossman",
        "jonathan",
        "miller",
        "angus",
        "wilson",
        "alan",
        "bennett",
        "alice",
        "thomas",
        "elli",
        "joan",
        "fontaine",
        "iris",
        "murdoch",
        "vs",
        "pritchett",
        "christopher",
        "hitchens",
        "believed",
        "maybe",
        "truly",
        "character",
        "george",
        "moore",
        "tom",
        "stoppard",
        "play",
        "jumper",
        "modeled",
        "ayer",
        "vain",
        "man",
        "whose",
        "vanity",
        "part",
        "considerable",
        "charm",
        "made",
        "distinction",
        "vanity",
        "egotism",
        "egotist",
        "said",
        "thought",
        "medal",
        "whilst",
        "vain",
        "person",
        "enjoyed",
        "showing",
        "medal",
        "among",
        "many",
        "medal",
        "given",
        "ayer",
        "knighthood",
        "fellow",
        "british",
        "academy",
        "honorary",
        "member",
        "american",
        "academy",
        "art",
        "science",
        "member",
        "bulgarian",
        "order",
        "cyril",
        "methodius",
        "st",
        "class",
        "chevalier",
        "légion",
        "honneur"
    ]
}