{
    "main_text": "Ethics || What is Ethics, and Why do we need It?\n2.1 What is Ethics, and Why do we need It?\n\nEthics \n\n\nis a code of values to guide man’s choices and actions—the\nchoices and actions that determine the purpose and the course of his\nlife. (1961b: 13) \n\n\nBefore we can decide which code of values we should accept, we need to\nask why we need a code of values at all. Rand claims that no\nphilosopher before her has provided a scientific answer to\nthis question, and so none has provided a satisfactory ethics.\n\nRand starts by describing value or “the good”, in\nclassical fashion, as the object of pursuit: “that which one\nacts to gain and/or keep” (1961b: 16). Thus, the concept of\nvalue presupposes the concept of “an entity capable of acting to\nachieve a goal in the face of an alternative”—and the\nbasic alternative facing any living entity is life or death (1961b:\n16). It is the conditional nature of life that gives rise to values,\nnot just human values, but values as such. As she puts it: \n\n\nMetaphysically, life is the only phenomenon that is an end in\nitself: a value gained and kept by a constant process of action.\n(1961b: 18) \n\n\nSurvival is the organism’s ultimate value, the “final goal\nor end to which all [its] lesser goals are the means”, and the\nstandard of all its other values: “that which furthers its life\nis the good, that which threatens it is the evil” (pp.\n16–17). The same, suitably modified, applies to human beings.\nLife is the standard and goal of all genuine human values, in the\nsense that all of them—from food to philosophy to fine art to\nethics—must be explained and justified as requirements of human\nsurvival. “Ethics is an objective, metaphysical necessity of\nman’s survival” (p. 24). Thus, \n\n\n[t]he standard of value of the Objectivist ethics … is\nman’s life, or: that which is required for man’s\nsurvival qua man, (1961b: 25) \n\n\nthat is, \n\n\nthe terms, methods, conditions and goals required for the survival of\na rational being through the whole of his lifespan—in all those\naspects of existence which are open to his choice. (1961b: 27) \n\n\nTo choose to live is to accept one’s “own\nlife” as one’s “ethical\npurpose”.\n\nRand’s metaphysical arguments make three points central to her\naxiology and ethics. (1) All living entities have values, not only\nhuman beings, and only living entities have values: life necessitates\nvalue, and value depends on life. (2) An entity’s values are\ndetermined by its objective life-needs, that is, by the requirements\nof survival for entities of its kind, and ethics is a requirement of\nhuman survival. (3) Thus, values are neither intrinsic properties of\nthings, nor subjective, neither free-floating Platonic entities, nor\nmere matters of preference, time, or culture. Rather, values are\nrelational or objective, dependent on the nature of the valuing entity\nand the nature of its environment. \n\nRand supports the first point by arguing that the concept of value\nentails the concept of life: \n\n\nepistemologically, the concept of “value” is genetically\ndependent upon and derived from the antecedent concept of\n“life”. (1961b: 18) \n\n\nShe asks the reader to \n\n\nimagine an immortal, indestructible robot, an entity which moves\nand acts, but which cannot be affected by anything, which cannot be\nchanged in any respect, which cannot be damaged, injured or destroyed.\n(1961b: 16) \n\n\nSuch an entity, she concludes, cannot have values.\n\nThe problem with this argument is that all it shows is that an entity\nthat cannot be destroyed or harmed cannot have values, and not that a\nnon-living entity cannot have values. Unlike the robot of this\nexample, real robots can be damaged or destroyed, by external\nas well as internal events. What it means for them to be damaged or\ndestroyed is that they cannot perform their functions well, or at\nall. Hence they can, quite straightforwardly, be said to have\n values.[3]\nTo take this into account, Rand would have to say that for an entity\nthat has a function, values are determined by what it needs to\nfunction (well), and that the function of living beings is to survive\n(well). Hence she can still maintain that for living things, values\nare determined by its objective life-needs, hence that values are\nobjective, and that ethics is a requirement of a proper human\nsurvival. \n\nRand’s naturalism, and her rejection of intrinsicism and\nsubjectivism in favor of objectivism, anticipate recent naturalisms\nand echo Aristotle’s argument, against both the Platonist and\nthe subjectivist, that “the good” must always be\ngood-for-something. Her conception of the function of\nmorality is notable both for its affinity to, and its difference from,\nThomas Hobbes’ conception: like Hobbes, Rand sees morality as a\nnecessary means to long-term survival, but unlike Hobbes, she does not\nsee morality as requiring a contract or even as a fundamentally social\naffair. The need for morality, according to Rand, is dictated by our\nnature as creatures that must think and produce to survive; hence we\nwould need morality even on a desert island. There is, however, no\nduty to survive; morality is based on a hypothetical imperative: if\nyou choose to live, then you must value your own long-term survival as\nan ultimate end, and morality as a necessary means to it. If asked why the\nchoice to live commits you to your own long-term survival rather than\nsome other ultimate end (such as, for example, the greatest happiness\nof the greatest number (Nozick 1971), or becoming worthy of eternal\nlife in heaven), the only answer is: because any other ultimate end, if\nconsistently adhered to, would lead to death.\n\nRand’s ethics is thus firmly teleological, this-worldly, and\nfoundationalist. Virtue is “the act by which one gains/and or\nkeeps” values in light of a recognition of certain facts (1961b:\n27, 28); it “is not an end in itself … not its own\nreward” (1957 [1992]: 939). A fact central to a\n“scientific” ethics is that reason is the chief\nindispensable human tool of survival, and we exercise reason by\nchoice. Hence rationality is the fundamental moral virtue, a virtue\nimplicated in all the other virtues, including productiveness\n (Section 2.4 below).\n Rand is widely credited by Objectivists (Peikoff 1991; Binswanger\n1990, 1992; Kelley & Thomas 1999—see Other Internet\nResources; Gotthelf 1999; Smith 2000, 2006) with having solved the\nis-ought problem by showing that morality is essential for long-term\nsurvival as a rational being, and so anyone who chooses to live ought\nto be moral (1961b: 19). But if the choice to live is itself a moral\nchoice, in the sense that we ought to choose to live, then the\nargument proceeds from an ought to an ought, not from an is to an\nought. On the other hand, if the choice to live is a non-moral choice\n(an idea that’s hard to reconcile with Rand’s general view\nthat all significant choices are moral choices), then suicide can\nnever be wrong, even if it is done for cowardly, irresponsible, or\nunjust reasons, a view that is obviously incoherent (King 1984 and\nNarveson 1998 criticize this and other aspects of Rand’s moral\nviews).  Again, if morality is needed only for long-term survival, and\nchoosing death is not immoral, then a suicide-bomber does no wrong in\nkilling innocent people. But people don’t lose their rights just\nbecause their killer has decided to kill himself. Darryl Wright seeks\nto save something of the commonsense view that the suicide-bomber acts\nwrongly by arguing that his choice to die without good reason\n“corresponds to a real defect or corruption” in him\n(Wright 2011: 26–29). But this verdict contradicts the premise\nthat choosing death is not immoral. For if the choice expresses a\ncorruption in the character of the suicide-bomber, then the choice\nitself is immoral. Moreover, this response leaves untouched the most\nimportant criticism of the suicide-bomber’s actions: that he\nviolates other people’s rights by using them as mere means to\nhis own (wicked) ends.\n More fundamentally, the very idea of morality resting on the\nchoice to live is questionable (Long 2000, Badhwar 2001). Most of us\nrarely, if ever, make a choice to live: we live by default. By giving\nus desires for food and water, for pleasure and security, Nature gives\nus, as she gives other animals, the implicit desire to stay\nalive. Perhaps the most dramatic evidence is the existence of feral\nchildren, children who have managed to stay alive for years in the\ncompany of wild animals. When we grow up, the only time we seriously\nask ourselves if we want to live or die is when living requires an\neffort on our part, such as in a grave illness, or deep depression, or\nemergency. But we start learning the difference between right and\nwrong (for example, don’t hit others, don’t grab their\nthings, and so on) long before we ever consider whether to live or\ndie. A deeper reflection on morality begins when we mature and start\nasking ourselves what constitutes happiness and a worthwhile life. But\nthis is an inherently moral question to which the answers are\ninherently moral or immoral. \n Let let us now return to the question of how we should understand\nthe relationship between long-term survival and survival as a rational\nbeing—the life “proper to a rational being” (Rand\n1961b: 27). Is a life proper to a rational being a necessary means,\nand only a necessary means, to literal, long-term survival? Or is such\na life itself the ultimate goal, the kind of survival worth having?\nAgain, what are we to make of the many passages in which Rand states\nthat the ultimate goal is one’s own happiness?\n\nSome of Rand’s statements suggest that she had only one,\nconsistent ethical view: the ultimate goal is the individual’s\nown survival; the only way to survive long-term, i.e., over a complete\nlife-span, is to live by the standard of man’s life as a\nrational being, which means: to live morally; and happiness is the\npsychological “result, reward and concomitant” (p. 32) of\nliving thus.  Many of Rand’s commentators follow her in holding\nthat there is only one consistent view, while disagreeing on the right\ninterpretation of it (Den Uyl & Rasmussen 1978; Machan 1984, 2000;\nPeikoff 1991; Bidinotto 1994—see Other Internet Resources; Hunt\n1999; Kelley & Thomas 1999—see Other Internet Resources;\nGotthelf 1999; Smith 2000, 2006). Others (Mack 1984, 2003; Badhwar\n1999, 2001; Long 2000) argue that Rand’s writings actually allow\nof two, if not three, mutually incompatible views of the ultimate\ngoal, and our task is to see which of these is the dominant or most\nplausible view. The three views are: survival, survival qua\nrational being, and happiness in the ancient Aristotelian sense of\nflourishing or eudaimonia. In the rest of Section 2, we will\npresent the textual evidence for each of these views of the final\ngoal, and the common objections to them, in turn.\n\nAll three views are, of course, egoist, in that the primary or sole\nintended beneficiary of morality is supposed to be the moral agent\nherself. But some of the criticisms usually levied at egoism lose some\nof their force when directed at the second and third views.\n",
    "section_title": "2.1 What is Ethics, and Why do we need It?",
    "entry_title": "Ayn Rand",
    "hierarchy_title": "Ayn Rand || Ethics || What is Ethics, and Why do we need It?",
    "tokenized_text": [
        "ethic",
        "ethic",
        "need",
        "ethic",
        "need",
        "ethic",
        "code",
        "value",
        "guide",
        "man",
        "choice",
        "actionsthe",
        "choice",
        "action",
        "determine",
        "purpose",
        "course",
        "life",
        "b",
        "decide",
        "code",
        "value",
        "accept",
        "need",
        "ask",
        "need",
        "code",
        "value",
        "rand",
        "claim",
        "philosopher",
        "provided",
        "scientific",
        "answer",
        "question",
        "none",
        "provided",
        "satisfactory",
        "ethic",
        "rand",
        "start",
        "describing",
        "value",
        "good",
        "classical",
        "fashion",
        "object",
        "pursuit",
        "one",
        "act",
        "gain",
        "andor",
        "keep",
        "b",
        "thus",
        "concept",
        "value",
        "presupposes",
        "concept",
        "entity",
        "capable",
        "acting",
        "achieve",
        "goal",
        "face",
        "alternative",
        "and",
        "basic",
        "alternative",
        "facing",
        "living",
        "entity",
        "life",
        "death",
        "b",
        "conditional",
        "nature",
        "life",
        "give",
        "rise",
        "value",
        "human",
        "value",
        "value",
        "put",
        "metaphysically",
        "life",
        "phenomenon",
        "end",
        "value",
        "gained",
        "kept",
        "constant",
        "process",
        "action",
        "b",
        "survival",
        "organism",
        "ultimate",
        "value",
        "final",
        "goal",
        "end",
        "lesser",
        "goal",
        "mean",
        "standard",
        "value",
        "furthers",
        "life",
        "good",
        "threatens",
        "evil",
        "pp",
        "suitably",
        "modified",
        "applies",
        "human",
        "being",
        "life",
        "standard",
        "goal",
        "genuine",
        "human",
        "value",
        "sense",
        "themfrom",
        "food",
        "philosophy",
        "fine",
        "art",
        "ethicsmust",
        "explained",
        "justified",
        "requirement",
        "human",
        "survival",
        "ethic",
        "objective",
        "metaphysical",
        "necessity",
        "man",
        "survival",
        "p",
        "thus",
        "standard",
        "value",
        "objectivist",
        "ethic",
        "man",
        "life",
        "required",
        "man",
        "survival",
        "qua",
        "man",
        "b",
        "term",
        "method",
        "condition",
        "goal",
        "required",
        "survival",
        "rational",
        "whole",
        "lifespanin",
        "aspect",
        "existence",
        "open",
        "choice",
        "b",
        "choose",
        "live",
        "accept",
        "one",
        "life",
        "one",
        "ethical",
        "purpose",
        "rand",
        "metaphysical",
        "argument",
        "make",
        "three",
        "point",
        "central",
        "axiology",
        "ethic",
        "living",
        "entity",
        "value",
        "human",
        "being",
        "living",
        "entity",
        "value",
        "life",
        "necessitates",
        "value",
        "value",
        "depends",
        "life",
        "entity",
        "value",
        "determined",
        "objective",
        "lifeneeds",
        "requirement",
        "survival",
        "entity",
        "kind",
        "ethic",
        "requirement",
        "human",
        "survival",
        "thus",
        "value",
        "neither",
        "intrinsic",
        "property",
        "thing",
        "subjective",
        "neither",
        "freefloating",
        "platonic",
        "entity",
        "mere",
        "matter",
        "preference",
        "time",
        "culture",
        "rather",
        "value",
        "relational",
        "objective",
        "dependent",
        "nature",
        "valuing",
        "entity",
        "nature",
        "environment",
        "rand",
        "support",
        "first",
        "point",
        "arguing",
        "concept",
        "value",
        "entail",
        "concept",
        "life",
        "epistemologically",
        "concept",
        "value",
        "genetically",
        "dependent",
        "upon",
        "derived",
        "antecedent",
        "concept",
        "life",
        "b",
        "asks",
        "reader",
        "imagine",
        "immortal",
        "indestructible",
        "robot",
        "entity",
        "move",
        "act",
        "affected",
        "anything",
        "changed",
        "respect",
        "damaged",
        "injured",
        "destroyed",
        "b",
        "entity",
        "concludes",
        "value",
        "problem",
        "argument",
        "show",
        "entity",
        "destroyed",
        "harmed",
        "value",
        "nonliving",
        "entity",
        "value",
        "unlike",
        "robot",
        "example",
        "real",
        "robot",
        "damaged",
        "destroyed",
        "external",
        "well",
        "internal",
        "event",
        "mean",
        "damaged",
        "destroyed",
        "perform",
        "function",
        "well",
        "hence",
        "quite",
        "straightforwardly",
        "said",
        "value",
        "take",
        "account",
        "rand",
        "would",
        "say",
        "entity",
        "function",
        "value",
        "determined",
        "need",
        "function",
        "well",
        "function",
        "living",
        "being",
        "survive",
        "well",
        "hence",
        "still",
        "maintain",
        "living",
        "thing",
        "value",
        "determined",
        "objective",
        "lifeneeds",
        "hence",
        "value",
        "objective",
        "ethic",
        "requirement",
        "proper",
        "human",
        "survival",
        "rand",
        "naturalism",
        "rejection",
        "intrinsicism",
        "subjectivism",
        "favor",
        "objectivism",
        "anticipate",
        "recent",
        "naturalism",
        "echo",
        "aristotle",
        "argument",
        "platonist",
        "subjectivist",
        "good",
        "must",
        "always",
        "goodforsomething",
        "conception",
        "function",
        "morality",
        "notable",
        "affinity",
        "difference",
        "thomas",
        "hobbes",
        "conception",
        "like",
        "hobbes",
        "rand",
        "see",
        "morality",
        "necessary",
        "mean",
        "longterm",
        "survival",
        "unlike",
        "hobbes",
        "see",
        "morality",
        "requiring",
        "contract",
        "even",
        "fundamentally",
        "social",
        "affair",
        "need",
        "morality",
        "according",
        "rand",
        "dictated",
        "nature",
        "creature",
        "must",
        "think",
        "produce",
        "survive",
        "hence",
        "would",
        "need",
        "morality",
        "even",
        "desert",
        "island",
        "however",
        "duty",
        "survive",
        "morality",
        "based",
        "hypothetical",
        "imperative",
        "choose",
        "live",
        "must",
        "value",
        "longterm",
        "survival",
        "ultimate",
        "end",
        "morality",
        "necessary",
        "mean",
        "asked",
        "choice",
        "live",
        "commits",
        "longterm",
        "survival",
        "rather",
        "ultimate",
        "end",
        "example",
        "greatest",
        "happiness",
        "greatest",
        "number",
        "nozick",
        "becoming",
        "worthy",
        "eternal",
        "life",
        "heaven",
        "answer",
        "ultimate",
        "end",
        "consistently",
        "adhered",
        "would",
        "lead",
        "death",
        "rand",
        "ethic",
        "thus",
        "firmly",
        "teleological",
        "thisworldly",
        "foundationalist",
        "virtue",
        "act",
        "one",
        "gainsand",
        "keep",
        "value",
        "light",
        "recognition",
        "certain",
        "fact",
        "b",
        "end",
        "reward",
        "fact",
        "central",
        "scientific",
        "ethic",
        "reason",
        "chief",
        "indispensable",
        "human",
        "tool",
        "survival",
        "exercise",
        "reason",
        "choice",
        "hence",
        "rationality",
        "fundamental",
        "moral",
        "virtue",
        "virtue",
        "implicated",
        "virtue",
        "including",
        "productiveness",
        "section",
        "rand",
        "widely",
        "credited",
        "objectivists",
        "peikoff",
        "binswanger",
        "kelley",
        "thomas",
        "see",
        "internet",
        "resource",
        "gotthelf",
        "smith",
        "solved",
        "isought",
        "problem",
        "showing",
        "morality",
        "essential",
        "longterm",
        "survival",
        "rational",
        "anyone",
        "chooses",
        "live",
        "ought",
        "moral",
        "b",
        "choice",
        "live",
        "moral",
        "choice",
        "sense",
        "ought",
        "choose",
        "live",
        "argument",
        "proceeds",
        "ought",
        "ought",
        "ought",
        "hand",
        "choice",
        "live",
        "nonmoral",
        "choice",
        "idea",
        "hard",
        "reconcile",
        "rand",
        "general",
        "view",
        "significant",
        "choice",
        "moral",
        "choice",
        "suicide",
        "never",
        "wrong",
        "even",
        "done",
        "cowardly",
        "irresponsible",
        "unjust",
        "reason",
        "view",
        "obviously",
        "incoherent",
        "king",
        "narveson",
        "criticize",
        "aspect",
        "rand",
        "moral",
        "view",
        "morality",
        "needed",
        "longterm",
        "survival",
        "choosing",
        "death",
        "immoral",
        "suicidebomber",
        "wrong",
        "killing",
        "innocent",
        "people",
        "people",
        "lose",
        "right",
        "killer",
        "decided",
        "kill",
        "darryl",
        "wright",
        "seek",
        "save",
        "something",
        "commonsense",
        "view",
        "suicidebomber",
        "act",
        "wrongly",
        "arguing",
        "choice",
        "die",
        "without",
        "good",
        "reason",
        "corresponds",
        "real",
        "defect",
        "corruption",
        "wright",
        "verdict",
        "contradicts",
        "premise",
        "choosing",
        "death",
        "immoral",
        "choice",
        "express",
        "corruption",
        "character",
        "suicidebomber",
        "choice",
        "immoral",
        "moreover",
        "response",
        "leaf",
        "untouched",
        "important",
        "criticism",
        "suicidebomber",
        "action",
        "violates",
        "people",
        "right",
        "using",
        "mere",
        "mean",
        "wicked",
        "end",
        "fundamentally",
        "idea",
        "morality",
        "resting",
        "choice",
        "live",
        "questionable",
        "long",
        "badhwar",
        "u",
        "rarely",
        "ever",
        "make",
        "choice",
        "live",
        "live",
        "default",
        "giving",
        "u",
        "desire",
        "food",
        "water",
        "pleasure",
        "security",
        "nature",
        "give",
        "u",
        "give",
        "animal",
        "implicit",
        "desire",
        "stay",
        "alive",
        "perhaps",
        "dramatic",
        "evidence",
        "existence",
        "feral",
        "child",
        "child",
        "managed",
        "stay",
        "alive",
        "year",
        "company",
        "wild",
        "animal",
        "grow",
        "time",
        "seriously",
        "ask",
        "want",
        "live",
        "die",
        "living",
        "requires",
        "effort",
        "part",
        "grave",
        "illness",
        "deep",
        "depression",
        "emergency",
        "start",
        "learning",
        "difference",
        "right",
        "wrong",
        "example",
        "hit",
        "others",
        "grab",
        "thing",
        "long",
        "ever",
        "consider",
        "whether",
        "live",
        "die",
        "deeper",
        "reflection",
        "morality",
        "begin",
        "mature",
        "start",
        "asking",
        "constitutes",
        "happiness",
        "worthwhile",
        "life",
        "inherently",
        "moral",
        "question",
        "answer",
        "inherently",
        "moral",
        "immoral",
        "let",
        "let",
        "u",
        "return",
        "question",
        "understand",
        "relationship",
        "longterm",
        "survival",
        "survival",
        "rational",
        "beingthe",
        "life",
        "proper",
        "rational",
        "rand",
        "b",
        "life",
        "proper",
        "rational",
        "necessary",
        "mean",
        "necessary",
        "mean",
        "literal",
        "longterm",
        "survival",
        "life",
        "ultimate",
        "goal",
        "kind",
        "survival",
        "worth",
        "make",
        "many",
        "passage",
        "rand",
        "state",
        "ultimate",
        "goal",
        "one",
        "happiness",
        "rand",
        "statement",
        "suggest",
        "one",
        "consistent",
        "ethical",
        "view",
        "ultimate",
        "goal",
        "individual",
        "survival",
        "way",
        "survive",
        "longterm",
        "ie",
        "complete",
        "lifespan",
        "live",
        "standard",
        "man",
        "life",
        "rational",
        "mean",
        "live",
        "morally",
        "happiness",
        "psychological",
        "result",
        "reward",
        "concomitant",
        "p",
        "living",
        "thus",
        "many",
        "rand",
        "commentator",
        "follow",
        "holding",
        "one",
        "consistent",
        "view",
        "disagreeing",
        "right",
        "interpretation",
        "den",
        "uyl",
        "rasmussen",
        "machan",
        "peikoff",
        "bidinotto",
        "see",
        "internet",
        "resource",
        "hunt",
        "kelley",
        "thomas",
        "see",
        "internet",
        "resource",
        "gotthelf",
        "smith",
        "others",
        "mack",
        "badhwar",
        "long",
        "argue",
        "rand",
        "writing",
        "actually",
        "allow",
        "two",
        "three",
        "mutually",
        "incompatible",
        "view",
        "ultimate",
        "goal",
        "task",
        "see",
        "dominant",
        "plausible",
        "view",
        "three",
        "view",
        "survival",
        "survival",
        "qua",
        "rational",
        "happiness",
        "ancient",
        "aristotelian",
        "sense",
        "flourishing",
        "eudaimonia",
        "rest",
        "section",
        "present",
        "textual",
        "evidence",
        "view",
        "final",
        "goal",
        "common",
        "objection",
        "turn",
        "three",
        "view",
        "course",
        "egoist",
        "primary",
        "sole",
        "intended",
        "beneficiary",
        "morality",
        "supposed",
        "moral",
        "agent",
        "criticism",
        "usually",
        "levied",
        "egoism",
        "lose",
        "force",
        "directed",
        "second",
        "third",
        "view"
    ]
}