{
    "main_text": "Counterfactual Theories of the Basing Relation\n2. Counterfactual Theories of the Basing Relation\n\nAmong the most widely discussed theories of the basing relation is\nthat presented by Marshall Swain (1979, 1981, and 1985). Concerned\nabout superstitious-lawyer style counterexamples, Swain suggests that\na counterfactual analysis of causation may avoid them without doing\nviolence to the intuitions underlying causal theories of the basing\nrelation. A counterfactual statement is a statement of the form\n“If A were to occur, then B would\noccur”, where ‘A’ and\n‘B’ denote events. Roughly, the idea is that a\nbelief is based on a reason if the reason either non-deviantly causes\nor would have caused (in the appropriate circumstances) the belief in\nquestion. Very roughly, where the reason would have caused the belief\n(in the appropriate circumstances), the reason is, in Swain’s\nterminology, a pseudo-overdeterminant of the belief, and hence the\nbelief is based on it. Swain argues that the complicated line of\nreasoning is a pseudo-overdeterminant of the lawyer’s belief\nthat his client is innocent, and hence that there is a kind of causal\nconnection between the complicated line of reasoning and the\nlawyer’s belief by virtue of which the lawyer’s belief is\nbased on the reasoning. Swain more precisely defines\npseudo-overdeterminants as follows (1981, p. 70):\n\n(DPO) Where c and e are occurrent events, c\nis a pseudo-overdeterminant of e if and only if:\n\n\nc is not a cause of e(that is, there is no\ncausal chain from c to e and c is not a\ngenuine overdeterminant of e);  and\nthere is some set of occurrent events, D =\n{d1, d2,…,\ndn} (possibly having only one member), such that\n\n\neach di in D is a cause of\ne; and\nif no member of D had occurred, but c and\ne had occurred anyway, then there would have been a causal\nchain from c to e, and c would have been\ncausally prior to e.\n \n\n\n\nHere ‘c’ stands for a cause and\n‘e’ for an effect. If we restrict the application\nof (DPO) to reasons and beliefs, c will be the reason and\ne will be the belief caused by the reason. The\n“di” will stand for the actual\nreason(s) for the belief. So, (DPO) in effect states that if the\nactual reason(s) di for the belief had not\noccurred, then if another reason c and the belief had\noccurred anyway, and only the minimum necessary changes in the\nperson’s epistemic situation (e.g., the person’s other\nbeliefs, reasons, etc.) are made, then reason c would have\ncaused the belief and is therefore a pseudo-overdeterminant of the\nbelief.\n\nIt’s important to note that a potential reason will not\npseudo-overdetermine a belief simply because there is some possible\nworld in which the actual reason does not cause the belief yet the\npotential reason does. This is much too broad, for it would allow\nbeliefs to be based on reasons when it seems obvious that they are not\nso based in the actual world. Rather, the various stipulations in\n(DPO) are intended to limit the relevant domain of possible worlds to\nthose as close as possible to the actual world.\n\nSwain’s theory of the basing relation counts\npseudo-overdeterminants of a belief as reasons upon which a belief is\nbased, as we can see from the definition of the basing relation Swain\noffers (Swain 1981, p. 74 and pp.\n 86–87)[6]:\n\n(DB) S’s belief that h is based upon the set\nof causal reasons R at a time t\n=df\n\nS believes that h at t; and\nFor every member rj of R, there is\nsome time tn (which may be identical with or\nearlier than t) such that\n\n\nS has (or had) rj at\ntn; and\nEither\n\n\nS’s having rj at\ntn is a cause (including genuine\noverdetermination) of S’s believing h at\nt or S’s having rj at\ntn is a pseudo-overdeterminant of\nS’s believing that h at t; or\nfor some ri and ti that\nsatisfy condition (i), with ‘ri’\nsubstituted for ‘rj’ and\n‘ti’ for\n‘tn’, S’s having\nrj at tn is either a cause or\na pseudo-overdeterminant of S’s having\nri at ti, or\n… , etc.\n \n \n\n\n\nGenuine causal overdeterminants occur when two or more causes both\noccur and each is sufficient to generate a particular effect. For\nexample, perhaps a table has five legs, four at the corners and one at\nthe center. It may be the case that the four legs at the corners are\nsufficient to cause the table to remain upright, but if the four legs\nat the corners were removed, the center leg would also be sufficient\nto keep the table upright. Here, the effect of the table’s\nremaining upright is overdetermined by the center leg, on the one\nhand, and the four legs at the corners, on the other. Similarly,\nperhaps a person has two good reasons for holding a belief, and either\none alone would be sufficient to cause the belief. In this case, the\ntwo reasons would be said to overdetermine the belief. Assuming that\nthe causal relations were not deviant, the belief would be based on\nboth of the reasons. The ‘ri’ and\n‘rj’ in (DB) are simply reasons on\nwhich the belief is based. Condition (ii) allows that a reason\nrj, which is in turn a reason for\nri, which in turn is a reason for the belief that\nh, is also a reason on which the belief that h is\nbased, and the “or …, etc.” clause is intended to\ninclude each of the reasons in a long chain of reasoning leading to\nthe belief to count as reasons upon which the belief is based.\n\nOne advantage of Swain’s theory (which could be easily\nincorporated into many other theories of the basing relation) is that\nreasons are not limited to beliefs. Things like perceptual states\n(such as seeing something) or what Swain calls sensation states (such\nas experiencing hunger, thirst, pain, or other things which we sense\nbut not necessarily through the five senses) are counted (by\nstipulation) as non-propositional reasons for the purposes of his\ntheory. Thus, a unified account of belief basing is provided.\n\nAs already noted, Swain’s theory is intended to avoid\nLehrer’s objection regarding superstitious-lawyer style\ncounterexamples. The complicated line of reasoning is not a cause or\ncausal overdeterminant of the lawyer’s belief that his client is\ninnocent because the lawyer’s strong desire to believe that his\nclient is guilty of the eighth murder prevents the complicated line of\nreasoning from causing the belief that his client is innocent. The\ndegree of conviction the lawyer has in the complicated line of\nreasoning is sufficient for the lawyer to believe the complicated line\nof reasoning (once his strong desire to believe that his client is\nguilty is overridden by his strong faith (or rational belief, as the\ncase may be) in the cards), but alone is not sufficient to override\nhis strong desire to believe that his client is innocent. Swain argues\nthat (DB) avoids Lehrer’s objection because the complicated line\nof reasoning pseudo-overdetermines the lawyer’s belief that his\nclient is innocent (Swain 1981, p. 74 and pp. 86–87). We can see\nhow this is to work by examining condition (2)(b) of (DPO). Suppose\nthat the actual cause of his belief that his client is innocent\n(di) (namely, the lawyer’s belief about the\nresult of the card reading) had not occurred, and that both the\ncomplicated line of reasoning (c) and the belief that his\nclient is innocent (e) had occurred anyway. On this\nsupposition, the lawyer’s strong desire to believe that his\nclient is guilty of all eight crimes could not have occurred, because\nif it had it would have prevented the lawyer from believing that his\nclient is innocent. Since the lawyer’s strong desire is the only\nthing that prevents the complicated line of reasoning from causing the\nlawyer’s belief that his client is innocent, the complicated\nline of reasoning would then have caused the lawyer to believe that\nhis client is innocent. Thus, the complicated line of reasoning\npseudo-overdetermines the lawyer’s belief that his client is\ninnocent, and hence, on (DB), the lawyer’s belief is based on\nthe complicated line of reasoning in Lehrer’s original example.\nSo on Swain’s theory, the lawyer’s belief is based on the\ncomplicated line of reasoning, in accordance with Lehrer’s\nintuitions about the case. Contrary to Lehrer, however, Swain argues\nthat there is a counterfactual causal connection between the reasoning\nand the lawyer’s belief that his client is innocent, thus\nproviding a theory of the basing relation consistent with the\nintuition that the basing relation is best analyzed in terms of a\nreason’s causing a belief.\n\nA variety of objections to Swain’s theory have been proposed in\nthe\n literature.[7]\n Perhaps the best of these is that presented by Joseph Tolliver (1982,\npp. 151–155). Tolliver’s counterexample, which he calls\nthe pendulum case, goes like this: suppose a physics student has\nlearned that from the period of a pendulum (i.e., the time it takes to\ncomplete a swing) one can calculate its length and vice versa. \nThe student measures a particular pendulum and discovers that it has a\nlength L, and calculates that it must have period P.\nThe student also has two general beliefs about pendulums, namely (1)\nthat if x is a pendulum of period P, then x\nis a pendulum of length L, and (2) that if x is a\npendulum of length L, then x is a pendulum of period\nP. We may suppose that it is clear in this case that the\nstudent’s belief about the period is based (at least in part) on\nher belief about its length, but her belief about its length is not\nbased on her belief about the period. But, Tolliver claims, the\nstudent’s belief about the period pseudo-overdetermines her\nbelief about the length of the pendulum, and hence gets counted, on\nSwain’s theory, as the basis of her belief about the length of\nthe pendulum. This is so because, according to Tolliver, if the actual\ncause of the student’s belief about the length had not occurred,\nand if the student still had both her belief about the period and her\nbelief about the length, then her belief about the period would have\ncaused her belief about the length.\n\nOne natural line of reply to this sort of counterexample to\nSwain’s theory would be to further specify the sorts of changes\nin one’s epistemic situation that are consistent with\npseudo-overdetermination. For example, perhaps the student in the\nabove example would have to engage in further reasoning, inferring the\nlength of the pendulum from her two general beliefs about pendulums\nand her belief about the period of the pendulum. If such additional\ninferences could be ruled out as being unwarranted changes in the\nstudent’s epistemic situation, then the student’s belief\nabout the period would not pseudo-overdetermine her belief about the\nlength of the pendulum.\n",
    "section_title": "2. Counterfactual Theories of the Basing Relation",
    "entry_title": "The Epistemic Basing Relation",
    "hierarchy_title": "The Epistemic Basing Relation || Counterfactual Theories of the Basing Relation",
    "tokenized_text": [
        "counterfactual",
        "theory",
        "basing",
        "relation",
        "counterfactual",
        "theory",
        "basing",
        "relation",
        "among",
        "widely",
        "discussed",
        "theory",
        "basing",
        "relation",
        "presented",
        "marshall",
        "swain",
        "concerned",
        "superstitiouslawyer",
        "style",
        "counterexample",
        "swain",
        "suggests",
        "counterfactual",
        "analysis",
        "causation",
        "may",
        "avoid",
        "without",
        "violence",
        "intuition",
        "underlying",
        "causal",
        "theory",
        "basing",
        "relation",
        "counterfactual",
        "statement",
        "statement",
        "form",
        "occur",
        "b",
        "would",
        "occur",
        "b",
        "denote",
        "event",
        "roughly",
        "idea",
        "belief",
        "based",
        "reason",
        "reason",
        "either",
        "nondeviantly",
        "cause",
        "would",
        "caused",
        "appropriate",
        "circumstance",
        "belief",
        "question",
        "roughly",
        "reason",
        "would",
        "caused",
        "belief",
        "appropriate",
        "circumstance",
        "reason",
        "swain",
        "terminology",
        "pseudooverdeterminant",
        "belief",
        "hence",
        "belief",
        "based",
        "swain",
        "argues",
        "complicated",
        "line",
        "reasoning",
        "pseudooverdeterminant",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "hence",
        "kind",
        "causal",
        "connection",
        "complicated",
        "line",
        "reasoning",
        "lawyer",
        "belief",
        "virtue",
        "lawyer",
        "belief",
        "based",
        "reasoning",
        "swain",
        "precisely",
        "defines",
        "pseudooverdeterminants",
        "follows",
        "p",
        "dpo",
        "c",
        "e",
        "occurrent",
        "event",
        "c",
        "pseudooverdeterminant",
        "e",
        "c",
        "cause",
        "e",
        "causal",
        "chain",
        "c",
        "e",
        "c",
        "genuine",
        "overdeterminant",
        "e",
        "set",
        "occurrent",
        "event",
        "d",
        "d",
        "dn",
        "possibly",
        "one",
        "member",
        "di",
        "cause",
        "e",
        "member",
        "occurred",
        "c",
        "e",
        "occurred",
        "anyway",
        "would",
        "causal",
        "chain",
        "c",
        "e",
        "c",
        "would",
        "causally",
        "prior",
        "e",
        "c",
        "stand",
        "cause",
        "e",
        "effect",
        "restrict",
        "application",
        "dpo",
        "reason",
        "belief",
        "c",
        "reason",
        "e",
        "belief",
        "caused",
        "reason",
        "di",
        "stand",
        "actual",
        "reason",
        "belief",
        "dpo",
        "effect",
        "state",
        "actual",
        "reason",
        "di",
        "belief",
        "occurred",
        "another",
        "reason",
        "c",
        "belief",
        "occurred",
        "anyway",
        "minimum",
        "necessary",
        "change",
        "person",
        "epistemic",
        "situation",
        "eg",
        "person",
        "belief",
        "reason",
        "etc",
        "made",
        "reason",
        "c",
        "would",
        "caused",
        "belief",
        "therefore",
        "pseudooverdeterminant",
        "belief",
        "important",
        "note",
        "potential",
        "reason",
        "pseudooverdetermine",
        "belief",
        "simply",
        "possible",
        "world",
        "actual",
        "reason",
        "cause",
        "belief",
        "yet",
        "potential",
        "reason",
        "much",
        "broad",
        "would",
        "allow",
        "belief",
        "based",
        "reason",
        "seems",
        "obvious",
        "based",
        "actual",
        "world",
        "rather",
        "various",
        "stipulation",
        "dpo",
        "intended",
        "limit",
        "relevant",
        "domain",
        "possible",
        "world",
        "close",
        "possible",
        "actual",
        "world",
        "swain",
        "theory",
        "basing",
        "relation",
        "count",
        "pseudooverdeterminants",
        "belief",
        "reason",
        "upon",
        "belief",
        "based",
        "see",
        "definition",
        "basing",
        "relation",
        "swain",
        "offer",
        "swain",
        "p",
        "pp",
        "db",
        "belief",
        "h",
        "based",
        "upon",
        "set",
        "causal",
        "reason",
        "r",
        "time",
        "df",
        "belief",
        "h",
        "every",
        "member",
        "rj",
        "r",
        "time",
        "tn",
        "may",
        "identical",
        "earlier",
        "rj",
        "tn",
        "either",
        "rj",
        "tn",
        "cause",
        "including",
        "genuine",
        "overdetermination",
        "believing",
        "h",
        "rj",
        "tn",
        "pseudooverdeterminant",
        "believing",
        "h",
        "ri",
        "ti",
        "satisfy",
        "condition",
        "ri",
        "substituted",
        "rj",
        "ti",
        "tn",
        "rj",
        "tn",
        "either",
        "cause",
        "pseudooverdeterminant",
        "ri",
        "ti",
        "etc",
        "genuine",
        "causal",
        "overdeterminants",
        "occur",
        "two",
        "cause",
        "occur",
        "sufficient",
        "generate",
        "particular",
        "effect",
        "example",
        "perhaps",
        "table",
        "five",
        "leg",
        "four",
        "corner",
        "one",
        "center",
        "may",
        "case",
        "four",
        "leg",
        "corner",
        "sufficient",
        "cause",
        "table",
        "remain",
        "upright",
        "four",
        "leg",
        "corner",
        "removed",
        "center",
        "leg",
        "would",
        "also",
        "sufficient",
        "keep",
        "table",
        "upright",
        "effect",
        "table",
        "remaining",
        "upright",
        "overdetermined",
        "center",
        "leg",
        "one",
        "hand",
        "four",
        "leg",
        "corner",
        "similarly",
        "perhaps",
        "person",
        "two",
        "good",
        "reason",
        "holding",
        "belief",
        "either",
        "one",
        "alone",
        "would",
        "sufficient",
        "cause",
        "belief",
        "case",
        "two",
        "reason",
        "would",
        "said",
        "overdetermine",
        "belief",
        "assuming",
        "causal",
        "relation",
        "deviant",
        "belief",
        "would",
        "based",
        "reason",
        "ri",
        "rj",
        "db",
        "simply",
        "reason",
        "belief",
        "based",
        "condition",
        "ii",
        "allows",
        "reason",
        "rj",
        "turn",
        "reason",
        "ri",
        "turn",
        "reason",
        "belief",
        "h",
        "also",
        "reason",
        "belief",
        "h",
        "based",
        "etc",
        "clause",
        "intended",
        "include",
        "reason",
        "long",
        "chain",
        "reasoning",
        "leading",
        "belief",
        "count",
        "reason",
        "upon",
        "belief",
        "based",
        "one",
        "advantage",
        "swain",
        "theory",
        "could",
        "easily",
        "incorporated",
        "many",
        "theory",
        "basing",
        "relation",
        "reason",
        "limited",
        "belief",
        "thing",
        "like",
        "perceptual",
        "state",
        "seeing",
        "something",
        "swain",
        "call",
        "sensation",
        "state",
        "experiencing",
        "hunger",
        "thirst",
        "pain",
        "thing",
        "sense",
        "necessarily",
        "five",
        "sens",
        "counted",
        "stipulation",
        "nonpropositional",
        "reason",
        "purpose",
        "theory",
        "thus",
        "unified",
        "account",
        "belief",
        "basing",
        "provided",
        "already",
        "noted",
        "swain",
        "theory",
        "intended",
        "avoid",
        "lehrer",
        "objection",
        "regarding",
        "superstitiouslawyer",
        "style",
        "counterexample",
        "complicated",
        "line",
        "reasoning",
        "cause",
        "causal",
        "overdeterminant",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "lawyer",
        "strong",
        "desire",
        "believe",
        "client",
        "guilty",
        "eighth",
        "murder",
        "prevents",
        "complicated",
        "line",
        "reasoning",
        "causing",
        "belief",
        "client",
        "innocent",
        "degree",
        "conviction",
        "lawyer",
        "complicated",
        "line",
        "reasoning",
        "sufficient",
        "lawyer",
        "believe",
        "complicated",
        "line",
        "reasoning",
        "strong",
        "desire",
        "believe",
        "client",
        "guilty",
        "overridden",
        "strong",
        "faith",
        "rational",
        "belief",
        "case",
        "may",
        "card",
        "alone",
        "sufficient",
        "override",
        "strong",
        "desire",
        "believe",
        "client",
        "innocent",
        "swain",
        "argues",
        "db",
        "avoids",
        "lehrer",
        "objection",
        "complicated",
        "line",
        "reasoning",
        "pseudooverdetermines",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "swain",
        "p",
        "pp",
        "see",
        "work",
        "examining",
        "condition",
        "b",
        "dpo",
        "suppose",
        "actual",
        "cause",
        "belief",
        "client",
        "innocent",
        "di",
        "namely",
        "lawyer",
        "belief",
        "result",
        "card",
        "reading",
        "occurred",
        "complicated",
        "line",
        "reasoning",
        "c",
        "belief",
        "client",
        "innocent",
        "e",
        "occurred",
        "anyway",
        "supposition",
        "lawyer",
        "strong",
        "desire",
        "believe",
        "client",
        "guilty",
        "eight",
        "crime",
        "could",
        "occurred",
        "would",
        "prevented",
        "lawyer",
        "believing",
        "client",
        "innocent",
        "since",
        "lawyer",
        "strong",
        "desire",
        "thing",
        "prevents",
        "complicated",
        "line",
        "reasoning",
        "causing",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "complicated",
        "line",
        "reasoning",
        "would",
        "caused",
        "lawyer",
        "believe",
        "client",
        "innocent",
        "thus",
        "complicated",
        "line",
        "reasoning",
        "pseudooverdetermines",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "hence",
        "db",
        "lawyer",
        "belief",
        "based",
        "complicated",
        "line",
        "reasoning",
        "lehrer",
        "original",
        "example",
        "swain",
        "theory",
        "lawyer",
        "belief",
        "based",
        "complicated",
        "line",
        "reasoning",
        "accordance",
        "lehrer",
        "intuition",
        "case",
        "contrary",
        "lehrer",
        "however",
        "swain",
        "argues",
        "counterfactual",
        "causal",
        "connection",
        "reasoning",
        "lawyer",
        "belief",
        "client",
        "innocent",
        "thus",
        "providing",
        "theory",
        "basing",
        "relation",
        "consistent",
        "intuition",
        "basing",
        "relation",
        "best",
        "analyzed",
        "term",
        "reason",
        "causing",
        "belief",
        "variety",
        "objection",
        "swain",
        "theory",
        "proposed",
        "literature",
        "perhaps",
        "best",
        "presented",
        "joseph",
        "tolliver",
        "pp",
        "tolliver",
        "counterexample",
        "call",
        "pendulum",
        "case",
        "go",
        "like",
        "suppose",
        "physic",
        "student",
        "learned",
        "period",
        "pendulum",
        "ie",
        "time",
        "take",
        "complete",
        "swing",
        "one",
        "calculate",
        "length",
        "vice",
        "versa",
        "student",
        "measure",
        "particular",
        "pendulum",
        "discovers",
        "length",
        "l",
        "calculates",
        "must",
        "period",
        "p",
        "student",
        "also",
        "two",
        "general",
        "belief",
        "pendulum",
        "namely",
        "x",
        "pendulum",
        "period",
        "p",
        "x",
        "pendulum",
        "length",
        "l",
        "x",
        "pendulum",
        "length",
        "l",
        "x",
        "pendulum",
        "period",
        "p",
        "may",
        "suppose",
        "clear",
        "case",
        "student",
        "belief",
        "period",
        "based",
        "least",
        "part",
        "belief",
        "length",
        "belief",
        "length",
        "based",
        "belief",
        "period",
        "tolliver",
        "claim",
        "student",
        "belief",
        "period",
        "pseudooverdetermines",
        "belief",
        "length",
        "pendulum",
        "hence",
        "get",
        "counted",
        "swain",
        "theory",
        "basis",
        "belief",
        "length",
        "pendulum",
        "according",
        "tolliver",
        "actual",
        "cause",
        "student",
        "belief",
        "length",
        "occurred",
        "student",
        "still",
        "belief",
        "period",
        "belief",
        "length",
        "belief",
        "period",
        "would",
        "caused",
        "belief",
        "length",
        "one",
        "natural",
        "line",
        "reply",
        "sort",
        "counterexample",
        "swain",
        "theory",
        "would",
        "specify",
        "sort",
        "change",
        "one",
        "epistemic",
        "situation",
        "consistent",
        "pseudooverdetermination",
        "example",
        "perhaps",
        "student",
        "example",
        "would",
        "engage",
        "reasoning",
        "inferring",
        "length",
        "pendulum",
        "two",
        "general",
        "belief",
        "pendulum",
        "belief",
        "period",
        "pendulum",
        "additional",
        "inference",
        "could",
        "ruled",
        "unwarranted",
        "change",
        "student",
        "epistemic",
        "situation",
        "student",
        "belief",
        "period",
        "would",
        "pseudooverdetermine",
        "belief",
        "length",
        "pendulum"
    ]
}