{
    "main_text": "Bauer’s Late Work, 1850–1882\n3. Bauer’s Late Work, 1850–1882\n\nWhile he continued to proclaim the continuity of his thought,\nBauer’s late work was characterized by the definitive\nabandonment of his Vormärz republicanism. The failure of 1848, he\nargued, demonstrated the bankruptcy of the European philosophical\ntradition. Instead of the triumph of republics, Bauer now foresaw an\nage of global imperialism. The decisive political question after 1848\nwas the rise of Russia. Bauer predicted that Russian pressure would\npromote a pan-European union, as a stage in a movement toward a global\nabsolutism. The revolutionaries of 1848 still presupposed,\nuncritically, that states were independent units. The next historical\nperiod would initiate a genuine continental crisis. Anticipating\nNietzsche, Bauer contended that the impending collapse of European\ncivilisation would make possible a new beginning, a liberation from\ntraditional forms and values, together with their metaphysical and\nreligious sanctions. Bauer’s abiding opposition to liberalism\nnow induced him to collaborate in conservative causes; but his\nconservatism was unconventional. Like Nietzsche, he continued to\nrepudiate tradition and religion. Because of his anti-Semitism, Bauer\nwas claimed as a precursor by some National-Socialist authors, though\nErnst Barnikol, for example, disputes a direct connection (Barnikol\n1972, pp. 350–53).\n\nFor Bauer, the revolutions of 1848 were so closely connected with the\nEnlightenment, Kantian, and Hegelian projects that their failure\nsounded the death-knell of philosophy and its claims to rational\nindividual autonomy. Bauer’s late critique assimilated Hegel\nwith Spinoza and the metaphysics of substance, understood as the\nnegation of form and subjectivity. Unlike his Vormärz position,\nhe asserted in texts of 1852 and 1853 that Hegel had yielded to the\ninfluence of Spinoza, effacing individuality, and submerging concrete\nparticulars under illusory, abstract logical categories. Bauer now\ndescribed the Hegelian idea as being itself a transcendent illusion.\nIts inability to admit concrete particulars derived from the\nsubstantiality of the system itself. The result was that Hegel had\ndiscounted individuality in favour of conformity. While prior to 1848\nBauer proclaimed that Hegel had taught “the republic and the\nrevolution,” he now decried the absolutist tendencies of the\nHegelian system, whose oppressive unity paralleled the historical\ntrend toward an all-encompassing political despotism. Bauer accused\nphilosophy of contributing to an inexorable process of levelling and\nuniformity in the post-revolutionary state (Bauer, Russland und\ndas Germanenthum, I, pp. 40–54). These criticisms\nanticipated Rudolph Haym’s polemic in Hegel und seine\nZeit (1857).\n\nIn common with many post-1848 intellectuals, Bauer’s abandonment\nof metaphysics led him to a new conception of critique as a positive\nscience or empirical investigation. Bauer no longer contended that\nhistory represents an unfolding dialectic of self-consciousness.\nCritique was to permit the observer to examine historical phenomena\nwithout distortion or partiality, and without an a priori systemic\nconcern. Bauer maintained that scientific research must remain\nindependent of ecclesiastical and political tutelage. Its objective\nwas to determine the relation of nature to rights and freedom of the\nwill (concepts which the late Bauer retained, while rejecting their\nmetaphysical foundations); but critique did not enjoin practical\nintervention in political affairs. The correct stance was now\ndisinterested contemplation of the inevitable processes of cultural\ndecay and regeneration, and an attempt to salvage one’s own\nindependence from the general wreckage of philosophical systems and\npolitical life.\n\nThe conclusion of this new critique was that the future belonged not\nto the republican people, or to separate national states, but to a\ntransnational imperialism, involving the confrontation of two\nabsolutist programmes. In one of these, the Western European,\npolitical absolutism arose over modern mass society as its necessary\ncomplement. Bauer had earlier criticized this configuration as an\noutmoded form of state, to be supplanted by the republic; he now\ndescribed it as the result of an incomplete political development,\nwhich would issue in a contention for world domination. Within the\nWestern European form, Bauer distinguished two variants:\nBismarck’s state socialism, imitating eighteenth-century\nPrussian militarism, attempted to subject economic production to\npolitical control, suppressing innovation and personal independence;\nwhile Disraeli’s romantic imperialism sought to level and\nsubordinate English society before a paternalistic monarchy. In\nopposition to the west, the second major absolutist form was that of\nRussia, a substantial power with limited internal distinctions. Its\ncohesiveness derived from the fusion of political and ecclesiastical\npower, and the absence of the modern idea of subjectivity. Bauer noted\nthat Hegel had mistakenly discounted this zone from world history.\nLike the anarchist Michael Bakunin, Bauer claimed that Russia owed its\noriginal state formation to Germany; but Russia had otherwise been\nimpervious to western philosophical influence, adopting only what\nserved its immediate, concrete ends. Animated by hatred and shame of\nits past insignificance, Russia too was ambivalent. It did not\ndirectly provide the solution to the contemporary political crisis,\nbut elicited a decisive struggle with the west. The vigour of an alien\nadversary would force Europe to transform itself, and offered the only\nremaining prospects of a cultural renewal. Preceding any such renewal\nwould be the extension of imperialism across the continent and the\nglobe, and the clash of rivals for dominance within the new empire.\nBauer concluded that world war was inevitable.\n\nBauer’s prognosis anticipated aspects of Karl Kautsky’s\n1915 theory of ultraimperialism, though without the latter’s\noptimism that this trend heralded a reduction in conflicts among\ncontenders for hegemony. Imperialism, moreover, did not stimulate, but\nhampered economic growth, since insecurity and permanent military\nmobilization undermined productive activity. The historic function of\nthe globalizing process was to eliminate national identities, laying\nthe basis for an eventual cosmopolitan rebirth. Bauer saw nationalism\nas a dissipated force. The emerging world order was framed not by the\ndefence of national interests, but by a struggle for transnational\nsupremacy among elites with no local loyalties. The growing\ncentralization of political power was abetted by the levelling forces\nof the socialist movement, with its own internationalist pretensions.\nThis trend also underlay what Bauer called political pauperism, a\ngeneralised disqualification of individuals from participation in\npolitical activity. The conclusion of this process would be to perfect\nmass society, which Bauer had analyzed since the 1840s. The principle\nof substance, non-differentiation, and conformity would reach its\nultimate extension, and could then be overthrown. World imperialism\nwould issue in an all-embracing catastrophe, the apocalyptic end of\nthe old, Christian-Germanic order. Only then would new cultural\npossibilities emerge. Though these could not be predicted in detail,\nthey would involve the emergence of an unprecedented creative\nindividuality, freed from religious and metaphysical illusions.\n\nBauer likened the present crisis to the end of the classical world in\nRoman imperialism. His studies in the 1850s located the origins of\nChristianity in the second century CE, concluding that the first\ngospel was written under Hadrian (117–138 CE), though slightly\npredated by some of the Pauline epistles. Bauer traced the evolution\nof Christian ideas from Hellenism and Stoicism, deriving the logos\ndoctrine of John’s gospel from Philo and neo-Platonic sources.\nAs in Herr Dr. Hengstenberg, he denied that Christianity had\nemerged directly from Judaism. More than in his early work, though, he\nnow stressed the revolutionary power of the early Christian religion,\nas a source of liberation for the excluded and impoverished elements\nof the Roman Empire. His final book described Christianity as the\nsocialist culmination of Greek and Roman history. Responding to this\nargument in his very positive obituary of Bauer, Friedrich Engels\nacknowledged the importance of Bauer’s late work for the\nsocialist critique of religion (Sozialdemokrat, 1882). In\n1908, Karl Kautsky’s book, The Origins of Christianity,\napplied Bauer’s thesis.\n\nBauer’s late writings identified sentiment and pietistic\nfeeling-certainty, rather than autonomous reason, as the principal\nforce in shaping modern subjectivity. His studies of the Quakers and\nof pietism described passive inwardness and sentiment as the dominant\ncharacteristics of the German Enlightenment. The practical reason of\nKant and Fichte merely translated the inner voice of pietist\nconscience into a rationalist idiom. Bauer also described pietism as\nthe end of Christianity, since it destroyed dogma in favour of inner\nillumination and personal moral rectitude. Consistent with his\nChristianity Revealed, Bauer continued to define positive or\nstatutory religions by their exclusive dogmas and symbols; and he\nstill saw the general course of history as dissipating these dogmas,\nas mere illusions. He discounted the mobilizing potential of religion\nin the modern imperial order. In the Posaune, he had denounced\nSchleiermacher’s efforts to restore dogmatic Christianity\nthrough an appeal to feelings of dependency. Now he claimed that the\nforce of sentiment, contrary to Schleiermacher’s supposition,\nwas to dissolve dogmatic religion into personal conviction. The new\nworld empire would end with the inner erosion of religious belief. Not\nrational speculation, but sentiment, would effect this\ntransformation.\n\nA stringent anti-nationalism and a marked anti-Semitism characterized\nBauer’s later thought. He defended German culture against its\npolitical appropriation by the Prussian and Austrian regimes, but\ncriticized its insufficiencies, in Goethe, for example, who remained\nenthralled to the metaphysical tradition. Bauer stressed that Germany\nwas not a racial unit, but a historical and cultural artefact,\nreinforced by racial mixing, and not by racial purity (Barnikol 1972,\np. 393). It is clear, however, that some elements were excluded from\nthe mix: unlike his earlier treatment of the Jewish question as\nhistorical, cultural, and religious, he now asserted that a natural\ndistinction of race created an impassable divide between Jews and\nEuropeans (Bauer, “Present Position of the Jews,” 1852).\nHis claim that the political significance of the Jews throughout the\npolitical spectrum was a testimony to the debility of European culture\nand to the approaching crisis was greeted by National-Socialist\nauthors.\n\nBauer’s late work contains prescient observations on\nglobalization and world war, and has affinities with a variety of\ntwentieth-century ideological forms, from socialism to imperialism and\nanti-Semitism. In contrast, his early work bespeaks an original,\nHegelian republicanism, and offers cogent analyses of Restoration\npolitical thought and the rise of mass society. His intellectual\nlegacy is complex and contentious.\n",
    "section_title": "3. Bauer’s Late Work, 1850–1882",
    "entry_title": "Bruno Bauer",
    "hierarchy_title": "Bruno Bauer || Bauer’s Late Work, 1850–1882",
    "tokenized_text": [
        "bauer",
        "late",
        "work",
        "bauer",
        "late",
        "work",
        "continued",
        "proclaim",
        "continuity",
        "thought",
        "bauer",
        "late",
        "work",
        "characterized",
        "definitive",
        "abandonment",
        "vormärz",
        "republicanism",
        "failure",
        "argued",
        "demonstrated",
        "bankruptcy",
        "european",
        "philosophical",
        "tradition",
        "instead",
        "triumph",
        "republic",
        "bauer",
        "foresaw",
        "age",
        "global",
        "imperialism",
        "decisive",
        "political",
        "question",
        "rise",
        "russia",
        "bauer",
        "predicted",
        "russian",
        "pressure",
        "would",
        "promote",
        "paneuropean",
        "union",
        "stage",
        "movement",
        "toward",
        "global",
        "absolutism",
        "revolutionary",
        "still",
        "presupposed",
        "uncritically",
        "state",
        "independent",
        "unit",
        "next",
        "historical",
        "period",
        "would",
        "initiate",
        "genuine",
        "continental",
        "crisis",
        "anticipating",
        "nietzsche",
        "bauer",
        "contended",
        "impending",
        "collapse",
        "european",
        "civilisation",
        "would",
        "make",
        "possible",
        "new",
        "beginning",
        "liberation",
        "traditional",
        "form",
        "value",
        "together",
        "metaphysical",
        "religious",
        "sanction",
        "bauer",
        "abiding",
        "opposition",
        "liberalism",
        "induced",
        "collaborate",
        "conservative",
        "cause",
        "conservatism",
        "unconventional",
        "like",
        "nietzsche",
        "continued",
        "repudiate",
        "tradition",
        "religion",
        "antisemitism",
        "bauer",
        "claimed",
        "precursor",
        "nationalsocialist",
        "author",
        "though",
        "ernst",
        "barnikol",
        "example",
        "dispute",
        "direct",
        "connection",
        "barnikol",
        "pp",
        "bauer",
        "revolution",
        "closely",
        "connected",
        "enlightenment",
        "kantian",
        "hegelian",
        "project",
        "failure",
        "sounded",
        "deathknell",
        "philosophy",
        "claim",
        "rational",
        "individual",
        "autonomy",
        "bauer",
        "late",
        "critique",
        "assimilated",
        "hegel",
        "spinoza",
        "metaphysics",
        "substance",
        "understood",
        "negation",
        "form",
        "subjectivity",
        "unlike",
        "vormärz",
        "position",
        "asserted",
        "text",
        "hegel",
        "yielded",
        "influence",
        "spinoza",
        "effacing",
        "individuality",
        "submerging",
        "concrete",
        "particular",
        "illusory",
        "abstract",
        "logical",
        "category",
        "bauer",
        "described",
        "hegelian",
        "idea",
        "transcendent",
        "illusion",
        "inability",
        "admit",
        "concrete",
        "particular",
        "derived",
        "substantiality",
        "system",
        "result",
        "hegel",
        "discounted",
        "individuality",
        "favour",
        "conformity",
        "prior",
        "bauer",
        "proclaimed",
        "hegel",
        "taught",
        "republic",
        "revolution",
        "decried",
        "absolutist",
        "tendency",
        "hegelian",
        "system",
        "whose",
        "oppressive",
        "unity",
        "paralleled",
        "historical",
        "trend",
        "toward",
        "allencompassing",
        "political",
        "despotism",
        "bauer",
        "accused",
        "philosophy",
        "contributing",
        "inexorable",
        "process",
        "levelling",
        "uniformity",
        "postrevolutionary",
        "state",
        "bauer",
        "russland",
        "und",
        "da",
        "germanenthum",
        "pp",
        "criticism",
        "anticipated",
        "rudolph",
        "haym",
        "polemic",
        "hegel",
        "und",
        "seine",
        "zeit",
        "common",
        "many",
        "post",
        "intellectual",
        "bauer",
        "abandonment",
        "metaphysics",
        "led",
        "new",
        "conception",
        "critique",
        "positive",
        "science",
        "empirical",
        "investigation",
        "bauer",
        "longer",
        "contended",
        "history",
        "represents",
        "unfolding",
        "dialectic",
        "selfconsciousness",
        "critique",
        "permit",
        "observer",
        "examine",
        "historical",
        "phenomenon",
        "without",
        "distortion",
        "partiality",
        "without",
        "priori",
        "systemic",
        "concern",
        "bauer",
        "maintained",
        "scientific",
        "research",
        "must",
        "remain",
        "independent",
        "ecclesiastical",
        "political",
        "tutelage",
        "objective",
        "determine",
        "relation",
        "nature",
        "right",
        "freedom",
        "concept",
        "late",
        "bauer",
        "retained",
        "rejecting",
        "metaphysical",
        "foundation",
        "critique",
        "enjoin",
        "practical",
        "intervention",
        "political",
        "affair",
        "correct",
        "stance",
        "disinterested",
        "contemplation",
        "inevitable",
        "process",
        "cultural",
        "decay",
        "regeneration",
        "attempt",
        "salvage",
        "one",
        "independence",
        "general",
        "wreckage",
        "philosophical",
        "system",
        "political",
        "life",
        "conclusion",
        "new",
        "critique",
        "future",
        "belonged",
        "republican",
        "people",
        "separate",
        "national",
        "state",
        "transnational",
        "imperialism",
        "involving",
        "confrontation",
        "two",
        "absolutist",
        "programme",
        "one",
        "western",
        "european",
        "political",
        "absolutism",
        "arose",
        "modern",
        "mass",
        "society",
        "necessary",
        "complement",
        "bauer",
        "earlier",
        "criticized",
        "configuration",
        "outmoded",
        "form",
        "state",
        "supplanted",
        "republic",
        "described",
        "result",
        "incomplete",
        "political",
        "development",
        "would",
        "issue",
        "contention",
        "world",
        "domination",
        "within",
        "western",
        "european",
        "form",
        "bauer",
        "distinguished",
        "two",
        "variant",
        "bismarck",
        "state",
        "socialism",
        "imitating",
        "eighteenthcentury",
        "prussian",
        "militarism",
        "attempted",
        "subject",
        "economic",
        "production",
        "political",
        "control",
        "suppressing",
        "innovation",
        "personal",
        "independence",
        "disraeli",
        "romantic",
        "imperialism",
        "sought",
        "level",
        "subordinate",
        "english",
        "society",
        "paternalistic",
        "monarchy",
        "opposition",
        "west",
        "second",
        "major",
        "absolutist",
        "form",
        "russia",
        "substantial",
        "power",
        "limited",
        "internal",
        "distinction",
        "cohesiveness",
        "derived",
        "fusion",
        "political",
        "ecclesiastical",
        "power",
        "absence",
        "modern",
        "idea",
        "subjectivity",
        "bauer",
        "noted",
        "hegel",
        "mistakenly",
        "discounted",
        "zone",
        "world",
        "history",
        "like",
        "anarchist",
        "michael",
        "bakunin",
        "bauer",
        "claimed",
        "russia",
        "owed",
        "original",
        "state",
        "formation",
        "germany",
        "russia",
        "otherwise",
        "impervious",
        "western",
        "philosophical",
        "influence",
        "adopting",
        "served",
        "immediate",
        "concrete",
        "end",
        "animated",
        "hatred",
        "shame",
        "past",
        "insignificance",
        "russia",
        "ambivalent",
        "directly",
        "provide",
        "solution",
        "contemporary",
        "political",
        "crisis",
        "elicited",
        "decisive",
        "struggle",
        "west",
        "vigour",
        "alien",
        "adversary",
        "would",
        "force",
        "europe",
        "transform",
        "offered",
        "remaining",
        "prospect",
        "cultural",
        "renewal",
        "preceding",
        "renewal",
        "would",
        "extension",
        "imperialism",
        "across",
        "continent",
        "globe",
        "clash",
        "rival",
        "dominance",
        "within",
        "new",
        "empire",
        "bauer",
        "concluded",
        "world",
        "war",
        "inevitable",
        "bauer",
        "prognosis",
        "anticipated",
        "aspect",
        "karl",
        "kautsky",
        "theory",
        "ultraimperialism",
        "though",
        "without",
        "latter",
        "optimism",
        "trend",
        "heralded",
        "reduction",
        "conflict",
        "among",
        "contender",
        "hegemony",
        "imperialism",
        "moreover",
        "stimulate",
        "hampered",
        "economic",
        "growth",
        "since",
        "insecurity",
        "permanent",
        "military",
        "mobilization",
        "undermined",
        "productive",
        "activity",
        "historic",
        "function",
        "globalizing",
        "process",
        "eliminate",
        "national",
        "identity",
        "laying",
        "basis",
        "eventual",
        "cosmopolitan",
        "rebirth",
        "bauer",
        "saw",
        "nationalism",
        "dissipated",
        "force",
        "emerging",
        "world",
        "order",
        "framed",
        "defence",
        "national",
        "interest",
        "struggle",
        "transnational",
        "supremacy",
        "among",
        "elite",
        "local",
        "loyalty",
        "growing",
        "centralization",
        "political",
        "power",
        "abetted",
        "levelling",
        "force",
        "socialist",
        "movement",
        "internationalist",
        "pretension",
        "trend",
        "also",
        "underlay",
        "bauer",
        "called",
        "political",
        "pauperism",
        "generalised",
        "disqualification",
        "individual",
        "participation",
        "political",
        "activity",
        "conclusion",
        "process",
        "would",
        "perfect",
        "mass",
        "society",
        "bauer",
        "analyzed",
        "since",
        "s",
        "principle",
        "substance",
        "nondifferentiation",
        "conformity",
        "would",
        "reach",
        "ultimate",
        "extension",
        "could",
        "overthrown",
        "world",
        "imperialism",
        "would",
        "issue",
        "allembracing",
        "catastrophe",
        "apocalyptic",
        "end",
        "old",
        "christiangermanic",
        "order",
        "would",
        "new",
        "cultural",
        "possibility",
        "emerge",
        "though",
        "could",
        "predicted",
        "detail",
        "would",
        "involve",
        "emergence",
        "unprecedented",
        "creative",
        "individuality",
        "freed",
        "religious",
        "metaphysical",
        "illusion",
        "bauer",
        "likened",
        "present",
        "crisis",
        "end",
        "classical",
        "world",
        "roman",
        "imperialism",
        "study",
        "s",
        "located",
        "origin",
        "christianity",
        "second",
        "century",
        "ce",
        "concluding",
        "first",
        "gospel",
        "written",
        "hadrian",
        "ce",
        "though",
        "slightly",
        "predated",
        "pauline",
        "epistle",
        "bauer",
        "traced",
        "evolution",
        "christian",
        "idea",
        "hellenism",
        "stoicism",
        "deriving",
        "logo",
        "doctrine",
        "john",
        "gospel",
        "philo",
        "neoplatonic",
        "source",
        "herr",
        "dr",
        "hengstenberg",
        "denied",
        "christianity",
        "emerged",
        "directly",
        "judaism",
        "early",
        "work",
        "though",
        "stressed",
        "revolutionary",
        "power",
        "early",
        "christian",
        "religion",
        "source",
        "liberation",
        "excluded",
        "impoverished",
        "element",
        "roman",
        "empire",
        "final",
        "book",
        "described",
        "christianity",
        "socialist",
        "culmination",
        "greek",
        "roman",
        "history",
        "responding",
        "argument",
        "positive",
        "obituary",
        "bauer",
        "friedrich",
        "engels",
        "acknowledged",
        "importance",
        "bauer",
        "late",
        "work",
        "socialist",
        "critique",
        "religion",
        "sozialdemokrat",
        "karl",
        "kautsky",
        "book",
        "origin",
        "christianity",
        "applied",
        "bauer",
        "thesis",
        "bauer",
        "late",
        "writing",
        "identified",
        "sentiment",
        "pietistic",
        "feelingcertainty",
        "rather",
        "autonomous",
        "reason",
        "principal",
        "force",
        "shaping",
        "modern",
        "subjectivity",
        "study",
        "quaker",
        "pietism",
        "described",
        "passive",
        "inwardness",
        "sentiment",
        "dominant",
        "characteristic",
        "german",
        "enlightenment",
        "practical",
        "reason",
        "kant",
        "fichte",
        "merely",
        "translated",
        "inner",
        "voice",
        "pietist",
        "conscience",
        "rationalist",
        "idiom",
        "bauer",
        "also",
        "described",
        "pietism",
        "end",
        "christianity",
        "since",
        "destroyed",
        "dogma",
        "favour",
        "inner",
        "illumination",
        "personal",
        "moral",
        "rectitude",
        "consistent",
        "christianity",
        "revealed",
        "bauer",
        "continued",
        "define",
        "positive",
        "statutory",
        "religion",
        "exclusive",
        "dogma",
        "symbol",
        "still",
        "saw",
        "general",
        "course",
        "history",
        "dissipating",
        "dogma",
        "mere",
        "illusion",
        "discounted",
        "mobilizing",
        "potential",
        "religion",
        "modern",
        "imperial",
        "order",
        "posaune",
        "denounced",
        "schleiermacher",
        "effort",
        "restore",
        "dogmatic",
        "christianity",
        "appeal",
        "feeling",
        "dependency",
        "claimed",
        "force",
        "sentiment",
        "contrary",
        "schleiermacher",
        "supposition",
        "dissolve",
        "dogmatic",
        "religion",
        "personal",
        "conviction",
        "new",
        "world",
        "empire",
        "would",
        "end",
        "inner",
        "erosion",
        "religious",
        "belief",
        "rational",
        "speculation",
        "sentiment",
        "would",
        "effect",
        "transformation",
        "stringent",
        "antinationalism",
        "marked",
        "antisemitism",
        "characterized",
        "bauer",
        "later",
        "thought",
        "defended",
        "german",
        "culture",
        "political",
        "appropriation",
        "prussian",
        "austrian",
        "regime",
        "criticized",
        "insufficiency",
        "goethe",
        "example",
        "remained",
        "enthralled",
        "metaphysical",
        "tradition",
        "bauer",
        "stressed",
        "germany",
        "racial",
        "unit",
        "historical",
        "cultural",
        "artefact",
        "reinforced",
        "racial",
        "mixing",
        "racial",
        "purity",
        "barnikol",
        "p",
        "clear",
        "however",
        "element",
        "excluded",
        "mix",
        "unlike",
        "earlier",
        "treatment",
        "jewish",
        "question",
        "historical",
        "cultural",
        "religious",
        "asserted",
        "natural",
        "distinction",
        "race",
        "created",
        "impassable",
        "divide",
        "jew",
        "european",
        "bauer",
        "present",
        "position",
        "jew",
        "claim",
        "political",
        "significance",
        "jew",
        "throughout",
        "political",
        "spectrum",
        "testimony",
        "debility",
        "european",
        "culture",
        "approaching",
        "crisis",
        "greeted",
        "nationalsocialist",
        "author",
        "bauer",
        "late",
        "work",
        "contains",
        "prescient",
        "observation",
        "globalization",
        "world",
        "war",
        "affinity",
        "variety",
        "twentiethcentury",
        "ideological",
        "form",
        "socialism",
        "imperialism",
        "antisemitism",
        "contrast",
        "early",
        "work",
        "bespeaks",
        "original",
        "hegelian",
        "republicanism",
        "offer",
        "cogent",
        "analysis",
        "restoration",
        "political",
        "thought",
        "rise",
        "mass",
        "society",
        "intellectual",
        "legacy",
        "complex",
        "contentious"
    ]
}