{
    "main_text": "Religious Toleration\n4. Religious Toleration\n\nBayle’s argument for freedom of conscience does not provide a\nsufficient reason for sovereigns to tolerate minority religions in\ntheir realms. Freedom of conscience establishes that everyone has the\nsame right and duty to believe whatever appears true to them, and to\nact on the basis of apparently true beliefs. However, it is possible\nthat many religious people will believe that persecuting other\nreligions is a morally good action. Perhaps the Sovereign believes\nthat it is their own God-given duty to persecute others. It will\nfollow from Bayle’s argument for the freedom of conscience that\nall of these religious people will have the same right and duty to\npersecute one another. The result will be a morally justified war of\nall against all. Bayle devotes his magnus opus on religious\ntoleration, A Philosophical Commentary on These Words of Jesus\nChrist: Compel Them to Enter (1686–88), to forestalling\nthis unhappy consequence of his doctrine of freedom of conscience.\n\nA universal religious war will result from Bayle’s doctrine of\nfreedom of conscience only if religious believers think they have a\nright and duty to persecute other religions. This will happen only if\nbelievers think that God has commanded persecution, or in the absence\nof any clear direction from God, that the proposition\n“persecuting other religions is morally good” is evidently\ntrue after careful rational inspection. Bayle’s\nPhilosophical Commentary therefore argues that God has not\ncommanded persecution, and that persecuting other religions cannot\nappear good to any sincere rational person after careful examination.\nThe argumentative strategy of the book is in fact to use the second\nclaim to support the first: because persecution cannot appear good to\nany sincere rational person, therefore God has not commanded\npersecution.\n\nThe problem with Bayle’s argument is that there is a long\ntradition within Christianity of interpreting the Gospel of Luke,\nchapter 14, verse 23—which contains the words “Compel them\nto enter”—as a divine command to persecute. The context of\nthis passage is the parable of the banquet, in which a master commands\nhis servants to invite guests into his home to enjoy a feast. The\nservant reports that the invited guests are too busy. So, the master\norders the servant to go out into the highways and byways and compel\npeople to enter his home to enjoy the feast. The passage had been\ntaken by Catholics since St. Augustine to justify forcing\nnon-Catholics to join the Church.\n\nBayle responds to this argument for persecution by insisting that\nScripture requires careful interpretation, and interpretation requires\na criterion. The first chapter of the Philosophical\nCommentary establishes that the only possible criterion of the\ninterpretation of Scripture is individual conscience and rational\nexamination:\n\n\nI am very persuaded that before God made Adam hear any voice to teach\nhim what he should do, God had already spoken to Adam interiorly, by\nmaking him see the vast and immense idea of a supremely perfect Being,\nand the eternal laws of justice and equity. (OD II: 369)\n\n\nTherefore, in order to decide whether Luke 14:23 is a divine command\nto persecute, Bayle proposes to investigate whether persecution is\nconsistent with our perception of the eternal laws of justice and\nequity. In other words, the question of whether God has commanded\npersecution boils down to the question whether an obligation to\npersecute can be considered an evidently good command from the\nperspective of reason.\n\nBayle anticipates Kant once again in the first chapter of the\nPhilosophical Commentary where he establishes a test to\ndetermine what should be considered an eternal law of justice:\n\n\n[A]nyone who wants to know distinctly the natural light with respect\nto morality should elevate himself above his own personal interest,\nand above the customs of his country, and should ask himself in\ngeneral whether the action is just by considering this: if the action\nin question were proposed in a country where it had never been the\ncustom, and where people were free to adopt or not to adopt the\nproposed action, would the people in that country find, upon careful\nexamination, that the action was just enough to merit adoption? (OD\nII: 368–369).\n\n\nLike Kant’s categorical imperative, this test requires us to\nconsider morality as a form of legislation over a possible kingdom of\npeople who are guided by reason and examination. Moral laws that pass\nthis test will be universal: anyone in any land will be capable of\nappreciating their worth and will find the laws worthy of adoption.\nWhether or not a moral command is evident or not depends on whether or\nnot it can be adopted universally by all people. In order to apply\nthis test, a clear maxim must be articulated. The maxim Bayle\nconsiders throughout the Philosophical Commentary is this:\n“Compelling religious heretics to enter the true Church is\njust”. The meaning of “compelling to enter” that\nmotivates Bayle’s arguments is one that he learned first-hand\nwhile living in France: Compulsion is violence. It is dragooning. It\nis forced conversions. It is imprisonment. It is confiscation of\nmaterial goods. It is expelling one from home and country if they\ncontinue to refuse the “invitation”. It is barring certain\npeople from employment, school, or office. It is Bayle’s brother\ndying in a damp basement after being imprisoned unjustly by Catholics.\nIt is Bayle himself needing to change the spelling of his last name\nwhile in France and eventually to live as a refugee in Rotterdam for\nthinking twice about Catholicism. When put this way, one hardly needs\nan argument against such compulsion. To some extent, that’s\nBayle’s point: persecution is evidently bad, not good. But he\noffers nine arguments against persecution anyway.\n\nReligious persecution does not pass Bayle’s proto-Kantian\ncategorical imperative test, and therefore Luke 14:23 must not be\ninterpreted as a command to persecute. Why not? The First Part of the\nPhilosophical Commentary offers nine reasons why persecution\nfails the test. What most of these arguments have in common—and\nagain the proto-Kantian tone of the arguments cannot be\noverstated—is the claim that persecution is morally wrong\nbecause it leads Christians to contradict themselves. The essence of\nBaylean morality that emerges from these arguments is integrity:\nconsistency in one’s beliefs and between one’s beliefs and\nactions. Persecution is morally wrong because it necessarily entails\ninternal inconsistency: a lack of integrity. The first argument that\nBayle offers against persecution in Part 1, chapter 2, of the\nPhilosophical Commentary is also the best. Persecutors wish\nto bring people into the one true Church, presumably because they want\nthese people to love God properly. To love God properly is to form\ncorrect judgments about God and to have the right movements of the\nwill toward God (such as love). However, the actions of persecutors in\nBayle’s day, like “threats, imprisonment, exile, beatings,\ntorture” (OD II: 371), cannot possibly give rise to true\nknowledge and sincere love of God; on the contrary, persecutors’\nactions are far better suited to making people hate God. Persecutors\ncannot possibly report sincerely that they are motivated to persecute\nby the desire to spread the love and knowledge of God. Persecutors lie\nto themselves, to their victims, and to God.\n\nBayle scholars have grappled for a long time with this seemingly\ndogmatic assertion of Bayle, who is usually more circumspect, if not\ndownright skeptical. What if there was a sincere persecutor who, after\nlong examination of Luke 14:23 and the tradition of biblical\ncommentary surrounding it, came to the conscientious conviction that\nGod wished him to use force to bring heterodox people into conformity\nwith what the persecutor believes is the one true Church? Then does it\nnot follow from Bayle’s doctrine of the freedom of conscience\nthat the persecutor must persecute? This is known as the\n“Persecutor Paradox” or “Sincere Persecutor\nAporia” (see Solère 2016). Some scholars believe that\nthis objection undermines the foundation of Bayle’s moral\nargument for toleration, and requires Bayle to have recourse to a\nlegal or political solution to intolerance (Mori 1999 [2020]). Others\nbelieve that Bayle offers a valid response to the objection, or that\nthe objection is not very strong in the first place. The debate\nremains open.\n",
    "section_title": "4. Religious Toleration",
    "entry_title": "Pierre Bayle",
    "hierarchy_title": "Pierre Bayle || Religious Toleration",
    "tokenized_text": [
        "religious",
        "toleration",
        "religious",
        "toleration",
        "bayle",
        "argument",
        "freedom",
        "conscience",
        "provide",
        "sufficient",
        "reason",
        "sovereign",
        "tolerate",
        "minority",
        "religion",
        "realm",
        "freedom",
        "conscience",
        "establishes",
        "everyone",
        "right",
        "duty",
        "believe",
        "whatever",
        "appears",
        "true",
        "act",
        "basis",
        "apparently",
        "true",
        "belief",
        "however",
        "possible",
        "many",
        "religious",
        "people",
        "believe",
        "persecuting",
        "religion",
        "morally",
        "good",
        "action",
        "perhaps",
        "sovereign",
        "belief",
        "godgiven",
        "duty",
        "persecute",
        "others",
        "follow",
        "bayle",
        "argument",
        "freedom",
        "conscience",
        "religious",
        "people",
        "right",
        "duty",
        "persecute",
        "one",
        "another",
        "result",
        "morally",
        "justified",
        "war",
        "bayle",
        "devotes",
        "magnus",
        "opus",
        "religious",
        "toleration",
        "philosophical",
        "commentary",
        "word",
        "jesus",
        "christ",
        "compel",
        "enter",
        "forestalling",
        "unhappy",
        "consequence",
        "doctrine",
        "freedom",
        "conscience",
        "universal",
        "religious",
        "war",
        "result",
        "bayle",
        "doctrine",
        "freedom",
        "conscience",
        "religious",
        "believer",
        "think",
        "right",
        "duty",
        "persecute",
        "religion",
        "happen",
        "believer",
        "think",
        "god",
        "commanded",
        "persecution",
        "absence",
        "clear",
        "direction",
        "god",
        "proposition",
        "persecuting",
        "religion",
        "morally",
        "good",
        "evidently",
        "true",
        "careful",
        "rational",
        "inspection",
        "bayle",
        "philosophical",
        "commentary",
        "therefore",
        "argues",
        "god",
        "commanded",
        "persecution",
        "persecuting",
        "religion",
        "appear",
        "good",
        "sincere",
        "rational",
        "person",
        "careful",
        "examination",
        "argumentative",
        "strategy",
        "book",
        "fact",
        "use",
        "second",
        "claim",
        "support",
        "first",
        "persecution",
        "appear",
        "good",
        "sincere",
        "rational",
        "person",
        "therefore",
        "god",
        "commanded",
        "persecution",
        "problem",
        "bayle",
        "argument",
        "long",
        "tradition",
        "within",
        "christianity",
        "interpreting",
        "gospel",
        "luke",
        "chapter",
        "verse",
        "which",
        "contains",
        "word",
        "compel",
        "enter",
        "as",
        "divine",
        "command",
        "persecute",
        "context",
        "passage",
        "parable",
        "banquet",
        "master",
        "command",
        "servant",
        "invite",
        "guest",
        "home",
        "enjoy",
        "feast",
        "servant",
        "report",
        "invited",
        "guest",
        "busy",
        "master",
        "order",
        "servant",
        "go",
        "highway",
        "byway",
        "compel",
        "people",
        "enter",
        "home",
        "enjoy",
        "feast",
        "passage",
        "taken",
        "catholic",
        "since",
        "st",
        "augustine",
        "justify",
        "forcing",
        "noncatholic",
        "join",
        "church",
        "bayle",
        "responds",
        "argument",
        "persecution",
        "insisting",
        "scripture",
        "requires",
        "careful",
        "interpretation",
        "interpretation",
        "requires",
        "criterion",
        "first",
        "chapter",
        "philosophical",
        "commentary",
        "establishes",
        "possible",
        "criterion",
        "interpretation",
        "scripture",
        "individual",
        "conscience",
        "rational",
        "examination",
        "persuaded",
        "god",
        "made",
        "adam",
        "hear",
        "voice",
        "teach",
        "god",
        "already",
        "spoken",
        "adam",
        "interiorly",
        "making",
        "see",
        "vast",
        "immense",
        "idea",
        "supremely",
        "perfect",
        "eternal",
        "law",
        "justice",
        "equity",
        "od",
        "ii",
        "therefore",
        "order",
        "decide",
        "whether",
        "luke",
        "divine",
        "command",
        "persecute",
        "bayle",
        "proposes",
        "investigate",
        "whether",
        "persecution",
        "consistent",
        "perception",
        "eternal",
        "law",
        "justice",
        "equity",
        "word",
        "question",
        "whether",
        "god",
        "commanded",
        "persecution",
        "boil",
        "question",
        "whether",
        "obligation",
        "persecute",
        "considered",
        "evidently",
        "good",
        "command",
        "perspective",
        "reason",
        "bayle",
        "anticipates",
        "kant",
        "first",
        "chapter",
        "philosophical",
        "commentary",
        "establishes",
        "test",
        "determine",
        "considered",
        "eternal",
        "law",
        "justice",
        "nyone",
        "want",
        "know",
        "distinctly",
        "natural",
        "light",
        "respect",
        "morality",
        "elevate",
        "personal",
        "interest",
        "custom",
        "country",
        "ask",
        "general",
        "whether",
        "action",
        "considering",
        "action",
        "question",
        "proposed",
        "country",
        "never",
        "custom",
        "people",
        "free",
        "adopt",
        "adopt",
        "proposed",
        "action",
        "would",
        "people",
        "country",
        "find",
        "upon",
        "careful",
        "examination",
        "action",
        "enough",
        "merit",
        "adoption",
        "od",
        "ii",
        "like",
        "kant",
        "categorical",
        "imperative",
        "test",
        "requires",
        "u",
        "consider",
        "morality",
        "form",
        "legislation",
        "possible",
        "kingdom",
        "people",
        "guided",
        "reason",
        "examination",
        "moral",
        "law",
        "pas",
        "test",
        "universal",
        "anyone",
        "land",
        "capable",
        "appreciating",
        "worth",
        "find",
        "law",
        "worthy",
        "adoption",
        "whether",
        "moral",
        "command",
        "evident",
        "depends",
        "whether",
        "adopted",
        "universally",
        "people",
        "order",
        "apply",
        "test",
        "clear",
        "maxim",
        "must",
        "articulated",
        "maxim",
        "bayle",
        "considers",
        "throughout",
        "philosophical",
        "commentary",
        "compelling",
        "religious",
        "heretic",
        "enter",
        "true",
        "church",
        "meaning",
        "compelling",
        "enter",
        "motivates",
        "bayle",
        "argument",
        "one",
        "learned",
        "firsthand",
        "living",
        "france",
        "compulsion",
        "violence",
        "dragooning",
        "forced",
        "conversion",
        "imprisonment",
        "confiscation",
        "material",
        "good",
        "expelling",
        "one",
        "home",
        "country",
        "continue",
        "refuse",
        "invitation",
        "barring",
        "certain",
        "people",
        "employment",
        "school",
        "office",
        "bayle",
        "brother",
        "dying",
        "damp",
        "basement",
        "imprisoned",
        "unjustly",
        "catholic",
        "bayle",
        "needing",
        "change",
        "spelling",
        "last",
        "name",
        "france",
        "eventually",
        "live",
        "refugee",
        "rotterdam",
        "thinking",
        "twice",
        "catholicism",
        "put",
        "way",
        "one",
        "hardly",
        "need",
        "argument",
        "compulsion",
        "extent",
        "bayle",
        "point",
        "persecution",
        "evidently",
        "bad",
        "good",
        "offer",
        "nine",
        "argument",
        "persecution",
        "anyway",
        "religious",
        "persecution",
        "pas",
        "bayle",
        "protokantian",
        "categorical",
        "imperative",
        "test",
        "therefore",
        "luke",
        "must",
        "interpreted",
        "command",
        "persecute",
        "first",
        "part",
        "philosophical",
        "commentary",
        "offer",
        "nine",
        "reason",
        "persecution",
        "fails",
        "test",
        "argument",
        "commonand",
        "protokantian",
        "tone",
        "argument",
        "overstatedis",
        "claim",
        "persecution",
        "morally",
        "wrong",
        "lead",
        "christian",
        "contradict",
        "essence",
        "baylean",
        "morality",
        "emerges",
        "argument",
        "integrity",
        "consistency",
        "one",
        "belief",
        "one",
        "belief",
        "action",
        "persecution",
        "morally",
        "wrong",
        "necessarily",
        "entail",
        "internal",
        "inconsistency",
        "lack",
        "integrity",
        "first",
        "argument",
        "bayle",
        "offer",
        "persecution",
        "part",
        "chapter",
        "philosophical",
        "commentary",
        "also",
        "best",
        "persecutor",
        "wish",
        "bring",
        "people",
        "one",
        "true",
        "church",
        "presumably",
        "want",
        "people",
        "love",
        "god",
        "properly",
        "love",
        "god",
        "properly",
        "form",
        "correct",
        "judgment",
        "god",
        "right",
        "movement",
        "toward",
        "god",
        "love",
        "however",
        "action",
        "persecutor",
        "bayle",
        "day",
        "like",
        "threat",
        "imprisonment",
        "exile",
        "beating",
        "torture",
        "od",
        "ii",
        "possibly",
        "give",
        "rise",
        "true",
        "knowledge",
        "sincere",
        "love",
        "god",
        "contrary",
        "persecutor",
        "action",
        "far",
        "better",
        "suited",
        "making",
        "people",
        "hate",
        "god",
        "persecutor",
        "possibly",
        "report",
        "sincerely",
        "motivated",
        "persecute",
        "desire",
        "spread",
        "love",
        "knowledge",
        "god",
        "persecutor",
        "lie",
        "victim",
        "god",
        "bayle",
        "scholar",
        "grappled",
        "long",
        "time",
        "seemingly",
        "dogmatic",
        "assertion",
        "bayle",
        "usually",
        "circumspect",
        "downright",
        "skeptical",
        "sincere",
        "persecutor",
        "long",
        "examination",
        "luke",
        "tradition",
        "biblical",
        "commentary",
        "surrounding",
        "came",
        "conscientious",
        "conviction",
        "god",
        "wished",
        "use",
        "force",
        "bring",
        "heterodox",
        "people",
        "conformity",
        "persecutor",
        "belief",
        "one",
        "true",
        "church",
        "follow",
        "bayle",
        "doctrine",
        "freedom",
        "conscience",
        "persecutor",
        "must",
        "persecute",
        "known",
        "persecutor",
        "paradox",
        "sincere",
        "persecutor",
        "aporia",
        "see",
        "solère",
        "scholar",
        "believe",
        "objection",
        "undermines",
        "foundation",
        "bayle",
        "moral",
        "argument",
        "toleration",
        "requires",
        "bayle",
        "recourse",
        "legal",
        "political",
        "solution",
        "intolerance",
        "mori",
        "others",
        "believe",
        "bayle",
        "offer",
        "valid",
        "response",
        "objection",
        "objection",
        "strong",
        "first",
        "place",
        "debate",
        "remains",
        "open"
    ]
}