{
    "main_text": "The Ontology of Art: Phenomenalism and Friends\n3. The Ontology of Art: Phenomenalism and Friends\n\nThe first chapter of Aesthetics is in part devoted to the\nontology of art—or aesthetic objects, as Beardsley was then wont\nto say. The term “work of art” was largely avoided by him\nat the time, because, as he later admitted, he did\n\n\nnot [want] to become enmeshed… in [the question of the\ndefinition of “work of art”, a question] that…\n[had] not convince[d] [him] of its importance or promise[d] any very\nsatisfactory and agreeable resolution. (Aesth:\nxviii)\n\n\nThat was to change, and Beardsley later did offer a definition of art.\nIn any case, it’s the ontology of “aesthetic\nobjects” that’s first discussed in\nAesthetics.\n\nThe ontology argued for begins with a distinction between physical\nobjects and perceptual objects. In speaking of a thing being six feet\nby six feet in size and at rest, we’re speaking of a physical\nobject; in speaking of a thing being dynamic and frightening,\nwe’re speaking of a perceptual object. Perceptual objects are\nthe objects we perceive, objects “some of whose qualities, at\nleast, are open to direct sensory awareness” (Aesth:\n31). Aesthetic objects are a subset of perceptual objects. This\ndoesn’t necessarily mean that aesthetic objects aren’t\nphysical objects, however. Aesthetic objects might be other than\nphysical objects—the conceptual distinction might mark a real\ndistinction—or they might be physical objects—the\nconceptual distinction, though somewhat misleadingly couched in terms\nof objects, might simply mark “two aspects of the same”\nthing (Aesth: 33). At first indifferent as to which\nalternative is opted for—Beardsley mentions that he\ndoesn’t “see that it makes much difference which\nterminology [that of objects or aspects] is chosen”\n(ibid.)—he then proceeds to develop an ontology that stresses\nobjects more than aspects.\n\nThe ontology is phenomenalistic in its leanings, though open to a more\nphysicalist interpretation. A presentation of an aesthetic object is\ndefined as the object as experienced by a particular person on a\nparticular occasion. Essentially, presentations are sense-data of\naesthetic objects. Aesthetic objects aren’t presentations,\nhowever, for that would invite not just an uncontrollable population\nexplosion of aesthetic objects, but chaos in criticism; and neither\nare aesthetic objects classes of presentations, for aesthetic objects\nmust have at least some perceptual properties, but classes, as\nabstract entities, have none. However,\n\n\nwhenever we want to say anything about an aesthetic object, we can\ntalk about its presentations. (Aesth: 54)\n\n\nThis, Beardsley says,\n\n\ndoes not “reduce” the aesthetic object to a presentation;\nit only analyzes statements about aesthetic objects into\nstatements about presentations (Aesth: 54).\n\n\nIn effect, this is a form of linguistic phenomenalism, and commits\nBeardsley to adequate translations of statements about aesthetic\nobjects into statements about the presentations of such\nobjects—in effect, statements about experiences of such objects.\nAs linguistic phenomenalism as a general ontology—or surrogate\nfor ontology—has met with very strong criticism over the years,\nBeardsley’s ontology would have problems enough if it stopped\nhere.\n\nBut it doesn’t. Not satisfied, Beardsley presses on to\ndistinguish\n\nthe artifact—the play itself, say, as written\ndown—from\na particular production of it—the Old Vic’s\nproduction, as opposed to the Marquette University theater\ndepartment’s production—from\na particular performance of it—last night’s\nperformance in the Helfaer Theater—from\na particular presentation of it—the play as it shows up in\nPeter Alelyunas’s experience of it, upon attending last\nnight’s performance.\n\n\nThe same distinctions hold across the arts, though differently in\ndifferent arts, and somewhat more naturally in some than others. There\nis Beethoven’s D Minor Symphony (the artifact), a\nproduction of it (The Philadelphia Symphony Orchestra’s\nrecording of it), a particular performance of it (my playing the\nrecording last night, in my house), and particular presentations of it\n(mine and other people’s experiences of it last night, in my\nhouse). At least in many arts, a single artifact can have many\nproductions; a single production can have many performances; and a\nsingle performance can give rise to many presentations. As Beardsley\nnotes, these distinctions collapse to some extent in some of the arts,\nand would have to be stretched a bit to fit them all. In reading a\npoem silently, he says, the production is the presentation (and I\nwould also think the performance); “in architecture, the\narchitect’s plans are the artifact; the completed building is\nthe production” (Aesth: 57–58) (and also\npresumably the performance); and in painting and sculpture, “the\ndistinction between artifact and production almost disappears”\n(Aesth: 58) (with the performance presumably being identical\nwith both).\n\nBut what is the aesthetic object, the object of critical attention?\nIt’s not a presentation or class of presentations, and\nit’s not the artifact—Beethoven’s 9th\nSymphony, for example. If the aesthetic object were the artifact,\nit would have contradictory characteristics, since different\nrecordings of the 9th have different, incompatible\ncharacteristics: some are shorter than 60 minutes long, some longer.\nWhat’s left, and what the aesthetic object must be, is the\nproduction. Thus the primary object of critical attention is the\nproduction of an artifact, and the basic job of the critic is to\ndescribe, interpret, and evaluate such productions.\n\nWhile interesting, original, and elegant, this position has its\nproblems. Difficulties with carrying out the translation program that\nBeardsley is committed to aside, linguistic phenomenalism is little\nmore than an attempt to enjoy the benefits of a reductive, sense-data\nontology without paying the price for it. Reductive translations have\ncommitments; there would be little point in proposing and defending an\nelaborate, difficult, counterintuitive, and otherwise inexplicable\ntranslation program, even in schematic form, unless it had some point\nbeyond translation for the sake of translation. There’s either\nan ontology and a philosophical purpose behind such\ntranslations—and there certainly seems to be both (an adequate\nreductive translation of ‘p’ as\n‘q’ entails commitment only to the entities\nmentioned in ‘q’)—or there is not—in\nwhich case the possibility of such translations may be of interest to\nlinguists and those who like odd parlor games but no one else. In\nshort, arguing that one can, in principle, avoid speaking of one sort\nof entity in favor of another is indirect ontology if it’s\nphilosophy at all, and avoiding taking an explicit stand on ontology\ndoesn’t change the fact. Beardsley would thus seem to be\ncommitted to phenomenalism, despite his explicit claim that aesthetic\nobjects aren’t presentations.\n\nBut presentations are ill-suited objects of critical attention in any\ncase. They’re too numerous and variable to ground objective\ncriticism, and thus too unwieldy to make criticism of any kind worth\nthe effort. In addition, taking aesthetic objects to be presentations\nconflicts with much of the practice—that is, many of the\nremarks—of critics themselves. None of this would be news to\nBeardsley—he says as much himself in several places—but it\ndoes mean that he shouldn’t have walked down the phenomenalist\nroad as far as he did.\n\nPhenomenalism, even in linguistic dress, also conflicts with\nidentifying aesthetic objects with productions, since in a great many\ncases the production of an aesthetic object isn’t the same thing\nas a presentation of it. But even if phenomenalism is put to the side\nand Beardsley is simply taken at his word, and aesthetic objects are\nidentified with productions, there are still anomalies. The first and\nmost important is that the ontological status of aesthetic objects\nwould be variable to the point of being of little philosophical\ninterest. A production of a novel, if read silently, is something\nmental, a series of thoughts, perhaps conjoined with images. The\nproduction of a play or symphony, however, isn’t mental at all,\nbut a publicly accessible event or process. It thus has whatever\nontological status events or processes do. In architecture, the\nproduction is a building (or a bridge or a walkway), and thus a\nphysical object (or a cultural object, with physical properties, some\nwould say). Such wide variability suggests that there’s no real\nontology of art at all, nothing firm, finite, or systematically\nrelated enough among the arts to be worth taking note of. A second\nproblem with taking aesthetic objects to be productions is that, since\nsome aesthetic objects are mental objects, the problems with\nphenomenalism noted at the end of the last paragraph reemerge in at\nleast some cases, literature among them. A third problem, one in\neffect already noted, is that even within one art aesthetic\nobjects would have a shifting ontological status. In the case of\npoetry, for example, if a poem is read silently, the production, and\nthus the aesthetic object, is a mental thing, but if the same poem is\nread publicly, to an audience, the production, and thus the aesthetic\nobject, is an event.\n\nBy themselves, these objections don't refute Beardsley’s views\non the ontology of art. What they show is the price that has to be\npaid for them. Perhaps alternative views offer less insight, or\nperhaps they offer more insight but at a higher cost, that is,\ngenerate more or even greater anomalies. Beardsley’s views might\nstill be the best, all things considered. If so, the moral to be drawn\nmay be that the ontology of art isn’t a very fruitful or\nimportant area of philosophical investigation, and that no harm to\nphilosophy or art criticism is done by ignoring it.\n",
    "section_title": "3. The Ontology of Art: Phenomenalism and Friends",
    "entry_title": "Beardsley’s Aesthetics",
    "hierarchy_title": "Beardsley’s Aesthetics || The Ontology of Art: Phenomenalism and Friends",
    "tokenized_text": [
        "ontology",
        "art",
        "phenomenalism",
        "friend",
        "ontology",
        "art",
        "phenomenalism",
        "friend",
        "first",
        "chapter",
        "aesthetic",
        "part",
        "devoted",
        "ontology",
        "artor",
        "aesthetic",
        "object",
        "beardsley",
        "wont",
        "say",
        "term",
        "work",
        "art",
        "largely",
        "avoided",
        "time",
        "later",
        "admitted",
        "want",
        "become",
        "enmeshed",
        "question",
        "definition",
        "work",
        "art",
        "question",
        "that",
        "convince",
        "importance",
        "promise",
        "satisfactory",
        "agreeable",
        "resolution",
        "aesth",
        "xviii",
        "change",
        "beardsley",
        "later",
        "offer",
        "definition",
        "art",
        "case",
        "ontology",
        "aesthetic",
        "object",
        "first",
        "discussed",
        "aesthetic",
        "ontology",
        "argued",
        "begin",
        "distinction",
        "physical",
        "object",
        "perceptual",
        "object",
        "speaking",
        "thing",
        "six",
        "foot",
        "six",
        "foot",
        "size",
        "rest",
        "speaking",
        "physical",
        "object",
        "speaking",
        "thing",
        "dynamic",
        "frightening",
        "speaking",
        "perceptual",
        "object",
        "perceptual",
        "object",
        "object",
        "perceive",
        "object",
        "whose",
        "quality",
        "least",
        "open",
        "direct",
        "sensory",
        "awareness",
        "aesth",
        "aesthetic",
        "object",
        "subset",
        "perceptual",
        "object",
        "necessarily",
        "mean",
        "aesthetic",
        "object",
        "physical",
        "object",
        "however",
        "aesthetic",
        "object",
        "might",
        "physical",
        "objectsthe",
        "conceptual",
        "distinction",
        "might",
        "mark",
        "real",
        "distinctionor",
        "might",
        "physical",
        "objectsthe",
        "conceptual",
        "distinction",
        "though",
        "somewhat",
        "misleadingly",
        "couched",
        "term",
        "object",
        "might",
        "simply",
        "mark",
        "two",
        "aspect",
        "thing",
        "aesth",
        "first",
        "indifferent",
        "alternative",
        "opted",
        "forbeardsley",
        "mention",
        "see",
        "make",
        "much",
        "difference",
        "terminology",
        "object",
        "aspect",
        "chosen",
        "ibid",
        "he",
        "proceeds",
        "develop",
        "ontology",
        "stress",
        "object",
        "aspect",
        "ontology",
        "phenomenalistic",
        "leaning",
        "though",
        "open",
        "physicalist",
        "interpretation",
        "presentation",
        "aesthetic",
        "object",
        "defined",
        "object",
        "experienced",
        "particular",
        "person",
        "particular",
        "occasion",
        "essentially",
        "presentation",
        "sensedata",
        "aesthetic",
        "object",
        "aesthetic",
        "object",
        "presentation",
        "however",
        "would",
        "invite",
        "uncontrollable",
        "population",
        "explosion",
        "aesthetic",
        "object",
        "chaos",
        "criticism",
        "neither",
        "aesthetic",
        "object",
        "class",
        "presentation",
        "aesthetic",
        "object",
        "must",
        "least",
        "perceptual",
        "property",
        "class",
        "abstract",
        "entity",
        "none",
        "however",
        "whenever",
        "want",
        "say",
        "anything",
        "aesthetic",
        "object",
        "talk",
        "presentation",
        "aesth",
        "beardsley",
        "say",
        "reduce",
        "aesthetic",
        "object",
        "presentation",
        "analyzes",
        "statement",
        "aesthetic",
        "object",
        "statement",
        "presentation",
        "aesth",
        "effect",
        "form",
        "linguistic",
        "phenomenalism",
        "commits",
        "beardsley",
        "adequate",
        "translation",
        "statement",
        "aesthetic",
        "object",
        "statement",
        "presentation",
        "objectsin",
        "effect",
        "statement",
        "experience",
        "object",
        "linguistic",
        "phenomenalism",
        "general",
        "ontologyor",
        "surrogate",
        "ontologyhas",
        "met",
        "strong",
        "criticism",
        "year",
        "beardsley",
        "ontology",
        "would",
        "problem",
        "enough",
        "stopped",
        "satisfied",
        "beardsley",
        "press",
        "distinguish",
        "artifactthe",
        "play",
        "say",
        "written",
        "downfrom",
        "particular",
        "production",
        "itthe",
        "old",
        "vic",
        "production",
        "opposed",
        "marquette",
        "university",
        "theater",
        "department",
        "productionfrom",
        "particular",
        "performance",
        "itlast",
        "night",
        "performance",
        "helfaer",
        "theaterfrom",
        "particular",
        "presentation",
        "itthe",
        "play",
        "show",
        "peter",
        "alelyunas",
        "experience",
        "upon",
        "attending",
        "last",
        "night",
        "performance",
        "distinction",
        "hold",
        "across",
        "art",
        "though",
        "differently",
        "different",
        "art",
        "somewhat",
        "naturally",
        "others",
        "beethoven",
        "minor",
        "symphony",
        "artifact",
        "production",
        "philadelphia",
        "symphony",
        "orchestra",
        "recording",
        "particular",
        "performance",
        "playing",
        "recording",
        "last",
        "night",
        "house",
        "particular",
        "presentation",
        "mine",
        "people",
        "experience",
        "last",
        "night",
        "house",
        "least",
        "many",
        "art",
        "single",
        "artifact",
        "many",
        "production",
        "single",
        "production",
        "many",
        "performance",
        "single",
        "performance",
        "give",
        "rise",
        "many",
        "presentation",
        "beardsley",
        "note",
        "distinction",
        "collapse",
        "extent",
        "art",
        "would",
        "stretched",
        "bit",
        "fit",
        "reading",
        "poem",
        "silently",
        "say",
        "production",
        "presentation",
        "would",
        "also",
        "think",
        "performance",
        "architecture",
        "architect",
        "plan",
        "artifact",
        "completed",
        "building",
        "production",
        "aesth",
        "also",
        "presumably",
        "performance",
        "painting",
        "sculpture",
        "distinction",
        "artifact",
        "production",
        "almost",
        "disappears",
        "aesth",
        "performance",
        "presumably",
        "identical",
        "aesthetic",
        "object",
        "object",
        "critical",
        "attention",
        "presentation",
        "class",
        "presentation",
        "artifactbeethoven",
        "th",
        "symphony",
        "example",
        "aesthetic",
        "object",
        "artifact",
        "would",
        "contradictory",
        "characteristic",
        "since",
        "different",
        "recording",
        "th",
        "different",
        "incompatible",
        "characteristic",
        "shorter",
        "minute",
        "long",
        "longer",
        "left",
        "aesthetic",
        "object",
        "must",
        "production",
        "thus",
        "primary",
        "object",
        "critical",
        "attention",
        "production",
        "artifact",
        "basic",
        "job",
        "critic",
        "describe",
        "interpret",
        "evaluate",
        "production",
        "interesting",
        "original",
        "elegant",
        "position",
        "problem",
        "difficulty",
        "carrying",
        "translation",
        "program",
        "beardsley",
        "committed",
        "aside",
        "linguistic",
        "phenomenalism",
        "little",
        "attempt",
        "enjoy",
        "benefit",
        "reductive",
        "sensedata",
        "ontology",
        "without",
        "paying",
        "price",
        "reductive",
        "translation",
        "commitment",
        "would",
        "little",
        "point",
        "proposing",
        "defending",
        "elaborate",
        "difficult",
        "counterintuitive",
        "otherwise",
        "inexplicable",
        "translation",
        "program",
        "even",
        "schematic",
        "form",
        "unless",
        "point",
        "beyond",
        "translation",
        "sake",
        "translation",
        "either",
        "ontology",
        "philosophical",
        "purpose",
        "behind",
        "translationsand",
        "certainly",
        "seems",
        "adequate",
        "reductive",
        "translation",
        "p",
        "q",
        "entail",
        "commitment",
        "entity",
        "mentioned",
        "q",
        "or",
        "notin",
        "case",
        "possibility",
        "translation",
        "may",
        "interest",
        "linguist",
        "like",
        "odd",
        "parlor",
        "game",
        "one",
        "else",
        "short",
        "arguing",
        "one",
        "principle",
        "avoid",
        "speaking",
        "one",
        "sort",
        "entity",
        "favor",
        "another",
        "indirect",
        "ontology",
        "philosophy",
        "avoiding",
        "taking",
        "explicit",
        "stand",
        "ontology",
        "change",
        "fact",
        "beardsley",
        "would",
        "thus",
        "seem",
        "committed",
        "phenomenalism",
        "despite",
        "explicit",
        "claim",
        "aesthetic",
        "object",
        "presentation",
        "presentation",
        "illsuited",
        "object",
        "critical",
        "attention",
        "case",
        "numerous",
        "variable",
        "ground",
        "objective",
        "criticism",
        "thus",
        "unwieldy",
        "make",
        "criticism",
        "kind",
        "worth",
        "effort",
        "addition",
        "taking",
        "aesthetic",
        "object",
        "presentation",
        "conflict",
        "much",
        "practicethat",
        "many",
        "remarksof",
        "critic",
        "none",
        "would",
        "news",
        "beardsleyhe",
        "say",
        "much",
        "several",
        "placesbut",
        "mean",
        "walked",
        "phenomenalist",
        "road",
        "far",
        "phenomenalism",
        "even",
        "linguistic",
        "dress",
        "also",
        "conflict",
        "identifying",
        "aesthetic",
        "object",
        "production",
        "since",
        "great",
        "many",
        "case",
        "production",
        "aesthetic",
        "object",
        "thing",
        "presentation",
        "even",
        "phenomenalism",
        "put",
        "side",
        "beardsley",
        "simply",
        "taken",
        "word",
        "aesthetic",
        "object",
        "identified",
        "production",
        "still",
        "anomaly",
        "first",
        "important",
        "ontological",
        "status",
        "aesthetic",
        "object",
        "would",
        "variable",
        "point",
        "little",
        "philosophical",
        "interest",
        "production",
        "novel",
        "read",
        "silently",
        "something",
        "mental",
        "series",
        "thought",
        "perhaps",
        "conjoined",
        "image",
        "production",
        "play",
        "symphony",
        "however",
        "mental",
        "publicly",
        "accessible",
        "event",
        "process",
        "thus",
        "whatever",
        "ontological",
        "status",
        "event",
        "process",
        "architecture",
        "production",
        "building",
        "bridge",
        "walkway",
        "thus",
        "physical",
        "object",
        "cultural",
        "object",
        "physical",
        "property",
        "would",
        "say",
        "wide",
        "variability",
        "suggests",
        "real",
        "ontology",
        "art",
        "nothing",
        "firm",
        "finite",
        "systematically",
        "related",
        "enough",
        "among",
        "art",
        "worth",
        "taking",
        "note",
        "second",
        "problem",
        "taking",
        "aesthetic",
        "object",
        "production",
        "since",
        "aesthetic",
        "object",
        "mental",
        "object",
        "problem",
        "phenomenalism",
        "noted",
        "end",
        "last",
        "paragraph",
        "reemerge",
        "least",
        "case",
        "literature",
        "among",
        "third",
        "problem",
        "one",
        "effect",
        "already",
        "noted",
        "even",
        "within",
        "one",
        "art",
        "aesthetic",
        "object",
        "would",
        "shifting",
        "ontological",
        "status",
        "case",
        "poetry",
        "example",
        "poem",
        "read",
        "silently",
        "production",
        "thus",
        "aesthetic",
        "object",
        "mental",
        "thing",
        "poem",
        "read",
        "publicly",
        "audience",
        "production",
        "thus",
        "aesthetic",
        "object",
        "event",
        "objection",
        "nt",
        "refute",
        "beardsley",
        "view",
        "ontology",
        "art",
        "show",
        "price",
        "paid",
        "perhaps",
        "alternative",
        "view",
        "offer",
        "le",
        "insight",
        "perhaps",
        "offer",
        "insight",
        "higher",
        "cost",
        "generate",
        "even",
        "greater",
        "anomaly",
        "beardsley",
        "view",
        "might",
        "still",
        "best",
        "thing",
        "considered",
        "moral",
        "drawn",
        "may",
        "ontology",
        "art",
        "fruitful",
        "important",
        "area",
        "philosophical",
        "investigation",
        "harm",
        "philosophy",
        "art",
        "criticism",
        "done",
        "ignoring"
    ]
}