{
    "main_text": "The Coming of Age: The Other Again\n12. The Coming of Age: The Other Again\n\nWe need to read A Very Easy Death and Adieux within\nthe context of the analyses of The Coming of Age to fully\nappreciate Beauvoir’s role as witness. The project of The\nComing of Age is similar to that of The Second Sex. Like\nThe Second Sex, it focuses on a group of people designated as\nOther; like The Second Sex it exposes the mythical status of\nthe “facts” about aging and the aged; and like The\nSecond Sex it indicts society for its dehumanization of those it\ndesignates as Other. The Coming of Age also emulates The\nSecond Sex in its method and scope. It brings a phenomenological\nlens to bear on biological, psychological, historical, economic, and\nsociological factors in order to understand the phenomenon of a\nparticular kind of marginalized otherness. \n\nIn The Coming of Age, Beauvoir considers the injustices\nendured by the aged. She describes the experiences of old age and\nargues that it throws one into the position of the Other not by\nnecessity, but as a result of culturally produced stigmas and a\nsocietal loathing of aging. Thus, while the process of aging may be\ninescapable, old age as a situation of Otherness is not. This\nnon-subject status is a matter of the conditions of experience that\nforeclose transcendence, including myths, societal attitudes, and the\neconomic conditions of the aged. Whereas in The Second Sex,\nBeauvoir accused patriarchy of depriving women of their subject\nstatus, The Coming of Age argues that the non-subject status\nof the aged can be traced to the fact that they are barred from\nexistential projects and meaningful relationships with others. To\nexperience old age in this way, Beauvoir argues, is to be denied\none’s humanity. “The old man”, Beauvoir writes,\n“looks to active members of the community like one of a\n‘different species’” because he is not engaged in a\nproject (1970[1972], 231, cf. 1972, 217).\n\nLike The Second Sex, which attended to the givens of biology\nwithout allowing them to determine the meaning of the subject, The\nComing of Age also gives biology its due. The lack of engagement\nof the aged, Beauvoir notes, is in part imposed from without and in\npart comes from within; for as we age, the body is transformed from an\ninstrument that engages the world into a hindrance that makes our\naccess to the world difficult. The point of The Coming of\nAge, however, is that it is unjust to use these difficulties to\njustify reducing the aged to the status of the Other.\nAdieux’s witnessing makes this point clearly. However\ndiminished Sartre’s body became, it never severed him from his\nprojects. He could not have sustained his work by himself, however.\nRather, he was in a situation where others refused to marginalize him.\nThey did not equate his diminished bodily capacities with a diminished\nhumanity. The Coming of Age argues that the situation of a\nprivileged Sartre ought to be our common destiny.\n\nIn a world that recognized the phenomenological truth of the body, the\nexistential truth of freedom, the Marxist truth of exploitation and\nthe human truth of the bond, the derogatory category of the Other\nwould be eradicated. Neither the aged nor women, nor anyone by virtue\nof their race, class, ethnicity or religion would find themselves\nrendered inessential. Beauvoir knows that it is too much to hope for\nsuch a world. She understands the lures of domination and violence.\nThroughout her career, however, she used philosophical and literary\ntools to reveal the possibilities of such a world and appealed to us\nto work for it.\n13. Life Writings: Situation, Becoming and the Self-Other Relation\n\nBeauvoir’s practices of writing the self were deeply connected\nto her philosophical ideas. Indeed, for Beauvoir, living is\nphilosophy, a point that is evident in her autobiographical works.\nBeauvoir wrote a four-volume autobiography where she recounts\nfifty-four years of her life, from the years 1908–1962. In\nMemoirs of a Dutiful Daughter (1958), Beauvoir narrates the\nformative years of 1908–1929, while The Prime of Life\ncovers 1929–1944. Force of Circumstance (1963) is\nwritten in two volumes, 1944–1952 (After the War) and\n1952–1962 (Hard Times). Beauvoir was also a devoted\ndiarist. Her diaries, including Diary of a Philosophy Student\nVolume 1 (1926–27) and Volume 2 (1928–29),\nand her Wartime Diaries, often complicate the narration of\nher autobiographies, exposing different details of her life and thus\nexpose a different Beauvoir to the reader. For Beauvoir, diary writing\nwas an integral part of self-understanding and self-making. The\nsignificance of these autobiographical works is threefold. They offer\na detailed account of events, experiences and relations with others\nout of which Beauvoir made her self, that is, these works reveal how\nshe became Beauvoir. They also shed light on Beauvoir’s\nphilosophical trajectory, intellectual influences, the ideas and\nthemes central to her novels and philosophical works, and they offer\nglaring evidence that her philosophical ideas developed prior to,\nalongside, and often against Sartre’s.\n\nIn writing her life, it is evident that the notion of situation, the\nset of concrete circumstances, including one’s embodiment that\nsignificantly shapes but does not fix one’s existence, is\ncentral to Beauvoir’s philosophy of self. It is only in living\nand living out one’s choices, constrained but not determined by\nsocial and historical context, that one’s existence takes shape.\nBeauvoir’s autobiographical writings make clear that her\nsituation as a girl raised in a Catholic, bourgeois household, as a\nwoman with a certain level of independence and privilege, an\nintellectual, a writer, a leftist living amidst and in the aftermath\nof war and colonial projects, are all generative circumstances for\nher. She is neither the mere product of circumstance nor does she just\nwill herself into existence. Yet, her understanding of\n‘situation’ takes time to develop, as Beauvoir herself\nnotes that she did not always recognize the force of circumstance.\nThough, perhaps that she did not recognize this to be the case was a\nconstraint of her own particular situation. In The Prime of\nLife, for instance, the Beauvoir we read about is still full of\nbourgeois idealism and is focused on happiness, which she marks as\ncharacteristic of the times. Ultimately, in narrating her experience,\nBeauvoir discloses the connection between the personal and the\ncollective, and the distinctness of a self unfolding in time.\n\nThe ethical significance Beauvoir places on the self-other relation is\nalso central to her autobiographical writings. Although it is not\nuntil 1939 that she rejects individualism, Beauvoir’s younger\nyears show a deep interest in her relationships with others. Her\nrelationship with her parents and her love for Zaza and her cousin\nJacques, for instance, reveal the capacity of others to open and close\nthe world and to make and remake the self. Indeed, there is a robust\nphilosophy of love across Beauvoir’s personal writings,\nincluding her love with Zaza (fictionalized in Inseparable),\nto the complicated relationship with Sartre, to her longing for Nelson\nAlgren (detailed further in A Transatlantic Love Affair, her\npublished letters to Algren), to her discussion of She Came to\nStay and the narration of the triad with Olga in The Prime of\nLife, that speak not only to Beauvoir’s preoccupations with\nthe role of love in life more generally, but to the bond between self\nand other that takes shape in an erotic encounter. In Force of\nCircumstance, Beauvoir considers the self-other relation in more\npolitical terms as she describes the politicization of her private\nexistence and the Algerian War and colonial oppression.\nBeauvoir’s attention to the Algerian War was an encounter that\nplaced an ethical demand on her, out of which she politicized and so\nreshaped her self.\n\nFor Beauvoir, the writing of her life, including writing about her\ndesire to write, is ultimately a way to disclose the ambiguities of\nconcrete existence. The detail at which Beauvoir narrates her life,\nincluding the omissions she makes, which are exposed in her diaries,\noffers important insights about Beauvoir’s philosophical ideas\nand their emergence within and out of her experience. These writings\nare also philosophically significant investigations of the meaning of\nexistence and an ethics, one that is not laid out programmatically but\nthat is disclosed in the joys, banality, and failures of living.\n14. Influence and Current Scholarship\n\nBeauvoir is no doubt a feminist icon and one of the most impactful\nfeminist thinkers of the twentieth century. The Second Sex,\ntranslated in 40 languages, has inspired generations of women to\nchallenge their status and pursue freedom. In spite of her impact,\nreadings and receptions of Beauvoir among feminist scholars were\ninitially largely antagonistic. The renaissance in Beauvoir\nscholarship served as a response. While difficult to pin down its\nexact beginning, it was after Beauvoir’s death in 1986 that\ndifferent questions about and inquiries into her thinking became more\nprevalent. The Second Sex has also been the source of\nimportant debate and criticism in the interdisciplinary field of\nfeminist theory, and even among those who distance themselves from her\nwork, it has been no less impactful. For instance, Beauvoir’s\nlegacy is apparent in the work of more contemporary thinkers like Sara\nAhmed, Judith Butler, bell hooks, and Luce Irigaray.\n\nA significant aspect of the renewal in Beauvoir scholarship has much\nto do with the posthumous availability of previously unpublished\npersonal writings, the increasing number of works translated into\nEnglish, especially those in the Beauvoir Series published by\nUniversity of Illinois Press, and the 2010 new English translation of\nThe Second Sex. Access to such work, made possible by the\nlabor of Beauvoir scholars, has helped shed light on Beauvoir’s\nphilosophical influences and her own criticisms of and distance from\nSartre. That access has also challenged misinterpretations stemming\nfrom inadequate translations and has encouraged interest in and more\nthorough engagement with Beauvoir’s work beyond The Second\nSex. The interdisciplinary, peer-reviewed journal, Simone de\nBeauvoir Studies, founded in 1983 and reorganized in 2016, and\nthe International Simone de Beauvoir Society, are important venues for\nthe study of Beauvoir’s life and works.\n\nGiven the scope of Beauvoir’s influence internationally and\ninterdisciplinarily, it is difficult to succinctly capture her legacy.\nThe following highlights a few key areas scholarship: Beauvoir’s\noriginal philosophical contributions to existentialism (e.g., Le\nDoeuff 1980; Butler 1986; Kruks 1990 and 2001; Fullbrook and Fullbrook\n1994; Gothlin 1999; Arp 2001; Kail 2006; Deutscher 2008; Daigle and\nColomb 2009) and phenomenology (Bergoffen 1997; Heinämaa 1997 and\n2003; Oksala 2016 and 2022; Mann 2018); her contributions to ethics\n(e.g., Gothlin 1995; Tidd 1999a and 1999b; Stoller 2014) and political\ntheory (e.g., Kruks 2012;); situating The Second Sex\nphilosophically (e.g., Bauer 2001; Lundgren-Gothlin 1991; Moi 2001;\nSimons 2001; Heinämaa 2003; Mann and Ferrari 2017); the\nhistorical and global receptions of The Second Sex (e.g.,\nChaperon 1999; Dongchao 2005; Coffin 2020; Rouch 2019 ; Chaperon and\nRouch 2020); the limitations of The Second Sex with regard to\nrace and ethnocentrism (e.g., Spelman 1988; Simons 2001; Deutscher\n2008; Belle 2010, 2014 and 2017; hooks 2012; Berruz 2016; Collins\n2017; Jones 2019; Altman 2020); her perspective on race and racism in\nAmerica Day by Day (e.g., Alfonso 2005; Bernasconi 2019;\nAltman 2020; Mussett 2020); Beauvoir’s engagement with the\ninjustices of French colonialism and her position as a colonizer\n(e.g., Surkis 2010; Nya 2019); critical engagement with\nBeauvoir’s life (e.g., Moi 2009) and personal writings (e.g.,\nTidd 1999b); and biographical projects (Bair 2002; Kirkpatrick\n2019).\n\nAdditionally, Beauvoir’s work inspires feminist philosophical\nanalyses of various lived experiences, such as embodiment and\noppression (Young 1980; Bartky 1990; Burke 2019; Froidevaux-Mettiere\n2021), patriarchal love (Mann 2009), masculinity and nationalism (Mann\n2014), hook-up culture (Bauer 2017), #BlackGirlJoy (Mason 2018),\nstreet harassment (Vera-Gray 2018), feminine submission (Garcia 2018),\nbody positivity (Leboeuf 2019); trans subjectivity (Antonopoulos 2017;\nBurke 2020), non-monogamy (Kean 2018; Anderson 2021), #MeToo (McKinney\n2019; Melo Lopes 2021), obstetric violence (Shabot 2021), old age\n(Stoller 2014; Kruks 2022); rape (Bergoffen 2017); and authenticity\n(Cleary 2022).",
    "section_title": "12. The Coming of Age: The Other Again",
    "entry_title": "Simone de Beauvoir",
    "hierarchy_title": "Simone de Beauvoir || The Coming of Age: The Other Again",
    "tokenized_text": [
        "coming",
        "age",
        "coming",
        "age",
        "need",
        "read",
        "easy",
        "death",
        "adieu",
        "within",
        "context",
        "analysis",
        "coming",
        "age",
        "fully",
        "appreciate",
        "beauvoir",
        "role",
        "witness",
        "project",
        "coming",
        "age",
        "similar",
        "second",
        "sex",
        "like",
        "second",
        "sex",
        "focus",
        "group",
        "people",
        "designated",
        "like",
        "second",
        "sex",
        "expose",
        "mythical",
        "status",
        "fact",
        "aging",
        "aged",
        "like",
        "second",
        "sex",
        "indicts",
        "society",
        "dehumanization",
        "designates",
        "coming",
        "age",
        "also",
        "emulates",
        "second",
        "sex",
        "method",
        "scope",
        "brings",
        "phenomenological",
        "lens",
        "bear",
        "biological",
        "psychological",
        "historical",
        "economic",
        "sociological",
        "factor",
        "order",
        "understand",
        "phenomenon",
        "particular",
        "kind",
        "marginalized",
        "otherness",
        "coming",
        "age",
        "beauvoir",
        "considers",
        "injustice",
        "endured",
        "aged",
        "describes",
        "experience",
        "old",
        "age",
        "argues",
        "throw",
        "one",
        "position",
        "necessity",
        "result",
        "culturally",
        "produced",
        "stigma",
        "societal",
        "loathing",
        "aging",
        "thus",
        "process",
        "aging",
        "may",
        "inescapable",
        "old",
        "age",
        "situation",
        "otherness",
        "nonsubject",
        "status",
        "matter",
        "condition",
        "experience",
        "foreclose",
        "transcendence",
        "including",
        "myth",
        "societal",
        "attitude",
        "economic",
        "condition",
        "aged",
        "whereas",
        "second",
        "sex",
        "beauvoir",
        "accused",
        "patriarchy",
        "depriving",
        "woman",
        "subject",
        "status",
        "coming",
        "age",
        "argues",
        "nonsubject",
        "status",
        "aged",
        "traced",
        "fact",
        "barred",
        "existential",
        "project",
        "meaningful",
        "relationship",
        "others",
        "experience",
        "old",
        "age",
        "way",
        "beauvoir",
        "argues",
        "denied",
        "one",
        "humanity",
        "old",
        "man",
        "beauvoir",
        "writes",
        "look",
        "active",
        "member",
        "community",
        "like",
        "one",
        "different",
        "specie",
        "engaged",
        "project",
        "cf",
        "like",
        "second",
        "sex",
        "attended",
        "given",
        "biology",
        "without",
        "allowing",
        "determine",
        "meaning",
        "subject",
        "coming",
        "age",
        "also",
        "give",
        "biology",
        "due",
        "lack",
        "engagement",
        "aged",
        "beauvoir",
        "note",
        "part",
        "imposed",
        "without",
        "part",
        "come",
        "within",
        "age",
        "body",
        "transformed",
        "instrument",
        "engages",
        "world",
        "hindrance",
        "make",
        "access",
        "world",
        "difficult",
        "point",
        "coming",
        "age",
        "however",
        "unjust",
        "use",
        "difficulty",
        "justify",
        "reducing",
        "aged",
        "status",
        "adieu",
        "witnessing",
        "make",
        "point",
        "clearly",
        "however",
        "diminished",
        "sartre",
        "body",
        "became",
        "never",
        "severed",
        "project",
        "could",
        "sustained",
        "work",
        "however",
        "rather",
        "situation",
        "others",
        "refused",
        "marginalize",
        "equate",
        "diminished",
        "bodily",
        "capacity",
        "diminished",
        "humanity",
        "coming",
        "age",
        "argues",
        "situation",
        "privileged",
        "sartre",
        "ought",
        "common",
        "destiny",
        "world",
        "recognized",
        "phenomenological",
        "truth",
        "body",
        "existential",
        "truth",
        "freedom",
        "marxist",
        "truth",
        "exploitation",
        "human",
        "truth",
        "bond",
        "derogatory",
        "category",
        "would",
        "eradicated",
        "neither",
        "aged",
        "woman",
        "anyone",
        "virtue",
        "race",
        "class",
        "ethnicity",
        "religion",
        "would",
        "find",
        "rendered",
        "inessential",
        "beauvoir",
        "know",
        "much",
        "hope",
        "world",
        "understands",
        "lure",
        "domination",
        "violence",
        "throughout",
        "career",
        "however",
        "used",
        "philosophical",
        "literary",
        "tool",
        "reveal",
        "possibility",
        "world",
        "appealed",
        "u",
        "work",
        "life",
        "writing",
        "situation",
        "becoming",
        "selfother",
        "relation",
        "beauvoir",
        "practice",
        "writing",
        "self",
        "deeply",
        "connected",
        "philosophical",
        "idea",
        "indeed",
        "beauvoir",
        "living",
        "philosophy",
        "point",
        "evident",
        "autobiographical",
        "work",
        "beauvoir",
        "wrote",
        "fourvolume",
        "autobiography",
        "recount",
        "fiftyfour",
        "year",
        "life",
        "year",
        "memoir",
        "dutiful",
        "daughter",
        "beauvoir",
        "narrates",
        "formative",
        "year",
        "prime",
        "life",
        "cover",
        "force",
        "circumstance",
        "written",
        "two",
        "volume",
        "war",
        "hard",
        "time",
        "beauvoir",
        "also",
        "devoted",
        "diarist",
        "diary",
        "including",
        "diary",
        "philosophy",
        "student",
        "volume",
        "volume",
        "wartime",
        "diary",
        "often",
        "complicate",
        "narration",
        "autobiography",
        "exposing",
        "different",
        "detail",
        "life",
        "thus",
        "expose",
        "different",
        "beauvoir",
        "reader",
        "beauvoir",
        "diary",
        "writing",
        "integral",
        "part",
        "selfunderstanding",
        "selfmaking",
        "significance",
        "autobiographical",
        "work",
        "threefold",
        "offer",
        "detailed",
        "account",
        "event",
        "experience",
        "relation",
        "others",
        "beauvoir",
        "made",
        "self",
        "work",
        "reveal",
        "became",
        "beauvoir",
        "also",
        "shed",
        "light",
        "beauvoir",
        "philosophical",
        "trajectory",
        "intellectual",
        "influence",
        "idea",
        "theme",
        "central",
        "novel",
        "philosophical",
        "work",
        "offer",
        "glaring",
        "evidence",
        "philosophical",
        "idea",
        "developed",
        "prior",
        "alongside",
        "often",
        "sartre",
        "writing",
        "life",
        "evident",
        "notion",
        "situation",
        "set",
        "concrete",
        "circumstance",
        "including",
        "one",
        "embodiment",
        "significantly",
        "shape",
        "fix",
        "one",
        "existence",
        "central",
        "beauvoir",
        "philosophy",
        "self",
        "living",
        "living",
        "one",
        "choice",
        "constrained",
        "determined",
        "social",
        "historical",
        "context",
        "one",
        "existence",
        "take",
        "shape",
        "beauvoir",
        "autobiographical",
        "writing",
        "make",
        "clear",
        "situation",
        "girl",
        "raised",
        "catholic",
        "bourgeois",
        "household",
        "woman",
        "certain",
        "level",
        "independence",
        "privilege",
        "intellectual",
        "writer",
        "leftist",
        "living",
        "amidst",
        "aftermath",
        "war",
        "colonial",
        "project",
        "generative",
        "circumstance",
        "neither",
        "mere",
        "product",
        "circumstance",
        "existence",
        "yet",
        "understanding",
        "situation",
        "take",
        "time",
        "develop",
        "beauvoir",
        "note",
        "always",
        "recognize",
        "force",
        "circumstance",
        "though",
        "perhaps",
        "recognize",
        "case",
        "constraint",
        "particular",
        "situation",
        "prime",
        "life",
        "instance",
        "beauvoir",
        "read",
        "still",
        "full",
        "bourgeois",
        "idealism",
        "focused",
        "happiness",
        "mark",
        "characteristic",
        "time",
        "ultimately",
        "narrating",
        "experience",
        "beauvoir",
        "discloses",
        "connection",
        "personal",
        "collective",
        "distinctness",
        "self",
        "unfolding",
        "time",
        "ethical",
        "significance",
        "beauvoir",
        "place",
        "selfother",
        "relation",
        "also",
        "central",
        "autobiographical",
        "writing",
        "although",
        "reject",
        "individualism",
        "beauvoir",
        "younger",
        "year",
        "show",
        "deep",
        "interest",
        "relationship",
        "others",
        "relationship",
        "parent",
        "love",
        "zaza",
        "cousin",
        "jacques",
        "instance",
        "reveal",
        "capacity",
        "others",
        "open",
        "close",
        "world",
        "make",
        "remake",
        "self",
        "indeed",
        "robust",
        "philosophy",
        "love",
        "across",
        "beauvoir",
        "personal",
        "writing",
        "including",
        "love",
        "zaza",
        "fictionalized",
        "inseparable",
        "complicated",
        "relationship",
        "sartre",
        "longing",
        "nelson",
        "algren",
        "detailed",
        "transatlantic",
        "love",
        "affair",
        "published",
        "letter",
        "algren",
        "discussion",
        "came",
        "stay",
        "narration",
        "triad",
        "olga",
        "prime",
        "life",
        "speak",
        "beauvoir",
        "preoccupation",
        "role",
        "love",
        "life",
        "generally",
        "bond",
        "self",
        "take",
        "shape",
        "erotic",
        "encounter",
        "force",
        "circumstance",
        "beauvoir",
        "considers",
        "selfother",
        "relation",
        "political",
        "term",
        "describes",
        "politicization",
        "private",
        "existence",
        "algerian",
        "war",
        "colonial",
        "oppression",
        "beauvoir",
        "attention",
        "algerian",
        "war",
        "encounter",
        "placed",
        "ethical",
        "demand",
        "politicized",
        "reshaped",
        "self",
        "beauvoir",
        "writing",
        "life",
        "including",
        "writing",
        "desire",
        "write",
        "ultimately",
        "way",
        "disclose",
        "ambiguity",
        "concrete",
        "existence",
        "detail",
        "beauvoir",
        "narrates",
        "life",
        "including",
        "omission",
        "make",
        "exposed",
        "diary",
        "offer",
        "important",
        "insight",
        "beauvoir",
        "philosophical",
        "idea",
        "emergence",
        "within",
        "experience",
        "writing",
        "also",
        "philosophically",
        "significant",
        "investigation",
        "meaning",
        "existence",
        "ethic",
        "one",
        "laid",
        "programmatically",
        "disclosed",
        "joy",
        "banality",
        "failure",
        "living",
        "influence",
        "current",
        "scholarship",
        "beauvoir",
        "doubt",
        "feminist",
        "icon",
        "one",
        "impactful",
        "feminist",
        "thinker",
        "twentieth",
        "century",
        "second",
        "sex",
        "translated",
        "language",
        "inspired",
        "generation",
        "woman",
        "challenge",
        "status",
        "pursue",
        "freedom",
        "spite",
        "impact",
        "reading",
        "reception",
        "beauvoir",
        "among",
        "feminist",
        "scholar",
        "initially",
        "largely",
        "antagonistic",
        "renaissance",
        "beauvoir",
        "scholarship",
        "served",
        "response",
        "difficult",
        "pin",
        "exact",
        "beginning",
        "beauvoir",
        "death",
        "different",
        "question",
        "inquiry",
        "thinking",
        "became",
        "prevalent",
        "second",
        "sex",
        "also",
        "source",
        "important",
        "debate",
        "criticism",
        "interdisciplinary",
        "field",
        "feminist",
        "theory",
        "even",
        "among",
        "distance",
        "work",
        "le",
        "impactful",
        "instance",
        "beauvoir",
        "legacy",
        "apparent",
        "work",
        "contemporary",
        "thinker",
        "like",
        "sara",
        "ahmed",
        "judith",
        "butler",
        "bell",
        "hook",
        "luce",
        "irigaray",
        "significant",
        "aspect",
        "renewal",
        "beauvoir",
        "scholarship",
        "much",
        "posthumous",
        "availability",
        "previously",
        "unpublished",
        "personal",
        "writing",
        "increasing",
        "number",
        "work",
        "translated",
        "english",
        "especially",
        "beauvoir",
        "series",
        "published",
        "university",
        "illinois",
        "press",
        "new",
        "english",
        "translation",
        "second",
        "sex",
        "access",
        "work",
        "made",
        "possible",
        "labor",
        "beauvoir",
        "scholar",
        "helped",
        "shed",
        "light",
        "beauvoir",
        "philosophical",
        "influence",
        "criticism",
        "distance",
        "sartre",
        "access",
        "also",
        "challenged",
        "misinterpretation",
        "stemming",
        "inadequate",
        "translation",
        "encouraged",
        "interest",
        "thorough",
        "engagement",
        "beauvoir",
        "work",
        "beyond",
        "second",
        "sex",
        "interdisciplinary",
        "peerreviewed",
        "journal",
        "simone",
        "de",
        "beauvoir",
        "study",
        "founded",
        "reorganized",
        "international",
        "simone",
        "de",
        "beauvoir",
        "society",
        "important",
        "venue",
        "study",
        "beauvoir",
        "life",
        "work",
        "given",
        "scope",
        "beauvoir",
        "influence",
        "internationally",
        "interdisciplinarily",
        "difficult",
        "succinctly",
        "capture",
        "legacy",
        "following",
        "highlight",
        "key",
        "area",
        "scholarship",
        "beauvoir",
        "original",
        "philosophical",
        "contribution",
        "existentialism",
        "eg",
        "le",
        "doeuff",
        "butler",
        "kruks",
        "fullbrook",
        "fullbrook",
        "gothlin",
        "arp",
        "kail",
        "deutscher",
        "daigle",
        "colomb",
        "phenomenology",
        "bergoffen",
        "heinämaa",
        "oksala",
        "mann",
        "contribution",
        "ethic",
        "eg",
        "gothlin",
        "tidd",
        "a",
        "b",
        "stoller",
        "political",
        "theory",
        "eg",
        "kruks",
        "situating",
        "second",
        "sex",
        "philosophically",
        "eg",
        "bauer",
        "lundgrengothlin",
        "moi",
        "simon",
        "heinämaa",
        "mann",
        "ferrari",
        "historical",
        "global",
        "reception",
        "second",
        "sex",
        "eg",
        "chaperon",
        "dongchao",
        "coffin",
        "rouch",
        "chaperon",
        "rouch",
        "limitation",
        "second",
        "sex",
        "regard",
        "race",
        "ethnocentrism",
        "eg",
        "spelman",
        "simon",
        "deutscher",
        "belle",
        "hook",
        "berruz",
        "collins",
        "jones",
        "altman",
        "perspective",
        "race",
        "racism",
        "america",
        "day",
        "day",
        "eg",
        "alfonso",
        "bernasconi",
        "altman",
        "mussett",
        "beauvoir",
        "engagement",
        "injustice",
        "french",
        "colonialism",
        "position",
        "colonizer",
        "eg",
        "surkis",
        "nya",
        "critical",
        "engagement",
        "beauvoir",
        "life",
        "eg",
        "moi",
        "personal",
        "writing",
        "eg",
        "tidd",
        "b",
        "biographical",
        "project",
        "bair",
        "kirkpatrick",
        "additionally",
        "beauvoir",
        "work",
        "inspires",
        "feminist",
        "philosophical",
        "analysis",
        "various",
        "lived",
        "experience",
        "embodiment",
        "oppression",
        "young",
        "bartky",
        "burke",
        "froidevauxmettiere",
        "patriarchal",
        "love",
        "mann",
        "masculinity",
        "nationalism",
        "mann",
        "hookup",
        "culture",
        "bauer",
        "blackgirljoy",
        "mason",
        "street",
        "harassment",
        "veragray",
        "feminine",
        "submission",
        "garcia",
        "body",
        "positivity",
        "leboeuf",
        "trans",
        "subjectivity",
        "antonopoulos",
        "burke",
        "nonmonogamy",
        "kean",
        "anderson",
        "metoo",
        "mckinney",
        "melo",
        "lope",
        "obstetric",
        "violence",
        "shabot",
        "old",
        "age",
        "stoller",
        "kruks",
        "rape",
        "bergoffen",
        "authenticity",
        "cleary"
    ]
}