{
    "main_text": "Life and Works\n1. Life and Works\n\nSimone de Beauvoir was born on January 9, 1908 in Paris, France. Her\nparents, Georges Bertrand de Beauvoir and Françoise\n(née) Brasseur provided Beauvoir and her younger sister\nHélène, often referred to by her nickname\n“Poupette,” with a traditional bourgeois, Catholic\nupbringing. Beauvoir spent much of her childhood rebelling against the\nvalues of her faith and bourgeois ideology. The disdain for the latter\nwould continue throughout her adult life. In her childhood, Beauvoir\nvowed to never become a housewife or mother and admired her\nfather’s intelligence. He introduced the young Beauvoir to great\nworks of literature and encouraged her to write. She pursued this out\nof her own interest, writing stories and keeping diaries throughout\nher girlhood, and more formally in her educational training at the\nprivate Catholic school for girls, the Institut Adeline Désir.\nAt school, she formed an intimate bond with Elizabeth Mabille, or\nZaza. Together, the two confronted and resisted the rigid expectations\nof bourgeois, Catholic femininity. When Zaza died of meningitis in\n1929, Beauvoir suffered intense heartbreak. She fictionalized this\nheartbreak and their intimacy in the novel Inseparable\n(2021), which was written in 1954 but deemed “too\nintimate” to publish during Beauvoir’s lifetime.\n\nIn her girlhood, Beauvoir was independent, curious, and a gifted\nstudent. She was often defiant of the rules of the adult world and\ndesired to fill her life with as many experiences as possible.\nAlthough initially devout in her faith, at age fourteen Beauvoir\nrejected the existence of God, which was a pivotal moment in her life,\nas was her family’s loss of class status in 1919. The former\nevent propelled Beauvoir into studying philosophy, while the latter\nmade the bourgeois expectation of marriage improbable. Her early\ndevotion to an intellectual life proved to have social and material\nbenefits, offering her a way to concretely realize her independence\nduring an era when most women were economically dependent on men.\n\nIn 1925, at the age of seventeen, Beauvoir passed the\nbaccalauréat exams in mathematics and philosophy. In 1926, she\nearned Certificates of Higher Studies in French literature and Latin\nafter studying at the Institut Catholique and the Institut\nSainte-Marie. In the fall of 1926 she began studying philosophy at the\nSorbonne where, in 1928–1929, she would write her graduate\nthesis (diplôme) on Leibniz prior to taking the competitive\nagrégation exam in philosophy in 1929. At twenty-one Beauvoir\nwas the youngest candidate to pass the exam, finishing second to\nJean-Paul Sartre who had taken the exam for the second time. As the\neighth woman to pass the agrégation, Beauvoir’s success\nsolidified her economic independence and she continued to assume her\nindependence in the face of patriarchal constraints. In the second\nvolume of her autobiography, The Prime of Life (1960),\nBeauvoir recounts this time as carefree, as if she were untethered to\nthe constraints of the world. Years later, different conditions would\nshift her attitude.\n\nWhile studying for the agrégation, Beauvoir met Sartre and they\nfound in each other intellectual companions and lovers. Although\nBeauvoir has often been framed as merely adopting Sartre’s\nphilosophical commitments, her diaries and memoirs tell another story.\nThey both relied on one another as interlocutors and Sartre often\nrelied on Beauvoir’s intellectual acuity to develop his ideas.\nThough they refused the tradition of monogamy, the two remained\ntogether their entire lives. In 1929, they made a famous pact to be\n“essential lovers”, yet allowed for “contingent\nloves” that they disclosed to one another. During her lifetime\nBeauvoir had numerous affairs with men and women, but none paralleled\nher relationship with American author Nelson Algren, whom she fell\ndeeply in love with. In various personal writings, Algren seems to\noccupy the place of an “essential love” far more than\nSartre. However, the pact with Sartre was never broken and the two\nwere bonded throughout their lifetime. This open relationship was\nradical for the time, yet Sartre and Beauvoir have also been\ncriticized for their sexual ethics. Given what is exposed in\nBeauvoir’s diaries about her disappointments with her\nrelationship with Sartre, it is not entirely clear why she honored\ntheir pact. If anything, Beauvoir’s life and work are reminders\nof the concrete contradictions and ambiguities we all, and women\nespecially, face, even in love.\n\nIn the 1930s, Beauvoir spent much of her time teaching philosophy\nuntil she was dismissed from her post in 1941 by the Nazis who had\noccupied Paris in 1940. The Nazi Occupation and the changing social\nand political climate had a profound impact on Beauvoir, and she\nbecame more attuned to ethics and the constitutive relationship\nbetween circumstance and freedom. During this time, she abandoned the\nrationalist-voluntarist position of her youth, and became more\npreoccupied with morality and agency in the concreteness of social\ncontext. From 1941–1946 she wrote several important works,\nincluding the novel, The Blood of Others (1945), her first\nphilosophical essay Pyrrhus et Cinéas (1944), a\nprecursor of sorts to The Ethics of Ambiguity (1947), and the\nnovel All Men are Mortal (1946). In 1945, she helped found\nthe leftist journal Les Temps Modernes with other French\nintellectuals, including Sartre and Merleau-Ponty. Beauvoir was a\nco-editor of the journal and it quickly became an important venue for\nphilosophical and political essays of the time, including\nBeauvoir’s “Eye for an Eye” (1946). While focusing\non her political writings, Beauvoir traveled to the United States and\nwrote America Day by Day (1948). It was also in Les Temps\nModernes that Beauvoir first published extracts of The Second\nSex (1949).\n\nAlthough Beauvoir was not an ardent feminist in her early years,\nThe Second Sex (1949) became one of the most important\nfeminist texts of the twentieth century, and it launched Beauvoir into\nthe public spotlight for generations to come. As The Second\nSex became a catalyst for challenging women’s situations,\nBeauvoir’s political and intellectual place was also reset.\nAfter repeatedly refusing to align herself with the feminist movement,\nBeauvoir declared herself a feminist in a 1972 interview in Le\nNouvel Observateur and joined other Marxist feminists in founding\nthe journal Questions Féministes. In 1971, she\nauthored and signed Manifesto 343, a public declaration of 343 women\nwho admitted to having an abortion at a time when it was still illegal\nin France. In the 1960s, she also used her philosophical voice to\nengage in political activism against French colonialism, writing\npublicly against the torture of Djamila Boupacha and criticizing the\nindifference to the commonplace torture of Algerian women by the\nFrench Army.\n\nBeauvoir’s literary and philosophical success and reflections on\nthe concrete world continued after The Second Sex. She\npublished important essays, including “Must We Burn Sade?”\n(1951–1952) and “Right Wing Thought Today” (1955),\nthat further develop her notions of authenticity, responsibility, and\nsolidarity. Her novel The Mandarins (1954), a story about\nleft-wing intellectuals at the end of World War II, won the Prix\nGoncourt, the prestigious French literary award. As with many of her\nother works, this novel examines relationships, events, and struggles\nthat fictionalize aspects of her own life. As Beauvoir describes in\nthe third volume of her autobiography, Force of Circumstance\n(1963), The Mandarins is not a novel with a message, but\nrather a philosophical investigation of the meaning of life after the\nwar and the lived confrontation with being and nothingness. It is a\nwork that exemplifies Beauvoir’s turn to literature to do\nphilosophy. A few years later in 1957, she published A Long\nMarch, an essay about her six-week visit to Communist China in\n1955 as one of the 1,500 delegates to visit for the Bandung\nConference. From 1958–1963, she published her autobiography in\nthree volumes (the fourth volume would come out in 1974), and not too\nlong after A Very Easy Death (1964), an intimate reflection\non the last six weeks of her mother’s life, and later The\nWoman Destroyed (1967). After a significant period of\ninterdisciplinary research, similar to the work undertaken to write\nThe Second Sex, Beauvoir wrote The Coming of Age\n(1970), offering a harrowing account of what it means to become old\nand the oppression it entails in western, capitalist societies.\n\nAfter spending the latter half of her life as a feminist icon, public\nintellectual, and an eminent writer, Beauvoir died at seventy-eight,\non April 14, 1986. She was buried, with Sartre, in the Montparnasse\nCemetery in Paris, wearing the ring Nelson Algren had given her many\nyears earlier.\n\nIn spite of working amidst some of the most prominent French\nphilosophers of her time, Beauvoir’s legacy has often been\ndenied its philosophical significance. Indeed, the details of her life\nhave often been taken to be more interesting than her ideas. This\nreception exemplifies that circumstances can often steal an\nindividual’s transcendence, a point she pursues time and time\nagain in her work.\n",
    "section_title": "1. Life and Works",
    "entry_title": "Simone de Beauvoir",
    "hierarchy_title": "Simone de Beauvoir || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "simone",
        "de",
        "beauvoir",
        "born",
        "january",
        "paris",
        "france",
        "parent",
        "george",
        "bertrand",
        "de",
        "beauvoir",
        "françoise",
        "née",
        "brasseur",
        "provided",
        "beauvoir",
        "younger",
        "sister",
        "hélène",
        "often",
        "referred",
        "nickname",
        "poupette",
        "traditional",
        "bourgeois",
        "catholic",
        "upbringing",
        "beauvoir",
        "spent",
        "much",
        "childhood",
        "rebelling",
        "value",
        "faith",
        "bourgeois",
        "ideology",
        "disdain",
        "latter",
        "would",
        "continue",
        "throughout",
        "adult",
        "life",
        "childhood",
        "beauvoir",
        "vowed",
        "never",
        "become",
        "housewife",
        "mother",
        "admired",
        "father",
        "intelligence",
        "introduced",
        "young",
        "beauvoir",
        "great",
        "work",
        "literature",
        "encouraged",
        "write",
        "pursued",
        "interest",
        "writing",
        "story",
        "keeping",
        "diary",
        "throughout",
        "girlhood",
        "formally",
        "educational",
        "training",
        "private",
        "catholic",
        "school",
        "girl",
        "institut",
        "adeline",
        "désir",
        "school",
        "formed",
        "intimate",
        "bond",
        "elizabeth",
        "mabille",
        "zaza",
        "together",
        "two",
        "confronted",
        "resisted",
        "rigid",
        "expectation",
        "bourgeois",
        "catholic",
        "femininity",
        "zaza",
        "died",
        "meningitis",
        "beauvoir",
        "suffered",
        "intense",
        "heartbreak",
        "fictionalized",
        "heartbreak",
        "intimacy",
        "novel",
        "inseparable",
        "written",
        "deemed",
        "intimate",
        "publish",
        "beauvoir",
        "lifetime",
        "girlhood",
        "beauvoir",
        "independent",
        "curious",
        "gifted",
        "student",
        "often",
        "defiant",
        "rule",
        "adult",
        "world",
        "desired",
        "fill",
        "life",
        "many",
        "experience",
        "possible",
        "although",
        "initially",
        "devout",
        "faith",
        "age",
        "fourteen",
        "beauvoir",
        "rejected",
        "existence",
        "god",
        "pivotal",
        "moment",
        "life",
        "family",
        "loss",
        "class",
        "status",
        "former",
        "event",
        "propelled",
        "beauvoir",
        "studying",
        "philosophy",
        "latter",
        "made",
        "bourgeois",
        "expectation",
        "marriage",
        "improbable",
        "early",
        "devotion",
        "intellectual",
        "life",
        "proved",
        "social",
        "material",
        "benefit",
        "offering",
        "way",
        "concretely",
        "realize",
        "independence",
        "era",
        "woman",
        "economically",
        "dependent",
        "men",
        "age",
        "seventeen",
        "beauvoir",
        "passed",
        "baccalauréat",
        "exam",
        "mathematics",
        "philosophy",
        "earned",
        "certificate",
        "higher",
        "study",
        "french",
        "literature",
        "latin",
        "studying",
        "institut",
        "catholique",
        "institut",
        "saintemarie",
        "fall",
        "began",
        "studying",
        "philosophy",
        "sorbonne",
        "would",
        "write",
        "graduate",
        "thesis",
        "diplôme",
        "leibniz",
        "prior",
        "taking",
        "competitive",
        "agrégation",
        "exam",
        "philosophy",
        "twentyone",
        "beauvoir",
        "youngest",
        "candidate",
        "pas",
        "exam",
        "finishing",
        "second",
        "jeanpaul",
        "sartre",
        "taken",
        "exam",
        "second",
        "time",
        "eighth",
        "woman",
        "pas",
        "agrégation",
        "beauvoir",
        "success",
        "solidified",
        "economic",
        "independence",
        "continued",
        "assume",
        "independence",
        "face",
        "patriarchal",
        "constraint",
        "second",
        "volume",
        "autobiography",
        "prime",
        "life",
        "beauvoir",
        "recount",
        "time",
        "carefree",
        "untethered",
        "constraint",
        "world",
        "year",
        "later",
        "different",
        "condition",
        "would",
        "shift",
        "attitude",
        "studying",
        "agrégation",
        "beauvoir",
        "met",
        "sartre",
        "found",
        "intellectual",
        "companion",
        "lover",
        "although",
        "beauvoir",
        "often",
        "framed",
        "merely",
        "adopting",
        "sartre",
        "philosophical",
        "commitment",
        "diary",
        "memoir",
        "tell",
        "another",
        "story",
        "relied",
        "one",
        "another",
        "interlocutor",
        "sartre",
        "often",
        "relied",
        "beauvoir",
        "intellectual",
        "acuity",
        "develop",
        "idea",
        "though",
        "refused",
        "tradition",
        "monogamy",
        "two",
        "remained",
        "together",
        "entire",
        "life",
        "made",
        "famous",
        "pact",
        "essential",
        "lover",
        "yet",
        "allowed",
        "contingent",
        "love",
        "disclosed",
        "one",
        "another",
        "lifetime",
        "beauvoir",
        "numerous",
        "affair",
        "men",
        "woman",
        "none",
        "paralleled",
        "relationship",
        "american",
        "author",
        "nelson",
        "algren",
        "fell",
        "deeply",
        "love",
        "various",
        "personal",
        "writing",
        "algren",
        "seems",
        "occupy",
        "place",
        "essential",
        "love",
        "far",
        "sartre",
        "however",
        "pact",
        "sartre",
        "never",
        "broken",
        "two",
        "bonded",
        "throughout",
        "lifetime",
        "open",
        "relationship",
        "radical",
        "time",
        "yet",
        "sartre",
        "beauvoir",
        "also",
        "criticized",
        "sexual",
        "ethic",
        "given",
        "exposed",
        "beauvoir",
        "diary",
        "disappointment",
        "relationship",
        "sartre",
        "entirely",
        "clear",
        "honored",
        "pact",
        "anything",
        "beauvoir",
        "life",
        "work",
        "reminder",
        "concrete",
        "contradiction",
        "ambiguity",
        "woman",
        "especially",
        "face",
        "even",
        "love",
        "s",
        "beauvoir",
        "spent",
        "much",
        "time",
        "teaching",
        "philosophy",
        "dismissed",
        "post",
        "nazi",
        "occupied",
        "paris",
        "nazi",
        "occupation",
        "changing",
        "social",
        "political",
        "climate",
        "profound",
        "impact",
        "beauvoir",
        "became",
        "attuned",
        "ethic",
        "constitutive",
        "relationship",
        "circumstance",
        "freedom",
        "time",
        "abandoned",
        "rationalistvoluntarist",
        "position",
        "youth",
        "became",
        "preoccupied",
        "morality",
        "agency",
        "concreteness",
        "social",
        "context",
        "wrote",
        "several",
        "important",
        "work",
        "including",
        "novel",
        "blood",
        "others",
        "first",
        "philosophical",
        "essay",
        "pyrrhus",
        "et",
        "cinéas",
        "precursor",
        "sort",
        "ethic",
        "ambiguity",
        "novel",
        "men",
        "mortal",
        "helped",
        "found",
        "leftist",
        "journal",
        "le",
        "temp",
        "modernes",
        "french",
        "intellectual",
        "including",
        "sartre",
        "merleauponty",
        "beauvoir",
        "coeditor",
        "journal",
        "quickly",
        "became",
        "important",
        "venue",
        "philosophical",
        "political",
        "essay",
        "time",
        "including",
        "beauvoir",
        "eye",
        "eye",
        "focusing",
        "political",
        "writing",
        "beauvoir",
        "traveled",
        "united",
        "state",
        "wrote",
        "america",
        "day",
        "day",
        "also",
        "le",
        "temp",
        "modernes",
        "beauvoir",
        "first",
        "published",
        "extract",
        "second",
        "sex",
        "although",
        "beauvoir",
        "ardent",
        "feminist",
        "early",
        "year",
        "second",
        "sex",
        "became",
        "one",
        "important",
        "feminist",
        "text",
        "twentieth",
        "century",
        "launched",
        "beauvoir",
        "public",
        "spotlight",
        "generation",
        "come",
        "second",
        "sex",
        "became",
        "catalyst",
        "challenging",
        "woman",
        "situation",
        "beauvoir",
        "political",
        "intellectual",
        "place",
        "also",
        "reset",
        "repeatedly",
        "refusing",
        "align",
        "feminist",
        "movement",
        "beauvoir",
        "declared",
        "feminist",
        "interview",
        "le",
        "nouvel",
        "observateur",
        "joined",
        "marxist",
        "feminist",
        "founding",
        "journal",
        "question",
        "féministes",
        "authored",
        "signed",
        "manifesto",
        "public",
        "declaration",
        "woman",
        "admitted",
        "abortion",
        "time",
        "still",
        "illegal",
        "france",
        "s",
        "also",
        "used",
        "philosophical",
        "voice",
        "engage",
        "political",
        "activism",
        "french",
        "colonialism",
        "writing",
        "publicly",
        "torture",
        "djamila",
        "boupacha",
        "criticizing",
        "indifference",
        "commonplace",
        "torture",
        "algerian",
        "woman",
        "french",
        "army",
        "beauvoir",
        "literary",
        "philosophical",
        "success",
        "reflection",
        "concrete",
        "world",
        "continued",
        "second",
        "sex",
        "published",
        "important",
        "essay",
        "including",
        "must",
        "burn",
        "sade",
        "right",
        "wing",
        "thought",
        "today",
        "develop",
        "notion",
        "authenticity",
        "responsibility",
        "solidarity",
        "novel",
        "mandarin",
        "story",
        "leftwing",
        "intellectual",
        "end",
        "world",
        "war",
        "ii",
        "prix",
        "goncourt",
        "prestigious",
        "french",
        "literary",
        "award",
        "many",
        "work",
        "novel",
        "examines",
        "relationship",
        "event",
        "struggle",
        "fictionalize",
        "aspect",
        "life",
        "beauvoir",
        "describes",
        "third",
        "volume",
        "autobiography",
        "force",
        "circumstance",
        "mandarin",
        "novel",
        "message",
        "rather",
        "philosophical",
        "investigation",
        "meaning",
        "life",
        "war",
        "lived",
        "confrontation",
        "nothingness",
        "work",
        "exemplifies",
        "beauvoir",
        "turn",
        "literature",
        "philosophy",
        "year",
        "later",
        "published",
        "long",
        "march",
        "essay",
        "sixweek",
        "visit",
        "communist",
        "china",
        "one",
        "delegate",
        "visit",
        "bandung",
        "conference",
        "published",
        "autobiography",
        "three",
        "volume",
        "fourth",
        "volume",
        "would",
        "come",
        "long",
        "easy",
        "death",
        "intimate",
        "reflection",
        "last",
        "six",
        "week",
        "mother",
        "life",
        "later",
        "woman",
        "destroyed",
        "significant",
        "period",
        "interdisciplinary",
        "research",
        "similar",
        "work",
        "undertaken",
        "write",
        "second",
        "sex",
        "beauvoir",
        "wrote",
        "coming",
        "age",
        "offering",
        "harrowing",
        "account",
        "mean",
        "become",
        "old",
        "oppression",
        "entail",
        "western",
        "capitalist",
        "society",
        "spending",
        "latter",
        "half",
        "life",
        "feminist",
        "icon",
        "public",
        "intellectual",
        "eminent",
        "writer",
        "beauvoir",
        "died",
        "seventyeight",
        "april",
        "buried",
        "sartre",
        "montparnasse",
        "cemetery",
        "paris",
        "wearing",
        "ring",
        "nelson",
        "algren",
        "given",
        "many",
        "year",
        "earlier",
        "spite",
        "working",
        "amidst",
        "prominent",
        "french",
        "philosopher",
        "time",
        "beauvoir",
        "legacy",
        "often",
        "denied",
        "philosophical",
        "significance",
        "indeed",
        "detail",
        "life",
        "often",
        "taken",
        "interesting",
        "idea",
        "reception",
        "exemplifies",
        "circumstance",
        "often",
        "steal",
        "individual",
        "transcendence",
        "point",
        "pursues",
        "time",
        "time",
        "work"
    ]
}