{
    "main_text": "Romanticism, Goethe and Criticism\n3. Romanticism, Goethe and Criticism\nBenjamin initially sought to develop these ideas in the context of\nKant’s philosophy of history, believing it was in this context that\nthe problems of the Kantian system could be fully exposed and\nchallenged (C, 98). A very early article, ‘The Life of\nStudents’ (‘Das Leben der Studenten’,\n1915), is useful for suggesting how these problems manifest themselves\nwithin the philosophy of history. It rejects a “a view of\nhistory that puts its faith in the infinite extent of time and thus\nconcerns itself only with the speed, or lack of it, with which people\nand epochs advance along the path of progress” and contrasts\nthis with a perspective “in which history appears to be\nconcentrated on a single focal point, like those that had\ntraditionally been found in the utopian images of the\nphilosophers” (SW 1, 37).  The latter, ‘messianic’\nview of history has a distinct intention and methodology: it aims to\ngrasp how elements of what Benjamin calls “the ultimate\ncondition” and “highest metaphysical state” of\nhistory—which we might call the historical Absolute—appear\nnot as the telos or end of history, but as an immanent state\nof perfection which has the potential to manifest itself in any\nparticular moment (SW 1, 37). He claims that the necessary recognition\nof such metaphysical condition requires an act of criticism\n[Kritik] (SW 1, 38). Benjamin had initially proposed Kant’s\nphilosophy of history as the topic of his doctoral dissertation, and\nwhile he felt it necessary to change this to the Early German\nRomantics’ philosophy of art, crucial features of the proposed project\nsurvive in the final work. Astute readers, he says, may still discern\nin it an “insight into the relationship of a truth to\nhistory” (C, 135–6). Specifically, the concept of art\ncriticism operating in Romantic aesthetics rests upon epistemological\npresuppositions that reveal the ‘messianic’ essence of\nRomanticism (SW 1, 116–7; n.3, 185). The messianic conjunction\nbetween the highest metaphysical state of history and the ephemerality\nof each particular moment is here seen as theoretically determining\nthe Romantic relationship between the artistic Absolute—or what\nBenjamin defines as the Idea of art—and each particular\nartwork.\nIn his doctoral dissertation, Benjamin argues that the philosophical\nrelationship between the Idea of art and particular artworks posited in\nRomantic aesthetics must be understood in relation to Fichte’s\ntheory of reflection. This sought to ground the possibility of a\ncertain and immediate type of cognition without recourse to the\nproblematic notion of an intellectual intuition. For Fichte, reflection\nindicates the free activity of consciousness taking itself as its own\nobject of thought: its capacity for thinking of thinking. In doing so,\nthe initial form of thinking is transformed into its content. In such\nreflection, thought seems capable of immediately grasping itself as a\nthinking subject and therefore of possessing a certain kind of\nimmediate and foundational knowledge. Although Benjamin introduces a\nnumber of specific criticisms of Fichte’s philosophical position\nin his dissertation, he nonetheless values the Fichtean concept of\nreflection for providing the epistemological foundation of Friedrich\nSchlegel’s and Novalis’ understandings of the metaphysical\nfunction of art criticism. Some scholars have, however, questioned the\naccuracy of Benjamin’s interpretation of Fichte’s concept\nof reflection and the importance he accords to it in Romantic\nepistemology (Bullock 1987, 78–93; Menninghaus 2005, 29–44). \nUnlike in Fichte, here immediacy and infinitude are not mutually\nexclusive aspects of cognition. The uniqueness of the Romantic concept\nof the Absolute resides in the fact that the Romantic conception of\ninfinitude regards it not as empty but “substantial and\nfilled” (SW 1, 129). Benjamin argued that the Romantics\nspecifically identified this structure of the Absolute with the Idea of\nart, and in particular with artistic form (SW 1, 135). Art criticism\nbecomes central to this concept of infinite fulfilment because, like\nthe epistemological relation between reflection and thought in Fichte,\ncriticism both consummates the finite and particular work by raising it\nto a higher level—in which the form of the work is transformed\ninto content as the object of criticism—and simultaneously\nconnects the work’s particular artistic form with the continuity\nand unity of absolute form in the Idea of art. Criticism is, for the\nRomantics, the continuation and ongoing completion of the particular\nwork through its infinite connection with other art works and works of\ncriticism. By conceiving the Idea of art as a ‘medium of\nreflection’, the early Romantics dissolve the Enlightenment\nworld-view of the positive sciences that Fichte inherited from Kant,\nand in doing so overcome the critical injunctions placed upon the\nexperience of the infinite (SW 1, 132; 131). This conception of a\nfulfilled infinity constitutes the messianism that Benjamin claims is\nessential to Early Romantic epistemology.\nIn the version of the dissertation formally submitted to the\nuniversity, Benjamin concludes by identifying the Romantic theory of\nart criticism with ‘the consummation of the work’ (SW 1,\n177). The artwork provides the immanent criterion for critical\nreflection, which in turn completes the work by raising it into an\nautonomous and higher existence. This immanent criticism rejects both\nthe dogmatic imposition of external rules (such as those of classical\naesthetics) and the dissolution of aesthetic criteria (with the appeal\nto artistic genius). It provides, Benjamin thought, one of the\nfundamental legacies for a modern concept of art criticism. The version\ncirculated amongst friends and colleagues does not conclude with a\ncomplete affirmation of Romanticism, however, but contains a critical\nafterword that renders explicit the critical objections that Benjamin\nhad carefully inserted into the text. These suggest that the Romantic\ntheory of art, and by implication the structure of the Absolute it is\ngrounded upon, is problematically one-sided and incomplete with regard\nto (1) its formalism, (2) its positivity, and (3) its singularity. \n\nSince the content of each, successive,\nlevel of reflection is supplied by the form of its object, the\ncriticism unfolds the germ of immanent criticizability contained in\neach particular artwork’s form. This formalism precludes any\nserious discussion of the artwork’s specific content.\nConversely, anything immanently uncriticizable cannot constitute a\ntrue work of art. As a consequence, Romantic criticism is unable to\ndifferentiate between good or bad artworks, since its only criterion\nis whether a work is or is not art. Such criticism\nis entirely positive in its evaluation, and lacks the important\nnegative moment essential to judgement.\nFinally, Schlegel “committed the old error of confounding\n‘abstract and ‘universal’ when he believed he had to\nmake that [Absolute] ground [of art] into an individual”,\nBenjamin claims (SW 1, 166–7). He therefore gave a “false\ninterpretation” of the unity of all works when he conceived this\nas pertaining to some mystical, singular and transcendental work.\n\nThe consequent need for what Benjamin presents as a Goethean\nmodification of Early German Romanticism is laid out in the afterword.\nThe relation between these criticisms of Romanticism and Goethe’s\nthought is suggested in the claim that, “Ultimately the mystical\nthesis that art itself is one work…stands in exact correlation with\nthe principle which asserts the indestructibility of works that are\npurified in irony” (SW 1, 167). With its mistaken emphasis on the\nsingularity of the Idea of art, Romantic fulfilment only coincides with\nthe infinity of the unconditioned, meaning that fulfilment is an\nessentially non-historical category of the infinite. Such criticism\ncannot be described as judgement, since all authentic judgement\ninvolves an essential negative moment of completion in\n“self-annihilation” (SW 1, 152). Consequently, because\n‘Romantic messianism is not at work in its full force’ here\n(SW 1, 168), the Romantics were increasingly forced to turn to the\n“accoutrements” of ethics, religion and politics to provide\nthe content required to complete their theory of art. \nGoethe’s conception of aesthetic judgement and his principle\nof the ‘uncriticizability’ of great works provided Benjamin\nwith a way of thinking the necessary modification to the Early German\nRomantic Idea of art. His explication of the implicit metaphysical\nstructure of Goethe’s corresponding Ideal of art reveals the\ncontrasting features of his structure of the Absolute: as a sphere of\npure content, a medium of destructive refraction,\nand a plurality of discontinuous archetypes (Charles 2020, 53–67). Because finite, particular\nworks can never be romanticized into the unity of an individual\nAbsolute, they remains immanently incomplete and yet nonetheless\nincapable of higher consummation: a “torso”, dismembered in\nrelation to the whole, corpse-like in its deadness. In this context,\nthe true task of criticism becomes not the consummation of the living\nwork, but that destructive completion of the dying one.\nBenjamin’s essay on ‘Goethe’s Elective\nAffinities’ (1924–5) provides an exemplary piece of\nsuch criticism, whilst developing the concept further by situating it\nmore explicitly within the context of history. Here, criticism is\ncharged with the task of revealing what Benjamin calls the\n“truth content of a work of art”, which is intimately\nbound up with its “material content” at the beginning of\nthe work’s history (SW 1, 297). In contrast to mere\ncommentary—which proceeds no further than a consideration of\nthese now historically anachronistic features of its material\ncontent—the aim of criticism is the destruction of this outer\nlayer in order for the work’s inner truth content to be grasped. The\nfundamental philological error of commentary is merely to situate the\nwork in relation to the “lived experience\n[Erlebnis]” of its author’s biographical life\n(exemplified in Friedrich Gundolf’s 1916 biography\nof Goethe), instead of the broader medium of historical\nreception through which it has passed down to the contemporary\ncritic. Benjamin’s Romantic theory of immanent criticism insists that\nthe work must contain its own inner criterion, such that the critic\nproceeds from the work itself and not from the life of the author (SW\n1, 321). Beginning, therefore, with the odd and striking features of\nGoethe’s work that come to preoccupy later critics, Benjamin examines\nhow these are derived from techniques borrowed from the distinct form\nof the novella. This novella-like construction grants the Elective\nAffinities its strange, fable-like quality, which differentiates\nit from the naturalism of a typical novel. It is this mythical layer,\nas the real material content of the work, which expresses the presence\nof a pantheistic and “daemonic” attitude toward nature in\nGoethe’s work.\nTruth content, in contrast, is not to be sought in the conspicuous\nfeatures of the work’s technique, but in the unity of its\ndistinct form. The task of criticism is to make this truth content an\nobject of experience. It concerns itself not with the life or\nintentions of the artist, but with that semblance or appearance of life\nthat the work itself possesses by virtue of its mimetic capacity for\nrepresentation: its linguistic expressiveness, which is described as a\nverging and bordering on life (SW 1, 350). What is essential to art,\nhowever, and what distinguishes it from the semblance of nature, is the\n“expressionless [Ausdruckslose]”:\nthat critical violence within the work of art that “arrests this\nsemblance, spellbinds the movement, and interrupts the harmony”\n(SW 1, 340). “Only the expressionless completes the work” as\na work of art, Benjamin argues, and it does so by shattering the\nwork’s semblance of unity, the false appearance of totality\npertaining to it. Unlike the intensification of Romantic reflection,\nwhen this semblance itself becomes the object of a higher-level\nsemblance, a refractive dissonance is opened up. Drawing on\nHölderlin’s concept of the caesura to describe this moment,\nBenjamin calls it a “counter-rhythmic rupture” (SW 1, 341).\nIn focusing its efforts on representing this caesura, genuine criticism\nin turn deepens the refractive violence, performing a destructive or\nmortuary act of self-annihilation upon the work.\nArt, at the very limit of its mimetic capacity, draws attention to\nits construction and in doing so finds the resources to encapsulate a\ndeeper truth. It is against what Benjamin calls the Christian-mystical\ncertainty in future reconciliation (which Goethe inserts into the\nconclusion of the novella as an attempt to counter the mythical\nfatalism which holds sway elsewhere) that he instead endorses the\nparadoxical glimmer of hope identified with the image of a shooting\nstar which appears in Goethe’s novella (SW 1, 354–5). If the\nimage of the star retains its relationship to the symbolic here, it\ndoes so in accordance with Benjamin’s earlier description of the\nexpressionless as “the torso of a symbol” (SW 1, 340).\nHowever, it might be better to understand the significance of the\ncaesura here in the context of the theory of allegory. This is only\nproperly formulated in Benjamin’s next major work, his thesis on\nthe Origin of the German Mourning-Play (Ursprung des\ndeutschen Trauerspiels, 1928).\n",
    "section_title": "3. Romanticism, Goethe and Criticism",
    "entry_title": "Walter Benjamin",
    "hierarchy_title": "Walter Benjamin || Romanticism, Goethe and Criticism",
    "tokenized_text": [
        "romanticism",
        "goethe",
        "criticism",
        "romanticism",
        "goethe",
        "criticism",
        "benjamin",
        "initially",
        "sought",
        "develop",
        "idea",
        "context",
        "kant",
        "philosophy",
        "history",
        "believing",
        "context",
        "problem",
        "kantian",
        "system",
        "could",
        "fully",
        "exposed",
        "challenged",
        "c",
        "early",
        "article",
        "life",
        "student",
        "da",
        "leben",
        "der",
        "studenten",
        "useful",
        "suggesting",
        "problem",
        "manifest",
        "within",
        "philosophy",
        "history",
        "reject",
        "view",
        "history",
        "put",
        "faith",
        "infinite",
        "extent",
        "time",
        "thus",
        "concern",
        "speed",
        "lack",
        "people",
        "epoch",
        "advance",
        "along",
        "path",
        "progress",
        "contrast",
        "perspective",
        "history",
        "appears",
        "concentrated",
        "single",
        "focal",
        "point",
        "like",
        "traditionally",
        "found",
        "utopian",
        "image",
        "philosopher",
        "sw",
        "latter",
        "messianic",
        "view",
        "history",
        "distinct",
        "intention",
        "methodology",
        "aim",
        "grasp",
        "element",
        "benjamin",
        "call",
        "ultimate",
        "condition",
        "highest",
        "metaphysical",
        "state",
        "historywhich",
        "might",
        "call",
        "historical",
        "absoluteappear",
        "telos",
        "end",
        "history",
        "immanent",
        "state",
        "perfection",
        "potential",
        "manifest",
        "particular",
        "moment",
        "sw",
        "claim",
        "necessary",
        "recognition",
        "metaphysical",
        "condition",
        "requires",
        "act",
        "criticism",
        "kritik",
        "sw",
        "benjamin",
        "initially",
        "proposed",
        "kant",
        "philosophy",
        "history",
        "topic",
        "doctoral",
        "dissertation",
        "felt",
        "necessary",
        "change",
        "early",
        "german",
        "romantic",
        "philosophy",
        "art",
        "crucial",
        "feature",
        "proposed",
        "project",
        "survive",
        "final",
        "work",
        "astute",
        "reader",
        "say",
        "may",
        "still",
        "discern",
        "insight",
        "relationship",
        "truth",
        "history",
        "c",
        "specifically",
        "concept",
        "art",
        "criticism",
        "operating",
        "romantic",
        "aesthetic",
        "rest",
        "upon",
        "epistemological",
        "presupposition",
        "reveal",
        "messianic",
        "essence",
        "romanticism",
        "sw",
        "n",
        "messianic",
        "conjunction",
        "highest",
        "metaphysical",
        "state",
        "history",
        "ephemerality",
        "particular",
        "moment",
        "seen",
        "theoretically",
        "determining",
        "romantic",
        "relationship",
        "artistic",
        "absoluteor",
        "benjamin",
        "defines",
        "idea",
        "artand",
        "particular",
        "artwork",
        "doctoral",
        "dissertation",
        "benjamin",
        "argues",
        "philosophical",
        "relationship",
        "idea",
        "art",
        "particular",
        "artwork",
        "posited",
        "romantic",
        "aesthetic",
        "must",
        "understood",
        "relation",
        "fichte",
        "theory",
        "reflection",
        "sought",
        "ground",
        "possibility",
        "certain",
        "immediate",
        "type",
        "cognition",
        "without",
        "recourse",
        "problematic",
        "notion",
        "intellectual",
        "intuition",
        "fichte",
        "reflection",
        "indicates",
        "free",
        "activity",
        "consciousness",
        "taking",
        "object",
        "thought",
        "capacity",
        "thinking",
        "thinking",
        "initial",
        "form",
        "thinking",
        "transformed",
        "content",
        "reflection",
        "thought",
        "seems",
        "capable",
        "immediately",
        "grasping",
        "thinking",
        "subject",
        "therefore",
        "possessing",
        "certain",
        "kind",
        "immediate",
        "foundational",
        "knowledge",
        "although",
        "benjamin",
        "introduces",
        "number",
        "specific",
        "criticism",
        "fichte",
        "philosophical",
        "position",
        "dissertation",
        "nonetheless",
        "value",
        "fichtean",
        "concept",
        "reflection",
        "providing",
        "epistemological",
        "foundation",
        "friedrich",
        "schlegel",
        "novalis",
        "understanding",
        "metaphysical",
        "function",
        "art",
        "criticism",
        "scholar",
        "however",
        "questioned",
        "accuracy",
        "benjamin",
        "interpretation",
        "fichte",
        "concept",
        "reflection",
        "importance",
        "accord",
        "romantic",
        "epistemology",
        "bullock",
        "menninghaus",
        "unlike",
        "fichte",
        "immediacy",
        "infinitude",
        "mutually",
        "exclusive",
        "aspect",
        "cognition",
        "uniqueness",
        "romantic",
        "concept",
        "absolute",
        "resides",
        "fact",
        "romantic",
        "conception",
        "infinitude",
        "regard",
        "empty",
        "substantial",
        "filled",
        "sw",
        "benjamin",
        "argued",
        "romantic",
        "specifically",
        "identified",
        "structure",
        "absolute",
        "idea",
        "art",
        "particular",
        "artistic",
        "form",
        "sw",
        "art",
        "criticism",
        "becomes",
        "central",
        "concept",
        "infinite",
        "fulfilment",
        "like",
        "epistemological",
        "relation",
        "reflection",
        "thought",
        "fichte",
        "criticism",
        "consummates",
        "finite",
        "particular",
        "work",
        "raising",
        "higher",
        "levelin",
        "form",
        "work",
        "transformed",
        "content",
        "object",
        "criticismand",
        "simultaneously",
        "connects",
        "work",
        "particular",
        "artistic",
        "form",
        "continuity",
        "unity",
        "absolute",
        "form",
        "idea",
        "art",
        "criticism",
        "romantic",
        "continuation",
        "ongoing",
        "completion",
        "particular",
        "work",
        "infinite",
        "connection",
        "art",
        "work",
        "work",
        "criticism",
        "conceiving",
        "idea",
        "art",
        "medium",
        "reflection",
        "early",
        "romantic",
        "dissolve",
        "enlightenment",
        "worldview",
        "positive",
        "science",
        "fichte",
        "inherited",
        "kant",
        "overcome",
        "critical",
        "injunction",
        "placed",
        "upon",
        "experience",
        "infinite",
        "sw",
        "conception",
        "fulfilled",
        "infinity",
        "constitutes",
        "messianism",
        "benjamin",
        "claim",
        "essential",
        "early",
        "romantic",
        "epistemology",
        "version",
        "dissertation",
        "formally",
        "submitted",
        "university",
        "benjamin",
        "concludes",
        "identifying",
        "romantic",
        "theory",
        "art",
        "criticism",
        "consummation",
        "work",
        "sw",
        "artwork",
        "provides",
        "immanent",
        "criterion",
        "critical",
        "reflection",
        "turn",
        "completes",
        "work",
        "raising",
        "autonomous",
        "higher",
        "existence",
        "immanent",
        "criticism",
        "reject",
        "dogmatic",
        "imposition",
        "external",
        "rule",
        "classical",
        "aesthetic",
        "dissolution",
        "aesthetic",
        "criterion",
        "appeal",
        "artistic",
        "genius",
        "provides",
        "benjamin",
        "thought",
        "one",
        "fundamental",
        "legacy",
        "modern",
        "concept",
        "art",
        "criticism",
        "version",
        "circulated",
        "amongst",
        "friend",
        "colleague",
        "conclude",
        "complete",
        "affirmation",
        "romanticism",
        "however",
        "contains",
        "critical",
        "afterword",
        "render",
        "explicit",
        "critical",
        "objection",
        "benjamin",
        "carefully",
        "inserted",
        "text",
        "suggest",
        "romantic",
        "theory",
        "art",
        "implication",
        "structure",
        "absolute",
        "grounded",
        "upon",
        "problematically",
        "onesided",
        "incomplete",
        "regard",
        "formalism",
        "positivity",
        "singularity",
        "since",
        "content",
        "successive",
        "level",
        "reflection",
        "supplied",
        "form",
        "object",
        "criticism",
        "unfolds",
        "germ",
        "immanent",
        "criticizability",
        "contained",
        "particular",
        "artwork",
        "form",
        "formalism",
        "precludes",
        "serious",
        "discussion",
        "artwork",
        "specific",
        "content",
        "conversely",
        "anything",
        "immanently",
        "uncriticizable",
        "constitute",
        "true",
        "work",
        "art",
        "consequence",
        "romantic",
        "criticism",
        "unable",
        "differentiate",
        "good",
        "bad",
        "artwork",
        "since",
        "criterion",
        "whether",
        "work",
        "art",
        "criticism",
        "entirely",
        "positive",
        "evaluation",
        "lack",
        "important",
        "negative",
        "moment",
        "essential",
        "judgement",
        "finally",
        "schlegel",
        "committed",
        "old",
        "error",
        "confounding",
        "abstract",
        "universal",
        "believed",
        "make",
        "absolute",
        "ground",
        "art",
        "individual",
        "benjamin",
        "claim",
        "sw",
        "therefore",
        "gave",
        "false",
        "interpretation",
        "unity",
        "work",
        "conceived",
        "pertaining",
        "mystical",
        "singular",
        "transcendental",
        "work",
        "consequent",
        "need",
        "benjamin",
        "present",
        "goethean",
        "modification",
        "early",
        "german",
        "romanticism",
        "laid",
        "afterword",
        "relation",
        "criticism",
        "romanticism",
        "goethe",
        "thought",
        "suggested",
        "claim",
        "ultimately",
        "mystical",
        "thesis",
        "art",
        "one",
        "workstands",
        "exact",
        "correlation",
        "principle",
        "asserts",
        "indestructibility",
        "work",
        "purified",
        "irony",
        "sw",
        "mistaken",
        "emphasis",
        "singularity",
        "idea",
        "art",
        "romantic",
        "fulfilment",
        "coincides",
        "infinity",
        "unconditioned",
        "meaning",
        "fulfilment",
        "essentially",
        "nonhistorical",
        "category",
        "infinite",
        "criticism",
        "described",
        "judgement",
        "since",
        "authentic",
        "judgement",
        "involves",
        "essential",
        "negative",
        "moment",
        "completion",
        "selfannihilation",
        "sw",
        "consequently",
        "romantic",
        "messianism",
        "work",
        "full",
        "force",
        "sw",
        "romantic",
        "increasingly",
        "forced",
        "turn",
        "accoutrement",
        "ethic",
        "religion",
        "politics",
        "provide",
        "content",
        "required",
        "complete",
        "theory",
        "art",
        "goethe",
        "conception",
        "aesthetic",
        "judgement",
        "principle",
        "uncriticizability",
        "great",
        "work",
        "provided",
        "benjamin",
        "way",
        "thinking",
        "necessary",
        "modification",
        "early",
        "german",
        "romantic",
        "idea",
        "art",
        "explication",
        "implicit",
        "metaphysical",
        "structure",
        "goethe",
        "corresponding",
        "ideal",
        "art",
        "reveals",
        "contrasting",
        "feature",
        "structure",
        "absolute",
        "sphere",
        "pure",
        "content",
        "medium",
        "destructive",
        "refraction",
        "plurality",
        "discontinuous",
        "archetype",
        "charles",
        "finite",
        "particular",
        "work",
        "never",
        "romanticized",
        "unity",
        "individual",
        "absolute",
        "remains",
        "immanently",
        "incomplete",
        "yet",
        "nonetheless",
        "incapable",
        "higher",
        "consummation",
        "torso",
        "dismembered",
        "relation",
        "whole",
        "corpselike",
        "deadness",
        "context",
        "true",
        "task",
        "criticism",
        "becomes",
        "consummation",
        "living",
        "work",
        "destructive",
        "completion",
        "dying",
        "one",
        "benjamin",
        "essay",
        "goethe",
        "elective",
        "affinity",
        "provides",
        "exemplary",
        "piece",
        "criticism",
        "whilst",
        "developing",
        "concept",
        "situating",
        "explicitly",
        "within",
        "context",
        "history",
        "criticism",
        "charged",
        "task",
        "revealing",
        "benjamin",
        "call",
        "truth",
        "content",
        "work",
        "art",
        "intimately",
        "bound",
        "material",
        "content",
        "beginning",
        "work",
        "history",
        "sw",
        "contrast",
        "mere",
        "commentarywhich",
        "proceeds",
        "consideration",
        "historically",
        "anachronistic",
        "feature",
        "material",
        "contentthe",
        "aim",
        "criticism",
        "destruction",
        "outer",
        "layer",
        "order",
        "work",
        "inner",
        "truth",
        "content",
        "grasped",
        "fundamental",
        "philological",
        "error",
        "commentary",
        "merely",
        "situate",
        "work",
        "relation",
        "lived",
        "experience",
        "erlebnis",
        "author",
        "biographical",
        "life",
        "exemplified",
        "friedrich",
        "gundolf",
        "biography",
        "goethe",
        "instead",
        "broader",
        "medium",
        "historical",
        "reception",
        "passed",
        "contemporary",
        "critic",
        "benjamin",
        "romantic",
        "theory",
        "immanent",
        "criticism",
        "insists",
        "work",
        "must",
        "contain",
        "inner",
        "criterion",
        "critic",
        "proceeds",
        "work",
        "life",
        "author",
        "sw",
        "beginning",
        "therefore",
        "odd",
        "striking",
        "feature",
        "goethe",
        "work",
        "come",
        "preoccupy",
        "later",
        "critic",
        "benjamin",
        "examines",
        "derived",
        "technique",
        "borrowed",
        "distinct",
        "form",
        "novella",
        "novellalike",
        "construction",
        "grant",
        "elective",
        "affinity",
        "strange",
        "fablelike",
        "quality",
        "differentiates",
        "naturalism",
        "typical",
        "novel",
        "mythical",
        "layer",
        "real",
        "material",
        "content",
        "work",
        "express",
        "presence",
        "pantheistic",
        "daemonic",
        "attitude",
        "toward",
        "nature",
        "goethe",
        "work",
        "truth",
        "content",
        "contrast",
        "sought",
        "conspicuous",
        "feature",
        "work",
        "technique",
        "unity",
        "distinct",
        "form",
        "task",
        "criticism",
        "make",
        "truth",
        "content",
        "object",
        "experience",
        "concern",
        "life",
        "intention",
        "artist",
        "semblance",
        "appearance",
        "life",
        "work",
        "posse",
        "virtue",
        "mimetic",
        "capacity",
        "representation",
        "linguistic",
        "expressiveness",
        "described",
        "verging",
        "bordering",
        "life",
        "sw",
        "essential",
        "art",
        "however",
        "distinguishes",
        "semblance",
        "nature",
        "expressionless",
        "ausdruckslose",
        "critical",
        "violence",
        "within",
        "work",
        "art",
        "arrest",
        "semblance",
        "spellbinds",
        "movement",
        "interrupt",
        "harmony",
        "sw",
        "expressionless",
        "completes",
        "work",
        "work",
        "art",
        "benjamin",
        "argues",
        "shattering",
        "work",
        "semblance",
        "unity",
        "false",
        "appearance",
        "totality",
        "pertaining",
        "unlike",
        "intensification",
        "romantic",
        "reflection",
        "semblance",
        "becomes",
        "object",
        "higherlevel",
        "semblance",
        "refractive",
        "dissonance",
        "opened",
        "drawing",
        "hölderlin",
        "concept",
        "caesura",
        "describe",
        "moment",
        "benjamin",
        "call",
        "counterrhythmic",
        "rupture",
        "sw",
        "focusing",
        "effort",
        "representing",
        "caesura",
        "genuine",
        "criticism",
        "turn",
        "deepens",
        "refractive",
        "violence",
        "performing",
        "destructive",
        "mortuary",
        "act",
        "selfannihilation",
        "upon",
        "work",
        "art",
        "limit",
        "mimetic",
        "capacity",
        "draw",
        "attention",
        "construction",
        "find",
        "resource",
        "encapsulate",
        "deeper",
        "truth",
        "benjamin",
        "call",
        "christianmystical",
        "certainty",
        "future",
        "reconciliation",
        "goethe",
        "insert",
        "conclusion",
        "novella",
        "attempt",
        "counter",
        "mythical",
        "fatalism",
        "hold",
        "sway",
        "elsewhere",
        "instead",
        "endorses",
        "paradoxical",
        "glimmer",
        "hope",
        "identified",
        "image",
        "shooting",
        "star",
        "appears",
        "goethe",
        "novella",
        "sw",
        "image",
        "star",
        "retains",
        "relationship",
        "symbolic",
        "accordance",
        "benjamin",
        "earlier",
        "description",
        "expressionless",
        "torso",
        "symbol",
        "sw",
        "however",
        "might",
        "better",
        "understand",
        "significance",
        "caesura",
        "context",
        "theory",
        "allegory",
        "properly",
        "formulated",
        "benjamin",
        "next",
        "major",
        "work",
        "thesis",
        "origin",
        "german",
        "mourningplay",
        "ursprung",
        "de",
        "deutschen",
        "trauerspiels"
    ]
}