{
    "main_text": "Perception and memory\n4. Perception and memory\n\nSince its publication in 1896, Matter and Memory has\nattracted considerable attention (see, for example, Deleuze 1956). In\nthe Preface that he wrote in 1910, Bergson says that Matter and\nMemory “is frankly dualistic,” since it\n“affirms both the reality of matter and the reality of\nspirit” (Matter and Memory, p. 9). However, he is quick to warn\nus that the aim of the book is really “to overcome the\ntheoretical difficulties which have always beset dualism”\n(ibid.). In the history of philosophy, these theoretical difficulties\nhave generally arisen from a view of external perception, which always\nseems to result in an opposition between representation and matter.\nThus, Bergson’s theory of “pure perception,” laid\nout in the first chapter of Matter and Memory aims to show that\n— beyond both realism and idealism — our knowledge of\nthings, in its pure state, takes place within the things it\nrepresents.\n\nBut, in order to show this, Bergson starts with a hypothesis that all\nwe sense are images. Now we can see the basis of Bergson’s use\nof images in his method of intuition. He is re-stating the problem of\nperception in terms of images because it seems to be an intermediate\nposition between realism and idealism (Matter and Memory, p. 26).\nBergson is employing the concept of image to dispel the false belief\n— central to realism and materialism — that matter is a\nthing that possesses a hidden power able to produce representations in\nus. There is no hidden power in matter; matter is only images.\nBergson, however, not only criticizes materialism (its theory of\nhidden powers), but also idealism insofar as idealism attempts to\nreduce matter to the representation we have of it. For Bergson, image\ndiffers from representation, but it does not differ in nature from\nrepresentation since Bergson’s criticism of materialism consists\nin showing that matter does not differ in nature from representation.\nFor Bergson, the image is less than a thing but more than a\nrepresentation. The “more” and the “less”\nindicates that representation differs from the image by degree. It\nalso indicates that perception is continuous with images of matter.\nThrough the hypothesis of the image, Bergson is re-attaching\nperception to the real.\n\nIn perception — Bergson demonstrates this point through his\ntheory of pure perception — the image of a material thing\nbecomes a representation. A representation is always in the image\nvirtually. We shall return to this concept of virtuality below. In any\ncase, in perception, there is a transition from the image as being in\nitself to its being for me. But, perception adds nothing new to the\nimage; in fact, it subtracts from it. Representation is a diminution\nof the image; the transition from image to pure perception is\n“discernment in the etymological sense of the word,” a\n“slicing up” or a “selection” (Matter and\nMemory, p. 38). According to Bergson, selection occurs because of\nnecessities or utility based in our bodies. In other words, conscious\nrepresentation results from the suppression of what has no interest\nfor bodily functions and the conservation only of what does interest\nbodily functions. The conscious perception of a living being therefore\nexhibits a “necessary poverty” ( Matter and Memory, p.\n38).\n\nIf we can circle back for a moment, although Bergson shows that we\nperceive things in the things, the necessary poverty of perception\nmeans that it cannot define intuition. Turning back from the habitual\nuse of intelligence for needs, intuition, as we can see now, places us\nabove or below representations. Intuition is fundamentally\nun-representative. In this regard, the following passage from the\nthird chapter of Matter and Memory becomes very\nimportant:\n\nIf you abolish my consciousness … matter resolves itself into\nnumberless vibrations, all linked together in uninterrupted\ncontinuity, all bound up with each other, and traveling in every\ndirection like shivers. In short, try first to connect together the\ndiscontinuous objects of daily experience; then, resolve the\nmotionless continuity of these qualities into vibrations, which are\nmoving in place; finally, attach yourself to these movements, by\nfreeing yourself from the divisible space that underlies them in order\nto consider only their mobility – this undivided act that your\nconsciousness grasps in the movement that you yourself execute. You\nwill obtain a vision of matter that is perhaps fatiguing for your\nimagination, but pure and stripped of what the requirements of life\nmake you add to it in external perception. Reestablish now my\nconsciousness, and with it, the requirements of life: farther and\nfarther, and by crossing over each time enormous periods of the\ninternal history of things, quasi-instantaneous views are going to be\ntaken, views this time pictorial, of which the most vivid colors\ncondense an infinity of repetitions and elementary changes. In just\nthe same way the thousands of successive positions of a runner are\ncontracted into one sole symbolic attitude, which our eye perceives,\nwhich art reproduces, and which becomes for everyone the image of a\nman who runs (Matter and Memory, pp.208–209).\n\n\nLike the descriptions of intuition, this passage describes how we can\nresolve the images of matter into mobile vibrations. In this way, we\novercome the inadequacy of all images of duration. We would have to\ncall the experience described here not a perception of matter, but a\nmemory of matter because of its richness. As we have already\nsuggested, Bergsonian intuition is memory. So, we turn now to\nmemory.\n\nAs we saw in the discussion of method above, Bergson always makes a\ndifferentiation within a mixture. Therefore, he sees that our word\n“memory” mixes together two different kinds of memories.\nOn the one hand, there is habit-memory, which consists in obtaining\ncertain automatic behavior by means of repetition; in other words, it\ncoincides with the acquisition of sensori-motor mechanisms. On the\nother hand, there is true or “pure” memory; it is the\nsurvival of personal memories, a survival that, for Bergson, is\nunconscious. In other words, we have habit-memory actually aligned\nwith bodily perception. Pure memory is something else, and here we\nencounter Bergson’s famous (or infamous) image of the memory\ncone.\n\nThe image of the inverted cone occurs twice in the third chapter of\nMatter and Memory (pp. 152 and 162). The image of the cone is\nconstructed with a plane and an inverted cone whose summit is inserted\ninto the plane. The plane, “plane P,” as Bergson calls it,\nis the “plane of my actual representation of the\nuniverse.”  The cone “SAB,” of course, is\nsupposed to symbolize memory, specifically, the true memory or\nregressive memory. At the cone’s base, “AB,” we have\nunconscious memories, the oldest surviving memories, which come\nforward spontaneously, for example, in dreams. As we descend, we have\nan indefinite number of different regions of the past ordered by their\ndistance or nearness to the present. The second cone image represents\nthese different regions with horizontal lines trisecting the cone. At\nthe summit of the cone, “S,” we have the image of my body\nwhich is concentrated into a point, into the present perception. The\nsummit is inserted into the plane and thus the image of my body\n“participates in the plane” of my actual representation of\nthe universe.\n\nThe inverted cone image is no exception to Bergson’s belief that\nall images are inadequate to duration. The inverted cone is really\nsupposed to symbolize a dynamic process, mobility. Memories are\ndescending down the cone from the past to the present perception and\naction. The idea that memories are descending means that true memory\nin Bergson is progressive. This progressive movement of memory as a\nwhole takes place, according to Bergson, between the extremes of the\nbase of “pure memory,” which is immobile and which Bergson\ncalls “contemplation” (Matter and Memory, p. 163), and the\nplane where action takes place. Whenever Bergson in any of his works\nmentions contemplation, he is thinking of Plotinus, on whom he\nlectured many times. But, in contrast to Plotinus, for Bergson,\nthinking is not mere contemplation; it is the entire or integral\nmovement of memory between contemplation and action. Thinking, for\nBergson, occurs when pure memory moves forward into singular images.\nThis forward movement occurs by means of two movements which the\ninverted cone symbolizes. On the one hand, the cone is supposed to\nrotate. Bergson compares the experience of true memory to a telescope,\nwhich allows us to understand the rotating movement. What we are\nsupposed to visualize with the cone is a telescope that we are\npointing up at the night sky. Thus, when I am trying to remember\nsomething, I at first see nothing all. What will help us understand\nthis image is the idea of my character. When I try to remember how my\ncharacter came about, at first, I might not remember anything; no\nimage might at first come to mind. Pure memory for Bergson precedes\nimages; it is unconscious. But, I try to focus, as if I were rotating\nthe rings that control the lenses in the “telescope”; then\nsome singular images come into view. Rotation is really the key to\nBergson’s concept of virtuality. Always, we start with something\nlike the Milky Way, a cloud of interpenetration; but then the cloud\nstarts to condense into singular drops, into singular stars. This\nmovement from interpenetration to fragmentation, from unity to\nmultiplicity, (and even from multiplicity to juxtaposition) is always\npotential or virtual. But the reverse process is also virtual.\nTherefore the cone has a second movement, “contraction”\n(Matter and Memory, p. 168). If we remain with the telescope\nimage, we can see that the images of the constellation must be\nnarrowed, brought down the tube so that they will fit into my eye.\nHere we have a movement from singular images to generalities, on which\naction can be based. The movement of memory always results in action.\nBut also, for Bergson, this twofold movement of rotation and\ncontraction can be repeated in language. Even though Bergson never\ndevotes much reflection to language – we shall return to this\npoint below– he is well aware that literary creation resembles\nnatural creation. Here we should consult his early essay on laughter.\nBut, with this creative movement, which is memory, we can turn to\ncreative evolution.\n",
    "section_title": "4. Perception and memory",
    "entry_title": "Henri Bergson",
    "hierarchy_title": "Henri Bergson || Perception and memory",
    "tokenized_text": [
        "perception",
        "memory",
        "perception",
        "memory",
        "since",
        "publication",
        "matter",
        "memory",
        "attracted",
        "considerable",
        "attention",
        "see",
        "example",
        "deleuze",
        "preface",
        "wrote",
        "bergson",
        "say",
        "matter",
        "memory",
        "frankly",
        "dualistic",
        "since",
        "affirms",
        "reality",
        "matter",
        "reality",
        "spirit",
        "matter",
        "memory",
        "p",
        "however",
        "quick",
        "warn",
        "u",
        "aim",
        "book",
        "really",
        "overcome",
        "theoretical",
        "difficulty",
        "always",
        "beset",
        "dualism",
        "ibid",
        "history",
        "philosophy",
        "theoretical",
        "difficulty",
        "generally",
        "arisen",
        "view",
        "external",
        "perception",
        "always",
        "seems",
        "result",
        "opposition",
        "representation",
        "matter",
        "thus",
        "bergson",
        "theory",
        "pure",
        "perception",
        "laid",
        "first",
        "chapter",
        "matter",
        "memory",
        "aim",
        "show",
        "beyond",
        "realism",
        "idealism",
        "knowledge",
        "thing",
        "pure",
        "state",
        "take",
        "place",
        "within",
        "thing",
        "represents",
        "order",
        "show",
        "bergson",
        "start",
        "hypothesis",
        "sense",
        "image",
        "see",
        "basis",
        "bergson",
        "use",
        "image",
        "method",
        "intuition",
        "restating",
        "problem",
        "perception",
        "term",
        "image",
        "seems",
        "intermediate",
        "position",
        "realism",
        "idealism",
        "matter",
        "memory",
        "p",
        "bergson",
        "employing",
        "concept",
        "image",
        "dispel",
        "false",
        "belief",
        "central",
        "realism",
        "materialism",
        "matter",
        "thing",
        "posse",
        "hidden",
        "power",
        "able",
        "produce",
        "representation",
        "u",
        "hidden",
        "power",
        "matter",
        "matter",
        "image",
        "bergson",
        "however",
        "criticizes",
        "materialism",
        "theory",
        "hidden",
        "power",
        "also",
        "idealism",
        "insofar",
        "idealism",
        "attempt",
        "reduce",
        "matter",
        "representation",
        "bergson",
        "image",
        "differs",
        "representation",
        "differ",
        "nature",
        "representation",
        "since",
        "bergson",
        "criticism",
        "materialism",
        "consists",
        "showing",
        "matter",
        "differ",
        "nature",
        "representation",
        "bergson",
        "image",
        "le",
        "thing",
        "representation",
        "le",
        "indicates",
        "representation",
        "differs",
        "image",
        "degree",
        "also",
        "indicates",
        "perception",
        "continuous",
        "image",
        "matter",
        "hypothesis",
        "image",
        "bergson",
        "reattaching",
        "perception",
        "real",
        "perception",
        "bergson",
        "demonstrates",
        "point",
        "theory",
        "pure",
        "perception",
        "image",
        "material",
        "thing",
        "becomes",
        "representation",
        "representation",
        "always",
        "image",
        "virtually",
        "shall",
        "return",
        "concept",
        "virtuality",
        "case",
        "perception",
        "transition",
        "image",
        "perception",
        "add",
        "nothing",
        "new",
        "image",
        "fact",
        "subtracts",
        "representation",
        "diminution",
        "image",
        "transition",
        "image",
        "pure",
        "perception",
        "discernment",
        "etymological",
        "sense",
        "word",
        "slicing",
        "selection",
        "matter",
        "memory",
        "p",
        "according",
        "bergson",
        "selection",
        "occurs",
        "necessity",
        "utility",
        "based",
        "body",
        "word",
        "conscious",
        "representation",
        "result",
        "suppression",
        "interest",
        "bodily",
        "function",
        "conservation",
        "interest",
        "bodily",
        "function",
        "conscious",
        "perception",
        "living",
        "therefore",
        "exhibit",
        "necessary",
        "poverty",
        "matter",
        "memory",
        "p",
        "circle",
        "back",
        "moment",
        "although",
        "bergson",
        "show",
        "perceive",
        "thing",
        "thing",
        "necessary",
        "poverty",
        "perception",
        "mean",
        "define",
        "intuition",
        "turning",
        "back",
        "habitual",
        "use",
        "intelligence",
        "need",
        "intuition",
        "see",
        "place",
        "u",
        "representation",
        "intuition",
        "fundamentally",
        "unrepresentative",
        "regard",
        "following",
        "passage",
        "third",
        "chapter",
        "matter",
        "memory",
        "becomes",
        "important",
        "abolish",
        "consciousness",
        "matter",
        "resolve",
        "numberless",
        "vibration",
        "linked",
        "together",
        "uninterrupted",
        "continuity",
        "bound",
        "traveling",
        "every",
        "direction",
        "like",
        "shiver",
        "short",
        "try",
        "first",
        "connect",
        "together",
        "discontinuous",
        "object",
        "daily",
        "experience",
        "resolve",
        "motionless",
        "continuity",
        "quality",
        "vibration",
        "moving",
        "place",
        "finally",
        "attach",
        "movement",
        "freeing",
        "divisible",
        "space",
        "underlies",
        "order",
        "consider",
        "mobility",
        "undivided",
        "act",
        "consciousness",
        "grasp",
        "movement",
        "execute",
        "obtain",
        "vision",
        "matter",
        "perhaps",
        "fatiguing",
        "imagination",
        "pure",
        "stripped",
        "requirement",
        "life",
        "make",
        "add",
        "external",
        "perception",
        "reestablish",
        "consciousness",
        "requirement",
        "life",
        "farther",
        "farther",
        "crossing",
        "time",
        "enormous",
        "period",
        "internal",
        "history",
        "thing",
        "quasiinstantaneous",
        "view",
        "going",
        "taken",
        "view",
        "time",
        "pictorial",
        "vivid",
        "color",
        "condense",
        "infinity",
        "repetition",
        "elementary",
        "change",
        "way",
        "thousand",
        "successive",
        "position",
        "runner",
        "contracted",
        "one",
        "sole",
        "symbolic",
        "attitude",
        "eye",
        "perceives",
        "art",
        "reproduces",
        "becomes",
        "everyone",
        "image",
        "man",
        "run",
        "matter",
        "memory",
        "pp",
        "like",
        "description",
        "intuition",
        "passage",
        "describes",
        "resolve",
        "image",
        "matter",
        "mobile",
        "vibration",
        "way",
        "overcome",
        "inadequacy",
        "image",
        "duration",
        "would",
        "call",
        "experience",
        "described",
        "perception",
        "matter",
        "memory",
        "matter",
        "richness",
        "already",
        "suggested",
        "bergsonian",
        "intuition",
        "memory",
        "turn",
        "memory",
        "saw",
        "discussion",
        "method",
        "bergson",
        "always",
        "make",
        "differentiation",
        "within",
        "mixture",
        "therefore",
        "see",
        "word",
        "memory",
        "mix",
        "together",
        "two",
        "different",
        "kind",
        "memory",
        "one",
        "hand",
        "habitmemory",
        "consists",
        "obtaining",
        "certain",
        "automatic",
        "behavior",
        "mean",
        "repetition",
        "word",
        "coincides",
        "acquisition",
        "sensorimotor",
        "mechanism",
        "hand",
        "true",
        "pure",
        "memory",
        "survival",
        "personal",
        "memory",
        "survival",
        "bergson",
        "unconscious",
        "word",
        "habitmemory",
        "actually",
        "aligned",
        "bodily",
        "perception",
        "pure",
        "memory",
        "something",
        "else",
        "encounter",
        "bergson",
        "famous",
        "infamous",
        "image",
        "memory",
        "cone",
        "image",
        "inverted",
        "cone",
        "occurs",
        "twice",
        "third",
        "chapter",
        "matter",
        "memory",
        "pp",
        "image",
        "cone",
        "constructed",
        "plane",
        "inverted",
        "cone",
        "whose",
        "summit",
        "inserted",
        "plane",
        "plane",
        "plane",
        "p",
        "bergson",
        "call",
        "plane",
        "actual",
        "representation",
        "universe",
        "cone",
        "sab",
        "course",
        "supposed",
        "symbolize",
        "memory",
        "specifically",
        "true",
        "memory",
        "regressive",
        "memory",
        "cone",
        "base",
        "ab",
        "unconscious",
        "memory",
        "oldest",
        "surviving",
        "memory",
        "come",
        "forward",
        "spontaneously",
        "example",
        "dream",
        "descend",
        "indefinite",
        "number",
        "different",
        "region",
        "past",
        "ordered",
        "distance",
        "nearness",
        "present",
        "second",
        "cone",
        "image",
        "represents",
        "different",
        "region",
        "horizontal",
        "line",
        "trisecting",
        "cone",
        "summit",
        "cone",
        "image",
        "body",
        "concentrated",
        "point",
        "present",
        "perception",
        "summit",
        "inserted",
        "plane",
        "thus",
        "image",
        "body",
        "participates",
        "plane",
        "actual",
        "representation",
        "universe",
        "inverted",
        "cone",
        "image",
        "exception",
        "bergson",
        "belief",
        "image",
        "inadequate",
        "duration",
        "inverted",
        "cone",
        "really",
        "supposed",
        "symbolize",
        "dynamic",
        "process",
        "mobility",
        "memory",
        "descending",
        "cone",
        "past",
        "present",
        "perception",
        "action",
        "idea",
        "memory",
        "descending",
        "mean",
        "true",
        "memory",
        "bergson",
        "progressive",
        "progressive",
        "movement",
        "memory",
        "whole",
        "take",
        "place",
        "according",
        "bergson",
        "extreme",
        "base",
        "pure",
        "memory",
        "immobile",
        "bergson",
        "call",
        "contemplation",
        "matter",
        "memory",
        "p",
        "plane",
        "action",
        "take",
        "place",
        "whenever",
        "bergson",
        "work",
        "mention",
        "contemplation",
        "thinking",
        "plotinus",
        "lectured",
        "many",
        "time",
        "contrast",
        "plotinus",
        "bergson",
        "thinking",
        "mere",
        "contemplation",
        "entire",
        "integral",
        "movement",
        "memory",
        "contemplation",
        "action",
        "thinking",
        "bergson",
        "occurs",
        "pure",
        "memory",
        "move",
        "forward",
        "singular",
        "image",
        "forward",
        "movement",
        "occurs",
        "mean",
        "two",
        "movement",
        "inverted",
        "cone",
        "symbolizes",
        "one",
        "hand",
        "cone",
        "supposed",
        "rotate",
        "bergson",
        "compare",
        "experience",
        "true",
        "memory",
        "telescope",
        "allows",
        "u",
        "understand",
        "rotating",
        "movement",
        "supposed",
        "visualize",
        "cone",
        "telescope",
        "pointing",
        "night",
        "sky",
        "thus",
        "trying",
        "remember",
        "something",
        "first",
        "see",
        "nothing",
        "help",
        "u",
        "understand",
        "image",
        "idea",
        "character",
        "try",
        "remember",
        "character",
        "came",
        "first",
        "might",
        "remember",
        "anything",
        "image",
        "might",
        "first",
        "come",
        "mind",
        "pure",
        "memory",
        "bergson",
        "precedes",
        "image",
        "unconscious",
        "try",
        "focus",
        "rotating",
        "ring",
        "control",
        "lens",
        "telescope",
        "singular",
        "image",
        "come",
        "view",
        "rotation",
        "really",
        "key",
        "bergson",
        "concept",
        "virtuality",
        "always",
        "start",
        "something",
        "like",
        "milky",
        "way",
        "cloud",
        "interpenetration",
        "cloud",
        "start",
        "condense",
        "singular",
        "drop",
        "singular",
        "star",
        "movement",
        "interpenetration",
        "fragmentation",
        "unity",
        "multiplicity",
        "even",
        "multiplicity",
        "juxtaposition",
        "always",
        "potential",
        "virtual",
        "reverse",
        "process",
        "also",
        "virtual",
        "therefore",
        "cone",
        "second",
        "movement",
        "contraction",
        "matter",
        "memory",
        "p",
        "remain",
        "telescope",
        "image",
        "see",
        "image",
        "constellation",
        "must",
        "narrowed",
        "brought",
        "tube",
        "fit",
        "eye",
        "movement",
        "singular",
        "image",
        "generality",
        "action",
        "based",
        "movement",
        "memory",
        "always",
        "result",
        "action",
        "also",
        "bergson",
        "twofold",
        "movement",
        "rotation",
        "contraction",
        "repeated",
        "language",
        "even",
        "though",
        "bergson",
        "never",
        "devotes",
        "much",
        "reflection",
        "language",
        "shall",
        "return",
        "point",
        "below",
        "well",
        "aware",
        "literary",
        "creation",
        "resembles",
        "natural",
        "creation",
        "consult",
        "early",
        "essay",
        "laughter",
        "creative",
        "movement",
        "memory",
        "turn",
        "creative",
        "evolution"
    ]
}