{
    "main_text": "Ethical Thought and Value Pluralism || Value Pluralism after Berlin: Some Controversies\n4.4 Value Pluralism after Berlin: Some Controversies\n\nSince the 1990s, pluralism has become the most widely and hotly\ndebated of Berlin’s ideas. This is due in part to Berlin’s\nwork, and in part to that of later philosophers who, as followers or\nallies of Berlin or independently, have also articulated and advanced\nvalue pluralism or similar\n positions.[18]\n Although pluralism achieved its current prominence in interpretations\nof Berlin’s work later in his life, it was identified earlier as\na key component in his thought by a few prescient readers. Two of\nthese readers advanced what remains one of the most common criticisms\nof Berlin’s pluralism: that it is indistinguishable from\nrelativism (Strauss 1961; Momigliano 1976; see MacCallum 1967a and\nKocis 1989 for other early\n critiques).[19]\n\nOne problem that has bedevilled the debate is a persistent failure to\ndefine the terms at issue with adequate clarity and precision.\nPluralism, of course, has been the subject of repeated definition by\nBerlin and others (the repetition not always serving a clarifying\npurpose). However, the term ‘relativism’ often remains\nunderanalysed in these discussions. Whether pluralism can be\ndistinguished from relativism depends largely on how relativism is\ndefined, as well as on how certain obscure or controversial components\nof pluralism are treated. It should also be noted that the question of\nwhether values are plural is logically distinct from the question of\nwhether they are objective, despite the frequent elision of the two\ntopics in the literature on this subject.\n\nOne way of defining relativism is as a form of subjectivism or moral\nirrationalism. This is how Berlin defined it in his attempts to refute\nthe charge of relativism brought against his pluralism. For Berlin,\nthe model of a relativist statement is ‘I like my coffee white,\nyou like yours black; that is simply the way it is; there is nothing\nto choose between us; I don’t understand how you can prefer\nblack coffee, and you cannot understand how I can prefer white; we\ncannot agree.’ Applied to ethics, this same relativist attitude\nmight lead its holder to say: ‘I like human sacrifice, and you\ndo not; our tastes, and traditions, simply differ.’ Pluralism,\non the other hand, as Berlin defines it, holds that understanding of\nmoral views is possible among all people (unless they are so alienated\nfrom normal human sentiments and beliefs as to be considered really\nderanged). Relativism, in Berlin’s definition, would make such\nmoral understanding impossible; while pluralism explains the\npossibility of (and acceptance of pluralism may facilitate) moral\ncommunication.\n\nAnother (related) way of differentiating pluralism and relativism,\nemployed by Berlin and others, holds that pluralism accepts a basic\n‘core’ of human values, and that these and other values\nadopted alongside them in a particular context fall within a common\n‘human horizon’ (1990, 12). Though Berlin’s usage is\nnot entirely consistent, this horizon is best thought of as a boundary\nenclosing any form of human conduct that is comprehensible to other\nhuman beings in virtue of their shared humanity, whether or not the\nconduct is deemed acceptable. (Actions may be comprehensible but\nunacceptable for more than one reason, including mistaken empirical\nbeliefs and – jointly or separately – what is known in\nreligious terminology as original sin, the innate human propensity to\nbehave immorally.) Beyond the horizon lies behaviour we cannot make\nsense of, and therefore regard as insane or irrational, such as the\nworship of wood simply because it is wood, or sticking pins into the\nflesh of living people just because it is pleasurable to pierce\nresilient surfaces, without regard to or even enjoyment of the pain\nthis causes. The ‘core’ of shared or universal values\naccounts for our agreement on at least some moral issues, for example,\nthe immorality of ‘slavery or ritual murder or Nazi gas\nchambers’ (1990, 19). This view rests on a belief in a basic,\nminimum, universal human nature beneath the widely diverse forms that\nhuman life and belief have taken across time and place. It may also\ninvolve a belief in the existence of a specifically ‘moral\nsense’ inherent in human beings. Berlin seems to have believed\nin such a faculty (which he refers to under this name), and linked it\nto empathy, but did not develop this view in his writings.\n\nYet another way of defining relativism is to view it as holding that\nthings have value only relative to particular situations or\noutlooks; nothing is intrinsically good – that is, valuable in\nand for itself. A slightly different way of putting this would be to\nmaintain that there are no such things as values that are always\nvalid; values are valid to different degrees in different\ncircumstances, but not others. For instance, liberty may be a leading\nvalue in one place at one time, but has a much lower status as a value\nat another. Here, again, Berlin’s pluralism seems opposed to\nrelativism, since it is committed to the belief that, for human\nbeings, at least some values are intrinsically rather than\ninstrumentally good, and that at least some values are universally\nvalid, even if others aren’t, and even if this universal\nvalidity isn’t recognised. Berlin admitted that liberty, for\ninstance, had historically been upheld as a pre-eminent ideal only by\na minority of human beings; yet he still held it to be a genuine value\nfor all human beings, everywhere, because of the way that human beings\nare constituted, and, so far as we know, will continue to be\nconstituted. Similarly, Steven Lukes has suggested that relativism\nseeks to avoid or dismiss moral conflict, to explain it away by\nholding that different values hold for different people\n(‘Liberalism for the liberals, cannibalism for the\ncannibals’: Lukes 2001b; cf. Hollis 1999, 36), and by denying\nthat the competing values may be, and often are, binding on all\npeople. Pluralism, on the other hand, sees conflicts of values as\noccurring both within, and across, cultures, and (at least in\nLukes’s formulation) maintains that custom or relatively valid\nbelief-systems or ways of life cannot be appealed to as ways of\novercoming value-conflict (Lukes 1989). This is not a position that\nBerlin explicitly advances; but his later writings suggest a sympathy\nfor it.\n\nBerlin’s own position seems to lie somewhere between this\nversion of relativism and Lukes’s proposal. He acknowledged that\ncultures are not monolithic or morally ‘rational’ (that\nis, conflicts of values are endemic within cultures), and denies that\ncultural traditions or norms can be invoked to dissipate or\nauthoritatively resolve conflicts between values (as Michael Oakeshott\nsuggested when he appealed to the ‘intimations’ of\ntradition as a way of resolving apparent conflicts generated by\nattempts at ‘rational’ action: see Oakeshott 1962,\n125–34; Oakeshott 1965). But Berlin did hold that, as an\nempirical matter, most individuals do make decisions about how to\nbalance, reconcile, or choose between competing values in light of\ntheir existing general commitments and visions of life, which are\nshaped (though not completely determined) by cultural tradition and\ncontext. Liberty may be a genuine, and important, good for human\nbeings in general; but how human beings decide to promote or actualise\nliberty in relation to a whole web of other values will differ between\ndifferent societies.\n\nYet the charge that pluralism is equivalent to relativism is not so\neasily refuted, given certain ambiguities in Berlin’s account.\nThese centre on the nature and origins of values, the related question\nof the role of cultural norms, and the meaning of\n‘incommensurability’.\n\nAs stated above, Berlin held both that values are human creations, and\nthat they are ‘objective’. The foundation for this latter\nclaim is unclear in Berlin’s work. The claim that values are\nobjective in being founded on (or expressions of) and limited by\ncertain realities of human nature would seem to provide a defence\nagainst relativism, in holding that there is an underlying, shared\nhuman nature which makes at least some values non-relative. The\nargument that values are objective simply because they are pursued by\nhuman beings may seem to allow for relativism, if it makes the\nvalidity of values dependent on nothing but human preferences, and\nallows any values actually pursued by human beings (and, therefore,\nany practices adopted in pursuing those values) to claim\n validity.[20]\n But this is a reductio ad absurdum, to be deflected by\nadding two further considerations: how widespread aspirant universal\nvalues are; and whether they can be justified in terms of some\nrationally defensible conception of human welfare.\n\nOne of the knottiest dimensions of Berlin’s pluralism is the\nidea of incommensurability, which has led to diverging\ninterpretations. One can make a three-way distinction, between weak\nincommensurability, moderate incommensurability and radical\nincommensurability. Weak incommensurability is the view that values\ncannot be ranked quantitatively, but can be arranged in a qualitative\nhierarchy that applies consistently in all cases. Berlin goes further\nthan this, but it is not clear whether he presents a moderate or a\nradical version of incommensurability. The former holds that there is\nno single, ultimate scale or principle with which to measure values\n– no moral ‘slide-rule’ (2002b, 216) or universal\nunit of normative measurement. This view is certainly consistent with\nall that Berlin wrote from the 1930s onwards. Such a view does not\nnecessarily rule out making judgements between values on a\ncase-by-case basis: just because values can’t be compared or\nranked in terms of one master-value or formula, we can’t\nconclude that it is impossible to compare or deliberate between them\nat all, as we indeed do in actual cases.\n\nBerlin does sometimes offer more starkly dramatic accounts of\nincommensurability, which make it hard to rule out the more radical\ninterpretation of the concept, according to which incommensurability\nis more or less synonymous with incomparability. This interpretation\nstates that values cannot be compared at all, since there is no\n‘common currency’ in terms of which to compare them: each\nvalue, being sui generis, cannot be judged in relation to any\nother value, because there is nothing in relation to which both can be\njudged or measured. As a result, choices among values cannot be based\non (objectively valid) evaluative comparisons, but only on personal\npreference, or on an act of radical, arbitrary choice, which Berlin\nsometimes calls ‘plumping’. But plumping need not be a\ndisembodied, inexplicable act: it can draw, albeit subconsciously, on\na hinterland of moral understanding rooted in the moral experience of\nthe plumper and in his cultural tradition.\n\nA related question concerns the role of reason in moral deliberation.\nIf values are incommensurable, must all choices between conflicting\nvalues be ultimately subjective or irrational? If so, how does\npluralism differ from radical relativism and subjectivism? If not,\nhow, exactly, does moral reasoning work? How can we rationally make\nchoices between values when there is no system or unit of measurement\nthat can be used in making such deliberations? One possible answer to\nthe last question is to offer an account of practical, situational\nreasoning that is not quantitative or rule-based, but appeals to the\nmoral sense mentioned above. This is what Berlin suggests; but, once\nagain, he does not offer a systematic explanation of the nature of\nnon-systematic reason. (On incommensurability see Chang 1997 and\nCrowder 2002.)\n\nIn the area of political philosophy, the most widespread controversy\nover pluralism concerns its relationship to liberalism. This debate\noverlaps with that regarding pluralism’s relationship to\nrelativism, to the extent that liberalism is regarded as resting on a\nbelief in certain universal values and fundamental human rights, a\nbelief which relativism undermines. However, there are some who\nmaintain that, while pluralism is distinct from, and preferable to,\nrelativism, it is nevertheless too radical, contested and subversive\nto be be depended on for a justification of liberalism (or,\nconversely, that liberalism is too universalistic or absolutist to be\nlinked to pluralism). The main proponent of this view, more\nresponsible than any other thinker for the emergence and wide\ndiscussion of this issue, is John Gray (see, especially, Gray 1995).\nGray asserts that pluralism is true, that pluralism undermines\nliberalism, and that therefore liberalism should be abandoned, at\nleast in its traditional role of a political philosophy claiming\nuniversal\n status.[21]\n\nGray’s case has spawned a vast literature, concerning both\nBerlin’s own treatment of the relationship between pluralism and\nliberalism in particular, and this issue in general. Some theorists\nhave agreed with Gray (Kekes, 1993, 1997); others have sought to show\nthat pluralism and liberalism are reconcilable, although this\nreconciliation may require modifications to both liberalism and\npluralism – modifications that are, however, justifiable, and\nindeed inherently desirable. The most extensive discussions to date\nare those by George Crowder and William Galston (Crowder 2002, 2004,\n2019, Galston 2002,\n 2004).[22]\n\nBerlin himself was devoted both to pluralism and to liberalism, which\nhe saw not as related by logical entailment (though he sometimes comes\nclose to positing this: e.g. 2002b, 216; Jahanbegloo 1992, 44), but as\ninterconnected and harmonious. The version of pluralism he advanced\nwas distinctly liberal in its assumptions, aims and conclusions, just\nas his liberalism was distinctly pluralist. As Michael Walzer has\nremarked, Berlin’s pluralism is characterised by\n‘receptivity, generosity, and scepticism’, which are,\n‘if not liberal values, then qualities of mind that make it\n[…] likely that liberal values will be accepted’ (Galston\n2002, 60–1; Walzer 1995, 31).\n",
    "section_title": "4.4 Value Pluralism after Berlin: Some Controversies",
    "entry_title": "Isaiah Berlin",
    "hierarchy_title": "Isaiah Berlin || Ethical Thought and Value Pluralism || Value Pluralism after Berlin: Some Controversies",
    "tokenized_text": [
        "ethical",
        "thought",
        "value",
        "pluralism",
        "value",
        "pluralism",
        "berlin",
        "controversy",
        "value",
        "pluralism",
        "berlin",
        "controversy",
        "since",
        "s",
        "pluralism",
        "become",
        "widely",
        "hotly",
        "debated",
        "berlin",
        "idea",
        "due",
        "part",
        "berlin",
        "work",
        "part",
        "later",
        "philosopher",
        "follower",
        "ally",
        "berlin",
        "independently",
        "also",
        "articulated",
        "advanced",
        "value",
        "pluralism",
        "similar",
        "position",
        "although",
        "pluralism",
        "achieved",
        "current",
        "prominence",
        "interpretation",
        "berlin",
        "work",
        "later",
        "life",
        "identified",
        "earlier",
        "key",
        "component",
        "thought",
        "prescient",
        "reader",
        "two",
        "reader",
        "advanced",
        "remains",
        "one",
        "common",
        "criticism",
        "berlin",
        "pluralism",
        "indistinguishable",
        "relativism",
        "strauss",
        "momigliano",
        "see",
        "maccallum",
        "a",
        "kocis",
        "early",
        "critique",
        "one",
        "problem",
        "bedevilled",
        "debate",
        "persistent",
        "failure",
        "define",
        "term",
        "issue",
        "adequate",
        "clarity",
        "precision",
        "pluralism",
        "course",
        "subject",
        "repeated",
        "definition",
        "berlin",
        "others",
        "repetition",
        "always",
        "serving",
        "clarifying",
        "purpose",
        "however",
        "term",
        "relativism",
        "often",
        "remains",
        "underanalysed",
        "discussion",
        "whether",
        "pluralism",
        "distinguished",
        "relativism",
        "depends",
        "largely",
        "relativism",
        "defined",
        "well",
        "certain",
        "obscure",
        "controversial",
        "component",
        "pluralism",
        "treated",
        "also",
        "noted",
        "question",
        "whether",
        "value",
        "plural",
        "logically",
        "distinct",
        "question",
        "whether",
        "objective",
        "despite",
        "frequent",
        "elision",
        "two",
        "topic",
        "literature",
        "subject",
        "one",
        "way",
        "defining",
        "relativism",
        "form",
        "subjectivism",
        "moral",
        "irrationalism",
        "berlin",
        "defined",
        "attempt",
        "refute",
        "charge",
        "relativism",
        "brought",
        "pluralism",
        "berlin",
        "model",
        "relativist",
        "statement",
        "like",
        "coffee",
        "white",
        "like",
        "black",
        "simply",
        "way",
        "nothing",
        "choose",
        "u",
        "understand",
        "prefer",
        "black",
        "coffee",
        "understand",
        "prefer",
        "white",
        "agree",
        "applied",
        "ethic",
        "relativist",
        "attitude",
        "might",
        "lead",
        "holder",
        "say",
        "like",
        "human",
        "sacrifice",
        "taste",
        "tradition",
        "simply",
        "differ",
        "pluralism",
        "hand",
        "berlin",
        "defines",
        "hold",
        "understanding",
        "moral",
        "view",
        "possible",
        "among",
        "people",
        "unless",
        "alienated",
        "normal",
        "human",
        "sentiment",
        "belief",
        "considered",
        "really",
        "deranged",
        "relativism",
        "berlin",
        "definition",
        "would",
        "make",
        "moral",
        "understanding",
        "impossible",
        "pluralism",
        "explains",
        "possibility",
        "acceptance",
        "pluralism",
        "may",
        "facilitate",
        "moral",
        "communication",
        "another",
        "related",
        "way",
        "differentiating",
        "pluralism",
        "relativism",
        "employed",
        "berlin",
        "others",
        "hold",
        "pluralism",
        "accepts",
        "basic",
        "core",
        "human",
        "value",
        "value",
        "adopted",
        "alongside",
        "particular",
        "context",
        "fall",
        "within",
        "common",
        "human",
        "horizon",
        "though",
        "berlin",
        "usage",
        "entirely",
        "consistent",
        "horizon",
        "best",
        "thought",
        "boundary",
        "enclosing",
        "form",
        "human",
        "conduct",
        "comprehensible",
        "human",
        "being",
        "virtue",
        "shared",
        "humanity",
        "whether",
        "conduct",
        "deemed",
        "acceptable",
        "action",
        "may",
        "comprehensible",
        "unacceptable",
        "one",
        "reason",
        "including",
        "mistaken",
        "empirical",
        "belief",
        "jointly",
        "separately",
        "known",
        "religious",
        "terminology",
        "original",
        "sin",
        "innate",
        "human",
        "propensity",
        "behave",
        "immorally",
        "beyond",
        "horizon",
        "lie",
        "behaviour",
        "make",
        "sense",
        "therefore",
        "regard",
        "insane",
        "irrational",
        "worship",
        "wood",
        "simply",
        "wood",
        "sticking",
        "pin",
        "flesh",
        "living",
        "people",
        "pleasurable",
        "pierce",
        "resilient",
        "surface",
        "without",
        "regard",
        "even",
        "enjoyment",
        "pain",
        "cause",
        "core",
        "shared",
        "universal",
        "value",
        "account",
        "agreement",
        "least",
        "moral",
        "issue",
        "example",
        "immorality",
        "slavery",
        "ritual",
        "murder",
        "nazi",
        "gas",
        "chamber",
        "view",
        "rest",
        "belief",
        "basic",
        "minimum",
        "universal",
        "human",
        "nature",
        "beneath",
        "widely",
        "diverse",
        "form",
        "human",
        "life",
        "belief",
        "taken",
        "across",
        "time",
        "place",
        "may",
        "also",
        "involve",
        "belief",
        "existence",
        "specifically",
        "moral",
        "sense",
        "inherent",
        "human",
        "being",
        "berlin",
        "seems",
        "believed",
        "faculty",
        "refers",
        "name",
        "linked",
        "empathy",
        "develop",
        "view",
        "writing",
        "yet",
        "another",
        "way",
        "defining",
        "relativism",
        "view",
        "holding",
        "thing",
        "value",
        "relative",
        "particular",
        "situation",
        "outlook",
        "nothing",
        "intrinsically",
        "good",
        "valuable",
        "slightly",
        "different",
        "way",
        "putting",
        "would",
        "maintain",
        "thing",
        "value",
        "always",
        "valid",
        "value",
        "valid",
        "different",
        "degree",
        "different",
        "circumstance",
        "others",
        "instance",
        "liberty",
        "may",
        "leading",
        "value",
        "one",
        "place",
        "one",
        "time",
        "much",
        "lower",
        "status",
        "value",
        "another",
        "berlin",
        "pluralism",
        "seems",
        "opposed",
        "relativism",
        "since",
        "committed",
        "belief",
        "human",
        "being",
        "least",
        "value",
        "intrinsically",
        "rather",
        "instrumentally",
        "good",
        "least",
        "value",
        "universally",
        "valid",
        "even",
        "others",
        "even",
        "universal",
        "validity",
        "recognised",
        "berlin",
        "admitted",
        "liberty",
        "instance",
        "historically",
        "upheld",
        "preeminent",
        "ideal",
        "minority",
        "human",
        "being",
        "yet",
        "still",
        "held",
        "genuine",
        "value",
        "human",
        "being",
        "everywhere",
        "way",
        "human",
        "being",
        "constituted",
        "far",
        "know",
        "continue",
        "constituted",
        "similarly",
        "steven",
        "luke",
        "suggested",
        "relativism",
        "seek",
        "avoid",
        "dismiss",
        "moral",
        "conflict",
        "explain",
        "away",
        "holding",
        "different",
        "value",
        "hold",
        "different",
        "people",
        "liberalism",
        "liberal",
        "cannibalism",
        "cannibal",
        "luke",
        "b",
        "cf",
        "hollis",
        "denying",
        "competing",
        "value",
        "may",
        "often",
        "binding",
        "people",
        "pluralism",
        "hand",
        "see",
        "conflict",
        "value",
        "occurring",
        "within",
        "across",
        "culture",
        "least",
        "luke",
        "formulation",
        "maintains",
        "custom",
        "relatively",
        "valid",
        "beliefsystems",
        "way",
        "life",
        "appealed",
        "way",
        "overcoming",
        "valueconflict",
        "luke",
        "position",
        "berlin",
        "explicitly",
        "advance",
        "later",
        "writing",
        "suggest",
        "sympathy",
        "berlin",
        "position",
        "seems",
        "lie",
        "somewhere",
        "version",
        "relativism",
        "luke",
        "proposal",
        "acknowledged",
        "culture",
        "monolithic",
        "morally",
        "rational",
        "conflict",
        "value",
        "endemic",
        "within",
        "culture",
        "denies",
        "cultural",
        "tradition",
        "norm",
        "invoked",
        "dissipate",
        "authoritatively",
        "resolve",
        "conflict",
        "value",
        "michael",
        "oakeshott",
        "suggested",
        "appealed",
        "intimation",
        "tradition",
        "way",
        "resolving",
        "apparent",
        "conflict",
        "generated",
        "attempt",
        "rational",
        "action",
        "see",
        "oakeshott",
        "oakeshott",
        "berlin",
        "hold",
        "empirical",
        "matter",
        "individual",
        "make",
        "decision",
        "balance",
        "reconcile",
        "choose",
        "competing",
        "value",
        "light",
        "existing",
        "general",
        "commitment",
        "vision",
        "life",
        "shaped",
        "though",
        "completely",
        "determined",
        "cultural",
        "tradition",
        "context",
        "liberty",
        "may",
        "genuine",
        "important",
        "good",
        "human",
        "being",
        "general",
        "human",
        "being",
        "decide",
        "promote",
        "actualise",
        "liberty",
        "relation",
        "whole",
        "web",
        "value",
        "differ",
        "different",
        "society",
        "yet",
        "charge",
        "pluralism",
        "equivalent",
        "relativism",
        "easily",
        "refuted",
        "given",
        "certain",
        "ambiguity",
        "berlin",
        "account",
        "centre",
        "nature",
        "origin",
        "value",
        "related",
        "question",
        "role",
        "cultural",
        "norm",
        "meaning",
        "incommensurability",
        "stated",
        "berlin",
        "held",
        "value",
        "human",
        "creation",
        "objective",
        "foundation",
        "latter",
        "claim",
        "unclear",
        "berlin",
        "work",
        "claim",
        "value",
        "objective",
        "founded",
        "expression",
        "limited",
        "certain",
        "reality",
        "human",
        "nature",
        "would",
        "seem",
        "provide",
        "defence",
        "relativism",
        "holding",
        "underlying",
        "shared",
        "human",
        "nature",
        "make",
        "least",
        "value",
        "nonrelative",
        "argument",
        "value",
        "objective",
        "simply",
        "pursued",
        "human",
        "being",
        "may",
        "seem",
        "allow",
        "relativism",
        "make",
        "validity",
        "value",
        "dependent",
        "nothing",
        "human",
        "preference",
        "allows",
        "value",
        "actually",
        "pursued",
        "human",
        "being",
        "therefore",
        "practice",
        "adopted",
        "pursuing",
        "value",
        "claim",
        "validity",
        "reductio",
        "ad",
        "absurdum",
        "deflected",
        "adding",
        "two",
        "consideration",
        "widespread",
        "aspirant",
        "universal",
        "value",
        "whether",
        "justified",
        "term",
        "rationally",
        "defensible",
        "conception",
        "human",
        "welfare",
        "one",
        "knottiest",
        "dimension",
        "berlin",
        "pluralism",
        "idea",
        "incommensurability",
        "led",
        "diverging",
        "interpretation",
        "one",
        "make",
        "threeway",
        "distinction",
        "weak",
        "incommensurability",
        "moderate",
        "incommensurability",
        "radical",
        "incommensurability",
        "weak",
        "incommensurability",
        "view",
        "value",
        "ranked",
        "quantitatively",
        "arranged",
        "qualitative",
        "hierarchy",
        "applies",
        "consistently",
        "case",
        "berlin",
        "go",
        "clear",
        "whether",
        "present",
        "moderate",
        "radical",
        "version",
        "incommensurability",
        "former",
        "hold",
        "single",
        "ultimate",
        "scale",
        "principle",
        "measure",
        "value",
        "moral",
        "sliderule",
        "b",
        "universal",
        "unit",
        "normative",
        "measurement",
        "view",
        "certainly",
        "consistent",
        "berlin",
        "wrote",
        "s",
        "onwards",
        "view",
        "necessarily",
        "rule",
        "making",
        "judgement",
        "value",
        "casebycase",
        "basis",
        "value",
        "compared",
        "ranked",
        "term",
        "one",
        "mastervalue",
        "formula",
        "conclude",
        "impossible",
        "compare",
        "deliberate",
        "indeed",
        "actual",
        "case",
        "berlin",
        "sometimes",
        "offer",
        "starkly",
        "dramatic",
        "account",
        "incommensurability",
        "make",
        "hard",
        "rule",
        "radical",
        "interpretation",
        "concept",
        "according",
        "incommensurability",
        "le",
        "synonymous",
        "incomparability",
        "interpretation",
        "state",
        "value",
        "compared",
        "since",
        "common",
        "currency",
        "term",
        "compare",
        "value",
        "sui",
        "generis",
        "judged",
        "relation",
        "value",
        "nothing",
        "relation",
        "judged",
        "measured",
        "result",
        "choice",
        "among",
        "value",
        "based",
        "objectively",
        "valid",
        "evaluative",
        "comparison",
        "personal",
        "preference",
        "act",
        "radical",
        "arbitrary",
        "choice",
        "berlin",
        "sometimes",
        "call",
        "plumping",
        "plumping",
        "need",
        "disembodied",
        "inexplicable",
        "act",
        "draw",
        "albeit",
        "subconsciously",
        "hinterland",
        "moral",
        "understanding",
        "rooted",
        "moral",
        "experience",
        "plumper",
        "cultural",
        "tradition",
        "related",
        "question",
        "concern",
        "role",
        "reason",
        "moral",
        "deliberation",
        "value",
        "incommensurable",
        "must",
        "choice",
        "conflicting",
        "value",
        "ultimately",
        "subjective",
        "irrational",
        "pluralism",
        "differ",
        "radical",
        "relativism",
        "subjectivism",
        "exactly",
        "moral",
        "reasoning",
        "work",
        "rationally",
        "make",
        "choice",
        "value",
        "system",
        "unit",
        "measurement",
        "used",
        "making",
        "deliberation",
        "one",
        "possible",
        "answer",
        "last",
        "question",
        "offer",
        "account",
        "practical",
        "situational",
        "reasoning",
        "quantitative",
        "rulebased",
        "appeal",
        "moral",
        "sense",
        "mentioned",
        "berlin",
        "suggests",
        "offer",
        "systematic",
        "explanation",
        "nature",
        "nonsystematic",
        "reason",
        "incommensurability",
        "see",
        "chang",
        "crowder",
        "area",
        "political",
        "philosophy",
        "widespread",
        "controversy",
        "pluralism",
        "concern",
        "relationship",
        "liberalism",
        "debate",
        "overlap",
        "regarding",
        "pluralism",
        "relationship",
        "relativism",
        "extent",
        "liberalism",
        "regarded",
        "resting",
        "belief",
        "certain",
        "universal",
        "value",
        "fundamental",
        "human",
        "right",
        "belief",
        "relativism",
        "undermines",
        "however",
        "maintain",
        "pluralism",
        "distinct",
        "preferable",
        "relativism",
        "nevertheless",
        "radical",
        "contested",
        "subversive",
        "depended",
        "justification",
        "liberalism",
        "conversely",
        "liberalism",
        "universalistic",
        "absolutist",
        "linked",
        "pluralism",
        "main",
        "proponent",
        "view",
        "responsible",
        "thinker",
        "emergence",
        "wide",
        "discussion",
        "issue",
        "john",
        "gray",
        "see",
        "especially",
        "gray",
        "gray",
        "asserts",
        "pluralism",
        "true",
        "pluralism",
        "undermines",
        "liberalism",
        "therefore",
        "liberalism",
        "abandoned",
        "least",
        "traditional",
        "role",
        "political",
        "philosophy",
        "claiming",
        "universal",
        "status",
        "gray",
        "case",
        "spawned",
        "vast",
        "literature",
        "concerning",
        "berlin",
        "treatment",
        "relationship",
        "pluralism",
        "liberalism",
        "particular",
        "issue",
        "general",
        "theorist",
        "agreed",
        "gray",
        "kekes",
        "others",
        "sought",
        "show",
        "pluralism",
        "liberalism",
        "reconcilable",
        "although",
        "reconciliation",
        "may",
        "require",
        "modification",
        "liberalism",
        "pluralism",
        "modification",
        "however",
        "justifiable",
        "indeed",
        "inherently",
        "desirable",
        "extensive",
        "discussion",
        "date",
        "george",
        "crowder",
        "william",
        "galston",
        "crowder",
        "galston",
        "berlin",
        "devoted",
        "pluralism",
        "liberalism",
        "saw",
        "related",
        "logical",
        "entailment",
        "though",
        "sometimes",
        "come",
        "close",
        "positing",
        "eg",
        "b",
        "jahanbegloo",
        "interconnected",
        "harmonious",
        "version",
        "pluralism",
        "advanced",
        "distinctly",
        "liberal",
        "assumption",
        "aim",
        "conclusion",
        "liberalism",
        "distinctly",
        "pluralist",
        "michael",
        "walzer",
        "remarked",
        "berlin",
        "pluralism",
        "characterised",
        "receptivity",
        "generosity",
        "scepticism",
        "liberal",
        "value",
        "quality",
        "mind",
        "make",
        "likely",
        "liberal",
        "value",
        "accepted",
        "galston",
        "walzer"
    ]
}