{
    "main_text": "Later Work on Variety, Its Value, and the Question of Normativity || What do we mean by “variety” or “diversity” and how do we measure it?\n2.3 What do we mean by “variety” or “diversity” and how do we measure it?\n\nDuring the pre-history of “biodiversity”, the species\nextinction crisis provided motivation to consider the value of living\nvariation, covering not only species richness but also genetic\nvariation and the variety of ecosystems. The new term\n“biodiversity” introduced fresh considerations,\nparticularly reflecting ecology and ecosystems perspectives. The CBD\ndefinition of “biodiversity” used two terms,\n“variability” and “diversity”, that have\ninvited multiple interpretations:\n\n\n… the variability among living organisms from all sources\nincluding, inter alia, terrestrial, marine and other aquatic\necosystems and the ecological complexes of which they are part; this\nincludes diversity within species, between species and of\necosystems.\n\n\nThe definition of “biodiversity” in the IPBES Glossary\n(see the link in\n Other Internet Resources)\n partly follows that of the CBD:\n\n\nThe variability among living organisms from all sources including\nterrestrial, marine and other aquatic ecosystems and the ecological\ncomplexes of which they are a part. This includes variation in\ngenetic, phenotypic, phylogenetic, and functional attributes, as well\nas changes in abundance and distribution over time and space within\nand among species, biological communities and ecosystems.\n\n\nThe vague open-ended term “diversity”, in the CBD\ndefinition, can be interpreted as any of a number of ecological\ndiversity indices (see below). In contrast, IPBES reflects pre-history\nin shifting to the word, “variation”. Naturally, this word\nhas provided its own interpretation challenges, including how to\ncharacterise it consistently across different levels of variation.\nWeitzman (1992) presented an influential general framework for\nbiodiversity as variation, based on the idea of objects, and measures\nof difference between objects. Biodiversity (amount of variation) then\ndepends not only on the number of objects, but also the degree of\ndifferences among them. In the book Philosophy and\nBiodiversity, the link between “biodiversity” and\ninvestment and insurance value is described as depending on:\n“The higher the number and the degree of difference between\nbiological elements” (Koricheva & Siipi 2004: 39). Weikard\n(2002) argued that any operational concept of biodiversity must have\nsome measure of difference between objects (see also Maclaurin &\nSterelny 2008; Morgan 2009).\n\nThis strategy assumes that we can define meaningful differences among\nthe initial objects, and also sort out the trade-off between having\nmore objects versus bigger differences. One difficulty is that there\nare many ways to define “differences”. Morgan (2009)\nconcluded that, even if one has some agreed natural measure of\ndifferences, we do not know how to trade off more objects for less\ndifferences (or vice versa) to assess biodiversity.\n\nAn alternative general framework, proposed by Faith (1994), avoids\nweaknesses of the objects-differences strategy. The framework\nside-steps the idea of differences and instead uses the inferred\nrelative number of biodiversity “units” among any given\nset of “objects”. If “biodiversity” is\nvariation or variety in the sense of units (such as species) that we\nideally count-up, then what are those units or elements that make-up\nbiodiversity? The units of interest logically cover more than just the\nspecies level (and even the core idea of “species” may\nconsider alternative classifications, such as those in folk cultures;\nOksanen 2004). Maclaurin and Sterelny’s argument (2008:\n154) that option value “links variation and value”\nconsidered option value for units across all levels of\nbiodiversity.\n\nA common assessment of biodiversity-as-variety evaluates a set of\nprotected areas and asks “how many different species are\nrepresented by that set of areas?” In the general framework,\nthis converts to a more general biodiversity question: “how many\ndifferent units are represented by that set of objects?” Thus,\n“species” corresponds to just one kind of\n“unit” of variation (with different species as different\n“units”), and areas are just one kind of\n“objects”. Biodiversity assessment considers a wide range\nof these possible objects for decision-making—not just areas,\nbut also species, populations, and other entities. Biodiversity\ntherefore can be quantified in general as a count of the number of\ndifferent units represented by a given set of objects. Examples of\nother objects/units combinations include species/traits (or features)\nand species’ populations/genetic variants.\n\nA strength of the framework is that it addresses the fact that many of\nthe “units” are unknown, and so, cannot simply be\ncounted-up. Many species are still unknown to science; many features\nof species are undescribed. We may directly observe some objects (say,\nspecies) and want to quantify the relative number of un-observed units\n(say, features) that are represented by those objects. The relative\nnumber of units for any object or set of objects therefore has to be\nestimated through the use of an inferential model or a surrogate of\nsome kind.\n\nA model that successfully reflects the underlying processes that\ndetermine the distribution of units among objects (a\npattern—process model) may tell us enough about the\nrelationships among the objects to enable inference of relative\nnumbers of units represented by any set of those objects. This is the\nrationale for a general framework for using pattern to quantify\ndiversity at a level below that of the original objects.\n\nThus, relationships among different objects ) informs us about what is\nof interest: the amount of biodiversity, expressed as the number of\nunits represented by those objects. This “counting-up” of\nthe lower-level units means that we can compare different sets of\nobjects by the count of the number of different units represented, and\nlook at useful information such as gains and losses as the set\nchanges.\n\nSuppose, for example, that the units of interest are features of\nspecies (a feature might be some morphological characteristic). These\nfeatures in general have unknown future benefits; feature diversity\nprovides another example of biodiversity option value. If we apply the\nrationale that all these features should be treated as units of equal\nvalue, then some species (those that are phylogenetically distinctive;\nsee below) will make larger contributions to the overall feature\ndiversity represented by a set of species. Thus, equal value at the\nfine scale among features leads to differential values at the coarse\nscale among species.\n\nFeature diversity raises measurement challenges. Not only do we not\nknow, in general, the future value of different features, but also we\ncannot even list the features for most species. Phylogenetic pattern\nprovides one way to estimate and quantify variation at the feature\nlevel. The predicted total feature diversity of a set of species is\nreferred to as its “phylogenetic diversity” (PD). The\namount of PD, and the estimated relative feature diversity, of a set\nof species is calculated as the minimum total length of all the\nphylogenetic branches required to connect all the species in that set\non the phylogenetic tree (Faith 1992). This definition follows from an\nevolutionary model in which branch lengths reflect evolutionary\nchanges (new features), and shared ancestry accounts for shared\nfeatures among species. Note that a set of three species may have\nlower PD (lower feature diversity) than a set of two species (see\nfigure below).\n\nThe phylogenetic diversity measure illustrates how the\npattern—process framework differs from the objects and\ndifferences approach. For PD, the objects are species (or other taxa)\nand the units that we would like to count-up are features (or\ncharacters). The use of phylogeny (the “tree of life”) to\nmake inferences about the relative feature diversity of different sets\nof species is a way to overcome our lack of knowledge about all the\nfeatures of different species. Maclaurin and Sterelny (2008: 20)\nincorrectly interpreted PD as an application of the objects and\ndifferences approach, with species as objects and differences given by\n“genealogical depth”. Instead, a pattern (phylogeny) among\nthe species is used. This pattern allows inferences about the\nbiodiversity units of interest—here, features or characters of\nspecies.\n\n\n\n\n\n(a)\n\n\n\n\n(b)\n\n\n\nFigure. A general biodiversity model\nlinking relationships among objects to measures of biodiversity based\non the indirect counting-up of units. In each case, relationships\namong the three objects represented by solid dots provides information\nabout their representation, as a set, of underlying units. The ovals\nhighlight the idea that their degree of similarity within the pattern\nindicates degree of shared units.\n\n\n\nfor phylogenetic diversity, the objects are species, the units are\nevolutionary features and the phylogenetic/feature diversity of the 3\n(solid dots) species is indicated by the summed lengths of the blue\nbranches on the phylogenetic tree. Note that this set of 3 species has\ngreater phylogenetic diversity / feature diversity than the set of two\nhollow-dot species (red branches). [An\n extended description of figure (a)\n is in the supplement.] \n\n\nanother kind of pattern for species-as-objects is a Euclidean space\nrepresenting key environmental gradients. The inferred biodiversity\nmay be functional trait diversity. [An\n extended description of figure (b)\n is in the supplement.] \n\n\n\nSarkar’s (2014: 3) consideration of “units” other\nthan species appears compatible with the general pattern–process\nframework. However, Sarkar’s proposal differs in integrating\nother additional calculations into the quantification of biodiversity.\nFor example, Sarkar proposed that biodiversity must include a number\nof aspects beyond richness. At the species-level, Sarkar (2014: 3)\nargued that a measure of biodiversity should reflect complementarity,\nrarity, endemism and also “equitability” (reflecting\nrelative abundances). Another aspect to be included was\n“disparity” reflecting taxonomic distance between species.\nSarkar’s consideration of a taxonomic measure of difference\nbetween species as part of “biodiversity” echoes the\npopular objects and differences strategy.\n\nPossible proposals to include aspects beyond richness (counting units)\nseem limitless. This problem highlights the advantages of a simpler\nframework where “biodiversity” focuses on the number of\nunits, while recognising that the same units can be part of numerous\nother calculations that include standard ecological indices. Thus,\ncomplementarity, endemism, and dissimilarities and many traditional\necological “diversity” measures all can be calculated, but\nthey are not measures of “biodiversity”.\n",
    "section_title": "2.3 What do we mean by “variety” or “diversity” and how do we measure it?",
    "entry_title": "Biodiversity",
    "hierarchy_title": "Biodiversity || Later Work on Variety, Its Value, and the Question of Normativity || What do we mean by “variety” or “diversity” and how do we measure it?",
    "tokenized_text": [
        "later",
        "work",
        "variety",
        "value",
        "question",
        "normativity",
        "mean",
        "variety",
        "diversity",
        "measure",
        "mean",
        "variety",
        "diversity",
        "measure",
        "prehistory",
        "biodiversity",
        "specie",
        "extinction",
        "crisis",
        "provided",
        "motivation",
        "consider",
        "value",
        "living",
        "variation",
        "covering",
        "specie",
        "richness",
        "also",
        "genetic",
        "variation",
        "variety",
        "ecosystem",
        "new",
        "term",
        "biodiversity",
        "introduced",
        "fresh",
        "consideration",
        "particularly",
        "reflecting",
        "ecology",
        "ecosystem",
        "perspective",
        "cbd",
        "definition",
        "biodiversity",
        "used",
        "two",
        "term",
        "variability",
        "diversity",
        "invited",
        "multiple",
        "interpretation",
        "variability",
        "among",
        "living",
        "organism",
        "source",
        "including",
        "inter",
        "alia",
        "terrestrial",
        "marine",
        "aquatic",
        "ecosystem",
        "ecological",
        "complex",
        "part",
        "includes",
        "diversity",
        "within",
        "specie",
        "specie",
        "ecosystem",
        "definition",
        "biodiversity",
        "ipbes",
        "glossary",
        "see",
        "link",
        "internet",
        "resource",
        "partly",
        "follows",
        "cbd",
        "variability",
        "among",
        "living",
        "organism",
        "source",
        "including",
        "terrestrial",
        "marine",
        "aquatic",
        "ecosystem",
        "ecological",
        "complex",
        "part",
        "includes",
        "variation",
        "genetic",
        "phenotypic",
        "phylogenetic",
        "functional",
        "attribute",
        "well",
        "change",
        "abundance",
        "distribution",
        "time",
        "space",
        "within",
        "among",
        "specie",
        "biological",
        "community",
        "ecosystem",
        "vague",
        "openended",
        "term",
        "diversity",
        "cbd",
        "definition",
        "interpreted",
        "number",
        "ecological",
        "diversity",
        "index",
        "see",
        "contrast",
        "ipbes",
        "reflects",
        "prehistory",
        "shifting",
        "word",
        "variation",
        "naturally",
        "word",
        "provided",
        "interpretation",
        "challenge",
        "including",
        "characterise",
        "consistently",
        "across",
        "different",
        "level",
        "variation",
        "weitzman",
        "presented",
        "influential",
        "general",
        "framework",
        "biodiversity",
        "variation",
        "based",
        "idea",
        "object",
        "measure",
        "difference",
        "object",
        "biodiversity",
        "amount",
        "variation",
        "depends",
        "number",
        "object",
        "also",
        "degree",
        "difference",
        "among",
        "book",
        "philosophy",
        "biodiversity",
        "link",
        "biodiversity",
        "investment",
        "insurance",
        "value",
        "described",
        "depending",
        "higher",
        "number",
        "degree",
        "difference",
        "biological",
        "element",
        "koricheva",
        "siipi",
        "weikard",
        "argued",
        "operational",
        "concept",
        "biodiversity",
        "must",
        "measure",
        "difference",
        "object",
        "see",
        "also",
        "maclaurin",
        "sterelny",
        "morgan",
        "strategy",
        "assumes",
        "define",
        "meaningful",
        "difference",
        "among",
        "initial",
        "object",
        "also",
        "sort",
        "tradeoff",
        "object",
        "versus",
        "bigger",
        "difference",
        "one",
        "difficulty",
        "many",
        "way",
        "define",
        "difference",
        "morgan",
        "concluded",
        "even",
        "one",
        "agreed",
        "natural",
        "measure",
        "difference",
        "know",
        "trade",
        "object",
        "le",
        "difference",
        "vice",
        "versa",
        "ass",
        "biodiversity",
        "alternative",
        "general",
        "framework",
        "proposed",
        "faith",
        "avoids",
        "weakness",
        "objectsdifferences",
        "strategy",
        "framework",
        "sidesteps",
        "idea",
        "difference",
        "instead",
        "us",
        "inferred",
        "relative",
        "number",
        "biodiversity",
        "unit",
        "among",
        "given",
        "set",
        "object",
        "biodiversity",
        "variation",
        "variety",
        "sense",
        "unit",
        "specie",
        "ideally",
        "countup",
        "unit",
        "element",
        "makeup",
        "biodiversity",
        "unit",
        "interest",
        "logically",
        "cover",
        "specie",
        "level",
        "even",
        "core",
        "idea",
        "specie",
        "may",
        "consider",
        "alternative",
        "classification",
        "folk",
        "culture",
        "oksanen",
        "maclaurin",
        "sterelny",
        "argument",
        "option",
        "value",
        "link",
        "variation",
        "value",
        "considered",
        "option",
        "value",
        "unit",
        "across",
        "level",
        "biodiversity",
        "common",
        "assessment",
        "biodiversityasvariety",
        "evaluates",
        "set",
        "protected",
        "area",
        "asks",
        "many",
        "different",
        "specie",
        "represented",
        "set",
        "area",
        "general",
        "framework",
        "convert",
        "general",
        "biodiversity",
        "question",
        "many",
        "different",
        "unit",
        "represented",
        "set",
        "object",
        "thus",
        "specie",
        "corresponds",
        "one",
        "kind",
        "unit",
        "variation",
        "different",
        "specie",
        "different",
        "unit",
        "area",
        "one",
        "kind",
        "object",
        "biodiversity",
        "assessment",
        "considers",
        "wide",
        "range",
        "possible",
        "object",
        "decisionmakingnot",
        "area",
        "also",
        "specie",
        "population",
        "entity",
        "biodiversity",
        "therefore",
        "quantified",
        "general",
        "count",
        "number",
        "different",
        "unit",
        "represented",
        "given",
        "set",
        "object",
        "example",
        "objectsunits",
        "combination",
        "include",
        "speciestraits",
        "feature",
        "specie",
        "populationsgenetic",
        "variant",
        "strength",
        "framework",
        "address",
        "fact",
        "many",
        "unit",
        "unknown",
        "simply",
        "countedup",
        "many",
        "specie",
        "still",
        "unknown",
        "science",
        "many",
        "feature",
        "specie",
        "undescribed",
        "may",
        "directly",
        "observe",
        "object",
        "say",
        "specie",
        "want",
        "quantify",
        "relative",
        "number",
        "unobserved",
        "unit",
        "say",
        "feature",
        "represented",
        "object",
        "relative",
        "number",
        "unit",
        "object",
        "set",
        "object",
        "therefore",
        "estimated",
        "use",
        "inferential",
        "model",
        "surrogate",
        "kind",
        "model",
        "successfully",
        "reflects",
        "underlying",
        "process",
        "determine",
        "distribution",
        "unit",
        "among",
        "object",
        "patternprocess",
        "model",
        "may",
        "tell",
        "u",
        "enough",
        "relationship",
        "among",
        "object",
        "enable",
        "inference",
        "relative",
        "number",
        "unit",
        "represented",
        "set",
        "object",
        "rationale",
        "general",
        "framework",
        "using",
        "pattern",
        "quantify",
        "diversity",
        "level",
        "original",
        "object",
        "thus",
        "relationship",
        "among",
        "different",
        "object",
        "informs",
        "u",
        "interest",
        "amount",
        "biodiversity",
        "expressed",
        "number",
        "unit",
        "represented",
        "object",
        "countingup",
        "lowerlevel",
        "unit",
        "mean",
        "compare",
        "different",
        "set",
        "object",
        "count",
        "number",
        "different",
        "unit",
        "represented",
        "look",
        "useful",
        "information",
        "gain",
        "loss",
        "set",
        "change",
        "suppose",
        "example",
        "unit",
        "interest",
        "feature",
        "specie",
        "feature",
        "might",
        "morphological",
        "characteristic",
        "feature",
        "general",
        "unknown",
        "future",
        "benefit",
        "feature",
        "diversity",
        "provides",
        "another",
        "example",
        "biodiversity",
        "option",
        "value",
        "apply",
        "rationale",
        "feature",
        "treated",
        "unit",
        "equal",
        "value",
        "specie",
        "phylogenetically",
        "distinctive",
        "see",
        "make",
        "larger",
        "contribution",
        "overall",
        "feature",
        "diversity",
        "represented",
        "set",
        "specie",
        "thus",
        "equal",
        "value",
        "fine",
        "scale",
        "among",
        "feature",
        "lead",
        "differential",
        "value",
        "coarse",
        "scale",
        "among",
        "specie",
        "feature",
        "diversity",
        "raise",
        "measurement",
        "challenge",
        "know",
        "general",
        "future",
        "value",
        "different",
        "feature",
        "also",
        "even",
        "list",
        "feature",
        "specie",
        "phylogenetic",
        "pattern",
        "provides",
        "one",
        "way",
        "estimate",
        "quantify",
        "variation",
        "feature",
        "level",
        "predicted",
        "total",
        "feature",
        "diversity",
        "set",
        "specie",
        "referred",
        "phylogenetic",
        "diversity",
        "pd",
        "amount",
        "pd",
        "estimated",
        "relative",
        "feature",
        "diversity",
        "set",
        "specie",
        "calculated",
        "minimum",
        "total",
        "length",
        "phylogenetic",
        "branch",
        "required",
        "connect",
        "specie",
        "set",
        "phylogenetic",
        "tree",
        "faith",
        "definition",
        "follows",
        "evolutionary",
        "model",
        "branch",
        "length",
        "reflect",
        "evolutionary",
        "change",
        "new",
        "feature",
        "shared",
        "ancestry",
        "account",
        "shared",
        "feature",
        "among",
        "specie",
        "note",
        "set",
        "three",
        "specie",
        "may",
        "lower",
        "pd",
        "lower",
        "feature",
        "diversity",
        "set",
        "two",
        "specie",
        "see",
        "figure",
        "phylogenetic",
        "diversity",
        "measure",
        "illustrates",
        "patternprocess",
        "framework",
        "differs",
        "object",
        "difference",
        "approach",
        "pd",
        "object",
        "specie",
        "taxon",
        "unit",
        "would",
        "like",
        "countup",
        "feature",
        "character",
        "use",
        "phylogeny",
        "tree",
        "life",
        "make",
        "inference",
        "relative",
        "feature",
        "diversity",
        "different",
        "set",
        "specie",
        "way",
        "overcome",
        "lack",
        "knowledge",
        "feature",
        "different",
        "specie",
        "maclaurin",
        "sterelny",
        "incorrectly",
        "interpreted",
        "pd",
        "application",
        "object",
        "difference",
        "approach",
        "specie",
        "object",
        "difference",
        "given",
        "genealogical",
        "depth",
        "instead",
        "pattern",
        "phylogeny",
        "among",
        "specie",
        "used",
        "pattern",
        "allows",
        "inference",
        "biodiversity",
        "unit",
        "interesthere",
        "feature",
        "character",
        "specie",
        "b",
        "figure",
        "general",
        "biodiversity",
        "model",
        "linking",
        "relationship",
        "among",
        "object",
        "measure",
        "biodiversity",
        "based",
        "indirect",
        "countingup",
        "unit",
        "case",
        "relationship",
        "among",
        "three",
        "object",
        "represented",
        "solid",
        "dot",
        "provides",
        "information",
        "representation",
        "set",
        "underlying",
        "unit",
        "oval",
        "highlight",
        "idea",
        "degree",
        "similarity",
        "within",
        "pattern",
        "indicates",
        "degree",
        "shared",
        "unit",
        "phylogenetic",
        "diversity",
        "object",
        "specie",
        "unit",
        "evolutionary",
        "feature",
        "phylogeneticfeature",
        "diversity",
        "solid",
        "dot",
        "specie",
        "indicated",
        "summed",
        "length",
        "blue",
        "branch",
        "phylogenetic",
        "tree",
        "note",
        "set",
        "specie",
        "greater",
        "phylogenetic",
        "diversity",
        "feature",
        "diversity",
        "set",
        "two",
        "hollowdot",
        "specie",
        "red",
        "branch",
        "extended",
        "description",
        "figure",
        "supplement",
        "another",
        "kind",
        "pattern",
        "speciesasobjects",
        "euclidean",
        "space",
        "representing",
        "key",
        "environmental",
        "gradient",
        "inferred",
        "biodiversity",
        "may",
        "functional",
        "trait",
        "diversity",
        "extended",
        "description",
        "figure",
        "b",
        "supplement",
        "sarkar",
        "consideration",
        "unit",
        "specie",
        "appears",
        "compatible",
        "general",
        "patternprocess",
        "framework",
        "however",
        "sarkar",
        "proposal",
        "differs",
        "integrating",
        "additional",
        "calculation",
        "quantification",
        "biodiversity",
        "example",
        "sarkar",
        "proposed",
        "biodiversity",
        "must",
        "include",
        "number",
        "aspect",
        "beyond",
        "richness",
        "specieslevel",
        "sarkar",
        "argued",
        "measure",
        "biodiversity",
        "reflect",
        "complementarity",
        "rarity",
        "endemism",
        "also",
        "equitability",
        "reflecting",
        "relative",
        "abundance",
        "another",
        "aspect",
        "included",
        "disparity",
        "reflecting",
        "taxonomic",
        "distance",
        "specie",
        "sarkar",
        "consideration",
        "taxonomic",
        "measure",
        "difference",
        "specie",
        "part",
        "biodiversity",
        "echo",
        "popular",
        "object",
        "difference",
        "strategy",
        "possible",
        "proposal",
        "include",
        "aspect",
        "beyond",
        "richness",
        "counting",
        "unit",
        "seem",
        "limitless",
        "problem",
        "highlight",
        "advantage",
        "simpler",
        "framework",
        "biodiversity",
        "focus",
        "number",
        "unit",
        "recognising",
        "unit",
        "part",
        "numerous",
        "calculation",
        "include",
        "standard",
        "ecological",
        "index",
        "thus",
        "complementarity",
        "endemism",
        "dissimilarity",
        "many",
        "traditional",
        "ecological",
        "diversity",
        "measure",
        "calculated",
        "measure",
        "biodiversity"
    ]
}