{
    "main_text": "Later Work on Variety, Its Value, and the Question of Normativity || Variety, value and normativity\n2.2 Variety, value and normativity\n\nBiodiversity as variety provides option/investment and insurance\nbenefits to humanity, but this leaves open the question as to the\nnature of the value of such benefits. Haskins (1974) had called for\n“an Ethic of Biotic Diversity”, in which variety’s\nbenefit has ethical import because we care about the well-being of\nfuture generations. Similarly, when IUCN (1980: Section 3) reviewed\nthe arguments for the conservation of biotic diversity, they linked\nthis to moral principles:\n\n\nThe issue of moral principle relates particularly to species\nextinction, and may be stated as follows. Human beings have become a\nmajor evolutionary force. While lacking the knowledge to control the\nbiosphere, we have the power to change it radically. We are morally\nobliged-to our descendants and to other creatures-to act\nprudently… We cannot predict what species may become useful to\nus. Indeed we may learn that many species that seem dispensable are\ncapable of providing important products, such as pharmaceuticals, or\nare vital parts of life-support systems on which we depend. For\nreasons of ethics and self-interest, therefore, we should not\nknowingly cause the extinction of a species.\n\n\nThis early discussion, linking biodiversity’s option value to\nethical/moral obligations to future generations, anticipated the\nrationale for the Convention on Biological Diversity (CBD). Schroeder\nand Pisupati (2010: 9) in “Ethics, Justice, and the Convention\non Biological Diversity”, note that the CBD statements on\nconservation of biodiversity include consideration of\nintergenerational justice:\n\n\nThe first CBD objective, the conservation of biodiversity, is an\nurgent act of attaining intergenerational justice; an act that\nrequires sustained, engaged international collaboration. To deplete\nthe planet of essential resources and leave to future generations a\nworld which severely limits their options, is unjust.\n\n\nIn this context, biodiversity is valued (now) because we care about\nthe welfare of future generations; thus, we see a current benefit, and\na link to justice, in biodiversity’s maintenance of options for\nfuture generations. This is seen as a kind of relational value,\nrelating the present generation to future generations (Faith 2017:\n76):\n\n\nthe best argument for what we call the option value of biodiversity is\nthat we see many currently beneficial units, and maintaining a large\nnumber of units (biodiversity) for the future will help maintain a\nsteady flow of such beneficial units… Biodiversity option value\ntherefore links “variation” and “value”:\nproviding a fundamental relational value of biodiversity reflecting\nour degree of concern about benefits for future generations\n\n\nIntergenerational justice or equity is linked to both\ninvestment/options and insurance (Bartkowski 2017: 53):\n\n\n…the two perspectives—insurance and options—are\ninherently interlinked; however, they depend on different types of\nuncertainty (supply vs. demand), which makes the differentiation\nsensible. The view of biodiversity as carrier of option value stems\nfrom the recognition that a biodiverse ecosystem, which contains many\ndifferent species and genomes, can best accommodate unanticipated\nfuture desires (preferences). As in the case of insurance value, this\ncan be coupled with considerations of intergenerational equity. In\nfact, in the case of option value, this notion is arguably more\ncentral: high levels of biodiversity now mean many different options\nfor our descendants.\n\n\nAn important consideration in recognising an ethical/moral/justice\nimperative to conserve biodiversity is the recognition that\nbiodiversity, as variety, has a current benefit/value because of that\nrelational link between generations. However, other framings omit this\nidea of a current benefit from variety itself. For example, Binder and\nPolasky (2013), in the Encyclopedia of Biodiversity, list\nways that biodiversity links to human well-being.\n\n\nBiodiversity contributes to human well-being directly through\nprovision of foods, fuels, and fibers, and indirectly through its role\nin enhancing ecosystem functions that lead to the provision of\necosystem services.\n\n\nThis might seem to capture biodiversity option value in referring to\nfoods and other goods, but in fact leaves out the idea that society\nsees biodiversity and the prospect for discoveries for future\ngenerations as a current contribution to well-being. The well-being is\nnot just that realised when the new product is discovered.\n\nSuch a restricted interpretation can mean that the maintenance of\noptions provided by biodiversity fails to enter into assessments. For\nexample, Brauman et al. (2020) set out to assess the current global\nstatus of nature’s contributions to people, but explicitly chose\nnot to assess maintenance of options—arguing that this is a\ncontribution to well-being only through its support of the well-being\nobtained from other contributions of nature. In contrast, the IPBES\nglobal assessment (IPBES 2019) did assess global status of maintenance\nof options, noting that, even when considering other specific nature\ncontributions, such as medicinal resources, biodiversity’s\nmaintenance of options is a current benefit in promising possible\nfuture medicinal benefits (see also “Phylogenetic diversity and\nIPBES” in Other Internet Resources).\n\nAbsence of recognition of the current benefit of biodiversity’s\nmaintenance of options has other implications. Maier’s (2018)\narguments that biodiversity option value has no normative standing are\nbased on an assessment of variety as a future, not current, benefit.\nAn alternative argument, supporting normative standing, focuses on\nbiodiversity-as-variety as a current benefit, because this variety is\nrecognised as maintaining options for future generations. This current\nvalue links to normativity—we ought to act to conserve\nbiodiversity and its maintenance of options because it is the right\nthing to do, given that we care about, and have some relational moral\nobligation to future generations (Faith 2018a). These discussions\nhighlight the idea that both “current benefit” and\n“future benefit” are relevant to biodiversity option\nvalue. Biodiversity is a benefit currently because it offers\nunanticipated future benefits, and given the relational sense of\nobligation to future generations is a basis for normativity.\n\nAnother entry in the Encyclopedia of Biodiversity, Chan and\nSatterfield’s (2013) “Justice, Equity and\nBiodiversity”, supports this idea, in linking biodiversity\nconservation to justice for future generations. However,\n“biodiversity” is left undefined, and seen as something\nthat exists within ecosystems that maintains ecosystems services for\nfuture generations. The focus on ecosystem services (where\n“biodiversity” often has ecological interpretations; see\nsection below) means that the value of variety itself is left unstated\nby the authors.\n\nSome perspectives give less emphasis to the idea of variety and its\nbenefit/value, and in these, the arguments for a normative status for\n“biodiversity” appear to be weaker. For example, Koricheva\nand Siipi (2004: 46) see only intrinsic value as a pathway for moral\nobligation to (overall) biodiversity:\n\n\nIf biodiversity is found to be intrinsically valuable, we have strong\nmoral reasons to conserve all aspects of biodiversity, regardless of\ntheir potential utilitarian and instrumental values. If, conversely,\nbiodiversity is found to be only instrumentally valuable, then on\nmoral grounds we can demand conservation only of those parts which\n(directly or indirectly) enhance (or will in the future enhance) the\nwell-being or quality of some other valuable entity or state of\naffairs.\n\n\nGiven this perspective, they conclude that: “conservationists\nare burdened with the need to find or create instrumental values for\neach biodiversity element”. Similarly, in “The Moral Value\nof Biodiversity”, Oksanen (1997) concludes that “It is not\nthe thing ‘biodiversity’ that is of ultimate moral value,\nbut its various constituents”. Thus, this argumentation seems to\nbe disconnected from the idea that, collectively, all of the\n“elements” or “constituents”—the\nvariety—delivers biodiversity option value and justice for\nfuture generations.\n\nSignificantly, the popular instrumental-versus-intrinsic argumentation\nhas sometimes meant a neglect of biodiversity option\n value.[1]\n Commonly, the instrumental value of biodiversity is characterised as\nall about supporting of functions/resilience within ecosystems, not\nglobal option values. Some literature suggests that relational values\nimportantly move beyond the standard instrumental-versus-intrinsic\nframework (e.g., Himes & Muraca 2018). In the context of\nbiodiversity option value, greater appreciation of relational values\nin fact restores a link to biodiversity value that has been obscured\nby the popular instrumental-versus-intrinsic argumentation.\n\nThe link to variety, as compared to individual elements and/or other\necosystem/ecological aspects, is an issue in other discussions. Eser\net al. (2014) acknowledge a normative content for biodiversity, and\nconsider it as arising from the politics at that time (“the\nmaking of the term ‘biodiversity’ indicates that the\nconcept is morally impregnated”, 2014: 38). They argue that\n\n\nthe Convention on Biological Diversity, not only addresses issues of\nconservation, but also sustainable use and fair sharing of benefits.\nThis triad of objectives reflects the three dimensions of sustainable\ndevelopment: ecology, economy and society. (2014: 38)\n\n\nThis equation may imply that the justice/normativity link is to be\ninterpreted as depending on the “fair sharing of\nbenefits”. This fair sharing of benefits often is played out\nlocally, while the conservation of biodiversity is more a global CBD\nissue. Thus, there does not seem to be a tight fit between Eser et\nal.’s historical perspective, tied to the origins of the term\n“biodiversity”, and the deeper historical perspective of\nethical arguments for the conservation of biotic diversity. Indeed,\nEser et al. do not provide any explicit analysis of the benefits and\nvalue of biodiversity-as-variety. Instead, they see the wide range of\nnotions of “biodiversity” as quite useful in providing a\n“boundary” object that can embrace lots of meanings and\nperspectives about value. A similar perspective is found in a proposed\n“weak deflationism” for biodiversity (see below), where\nwhat is regarded as “biodiversity” is the outcome of\n“normative discussion of what merits conservation”.\n\nEser et al.’s arguments nevertheless are compatible with the\nearly ideas, going back to Haskins and others, of a normative reason\nto protect biodiversity-as-variety for future generations.\nSignificantly, Eser et al. (2014: 94) argue that:\n\n\nconsideration of the needs of future generations does not count as\n“nice to have” but is considered a “must”.\nFinding the appropriate balance between obligations to current and\nfuture generations is one of the main challenges of global change\nethics.\n\n\nEser et al. conclude (2014: 95)\n\n\nthe moral belief that our dealing with the needs of future generations\nis a matter of Justice is so widespread that it can almost count as a\ntruism. To substantiate biodiversity strategies with the rights of\nfuture generations therefore is a promising strategy because it meets\nthe intuitions of so many people.\n\n",
    "section_title": "2.2 Variety, value and normativity",
    "entry_title": "Biodiversity",
    "hierarchy_title": "Biodiversity || Later Work on Variety, Its Value, and the Question of Normativity || Variety, value and normativity",
    "tokenized_text": [
        "later",
        "work",
        "variety",
        "value",
        "question",
        "normativity",
        "variety",
        "value",
        "normativity",
        "variety",
        "value",
        "normativity",
        "biodiversity",
        "variety",
        "provides",
        "optioninvestment",
        "insurance",
        "benefit",
        "humanity",
        "leaf",
        "open",
        "question",
        "nature",
        "value",
        "benefit",
        "haskins",
        "called",
        "ethic",
        "biotic",
        "diversity",
        "variety",
        "benefit",
        "ethical",
        "import",
        "care",
        "wellbeing",
        "future",
        "generation",
        "similarly",
        "iucn",
        "section",
        "reviewed",
        "argument",
        "conservation",
        "biotic",
        "diversity",
        "linked",
        "moral",
        "principle",
        "issue",
        "moral",
        "principle",
        "relates",
        "particularly",
        "specie",
        "extinction",
        "may",
        "stated",
        "follows",
        "human",
        "being",
        "become",
        "major",
        "evolutionary",
        "force",
        "lacking",
        "knowledge",
        "control",
        "biosphere",
        "power",
        "change",
        "radically",
        "morally",
        "obligedto",
        "descendant",
        "creaturesto",
        "act",
        "prudently",
        "predict",
        "specie",
        "may",
        "become",
        "useful",
        "u",
        "indeed",
        "may",
        "learn",
        "many",
        "specie",
        "seem",
        "dispensable",
        "capable",
        "providing",
        "important",
        "product",
        "pharmaceutical",
        "vital",
        "part",
        "lifesupport",
        "system",
        "depend",
        "reason",
        "ethic",
        "selfinterest",
        "therefore",
        "knowingly",
        "cause",
        "extinction",
        "specie",
        "early",
        "discussion",
        "linking",
        "biodiversity",
        "option",
        "value",
        "ethicalmoral",
        "obligation",
        "future",
        "generation",
        "anticipated",
        "rationale",
        "convention",
        "biological",
        "diversity",
        "cbd",
        "schroeder",
        "pisupati",
        "ethic",
        "justice",
        "convention",
        "biological",
        "diversity",
        "note",
        "cbd",
        "statement",
        "conservation",
        "biodiversity",
        "include",
        "consideration",
        "intergenerational",
        "justice",
        "first",
        "cbd",
        "objective",
        "conservation",
        "biodiversity",
        "urgent",
        "act",
        "attaining",
        "intergenerational",
        "justice",
        "act",
        "requires",
        "sustained",
        "engaged",
        "international",
        "collaboration",
        "deplete",
        "planet",
        "essential",
        "resource",
        "leave",
        "future",
        "generation",
        "world",
        "severely",
        "limit",
        "option",
        "unjust",
        "context",
        "biodiversity",
        "valued",
        "care",
        "welfare",
        "future",
        "generation",
        "thus",
        "see",
        "current",
        "benefit",
        "link",
        "justice",
        "biodiversity",
        "maintenance",
        "option",
        "future",
        "generation",
        "seen",
        "kind",
        "relational",
        "value",
        "relating",
        "present",
        "generation",
        "future",
        "generation",
        "faith",
        "best",
        "argument",
        "call",
        "option",
        "value",
        "biodiversity",
        "see",
        "many",
        "currently",
        "beneficial",
        "unit",
        "maintaining",
        "large",
        "number",
        "unit",
        "biodiversity",
        "future",
        "help",
        "maintain",
        "steady",
        "flow",
        "beneficial",
        "units",
        "biodiversity",
        "option",
        "value",
        "therefore",
        "link",
        "variation",
        "value",
        "providing",
        "fundamental",
        "relational",
        "value",
        "biodiversity",
        "reflecting",
        "degree",
        "concern",
        "benefit",
        "future",
        "generation",
        "intergenerational",
        "justice",
        "equity",
        "linked",
        "investmentoptions",
        "insurance",
        "bartkowski",
        "the",
        "two",
        "perspectivesinsurance",
        "optionsare",
        "inherently",
        "interlinked",
        "however",
        "depend",
        "different",
        "type",
        "uncertainty",
        "supply",
        "vs",
        "demand",
        "make",
        "differentiation",
        "sensible",
        "view",
        "biodiversity",
        "carrier",
        "option",
        "value",
        "stem",
        "recognition",
        "biodiverse",
        "ecosystem",
        "contains",
        "many",
        "different",
        "specie",
        "genome",
        "best",
        "accommodate",
        "unanticipated",
        "future",
        "desire",
        "preference",
        "case",
        "insurance",
        "value",
        "coupled",
        "consideration",
        "intergenerational",
        "equity",
        "fact",
        "case",
        "option",
        "value",
        "notion",
        "arguably",
        "central",
        "high",
        "level",
        "biodiversity",
        "mean",
        "many",
        "different",
        "option",
        "descendant",
        "important",
        "consideration",
        "recognising",
        "ethicalmoraljustice",
        "imperative",
        "conserve",
        "biodiversity",
        "recognition",
        "biodiversity",
        "variety",
        "current",
        "benefitvalue",
        "relational",
        "link",
        "generation",
        "however",
        "framing",
        "omit",
        "idea",
        "current",
        "benefit",
        "variety",
        "example",
        "binder",
        "polasky",
        "encyclopedia",
        "biodiversity",
        "list",
        "way",
        "biodiversity",
        "link",
        "human",
        "wellbeing",
        "biodiversity",
        "contributes",
        "human",
        "wellbeing",
        "directly",
        "provision",
        "food",
        "fuel",
        "fiber",
        "indirectly",
        "role",
        "enhancing",
        "ecosystem",
        "function",
        "lead",
        "provision",
        "ecosystem",
        "service",
        "might",
        "seem",
        "capture",
        "biodiversity",
        "option",
        "value",
        "referring",
        "food",
        "good",
        "fact",
        "leaf",
        "idea",
        "society",
        "see",
        "biodiversity",
        "prospect",
        "discovery",
        "future",
        "generation",
        "current",
        "contribution",
        "wellbeing",
        "wellbeing",
        "realised",
        "new",
        "product",
        "discovered",
        "restricted",
        "interpretation",
        "mean",
        "maintenance",
        "option",
        "provided",
        "biodiversity",
        "fails",
        "enter",
        "assessment",
        "example",
        "brauman",
        "et",
        "al",
        "set",
        "ass",
        "current",
        "global",
        "status",
        "nature",
        "contribution",
        "people",
        "explicitly",
        "chose",
        "ass",
        "maintenance",
        "optionsarguing",
        "contribution",
        "wellbeing",
        "support",
        "wellbeing",
        "obtained",
        "contribution",
        "nature",
        "contrast",
        "ipbes",
        "global",
        "assessment",
        "ipbes",
        "ass",
        "global",
        "status",
        "maintenance",
        "option",
        "noting",
        "even",
        "considering",
        "specific",
        "nature",
        "contribution",
        "medicinal",
        "resource",
        "biodiversity",
        "maintenance",
        "option",
        "current",
        "benefit",
        "promising",
        "possible",
        "future",
        "medicinal",
        "benefit",
        "see",
        "also",
        "phylogenetic",
        "diversity",
        "ipbes",
        "internet",
        "resource",
        "absence",
        "recognition",
        "current",
        "benefit",
        "biodiversity",
        "maintenance",
        "option",
        "implication",
        "maier",
        "argument",
        "biodiversity",
        "option",
        "value",
        "normative",
        "standing",
        "based",
        "assessment",
        "variety",
        "future",
        "current",
        "benefit",
        "alternative",
        "argument",
        "supporting",
        "normative",
        "standing",
        "focus",
        "biodiversityasvariety",
        "current",
        "benefit",
        "variety",
        "recognised",
        "maintaining",
        "option",
        "future",
        "generation",
        "current",
        "value",
        "link",
        "normativitywe",
        "ought",
        "act",
        "conserve",
        "biodiversity",
        "maintenance",
        "option",
        "right",
        "thing",
        "given",
        "care",
        "relational",
        "moral",
        "obligation",
        "future",
        "generation",
        "faith",
        "a",
        "discussion",
        "highlight",
        "idea",
        "current",
        "benefit",
        "future",
        "benefit",
        "relevant",
        "biodiversity",
        "option",
        "value",
        "biodiversity",
        "benefit",
        "currently",
        "offer",
        "unanticipated",
        "future",
        "benefit",
        "given",
        "relational",
        "sense",
        "obligation",
        "future",
        "generation",
        "basis",
        "normativity",
        "another",
        "entry",
        "encyclopedia",
        "biodiversity",
        "chan",
        "satterfield",
        "justice",
        "equity",
        "biodiversity",
        "support",
        "idea",
        "linking",
        "biodiversity",
        "conservation",
        "justice",
        "future",
        "generation",
        "however",
        "biodiversity",
        "left",
        "undefined",
        "seen",
        "something",
        "exists",
        "within",
        "ecosystem",
        "maintains",
        "ecosystem",
        "service",
        "future",
        "generation",
        "focus",
        "ecosystem",
        "service",
        "biodiversity",
        "often",
        "ecological",
        "interpretation",
        "see",
        "section",
        "mean",
        "value",
        "variety",
        "left",
        "unstated",
        "author",
        "perspective",
        "give",
        "le",
        "emphasis",
        "idea",
        "variety",
        "benefitvalue",
        "argument",
        "normative",
        "status",
        "biodiversity",
        "appear",
        "weaker",
        "example",
        "koricheva",
        "siipi",
        "see",
        "intrinsic",
        "value",
        "pathway",
        "moral",
        "obligation",
        "overall",
        "biodiversity",
        "biodiversity",
        "found",
        "intrinsically",
        "valuable",
        "strong",
        "moral",
        "reason",
        "conserve",
        "aspect",
        "biodiversity",
        "regardless",
        "potential",
        "utilitarian",
        "instrumental",
        "value",
        "conversely",
        "biodiversity",
        "found",
        "instrumentally",
        "valuable",
        "moral",
        "ground",
        "demand",
        "conservation",
        "part",
        "directly",
        "indirectly",
        "enhance",
        "future",
        "enhance",
        "wellbeing",
        "quality",
        "valuable",
        "entity",
        "state",
        "affair",
        "given",
        "perspective",
        "conclude",
        "conservationist",
        "burdened",
        "need",
        "find",
        "create",
        "instrumental",
        "value",
        "biodiversity",
        "element",
        "similarly",
        "moral",
        "value",
        "biodiversity",
        "oksanen",
        "concludes",
        "thing",
        "biodiversity",
        "ultimate",
        "moral",
        "value",
        "various",
        "constituent",
        "thus",
        "argumentation",
        "seems",
        "disconnected",
        "idea",
        "collectively",
        "element",
        "constituent",
        "the",
        "varietydelivers",
        "biodiversity",
        "option",
        "value",
        "justice",
        "future",
        "generation",
        "significantly",
        "popular",
        "instrumentalversusintrinsic",
        "argumentation",
        "sometimes",
        "meant",
        "neglect",
        "biodiversity",
        "option",
        "value",
        "commonly",
        "instrumental",
        "value",
        "biodiversity",
        "characterised",
        "supporting",
        "functionsresilience",
        "within",
        "ecosystem",
        "global",
        "option",
        "value",
        "literature",
        "suggests",
        "relational",
        "value",
        "importantly",
        "move",
        "beyond",
        "standard",
        "instrumentalversusintrinsic",
        "framework",
        "eg",
        "himes",
        "muraca",
        "context",
        "biodiversity",
        "option",
        "value",
        "greater",
        "appreciation",
        "relational",
        "value",
        "fact",
        "restores",
        "link",
        "biodiversity",
        "value",
        "obscured",
        "popular",
        "instrumentalversusintrinsic",
        "argumentation",
        "link",
        "variety",
        "compared",
        "individual",
        "element",
        "andor",
        "ecosystemecological",
        "aspect",
        "issue",
        "discussion",
        "eser",
        "et",
        "al",
        "acknowledge",
        "normative",
        "content",
        "biodiversity",
        "consider",
        "arising",
        "politics",
        "time",
        "making",
        "term",
        "biodiversity",
        "indicates",
        "concept",
        "morally",
        "impregnated",
        "argue",
        "convention",
        "biological",
        "diversity",
        "address",
        "issue",
        "conservation",
        "also",
        "sustainable",
        "use",
        "fair",
        "sharing",
        "benefit",
        "triad",
        "objective",
        "reflects",
        "three",
        "dimension",
        "sustainable",
        "development",
        "ecology",
        "economy",
        "society",
        "equation",
        "may",
        "imply",
        "justicenormativity",
        "link",
        "interpreted",
        "depending",
        "fair",
        "sharing",
        "benefit",
        "fair",
        "sharing",
        "benefit",
        "often",
        "played",
        "locally",
        "conservation",
        "biodiversity",
        "global",
        "cbd",
        "issue",
        "thus",
        "seem",
        "tight",
        "fit",
        "eser",
        "et",
        "al",
        "historical",
        "perspective",
        "tied",
        "origin",
        "term",
        "biodiversity",
        "deeper",
        "historical",
        "perspective",
        "ethical",
        "argument",
        "conservation",
        "biotic",
        "diversity",
        "indeed",
        "eser",
        "et",
        "al",
        "provide",
        "explicit",
        "analysis",
        "benefit",
        "value",
        "biodiversityasvariety",
        "instead",
        "see",
        "wide",
        "range",
        "notion",
        "biodiversity",
        "quite",
        "useful",
        "providing",
        "boundary",
        "object",
        "embrace",
        "lot",
        "meaning",
        "perspective",
        "value",
        "similar",
        "perspective",
        "found",
        "proposed",
        "weak",
        "deflationism",
        "biodiversity",
        "see",
        "regarded",
        "biodiversity",
        "outcome",
        "normative",
        "discussion",
        "merit",
        "conservation",
        "eser",
        "et",
        "al",
        "argument",
        "nevertheless",
        "compatible",
        "early",
        "idea",
        "going",
        "back",
        "haskins",
        "others",
        "normative",
        "reason",
        "protect",
        "biodiversityasvariety",
        "future",
        "generation",
        "significantly",
        "eser",
        "et",
        "al",
        "argue",
        "consideration",
        "need",
        "future",
        "generation",
        "count",
        "nice",
        "considered",
        "must",
        "finding",
        "appropriate",
        "balance",
        "obligation",
        "current",
        "future",
        "generation",
        "one",
        "main",
        "challenge",
        "global",
        "change",
        "ethic",
        "eser",
        "et",
        "al",
        "conclude",
        "moral",
        "belief",
        "dealing",
        "need",
        "future",
        "generation",
        "matter",
        "justice",
        "widespread",
        "almost",
        "count",
        "truism",
        "substantiate",
        "biodiversity",
        "strategy",
        "right",
        "future",
        "generation",
        "therefore",
        "promising",
        "strategy",
        "meet",
        "intuition",
        "many",
        "people"
    ]
}