{
    "main_text": "Explanatory Approaches to Development || Integrating Approaches: Genetics and Physics\n3.3 Integrating Approaches: Genetics and Physics\n\nThompson held that physical forces were explanatory but inadequate in\nisolation to account for the developmental origin of morphology;\nheredity (genetics) was also a necessary causal\n factor.[13]\n Yet Thompson was quick to highlight that mechanical modes of\ncausation might be neglected in the midst of growing attention to\nheredity (genetics):\n\n\nit is no less of an exaggeration if we tend to neglect these direct\nphysical and mechanical modes of causation altogether, and to see in\nthe characters of a bone merely the results of variation and of\nheredity. (Thompson 1992 [1942]: 1023)\n\n\nDespite this latter form of exaggeration manifesting itself through\nmuch of the 20th century, an agenda to combine or integrate\nthe two approaches is now\n explicit.[14]\n\nThere is no controversy about whether genetic and physical modes of\ncausation are at work simultaneously:\n\n\nboth the physics and biochemical signaling pathways of the embryo\ncontribute to the form of the organism. (Von Dassow et al. 2010:\n1)\n\n\nThey are not competing causal explanations of the same phenomenon.\nExplanations should capture how their productive interactions yield\ndevelopmental outcomes:\n\n\nan increasing number of examples point to the existence of a\nreciprocal interplay between expression of some developmental genes\nand the mechanical forces that are associated with morphogenetic\nmovements. (Brouzés and Farge 2004: 372)\n\n\nGenetic causes can lead to physical causation and vice versa.\nPhysical causation brings about genetic causation through\nmechanotransduction. Stretching, contraction, compression, fluid shear\nstress, and other physical dynamics are sensed by different molecular\ncomponents inside and outside of cells that translate these\nenvironmental changes into biochemical signals (Hoffman et al. 2011;\nWozniak and Chen 2009). Genetic causation brings about physical\ncausation by creating different physical properties of cells and\ntissues through the presence, absence, or change in frequency of\nparticular proteins. For example, different patterns of expression for\ncell adhesion molecules (e.g., cadherins) can lead to differential\nadhesion across epithelial sheets of tissue and thereby generate phase\nseparations or compartments via surface tension variation (Newman and\nBhat 2008). If these modes of causation are not competing, then how\nmight one combine genetic and physical difference makers into an\nintegrated causal explanation? How much explanatory unity can be\nachieved for this “reciprocal interplay”?\n\nFinding philosophical models for the explanatory integration of\ngenetics and physics remains an open question (Love 2017b).\nApportioning causal responsibility in the sense of determining\nrelative contributions (e.g., the composition of causal magnitudes\namong different physical forces in Newtonian mechanics) is problematic\nbecause this requires commensurability with respect to how causes\nproduce their effects (Sober 1988). In the context of causation\nunderstood in terms of difference makers, the difficulty of\nintegration is a variation on a problem in causal reasoning identified\nby John Stuart Mill and labeled the “intermixture of\neffects,” which involves multiple causes contributing in a\nblended fashion to yield an outcome.\n\n\nThis difficulty is most of all conspicuous in the case of\nphysiological phenomena; it being seldom possible to separate the\ndifferent agencies which collectively compose an organized body,\nwithout destroying the very phenomena which it is our object to\ninvestigate. (Mill 1843 [1974]: 456 [book 3, chapter 11, section 1,\nparagraph 7])\n\n\nCareful statistical methodology in experiments can answer whether one\ntype of difference maker accounts for more of the variation in the\neffect variable for a particular population. But a ranking of causal\nfactors with respect to how much of a difference they made is not the\nsame as combining two modes of causation into an integrated account.\nAnother response is to dissolve the integration problem by reducing\nall of the causal interactions to one of the two distinct modes,\nthereby achieving a kind of explanatory unity (Rosenberg 2006).\nHowever, this approach is eschewed by working biologists who take both\ngenetic and physical modes of causation as significant and not\nreducible one to the other.\n\nA different strategy is integrative pluralism (Mitchell 2002). This\ninvolves a two-step procedure for explaining complex phenomena whose\nfeatures are the result of multiple causes: (a) formulate idealized\nmodels where particular causal factors operate in isolation\n(“theoretical modeling”); and, (b) integrate idealized\nmodels to explain how particular, concrete phenomena originate from\nthese causes in combination. This model is suggestive but also has key\ndrawbacks that include the fact that genetic causal reasoning in\ndevelopmental biology does not typically involve theoretical modeling\nand the precise nature of the integration is underspecified.\nIntegration of genetic and physical difference makers in a single\nmechanism offers a further possibility (Darden 2006; Craver 2007).\nAlthough this valuably highlights the productive continuity between\ndifference makers through stages in a sequence (i.e., their reciprocal\ninterplay), it also has handicaps. These include:\n\n\n\nDivergent approaches to measuring time. Instead of time “in the\nmechanism,” time is measured with external standardized stages\n(see below,\n Section 5.2).\n Stages facilitate the study of different kinds of developmental\nmechanisms, with different characteristic rates and durations for\ntheir stages, within a common framework for a model organism (e.g.,\nDrosophila), while also permitting conserved molecular\nmechanisms to be studied in different species because the\ncorresponding mechanism description is not anchored to the temporal\nsequence of the model organism.\n\n\nAn expectation that mechanism descriptions “bottom-out” in\nlowest level activities of molecular entities (Darden 2006). In the\ncase of combining genetic and physical difference makers, the\nreciprocal interplay means that there is a studious avoidance of\nbottoming out in one or the other mode of causation.\n\n\nThe requirement of stable, compositional organization for mechanisms:\n\n\n\nMechanistic explanations are constitutive or componential\nexplanations: they explain the behavior of the mechanism as a whole in\nterms of the organized activities and interaction of its components.\n(Craver 2007: 128) \n\n\nBut these mechanism descriptions are often embedded in different\ndevelopmental contexts (at different times in ontogeny) with distinct\ncompositional relations (within and between species). The reciprocal\ninterplay between genetic and physical difference makers is not\nmaintained precisely because these compositional differences alter\nrelationships of physical causation (fluid flow, tension, etc.; see\n Section 1.3).\n Developmental biologists have been able to generalize relationships\nof genetic causation (in terms of genetic mechanisms; see\n Section 1.3)\n across species quite widely, but the attempt to combine these with\nphysical causation has necessitated narrowing the scope of the causal\nclaims.\n\n\nAdequate philosophical models of the systematic dependence between\ngenetic and physical difference makers in ontogeny need to account for\nhow the temporal relations necessary for making causal claims are\nanchored in an external periodization used by developmental\nbiologists. The imposition of different temporal scales can lead to\ndistinct factors being significant or salient, which matters for\nascertaining how different kinds of causes can be combined into\nintegrated explanations. One possibility is to juxtapose these\ndifference makers at distinct stages via experimental verification\nsuch that they exhibit productive continuity within the constraints of\nthe external periodization (Love 2017b). This facilitates representing\nsymmetry between causal factors because genetic difference makers can\nbe placed before or after physical difference makers (and vice\nversa). Although this does not provide a way to combine causal\nmagnitudes (as in vector addition from Newtonian mechanics), it offers\nan explicit strategy for assigning responsibility among different\nkinds of causes through the vehicle of temporal organization that goes\nbeyond ranking difference makers. The periodization serves as a\ntemplate from the practices of developmental biologists for providing\nwholeness or unity to the different modes of causation to yield a kind\nof integrated explanation of the morphology that results from a\nsequence of developmental processes.\n\nNot all types of causal explanation involve an external periodization\nand there are other ways to combine causes in order to produce more\nintegrated explanatory frameworks. One area where combined\nexplanations for developmental phenomena are being analyzed pertains\nto mechanism descriptions and mathematical modeling in systems biology\n(Brigandt 2013; Fagan 2013). For example, Fagan (2013: ch. 9) shows\nhow an integrated explanation emerges from a step-wise procedure that\nstarts with a detailed description of a molecular mechanism followed\nby the formulation of an abstracted wiring diagram of component\ninteractions, which is then translated into a system of equations that\ncan account for changes in component interactions over time. Solutions\nto these systems of equations and a mapping of solutions for the\ninteractions among components of the system onto the behavior of the\noverall system within a shared landscape representation more\nsystematically explains cellular differentiation.\n",
    "section_title": "3.3 Integrating Approaches: Genetics and Physics",
    "entry_title": "Developmental Biology",
    "hierarchy_title": "Developmental Biology || Explanatory Approaches to Development || Integrating Approaches: Genetics and Physics",
    "tokenized_text": [
        "explanatory",
        "approach",
        "development",
        "integrating",
        "approach",
        "genetics",
        "physic",
        "integrating",
        "approach",
        "genetics",
        "physic",
        "thompson",
        "held",
        "physical",
        "force",
        "explanatory",
        "inadequate",
        "isolation",
        "account",
        "developmental",
        "origin",
        "morphology",
        "heredity",
        "genetics",
        "also",
        "necessary",
        "causal",
        "factor",
        "yet",
        "thompson",
        "quick",
        "highlight",
        "mechanical",
        "mode",
        "causation",
        "might",
        "neglected",
        "midst",
        "growing",
        "attention",
        "heredity",
        "genetics",
        "le",
        "exaggeration",
        "tend",
        "neglect",
        "direct",
        "physical",
        "mechanical",
        "mode",
        "causation",
        "altogether",
        "see",
        "character",
        "bone",
        "merely",
        "result",
        "variation",
        "heredity",
        "thompson",
        "despite",
        "latter",
        "form",
        "exaggeration",
        "manifesting",
        "much",
        "th",
        "century",
        "agenda",
        "combine",
        "integrate",
        "two",
        "approach",
        "explicit",
        "controversy",
        "whether",
        "genetic",
        "physical",
        "mode",
        "causation",
        "work",
        "simultaneously",
        "physic",
        "biochemical",
        "signaling",
        "pathway",
        "embryo",
        "contribute",
        "form",
        "organism",
        "von",
        "dassow",
        "et",
        "al",
        "competing",
        "causal",
        "explanation",
        "phenomenon",
        "explanation",
        "capture",
        "productive",
        "interaction",
        "yield",
        "developmental",
        "outcome",
        "increasing",
        "number",
        "example",
        "point",
        "existence",
        "reciprocal",
        "interplay",
        "expression",
        "developmental",
        "gene",
        "mechanical",
        "force",
        "associated",
        "morphogenetic",
        "movement",
        "brouzés",
        "farge",
        "genetic",
        "cause",
        "lead",
        "physical",
        "causation",
        "vice",
        "versa",
        "physical",
        "causation",
        "brings",
        "genetic",
        "causation",
        "mechanotransduction",
        "stretching",
        "contraction",
        "compression",
        "fluid",
        "shear",
        "stress",
        "physical",
        "dynamic",
        "sensed",
        "different",
        "molecular",
        "component",
        "inside",
        "outside",
        "cell",
        "translate",
        "environmental",
        "change",
        "biochemical",
        "signal",
        "hoffman",
        "et",
        "al",
        "wozniak",
        "chen",
        "genetic",
        "causation",
        "brings",
        "physical",
        "causation",
        "creating",
        "different",
        "physical",
        "property",
        "cell",
        "tissue",
        "presence",
        "absence",
        "change",
        "frequency",
        "particular",
        "protein",
        "example",
        "different",
        "pattern",
        "expression",
        "cell",
        "adhesion",
        "molecule",
        "eg",
        "cadherins",
        "lead",
        "differential",
        "adhesion",
        "across",
        "epithelial",
        "sheet",
        "tissue",
        "thereby",
        "generate",
        "phase",
        "separation",
        "compartment",
        "via",
        "surface",
        "tension",
        "variation",
        "newman",
        "bhat",
        "mode",
        "causation",
        "competing",
        "might",
        "one",
        "combine",
        "genetic",
        "physical",
        "difference",
        "maker",
        "integrated",
        "causal",
        "explanation",
        "much",
        "explanatory",
        "unity",
        "achieved",
        "reciprocal",
        "interplay",
        "finding",
        "philosophical",
        "model",
        "explanatory",
        "integration",
        "genetics",
        "physic",
        "remains",
        "open",
        "question",
        "love",
        "b",
        "apportioning",
        "causal",
        "responsibility",
        "sense",
        "determining",
        "relative",
        "contribution",
        "eg",
        "composition",
        "causal",
        "magnitude",
        "among",
        "different",
        "physical",
        "force",
        "newtonian",
        "mechanic",
        "problematic",
        "requires",
        "commensurability",
        "respect",
        "cause",
        "produce",
        "effect",
        "sober",
        "context",
        "causation",
        "understood",
        "term",
        "difference",
        "maker",
        "difficulty",
        "integration",
        "variation",
        "problem",
        "causal",
        "reasoning",
        "identified",
        "john",
        "stuart",
        "mill",
        "labeled",
        "intermixture",
        "effect",
        "involves",
        "multiple",
        "cause",
        "contributing",
        "blended",
        "fashion",
        "yield",
        "outcome",
        "difficulty",
        "conspicuous",
        "case",
        "physiological",
        "phenomenon",
        "seldom",
        "possible",
        "separate",
        "different",
        "agency",
        "collectively",
        "compose",
        "organized",
        "body",
        "without",
        "destroying",
        "phenomenon",
        "object",
        "investigate",
        "mill",
        "book",
        "chapter",
        "section",
        "paragraph",
        "careful",
        "statistical",
        "methodology",
        "experiment",
        "answer",
        "whether",
        "one",
        "type",
        "difference",
        "maker",
        "account",
        "variation",
        "effect",
        "variable",
        "particular",
        "population",
        "ranking",
        "causal",
        "factor",
        "respect",
        "much",
        "difference",
        "made",
        "combining",
        "two",
        "mode",
        "causation",
        "integrated",
        "account",
        "another",
        "response",
        "dissolve",
        "integration",
        "problem",
        "reducing",
        "causal",
        "interaction",
        "one",
        "two",
        "distinct",
        "mode",
        "thereby",
        "achieving",
        "kind",
        "explanatory",
        "unity",
        "rosenberg",
        "however",
        "approach",
        "eschewed",
        "working",
        "biologist",
        "take",
        "genetic",
        "physical",
        "mode",
        "causation",
        "significant",
        "reducible",
        "one",
        "different",
        "strategy",
        "integrative",
        "pluralism",
        "mitchell",
        "involves",
        "twostep",
        "procedure",
        "explaining",
        "complex",
        "phenomenon",
        "whose",
        "feature",
        "result",
        "multiple",
        "cause",
        "formulate",
        "idealized",
        "model",
        "particular",
        "causal",
        "factor",
        "operate",
        "isolation",
        "theoretical",
        "modeling",
        "b",
        "integrate",
        "idealized",
        "model",
        "explain",
        "particular",
        "concrete",
        "phenomenon",
        "originate",
        "cause",
        "combination",
        "model",
        "suggestive",
        "also",
        "key",
        "drawback",
        "include",
        "fact",
        "genetic",
        "causal",
        "reasoning",
        "developmental",
        "biology",
        "typically",
        "involve",
        "theoretical",
        "modeling",
        "precise",
        "nature",
        "integration",
        "underspecified",
        "integration",
        "genetic",
        "physical",
        "difference",
        "maker",
        "single",
        "mechanism",
        "offer",
        "possibility",
        "darden",
        "craver",
        "although",
        "valuably",
        "highlight",
        "productive",
        "continuity",
        "difference",
        "maker",
        "stage",
        "sequence",
        "ie",
        "reciprocal",
        "interplay",
        "also",
        "handicap",
        "include",
        "divergent",
        "approach",
        "measuring",
        "time",
        "instead",
        "time",
        "mechanism",
        "time",
        "measured",
        "external",
        "standardized",
        "stage",
        "see",
        "section",
        "stage",
        "facilitate",
        "study",
        "different",
        "kind",
        "developmental",
        "mechanism",
        "different",
        "characteristic",
        "rate",
        "duration",
        "stage",
        "within",
        "common",
        "framework",
        "model",
        "organism",
        "eg",
        "drosophila",
        "also",
        "permitting",
        "conserved",
        "molecular",
        "mechanism",
        "studied",
        "different",
        "specie",
        "corresponding",
        "mechanism",
        "description",
        "anchored",
        "temporal",
        "sequence",
        "model",
        "organism",
        "expectation",
        "mechanism",
        "description",
        "bottomout",
        "lowest",
        "level",
        "activity",
        "molecular",
        "entity",
        "darden",
        "case",
        "combining",
        "genetic",
        "physical",
        "difference",
        "maker",
        "reciprocal",
        "interplay",
        "mean",
        "studious",
        "avoidance",
        "bottoming",
        "one",
        "mode",
        "causation",
        "requirement",
        "stable",
        "compositional",
        "organization",
        "mechanism",
        "mechanistic",
        "explanation",
        "constitutive",
        "componential",
        "explanation",
        "explain",
        "behavior",
        "mechanism",
        "whole",
        "term",
        "organized",
        "activity",
        "interaction",
        "component",
        "craver",
        "mechanism",
        "description",
        "often",
        "embedded",
        "different",
        "developmental",
        "context",
        "different",
        "time",
        "ontogeny",
        "distinct",
        "compositional",
        "relation",
        "within",
        "specie",
        "reciprocal",
        "interplay",
        "genetic",
        "physical",
        "difference",
        "maker",
        "maintained",
        "precisely",
        "compositional",
        "difference",
        "alter",
        "relationship",
        "physical",
        "causation",
        "fluid",
        "flow",
        "tension",
        "etc",
        "see",
        "section",
        "developmental",
        "biologist",
        "able",
        "generalize",
        "relationship",
        "genetic",
        "causation",
        "term",
        "genetic",
        "mechanism",
        "see",
        "section",
        "across",
        "specie",
        "quite",
        "widely",
        "attempt",
        "combine",
        "physical",
        "causation",
        "necessitated",
        "narrowing",
        "scope",
        "causal",
        "claim",
        "adequate",
        "philosophical",
        "model",
        "systematic",
        "dependence",
        "genetic",
        "physical",
        "difference",
        "maker",
        "ontogeny",
        "need",
        "account",
        "temporal",
        "relation",
        "necessary",
        "making",
        "causal",
        "claim",
        "anchored",
        "external",
        "periodization",
        "used",
        "developmental",
        "biologist",
        "imposition",
        "different",
        "temporal",
        "scale",
        "lead",
        "distinct",
        "factor",
        "significant",
        "salient",
        "matter",
        "ascertaining",
        "different",
        "kind",
        "cause",
        "combined",
        "integrated",
        "explanation",
        "one",
        "possibility",
        "juxtapose",
        "difference",
        "maker",
        "distinct",
        "stage",
        "via",
        "experimental",
        "verification",
        "exhibit",
        "productive",
        "continuity",
        "within",
        "constraint",
        "external",
        "periodization",
        "love",
        "b",
        "facilitates",
        "representing",
        "symmetry",
        "causal",
        "factor",
        "genetic",
        "difference",
        "maker",
        "placed",
        "physical",
        "difference",
        "maker",
        "vice",
        "versa",
        "although",
        "provide",
        "way",
        "combine",
        "causal",
        "magnitude",
        "vector",
        "addition",
        "newtonian",
        "mechanic",
        "offer",
        "explicit",
        "strategy",
        "assigning",
        "responsibility",
        "among",
        "different",
        "kind",
        "cause",
        "vehicle",
        "temporal",
        "organization",
        "go",
        "beyond",
        "ranking",
        "difference",
        "maker",
        "periodization",
        "serf",
        "template",
        "practice",
        "developmental",
        "biologist",
        "providing",
        "wholeness",
        "unity",
        "different",
        "mode",
        "causation",
        "yield",
        "kind",
        "integrated",
        "explanation",
        "morphology",
        "result",
        "sequence",
        "developmental",
        "process",
        "type",
        "causal",
        "explanation",
        "involve",
        "external",
        "periodization",
        "way",
        "combine",
        "cause",
        "order",
        "produce",
        "integrated",
        "explanatory",
        "framework",
        "one",
        "area",
        "combined",
        "explanation",
        "developmental",
        "phenomenon",
        "analyzed",
        "pertains",
        "mechanism",
        "description",
        "mathematical",
        "modeling",
        "system",
        "biology",
        "brigandt",
        "fagan",
        "example",
        "fagan",
        "ch",
        "show",
        "integrated",
        "explanation",
        "emerges",
        "stepwise",
        "procedure",
        "start",
        "detailed",
        "description",
        "molecular",
        "mechanism",
        "followed",
        "formulation",
        "abstracted",
        "wiring",
        "diagram",
        "component",
        "interaction",
        "translated",
        "system",
        "equation",
        "account",
        "change",
        "component",
        "interaction",
        "time",
        "solution",
        "system",
        "equation",
        "mapping",
        "solution",
        "interaction",
        "among",
        "component",
        "system",
        "onto",
        "behavior",
        "overall",
        "system",
        "within",
        "shared",
        "landscape",
        "representation",
        "systematically",
        "explains",
        "cellular",
        "differentiation"
    ]
}