{
    "main_text": "Experimental Systems and Model Organisms || Model Organisms\n3.1 Model Organisms\n\nWhat would modern biology be without its model organisms? To give just\na few examples: Classical genetics was developed mainly by\nexperimenting with fruit flies of the species Drosophila\nmelanogaster. The same organism has recently also been at the\ncenter of much exciting work in developmental biology, together with\nthe nematode Caenorhabditis elegans and the zebrafish\nDanio rerio. Molecular biologists were initially mostly\nworking with the bacterium Escherichia coli and bacteriophage\n(viruses that infect bacteria). Neuroscientists owe much to the squid\nwith its giant axons. For immunology, the mouse Mus musculus\nhas proven invaluable. Plant molecular biology’s favorite is\nArabidopsis thaliana. Cell biology has found in baker’s yeast\nSaccharomyes cerevisiae an organism that is as easy to breed\nas E. coli, but its cells are more similar to animal and\nhuman cells. This list could go on, but not forever. Compared to field\nbiology, the number of species that are being studied in the\nexperimental life sciences is quite small; so small, in fact, that for\nmost of these model organisms complete genomic DNA sequences are\navailable today.\n\nIt may seem as somewhat paradoxical that it is exactly these\nexperimental disciplines of biology that limit their research to the\nsmallest part of life’s diversity that aspire to the greatest degree\nof universality. For the point of studying model organism is often to\ngain knowledge that is not only valid for one species but for many\nspecies, sometimes including humans. Before discussing this\nepistemological question, it is pertinent to review some results of\nhistorical and philosophical analyses of research on model\norganisms.\n\nAn important study is Robert Kohler’s Lords of the Fly\n(Kohler 1994), a history of Drosophila genetics originating\nfrom Thomas Hunt Morgan’s laboratory at Columbia University. Kohler\nattributes the success of this way of doing science to the enormous\noutput of the Drosophila system in terms of newly described\nand mapped mutations. The fruit fly breeds relatively fast and is easy\nto keep in laboratories in large numbers, which increases the chance\nof detecting new mutations. Kohler refers to Drosophila as the\n“breeder-reactor” to capture this kind of fecundity, thus,\nhis study is not unlike an ecology of the lab fruit fly. The elaborate\ntechniques of genetic mapping developed in Morgan’s laboratory, which\nassigned each mutation a physical location on one of the fly’s four\nchromosomes, can also be viewed as a way of organizing laboratory work\nand keeping track of the zillions of mutants that were cropping up\ncontinuously. A genetic map is a systematic catalogue of mutants and\nthus a research tool as much as it is a theoretical model of the fly’s\ngenetic system (cf. Weber 1998). Thus, most of what went on in\nMorgan’s laboratory is best described as breeding, maintaining,\ncharacterizing and cataloguing (by genetic mapping) fly strains. Very\nlittle of it had anything to do with testing genetic theories, even\nthough the theoretical knowledge about regularities of gene\ntransmission canonically known as “Mendel’s laws” was, of\ncourse, also considerably refined in the process (Darden 1991).\nHowever, classical genetic theory was also a means of discovering\nmutants and genes for further study, not an end in itself (Waters\n2004). This is also evident in the way in which Drosophila\nwas adapted to the age of the molecular biology (Weber 2005; Falk\n2009).\n\nModel organisms were often chosen for a particular field of study, but\nturned out to be invaluable for other fields as well.\nDrosophila is a case in point; Morgan was mainly interested\nin embryology when he chose Drosophila as a model system.\nThis paid off enormously, but the fly was just as important for\ngenetics itself, including evolutionary genetics (especially the work\nof one of the “architects” of the evolutionary synthesis,\nT. Dobzhansky; see Dobzhansky 1937), behavioral genetics (e.g., S.\nBenzer’s studies of the circadian clock mechanism, see Weiner 1999),\nbiochemical genetics, as well as neuroscience.\n\nThere is always an element of contingency in the choice of model\norganisms; no biological problem determines the choice of the best\norganism to study it. Even though considerations of convenience, easy\nbreeding and maintenance, as well as suitability for the study of\nspecific phenomena play a role (Clarke and Fujimura 1992; Burian 1992,\n1993; Lederman and Burian 1993; Clause 1993; Creager 2002; Geison and\nCreager 1999; Lederman and Tolin 1993), there are always many\ndifferent organisms that would satisfy these criteria. Thus, which\nmodel organism is chosen sometimes is a matter of chance.\n\nIs it possible that our biological knowledge would be altogether\ndifferent, had contingent choices been different in the past? As this\nquestion requires us to indulge in historical counterfactuals, which\nare controversial (Radick 2005), it is difficult to answer. However,\nit may not matter much one way or the other if the knowledge produced\nby model organisms can be shown to be of general validity, or at least\nas transcending the particular organism in which it was produced. This\nis an instance of the more general epistemological problem of\nextrapolating knowledge from one domain into another and can be\nfruitfully discussed as such (Burian 1992).\n\nLet us first consider a special case, the universality of the genetic\ncode. In molecular biology, unlike in popular science articles, the\nterm “genetic code” does not refer to an organism’s\ngenomic DNA sequence but to the assignment of amino acids to base\ntriplets on the messenger RNA. There are four such bases: A, U, G and\nC. Three bases together form a “codon” and specify an\namino acid, for example, the triplet AUG specifies the amino acid\nmethionine (it is also a start codon, i.e., it initiates an open\nreading frame for making a protein). It was remarkable to find that\nthe genetic code is completely identical in almost every organism that\nhas been studied so far. There are only a few exceptions known, for\nexample, the genetic code of mitochondria and chloroplasts or that of\nTrypanosomes (a human parasite causing sleeping sickness). Therefore,\nthe code is called “universal”, because the exceptions are\nso few. But how do biologists know that the code is universal, given\nthat it has been determined only in a small number of species?\n\nIn this case, a simple Bayesian argument can be used to show that\ncurrent belief in the universality of the genetic code is well\njustified. To see this, it must first be noted that the code is\narbitrary; there is no necessity in the specific mapping of amino\nacids to codons in the current standard genetic code. A second premise\nis that there is an enormously large number of different possible\ngenetic codes. Now, we may ask what the probability is that the exact\nsame genetic code evolved independently in so many different species\nas have been investigated at the molecular level to date. Surely, this\nprobability is vanishingly small. The probability of coincidence of\ngenetic codes is much, much larger on the assumption that the code did\nnot arise independently in the different species. On this hypothesis,\nthe code arose only once, and the coincidence is due to common\ndescent. However, once a specific genetic code is in place, it is very\ndifficult to change, because any mutational change in the amino\nacid-codon assignment tends to affect a larger number of different\nproteins and thus threatens to kill the organism. It is for this\nreason that Jacques Monod (1974) has described the code as a\n“frozen accident”. Its mutation rate is just very, very\nlow. These considerations together support the hypothesis of\nuniversality in the case of the genetic code.\n\nSuch an argument may not always be available. In fact, in the general\ncase extrapolation from a model organism is intrinsically problematic.\nThe main problem is what Daniel Steel (2008) has termed the\n“extrapolator’s circle”. The problem is this. We want to\ninfer that some system S has a mechanism M because another system T is\nalready known to have M. For this inference to be good, we must assume\nthat S and T are relevantly similar. We can’t know that the systems\nare relevantly similar unless we already know that they both have M.\nBut if we knew that, there would not be a need for extrapolating in\nthe first place.\n\nNote that such a circle does not arise when we extrapolate genetic\ncodes. In this case, we do know that the systems are\nrelevantly similar because all organisms share a common ancestor and\nbecause the code is hard to change. What can we do if no such argument\nis available?\n\nSteel (2008) has proposed a form of reasoning that he calls\n“comparative process tracing”. Steel’s proposed solution\nis that even in the absence of strong evidence as to what mechanism(s)\noperate in a target system compared to a model system, scientists can\ncompare the two systems with respect to certain crucial nodes in the\nrespective causal structures, namely those where the two systems are\nmost likely to differ. This can break the regress by providing\nevidence that the two systems are similar enough to warrant\nextrapolations, yet it is not necessary to already have an\nunderstanding of the target systems that matches the knowledge about\nthe model system.\n\nWhile this reasoning strategy seems plausible, it may not be so\npertinent for extrapolating from model organisms. Steel’s reasoning\nstrategy pertains to cases where we want to infer from one system\nwhere we know a certain mechanism operates to a different kind of\nsystem about we do not (yet) know that the same mechanism\noperates. However, in biology there is often evidence to the effect\nthat, in fact, very similar mechanisms operate in the model as well as\nin the target system. A particularly important kind of evidence is the\nexistence of so-called sequence homologies between different\norganisms. These are usually DNA sequences that show a more or less\nstrong similarity, in some cases even identity. As it is (like in the\ncase of the genetic code discussed above) not likely that this\nsequence similarity is due to chance, it is normally attributed to\ncommon ancestry (hence the term sequence “homology”; in\nbiology, this term in its modern usage indicates relations of shared\nancestry). Sequence homology has proven to be a reliable indicator of\nsimilarity of mechanisms. To give an example, a highly conserved\nsequence element called the “homeobox”, which was first\ndescribed in Drosophila, is today believed to play a similar\nrole in development in an extremely broad range of organisms (Gehring\n1998). When there are reasons to think that the model and the target\nshare similar causal mechanisms due to common descent, the\nextrapolator’s circle does not arise.\n\nHowever, the extent in which extrapolations from model organisms to\nother organisms can serve as evidence in the context of justification\nor merely as a heuristic in the context of discovery remains\ncontroversial. Baetu (1916) argues for a middle ground according to\nwhich extrapolations can be lines of evidence, but only in the context\nof a larger body of evidence where certain assumptions made in\nextrapolations are subjected to empirical scrutiny.\n\nThere has also been some debate to what extent there is a strong\nparallel between model organisms and theoretical models in science,\nfor example, the Lotka-Volterra predator-prey model in population\necology. A strong parallel is suggested by the fact that there is a\nwidespread agreement in the literature on scientific modeling (see\nentry Models in Science) that scientific models need not be abstract\n(i.e., consist of mathematical equations or something of this sort);\nthey can also be concrete and physical. Watson’s and\nCrick’s 1953 DNA model made of cardboard and wire qualifies as a\nmodel in this sense. Could a fruit fly bred in a laboratory to do\ngenetic experiments also be considered as a scientific model in the\nstandard sense? Ankeny and Leonelli (2011) answer this question in the\naffirmative, on the grounds that (1) model organisms are used to\nrepresent a whole range of other organisms and (2) that they are used\nto represent specific phenomena.\n\nLevy and Currie (2015) have criticized this idea. On their view,\nscientific models such as Lotka’s and Volterra’s (and all\nthe other models discussed in the burgeoning modeling literature) play\na completely different role in science than model organisms. In\nparticular, they differ in the way they are used in scientific\ninferences. In a model such as the mathematical predator-prey model,\nscientists draw analogical inferences from model to target, inferences\nthat are underwritten by theoretical assumptions. By contrast, model\norganisms serve as a basis for extrapolations from individual members\nto a whole class (often but not necessarily on the basis of shared\nancestry). Thus, they want to exclude what they call “empirical\nextrapolation” (a form of induction), which they take to be\ncharacteristic for model organism-target inferences from the kind of\ntheoretical inferences that are used to gain knowledge about a target\nvia scientific models in general.\n\nHowever, this does not mean that living organisms or populations of\norganisms cannot be used as models. Levy and Currie accept that\ncertain model systems in experimental ecology and experimental\nevolution are scientific models that are akin to the Lotka-Volterra\nmodel. A case in point are Thomas Park’s (1948) famous\ncompetition experiments using the flour beetle Tribolium. What\ncharacterizes such experimental models, in contrast to model\norganisms, is that they can be used to represent generalized\nbiologically phenomena (e.g., interspecific competition in\nPark’s case) that can be applied to radically different and\ntaxonomically unrelated target systems (see also Weber 2014).\n\nNo matter whether model organisms are considered as scientific models\nor as something else, it is widely agreed that they serve many\ndifferent purposes, only some of which are representational. The\ndevelopment of model organisms such as Drosophila (fruit\nfly), Arabidopsis (Thale cress), Caenorhabditis\n(roundworm) and the associated databases such as FlyBase, Wormbase\netc. has had a profound impact on the way in which biological research\nis organized (e.g., Geison and Creager 1999, Clarke and Fujimura 1992,\nCreager 2002, Leonelli and Ankeny 2012). Furthermore, model organisms\nare also important sources of research materials such as genetically\nwell-defined laboratory strains or genetically modified organisms\nwithout which cutting-edge biological experimentation is no longer\npossible today. Weber (2005) has introduced the notion of preparative\nexperimentation to capture this role of model organisms.\n",
    "section_title": "3.1 Model Organisms",
    "entry_title": "Experiment in Biology",
    "hierarchy_title": "Experiment in Biology || Experimental Systems and Model Organisms || Model Organisms",
    "tokenized_text": [
        "experimental",
        "system",
        "model",
        "organism",
        "model",
        "organism",
        "model",
        "organism",
        "would",
        "modern",
        "biology",
        "without",
        "model",
        "organism",
        "give",
        "example",
        "classical",
        "genetics",
        "developed",
        "mainly",
        "experimenting",
        "fruit",
        "fly",
        "specie",
        "drosophila",
        "melanogaster",
        "organism",
        "recently",
        "also",
        "center",
        "much",
        "exciting",
        "work",
        "developmental",
        "biology",
        "together",
        "nematode",
        "caenorhabditis",
        "elegans",
        "zebrafish",
        "danio",
        "rerio",
        "molecular",
        "biologist",
        "initially",
        "mostly",
        "working",
        "bacterium",
        "escherichia",
        "coli",
        "bacteriophage",
        "virus",
        "infect",
        "bacteria",
        "neuroscientist",
        "owe",
        "much",
        "squid",
        "giant",
        "axon",
        "immunology",
        "mouse",
        "mu",
        "musculus",
        "proven",
        "invaluable",
        "plant",
        "molecular",
        "biology",
        "favorite",
        "arabidopsis",
        "thaliana",
        "cell",
        "biology",
        "found",
        "baker",
        "yeast",
        "saccharomyes",
        "cerevisiae",
        "organism",
        "easy",
        "breed",
        "e",
        "coli",
        "cell",
        "similar",
        "animal",
        "human",
        "cell",
        "list",
        "could",
        "go",
        "forever",
        "compared",
        "field",
        "biology",
        "number",
        "specie",
        "studied",
        "experimental",
        "life",
        "science",
        "quite",
        "small",
        "small",
        "fact",
        "model",
        "organism",
        "complete",
        "genomic",
        "dna",
        "sequence",
        "available",
        "today",
        "may",
        "seem",
        "somewhat",
        "paradoxical",
        "exactly",
        "experimental",
        "discipline",
        "biology",
        "limit",
        "research",
        "smallest",
        "part",
        "life",
        "diversity",
        "aspire",
        "greatest",
        "degree",
        "universality",
        "point",
        "studying",
        "model",
        "organism",
        "often",
        "gain",
        "knowledge",
        "valid",
        "one",
        "specie",
        "many",
        "specie",
        "sometimes",
        "including",
        "human",
        "discussing",
        "epistemological",
        "question",
        "pertinent",
        "review",
        "result",
        "historical",
        "philosophical",
        "analysis",
        "research",
        "model",
        "organism",
        "important",
        "study",
        "robert",
        "kohler",
        "lord",
        "fly",
        "kohler",
        "history",
        "drosophila",
        "genetics",
        "originating",
        "thomas",
        "hunt",
        "morgan",
        "laboratory",
        "columbia",
        "university",
        "kohler",
        "attribute",
        "success",
        "way",
        "science",
        "enormous",
        "output",
        "drosophila",
        "system",
        "term",
        "newly",
        "described",
        "mapped",
        "mutation",
        "fruit",
        "fly",
        "breed",
        "relatively",
        "fast",
        "easy",
        "keep",
        "laboratory",
        "large",
        "number",
        "increase",
        "chance",
        "detecting",
        "new",
        "mutation",
        "kohler",
        "refers",
        "drosophila",
        "breederreactor",
        "capture",
        "kind",
        "fecundity",
        "thus",
        "study",
        "unlike",
        "ecology",
        "lab",
        "fruit",
        "fly",
        "elaborate",
        "technique",
        "genetic",
        "mapping",
        "developed",
        "morgan",
        "laboratory",
        "assigned",
        "mutation",
        "physical",
        "location",
        "one",
        "fly",
        "four",
        "chromosome",
        "also",
        "viewed",
        "way",
        "organizing",
        "laboratory",
        "work",
        "keeping",
        "track",
        "zillion",
        "mutant",
        "cropping",
        "continuously",
        "genetic",
        "map",
        "systematic",
        "catalogue",
        "mutant",
        "thus",
        "research",
        "tool",
        "much",
        "theoretical",
        "model",
        "fly",
        "genetic",
        "system",
        "cf",
        "weber",
        "thus",
        "went",
        "morgan",
        "laboratory",
        "best",
        "described",
        "breeding",
        "maintaining",
        "characterizing",
        "cataloguing",
        "genetic",
        "mapping",
        "fly",
        "strain",
        "little",
        "anything",
        "testing",
        "genetic",
        "theory",
        "even",
        "though",
        "theoretical",
        "knowledge",
        "regularity",
        "gene",
        "transmission",
        "canonically",
        "known",
        "mendel",
        "law",
        "course",
        "also",
        "considerably",
        "refined",
        "process",
        "darden",
        "however",
        "classical",
        "genetic",
        "theory",
        "also",
        "mean",
        "discovering",
        "mutant",
        "gene",
        "study",
        "end",
        "water",
        "also",
        "evident",
        "way",
        "drosophila",
        "adapted",
        "age",
        "molecular",
        "biology",
        "weber",
        "falk",
        "model",
        "organism",
        "often",
        "chosen",
        "particular",
        "field",
        "study",
        "turned",
        "invaluable",
        "field",
        "well",
        "drosophila",
        "case",
        "point",
        "morgan",
        "mainly",
        "interested",
        "embryology",
        "chose",
        "drosophila",
        "model",
        "system",
        "paid",
        "enormously",
        "fly",
        "important",
        "genetics",
        "including",
        "evolutionary",
        "genetics",
        "especially",
        "work",
        "one",
        "architect",
        "evolutionary",
        "synthesis",
        "t",
        "dobzhansky",
        "see",
        "dobzhansky",
        "behavioral",
        "genetics",
        "eg",
        "s",
        "benzer",
        "study",
        "circadian",
        "clock",
        "mechanism",
        "see",
        "weiner",
        "biochemical",
        "genetics",
        "well",
        "neuroscience",
        "always",
        "element",
        "contingency",
        "choice",
        "model",
        "organism",
        "biological",
        "problem",
        "determines",
        "choice",
        "best",
        "organism",
        "study",
        "even",
        "though",
        "consideration",
        "convenience",
        "easy",
        "breeding",
        "maintenance",
        "well",
        "suitability",
        "study",
        "specific",
        "phenomenon",
        "play",
        "role",
        "clarke",
        "fujimura",
        "burian",
        "lederman",
        "burian",
        "clause",
        "creager",
        "geison",
        "creager",
        "lederman",
        "tolin",
        "always",
        "many",
        "different",
        "organism",
        "would",
        "satisfy",
        "criterion",
        "thus",
        "model",
        "organism",
        "chosen",
        "sometimes",
        "matter",
        "chance",
        "possible",
        "biological",
        "knowledge",
        "would",
        "altogether",
        "different",
        "contingent",
        "choice",
        "different",
        "past",
        "question",
        "requires",
        "u",
        "indulge",
        "historical",
        "counterfactuals",
        "controversial",
        "radick",
        "difficult",
        "answer",
        "however",
        "may",
        "matter",
        "much",
        "one",
        "way",
        "knowledge",
        "produced",
        "model",
        "organism",
        "shown",
        "general",
        "validity",
        "least",
        "transcending",
        "particular",
        "organism",
        "produced",
        "instance",
        "general",
        "epistemological",
        "problem",
        "extrapolating",
        "knowledge",
        "one",
        "domain",
        "another",
        "fruitfully",
        "discussed",
        "burian",
        "let",
        "u",
        "first",
        "consider",
        "special",
        "case",
        "universality",
        "genetic",
        "code",
        "molecular",
        "biology",
        "unlike",
        "popular",
        "science",
        "article",
        "term",
        "genetic",
        "code",
        "refer",
        "organism",
        "genomic",
        "dna",
        "sequence",
        "assignment",
        "amino",
        "acid",
        "base",
        "triplet",
        "messenger",
        "rna",
        "four",
        "base",
        "u",
        "g",
        "c",
        "three",
        "base",
        "together",
        "form",
        "codon",
        "specify",
        "amino",
        "acid",
        "example",
        "triplet",
        "aug",
        "specifies",
        "amino",
        "acid",
        "methionine",
        "also",
        "start",
        "codon",
        "ie",
        "initiate",
        "open",
        "reading",
        "frame",
        "making",
        "protein",
        "remarkable",
        "find",
        "genetic",
        "code",
        "completely",
        "identical",
        "almost",
        "every",
        "organism",
        "studied",
        "far",
        "exception",
        "known",
        "example",
        "genetic",
        "code",
        "mitochondrion",
        "chloroplast",
        "trypanosomes",
        "human",
        "parasite",
        "causing",
        "sleeping",
        "sickness",
        "therefore",
        "code",
        "called",
        "universal",
        "exception",
        "biologist",
        "know",
        "code",
        "universal",
        "given",
        "determined",
        "small",
        "number",
        "specie",
        "case",
        "simple",
        "bayesian",
        "argument",
        "used",
        "show",
        "current",
        "belief",
        "universality",
        "genetic",
        "code",
        "well",
        "justified",
        "see",
        "must",
        "first",
        "noted",
        "code",
        "arbitrary",
        "necessity",
        "specific",
        "mapping",
        "amino",
        "acid",
        "codon",
        "current",
        "standard",
        "genetic",
        "code",
        "second",
        "premise",
        "enormously",
        "large",
        "number",
        "different",
        "possible",
        "genetic",
        "code",
        "may",
        "ask",
        "probability",
        "exact",
        "genetic",
        "code",
        "evolved",
        "independently",
        "many",
        "different",
        "specie",
        "investigated",
        "molecular",
        "level",
        "date",
        "surely",
        "probability",
        "vanishingly",
        "small",
        "probability",
        "coincidence",
        "genetic",
        "code",
        "much",
        "much",
        "larger",
        "assumption",
        "code",
        "arise",
        "independently",
        "different",
        "specie",
        "hypothesis",
        "code",
        "arose",
        "coincidence",
        "due",
        "common",
        "descent",
        "however",
        "specific",
        "genetic",
        "code",
        "place",
        "difficult",
        "change",
        "mutational",
        "change",
        "amino",
        "acidcodon",
        "assignment",
        "tends",
        "affect",
        "larger",
        "number",
        "different",
        "protein",
        "thus",
        "threatens",
        "kill",
        "organism",
        "reason",
        "jacques",
        "monod",
        "described",
        "code",
        "frozen",
        "accident",
        "mutation",
        "rate",
        "low",
        "consideration",
        "together",
        "support",
        "hypothesis",
        "universality",
        "case",
        "genetic",
        "code",
        "argument",
        "may",
        "always",
        "available",
        "fact",
        "general",
        "case",
        "extrapolation",
        "model",
        "organism",
        "intrinsically",
        "problematic",
        "main",
        "problem",
        "daniel",
        "steel",
        "termed",
        "extrapolator",
        "circle",
        "problem",
        "want",
        "infer",
        "system",
        "mechanism",
        "another",
        "system",
        "already",
        "known",
        "m",
        "inference",
        "good",
        "must",
        "assume",
        "relevantly",
        "similar",
        "know",
        "system",
        "relevantly",
        "similar",
        "unless",
        "already",
        "know",
        "m",
        "knew",
        "would",
        "need",
        "extrapolating",
        "first",
        "place",
        "note",
        "circle",
        "arise",
        "extrapolate",
        "genetic",
        "code",
        "case",
        "know",
        "system",
        "relevantly",
        "similar",
        "organism",
        "share",
        "common",
        "ancestor",
        "code",
        "hard",
        "change",
        "argument",
        "available",
        "steel",
        "proposed",
        "form",
        "reasoning",
        "call",
        "comparative",
        "process",
        "tracing",
        "steel",
        "proposed",
        "solution",
        "even",
        "absence",
        "strong",
        "evidence",
        "mechanism",
        "operate",
        "target",
        "system",
        "compared",
        "model",
        "system",
        "scientist",
        "compare",
        "two",
        "system",
        "respect",
        "certain",
        "crucial",
        "node",
        "respective",
        "causal",
        "structure",
        "namely",
        "two",
        "system",
        "likely",
        "differ",
        "break",
        "regress",
        "providing",
        "evidence",
        "two",
        "system",
        "similar",
        "enough",
        "warrant",
        "extrapolation",
        "yet",
        "necessary",
        "already",
        "understanding",
        "target",
        "system",
        "match",
        "knowledge",
        "model",
        "system",
        "reasoning",
        "strategy",
        "seems",
        "plausible",
        "may",
        "pertinent",
        "extrapolating",
        "model",
        "organism",
        "steel",
        "reasoning",
        "strategy",
        "pertains",
        "case",
        "want",
        "infer",
        "one",
        "system",
        "know",
        "certain",
        "mechanism",
        "operates",
        "different",
        "kind",
        "system",
        "yet",
        "know",
        "mechanism",
        "operates",
        "however",
        "biology",
        "often",
        "evidence",
        "effect",
        "fact",
        "similar",
        "mechanism",
        "operate",
        "model",
        "well",
        "target",
        "system",
        "particularly",
        "important",
        "kind",
        "evidence",
        "existence",
        "socalled",
        "sequence",
        "homology",
        "different",
        "organism",
        "usually",
        "dna",
        "sequence",
        "show",
        "le",
        "strong",
        "similarity",
        "case",
        "even",
        "identity",
        "like",
        "case",
        "genetic",
        "code",
        "discussed",
        "likely",
        "sequence",
        "similarity",
        "due",
        "chance",
        "normally",
        "attributed",
        "common",
        "ancestry",
        "hence",
        "term",
        "sequence",
        "homology",
        "biology",
        "term",
        "modern",
        "usage",
        "indicates",
        "relation",
        "shared",
        "ancestry",
        "sequence",
        "homology",
        "proven",
        "reliable",
        "indicator",
        "similarity",
        "mechanism",
        "give",
        "example",
        "highly",
        "conserved",
        "sequence",
        "element",
        "called",
        "homeobox",
        "first",
        "described",
        "drosophila",
        "today",
        "believed",
        "play",
        "similar",
        "role",
        "development",
        "extremely",
        "broad",
        "range",
        "organism",
        "gehring",
        "reason",
        "think",
        "model",
        "target",
        "share",
        "similar",
        "causal",
        "mechanism",
        "due",
        "common",
        "descent",
        "extrapolator",
        "circle",
        "arise",
        "however",
        "extent",
        "extrapolation",
        "model",
        "organism",
        "organism",
        "serve",
        "evidence",
        "context",
        "justification",
        "merely",
        "heuristic",
        "context",
        "discovery",
        "remains",
        "controversial",
        "baetu",
        "argues",
        "middle",
        "ground",
        "according",
        "extrapolation",
        "line",
        "evidence",
        "context",
        "larger",
        "body",
        "evidence",
        "certain",
        "assumption",
        "made",
        "extrapolation",
        "subjected",
        "empirical",
        "scrutiny",
        "also",
        "debate",
        "extent",
        "strong",
        "parallel",
        "model",
        "organism",
        "theoretical",
        "model",
        "science",
        "example",
        "lotkavolterra",
        "predatorprey",
        "model",
        "population",
        "ecology",
        "strong",
        "parallel",
        "suggested",
        "fact",
        "widespread",
        "agreement",
        "literature",
        "scientific",
        "modeling",
        "see",
        "entry",
        "model",
        "science",
        "scientific",
        "model",
        "need",
        "abstract",
        "ie",
        "consist",
        "mathematical",
        "equation",
        "something",
        "sort",
        "also",
        "concrete",
        "physical",
        "watson",
        "crick",
        "dna",
        "model",
        "made",
        "cardboard",
        "wire",
        "qualifies",
        "model",
        "sense",
        "could",
        "fruit",
        "fly",
        "bred",
        "laboratory",
        "genetic",
        "experiment",
        "also",
        "considered",
        "scientific",
        "model",
        "standard",
        "sense",
        "ankeny",
        "leonelli",
        "answer",
        "question",
        "affirmative",
        "ground",
        "model",
        "organism",
        "used",
        "represent",
        "whole",
        "range",
        "organism",
        "used",
        "represent",
        "specific",
        "phenomenon",
        "levy",
        "currie",
        "criticized",
        "idea",
        "view",
        "scientific",
        "model",
        "lotka",
        "volterra",
        "model",
        "discussed",
        "burgeoning",
        "modeling",
        "literature",
        "play",
        "completely",
        "different",
        "role",
        "science",
        "model",
        "organism",
        "particular",
        "differ",
        "way",
        "used",
        "scientific",
        "inference",
        "model",
        "mathematical",
        "predatorprey",
        "model",
        "scientist",
        "draw",
        "analogical",
        "inference",
        "model",
        "target",
        "inference",
        "underwritten",
        "theoretical",
        "assumption",
        "contrast",
        "model",
        "organism",
        "serve",
        "basis",
        "extrapolation",
        "individual",
        "member",
        "whole",
        "class",
        "often",
        "necessarily",
        "basis",
        "shared",
        "ancestry",
        "thus",
        "want",
        "exclude",
        "call",
        "empirical",
        "extrapolation",
        "form",
        "induction",
        "take",
        "characteristic",
        "model",
        "organismtarget",
        "inference",
        "kind",
        "theoretical",
        "inference",
        "used",
        "gain",
        "knowledge",
        "target",
        "via",
        "scientific",
        "model",
        "general",
        "however",
        "mean",
        "living",
        "organism",
        "population",
        "organism",
        "used",
        "model",
        "levy",
        "currie",
        "accept",
        "certain",
        "model",
        "system",
        "experimental",
        "ecology",
        "experimental",
        "evolution",
        "scientific",
        "model",
        "akin",
        "lotkavolterra",
        "model",
        "case",
        "point",
        "thomas",
        "park",
        "famous",
        "competition",
        "experiment",
        "using",
        "flour",
        "beetle",
        "tribolium",
        "characterizes",
        "experimental",
        "model",
        "contrast",
        "model",
        "organism",
        "used",
        "represent",
        "generalized",
        "biologically",
        "phenomenon",
        "eg",
        "interspecific",
        "competition",
        "park",
        "case",
        "applied",
        "radically",
        "different",
        "taxonomically",
        "unrelated",
        "target",
        "system",
        "see",
        "also",
        "weber",
        "matter",
        "whether",
        "model",
        "organism",
        "considered",
        "scientific",
        "model",
        "something",
        "else",
        "widely",
        "agreed",
        "serve",
        "many",
        "different",
        "purpose",
        "representational",
        "development",
        "model",
        "organism",
        "drosophila",
        "fruit",
        "fly",
        "arabidopsis",
        "thale",
        "cress",
        "caenorhabditis",
        "roundworm",
        "associated",
        "database",
        "flybase",
        "wormbase",
        "etc",
        "profound",
        "impact",
        "way",
        "biological",
        "research",
        "organized",
        "eg",
        "geison",
        "creager",
        "clarke",
        "fujimura",
        "creager",
        "leonelli",
        "ankeny",
        "furthermore",
        "model",
        "organism",
        "also",
        "important",
        "source",
        "research",
        "material",
        "genetically",
        "welldefined",
        "laboratory",
        "strain",
        "genetically",
        "modified",
        "organism",
        "without",
        "cuttingedge",
        "biological",
        "experimentation",
        "longer",
        "possible",
        "today",
        "weber",
        "introduced",
        "notion",
        "preparative",
        "experimentation",
        "capture",
        "role",
        "model",
        "organism"
    ]
}