{
    "main_text": "Development and Evolution || Functional Homology in Developmental Genetics\n5.1 Functional Homology in Developmental Genetics\n\nThe conserved role of Hox genes in axial patterning is\nreferred to as functionally homologous across animals (Manak and Scott\n1994), over and above the relation of structural homology that obtains\nbetween DNA sequences. And yet “functional homology” is a\ncontradiction in terms (Abouheif et al. 1997) because the definition\nof a homologue is “the same organ in different animals under\nevery variety of form and function” (Owen 1843: 379)—the\ndescendant, evolutionary distinction between homology (structure) and\nanalogy (function) is founded on this recognition. Therefore, the idea\nof functional homology appears theoretically confused and there is a\nconceptual tension in its use by molecular developmental\nbiologists.\n\n\n\nFigure 6: Vertebrate wings are\nhomologous as forelimbs; they are derived by common descent from the\nsame structure. The function of vertebrate wings (i.e., flight) is\nanalogous; although the wings fulfill similar functions, their role in\nflight has evolved separately.\n\n\nThe reference to “organ” in Owen’s definition is\nindicative of a structure (an entity) found in an organism that may\nvary in its shape and composition (form) or what it is for (function)\nin the species where it occurs. Translated into an evolutionary\ncontext, sameness is cashed out by reference to common ancestry. Since\nstructures also can be similar by virtue of natural selection\noperating in similar environments, homology is contrasted with\nanalogy. Homologous structures are the same by virtue of descent from\na common ancestor, regardless of what functions these structures are\ninvolved in, whereas analogous structures are similar by virtue of\nselection processes favoring comparable functional outcomes,\nregardless of common descent\n (Figure 6).\n \n\nThis is what makes similarity of function an especially problematic\ncriterion of homology (Abouheif et al. 1997). Because functional\nsimilarity is the appropriate relation for analogy, it is not\nnecessary for analogues to have the same function as a consequence of\ncommon ancestry—similarity despite different origins suffices\n(Ghiselin 2005). Classic cases of analogy involve taxa that do not\nshare a recent common ancestor that exhibits the structure, such as\nthe external body morphology of dolphins and tuna (Pabst 2000). Thus,\nfunctional homology seems to be a category error because what a\nstructure does should not enter into an evaluation of homologue\ncorrespondence and similarity of function is often the result of\nadaptation via natural selection to common environmental demands, not\ncommon ancestry.\n\nAlthough we might be inclined to simply prohibit the terminology of\nfunctional homology, its widespread use in molecular and developmental\nbiology should at least make us\n pause.[18]\n While it is important to recognize this pervasive practice, some\noccurrences may be illicit. Swapping structurally homologous genes\nbetween species to rescue mutant or null phenotypes is not a genuine\ncriterion of functional homology, especially when there is little or\nno attention to establishing a phylogenetic context. This makes a\nnumber of claims of functional homology suspect. To not run afoul of\nthe conceptual tension, explicit attention must be given to the\nmeaning of “function.” Biological practice harbors at\nleast four separate meanings of function (Wouters 2003, 2005):\nactivity (what something does), causal role (contribution to a\ncapacity), fitness advantage or viability (value of having something),\nand selected effect or etiology (origination and maintenance via\nnatural selection). Debate has raged about which of them (if any) is\nmost appropriate for different aspects of biological and psychological\nreasoning or most general in scope (i.e., what makes them all function\nconcepts?) (see discussion in Garson 2016). Here the issue is whether\nwe can identify a legitimate concept of homology of function.\n\nIf we are to avoid mixing homology and analogy, then the appropriate\nnotion of function cannot be based on selection history, which is\nallied with the concept of analogy and concerns a particular variety\nof function. Similarly, viability interpretations concentrate on\nfeatures where the variety of function is critical because of\nconferred survival advantages. Any interpretation of function that\nrelies on a particular variety of function (because it was selected or\nbecause it confers viability) clashes with the demand that homology\nconcern something “under every variety of form and\nfunction.” A causal role interpretation emphasizes a systemic\ncapacity to which a function makes a contribution. It too focuses on a\nparticular variety of function, though in a way different from either\nselected effect or viability interpretations. Only an activity\ninterpretation (‘what something does’) accents the\nfunction itself, apart from its specific contribution to a systemic\ncapacity and position in a larger context. Therefore, the most\nappropriate meaning to incorporate into homology of function is\n“activity-function” because it is at least\npossible for activity-functions to remain constant under every\nvariety. An evaluation of sameness due to common ancestry is made\nseparately from the role the function plays (or its use), whether\nunderstood in terms of a causal role, a fitness advantage, or a\nhistory of\n selection.[19]\nActivity-functions can be put to different uses while being\nshared via common descent (i.e., homologous). More precisely, homology\nof function can be defined as the same activity-function in different\nanimals under every variety of form and use-function (Love 2007). This\nunambiguously removes the tension that plagued functional\nhomology.\n\nCareful discussions of regulatory gene function in development and\nevolution recognize something akin to the distinction between\nactivity- and use-function (i.e., between what a gene does and what it\nis for in some process within the organism).\n\n\nWhen studying the molecular evolution of regulatory genes, their\nbiochemical and developmental function must be considered separately.\nThe biochemical function of PAX-6 and eyeless are as\ngeneral transcription factors (which bind and activate downstream\ngenes), but their developmental function is their specific involvement\nin eye morphogenesis (Abouheif 1997: 407).\n\n\nThe biochemical function is the activity-function and the\ndevelopmental function is the use-function. This distinction helps to\ndiscriminate between divergent evolutionary trajectories. Biochemical\n(activity-functions) of genes are often conserved (i.e., homologous),\nwhile simultaneously being available for co-option to make causal role\ncontributions (use-functions) to distinct developmental processes. The\nsame regulatory genes are evolutionarily stable in terms of\nactivity-function and evolutionarily labile in terms of\n use-function.[20]\n By implication, claims about use-function homology for genes\nqua developmental function are suspect compared to those\nconcerning activity-function homology for genes qua\nbiochemical function because developmental functions are more likely\nto have changed as phylogenetic distance increases.\n\nThe distinction between biochemical (activity) function and\ndevelopmental (use) function is reinforced by the hierarchical aspects\nof homology (Hall 1994). A capacity defining the use-function of a\nregulatory gene at one level of organization, such as axial\npatterning, must be considered as an activity-function itself at\nanother level of organization, such as the differentiation of serially\nrepeated elements along a body axis. (Note that\n “level of organization”\n need not be compositional and thus the language of\n“higher” and “lower” levels may be\ninappropriate.) The developmental roles of Hox genes in axial\npatterning may be conserved by virtue of their biochemical\nactivity-function homologies but Hox genes are not\nuse-function homologues because of these developmental roles. Instead\nof focusing on the activity of a gene component and its causal role in\naxial patterning, we shift to the activity of axial patterning and its\ncausal role elsewhere (or elsewhen) in embryonic development.\n\nIntroducing a conceptually legitimate idea of homology of\nactivity-function is not about keeping the ideas of developmental\nbiology tidy. It assists in the interpretation of evidence and\ncircumscribes the inferences drawn. For example, NK-2 genes\nare involved in mesoderm specification, which underlies muscle\nmorphogenesis. In Drosophila, the expression of a particular\nNK-2 gene (tinman) is critical for both cardiac and\nvisceral mesoderm development. If tinman is knocked out and\ntransgenically replaced with its vertebrate orthologue,\nNkx2-5, only visceral mesoderm specification is rescued; the\nregulation of cardiac mesoderm is not (Ranganayakulu et al. 1998). A\nregion of the vertebrate protein near the 5′ end of the\npolypeptide differs enough to prevent appropriate regulation in\ncardiac morphogenesis. The homeodomains (stretches of sequence that\nconfer DNA binding) for vertebrate Nkx2-5 and\nDrosophila tinman are interchangeable. The inability\nof Nkx2-5 to rescue cardiac mesoderm specification is not\nrelated to the activity-function of differential DNA binding. One\ncomponent of the orthologous (homologous) proteins in both species\nretains an activity-function homology related to visceral mesoderm\nspecification but another component (not the homeodomain) has\ndiverged. This homeobox gene does not have a single use-function (as\nexpected), but it also does not have a single activity-function. Any\nadequate evaluation of these cases must recognize a more fine-grained\ndecomposition of genes into working units to capture genuine\nactivity-function conservation. We can link activity-function\nhomologues directly to structural motifs within a gene, but there is\nnot necessarily a single activity-function for an entire open reading\nframe.\n\nDefusing the conceptual tensions between developmental and\nevolutionary biology with respect to homology of function has a direct\nimpact on the causal generalizations and inferences made from model\norganisms\n (Section 4).\n Activity-function homology directs our attention to the stability or\nconservation of activities. This conservation is indicative of when\nthe study of mechanisms in model organisms will produce robust and\nstable generalizations\n (Section 1.3).\n The widespread use of functional homology in developmental biology is\naimed at exactly this kind of question, which explains its persistence\nin experimental biology despite conceptual ambiguities.\nGeneralizations concerning molecular signaling cascades are\nunderwritten by the coordinated biochemical activities in view, not\nthe developmental roles (though sometimes they may coincide). Thus,\nactivity-function details about a signaling cascade gleaned from a\nmodel organism can be generalized via homology to other unstudied\norganisms even if the developmental role varies for the\nactivity-function in other species.\n",
    "section_title": "5.1 Functional Homology in Developmental Genetics",
    "entry_title": "Developmental Biology",
    "hierarchy_title": "Developmental Biology || Development and Evolution || Functional Homology in Developmental Genetics",
    "tokenized_text": [
        "development",
        "evolution",
        "functional",
        "homology",
        "developmental",
        "genetics",
        "functional",
        "homology",
        "developmental",
        "genetics",
        "conserved",
        "role",
        "hox",
        "gene",
        "axial",
        "patterning",
        "referred",
        "functionally",
        "homologous",
        "across",
        "animal",
        "manak",
        "scott",
        "relation",
        "structural",
        "homology",
        "obtains",
        "dna",
        "sequence",
        "yet",
        "functional",
        "homology",
        "contradiction",
        "term",
        "abouheif",
        "et",
        "al",
        "definition",
        "homologue",
        "organ",
        "different",
        "animal",
        "every",
        "variety",
        "form",
        "function",
        "owen",
        "the",
        "descendant",
        "evolutionary",
        "distinction",
        "homology",
        "structure",
        "analogy",
        "function",
        "founded",
        "recognition",
        "therefore",
        "idea",
        "functional",
        "homology",
        "appears",
        "theoretically",
        "confused",
        "conceptual",
        "tension",
        "use",
        "molecular",
        "developmental",
        "biologist",
        "figure",
        "vertebrate",
        "wing",
        "homologous",
        "forelimb",
        "derived",
        "common",
        "descent",
        "structure",
        "function",
        "vertebrate",
        "wing",
        "ie",
        "flight",
        "analogous",
        "although",
        "wing",
        "fulfill",
        "similar",
        "function",
        "role",
        "flight",
        "evolved",
        "separately",
        "reference",
        "organ",
        "owen",
        "definition",
        "indicative",
        "structure",
        "entity",
        "found",
        "organism",
        "may",
        "vary",
        "shape",
        "composition",
        "form",
        "function",
        "specie",
        "occurs",
        "translated",
        "evolutionary",
        "context",
        "sameness",
        "cashed",
        "reference",
        "common",
        "ancestry",
        "since",
        "structure",
        "also",
        "similar",
        "virtue",
        "natural",
        "selection",
        "operating",
        "similar",
        "environment",
        "homology",
        "contrasted",
        "analogy",
        "homologous",
        "structure",
        "virtue",
        "descent",
        "common",
        "ancestor",
        "regardless",
        "function",
        "structure",
        "involved",
        "whereas",
        "analogous",
        "structure",
        "similar",
        "virtue",
        "selection",
        "process",
        "favoring",
        "comparable",
        "functional",
        "outcome",
        "regardless",
        "common",
        "descent",
        "figure",
        "make",
        "similarity",
        "function",
        "especially",
        "problematic",
        "criterion",
        "homology",
        "abouheif",
        "et",
        "al",
        "functional",
        "similarity",
        "appropriate",
        "relation",
        "analogy",
        "necessary",
        "analogue",
        "function",
        "consequence",
        "common",
        "ancestrysimilarity",
        "despite",
        "different",
        "origin",
        "suffices",
        "ghiselin",
        "classic",
        "case",
        "analogy",
        "involve",
        "taxon",
        "share",
        "recent",
        "common",
        "ancestor",
        "exhibit",
        "structure",
        "external",
        "body",
        "morphology",
        "dolphin",
        "tuna",
        "pabst",
        "thus",
        "functional",
        "homology",
        "seems",
        "category",
        "error",
        "structure",
        "enter",
        "evaluation",
        "homologue",
        "correspondence",
        "similarity",
        "function",
        "often",
        "result",
        "adaptation",
        "via",
        "natural",
        "selection",
        "common",
        "environmental",
        "demand",
        "common",
        "ancestry",
        "although",
        "might",
        "inclined",
        "simply",
        "prohibit",
        "terminology",
        "functional",
        "homology",
        "widespread",
        "use",
        "molecular",
        "developmental",
        "biology",
        "least",
        "make",
        "u",
        "pause",
        "important",
        "recognize",
        "pervasive",
        "practice",
        "occurrence",
        "may",
        "illicit",
        "swapping",
        "structurally",
        "homologous",
        "gene",
        "specie",
        "rescue",
        "mutant",
        "null",
        "phenotype",
        "genuine",
        "criterion",
        "functional",
        "homology",
        "especially",
        "little",
        "attention",
        "establishing",
        "phylogenetic",
        "context",
        "make",
        "number",
        "claim",
        "functional",
        "homology",
        "suspect",
        "run",
        "afoul",
        "conceptual",
        "tension",
        "explicit",
        "attention",
        "must",
        "given",
        "meaning",
        "function",
        "biological",
        "practice",
        "harbor",
        "least",
        "four",
        "separate",
        "meaning",
        "function",
        "wouters",
        "activity",
        "something",
        "causal",
        "role",
        "contribution",
        "capacity",
        "fitness",
        "advantage",
        "viability",
        "value",
        "something",
        "selected",
        "effect",
        "etiology",
        "origination",
        "maintenance",
        "via",
        "natural",
        "selection",
        "debate",
        "raged",
        "appropriate",
        "different",
        "aspect",
        "biological",
        "psychological",
        "reasoning",
        "general",
        "scope",
        "ie",
        "make",
        "function",
        "concept",
        "see",
        "discussion",
        "garson",
        "issue",
        "whether",
        "identify",
        "legitimate",
        "concept",
        "homology",
        "function",
        "avoid",
        "mixing",
        "homology",
        "analogy",
        "appropriate",
        "notion",
        "function",
        "based",
        "selection",
        "history",
        "allied",
        "concept",
        "analogy",
        "concern",
        "particular",
        "variety",
        "function",
        "similarly",
        "viability",
        "interpretation",
        "concentrate",
        "feature",
        "variety",
        "function",
        "critical",
        "conferred",
        "survival",
        "advantage",
        "interpretation",
        "function",
        "relies",
        "particular",
        "variety",
        "function",
        "selected",
        "confers",
        "viability",
        "clash",
        "demand",
        "homology",
        "concern",
        "something",
        "every",
        "variety",
        "form",
        "function",
        "causal",
        "role",
        "interpretation",
        "emphasizes",
        "systemic",
        "capacity",
        "function",
        "make",
        "contribution",
        "focus",
        "particular",
        "variety",
        "function",
        "though",
        "way",
        "different",
        "either",
        "selected",
        "effect",
        "viability",
        "interpretation",
        "activity",
        "interpretation",
        "something",
        "accent",
        "function",
        "apart",
        "specific",
        "contribution",
        "systemic",
        "capacity",
        "position",
        "larger",
        "context",
        "therefore",
        "appropriate",
        "meaning",
        "incorporate",
        "homology",
        "function",
        "activityfunction",
        "least",
        "possible",
        "activityfunctions",
        "remain",
        "constant",
        "every",
        "variety",
        "evaluation",
        "sameness",
        "due",
        "common",
        "ancestry",
        "made",
        "separately",
        "role",
        "function",
        "play",
        "use",
        "whether",
        "understood",
        "term",
        "causal",
        "role",
        "fitness",
        "advantage",
        "history",
        "selection",
        "activityfunctions",
        "put",
        "different",
        "us",
        "shared",
        "via",
        "common",
        "descent",
        "ie",
        "homologous",
        "precisely",
        "homology",
        "function",
        "defined",
        "activityfunction",
        "different",
        "animal",
        "every",
        "variety",
        "form",
        "usefunction",
        "love",
        "unambiguously",
        "remove",
        "tension",
        "plagued",
        "functional",
        "homology",
        "careful",
        "discussion",
        "regulatory",
        "gene",
        "function",
        "development",
        "evolution",
        "recognize",
        "something",
        "akin",
        "distinction",
        "activity",
        "usefunction",
        "ie",
        "gene",
        "process",
        "within",
        "organism",
        "studying",
        "molecular",
        "evolution",
        "regulatory",
        "gene",
        "biochemical",
        "developmental",
        "function",
        "must",
        "considered",
        "separately",
        "biochemical",
        "function",
        "pax",
        "eyeless",
        "general",
        "transcription",
        "factor",
        "bind",
        "activate",
        "downstream",
        "gene",
        "developmental",
        "function",
        "specific",
        "involvement",
        "eye",
        "morphogenesis",
        "abouheif",
        "biochemical",
        "function",
        "activityfunction",
        "developmental",
        "function",
        "usefunction",
        "distinction",
        "help",
        "discriminate",
        "divergent",
        "evolutionary",
        "trajectory",
        "biochemical",
        "activityfunctions",
        "gene",
        "often",
        "conserved",
        "ie",
        "homologous",
        "simultaneously",
        "available",
        "cooption",
        "make",
        "causal",
        "role",
        "contribution",
        "usefunctions",
        "distinct",
        "developmental",
        "process",
        "regulatory",
        "gene",
        "evolutionarily",
        "stable",
        "term",
        "activityfunction",
        "evolutionarily",
        "labile",
        "term",
        "usefunction",
        "implication",
        "claim",
        "usefunction",
        "homology",
        "gene",
        "qua",
        "developmental",
        "function",
        "suspect",
        "compared",
        "concerning",
        "activityfunction",
        "homology",
        "gene",
        "qua",
        "biochemical",
        "function",
        "developmental",
        "function",
        "likely",
        "changed",
        "phylogenetic",
        "distance",
        "increase",
        "distinction",
        "biochemical",
        "activity",
        "function",
        "developmental",
        "use",
        "function",
        "reinforced",
        "hierarchical",
        "aspect",
        "homology",
        "hall",
        "capacity",
        "defining",
        "usefunction",
        "regulatory",
        "gene",
        "one",
        "level",
        "organization",
        "axial",
        "patterning",
        "must",
        "considered",
        "activityfunction",
        "another",
        "level",
        "organization",
        "differentiation",
        "serially",
        "repeated",
        "element",
        "along",
        "body",
        "axis",
        "note",
        "level",
        "organization",
        "need",
        "compositional",
        "thus",
        "language",
        "higher",
        "lower",
        "level",
        "may",
        "inappropriate",
        "developmental",
        "role",
        "hox",
        "gene",
        "axial",
        "patterning",
        "may",
        "conserved",
        "virtue",
        "biochemical",
        "activityfunction",
        "homology",
        "hox",
        "gene",
        "usefunction",
        "homologues",
        "developmental",
        "role",
        "instead",
        "focusing",
        "activity",
        "gene",
        "component",
        "causal",
        "role",
        "axial",
        "patterning",
        "shift",
        "activity",
        "axial",
        "patterning",
        "causal",
        "role",
        "elsewhere",
        "elsewhen",
        "embryonic",
        "development",
        "introducing",
        "conceptually",
        "legitimate",
        "idea",
        "homology",
        "activityfunction",
        "keeping",
        "idea",
        "developmental",
        "biology",
        "tidy",
        "assist",
        "interpretation",
        "evidence",
        "circumscribes",
        "inference",
        "drawn",
        "example",
        "nk",
        "gene",
        "involved",
        "mesoderm",
        "specification",
        "underlies",
        "muscle",
        "morphogenesis",
        "drosophila",
        "expression",
        "particular",
        "nk",
        "gene",
        "tinman",
        "critical",
        "cardiac",
        "visceral",
        "mesoderm",
        "development",
        "tinman",
        "knocked",
        "transgenically",
        "replaced",
        "vertebrate",
        "orthologue",
        "nkx",
        "visceral",
        "mesoderm",
        "specification",
        "rescued",
        "regulation",
        "cardiac",
        "mesoderm",
        "ranganayakulu",
        "et",
        "al",
        "region",
        "vertebrate",
        "protein",
        "near",
        "end",
        "polypeptide",
        "differs",
        "enough",
        "prevent",
        "appropriate",
        "regulation",
        "cardiac",
        "morphogenesis",
        "homeodomains",
        "stretch",
        "sequence",
        "confer",
        "dna",
        "binding",
        "vertebrate",
        "nkx",
        "drosophila",
        "tinman",
        "interchangeable",
        "inability",
        "nkx",
        "rescue",
        "cardiac",
        "mesoderm",
        "specification",
        "related",
        "activityfunction",
        "differential",
        "dna",
        "binding",
        "one",
        "component",
        "orthologous",
        "homologous",
        "protein",
        "specie",
        "retains",
        "activityfunction",
        "homology",
        "related",
        "visceral",
        "mesoderm",
        "specification",
        "another",
        "component",
        "homeodomain",
        "diverged",
        "homeobox",
        "gene",
        "single",
        "usefunction",
        "expected",
        "also",
        "single",
        "activityfunction",
        "adequate",
        "evaluation",
        "case",
        "must",
        "recognize",
        "finegrained",
        "decomposition",
        "gene",
        "working",
        "unit",
        "capture",
        "genuine",
        "activityfunction",
        "conservation",
        "link",
        "activityfunction",
        "homologues",
        "directly",
        "structural",
        "motif",
        "within",
        "gene",
        "necessarily",
        "single",
        "activityfunction",
        "entire",
        "open",
        "reading",
        "frame",
        "defusing",
        "conceptual",
        "tension",
        "developmental",
        "evolutionary",
        "biology",
        "respect",
        "homology",
        "function",
        "direct",
        "impact",
        "causal",
        "generalization",
        "inference",
        "made",
        "model",
        "organism",
        "section",
        "activityfunction",
        "homology",
        "directs",
        "attention",
        "stability",
        "conservation",
        "activity",
        "conservation",
        "indicative",
        "study",
        "mechanism",
        "model",
        "organism",
        "produce",
        "robust",
        "stable",
        "generalization",
        "section",
        "widespread",
        "use",
        "functional",
        "homology",
        "developmental",
        "biology",
        "aimed",
        "exactly",
        "kind",
        "question",
        "explains",
        "persistence",
        "experimental",
        "biology",
        "despite",
        "conceptual",
        "ambiguity",
        "generalization",
        "concerning",
        "molecular",
        "signaling",
        "cascade",
        "underwritten",
        "coordinated",
        "biochemical",
        "activity",
        "view",
        "developmental",
        "role",
        "though",
        "sometimes",
        "may",
        "coincide",
        "thus",
        "activityfunction",
        "detail",
        "signaling",
        "cascade",
        "gleaned",
        "model",
        "organism",
        "generalized",
        "via",
        "homology",
        "unstudied",
        "organism",
        "even",
        "developmental",
        "role",
        "varies",
        "activityfunction",
        "specie"
    ]
}