{
    "main_text": "Divine Prescience, Contingency and Eternity\n6. Divine Prescience, Contingency and Eternity\n\nIn V.3, however, the character Boethius puts forward an argument,\nbased on God’s foreknowledge of future events, which threatens\nto show that even mental acts of willing are necessary and so (as\nBoethius the author believed) unfree. He argues that:\n\n[7] If God foresees all things and cannot be mistaken in any way, what\nprovidence has foreseen will be, will necessarily happen. [8] So, if\nGod foreknows from eternity not just what humans will do but also\ntheir plans and volitions, there will be no freedom of choice, for\nthere will not be able to be any deed, or any sort of volition that\ninfallible divine providence has not foreseen. For if volitions are\ncapable of turning out differently from how they have been foreseen,\nthen there will not be firm foreknowlede of the future, but rather\nuncertain opinion, and I judge it wicked to believe that about God.\n\n\nSince it is accepted that God is omniscient, and that this implies\nthat he knows what every future event—including mental\nevents such as volitions—will be, (7) and (8) each seem to rule\nout any sort of freedom of the will requisite for attributing moral\nresponsibility: a consequence the disastrous implications of which\nBoethius the character vividly describes.\n\nPhilosophy’s answer to this difficulty is the most\nphilosophically intricate and interesting section of the\nConsolation. It is one part of Boethius’s work (perhaps\nthe only one) which remains of interest in contemporary philosophy (of\nreligion) and, for that reason, it has often been interpreted\naccording to a framework provided by more recent thinking about the\nproblem of divine prescience (see, for example, Leftow 1991, Zagzebski\n1991). The following is, rather, an attempt to present the discussion\nas it actually proceeds in the Consolation.\n\nThe first point which needs to be settled is what, precisely, is the\nproblem which Boethius the character proposes? One way of reading this\ndiscussion is that the argument here is in fact fallacious. According\nto this interpretation, the reasoning behind (7) seems to be of the\nfollowing form:\n\nGod knows every event, including all future ones.\nWhen someone knows that an event will happen, then the\nevent will happen.\n(10) is true as a matter of necessity, because it is impossible to\nknow that which is not the case.\nIf someone knows an event will happen, it will happen necessarily.\n(10, 11)\nEvery event, including future ones, happens necessarily. (9,\n12)\n\n\nThe pattern behind (8) will be similar, but in reverse: from a\nnegation of (13), the negation of (9) will be seen to follow. But, as\nit is easy to observe, (9–13) is a fallacious argument: (10) and\n(11) imply, not (12), but\n\nNecessarily, if someone knows an event will happen, it will\nhappen.\n\n\nThe fallacy in question concerns the scope of the necessity operator.\nBoethius, the claim would be, has mistakenly inferred the\n(narrow-scope) necessity of the consequent (‘the event will\nhappen’), when he is entitled only to infer the (wide-scope)\nnecessity of the whole conditional (‘if someone knows an event\nwill happen, it will happen’). Boethius the character is clearly\ntaken in by this fallacious argument, and there is no good reason to\nthink that Boethius the author ever became aware of the fallacy\n(despite a passage later on which some modern commentators have\ninterpreted in this sense). None the less, the discussion which\nfollows does not, as the danger seems to be, address itself to a\nnon-problem. Intuitively, Boethius sees that the threat which divine\nprescience poses to the contingency of future events arises not just\nfrom the claim that God’s beliefs about the future constitute\nknowledge, but also from the fact that they are beliefs about\nthe future. There is a real problem here, because if God\nknows now what I shall do tomorrow, then it seems that either what I\nshall do is already determined, or else that I shall have the power\ntomorrow to convert God’s knowledge today into a false belief.\nAlthough his logical formulation does not capture this problem, the\nsolution Boethius gives to Philosophy is clearly designed to tackle\nit.\n\nIt is also possible to read the way that the question is posed by\nBoethius the character as not involving a fallacy (Marenbon 2013).\nBoethius the character is, on this reading, putting forward a sort of\ntranscendental argument. Boethius considers that when a knower knows a\nfuture event, as opposed to merely having opinion about it, the knower\nis judging that the event is fixed, since if it were an event that\ncould be otherwise, it could be the object of opinion but not\nknowledge. If future events could be otherwise, then God, in knowing\nthem, would in fact be holding a false belief, since he would be\njudging that they could not be otherwise. But God has no false\nbeliefs, and so the world must be such that his beliefs about future\nevents are not false, and so all future events must be fixed.\n\nPhilosophy identifies (V.4) the character Boethius’s central\ndifficulty as lying in the apparent incompatibility between an\nevent’s not having a necessary outcome and yet its being\nforeknown. To foresee something ‘as if it were certain’\nwhen it is uncertain how it will turn out is ‘foreign to the\nintegrity of knowledge’, since it involves ‘judging a\nthing as being other than it is.’ Philosophy counters these\ndoubts with the principle that ‘everything that is known is\ngrasped, not according to its own power, but rather according to the\ncapacity of those who know it.’ Her view, as she develops it (in\nV.5 and V.6), is based on what might be called the Principle of Modes\nof Cognition: the idea that knowledge is always relativized to\ndifferent levels of knowers, who have different sorts of objects of\nknowledge. This relativization is, however, limited. The same item is\nnot true for one knower and false for another, but the way in which a\ngiven item is known differs according to the powers of the knower.\nPhilosophy develops this scheme in relation to the different levels of\nthe soul (intelligence, reason, imagination and the senses) and their\ndifferent objects (pure Form, abstract universals, images, particular\nbodily things).\n\nPhilosophy does not at this point follow the most obvious path that\nthe Modes of Cognition Principle would suggest and declare that it\njust depends on the knower whether something is known as certain or\nnot. Perhaps she accepted that there is something intrinsically\nuncertain about future contingents, whoever it is that knows them.\nRather, she reaches her conclusion through a more complex twist of the\nargument. Philosophy argues that the temporal relation of the thing\nknown to the knower—whether it is known as a past, present or\nfuture event—depends on the nature and cognitive power of the\nknower. God’s way of being and knowing, she argues, is eternal,\nand divine eternity, she says, is not the same as just lacking a\nbeginning and end, but it is rather (V.6) ‘the whole,\nsimultaneous and perfect possession of unbounded life.’\n\nA being who is eternal in this way, Philosophy argues, knows all\nthings—past, present and future—in the same way as we, who\nlive in time and not eternity, know what is present. Since, therefore,\ncontingent events that are future to us are present in relation to\nGod, there is no reason why God should not know them as certain. But,\nif they can be known as certain, are they really contingent? The last\npart of Philosophy’s argument deals with this problem by\naccepting that, as known by God in his eternal present, events are not\ncontingent, but necessary in a special way that does not involve any\nconstraint or limitation of freedom. There are, she explains, two\nsorts of necessity: simple and conditional. Simple necessities are\nwhat would now be called physical or nomic necessities: that the sun\nrises, or that a man will sometime die. By contrast, it is\nconditionally necessary that, for instance, I am walking,\nwhen I am walking (or when someone sees that I am walking);\nbut from this conditional necessity it does not follow that it is\nsimply necessary that I am walking. Although a number of modern\ncommentators interpret this passage as Philosophy’s way of\nnoticing the scope-distinction fallacy in the original way Boethius\nthe character presents the problem, she really seems to be making a\nrather different point. On an Aristotelian understanding of modality,\nwhich Boethius the author accepted, the present is necessary:\n‘what is, necessarily is, when it is’ (On\nInterpretation 19a23). Philosophy is arguing that, since God\nknows all things as if they were present, future events are necessary,\nin relation to their being known by God, in just the way that anything\nwhich is presently the case is necessary. And this necessity of the\npresent is an unconstraining necessity—those who accepted\nAristotelian modalities did not think that because, when I am sitting,\nI am sitting necessarily, my freedom to stand has been at all\ncurtailed. Indeed, as Philosophy stresses, in themselves the future\nevents remain completely free. Philosophy is thus able to explain how,\nas known by God, future contingent events have the certainty which\nmake them proper objects of knowledge, rather than opinion, whilst\nnevertheless retaining their indeterminacy.\n\nIt is important to add, however, that most contemporary interpreters\ndo not read the argument of V.3–6 in quite this way. (For a\nbalanced assessment of various interpretations, including the one\noffered here, see Sharples 2009; and for a powerful critique of\naspects of the view presented here, see Michon 2015). They hold that\nPhilosophy is arguing that God is atemporal, so eliminating the\nproblems about determinism, which arise when God’s knowing\nfuture contingents is seen an event in the past, and therefore,\nfixed.\n\nHowever it is interpreted, Philosophy’s argument takes a\nsurprising turn at the very end of the book. When he gave his initial\nstatement of the problem, Boethius the character had distinguished the\nproblem at issue—that of divine prescience—from that of\ndivine predetermination. He had explained (V.3) that, for the purposes\nof their discussion, he was assuming that God does not cause the\nevents he foreknows: he knows them because they happen, rather than\ntheir happening because he foreknows them. He added, though, in\npassing, that he did not really accept this view: it is ‘back to\nfront’ to think that ‘the outcome of things in time should\nbe the cause of eternal prescience.’ Philosophy now returns to\nthis point, conceding that God’s act of knowing ‘sets the\nmeasure for all things and owes nothing to things which follow on from\nit.’ Although Philosophy considers that she has successfully\nresolved the character Boethius’s problems, the reader is left\nasking whether this final concession, which makes God the determiner\nof all events, does not ruin the elaborate defence of the contingency\nof human volitions she has just been mounting.\n",
    "section_title": "6. Divine Prescience, Contingency and Eternity",
    "entry_title": "Anicius Manlius Severinus Boethius",
    "hierarchy_title": "Anicius Manlius Severinus Boethius || Divine Prescience, Contingency and Eternity",
    "tokenized_text": [
        "divine",
        "prescience",
        "contingency",
        "eternity",
        "divine",
        "prescience",
        "contingency",
        "eternity",
        "v",
        "however",
        "character",
        "boethius",
        "put",
        "forward",
        "argument",
        "based",
        "god",
        "foreknowledge",
        "future",
        "event",
        "threatens",
        "show",
        "even",
        "mental",
        "act",
        "willing",
        "necessary",
        "boethius",
        "author",
        "believed",
        "unfree",
        "argues",
        "god",
        "foresees",
        "thing",
        "mistaken",
        "way",
        "providence",
        "foreseen",
        "necessarily",
        "happen",
        "god",
        "foreknows",
        "eternity",
        "human",
        "also",
        "plan",
        "volition",
        "freedom",
        "choice",
        "able",
        "deed",
        "sort",
        "volition",
        "infallible",
        "divine",
        "providence",
        "foreseen",
        "volition",
        "capable",
        "turning",
        "differently",
        "foreseen",
        "firm",
        "foreknowlede",
        "future",
        "rather",
        "uncertain",
        "opinion",
        "judge",
        "wicked",
        "believe",
        "god",
        "since",
        "accepted",
        "god",
        "omniscient",
        "implies",
        "know",
        "every",
        "future",
        "eventincluding",
        "mental",
        "event",
        "volitionswill",
        "seem",
        "rule",
        "sort",
        "freedom",
        "requisite",
        "attributing",
        "moral",
        "responsibility",
        "consequence",
        "disastrous",
        "implication",
        "boethius",
        "character",
        "vividly",
        "describes",
        "philosophy",
        "answer",
        "difficulty",
        "philosophically",
        "intricate",
        "interesting",
        "section",
        "consolation",
        "one",
        "part",
        "boethius",
        "work",
        "perhaps",
        "one",
        "remains",
        "interest",
        "contemporary",
        "philosophy",
        "religion",
        "reason",
        "often",
        "interpreted",
        "according",
        "framework",
        "provided",
        "recent",
        "thinking",
        "problem",
        "divine",
        "prescience",
        "see",
        "example",
        "leftow",
        "zagzebski",
        "following",
        "rather",
        "attempt",
        "present",
        "discussion",
        "actually",
        "proceeds",
        "consolation",
        "first",
        "point",
        "need",
        "settled",
        "precisely",
        "problem",
        "boethius",
        "character",
        "proposes",
        "one",
        "way",
        "reading",
        "discussion",
        "argument",
        "fact",
        "fallacious",
        "according",
        "interpretation",
        "reasoning",
        "behind",
        "seems",
        "following",
        "form",
        "god",
        "know",
        "every",
        "event",
        "including",
        "future",
        "one",
        "someone",
        "know",
        "event",
        "happen",
        "event",
        "happen",
        "true",
        "matter",
        "necessity",
        "impossible",
        "know",
        "case",
        "someone",
        "know",
        "event",
        "happen",
        "happen",
        "necessarily",
        "every",
        "event",
        "including",
        "future",
        "one",
        "happens",
        "necessarily",
        "pattern",
        "behind",
        "similar",
        "reverse",
        "negation",
        "negation",
        "seen",
        "follow",
        "easy",
        "observe",
        "fallacious",
        "argument",
        "imply",
        "necessarily",
        "someone",
        "know",
        "event",
        "happen",
        "happen",
        "fallacy",
        "question",
        "concern",
        "scope",
        "necessity",
        "operator",
        "boethius",
        "claim",
        "would",
        "mistakenly",
        "inferred",
        "narrowscope",
        "necessity",
        "consequent",
        "event",
        "happen",
        "entitled",
        "infer",
        "widescope",
        "necessity",
        "whole",
        "conditional",
        "someone",
        "know",
        "event",
        "happen",
        "happen",
        "boethius",
        "character",
        "clearly",
        "taken",
        "fallacious",
        "argument",
        "good",
        "reason",
        "think",
        "boethius",
        "author",
        "ever",
        "became",
        "aware",
        "fallacy",
        "despite",
        "passage",
        "later",
        "modern",
        "commentator",
        "interpreted",
        "sense",
        "none",
        "le",
        "discussion",
        "follows",
        "danger",
        "seems",
        "address",
        "nonproblem",
        "intuitively",
        "boethius",
        "see",
        "threat",
        "divine",
        "prescience",
        "pose",
        "contingency",
        "future",
        "event",
        "arises",
        "claim",
        "god",
        "belief",
        "future",
        "constitute",
        "knowledge",
        "also",
        "fact",
        "belief",
        "future",
        "real",
        "problem",
        "god",
        "know",
        "shall",
        "tomorrow",
        "seems",
        "either",
        "shall",
        "already",
        "determined",
        "else",
        "shall",
        "power",
        "tomorrow",
        "convert",
        "god",
        "knowledge",
        "today",
        "false",
        "belief",
        "although",
        "logical",
        "formulation",
        "capture",
        "problem",
        "solution",
        "boethius",
        "give",
        "philosophy",
        "clearly",
        "designed",
        "tackle",
        "also",
        "possible",
        "read",
        "way",
        "question",
        "posed",
        "boethius",
        "character",
        "involving",
        "fallacy",
        "marenbon",
        "boethius",
        "character",
        "reading",
        "putting",
        "forward",
        "sort",
        "transcendental",
        "argument",
        "boethius",
        "considers",
        "knower",
        "know",
        "future",
        "event",
        "opposed",
        "merely",
        "opinion",
        "knower",
        "judging",
        "event",
        "fixed",
        "since",
        "event",
        "could",
        "otherwise",
        "could",
        "object",
        "opinion",
        "knowledge",
        "future",
        "event",
        "could",
        "otherwise",
        "god",
        "knowing",
        "would",
        "fact",
        "holding",
        "false",
        "belief",
        "since",
        "would",
        "judging",
        "could",
        "otherwise",
        "god",
        "false",
        "belief",
        "world",
        "must",
        "belief",
        "future",
        "event",
        "false",
        "future",
        "event",
        "must",
        "fixed",
        "philosophy",
        "identifies",
        "v",
        "character",
        "boethius",
        "central",
        "difficulty",
        "lying",
        "apparent",
        "incompatibility",
        "event",
        "necessary",
        "outcome",
        "yet",
        "foreknown",
        "foresee",
        "something",
        "certain",
        "uncertain",
        "turn",
        "foreign",
        "integrity",
        "knowledge",
        "since",
        "involves",
        "judging",
        "thing",
        "is",
        "philosophy",
        "counter",
        "doubt",
        "principle",
        "everything",
        "known",
        "grasped",
        "according",
        "power",
        "rather",
        "according",
        "capacity",
        "know",
        "it",
        "view",
        "develops",
        "v",
        "v",
        "based",
        "might",
        "called",
        "principle",
        "mode",
        "cognition",
        "idea",
        "knowledge",
        "always",
        "relativized",
        "different",
        "level",
        "knower",
        "different",
        "sort",
        "object",
        "knowledge",
        "relativization",
        "however",
        "limited",
        "item",
        "true",
        "one",
        "knower",
        "false",
        "another",
        "way",
        "given",
        "item",
        "known",
        "differs",
        "according",
        "power",
        "knower",
        "philosophy",
        "develops",
        "scheme",
        "relation",
        "different",
        "level",
        "soul",
        "intelligence",
        "reason",
        "imagination",
        "sens",
        "different",
        "object",
        "pure",
        "form",
        "abstract",
        "universal",
        "image",
        "particular",
        "bodily",
        "thing",
        "philosophy",
        "point",
        "follow",
        "obvious",
        "path",
        "mode",
        "cognition",
        "principle",
        "would",
        "suggest",
        "declare",
        "depends",
        "knower",
        "whether",
        "something",
        "known",
        "certain",
        "perhaps",
        "accepted",
        "something",
        "intrinsically",
        "uncertain",
        "future",
        "contingent",
        "whoever",
        "know",
        "rather",
        "reach",
        "conclusion",
        "complex",
        "twist",
        "argument",
        "philosophy",
        "argues",
        "temporal",
        "relation",
        "thing",
        "known",
        "knowerwhether",
        "known",
        "past",
        "present",
        "future",
        "eventdepends",
        "nature",
        "cognitive",
        "power",
        "knower",
        "god",
        "way",
        "knowing",
        "argues",
        "eternal",
        "divine",
        "eternity",
        "say",
        "lacking",
        "beginning",
        "end",
        "rather",
        "v",
        "whole",
        "simultaneous",
        "perfect",
        "possession",
        "unbounded",
        "life",
        "eternal",
        "way",
        "philosophy",
        "argues",
        "know",
        "thingspast",
        "present",
        "futurein",
        "way",
        "live",
        "time",
        "eternity",
        "know",
        "present",
        "since",
        "therefore",
        "contingent",
        "event",
        "future",
        "u",
        "present",
        "relation",
        "god",
        "reason",
        "god",
        "know",
        "certain",
        "known",
        "certain",
        "really",
        "contingent",
        "last",
        "part",
        "philosophy",
        "argument",
        "deal",
        "problem",
        "accepting",
        "known",
        "god",
        "eternal",
        "present",
        "event",
        "contingent",
        "necessary",
        "special",
        "way",
        "involve",
        "constraint",
        "limitation",
        "freedom",
        "explains",
        "two",
        "sort",
        "necessity",
        "simple",
        "conditional",
        "simple",
        "necessity",
        "would",
        "called",
        "physical",
        "nomic",
        "necessity",
        "sun",
        "rise",
        "man",
        "sometime",
        "die",
        "contrast",
        "conditionally",
        "necessary",
        "instance",
        "walking",
        "walking",
        "someone",
        "see",
        "walking",
        "conditional",
        "necessity",
        "follow",
        "simply",
        "necessary",
        "walking",
        "although",
        "number",
        "modern",
        "commentator",
        "interpret",
        "passage",
        "philosophy",
        "way",
        "noticing",
        "scopedistinction",
        "fallacy",
        "original",
        "way",
        "boethius",
        "character",
        "present",
        "problem",
        "really",
        "seems",
        "making",
        "rather",
        "different",
        "point",
        "aristotelian",
        "understanding",
        "modality",
        "boethius",
        "author",
        "accepted",
        "present",
        "necessary",
        "necessarily",
        "interpretation",
        "a",
        "philosophy",
        "arguing",
        "since",
        "god",
        "know",
        "thing",
        "present",
        "future",
        "event",
        "necessary",
        "relation",
        "known",
        "god",
        "way",
        "anything",
        "presently",
        "case",
        "necessary",
        "necessity",
        "present",
        "unconstraining",
        "necessitythose",
        "accepted",
        "aristotelian",
        "modality",
        "think",
        "sitting",
        "sitting",
        "necessarily",
        "freedom",
        "stand",
        "curtailed",
        "indeed",
        "philosophy",
        "stress",
        "future",
        "event",
        "remain",
        "completely",
        "free",
        "philosophy",
        "thus",
        "able",
        "explain",
        "known",
        "god",
        "future",
        "contingent",
        "event",
        "certainty",
        "make",
        "proper",
        "object",
        "knowledge",
        "rather",
        "opinion",
        "whilst",
        "nevertheless",
        "retaining",
        "indeterminacy",
        "important",
        "add",
        "however",
        "contemporary",
        "interpreter",
        "read",
        "argument",
        "v",
        "quite",
        "way",
        "balanced",
        "assessment",
        "various",
        "interpretation",
        "including",
        "one",
        "offered",
        "see",
        "sharples",
        "powerful",
        "critique",
        "aspect",
        "view",
        "presented",
        "see",
        "michon",
        "hold",
        "philosophy",
        "arguing",
        "god",
        "atemporal",
        "eliminating",
        "problem",
        "determinism",
        "arise",
        "god",
        "knowing",
        "future",
        "contingent",
        "seen",
        "event",
        "past",
        "therefore",
        "fixed",
        "however",
        "interpreted",
        "philosophy",
        "argument",
        "take",
        "surprising",
        "turn",
        "end",
        "book",
        "gave",
        "initial",
        "statement",
        "problem",
        "boethius",
        "character",
        "distinguished",
        "problem",
        "issuethat",
        "divine",
        "presciencefrom",
        "divine",
        "predetermination",
        "explained",
        "v",
        "purpose",
        "discussion",
        "assuming",
        "god",
        "cause",
        "event",
        "foreknows",
        "know",
        "happen",
        "rather",
        "happening",
        "foreknows",
        "added",
        "though",
        "passing",
        "really",
        "accept",
        "view",
        "back",
        "front",
        "think",
        "outcome",
        "thing",
        "time",
        "cause",
        "eternal",
        "prescience",
        "philosophy",
        "return",
        "point",
        "conceding",
        "god",
        "act",
        "knowing",
        "set",
        "measure",
        "thing",
        "owes",
        "nothing",
        "thing",
        "follow",
        "it",
        "although",
        "philosophy",
        "considers",
        "successfully",
        "resolved",
        "character",
        "boethius",
        "problem",
        "reader",
        "left",
        "asking",
        "whether",
        "final",
        "concession",
        "make",
        "god",
        "determiner",
        "event",
        "ruin",
        "elaborate",
        "defence",
        "contingency",
        "human",
        "volition",
        "mounting"
    ]
}