{
    "main_text": "Bohr’s Writings on the Correspondence Principle (1918–1928)\n3. Bohr’s Writings on the Correspondence Principle (1918–1928)\n\nMost of Bohr’s writings on the correspondence principle are\ncollected in Volume 3 of Niels Bohr Collected Works\n(abbreviated here BCW), which is titled The Correspondence\nPrinciple (1918–1923). As Bohr himself reports (Bohr 1922),\nthe first germ of the correspondence principle can be found in his\n1913 lecture “On the constitution of molecules and atoms,”\nalthough the term does not appear in his writings until 1920. In the\nyears before Bohr adopted the expression “correspondence\nprinciple,” he described the relation as an analogy between\nclassical and quantum mechanics. For example, in his 1918 paper\n“On the Quantum Theory of Line Spectra.” (which he refers\nto as “Q.o.L.”) Bohr writes, “It seems possible to\nthrow some light on the outstanding difficulties by trying to trace\nthe analogy between the quantum theory and the ordinary theory of\nradiation as closely as possible” (Bohr 1918, p. 4; BCW 3, p.\n70). In his later writings, however, Bohr explicitly rejects this view\nthat the correspondence principle can be thought of as an analogy. He\nwrites,\n\nIn Q.o.L [Bohr 1918] this designation has not yet been used, but the\nsubstance of the principle is referred to there as a formal analogy\nbetween the quantum theory and the classical theory. Such expressions\nmight cause misunderstanding, since in fact—as we shall see\nlater on—this Correspondence Principle must be regarded purely\nas a law of the quantum theory, which can in no way diminish the\ncontrast between the postulates and electrodynamic theory. (Bohr\n[1923] 1924, fn. p. 22)\n\n\nNot only does Bohr reject the view that the correspondence principle\nis an analogy, but the fact that he refers to it as a law of\nquantum theory suggests, first, that he takes it to be a\nuniversal principle (not just applicable in a limited\ndomain), and, second, that it is an essential part of quantum theory\nitself, not some sort of general methodological constraint coming from\noutside of quantum theory.\n\nIn his 1920 paper where the terms “correspondence” and\n“correspondence principle” first appear (Nielsen 1976, p.\n21), Bohr writes,\n\n[A]lthough the process of radiation can not be described on the basis\nof the ordinary theory of electrodynamics, according to which the\nnature of the radiation emitted by an atom is directly related to the\nharmonic components occurring in the motion of the system, there is\nfound, nevertheless, to exist a far-reaching correspondence\nbetween the various types of possible transitions between the\nstationary states on the one hand and the various harmonic components\nof the motion on the other hand. This correspondence is of such a\nnature, that the present theory of spectra is in a certain sense to be\nregarded as a rational generalization of the ordinary theory of\nradiation. (Bohr 1920, pp. 23–24; BCW 3, pp. 245–246)\n\n\nThe correspondence Bohr describes here is between allowed transitions\nfrom one stationary state to another and the harmonic components of\nthe classical motion. Moreover, he takes this correspondence to be the\nground or justification for the view that quantum theory is a rational\ngeneralization of classical mechanics (for a discussion of this latter\nview see Bokulich and Bokulich 2005). A few pages later, in a section\ntitled “The Correspondence Principle,” Bohr goes on to\ndescribe both the frequency correspondence and the intensity\ncorrespondence:\n\nThis correspondence between frequencies determined by the two methods\nmust have a deeper significance and we are led to anticipate that it\nwill also apply to the intensities. This is equivalent to the\nstatement that, when the quantum numbers are large, the relative\nprobability of a particular transition is connected in a simple manner\nwith the amplitude of the corresponding harmonic component in the\nmotion. This peculiar relation suggests a general law for the\noccurrence of transitions between stationary states. Thus we\nshall assume that even when the quantum numbers are small the\npossibility of transition between two stationary states is connected\nwith the presence of a certain harmonic component in the motion of the\nsystem. (Bohr 1920, pp. 27–28; BCW 3, pp. 249–250)\n\n\nIn typical Bohr style, he fails to come out and clearly say whether\none, all, or none of these correspondences is what he means to\ndesignate by “the correspondence principle.”\n\nBohr also argues that the correspondence principle is something which\nexplains why only certain spectral lines are observed in experiments.\nHe writes,\n\nThe above view, which may be termed the correspondence principle\n… has offered an immediate interpretation of the apparent\ncapriciousness, involved in the application of the principle of\ncombination of spectral lines, which consists in the circumstance,\nthat only a small part of the spectral lines, which might be\nanticipated from an unrestricted application of this [Rydberg-Ritz\ncombination] principle, are actually observed in the experiments.\n(Bohr 1921b unpublished; BCW 4, p. 150)\n\n\nBokulich (2008, and 2009 [Other Internet Resources]) has argued that\ninterpreting the correspondence principle in terms of the selection\nrule not only illuminates Bohr’s claim that it explains the\ncapriciousness of the spectral lines, but also his claim that the\ncorrespondence principle is a law of quantum theory. Indeed, the\ncorrespondence that he refers to as a “law” is the\nselection rule correspondence, which holds also for small quantum\nnumbers, not just in the classical limit. It is a law because\nit is a universal (i.e., applying to all \\(n)\\) restriction on\nthe allowed quantum transitions. To understand why it is a law of\nquantum theory (as opposed to a law of classical electrodynamics)\nit is helpful to consider Bohr’s following remarks:\n\n[T]he occurrence of radiative transitions is conditioned by the\npresence of the corresponding vibrations in the motion of the atom. As\nto our right to regard the asymptotic relation obtained as the\nintimation of a general law of the quantum theory for the occurrence\nof radiation, as it is assumed to be in the Correspondence Principle\nmentioned above, let it be once more recalled that in the limiting\nregion of large quantum numbers there is no wise a question of a\ngradual diminution of the difference between the description by the\nquantum theory of the phenomena of radiation and the ideas of\nclassical electrodynamics, but only an asymptotic agreement of the\nstatistical results. (Bohr [1923] 1924, p. 23; BCW 3, p. 480)\n\n\nIn this passage it is clear that Bohr takes quantum mechanics to be a\nuniversal theory. Despite the statistical agreement of results in this\nlimit, the physics of the frequencies and intensities, for example,\nremains different, and Bohr is insistent that it is the quantum\naccount that is the strictly correct one—even in this high\n\\(n\\) or “classical” limit. Hence, when Bohr\ndiscovered that the allowable quantum transitions are those for which\nthere is a corresponding harmonic in the classical motion, what he had\ndiscovered was something about quantum theory.\n\nIn his 1922 lectures on atomic theory in Göttingen, Bohr again\nemphasizes that the correspondence principle holds even for low\nquantum number transitions. This can particularly be seen in his\ndiscussion of the well-known red and green spectral lines of the\nBalmer series in the visible part of the hydrogen spectrum. The red\nspectral line (which really is red at a wavelength of around 656 nm)\nis typically labeled \\(\\rH_{\\alpha}\\), and is the result of\nradiation emitted in the jump from the \\(n = 3\\) to \\(n =\n2\\) stationary state. The green line (labeled \\(\\rH_{\\beta}\\) with a\nwavelength of around 486 nm) is a result of the electron in a hydrogen\natom jumping from the \\(n = 4\\) to \\(n = 2\\) stationary\nstate.\n\n\n\n\nFigure 2.\nRed and green spectral lines of the Balmer series in the visible part\nof the hydrogen atom\n\n\nRegarding these low-quantum-number transitions Bohr writes,\n\nWe may regard \\(\\rH_{\\beta}\\) as the octave of \\(\\rH_{\\alpha}\\),\nsince \\(\\rH_{\\beta}\\) corresponds to a jump of 2 and\n\\(\\rH_{\\alpha}\\) to a quantum jump of 1. It is true that\n\\(\\rH_{\\beta}\\) does not have twice the frequency of\n\\(\\rH_{\\alpha}\\), but it corresponds to the octave. This\nrelationship we call the ‘correspondence principle.’ To\neach transition there corresponds a harmonic component of the\nmechanical motion. (Bohr 1922 unpublished lecture; BCW4, p. 348)\n\n\nIn other words, although the “frequency correspondence”\ndoes not hold for these low quantum numbers (nor can the intensities\nof these lines be calculated directly from the classical amplitudes\nvia the “intensity correspondence”), what Bohr is here\ncalling the more general correspondence principle does hold;\nspecifically, these \\(\\tau = 1\\) and \\(\\tau = 2\\) transitions are allowed\nbecause there is, in the Fourier decomposition of the electron’s\nclassical orbit in the initial stationary state, a first and second\nharmonic component. Such passages are a challenge for those who want\nto interpret the correspondence principle as some sort of asymptotic\nrelation holding in the classical limit.\n\nThere is a remarkable continuity in Bohr’s statements on the\ncorrespondence principle. In 1923 one again finds Bohr emphasizing\nthat the allowed or possible transitions between stationary states are\nconnected to the harmonic components present in the classical\nmotion.\n\n\n[T]he possibility of the occurrence of a transition, accompanied by\nradiation, between two states of a multiply periodic system, of\nquantum numbers for example \\(n_1', \\ldots, n_u'\\) and \\(n_1'',\n\\ldots, n_u''\\), is conditioned by the presence\nof certain harmonic components in the expression given by [the Fourier\nseries expansion of the classical electron motion]. The frequencies\n\\(\\tau_1\\omega_1 + \\ldots + \\tau_u\\omega_u\\) of these\nharmonic components are given by the following equation\n\n\\[\n\\tau_1 = n_1' - n_1'' \\quad\\ldots\\quad \\tau_u = n_u' - n_u''.\n\\]\n\n\nWe, therefore, call these the “corresponding” harmonic\ncomponents in the motion, and the substance of the above statement we\ndesignate as the “Correspondence Principle.” (Bohr [1923]\n1924, p. 22; BCW 3, p. 479)\n\n\nIn 1925 Werner Heisenberg published his famous “Umdeutung”\npaper introducing matrix mechanics (Heisenberg 1925). This would be\nthe beginning of modern quantum mechanics, which replaced the old\nquantum theory. In a supplement to Nature published in\nDecember of 1925, Bohr describes what he takes to be the relationship\nof the new quantum mechanics to his correspondence principle. He\nbegins with a statement of the correspondence principle.\n\nThe demonstration of the asymptotic agreement between spectrum and\nmotion gave rise to the formulation of the “correspondence\nprinciple,” according to which the possibility of every\ntransition process connected with emission of radiation is conditioned\nby the presence of a corresponding harmonic component in the motion of\nthe atom. Not only do the frequencies of the corresponding harmonic\ncomponents agree asymptotically with the values obtained from the\nfrequency condition in the limit where the energies of the stationary\nstates converge, but also the amplitudes of the mechanical oscillatory\ncomponents give in this limit an asymptotic measure for the\nprobabilities of the transition processes on which the intensities of\nthe observable spectral lines depend. (Bohr 1925, pp. 848–849;\nBCW 5, pp. 276–277)\n\n\nIn this quotation Bohr notes all three correspondence relations: the\nselection rule correspondence, the asymptotic frequency\ncorrespondence, and the asymptotic intensity correspondence. Bohr then\nturns to a discussion of Heisenberg’s matrix mechanics paper,\narguing that\n\nIt [the new matrix mechanics] operates with manifolds of quantities,\nwhich replace the harmonic oscillating components of the motion and\nsymbolise the possibilities of transitions between stationary states\nin conformity with the correspondence principle… In brief, the\nwhole apparatus of the quantum mechanics can be regarded as a precise\nformulation of the tendencies embodied in the correspondence\nprinciple. (Bohr 1925, p. 852; BCW 5, p. 280)\n\n\nWhat Bohr seems to be saying in this passage is that the new quantum\nmechanics symbolizes the allowed transitions in conformity with his\nselection rule.\n\nBohr continued to discuss the correspondence principle even after the\nadvent of modern quantum mechanics. In his 1928 Como lecture, for\nexample, he writes,\n\nThe aim of regarding the quantum theory as a rational generalisation\nof the classical theories led to the formulation of the so-called\ncorrespondence principle. The utilisation of this principle for the\ninterpretation of spectroscopic results was based on a symbolical\napplication of classical electrodynamics, in which the individual\ntransition processes were each associated with a harmonic in the\nmotion of the atomic particles to be expected according to ordinary\nmechanics. (Bohr 1928, p. 584; BCW 6, p. 152)\n\n\nNote that Bohr here speaks of a “symbolic” application of\nclassical electrodynamics—the electron trajectories in the\nstationary states, for example, are not to be interpreted literally or\neven “formally.” This shift in Bohr’s understanding\nof the status of the electron trajectories being employed in the\ncorrespondence principle has been emphasized in particular by Olivier\nDarrigol (Darrigol 1997, p. 558).\n\nNonetheless, as in 1920 when he first introduced the term\ncorrespondence principle, Bohr is here in 1928 (after the replacement\nof the old quantum theory by modern quantum mechanics) interpreting\nthe correspondence principle as a connection between transition\nprocesses and harmonics in the classical motion of the particles.\nMoreover, just as in 1920, he is explicitly tying the correspondence\nprinciple to his view that quantum mechanics is a rational\ngeneralization of classical mechanics. The correspondence principle\nthus provided a conceptual link between classical mechanics (and\nelectrodynamics), the old quantum theory, and modern quantum\nmechanics. This rational generalization thesis in turn was the\nfoundation of Bohr’s views on complementarity, and more broadly,\nhis Copenhagen interpretation of quantum mechanics. Thus the\ncorrespondence principle was not only technically important in the\ndiscovery of modern quantum mechanics, as Jammer (1966, p. 118) has\nemphasized, but it was also was the very foundation of Bohr’s\nphilosophy.\n",
    "section_title": "3. Bohr’s Writings on the Correspondence Principle (1918–1928)",
    "entry_title": "Bohr’s Correspondence Principle",
    "hierarchy_title": "Bohr’s Correspondence Principle || Bohr’s Writings on the Correspondence Principle (1918–1928)",
    "tokenized_text": [
        "bohr",
        "writing",
        "correspondence",
        "principle",
        "bohr",
        "writing",
        "correspondence",
        "principle",
        "bohr",
        "writing",
        "correspondence",
        "principle",
        "collected",
        "volume",
        "niels",
        "bohr",
        "collected",
        "work",
        "abbreviated",
        "bcw",
        "titled",
        "correspondence",
        "principle",
        "bohr",
        "report",
        "bohr",
        "first",
        "germ",
        "correspondence",
        "principle",
        "found",
        "lecture",
        "constitution",
        "molecule",
        "atom",
        "although",
        "term",
        "appear",
        "writing",
        "year",
        "bohr",
        "adopted",
        "expression",
        "correspondence",
        "principle",
        "described",
        "relation",
        "analogy",
        "classical",
        "quantum",
        "mechanic",
        "example",
        "paper",
        "quantum",
        "theory",
        "line",
        "spectra",
        "refers",
        "qol",
        "bohr",
        "writes",
        "seems",
        "possible",
        "throw",
        "light",
        "outstanding",
        "difficulty",
        "trying",
        "trace",
        "analogy",
        "quantum",
        "theory",
        "ordinary",
        "theory",
        "radiation",
        "closely",
        "possible",
        "bohr",
        "p",
        "bcw",
        "p",
        "later",
        "writing",
        "however",
        "bohr",
        "explicitly",
        "reject",
        "view",
        "correspondence",
        "principle",
        "thought",
        "analogy",
        "writes",
        "qol",
        "bohr",
        "designation",
        "yet",
        "used",
        "substance",
        "principle",
        "referred",
        "formal",
        "analogy",
        "quantum",
        "theory",
        "classical",
        "theory",
        "expression",
        "might",
        "cause",
        "misunderstanding",
        "since",
        "factas",
        "shall",
        "see",
        "later",
        "onthis",
        "correspondence",
        "principle",
        "must",
        "regarded",
        "purely",
        "law",
        "quantum",
        "theory",
        "way",
        "diminish",
        "contrast",
        "postulate",
        "electrodynamic",
        "theory",
        "bohr",
        "fn",
        "p",
        "bohr",
        "reject",
        "view",
        "correspondence",
        "principle",
        "analogy",
        "fact",
        "refers",
        "law",
        "quantum",
        "theory",
        "suggests",
        "first",
        "take",
        "universal",
        "principle",
        "applicable",
        "limited",
        "domain",
        "second",
        "essential",
        "part",
        "quantum",
        "theory",
        "sort",
        "general",
        "methodological",
        "constraint",
        "coming",
        "outside",
        "quantum",
        "theory",
        "paper",
        "term",
        "correspondence",
        "correspondence",
        "principle",
        "first",
        "appear",
        "nielsen",
        "p",
        "bohr",
        "writes",
        "lthough",
        "process",
        "radiation",
        "described",
        "basis",
        "ordinary",
        "theory",
        "electrodynamics",
        "according",
        "nature",
        "radiation",
        "emitted",
        "atom",
        "directly",
        "related",
        "harmonic",
        "component",
        "occurring",
        "motion",
        "system",
        "found",
        "nevertheless",
        "exist",
        "farreaching",
        "correspondence",
        "various",
        "type",
        "possible",
        "transition",
        "stationary",
        "state",
        "one",
        "hand",
        "various",
        "harmonic",
        "component",
        "motion",
        "hand",
        "correspondence",
        "nature",
        "present",
        "theory",
        "spectrum",
        "certain",
        "sense",
        "regarded",
        "rational",
        "generalization",
        "ordinary",
        "theory",
        "radiation",
        "bohr",
        "pp",
        "bcw",
        "pp",
        "correspondence",
        "bohr",
        "describes",
        "allowed",
        "transition",
        "one",
        "stationary",
        "state",
        "another",
        "harmonic",
        "component",
        "classical",
        "motion",
        "moreover",
        "take",
        "correspondence",
        "ground",
        "justification",
        "view",
        "quantum",
        "theory",
        "rational",
        "generalization",
        "classical",
        "mechanic",
        "discussion",
        "latter",
        "view",
        "see",
        "bokulich",
        "bokulich",
        "page",
        "later",
        "section",
        "titled",
        "correspondence",
        "principle",
        "bohr",
        "go",
        "describe",
        "frequency",
        "correspondence",
        "intensity",
        "correspondence",
        "correspondence",
        "frequency",
        "determined",
        "two",
        "method",
        "must",
        "deeper",
        "significance",
        "led",
        "anticipate",
        "also",
        "apply",
        "intensity",
        "equivalent",
        "statement",
        "quantum",
        "number",
        "large",
        "relative",
        "probability",
        "particular",
        "transition",
        "connected",
        "simple",
        "manner",
        "amplitude",
        "corresponding",
        "harmonic",
        "component",
        "motion",
        "peculiar",
        "relation",
        "suggests",
        "general",
        "law",
        "occurrence",
        "transition",
        "stationary",
        "state",
        "thus",
        "shall",
        "assume",
        "even",
        "quantum",
        "number",
        "small",
        "possibility",
        "transition",
        "two",
        "stationary",
        "state",
        "connected",
        "presence",
        "certain",
        "harmonic",
        "component",
        "motion",
        "system",
        "bohr",
        "pp",
        "bcw",
        "pp",
        "typical",
        "bohr",
        "style",
        "fails",
        "come",
        "clearly",
        "say",
        "whether",
        "one",
        "none",
        "correspondence",
        "mean",
        "designate",
        "correspondence",
        "principle",
        "bohr",
        "also",
        "argues",
        "correspondence",
        "principle",
        "something",
        "explains",
        "certain",
        "spectral",
        "line",
        "observed",
        "experiment",
        "writes",
        "view",
        "may",
        "termed",
        "correspondence",
        "principle",
        "offered",
        "immediate",
        "interpretation",
        "apparent",
        "capriciousness",
        "involved",
        "application",
        "principle",
        "combination",
        "spectral",
        "line",
        "consists",
        "circumstance",
        "small",
        "part",
        "spectral",
        "line",
        "might",
        "anticipated",
        "unrestricted",
        "application",
        "rydbergritz",
        "combination",
        "principle",
        "actually",
        "observed",
        "experiment",
        "bohr",
        "b",
        "unpublished",
        "bcw",
        "p",
        "bokulich",
        "internet",
        "resource",
        "argued",
        "interpreting",
        "correspondence",
        "principle",
        "term",
        "selection",
        "rule",
        "illuminates",
        "bohr",
        "claim",
        "explains",
        "capriciousness",
        "spectral",
        "line",
        "also",
        "claim",
        "correspondence",
        "principle",
        "law",
        "quantum",
        "theory",
        "indeed",
        "correspondence",
        "refers",
        "law",
        "selection",
        "rule",
        "correspondence",
        "hold",
        "also",
        "small",
        "quantum",
        "number",
        "classical",
        "limit",
        "law",
        "universal",
        "ie",
        "applying",
        "n",
        "restriction",
        "allowed",
        "quantum",
        "transition",
        "understand",
        "law",
        "quantum",
        "theory",
        "opposed",
        "law",
        "classical",
        "electrodynamics",
        "helpful",
        "consider",
        "bohr",
        "following",
        "remark",
        "occurrence",
        "radiative",
        "transition",
        "conditioned",
        "presence",
        "corresponding",
        "vibration",
        "motion",
        "atom",
        "right",
        "regard",
        "asymptotic",
        "relation",
        "obtained",
        "intimation",
        "general",
        "law",
        "quantum",
        "theory",
        "occurrence",
        "radiation",
        "assumed",
        "correspondence",
        "principle",
        "mentioned",
        "let",
        "recalled",
        "limiting",
        "region",
        "large",
        "quantum",
        "number",
        "wise",
        "question",
        "gradual",
        "diminution",
        "difference",
        "description",
        "quantum",
        "theory",
        "phenomenon",
        "radiation",
        "idea",
        "classical",
        "electrodynamics",
        "asymptotic",
        "agreement",
        "statistical",
        "result",
        "bohr",
        "p",
        "bcw",
        "p",
        "passage",
        "clear",
        "bohr",
        "take",
        "quantum",
        "mechanic",
        "universal",
        "theory",
        "despite",
        "statistical",
        "agreement",
        "result",
        "limit",
        "physic",
        "frequency",
        "intensity",
        "example",
        "remains",
        "different",
        "bohr",
        "insistent",
        "quantum",
        "account",
        "strictly",
        "correct",
        "oneeven",
        "high",
        "n",
        "classical",
        "limit",
        "hence",
        "bohr",
        "discovered",
        "allowable",
        "quantum",
        "transition",
        "corresponding",
        "harmonic",
        "classical",
        "motion",
        "discovered",
        "something",
        "quantum",
        "theory",
        "lecture",
        "atomic",
        "theory",
        "göttingen",
        "bohr",
        "emphasizes",
        "correspondence",
        "principle",
        "hold",
        "even",
        "low",
        "quantum",
        "number",
        "transition",
        "particularly",
        "seen",
        "discussion",
        "wellknown",
        "red",
        "green",
        "spectral",
        "line",
        "balmer",
        "series",
        "visible",
        "part",
        "hydrogen",
        "spectrum",
        "red",
        "spectral",
        "line",
        "really",
        "red",
        "wavelength",
        "around",
        "nm",
        "typically",
        "labeled",
        "rh_",
        "alpha",
        "result",
        "radiation",
        "emitted",
        "jump",
        "n",
        "n",
        "stationary",
        "state",
        "green",
        "line",
        "labeled",
        "rh_",
        "beta",
        "wavelength",
        "around",
        "nm",
        "result",
        "electron",
        "hydrogen",
        "atom",
        "jumping",
        "n",
        "n",
        "stationary",
        "state",
        "figure",
        "red",
        "green",
        "spectral",
        "line",
        "balmer",
        "series",
        "visible",
        "part",
        "hydrogen",
        "atom",
        "regarding",
        "lowquantumnumber",
        "transition",
        "bohr",
        "writes",
        "may",
        "regard",
        "rh_",
        "beta",
        "octave",
        "rh_",
        "alpha",
        "since",
        "rh_",
        "beta",
        "corresponds",
        "jump",
        "rh_",
        "alpha",
        "quantum",
        "jump",
        "true",
        "rh_",
        "beta",
        "twice",
        "frequency",
        "rh_",
        "alpha",
        "corresponds",
        "octave",
        "relationship",
        "call",
        "correspondence",
        "principle",
        "transition",
        "corresponds",
        "harmonic",
        "component",
        "mechanical",
        "motion",
        "bohr",
        "unpublished",
        "lecture",
        "bcw",
        "p",
        "word",
        "although",
        "frequency",
        "correspondence",
        "hold",
        "low",
        "quantum",
        "number",
        "intensity",
        "line",
        "calculated",
        "directly",
        "classical",
        "amplitude",
        "via",
        "intensity",
        "correspondence",
        "bohr",
        "calling",
        "general",
        "correspondence",
        "principle",
        "hold",
        "specifically",
        "tau",
        "tau",
        "transition",
        "allowed",
        "fourier",
        "decomposition",
        "electron",
        "classical",
        "orbit",
        "initial",
        "stationary",
        "state",
        "first",
        "second",
        "harmonic",
        "component",
        "passage",
        "challenge",
        "want",
        "interpret",
        "correspondence",
        "principle",
        "sort",
        "asymptotic",
        "relation",
        "holding",
        "classical",
        "limit",
        "remarkable",
        "continuity",
        "bohr",
        "statement",
        "correspondence",
        "principle",
        "one",
        "find",
        "bohr",
        "emphasizing",
        "allowed",
        "possible",
        "transition",
        "stationary",
        "state",
        "connected",
        "harmonic",
        "component",
        "present",
        "classical",
        "motion",
        "possibility",
        "occurrence",
        "transition",
        "accompanied",
        "radiation",
        "two",
        "state",
        "multiply",
        "periodic",
        "system",
        "quantum",
        "number",
        "example",
        "n_",
        "ldots",
        "n_u",
        "n_",
        "ldots",
        "n_u",
        "conditioned",
        "presence",
        "certain",
        "harmonic",
        "component",
        "expression",
        "given",
        "fourier",
        "series",
        "expansion",
        "classical",
        "electron",
        "motion",
        "frequency",
        "tau_omega_",
        "ldots",
        "tau_uomega_u",
        "harmonic",
        "component",
        "given",
        "following",
        "equation",
        "tau_",
        "n_",
        "n_",
        "quadldotsquad",
        "tau_u",
        "n_u",
        "n_u",
        "therefore",
        "call",
        "corresponding",
        "harmonic",
        "component",
        "motion",
        "substance",
        "statement",
        "designate",
        "correspondence",
        "principle",
        "bohr",
        "p",
        "bcw",
        "p",
        "werner",
        "heisenberg",
        "published",
        "famous",
        "umdeutung",
        "paper",
        "introducing",
        "matrix",
        "mechanic",
        "heisenberg",
        "would",
        "beginning",
        "modern",
        "quantum",
        "mechanic",
        "replaced",
        "old",
        "quantum",
        "theory",
        "supplement",
        "nature",
        "published",
        "december",
        "bohr",
        "describes",
        "take",
        "relationship",
        "new",
        "quantum",
        "mechanic",
        "correspondence",
        "principle",
        "begin",
        "statement",
        "correspondence",
        "principle",
        "demonstration",
        "asymptotic",
        "agreement",
        "spectrum",
        "motion",
        "gave",
        "rise",
        "formulation",
        "correspondence",
        "principle",
        "according",
        "possibility",
        "every",
        "transition",
        "process",
        "connected",
        "emission",
        "radiation",
        "conditioned",
        "presence",
        "corresponding",
        "harmonic",
        "component",
        "motion",
        "atom",
        "frequency",
        "corresponding",
        "harmonic",
        "component",
        "agree",
        "asymptotically",
        "value",
        "obtained",
        "frequency",
        "condition",
        "limit",
        "energy",
        "stationary",
        "state",
        "converge",
        "also",
        "amplitude",
        "mechanical",
        "oscillatory",
        "component",
        "give",
        "limit",
        "asymptotic",
        "measure",
        "probability",
        "transition",
        "process",
        "intensity",
        "observable",
        "spectral",
        "line",
        "depend",
        "bohr",
        "pp",
        "bcw",
        "pp",
        "quotation",
        "bohr",
        "note",
        "three",
        "correspondence",
        "relation",
        "selection",
        "rule",
        "correspondence",
        "asymptotic",
        "frequency",
        "correspondence",
        "asymptotic",
        "intensity",
        "correspondence",
        "bohr",
        "turn",
        "discussion",
        "heisenberg",
        "matrix",
        "mechanic",
        "paper",
        "arguing",
        "new",
        "matrix",
        "mechanic",
        "operates",
        "manifold",
        "quantity",
        "replace",
        "harmonic",
        "oscillating",
        "component",
        "motion",
        "symbolise",
        "possibility",
        "transition",
        "stationary",
        "state",
        "conformity",
        "correspondence",
        "principle",
        "brief",
        "whole",
        "apparatus",
        "quantum",
        "mechanic",
        "regarded",
        "precise",
        "formulation",
        "tendency",
        "embodied",
        "correspondence",
        "principle",
        "bohr",
        "p",
        "bcw",
        "p",
        "bohr",
        "seems",
        "saying",
        "passage",
        "new",
        "quantum",
        "mechanic",
        "symbolizes",
        "allowed",
        "transition",
        "conformity",
        "selection",
        "rule",
        "bohr",
        "continued",
        "discus",
        "correspondence",
        "principle",
        "even",
        "advent",
        "modern",
        "quantum",
        "mechanic",
        "como",
        "lecture",
        "example",
        "writes",
        "aim",
        "regarding",
        "quantum",
        "theory",
        "rational",
        "generalisation",
        "classical",
        "theory",
        "led",
        "formulation",
        "socalled",
        "correspondence",
        "principle",
        "utilisation",
        "principle",
        "interpretation",
        "spectroscopic",
        "result",
        "based",
        "symbolical",
        "application",
        "classical",
        "electrodynamics",
        "individual",
        "transition",
        "process",
        "associated",
        "harmonic",
        "motion",
        "atomic",
        "particle",
        "expected",
        "according",
        "ordinary",
        "mechanic",
        "bohr",
        "p",
        "bcw",
        "p",
        "note",
        "bohr",
        "speaks",
        "symbolic",
        "application",
        "classical",
        "electrodynamicsthe",
        "electron",
        "trajectory",
        "stationary",
        "state",
        "example",
        "interpreted",
        "literally",
        "even",
        "formally",
        "shift",
        "bohr",
        "understanding",
        "status",
        "electron",
        "trajectory",
        "employed",
        "correspondence",
        "principle",
        "emphasized",
        "particular",
        "olivier",
        "darrigol",
        "darrigol",
        "p",
        "nonetheless",
        "first",
        "introduced",
        "term",
        "correspondence",
        "principle",
        "bohr",
        "replacement",
        "old",
        "quantum",
        "theory",
        "modern",
        "quantum",
        "mechanic",
        "interpreting",
        "correspondence",
        "principle",
        "connection",
        "transition",
        "process",
        "harmonic",
        "classical",
        "motion",
        "particle",
        "moreover",
        "explicitly",
        "tying",
        "correspondence",
        "principle",
        "view",
        "quantum",
        "mechanic",
        "rational",
        "generalization",
        "classical",
        "mechanic",
        "correspondence",
        "principle",
        "thus",
        "provided",
        "conceptual",
        "link",
        "classical",
        "mechanic",
        "electrodynamics",
        "old",
        "quantum",
        "theory",
        "modern",
        "quantum",
        "mechanic",
        "rational",
        "generalization",
        "thesis",
        "turn",
        "foundation",
        "bohr",
        "view",
        "complementarity",
        "broadly",
        "copenhagen",
        "interpretation",
        "quantum",
        "mechanic",
        "thus",
        "correspondence",
        "principle",
        "technically",
        "important",
        "discovery",
        "modern",
        "quantum",
        "mechanic",
        "jammer",
        "p",
        "emphasized",
        "also",
        "foundation",
        "bohr",
        "philosophy"
    ]
}