{
    "main_text": "Philosophy, Faith, and Theology\n2. Philosophy, Faith, and Theology \n\nWithout exception, every word of philosophy Bonaventure ever wrote is\ncontained in works explicitly religious—in sermons, works of\nspiritual direction, and theology. He never wrote the kind of\nintroductions to the principles of metaphysics and natural philosophy\nthat Thomas Aquinas composed in his On Being and Essence\n(De ente et essentia) and On the Principles of\nNature (De principiis naturae), nor have any\ncommentaries on Aristotle’s works under his name been\nidentified. Scholars writing during the twentieth century\nNeo-Thomistic revival compared Bonaventure with three other thinkers:\nAristotle, Augustine, and Aquinas. P. Mandonnet thought he had no\nphilosophy of his own, but was an Augustinian theologian, pure and\nsimple, all of whose conclusions depend on faith. E. Gilson thought\nBonaventure developed an Augustinian philosophy within his\ntheology:\n\n\nwith St. Bonaventure the mystical synthesis of mediaeval\nAugustinianism was fully formed, just as that of Christian\nAristotelianism was fully formed with St. Thomas. (Gilson 1924 [1938:\n490]).\n\n\nF. Van Steenberghen thought his philosophy a failed Aristotelianism\nseparate from but at the service of his Augustinian\n theology.[12]\n None of these interpretations quite captures Bonaventure’s\nrelation to these three philosophers or his own approach to the\nrelations among reason, faith, and theology, because they implicitly\nemployed a Thomistic model for being an Aristotelian, with the result\nthat Bonaventure’s failures derive from his not being the kind\nof Aristotelian Thomas Aquinas was.\n\nBonaventure’s approach to Aristotle was quite different from\nAlbert and Thomas. He felt no need for detailed knowledge of the text\nof Aristotle. As a student in Arts he had learned from his Masters,\nnot from detailed study of Aristotle’s text, broadly\nAristotelian philosophical principles—the categories and\ntranscendentals, the causes and predicables, and fundamental notions\nlike potency and act, possible and necessary—sufficient to do\nhis own work. As a philosopher and theologian, he was perfectly\ncapable of using such borrowed principles to draw his own conclusions,\nones which he himself said depended more on Alexander of Hales than on\nany philosopher:\n\n\nFor I do not intend to advocate new opinions, but to reweave the\ncommon and approved ones (“Praelocutio,” Quaracchi II: 1a, trans.\nauthors).\n\n\nConsequently, Bonaventure was not a failed Aristotelian for the simple\nreason that he never tried to be an Aristotelian in the Dominican way\nat all. On the other hand, while Augustine was clearly\nBonaventure’s favorite theological authority, he was not,\nproperly speaking, an Augustinian. Even when he draws Augustinian\nconclusions, Bonaventure does not employ Augustinian arguments. In\ntruth, Bonaventure was, broadly speaking, an Aristotelian in his\nphilosophical principles, but not in his conclusions. A better way to\ndescribe his philosophical conclusions and his way of drawing them is\nthat his thought was Franciscan in inspiration and Bonaventurean in\nexecution.\n\nThe pressing issue concerning philosophy, faith, and theology in the\n1250s was how to set up theology as an Aristotelian demonstrative\nscience. Albert had done so in his commentary on the\nSentences (1243–9), which Bonaventure had on hand when\nwriting his own commentary. Demonstration is causal knowledge, and a\nscience in Aristotle’s sense is systematic knowledge of one\nlimited subject developed through demonstrating necessary conclusions\nby making use of certain fundamental causal principles relevant to the\nsubject at hand. The task theology had set itself, then, was to\ndiscover and present systematically the truths set out in that most\nunsystematic of books—the Bible.\n\nSince a “science” is causal knowledge, Bonaventure devoted\nthe four questions of the prologue to his commentary on Book 1 of the\nSentences, which serves as his introduction the whole\n“science” of theology, to its four causes—efficient,\nfinal, formal, and material. These causes in turn clarify the\nrelations between philosophy, faith, and theology.\n\nSince science exists as an intellectual habit in the mind of the\nknower, the efficient cause of any book of theology is the\nauthor who wrote it, Peter Lombard in the case of his\nSentences, Bonaventure himself in the case of his commentary.\nLombard was no mere scribe, compiler, or commentator; he was an\n“author”, and the same is true of Bonaventure himself.\nThis simple point distinguishes faith, whose sole efficient cause is\nGod working through grace, from both philosophy and theology, whose\nefficient cause is the human mind, though even here God has a role to\nplay.\n\nWhen he came to clarify the end of theology, Bonaventure\nunderstood that Aristotle had sharply distinguished practical\nscience—whose end is deeds—from theoretical\nscience—whose end is knowledge. So he asks whether theology is\n“for the sake of contemplation or for the sake of our becoming\ngood”. The answer is that theology is more perfect than any\nphilosophical science because it breaks through the bounds of this\nAristotelian dichotomy. Neither theoretical knowledge nor practical\ndeeds get to the center of the moral life, which is love—both\nthe “affection” of love and the theological virtue of\ncharity. The kind of intellectual virtue that prepares the mind for\ncharity is a “wisdom” that “involves knowledge and\naffection together”. The “knowledge that Christ died for\nus”, for example, is far different from the knowledge of the\ngeometer or the knowledge of the general. Consequently, theological\nwisdom is both\n\n\nfor the sake of contemplation and also for our becoming good, but\nprincipally for the sake of our becoming good (Quaracchi III: 13b;\ntrans. Houser and Noone 2013: 12)\n\n\nthrough enlivening our knowledge and deeds with Christian\n“affection”.\n\nThe form that produces “science” is its\n“method of proceeding”. Now\n\n\nthe end imposes necessity on the means, since “teeth are sharp\nin order to cut”, as Aristotle says.\n\n\nSince theology is “designed to promote the faith”, it\nemploys “the method of argumentation or inquiry” first\ndeveloped by Aristotle. By adapting the philosophical method to the\ndata of faith, theology attempts to “confound the adversaries of\nthe faith”, “strengthen those weak in their faith”,\nand “delight those whose faith is complete”. Bonaventure\nsituated theology within the hierarchy of the sciences by adverting to\nAristotle’s notion of “subalternated sciences”. The\nPhilosopher had recognized that optics—which studies visible\nlines—is a science “subalternated” to\ngeometry—which studies lines as such. Theology depends upon\nScripture in a similar way, for scripture offers certain truths to be\nbelieved, but theology looks at the same truths “as made\nintelligible”. In this way, theology is different from the faith\nit tries to understand and from the Scripture that offers faith to us\n(In I Sent. prol. q. 1 ad 5m; 2c [Quaracchi I: 8b]; trans.\nHouser and Noone 2013, 5).\n\nTo understand theology as a “science” making faith\nintelligible, Bonaventure must clarify its material cause.\nDetermining that material cause of theology is the same as\nsettling on its subject. On this point, there had been\nconsiderable dispute among the Masters. Aristotle’s\n“sciences” were all limited to a particular genus, such as\n“animal” or “soul” or “memory” or\n“ethics”. Even his universal science of metaphysics was\nlimited to studying substances; it eschewed the other categories.\nTheology, by contrast, cuts across all genera and includes God, who is\nnot confined within any genus. Bonaventure was familiar with many\naccounts of the subject of theology: “things and signs”,\nthe work of “reparation for sin”, “Christ—head\nand members”, “God”, and “the object of\nbelief” (credibile). To throw light on these\nconflicting answers, Bonaventure turned to his study of the Arts.\nPriscian had noted three different senses of the subject of grammar.\nIts subject in the sense of its “root principle” is the\n“letter” that makes up words; its subject conceived as an\n“integral whole” is “a fitting and complete\noration;” and its subject conceived as “universal\nwhole” is “meaningful sound, articulated and\nordered”. There are three correlative senses of the subject of\ntheology: “God” is the “principle” of the\nsubject and “Christ—head and members” is the\n“integral whole”, the entirety of what theology studies.\nBut the most important sense of “subject” is the\n“universal whole”. Therefore, “the subject of this\nbook, properly speaking”, is the “object of belief”,\na subject that lets theology range over all realities and all thoughts\nabout which one can have religious faith. (Quaracchi I: 6–8; trans.\nHouser and Noone 2013, 1–6).\n\nBonaventure does not explicitly address the principles of theology.\nBut he further clarifies its “subject” in a way that\npoints to those principles. To faith, Scripture adds the notion of\n“authority”, and to the faith and authority of Scriptural\nrevelation, theology adds “proof”. Theology presupposes\nfaith but adds to it rational demonstrations about matters of faith.\nConsequently, Bonaventure adds a telling qualification to his\ndescription of the subject of theology. Theology’s subject is\nthe object of belief\n\n\nin so far as the object of belief passes over into\nintelligibility by the addition of reasoning.\n\nprout tamen credibile transit in rationem intelligibilis, et hoc\nper additionem rationis.\n\n(In I Sent. prol., q. 1 conclusio [Quaracchi I: 7b]; trans.\nHouser and Noone 2013, 4)\n\n\nWith this concise formula, Bonaventure includes within theology both\nreligious belief transformed by arguments from natural reason and\nnatural reason transformed by arguments based on religious revelation.\nIf so, then theology must have the kinds of principles that make\npossible both kinds of arguments: the fundamental truths of faith\ndrawn from the Bible and tradition, but also fundamental truths of\nreason. What makes all such basic truths theological is their\nargumentative function. Theological arguments may draw from revelation\nby using revealed truths as premises and they may draw from reason by\nusing rational truths as premises. Both kinds of arguments are\ntheological because of the use to which they are put. In this way,\nphilosophical reasoning has an integral place within the\ndomain of Bonaventurean theology.\n\nBonaventure showed how philosophical reasoning works in theology in\nthe very structure of his disputed question On the Mystery of the\nTrinity. Each question is divided into two articles, the first\nproven using rational premises and the second proven using premises\ndrawn from faith. In Question 1, for example, God is rationally proven\nto exist in Art. 1, then shown to be a trinity of persons using\narguments based on faith and reason in Art. 2. Theology, then,\nconsists most fundamentally in the understanding that results from\njoining rational arguments and faith-based arguments\n together.[13]\n The same mode of reasoning is found in On Retracing the Arts to\nTheology. Here “reduction” consists in developing\nanalogies that move the mind from the liberal arts to theology and\nback again. Bonaventure argues for each point by combining one claim\nbased on reason with another based on revelation, as though they were\nwall and buttress of the cathedral of theology. Philosophical\nreasoning, then, is an absolutely integral part of Bonaventure’s\nfaith-based theology.\n",
    "section_title": "2. Philosophy, Faith, and Theology",
    "entry_title": "Bonaventure",
    "hierarchy_title": "Bonaventure || Philosophy, Faith, and Theology",
    "tokenized_text": [
        "philosophy",
        "faith",
        "theology",
        "philosophy",
        "faith",
        "theology",
        "without",
        "exception",
        "every",
        "word",
        "philosophy",
        "bonaventure",
        "ever",
        "wrote",
        "contained",
        "work",
        "explicitly",
        "religiousin",
        "sermon",
        "work",
        "spiritual",
        "direction",
        "theology",
        "never",
        "wrote",
        "kind",
        "introduction",
        "principle",
        "metaphysics",
        "natural",
        "philosophy",
        "thomas",
        "aquinas",
        "composed",
        "essence",
        "de",
        "ente",
        "et",
        "essentia",
        "principle",
        "nature",
        "de",
        "principiis",
        "naturae",
        "commentary",
        "aristotle",
        "work",
        "name",
        "identified",
        "scholar",
        "writing",
        "twentieth",
        "century",
        "neothomistic",
        "revival",
        "compared",
        "bonaventure",
        "three",
        "thinker",
        "aristotle",
        "augustine",
        "aquinas",
        "p",
        "mandonnet",
        "thought",
        "philosophy",
        "augustinian",
        "theologian",
        "pure",
        "simple",
        "whose",
        "conclusion",
        "depend",
        "faith",
        "e",
        "gilson",
        "thought",
        "bonaventure",
        "developed",
        "augustinian",
        "philosophy",
        "within",
        "theology",
        "st",
        "bonaventure",
        "mystical",
        "synthesis",
        "mediaeval",
        "augustinianism",
        "fully",
        "formed",
        "christian",
        "aristotelianism",
        "fully",
        "formed",
        "st",
        "thomas",
        "gilson",
        "f",
        "van",
        "steenberghen",
        "thought",
        "philosophy",
        "failed",
        "aristotelianism",
        "separate",
        "service",
        "augustinian",
        "theology",
        "none",
        "interpretation",
        "quite",
        "capture",
        "bonaventure",
        "relation",
        "three",
        "philosopher",
        "approach",
        "relation",
        "among",
        "reason",
        "faith",
        "theology",
        "implicitly",
        "employed",
        "thomistic",
        "model",
        "aristotelian",
        "result",
        "bonaventure",
        "failure",
        "derive",
        "kind",
        "aristotelian",
        "thomas",
        "aquinas",
        "bonaventure",
        "approach",
        "aristotle",
        "quite",
        "different",
        "albert",
        "thomas",
        "felt",
        "need",
        "detailed",
        "knowledge",
        "text",
        "aristotle",
        "student",
        "art",
        "learned",
        "master",
        "detailed",
        "study",
        "aristotle",
        "text",
        "broadly",
        "aristotelian",
        "philosophical",
        "principlesthe",
        "category",
        "transcendentals",
        "cause",
        "predicables",
        "fundamental",
        "notion",
        "like",
        "potency",
        "act",
        "possible",
        "necessarysufficient",
        "work",
        "philosopher",
        "theologian",
        "perfectly",
        "capable",
        "using",
        "borrowed",
        "principle",
        "draw",
        "conclusion",
        "one",
        "said",
        "depended",
        "alexander",
        "hale",
        "philosopher",
        "intend",
        "advocate",
        "new",
        "opinion",
        "reweave",
        "common",
        "approved",
        "one",
        "praelocutio",
        "quaracchi",
        "ii",
        "a",
        "trans",
        "author",
        "consequently",
        "bonaventure",
        "failed",
        "aristotelian",
        "simple",
        "reason",
        "never",
        "tried",
        "aristotelian",
        "dominican",
        "way",
        "hand",
        "augustine",
        "clearly",
        "bonaventure",
        "favorite",
        "theological",
        "authority",
        "properly",
        "speaking",
        "augustinian",
        "even",
        "draw",
        "augustinian",
        "conclusion",
        "bonaventure",
        "employ",
        "augustinian",
        "argument",
        "truth",
        "bonaventure",
        "broadly",
        "speaking",
        "aristotelian",
        "philosophical",
        "principle",
        "conclusion",
        "better",
        "way",
        "describe",
        "philosophical",
        "conclusion",
        "way",
        "drawing",
        "thought",
        "franciscan",
        "inspiration",
        "bonaventurean",
        "execution",
        "pressing",
        "issue",
        "concerning",
        "philosophy",
        "faith",
        "theology",
        "s",
        "set",
        "theology",
        "aristotelian",
        "demonstrative",
        "science",
        "albert",
        "done",
        "commentary",
        "sentence",
        "bonaventure",
        "hand",
        "writing",
        "commentary",
        "demonstration",
        "causal",
        "knowledge",
        "science",
        "aristotle",
        "sense",
        "systematic",
        "knowledge",
        "one",
        "limited",
        "subject",
        "developed",
        "demonstrating",
        "necessary",
        "conclusion",
        "making",
        "use",
        "certain",
        "fundamental",
        "causal",
        "principle",
        "relevant",
        "subject",
        "hand",
        "task",
        "theology",
        "set",
        "discover",
        "present",
        "systematically",
        "truth",
        "set",
        "unsystematic",
        "booksthe",
        "bible",
        "since",
        "science",
        "causal",
        "knowledge",
        "bonaventure",
        "devoted",
        "four",
        "question",
        "prologue",
        "commentary",
        "book",
        "sentence",
        "serf",
        "introduction",
        "whole",
        "science",
        "theology",
        "four",
        "causesefficient",
        "final",
        "formal",
        "material",
        "cause",
        "turn",
        "clarify",
        "relation",
        "philosophy",
        "faith",
        "theology",
        "since",
        "science",
        "exists",
        "intellectual",
        "habit",
        "mind",
        "knower",
        "efficient",
        "cause",
        "book",
        "theology",
        "author",
        "wrote",
        "peter",
        "lombard",
        "case",
        "sentence",
        "bonaventure",
        "case",
        "commentary",
        "lombard",
        "mere",
        "scribe",
        "compiler",
        "commentator",
        "author",
        "true",
        "bonaventure",
        "simple",
        "point",
        "distinguishes",
        "faith",
        "whose",
        "sole",
        "efficient",
        "cause",
        "god",
        "working",
        "grace",
        "philosophy",
        "theology",
        "whose",
        "efficient",
        "cause",
        "human",
        "mind",
        "though",
        "even",
        "god",
        "role",
        "play",
        "came",
        "clarify",
        "end",
        "theology",
        "bonaventure",
        "understood",
        "aristotle",
        "sharply",
        "distinguished",
        "practical",
        "sciencewhose",
        "end",
        "deedsfrom",
        "theoretical",
        "sciencewhose",
        "end",
        "knowledge",
        "asks",
        "whether",
        "theology",
        "sake",
        "contemplation",
        "sake",
        "becoming",
        "good",
        "answer",
        "theology",
        "perfect",
        "philosophical",
        "science",
        "break",
        "bound",
        "aristotelian",
        "dichotomy",
        "neither",
        "theoretical",
        "knowledge",
        "practical",
        "deed",
        "get",
        "center",
        "moral",
        "life",
        "loveboth",
        "affection",
        "love",
        "theological",
        "virtue",
        "charity",
        "kind",
        "intellectual",
        "virtue",
        "prepares",
        "mind",
        "charity",
        "wisdom",
        "involves",
        "knowledge",
        "affection",
        "together",
        "knowledge",
        "christ",
        "died",
        "u",
        "example",
        "far",
        "different",
        "knowledge",
        "geometer",
        "knowledge",
        "general",
        "consequently",
        "theological",
        "wisdom",
        "sake",
        "contemplation",
        "also",
        "becoming",
        "good",
        "principally",
        "sake",
        "becoming",
        "good",
        "quaracchi",
        "iii",
        "b",
        "trans",
        "houser",
        "noone",
        "enlivening",
        "knowledge",
        "deed",
        "christian",
        "affection",
        "form",
        "produce",
        "science",
        "method",
        "proceeding",
        "end",
        "imposes",
        "necessity",
        "mean",
        "since",
        "teeth",
        "sharp",
        "order",
        "cut",
        "aristotle",
        "say",
        "since",
        "theology",
        "designed",
        "promote",
        "faith",
        "employ",
        "method",
        "argumentation",
        "inquiry",
        "first",
        "developed",
        "aristotle",
        "adapting",
        "philosophical",
        "method",
        "data",
        "faith",
        "theology",
        "attempt",
        "confound",
        "adversary",
        "faith",
        "strengthen",
        "weak",
        "faith",
        "delight",
        "whose",
        "faith",
        "complete",
        "bonaventure",
        "situated",
        "theology",
        "within",
        "hierarchy",
        "science",
        "adverting",
        "aristotle",
        "notion",
        "subalternated",
        "science",
        "philosopher",
        "recognized",
        "opticswhich",
        "study",
        "visible",
        "linesis",
        "science",
        "subalternated",
        "geometrywhich",
        "study",
        "line",
        "theology",
        "depends",
        "upon",
        "scripture",
        "similar",
        "way",
        "scripture",
        "offer",
        "certain",
        "truth",
        "believed",
        "theology",
        "look",
        "truth",
        "made",
        "intelligible",
        "way",
        "theology",
        "different",
        "faith",
        "try",
        "understand",
        "scripture",
        "offer",
        "faith",
        "u",
        "sent",
        "prol",
        "q",
        "ad",
        "m",
        "c",
        "quaracchi",
        "b",
        "trans",
        "houser",
        "noone",
        "understand",
        "theology",
        "science",
        "making",
        "faith",
        "intelligible",
        "bonaventure",
        "must",
        "clarify",
        "material",
        "cause",
        "determining",
        "material",
        "cause",
        "theology",
        "settling",
        "subject",
        "point",
        "considerable",
        "dispute",
        "among",
        "master",
        "aristotle",
        "science",
        "limited",
        "particular",
        "genus",
        "animal",
        "soul",
        "memory",
        "ethic",
        "even",
        "universal",
        "science",
        "metaphysics",
        "limited",
        "studying",
        "substance",
        "eschewed",
        "category",
        "theology",
        "contrast",
        "cut",
        "across",
        "genus",
        "includes",
        "god",
        "confined",
        "within",
        "genus",
        "bonaventure",
        "familiar",
        "many",
        "account",
        "subject",
        "theology",
        "thing",
        "sign",
        "work",
        "reparation",
        "sin",
        "christhead",
        "member",
        "god",
        "object",
        "belief",
        "credibile",
        "throw",
        "light",
        "conflicting",
        "answer",
        "bonaventure",
        "turned",
        "study",
        "art",
        "priscian",
        "noted",
        "three",
        "different",
        "sens",
        "subject",
        "grammar",
        "subject",
        "sense",
        "root",
        "principle",
        "letter",
        "make",
        "word",
        "subject",
        "conceived",
        "integral",
        "whole",
        "fitting",
        "complete",
        "oration",
        "subject",
        "conceived",
        "universal",
        "whole",
        "meaningful",
        "sound",
        "articulated",
        "ordered",
        "three",
        "correlative",
        "sens",
        "subject",
        "theology",
        "god",
        "principle",
        "subject",
        "christhead",
        "member",
        "integral",
        "whole",
        "entirety",
        "theology",
        "study",
        "important",
        "sense",
        "subject",
        "universal",
        "whole",
        "therefore",
        "subject",
        "book",
        "properly",
        "speaking",
        "object",
        "belief",
        "subject",
        "let",
        "theology",
        "range",
        "reality",
        "thought",
        "one",
        "religious",
        "faith",
        "quaracchi",
        "trans",
        "houser",
        "noone",
        "bonaventure",
        "explicitly",
        "address",
        "principle",
        "theology",
        "clarifies",
        "subject",
        "way",
        "point",
        "principle",
        "faith",
        "scripture",
        "add",
        "notion",
        "authority",
        "faith",
        "authority",
        "scriptural",
        "revelation",
        "theology",
        "add",
        "proof",
        "theology",
        "presupposes",
        "faith",
        "add",
        "rational",
        "demonstration",
        "matter",
        "faith",
        "consequently",
        "bonaventure",
        "add",
        "telling",
        "qualification",
        "description",
        "subject",
        "theology",
        "theology",
        "subject",
        "object",
        "belief",
        "far",
        "object",
        "belief",
        "pass",
        "intelligibility",
        "addition",
        "reasoning",
        "prout",
        "tamen",
        "credibile",
        "transit",
        "rationem",
        "intelligibilis",
        "et",
        "hoc",
        "per",
        "additionem",
        "rationis",
        "sent",
        "prol",
        "q",
        "conclusio",
        "quaracchi",
        "b",
        "trans",
        "houser",
        "noone",
        "concise",
        "formula",
        "bonaventure",
        "includes",
        "within",
        "theology",
        "religious",
        "belief",
        "transformed",
        "argument",
        "natural",
        "reason",
        "natural",
        "reason",
        "transformed",
        "argument",
        "based",
        "religious",
        "revelation",
        "theology",
        "must",
        "kind",
        "principle",
        "make",
        "possible",
        "kind",
        "argument",
        "fundamental",
        "truth",
        "faith",
        "drawn",
        "bible",
        "tradition",
        "also",
        "fundamental",
        "truth",
        "reason",
        "make",
        "basic",
        "truth",
        "theological",
        "argumentative",
        "function",
        "theological",
        "argument",
        "may",
        "draw",
        "revelation",
        "using",
        "revealed",
        "truth",
        "premise",
        "may",
        "draw",
        "reason",
        "using",
        "rational",
        "truth",
        "premise",
        "kind",
        "argument",
        "theological",
        "use",
        "put",
        "way",
        "philosophical",
        "reasoning",
        "integral",
        "place",
        "within",
        "domain",
        "bonaventurean",
        "theology",
        "bonaventure",
        "showed",
        "philosophical",
        "reasoning",
        "work",
        "theology",
        "structure",
        "disputed",
        "question",
        "mystery",
        "trinity",
        "question",
        "divided",
        "two",
        "article",
        "first",
        "proven",
        "using",
        "rational",
        "premise",
        "second",
        "proven",
        "using",
        "premise",
        "drawn",
        "faith",
        "question",
        "example",
        "god",
        "rationally",
        "proven",
        "exist",
        "art",
        "shown",
        "trinity",
        "person",
        "using",
        "argument",
        "based",
        "faith",
        "reason",
        "art",
        "theology",
        "consists",
        "fundamentally",
        "understanding",
        "result",
        "joining",
        "rational",
        "argument",
        "faithbased",
        "argument",
        "together",
        "mode",
        "reasoning",
        "found",
        "retracing",
        "art",
        "theology",
        "reduction",
        "consists",
        "developing",
        "analogy",
        "move",
        "mind",
        "liberal",
        "art",
        "theology",
        "back",
        "bonaventure",
        "argues",
        "point",
        "combining",
        "one",
        "claim",
        "based",
        "reason",
        "another",
        "based",
        "revelation",
        "though",
        "wall",
        "buttress",
        "cathedral",
        "theology",
        "philosophical",
        "reasoning",
        "absolutely",
        "integral",
        "part",
        "bonaventure",
        "faithbased",
        "theology"
    ]
}