{
    "main_text": "Principal Contributions || Social, Political, and Legal Philosophy\n3.5 Social, Political, and Legal Philosophy\n\nBosanquet’s social and political philosophy is called\n‘idealist’ because of his view that social relations and\ninstitutions were not ultimately material phenomena, but best\nunderstood as existing in human consciousness. Writing largely in\nreaction to the utilitarianism of Bentham and Mill and to the\nnatural-rights based theory of Herbert Spencer, Bosanquet’s\nviews show both a strong influence of Hegel and an important debt to\nKant and to the classical Greek thought of Plato and Aristotle.\nIndeed, Bosanquet often spoke of his political theory as reflecting\nprinciples found in classical philosophy, and one of his early works\nwas a commentary on Plato’s Republic. Nevertheless, his\npolitical thought lies clearly within the tradition of liberalism.\n\nThe main source for Bosanquet’s social and political philosophy\nis The Philosophical Theory of the State (1899 [1923; Sweet\nand Gaus (ed.) 2001]; See Sweet 1997b), though many of his ideas are\ndeveloped in dozens of articles and essays which he wrote for\nprofessional academic journals, for publications of the Charity\nOrganisation Society and for the popular press. Like many of his\nfellow idealists (notably T.H. Green, D.G. Ritchie, William Wallace,\nJohn Watson, and, to a lesser degree, F.H. Bradley). Bosanquet’s\nprincipal concern was to explain the basis of political authority and\nthe state, the place of the citizen in society, and the nature, source\nand limits of human rights. The political theory that he developed is\nimportantly related to his metaphysics and logic—particularly to\nsuch notions as the individual, the general will, “the best\nlife”, society, and the state. In order to provide a coherent\naccount of such issues, Bosanquet argued, one must abandon some of the\nassumptions of the liberal tradition—particularly those that\nreveal a commitment to ‘individualism’.\n\nBosanquet saw authority and the state neither as based on individual\nconsent or a social contract, nor as mere products of a sovereign, but\nas part of the natural development of humanity, and as expressions of\nwhat he called the “real” or general will. On\nBosanquet’s view, the will of the individual is “a mental\nsystem” whose parts—“ideas or groups of\nideas”—are \n\n\nconnected in various degrees, and more or less subordinated to some\ndominant ideas which, as a rule, dictate the place and importance of\nthe others [i.e., of the other ideas that one has] (Bosanquet 1893–94,\np. 311). \n\n\nThus, Bosanquet writes that, \n\n\n[i]n order to obtain a full statement of what we will, what we want at\nany moment must at least be corrected and amended by what we want at\nall other moments. \n\n\nBut the process does not stop there. He continues: \n\n\nthis cannot be done without also correcting and amending it so as to\nharmonise it with what others want, which involves an application of\nthe same process to them. (1899 [1923; Sweet and Gaus (ed.) 2001]:\n133) \n\n\nIn other words, if we wish to arrive at an accurate statement of what\nour will is, we must be concerned not only with what we wish at some\nparticular moment, but also with all of the other wants, purposes,\nassociations and feelings that we and others have (or might have)\ngiven all of the knowledge available. The result is one’s\n“real” or the “general will”. Moreover, the\ndominant ideas characteristic of this real will provide a basis for\nshared understanding within the community and the state (see Sweet\n2019). Some have argued that the possibility of such an understanding\nprovides a basis not only for how language is a fundamental element in\npolitical community (see Grygienc 2018), but how it could be the\n“medium through which reality is given concrete shape”\n(Lejeune 2018).\n\nBosanquet sees a relation between the “real” or\n‘general will’ and the “common good”. He\nwrites that “The General Will seems to be, in the last resort,\nthe ineradicable impulse of an intelligent being to a good extending\nbeyond itself” (op. cit., p. 127). This\n‘good’ is nothing other than “the existence and the\nperfection of human personality” which Bosanquet identified with\n“the excellence of souls” and the complete realisation of\nthe individual. It is so far as the state reflects the general will\nand this common good that its authority is legitimate and its action\nmorally justifiable. Bosanquet describes the function of the state,\nthen, as “the hindrance of hindrances” to human\ndevelopment. (op. cit., p. 189)\n\nThe influence of Rousseau and Hegel is clearly evident here (Sweet\n1991). Bosanquet saw in Hegel’s Philosophy of Right a\nplausible account of the modern state as an “organism” or\nwhole united around a shared understanding of the good. Moreover, like\nHegel, he argued that the state, like all other social\n“institutions”, was best understood as an ethical idea and\nas existing at the level of consciousness rather than just material\nreality. Within nation states, Bosanquet held that the authority of\nthe state is absolute, because social life requires a consistent\nco-ordination of the activities of individuals and institutions.\n\nStill, although Bosanquet believed that the state was absolute, he did\nnot exclude the possibility of an organized system of international\nlaw (see Nicholson 1976). The conditions for an effective recognition\nand enforcement of such a system were, he thought, absent at that\nmoment—though he held out hope that the League of Nations\nreflected the beginnings of the consciousness of a genuine human\ncommunity and that it might provide a mechanism by which multinational\naction could be accomplished.\n\nBecause the state can be said to reflect the general will that\nBosanquet claimed is also each individual’s real will, Bosanquet\nheld (following Rousseau) that sometimes individuals can be required\nto engage in certain activities for their own good—that is they\ncan be “forced to be free”. Moreover, he maintained that\nit is in terms of the ‘common good’ that one’s\n“station” or “function” in society is defined,\nand it is the conscientious carrying out of the duties that are\nattached to one’s ‘station’ that constitutes ethical\nbehaviour. In fact, on Bosanquet’s account, it is primarily in\nlight of one’s service in the state that a person has the basis\nfor speaking of his or her personal identity. Not surprisingly, then,\nas Tyler (2006) points out, Bosanquet was frequently challenged by\nthose who claimed that he was anti-democratic and that his\nphilosophical views led to a devaluation of the individual. Such\nattacks ignore, however, Bosanquet’s insistence on liberty as\nthe essence and quality of the human person and his emphases on the\nmoral development of the human individual and on limiting the state\nfrom directly promoting morality (which reflects both his own reading\nof Kant and the influence of Green’s Kantianism.) Moreover,\nwhile Bosanquet did not hold that there were any a priori\nrestrictions on state action, he held that there were a number of\npractical conditions that did limit it. For example, while law was\nseen as necessary to the promotion of the common good, it could not\nmake a person good, and social progress could often be better achieved\nby volunteer action. (It is just this emphasis that Bosanquet found\nand defended in the approach to social work of the Charity\nOrganisation Society.)\n\nAlthough the state and law employ compulsion and restraint, they are\nconsidered to be ‘positive’ in that they provide the\nmaterial conditions for liberty, the functioning of social\ninstitutions, and the development of individual moral character. For\nBosanquet, then, there was no incompatibility between liberty and the\nlaw. Moreover, since individuals are necessarily social beings, their\nrights were neither absolute and inalienable, but reflected the\n“function” or “positions” they held in the\ncommunity. For such rights to have not only moral but legal weight,\nBosanquet insisted that they had to be recognized by the state in law.\nStrictly speaking, then, there could be no rights against the state.\nNevertheless, Bosanquet acknowledged that, where social institutions\nwere fundamentally corrupt, even though there was no right to\nrebellion, there could be a duty to resist.\n\nIt is in his discussion of the nature, source, and limits of state\naction and of the nature of rights that Bosanquet introduces the topic\nof punishment. Bosanquet considers the three dominant theories of\npunishment—retribution, reformation, and prevention—and\nseems to find all defective; some have argued that, like Green, in the\nend Bosanquet does not offer a clear, consistent theory of punishment.\nYet Bosanquet writes that “[t]he three main aspects of\npunishment [...] are really inseparable” (1899 [1923; Sweet and\nGaus (ed.) 2001]: 215). Punishment is the response to an act of a bad\nwill—and so it can be regarded as retributivist—but it\nalso has a properly preventive element, as well as a reformatory\ncharacter (since “the aim of punishment is to make the offender\ngood” (p. 206). The tension among these three theories has also\nled to the question of whether Bosanquet offers a “unified\ntheory of punishment”, and more recent scholarship, such as that\nof Brooks (2010), Crossley (2004), and Sweet (2000), all argue that\nthere is a way of reconciling the different theories, though they\ndisagree on the specifics of how that can occur. \n\nAlthough Bosanquet is sometimes regarded as a conservative, recent\nstudies have pointed out that he was an active Liberal and, in the\n1910s, supported the Labour Party. He insisted on the positive role\nthat the state can have in the promotion of social well being, he was\nin favour of worker ownership, he supported Irish Home Rule, and,\nduring the Second Boer War, was initially sympathetic to Boer\nindependence (see Sweet [1997]: 233–234; for a nuanced recent account,\nsee Boucher [2020]: 325). It is also worth noting that\nBosanquet’s audience was as much the professional social worker\nor the politician, as the philosopher. He was well-informed of the\npolitical situation in Britain, on the continent, and in the United\nStates. His interests extended to economics and social welfare, and\nhis work in adult education and social work provided a strong\nempirical dimension to his work. This background supplied him with a\nbroad base from which to reply to challenges from many of his\ncritics—e.g., from philosophers, like Mill and Spencer, and from\nsocial reformers, such as Sidney and Beatrice Webb and the founder of\nthe Salvation Army, General William Booth. Despite charges that\nBosanquet’s political philosophy is simplistic, inconsistent, or\nnaive, Adam Ulam notes that The Philosophical Theory of the\nState \n\n\nhas a comprehensiveness and an awareness of conflicting political and\nphilosophical opinions which give it a supreme importance in modern\npolitical thought. Bosanquet is both a political theorist and a\npolitical analyst. (Ulam 1951: 50) \n\n\nColin Tyler (2002) argues that Bosanquet’s political thought can\nalso provide a basis for the recognition of cultural diversity suited\nto a liberal, multicultural society.\n\nIt has sometimes been suggested that the influences of Kant and Hegel\nlead to a tension in Bosanquet’s political thought (see Vincent\n1982). Bosanquet’s emphasis on the moral development of the\nhuman individual and on limiting the state from directly promoting\nmorality clearly reflects a Kantian influence. Moreover, Bosanquet\nbelieved that “the best life” that he describes as the\n“end” of the individual and of the state alike,\napproximates what Kant referred to as “the kingdom of\nends”. Even Bosanquet’s justification of the authority of\nthe state can be seen as a reflection of a Kantian imperative that one\nwills the state as a necessary means to the moral end.\n",
    "section_title": "3.5 Social, Political, and Legal Philosophy",
    "entry_title": "Bernard Bosanquet",
    "hierarchy_title": "Bernard Bosanquet || Principal Contributions || Social, Political, and Legal Philosophy",
    "tokenized_text": [
        "principal",
        "contribution",
        "social",
        "political",
        "legal",
        "philosophy",
        "social",
        "political",
        "legal",
        "philosophy",
        "bosanquet",
        "social",
        "political",
        "philosophy",
        "called",
        "idealist",
        "view",
        "social",
        "relation",
        "institution",
        "ultimately",
        "material",
        "phenomenon",
        "best",
        "understood",
        "existing",
        "human",
        "consciousness",
        "writing",
        "largely",
        "reaction",
        "utilitarianism",
        "bentham",
        "mill",
        "naturalrights",
        "based",
        "theory",
        "herbert",
        "spencer",
        "bosanquet",
        "view",
        "show",
        "strong",
        "influence",
        "hegel",
        "important",
        "debt",
        "kant",
        "classical",
        "greek",
        "thought",
        "plato",
        "aristotle",
        "indeed",
        "bosanquet",
        "often",
        "spoke",
        "political",
        "theory",
        "reflecting",
        "principle",
        "found",
        "classical",
        "philosophy",
        "one",
        "early",
        "work",
        "commentary",
        "plato",
        "republic",
        "nevertheless",
        "political",
        "thought",
        "lie",
        "clearly",
        "within",
        "tradition",
        "liberalism",
        "main",
        "source",
        "bosanquet",
        "social",
        "political",
        "philosophy",
        "philosophical",
        "theory",
        "state",
        "sweet",
        "gaus",
        "ed",
        "see",
        "sweet",
        "b",
        "though",
        "many",
        "idea",
        "developed",
        "dozen",
        "article",
        "essay",
        "wrote",
        "professional",
        "academic",
        "journal",
        "publication",
        "charity",
        "organisation",
        "society",
        "popular",
        "press",
        "like",
        "many",
        "fellow",
        "idealist",
        "notably",
        "th",
        "green",
        "dg",
        "ritchie",
        "william",
        "wallace",
        "john",
        "watson",
        "lesser",
        "degree",
        "fh",
        "bradley",
        "bosanquet",
        "principal",
        "concern",
        "explain",
        "basis",
        "political",
        "authority",
        "state",
        "place",
        "citizen",
        "society",
        "nature",
        "source",
        "limit",
        "human",
        "right",
        "political",
        "theory",
        "developed",
        "importantly",
        "related",
        "metaphysics",
        "logicparticularly",
        "notion",
        "individual",
        "general",
        "best",
        "life",
        "society",
        "state",
        "order",
        "provide",
        "coherent",
        "account",
        "issue",
        "bosanquet",
        "argued",
        "one",
        "must",
        "abandon",
        "assumption",
        "liberal",
        "traditionparticularly",
        "reveal",
        "commitment",
        "individualism",
        "bosanquet",
        "saw",
        "authority",
        "state",
        "neither",
        "based",
        "individual",
        "consent",
        "social",
        "contract",
        "mere",
        "product",
        "sovereign",
        "part",
        "natural",
        "development",
        "humanity",
        "expression",
        "called",
        "real",
        "general",
        "bosanquet",
        "view",
        "individual",
        "mental",
        "system",
        "whose",
        "parts",
        "idea",
        "group",
        "idea",
        "are",
        "connected",
        "various",
        "degree",
        "le",
        "subordinated",
        "dominant",
        "idea",
        "rule",
        "dictate",
        "place",
        "importance",
        "others",
        "ie",
        "idea",
        "one",
        "bosanquet",
        "p",
        "thus",
        "bosanquet",
        "writes",
        "n",
        "order",
        "obtain",
        "full",
        "statement",
        "want",
        "moment",
        "must",
        "least",
        "corrected",
        "amended",
        "want",
        "moment",
        "process",
        "stop",
        "continues",
        "done",
        "without",
        "also",
        "correcting",
        "amending",
        "harmonise",
        "others",
        "want",
        "involves",
        "application",
        "process",
        "sweet",
        "gaus",
        "ed",
        "word",
        "wish",
        "arrive",
        "accurate",
        "statement",
        "must",
        "concerned",
        "wish",
        "particular",
        "moment",
        "also",
        "want",
        "purpose",
        "association",
        "feeling",
        "others",
        "might",
        "given",
        "knowledge",
        "available",
        "result",
        "one",
        "real",
        "general",
        "moreover",
        "dominant",
        "idea",
        "characteristic",
        "real",
        "provide",
        "basis",
        "shared",
        "understanding",
        "within",
        "community",
        "state",
        "see",
        "sweet",
        "argued",
        "possibility",
        "understanding",
        "provides",
        "basis",
        "language",
        "fundamental",
        "element",
        "political",
        "community",
        "see",
        "grygienc",
        "could",
        "medium",
        "reality",
        "given",
        "concrete",
        "shape",
        "lejeune",
        "bosanquet",
        "see",
        "relation",
        "real",
        "general",
        "common",
        "good",
        "writes",
        "general",
        "seems",
        "last",
        "resort",
        "ineradicable",
        "impulse",
        "intelligent",
        "good",
        "extending",
        "beyond",
        "op",
        "cit",
        "p",
        "good",
        "nothing",
        "existence",
        "perfection",
        "human",
        "personality",
        "bosanquet",
        "identified",
        "excellence",
        "soul",
        "complete",
        "realisation",
        "individual",
        "far",
        "state",
        "reflects",
        "general",
        "common",
        "good",
        "authority",
        "legitimate",
        "action",
        "morally",
        "justifiable",
        "bosanquet",
        "describes",
        "function",
        "state",
        "hindrance",
        "hindrance",
        "human",
        "development",
        "op",
        "cit",
        "p",
        "influence",
        "rousseau",
        "hegel",
        "clearly",
        "evident",
        "sweet",
        "bosanquet",
        "saw",
        "hegel",
        "philosophy",
        "right",
        "plausible",
        "account",
        "modern",
        "state",
        "organism",
        "whole",
        "united",
        "around",
        "shared",
        "understanding",
        "good",
        "moreover",
        "like",
        "hegel",
        "argued",
        "state",
        "like",
        "social",
        "institution",
        "best",
        "understood",
        "ethical",
        "idea",
        "existing",
        "level",
        "consciousness",
        "rather",
        "material",
        "reality",
        "within",
        "nation",
        "state",
        "bosanquet",
        "held",
        "authority",
        "state",
        "absolute",
        "social",
        "life",
        "requires",
        "consistent",
        "coordination",
        "activity",
        "individual",
        "institution",
        "still",
        "although",
        "bosanquet",
        "believed",
        "state",
        "absolute",
        "exclude",
        "possibility",
        "organized",
        "system",
        "international",
        "law",
        "see",
        "nicholson",
        "condition",
        "effective",
        "recognition",
        "enforcement",
        "system",
        "thought",
        "absent",
        "momentthough",
        "held",
        "hope",
        "league",
        "nation",
        "reflected",
        "beginning",
        "consciousness",
        "genuine",
        "human",
        "community",
        "might",
        "provide",
        "mechanism",
        "multinational",
        "action",
        "could",
        "accomplished",
        "state",
        "said",
        "reflect",
        "general",
        "bosanquet",
        "claimed",
        "also",
        "individual",
        "real",
        "bosanquet",
        "held",
        "following",
        "rousseau",
        "sometimes",
        "individual",
        "required",
        "engage",
        "certain",
        "activity",
        "goodthat",
        "forced",
        "free",
        "moreover",
        "maintained",
        "term",
        "common",
        "good",
        "one",
        "station",
        "function",
        "society",
        "defined",
        "conscientious",
        "carrying",
        "duty",
        "attached",
        "one",
        "station",
        "constitutes",
        "ethical",
        "behaviour",
        "fact",
        "bosanquet",
        "account",
        "primarily",
        "light",
        "one",
        "service",
        "state",
        "person",
        "basis",
        "speaking",
        "personal",
        "identity",
        "surprisingly",
        "tyler",
        "point",
        "bosanquet",
        "frequently",
        "challenged",
        "claimed",
        "antidemocratic",
        "philosophical",
        "view",
        "led",
        "devaluation",
        "individual",
        "attack",
        "ignore",
        "however",
        "bosanquet",
        "insistence",
        "liberty",
        "essence",
        "quality",
        "human",
        "person",
        "emphasis",
        "moral",
        "development",
        "human",
        "individual",
        "limiting",
        "state",
        "directly",
        "promoting",
        "morality",
        "reflects",
        "reading",
        "kant",
        "influence",
        "green",
        "kantianism",
        "moreover",
        "bosanquet",
        "hold",
        "priori",
        "restriction",
        "state",
        "action",
        "held",
        "number",
        "practical",
        "condition",
        "limit",
        "example",
        "law",
        "seen",
        "necessary",
        "promotion",
        "common",
        "good",
        "could",
        "make",
        "person",
        "good",
        "social",
        "progress",
        "could",
        "often",
        "better",
        "achieved",
        "volunteer",
        "action",
        "emphasis",
        "bosanquet",
        "found",
        "defended",
        "approach",
        "social",
        "work",
        "charity",
        "organisation",
        "society",
        "although",
        "state",
        "law",
        "employ",
        "compulsion",
        "restraint",
        "considered",
        "positive",
        "provide",
        "material",
        "condition",
        "liberty",
        "functioning",
        "social",
        "institution",
        "development",
        "individual",
        "moral",
        "character",
        "bosanquet",
        "incompatibility",
        "liberty",
        "law",
        "moreover",
        "since",
        "individual",
        "necessarily",
        "social",
        "being",
        "right",
        "neither",
        "absolute",
        "inalienable",
        "reflected",
        "function",
        "position",
        "held",
        "community",
        "right",
        "moral",
        "legal",
        "weight",
        "bosanquet",
        "insisted",
        "recognized",
        "state",
        "law",
        "strictly",
        "speaking",
        "could",
        "right",
        "state",
        "nevertheless",
        "bosanquet",
        "acknowledged",
        "social",
        "institution",
        "fundamentally",
        "corrupt",
        "even",
        "though",
        "right",
        "rebellion",
        "could",
        "duty",
        "resist",
        "discussion",
        "nature",
        "source",
        "limit",
        "state",
        "action",
        "nature",
        "right",
        "bosanquet",
        "introduces",
        "topic",
        "punishment",
        "bosanquet",
        "considers",
        "three",
        "dominant",
        "theory",
        "punishmentretribution",
        "reformation",
        "preventionand",
        "seems",
        "find",
        "defective",
        "argued",
        "like",
        "green",
        "end",
        "bosanquet",
        "offer",
        "clear",
        "consistent",
        "theory",
        "punishment",
        "yet",
        "bosanquet",
        "writes",
        "three",
        "main",
        "aspect",
        "punishment",
        "really",
        "inseparable",
        "sweet",
        "gaus",
        "ed",
        "punishment",
        "response",
        "act",
        "bad",
        "willand",
        "regarded",
        "retributivistbut",
        "also",
        "properly",
        "preventive",
        "element",
        "well",
        "reformatory",
        "character",
        "since",
        "aim",
        "punishment",
        "make",
        "offender",
        "good",
        "p",
        "tension",
        "among",
        "three",
        "theory",
        "also",
        "led",
        "question",
        "whether",
        "bosanquet",
        "offer",
        "unified",
        "theory",
        "punishment",
        "recent",
        "scholarship",
        "brook",
        "crossley",
        "sweet",
        "argue",
        "way",
        "reconciling",
        "different",
        "theory",
        "though",
        "disagree",
        "specific",
        "occur",
        "although",
        "bosanquet",
        "sometimes",
        "regarded",
        "conservative",
        "recent",
        "study",
        "pointed",
        "active",
        "liberal",
        "s",
        "supported",
        "labour",
        "party",
        "insisted",
        "positive",
        "role",
        "state",
        "promotion",
        "social",
        "well",
        "favour",
        "worker",
        "ownership",
        "supported",
        "irish",
        "home",
        "rule",
        "second",
        "boer",
        "war",
        "initially",
        "sympathetic",
        "boer",
        "independence",
        "see",
        "sweet",
        "nuanced",
        "recent",
        "account",
        "see",
        "boucher",
        "also",
        "worth",
        "noting",
        "bosanquet",
        "audience",
        "much",
        "professional",
        "social",
        "worker",
        "politician",
        "philosopher",
        "wellinformed",
        "political",
        "situation",
        "britain",
        "continent",
        "united",
        "state",
        "interest",
        "extended",
        "economics",
        "social",
        "welfare",
        "work",
        "adult",
        "education",
        "social",
        "work",
        "provided",
        "strong",
        "empirical",
        "dimension",
        "work",
        "background",
        "supplied",
        "broad",
        "base",
        "reply",
        "challenge",
        "many",
        "criticseg",
        "philosopher",
        "like",
        "mill",
        "spencer",
        "social",
        "reformer",
        "sidney",
        "beatrice",
        "webb",
        "founder",
        "salvation",
        "army",
        "general",
        "william",
        "booth",
        "despite",
        "charge",
        "bosanquet",
        "political",
        "philosophy",
        "simplistic",
        "inconsistent",
        "naive",
        "adam",
        "ulam",
        "note",
        "philosophical",
        "theory",
        "state",
        "comprehensiveness",
        "awareness",
        "conflicting",
        "political",
        "philosophical",
        "opinion",
        "give",
        "supreme",
        "importance",
        "modern",
        "political",
        "thought",
        "bosanquet",
        "political",
        "theorist",
        "political",
        "analyst",
        "ulam",
        "colin",
        "tyler",
        "argues",
        "bosanquet",
        "political",
        "thought",
        "also",
        "provide",
        "basis",
        "recognition",
        "cultural",
        "diversity",
        "suited",
        "liberal",
        "multicultural",
        "society",
        "sometimes",
        "suggested",
        "influence",
        "kant",
        "hegel",
        "lead",
        "tension",
        "bosanquet",
        "political",
        "thought",
        "see",
        "vincent",
        "bosanquet",
        "emphasis",
        "moral",
        "development",
        "human",
        "individual",
        "limiting",
        "state",
        "directly",
        "promoting",
        "morality",
        "clearly",
        "reflects",
        "kantian",
        "influence",
        "moreover",
        "bosanquet",
        "believed",
        "best",
        "life",
        "describes",
        "end",
        "individual",
        "state",
        "alike",
        "approximates",
        "kant",
        "referred",
        "kingdom",
        "end",
        "even",
        "bosanquet",
        "justification",
        "authority",
        "state",
        "seen",
        "reflection",
        "kantian",
        "imperative",
        "one",
        "will",
        "state",
        "necessary",
        "mean",
        "moral",
        "end"
    ]
}