{
    "main_text": "Theories || Non-realist Theories\n2.2 Non-realist Theories\n\nNon-realist theories come in a large variety, especially insofar as\nthe banishment of boundaries can be part of broader projects concerned\nwith the social and cognitive construction of everyday reality.\nPerhaps the most radical view is that boundaries should not be reified\nfor the simple reason that their character is purely qualitative,\nnatural or artificial as the case may be. As H. H. Price once put it,\n“there is really no such entity as a surface; there are\nonly solid things thus and thus surfaced” (1932: 106).\nBy extension, there would really be no such things as boundaries, only\nentities thus and thus bounded. This is straightforward ontological\neliminativism, as when one says that there are no holes but only\nobjects thus and thus holed (Lewis and Lewis 1970: 206), or no colors\nbut only things thus and thus colored (Quine 1948: 29–30). The\nmain challenge, then, is to go beyond the informal suggestion and\narticulate a systematic way of dealing in a similar fashion with every\nordinary sentence that seems to call for genuine reification. Can\nevery boundary-referring noun-phrase be de-nominalized this way? Can\nevery quantification over boundaries be reinterpreted as a\nquantification over bounded objects? Etc.\n\nFor the most part, however, non-realist accounts have concentrated on\nthe more limited task of reinterpreting ordinary boundary talk in the\ncontext of geometric and topological theorizing. Generally speaking,\nsuch accounts are not necessarily expression of an eliminativist\nontology. They are, rather, boundary-free. More precisely, they are\nfree from any genuine commitment to boundaries understood as the\nlower-dimensional entities endorsed by the realist theories outlined\nin Section 2.1. The common idea, here, is that deep down all such talk\ninvolves some sort of “abstraction” — an idea that\ncan be found already in the medieval and modern debates on\nanti-indivisibilism (Zupko 1993; Zimmerman 1996a; Holden 2004; Shapiro\nand Hellman 2021) and that made its way into contemporary formal\ntheories via Lobačevskij’s New Principles\n(1835–1938). It is this idea that has recently become the focus\nof renewed attention in connection with the hypothesis that the\nuniverse might consist of “atomless gunk”, as Lewis (1991:\n20) calls it, i.e., that either space and time or matter, or both,\ndivide forever into smaller and smaller parts (Zimmerman 1996b;\nMcDaniel 2006; Hudson 2007; Russell 2008). What sort of abstraction\nwould be involved here? And how can one account for our ordinary and\nmathematical talk about boundaries if these are to be conceived of as\nmere abstractions?\n\nWith special reference to the boundaries of spatio-temporal\nparticulars, we may distinguish two main approaches. (Our taxonomy,\nhere, will be rather sketchy; for a fuller picture, see Vakarelov\n2007, Hahmann and Grüninger 2012, and the monographs by Gorzka\n2003 and Gruszczyński 2016.)\n\n(A) Substantivalists about space-time may see the abstraction\nas stemming from the relationship between a particular and its\nspatio-temporal receptacle, relying on the topology of space-time to\naccount for our boundary talk when it comes to specific cases. It has\nbeen held, for instance, that material bodies are the material content\nof open regions of space, more specifically regular open regions,\nboundary contact between bodies being explained in terms of overlap\nbetween the closures of their receptacles. (An open region is regular\nif it is equal to the interior of its own closure. This rules out, for\ninstance, regions lacking what would commonly be described as a single\ninterior point, or regions with ingrowing boundary\n“cracks”.) This view can be traced back to Descartes\n(Principles II.15) and has been explicitly articulated by\nCartwright (1975). It does, to be sure, yield a hybrid account, an\naccount that does away only with the boundaries of material bodies\n(and, by extension, events); their receptacles are typically subject\nto a standard topology in which boundaries are treated as per theory\n(2) above. Yet this account is enough to bypass the puzzles of Section\n1 (especially 1.1) insofar as there is no pressing problem in assuming\na standard topology for space-time and, with it, the distinction\nbetween open and closed regions. The main problem for the theory is,\nrather, to justify the claim that only some regions (open\nregular regions, for instance) are receptacles. (See Hudson 2002 for a\nchallenge to this view, and Uzquiano 2006 for a defense.) On the other\nhand, there are more radical, non-hybrid theories that do away with\nboundaries also with regard to the structure of space-time.\nTopological theories of this sort may be found e.g. in Johanson\n(1981), Randell, Cui, and Cohn 1992), Asher and Vieu (1995), Forrest\n(1996), Roeper (1997), Pratt-Hartmann (2007), and Hellman and Shapiro\n(2018), but see also Gerla (1990) for a geometric account, Skyrms\n(1993) and Arntzenius (2008) for measure-theoretic alternatives, and\nLando and Scott (2019) for a robust approach combining both topology\nand measure theory. In the temporal realm, the same approach has\ninspired much work in so-called interval semantics for tense logic,\nbeginning with Hamblin (1971) and Humberstone (1979).\n\n(B) If one is not a substantivalist about space and/or time,\nthe abstractionist approach is even more tempting. For if space and/or\ntime are themselves abstractions emerging from concrete relations\namong material bodies and/or events, then, as Whitehead put it, it\nseems illegitimate to “assume sub silentio” that\nboundary elements are among the latter (1919: 5). In particular, it\nseems natural to treat them as mere “conceptual limits”\nemerging from the progressive contemplation of ever thinner layers of\nthe bounded entities with which we are directly acquainted (1916:\n730). The best formulation of this idea is Whitehead’s own\ntheory of “extensive abstraction”, originally developed in\npurely mereological terms and later refined in mereotopological terms\nfrom suggestions by De Laguna (1921, 1922) and Nicod (1924: I.4) (see\nWhitehead 1929, Part IV) and variously endorsed by Broad (1923: ch.\n1), Russell (1927: ch. 28), Stebbing (1930: ch. 23), and eventually\nMenger (1940) and others. On this account, boundary elements are no\nlonger viewed as lower-dimensional entities; they are, rather,\nhigher-order constructs, viz. equivalence classes of\nconvergent series of nested bodies “packed one within the other\nlike the nest of boxes of a Chinese toy” (Whitehead 1920: 61),\nbut with no smallest box. For example, the series of all concentric\nspheres included in a given sphere converges to the point at\nthe center, the series of all concentric right cylinders of equal\nlength included in a given cylinder converge to the axial\nline, and so on. Call a convergent series of this sort an\nabstractive class if and only if it has no bottom, i.e., if\nand only if no object is part of every member of the class. And call\ntwo co-convergent abstractive classes equivalent if and only\nif every member of the first class has a member of the second as part,\nand vice versa. For instance, an abstractive class of spheres is\nequivalent to the class of all the cubes inscribed in the spheres,\nwhich converge to the same point at the center, etc. Then each\nboundary element can be viewed as an equivalence class of suitably\ndefined converging abstractive classes, and if things are done\nproperly, one can eventually reconstruct ordinary talk about\nlower-dimensional boundaries as talk about such higher-order entities.\n(For details, see Clarke 1985 and Varzi 2021.) This approach has\nanalogues also in the temporal realm, where instants can be construed\nmore directly as convergent classes of nested time intervals, which in\nturn can be construed as sets of overlapping events. (The locus\nclassicus, directly inspired by Whitehead’s thinking, is\nRussell 1914, but see also Walker 1947, Kamp 1979, van Benthem 1983,\nand Vakarelov 2015.) Moreover, the approach itself is amenable to\nseveral variants, depending on exactly which primitives one assumes.\nWhitehead himself eventually settled on a framework based on a\nprimitive binary relation of topological connection; a popular\nalternative formulation, following Tarski (1929), uses instead\nparthood along with as a special unary primitive ‘x is\na sphere’, defining e.g. a geometric point as the class of all\nspheres that are concentric — in a suitably defined sense\n— with a given one. (For details and developments of this\nalternative approach, see Bennett 2001, Gruszczyński and\nPietruszczak 2008, Betti and Loeb 2012, and Clay 2017; for extensions\nand further variants, Borgo and Masolo 2010, Borgo 2013, and Gerla and\nGruszczyński 2017.) Another influential variant, though\ndeveloped independently, is the point-free topology of Grzegorczyk\n(1960), which is based on parthood along with a primitive notion of\n‘spatial body’ and a binary relation of separation, i.e.,\nthe opposite of connection. This theory is closely related to\nWhitehead’s (see Biacino and Gerla 1996) and has recently been\nworked out in full detail by Gruszczyński and Pietruszczak\n(2018, 2019). (Point-free topologies were initially called\npointless topologies, following Johnstone 1983, but the\nterminology has aptly been updated.)\n\nFrom a technical viewpoint, these two approaches tend to overlap in\nmany ways. In particular, Whitehead’s technique is often used\nalso in the context of substantivalists theories, as with the\n“Region Connection Calculus” of Randell et al.\n(1992), which has proved highly influential in the computational\ntreatment of boundary-free spatial reasoning. Moreover, both sorts of\ntheories face a number of common questions when it comes to specifying\nthe ontological assumptions on which they rest. Formally they are all\nboundary-free, which means that, in a logical setting, their variables\nare meant to range exclusively over extended regions or bodies. Yet\nnot all such things are equal; is there room for interesting\ndistinctions? For instance, should these theories have room for the\nstandard topological distinction between open and closed entities?\nShould they preserve the distinction between regular entities and\nirregular ones? Some authors find such distinctions unintelligible\nfrom a boundary-free perspective. Randell et al. (1992), for\ninstance, rule them out at the outset, and Bostock (2010) rules them\nout by argument. However others disagree, beginning with Clarke\n(1981), who actually provides detailed instructions on how to retrieve\nall standard topological distinctions within the framework of\nWhitehead’s theory. (For other theories, see Cohn and Varzi\n2003.) Of course, retrieving them formally doesn’t mean much;\nthe distinctions may still collapse. But do they — or should\nthey — collapse?\n\nOther questions may be more or less pressing depending on one’s\ngeneral philosophical concerns. For example, a common objection to\ntype-(B) theories is that the abstractness of boundaries would seem to\nrun afoul of the abstractness of set-theoretic constructions. One can\nsee and paint the surface of a table, and in principle one could even\nsee and paint an infinite series of ever thinner layers of\ntable-parts; but one cannot see or paint the set of these\nparts, even less an equivalence class of such sets (Simons 1991: 96).\nEven de Laguna, one of the very first sponsors of Whitehead’s\nmethod, remarked that the identification of points and other\nboundaries with abstractive sets is open to serious misinterpretation:\n“Although we perceive solids, we perceive no abstractive sets of\nsolids […] In accepting the abstractive set, we are as\nveritably going beyond experience as in accepting the solid of\nzero-length” (1922: 460). This is not a formal objection.\nIndeed, there are philosophers who, such as Maddy (1980), believe that\nsets can be perceived, at least sets of physical objects such\nas tables. Nonetheless, the perceptibility of an infinite equivalence\nclass remains problematic. It is especially problematic if, as in\nWhitehead’s case, the motivation for going boundary-free is\ngrounded on a broadly empiricist epistemology.\n\nFinally, there is room for speculations concerning different\nnon-realist strategies one might consider besides type-(A) and\ntype-(B) theories. At the moment, the main option that received some\nattention in the literature appears to be an\n“operationalist” account of the sort advocated by Adams\n(1984, 1996), where the abstractive process by which boundary elements\nare constructed out of concrete observables is explained in terms of\n“operational tests”. Such an account might meet De\nLaguna’s worries. Arguably, however, it is best regarded as a\nparallel story. It may offer an explanation of our empirical knowledge\nconcerning boundaries, but it remains ultimately neutral with regard\nto their ontological status.\n",
    "section_title": "2.2 Non-realist Theories",
    "entry_title": "Boundary",
    "hierarchy_title": "Boundary || Theories || Non-realist Theories",
    "tokenized_text": [
        "theory",
        "nonrealist",
        "theory",
        "nonrealist",
        "theory",
        "nonrealist",
        "theory",
        "come",
        "large",
        "variety",
        "especially",
        "insofar",
        "banishment",
        "boundary",
        "part",
        "broader",
        "project",
        "concerned",
        "social",
        "cognitive",
        "construction",
        "everyday",
        "reality",
        "perhaps",
        "radical",
        "view",
        "boundary",
        "reified",
        "simple",
        "reason",
        "character",
        "purely",
        "qualitative",
        "natural",
        "artificial",
        "case",
        "may",
        "h",
        "h",
        "price",
        "put",
        "really",
        "entity",
        "surface",
        "solid",
        "thing",
        "thus",
        "thus",
        "surfaced",
        "extension",
        "would",
        "really",
        "thing",
        "boundary",
        "entity",
        "thus",
        "thus",
        "bounded",
        "straightforward",
        "ontological",
        "eliminativism",
        "one",
        "say",
        "hole",
        "object",
        "thus",
        "thus",
        "holed",
        "lewis",
        "lewis",
        "color",
        "thing",
        "thus",
        "thus",
        "colored",
        "quine",
        "main",
        "challenge",
        "go",
        "beyond",
        "informal",
        "suggestion",
        "articulate",
        "systematic",
        "way",
        "dealing",
        "similar",
        "fashion",
        "every",
        "ordinary",
        "sentence",
        "seems",
        "call",
        "genuine",
        "reification",
        "every",
        "boundaryreferring",
        "nounphrase",
        "denominalized",
        "way",
        "every",
        "quantification",
        "boundary",
        "reinterpreted",
        "quantification",
        "bounded",
        "object",
        "etc",
        "part",
        "however",
        "nonrealist",
        "account",
        "concentrated",
        "limited",
        "task",
        "reinterpreting",
        "ordinary",
        "boundary",
        "talk",
        "context",
        "geometric",
        "topological",
        "theorizing",
        "generally",
        "speaking",
        "account",
        "necessarily",
        "expression",
        "eliminativist",
        "ontology",
        "rather",
        "boundaryfree",
        "precisely",
        "free",
        "genuine",
        "commitment",
        "boundary",
        "understood",
        "lowerdimensional",
        "entity",
        "endorsed",
        "realist",
        "theory",
        "outlined",
        "section",
        "common",
        "idea",
        "deep",
        "talk",
        "involves",
        "sort",
        "abstraction",
        "idea",
        "found",
        "already",
        "medieval",
        "modern",
        "debate",
        "antiindivisibilism",
        "zupko",
        "zimmerman",
        "a",
        "holden",
        "shapiro",
        "hellman",
        "made",
        "way",
        "contemporary",
        "formal",
        "theory",
        "via",
        "lobačevskij",
        "new",
        "principle",
        "idea",
        "recently",
        "become",
        "focus",
        "renewed",
        "attention",
        "connection",
        "hypothesis",
        "universe",
        "might",
        "consist",
        "atomless",
        "gunk",
        "lewis",
        "call",
        "ie",
        "either",
        "space",
        "time",
        "matter",
        "divide",
        "forever",
        "smaller",
        "smaller",
        "part",
        "zimmerman",
        "b",
        "mcdaniel",
        "hudson",
        "russell",
        "sort",
        "abstraction",
        "would",
        "involved",
        "one",
        "account",
        "ordinary",
        "mathematical",
        "talk",
        "boundary",
        "conceived",
        "mere",
        "abstraction",
        "special",
        "reference",
        "boundary",
        "spatiotemporal",
        "particular",
        "may",
        "distinguish",
        "two",
        "main",
        "approach",
        "taxonomy",
        "rather",
        "sketchy",
        "fuller",
        "picture",
        "see",
        "vakarelov",
        "hahmann",
        "grüninger",
        "monograph",
        "gorzka",
        "gruszczyński",
        "substantivalists",
        "spacetime",
        "may",
        "see",
        "abstraction",
        "stemming",
        "relationship",
        "particular",
        "spatiotemporal",
        "receptacle",
        "relying",
        "topology",
        "spacetime",
        "account",
        "boundary",
        "talk",
        "come",
        "specific",
        "case",
        "held",
        "instance",
        "material",
        "body",
        "material",
        "content",
        "open",
        "region",
        "space",
        "specifically",
        "regular",
        "open",
        "region",
        "boundary",
        "contact",
        "body",
        "explained",
        "term",
        "overlap",
        "closure",
        "receptacle",
        "open",
        "region",
        "regular",
        "equal",
        "interior",
        "closure",
        "rule",
        "instance",
        "region",
        "lacking",
        "would",
        "commonly",
        "described",
        "single",
        "interior",
        "point",
        "region",
        "ingrowing",
        "boundary",
        "crack",
        "view",
        "traced",
        "back",
        "descartes",
        "principle",
        "ii",
        "explicitly",
        "articulated",
        "cartwright",
        "sure",
        "yield",
        "hybrid",
        "account",
        "account",
        "away",
        "boundary",
        "material",
        "body",
        "extension",
        "event",
        "receptacle",
        "typically",
        "subject",
        "standard",
        "topology",
        "boundary",
        "treated",
        "per",
        "theory",
        "yet",
        "account",
        "enough",
        "bypass",
        "puzzle",
        "section",
        "especially",
        "insofar",
        "pressing",
        "problem",
        "assuming",
        "standard",
        "topology",
        "spacetime",
        "distinction",
        "open",
        "closed",
        "region",
        "main",
        "problem",
        "theory",
        "rather",
        "justify",
        "claim",
        "region",
        "open",
        "regular",
        "region",
        "instance",
        "receptacle",
        "see",
        "hudson",
        "challenge",
        "view",
        "uzquiano",
        "defense",
        "hand",
        "radical",
        "nonhybrid",
        "theory",
        "away",
        "boundary",
        "also",
        "regard",
        "structure",
        "spacetime",
        "topological",
        "theory",
        "sort",
        "may",
        "found",
        "eg",
        "johanson",
        "randell",
        "cui",
        "cohn",
        "asher",
        "vieu",
        "forrest",
        "roeper",
        "pratthartmann",
        "hellman",
        "shapiro",
        "see",
        "also",
        "gerla",
        "geometric",
        "account",
        "skyrms",
        "arntzenius",
        "measuretheoretic",
        "alternative",
        "lando",
        "scott",
        "robust",
        "approach",
        "combining",
        "topology",
        "measure",
        "theory",
        "temporal",
        "realm",
        "approach",
        "inspired",
        "much",
        "work",
        "socalled",
        "interval",
        "semantics",
        "tense",
        "logic",
        "beginning",
        "hamblin",
        "humberstone",
        "b",
        "one",
        "substantivalist",
        "space",
        "andor",
        "time",
        "abstractionist",
        "approach",
        "even",
        "tempting",
        "space",
        "andor",
        "time",
        "abstraction",
        "emerging",
        "concrete",
        "relation",
        "among",
        "material",
        "body",
        "andor",
        "event",
        "whitehead",
        "put",
        "seems",
        "illegitimate",
        "assume",
        "sub",
        "silentio",
        "boundary",
        "element",
        "among",
        "latter",
        "particular",
        "seems",
        "natural",
        "treat",
        "mere",
        "conceptual",
        "limit",
        "emerging",
        "progressive",
        "contemplation",
        "ever",
        "thinner",
        "layer",
        "bounded",
        "entity",
        "directly",
        "acquainted",
        "best",
        "formulation",
        "idea",
        "whitehead",
        "theory",
        "extensive",
        "abstraction",
        "originally",
        "developed",
        "purely",
        "mereological",
        "term",
        "later",
        "refined",
        "mereotopological",
        "term",
        "suggestion",
        "de",
        "laguna",
        "nicod",
        "i",
        "see",
        "whitehead",
        "part",
        "iv",
        "variously",
        "endorsed",
        "broad",
        "ch",
        "russell",
        "ch",
        "stebbing",
        "ch",
        "eventually",
        "menger",
        "others",
        "account",
        "boundary",
        "element",
        "longer",
        "viewed",
        "lowerdimensional",
        "entity",
        "rather",
        "higherorder",
        "construct",
        "viz",
        "equivalence",
        "class",
        "convergent",
        "series",
        "nested",
        "body",
        "packed",
        "one",
        "within",
        "like",
        "nest",
        "box",
        "chinese",
        "toy",
        "whitehead",
        "smallest",
        "box",
        "example",
        "series",
        "concentric",
        "sphere",
        "included",
        "given",
        "sphere",
        "converges",
        "point",
        "center",
        "series",
        "concentric",
        "right",
        "cylinder",
        "equal",
        "length",
        "included",
        "given",
        "cylinder",
        "converge",
        "axial",
        "line",
        "call",
        "convergent",
        "series",
        "sort",
        "abstractive",
        "class",
        "bottom",
        "ie",
        "object",
        "part",
        "every",
        "member",
        "class",
        "call",
        "two",
        "coconvergent",
        "abstractive",
        "class",
        "equivalent",
        "every",
        "member",
        "first",
        "class",
        "member",
        "second",
        "part",
        "vice",
        "versa",
        "instance",
        "abstractive",
        "class",
        "sphere",
        "equivalent",
        "class",
        "cube",
        "inscribed",
        "sphere",
        "converge",
        "point",
        "center",
        "etc",
        "boundary",
        "element",
        "viewed",
        "equivalence",
        "class",
        "suitably",
        "defined",
        "converging",
        "abstractive",
        "class",
        "thing",
        "done",
        "properly",
        "one",
        "eventually",
        "reconstruct",
        "ordinary",
        "talk",
        "lowerdimensional",
        "boundary",
        "talk",
        "higherorder",
        "entity",
        "detail",
        "see",
        "clarke",
        "varzi",
        "approach",
        "analogue",
        "also",
        "temporal",
        "realm",
        "instant",
        "construed",
        "directly",
        "convergent",
        "class",
        "nested",
        "time",
        "interval",
        "turn",
        "construed",
        "set",
        "overlapping",
        "event",
        "locus",
        "classicus",
        "directly",
        "inspired",
        "whitehead",
        "thinking",
        "russell",
        "see",
        "also",
        "walker",
        "kamp",
        "van",
        "benthem",
        "vakarelov",
        "moreover",
        "approach",
        "amenable",
        "several",
        "variant",
        "depending",
        "exactly",
        "primitive",
        "one",
        "assumes",
        "whitehead",
        "eventually",
        "settled",
        "framework",
        "based",
        "primitive",
        "binary",
        "relation",
        "topological",
        "connection",
        "popular",
        "alternative",
        "formulation",
        "following",
        "tarski",
        "us",
        "instead",
        "parthood",
        "along",
        "special",
        "unary",
        "primitive",
        "x",
        "sphere",
        "defining",
        "eg",
        "geometric",
        "point",
        "class",
        "sphere",
        "concentric",
        "suitably",
        "defined",
        "sense",
        "given",
        "one",
        "detail",
        "development",
        "alternative",
        "approach",
        "see",
        "bennett",
        "gruszczyński",
        "pietruszczak",
        "betti",
        "loeb",
        "clay",
        "extension",
        "variant",
        "borgo",
        "masolo",
        "borgo",
        "gerla",
        "gruszczyński",
        "another",
        "influential",
        "variant",
        "though",
        "developed",
        "independently",
        "pointfree",
        "topology",
        "grzegorczyk",
        "based",
        "parthood",
        "along",
        "primitive",
        "notion",
        "spatial",
        "body",
        "binary",
        "relation",
        "separation",
        "ie",
        "opposite",
        "connection",
        "theory",
        "closely",
        "related",
        "whitehead",
        "see",
        "biacino",
        "gerla",
        "recently",
        "worked",
        "full",
        "detail",
        "gruszczyński",
        "pietruszczak",
        "pointfree",
        "topology",
        "initially",
        "called",
        "pointless",
        "topology",
        "following",
        "johnstone",
        "terminology",
        "aptly",
        "updated",
        "technical",
        "viewpoint",
        "two",
        "approach",
        "tend",
        "overlap",
        "many",
        "way",
        "particular",
        "whitehead",
        "technique",
        "often",
        "used",
        "also",
        "context",
        "substantivalists",
        "theory",
        "region",
        "connection",
        "calculus",
        "randell",
        "et",
        "al",
        "proved",
        "highly",
        "influential",
        "computational",
        "treatment",
        "boundaryfree",
        "spatial",
        "reasoning",
        "moreover",
        "sort",
        "theory",
        "face",
        "number",
        "common",
        "question",
        "come",
        "specifying",
        "ontological",
        "assumption",
        "rest",
        "formally",
        "boundaryfree",
        "mean",
        "logical",
        "setting",
        "variable",
        "meant",
        "range",
        "exclusively",
        "extended",
        "region",
        "body",
        "yet",
        "thing",
        "equal",
        "room",
        "interesting",
        "distinction",
        "instance",
        "theory",
        "room",
        "standard",
        "topological",
        "distinction",
        "open",
        "closed",
        "entity",
        "preserve",
        "distinction",
        "regular",
        "entity",
        "irregular",
        "one",
        "author",
        "find",
        "distinction",
        "unintelligible",
        "boundaryfree",
        "perspective",
        "randell",
        "et",
        "al",
        "instance",
        "rule",
        "outset",
        "bostock",
        "rule",
        "argument",
        "however",
        "others",
        "disagree",
        "beginning",
        "clarke",
        "actually",
        "provides",
        "detailed",
        "instruction",
        "retrieve",
        "standard",
        "topological",
        "distinction",
        "within",
        "framework",
        "whitehead",
        "theory",
        "theory",
        "see",
        "cohn",
        "varzi",
        "course",
        "retrieving",
        "formally",
        "mean",
        "much",
        "distinction",
        "may",
        "still",
        "collapse",
        "collapse",
        "question",
        "may",
        "le",
        "pressing",
        "depending",
        "one",
        "general",
        "philosophical",
        "concern",
        "example",
        "common",
        "objection",
        "type",
        "b",
        "theory",
        "abstractness",
        "boundary",
        "would",
        "seem",
        "run",
        "afoul",
        "abstractness",
        "settheoretic",
        "construction",
        "one",
        "see",
        "paint",
        "surface",
        "table",
        "principle",
        "one",
        "could",
        "even",
        "see",
        "paint",
        "infinite",
        "series",
        "ever",
        "thinner",
        "layer",
        "tableparts",
        "one",
        "see",
        "paint",
        "set",
        "part",
        "even",
        "le",
        "equivalence",
        "class",
        "set",
        "simon",
        "even",
        "de",
        "laguna",
        "one",
        "first",
        "sponsor",
        "whitehead",
        "method",
        "remarked",
        "identification",
        "point",
        "boundary",
        "abstractive",
        "set",
        "open",
        "serious",
        "misinterpretation",
        "although",
        "perceive",
        "solid",
        "perceive",
        "abstractive",
        "set",
        "solid",
        "accepting",
        "abstractive",
        "set",
        "veritably",
        "going",
        "beyond",
        "experience",
        "accepting",
        "solid",
        "zerolength",
        "formal",
        "objection",
        "indeed",
        "philosopher",
        "maddy",
        "believe",
        "set",
        "perceived",
        "least",
        "set",
        "physical",
        "object",
        "table",
        "nonetheless",
        "perceptibility",
        "infinite",
        "equivalence",
        "class",
        "remains",
        "problematic",
        "especially",
        "problematic",
        "whitehead",
        "case",
        "motivation",
        "going",
        "boundaryfree",
        "grounded",
        "broadly",
        "empiricist",
        "epistemology",
        "finally",
        "room",
        "speculation",
        "concerning",
        "different",
        "nonrealist",
        "strategy",
        "one",
        "might",
        "consider",
        "besides",
        "type",
        "type",
        "b",
        "theory",
        "moment",
        "main",
        "option",
        "received",
        "attention",
        "literature",
        "appears",
        "operationalist",
        "account",
        "sort",
        "advocated",
        "adam",
        "abstractive",
        "process",
        "boundary",
        "element",
        "constructed",
        "concrete",
        "observables",
        "explained",
        "term",
        "operational",
        "test",
        "account",
        "might",
        "meet",
        "de",
        "laguna",
        "worry",
        "arguably",
        "however",
        "best",
        "regarded",
        "parallel",
        "story",
        "may",
        "offer",
        "explanation",
        "empirical",
        "knowledge",
        "concerning",
        "boundary",
        "remains",
        "ultimately",
        "neutral",
        "regard",
        "ontological",
        "status"
    ]
}