{
    "main_text": "Two Schools of Heuristics || Fast and Frugal Heuristics\n7.2 Fast and Frugal Heuristics\n\nThe Fast and Frugal school and the Biases and Heuristics school both\nagree that heuristics are biased. Where they disagree, and disagree\nsharply, is whether those biases are necessarily a sign of\nirrationality. For the Fast and Frugal program the question is under\nwhat environmental conditions, if any, does a particular heuristic\nperform effectively. If the heuristic’s structural bias is\nwell-suited to the task environment, then the bias of that heuristic\nmay be an advantage for making accurate judgments rather than a\nliability\n (section 4).\n We saw this adaptive strategy before in our discussion of\nBrunswik’s lens model\n (section 3.2),\n although there the bias in the model was to assume that both the\nenvironment and the subject’s responses were linear. The aim of\nthe Fast and Frugal program is to adapt this Brunswikian strategy to a\nvariety of improper models.\n\nThis general goal of the Fast and Frugal program leads to a second\ndifference between the two schools. Because the Fast and Frugal\nprogram aims to specify the conditions under which a heuristic will\nlead to better outcomes than competing models, heuristics are treated\nas algorithmic models of decision-making rather than descriptions of\nerrant effects; heuristics are themselves objects of study. To that\nend, all heuristics in the fast and frugal tradition are conceived to\nhave three components: (i) a search rule, (ii) a stopping rule, and\n(iii) a decision rule. For example, Take-the-Best (Gigerenzer\n& Goldstein 1996), is a heuristic applied to binary, forced-choice\nproblems. Specifically, the task is to pick the correct option\naccording to an external criterion, such as correctly picking which of\na pair of cities has a larger population, based on cue information\nthat is available to the decision-maker, such as whether she has heard\nof one city but not the other, whether one city is known to have a\nfootball franchise in the professional league, et cetera. Based on\ndata sets, one can compute the predictive validity of different cues,\nand thus derive their weights. Take-the-Best then has the following\nstructure: Search rule: Look up the cue with the highest\ncue-validity; Stopping rule: If the pair of objects have\ndifferent cue values, that is, one is positive and the other negative,\nstop the search. If the cue values are the same, continue searching\ndown the cue-order; Decision rule: Predict that the\nalternative with the positive cue value has the higher\ntarget-criterion value. If all cues fail to discriminate, that is, if\nall cue values are the same, then predict the alternative randomly by\na coin flip. The bias of Take-the-Best is that it ignores relevant\ncues. Another example is tallying, which is a type of\nimproper linear model\n (section 2.3).\n Tallying has the following structure for a binary, forced-choice\ntask: Search rule: Look up cues in a random order;\nStopping rule: After some exogenously determined m\n\\((1 < m \\leq N)\\) of the N available cues are evaluated,\nstop the search; Decision rule: Predict that the alternative\nwith the higher number of positive cue values has the higher\ntarget-criterion value. The bias in tallying is that it ignores cue\nweights. One can see then how models are compared to one another by\nhow they process cues and their performance is evaluated with respect\nto a specified criterion for success, such as the number of correct\nanswers to the city population task.\n\nBecause Fast and Frugal heuristics are computational models, this\nleads to a third difference between the two schools. Kahneman endorses\nthe System I and System II theory of cognition (Stanovich & West\n2000). Furthermore, Kahneman classifies heuristics as fast, intuitive,\nand non-deliberative System I thinking. Gigerenzer, by contrast, does\nnot endorse the System I and System II hypothesis, thus rejects\nclassifying heuristics as, necessarily, non-deliberative cognitive\nprocesses. Because heuristics are computational models in the Fast and\nFrugal program, in principle each may be used deliberatively by a\ndecision-maker or used by a decision-modeler to explain or predict a\ndecision-maker’s non-deliberative behavior. The Linear Optical\nTrajectory (LOT) heuristic (McBeath, Shaffer, & Kaiser 1995) that\nbaseball players use intuitively, without deliberation, to catch fly\nballs, and which some animals appear to use to intercept prey, is the\nsame heuristic that the “Miracle on the Hudson” airline\npilots used deliberatively to infer that they could not reach an\nairport runway and decided instead to land their crippled plane in the\nHudson river.\n\nHere are a list of heuristics studied in the Fast and Frugal program\n(Gigerenzer, Hertwig, & Pachur 2011), along with an informal\ndescription for each along with historical and selected contemporary\nreferences.\n\n\n\nImitation. People have a strong tendency to\nimitate the successful members of their communities (Henrich\n& Gil-White 2001). \n\n\nIf some one man in a tribe …invented a new snare or weapon, or\nother means of attack or defense, the plainest self-interest, without\nthe assistance of much reasoning power, would prompt other members to\nimitate him. (Darwin 1871, 155)\n\n\n\nImitation is presumed to be fundamental to the speed of cultural\nadaptation including the adoption of social norms\n (section 3.4).\n\n\nPreferential Attachment. When given the choice to\nform a new connection to someone, pick the individual with the most\nconnections to others (Yule 1925; Barabási & Albert\n1999; Simon 1955b).\n\n\nDefault rules. If there is an applicable default\nrule, and no apparent reason for you to do otherwise, follow the\nrule. (Fisher 1936; Reiter 1980; Thaler & Sustein 2008;\nWheeler 2004).\n\n\nSatisficing. Search available options and choose\nthe first one that exceeds your aspiration level. (Simon 1955a;\nHutchinson et al. 2012).\n\n\nTallying. To estimate a target criterion, rather\nthan estimate the weights of available cues, instead count the number\nof positive instances (Dawes 1979; Dana & Dawes\n2004).\n\n\nOne-bounce Rule (Hey’s Rule B). Have at\nleast two searches for an option. Stop if a price quote is larger than\nthe previous quote. The one-bounce rule plays\n“winning-streaks” by continuing search while you keep\nreceiving a series of lower and lower quotes, but stops as soon as\nyour luck runs out (Hey 1982; Charness & Kuhn 2011).\n\n\nTit-for-tat. Begin by cooperating, then respond\nin kind to your opponent; If your opponent cooperates, then cooperate;\nif your opponent defects, then defect (Axelrod 1984; Rapaport,\nSeale, & Colman 2015).\n\n\nLinear Optical Trajectory (LOT). To intersect\nwith another moving object, adjust your speed so that your angle of\ngaze remains constant. (McBeath et al. 1995; Gigerenzer\n2007).\n\n\nTake-the-best. To decide which of two\nalternatives has a higher value on a specific criterion, (i) first\nsearch the cues in order of their predictive validity; (ii) next, stop\nsearch when a cue is found which discriminates between the\nalternatives; (iii) then, choose the alternative selected by the\ndiscriminating cue. (iv) If all cues fail to discriminate between the\ntwo alternatives, then choose an alternative by chance (Einhorn\n1970; Gigerenzer & Goldstein 1996).\n\n\nRecognition: To decide which of two alternatives\nhas a higher value on a specific criterion and one of the two\nalternatives is recognized, choose the alternative that is\nrecognized (Goldstein & Gigerenzer 2002; Davis-Stober, Dana,\n& Budescu 2010; Pachur, Todd, et al. 2012).\n\n\nFluency: To decide which of two alternatives has\na higher value on a specific criterion, if both alternatives are\nrecognized but one is recognized faster, choose the alternative that\nis recognized faster (Schooler & Hertwig 2005; Herzog &\nHertwig 2013).\n\n\n\\(\\frac{1}{N}\\) Rule: For N feasible\noptions, invest resources equally across all N options\n(Hertwig, Davis, & Sulloway 2002; DeMiguel, Garlappi, & Uppal\n2009).\n\n\nThere are three lines of responses to the Fast and Frugal program to\nmention. Take-the-Best is an example of a non-compensatory\ndecision rule, which means that the first discriminating cue cannot be\n“compensated” by the cue-information remaining down the\norder. This condition, when it holds, is thought to warrant taking a\ndecision on the first discriminating cue and ignoring the remaining\ncue-information. The computational efficiency of Take-the-Best is\nsupposed to come from only evaluating a few cues, which number less\nthan 3 on average in benchmarks tests (Czerlinski et al. 1999).\nHowever, all of the cue validities need to be known by the\ndecision-maker and sorted before initiating the search. So,\nTake-the-Best by design treats a portion of the necessary\ncomputational costs to execute the heuristic as exogenous. Although\nthe lower-bound for sorting cues by comparison is \\(O(n \\log n)\\),\nthere is little evidence to suggest that humans sort cues by the most\nefficient sorting algorithms in this class. On the contrary, such\noperations are precisely of the kind that qualitative probability\njudgments demand\n (section 1.2).\n Furthermore, in addition to the costs of ranking cue validities,\nthere is the cost of acquisition and the determination that the\nagent’s estimates are non-compensatory. Although the exact\naccounting of the cognitive effort presupposed is unknown, and argued\nto be lower than critics suggest (Katsikopoulos et al. 2010),\nnevertheless these necessary steps threaten to render Take-the-Best\nnon-compensatory in execution but not in what is necessary prior to\nsetting up the model to execute.\n\nA second line of criticism concerns the cognitive plausibility of Take\nthe Best (Chater, Oaksford, Nakisa, & Redington 2003). Nearly all\nof the empirical data on the performance characteristics of\nTake-the-Best are by computer simulations, and those original\ncompetitions pitted Take the Best against standard statistical models\n(Czerlinski et al. 1999) but omitted standard machine learning\nalgorithms that Chater, Oaksford and colleagues found performed just\nas well as Take the Best. Since these initial studies, the focus has\nshifted to machine learning, and includes variants of Take-the-Best,\nsuch as “greedy cue permutation” that performs provably\nbetter than the original and is guaranteed to always find accurate\nsolutions when they exist (Schmitt & Martignon 2006). Setting\naside criticisms targeting the comparative performance advantages of\nTake the Best qua decision model, others have questioned the\nplausibility of using Take-the-Best as a cognitive model. For example,\nTake-the-Best presumes that cue-information is processed serially, but\nthe speed advantages of the model translate to an advantage in human\ndecision-making derives only if humans process cue information on a\nserial architecture. If instead people process cue information on a\nparallel cognitive architecture, then the comparative speed advantages\nof Take-the-Best would become moot (Chater et al. 2003).\n\nThe third line of criticism concerns whether the Fast-and-Frugal\nprogram truly mounts a challenge to the normative standards of\noptimization, dominance-reasoning, and consistency, as advertised.\nTake-the-Best is an algorithm for decision-making that does not\ncomport with the axioms of expected utility theory. For one thing, its\nlexicographic structure violates the Archimedean axiom\n (section 1.1, A2).\n For another, it is presumed to violate the transitivity condition of\nthe Ordering axiom\n (A1).\n Further still, the “less-is-more” effects appear to\nviolate Good’s principle (Good 1967), a central pillar of\nBayesian decision theory, which recommends to delay making a terminal\ndecision between alternative options if the opportunity arises to\nacquire free information. In other words, according canonical\nBayesianism, free advice is a bore but no one ought to turn down free\ninformation (Pedersen & Wheeler 2014). If noncompensatory decision\nrules like Take-the-Best violate Good’s principle, then perhaps\nthe whole Bayesian machinery ought to go (Gigerenzer & Brighton\n2009).\n\nBut these points merely tell us that attempts to formulate\nTake-the-Best in terms of an ordering of prospects on a real-valued\nindex won’t do, not that ordering and numerical indices have all\ngot to go. As we saw in\n section 1.1,\n there is a long and sizable literature on lexicographic probabilities\nand non-standard analysis, including early work specifically\naddressing non-compensatory nonlinear models (Einhorn 1970). Second,\nGigerenzer argues that “cognitive algorithms…need to meet\nmore important constraints than internal consistency”\n(Gigerenzer & Goldstein 1996), which includes transitivity, and\nelsewhere advocates abandoning coherence as a normative standard\n(Arkes, Gigerenzer, & Hertwig 2016). However, Take-the-Best\npresupposes that cues are ordered by cue validity, which naturally\nentails transitivity, otherwise Take-The-Best could neither be\ncoherently specified nor effectively executed. More generally, the\nFast and Frugal school’s commitment to formulating heuristics\nalgorithmically and implementing them as computational models commits\nthem to the normative standards of optimization, dominance reasoning,\nand logical consistency.\n\nFinally, Good’s principle states that a decision-maker facing a\nsingle-person decision-problem cannot be worse (in expectation) from\nreceiving free information. Exceptions are known in game theory\n(Osborne 2003: 283), however, that involve asymmetric information\namong two or more decision-makers. But there is also an exception for\nsingle-person decision-problems involving indeterminate or imprecise\nprobabilities (Pedersen & Wheeler 2015). The point is that\nGood’s principle is not a fundamental principle of probabilistic\nmethods, but instead is a specific result that holds for the canonical\ntheory of single-person decision-making with determinate\nprobabilities.\n",
    "section_title": "7.2 Fast and Frugal Heuristics",
    "entry_title": "Bounded Rationality",
    "hierarchy_title": "Bounded Rationality || Two Schools of Heuristics || Fast and Frugal Heuristics",
    "tokenized_text": [
        "two",
        "school",
        "heuristic",
        "fast",
        "frugal",
        "heuristic",
        "fast",
        "frugal",
        "heuristic",
        "fast",
        "frugal",
        "school",
        "bias",
        "heuristic",
        "school",
        "agree",
        "heuristic",
        "biased",
        "disagree",
        "disagree",
        "sharply",
        "whether",
        "bias",
        "necessarily",
        "sign",
        "irrationality",
        "fast",
        "frugal",
        "program",
        "question",
        "environmental",
        "condition",
        "particular",
        "heuristic",
        "perform",
        "effectively",
        "heuristic",
        "structural",
        "bias",
        "wellsuited",
        "task",
        "environment",
        "bias",
        "heuristic",
        "may",
        "advantage",
        "making",
        "accurate",
        "judgment",
        "rather",
        "liability",
        "section",
        "saw",
        "adaptive",
        "strategy",
        "discussion",
        "brunswik",
        "lens",
        "model",
        "section",
        "although",
        "bias",
        "model",
        "assume",
        "environment",
        "subject",
        "response",
        "linear",
        "aim",
        "fast",
        "frugal",
        "program",
        "adapt",
        "brunswikian",
        "strategy",
        "variety",
        "improper",
        "model",
        "general",
        "goal",
        "fast",
        "frugal",
        "program",
        "lead",
        "second",
        "difference",
        "two",
        "school",
        "fast",
        "frugal",
        "program",
        "aim",
        "specify",
        "condition",
        "heuristic",
        "lead",
        "better",
        "outcome",
        "competing",
        "model",
        "heuristic",
        "treated",
        "algorithmic",
        "model",
        "decisionmaking",
        "rather",
        "description",
        "errant",
        "effect",
        "heuristic",
        "object",
        "study",
        "end",
        "heuristic",
        "fast",
        "frugal",
        "tradition",
        "conceived",
        "three",
        "component",
        "search",
        "rule",
        "ii",
        "stopping",
        "rule",
        "iii",
        "decision",
        "rule",
        "example",
        "takethebest",
        "gigerenzer",
        "goldstein",
        "heuristic",
        "applied",
        "binary",
        "forcedchoice",
        "problem",
        "specifically",
        "task",
        "pick",
        "correct",
        "option",
        "according",
        "external",
        "criterion",
        "correctly",
        "picking",
        "pair",
        "city",
        "larger",
        "population",
        "based",
        "cue",
        "information",
        "available",
        "decisionmaker",
        "whether",
        "heard",
        "one",
        "city",
        "whether",
        "one",
        "city",
        "known",
        "football",
        "franchise",
        "professional",
        "league",
        "et",
        "cetera",
        "based",
        "data",
        "set",
        "one",
        "compute",
        "predictive",
        "validity",
        "different",
        "cue",
        "thus",
        "derive",
        "weight",
        "takethebest",
        "following",
        "structure",
        "search",
        "rule",
        "look",
        "cue",
        "highest",
        "cuevalidity",
        "stopping",
        "rule",
        "pair",
        "object",
        "different",
        "cue",
        "value",
        "one",
        "positive",
        "negative",
        "stop",
        "search",
        "cue",
        "value",
        "continue",
        "searching",
        "cueorder",
        "decision",
        "rule",
        "predict",
        "alternative",
        "positive",
        "cue",
        "value",
        "higher",
        "targetcriterion",
        "value",
        "cue",
        "fail",
        "discriminate",
        "cue",
        "value",
        "predict",
        "alternative",
        "randomly",
        "coin",
        "flip",
        "bias",
        "takethebest",
        "ignores",
        "relevant",
        "cue",
        "another",
        "example",
        "tallying",
        "type",
        "improper",
        "linear",
        "model",
        "section",
        "tallying",
        "following",
        "structure",
        "binary",
        "forcedchoice",
        "task",
        "search",
        "rule",
        "look",
        "cue",
        "random",
        "order",
        "stopping",
        "rule",
        "exogenously",
        "determined",
        "leq",
        "n",
        "n",
        "available",
        "cue",
        "evaluated",
        "stop",
        "search",
        "decision",
        "rule",
        "predict",
        "alternative",
        "higher",
        "number",
        "positive",
        "cue",
        "value",
        "higher",
        "targetcriterion",
        "value",
        "bias",
        "tallying",
        "ignores",
        "cue",
        "weight",
        "one",
        "see",
        "model",
        "compared",
        "one",
        "another",
        "process",
        "cue",
        "performance",
        "evaluated",
        "respect",
        "specified",
        "criterion",
        "success",
        "number",
        "correct",
        "answer",
        "city",
        "population",
        "task",
        "fast",
        "frugal",
        "heuristic",
        "computational",
        "model",
        "lead",
        "third",
        "difference",
        "two",
        "school",
        "kahneman",
        "endorses",
        "system",
        "system",
        "ii",
        "theory",
        "cognition",
        "stanovich",
        "west",
        "furthermore",
        "kahneman",
        "classifies",
        "heuristic",
        "fast",
        "intuitive",
        "nondeliberative",
        "system",
        "thinking",
        "gigerenzer",
        "contrast",
        "endorse",
        "system",
        "system",
        "ii",
        "hypothesis",
        "thus",
        "reject",
        "classifying",
        "heuristic",
        "necessarily",
        "nondeliberative",
        "cognitive",
        "process",
        "heuristic",
        "computational",
        "model",
        "fast",
        "frugal",
        "program",
        "principle",
        "may",
        "used",
        "deliberatively",
        "decisionmaker",
        "used",
        "decisionmodeler",
        "explain",
        "predict",
        "decisionmaker",
        "nondeliberative",
        "behavior",
        "linear",
        "optical",
        "trajectory",
        "lot",
        "heuristic",
        "mcbeath",
        "shaffer",
        "kaiser",
        "baseball",
        "player",
        "use",
        "intuitively",
        "without",
        "deliberation",
        "catch",
        "fly",
        "ball",
        "animal",
        "appear",
        "use",
        "intercept",
        "prey",
        "heuristic",
        "miracle",
        "hudson",
        "airline",
        "pilot",
        "used",
        "deliberatively",
        "infer",
        "could",
        "reach",
        "airport",
        "runway",
        "decided",
        "instead",
        "land",
        "crippled",
        "plane",
        "hudson",
        "river",
        "list",
        "heuristic",
        "studied",
        "fast",
        "frugal",
        "program",
        "gigerenzer",
        "hertwig",
        "pachur",
        "along",
        "informal",
        "description",
        "along",
        "historical",
        "selected",
        "contemporary",
        "reference",
        "imitation",
        "people",
        "strong",
        "tendency",
        "imitate",
        "successful",
        "member",
        "community",
        "henrich",
        "gilwhite",
        "one",
        "man",
        "tribe",
        "invented",
        "new",
        "snare",
        "weapon",
        "mean",
        "attack",
        "defense",
        "plainest",
        "selfinterest",
        "without",
        "assistance",
        "much",
        "reasoning",
        "power",
        "would",
        "prompt",
        "member",
        "imitate",
        "darwin",
        "imitation",
        "presumed",
        "fundamental",
        "speed",
        "cultural",
        "adaptation",
        "including",
        "adoption",
        "social",
        "norm",
        "section",
        "preferential",
        "attachment",
        "given",
        "choice",
        "form",
        "new",
        "connection",
        "someone",
        "pick",
        "individual",
        "connection",
        "others",
        "yule",
        "barabási",
        "albert",
        "simon",
        "b",
        "default",
        "rule",
        "applicable",
        "default",
        "rule",
        "apparent",
        "reason",
        "otherwise",
        "follow",
        "rule",
        "fisher",
        "reiter",
        "thaler",
        "sustein",
        "wheeler",
        "satisficing",
        "search",
        "available",
        "option",
        "choose",
        "first",
        "one",
        "exceeds",
        "aspiration",
        "level",
        "simon",
        "a",
        "hutchinson",
        "et",
        "al",
        "tallying",
        "estimate",
        "target",
        "criterion",
        "rather",
        "estimate",
        "weight",
        "available",
        "cue",
        "instead",
        "count",
        "number",
        "positive",
        "instance",
        "dawes",
        "dana",
        "dawes",
        "onebounce",
        "rule",
        "hey",
        "rule",
        "b",
        "least",
        "two",
        "search",
        "option",
        "stop",
        "price",
        "quote",
        "larger",
        "previous",
        "quote",
        "onebounce",
        "rule",
        "play",
        "winningstreaks",
        "continuing",
        "search",
        "keep",
        "receiving",
        "series",
        "lower",
        "lower",
        "quote",
        "stop",
        "soon",
        "luck",
        "run",
        "hey",
        "charness",
        "kuhn",
        "titfortat",
        "begin",
        "cooperating",
        "respond",
        "kind",
        "opponent",
        "opponent",
        "cooperates",
        "cooperate",
        "opponent",
        "defect",
        "defect",
        "axelrod",
        "rapaport",
        "seale",
        "colman",
        "linear",
        "optical",
        "trajectory",
        "lot",
        "intersect",
        "another",
        "moving",
        "object",
        "adjust",
        "speed",
        "angle",
        "gaze",
        "remains",
        "constant",
        "mcbeath",
        "et",
        "al",
        "gigerenzer",
        "takethebest",
        "decide",
        "two",
        "alternative",
        "higher",
        "value",
        "specific",
        "criterion",
        "first",
        "search",
        "cue",
        "order",
        "predictive",
        "validity",
        "ii",
        "next",
        "stop",
        "search",
        "cue",
        "found",
        "discriminates",
        "alternative",
        "iii",
        "choose",
        "alternative",
        "selected",
        "discriminating",
        "cue",
        "iv",
        "cue",
        "fail",
        "discriminate",
        "two",
        "alternative",
        "choose",
        "alternative",
        "chance",
        "einhorn",
        "gigerenzer",
        "goldstein",
        "recognition",
        "decide",
        "two",
        "alternative",
        "higher",
        "value",
        "specific",
        "criterion",
        "one",
        "two",
        "alternative",
        "recognized",
        "choose",
        "alternative",
        "recognized",
        "goldstein",
        "gigerenzer",
        "davisstober",
        "dana",
        "budescu",
        "pachur",
        "todd",
        "et",
        "al",
        "fluency",
        "decide",
        "two",
        "alternative",
        "higher",
        "value",
        "specific",
        "criterion",
        "alternative",
        "recognized",
        "one",
        "recognized",
        "faster",
        "choose",
        "alternative",
        "recognized",
        "faster",
        "schooler",
        "hertwig",
        "herzog",
        "hertwig",
        "frac",
        "n",
        "rule",
        "n",
        "feasible",
        "option",
        "invest",
        "resource",
        "equally",
        "across",
        "n",
        "option",
        "hertwig",
        "davis",
        "sulloway",
        "demiguel",
        "garlappi",
        "uppal",
        "three",
        "line",
        "response",
        "fast",
        "frugal",
        "program",
        "mention",
        "takethebest",
        "example",
        "noncompensatory",
        "decision",
        "rule",
        "mean",
        "first",
        "discriminating",
        "cue",
        "compensated",
        "cueinformation",
        "remaining",
        "order",
        "condition",
        "hold",
        "thought",
        "warrant",
        "taking",
        "decision",
        "first",
        "discriminating",
        "cue",
        "ignoring",
        "remaining",
        "cueinformation",
        "computational",
        "efficiency",
        "takethebest",
        "supposed",
        "come",
        "evaluating",
        "cue",
        "number",
        "le",
        "average",
        "benchmark",
        "test",
        "czerlinski",
        "et",
        "al",
        "however",
        "cue",
        "validity",
        "need",
        "known",
        "decisionmaker",
        "sorted",
        "initiating",
        "search",
        "takethebest",
        "design",
        "treat",
        "portion",
        "necessary",
        "computational",
        "cost",
        "execute",
        "heuristic",
        "exogenous",
        "although",
        "lowerbound",
        "sorting",
        "cue",
        "comparison",
        "n",
        "log",
        "n",
        "little",
        "evidence",
        "suggest",
        "human",
        "sort",
        "cue",
        "efficient",
        "sorting",
        "algorithm",
        "class",
        "contrary",
        "operation",
        "precisely",
        "kind",
        "qualitative",
        "probability",
        "judgment",
        "demand",
        "section",
        "furthermore",
        "addition",
        "cost",
        "ranking",
        "cue",
        "validity",
        "cost",
        "acquisition",
        "determination",
        "agent",
        "estimate",
        "noncompensatory",
        "although",
        "exact",
        "accounting",
        "cognitive",
        "effort",
        "presupposed",
        "unknown",
        "argued",
        "lower",
        "critic",
        "suggest",
        "katsikopoulos",
        "et",
        "al",
        "nevertheless",
        "necessary",
        "step",
        "threaten",
        "render",
        "takethebest",
        "noncompensatory",
        "execution",
        "necessary",
        "prior",
        "setting",
        "model",
        "execute",
        "second",
        "line",
        "criticism",
        "concern",
        "cognitive",
        "plausibility",
        "take",
        "best",
        "chater",
        "oaksford",
        "nakisa",
        "redington",
        "nearly",
        "empirical",
        "data",
        "performance",
        "characteristic",
        "takethebest",
        "computer",
        "simulation",
        "original",
        "competition",
        "pitted",
        "take",
        "best",
        "standard",
        "statistical",
        "model",
        "czerlinski",
        "et",
        "al",
        "omitted",
        "standard",
        "machine",
        "learning",
        "algorithm",
        "chater",
        "oaksford",
        "colleague",
        "found",
        "performed",
        "well",
        "take",
        "best",
        "since",
        "initial",
        "study",
        "focus",
        "shifted",
        "machine",
        "learning",
        "includes",
        "variant",
        "takethebest",
        "greedy",
        "cue",
        "permutation",
        "performs",
        "provably",
        "better",
        "original",
        "guaranteed",
        "always",
        "find",
        "accurate",
        "solution",
        "exist",
        "schmitt",
        "martignon",
        "setting",
        "aside",
        "criticism",
        "targeting",
        "comparative",
        "performance",
        "advantage",
        "take",
        "best",
        "qua",
        "decision",
        "model",
        "others",
        "questioned",
        "plausibility",
        "using",
        "takethebest",
        "cognitive",
        "model",
        "example",
        "takethebest",
        "presumes",
        "cueinformation",
        "processed",
        "serially",
        "speed",
        "advantage",
        "model",
        "translate",
        "advantage",
        "human",
        "decisionmaking",
        "derives",
        "human",
        "process",
        "cue",
        "information",
        "serial",
        "architecture",
        "instead",
        "people",
        "process",
        "cue",
        "information",
        "parallel",
        "cognitive",
        "architecture",
        "comparative",
        "speed",
        "advantage",
        "takethebest",
        "would",
        "become",
        "moot",
        "chater",
        "et",
        "al",
        "third",
        "line",
        "criticism",
        "concern",
        "whether",
        "fastandfrugal",
        "program",
        "truly",
        "mount",
        "challenge",
        "normative",
        "standard",
        "optimization",
        "dominancereasoning",
        "consistency",
        "advertised",
        "takethebest",
        "algorithm",
        "decisionmaking",
        "comport",
        "axiom",
        "expected",
        "utility",
        "theory",
        "one",
        "thing",
        "lexicographic",
        "structure",
        "violates",
        "archimedean",
        "axiom",
        "section",
        "a",
        "another",
        "presumed",
        "violate",
        "transitivity",
        "condition",
        "ordering",
        "axiom",
        "a",
        "still",
        "lessismore",
        "effect",
        "appear",
        "violate",
        "good",
        "principle",
        "good",
        "central",
        "pillar",
        "bayesian",
        "decision",
        "theory",
        "recommends",
        "delay",
        "making",
        "terminal",
        "decision",
        "alternative",
        "option",
        "opportunity",
        "arises",
        "acquire",
        "free",
        "information",
        "word",
        "according",
        "canonical",
        "bayesianism",
        "free",
        "advice",
        "bore",
        "one",
        "ought",
        "turn",
        "free",
        "information",
        "pedersen",
        "wheeler",
        "noncompensatory",
        "decision",
        "rule",
        "like",
        "takethebest",
        "violate",
        "good",
        "principle",
        "perhaps",
        "whole",
        "bayesian",
        "machinery",
        "ought",
        "go",
        "gigerenzer",
        "brighton",
        "point",
        "merely",
        "tell",
        "u",
        "attempt",
        "formulate",
        "takethebest",
        "term",
        "ordering",
        "prospect",
        "realvalued",
        "index",
        "ordering",
        "numerical",
        "index",
        "got",
        "go",
        "saw",
        "section",
        "long",
        "sizable",
        "literature",
        "lexicographic",
        "probability",
        "nonstandard",
        "analysis",
        "including",
        "early",
        "work",
        "specifically",
        "addressing",
        "noncompensatory",
        "nonlinear",
        "model",
        "einhorn",
        "second",
        "gigerenzer",
        "argues",
        "cognitive",
        "algorithmsneed",
        "meet",
        "important",
        "constraint",
        "internal",
        "consistency",
        "gigerenzer",
        "goldstein",
        "includes",
        "transitivity",
        "elsewhere",
        "advocate",
        "abandoning",
        "coherence",
        "normative",
        "standard",
        "arkes",
        "gigerenzer",
        "hertwig",
        "however",
        "takethebest",
        "presupposes",
        "cue",
        "ordered",
        "cue",
        "validity",
        "naturally",
        "entail",
        "transitivity",
        "otherwise",
        "takethebest",
        "could",
        "neither",
        "coherently",
        "specified",
        "effectively",
        "executed",
        "generally",
        "fast",
        "frugal",
        "school",
        "commitment",
        "formulating",
        "heuristic",
        "algorithmically",
        "implementing",
        "computational",
        "model",
        "commits",
        "normative",
        "standard",
        "optimization",
        "dominance",
        "reasoning",
        "logical",
        "consistency",
        "finally",
        "good",
        "principle",
        "state",
        "decisionmaker",
        "facing",
        "singleperson",
        "decisionproblem",
        "worse",
        "expectation",
        "receiving",
        "free",
        "information",
        "exception",
        "known",
        "game",
        "theory",
        "osborne",
        "however",
        "involve",
        "asymmetric",
        "information",
        "among",
        "two",
        "decisionmakers",
        "also",
        "exception",
        "singleperson",
        "decisionproblems",
        "involving",
        "indeterminate",
        "imprecise",
        "probability",
        "pedersen",
        "wheeler",
        "point",
        "good",
        "principle",
        "fundamental",
        "principle",
        "probabilistic",
        "method",
        "instead",
        "specific",
        "result",
        "hold",
        "canonical",
        "theory",
        "singleperson",
        "decisionmaking",
        "determinate",
        "probability"
    ]
}