{
    "main_text": "Life || The Grand Tour\n1.1 The Grand Tour\n\nIn Geneva on his continental tour Boyle underwent what he clearly felt\nto be a conversion from nominal or at least unthinking Christianity to\ncommitted Christianity. One summer night, he “was suddenly waked\nin a Fright with such loud Claps of Thunder … & every clap\n… both preceded & attended with Flashes of lightning so\nnumerous … & so dazling, that [he] began to imagine\n… the Day of Judgment’s being come.” This led him\nto vow that “all further additions to his life shud be more\nReligiously & carefully employ’d.” Realizing the\ninefficacy of a promise exacted under duress, Boyle repeated the\nperformance under a serene and cloudless sky “so solemnly that\nfrom that Day he dated his Conversion; renewing now he was past\nDanger, the vow he had made whilst he fancy’d himselfe to be in\nit: that tho his Feare was (& he blush’t it was so) the\n… occasion of his Resolution of Amendment; yet at least he\nmight not owe his more deliberate consecration … of himselfe to\nPiety, to any less noble Motive then that of it’s owne\nExcellence” (BP 37:181r-v, Hunter 1994a, 16).\n\nThe promise seems never to have been broken, and indeed the later\nBoyle stressed the need to have an examined faith. He pointed\nout that “usually, such as are born in such a place, espouse the\nopinions true or false, that obtain there” (BW, 12:421, Birch\n1772, VI:712), indeed, “the greatest number of those that pass\nfor Christians, profess themselves such only because Christianity is\nthe religion of their Parents, or their Country, or their Prince, or\nthose that have been, or may be, their Benefactors; which is in effect\nto say, that they are Christians, but upon the same grounds that would\nhave made them Mahometans, if they had been born and bred in\nTurky” (BP 7:233, BOA §3.7.5, pp 301–2). Boyle felt\nthat more was required of the thinking believer. Locke agreed: often a\nchild’s notion of God does more “resemble the Opinion, and\nNotion of the Teacher, than represent the True God” (Essay,\n1.14.13).\n\nHard on the heels of Boyle’s enlightenment, doubts about his\nfaith began to trouble\n him,[8]\n and these “distracting Doubts of some of the Fundamentals of\nChristianity” continued: “never after did these fleeting\nClouds, cease now & then to darken … the clearest serenity\nof his quiet: which made him often say that Injections of this Nature\nwere such a Disease to his Faith as the Tooth-ach is to the Body; for\ntho it be not mortall, ‘tis very troublesome” (BP 37:182r,\nHunter 1994a, 17).\n\nLeaving Switzerland, Boyle, along with Marcombes and his brother\ncrossed the Alps and entered Italy in September 1641 where, in\nFlorence, he spent the winter. “In Italy he read over\nthe lives of the ancient philosophers with the utmost\nattention,” presumably in Diogenes Laertius, and “[t]he\nsect, which then struck him most, was that of the Stoics; and he tried\nhis proficiency in their philosophy, by enduring a long fit of the\ntooth-ach with great\n unconcernedness.”[9]\n Still in Italy he had (in the winter of 41–42) what seems to\nhave been one of the very few sexual encounters of his life. Writing\nabout himself in the third person as Philaretus (sometimes P., or\nFilaretus) he says:\n\nNor did he sometimes scruple, in his Governor’s Company, to\nvisit the famousest Bordellos; whither resorting out of bare\nCuriosity, he retain’d there an unblemish’t Chastity,\n& still return’d thence as honest as he went thither.\nProfessing that he never found any such sermons against them, as they\nwere against themselves. The Impudent Nakednesse of vice, clothing it\nwith a Difformity, Description cannot reach, & the worst of\nEpithetes cannot but flatter. But tho P. were noe Fewell for forbidden\nFlames, he prov’d the Object of unnaturall ones. For being at\nthat Time not above 15, & the Cares of the World having not yet\nfaded a Complexion naturally fresh enuf; as he was once\nunaccompany’d diverting himselfe abroad, he was somewhat rudely\npresst by the Preposterous Courtship of 2 of those Fryers, whose Lust\nmakes no distinction of Sexes; but that which it’s Preference of\ntheir owne creates; & not without Difficulty, & Danger,\nforc’t a scape from these gown’d Sodomites. Whose Goatish\nHeates, serv’d not a little to arme Filaretus against such\nPeoples specious Hyprocrisy; & heightn’d &\nfortify’d in him an Aversenesse for Opinions, which now the\nReligieux discredit as well as the Religion (BP 37:184r-v, Hunter\n1994a, 20).\n\n\nLeaving Italy Marcombes and the two boys found on arrival in\nMarseilles that the monies the Great Earl had been in the habit of\nsending were no longer to arrive and that, indeed, the last\nquarter’s payment had been held up by Cork’s London agent.\nMoreover, there was a letter from the Earl, unaware of the mischance\naffecting the quarterly payment, telling them that, as a result of the\nrebellion in Ireland, no more money was to be forthcoming: in the\n“dangerous and poore estate whereunto by gods providence”\nhe had been reduced, he had “with much difficulty gott together\ntwo hundred and fifty pounds by selling of plate,” but to pay\nMarcombes’ bills punctually as he had in the past “I am\nnoe waies able.” So he advised Marcombes to use the money to\nbring the two boys\n\nout of some meet port in France to land either at dublin, Corke, or\nYoughall, (for all other Cities and Sea townes are possessed by the\nenemy), or else my two sonnes [must] travaile into Holland, and putt\nthemselves into entertaynement under the service and conduct of the\nPrince of Orange; for they must henceforward maintayne themselves by\nsuch entertaynements as they gett in the warres (Earl of Cork to\nMarcombes 9 March 1641/2, Maddison 1969, 47).\n\n\nIn the event Francis decided to return to Ireland, arriving in time to\nfight in the Battle of Liscarrol (September 3, 1642), at which another\nBoyle brother, Lewis, was killed. Meanwhile Robert decided that his\nhealth and lack of money ruled out a return to Ireland, and his age\nmade soldiering in Holland an untempting and indeed implausible\n prospect.[10]\n He therefore decided to accept Marcombes’ offer of hospitality\nin Geneva, and did not make his way to England until the summer of\n1644.\n\nBefore leaving Geneva Boyle had a conversation with François\nPerreaud (1572–1657), who later wrote Démonographie,\nou traité des démons, which Boyle then arranged to\nhave translated into English by Peter du Moulin (the younger,\n1601–1684). In a letter prefixed to the English edition Boyle\nrecalled that “the conversation I had with that pious Author\nduring my stay at Geneva, and the present he was pleased to\nmake me of this Treatise before it was printed, in a place where I had\nopportunities to enquire both after the writer, and some passages of\nthe booke, did at length overcome in me (as to this narrative) all my\nsettled indisposedness to believe strange things.” (BW 1:15)\nAcceptance of at least the possibility of diabolic or angelic\nintervention was common among the intelligentsia in the second half of\nthe seventeenth century. Cudworth pointed out one expedient reason for\nthe belief:\n\nall these Extraordinary Phænomena, of Apparitions,\nWitchcraft, Possessions, Miracles, and Prophecies, do Evince\nthat Spirits, Angels or Demons, though Invisible to\nus, are no Phancies, but Real and Substantial\nInhabitants of the World; which favours not the Atheistick\nHypothesis; but some of them, as the Higher kind of Miracles, and\nPredictions, do also immediatly enforce the acknowledgment of a\nDeity: a Being superiour to Nature, which therefore\ncan check and controul it; and which comprehending the whole,\nforeknows the most Remotely distant, and Contingent\nEvents (Cudworth 1678,\n 715).[11].\n \n\nIn a manuscript draft (“Loose papers whence some things are to\nbe extracted for the Discourse of the causes of Atheism”) Boyle\nconsidered three objections that might be made against such a belief:\nthe implausibility of the standard means of bringing about such\nintervention; the unreliability of the witnesses; and the\nimpossibility of incorporeal beings interacting with matter. He agrees\nthat the first objection, “urg’d with great confidence,\nand not without much show of Reason” is a strong one, but\nsuggests that “we men understand very little of the nature,\ncustomes, & government of the Intelligent creatures of the\nspirituall world: and particularly what concernes the Falne Angells or\nbad Daemons. And therefore they being themselves invisible to us, and\ncapable of working in wayes that our sences cannot discerne; and being\nAgents of great craft & long experience; tis no wonder that many\nof their actions, thô never so pollytickly contrived &\ncarried on, should seem irrationall to us: who know so little of their\nparticular inclinations & designes, and the subtil & secret\nmethods in which they carry them on.”\n\nThe second objection he also accepts, though not wholly:\n“thô upon particular & cogent proofe I beleeve some of\nthem to be true … yet I reject or distrust far the greatest\npart, as not being soe attested.” The third he rejects as being\nsimply inconsistent, for the human soul is accepted as incorporeal,\nand it works (though we know not how) on matter (BP 2:105, BOA\n§3.5.21, pp 257–8).\n\nWhen Boyle arrived back in England in mid-1644 at the age of 17 he was\nquickly reunited with his sister Katherine who seems immediately to\nhave re-adopted the semi-maternal role she had no doubt often played\nafter the death of their mother. She was concerned in a variety of\nother ways to look after his welfare, both spiritual and worldly. She\nwas, for example, the immediate cause of his getting to know the\nmembers of the Hartlib\n circle.[12]\n\nAt this time Boyle settled in Stalbridge (on an estate left to him by\nhis father) and occupied himself mainly in writing or planning works\nin ethics and theology. Much of his time during the early part of this\nStalbridge period was spent in moral philosophy — “My\nEthics go very slowly on,” he wrote to his sister\nKatherine on March 30, 1646 (BC 1:34) — and there was at this\nstage no reason to think that he would become one of the great natural\nphilosophers of his time. (See further, Hunter 2009, chs. 4 and 5;\nCorneanu 2020.) He already approximated to the\n“lay-bishop” that Aubrey, quoting Anthony Walker, was\nlater to find him to be. He was, in fact, a serious, somewhat priggish\nyoung man, though he often gave signs of light-heartedness both as a\nboy and in later life. After his death Gilbert Burnet claimed that\n“As for Joy, he had indeed nothing of Frolick and Levity in\nhim,” a judgement accepted by Steven Shapin, but this fails to\nallow for the lighter moments that Boyle undoubtedly\n enjoyed.[13]\n",
    "section_title": "1.1 The Grand Tour",
    "entry_title": "Robert Boyle",
    "hierarchy_title": "Robert Boyle || Life || The Grand Tour",
    "tokenized_text": [
        "life",
        "grand",
        "tour",
        "grand",
        "tour",
        "geneva",
        "continental",
        "tour",
        "boyle",
        "underwent",
        "clearly",
        "felt",
        "conversion",
        "nominal",
        "least",
        "unthinking",
        "christianity",
        "committed",
        "christianity",
        "one",
        "summer",
        "night",
        "suddenly",
        "waked",
        "fright",
        "loud",
        "clap",
        "thunder",
        "every",
        "clap",
        "preceded",
        "attended",
        "flash",
        "lightning",
        "numerous",
        "dazling",
        "began",
        "imagine",
        "day",
        "judgment",
        "come",
        "led",
        "vow",
        "addition",
        "life",
        "shud",
        "religiously",
        "carefully",
        "employ",
        "d",
        "realizing",
        "inefficacy",
        "promise",
        "exacted",
        "duress",
        "boyle",
        "repeated",
        "performance",
        "serene",
        "cloudless",
        "sky",
        "solemnly",
        "day",
        "dated",
        "conversion",
        "renewing",
        "past",
        "danger",
        "vow",
        "made",
        "whilst",
        "fancy",
        "himselfe",
        "tho",
        "feare",
        "blush",
        "occasion",
        "resolution",
        "amendment",
        "yet",
        "least",
        "might",
        "owe",
        "deliberate",
        "consecration",
        "himselfe",
        "piety",
        "le",
        "noble",
        "motive",
        "owne",
        "excellence",
        "bp",
        "rv",
        "hunter",
        "a",
        "promise",
        "seems",
        "never",
        "broken",
        "indeed",
        "later",
        "boyle",
        "stressed",
        "need",
        "examined",
        "faith",
        "pointed",
        "usually",
        "born",
        "place",
        "espouse",
        "opinion",
        "true",
        "false",
        "obtain",
        "bw",
        "birch",
        "vi",
        "indeed",
        "greatest",
        "number",
        "pas",
        "christian",
        "profess",
        "christianity",
        "religion",
        "parent",
        "country",
        "prince",
        "may",
        "benefactor",
        "effect",
        "say",
        "christian",
        "upon",
        "ground",
        "would",
        "made",
        "mahometans",
        "born",
        "bred",
        "turky",
        "bp",
        "boa",
        "pp",
        "boyle",
        "felt",
        "required",
        "thinking",
        "believer",
        "locke",
        "agreed",
        "often",
        "child",
        "notion",
        "god",
        "resemble",
        "opinion",
        "notion",
        "teacher",
        "represent",
        "true",
        "god",
        "essay",
        "hard",
        "heel",
        "boyle",
        "enlightenment",
        "doubt",
        "faith",
        "began",
        "trouble",
        "distracting",
        "doubt",
        "fundamental",
        "christianity",
        "continued",
        "never",
        "fleeting",
        "cloud",
        "cease",
        "darken",
        "clearest",
        "serenity",
        "quiet",
        "made",
        "often",
        "say",
        "injection",
        "nature",
        "disease",
        "faith",
        "toothach",
        "body",
        "tho",
        "mortall",
        "ti",
        "troublesome",
        "bp",
        "r",
        "hunter",
        "a",
        "leaving",
        "switzerland",
        "boyle",
        "along",
        "marcombes",
        "brother",
        "crossed",
        "alp",
        "entered",
        "italy",
        "september",
        "florence",
        "spent",
        "winter",
        "italy",
        "read",
        "life",
        "ancient",
        "philosopher",
        "utmost",
        "attention",
        "presumably",
        "diogenes",
        "laertius",
        "sect",
        "struck",
        "stoic",
        "tried",
        "proficiency",
        "philosophy",
        "enduring",
        "long",
        "fit",
        "toothach",
        "great",
        "unconcernedness",
        "still",
        "italy",
        "winter",
        "seems",
        "one",
        "sexual",
        "encounter",
        "life",
        "writing",
        "third",
        "person",
        "philaretus",
        "sometimes",
        "p",
        "filaretus",
        "say",
        "sometimes",
        "scruple",
        "governor",
        "company",
        "visit",
        "famousest",
        "bordello",
        "whither",
        "resorting",
        "bare",
        "curiosity",
        "retain",
        "unblemish",
        "chastity",
        "still",
        "return",
        "thence",
        "honest",
        "went",
        "thither",
        "professing",
        "never",
        "found",
        "sermon",
        "impudent",
        "nakednesse",
        "vice",
        "clothing",
        "difformity",
        "description",
        "reach",
        "worst",
        "epithetes",
        "flatter",
        "tho",
        "p",
        "noe",
        "fewell",
        "forbidden",
        "flame",
        "prov",
        "object",
        "unnaturall",
        "one",
        "time",
        "care",
        "world",
        "yet",
        "faded",
        "complexion",
        "naturally",
        "fresh",
        "enuf",
        "unaccompany",
        "diverting",
        "himselfe",
        "abroad",
        "somewhat",
        "rudely",
        "presst",
        "preposterous",
        "courtship",
        "fryer",
        "whose",
        "lust",
        "make",
        "distinction",
        "sex",
        "preference",
        "owne",
        "creates",
        "without",
        "difficulty",
        "danger",
        "forc",
        "scape",
        "gown",
        "sodomite",
        "whose",
        "goatish",
        "heates",
        "serv",
        "little",
        "arme",
        "filaretus",
        "people",
        "specious",
        "hyprocrisy",
        "heightn",
        "fortify",
        "aversenesse",
        "opinion",
        "religieux",
        "discredit",
        "well",
        "religion",
        "bp",
        "rv",
        "hunter",
        "a",
        "leaving",
        "italy",
        "marcombes",
        "two",
        "boy",
        "found",
        "arrival",
        "marseille",
        "monies",
        "great",
        "earl",
        "habit",
        "sending",
        "longer",
        "arrive",
        "indeed",
        "last",
        "quarter",
        "payment",
        "held",
        "cork",
        "london",
        "agent",
        "moreover",
        "letter",
        "earl",
        "unaware",
        "mischance",
        "affecting",
        "quarterly",
        "payment",
        "telling",
        "result",
        "rebellion",
        "ireland",
        "money",
        "forthcoming",
        "dangerous",
        "poore",
        "estate",
        "whereunto",
        "god",
        "providence",
        "reduced",
        "much",
        "difficulty",
        "gott",
        "together",
        "two",
        "hundred",
        "fifty",
        "pound",
        "selling",
        "plate",
        "pay",
        "marcombes",
        "bill",
        "punctually",
        "past",
        "noe",
        "way",
        "able",
        "advised",
        "marcombes",
        "use",
        "money",
        "bring",
        "two",
        "boy",
        "meet",
        "port",
        "france",
        "land",
        "either",
        "dublin",
        "corke",
        "youghall",
        "city",
        "sea",
        "townes",
        "possessed",
        "enemy",
        "else",
        "two",
        "sonnes",
        "must",
        "travaile",
        "holland",
        "putt",
        "entertaynement",
        "service",
        "conduct",
        "prince",
        "orange",
        "must",
        "henceforward",
        "maintayne",
        "entertaynements",
        "gett",
        "warres",
        "earl",
        "cork",
        "marcombes",
        "march",
        "maddison",
        "event",
        "francis",
        "decided",
        "return",
        "ireland",
        "arriving",
        "time",
        "fight",
        "battle",
        "liscarrol",
        "september",
        "another",
        "boyle",
        "brother",
        "lewis",
        "killed",
        "meanwhile",
        "robert",
        "decided",
        "health",
        "lack",
        "money",
        "ruled",
        "return",
        "ireland",
        "age",
        "made",
        "soldiering",
        "holland",
        "untempting",
        "indeed",
        "implausible",
        "prospect",
        "therefore",
        "decided",
        "accept",
        "marcombes",
        "offer",
        "hospitality",
        "geneva",
        "make",
        "way",
        "england",
        "summer",
        "leaving",
        "geneva",
        "boyle",
        "conversation",
        "françois",
        "perreaud",
        "later",
        "wrote",
        "démonographie",
        "ou",
        "traité",
        "de",
        "démons",
        "boyle",
        "arranged",
        "translated",
        "english",
        "peter",
        "du",
        "moulin",
        "younger",
        "letter",
        "prefixed",
        "english",
        "edition",
        "boyle",
        "recalled",
        "conversation",
        "pious",
        "author",
        "stay",
        "geneva",
        "present",
        "pleased",
        "make",
        "treatise",
        "printed",
        "place",
        "opportunity",
        "enquire",
        "writer",
        "passage",
        "booke",
        "length",
        "overcome",
        "narrative",
        "settled",
        "indisposedness",
        "believe",
        "strange",
        "things",
        "bw",
        "acceptance",
        "least",
        "possibility",
        "diabolic",
        "angelic",
        "intervention",
        "common",
        "among",
        "intelligentsia",
        "second",
        "half",
        "seventeenth",
        "century",
        "cudworth",
        "pointed",
        "one",
        "expedient",
        "reason",
        "belief",
        "extraordinary",
        "phænomena",
        "apparition",
        "witchcraft",
        "possession",
        "miracle",
        "prophecy",
        "evince",
        "spirit",
        "angel",
        "demon",
        "though",
        "invisible",
        "u",
        "phancies",
        "real",
        "substantial",
        "inhabitant",
        "world",
        "favour",
        "atheistick",
        "hypothesis",
        "higher",
        "kind",
        "miracle",
        "prediction",
        "also",
        "immediatly",
        "enforce",
        "acknowledgment",
        "deity",
        "superiour",
        "nature",
        "therefore",
        "check",
        "controul",
        "comprehending",
        "whole",
        "foreknows",
        "remotely",
        "distant",
        "contingent",
        "event",
        "cudworth",
        "manuscript",
        "draft",
        "loose",
        "paper",
        "whence",
        "thing",
        "extracted",
        "discourse",
        "cause",
        "atheism",
        "boyle",
        "considered",
        "three",
        "objection",
        "might",
        "made",
        "belief",
        "implausibility",
        "standard",
        "mean",
        "bringing",
        "intervention",
        "unreliability",
        "witness",
        "impossibility",
        "incorporeal",
        "being",
        "interacting",
        "matter",
        "agrees",
        "first",
        "objection",
        "urg",
        "great",
        "confidence",
        "without",
        "much",
        "show",
        "reason",
        "strong",
        "one",
        "suggests",
        "men",
        "understand",
        "little",
        "nature",
        "customes",
        "government",
        "intelligent",
        "creature",
        "spirituall",
        "world",
        "particularly",
        "concernes",
        "falne",
        "angells",
        "bad",
        "daemon",
        "therefore",
        "invisible",
        "u",
        "capable",
        "working",
        "wayes",
        "sences",
        "discerne",
        "agent",
        "great",
        "craft",
        "long",
        "experience",
        "ti",
        "wonder",
        "many",
        "action",
        "thô",
        "never",
        "pollytickly",
        "contrived",
        "carried",
        "seem",
        "irrationall",
        "u",
        "know",
        "little",
        "particular",
        "inclination",
        "designes",
        "subtil",
        "secret",
        "method",
        "carry",
        "on",
        "second",
        "objection",
        "also",
        "accepts",
        "though",
        "wholly",
        "thô",
        "upon",
        "particular",
        "cogent",
        "proofe",
        "beleeve",
        "true",
        "yet",
        "reject",
        "distrust",
        "far",
        "greatest",
        "part",
        "soe",
        "attested",
        "third",
        "reject",
        "simply",
        "inconsistent",
        "human",
        "soul",
        "accepted",
        "incorporeal",
        "work",
        "though",
        "know",
        "matter",
        "bp",
        "boa",
        "pp",
        "boyle",
        "arrived",
        "back",
        "england",
        "mid",
        "age",
        "quickly",
        "reunited",
        "sister",
        "katherine",
        "seems",
        "immediately",
        "readopted",
        "semimaternal",
        "role",
        "doubt",
        "often",
        "played",
        "death",
        "mother",
        "concerned",
        "variety",
        "way",
        "look",
        "welfare",
        "spiritual",
        "worldly",
        "example",
        "immediate",
        "cause",
        "getting",
        "know",
        "member",
        "hartlib",
        "circle",
        "time",
        "boyle",
        "settled",
        "stalbridge",
        "estate",
        "left",
        "father",
        "occupied",
        "mainly",
        "writing",
        "planning",
        "work",
        "ethic",
        "theology",
        "much",
        "time",
        "early",
        "part",
        "stalbridge",
        "period",
        "spent",
        "moral",
        "philosophy",
        "ethic",
        "go",
        "slowly",
        "wrote",
        "sister",
        "katherine",
        "march",
        "bc",
        "stage",
        "reason",
        "think",
        "would",
        "become",
        "one",
        "great",
        "natural",
        "philosopher",
        "time",
        "see",
        "hunter",
        "chs",
        "corneanu",
        "already",
        "approximated",
        "laybishop",
        "aubrey",
        "quoting",
        "anthony",
        "walker",
        "later",
        "find",
        "fact",
        "serious",
        "somewhat",
        "priggish",
        "young",
        "man",
        "though",
        "often",
        "gave",
        "sign",
        "lightheartedness",
        "boy",
        "later",
        "life",
        "death",
        "gilbert",
        "burnet",
        "claimed",
        "joy",
        "indeed",
        "nothing",
        "frolick",
        "levity",
        "judgement",
        "accepted",
        "steven",
        "shapin",
        "fails",
        "allow",
        "lighter",
        "moment",
        "boyle",
        "undoubtedly",
        "enjoyed"
    ]
}