{
    "main_text": "Boyle’s World View || The creation of the world\n3.1 The creation of the world\n\nBoyle had a straightforward notion of creation. First of all God, at a\nparticular, fairly recent, point in absolute time, made matter. Boyle\nwas an admirer of “our Irish St.\nAustin”(BC 1:40), James Ussher, archbishop of Armagh,\nwho famously propounded what seems to us, though not to his\ncontemporaries, to be a very late date (4004 b.c.) for creation. Boyle\nsaw “no just reason to embrace their opinion, that would so turn\nthe two first chapters of Genesis, into an allegory, as to\noverthrow the literal and historical sense of them” and, noting\nthe implausibility of the claims of “some extravagant ambitious\nPeople, such as those fabulous Chaldeans, whose fond account\nreach’d up to 40000 or 50000 years,” held that\n“Theology teaches us, that the World is very far from being so\nold by 30 or 40 thousand years as they … have presum’d:\nand does, from the Scripture, give us such an account of the age of\nthe World, that it has set us certain Limits, within which so long a\nDuration may be bounded, without mistaking in our Reckoning. Whereas\nPhilosophy leaves us to the vastness of Indeterminate Duration,\nwithout any certain Limits at all” (BW, 8:21; Birch 1772,\nIV:11). Revelation gives us (1) truths of which we would otherwise be\nignorant, such as “the order and time of the Creation of the\nWorld and of the first man and woman”; (2) details of truths\nwhich we can otherwise obtain “but very dimly, incogently, and\ndefectively”\n\nsuch as … That the World had a beginning, that ‘tis\nupheld and govern’d by Gods general concourse & providence;\nthat God has a peculiar regard to mankind; and a propitious one to\ngood men; that he foresees those future things, we call\ncontingent: that mens souls shall not dye with their bodyes,\nand many other articles of the Philosophers, as well as the Christians\nCreed (BP 7:242, 4:10–12, BW 14:268–9).\n\n\nAdditionally there are (3) “hints” which lead us\nto truths we would otherwise miss, such as “that whatever men\nhave generally believ’d, Vegetables had their Origine\nindependent from the Sun, the earth having producd all kinds of plants\na day before God made that Luminary” (BP 7:243, 4:15, BW\n14:271). Moreover,\n\nit ought much to recommend many of the things that Revelation\ndiscovers to us, that they are congruous, and if I may so speak\nSymmetrical to what reason it self teaches us; and this Supernatural\nLight does not only confirm, but advance and compleat the truths\ndiscoverable by the light of nature. For God has so excellently orderd\nthe discoverys he makes of Theological <Veritys> by meer reason,\nand by the holy Scriptures, that what Revelation superadds to Reason,\ndoes both very well agree with it, and supply what was wanting to it,\nthat from them both might result as compleat a body of Theological\nVerities, as is either necessary or fit for us in our Mortal State (BP\n7:245–6, 4:23, BW 14:275). (See further MacIntosh 1992.)\n\n\nUnsurprisingly, then, Boyle makes a point of attempting to bring his\ncreation story into line with a literal interpretation of the Genesis\nstory. God, he believes, could have started things off earlier or\nlater, but chose not to. Having created matter, he broke it up and\nstarted it moving. Sometimes Boyle says he broke it up by\nstarting it\n moving.[29]\nThen he gave it laws, since the “casual justlings of\natoms” would not, Boyle thinks, have given rise to this\n world.[30]\n Hooke, explicating Genesis, argued for the same ordering. For Boyle\nand Hooke, that is, a world without laws is not only possible, our\nworld was such a world for a time. In the previous century Konrad\nDaspodius held that comets “drift without laws,” but by\n1686 Leibniz was writing, “God does nothing out of order, and it\nis impossible even to feign events which are not\n regular.”[31]\n Leibniz’s point was that just as any ‘random’\nsequence of points will determine a curve (actually an infinite set of\ncurves, but Leibniz only needed the lesser claim), so any sequence of\nevents will conform to a regular pattern. Generalizing, we might say\nthat just as points underdetermine equations, so facts underdetermine\ntheories.\n\nIt should be noted however that for Leibniz, as for a number of his\ncontemporaries, not all such laws need be laws of\n nature.[32]\n Malebranche, for example, in his Dialogues on Metaphysics,\noffered no fewer than five distinct types of law: “general laws\nof the communication of motion, … laws of the union of soul and\nbody, … laws of the union of the soul with God, with the\nintelligible substance of universal Reason, … general laws\nwhich give good and bad Angels power over bodies, … finally,\nthe laws by which Jesus Christ received sovereign power in Heaven and\non earth, over minds as well as bodies, not only to distribute\ntemporal goods … but to diffuse (répandre)\ninternal grace in our hearts” (Entretiens sur la\nMétaphysique, in Malebranche 1962,\n 12:319–320).[33]\n\nBoyle’s position is an intermediate one between the claim that\nsome objects or events are lawless, and the claim that lawlessness is\nimpossible. For Boyle, physical objects do exhibit nomological\nregularities, but this is a contingent fact about the world, or\nrather, for Boyle was cautious about generalizing, about the\nspatio-temporal portion of it we occupy. He agrees, however, that\nthere are laws that are not laws of nature, with the laws of\ninterconnection between body and soul providing, for him, an obvious\nexample. This interconnection also provides a clear example of a state\nwhich God constantly preserves.\n\nAfter having made matter, started it moving, and given it laws, God\nthen formed the matter into particular structures and shapes,\nincluding certain “seeds.” Then he added some\n“seminal principles” with formative plastic powers. Boyle\ndoes not clearly indicate whether or not these are a special subclass\nof natural laws affecting matter, or whether they are in some way what\nhe sometimes calls “supra-mechanical,” though he does\npoint out that if there is a mechanism for animal inheritance, then it\nwould seem to require a framing intelligent agent (BW, 12:445–6,\nBirch 1772, VI:728–9. See Anstey 2002a and Inglehart 2015 for a\nfull discussion of the issue.). His older contemporary Harvey, much\nadmired by Boyle, was in no doubt about the matter, pouring scorn on\nthose who talk\n\nAs if (forsooth) Generation were nothing in the world but a\nmeer Separation, or Collection, or Order of things. I do not indeed\ndeny that to the Production of one thing out of another, these\nfore-mentioned things are requisite, but Generation her self\nis a thing quite distinct from them all … (Harvey 1653, 51).\n\n\nAll this holds for the corporeal universe, as opposed to the three\nsorts of incorporeal creatures God created or, in our case, continues\nto create: angels, evil demons, and human souls: the good, the bad,\nand the\n imprisoned.[34]\n The angels were created “before the visible World … was\nhalf compleated,” but God creates new human souls daily, and\nmoreover works a “physical miracle” to attach them to\ntheir respective bodies (BP 7:243, 4:14, BW 14:271; BP\n 2:62).[35]\n Sometimes Boyle felt that although humans are made in God’s\nimage they, like other created beings, are “at their best but\numbratile, and Arbitrary Pictures of God their Creatour” (BP\n4:4, BOA §2.2.38, p. 145). Elsewhere, however, he offers a more\ntraditional account of the soul as the image of God:\n\nThe Christian virtuoso considers the rational soul, not barely as it\nguides the motions of that living engine, we call the body, but as it\nis a kind of imprisoned angel, that bears the image of God, and is\ncapable of knowing, both ourselves and him; and by a consciousness of\nher being his production, is capable of acknowledgeing, loving, and\nobeying him, and referring to his glory all the excellencies she\ndiscovers, both in herself, and in the body she is united to; by which\njust reference, she is, by his goodness, in his divine Son, made\ncapable of becoming incomparably more knowing, than here she is, and\neternally happy with him (BW, 12:504, Birch 1772, VI:775).\n\n\nAlthough humans are made in the image of God, they are considerably\nless clever than the\n angels,[36]\n and since it is quite possible that God’s primary end in making\nthe universe was to provide a universe for the angels, and not\ncentrally for humans, it is thereby quite possible that the universe\nwill be too complicated for us to understand:\n\n[I]f God be allowed to be, as indeed he is, the Author of the\nUniverse, how will it appear that He, whose Knowledge infinitely\ntranscends ours, and who may be suppos’d to operate according to\nthe Dictates of his own immense Wisdom, should, in his Creating of\nthings, have respect to the measure and ease of Humane Understandings;\nand not rather, if of any, of Angelical Intellects? So that whether it\nbe to God or to Chance, that we ascribe the Production of things, that\nway may often be fittest or likelyest for Nature to work by, which is\nnot easiest for us to understand (BW, 3:257, Birch 1772, II:46).\n\n\n“[W]e presume too much of our own abilities,” Boyle wrote,\nc. 1680, “if we imagine that the omniscient God can have no\nother Ends in the framing & managing of Things Corporeal, than\nsuch as we Men can discover” (Boyle MS 198, fol. 120, BP 7:116,\nBOA §3.6.3, p 267). It follows at once that while simplicity may\noften be our best guide as to what working hypothesis to choose, we\nshould not think it to be inevitably a reliable guide to truth.\n\nWhy did God create the universe in this piecemeal way? What is\nBoyle’s rationale for thinking that God didn’t just start\noff by creating matter in motion with the proper directed velocities\nand letting it give rise to the present world in its own good time? Or\nwhy not suppose that he created the present world as a going\nconcern? Boyle doesn’t tell us, but two points stand out.\n\nFirst of all, it certainly fits the fact that Boyle has a very limited\nview of\n omnipotence.[37]\n Here he is, for example, bemused by the swiftness of God’s\ncreative ability:\n\nAs great a Number & variety of parts as a living Humane Body\nconsists of, ‘tis highly probable that the Lump of\n Stupid[38]\n matter out of which they were fashion’d, was contriv’d\ninto this admirable System; if not in a moment, yet in a very short\ntime. For the sacred story relates, that man was not created till\n<about> the end of the six dayes work; and since in One day God\ncreated all the four footed Beasts, (wilde & tame,) and all the\nnumerous Reptiles that creep upon the Earth after their kind;\n‘tis no way improbable that among so great a multitude of\ndiffering species of Animals, or Living Engines, that were\nmade in one Part of the same sixth day, God should make a Humane\nAnimal in an extreamly short time, not to say in a trice (BP\n4:85, BOA §2.2.68, p 161). [Here and throughout in quotations,\nthe emphasis is in the original.]\n\n\nDoing things step by step, fairly quickly, and with moderate success,\nwas quite enough to excite Boyle’s admiration for the Almighty\nand, though he had certainly read Descartes’s\nPrinciples (in which Descartes remarks explicitly that\nalthough God could have let things work their way from a very\ndifferent initial state to the present world, in fact God\nstarted the world off in medias res), it is quite possible\nthat the alternative did not strike him as likely: he was not, after\nall, a mathematician, or even a mathematical\n physicist.[39]\n\nGiven this, and the fact that motion was not natural to matter, but\nhad to be added to it, it would seem plausible to Boyle that God\ncreated matter first, and then gave it a push, particularly since the\npush had to be precisely fine tuned in order to yield just the world\nwe now have. (That matter is not naturally in motion forms the basis\nof one of Boyle’s criticisms of Epicurus. Boyle takes Epicurus\nto hold that motion is an innate property of matter. How\nthen, asks Boyle, are we to explain the fact that it is lost or\nchanged as a result of collision between particles? (BP 2:5, BOA\n§4.1, p 340).) Additionally, Boyle notices that no system of laws\ncan offer a complete explanation: we also need an account of the\ninitial\n parameters.[40]\n But then, since they are logically distinct, why not have them\nchronologically distinct as well?\n\nSecondly, there are, perhaps, historical reasons. For Boyle is\nconscious of himself as building on past views, and such views\ntypically treated matter as giving rise to the present world, and, in\nthe case of some past thinkers, at least, as having existed in a\nconstant state for some time before the initiating changes that led to\nthe present world occurred. The notion of a piecemeal creation, that\nis, fits Boyle’s views of God’s abilities, fits\nGenesis, and fits the views of previous thinkers. Probably we\ndo not need to look farther for an explanation for his adopting such a\nview.\n",
    "section_title": "3.1 The creation of the world",
    "entry_title": "Robert Boyle",
    "hierarchy_title": "Robert Boyle || Boyle’s World View || The creation of the world",
    "tokenized_text": [
        "boyle",
        "world",
        "view",
        "creation",
        "world",
        "creation",
        "world",
        "boyle",
        "straightforward",
        "notion",
        "creation",
        "first",
        "god",
        "particular",
        "fairly",
        "recent",
        "point",
        "absolute",
        "time",
        "made",
        "matter",
        "boyle",
        "admirer",
        "irish",
        "st",
        "austin",
        "bc",
        "james",
        "ussher",
        "archbishop",
        "armagh",
        "famously",
        "propounded",
        "seems",
        "u",
        "though",
        "contemporary",
        "late",
        "date",
        "bc",
        "creation",
        "boyle",
        "saw",
        "reason",
        "embrace",
        "opinion",
        "would",
        "turn",
        "two",
        "first",
        "chapter",
        "genesis",
        "allegory",
        "overthrow",
        "literal",
        "historical",
        "sense",
        "noting",
        "implausibility",
        "claim",
        "extravagant",
        "ambitious",
        "people",
        "fabulous",
        "chaldean",
        "whose",
        "fond",
        "account",
        "reach",
        "year",
        "held",
        "theology",
        "teach",
        "u",
        "world",
        "far",
        "old",
        "thousand",
        "year",
        "presum",
        "scripture",
        "give",
        "u",
        "account",
        "age",
        "world",
        "set",
        "u",
        "certain",
        "limit",
        "within",
        "long",
        "duration",
        "may",
        "bounded",
        "without",
        "mistaking",
        "reckoning",
        "whereas",
        "philosophy",
        "leaf",
        "u",
        "vastness",
        "indeterminate",
        "duration",
        "without",
        "certain",
        "limit",
        "bw",
        "birch",
        "iv",
        "revelation",
        "give",
        "u",
        "truth",
        "would",
        "otherwise",
        "ignorant",
        "order",
        "time",
        "creation",
        "world",
        "first",
        "man",
        "woman",
        "detail",
        "truth",
        "otherwise",
        "obtain",
        "dimly",
        "incogently",
        "defectively",
        "world",
        "beginning",
        "ti",
        "upheld",
        "govern",
        "god",
        "general",
        "concourse",
        "providence",
        "god",
        "peculiar",
        "regard",
        "mankind",
        "propitious",
        "one",
        "good",
        "men",
        "foresees",
        "future",
        "thing",
        "call",
        "contingent",
        "men",
        "soul",
        "shall",
        "dye",
        "bodyes",
        "many",
        "article",
        "philosopher",
        "well",
        "christian",
        "creed",
        "bp",
        "bw",
        "additionally",
        "hint",
        "lead",
        "u",
        "truth",
        "would",
        "otherwise",
        "miss",
        "whatever",
        "men",
        "generally",
        "believ",
        "vegetable",
        "origine",
        "independent",
        "sun",
        "earth",
        "producd",
        "kind",
        "plant",
        "day",
        "god",
        "made",
        "luminary",
        "bp",
        "bw",
        "moreover",
        "ought",
        "much",
        "recommend",
        "many",
        "thing",
        "revelation",
        "discovers",
        "u",
        "congruous",
        "may",
        "speak",
        "symmetrical",
        "reason",
        "self",
        "teach",
        "u",
        "supernatural",
        "light",
        "confirm",
        "advance",
        "compleat",
        "truth",
        "discoverable",
        "light",
        "nature",
        "god",
        "excellently",
        "orderd",
        "discovery",
        "make",
        "theological",
        "verity",
        "meer",
        "reason",
        "holy",
        "scripture",
        "revelation",
        "superadds",
        "reason",
        "well",
        "agree",
        "supply",
        "wanting",
        "might",
        "result",
        "compleat",
        "body",
        "theological",
        "verity",
        "either",
        "necessary",
        "fit",
        "u",
        "mortal",
        "state",
        "bp",
        "bw",
        "see",
        "macintosh",
        "unsurprisingly",
        "boyle",
        "make",
        "point",
        "attempting",
        "bring",
        "creation",
        "story",
        "line",
        "literal",
        "interpretation",
        "genesis",
        "story",
        "god",
        "belief",
        "could",
        "started",
        "thing",
        "earlier",
        "later",
        "chose",
        "created",
        "matter",
        "broke",
        "started",
        "moving",
        "sometimes",
        "boyle",
        "say",
        "broke",
        "starting",
        "moving",
        "gave",
        "law",
        "since",
        "casual",
        "justlings",
        "atom",
        "would",
        "boyle",
        "think",
        "given",
        "rise",
        "world",
        "hooke",
        "explicating",
        "genesis",
        "argued",
        "ordering",
        "boyle",
        "hooke",
        "world",
        "without",
        "law",
        "possible",
        "world",
        "world",
        "time",
        "previous",
        "century",
        "konrad",
        "daspodius",
        "held",
        "comet",
        "drift",
        "without",
        "law",
        "leibniz",
        "writing",
        "god",
        "nothing",
        "order",
        "impossible",
        "even",
        "feign",
        "event",
        "regular",
        "leibniz",
        "point",
        "random",
        "sequence",
        "point",
        "determine",
        "curve",
        "actually",
        "infinite",
        "set",
        "curve",
        "leibniz",
        "needed",
        "lesser",
        "claim",
        "sequence",
        "event",
        "conform",
        "regular",
        "pattern",
        "generalizing",
        "might",
        "say",
        "point",
        "underdetermine",
        "equation",
        "fact",
        "underdetermine",
        "theory",
        "noted",
        "however",
        "leibniz",
        "number",
        "contemporary",
        "law",
        "need",
        "law",
        "nature",
        "malebranche",
        "example",
        "dialogue",
        "metaphysics",
        "offered",
        "fewer",
        "five",
        "distinct",
        "type",
        "law",
        "general",
        "law",
        "communication",
        "motion",
        "law",
        "union",
        "soul",
        "body",
        "law",
        "union",
        "soul",
        "god",
        "intelligible",
        "substance",
        "universal",
        "reason",
        "general",
        "law",
        "give",
        "good",
        "bad",
        "angel",
        "power",
        "body",
        "finally",
        "law",
        "jesus",
        "christ",
        "received",
        "sovereign",
        "power",
        "heaven",
        "earth",
        "mind",
        "well",
        "body",
        "distribute",
        "temporal",
        "good",
        "diffuse",
        "répandre",
        "internal",
        "grace",
        "heart",
        "entretiens",
        "sur",
        "la",
        "métaphysique",
        "malebranche",
        "boyle",
        "position",
        "intermediate",
        "one",
        "claim",
        "object",
        "event",
        "lawless",
        "claim",
        "lawlessness",
        "impossible",
        "boyle",
        "physical",
        "object",
        "exhibit",
        "nomological",
        "regularity",
        "contingent",
        "fact",
        "world",
        "rather",
        "boyle",
        "cautious",
        "generalizing",
        "spatiotemporal",
        "portion",
        "occupy",
        "agrees",
        "however",
        "law",
        "law",
        "nature",
        "law",
        "interconnection",
        "body",
        "soul",
        "providing",
        "obvious",
        "example",
        "interconnection",
        "also",
        "provides",
        "clear",
        "example",
        "state",
        "god",
        "constantly",
        "preserve",
        "made",
        "matter",
        "started",
        "moving",
        "given",
        "law",
        "god",
        "formed",
        "matter",
        "particular",
        "structure",
        "shape",
        "including",
        "certain",
        "seeds",
        "added",
        "seminal",
        "principle",
        "formative",
        "plastic",
        "power",
        "boyle",
        "clearly",
        "indicate",
        "whether",
        "special",
        "subclass",
        "natural",
        "law",
        "affecting",
        "matter",
        "whether",
        "way",
        "sometimes",
        "call",
        "supramechanical",
        "though",
        "point",
        "mechanism",
        "animal",
        "inheritance",
        "would",
        "seem",
        "require",
        "framing",
        "intelligent",
        "agent",
        "bw",
        "birch",
        "vi",
        "see",
        "anstey",
        "a",
        "inglehart",
        "full",
        "discussion",
        "issue",
        "older",
        "contemporary",
        "harvey",
        "much",
        "admired",
        "boyle",
        "doubt",
        "matter",
        "pouring",
        "scorn",
        "talk",
        "forsooth",
        "generation",
        "nothing",
        "world",
        "meer",
        "separation",
        "collection",
        "order",
        "thing",
        "indeed",
        "deny",
        "production",
        "one",
        "thing",
        "another",
        "forementioned",
        "thing",
        "requisite",
        "generation",
        "self",
        "thing",
        "quite",
        "distinct",
        "harvey",
        "hold",
        "corporeal",
        "universe",
        "opposed",
        "three",
        "sort",
        "incorporeal",
        "creature",
        "god",
        "created",
        "case",
        "continues",
        "create",
        "angel",
        "evil",
        "demon",
        "human",
        "soul",
        "good",
        "bad",
        "imprisoned",
        "angel",
        "created",
        "visible",
        "world",
        "half",
        "compleated",
        "god",
        "creates",
        "new",
        "human",
        "soul",
        "daily",
        "moreover",
        "work",
        "physical",
        "miracle",
        "attach",
        "respective",
        "body",
        "bp",
        "bw",
        "bp",
        "sometimes",
        "boyle",
        "felt",
        "although",
        "human",
        "made",
        "god",
        "image",
        "like",
        "created",
        "being",
        "best",
        "umbratile",
        "arbitrary",
        "picture",
        "god",
        "creatour",
        "bp",
        "boa",
        "p",
        "elsewhere",
        "however",
        "offer",
        "traditional",
        "account",
        "soul",
        "image",
        "god",
        "christian",
        "virtuoso",
        "considers",
        "rational",
        "soul",
        "barely",
        "guide",
        "motion",
        "living",
        "engine",
        "call",
        "body",
        "kind",
        "imprisoned",
        "angel",
        "bear",
        "image",
        "god",
        "capable",
        "knowing",
        "consciousness",
        "production",
        "capable",
        "acknowledgeing",
        "loving",
        "obeying",
        "referring",
        "glory",
        "excellency",
        "discovers",
        "body",
        "united",
        "reference",
        "goodness",
        "divine",
        "son",
        "made",
        "capable",
        "becoming",
        "incomparably",
        "knowing",
        "eternally",
        "happy",
        "bw",
        "birch",
        "vi",
        "although",
        "human",
        "made",
        "image",
        "god",
        "considerably",
        "le",
        "clever",
        "angel",
        "since",
        "quite",
        "possible",
        "god",
        "primary",
        "end",
        "making",
        "universe",
        "provide",
        "universe",
        "angel",
        "centrally",
        "human",
        "thereby",
        "quite",
        "possible",
        "universe",
        "complicated",
        "u",
        "understand",
        "f",
        "god",
        "allowed",
        "indeed",
        "author",
        "universe",
        "appear",
        "whose",
        "knowledge",
        "infinitely",
        "transcends",
        "may",
        "suppos",
        "operate",
        "according",
        "dictate",
        "immense",
        "wisdom",
        "creating",
        "thing",
        "respect",
        "measure",
        "ease",
        "humane",
        "understanding",
        "rather",
        "angelical",
        "intellect",
        "whether",
        "god",
        "chance",
        "ascribe",
        "production",
        "thing",
        "way",
        "may",
        "often",
        "fittest",
        "likelyest",
        "nature",
        "work",
        "easiest",
        "u",
        "understand",
        "bw",
        "birch",
        "ii",
        "w",
        "e",
        "presume",
        "much",
        "ability",
        "boyle",
        "wrote",
        "c",
        "imagine",
        "omniscient",
        "god",
        "end",
        "framing",
        "managing",
        "thing",
        "corporeal",
        "men",
        "discover",
        "boyle",
        "m",
        "fol",
        "bp",
        "boa",
        "p",
        "follows",
        "simplicity",
        "may",
        "often",
        "best",
        "guide",
        "working",
        "hypothesis",
        "choose",
        "think",
        "inevitably",
        "reliable",
        "guide",
        "truth",
        "god",
        "create",
        "universe",
        "piecemeal",
        "way",
        "boyle",
        "rationale",
        "thinking",
        "god",
        "start",
        "creating",
        "matter",
        "motion",
        "proper",
        "directed",
        "velocity",
        "letting",
        "give",
        "rise",
        "present",
        "world",
        "good",
        "time",
        "suppose",
        "created",
        "present",
        "world",
        "going",
        "concern",
        "boyle",
        "tell",
        "u",
        "two",
        "point",
        "stand",
        "first",
        "certainly",
        "fit",
        "fact",
        "boyle",
        "limited",
        "view",
        "omnipotence",
        "example",
        "bemused",
        "swiftness",
        "god",
        "creative",
        "ability",
        "great",
        "number",
        "variety",
        "part",
        "living",
        "humane",
        "body",
        "consists",
        "ti",
        "highly",
        "probable",
        "lump",
        "stupid",
        "matter",
        "fashion",
        "contriv",
        "admirable",
        "system",
        "moment",
        "yet",
        "short",
        "time",
        "sacred",
        "story",
        "relates",
        "man",
        "created",
        "till",
        "end",
        "six",
        "dayes",
        "work",
        "since",
        "one",
        "day",
        "god",
        "created",
        "four",
        "footed",
        "beast",
        "wilde",
        "tame",
        "numerous",
        "reptile",
        "creep",
        "upon",
        "earth",
        "kind",
        "ti",
        "way",
        "improbable",
        "among",
        "great",
        "multitude",
        "differing",
        "specie",
        "animal",
        "living",
        "engine",
        "made",
        "one",
        "part",
        "sixth",
        "day",
        "god",
        "make",
        "humane",
        "animal",
        "extreamly",
        "short",
        "time",
        "say",
        "trice",
        "bp",
        "boa",
        "p",
        "throughout",
        "quotation",
        "emphasis",
        "original",
        "thing",
        "step",
        "step",
        "fairly",
        "quickly",
        "moderate",
        "success",
        "quite",
        "enough",
        "excite",
        "boyle",
        "admiration",
        "almighty",
        "though",
        "certainly",
        "read",
        "descartes",
        "principle",
        "descartes",
        "remark",
        "explicitly",
        "although",
        "god",
        "could",
        "let",
        "thing",
        "work",
        "way",
        "different",
        "initial",
        "state",
        "present",
        "world",
        "fact",
        "god",
        "started",
        "world",
        "medias",
        "re",
        "quite",
        "possible",
        "alternative",
        "strike",
        "likely",
        "mathematician",
        "even",
        "mathematical",
        "physicist",
        "given",
        "fact",
        "motion",
        "natural",
        "matter",
        "added",
        "would",
        "seem",
        "plausible",
        "boyle",
        "god",
        "created",
        "matter",
        "first",
        "gave",
        "push",
        "particularly",
        "since",
        "push",
        "precisely",
        "fine",
        "tuned",
        "order",
        "yield",
        "world",
        "matter",
        "naturally",
        "motion",
        "form",
        "basis",
        "one",
        "boyle",
        "criticism",
        "epicurus",
        "boyle",
        "take",
        "epicurus",
        "hold",
        "motion",
        "innate",
        "property",
        "matter",
        "asks",
        "boyle",
        "explain",
        "fact",
        "lost",
        "changed",
        "result",
        "collision",
        "particle",
        "bp",
        "boa",
        "p",
        "additionally",
        "boyle",
        "notice",
        "system",
        "law",
        "offer",
        "complete",
        "explanation",
        "also",
        "need",
        "account",
        "initial",
        "parameter",
        "since",
        "logically",
        "distinct",
        "chronologically",
        "distinct",
        "well",
        "secondly",
        "perhaps",
        "historical",
        "reason",
        "boyle",
        "conscious",
        "building",
        "past",
        "view",
        "view",
        "typically",
        "treated",
        "matter",
        "giving",
        "rise",
        "present",
        "world",
        "case",
        "past",
        "thinker",
        "least",
        "existed",
        "constant",
        "state",
        "time",
        "initiating",
        "change",
        "led",
        "present",
        "world",
        "occurred",
        "notion",
        "piecemeal",
        "creation",
        "fit",
        "boyle",
        "view",
        "god",
        "ability",
        "fit",
        "genesis",
        "fit",
        "view",
        "previous",
        "thinker",
        "probably",
        "need",
        "look",
        "farther",
        "explanation",
        "adopting",
        "view"
    ]
}