{
    "main_text": "The Structure of Volitional Choice\n1. The Structure of Volitional Choice\n\n\nBradley begins his study of morality and the moral agent with an\nanalysis of the ordinary person’s understanding of moral\nresponsibility. The reason for this starting-place is revealed much\nlater, when he argues that children are not moral creatures until they\nhave developed a measure of self-consciousness. This, he says,\nmakes possible “imputation and responsibility, and here begins\nthe proper moral life of the self” (Ethical Studies, p.\n299). If an action has any moral significance whatsoever then the\nperson responsible (in the causal sense) can be held accountable\n(responsible in the normative sense). One could feel accountable\nto other people, to God or to one’s own conscience, and with this\ngoes a sense of liability to censure or punishment. Actually being\nguilty and thereby deserving of censure or punishment requires the\nsatisfaction of three conditions: the person held accountable must be\nthe same person as the one who did the act, the act must have been that\nperson’s, and he or she must have had some understanding of the\nmoral quality of the act. While not in a position to provide a\nphilosophical opinion on questions concerning personal identity or what\nconstitutes an action, the ordinary person nevertheless recognizes\ncases in which an accused person was “not himself” or\n“did not mean to do it” or acted under duress, and sees\nthese as mitigating circumstances. In sum, the ordinary person’s\nview, as Bradley presents it, is Aristotelian: for the purposes\nof determining moral responsibility an act has to be the agent’s\nin that its origin (arche) lies with or in the agent in some\nsense—and the agent must not be acting under coercion or in a state\nof non-culpable ignorance. These last conditions reflect the\ncommon view that one cannot, in justice, hold someone accountable\nunless she had a measure of control over the situation and thereby\ncould be viewed as acting of her own free will.\n\n\nIf we turn to the theories of philosophers we find differing\nopinions about whether we enjoy this sort of freedom from external\ninfluences, and Bradley is interested in how the theories of\nDeterminism and Indeterminism differ from the views of the ordinary\npeople; not because he thinks the ordinary people will always be\ncorrect about such matters—indeed, they likely have not thought much\nabout such things—but because examining what the ordinary people say\nabout moral matters reveals the deep structures of a society’s\nmoral thinking as that is embedded in its language and social\ninstitutions. This is also important, as we will see\nlater, because Bradley believes morality is relative to a communal\nsetting, and sees a child’s moral development as dependent on\nmembership in a community.\n\n\nIn the matter of the free will debate the ordinary people believe\nneither side. Against Determinism they hold that they can and\noften do initiate actions—and on this point Bradley portrays the\nordinary person as accepting the thesis now called “agent\ncausality.” What is omitted by the Determinists are\nexplanations of behavior which appeal to the reasons of the agent,\nthereby ignoring Aristotle’s notion of final causality, or\npurposely reducing it to efficient causality. The Indeterminist\npresents herself as the friend of freedom but when she claims that\npeople are so free that they could choose any act at any time the\nordinary people object. They think it often possible to predict\nwhat someone will do, because she has a formed moral character and can\nbe counted on to act a certain way when faced with moral\nquestions. Moreover, the ordinary person thinks character is\ndeveloped by the choices people make and the kind of life they have\nled. Bradley notes, however, that character is malleable to\na degree and it is often difficult to determine the extent to which\nsomeone’s character is more or less fixed and resistant to\nchange. Those matters aside, the key result of the\ndiscussion of moral responsibility is the portrayal of moral agents as\nnot only acting in the world in ways that shape that world—especially\nthe social world—but also in ways that shape the agent’s moral\ncharacter. From the perspective of morality both the act\nand the doing of it are equally important.\n\nBut Bradley does not stop at character formation, claiming that human\nnature itself is evolving. He rejects the traditional view that\none’s essential human nature remains unchanged even though there\nwill be some differences in people that are only historical\naccidents. The contrary position is a metaphysical doctrine,\noften called historicity, which claims that human beings are\nself-making within the limits of their natural and social\ncontexts. There is a dialectical relationship between these\naspects of the human condition: we are not only constrained by\nnatural and social contexts but can often alter natural conditions and\nsocial arrangements, thereby influencing how they impact on our\nchoices. For example, my ability to think certain things possible\nwill be a function of my conception of the social institutions of my\nsociety. If marriages are defined as being between a male and a\nfemale, I may not even contemplate the possibility of being in a\nsame-sex marriage leave alone feel free to act on the idea. Yet,\nchange is possible because human beings have the ability to represent\nstates of affairs that do not exist. In its most familiar form\nthis happens when you plan tomorrow’s dinner.\n\n\nThe task, now, is to elaborate the logical structure of this\nself-making process, for Bradley’s moral thesis is not merely\nthat the aim of moral action is to generate a better, superior self,\nand ultimately a perfect self, but that this is to be achieved by the\nagent herself, for it is a process of\n‘self-realization.’ Eventually this theory must\nsupply an account of how anything we might recognize as moral content\ngets included in the picture, but the first task is to articulate the\nformal structure of “volitional choice” (Ethical\nStudies, p.71). Bradley begins this task by noting the\ndifferent aims we have in pursuing theoretical knowledge versus our\naims in practical reasoning:\n\n\nWhat we want in theory is to understand the object; we want neither\nto remove nor alter the world of sensuous fact, but we want to get at\nthe truth of it. The whole of science takes it for granted that\nthe ‘not-ourself’ is really intelligible; it stands and\nfalls with this assumption. So long as our theory strikes on the\nmind as strange and alien, so long do we say we have not found truth;\nwe feel the impulse to go beyond, we alter and alter our views, till we\nsee them as a consistent whole. There we rest, because then we\nhave found the nature of our own mind and the truth of the facts in\none. And in practice again, with a difference, we have the same\nwant. Here our aim is not, leaving the given as it is, to find\nthe truth of it; but here we want to force the sensuous fact to\ncorrespond to the truth of ourselves. (Ethical Studies,\np.73)\n\n\nThis presents two very different kinds of intentional mental\nstates. In the case of empirical knowledge we have a subject in\nthe psychological state of believing that something is true of the\nworld; his belief has a propositional object as its content as\nBradley would call it. Since the goal is to correctly understand the\nworld, the subject is committed to altering his belief set until it\naccurately represents the external physical world. By contrast,\nwhen I wish or desire to become a better person I must first have\nrepresented the self or person I wish to be under some\ndescription. This sort of mental state also has a\npropositional object; e.g., in the statement, “I wish that I\nwere a more patient person” the italicized proposition\nfollowing the “that” is the object of the mental state we\ncall wishing. What we have here, in Bradley’s\nterminology is an ideal object which is the content\nof the wish. This is ideal because it is a mental representation\nof a state of affairs that does not exist at the point the wish is\nmade.\n\n\nAn ideal object can represent a possible different state of\nthe person contemplating it, which presupposes, in addition to the\nability to represent possible future states, a degree of\nself-awareness. An example of this sort of self-consciousness is\nfound in the addict who may be very aware of how his desires are\nruining his life. Once this sort of self-reflective awareness is\nachieved it is then possible to think of changing things. In\nBradley’s language this addict has pictured a better self that he\nmight be, and if he comes to identify his satisfaction with realizing\nthis better self there is a possibility of change. This situation\nsets up a conflict between the actual person the addict now is and the\nrepresented better person he wishes to be and this generates disharmony\nor what Bradley often calls a “felt contradiction”.\nThe pain of this conflict moves the individual toward resolving\nit. It is important to note that the addict cannot move forward\nwithout having a determinate ideal object, a definite conception of the\nideal self being represented. Without this, identifying his\nsatisfaction with realizing that state would be impossible.\n\n\nThis gives us a way to see what Bradley means when he says, in a\nlater article, that “volition is ‘the self-realization of\nan idea with which the self is identified’” (Collected\nEssays, p. 476). In Ethical Studies the\nclaim made is that the only thing we can aim at in acting is to realize\nourselves—or, better, the structure of practical reasoning and the\nfacts of moral psychology make it impossible that we could aim at\nanything other than self-realization. If volitional choice has a\npossible state of oneself as its object, and if one has identified\none’s satisfaction with achieving this, then acting so as to\nrealize the superior self that has been pictured is an advancing of\noneself or realizing oneself. In fact, this would also be true of\na case in which the intentional object represents a state of affairs\nnot directly involving a change in oneself, for having identified\none’s satisfaction with a possible state of affairs would mean\nthat its coming to be would be also a case of advancing oneself, for in\nthis case the agent has forced the world to conform to us. What\nis crucial is that the represented state be taken as the agent’s\nend. As Bradley notes, “all my thoughts are not my\nends” and if self-realization meant no more than having an idea\nof a future event in our mind which later happens, “then I should\nrealize myself practically when I see that the engine is going to run\noff the line, and it does so” (Ethical Studies, p.\n67).\n",
    "section_title": "1. The Structure of Volitional Choice",
    "entry_title": "Francis Herbert Bradley’s Moral and Political Philosophy",
    "hierarchy_title": "Francis Herbert Bradley’s Moral and Political Philosophy || The Structure of Volitional Choice",
    "tokenized_text": [
        "structure",
        "volitional",
        "choice",
        "structure",
        "volitional",
        "choice",
        "bradley",
        "begin",
        "study",
        "morality",
        "moral",
        "agent",
        "analysis",
        "ordinary",
        "person",
        "understanding",
        "moral",
        "responsibility",
        "reason",
        "startingplace",
        "revealed",
        "much",
        "later",
        "argues",
        "child",
        "moral",
        "creature",
        "developed",
        "measure",
        "selfconsciousness",
        "say",
        "make",
        "possible",
        "imputation",
        "responsibility",
        "begin",
        "proper",
        "moral",
        "life",
        "self",
        "ethical",
        "study",
        "p",
        "action",
        "moral",
        "significance",
        "whatsoever",
        "person",
        "responsible",
        "causal",
        "sense",
        "held",
        "accountable",
        "responsible",
        "normative",
        "sense",
        "one",
        "could",
        "feel",
        "accountable",
        "people",
        "god",
        "one",
        "conscience",
        "go",
        "sense",
        "liability",
        "censure",
        "punishment",
        "actually",
        "guilty",
        "thereby",
        "deserving",
        "censure",
        "punishment",
        "requires",
        "satisfaction",
        "three",
        "condition",
        "person",
        "held",
        "accountable",
        "must",
        "person",
        "one",
        "act",
        "act",
        "must",
        "person",
        "must",
        "understanding",
        "moral",
        "quality",
        "act",
        "position",
        "provide",
        "philosophical",
        "opinion",
        "question",
        "concerning",
        "personal",
        "identity",
        "constitutes",
        "action",
        "ordinary",
        "person",
        "nevertheless",
        "recognizes",
        "case",
        "accused",
        "person",
        "mean",
        "acted",
        "duress",
        "see",
        "mitigating",
        "circumstance",
        "sum",
        "ordinary",
        "person",
        "view",
        "bradley",
        "present",
        "aristotelian",
        "purpose",
        "determining",
        "moral",
        "responsibility",
        "act",
        "agent",
        "origin",
        "arche",
        "lie",
        "agent",
        "senseand",
        "agent",
        "must",
        "acting",
        "coercion",
        "state",
        "nonculpable",
        "ignorance",
        "last",
        "condition",
        "reflect",
        "common",
        "view",
        "one",
        "justice",
        "hold",
        "someone",
        "accountable",
        "unless",
        "measure",
        "control",
        "situation",
        "thereby",
        "could",
        "viewed",
        "acting",
        "free",
        "turn",
        "theory",
        "philosopher",
        "find",
        "differing",
        "opinion",
        "whether",
        "enjoy",
        "sort",
        "freedom",
        "external",
        "influence",
        "bradley",
        "interested",
        "theory",
        "determinism",
        "indeterminism",
        "differ",
        "view",
        "ordinary",
        "people",
        "think",
        "ordinary",
        "people",
        "always",
        "correct",
        "mattersindeed",
        "likely",
        "thought",
        "much",
        "thingsbut",
        "examining",
        "ordinary",
        "people",
        "say",
        "moral",
        "matter",
        "reveals",
        "deep",
        "structure",
        "society",
        "moral",
        "thinking",
        "embedded",
        "language",
        "social",
        "institution",
        "also",
        "important",
        "see",
        "later",
        "bradley",
        "belief",
        "morality",
        "relative",
        "communal",
        "setting",
        "see",
        "child",
        "moral",
        "development",
        "dependent",
        "membership",
        "community",
        "matter",
        "free",
        "debate",
        "ordinary",
        "people",
        "believe",
        "neither",
        "side",
        "determinism",
        "hold",
        "often",
        "initiate",
        "actionsand",
        "point",
        "bradley",
        "portrays",
        "ordinary",
        "person",
        "accepting",
        "thesis",
        "called",
        "agent",
        "causality",
        "omitted",
        "determinist",
        "explanation",
        "behavior",
        "appeal",
        "reason",
        "agent",
        "thereby",
        "ignoring",
        "aristotle",
        "notion",
        "final",
        "causality",
        "purposely",
        "reducing",
        "efficient",
        "causality",
        "indeterminist",
        "present",
        "friend",
        "freedom",
        "claim",
        "people",
        "free",
        "could",
        "choose",
        "act",
        "time",
        "ordinary",
        "people",
        "object",
        "think",
        "often",
        "possible",
        "predict",
        "someone",
        "formed",
        "moral",
        "character",
        "counted",
        "act",
        "certain",
        "way",
        "faced",
        "moral",
        "question",
        "moreover",
        "ordinary",
        "person",
        "think",
        "character",
        "developed",
        "choice",
        "people",
        "make",
        "kind",
        "life",
        "led",
        "bradley",
        "note",
        "however",
        "character",
        "malleable",
        "degree",
        "often",
        "difficult",
        "determine",
        "extent",
        "someone",
        "character",
        "le",
        "fixed",
        "resistant",
        "change",
        "matter",
        "aside",
        "key",
        "result",
        "discussion",
        "moral",
        "responsibility",
        "portrayal",
        "moral",
        "agent",
        "acting",
        "world",
        "way",
        "shape",
        "worldespecially",
        "social",
        "worldbut",
        "also",
        "way",
        "shape",
        "agent",
        "moral",
        "character",
        "perspective",
        "morality",
        "act",
        "equally",
        "important",
        "bradley",
        "stop",
        "character",
        "formation",
        "claiming",
        "human",
        "nature",
        "evolving",
        "reject",
        "traditional",
        "view",
        "one",
        "essential",
        "human",
        "nature",
        "remains",
        "unchanged",
        "even",
        "though",
        "difference",
        "people",
        "historical",
        "accident",
        "contrary",
        "position",
        "metaphysical",
        "doctrine",
        "often",
        "called",
        "historicity",
        "claim",
        "human",
        "being",
        "selfmaking",
        "within",
        "limit",
        "natural",
        "social",
        "context",
        "dialectical",
        "relationship",
        "aspect",
        "human",
        "condition",
        "constrained",
        "natural",
        "social",
        "context",
        "often",
        "alter",
        "natural",
        "condition",
        "social",
        "arrangement",
        "thereby",
        "influencing",
        "impact",
        "choice",
        "example",
        "ability",
        "think",
        "certain",
        "thing",
        "possible",
        "function",
        "conception",
        "social",
        "institution",
        "society",
        "marriage",
        "defined",
        "male",
        "female",
        "may",
        "even",
        "contemplate",
        "possibility",
        "samesex",
        "marriage",
        "leave",
        "alone",
        "feel",
        "free",
        "act",
        "idea",
        "yet",
        "change",
        "possible",
        "human",
        "being",
        "ability",
        "represent",
        "state",
        "affair",
        "exist",
        "familiar",
        "form",
        "happens",
        "plan",
        "tomorrow",
        "dinner",
        "task",
        "elaborate",
        "logical",
        "structure",
        "selfmaking",
        "process",
        "bradley",
        "moral",
        "thesis",
        "merely",
        "aim",
        "moral",
        "action",
        "generate",
        "better",
        "superior",
        "self",
        "ultimately",
        "perfect",
        "self",
        "achieved",
        "agent",
        "process",
        "selfrealization",
        "eventually",
        "theory",
        "must",
        "supply",
        "account",
        "anything",
        "might",
        "recognize",
        "moral",
        "content",
        "get",
        "included",
        "picture",
        "first",
        "task",
        "articulate",
        "formal",
        "structure",
        "volitional",
        "choice",
        "ethical",
        "study",
        "p",
        "bradley",
        "begin",
        "task",
        "noting",
        "different",
        "aim",
        "pursuing",
        "theoretical",
        "knowledge",
        "versus",
        "aim",
        "practical",
        "reasoning",
        "want",
        "theory",
        "understand",
        "object",
        "want",
        "neither",
        "remove",
        "alter",
        "world",
        "sensuous",
        "fact",
        "want",
        "get",
        "truth",
        "whole",
        "science",
        "take",
        "granted",
        "notourself",
        "really",
        "intelligible",
        "stand",
        "fall",
        "assumption",
        "long",
        "theory",
        "strike",
        "mind",
        "strange",
        "alien",
        "long",
        "say",
        "found",
        "truth",
        "feel",
        "impulse",
        "go",
        "beyond",
        "alter",
        "alter",
        "view",
        "till",
        "see",
        "consistent",
        "whole",
        "rest",
        "found",
        "nature",
        "mind",
        "truth",
        "fact",
        "one",
        "practice",
        "difference",
        "want",
        "aim",
        "leaving",
        "given",
        "find",
        "truth",
        "want",
        "force",
        "sensuous",
        "fact",
        "correspond",
        "truth",
        "ethical",
        "study",
        "p",
        "present",
        "two",
        "different",
        "kind",
        "intentional",
        "mental",
        "state",
        "case",
        "empirical",
        "knowledge",
        "subject",
        "psychological",
        "state",
        "believing",
        "something",
        "true",
        "world",
        "belief",
        "propositional",
        "object",
        "content",
        "bradley",
        "would",
        "call",
        "since",
        "goal",
        "correctly",
        "understand",
        "world",
        "subject",
        "committed",
        "altering",
        "belief",
        "set",
        "accurately",
        "represents",
        "external",
        "physical",
        "world",
        "contrast",
        "wish",
        "desire",
        "become",
        "better",
        "person",
        "must",
        "first",
        "represented",
        "self",
        "person",
        "wish",
        "description",
        "sort",
        "mental",
        "state",
        "also",
        "propositional",
        "object",
        "eg",
        "statement",
        "wish",
        "patient",
        "person",
        "italicized",
        "proposition",
        "following",
        "object",
        "mental",
        "state",
        "call",
        "wishing",
        "bradley",
        "terminology",
        "ideal",
        "object",
        "content",
        "wish",
        "ideal",
        "mental",
        "representation",
        "state",
        "affair",
        "exist",
        "point",
        "wish",
        "made",
        "ideal",
        "object",
        "represent",
        "possible",
        "different",
        "state",
        "person",
        "contemplating",
        "presupposes",
        "addition",
        "ability",
        "represent",
        "possible",
        "future",
        "state",
        "degree",
        "selfawareness",
        "example",
        "sort",
        "selfconsciousness",
        "found",
        "addict",
        "may",
        "aware",
        "desire",
        "ruining",
        "life",
        "sort",
        "selfreflective",
        "awareness",
        "achieved",
        "possible",
        "think",
        "changing",
        "thing",
        "bradley",
        "language",
        "addict",
        "pictured",
        "better",
        "self",
        "might",
        "come",
        "identify",
        "satisfaction",
        "realizing",
        "better",
        "self",
        "possibility",
        "change",
        "situation",
        "set",
        "conflict",
        "actual",
        "person",
        "addict",
        "represented",
        "better",
        "person",
        "wish",
        "generates",
        "disharmony",
        "bradley",
        "often",
        "call",
        "felt",
        "contradiction",
        "pain",
        "conflict",
        "move",
        "individual",
        "toward",
        "resolving",
        "important",
        "note",
        "addict",
        "move",
        "forward",
        "without",
        "determinate",
        "ideal",
        "object",
        "definite",
        "conception",
        "ideal",
        "self",
        "represented",
        "without",
        "identifying",
        "satisfaction",
        "realizing",
        "state",
        "would",
        "impossible",
        "give",
        "u",
        "way",
        "see",
        "bradley",
        "mean",
        "say",
        "later",
        "article",
        "volition",
        "selfrealization",
        "idea",
        "self",
        "identified",
        "collected",
        "essay",
        "p",
        "ethical",
        "study",
        "claim",
        "made",
        "thing",
        "aim",
        "acting",
        "realize",
        "ourselvesor",
        "better",
        "structure",
        "practical",
        "reasoning",
        "fact",
        "moral",
        "psychology",
        "make",
        "impossible",
        "could",
        "aim",
        "anything",
        "selfrealization",
        "volitional",
        "choice",
        "possible",
        "state",
        "oneself",
        "object",
        "one",
        "identified",
        "one",
        "satisfaction",
        "achieving",
        "acting",
        "realize",
        "superior",
        "self",
        "pictured",
        "advancing",
        "oneself",
        "realizing",
        "oneself",
        "fact",
        "would",
        "also",
        "true",
        "case",
        "intentional",
        "object",
        "represents",
        "state",
        "affair",
        "directly",
        "involving",
        "change",
        "oneself",
        "identified",
        "one",
        "satisfaction",
        "possible",
        "state",
        "affair",
        "would",
        "mean",
        "coming",
        "would",
        "also",
        "case",
        "advancing",
        "oneself",
        "case",
        "agent",
        "forced",
        "world",
        "conform",
        "u",
        "crucial",
        "represented",
        "state",
        "taken",
        "agent",
        "end",
        "bradley",
        "note",
        "thought",
        "end",
        "selfrealization",
        "meant",
        "idea",
        "future",
        "event",
        "mind",
        "later",
        "happens",
        "realize",
        "practically",
        "see",
        "engine",
        "going",
        "run",
        "line",
        "ethical",
        "study",
        "p"
    ]
}