{
    "main_text": "Brentano’s Argument from Perception\n3. Brentano’s Argument from Perception\n\nWe have now introduced the idea that animates Brentano’s theory\nof judgement: predication is one thing, judgement another. We have\nseen which views inspired Brentano to disentangle judgement and\npredication. However, so far we lack a reason to follow\nBrentano’s lead. How can he convince his readers that\npredication is not necessary for judgement, since we already judge\nwhen we merely acknowledge or reject an object?\n\nSometimes Brentano simply trusts his readers to agree with him if they\npay sufficient attention to their own judgements and compare them\nwith, for example, presentations. Consider, for instance, the\nfollowing passage from the opening section of Brentano’s\ndiscussion of judgement in PES:\n\n\nIt is […] true that nothing is an object of judgement which is\nnot an object of presentation, and we maintain that when the object of\npresentation becomes the object of an affirmative or negative\njudgement, our consciousness enters into a completely new kind of\nrelationship with the object. […] This, we maintain, is\nrevealed clearly to us by inner perception and the attentive\nobservation of the phenomena of judgement in memory. (PES 201 [II\n38–9; SVS 1, 223, emphasis added)\n\n\nSo, if we are able to episodically remember judging something, we can\ncome to know that the same object given in a presentation can be\nacknowledged or rejected in judgement and that acknowledging and\nrejecting are distinct in kind from presentation.\n\nBut merely encouraging a philosopher who is in the grip of the idea\nthat judging is predication to pay more attention when recalling his\njudgements will not yield the intended results. Is there an argument\nthat will establish Brentano’s view on the basis of\nuncontroversial premises? Brentano thinks there is an argument that is\nbased on premises his opponents find\n compelling:[18]\n\n\nThat predication is not the essence of every judgement emerges quite\nclearly from the fact that all perceptions are judgements. For it\n[perception] is either knowledge [Erkenntnis] or at least a\nmistaken taking to be true [Fürwahrnehmen]. And this is\nnot denied by those thinkers who hold that every judgement consists in\na conjunction of subject and predicate. […] [I]t is hard to\nthink of anything more obvious and unmistakable than the fact that a\nperception is not a [connection] of a concept of the subject and a\nconcept of a predicate, nor does it refer to such a connection.\nRather, the object of an inner perception is simply a mental\nphenomenon, and the object of an external perception is\nsimply a physical phenomenon, a sound, odor, or the like. We have\nhere, then, a quite obvious justification of the truth of our\nassertion. (PES 209 [II 50–51; SVS 1, 232], translation\nchanged.)\n\n\nEveryone—even predication theorists of\njudgement—believe that in perceiving we don’t connect the\nconcept of a subject with that of a predicate. No\none—even predication theorists of judgement—denies\nthat every perception is a judgement. So, everyone accepts that there\nare some judgements that don’t predicate a property of something\n(connect a concept of a subject with a concept of a predicate). A\nfortiori the predication theorist of judgement is rationally\ncompelled to accept that there are non-predicational judgements. If he\ndoes not do so, his view of judgement is not in harmony with the right\nview of perception. Hence, the view of judgement as predication must\nbe revised.\n\nHow obvious is Brentano’s “quite obvious”\njustification? Let’s consider Brentano’s first premise\nfirst: perception does not involve predication. A charitable reading\nof Brentano should assume that by “perception” he means\nwhat philosophers following Fred Dretske now call “non-epistemic\nperception”. I can see something without having any\nbeliefs about it to the effect that it is so-and-so. I see the yellow\ncanary because it looks distinct from its immediate environment; I\ncan’t see the chameleon because it does not look distinct from\nits environment. Note that it does not matter at this point whether\none takes ordinary material objects such as birds or, as Brentano\nhimself prefers, physical phenomena such as colours and shapes to be\nthe (primary) objects of perception.\n\nIs non-epistemic seeing a form of predication? Prima facie,\nit isn’t. When I see the yellow canary, I am directed towards an\nobject and it appears distinct from its environment. The canary is\ngiven to me in such a way that I can attend to it in perception, but I\nmight abstain from making any predicative judgement about it for the\ntime being.\n\nBrentano takes it to be beyond doubt that such a perception is a\njudgement, only not a predicative one. This is controversial. For\nexample, Brentano’s modus ponens is Moritz\nSchlick’s (1925, 80/1974, 87) modus tollens: perception\nis not judgement, hence, a perception cannot be knowledge. So\nwhy should one think of seeing a yellow canary or hearing a\nsound as a judgement in the first place? Consider again your\nperception of the yellow canary. The canary looks different from its\nsurroundings to you and you can train your attention on it. In this\nsituation you will, to use a non-committal phrase, “take the\ncanary to be real”. Seeing the canary is a particular kind of\n“taking the canary to be”, namely as something real; in\nBrentano’s terminology that is “an acknowledging of the\ncanary”. If this is right, there are judgements that do not\npredicate any properties of an object and merely acknowledge it.\n\nLet us consider three objections to firm up our understanding of\nBrentano’s line of thought.\n\nObjection 1: But one cannot “take something to be real”,\nyet not predicate any property of it. Taking something to be real is\njust predicating existence of it. Brentano considers this objection\n himself:[19]\n\n\nBecause we say not only that we perceive a color, a sound, an act of\nseeing, an act of hearing, but also that we perceive the existence of\nan act of seeing or of an act of hearing, someone might be led to\nbelieve that perception, too, consists in the acknowledgement\n[Anerkennung] of the conjunction of the attribute\n“existence” with the phenomenon in question. Such a\nmisunderstanding of obvious facts seems to me almost inconceivable.\n(PES 210 [II 51–52; SVS 1, 232])\n\n\nAs said before, Brentano’s claim that the facts are obvious\nbears little argumentative weight. But the view that every\n(non-epistemic) perception is a judgement to the effect that something\nexists over-intellectualizes non-epistemic perception. Infants and\ndogs see and hear things. Does Brentano’s opponent really want\nto say that they make judgements to the effect that the objects\nperceived exist? Yet, a dog certainly takes the canary to be real when\nit chases it.\n\nBrentano also provides a more theoretical reason against the view that\n(non-epistemic) perception consists in predications of existence (PES\n210 [II 51–52; SVS 1, 232]). The view makes it difficult to\nexplain how we manage to acquire the concept of existence. If we\nexercise the concept in every (non-epistemic) perception, the concept\nof existence must come with the capacity to perceive objects and\nqualities. Brentano finds this unbelievable.\n\nIn turn, if acknowledging an object does not presuppose possession of\nthe concept of existence, our introspective knowledge of\nacknowledgement may be used to introduce the concept of existence.\nBrentano pursued this strategy following Aristotle:\n\n\nAristotle had already recognized that [the concept of existence] is\nacquired by reflection on the acknowledging judgement. (TE 27 [45],\ntranslation\n improved)[20]\n\n\nObjection 2: Seeing the yellow canary is not the same thing as\nacknowledging it. For instance, one can see an object without\nacknowledging it “if one does not trust one’s eyes.”\nI see the canary before me, but since you have given me misleading\nevidence that I am now hallucinating, I do not trust my senses and do\nnot take the canary to be real. So, seeing and judging are\nrelated—maybe (consciously) seeing something prompts one to\njudge that it is—but these mental acts are distinct.\n\nIn later work Brentano suggested that in such cases we do acknowledge\nthe bird as well as judge that there is no object in the scene\nperceived. Just as we can love and hate an object, we can accept and\nreject an object at the same time:\n\n\nAn affect that is reined in by a contradicting higher love still truly\npersists. Similarly, an acceptance of an object given in sensation,\nwhich is disapproved of by a higher judgement, could persist. Indeed,\nit is not at all clear, how the lower activity should be changed in\nits intrinsic character because of the occurrence of the higher\nactivity; if the lower activity had a relation of acceptance to the\nouter object before, it will have it later. (VNV 26, author\ntranslation.)\n\n\nIt is thus possible to acknowledge and reject an object at the same\ntime, although this is clearly not a mental state one prefers to be\nin. But sometimes things are not as we like them to be.\n\nWith this in mind Brentano can say that when we mistrust our senses we\nacknowledge an object, but this judgement conflicts with other\njudgements or beliefs that we have with regard to this matter.\n\nObjection 3: We have already seen that Brentano subscribes to a\nPolarity Thesis: Acknowledging an object x has an opposite:\nrejecting x (see\n section 1, claim 5).\n These attitudes are directed towards the same object, yet only one of\nthem can be correct even if they may co-exist, as Brentano allows. The\ncorrectness of acknowledging x is incompatible with the\ncorrectness of rejecting it. Hence, if non-epistemic perception is a\nkind of acknowledgement, it must have an opposite. But what could be\nthe opposite of\n seeing?[21]\n According to Peter Geach, there is nothing here to be found except\nthe exclusion relation between (instances of) properties that we\nsee:\n\n\nBelieving, like seeing, has no polar opposite, though contrary dogmas\nmay be believed, as contrary colours may be seen. (Geach 1965:\n455)\n\n\nHowever, Brentano’s view of perception could gain plausibility\nby contrasting it with a form of doubt that is also non-epistemic and\ndirectly opposed to it. If I see a yellow canary, that very act could\nmake it incorrect to raise a doubt of a non-epistemic kind. If\ndoubting can be like acknowledging an object-directed act with a\nnon-propositional content, then Brentano’s Polarity thesis\nstands. If not, we must either revise the Polarity Thesis or\nBrentano’s view of perception.\n\nLet us sum up the discussion and put its result into perspective.\nBrentano tells us that perceiving an object is acknowledging it. Such\nperceptions are for Brentano the prime example of existential\njudgements. In such judgements we acknowledge an object without\npredicating anything of it. Based on this observation, Brentano argues\nthat simple existential judgements are not of the categorical form\n“S is P” or “S has the\nproperty P”. In other words, simple judgements do not\nhave a propositional content. In making such judgements we may\nacknowledge a content, a combination of marks or a single mark and\nthereby an object that possesses these marks, but we do not affirm\nthat the object that is so-and-so exists.\n\nThe consequences of this move are indeed far reaching. Even when we\npredicate a property of an object, Brentano can say that the\npredication need not change the character of the judgement\nthat we are making. One may conceive of predication as a two-step\nprocess: one first connects the property P with the subject\nS, thus forming a complex representation of an\nS-that-is-P; then one acknowledges the complex\ncontent and thus forms a judgement. The content is complex, but the\njudgement itself is the same simple act of acknowledgement.\n\nIf judging is either acknowledging or rejecting of contents, the\nnotion of acknowledgement/rejection is fundamental in philosophy of\nmind. In response to Brentano’s move, philosophers at the end of\nthe 19th and beginning of 20th century engaged with his view of\nacknowledgement. Wilhelm Jerusalem (1895, 67–72) discussed\nBrentano’s and Marty’s view of judgement and argues for a\nview of judgement as a complex \n activity.[22] \nAdolf Reinach (1911, sect. I) distinguished different related notions of\n‘acknowledgement’ and criticises Brentano for running them\ntogether. Karelitzki (1914) is a (short) monograph devoted to find a\nplausible concept of acknowledgement and takes Brentano’s as its\nstarting point (see ibid., 13–28). The central figure of the\nVienna circle, Moritz Schlick (1925, 50/1974, 43) took Brentano to be\nright about the psychological nature of judgement, but not its logical\nrole. For this reason he argues against the reduction thesis that we\nwill examine below.\n",
    "section_title": "3. Brentano’s Argument from Perception",
    "entry_title": "Brentano’s Theory of Judgement",
    "hierarchy_title": "Brentano’s Theory of Judgement || Brentano’s Argument from Perception",
    "tokenized_text": [
        "brentano",
        "argument",
        "perception",
        "brentano",
        "argument",
        "perception",
        "introduced",
        "idea",
        "animates",
        "brentano",
        "theory",
        "judgement",
        "predication",
        "one",
        "thing",
        "judgement",
        "another",
        "seen",
        "view",
        "inspired",
        "brentano",
        "disentangle",
        "judgement",
        "predication",
        "however",
        "far",
        "lack",
        "reason",
        "follow",
        "brentano",
        "lead",
        "convince",
        "reader",
        "predication",
        "necessary",
        "judgement",
        "since",
        "already",
        "judge",
        "merely",
        "acknowledge",
        "reject",
        "object",
        "sometimes",
        "brentano",
        "simply",
        "trust",
        "reader",
        "agree",
        "pay",
        "sufficient",
        "attention",
        "judgement",
        "compare",
        "example",
        "presentation",
        "consider",
        "instance",
        "following",
        "passage",
        "opening",
        "section",
        "brentano",
        "discussion",
        "judgement",
        "pe",
        "true",
        "nothing",
        "object",
        "judgement",
        "object",
        "presentation",
        "maintain",
        "object",
        "presentation",
        "becomes",
        "object",
        "affirmative",
        "negative",
        "judgement",
        "consciousness",
        "enters",
        "completely",
        "new",
        "kind",
        "relationship",
        "object",
        "maintain",
        "revealed",
        "clearly",
        "u",
        "inner",
        "perception",
        "attentive",
        "observation",
        "phenomenon",
        "judgement",
        "memory",
        "pe",
        "ii",
        "svs",
        "emphasis",
        "added",
        "able",
        "episodically",
        "remember",
        "judging",
        "something",
        "come",
        "know",
        "object",
        "given",
        "presentation",
        "acknowledged",
        "rejected",
        "judgement",
        "acknowledging",
        "rejecting",
        "distinct",
        "kind",
        "presentation",
        "merely",
        "encouraging",
        "philosopher",
        "grip",
        "idea",
        "judging",
        "predication",
        "pay",
        "attention",
        "recalling",
        "judgement",
        "yield",
        "intended",
        "result",
        "argument",
        "establish",
        "brentano",
        "view",
        "basis",
        "uncontroversial",
        "premise",
        "brentano",
        "think",
        "argument",
        "based",
        "premise",
        "opponent",
        "find",
        "compelling",
        "predication",
        "essence",
        "every",
        "judgement",
        "emerges",
        "quite",
        "clearly",
        "fact",
        "perception",
        "judgement",
        "perception",
        "either",
        "knowledge",
        "erkenntnis",
        "least",
        "mistaken",
        "taking",
        "true",
        "fürwahrnehmen",
        "denied",
        "thinker",
        "hold",
        "every",
        "judgement",
        "consists",
        "conjunction",
        "subject",
        "predicate",
        "hard",
        "think",
        "anything",
        "obvious",
        "unmistakable",
        "fact",
        "perception",
        "connection",
        "concept",
        "subject",
        "concept",
        "predicate",
        "refer",
        "connection",
        "rather",
        "object",
        "inner",
        "perception",
        "simply",
        "mental",
        "phenomenon",
        "object",
        "external",
        "perception",
        "simply",
        "physical",
        "phenomenon",
        "sound",
        "odor",
        "like",
        "quite",
        "obvious",
        "justification",
        "truth",
        "assertion",
        "pe",
        "ii",
        "svs",
        "translation",
        "changed",
        "everyoneeven",
        "predication",
        "theorist",
        "judgementbelieve",
        "perceiving",
        "connect",
        "concept",
        "subject",
        "predicate",
        "oneeven",
        "predication",
        "theorist",
        "judgementdenies",
        "every",
        "perception",
        "judgement",
        "everyone",
        "accepts",
        "judgement",
        "predicate",
        "property",
        "something",
        "connect",
        "concept",
        "subject",
        "concept",
        "predicate",
        "fortiori",
        "predication",
        "theorist",
        "judgement",
        "rationally",
        "compelled",
        "accept",
        "nonpredicational",
        "judgement",
        "view",
        "judgement",
        "harmony",
        "right",
        "view",
        "perception",
        "hence",
        "view",
        "judgement",
        "predication",
        "must",
        "revised",
        "obvious",
        "brentano",
        "quite",
        "obvious",
        "justification",
        "let",
        "consider",
        "brentano",
        "first",
        "premise",
        "first",
        "perception",
        "involve",
        "predication",
        "charitable",
        "reading",
        "brentano",
        "assume",
        "perception",
        "mean",
        "philosopher",
        "following",
        "fred",
        "dretske",
        "call",
        "nonepistemic",
        "perception",
        "see",
        "something",
        "without",
        "belief",
        "effect",
        "soandso",
        "see",
        "yellow",
        "canary",
        "look",
        "distinct",
        "immediate",
        "environment",
        "see",
        "chameleon",
        "look",
        "distinct",
        "environment",
        "note",
        "matter",
        "point",
        "whether",
        "one",
        "take",
        "ordinary",
        "material",
        "object",
        "bird",
        "brentano",
        "prefers",
        "physical",
        "phenomenon",
        "colour",
        "shape",
        "primary",
        "object",
        "perception",
        "nonepistemic",
        "seeing",
        "form",
        "predication",
        "prima",
        "facie",
        "see",
        "yellow",
        "canary",
        "directed",
        "towards",
        "object",
        "appears",
        "distinct",
        "environment",
        "canary",
        "given",
        "way",
        "attend",
        "perception",
        "might",
        "abstain",
        "making",
        "predicative",
        "judgement",
        "time",
        "brentano",
        "take",
        "beyond",
        "doubt",
        "perception",
        "judgement",
        "predicative",
        "one",
        "controversial",
        "example",
        "brentano",
        "modus",
        "ponens",
        "moritz",
        "schlick",
        "modus",
        "tollens",
        "perception",
        "judgement",
        "hence",
        "perception",
        "knowledge",
        "one",
        "think",
        "seeing",
        "yellow",
        "canary",
        "hearing",
        "sound",
        "judgement",
        "first",
        "place",
        "consider",
        "perception",
        "yellow",
        "canary",
        "canary",
        "look",
        "different",
        "surroundings",
        "train",
        "attention",
        "situation",
        "use",
        "noncommittal",
        "phrase",
        "take",
        "canary",
        "real",
        "seeing",
        "canary",
        "particular",
        "kind",
        "taking",
        "canary",
        "namely",
        "something",
        "real",
        "brentano",
        "terminology",
        "acknowledging",
        "canary",
        "right",
        "judgement",
        "predicate",
        "property",
        "object",
        "merely",
        "acknowledge",
        "let",
        "u",
        "consider",
        "three",
        "objection",
        "firm",
        "understanding",
        "brentano",
        "line",
        "thought",
        "objection",
        "one",
        "take",
        "something",
        "real",
        "yet",
        "predicate",
        "property",
        "taking",
        "something",
        "real",
        "predicating",
        "existence",
        "brentano",
        "considers",
        "objection",
        "say",
        "perceive",
        "color",
        "sound",
        "act",
        "seeing",
        "act",
        "hearing",
        "also",
        "perceive",
        "existence",
        "act",
        "seeing",
        "act",
        "hearing",
        "someone",
        "might",
        "led",
        "believe",
        "perception",
        "consists",
        "acknowledgement",
        "anerkennung",
        "conjunction",
        "attribute",
        "existence",
        "phenomenon",
        "question",
        "misunderstanding",
        "obvious",
        "fact",
        "seems",
        "almost",
        "inconceivable",
        "pe",
        "ii",
        "svs",
        "said",
        "brentano",
        "claim",
        "fact",
        "obvious",
        "bear",
        "little",
        "argumentative",
        "weight",
        "view",
        "every",
        "nonepistemic",
        "perception",
        "judgement",
        "effect",
        "something",
        "exists",
        "overintellectualizes",
        "nonepistemic",
        "perception",
        "infant",
        "dog",
        "see",
        "hear",
        "thing",
        "brentano",
        "opponent",
        "really",
        "want",
        "say",
        "make",
        "judgement",
        "effect",
        "object",
        "perceived",
        "exist",
        "yet",
        "dog",
        "certainly",
        "take",
        "canary",
        "real",
        "chase",
        "brentano",
        "also",
        "provides",
        "theoretical",
        "reason",
        "view",
        "nonepistemic",
        "perception",
        "consists",
        "predication",
        "existence",
        "pe",
        "ii",
        "svs",
        "view",
        "make",
        "difficult",
        "explain",
        "manage",
        "acquire",
        "concept",
        "existence",
        "exercise",
        "concept",
        "every",
        "nonepistemic",
        "perception",
        "concept",
        "existence",
        "must",
        "come",
        "capacity",
        "perceive",
        "object",
        "quality",
        "brentano",
        "find",
        "unbelievable",
        "turn",
        "acknowledging",
        "object",
        "presuppose",
        "possession",
        "concept",
        "existence",
        "introspective",
        "knowledge",
        "acknowledgement",
        "may",
        "used",
        "introduce",
        "concept",
        "existence",
        "brentano",
        "pursued",
        "strategy",
        "following",
        "aristotle",
        "aristotle",
        "already",
        "recognized",
        "concept",
        "existence",
        "acquired",
        "reflection",
        "acknowledging",
        "judgement",
        "te",
        "translation",
        "improved",
        "objection",
        "seeing",
        "yellow",
        "canary",
        "thing",
        "acknowledging",
        "instance",
        "one",
        "see",
        "object",
        "without",
        "acknowledging",
        "one",
        "trust",
        "one",
        "eyes",
        "see",
        "canary",
        "since",
        "given",
        "misleading",
        "evidence",
        "hallucinating",
        "trust",
        "sens",
        "take",
        "canary",
        "real",
        "seeing",
        "judging",
        "relatedmaybe",
        "consciously",
        "seeing",
        "something",
        "prompt",
        "one",
        "judge",
        "isbut",
        "mental",
        "act",
        "distinct",
        "later",
        "work",
        "brentano",
        "suggested",
        "case",
        "acknowledge",
        "bird",
        "well",
        "judge",
        "object",
        "scene",
        "perceived",
        "love",
        "hate",
        "object",
        "accept",
        "reject",
        "object",
        "time",
        "affect",
        "reined",
        "contradicting",
        "higher",
        "love",
        "still",
        "truly",
        "persists",
        "similarly",
        "acceptance",
        "object",
        "given",
        "sensation",
        "disapproved",
        "higher",
        "judgement",
        "could",
        "persist",
        "indeed",
        "clear",
        "lower",
        "activity",
        "changed",
        "intrinsic",
        "character",
        "occurrence",
        "higher",
        "activity",
        "lower",
        "activity",
        "relation",
        "acceptance",
        "outer",
        "object",
        "later",
        "vnv",
        "author",
        "translation",
        "thus",
        "possible",
        "acknowledge",
        "reject",
        "object",
        "time",
        "although",
        "clearly",
        "mental",
        "state",
        "one",
        "prefers",
        "sometimes",
        "thing",
        "like",
        "mind",
        "brentano",
        "say",
        "mistrust",
        "sens",
        "acknowledge",
        "object",
        "judgement",
        "conflict",
        "judgement",
        "belief",
        "regard",
        "matter",
        "objection",
        "already",
        "seen",
        "brentano",
        "subscribes",
        "polarity",
        "thesis",
        "acknowledging",
        "object",
        "x",
        "opposite",
        "rejecting",
        "x",
        "see",
        "section",
        "claim",
        "attitude",
        "directed",
        "towards",
        "object",
        "yet",
        "one",
        "correct",
        "even",
        "may",
        "coexist",
        "brentano",
        "allows",
        "correctness",
        "acknowledging",
        "x",
        "incompatible",
        "correctness",
        "rejecting",
        "hence",
        "nonepistemic",
        "perception",
        "kind",
        "acknowledgement",
        "must",
        "opposite",
        "could",
        "opposite",
        "seeing",
        "according",
        "peter",
        "geach",
        "nothing",
        "found",
        "except",
        "exclusion",
        "relation",
        "instance",
        "property",
        "see",
        "believing",
        "like",
        "seeing",
        "polar",
        "opposite",
        "though",
        "contrary",
        "dogma",
        "may",
        "believed",
        "contrary",
        "colour",
        "may",
        "seen",
        "geach",
        "however",
        "brentano",
        "view",
        "perception",
        "could",
        "gain",
        "plausibility",
        "contrasting",
        "form",
        "doubt",
        "also",
        "nonepistemic",
        "directly",
        "opposed",
        "see",
        "yellow",
        "canary",
        "act",
        "could",
        "make",
        "incorrect",
        "raise",
        "doubt",
        "nonepistemic",
        "kind",
        "doubting",
        "like",
        "acknowledging",
        "objectdirected",
        "act",
        "nonpropositional",
        "content",
        "brentano",
        "polarity",
        "thesis",
        "stand",
        "must",
        "either",
        "revise",
        "polarity",
        "thesis",
        "brentano",
        "view",
        "perception",
        "let",
        "u",
        "sum",
        "discussion",
        "put",
        "result",
        "perspective",
        "brentano",
        "tell",
        "u",
        "perceiving",
        "object",
        "acknowledging",
        "perception",
        "brentano",
        "prime",
        "example",
        "existential",
        "judgement",
        "judgement",
        "acknowledge",
        "object",
        "without",
        "predicating",
        "anything",
        "based",
        "observation",
        "brentano",
        "argues",
        "simple",
        "existential",
        "judgement",
        "categorical",
        "form",
        "p",
        "property",
        "p",
        "word",
        "simple",
        "judgement",
        "propositional",
        "content",
        "making",
        "judgement",
        "may",
        "acknowledge",
        "content",
        "combination",
        "mark",
        "single",
        "mark",
        "thereby",
        "object",
        "posse",
        "mark",
        "affirm",
        "object",
        "soandso",
        "exists",
        "consequence",
        "move",
        "indeed",
        "far",
        "reaching",
        "even",
        "predicate",
        "property",
        "object",
        "brentano",
        "say",
        "predication",
        "need",
        "change",
        "character",
        "judgement",
        "making",
        "one",
        "may",
        "conceive",
        "predication",
        "twostep",
        "process",
        "one",
        "first",
        "connects",
        "property",
        "p",
        "subject",
        "thus",
        "forming",
        "complex",
        "representation",
        "sthatisp",
        "one",
        "acknowledges",
        "complex",
        "content",
        "thus",
        "form",
        "judgement",
        "content",
        "complex",
        "judgement",
        "simple",
        "act",
        "acknowledgement",
        "judging",
        "either",
        "acknowledging",
        "rejecting",
        "content",
        "notion",
        "acknowledgementrejection",
        "fundamental",
        "philosophy",
        "mind",
        "response",
        "brentano",
        "move",
        "philosopher",
        "end",
        "th",
        "beginning",
        "th",
        "century",
        "engaged",
        "view",
        "acknowledgement",
        "wilhelm",
        "jerusalem",
        "discussed",
        "brentano",
        "marty",
        "view",
        "judgement",
        "argues",
        "view",
        "judgement",
        "complex",
        "activity",
        "adolf",
        "reinach",
        "sect",
        "distinguished",
        "different",
        "related",
        "notion",
        "acknowledgement",
        "criticises",
        "brentano",
        "running",
        "together",
        "karelitzki",
        "short",
        "monograph",
        "devoted",
        "find",
        "plausible",
        "concept",
        "acknowledgement",
        "take",
        "brentano",
        "starting",
        "point",
        "see",
        "ibid",
        "central",
        "figure",
        "vienna",
        "circle",
        "moritz",
        "schlick",
        "took",
        "brentano",
        "right",
        "psychological",
        "nature",
        "judgement",
        "logical",
        "role",
        "reason",
        "argues",
        "reduction",
        "thesis",
        "examine"
    ]
}