{
    "main_text": "Logic, Ethics, and Aesthetics\n4. Logic, Ethics, and Aesthetics\n\nAccording to Brentano, psychology plays a central role in the\nsciences; he considers especially logics, ethics, and aesthetics as\npractical disciplines that depend on psychology as their theoretical\nfoundation. He collocates these three disciplines in his larger\nsystematic outlook by tying them to the three kinds of mental\nphenomenon: presentations, judgments, and phenomena of love and hate,\ni.e., emotions. The “triad of the Beautiful, the\nTrue, and the Good ... [is] related to the three\naspects of our mental life” (PES, 203). Moreover, the\nthree disciplines essentially build on his views that presentations\nare intrinsically valuable and that not only judgments, but also\nemotions can be correct or not correct. \n\nLogic, according to Brentano, is the practical discipline that is\nconcerned with judgments; i.e. with the class of mental phenomena in\nwhich we take a positive or a negative stance towards the (existence\nof the) object by affirming or denying it. In addition, judgments are\ncorrect or not; they have a truth-value. According to Brentano, a\njudgment is true when it is evident, i.e., when one perceives (in\ninner perception that is directed towards the judgment) that one\njudges with evidence. Brentano, thus, rejects the correspondence\ntheory of truth, suggesting that “a person judges truly, if and\nonly if, his judgment agrees with the judgment he would make if we\nwere to judge with evidence” (Chisholm 1986, 38).\nNotwithstanding this dependence on the notion of judgment, however,\ntruth, for Brentano, is not a subjective notion: if one person affirms\nan object and another person denies the same object, only one of them\njudges correctly. (For a more detailed discussion of Brentano’s\ncontributions to logic, cf. the entry\n Brentano’s Theory of Judgement.)\n\nEthics, on the other hand, is concerned with emotions or, as Brentano\ncalls them, phenomena of love and hate. Brentano sees a structural\nanalogy between judgments and phenomena of this class: just like\njudgments, that are either affirmative or negative, also emotions\nconsist in taking a positive or a negative (emotional) attitude\ntowards an object: love or hate, inclination and disinclination, being\npleased and being displeased, etc. Moreover, just as (positive and\nnegative) judgments can be correct or incorrect, Brentano holds that\nalso (both positive and negative) emotions can be correct or\nincorrect. An emotion is correct, according to Brentano, “when\none’s feelings are adequate to their object — adequate in\nthe sense of being appropriate, suitable, or fitting”\n(ORW, 70). [“Wer richtig liebt und haßt,\ndessen Gemüt verhält sich den Gegenständen\nadäquat, d.h. es verhält sich konvenient, passend,\nentsprechend” (USE, 76)] \n\nIf it is correct to love an object, we can say that it is good; if it\nis correct to hate it, it is bad:\n\n“We call a thing true when the affirmation relating to\nit is correct. We call a thing good when the love relating to\nit is correct. In the broadest sense of the term, the good is that\nwhich is worthy of love, that which can be loved with a love that is\ncorrect.” (ORW, 18)\n\n[“Wir nennen etwas Wahr, wenn die darauf bezügliche\nAnerkennung richtig ist. Wir nennen etwas gut, wenn die darauf\nbezügliche Liebe richtig ist. Das mit richtiger Liebe zu\nLiebende, das Liebenswerte, ist das Gute im weitesten Sinne des\nWortes.” (USE 17)]\n\n\nNot any experience of pleasure is taken into consideration, one needs\nsome sort of evidence that the pleasure is correct. Brentano\ncharacterizes the relevant form of pleasure with the following words:\n“it is a pleasure of the highest form; it is thus the analogue of\nsomething being evident in the sphere of judgment”\n(ORW, 22) [“Es ist ein Gefallen von jener\nhöheren Form die das Analogon ist von der Evidenz auf dem Gebiet\ndes Urteils” (USE 21)]. In this way Brentano avoids a\nsubjectivist position. While it is true that correct pleasure is an\nemotion experienced by subjects, it is impossible that one person can\nevidently and correctly love an object and another correctly and\nevidently hate it. In some cases, pleasure or love might be misguided\nby our prejudices, instincts or habits. \n\nBrentano presented his reflections on ethics in a lecture in 1889. The\nmanuscript was published as a short monograph in the same year, an\nEnglish translation had appeared as early as 1902 and was, for a long\ntime, the only text by Brentano available in English. This might\nexplain why Brentano’s views on ethics have received more\nattention in English speaking countries than in central Europe. In\nparticular, Brentano’s basic insight that moral and aesthetic\nvalue are related to attitudes we take towards objects and that these\nlatter attitudes can be correct or incorrect, have had a revival in\nrecent years, as it has inspired\n fitting attitude theories of value.\n \n\nAesthetics, finally, is based on the most basic class of mental\nphenomena: on presentations. According to Brentano, every presentation\nis in itself of value; this holds even for those that become the basis\nof a correct, negative judgment or emotion. \n\n“Every presentation, taken by itself, is a good and recognizable\nas such, since an emotion that is characterized as being correct can\nbe directed towards it. It is out of question that everyone, if they\nhad to choose between a state of unconsciousness and the having of any\npresentation whatsoever, would welcome even the poorest presentation\nand would not envy lifeless objects. Every presentation appears of\nvalue in that it constitutes a valuable enrichment of life.”\n(GA, 144 [my translation])\n\n[“Jedes Vorstellen ist aber, an und für sich\nbetrachtet, ein Gut und als solches erkennbar, weil sich eine als\nrichtig charakterisierte Gemütstätigkeit darauf richten\nkann. Ohne Frage würde jedermann, wenn er zwischen dem Zustand\nder Bewußtlosigkeit und dem Besitz irgendwelcher Vorstellungen\nzu wählen hätte, auch die ärmlichste\nbegrüßen und die leblosen Dinge nicht beneiden. Jede\nVorstellung erscheint als eine Bereicherung des Lebens von\nWert.” (GA, 144)]\n\n\nThus, while judgments and emotions consist in taking either a positive\nor a negative stance, the value of a presentation is always positive,\nbut comes in degrees: some presentations are of higher value than\nothers. Not every presentations is of particular aesthetic value,\nthough; in order to be so, it has to become the object of an emotion\nin which one correctly takes a positive stance towards it. In short,\naccording to Brentano, an object is beautiful if a presentation that\nis directed at it arouses a correct, positive emotion, i.e., a form of\npleasure; it is ugly, on the other hand, if a presentation that is\ndirected at it arouses a correct, negative emotion, a form of\ndispleasure. \n\nLike secondary qualities, the aesthetic value is not an intrinsic\nproperty of the object but rather depends on the way we experience it.\nWe tend to attribute beauty to the objects of experience, but strictly\nspeaking, the experienced objects are neither beautiful nor ugly:\n\n“When we call a girl beautiful, the term is used in a figurative\nsense. It is similar when we call objects that are outside of us\ngreen, red, warm, cold, sweet, bitter. All these expressions refer\ninitially to what appears, and are then also transferred to that which\npossibly evokes in us this appearance by having an impact on\nus.” (GA 123 [my translation])\n\n[“Wenn wir ein Mädchen schön nennen, so wird der\nName in übertragenem Sinn gebraucht. Es ist ähnlich, wie\nwenn wir Körper, die außer uns sind, grün, rot, warm,\nkalt, heiß, biter nennen. Alle diese Ausdrücke bezeichnen\nzunächst das, was erscheint, werden dann auch auf solches\nübertragen, was unter Umständen auf uns einwirkend diese\nErscheinungen hervorruft.” (GA 123)]\n\n\nEven though Brentano’s views on ethics and aesthetics are\nsomewhat sketchy and not worked out in detail, we can note that his\ntreatment of the three practical disciplines of logics, ethics, and\naesthetics are unified by a common principle: the idea that judgments\nor emotions not only can be positive or negative, they can also be\nfitting or appropriate to their object. Moreover, by tying the three\ndisciplines to his tripartition of mental phenomena (presentations,\njudgments, emotions), he also assigns them an exact collocation in his\noverall philosophical system. For these reasons, recent commentators\nhave insisted in the systematicity of Brentano’s philosophy,\narguing that he “was the last philosopher to have offered a\nsystem in the sense of a structurally unified account of the true, the\ngood, and the beautiful.” (Kriegel 2017a, 29). Kriegel\nacknowledges, however, that “Brentano was not a systematic\nwriter” (ibid., 21). This shows in the fact that\nBrentano saw his task mainly in sketching the basic views on\naesthetics and ethics in lectures, but never presented a longer or\nsystematic treatise of these topics, which can be explained by his\nconviction that science was a collective enterprise and by his\naversion of the cult of the genius that was widespread in his times.\nBrentano probably hoped that others would continue to work out the\ndetails within the parameters he had set. We know about his views on\naesthetics and ethics only from lecture notes that have been cut,\nrevised, and amended by his students, who typically did not bother to\ndocument their substantial editorial changes in the published text.\nMoreover, Brentano never presented his philosophical position as a\nsystem, probably because he did not want to be associated with German\nsystem philosophers of the early and mid-nineteenth century. Thus, the\nclaim that Brentano was a system-philosopher is somewhat questionable,\nthough he definitely was a systematic thinker in the sense that he\nalways kept the overall picture in mind when working on a specific\nproblem. \n",
    "section_title": "4. Logic, Ethics, and Aesthetics",
    "entry_title": "Franz Brentano",
    "hierarchy_title": "Franz Brentano || Logic, Ethics, and Aesthetics",
    "tokenized_text": [
        "logic",
        "ethic",
        "aesthetic",
        "logic",
        "ethic",
        "aesthetic",
        "according",
        "brentano",
        "psychology",
        "play",
        "central",
        "role",
        "science",
        "considers",
        "especially",
        "logic",
        "ethic",
        "aesthetic",
        "practical",
        "discipline",
        "depend",
        "psychology",
        "theoretical",
        "foundation",
        "collocates",
        "three",
        "discipline",
        "larger",
        "systematic",
        "outlook",
        "tying",
        "three",
        "kind",
        "mental",
        "phenomenon",
        "presentation",
        "judgment",
        "phenomenon",
        "love",
        "hate",
        "ie",
        "emotion",
        "triad",
        "beautiful",
        "true",
        "good",
        "related",
        "three",
        "aspect",
        "mental",
        "life",
        "pe",
        "moreover",
        "three",
        "discipline",
        "essentially",
        "build",
        "view",
        "presentation",
        "intrinsically",
        "valuable",
        "judgment",
        "also",
        "emotion",
        "correct",
        "correct",
        "logic",
        "according",
        "brentano",
        "practical",
        "discipline",
        "concerned",
        "judgment",
        "ie",
        "class",
        "mental",
        "phenomenon",
        "take",
        "positive",
        "negative",
        "stance",
        "towards",
        "existence",
        "object",
        "affirming",
        "denying",
        "addition",
        "judgment",
        "correct",
        "truthvalue",
        "according",
        "brentano",
        "judgment",
        "true",
        "evident",
        "ie",
        "one",
        "perceives",
        "inner",
        "perception",
        "directed",
        "towards",
        "judgment",
        "one",
        "judge",
        "evidence",
        "brentano",
        "thus",
        "reject",
        "correspondence",
        "theory",
        "truth",
        "suggesting",
        "person",
        "judge",
        "truly",
        "judgment",
        "agrees",
        "judgment",
        "would",
        "make",
        "judge",
        "evidence",
        "chisholm",
        "notwithstanding",
        "dependence",
        "notion",
        "judgment",
        "however",
        "truth",
        "brentano",
        "subjective",
        "notion",
        "one",
        "person",
        "affirms",
        "object",
        "another",
        "person",
        "denies",
        "object",
        "one",
        "judge",
        "correctly",
        "detailed",
        "discussion",
        "brentano",
        "contribution",
        "logic",
        "cf",
        "entry",
        "brentano",
        "theory",
        "judgement",
        "ethic",
        "hand",
        "concerned",
        "emotion",
        "brentano",
        "call",
        "phenomenon",
        "love",
        "hate",
        "brentano",
        "see",
        "structural",
        "analogy",
        "judgment",
        "phenomenon",
        "class",
        "like",
        "judgment",
        "either",
        "affirmative",
        "negative",
        "also",
        "emotion",
        "consist",
        "taking",
        "positive",
        "negative",
        "emotional",
        "attitude",
        "towards",
        "object",
        "love",
        "hate",
        "inclination",
        "disinclination",
        "pleased",
        "displeased",
        "etc",
        "moreover",
        "positive",
        "negative",
        "judgment",
        "correct",
        "incorrect",
        "brentano",
        "hold",
        "also",
        "positive",
        "negative",
        "emotion",
        "correct",
        "incorrect",
        "emotion",
        "correct",
        "according",
        "brentano",
        "one",
        "feeling",
        "adequate",
        "object",
        "adequate",
        "sense",
        "appropriate",
        "suitable",
        "fitting",
        "orw",
        "wer",
        "richtig",
        "liebt",
        "und",
        "haßt",
        "dessen",
        "gemüt",
        "verhält",
        "sich",
        "den",
        "gegenständen",
        "adäquat",
        "dh",
        "e",
        "verhält",
        "sich",
        "konvenient",
        "passend",
        "entsprechend",
        "use",
        "correct",
        "love",
        "object",
        "say",
        "good",
        "correct",
        "hate",
        "bad",
        "call",
        "thing",
        "true",
        "affirmation",
        "relating",
        "correct",
        "call",
        "thing",
        "good",
        "love",
        "relating",
        "correct",
        "broadest",
        "sense",
        "term",
        "good",
        "worthy",
        "love",
        "loved",
        "love",
        "correct",
        "orw",
        "wir",
        "nennen",
        "etwas",
        "wahr",
        "wenn",
        "die",
        "darauf",
        "bezügliche",
        "anerkennung",
        "richtig",
        "ist",
        "wir",
        "nennen",
        "etwas",
        "gut",
        "wenn",
        "die",
        "darauf",
        "bezügliche",
        "liebe",
        "richtig",
        "ist",
        "da",
        "mit",
        "richtiger",
        "liebe",
        "zu",
        "liebende",
        "da",
        "liebenswerte",
        "ist",
        "da",
        "gute",
        "im",
        "weitesten",
        "sinne",
        "de",
        "wortes",
        "use",
        "experience",
        "pleasure",
        "taken",
        "consideration",
        "one",
        "need",
        "sort",
        "evidence",
        "pleasure",
        "correct",
        "brentano",
        "characterizes",
        "relevant",
        "form",
        "pleasure",
        "following",
        "word",
        "pleasure",
        "highest",
        "form",
        "thus",
        "analogue",
        "something",
        "evident",
        "sphere",
        "judgment",
        "orw",
        "e",
        "ist",
        "ein",
        "gefallen",
        "von",
        "jener",
        "höheren",
        "form",
        "die",
        "da",
        "analogon",
        "ist",
        "von",
        "der",
        "evidenz",
        "auf",
        "dem",
        "gebiet",
        "de",
        "urteils",
        "use",
        "way",
        "brentano",
        "avoids",
        "subjectivist",
        "position",
        "true",
        "correct",
        "pleasure",
        "emotion",
        "experienced",
        "subject",
        "impossible",
        "one",
        "person",
        "evidently",
        "correctly",
        "love",
        "object",
        "another",
        "correctly",
        "evidently",
        "hate",
        "case",
        "pleasure",
        "love",
        "might",
        "misguided",
        "prejudice",
        "instinct",
        "habit",
        "brentano",
        "presented",
        "reflection",
        "ethic",
        "lecture",
        "manuscript",
        "published",
        "short",
        "monograph",
        "year",
        "english",
        "translation",
        "appeared",
        "early",
        "long",
        "time",
        "text",
        "brentano",
        "available",
        "english",
        "might",
        "explain",
        "brentano",
        "view",
        "ethic",
        "received",
        "attention",
        "english",
        "speaking",
        "country",
        "central",
        "europe",
        "particular",
        "brentano",
        "basic",
        "insight",
        "moral",
        "aesthetic",
        "value",
        "related",
        "attitude",
        "take",
        "towards",
        "object",
        "latter",
        "attitude",
        "correct",
        "incorrect",
        "revival",
        "recent",
        "year",
        "inspired",
        "fitting",
        "attitude",
        "theory",
        "value",
        "aesthetic",
        "finally",
        "based",
        "basic",
        "class",
        "mental",
        "phenomenon",
        "presentation",
        "according",
        "brentano",
        "every",
        "presentation",
        "value",
        "hold",
        "even",
        "become",
        "basis",
        "correct",
        "negative",
        "judgment",
        "emotion",
        "every",
        "presentation",
        "taken",
        "good",
        "recognizable",
        "since",
        "emotion",
        "characterized",
        "correct",
        "directed",
        "towards",
        "question",
        "everyone",
        "choose",
        "state",
        "unconsciousness",
        "presentation",
        "whatsoever",
        "would",
        "welcome",
        "even",
        "poorest",
        "presentation",
        "would",
        "envy",
        "lifeless",
        "object",
        "every",
        "presentation",
        "appears",
        "value",
        "constitutes",
        "valuable",
        "enrichment",
        "life",
        "ga",
        "translation",
        "jedes",
        "vorstellen",
        "ist",
        "aber",
        "und",
        "für",
        "sich",
        "betrachtet",
        "ein",
        "gut",
        "und",
        "al",
        "solches",
        "erkennbar",
        "weil",
        "sich",
        "eine",
        "al",
        "richtig",
        "charakterisierte",
        "gemütstätigkeit",
        "darauf",
        "richten",
        "kann",
        "ohne",
        "frage",
        "würde",
        "jedermann",
        "wenn",
        "er",
        "zwischen",
        "dem",
        "zustand",
        "der",
        "bewußtlosigkeit",
        "und",
        "dem",
        "besitz",
        "irgendwelcher",
        "vorstellungen",
        "zu",
        "wählen",
        "hätte",
        "auch",
        "die",
        "ärmlichste",
        "begrüßen",
        "und",
        "die",
        "leblosen",
        "dinge",
        "nicht",
        "beneiden",
        "jede",
        "vorstellung",
        "erscheint",
        "al",
        "eine",
        "bereicherung",
        "de",
        "lebens",
        "von",
        "wert",
        "ga",
        "thus",
        "judgment",
        "emotion",
        "consist",
        "taking",
        "either",
        "positive",
        "negative",
        "stance",
        "value",
        "presentation",
        "always",
        "positive",
        "come",
        "degree",
        "presentation",
        "higher",
        "value",
        "others",
        "every",
        "presentation",
        "particular",
        "aesthetic",
        "value",
        "though",
        "order",
        "become",
        "object",
        "emotion",
        "one",
        "correctly",
        "take",
        "positive",
        "stance",
        "towards",
        "short",
        "according",
        "brentano",
        "object",
        "beautiful",
        "presentation",
        "directed",
        "arouses",
        "correct",
        "positive",
        "emotion",
        "ie",
        "form",
        "pleasure",
        "ugly",
        "hand",
        "presentation",
        "directed",
        "arouses",
        "correct",
        "negative",
        "emotion",
        "form",
        "displeasure",
        "like",
        "secondary",
        "quality",
        "aesthetic",
        "value",
        "intrinsic",
        "property",
        "object",
        "rather",
        "depends",
        "way",
        "experience",
        "tend",
        "attribute",
        "beauty",
        "object",
        "experience",
        "strictly",
        "speaking",
        "experienced",
        "object",
        "neither",
        "beautiful",
        "ugly",
        "call",
        "girl",
        "beautiful",
        "term",
        "used",
        "figurative",
        "sense",
        "similar",
        "call",
        "object",
        "outside",
        "u",
        "green",
        "red",
        "warm",
        "cold",
        "sweet",
        "bitter",
        "expression",
        "refer",
        "initially",
        "appears",
        "also",
        "transferred",
        "possibly",
        "evokes",
        "u",
        "appearance",
        "impact",
        "us",
        "ga",
        "translation",
        "wenn",
        "wir",
        "ein",
        "mädchen",
        "schön",
        "nennen",
        "wird",
        "der",
        "name",
        "übertragenem",
        "sinn",
        "gebraucht",
        "e",
        "ist",
        "ähnlich",
        "wie",
        "wenn",
        "wir",
        "körper",
        "die",
        "außer",
        "un",
        "sind",
        "grün",
        "rot",
        "warm",
        "kalt",
        "heiß",
        "biter",
        "nennen",
        "alle",
        "diese",
        "ausdrücke",
        "bezeichnen",
        "zunächst",
        "da",
        "erscheint",
        "werden",
        "dann",
        "auch",
        "auf",
        "solches",
        "übertragen",
        "unter",
        "umständen",
        "auf",
        "un",
        "einwirkend",
        "diese",
        "erscheinungen",
        "hervorruft",
        "ga",
        "even",
        "though",
        "brentano",
        "view",
        "ethic",
        "aesthetic",
        "somewhat",
        "sketchy",
        "worked",
        "detail",
        "note",
        "treatment",
        "three",
        "practical",
        "discipline",
        "logic",
        "ethic",
        "aesthetic",
        "unified",
        "common",
        "principle",
        "idea",
        "judgment",
        "emotion",
        "positive",
        "negative",
        "also",
        "fitting",
        "appropriate",
        "object",
        "moreover",
        "tying",
        "three",
        "discipline",
        "tripartition",
        "mental",
        "phenomenon",
        "presentation",
        "judgment",
        "emotion",
        "also",
        "assigns",
        "exact",
        "collocation",
        "overall",
        "philosophical",
        "system",
        "reason",
        "recent",
        "commentator",
        "insisted",
        "systematicity",
        "brentano",
        "philosophy",
        "arguing",
        "last",
        "philosopher",
        "offered",
        "system",
        "sense",
        "structurally",
        "unified",
        "account",
        "true",
        "good",
        "beautiful",
        "kriegel",
        "a",
        "kriegel",
        "acknowledges",
        "however",
        "brentano",
        "systematic",
        "writer",
        "ibid",
        "show",
        "fact",
        "brentano",
        "saw",
        "task",
        "mainly",
        "sketching",
        "basic",
        "view",
        "aesthetic",
        "ethic",
        "lecture",
        "never",
        "presented",
        "longer",
        "systematic",
        "treatise",
        "topic",
        "explained",
        "conviction",
        "science",
        "collective",
        "enterprise",
        "aversion",
        "cult",
        "genius",
        "widespread",
        "time",
        "brentano",
        "probably",
        "hoped",
        "others",
        "would",
        "continue",
        "work",
        "detail",
        "within",
        "parameter",
        "set",
        "know",
        "view",
        "aesthetic",
        "ethic",
        "lecture",
        "note",
        "cut",
        "revised",
        "amended",
        "student",
        "typically",
        "bother",
        "document",
        "substantial",
        "editorial",
        "change",
        "published",
        "text",
        "moreover",
        "brentano",
        "never",
        "presented",
        "philosophical",
        "position",
        "system",
        "probably",
        "want",
        "associated",
        "german",
        "system",
        "philosopher",
        "early",
        "midnineteenth",
        "century",
        "thus",
        "claim",
        "brentano",
        "systemphilosopher",
        "somewhat",
        "questionable",
        "though",
        "definitely",
        "systematic",
        "thinker",
        "sense",
        "always",
        "kept",
        "overall",
        "picture",
        "mind",
        "working",
        "specific",
        "problem"
    ]
}