{
    "main_text": "Brief Characterisation of Brouwer’s Intuitionism\n4. Brouwer’s Development of Intuitionism\n\nThe following is a brief history of Brouwer’s ideas in philosophy,\nmathematics, and logic. There is also a more detailed separate article\non\n The Development of Intuitionistic Logic.\n\n\nBrouwer’s little book Life, Art and Mysticism of 1905, while\nnot developing his foundations of mathematics as such, is a key to\nthose foundations as developed in his dissertation on which he was\nworking at the same time and which was finished two years later. Among\na variety of other things, such as his views on society and women\nin particular, the book contains his basic ideas on mind, language,\nontology and epistemology. \n\n\nThese ideas are applied to mathematics in his dissertation On the\nFoundations of Mathematics, defended in 1907; it is the general\nphilosophy and not the paradoxes that initiates the development of\nintuitionism (once this had begun, solutions to the paradoxes\nemerged). As did Kant, Brouwer founds mathematics on a pure intuition\nof time (but Brouwer rejects pure intuition of space).\n\n\nBrouwer holds that mathematics is an essentially languageless\nactivity, and that language can only give descriptions of mathematical\nactivity after the fact. This leads him to deny axiomatic approaches\nany foundational role in mathematics. Also, he construes logic as the\nstudy of patterns in linguistic renditions of mathematical activity,\nand therefore logic is dependent on mathematics (as the study of\npatterns) and not vice versa. It is these considerations that motivate\nhim to introduce the distinction between mathematics and\nmetamathematics (for which he used the term “second order\nmathematics”), which he would explain to Hilbert in conversations\nin 1909 (Brouwer, 1928A2, p. 375n.2).\n\n\nWith this view in place, Brouwer sets out to reconstruct Cantorian\nset theory. When an attempt (in a draft of the dissertation) at making\nconstructive sense out of Cantor’s second number class (the class of\nall denumerably infinite ordinals) and higher classes of even greater\nordinals fails, he realises that this cannot be done and rejects the\nhigher number classes, leaving only all finite ordinals and an\nunfinished or open-ended collection of denumerably infinite ordinals.\nThus, as a consequence of his philosophical views, he consciously puts\naside part of generally accepted mathematics. Soon he would do the same\nwith a principle of logic, the principle of the excluded middle (PEM),\nbut in the dissertation he still thinks of it as correct but useless,\ninterpreting \\(p \\vee \\neg p\\) as \\(\\neg p \\rightarrow \\neg p\\).\n\n\nIn “The Unreliability of the Logical Principles” of 1908,\nBrouwer formulates, in general terms, his criticism of PEM: although in\nthe simple form of \\(p \\vee \\neg p\\), the principle will never lead to a contradiction,\nthere are instances of it for which one has, constructively speaking,\nno positive grounds. Brouwer names some. Because they\ndo not in the strict sense refute PEM, they are known as “weak\ncounterexamples”. See the\nsupplement on Weak Counterexamples.\n\n\nThe innovation that gives intuitionism a much wider range than other\nvarieties of constructive mathematics (including the one in Brouwer’s\ndissertation) are the choice sequences. These are potentially infinite\nsequences of numbers (or other mathematical objects) chosen one after\nthe other by the subject. Choice sequences made their\nfirst appearance as intuitionistically acceptable objects in a book\nreview in 1914; the principle that makes them mathematically\ntractable, the continuity principle, was formulated in Brouwer’s\nlectures notes of 1916. The main use of choice sequences is the\nreconstruction of analysis; points on the continuum (real numbers) are\nidentified with choice sequences satisfying certain conditions. Choice\nsequences are collected together using a device called \n“spread”, which performs a function similar to that of the\nCantorian set in classical analysis, and initially, Brouwer even uses\nthe word “Menge” (“set”) for it. Brouwer\ndevelops a theory of spreads, and a theory of point sets based on it,\nin the two-part paper “Founding Set Theory Independently of the\nPrinciple of the Excluded Middle” (1918/1919).\n\n\nThe answer to the question in the title of Brouwer’s paper\n“Does Every Real Number Have a Decimal Expansion?” (1921A)\nturns out to be no. Brouwer demonstrates that one can construct choice\nsequences satisfying the Cauchy condition that in their exact\ndevelopment depend on an as yet open problem. No decimal expansion can\nbe constructed until the open problem is solved; on Brouwer’s strict\nconstructivist view, this means that no decimal expansion exists until\nthe open problem is solved. In this sense, one can construct real\nnumbers (i.e., converging choice sequences) that do not yet have a decimal\nexpansion.\n\n\nIn a lecture in 1923, again using choice sequences and open problems,\nBrouwer devises a general technique, now known as “Brouwerian\ncounterexamples”, to generate weak counterexamples to classical\nprinciples: “On the Significance of the Principle of the\nExcluded Middle in Mathematics” (Brouwer 1924N).\n\n\nThe basic theorems of intuitionistic analysis — the bar theorem,\nfan theorem, and continuity theorem — are in “On the\nDomains of Definition of Functions” of 1927. The first two are\nstructural theorems on spreads; the third (not to be confused with the\ncontinuity principle for choice sequences) states that every total\nfunction \\([0,1] \\rightarrow \\mathbb{R}\\) is continuous and even\nuniformly continuous. The fan theorem is, in fact, a corollary of the\nbar theorem; combined with the continuity principle, which is not\nclassically valid, it yields the continuity theorem, which is not\nclassically valid either. The bar and fan theorems on the other hand\nare classically valid, although the classical and intuitionistic\nproofs for them are not exchangeable. The classical proofs are\nintuitionistically not acceptable because of the way they depend on\nPEM; the intuitionistic proofs are classically not acceptable because\nthey depend on reflection on the structure of mental proofs. In this\nreflection, Brouwer introduced the notion of the “fully\nanalysed” or “canonical” form of a proof, which\nwould be adopted much later by Martin-Löf and by Dummett. In a\nfootnote, Brouwer mentions that such proofs, which he identifies with\nmental objects in the subject’s mind, are often infinite.\n\n\n“Intuitionist Reflections on Formalism” of 1928 identifies\nand discusses four key differences between formalism and intuitionism,\nall having to do either with the role of PEM or with the relation\nbetween mathematics and language. Brouwer emphasises, as he had done\nin his dissertation, that formalism presupposes contentual mathematics\nat the metalevel. He also here presents his first strong\ncounterexample, a refutation of PEM in the form\n\\(\\forall x\\in \\mathbb{R}(Px \\vee \\neg Px)\\), by showing that it is false that every\nreal number is either rational or irrational. See the supplement on\n Strong Counterexamples.\n\n\n\nOf the two lectures held in Vienna in 1928 — “Mathematics,\nScience and Language” (1929A) and “The Structure of the\nContinuum” (1930A) — the first is for the most part of a\nphilosophical nature while the second is more mathematical. In\n“Mathematics, Science and Language”, Brouwer states his\ngeneral views on the relations between the three subjects mentioned in\nthe title, following a genetic approach, and stressing the role of the\nwill. A longer version of this lecture was published as\n“Will, Knowledge and Speech” (1933A2); it contains the\nfirst explicit remarks about a notion that had been present from the\nstart, now known as that of the “ideal(ised) mathematician”\nor “creating subject”.\n\n\n“Consciousness, Philosophy and Mathematics” (1949C) once\nagain goes through Brouwer’s philosophy of mind and some of its\nconsequences for mathematics. Comparison with Life, Art, and\nMysticism, “Mathematics, Science and Language”, and\n“Volition, Knowledge, Language” reveals that Brouwer’s\ngeneral philosophy over the years developed considerably, but mainly\nin depth.\n\n\nIn 1949, Brouwer (1949A) publishes the first of a new class of\nstrong counterexamples, a class that differs from Brouwer’s earlier\nstrong counterexample (1928, see above) in that the type of argument,\nwhich now goes by the name of “creating subject argument”,\ninvolves essential reference to the temporal structure of the creating\nsubject’s mathematical activity (Heyting, 1956, chs. III and VIII; van\nAtten, 2003, chs.4 and 5; van Atten, 2018).\n\n\nBrouwer’s example shows that there is a case where the double negation\nprinciple in the form of\n\\(\\forall x\\in \\mathbb{R}(\\neg \\neg Px \\rightarrow Px)\\), leads to a contradiction (“The\nNon-equivalence of the Constructive and the Negative Order Relation on\nthe Continuum”, in Dutch). The first publication of a strong\ncounterexample in English had to wait till 1954, in “An Example\nof Contradictority in Classical Theory of Functions”\n(1954F). This polemical title should be understood as follows: if one\nkeeps to the letter of the classical theory but in its interpretation\nsubstitutes intuitionistic notions for their classical counterparts,\none arrives at a contradiction. So it is not a counterexample in the\nstrict sense of the word, but rather a non-interpretability result. As\nintuitionistic logic is, formally speaking, part of classical logic,\nand intuitionistic arithmetic is part of classical arithmetic, the\nexistence of strong counterexamples must depend on an essentially\nnon-classical ingredient, and this is of course the choice\nsequences.\n\n\nThe creating subject argument is, after the earlier introduction of\nchoice sequences and the proof of the bar theorem, a new step in the\nexploitation of the subjective aspects of intuitionism. There is no\nprincipled reason why it should be the last.\n",
    "section_title": "4. Brouwer’s Development of Intuitionism",
    "entry_title": "Luitzen Egbertus Jan Brouwer",
    "hierarchy_title": "Luitzen Egbertus Jan Brouwer || Brief Characterisation of Brouwer’s Intuitionism",
    "tokenized_text": [
        "brief",
        "characterisation",
        "brouwer",
        "intuitionism",
        "brouwer",
        "development",
        "intuitionism",
        "following",
        "brief",
        "history",
        "brouwer",
        "idea",
        "philosophy",
        "mathematics",
        "logic",
        "also",
        "detailed",
        "separate",
        "article",
        "development",
        "intuitionistic",
        "logic",
        "brouwer",
        "little",
        "book",
        "life",
        "art",
        "mysticism",
        "developing",
        "foundation",
        "mathematics",
        "key",
        "foundation",
        "developed",
        "dissertation",
        "working",
        "time",
        "finished",
        "two",
        "year",
        "later",
        "among",
        "variety",
        "thing",
        "view",
        "society",
        "woman",
        "particular",
        "book",
        "contains",
        "basic",
        "idea",
        "mind",
        "language",
        "ontology",
        "epistemology",
        "idea",
        "applied",
        "mathematics",
        "dissertation",
        "foundation",
        "mathematics",
        "defended",
        "general",
        "philosophy",
        "paradox",
        "initiate",
        "development",
        "intuitionism",
        "begun",
        "solution",
        "paradox",
        "emerged",
        "kant",
        "brouwer",
        "found",
        "mathematics",
        "pure",
        "intuition",
        "time",
        "brouwer",
        "reject",
        "pure",
        "intuition",
        "space",
        "brouwer",
        "hold",
        "mathematics",
        "essentially",
        "languageless",
        "activity",
        "language",
        "give",
        "description",
        "mathematical",
        "activity",
        "fact",
        "lead",
        "deny",
        "axiomatic",
        "approach",
        "foundational",
        "role",
        "mathematics",
        "also",
        "construes",
        "logic",
        "study",
        "pattern",
        "linguistic",
        "rendition",
        "mathematical",
        "activity",
        "therefore",
        "logic",
        "dependent",
        "mathematics",
        "study",
        "pattern",
        "vice",
        "versa",
        "consideration",
        "motivate",
        "introduce",
        "distinction",
        "mathematics",
        "metamathematics",
        "used",
        "term",
        "second",
        "order",
        "mathematics",
        "would",
        "explain",
        "hilbert",
        "conversation",
        "brouwer",
        "a",
        "p",
        "n",
        "view",
        "place",
        "brouwer",
        "set",
        "reconstruct",
        "cantorian",
        "set",
        "theory",
        "attempt",
        "draft",
        "dissertation",
        "making",
        "constructive",
        "sense",
        "cantor",
        "second",
        "number",
        "class",
        "class",
        "denumerably",
        "infinite",
        "ordinal",
        "higher",
        "class",
        "even",
        "greater",
        "ordinal",
        "fails",
        "realises",
        "done",
        "reject",
        "higher",
        "number",
        "class",
        "leaving",
        "finite",
        "ordinal",
        "unfinished",
        "openended",
        "collection",
        "denumerably",
        "infinite",
        "ordinal",
        "thus",
        "consequence",
        "philosophical",
        "view",
        "consciously",
        "put",
        "aside",
        "part",
        "generally",
        "accepted",
        "mathematics",
        "soon",
        "would",
        "principle",
        "logic",
        "principle",
        "excluded",
        "middle",
        "pem",
        "dissertation",
        "still",
        "think",
        "correct",
        "useless",
        "interpreting",
        "p",
        "vee",
        "neg",
        "p",
        "neg",
        "p",
        "rightarrow",
        "neg",
        "p",
        "unreliability",
        "logical",
        "principle",
        "brouwer",
        "formulates",
        "general",
        "term",
        "criticism",
        "pem",
        "although",
        "simple",
        "form",
        "p",
        "vee",
        "neg",
        "p",
        "principle",
        "never",
        "lead",
        "contradiction",
        "instance",
        "one",
        "constructively",
        "speaking",
        "positive",
        "ground",
        "brouwer",
        "name",
        "strict",
        "sense",
        "refute",
        "pem",
        "known",
        "weak",
        "counterexample",
        "see",
        "supplement",
        "weak",
        "counterexample",
        "innovation",
        "give",
        "intuitionism",
        "much",
        "wider",
        "range",
        "variety",
        "constructive",
        "mathematics",
        "including",
        "one",
        "brouwer",
        "dissertation",
        "choice",
        "sequence",
        "potentially",
        "infinite",
        "sequence",
        "number",
        "mathematical",
        "object",
        "chosen",
        "one",
        "subject",
        "choice",
        "sequence",
        "made",
        "first",
        "appearance",
        "intuitionistically",
        "acceptable",
        "object",
        "book",
        "review",
        "principle",
        "make",
        "mathematically",
        "tractable",
        "continuity",
        "principle",
        "formulated",
        "brouwer",
        "lecture",
        "note",
        "main",
        "use",
        "choice",
        "sequence",
        "reconstruction",
        "analysis",
        "point",
        "continuum",
        "real",
        "number",
        "identified",
        "choice",
        "sequence",
        "satisfying",
        "certain",
        "condition",
        "choice",
        "sequence",
        "collected",
        "together",
        "using",
        "device",
        "called",
        "spread",
        "performs",
        "function",
        "similar",
        "cantorian",
        "set",
        "classical",
        "analysis",
        "initially",
        "brouwer",
        "even",
        "us",
        "word",
        "menge",
        "set",
        "brouwer",
        "develops",
        "theory",
        "spread",
        "theory",
        "point",
        "set",
        "based",
        "twopart",
        "paper",
        "founding",
        "set",
        "theory",
        "independently",
        "principle",
        "excluded",
        "middle",
        "answer",
        "question",
        "title",
        "brouwer",
        "paper",
        "every",
        "real",
        "number",
        "decimal",
        "expansion",
        "a",
        "turn",
        "brouwer",
        "demonstrates",
        "one",
        "construct",
        "choice",
        "sequence",
        "satisfying",
        "cauchy",
        "condition",
        "exact",
        "development",
        "depend",
        "yet",
        "open",
        "problem",
        "decimal",
        "expansion",
        "constructed",
        "open",
        "problem",
        "solved",
        "brouwer",
        "strict",
        "constructivist",
        "view",
        "mean",
        "decimal",
        "expansion",
        "exists",
        "open",
        "problem",
        "solved",
        "sense",
        "one",
        "construct",
        "real",
        "number",
        "ie",
        "converging",
        "choice",
        "sequence",
        "yet",
        "decimal",
        "expansion",
        "lecture",
        "using",
        "choice",
        "sequence",
        "open",
        "problem",
        "brouwer",
        "devise",
        "general",
        "technique",
        "known",
        "brouwerian",
        "counterexample",
        "generate",
        "weak",
        "counterexample",
        "classical",
        "principle",
        "significance",
        "principle",
        "excluded",
        "middle",
        "mathematics",
        "brouwer",
        "n",
        "basic",
        "theorem",
        "intuitionistic",
        "analysis",
        "bar",
        "theorem",
        "fan",
        "theorem",
        "continuity",
        "theorem",
        "domain",
        "definition",
        "function",
        "first",
        "two",
        "structural",
        "theorem",
        "spread",
        "third",
        "confused",
        "continuity",
        "principle",
        "choice",
        "sequence",
        "state",
        "every",
        "total",
        "function",
        "rightarrow",
        "mathbb",
        "r",
        "continuous",
        "even",
        "uniformly",
        "continuous",
        "fan",
        "theorem",
        "fact",
        "corollary",
        "bar",
        "theorem",
        "combined",
        "continuity",
        "principle",
        "classically",
        "valid",
        "yield",
        "continuity",
        "theorem",
        "classically",
        "valid",
        "either",
        "bar",
        "fan",
        "theorem",
        "hand",
        "classically",
        "valid",
        "although",
        "classical",
        "intuitionistic",
        "proof",
        "exchangeable",
        "classical",
        "proof",
        "intuitionistically",
        "acceptable",
        "way",
        "depend",
        "pem",
        "intuitionistic",
        "proof",
        "classically",
        "acceptable",
        "depend",
        "reflection",
        "structure",
        "mental",
        "proof",
        "reflection",
        "brouwer",
        "introduced",
        "notion",
        "fully",
        "analysed",
        "canonical",
        "form",
        "proof",
        "would",
        "adopted",
        "much",
        "later",
        "martinlöf",
        "dummett",
        "footnote",
        "brouwer",
        "mention",
        "proof",
        "identifies",
        "mental",
        "object",
        "subject",
        "mind",
        "often",
        "infinite",
        "intuitionist",
        "reflection",
        "formalism",
        "identifies",
        "discus",
        "four",
        "key",
        "difference",
        "formalism",
        "intuitionism",
        "either",
        "role",
        "pem",
        "relation",
        "mathematics",
        "language",
        "brouwer",
        "emphasis",
        "done",
        "dissertation",
        "formalism",
        "presupposes",
        "contentual",
        "mathematics",
        "metalevel",
        "also",
        "present",
        "first",
        "strong",
        "counterexample",
        "refutation",
        "pem",
        "form",
        "forall",
        "xin",
        "mathbb",
        "r",
        "px",
        "vee",
        "neg",
        "px",
        "showing",
        "false",
        "every",
        "real",
        "number",
        "either",
        "rational",
        "irrational",
        "see",
        "supplement",
        "strong",
        "counterexample",
        "two",
        "lecture",
        "held",
        "vienna",
        "mathematics",
        "science",
        "language",
        "a",
        "structure",
        "continuum",
        "a",
        "first",
        "part",
        "philosophical",
        "nature",
        "second",
        "mathematical",
        "mathematics",
        "science",
        "language",
        "brouwer",
        "state",
        "general",
        "view",
        "relation",
        "three",
        "subject",
        "mentioned",
        "title",
        "following",
        "genetic",
        "approach",
        "stressing",
        "role",
        "longer",
        "version",
        "lecture",
        "published",
        "knowledge",
        "speech",
        "a",
        "contains",
        "first",
        "explicit",
        "remark",
        "notion",
        "present",
        "start",
        "known",
        "ideal",
        "ised",
        "mathematician",
        "creating",
        "subject",
        "consciousness",
        "philosophy",
        "mathematics",
        "c",
        "go",
        "brouwer",
        "philosophy",
        "mind",
        "consequence",
        "mathematics",
        "comparison",
        "life",
        "art",
        "mysticism",
        "mathematics",
        "science",
        "language",
        "volition",
        "knowledge",
        "language",
        "reveals",
        "brouwer",
        "general",
        "philosophy",
        "year",
        "developed",
        "considerably",
        "mainly",
        "depth",
        "brouwer",
        "a",
        "publishes",
        "first",
        "new",
        "class",
        "strong",
        "counterexample",
        "class",
        "differs",
        "brouwer",
        "earlier",
        "strong",
        "counterexample",
        "see",
        "type",
        "argument",
        "go",
        "name",
        "creating",
        "subject",
        "argument",
        "involves",
        "essential",
        "reference",
        "temporal",
        "structure",
        "creating",
        "subject",
        "mathematical",
        "activity",
        "heyting",
        "chs",
        "iii",
        "viii",
        "van",
        "atten",
        "chs",
        "van",
        "atten",
        "brouwer",
        "example",
        "show",
        "case",
        "double",
        "negation",
        "principle",
        "form",
        "forall",
        "xin",
        "mathbb",
        "r",
        "neg",
        "neg",
        "px",
        "rightarrow",
        "px",
        "lead",
        "contradiction",
        "nonequivalence",
        "constructive",
        "negative",
        "order",
        "relation",
        "continuum",
        "dutch",
        "first",
        "publication",
        "strong",
        "counterexample",
        "english",
        "wait",
        "till",
        "example",
        "contradictority",
        "classical",
        "theory",
        "function",
        "f",
        "polemical",
        "title",
        "understood",
        "follows",
        "one",
        "keep",
        "letter",
        "classical",
        "theory",
        "interpretation",
        "substitute",
        "intuitionistic",
        "notion",
        "classical",
        "counterpart",
        "one",
        "arrives",
        "contradiction",
        "counterexample",
        "strict",
        "sense",
        "word",
        "rather",
        "noninterpretability",
        "result",
        "intuitionistic",
        "logic",
        "formally",
        "speaking",
        "part",
        "classical",
        "logic",
        "intuitionistic",
        "arithmetic",
        "part",
        "classical",
        "arithmetic",
        "existence",
        "strong",
        "counterexample",
        "must",
        "depend",
        "essentially",
        "nonclassical",
        "ingredient",
        "course",
        "choice",
        "sequence",
        "creating",
        "subject",
        "argument",
        "earlier",
        "introduction",
        "choice",
        "sequence",
        "proof",
        "bar",
        "theorem",
        "new",
        "step",
        "exploitation",
        "subjective",
        "aspect",
        "intuitionism",
        "principled",
        "reason",
        "last"
    ]
}