{
    "main_text": "Chronology\n2. Chronology\n\n1881 February 27, born in Overschie (since 1941\npart of Rotterdam), The Netherlands.\n\n1897 Enters the University of Amsterdam to study\nmathematics and physics.\n\n1904 Obtains doctorandus title (MSc degree)\nin mathematics; first publication (on rotations in four dimensional\nspace); marries Lize de Holl (born 1870). They would have no children,\nbut Lize had a daughter from an earlier marriage. They move to\nBlaricum, near Amsterdam, where they would live for the rest of their\nlives, although they also had houses in other places.\n\n1904–1907 Doctoral studies. His mathematical\nand philosophical notebooks towards his dissertation show strong\ninfluence from notably Cantor, Hilbert, Russell, Poincaré, and\nCouturat. He is aware of the Frege–Hilbert debate, and in that\nmatter sides with Frege. Some remarks betray a form of anti-semitism\nthat, unfortunately, often appeared in language at the time, as\ncodification of a common prejudice; an occasional remark goes further\nand contrasts Jewish people unfavourably to Germanic ones. No such\nutterances are known from other periods in his life; compare also the\nentries for 1934–1935 and 1940–1945 below. There is no meaningful\nconnection between this fleeting anti-semitism and the philosophical\nviews on mathematics, language, and society he set out in his\ndissertation and developed over the rest of his life.\n\n\n1907 Obtains doctor title with\ndissertation On the Foundations of Mathematics, under\nsupervision of Korteweg at the University of Amsterdam. (The original\nDutch title of the dissertation was ‘Over de Grondslagen der\nWiskunde’. The present entry will for the most part refer to works\ncited by using the titles of English translations, with the\nbibliography providing information about the original publications.)\nIt marks the beginning of his intuitionistic reconstruction of\nmathematics. Later that year, Brouwer’s wife graduates and becomes a\npharmacist. All his life, Brouwer did the bookkeeping for her and\nfilled out the tax forms, and sometimes he assisted behind the\ncounter.\n\n1908 First publication of his argument against the\ngeneral validity of the Principle of the Excluded Middle in “The\nunreliability of the logical principles”. First participation in\nan international conference, the Fourth International Conference of\nMathematicians in Rome.\n\n1909–1913 In a very productive four years,\nBrouwer founds modern topology, as a chapter of classical mathematics.\nHighlights: invariance of dimension, fixed point theorem, mapping\ndegree, definition of dimension. As van Dalen (2005, p. 450) observes,\nBrouwer’s definition of dimension seems to be the first reformulation\nof an inductive definition as a game. A pause in his intuitionistic\nprogram.\n\n1909 Becomes privaatdocent (unpaid lecturer)\nat the University of Amsterdam. Inaugural lecture “The Nature of\nGeometry”.\n\n1909 Meets Hilbert in the Dutch seaside resort of\nScheveningen. Brouwer much admires Hilbert and describes their meeting\nin a letter to a friend as “a beautiful new ray of light through\nmy life” (Brouwer & Adama van Scheltema, 1984, p. 100). Twenty\nyears later, Brouwer’s relation with Hilbert would turn sour.\n\n1911 First appearance of the names\n“formalism” and “intuitionism” in Brouwer’s\nwritings, in a review of Mannoury’s Methodological\nand philosophical remarks on elementary mathematics (1909).\n\n1912 Elected member of the Royal Academy of\nSciences (during World War II “Dutch Academy of Sciences”,\nafterward “Royal Dutch Academy of Sciences”).\n\n1912 Appointed full professor\nextraordinarius in the field of set theory, function\ntheory, and axiomatics. His philosophical inaugural lecture\n“Intuïtionisme en Formalisme” is translated into English as\n“Intuitionism and Formalism” and thus becomes, in 1913, the\nfirst publication on intuitionism in that language.\n\n1913 Appointed full professor ordinarius,\nsucceeding Korteweg, who had generously offered to vacate his chair for\nthe purpose.\n\n1914 Invited to join the editorial board of the\nMathematische Annalen; accepts the honour.\n\n1918 Brouwer begins the systematic intuitionistic\nreconstruction of mathematics with his paper “Founding\nSet Theory Independently of the Principle of the Excluded Middle. Part\nOne, General Set Theory”.\n\n1919 Receives offers for professorships in\nGöttingen and in Berlin; declines both.\n\n1919 “Intuitionistic Set Theory” is the first piece of\nintuitionistic mathematics in a widely read international journal, the\nJahresbericht der Deutschen Mathematiker Vereinigung.\n\n1920 Start of the “Grundlagenstreit”\n(Foundational Debate) with Brouwer’s lecture at the\n“Naturforscherversammlung” in Bad Nauheim, published in\n1921, “Does Every Real Number Have a\nDecimal Expansion?”; the debate was amplified by Weyl’s defence of intuitionism\nin 1921, “On the New Foundational Crisis of\nMathematics”; Hilbert responds in 1922,\n“The New\nGrounding of Mathematics”.\n\n1922 Co-founds, with Gerrit Mannoury, the man of letters \nFrederik van Eeden, and others, the “Signific Circle”, \naiming at spiritual and\npolitical progress through language reform. The Circle ends its meetings in\n1926, but Mannoury continues its work.\n\n1926 Lecture in Göttingen; as a result of a\ngroup dinner at Emmy Noether’s house, Hilbert and Brouwer are (for a\nbrief period) on good terms again.\n\n1927 Lecture series in Berlin; Hans Reichenbach and\nAndré Weil are in the audience, as is Brouwer’s later assistant\nHans Freudenthal. The newspaper Berliner Tageblatt proposes a\npublic debate between Brouwer and Hilbert, to be held in its pages,\nbut for some reason this is not realised. Neither does Brouwer\ncomplete the book he is invited to write by the German publisher\nWalter de Gruyter. The lectures and an incomplete book are published\nposthumously (Brouwer, 1992).\n\n1928 March 10 and 14: two lectures in Vienna.\nGödel is in the audience, as is Wittgenstein. It is said that the\nfirst lecture made Wittgenstein return to philosophy. Brouwer spends a\nday with Wittgenstein.\n\n1928 April: conversations with Husserl, who is in\nAmsterdam to lecture.\n\n1928 Conflict over the Bologna conference. The German\nmathematicians are, for the first time since the ending of World War\nI, admitted to an international conference again, but not quite as\nequals. Brouwer insists that this is not fair, and that the conference\nshould therefore be boycotted. Hilbert, who does not share this view,\nis much chagrined by Brouwer’s action and attends the conference as\nthe leader of the German delegation, the largest present.\n\n1928–1929 “Mathematische Annalenstreit”,\nthe conflict in the editorial board of Mathematische\nAnnalen. Hilbert, thinking he is about to die, feels a need to\nmake sure that after his death Brouwer will not become too\ninfluential, and expels him from the board in an unlawful way.\n(Hilbert’s motivation as described here is documented in letters from\npeople close to him: Carathéodory to Einstein, October 20,\n1928; Blumenthal to the publisher and editors of the Mathematische\nAnnalen, November 16, 1928; Born to Einstein, November 20,\n1928. Copies of these letters are in the Brouwer Papers \nat the Noord-Hollands Archief in Haarlem. \nRelevant quotations from these can be found in van Dalen,\n2005, p. 604 and p. 613.) Einstein, also member of the board,\nrefuses to support Hilbert’s action and does not want to have anything\nto do with the whole affair; most other board members do not want to\nirritate Hilbert by opposing him. Brouwer vehemently protests. In the\nend, the whole board is dissolved and immediately reassembled without\nBrouwer, in a strongly reduced size (in particular, Einstein and\nCarathéodory decline). The conflict leaves Brouwer mentally\nbroken and isolated, and puts an end to a very creative decade in his\nwork. Now that the two main contestants are no longer able to carry it\non, the “Grundlagenstreit” is over.\n\n1928–1930 Conflict with Karl Menger over the\npriority for the first correct definition of the notion of\ndimension.\n\n1929 August: theft of Brouwer’s briefcase on the\ntram in Brussels, and with it of his mathematical notebook. When\nneither the police nor a private detective hired for the purpose is\nable to find it again, he despairs of ever being able to reconstruct\nits contents. Brouwer later said that this loss was instrumental in the\nshift of his main interest from mathematics to philosophy.\n\n1929 Begins preparations for the foundation of a\nnew mathematical journal.\n\n1934 Appearance of the first issue of Brouwer’s own\ninternational journal, entitled Compositio Mathematica.\n\n1934 Lecture series in Geneva, on invitation of\nFerdinand Gonseth. Plans for a course on intuitionistic mathematics\nin Göttingen come very far, but are, in the end, not realised.\n\n1934–1935 Ludwig Bieberbach, a German member of\nthe editorial board of\nCompositio Mathematica who in 1933\nhad joined the National Socialist movement by entering the SA,\nasks Brouwer to remove the Jewish members from that board. \nBrouwer refuses; Bieberbach resigns.\n\n\n1935–1941 Member of the municipal council of\nBlaricum for the local Neutral Party (in 1939 he wins the elections by\nreceiving 310 of the 1601 votes).\n\n1940–1945 During the German Occupation of the\nNetherlands in World War II, Brouwer assists the resistance by letting\nthem use storage space in the Mathematical Institute, of which he was\nthe director. He offers hiding places to Jews and other persecuted\npersons in small houses on his premises (as testified by a neighbour’s\ndaughter, herself involved in these operations, in van Dalen 2005,\nvol. 2, p. 772–773). In 1943, he advises the students to sign\nthe declaration of loyalty demanded by the Germans; when some students\nrefuse and go into hiding, Brouwer and Heyting visit them to continue\ntheir education. Part of Brouwer’s explanation, after the war, for\nthe advice to sign is that signing would provide the students with the\nrelative peace needed to build up and carry out resistance\nactivities. He is met with skepticism (but is supported by Mannoury).\nBecause of this and some similar perhaps unfortunate attempts at\nshrewdness during the occupation, after the liberation he is suspended\nfor a few months. Deeply offended, Brouwer considers emigration to\nSouth Africa or the USA.\n\n1941 and 1944 Fires in Brouwer’s house destroy\nsignificant parts of his archives and library. \n\n1942 Publishes three short notes again on\nintuitionistic foundations, the first since 1933.\n\n1945–1950 Conflict over Compositio\nMathematica. The journal had not appeared during the war, and an\neffort is made to bring it back to life. Difficulties in assembling a\nnew board of editors arise because of Brouwer’s damaged reputation. In\nthe end, Brouwer’s name remains on the title page, but in effect he is\nremoved from the board of the journal he had founded.\n\n1947–1951 Annual lecture series in Cambridge,\nEngland. Brouwer plans to turn them into a book, but this does not\nhappen. However, he completes five of the planned six chapters, and\nthese are published poshumously (Brouwer, 1981).\n\n1948 Resumes his foundational program with a paper\nthat exploits the notion of the creating subject. Beginning of another\ncreative period.\n\n1949 Opposes a plan to have his collected papers\npublished, on the ground that he has no time to write annotations that\nreflect his original as well as his present views on them, which he\nconsiders would be the scientifically responsible thing to do.\n\n1951 Retires from the University of\nAmsterdam. Cooling off of his relationship with Arend Heyting, his\nsuccessor at the post of director of the Mathematical Institute, as a\nresult of disagreement over the exact role the retired Brouwer could\nstill play there.\n\n1952 Lectures in London and in Cape Town.\n\n1953 Lectures in Helsinki, where he stays with Von\nWright. Lecture tour through the USA (among others MIT, Princeton,\nUniversity of Wisconsin-Madison, Berkeley, Chicago) and Canada\n(Canadian Mathematical Congress in Kingston, Ontario). In Princeton,\nhe visits Gödel.\n\n1955 Publishes his last new paper (based on his\nlecture at the Boole conference in Dublin the year before).\n\n1959 Death of Mrs Brouwer, 89 years old. Brouwer\ndeclines an offer for a 1-year position at the University of British\nColumbia in Vancouver.\n\n1962 Brouwer is offered a position in Montana.\n\n1966 December 2: dies in Blaricum, The Netherlands,\n85 years old, when he is hit by a car in front of his house.\nHis library and archives are dispersed.\nBeginning in the 1970s, \nWalter van Stigt and Dirk van Dalen reconstitute the archives\nas much as possible;\nthe Brouwer Papers are now kept at the Noord-Hollands Archief in Haarlem.\n",
    "section_title": "2. Chronology",
    "entry_title": "Luitzen Egbertus Jan Brouwer",
    "hierarchy_title": "Luitzen Egbertus Jan Brouwer || Chronology",
    "tokenized_text": [
        "chronology",
        "chronology",
        "february",
        "born",
        "overschie",
        "since",
        "part",
        "rotterdam",
        "netherlands",
        "enters",
        "university",
        "amsterdam",
        "study",
        "mathematics",
        "physic",
        "obtains",
        "doctorandus",
        "title",
        "msc",
        "degree",
        "mathematics",
        "first",
        "publication",
        "rotation",
        "four",
        "dimensional",
        "space",
        "marries",
        "lize",
        "de",
        "holl",
        "born",
        "would",
        "child",
        "lize",
        "daughter",
        "earlier",
        "marriage",
        "move",
        "blaricum",
        "near",
        "amsterdam",
        "would",
        "live",
        "rest",
        "life",
        "although",
        "also",
        "house",
        "place",
        "doctoral",
        "study",
        "mathematical",
        "philosophical",
        "notebook",
        "towards",
        "dissertation",
        "show",
        "strong",
        "influence",
        "notably",
        "cantor",
        "hilbert",
        "russell",
        "poincaré",
        "couturat",
        "aware",
        "fregehilbert",
        "debate",
        "matter",
        "side",
        "frege",
        "remark",
        "betray",
        "form",
        "antisemitism",
        "unfortunately",
        "often",
        "appeared",
        "language",
        "time",
        "codification",
        "common",
        "prejudice",
        "occasional",
        "remark",
        "go",
        "contrast",
        "jewish",
        "people",
        "unfavourably",
        "germanic",
        "one",
        "utterance",
        "known",
        "period",
        "life",
        "compare",
        "also",
        "entry",
        "meaningful",
        "connection",
        "fleeting",
        "antisemitism",
        "philosophical",
        "view",
        "mathematics",
        "language",
        "society",
        "set",
        "dissertation",
        "developed",
        "rest",
        "life",
        "obtains",
        "doctor",
        "title",
        "dissertation",
        "foundation",
        "mathematics",
        "supervision",
        "korteweg",
        "university",
        "amsterdam",
        "original",
        "dutch",
        "title",
        "dissertation",
        "de",
        "grondslagen",
        "der",
        "wiskunde",
        "present",
        "entry",
        "part",
        "refer",
        "work",
        "cited",
        "using",
        "title",
        "english",
        "translation",
        "bibliography",
        "providing",
        "information",
        "original",
        "publication",
        "mark",
        "beginning",
        "intuitionistic",
        "reconstruction",
        "mathematics",
        "later",
        "year",
        "brouwer",
        "wife",
        "graduate",
        "becomes",
        "pharmacist",
        "life",
        "brouwer",
        "bookkeeping",
        "filled",
        "tax",
        "form",
        "sometimes",
        "assisted",
        "behind",
        "counter",
        "first",
        "publication",
        "argument",
        "general",
        "validity",
        "principle",
        "excluded",
        "middle",
        "unreliability",
        "logical",
        "principle",
        "first",
        "participation",
        "international",
        "conference",
        "fourth",
        "international",
        "conference",
        "mathematician",
        "rome",
        "productive",
        "four",
        "year",
        "brouwer",
        "found",
        "modern",
        "topology",
        "chapter",
        "classical",
        "mathematics",
        "highlight",
        "invariance",
        "dimension",
        "fixed",
        "point",
        "theorem",
        "mapping",
        "degree",
        "definition",
        "dimension",
        "van",
        "dalen",
        "p",
        "observes",
        "brouwer",
        "definition",
        "dimension",
        "seems",
        "first",
        "reformulation",
        "inductive",
        "definition",
        "game",
        "pause",
        "intuitionistic",
        "program",
        "becomes",
        "privaatdocent",
        "unpaid",
        "lecturer",
        "university",
        "amsterdam",
        "inaugural",
        "lecture",
        "nature",
        "geometry",
        "meet",
        "hilbert",
        "dutch",
        "seaside",
        "resort",
        "scheveningen",
        "brouwer",
        "much",
        "admires",
        "hilbert",
        "describes",
        "meeting",
        "letter",
        "friend",
        "beautiful",
        "new",
        "ray",
        "light",
        "life",
        "brouwer",
        "adama",
        "van",
        "scheltema",
        "p",
        "twenty",
        "year",
        "later",
        "brouwer",
        "relation",
        "hilbert",
        "would",
        "turn",
        "sour",
        "first",
        "appearance",
        "name",
        "formalism",
        "intuitionism",
        "brouwer",
        "writing",
        "review",
        "mannoury",
        "methodological",
        "philosophical",
        "remark",
        "elementary",
        "mathematics",
        "elected",
        "member",
        "royal",
        "academy",
        "science",
        "world",
        "war",
        "ii",
        "dutch",
        "academy",
        "science",
        "afterward",
        "royal",
        "dutch",
        "academy",
        "science",
        "appointed",
        "full",
        "professor",
        "extraordinarius",
        "field",
        "set",
        "theory",
        "function",
        "theory",
        "axiomatics",
        "philosophical",
        "inaugural",
        "lecture",
        "intuïtionisme",
        "en",
        "formalisme",
        "translated",
        "english",
        "intuitionism",
        "formalism",
        "thus",
        "becomes",
        "first",
        "publication",
        "intuitionism",
        "language",
        "appointed",
        "full",
        "professor",
        "ordinarius",
        "succeeding",
        "korteweg",
        "generously",
        "offered",
        "vacate",
        "chair",
        "purpose",
        "invited",
        "join",
        "editorial",
        "board",
        "mathematische",
        "annalen",
        "accepts",
        "honour",
        "brouwer",
        "begin",
        "systematic",
        "intuitionistic",
        "reconstruction",
        "mathematics",
        "paper",
        "founding",
        "set",
        "theory",
        "independently",
        "principle",
        "excluded",
        "middle",
        "part",
        "one",
        "general",
        "set",
        "theory",
        "receives",
        "offer",
        "professorship",
        "göttingen",
        "berlin",
        "decline",
        "intuitionistic",
        "set",
        "theory",
        "first",
        "piece",
        "intuitionistic",
        "mathematics",
        "widely",
        "read",
        "international",
        "journal",
        "jahresbericht",
        "der",
        "deutschen",
        "mathematiker",
        "vereinigung",
        "start",
        "grundlagenstreit",
        "foundational",
        "debate",
        "brouwer",
        "lecture",
        "naturforscherversammlung",
        "bad",
        "nauheim",
        "published",
        "every",
        "real",
        "number",
        "decimal",
        "expansion",
        "debate",
        "amplified",
        "weyl",
        "defence",
        "intuitionism",
        "new",
        "foundational",
        "crisis",
        "mathematics",
        "hilbert",
        "responds",
        "new",
        "grounding",
        "mathematics",
        "cofounds",
        "gerrit",
        "mannoury",
        "man",
        "letter",
        "frederik",
        "van",
        "eeden",
        "others",
        "signific",
        "circle",
        "aiming",
        "spiritual",
        "political",
        "progress",
        "language",
        "reform",
        "circle",
        "end",
        "meeting",
        "mannoury",
        "continues",
        "work",
        "lecture",
        "göttingen",
        "result",
        "group",
        "dinner",
        "emmy",
        "noether",
        "house",
        "hilbert",
        "brouwer",
        "brief",
        "period",
        "good",
        "term",
        "lecture",
        "series",
        "berlin",
        "han",
        "reichenbach",
        "andré",
        "weil",
        "audience",
        "brouwer",
        "later",
        "assistant",
        "han",
        "freudenthal",
        "newspaper",
        "berliner",
        "tageblatt",
        "proposes",
        "public",
        "debate",
        "brouwer",
        "hilbert",
        "held",
        "page",
        "reason",
        "realised",
        "neither",
        "brouwer",
        "complete",
        "book",
        "invited",
        "write",
        "german",
        "publisher",
        "walter",
        "de",
        "gruyter",
        "lecture",
        "incomplete",
        "book",
        "published",
        "posthumously",
        "brouwer",
        "march",
        "two",
        "lecture",
        "vienna",
        "gödel",
        "audience",
        "wittgenstein",
        "said",
        "first",
        "lecture",
        "made",
        "wittgenstein",
        "return",
        "philosophy",
        "brouwer",
        "spends",
        "day",
        "wittgenstein",
        "april",
        "conversation",
        "husserl",
        "amsterdam",
        "lecture",
        "conflict",
        "bologna",
        "conference",
        "german",
        "mathematician",
        "first",
        "time",
        "since",
        "ending",
        "world",
        "war",
        "admitted",
        "international",
        "conference",
        "quite",
        "equal",
        "brouwer",
        "insists",
        "fair",
        "conference",
        "therefore",
        "boycotted",
        "hilbert",
        "share",
        "view",
        "much",
        "chagrined",
        "brouwer",
        "action",
        "attends",
        "conference",
        "leader",
        "german",
        "delegation",
        "largest",
        "present",
        "mathematische",
        "annalenstreit",
        "conflict",
        "editorial",
        "board",
        "mathematische",
        "annalen",
        "hilbert",
        "thinking",
        "die",
        "feel",
        "need",
        "make",
        "sure",
        "death",
        "brouwer",
        "become",
        "influential",
        "expels",
        "board",
        "unlawful",
        "way",
        "hilbert",
        "motivation",
        "described",
        "documented",
        "letter",
        "people",
        "close",
        "carathéodory",
        "einstein",
        "october",
        "blumenthal",
        "publisher",
        "editor",
        "mathematische",
        "annalen",
        "november",
        "born",
        "einstein",
        "november",
        "copy",
        "letter",
        "brouwer",
        "paper",
        "noordhollands",
        "archief",
        "haarlem",
        "relevant",
        "quotation",
        "found",
        "van",
        "dalen",
        "p",
        "p",
        "einstein",
        "also",
        "member",
        "board",
        "refuse",
        "support",
        "hilbert",
        "action",
        "want",
        "anything",
        "whole",
        "affair",
        "board",
        "member",
        "want",
        "irritate",
        "hilbert",
        "opposing",
        "brouwer",
        "vehemently",
        "protest",
        "end",
        "whole",
        "board",
        "dissolved",
        "immediately",
        "reassembled",
        "without",
        "brouwer",
        "strongly",
        "reduced",
        "size",
        "particular",
        "einstein",
        "carathéodory",
        "decline",
        "conflict",
        "leaf",
        "brouwer",
        "mentally",
        "broken",
        "isolated",
        "put",
        "end",
        "creative",
        "decade",
        "work",
        "two",
        "main",
        "contestant",
        "longer",
        "able",
        "carry",
        "grundlagenstreit",
        "conflict",
        "karl",
        "menger",
        "priority",
        "first",
        "correct",
        "definition",
        "notion",
        "dimension",
        "august",
        "theft",
        "brouwer",
        "briefcase",
        "tram",
        "brussels",
        "mathematical",
        "notebook",
        "neither",
        "police",
        "private",
        "detective",
        "hired",
        "purpose",
        "able",
        "find",
        "despair",
        "ever",
        "able",
        "reconstruct",
        "content",
        "brouwer",
        "later",
        "said",
        "loss",
        "instrumental",
        "shift",
        "main",
        "interest",
        "mathematics",
        "philosophy",
        "begin",
        "preparation",
        "foundation",
        "new",
        "mathematical",
        "journal",
        "appearance",
        "first",
        "issue",
        "brouwer",
        "international",
        "journal",
        "entitled",
        "compositio",
        "mathematica",
        "lecture",
        "series",
        "geneva",
        "invitation",
        "ferdinand",
        "gonseth",
        "plan",
        "course",
        "intuitionistic",
        "mathematics",
        "göttingen",
        "come",
        "far",
        "end",
        "realised",
        "ludwig",
        "bieberbach",
        "german",
        "member",
        "editorial",
        "board",
        "compositio",
        "mathematica",
        "joined",
        "national",
        "socialist",
        "movement",
        "entering",
        "sa",
        "asks",
        "brouwer",
        "remove",
        "jewish",
        "member",
        "board",
        "brouwer",
        "refuse",
        "bieberbach",
        "resigns",
        "member",
        "municipal",
        "council",
        "blaricum",
        "local",
        "neutral",
        "party",
        "win",
        "election",
        "receiving",
        "vote",
        "german",
        "occupation",
        "netherlands",
        "world",
        "war",
        "ii",
        "brouwer",
        "assist",
        "resistance",
        "letting",
        "use",
        "storage",
        "space",
        "mathematical",
        "institute",
        "director",
        "offer",
        "hiding",
        "place",
        "jew",
        "persecuted",
        "person",
        "small",
        "house",
        "premise",
        "testified",
        "neighbour",
        "daughter",
        "involved",
        "operation",
        "van",
        "dalen",
        "vol",
        "p",
        "advises",
        "student",
        "sign",
        "declaration",
        "loyalty",
        "demanded",
        "german",
        "student",
        "refuse",
        "go",
        "hiding",
        "brouwer",
        "heyting",
        "visit",
        "continue",
        "education",
        "part",
        "brouwer",
        "explanation",
        "war",
        "advice",
        "sign",
        "signing",
        "would",
        "provide",
        "student",
        "relative",
        "peace",
        "needed",
        "build",
        "carry",
        "resistance",
        "activity",
        "met",
        "skepticism",
        "supported",
        "mannoury",
        "similar",
        "perhaps",
        "unfortunate",
        "attempt",
        "shrewdness",
        "occupation",
        "liberation",
        "suspended",
        "month",
        "deeply",
        "offended",
        "brouwer",
        "considers",
        "emigration",
        "south",
        "africa",
        "usa",
        "fire",
        "brouwer",
        "house",
        "destroy",
        "significant",
        "part",
        "archive",
        "library",
        "publishes",
        "three",
        "short",
        "note",
        "intuitionistic",
        "foundation",
        "first",
        "since",
        "conflict",
        "compositio",
        "mathematica",
        "journal",
        "appeared",
        "war",
        "effort",
        "made",
        "bring",
        "back",
        "life",
        "difficulty",
        "assembling",
        "new",
        "board",
        "editor",
        "arise",
        "brouwer",
        "damaged",
        "reputation",
        "end",
        "brouwer",
        "name",
        "remains",
        "title",
        "page",
        "effect",
        "removed",
        "board",
        "journal",
        "founded",
        "annual",
        "lecture",
        "series",
        "cambridge",
        "england",
        "brouwer",
        "plan",
        "turn",
        "book",
        "happen",
        "however",
        "completes",
        "five",
        "planned",
        "six",
        "chapter",
        "published",
        "poshumously",
        "brouwer",
        "resume",
        "foundational",
        "program",
        "paper",
        "exploit",
        "notion",
        "creating",
        "subject",
        "beginning",
        "another",
        "creative",
        "period",
        "opposes",
        "plan",
        "collected",
        "paper",
        "published",
        "ground",
        "time",
        "write",
        "annotation",
        "reflect",
        "original",
        "well",
        "present",
        "view",
        "considers",
        "would",
        "scientifically",
        "responsible",
        "thing",
        "retires",
        "university",
        "amsterdam",
        "cooling",
        "relationship",
        "arend",
        "heyting",
        "successor",
        "post",
        "director",
        "mathematical",
        "institute",
        "result",
        "disagreement",
        "exact",
        "role",
        "retired",
        "brouwer",
        "could",
        "still",
        "play",
        "lecture",
        "london",
        "cape",
        "town",
        "lecture",
        "helsinki",
        "stay",
        "von",
        "wright",
        "lecture",
        "tour",
        "usa",
        "among",
        "others",
        "mit",
        "princeton",
        "university",
        "wisconsinmadison",
        "berkeley",
        "chicago",
        "canada",
        "canadian",
        "mathematical",
        "congress",
        "kingston",
        "ontario",
        "princeton",
        "visit",
        "gödel",
        "publishes",
        "last",
        "new",
        "paper",
        "based",
        "lecture",
        "boole",
        "conference",
        "dublin",
        "year",
        "death",
        "mr",
        "brouwer",
        "year",
        "old",
        "brouwer",
        "decline",
        "offer",
        "year",
        "position",
        "university",
        "british",
        "columbia",
        "vancouver",
        "brouwer",
        "offered",
        "position",
        "montana",
        "december",
        "dy",
        "blaricum",
        "netherlands",
        "year",
        "old",
        "hit",
        "car",
        "front",
        "house",
        "library",
        "archive",
        "dispersed",
        "beginning",
        "s",
        "walter",
        "van",
        "stigt",
        "dirk",
        "van",
        "dalen",
        "reconstitute",
        "archive",
        "much",
        "possible",
        "brouwer",
        "paper",
        "kept",
        "noordhollands",
        "archief",
        "haarlem"
    ]
}