{
    "main_text": "Truth and the Nature of Knowledge and Language in Chan\n4. Truth and the Nature of Knowledge and Language in Chan\n\nChan’s identification of ultimate reality or true suchness (Ch.\nzhenru; Skt. bhūtatathatā) with\nliberation-enacting responsive virtuosity implies that reality is both\npersonal and communicative. Given this, it is not surprising that\n“public cases” (Ch. gong’an; J.\nkōan) purportedly recording the encounters of Chan\nmasters and their students came to be the premier Chan literary form\nand by the mid-Song dynasty constituted a kind of core curriculum for\nChan training. But, as noted earlier, Chan also came to represent\nitself as\n\n\na special transmission outside the teachings (jiaowai\nbiechuan); not established upon words and letters (buli\nwenzi); directly pointing to the human heartmind (zhizhi\nrenxin); seeing nature and becoming a Buddha (jianxing\nchengfo).\n\n\nAnd this suggests that the relationship among truth, language and\ncommunication in Chan may confound some common Western philosophical\nexpectations.\n\nAs is suggested by the abundant references to canonical texts found in\nChan master discourse records, announcing that Chan involves a special\ntransmission (biechuan) beyond the scope of scriptural\nteachings (jiaowai) does not necessarily call the value of\ntextual transmission into question. But it does point to the\npossibility of a form of communication that directly indexes or\nindicates (zhi) the human heartmind without either standing\nupon or erecting (li) words and letters as conveyances for\nknowledge.\n\nThe term chuan, translated here as\n“transmission”, has the connotation of publishing or\nputting into circulation and is thus compatible with imagining\nBuddhist understanding as being transferred from person-to-person,\nfrom place-to-place and from generation-to-generation by means of\ntextually-manifested teachings. But chuan also has the\nconnotation of spreading through a process of conduction. Heat can be\ntransferred from one place to another by convection as high energy\nparticles or objects move into a space of lower energy ones. But heat\ncan also spread without any particles or objects changing location.\nConduction is energy flowing as a function of vibrational resonances\namong adjacent particles or objects and is measured not in terms of\namounts of energy transferred, but rather rates of\ntransfer. Something analogous seems to be at the heart of Chan claims\nof a “special transmission” and of the repeated denials by\nTang and Song dynasty Chan masters that they have anything—like\na robe or bowl— to give or that there is ultimately anything for\ntheir students to seek and attain.\n\nThe textual transmission of Buddhism signals a process of\n“knowledge convection” that can easily result in energy\ndissipation—a possibility that seems to have informed\nspeculations about the eventual demise of the effectiveness of the\nDharma that were widely prevalent during the period of Chan’s\nemergence and maturation. It is in keeping with this insight that\nBodhidharma warned that Buddhist realization attained through the\nmedium of words results in weak qi (氣) or energy, and\nthat Huineng broke with Chinese scholastic tradition to deny the value\nof classifying teachings and texts having “sudden” or\n“gradual” content and directed attention instead to seeing\n“sudden enlightenment” (dunwu, 頓 悟)\nas a function of personal readiness (a root meaning of the term,\ndun) to engage in enlightened/enlightening conduct—a\nfunction of the keenness or dullness with which one enters into\nliberating resonance with others.\n\nConsistent with seeing knowledge transfer as a process of conduction,\nthe paradigmatic Chan term for records of intergenerational\ntransmission is denglu (燈錄) or “lamp\nrecords”—a term that invites imagining a series of lamps\nbeing restored to their natural luminosity as teachers and students\nenter into effective resonance with one another. In Chan, knowledge is\nnot something that can be bequeathed. Truth is not a function of\npropositional coherence or of a correspondence between propositions\nand reality. Truth is the enactment of liberating\nrelationality—a truing of relational dynamics.\n\nThis understanding of truth is crucial to the evolution of Chan\nteachings, and to the apparent embrace of such contradictory\nclaims—sometimes made by the same teacher—as that Chan\ninvolves the realization of “one mind” or “ordinary\nmind” or “no-mind”. Chan teachings are—at\nleast ideally—improvised in effective and always situated\nresponse to actual needs and concerns. That is, they are\nexemplifications of the bodhisattva exercise of upāya or\nresponsive virtuosity, not final expressions of eternally or\nuniversally valid insights.\n\nMazu, for example, was once asked by a monk, “Why do you say\nthat ‘mind is Buddha’?” Mazu replied, “To end\nthe crying of small children”. The monk then asked, “So\nwhat do you say when the tears have dried up?” Mazu answered,\n“It is neither mind nor Buddha”. The monk continued\nprobing. “Then what if people come along who don’t fit\ninto either of these categories? How do you teach them?” Mazu\nsaid, “Then I tell them that it’s not a thing”.\nStill not giving up, the monk finally asked, “But what about if\nyou come across someone who is truly present?” To this Mazu\nreplied, “I teach such a person to realize the great Way”\n(Xu zangjing, Vol. 119.408b).\n\nThe provisional nature of Chan declarations exemplified in this\nencounter and even more apparent in some Chan teachers’ use of\nphysical gestures like raising a finger, wiggling eyebrows or killing\na cat in response to students’ questions was a lightning rod for\ncriticism. If Chan teachings can include contradictory statements and\nsuch gruesome acts as killing a cat, what is to prevent the truth of\nnondualism from spurring an antinomian erasure of the boundaries not\nonly between sense and nonsense, but also between the moral and\nimmoral? This was a concern for even such eminent Buddhist thinkers as\nGuifeng Zongmi (780–841), a lineage holder in both the Huayan\nSchool and the Heze Chan lineage, who argued that if any kind of\nspeech or action can be the functioning of Buddha-nature, then what is\nto stop hatred and gratuitous violence from being seen as\n“liberating” (Xu zangjing, Vol. 110.435d)?\n\nHere it is useful to place Zongmi’s concerns in the context of\nChinese appropriations of the distinction between conventional truth\n(saṃvṛti-satya) and ultimate truth\n(paramārtha-satya)—a distinction that had roots in\nboth Nikāya and Mahāyāna Buddhism, and that was given\nperhaps its most developed expression in the work of the Indian\nthinker, Candrakīrti (570–650). In China, while the\n“two truths” distinction became a philosophical mainstay,\nit was also seen as being in tension with the teachings of nonduality\nsince it implies two separate levels of reality or at the very least a\ncontrast of reality and illusion. One of the most influential\nresponses to this seeming inconsistency was put forward by Zhiyi\n(538–597), one of the founding figures of Chinese Tiantai\nBuddhism, who forwarded a “three truths” approach that\nembraced such apparent opposites as existence and nonexistence,\nenlightenment and delusion, and the sacred and the profane as equal\npartners of the “Middle Way”. According to Zhiyi,\nconventional realities/truths (based on day-to-day experience) and\nultimate realities/truths (based on the realization of emptiness) are\nequally involved in bringing about the end of suffering (the Middle\nPath). And this implies that, in fact, all things and statements can\nbe true as mutually inclusive aspects of a single reality/truth.\n\nThe more radical streams of Chan teaching—for example,\nHuineng’s claim that passions are not an obstruction to\nenlightenment, or Linji’s use of hitting and shouting—are\nconsistent with this approach. But both in Zhiyi’s Tiantai and\nin Chan it arguably was not held that all things are doing\nthe Buddha work of enlightenment, but rather that they can\nfunction in this way. Whether or not raising a finger actually brings\nabout a liberating turn in a teacher-student encounter is not a\nfunction of the action or the intention behind it, but of what it\nmeans relationally. Case 19 of the Blue Cliff Record (see,\nCleary 1977) recounts how Chan master Juzhi was fond of\nresponding to students’ queries simply by raising his index\nfinger. One day, Juzhi was away and his teenaged attendant\ngreeted some visitors inquiring as to the master’s whereabouts\nby mimicking his master’s trademark gesture. When Juzhi\nreturned, the boy informed him how things had gone while he was away\nand Juzhi asked him to demonstrate how he had responded to the\nvisitors. The boy raised his finger, which Juzhi promptly severed with\na knife. As his attendant fled in pain, Juzhi called out his name.\nWhen the boy stopped and turned, Juzhi raised his finger. The\nboy’s mind opened and realization blossomed. Chan teaching is\nnot something conveyed by words or gestures; it consists in direct\nrelational transformation.\n\nIt still can be asked, of course, how one knows what direction of\nrelational transformation is truly liberating or what interventions\nare appropriate in any given situation. This epistemological concern\nis not one, however, that Chan endorsed. On the contrary, the general\nChan view has been that asking the epistemological question is perhaps\nthe single most pernicious form of distraction from embarking wholly\nupon the path of Chan practice. Huineng insisted that from the\nancients down to his day, without-thinking (wunian\n無念) had always been the core teaching (Platform Sutra,\n17). But he also noted that being without-thinking can be sustained\neven as thoughts are arising and passing away so long as one refrains\nfrom forming attachments, calculating outcomes and taking up fixed\npositions. In short, being without-thinking is being single-mindedly\npresent in unwavering attentiveness. Deliberating about whether an\naction is right or wrong is already to have departed from such\npresence and to have fallen into doubt or being of “two\nminds”.\n\nIn an iconic encounter between Mazu and his teacher, Nanyue Huairang\n(677–744), Mazu has an awakening after pointing out to Huairang\nthat he cannot make a mirror by rubbing together a stone and a clay\nroofing tile, only to be asked why he then thinks it is possible to\nmake himself into a Buddha by sitting on a meditation cushion. To\nbecome a Buddha, Huairang avers, simply act as a Buddha. This opens\nMazu’s mind, but then it swiftly closes as he wonders how he\nwill know when he is acting like a Buddha. Huairang’s reply to\nthis question triggers a still deeper awakening: “You cannot see\nthe Path, you can only see from it”. Epistemological\nworries are potentially endless detours of often fervently justified\ndisengagement—detours predicated on the separating out of a\nquestioning subject and a questioned object or environment. Seeing\nfrom the Chan path is seeing completely.\n",
    "section_title": "4. Truth and the Nature of Knowledge and Language in Chan",
    "entry_title": "Chan Buddhism",
    "hierarchy_title": "Chan Buddhism || Truth and the Nature of Knowledge and Language in Chan",
    "tokenized_text": [
        "truth",
        "nature",
        "knowledge",
        "language",
        "chan",
        "truth",
        "nature",
        "knowledge",
        "language",
        "chan",
        "chan",
        "identification",
        "ultimate",
        "reality",
        "true",
        "suchness",
        "ch",
        "zhenru",
        "skt",
        "bhūtatathatā",
        "liberationenacting",
        "responsive",
        "virtuosity",
        "implies",
        "reality",
        "personal",
        "communicative",
        "given",
        "surprising",
        "public",
        "case",
        "ch",
        "gong",
        "j",
        "kōan",
        "purportedly",
        "recording",
        "encounter",
        "chan",
        "master",
        "student",
        "came",
        "premier",
        "chan",
        "literary",
        "form",
        "midsong",
        "dynasty",
        "constituted",
        "kind",
        "core",
        "curriculum",
        "chan",
        "training",
        "noted",
        "earlier",
        "chan",
        "also",
        "came",
        "represent",
        "special",
        "transmission",
        "outside",
        "teaching",
        "jiaowai",
        "biechuan",
        "established",
        "upon",
        "word",
        "letter",
        "buli",
        "wenzi",
        "directly",
        "pointing",
        "human",
        "heartmind",
        "zhizhi",
        "renxin",
        "seeing",
        "nature",
        "becoming",
        "buddha",
        "jianxing",
        "chengfo",
        "suggests",
        "relationship",
        "among",
        "truth",
        "language",
        "communication",
        "chan",
        "may",
        "confound",
        "common",
        "western",
        "philosophical",
        "expectation",
        "suggested",
        "abundant",
        "reference",
        "canonical",
        "text",
        "found",
        "chan",
        "master",
        "discourse",
        "record",
        "announcing",
        "chan",
        "involves",
        "special",
        "transmission",
        "biechuan",
        "beyond",
        "scope",
        "scriptural",
        "teaching",
        "jiaowai",
        "necessarily",
        "call",
        "value",
        "textual",
        "transmission",
        "question",
        "point",
        "possibility",
        "form",
        "communication",
        "directly",
        "index",
        "indicates",
        "zhi",
        "human",
        "heartmind",
        "without",
        "either",
        "standing",
        "upon",
        "erecting",
        "li",
        "word",
        "letter",
        "conveyance",
        "knowledge",
        "term",
        "chuan",
        "translated",
        "transmission",
        "connotation",
        "publishing",
        "putting",
        "circulation",
        "thus",
        "compatible",
        "imagining",
        "buddhist",
        "understanding",
        "transferred",
        "persontoperson",
        "placetoplace",
        "generationtogeneration",
        "mean",
        "textuallymanifested",
        "teaching",
        "chuan",
        "also",
        "connotation",
        "spreading",
        "process",
        "conduction",
        "heat",
        "transferred",
        "one",
        "place",
        "another",
        "convection",
        "high",
        "energy",
        "particle",
        "object",
        "move",
        "space",
        "lower",
        "energy",
        "one",
        "heat",
        "also",
        "spread",
        "without",
        "particle",
        "object",
        "changing",
        "location",
        "conduction",
        "energy",
        "flowing",
        "function",
        "vibrational",
        "resonance",
        "among",
        "adjacent",
        "particle",
        "object",
        "measured",
        "term",
        "amount",
        "energy",
        "transferred",
        "rather",
        "rate",
        "transfer",
        "something",
        "analogous",
        "seems",
        "heart",
        "chan",
        "claim",
        "special",
        "transmission",
        "repeated",
        "denial",
        "tang",
        "song",
        "dynasty",
        "chan",
        "master",
        "anythinglike",
        "robe",
        "bowl",
        "give",
        "ultimately",
        "anything",
        "student",
        "seek",
        "attain",
        "textual",
        "transmission",
        "buddhism",
        "signal",
        "process",
        "knowledge",
        "convection",
        "easily",
        "result",
        "energy",
        "dissipationa",
        "possibility",
        "seems",
        "informed",
        "speculation",
        "eventual",
        "demise",
        "effectiveness",
        "dharma",
        "widely",
        "prevalent",
        "period",
        "chan",
        "emergence",
        "maturation",
        "keeping",
        "insight",
        "bodhidharma",
        "warned",
        "buddhist",
        "realization",
        "attained",
        "medium",
        "word",
        "result",
        "weak",
        "qi",
        "氣",
        "energy",
        "huineng",
        "broke",
        "chinese",
        "scholastic",
        "tradition",
        "deny",
        "value",
        "classifying",
        "teaching",
        "text",
        "sudden",
        "gradual",
        "content",
        "directed",
        "attention",
        "instead",
        "seeing",
        "sudden",
        "enlightenment",
        "dunwu",
        "頓",
        "悟",
        "function",
        "personal",
        "readiness",
        "root",
        "meaning",
        "term",
        "dun",
        "engage",
        "enlightenedenlightening",
        "conducta",
        "function",
        "keenness",
        "dullness",
        "one",
        "enters",
        "liberating",
        "resonance",
        "others",
        "consistent",
        "seeing",
        "knowledge",
        "transfer",
        "process",
        "conduction",
        "paradigmatic",
        "chan",
        "term",
        "record",
        "intergenerational",
        "transmission",
        "denglu",
        "燈錄",
        "lamp",
        "record",
        "a",
        "term",
        "invite",
        "imagining",
        "series",
        "lamp",
        "restored",
        "natural",
        "luminosity",
        "teacher",
        "student",
        "enter",
        "effective",
        "resonance",
        "one",
        "another",
        "chan",
        "knowledge",
        "something",
        "bequeathed",
        "truth",
        "function",
        "propositional",
        "coherence",
        "correspondence",
        "proposition",
        "reality",
        "truth",
        "enactment",
        "liberating",
        "relationalitya",
        "truing",
        "relational",
        "dynamic",
        "understanding",
        "truth",
        "crucial",
        "evolution",
        "chan",
        "teaching",
        "apparent",
        "embrace",
        "contradictory",
        "claimssometimes",
        "made",
        "teacheras",
        "chan",
        "involves",
        "realization",
        "one",
        "mind",
        "ordinary",
        "mind",
        "nomind",
        "chan",
        "teaching",
        "areat",
        "least",
        "ideallyimprovised",
        "effective",
        "always",
        "situated",
        "response",
        "actual",
        "need",
        "concern",
        "exemplification",
        "bodhisattva",
        "exercise",
        "upāya",
        "responsive",
        "virtuosity",
        "final",
        "expression",
        "eternally",
        "universally",
        "valid",
        "insight",
        "mazu",
        "example",
        "asked",
        "monk",
        "say",
        "mind",
        "buddha",
        "mazu",
        "replied",
        "end",
        "cry",
        "small",
        "child",
        "monk",
        "asked",
        "say",
        "tear",
        "dried",
        "mazu",
        "answered",
        "neither",
        "mind",
        "buddha",
        "monk",
        "continued",
        "probing",
        "people",
        "come",
        "along",
        "fit",
        "either",
        "category",
        "teach",
        "mazu",
        "said",
        "tell",
        "thing",
        "still",
        "giving",
        "monk",
        "finally",
        "asked",
        "come",
        "across",
        "someone",
        "truly",
        "present",
        "mazu",
        "replied",
        "teach",
        "person",
        "realize",
        "great",
        "way",
        "xu",
        "zangjing",
        "vol",
        "b",
        "provisional",
        "nature",
        "chan",
        "declaration",
        "exemplified",
        "encounter",
        "even",
        "apparent",
        "chan",
        "teacher",
        "use",
        "physical",
        "gesture",
        "like",
        "raising",
        "finger",
        "wiggling",
        "eyebrow",
        "killing",
        "cat",
        "response",
        "student",
        "question",
        "lightning",
        "rod",
        "criticism",
        "chan",
        "teaching",
        "include",
        "contradictory",
        "statement",
        "gruesome",
        "act",
        "killing",
        "cat",
        "prevent",
        "truth",
        "nondualism",
        "spurring",
        "antinomian",
        "erasure",
        "boundary",
        "sense",
        "nonsense",
        "also",
        "moral",
        "immoral",
        "concern",
        "even",
        "eminent",
        "buddhist",
        "thinker",
        "guifeng",
        "zongmi",
        "lineage",
        "holder",
        "huayan",
        "school",
        "heze",
        "chan",
        "lineage",
        "argued",
        "kind",
        "speech",
        "action",
        "functioning",
        "buddhanature",
        "stop",
        "hatred",
        "gratuitous",
        "violence",
        "seen",
        "liberating",
        "xu",
        "zangjing",
        "vol",
        "d",
        "useful",
        "place",
        "zongmi",
        "concern",
        "context",
        "chinese",
        "appropriation",
        "distinction",
        "conventional",
        "truth",
        "saṃvṛtisatya",
        "ultimate",
        "truth",
        "paramārthasatya",
        "a",
        "distinction",
        "root",
        "nikāya",
        "mahāyāna",
        "buddhism",
        "given",
        "perhaps",
        "developed",
        "expression",
        "work",
        "indian",
        "thinker",
        "candrakīrti",
        "china",
        "two",
        "truth",
        "distinction",
        "became",
        "philosophical",
        "mainstay",
        "also",
        "seen",
        "tension",
        "teaching",
        "nonduality",
        "since",
        "implies",
        "two",
        "separate",
        "level",
        "reality",
        "least",
        "contrast",
        "reality",
        "illusion",
        "one",
        "influential",
        "response",
        "seeming",
        "inconsistency",
        "put",
        "forward",
        "zhiyi",
        "one",
        "founding",
        "figure",
        "chinese",
        "tiantai",
        "buddhism",
        "forwarded",
        "three",
        "truth",
        "approach",
        "embraced",
        "apparent",
        "opposite",
        "existence",
        "nonexistence",
        "enlightenment",
        "delusion",
        "sacred",
        "profane",
        "equal",
        "partner",
        "middle",
        "way",
        "according",
        "zhiyi",
        "conventional",
        "realitiestruths",
        "based",
        "daytoday",
        "experience",
        "ultimate",
        "realitiestruths",
        "based",
        "realization",
        "emptiness",
        "equally",
        "involved",
        "bringing",
        "end",
        "suffering",
        "middle",
        "path",
        "implies",
        "fact",
        "thing",
        "statement",
        "true",
        "mutually",
        "inclusive",
        "aspect",
        "single",
        "realitytruth",
        "radical",
        "stream",
        "chan",
        "teachingfor",
        "example",
        "huineng",
        "claim",
        "passion",
        "obstruction",
        "enlightenment",
        "linji",
        "use",
        "hitting",
        "shoutingare",
        "consistent",
        "approach",
        "zhiyi",
        "tiantai",
        "chan",
        "arguably",
        "held",
        "thing",
        "buddha",
        "work",
        "enlightenment",
        "rather",
        "function",
        "way",
        "whether",
        "raising",
        "finger",
        "actually",
        "brings",
        "liberating",
        "turn",
        "teacherstudent",
        "encounter",
        "function",
        "action",
        "intention",
        "behind",
        "mean",
        "relationally",
        "case",
        "blue",
        "cliff",
        "record",
        "see",
        "cleary",
        "recount",
        "chan",
        "master",
        "juzhi",
        "fond",
        "responding",
        "student",
        "query",
        "simply",
        "raising",
        "index",
        "finger",
        "one",
        "day",
        "juzhi",
        "away",
        "teenaged",
        "attendant",
        "greeted",
        "visitor",
        "inquiring",
        "master",
        "whereabouts",
        "mimicking",
        "master",
        "trademark",
        "gesture",
        "juzhi",
        "returned",
        "boy",
        "informed",
        "thing",
        "gone",
        "away",
        "juzhi",
        "asked",
        "demonstrate",
        "responded",
        "visitor",
        "boy",
        "raised",
        "finger",
        "juzhi",
        "promptly",
        "severed",
        "knife",
        "attendant",
        "fled",
        "pain",
        "juzhi",
        "called",
        "name",
        "boy",
        "stopped",
        "turned",
        "juzhi",
        "raised",
        "finger",
        "boy",
        "mind",
        "opened",
        "realization",
        "blossomed",
        "chan",
        "teaching",
        "something",
        "conveyed",
        "word",
        "gesture",
        "consists",
        "direct",
        "relational",
        "transformation",
        "still",
        "asked",
        "course",
        "one",
        "know",
        "direction",
        "relational",
        "transformation",
        "truly",
        "liberating",
        "intervention",
        "appropriate",
        "given",
        "situation",
        "epistemological",
        "concern",
        "one",
        "however",
        "chan",
        "endorsed",
        "contrary",
        "general",
        "chan",
        "view",
        "asking",
        "epistemological",
        "question",
        "perhaps",
        "single",
        "pernicious",
        "form",
        "distraction",
        "embarking",
        "wholly",
        "upon",
        "path",
        "chan",
        "practice",
        "huineng",
        "insisted",
        "ancient",
        "day",
        "withoutthinking",
        "wunian",
        "無念",
        "always",
        "core",
        "teaching",
        "platform",
        "sutra",
        "also",
        "noted",
        "withoutthinking",
        "sustained",
        "even",
        "thought",
        "arising",
        "passing",
        "away",
        "long",
        "one",
        "refrain",
        "forming",
        "attachment",
        "calculating",
        "outcome",
        "taking",
        "fixed",
        "position",
        "short",
        "withoutthinking",
        "singlemindedly",
        "present",
        "unwavering",
        "attentiveness",
        "deliberating",
        "whether",
        "action",
        "right",
        "wrong",
        "already",
        "departed",
        "presence",
        "fallen",
        "doubt",
        "two",
        "mind",
        "iconic",
        "encounter",
        "mazu",
        "teacher",
        "nanyue",
        "huairang",
        "mazu",
        "awakening",
        "pointing",
        "huairang",
        "make",
        "mirror",
        "rubbing",
        "together",
        "stone",
        "clay",
        "roofing",
        "tile",
        "asked",
        "think",
        "possible",
        "make",
        "buddha",
        "sitting",
        "meditation",
        "cushion",
        "become",
        "buddha",
        "huairang",
        "avers",
        "simply",
        "act",
        "buddha",
        "open",
        "mazu",
        "mind",
        "swiftly",
        "close",
        "wonder",
        "know",
        "acting",
        "like",
        "buddha",
        "huairang",
        "reply",
        "question",
        "trigger",
        "still",
        "deeper",
        "awakening",
        "see",
        "path",
        "see",
        "epistemological",
        "worry",
        "potentially",
        "endless",
        "detour",
        "often",
        "fervently",
        "justified",
        "disengagementdetours",
        "predicated",
        "separating",
        "questioning",
        "subject",
        "questioned",
        "object",
        "environment",
        "seeing",
        "chan",
        "path",
        "seeing",
        "completely"
    ]
}