{
    "main_text": "History\n2. History\n\nChan coalesced over the course of several centuries of sustained and\nreflexive engagement with the meaning of being both Chinese and\nBuddhist. That is, it took shape over the period from roughly 500 to\n1000 CE in the context of negotiations taking place within what the\nanthropologist James Clifford (1988) has referred to as the\n“predicament of culture”—the feeling of pervasive\noff-centeredness that occurs when we are confronted with an\nunavoidable and unprecedented overlay of distinct meaning systems and\ncompelled to choose among or reconcile different and often contrary\nsources of personal and cultural identity.\n\nBuddhism first entered China in the latter part of the Han dynasty\n(206 BCE to 220 CE) along with growing trans-Eurasian trade. Early\nrecords of Buddhist presence in China depict the arrival of this\nforeign religion as at once intriguing and unsettling—a\nconfrontation with cultural difference, not as an objectively\nobservable fact, but as a subjectively troubling experience of failing\ncommon sense (Sakai 1997). Monastic Buddhist missionaries were visibly\nalien with their monochrome robes, their shaved heads and eyebrows,\nand their restricted diets. Along with strikingly novel votive statues\nand paintings—the first term for Buddhism was, in fact, the\n“teaching of the images” (xiangjiao)—they\nbrought with them new meditative techniques, new ritual technologies,\nand, most importantly, new forms of writing.\n\nSince very early times in China, writing had been understood as\nintimately tied to spiritual, political and cultural authority (Lewis\n1999)—an association manifest in the Chinese term for culture\n(wenhua, 文化), which combines characters for\nliterature (文) and transformation (化). The arrival of\nBuddhist texts were evidence that there were peoples in “the\nWest” who, unlike any other peoples the Chinese had encountered,\nnot only had their own customs, but also their own literary culture\nand thus their own claims to authority. Buddhist texts held out the\npromise of alternative ways of understanding the world and the place\nof humanity in it, but also new forms of subjectivity and imagination,\nnew personal ideals, and new visions of the interrelatedness of the\nspiritual and the political.\n\nBuddhist practices of meditative discipline, image worship and ritual\ndevotion spread rapidly through Chinese society in the period of\ndisunity after the fall of the Han dynasty. By the early fourth\ncentury, for example, regular, multi-week Buddhist retreats of up to\n5,000 people were being held, and by the sixth century over two\nmillion people—roughly one out of every twenty-five people in\nChina—were ordained as monks and nuns. Buddhism played crucial\nroles in the unification of nomadic peoples under the Northern Wei\n(386–534) and in the eventual restoration of the Chinese empire\nwith the founding of the Sui dynasty (581–618). A sense of the\nimportance of Buddhism in shaping the political and cultural\nimaginaire of medieval China can be gleaned by considering\nthe investment needed to build the monumental cave complexes at\nYungang Grottoes and Longmen Grottoes—each with tens of\nthousands of Buddhist images carved out of live rock, some as large as\nsixty feet in height with faces originally clad in gold.\n\nBut it was through collaborative projects of translation and textual\nexegesis that Buddhism came to be woven so thoroughly into the fabric\nof Chinese culture that the emperor of Song China, Song Xiaozong (r.\n1162–89), would compare the three teachings of Confucianism,\nDaoism and Buddhism to the legs of a bronze ding: a\nceremonial vessel associated with political unity and power and\ncultural authority that would be useless if any one of the three were\nto be removed. Indian and Central Asian Buddhist texts offered new\nvisions of the cosmos, new narrative structures, and new concepts that\nmade obvious the boundaries and biases of Chinese literary and\nphilosophical thought and practice. Engaging these texts required\nimprovising linguistic and conceptual bridges, but ultimately also\nbuilding new kinds of cultural consciousness and identity.\n\nAt the time that the great Central Asian translator,\nKumārajīva (334–413), was working with a multi-ethnic\ntranslation team in the Chinese capital of Chang’an (a city of\nbetween 300,000 and 500,000 people at the time), Buddhism had\nundergone nearly a thousand years of adaptive evolution and several\nhundred texts were catalogued as part of the Buddhist canon. By the\nseventh century, that number had grown to over a thousand. These texts\nall purported to be authentic renderings of Buddhist teaching. But in\nactuality they often had quite disparate historical and cultural\norigins, and this presented Chinese Buddhist scholars with immense\nhermeneutical challenges. Drawing on evidence internal to key Buddhist\nscriptures, different systems were devised for classifying and ranking\nBuddhist teachings and texts, and these became the basis of competing,\ntextually-defined schools of Buddhism, the foremost being the\nConsciousness-Only (Weishizong, 唯識宗),\nTiantai or Heavenly Terrace (Tiantai zong,\n天台宗 ), Pure Land (Jingtu zong,\n淨土宗) and Huayan or Flower Ornament (Huayan\nzong, 華嚴宗) schools.\n\nChan traces its origins to a radical break from this scholastic\napproach—an explicit rejection of the ultimate authority of\nwriting combined with an insistence that authentic Buddhist teachings\nare not to be found in books or memorized liturgies but only in the\nimmediate, face-to-face encounters of Buddhist masters and their\nstudents. The iconic precedent for this break is the moment of\ntransmission said to have occurred when, in the middle of preaching to\na gathering of some 10,000 people on Vulture Peak, the Buddha held up\na single flower and elicited a smile of shared realization from his\ndisciple, Mahākāśyapa. Nearly a thousand years later,\nthe purported 28th lineage holder in this line of direct\ntransmission—an Indian monk named Bodhidharma—is said to\nhave arrived in southeast China by sea, made his way to north China,\nand eventually offered the “skin”, “flesh”,\n“bone” and “marrow” of his teaching to his\nfour closest disciples, one of whom, Huike (487–593), came to be\nregarded as the second Chan Patriarch in China.\n\nThis account of Chan origins was well-established by the tenth\ncentury, and its rudiments were already circulating by the late\n6th and early 7th centuries. Contemporary\nscholars now regard this account and much of what Chan eventually came\nto regard as the particulars of its own history as inventions of\ntradition (see, e.g., McRae 2003 and Faure 1991). But for present\npurposes, the traditional story of Chan’s origins affords a\nuseful way of introducing the philosophical concerns that shaped the\nconsolidation of Chan identity.\n\nIn the earliest strata of texts reliably attributed to Bodhidharma and\nother early Chan teachers (see Broughton 1999), we find Bodhidharma\nclaiming that there are two points of entry to Buddhism: via\nli (理), an “informing impetus” or\n“principle”; and via xing (行),\n“practice”. Entry by li consists in realizing\nthat all sentient beings have the same true nature; entry by\nxing consists in making good on wrongs done; corresponding\nwith conditions; seeking nothing; and acting in accordance with the\nrealization that all beings have the same true nature. Buddhist truth,\nin other words, is not something attained through practice,\nbut rather an aspect and achievement of it. Moreover,\nBodhidharma affirms that this is possible anywhere, whether one is\nwalking, lying down, sitting or standing. Successful Buddhist practice\nis not based on being in some specific place or posture. Neither is it\ndependent on textual study. In fact, it is claimed that whoever\nobtains understanding through reading will have weak vital energy\n(qi, 氣) and that to have the energy needed to truly\nenact the Buddhist path one must obtain understanding in the medium of\ncircumstances and events by never losing mindfulness anywhere.\n\nThese claims eventually become conventional elements of Chan identity.\nBut they were profoundly iconoclastic given Chinese associations of\nwriting with authority and the institutional ramifications of Buddhist\nscholasticism. They were also philosophically pregnant claims when\nseen in the light of the hermeneutical challenges with which Chinese\nBuddhists were grappling in the seventh and eighth centuries.\n\nOne of the signal debates of the seventh century centered on whether\nor not there were people who had committed such heinous\ncrimes—for example, killing their own parents or an enlightened\nbeing—that they had absolutely no prospect of ever realizing\nenlightenment. One could find textual evidence, in the highly\ninfluential Lotus Sutra, for example, that even beings like Devadatta,\nthe cousin of the Buddha who had tried to murder him out of jealousy,\nare already doing the work of bodhisattvas and will eventually reach\nBuddhahood. Other texts forwarded the controversial but supportive\nthesis that what guaranteed this was the fact that all sentient beings\nalready have/are Buddha-nature. Since we are all originally\nenlightened (benjue, 本覺) practice is not a\nprocess of acquisition, but one of restoration. Not everyone agreed.\nThe Chinese monk, Xuanzang (602–664) was not convinced by such\ntexts and went on a sixteen-year sojourn through Central Asia to India\nto put an end to the debate. He returned laden with more than six\nhundred new Buddhist texts and confirmation of the heterodox nature of\nthe idea that all beings have Buddha-nature. In spite of being treated\nto an imperial welcome and granted lavish support for his translation\nwork, his report on the state of Buddhist teaching in the birthplace\nof the Buddha ironically seems to have buoyed the confidence of\nChinese Buddhists committed to the Buddha-nature thesis and the\nteachings about nonduality and the bodhisattva ideal that were\npresented in such key texts as the Nirvāṇa,\nVimalakīrti and Huayan sutras. Interest in Indian Buddhism waned\nand Chinese Buddhists, including early proponents of Chan, began\nseeing themselves as the true inheritors of the Buddha Dharma with a\nmandate to demonstrate the skillful means (upāya) needed\nto present Buddhism in ways suited to Chinese audiences.\n\nA striking, symbolic turning point in the confidence of Chinese\nBuddhists occurs less than fifty years after Xuanzang’s return\nfrom India when Huineng, an illiterate manual laborer, is made the\nsixth Chinese Chan lineage holder and given the unprecedented\ntreatment of having his transcribed teachings titled the Platform\nSutra (Tanjing). Since “sutra” is traditionally\nreserved solely for the recorded teachings of the historical Buddha,\nthis effectively proclaimed that Huineng was China’s first\n“homegrown” Buddha. It is hard to imagine a more dramatic\naffirmation of the Buddha-nature teachings in China, or a more pointed\nrejection of the identification of Buddhist authority with Buddhist\nliteracy.\n\nOver the next two centuries, Chan identity crystalized around the\nteachings of nonduality and Buddha-nature. In the aftermath of a\ndevastating purge of Buddhism during the Huichang era (841–846),\nduring which more than a quarter million monks and nuns were forcibly\nreturned to lay life and over 5,000 temples, monasteries and Buddhist\nlibraries were destroyed, Linji Yixuan (d. 866), one of the most\ninfluential teachers in Chan history, took these teachings to their\niconoclastic extreme, dismissing the great Buddhist scriptures as\n“hitching posts for donkeys” and encouraging anyone who\nhappened to see “the Buddha” on the road to kill him.\n\nWhereas the metropolitan, text-based schools of Chinese Buddhism were\ndevastated by the mid-ninth century purge, rural Chan communities\nflourished, resulting in the so-called “five houses” or\nLinji, Caodong, Fayan, Yunmen and Guiyang lineages. Collections of\n“encounter dialogues” between Chan masters and their\nstudents began circulating and resonated well with Chinese literati.\nWith the collapse of the Tang dynasty (618–907) and the founding\nof the Song (960–1279), Chan fortunes continued to swell as a\n“homegrown” form of Chinese Buddhism that fit well into\nthe literati mission of using ancestral cultural traditions\n(guwen) to craft a new imperial identity for China. By the\ntwelfth century, Chan had both religious and political prestige and\nthe vast majority of public monasteries supported by the Song court\nwere devoted to the practice of Chan (see Welter 2006).\n",
    "section_title": "2. History",
    "entry_title": "Chan Buddhism",
    "hierarchy_title": "Chan Buddhism || History",
    "tokenized_text": [
        "history",
        "history",
        "chan",
        "coalesced",
        "course",
        "several",
        "century",
        "sustained",
        "reflexive",
        "engagement",
        "meaning",
        "chinese",
        "buddhist",
        "took",
        "shape",
        "period",
        "roughly",
        "ce",
        "context",
        "negotiation",
        "taking",
        "place",
        "within",
        "anthropologist",
        "james",
        "clifford",
        "referred",
        "predicament",
        "culture",
        "the",
        "feeling",
        "pervasive",
        "offcenteredness",
        "occurs",
        "confronted",
        "unavoidable",
        "unprecedented",
        "overlay",
        "distinct",
        "meaning",
        "system",
        "compelled",
        "choose",
        "among",
        "reconcile",
        "different",
        "often",
        "contrary",
        "source",
        "personal",
        "cultural",
        "identity",
        "buddhism",
        "first",
        "entered",
        "china",
        "latter",
        "part",
        "han",
        "dynasty",
        "bce",
        "ce",
        "along",
        "growing",
        "transeurasian",
        "trade",
        "early",
        "record",
        "buddhist",
        "presence",
        "china",
        "depict",
        "arrival",
        "foreign",
        "religion",
        "intriguing",
        "unsettlinga",
        "confrontation",
        "cultural",
        "difference",
        "objectively",
        "observable",
        "fact",
        "subjectively",
        "troubling",
        "experience",
        "failing",
        "common",
        "sense",
        "sakai",
        "monastic",
        "buddhist",
        "missionary",
        "visibly",
        "alien",
        "monochrome",
        "robe",
        "shaved",
        "head",
        "eyebrow",
        "restricted",
        "diet",
        "along",
        "strikingly",
        "novel",
        "votive",
        "statue",
        "paintingsthe",
        "first",
        "term",
        "buddhism",
        "fact",
        "teaching",
        "image",
        "xiangjiao",
        "they",
        "brought",
        "new",
        "meditative",
        "technique",
        "new",
        "ritual",
        "technology",
        "importantly",
        "new",
        "form",
        "writing",
        "since",
        "early",
        "time",
        "china",
        "writing",
        "understood",
        "intimately",
        "tied",
        "spiritual",
        "political",
        "cultural",
        "authority",
        "lewis",
        "an",
        "association",
        "manifest",
        "chinese",
        "term",
        "culture",
        "wenhua",
        "文化",
        "combine",
        "character",
        "literature",
        "文",
        "transformation",
        "化",
        "arrival",
        "buddhist",
        "text",
        "evidence",
        "people",
        "west",
        "unlike",
        "people",
        "chinese",
        "encountered",
        "custom",
        "also",
        "literary",
        "culture",
        "thus",
        "claim",
        "authority",
        "buddhist",
        "text",
        "held",
        "promise",
        "alternative",
        "way",
        "understanding",
        "world",
        "place",
        "humanity",
        "also",
        "new",
        "form",
        "subjectivity",
        "imagination",
        "new",
        "personal",
        "ideal",
        "new",
        "vision",
        "interrelatedness",
        "spiritual",
        "political",
        "buddhist",
        "practice",
        "meditative",
        "discipline",
        "image",
        "worship",
        "ritual",
        "devotion",
        "spread",
        "rapidly",
        "chinese",
        "society",
        "period",
        "disunity",
        "fall",
        "han",
        "dynasty",
        "early",
        "fourth",
        "century",
        "example",
        "regular",
        "multiweek",
        "buddhist",
        "retreat",
        "people",
        "held",
        "sixth",
        "century",
        "two",
        "million",
        "peopleroughly",
        "one",
        "every",
        "twentyfive",
        "people",
        "chinawere",
        "ordained",
        "monk",
        "nun",
        "buddhism",
        "played",
        "crucial",
        "role",
        "unification",
        "nomadic",
        "people",
        "northern",
        "wei",
        "eventual",
        "restoration",
        "chinese",
        "empire",
        "founding",
        "sui",
        "dynasty",
        "sense",
        "importance",
        "buddhism",
        "shaping",
        "political",
        "cultural",
        "imaginaire",
        "medieval",
        "china",
        "gleaned",
        "considering",
        "investment",
        "needed",
        "build",
        "monumental",
        "cave",
        "complex",
        "yungang",
        "grotto",
        "longmen",
        "grottoeseach",
        "ten",
        "thousand",
        "buddhist",
        "image",
        "carved",
        "live",
        "rock",
        "large",
        "sixty",
        "foot",
        "height",
        "face",
        "originally",
        "clad",
        "gold",
        "collaborative",
        "project",
        "translation",
        "textual",
        "exegesis",
        "buddhism",
        "came",
        "woven",
        "thoroughly",
        "fabric",
        "chinese",
        "culture",
        "emperor",
        "song",
        "china",
        "song",
        "xiaozong",
        "r",
        "would",
        "compare",
        "three",
        "teaching",
        "confucianism",
        "daoism",
        "buddhism",
        "leg",
        "bronze",
        "ding",
        "ceremonial",
        "vessel",
        "associated",
        "political",
        "unity",
        "power",
        "cultural",
        "authority",
        "would",
        "useless",
        "one",
        "three",
        "removed",
        "indian",
        "central",
        "asian",
        "buddhist",
        "text",
        "offered",
        "new",
        "vision",
        "cosmos",
        "new",
        "narrative",
        "structure",
        "new",
        "concept",
        "made",
        "obvious",
        "boundary",
        "bias",
        "chinese",
        "literary",
        "philosophical",
        "thought",
        "practice",
        "engaging",
        "text",
        "required",
        "improvising",
        "linguistic",
        "conceptual",
        "bridge",
        "ultimately",
        "also",
        "building",
        "new",
        "kind",
        "cultural",
        "consciousness",
        "identity",
        "time",
        "great",
        "central",
        "asian",
        "translator",
        "kumārajīva",
        "working",
        "multiethnic",
        "translation",
        "team",
        "chinese",
        "capital",
        "chang",
        "city",
        "people",
        "time",
        "buddhism",
        "undergone",
        "nearly",
        "thousand",
        "year",
        "adaptive",
        "evolution",
        "several",
        "hundred",
        "text",
        "catalogued",
        "part",
        "buddhist",
        "canon",
        "seventh",
        "century",
        "number",
        "grown",
        "thousand",
        "text",
        "purported",
        "authentic",
        "rendering",
        "buddhist",
        "teaching",
        "actuality",
        "often",
        "quite",
        "disparate",
        "historical",
        "cultural",
        "origin",
        "presented",
        "chinese",
        "buddhist",
        "scholar",
        "immense",
        "hermeneutical",
        "challenge",
        "drawing",
        "evidence",
        "internal",
        "key",
        "buddhist",
        "scripture",
        "different",
        "system",
        "devised",
        "classifying",
        "ranking",
        "buddhist",
        "teaching",
        "text",
        "became",
        "basis",
        "competing",
        "textuallydefined",
        "school",
        "buddhism",
        "foremost",
        "consciousnessonly",
        "weishizong",
        "唯識宗",
        "tiantai",
        "heavenly",
        "terrace",
        "tiantai",
        "zong",
        "天台宗",
        "pure",
        "land",
        "jingtu",
        "zong",
        "淨土宗",
        "huayan",
        "flower",
        "ornament",
        "huayan",
        "zong",
        "華嚴宗",
        "school",
        "chan",
        "trace",
        "origin",
        "radical",
        "break",
        "scholastic",
        "approachan",
        "explicit",
        "rejection",
        "ultimate",
        "authority",
        "writing",
        "combined",
        "insistence",
        "authentic",
        "buddhist",
        "teaching",
        "found",
        "book",
        "memorized",
        "liturgy",
        "immediate",
        "facetoface",
        "encounter",
        "buddhist",
        "master",
        "student",
        "iconic",
        "precedent",
        "break",
        "moment",
        "transmission",
        "said",
        "occurred",
        "middle",
        "preaching",
        "gathering",
        "people",
        "vulture",
        "peak",
        "buddha",
        "held",
        "single",
        "flower",
        "elicited",
        "smile",
        "shared",
        "realization",
        "disciple",
        "mahākāśyapa",
        "nearly",
        "thousand",
        "year",
        "later",
        "purported",
        "th",
        "lineage",
        "holder",
        "line",
        "direct",
        "transmissionan",
        "indian",
        "monk",
        "named",
        "bodhidharmais",
        "said",
        "arrived",
        "southeast",
        "china",
        "sea",
        "made",
        "way",
        "north",
        "china",
        "eventually",
        "offered",
        "skin",
        "flesh",
        "bone",
        "marrow",
        "teaching",
        "four",
        "closest",
        "disciple",
        "one",
        "huike",
        "came",
        "regarded",
        "second",
        "chan",
        "patriarch",
        "china",
        "account",
        "chan",
        "origin",
        "wellestablished",
        "tenth",
        "century",
        "rudiment",
        "already",
        "circulating",
        "late",
        "th",
        "early",
        "th",
        "century",
        "contemporary",
        "scholar",
        "regard",
        "account",
        "much",
        "chan",
        "eventually",
        "came",
        "regard",
        "particular",
        "history",
        "invention",
        "tradition",
        "see",
        "eg",
        "mcrae",
        "faure",
        "present",
        "purpose",
        "traditional",
        "story",
        "chan",
        "origin",
        "affords",
        "useful",
        "way",
        "introducing",
        "philosophical",
        "concern",
        "shaped",
        "consolidation",
        "chan",
        "identity",
        "earliest",
        "stratum",
        "text",
        "reliably",
        "attributed",
        "bodhidharma",
        "early",
        "chan",
        "teacher",
        "see",
        "broughton",
        "find",
        "bodhidharma",
        "claiming",
        "two",
        "point",
        "entry",
        "buddhism",
        "via",
        "li",
        "理",
        "informing",
        "impetus",
        "principle",
        "via",
        "xing",
        "行",
        "practice",
        "entry",
        "li",
        "consists",
        "realizing",
        "sentient",
        "being",
        "true",
        "nature",
        "entry",
        "xing",
        "consists",
        "making",
        "good",
        "wrong",
        "done",
        "corresponding",
        "condition",
        "seeking",
        "nothing",
        "acting",
        "accordance",
        "realization",
        "being",
        "true",
        "nature",
        "buddhist",
        "truth",
        "word",
        "something",
        "attained",
        "practice",
        "rather",
        "aspect",
        "achievement",
        "moreover",
        "bodhidharma",
        "affirms",
        "possible",
        "anywhere",
        "whether",
        "one",
        "walking",
        "lying",
        "sitting",
        "standing",
        "successful",
        "buddhist",
        "practice",
        "based",
        "specific",
        "place",
        "posture",
        "neither",
        "dependent",
        "textual",
        "study",
        "fact",
        "claimed",
        "whoever",
        "obtains",
        "understanding",
        "reading",
        "weak",
        "vital",
        "energy",
        "qi",
        "氣",
        "energy",
        "needed",
        "truly",
        "enact",
        "buddhist",
        "path",
        "one",
        "must",
        "obtain",
        "understanding",
        "medium",
        "circumstance",
        "event",
        "never",
        "losing",
        "mindfulness",
        "anywhere",
        "claim",
        "eventually",
        "become",
        "conventional",
        "element",
        "chan",
        "identity",
        "profoundly",
        "iconoclastic",
        "given",
        "chinese",
        "association",
        "writing",
        "authority",
        "institutional",
        "ramification",
        "buddhist",
        "scholasticism",
        "also",
        "philosophically",
        "pregnant",
        "claim",
        "seen",
        "light",
        "hermeneutical",
        "challenge",
        "chinese",
        "buddhist",
        "grappling",
        "seventh",
        "eighth",
        "century",
        "one",
        "signal",
        "debate",
        "seventh",
        "century",
        "centered",
        "whether",
        "people",
        "committed",
        "heinous",
        "crimesfor",
        "example",
        "killing",
        "parent",
        "enlightened",
        "beingthat",
        "absolutely",
        "prospect",
        "ever",
        "realizing",
        "enlightenment",
        "one",
        "could",
        "find",
        "textual",
        "evidence",
        "highly",
        "influential",
        "lotus",
        "sutra",
        "example",
        "even",
        "being",
        "like",
        "devadatta",
        "cousin",
        "buddha",
        "tried",
        "murder",
        "jealousy",
        "already",
        "work",
        "bodhisattva",
        "eventually",
        "reach",
        "buddhahood",
        "text",
        "forwarded",
        "controversial",
        "supportive",
        "thesis",
        "guaranteed",
        "fact",
        "sentient",
        "being",
        "already",
        "haveare",
        "buddhanature",
        "since",
        "originally",
        "enlightened",
        "benjue",
        "本覺",
        "practice",
        "process",
        "acquisition",
        "one",
        "restoration",
        "everyone",
        "agreed",
        "chinese",
        "monk",
        "xuanzang",
        "convinced",
        "text",
        "went",
        "sixteenyear",
        "sojourn",
        "central",
        "asia",
        "india",
        "put",
        "end",
        "debate",
        "returned",
        "laden",
        "six",
        "hundred",
        "new",
        "buddhist",
        "text",
        "confirmation",
        "heterodox",
        "nature",
        "idea",
        "being",
        "buddhanature",
        "spite",
        "treated",
        "imperial",
        "welcome",
        "granted",
        "lavish",
        "support",
        "translation",
        "work",
        "report",
        "state",
        "buddhist",
        "teaching",
        "birthplace",
        "buddha",
        "ironically",
        "seems",
        "buoyed",
        "confidence",
        "chinese",
        "buddhist",
        "committed",
        "buddhanature",
        "thesis",
        "teaching",
        "nonduality",
        "bodhisattva",
        "ideal",
        "presented",
        "key",
        "text",
        "nirvāṇa",
        "vimalakīrti",
        "huayan",
        "sutra",
        "interest",
        "indian",
        "buddhism",
        "waned",
        "chinese",
        "buddhist",
        "including",
        "early",
        "proponent",
        "chan",
        "began",
        "seeing",
        "true",
        "inheritor",
        "buddha",
        "dharma",
        "mandate",
        "demonstrate",
        "skillful",
        "mean",
        "upāya",
        "needed",
        "present",
        "buddhism",
        "way",
        "suited",
        "chinese",
        "audience",
        "striking",
        "symbolic",
        "turning",
        "point",
        "confidence",
        "chinese",
        "buddhist",
        "occurs",
        "le",
        "fifty",
        "year",
        "xuanzang",
        "return",
        "india",
        "huineng",
        "illiterate",
        "manual",
        "laborer",
        "made",
        "sixth",
        "chinese",
        "chan",
        "lineage",
        "holder",
        "given",
        "unprecedented",
        "treatment",
        "transcribed",
        "teaching",
        "titled",
        "platform",
        "sutra",
        "tanjing",
        "since",
        "sutra",
        "traditionally",
        "reserved",
        "solely",
        "recorded",
        "teaching",
        "historical",
        "buddha",
        "effectively",
        "proclaimed",
        "huineng",
        "china",
        "first",
        "homegrown",
        "buddha",
        "hard",
        "imagine",
        "dramatic",
        "affirmation",
        "buddhanature",
        "teaching",
        "china",
        "pointed",
        "rejection",
        "identification",
        "buddhist",
        "authority",
        "buddhist",
        "literacy",
        "next",
        "two",
        "century",
        "chan",
        "identity",
        "crystalized",
        "around",
        "teaching",
        "nonduality",
        "buddhanature",
        "aftermath",
        "devastating",
        "purge",
        "buddhism",
        "huichang",
        "era",
        "quarter",
        "million",
        "monk",
        "nun",
        "forcibly",
        "returned",
        "lay",
        "life",
        "temple",
        "monastery",
        "buddhist",
        "library",
        "destroyed",
        "linji",
        "yixuan",
        "d",
        "one",
        "influential",
        "teacher",
        "chan",
        "history",
        "took",
        "teaching",
        "iconoclastic",
        "extreme",
        "dismissing",
        "great",
        "buddhist",
        "scripture",
        "hitching",
        "post",
        "donkey",
        "encouraging",
        "anyone",
        "happened",
        "see",
        "buddha",
        "road",
        "kill",
        "whereas",
        "metropolitan",
        "textbased",
        "school",
        "chinese",
        "buddhism",
        "devastated",
        "midninth",
        "century",
        "purge",
        "rural",
        "chan",
        "community",
        "flourished",
        "resulting",
        "socalled",
        "five",
        "house",
        "linji",
        "caodong",
        "fayan",
        "yunmen",
        "guiyang",
        "lineage",
        "collection",
        "encounter",
        "dialogue",
        "chan",
        "master",
        "student",
        "began",
        "circulating",
        "resonated",
        "well",
        "chinese",
        "literati",
        "collapse",
        "tang",
        "dynasty",
        "founding",
        "song",
        "chan",
        "fortune",
        "continued",
        "swell",
        "homegrown",
        "form",
        "chinese",
        "buddhism",
        "fit",
        "well",
        "literati",
        "mission",
        "using",
        "ancestral",
        "cultural",
        "tradition",
        "guwen",
        "craft",
        "new",
        "imperial",
        "identity",
        "china",
        "twelfth",
        "century",
        "chan",
        "religious",
        "political",
        "prestige",
        "vast",
        "majority",
        "public",
        "monastery",
        "supported",
        "song",
        "court",
        "devoted",
        "practice",
        "chan",
        "see",
        "welter"
    ]
}