{
    "main_text": "Zhiyan (602–668)\n3. Zhiyan (602–668)\n\nTradition identifies Zhiyan as the second patriarch of the Huayan\nSchool. Zhiyan entered the Buddhist sangha under the tutelage of\nDushun, who exposed him to the Avatamsaka Sutra at Zhixiang\nTemple. But the youthful Zhiyan was also keenly interested in\ndoctrinal matters, and he studied a wide variety of texts and learned\nfrom masters of other schools. His encyclopedic scholarly knowledge of\nBuddhism, paired with uncertainty about how the many doctrines of the\nmany Buddhist schools cohere with each other and an abiding concern\nwith the charge that Buddhism neglects practical matters, led the\nyoung Zhiyan to become disheartened and confused. \n\nRather than follow the more typical path of monk-scholars, Zhiyan left\npublic life, spending some 20 years wandering the countryside and\npreaching to the laity. He returned to Chang’an in the late\n640s, whereupon he attracted many disciples—chief among them\nFazang (who would later become the Third Patriarch) and the Korean\nmonk Uisang (625–702), who took Huayan to Korea. In 661, Prince Pei,\nson of Emperor Gaozu and Empress Wu, appointed Zhiyan as a chief\nlecturer. (This appointment may have been a factor in granting Fazang\nthe access to the royal court that was so important in his later\ncareer.) Zhiyan spent his remaining years teaching and refining his\nearlier work with scholarly detail. \n\nPerhaps the most significant of Zhiyan’s later works is his\nEssays on Sundry Topics in the Huayan Sutra (Ch. Huayan\nJing Nei Zhang Men Deng Za Kong Mu Zhang; T45.1870). Here Zhiyan\nintroduced a five-tiered panjiao. Lowest in rank for this\npanjiao are Abhidharma teachings that posit the existence of\ndharmas with self-natures (svabhava). The second and\nthird ranks then encompass the sectarian Mahayana teachings\nresponsible for Zhiyan’s early confusions. These teachings\nacknowledge that everything, dharmas as well as constructions\nthereof, is empty of self-nature. But they do so in different ways.\nSome, such as Madhyamaka, take universal and thoroughgoing emptiness\nto preclude the possibility of experiencing or knowing a reality that\nis free of conceptual construction. Others, such as the\ntathagatagarbha theory of Yogacara, ground universal and\nthoroughgoing emptiness upon a pure and untainted consciousness.\nZhiyan classifies teachings without a pure and untainted ground for\nemptiness as “elementary” and those with such a ground as\n“advanced,” ranking them second and third in his\npanjiao, respectively. \n\nThe second tier of Zhiyan’s panjiao stands to the third\ntier as Dushun’s first discernment stands to his second. In both\ncases, the latter makes claim to a more penetrating insight into the\nsignificance of dependent arising, by virtue of applying not only to\ndharmas but also to constructions thereof. For both Zhiyan\nand Dushun, the more penetrating insight seems to reveal a preference\nfor kataphatic accounts—focusing on the positive import of\ndependent arising, as manifest with doctrines about\ntathata—over apophatic accounts that focus on the\nconnections between dependent arising and emptiness. \n\nSimilarly, the third tier of Zhiyan’s panjiao stands to\nsubsequent tiers as Dushun’s second discernment stands to his\nthird, delving further into the nature of and relations among\nindividual shi. But Zhiyan’s panjiao, unlike\nDushun’s discernments, offers a doctrinal motivation for\nproceeding to higher stages. The motivation, in brief, is that no\nMahayana teaching, elementary or advanced, explains both the origins of\nenlightenment and the origins of ignorance (as the main cause of\nbarriers to enlightenment). Some Mahayana teachings ground the\nemptiness of reality upon something impure and tainted, laden with\nhindrances and defilements. These teachings accommodate ignorance. Yet\nthey struggle to explain how enlightenment—pure and\nuntainted—arises from the impure and tainted. Other Mahayana\nteachings ground the emptiness of reality upon something pure and\nuntainted. Yet they struggle to explain how such a ground gives rise\nto hindrance and defilement. \n\nZhiyan claims that the teachings of the Avatamsaka Sutra\novercome the limitations of the “elementary” and\n“advanced” Mahayana. (He claims this virtue for the\nteachings of the Lotus Sutra as well.) For Zhiyan, the\nAvatamsaka Sutra reveals an unmediated vision of ultimate\nreality that resolves all conflict among opposites. He calls this a\nvision of the “dharma-realm of dependent\narising.” This realm stands in contrast, conceptually, with the\nrealm of “dependent origination” (Skt.\npratitya-samutpada) familiar from earlier Buddhist teaching.\nThe realm of dependent origination concerns relations of dependence\namong conditioned and illusory dharmas, and in particular\nrelations that help to sustain or extinguish samsaric modes\nof experience. By contrast, the dharma-realm of dependent\narising concerns relations that pertain to nirvanic modes of\nexperience. The most pertinent of these relations, for Zhiyan’s\npanjiao, is the relation between the unmediated vision of\nultimate reality and nirvanic experience itself. According to\nZhiyan, these stand to each other as cause and result, respectively.\nHe calls the teaching that pertains to the first (cause) the “sudden” teaching; and the teaching that pertains to the\nsecond (result), the “round” teaching. Ranking result as\nsuperior to cause thereby completes his five-tiered panjiao.\n\n\nZhiyan endeavors to explain the Avatamsaka Sutra’s\nvision of reality in his Ten Mysteries of the One Vehicle of\nHuayan (Ch. Huayan Yicheng Shixuan Men; trans. Cleary\n1993, 125–146). He does so with his doctrine of the ten mysteries (Ch.\nshi xuan) of the dharma-realm of dependent arising.\nEach mystery is meant to reveal some aspect of the Avatamsaka\nSutra’s vision of reality. These aspects do not quite\ncorrespond with Dushun’s ten claims about the “total\npervasion and accommodation” of each shi with all\nothers (in his third discernment). But subsequent contributors to the\nHuayan School understand Zhiyan’s mysteries as an effort to\nelaborate upon these claims. \n\nZhiyan intends for the ten mysteries to apply to ten categories of\ndharmas. He presents each category as a pairing among\ncontraries: doctrine and meaning, li and shi,\nunderstanding and practice, cause and result, person and\ndharma, realms and stages, teacher and disciple, chief and\nattendants, substance and function, response and stimulus. But there\nis no apparent pattern or system to the order in which Zhiyan presents\nthe ten mysteries, nor does Zhiyan explain how each category applies\nto each mystery. \n\nFor the sake of illustration, consider each mystery as it pertains to\nthe category of shi. (1) Each shi simultaneously\ncauses, and results from, all other shi. (2) Each relates to\nall other shi in a manner that might be described as\n“fractal”: reflecting all others, being reflected by those\nothers, reflecting those reflections, being reflected in reflections\nof those reflections, and so on ad infinitum, akin to a jewel\nof Indra’s net. (3) The arising of each shi is\nsimultaneous with its cessation, and each shi’s\nrevealing itself to nirvanic awareness coincides with the\nconcealment of its dependence upon other shi. (4) Each is\nendowed with the qualities of all others and so, for example,\nmanifests as simultaneously the smallest particle of dust and the\ngreat Mount Sumeru. (5) Each shi, appearing in a single\ninstant of thought, is simultaneously past, present, and future; and\neach of these times has its own past, present, and future. (6) Each\nshi is simultaneously pure, insofar as it is identical with\nall other shi, and mixed, insofar as it contains all other\nshi within itself. (7) Each shi simultaneously\nincludes, and is included within, all other shi, yet without\nlosing its distinctness from those others. (8) Each is identical with\nall others, in the sense that each determines the identity and power\nof all others—and has its identity and power determined by those\nothers—without losing its distinctness. (9) Each shi is\nnothing more than a creation of mind. (10) Each shi reveals the round teaching of the Avatamsaka Sutra and\nfosters understanding of the nature of ultimate reality. \n\nMany of Zhiyan’s mysteries have a paradoxical flavor, presenting\nshi with apparently contrary characteristics. But Zhiyan\nfinds mystery rather than contradiction. His insight seems to involve\na sort of aspectualism, whereby contrary characteristics are ascribed\nto different aspects of one and the same shi, and where\nopposition among these aspects is a matter of perspectival limitation\nrather than inherent contradiction. This perspectival aspectualism\nsupports, as a corollary, Zhiyan’s doctrine of the six\ncharacteristics. According to this doctrine, each shi creates\nall others while retaining its particularity, includes all others\nwithin itself while retaining its difference from them, and integrates\nothers into a whole without cooperating with those others to do so.\nBut Zhiyan provides little by way of explanation for these\ncharacteristics. Nor does he provide explanatory detail for locating\nthe full diversity of experience in a common foundational source of\nmind. These tasks fall to his successors. \n",
    "section_title": "3. Zhiyan (602–668)",
    "entry_title": "Huayan Buddhism",
    "hierarchy_title": "Huayan Buddhism || Zhiyan (602–668)",
    "tokenized_text": [
        "zhiyan",
        "zhiyan",
        "tradition",
        "identifies",
        "zhiyan",
        "second",
        "patriarch",
        "huayan",
        "school",
        "zhiyan",
        "entered",
        "buddhist",
        "sangha",
        "tutelage",
        "dushun",
        "exposed",
        "avatamsaka",
        "sutra",
        "zhixiang",
        "temple",
        "youthful",
        "zhiyan",
        "also",
        "keenly",
        "interested",
        "doctrinal",
        "matter",
        "studied",
        "wide",
        "variety",
        "text",
        "learned",
        "master",
        "school",
        "encyclopedic",
        "scholarly",
        "knowledge",
        "buddhism",
        "paired",
        "uncertainty",
        "many",
        "doctrine",
        "many",
        "buddhist",
        "school",
        "cohere",
        "abiding",
        "concern",
        "charge",
        "buddhism",
        "neglect",
        "practical",
        "matter",
        "led",
        "young",
        "zhiyan",
        "become",
        "disheartened",
        "confused",
        "rather",
        "follow",
        "typical",
        "path",
        "monkscholars",
        "zhiyan",
        "left",
        "public",
        "life",
        "spending",
        "year",
        "wandering",
        "countryside",
        "preaching",
        "laity",
        "returned",
        "chang",
        "late",
        "s",
        "whereupon",
        "attracted",
        "many",
        "discipleschief",
        "among",
        "fazang",
        "would",
        "later",
        "become",
        "third",
        "patriarch",
        "korean",
        "monk",
        "uisang",
        "took",
        "huayan",
        "korea",
        "prince",
        "pei",
        "son",
        "emperor",
        "gaozu",
        "empress",
        "wu",
        "appointed",
        "zhiyan",
        "chief",
        "lecturer",
        "appointment",
        "may",
        "factor",
        "granting",
        "fazang",
        "access",
        "royal",
        "court",
        "important",
        "later",
        "career",
        "zhiyan",
        "spent",
        "remaining",
        "year",
        "teaching",
        "refining",
        "earlier",
        "work",
        "scholarly",
        "detail",
        "perhaps",
        "significant",
        "zhiyan",
        "later",
        "work",
        "essay",
        "sundry",
        "topic",
        "huayan",
        "sutra",
        "ch",
        "huayan",
        "jing",
        "nei",
        "zhang",
        "men",
        "deng",
        "za",
        "kong",
        "mu",
        "zhang",
        "t",
        "zhiyan",
        "introduced",
        "fivetiered",
        "panjiao",
        "lowest",
        "rank",
        "panjiao",
        "abhidharma",
        "teaching",
        "posit",
        "existence",
        "dharma",
        "selfnatures",
        "svabhava",
        "second",
        "third",
        "rank",
        "encompass",
        "sectarian",
        "mahayana",
        "teaching",
        "responsible",
        "zhiyan",
        "early",
        "confusion",
        "teaching",
        "acknowledge",
        "everything",
        "dharma",
        "well",
        "construction",
        "thereof",
        "empty",
        "selfnature",
        "different",
        "way",
        "madhyamaka",
        "take",
        "universal",
        "thoroughgoing",
        "emptiness",
        "preclude",
        "possibility",
        "experiencing",
        "knowing",
        "reality",
        "free",
        "conceptual",
        "construction",
        "others",
        "tathagatagarbha",
        "theory",
        "yogacara",
        "ground",
        "universal",
        "thoroughgoing",
        "emptiness",
        "upon",
        "pure",
        "untainted",
        "consciousness",
        "zhiyan",
        "classifies",
        "teaching",
        "without",
        "pure",
        "untainted",
        "ground",
        "emptiness",
        "elementary",
        "ground",
        "advanced",
        "ranking",
        "second",
        "third",
        "panjiao",
        "respectively",
        "second",
        "tier",
        "zhiyan",
        "panjiao",
        "stand",
        "third",
        "tier",
        "dushun",
        "first",
        "discernment",
        "stand",
        "second",
        "case",
        "latter",
        "make",
        "claim",
        "penetrating",
        "insight",
        "significance",
        "dependent",
        "arising",
        "virtue",
        "applying",
        "dharma",
        "also",
        "construction",
        "thereof",
        "zhiyan",
        "dushun",
        "penetrating",
        "insight",
        "seems",
        "reveal",
        "preference",
        "kataphatic",
        "accountsfocusing",
        "positive",
        "import",
        "dependent",
        "arising",
        "manifest",
        "doctrine",
        "tathataover",
        "apophatic",
        "account",
        "focus",
        "connection",
        "dependent",
        "arising",
        "emptiness",
        "similarly",
        "third",
        "tier",
        "zhiyan",
        "panjiao",
        "stand",
        "subsequent",
        "tier",
        "dushun",
        "second",
        "discernment",
        "stand",
        "third",
        "delving",
        "nature",
        "relation",
        "among",
        "individual",
        "shi",
        "zhiyan",
        "panjiao",
        "unlike",
        "dushun",
        "discernment",
        "offer",
        "doctrinal",
        "motivation",
        "proceeding",
        "higher",
        "stage",
        "motivation",
        "brief",
        "mahayana",
        "teaching",
        "elementary",
        "advanced",
        "explains",
        "origin",
        "enlightenment",
        "origin",
        "ignorance",
        "main",
        "cause",
        "barrier",
        "enlightenment",
        "mahayana",
        "teaching",
        "ground",
        "emptiness",
        "reality",
        "upon",
        "something",
        "impure",
        "tainted",
        "laden",
        "hindrance",
        "defilement",
        "teaching",
        "accommodate",
        "ignorance",
        "yet",
        "struggle",
        "explain",
        "enlightenmentpure",
        "untaintedarises",
        "impure",
        "tainted",
        "mahayana",
        "teaching",
        "ground",
        "emptiness",
        "reality",
        "upon",
        "something",
        "pure",
        "untainted",
        "yet",
        "struggle",
        "explain",
        "ground",
        "give",
        "rise",
        "hindrance",
        "defilement",
        "zhiyan",
        "claim",
        "teaching",
        "avatamsaka",
        "sutra",
        "overcome",
        "limitation",
        "elementary",
        "advanced",
        "mahayana",
        "claim",
        "virtue",
        "teaching",
        "lotus",
        "sutra",
        "well",
        "zhiyan",
        "avatamsaka",
        "sutra",
        "reveals",
        "unmediated",
        "vision",
        "ultimate",
        "reality",
        "resolve",
        "conflict",
        "among",
        "opposite",
        "call",
        "vision",
        "dharmarealm",
        "dependent",
        "arising",
        "realm",
        "stand",
        "contrast",
        "conceptually",
        "realm",
        "dependent",
        "origination",
        "skt",
        "pratityasamutpada",
        "familiar",
        "earlier",
        "buddhist",
        "teaching",
        "realm",
        "dependent",
        "origination",
        "concern",
        "relation",
        "dependence",
        "among",
        "conditioned",
        "illusory",
        "dharma",
        "particular",
        "relation",
        "help",
        "sustain",
        "extinguish",
        "samsaric",
        "mode",
        "experience",
        "contrast",
        "dharmarealm",
        "dependent",
        "arising",
        "concern",
        "relation",
        "pertain",
        "nirvanic",
        "mode",
        "experience",
        "pertinent",
        "relation",
        "zhiyan",
        "panjiao",
        "relation",
        "unmediated",
        "vision",
        "ultimate",
        "reality",
        "nirvanic",
        "experience",
        "according",
        "zhiyan",
        "stand",
        "cause",
        "result",
        "respectively",
        "call",
        "teaching",
        "pertains",
        "first",
        "cause",
        "sudden",
        "teaching",
        "teaching",
        "pertains",
        "second",
        "result",
        "round",
        "teaching",
        "ranking",
        "result",
        "superior",
        "cause",
        "thereby",
        "completes",
        "fivetiered",
        "panjiao",
        "zhiyan",
        "endeavor",
        "explain",
        "avatamsaka",
        "sutra",
        "vision",
        "reality",
        "ten",
        "mystery",
        "one",
        "vehicle",
        "huayan",
        "ch",
        "huayan",
        "yicheng",
        "shixuan",
        "men",
        "trans",
        "cleary",
        "doctrine",
        "ten",
        "mystery",
        "ch",
        "shi",
        "xuan",
        "dharmarealm",
        "dependent",
        "arising",
        "mystery",
        "meant",
        "reveal",
        "aspect",
        "avatamsaka",
        "sutra",
        "vision",
        "reality",
        "aspect",
        "quite",
        "correspond",
        "dushun",
        "ten",
        "claim",
        "total",
        "pervasion",
        "accommodation",
        "shi",
        "others",
        "third",
        "discernment",
        "subsequent",
        "contributor",
        "huayan",
        "school",
        "understand",
        "zhiyan",
        "mystery",
        "effort",
        "elaborate",
        "upon",
        "claim",
        "zhiyan",
        "intends",
        "ten",
        "mystery",
        "apply",
        "ten",
        "category",
        "dharma",
        "present",
        "category",
        "pairing",
        "among",
        "contrary",
        "doctrine",
        "meaning",
        "li",
        "shi",
        "understanding",
        "practice",
        "cause",
        "result",
        "person",
        "dharma",
        "realm",
        "stage",
        "teacher",
        "disciple",
        "chief",
        "attendant",
        "substance",
        "function",
        "response",
        "stimulus",
        "apparent",
        "pattern",
        "system",
        "order",
        "zhiyan",
        "present",
        "ten",
        "mystery",
        "zhiyan",
        "explain",
        "category",
        "applies",
        "mystery",
        "sake",
        "illustration",
        "consider",
        "mystery",
        "pertains",
        "category",
        "shi",
        "shi",
        "simultaneously",
        "cause",
        "result",
        "shi",
        "relates",
        "shi",
        "manner",
        "might",
        "described",
        "fractal",
        "reflecting",
        "others",
        "reflected",
        "others",
        "reflecting",
        "reflection",
        "reflected",
        "reflection",
        "reflection",
        "ad",
        "infinitum",
        "akin",
        "jewel",
        "indra",
        "net",
        "arising",
        "shi",
        "simultaneous",
        "cessation",
        "shi",
        "revealing",
        "nirvanic",
        "awareness",
        "coincides",
        "concealment",
        "dependence",
        "upon",
        "shi",
        "endowed",
        "quality",
        "others",
        "example",
        "manifest",
        "simultaneously",
        "smallest",
        "particle",
        "dust",
        "great",
        "mount",
        "sumeru",
        "shi",
        "appearing",
        "single",
        "instant",
        "thought",
        "simultaneously",
        "past",
        "present",
        "future",
        "time",
        "past",
        "present",
        "future",
        "shi",
        "simultaneously",
        "pure",
        "insofar",
        "identical",
        "shi",
        "mixed",
        "insofar",
        "contains",
        "shi",
        "within",
        "shi",
        "simultaneously",
        "includes",
        "included",
        "within",
        "shi",
        "yet",
        "without",
        "losing",
        "distinctness",
        "others",
        "identical",
        "others",
        "sense",
        "determines",
        "identity",
        "power",
        "othersand",
        "identity",
        "power",
        "determined",
        "otherswithout",
        "losing",
        "distinctness",
        "shi",
        "nothing",
        "creation",
        "mind",
        "shi",
        "reveals",
        "round",
        "teaching",
        "avatamsaka",
        "sutra",
        "foster",
        "understanding",
        "nature",
        "ultimate",
        "reality",
        "many",
        "zhiyan",
        "mystery",
        "paradoxical",
        "flavor",
        "presenting",
        "shi",
        "apparently",
        "contrary",
        "characteristic",
        "zhiyan",
        "find",
        "mystery",
        "rather",
        "contradiction",
        "insight",
        "seems",
        "involve",
        "sort",
        "aspectualism",
        "whereby",
        "contrary",
        "characteristic",
        "ascribed",
        "different",
        "aspect",
        "one",
        "shi",
        "opposition",
        "among",
        "aspect",
        "matter",
        "perspectival",
        "limitation",
        "rather",
        "inherent",
        "contradiction",
        "perspectival",
        "aspectualism",
        "support",
        "corollary",
        "zhiyan",
        "doctrine",
        "six",
        "characteristic",
        "according",
        "doctrine",
        "shi",
        "creates",
        "others",
        "retaining",
        "particularity",
        "includes",
        "others",
        "within",
        "retaining",
        "difference",
        "integrates",
        "others",
        "whole",
        "without",
        "cooperating",
        "others",
        "zhiyan",
        "provides",
        "little",
        "way",
        "explanation",
        "characteristic",
        "provide",
        "explanatory",
        "detail",
        "locating",
        "full",
        "diversity",
        "experience",
        "common",
        "foundational",
        "source",
        "mind",
        "task",
        "fall",
        "successor"
    ]
}