{
    "main_text": "Language\n3. Language\n\n\nIn the medieval university, arts masters provided students with their\nbasic education in grammar, logic or dialectic, and Aristotelian\nphilosophy, subjects that embodied the ideals of literacy and learning\nin the Middle Ages. What they taught is perhaps best understood as a\nspecialized language of rational inquiry, which became the foundation\nfor further study in the faculties of law, medicine, and\ntheology. Students were required to learn, in ascending order, the\nexposition and interpretation of authoritative texts (grammar), the\nstructure and modes of argumentative discourse (logic), and finally,\nthe systematic analysis and investigation of the order of nature\n(Aristotelian philosophy). Although he did not write grammatical\n treatises,[8]\n Buridan asserts in the very first section of the Summulae\nthat “positive grammar [grammatica positiva] has to be\nlearned first, by means of which the master is able to communicate\nwith the disciple, whether it be in Latin, French, Greek, or Hebrew,\nor whatever else” (S 1.1.1: 6). The disciple's knowledge of\nlogic and Aristotelian philosophy is built upon this grammatical\nfoundation.\n\n\nThe importance of language in Buridan's philosophy emerges on many\nlevels, all of which are driven by his pedagogical aims. In logic,\ngrammatical rules are explicitly subsumed as necessary conditions of\nthe science (scientia) of logic, so that although the\nlogician's notion of truth and the grammarian's notion of congruence\nare separable in theory, in practice the complete significance of a\npiece of discourse cannot be determined without both. Context is\ncrucial to interpretation:\nWe should also note that some might ask whether it is the\ncomposite or the divided sense that is properly expressed by\n‘Every man or (a) donkey runs’, that is to say, whether\nonly the term ‘man’ or the whole subject is distributed.\nAnd I say that we have to respond differently, in accordance with the\ndifferent manners of speaking and writing. For if immediately after\n‘man’ there is a sign of division, namely, a pause or a\nperiod, then the proposition will be called divided, and only\n‘man’ will be distributed, but if not, then it will be\ncalled ‘composite’, and the whole subject will be\ndistributed. (S 4.2.6: 250; cf. S 9.4, 15th sophism:\n912–13).\n\n\nAccordingly, logic is not about some conceptually ideal or canonical\nlanguage but the practical art of interpreting human discourse:\nan utterance [vox] does not have any proper import\n[virtus propria] in signifying and suppositing, except from\nourselves. So by an agreement of the disputing parties, as in\nobligational disputes, we can impose on it a new signification and not\nuse it according to its common signification. We can also speak\nfiguratively [transsumptive] and ironically, according to a\ndifferent signification. But we call a locution ‘proper’\nwhen we use it according to the signification commonly and principally\ngiven to it, and we call a locution ‘improper’ when we use\nit otherwise, although we can legitimately use it otherwise. So it is\nabsurd to say that a proposition of an author is false, absolutely\nspeaking, if he puts it forth incorporating an improper locution,\naccording to which it is true. Instead, we ought to say that it is\ntrue, since it is enunciated according to the sense in which it is true\n… So it absolutely seems to me that wherever it is evident that\nan author puts forward a proposition in a true sense, although not as a\nproper locution, then to deny that proposition without qualification\nwould be cantankerous and insolent [dyscolum et protervum].\nBut to avoid error, it should be properly pointed out that the\nproposition is not true in the proper sense, or by virtue of its proper\nmeaning, and then it has to be shown in which sense it is true. (S\n4.3.2: 256; cf. QIP 5: 144–145, ll. 800–829)\n\n\nIn Buridan's view, the logician cannot expound the meaning of a\nproposition without carefully attending to its internal features, i.e.,\nthe sense of the particular locutions incorporated in it, as well as to\nits external features, i.e., the discourse conditions that surround\nit (see Zupko 2015).\n\n\nThis willingness to take human language as it is found, with all of\nits ambiguities and rough edges, marks an important difference between\nBuridan and Ockham, the fourteenth-century philosopher with whom he is\nmost often compared. Both make the traditional assumption that\npropositions, be they spoken, written, or mental, are the bearers of\ntruth and falsity. Ockham, however, tends to see mental propositions\nas logically ideal or, in modern parlance,\n ‘canonical’.[9]\n The problem with spoken and written propositions is that because they\ndepend on the meaning conventions of fallible users, they fail to be\nuniversal and logically perspicuous.  Thankfully, these shortcomings\ncan be filtered out metalinguistically once we realize that the\nmeanings of their constituent terms depend on their corresponding\nmental concepts, which naturally signify the same for everyone. So in\nOckham's logic, the semantic relation between these concepts and what\nthey signify outside the mind is of paramount importance; spoken and\nwritten terms have semantic properties too, of course, but in an\nentirely derivative way. By contrast, Buridan never privileges\nconceptual discourse or suggests that the logician might use it\nsystematically to reform spoken or written language. He holds that\nspoken and written utterances—sometimes he uses the term\n‘utterance [vox]’ where Ockham has ‘term\n[terminus]’—signify concepts primarily: “the\ncapability of speaking was given to us in order that we could signify\nour concepts to others and also the capacity of hearing was given to\nus in order that the concepts of speakers could be signified to\nus” (S 4.1.2: 222). Accordingly, “utterances are imposed\nto signify things only through the mediation of the concepts by which\nthose things are conceived” (QC 1: 4, ll. 45–6). Concepts are\njust the medium of signification for Buridan, the cognitive or\npsychological aspect of the signification of a word.\n\n\nThis difference helps to explain why Buridan uses paradoxes of\nself-reference to test the functionality of his logic, whereas Ockham\navoids them by claiming that a term—or at least a term in those\ncircumstances—cannot refer to\n itself.[10]\n Buridan takes seriously the fact that people can and do utter\nself-referential propositions, and thinks logicians should say what is\ngoing on when they do. This is really a difference of perspective. As\nJoël Biard has pointed out, we can divide medieval logicians into\nthose who try to restrict the possibilities of human discourse in the\ndirection of what is logically ideal, and those who are willing to\naccept a proposition because it is grammatical and because the person\nwho utters it intends to signify something by it. Ockham, William of\nSherwood, and Walter Burley belong to the former group; Buridan and\nThomas Bradwardine to the\n latter.[11]\n It also explains why Buridan tells us that it is not possible to\nanalyze contradictory propositions unless they “have the same\nsubject and predicate in utterance and also in intention” (S\n9.7, 2nd sophism: 943), and his reminding us that, when testing a\nproposition for contradictoriness, “it is [sometimes] necessary\nto add other utterances when contradicting it…. For one should\nprimarily attend to the intention, for we use words only to express\nthe intention” (S 9.8, 11th sophism: 979). The logician must\nabove all be a skilled interpreter of human discourse.\n\n\nFor Buridan, linguistic confusion is the source of many of the\ntraditional problems of metaphysics and natural philosophy. His\napproach is broadly nominalistic, but Buridan's nominalism is more of\na parsimonious way of doing philosophy than a doctrine about the\nontological or metaphysical status of universals.  For example, when a\ncause is understood as being actual rather than merely potential, does\nour conception of it qua cause change in any way? Aristotle\nleaves this ambiguous in Metaphysics V.2, but some medieval\nphilosophers thought it necessary to posit an additional state of\naffairs to explain the dynamic aspect of causality, i.e., the fact\nthat a contingent state of affairs needs to be brought about by some\nagent. Thus, if we think of God as the cause of Socrates, there must\nbe something else, God's-being-the-cause-of-Socrates (deum esse\ncausam Sortis), distinct from both God and Socrates, to account\nfor his existence. This ‘something else’ then becomes not\nonly what is signified by the proposition ‘God is the cause of\nSocrates’ (complexe significabile), but also the proper\nobject of our knowledge that God is the cause of Socrates. Buridan\nreplies by arguing that philosophers who think this way do not know\nhow to interpret human discourse. They take everything too\nliterally. But we should not be misled by what a proposition literally\nsays, or seems to say, into thinking that there must be some new kind\nof entity corresponding to God's being the cause of Socrates,\nespecially since such reifying moves do not help us to understand what\nis happening when a cause actually causes (QM V.7–8: 30va–33ra).\n\n\nThe same sensitivity to questions of interpretation is evident in\nhis treatment of propositions in natural philosophy, where he argues\nthat we can meaningfully use propositions containing terms such as\n‘infinite [infinitum]’ and ‘point\n[punctum]’ to express actual states of affairs without\ncommitting ourselves to the existence of infinite magnitudes or\nindivisible points. The key is to realize that propositions do not\nalways wear their meanings on their sleeves. Their component terms can\nbe differently construed (e.g., categorematically or\nsyncategorematically), and can even perform different modal functions,\nwhich, depending on how the proposition is read (e.g., in a composite\nor divided sense) can change its truth\n conditions.[12]\n There will be ambiguities, of course, but Buridan is steadfast in his\nassumption that the rational inquirer will always be able to sort them\nout, given the right dialectical tools.\n",
    "section_title": "3. Language",
    "entry_title": "John Buridan",
    "hierarchy_title": "John Buridan || Language",
    "tokenized_text": [
        "language",
        "language",
        "medieval",
        "university",
        "art",
        "master",
        "provided",
        "student",
        "basic",
        "education",
        "grammar",
        "logic",
        "dialectic",
        "aristotelian",
        "philosophy",
        "subject",
        "embodied",
        "ideal",
        "literacy",
        "learning",
        "middle",
        "age",
        "taught",
        "perhaps",
        "best",
        "understood",
        "specialized",
        "language",
        "rational",
        "inquiry",
        "became",
        "foundation",
        "study",
        "faculty",
        "law",
        "medicine",
        "theology",
        "student",
        "required",
        "learn",
        "ascending",
        "order",
        "exposition",
        "interpretation",
        "authoritative",
        "text",
        "grammar",
        "structure",
        "mode",
        "argumentative",
        "discourse",
        "logic",
        "finally",
        "systematic",
        "analysis",
        "investigation",
        "order",
        "nature",
        "aristotelian",
        "philosophy",
        "although",
        "write",
        "grammatical",
        "treatise",
        "buridan",
        "asserts",
        "first",
        "section",
        "summulae",
        "positive",
        "grammar",
        "grammatica",
        "positiva",
        "learned",
        "first",
        "mean",
        "master",
        "able",
        "communicate",
        "disciple",
        "whether",
        "latin",
        "french",
        "greek",
        "hebrew",
        "whatever",
        "else",
        "disciple",
        "s",
        "knowledge",
        "logic",
        "aristotelian",
        "philosophy",
        "built",
        "upon",
        "grammatical",
        "foundation",
        "importance",
        "language",
        "buridan",
        "s",
        "philosophy",
        "emerges",
        "many",
        "level",
        "driven",
        "pedagogical",
        "aim",
        "logic",
        "grammatical",
        "rule",
        "explicitly",
        "subsumed",
        "necessary",
        "condition",
        "science",
        "scientia",
        "logic",
        "although",
        "logician",
        "s",
        "notion",
        "truth",
        "grammarian",
        "s",
        "notion",
        "congruence",
        "separable",
        "theory",
        "practice",
        "complete",
        "significance",
        "piece",
        "discourse",
        "determined",
        "without",
        "context",
        "crucial",
        "interpretation",
        "also",
        "note",
        "might",
        "ask",
        "whether",
        "composite",
        "divided",
        "sense",
        "properly",
        "expressed",
        "every",
        "man",
        "donkey",
        "run",
        "say",
        "whether",
        "term",
        "man",
        "whole",
        "subject",
        "distributed",
        "say",
        "respond",
        "differently",
        "accordance",
        "different",
        "manner",
        "speaking",
        "writing",
        "immediately",
        "man",
        "sign",
        "division",
        "namely",
        "pause",
        "period",
        "proposition",
        "called",
        "divided",
        "man",
        "distributed",
        "called",
        "composite",
        "whole",
        "subject",
        "distributed",
        "cf",
        "th",
        "sophism",
        "accordingly",
        "logic",
        "conceptually",
        "ideal",
        "canonical",
        "language",
        "practical",
        "art",
        "interpreting",
        "human",
        "discourse",
        "utterance",
        "vox",
        "proper",
        "import",
        "virtu",
        "propria",
        "signifying",
        "suppositing",
        "except",
        "agreement",
        "disputing",
        "party",
        "obligational",
        "dispute",
        "impose",
        "new",
        "signification",
        "use",
        "according",
        "common",
        "signification",
        "also",
        "speak",
        "figuratively",
        "transsumptive",
        "ironically",
        "according",
        "different",
        "signification",
        "call",
        "locution",
        "proper",
        "use",
        "according",
        "signification",
        "commonly",
        "principally",
        "given",
        "call",
        "locution",
        "improper",
        "use",
        "otherwise",
        "although",
        "legitimately",
        "use",
        "otherwise",
        "absurd",
        "say",
        "proposition",
        "author",
        "false",
        "absolutely",
        "speaking",
        "put",
        "forth",
        "incorporating",
        "improper",
        "locution",
        "according",
        "true",
        "instead",
        "ought",
        "say",
        "true",
        "since",
        "enunciated",
        "according",
        "sense",
        "true",
        "absolutely",
        "seems",
        "wherever",
        "evident",
        "author",
        "put",
        "forward",
        "proposition",
        "true",
        "sense",
        "although",
        "proper",
        "locution",
        "deny",
        "proposition",
        "without",
        "qualification",
        "would",
        "cantankerous",
        "insolent",
        "dyscolum",
        "et",
        "protervum",
        "avoid",
        "error",
        "properly",
        "pointed",
        "proposition",
        "true",
        "proper",
        "sense",
        "virtue",
        "proper",
        "meaning",
        "shown",
        "sense",
        "true",
        "cf",
        "qip",
        "buridan",
        "s",
        "view",
        "logician",
        "expound",
        "meaning",
        "proposition",
        "without",
        "carefully",
        "attending",
        "internal",
        "feature",
        "ie",
        "sense",
        "particular",
        "locution",
        "incorporated",
        "well",
        "external",
        "feature",
        "ie",
        "discourse",
        "condition",
        "surround",
        "see",
        "zupko",
        "willingness",
        "take",
        "human",
        "language",
        "found",
        "ambiguity",
        "rough",
        "edge",
        "mark",
        "important",
        "difference",
        "buridan",
        "ockham",
        "fourteenthcentury",
        "philosopher",
        "often",
        "compared",
        "make",
        "traditional",
        "assumption",
        "proposition",
        "spoken",
        "written",
        "mental",
        "bearer",
        "truth",
        "falsity",
        "ockham",
        "however",
        "tends",
        "see",
        "mental",
        "proposition",
        "logically",
        "ideal",
        "modern",
        "parlance",
        "canonical",
        "problem",
        "spoken",
        "written",
        "proposition",
        "depend",
        "meaning",
        "convention",
        "fallible",
        "user",
        "fail",
        "universal",
        "logically",
        "perspicuous",
        "thankfully",
        "shortcoming",
        "filtered",
        "metalinguistically",
        "realize",
        "meaning",
        "constituent",
        "term",
        "depend",
        "corresponding",
        "mental",
        "concept",
        "naturally",
        "signify",
        "everyone",
        "ockham",
        "s",
        "logic",
        "semantic",
        "relation",
        "concept",
        "signify",
        "outside",
        "mind",
        "paramount",
        "importance",
        "spoken",
        "written",
        "term",
        "semantic",
        "property",
        "course",
        "entirely",
        "derivative",
        "way",
        "contrast",
        "buridan",
        "never",
        "privilege",
        "conceptual",
        "discourse",
        "suggests",
        "logician",
        "might",
        "use",
        "systematically",
        "reform",
        "spoken",
        "written",
        "language",
        "hold",
        "spoken",
        "written",
        "utterancessometimes",
        "us",
        "term",
        "utterance",
        "vox",
        "ockham",
        "term",
        "terminus",
        "signify",
        "concept",
        "primarily",
        "capability",
        "speaking",
        "given",
        "u",
        "order",
        "could",
        "signify",
        "concept",
        "others",
        "also",
        "capacity",
        "hearing",
        "given",
        "u",
        "order",
        "concept",
        "speaker",
        "could",
        "signified",
        "u",
        "accordingly",
        "utterance",
        "imposed",
        "signify",
        "thing",
        "mediation",
        "concept",
        "thing",
        "conceived",
        "qc",
        "concept",
        "medium",
        "signification",
        "buridan",
        "cognitive",
        "psychological",
        "aspect",
        "signification",
        "word",
        "difference",
        "help",
        "explain",
        "buridan",
        "us",
        "paradox",
        "selfreference",
        "test",
        "functionality",
        "logic",
        "whereas",
        "ockham",
        "avoids",
        "claiming",
        "termor",
        "least",
        "term",
        "circumstances",
        "refer",
        "buridan",
        "take",
        "seriously",
        "fact",
        "people",
        "utter",
        "selfreferential",
        "proposition",
        "think",
        "logician",
        "say",
        "going",
        "really",
        "difference",
        "perspective",
        "joël",
        "biard",
        "pointed",
        "divide",
        "medieval",
        "logician",
        "try",
        "restrict",
        "possibility",
        "human",
        "discourse",
        "direction",
        "logically",
        "ideal",
        "willing",
        "accept",
        "proposition",
        "grammatical",
        "person",
        "utters",
        "intends",
        "signify",
        "something",
        "ockham",
        "william",
        "sherwood",
        "walter",
        "burley",
        "belong",
        "former",
        "group",
        "buridan",
        "thomas",
        "bradwardine",
        "latter",
        "also",
        "explains",
        "buridan",
        "tell",
        "u",
        "possible",
        "analyze",
        "contradictory",
        "proposition",
        "unless",
        "subject",
        "predicate",
        "utterance",
        "also",
        "intention",
        "nd",
        "sophism",
        "reminding",
        "u",
        "testing",
        "proposition",
        "contradictoriness",
        "sometimes",
        "necessary",
        "add",
        "utterance",
        "contradicting",
        "it",
        "one",
        "primarily",
        "attend",
        "intention",
        "use",
        "word",
        "express",
        "intention",
        "th",
        "sophism",
        "logician",
        "must",
        "skilled",
        "interpreter",
        "human",
        "discourse",
        "buridan",
        "linguistic",
        "confusion",
        "source",
        "many",
        "traditional",
        "problem",
        "metaphysics",
        "natural",
        "philosophy",
        "approach",
        "broadly",
        "nominalistic",
        "buridan",
        "s",
        "nominalism",
        "parsimonious",
        "way",
        "philosophy",
        "doctrine",
        "ontological",
        "metaphysical",
        "status",
        "universal",
        "example",
        "cause",
        "understood",
        "actual",
        "rather",
        "merely",
        "potential",
        "conception",
        "qua",
        "cause",
        "change",
        "way",
        "aristotle",
        "leaf",
        "ambiguous",
        "metaphysics",
        "v",
        "medieval",
        "philosopher",
        "thought",
        "necessary",
        "posit",
        "additional",
        "state",
        "affair",
        "explain",
        "dynamic",
        "aspect",
        "causality",
        "ie",
        "fact",
        "contingent",
        "state",
        "affair",
        "need",
        "brought",
        "agent",
        "thus",
        "think",
        "god",
        "cause",
        "socrates",
        "must",
        "something",
        "else",
        "godsbeingthecauseofsocrates",
        "deum",
        "esse",
        "causam",
        "sortis",
        "distinct",
        "god",
        "socrates",
        "account",
        "existence",
        "something",
        "else",
        "becomes",
        "signified",
        "proposition",
        "god",
        "cause",
        "socrates",
        "complexe",
        "significabile",
        "also",
        "proper",
        "object",
        "knowledge",
        "god",
        "cause",
        "socrates",
        "buridan",
        "reply",
        "arguing",
        "philosopher",
        "think",
        "way",
        "know",
        "interpret",
        "human",
        "discourse",
        "take",
        "everything",
        "literally",
        "misled",
        "proposition",
        "literally",
        "say",
        "seems",
        "say",
        "thinking",
        "must",
        "new",
        "kind",
        "entity",
        "corresponding",
        "god",
        "s",
        "cause",
        "socrates",
        "especially",
        "since",
        "reifying",
        "move",
        "help",
        "u",
        "understand",
        "happening",
        "cause",
        "actually",
        "cause",
        "qm",
        "v",
        "vara",
        "sensitivity",
        "question",
        "interpretation",
        "evident",
        "treatment",
        "proposition",
        "natural",
        "philosophy",
        "argues",
        "meaningfully",
        "use",
        "proposition",
        "containing",
        "term",
        "infinite",
        "infinitum",
        "point",
        "punctum",
        "express",
        "actual",
        "state",
        "affair",
        "without",
        "committing",
        "existence",
        "infinite",
        "magnitude",
        "indivisible",
        "point",
        "key",
        "realize",
        "proposition",
        "always",
        "wear",
        "meaning",
        "sleeve",
        "component",
        "term",
        "differently",
        "construed",
        "eg",
        "categorematically",
        "syncategorematically",
        "even",
        "perform",
        "different",
        "modal",
        "function",
        "depending",
        "proposition",
        "read",
        "eg",
        "composite",
        "divided",
        "sense",
        "change",
        "truth",
        "condition",
        "ambiguity",
        "course",
        "buridan",
        "steadfast",
        "assumption",
        "rational",
        "inquirer",
        "always",
        "able",
        "sort",
        "given",
        "right",
        "dialectical",
        "tool"
    ]
}