{
    "main_text": "Burke and the American Revolution\n7. Burke and the American Revolution\n\n\nPolitical participation generated scepticism about Burke as a person,\nsome of which was unjust, though all of it was to be expected.  What\nwas perhaps less predictable, and is certainly more interesting\nphilosophically, is that this participation was a precondition of the\npractical thought which made Burke famous in his own time and has\ngiven him a leading place in the canon of Western political\nthought. One very important example of this is his treatment of the\nAmerican Revolution. This was informed, no doubt, by where Burke\nhappened to find himself on the spectrum of practical politics in the\nyears that followed 1766. But his conclusions for practice were\ninformed also by his understanding of ideas – meaning ideas in a\nphilosophical, precisely in a Lockean sense – and how these could be\ncombined. In other words, the content of his political thought was\ninformed importantly not only by where he was practically but also who\nhe was philosophically.\n\n\nBurke’s practical thinking about the dispute between the British\nparliament and its North American colonies began with a situation not\nof his making, that is to say the rejection of the Stamp Act by the\ncolonists, and its withdrawal by the ministry headed by Lord\nRockingham in 1765–6. The Rockingham ministry followed up this\nconcession by way of letting the colonists alone with the explicit\nassertion of Parliament’s right to legislate for the colonies in the\nDeclaratory Act of 1766. Burke’s task was to demonstrate to the House\nof Commons the plausibility of this package. He did so by combining\ntwo complex ideas—or at least two abstract compound\nnouns—in a new way. One idea was empire, which involved\ncommand. The other was liberty. These, Burke thought, were ideas\ndifficult to combine—a sound reflection as they are\ndiametrically opposed—but that they were combinable in the\nfurther idea of a British empire—one which combined\nlegislative command with civil liberty. This idea implied letting\nalone certain matters of concern to the colonists, and so allowing\nthem in some respects civil liberty on a de facto basis (SDR,\nW & S 1981–2015, ii. 317–18). This idea is\nconsiderably more ingenious than the average British position that\n‘all the dominions of Great Britain are bound by Acts of\nParliament’\n .[8] \n Burke’s view was explanatory, because it conceptualised the situation\nbefore Parliament in a way that made intelligible the points involved\nand established a connexion amongst them. It was also accommodating,\nbecause it made the British executive’s policy intellectually and\ntherefore practically respectable at the same time that it made room\nfor colonial preferences. In short, it was a small masterpiece of\nthinking about policy.\n\n\nThe repeal of the Stamp Act was followed by the passing of the\nDeclaratory Act. Burke was practically successful in 1766 with the\nHouse of Commons because he was speaking for the executive, and a\nmajority amongst Members of Parliament, ceteris paribus,\ntended to vote for the king’s ministers. In 1774 and 1775 he was\npractically unsuccessful, because he was now in opposition, but his\nconceptual achievement in dealing with the American question became\nmuch greater. By 1774, the issues dividing some American colonists\nfrom Parliament had changed. The former now resented the\nattempts of the latter to levy taxation on them directly, rather than\nby the authority of their own colonial legislatures, and they resented\nstill more the project of backing the attempt, if need be, with\ncoercion. Burke’s speech of 1774 on\nAmerican Taxation did not delete the idea of imperial\ncommand, but rather elaborated his complex idea of the British empire\nin a new way in order to deal with the new situation.\n\n\nBurke elaborated the complex idea in a way to which complex ideas lend\nthemselves, that is to say, by adding a qualification. The sovereignty\nof the British parliament was an idea that certainly included a right\nto tax: but a right to tax could be understood to be consistent on\nprinciple with inaction as well as action. The right, in plainer\nlanguage, need not be applied. Burke could accommodate, therefore,\nboth the claims of Westminster and those of the colonists. To this\npoint, of course, one might reply that Burke was merely\nmaking concessions. But observe: this situation provided a cue for\nconceptual innovation—Burke inserted a distinction into the\nidea of sovereignty. He distinguished ‘my idea of the\nconstitution of the British Empire’ from ‘the constitution\nof Britain’ unconnected with overseas rule. It could be inferred\nthat\nThe Parliament of Great Britain sits at the head of her\nextensive empire in two capacities: one of the local legislature of\nthis island, providing for all things at home…The\nother…is what I call her imperial character, in\nwhich…she superintends all the several inferior legislatures,\nand guides, and controls them all without annihilating any. As all\nthese provincial legislatures are only co-ordinate to each other, they\nought all to be subordinate to her….It is necessary to coerce\nthe negligent, to restrain the violent, and to aid the weak and\ndeficient, by the over-ruling plenitude of her power. She is never to\nintrude into the place of the others, whilst they are equal to the\ncommon ends of their institution. But in order to enable parliament to\nanswer all these ends of provident and beneficent superintendence, her\npowers must be boundless\n\n\nso that Burke’s elaboration of the complex idea of the British\nempire suggests complementary roles for the British parliament and the\ncolonial legislatures, an elaboration which would make the question of\ntaxation irrelevant at a stroke, whilst simultaneously emphasizing the\nauthority of Westminster.\n\n\nConceptual refinement provided a practical avenue that other, less\ngifted politicians had not devised. Burke’s position was altogether\nsubtler than the implied tautology of a minister’s claim that ‘to\nsay we have a right to tax America and are never to exercise that right\nis ridiculous’ (Sir Edward Thurlow, quoted in Gore-Brown 1953,\n85), and of another politician’s despairing sense that ‘we must\neither insist upon their submission to the authority of the Legislature\nor give them up entirely to their own discretion.’\n .[9]\n These pundits, by failing to conceive a sufficiently complex idea of\nsovereignty and the sovereign’s right to tax, failed also to see that\nsovereignty did not imply an unpleasant choice between abrogating this\nright by disuse or applying it by force.\n\n\nEvents soon required a further elaboration of Burke’s idea of the\nBritish empire. The continued use of coercion made the colonists more,\nnot less recalcitrant. The practical need seemed to be for terms on\nwhich they would stay, in some sense or senses, under British rule. Their\ncrucial claim was now that their right to tax themselves by their own\nlegislatures rested on charters from the Crown, and that they were\nsubordinate to the Crown alone, and not to Parliament. Burke gave still\ncloser attention to the idea of sovereignty. It would be tactless to\nemphasize the sovereignty of Parliament, but it would be self-defeating\nto withdraw it explicitly and concede a sovereign right over taxation\nto the colonial legislatures. So now, in Burke’s speech on\nConciliation with America (1775), he focussed upon only one\naspect of the complex idea of a parliamentary sovereign. The latter\ncomprised in the British instance not only Lords and Commons, but also\nthe king. Hence, by judicious emphasis, the item acquiesced in by the\ncolonists could do some conceptual work: ‘my idea of an\nEmpire…is…that an Empire is the aggregate of many States,\nunder one common head; whether this head be a monarch or a presiding\nrepublick’; and it was emphasized that the rights of the colonists\ndepended on this superior, for ‘the claim of a privilege seems\nrather, ex vi termini, to imply a superior power.’ As to\na right to tax, Burke added on a later occasion, that though it\n‘was inherent in the supreme power of society, taken as\nan aggregate, it did not follow that it must reside in any\nparticular power in that society’, and therefore\nParliament could delegate it to local legislatures. In short,\n‘sovereignty was not in its nature an idea of abstract unity; but\nwas capable of great complexity and infinite modifications.’\n(SSC, W & S 1981–2015, iii. 193).\n\n\nWhether Burke’s ‘infinite modifications’ would have\nassisted in keeping the thirteen colonies within the fold of the\nBritish empire is unknowable, for nothing like his proposals were tried\nuntil 1778, which was too late. It is clear, however, that Burke’s\nability to make conceptual changes depended on his philosophical\nthinking. To think in terms of complex ideas is to recognize that they\ncan be elaborated by adding further ideas; to distinguish between the\nroles of Parliament is to make that addition; and to analyse the powers\nof a parliamentary sovereign as a preface to relocating one of them is to\nuse philosophy as a tool in practical reasoning. It is noteworthy,\nalso, that these philosophical exercises were the means of coping, as\nBurke hoped, with practical changes. Neither was his work here\nprimarily ideological, for though Burke had a practical goal in view,\nand at that one consistent with the Rockingham achievements of 1766, he\nworked philosophically to modify the conceptions in terms of which his\ncontemporaries viewed their situation, rather than using his conceptual\ntools as ways of defending those conceptions without modifying them.\nThus he added ideas to the stock of his day. It is fitting, though\nBurke’s proposals were not implemented in time, and though his goal was\nnot attained, that his American speeches figured prominently in the\nschools and universities of both the U.K. and the U.S.A. well into the\ntwentieth century. Burke, after all, was suspicious of poor ideas: he\nconcluded that ‘one of the main causes of our present\ntroubles’ was ‘general discourses, and vague\nsentiments’, and urged instead study of ‘an exact detail of\nparticulars’ (SSC, W & S 1981–2015, iii. 185).\n",
    "section_title": "7. Burke and the American Revolution",
    "entry_title": "Edmund Burke",
    "hierarchy_title": "Edmund Burke || Burke and the American Revolution",
    "tokenized_text": [
        "burke",
        "american",
        "revolution",
        "burke",
        "american",
        "revolution",
        "political",
        "participation",
        "generated",
        "scepticism",
        "burke",
        "person",
        "unjust",
        "though",
        "expected",
        "perhaps",
        "le",
        "predictable",
        "certainly",
        "interesting",
        "philosophically",
        "participation",
        "precondition",
        "practical",
        "thought",
        "made",
        "burke",
        "famous",
        "time",
        "given",
        "leading",
        "place",
        "canon",
        "western",
        "political",
        "thought",
        "one",
        "important",
        "example",
        "treatment",
        "american",
        "revolution",
        "informed",
        "doubt",
        "burke",
        "happened",
        "find",
        "spectrum",
        "practical",
        "politics",
        "year",
        "followed",
        "conclusion",
        "practice",
        "informed",
        "also",
        "understanding",
        "idea",
        "meaning",
        "idea",
        "philosophical",
        "precisely",
        "lockean",
        "sense",
        "could",
        "combined",
        "word",
        "content",
        "political",
        "thought",
        "informed",
        "importantly",
        "practically",
        "also",
        "philosophically",
        "burke",
        "practical",
        "thinking",
        "dispute",
        "british",
        "parliament",
        "north",
        "american",
        "colony",
        "began",
        "situation",
        "making",
        "say",
        "rejection",
        "stamp",
        "act",
        "colonist",
        "withdrawal",
        "ministry",
        "headed",
        "lord",
        "rockingham",
        "rockingham",
        "ministry",
        "followed",
        "concession",
        "way",
        "letting",
        "colonist",
        "alone",
        "explicit",
        "assertion",
        "parliament",
        "right",
        "legislate",
        "colony",
        "declaratory",
        "act",
        "burke",
        "task",
        "demonstrate",
        "house",
        "common",
        "plausibility",
        "package",
        "combining",
        "two",
        "complex",
        "ideasor",
        "least",
        "two",
        "abstract",
        "compound",
        "nounsin",
        "new",
        "way",
        "one",
        "idea",
        "empire",
        "involved",
        "command",
        "liberty",
        "burke",
        "thought",
        "idea",
        "difficult",
        "combinea",
        "sound",
        "reflection",
        "diametrically",
        "opposedbut",
        "combinable",
        "idea",
        "british",
        "empireone",
        "combined",
        "legislative",
        "command",
        "civil",
        "liberty",
        "idea",
        "implied",
        "letting",
        "alone",
        "certain",
        "matter",
        "concern",
        "colonist",
        "allowing",
        "respect",
        "civil",
        "liberty",
        "de",
        "facto",
        "basis",
        "sdr",
        "w",
        "ii",
        "idea",
        "considerably",
        "ingenious",
        "average",
        "british",
        "position",
        "dominion",
        "great",
        "britain",
        "bound",
        "act",
        "parliament",
        "burke",
        "view",
        "explanatory",
        "conceptualised",
        "situation",
        "parliament",
        "way",
        "made",
        "intelligible",
        "point",
        "involved",
        "established",
        "connexion",
        "amongst",
        "also",
        "accommodating",
        "made",
        "british",
        "executive",
        "policy",
        "intellectually",
        "therefore",
        "practically",
        "respectable",
        "time",
        "made",
        "room",
        "colonial",
        "preference",
        "short",
        "small",
        "masterpiece",
        "thinking",
        "policy",
        "repeal",
        "stamp",
        "act",
        "followed",
        "passing",
        "declaratory",
        "act",
        "burke",
        "practically",
        "successful",
        "house",
        "common",
        "speaking",
        "executive",
        "majority",
        "amongst",
        "member",
        "parliament",
        "ceteris",
        "paribus",
        "tended",
        "vote",
        "king",
        "minister",
        "practically",
        "unsuccessful",
        "opposition",
        "conceptual",
        "achievement",
        "dealing",
        "american",
        "question",
        "became",
        "much",
        "greater",
        "issue",
        "dividing",
        "american",
        "colonist",
        "parliament",
        "changed",
        "former",
        "resented",
        "attempt",
        "latter",
        "levy",
        "taxation",
        "directly",
        "rather",
        "authority",
        "colonial",
        "legislature",
        "resented",
        "still",
        "project",
        "backing",
        "attempt",
        "need",
        "coercion",
        "burke",
        "speech",
        "american",
        "taxation",
        "delete",
        "idea",
        "imperial",
        "command",
        "rather",
        "elaborated",
        "complex",
        "idea",
        "british",
        "empire",
        "new",
        "way",
        "order",
        "deal",
        "new",
        "situation",
        "burke",
        "elaborated",
        "complex",
        "idea",
        "way",
        "complex",
        "idea",
        "lend",
        "say",
        "adding",
        "qualification",
        "sovereignty",
        "british",
        "parliament",
        "idea",
        "certainly",
        "included",
        "right",
        "tax",
        "right",
        "tax",
        "could",
        "understood",
        "consistent",
        "principle",
        "inaction",
        "well",
        "action",
        "right",
        "plainer",
        "language",
        "need",
        "applied",
        "burke",
        "could",
        "accommodate",
        "therefore",
        "claim",
        "westminster",
        "colonist",
        "point",
        "course",
        "one",
        "might",
        "reply",
        "burke",
        "merely",
        "making",
        "concession",
        "observe",
        "situation",
        "provided",
        "cue",
        "conceptual",
        "innovationburke",
        "inserted",
        "distinction",
        "idea",
        "sovereignty",
        "distinguished",
        "idea",
        "constitution",
        "british",
        "empire",
        "constitution",
        "britain",
        "unconnected",
        "overseas",
        "rule",
        "could",
        "inferred",
        "parliament",
        "great",
        "britain",
        "sits",
        "head",
        "extensive",
        "empire",
        "two",
        "capacity",
        "one",
        "local",
        "legislature",
        "island",
        "providing",
        "thing",
        "homethe",
        "otheris",
        "call",
        "imperial",
        "character",
        "whichshe",
        "superintends",
        "several",
        "inferior",
        "legislature",
        "guide",
        "control",
        "without",
        "annihilating",
        "provincial",
        "legislature",
        "coordinate",
        "ought",
        "subordinate",
        "herit",
        "necessary",
        "coerce",
        "negligent",
        "restrain",
        "violent",
        "aid",
        "weak",
        "deficient",
        "overruling",
        "plenitude",
        "power",
        "never",
        "intrude",
        "place",
        "others",
        "whilst",
        "equal",
        "common",
        "end",
        "institution",
        "order",
        "enable",
        "parliament",
        "answer",
        "end",
        "provident",
        "beneficent",
        "superintendence",
        "power",
        "must",
        "boundless",
        "burke",
        "elaboration",
        "complex",
        "idea",
        "british",
        "empire",
        "suggests",
        "complementary",
        "role",
        "british",
        "parliament",
        "colonial",
        "legislature",
        "elaboration",
        "would",
        "make",
        "question",
        "taxation",
        "irrelevant",
        "stroke",
        "whilst",
        "simultaneously",
        "emphasizing",
        "authority",
        "westminster",
        "conceptual",
        "refinement",
        "provided",
        "practical",
        "avenue",
        "le",
        "gifted",
        "politician",
        "devised",
        "burke",
        "position",
        "altogether",
        "subtler",
        "implied",
        "tautology",
        "minister",
        "claim",
        "say",
        "right",
        "tax",
        "america",
        "never",
        "exercise",
        "right",
        "ridiculous",
        "sir",
        "edward",
        "thurlow",
        "quoted",
        "gorebrown",
        "another",
        "politician",
        "despairing",
        "sense",
        "must",
        "either",
        "insist",
        "upon",
        "submission",
        "authority",
        "legislature",
        "give",
        "entirely",
        "discretion",
        "pundit",
        "failing",
        "conceive",
        "sufficiently",
        "complex",
        "idea",
        "sovereignty",
        "sovereign",
        "right",
        "tax",
        "failed",
        "also",
        "see",
        "sovereignty",
        "imply",
        "unpleasant",
        "choice",
        "abrogating",
        "right",
        "disuse",
        "applying",
        "force",
        "event",
        "soon",
        "required",
        "elaboration",
        "burke",
        "idea",
        "british",
        "empire",
        "continued",
        "use",
        "coercion",
        "made",
        "colonist",
        "le",
        "recalcitrant",
        "practical",
        "need",
        "seemed",
        "term",
        "would",
        "stay",
        "sense",
        "sens",
        "british",
        "rule",
        "crucial",
        "claim",
        "right",
        "tax",
        "legislature",
        "rested",
        "charter",
        "crown",
        "subordinate",
        "crown",
        "alone",
        "parliament",
        "burke",
        "gave",
        "still",
        "closer",
        "attention",
        "idea",
        "sovereignty",
        "would",
        "tactless",
        "emphasize",
        "sovereignty",
        "parliament",
        "would",
        "selfdefeating",
        "withdraw",
        "explicitly",
        "concede",
        "sovereign",
        "right",
        "taxation",
        "colonial",
        "legislature",
        "burke",
        "speech",
        "conciliation",
        "america",
        "focussed",
        "upon",
        "one",
        "aspect",
        "complex",
        "idea",
        "parliamentary",
        "sovereign",
        "latter",
        "comprised",
        "british",
        "instance",
        "lord",
        "common",
        "also",
        "king",
        "hence",
        "judicious",
        "emphasis",
        "item",
        "acquiesced",
        "colonist",
        "could",
        "conceptual",
        "work",
        "idea",
        "empireisthat",
        "empire",
        "aggregate",
        "many",
        "state",
        "one",
        "common",
        "head",
        "whether",
        "head",
        "monarch",
        "presiding",
        "republick",
        "emphasized",
        "right",
        "colonist",
        "depended",
        "superior",
        "claim",
        "privilege",
        "seems",
        "rather",
        "ex",
        "vi",
        "terminus",
        "imply",
        "superior",
        "power",
        "right",
        "tax",
        "burke",
        "added",
        "later",
        "occasion",
        "though",
        "inherent",
        "supreme",
        "power",
        "society",
        "taken",
        "aggregate",
        "follow",
        "must",
        "reside",
        "particular",
        "power",
        "society",
        "therefore",
        "parliament",
        "could",
        "delegate",
        "local",
        "legislature",
        "short",
        "sovereignty",
        "nature",
        "idea",
        "abstract",
        "unity",
        "capable",
        "great",
        "complexity",
        "infinite",
        "modifications",
        "ssc",
        "w",
        "iii",
        "whether",
        "burke",
        "infinite",
        "modification",
        "would",
        "assisted",
        "keeping",
        "thirteen",
        "colony",
        "within",
        "fold",
        "british",
        "empire",
        "unknowable",
        "nothing",
        "like",
        "proposal",
        "tried",
        "late",
        "clear",
        "however",
        "burke",
        "ability",
        "make",
        "conceptual",
        "change",
        "depended",
        "philosophical",
        "thinking",
        "think",
        "term",
        "complex",
        "idea",
        "recognize",
        "elaborated",
        "adding",
        "idea",
        "distinguish",
        "role",
        "parliament",
        "make",
        "addition",
        "analyse",
        "power",
        "parliamentary",
        "sovereign",
        "preface",
        "relocating",
        "one",
        "use",
        "philosophy",
        "tool",
        "practical",
        "reasoning",
        "noteworthy",
        "also",
        "philosophical",
        "exercise",
        "mean",
        "coping",
        "burke",
        "hoped",
        "practical",
        "change",
        "neither",
        "work",
        "primarily",
        "ideological",
        "though",
        "burke",
        "practical",
        "goal",
        "view",
        "one",
        "consistent",
        "rockingham",
        "achievement",
        "worked",
        "philosophically",
        "modify",
        "conception",
        "term",
        "contemporary",
        "viewed",
        "situation",
        "rather",
        "using",
        "conceptual",
        "tool",
        "way",
        "defending",
        "conception",
        "without",
        "modifying",
        "thus",
        "added",
        "idea",
        "stock",
        "day",
        "fitting",
        "though",
        "burke",
        "proposal",
        "implemented",
        "time",
        "though",
        "goal",
        "attained",
        "american",
        "speech",
        "figured",
        "prominently",
        "school",
        "university",
        "uk",
        "usa",
        "well",
        "twentieth",
        "century",
        "burke",
        "suspicious",
        "poor",
        "idea",
        "concluded",
        "one",
        "main",
        "cause",
        "present",
        "trouble",
        "general",
        "discourse",
        "vague",
        "sentiment",
        "urged",
        "instead",
        "study",
        "exact",
        "detail",
        "particular",
        "ssc",
        "w",
        "iii"
    ]
}