{
    "main_text": "Topics || The Immortality of the Soul\n2.2 Metaphysics: Universals\n\n\nThere is plenty of textual evidence that the attempt of Neoplatonist\ncommentators of Late Antiquity to reconcile the doctrines of Plato and\nAristotle on the issue of universals was closely followed in Byzantium\nby prominent thinkers like John Italos, Eustratios of Nicaea,\nNikephoros Blemmydes, Nikephoros Choumnos and George (Gennadios)\nScholarios. More specifically, Byzantine philosophers as a rule adopted\nthe Neoplatonist commentators’ three ways of understanding genera\n(and species) terms as referring to:\n\nthe genera before the particulars (pro tōn pollōn),\nwhich are generally identified with the Platonic Ideas in God’s\nmind;\nthe genera in the particulars (en tois pollois), which\nare supposed to correspond to Aristotle’s immanent forms;\nand\nthe genera after the particulars (epi tois pollois / meta tous\npollous), which are concepts in human minds.\n\n\n\nThese three types of genera are the ones first introduced by the\n5th-century Neoplatonist Ammonius in his commentary on Porphyry’s\nIsagoge; they are also discussed in Elias’ and\nDavid’s commentaries on the same work, in Olympiodorus’\nProlegomena, and in Philoponus’ commentary on\nAristotle’s Categories. And it is the same three ways of\nunderstanding genera (and species) terms that are discussed by Arethas\nin his commentary on Porphyry’s Isagoge, but are also\nhinted at in Photios’ treatise Various Questions for\nDiscussion on Genera and Species (= Amphil. 77) as well\nas in Psellos’ paraphrase of Aristotle’s De\ninterpretatione.\n\n\nThis attempt to bring together the three ways of understanding\ngenera (and species) terms has been labeled as “conceptual”\nor “moderate realism” (Benakis 1982), but it has also been\npresented as a nominalist or conceptualist position (Joannou 1954;\nLloyd 1990). In view of this disagreement, it may be interesting to\ntake a closer look at the position the Byzantines advocated and to\ncompare it with that propounded by the Neoplatonist commentators. In\nparticular, it is important to focus on John Italos’ views on\ngenera, since he repeatedly discusses them at great length in his\nQuaestiones quodlibetales and there seems to be no earlier\nindications of any more vivid or systematic interest in this issue.\n\n\nIn quaestio 5, for instance, Italos talks about the same\nthree types of genera in the same order, but a certain detail of his\naccount proves to be quite intriguing. Italos, too, regards the genera\nbefore the particulars as the causes and paradigms of perceptible\nindividuals, which are not predicates, are separate from them, and\nexist in God’s mind, perfectly accommodating in this way the\nrequirements of Christian dogma. But then he presents the genera in the\nparticulars and the genera after the particulars in a manner which\nseems to differ from Ammonius’ account, for he seems to treat\nthem as two subdivisions of one class of genera, which is distinguished\nfrom the genera before the particulars by being later-born\n(hysterogenē) than the perceptible individuals, capable\nof being predicated of them, inseparable from them, and acquired by our\nmind by abstraction. What makes the genera in the particulars differ\nfrom the genera after the particulars, according to Italos, is the fact\nthat they are inseparable from the particulars in which they are: they\nare not predicated of many particulars, but only of the one particular\nwhich participates in them. The animal in Socrates is not the same as\nthe animal in Plato. On the other hand, the genera after the\nparticulars are predicated of many particulars, and it is one and the\nsame genus that is predicated both of all the particulars together and\nof every single one of them separately.\n\n\nDoes this mean that Italos understands the genera in the particulars\nas referring to forms which are particular? In other words, does this\nmean that he interprets Aristotle’s immanent forms as particular\nrather than universal? The pedigree of such an interpretation is not\nnegligible; both Proclus in his Elements of Theology as well\nas his teacher Syrianus in his commentary on Aristotle’s\nMetaphysics viewed the immanent forms as particulars, without\nimplying in any way that on this point they disagreed with Aristotle.\nAnd although Ammonius is not clear on this subject, there is no reason\nto believe that he was not here in agreement with these other\nNeoplatonists. This, of course, does not mean that such an\ninterpretation of Aristotle’s theory has to be the right one. But\nit is reasonable to think that, by Italos’ time, treating\nAristotle’s immanent forms as particulars was an acceptable, if\nnot the standard, interpretation.\n\n\nMost importantly, though, the point on which Italos seems to differ\nfrom Ammonius’ account of the three types of genera is that he\nconsiders not only the genera after the particulars as acquired by our\nmind by abstraction but also the genera in the particulars as such. For\nit seems that the genera after the particulars are acquired by our mind\nby abstraction of the common characteristics of perceptible\nindividuals, just like in Ammonius’ commentary, while the genera\nin the particulars are acquired by our mind by abstraction of the\nparticular form from the matter involved in each particular. Therefore,\nthe genera in the particulars do seem to represent, on Italos’\nview, what they represent for Proclus and Syrianus, namely immanent\nforms that are particular.\n\n\nBut if both the genera after the particulars and the genera in the\nparticulars are acquired by our mind by abstraction, does this mean\nthat, for Italos, they are not beings? On the contrary, Italos offers a\nwhole series of arguments to support the thesis that the genera are\nbeings (quaestiones 3, 19, 31). For this purpose he draws what\nhe takes to be Aristotle’s distinction between two senses of\nsomething’s being incorporeal (quaestio 8):\n\nSomething is incorporeal per se, truly, and strictly speaking,\nwhen it does not need a body for subsisting.\nSomething is incorporeal per accidens and by abstraction, when\nit depends on a body for subsisting.\n\n\n\nThus, according to Italos’ interpretation of Aristotle, the\ngenera are incorporeal in a weak sense, since they are not strictly\nspeaking incorporeal but depend on a body for subsisting. Indeed, this\nis the sense that Italos himself adopts in his understanding of the\ngenera as incorporeal; genera are incorporeal per accidens and\nnot per se, because they are incorporeal insofar as they are\nin the human soul, while at the same time they are corporeal by\nparticipation (kata methexin) insofar as they subsist in the\nparticulars. And the genera that he has in mind in such contexts are\nobviously the genera in the particulars and the genera after the\nparticulars.\n\n\nBut if the genera are incorporeal beings, is there a special sense\nin which they are said to be beings? Italos often makes use of another\ndistinction, which is a commonplace in Platonic texts from Plotinus to\nSimplicius, but seems to have its origins even earlier; namely, the\ndistinction between something subsisting and something depending on\nmere thought. According to Italos (quaestio 19), things that\ndo not subsist (anupostata) but depend on mere thought are not\nbeings. As for things that subsist, he distinguishes between two\ndifferent kinds of beings; namely, between beings that subsist per\nse, which he calls subsistences (hupostaseis), and beings\nthat subsist in something else (enupostata). Subsistences are\nprior by perception, they are particulars and are for the most part\nbodies, whereas beings that subsist in something else are prior by\nknowledge, they are incorporeal, they are predicates shared by many\nthings, and they are thoughts (noēmata /\ndianoēmata). Italos’ terminology here clearly shows\nthe influence of the Christian Fathers, and in particular of John of\nDamascus, who in his Dialectica draws just this distinction\nbetween subsistences, things that subsist in something else, and things\nthat do not subsist. According to Italos, therefore, both subsistences\nand beings that subsist in something else are beings, and thus do not\ndepend on mere thought. Italos distinguishes these two kinds of beings\nfrom the standard examples of things that do not subsist, i.e.,\ngoat-stags and centaurs, as well as from his own examples of many-eyed\nmen and four-headed horses; for all these are, on his view, nothing but\nfabrications of the human mind and products of our imagination\n(phantasmata). On the other hand, it also is important not to\noverlook the difference between subsistences and beings that subsist in\nsomething else. Although the first subsist per se, the latter\nare thoughts that subsist in something else.\n\n\nHence, Italos’ position on the three types of genera could be\nsummarized as follows: All types of genera are incorporeal beings, the\ngenera before the particulars are subsistences whereas the genera in\nthe particulars as well as the genera after the particulars are beings\nthat subsist in something else. That is to say, although only God,\nGod’s thoughts, and the perceptible individuals exist in the\nstrong sense as subsistences, all types of genera are beings; they may\nbe beings in a different sense, but they all are beings and not\nconstructions of our mind devoid of reality. For this reason, it would\nperhaps be misleading to label Italos as a “nominalist”,\nsince he does not defend the view that the in rebus and\npost res genera are mere expressions, but it would also be\nmisleading to label him as a “realist”, since he does not\nthink that the in rebus and post res genera are\nsubsistences. Presumably, it is this difficulty of pinning down\nItalos’ position that has led to the introduction of intermediate\nlabels such as “conceptualist” and “conceptual”\nor “moderate realist”.\n",
    "section_title": "2.2 Metaphysics: Universals",
    "entry_title": "Byzantine Philosophy",
    "hierarchy_title": "Byzantine Philosophy || Topics || The Immortality of the Soul",
    "tokenized_text": [
        "topic",
        "immortality",
        "soul",
        "metaphysics",
        "universal",
        "plenty",
        "textual",
        "evidence",
        "attempt",
        "neoplatonist",
        "commentator",
        "late",
        "antiquity",
        "reconcile",
        "doctrine",
        "plato",
        "aristotle",
        "issue",
        "universal",
        "closely",
        "followed",
        "byzantium",
        "prominent",
        "thinker",
        "like",
        "john",
        "italos",
        "eustratios",
        "nicaea",
        "nikephoros",
        "blemmydes",
        "nikephoros",
        "choumnos",
        "george",
        "gennadios",
        "scholarios",
        "specifically",
        "byzantine",
        "philosopher",
        "rule",
        "adopted",
        "neoplatonist",
        "commentator",
        "three",
        "way",
        "understanding",
        "genus",
        "specie",
        "term",
        "referring",
        "genus",
        "particular",
        "pro",
        "tōn",
        "pollōn",
        "generally",
        "identified",
        "platonic",
        "idea",
        "god",
        "mind",
        "genus",
        "particular",
        "en",
        "tois",
        "pollois",
        "supposed",
        "correspond",
        "aristotle",
        "immanent",
        "form",
        "genus",
        "particular",
        "epi",
        "tois",
        "pollois",
        "meta",
        "tous",
        "pollous",
        "concept",
        "human",
        "mind",
        "three",
        "type",
        "genus",
        "one",
        "first",
        "introduced",
        "thcentury",
        "neoplatonist",
        "ammonius",
        "commentary",
        "porphyry",
        "isagoge",
        "also",
        "discussed",
        "elia",
        "david",
        "commentary",
        "work",
        "olympiodorus",
        "prolegomenon",
        "philoponus",
        "commentary",
        "aristotle",
        "category",
        "three",
        "way",
        "understanding",
        "genus",
        "specie",
        "term",
        "discussed",
        "arethas",
        "commentary",
        "porphyry",
        "isagoge",
        "also",
        "hinted",
        "photios",
        "treatise",
        "various",
        "question",
        "discussion",
        "genus",
        "specie",
        "amphil",
        "well",
        "psellos",
        "paraphrase",
        "aristotle",
        "de",
        "interpretatione",
        "attempt",
        "bring",
        "together",
        "three",
        "way",
        "understanding",
        "genus",
        "specie",
        "term",
        "labeled",
        "conceptual",
        "moderate",
        "realism",
        "benakis",
        "also",
        "presented",
        "nominalist",
        "conceptualist",
        "position",
        "joannou",
        "lloyd",
        "view",
        "disagreement",
        "may",
        "interesting",
        "take",
        "closer",
        "look",
        "position",
        "byzantine",
        "advocated",
        "compare",
        "propounded",
        "neoplatonist",
        "commentator",
        "particular",
        "important",
        "focus",
        "john",
        "italos",
        "view",
        "genus",
        "since",
        "repeatedly",
        "discus",
        "great",
        "length",
        "quaestiones",
        "quodlibetales",
        "seems",
        "earlier",
        "indication",
        "vivid",
        "systematic",
        "interest",
        "issue",
        "quaestio",
        "instance",
        "italos",
        "talk",
        "three",
        "type",
        "genus",
        "order",
        "certain",
        "detail",
        "account",
        "prof",
        "quite",
        "intriguing",
        "italos",
        "regard",
        "genus",
        "particular",
        "cause",
        "paradigm",
        "perceptible",
        "individual",
        "predicate",
        "separate",
        "exist",
        "god",
        "mind",
        "perfectly",
        "accommodating",
        "way",
        "requirement",
        "christian",
        "dogma",
        "present",
        "genus",
        "particular",
        "genus",
        "particular",
        "manner",
        "seems",
        "differ",
        "ammonius",
        "account",
        "seems",
        "treat",
        "two",
        "subdivision",
        "one",
        "class",
        "genus",
        "distinguished",
        "genus",
        "particular",
        "laterborn",
        "hysterogenē",
        "perceptible",
        "individual",
        "capable",
        "predicated",
        "inseparable",
        "acquired",
        "mind",
        "abstraction",
        "make",
        "genus",
        "particular",
        "differ",
        "genus",
        "particular",
        "according",
        "italos",
        "fact",
        "inseparable",
        "particular",
        "predicated",
        "many",
        "particular",
        "one",
        "particular",
        "participates",
        "animal",
        "socrates",
        "animal",
        "plato",
        "hand",
        "genus",
        "particular",
        "predicated",
        "many",
        "particular",
        "one",
        "genus",
        "predicated",
        "particular",
        "together",
        "every",
        "single",
        "one",
        "separately",
        "mean",
        "italos",
        "understands",
        "genus",
        "particular",
        "referring",
        "form",
        "particular",
        "word",
        "mean",
        "interprets",
        "aristotle",
        "immanent",
        "form",
        "particular",
        "rather",
        "universal",
        "pedigree",
        "interpretation",
        "negligible",
        "proclus",
        "element",
        "theology",
        "well",
        "teacher",
        "syrianus",
        "commentary",
        "aristotle",
        "metaphysics",
        "viewed",
        "immanent",
        "form",
        "particular",
        "without",
        "implying",
        "way",
        "point",
        "disagreed",
        "aristotle",
        "although",
        "ammonius",
        "clear",
        "subject",
        "reason",
        "believe",
        "agreement",
        "neoplatonist",
        "course",
        "mean",
        "interpretation",
        "aristotle",
        "theory",
        "right",
        "one",
        "reasonable",
        "think",
        "italos",
        "time",
        "treating",
        "aristotle",
        "immanent",
        "form",
        "particular",
        "acceptable",
        "standard",
        "interpretation",
        "importantly",
        "though",
        "point",
        "italos",
        "seems",
        "differ",
        "ammonius",
        "account",
        "three",
        "type",
        "genus",
        "considers",
        "genus",
        "particular",
        "acquired",
        "mind",
        "abstraction",
        "also",
        "genus",
        "particular",
        "seems",
        "genus",
        "particular",
        "acquired",
        "mind",
        "abstraction",
        "common",
        "characteristic",
        "perceptible",
        "individual",
        "like",
        "ammonius",
        "commentary",
        "genus",
        "particular",
        "acquired",
        "mind",
        "abstraction",
        "particular",
        "form",
        "matter",
        "involved",
        "particular",
        "therefore",
        "genus",
        "particular",
        "seem",
        "represent",
        "italos",
        "view",
        "represent",
        "proclus",
        "syrianus",
        "namely",
        "immanent",
        "form",
        "particular",
        "genus",
        "particular",
        "genus",
        "particular",
        "acquired",
        "mind",
        "abstraction",
        "mean",
        "italos",
        "being",
        "contrary",
        "italos",
        "offer",
        "whole",
        "series",
        "argument",
        "support",
        "thesis",
        "genus",
        "being",
        "quaestiones",
        "purpose",
        "draw",
        "take",
        "aristotle",
        "distinction",
        "two",
        "sens",
        "something",
        "incorporeal",
        "quaestio",
        "something",
        "incorporeal",
        "per",
        "se",
        "truly",
        "strictly",
        "speaking",
        "need",
        "body",
        "subsisting",
        "something",
        "incorporeal",
        "per",
        "accidens",
        "abstraction",
        "depends",
        "body",
        "subsisting",
        "thus",
        "according",
        "italos",
        "interpretation",
        "aristotle",
        "genus",
        "incorporeal",
        "weak",
        "sense",
        "since",
        "strictly",
        "speaking",
        "incorporeal",
        "depend",
        "body",
        "subsisting",
        "indeed",
        "sense",
        "italos",
        "adopts",
        "understanding",
        "genus",
        "incorporeal",
        "genus",
        "incorporeal",
        "per",
        "accidens",
        "per",
        "se",
        "incorporeal",
        "insofar",
        "human",
        "soul",
        "time",
        "corporeal",
        "participation",
        "kata",
        "methexin",
        "insofar",
        "subsist",
        "particular",
        "genus",
        "mind",
        "context",
        "obviously",
        "genus",
        "particular",
        "genus",
        "particular",
        "genus",
        "incorporeal",
        "being",
        "special",
        "sense",
        "said",
        "being",
        "italos",
        "often",
        "make",
        "use",
        "another",
        "distinction",
        "commonplace",
        "platonic",
        "text",
        "plotinus",
        "simplicius",
        "seems",
        "origin",
        "even",
        "earlier",
        "namely",
        "distinction",
        "something",
        "subsisting",
        "something",
        "depending",
        "mere",
        "thought",
        "according",
        "italos",
        "quaestio",
        "thing",
        "subsist",
        "anupostata",
        "depend",
        "mere",
        "thought",
        "being",
        "thing",
        "subsist",
        "distinguishes",
        "two",
        "different",
        "kind",
        "being",
        "namely",
        "being",
        "subsist",
        "per",
        "se",
        "call",
        "subsistence",
        "hupostaseis",
        "being",
        "subsist",
        "something",
        "else",
        "enupostata",
        "subsistence",
        "prior",
        "perception",
        "particular",
        "part",
        "body",
        "whereas",
        "being",
        "subsist",
        "something",
        "else",
        "prior",
        "knowledge",
        "incorporeal",
        "predicate",
        "shared",
        "many",
        "thing",
        "thought",
        "noēmata",
        "dianoēmata",
        "italos",
        "terminology",
        "clearly",
        "show",
        "influence",
        "christian",
        "father",
        "particular",
        "john",
        "damascus",
        "dialectica",
        "draw",
        "distinction",
        "subsistence",
        "thing",
        "subsist",
        "something",
        "else",
        "thing",
        "subsist",
        "according",
        "italos",
        "therefore",
        "subsistence",
        "being",
        "subsist",
        "something",
        "else",
        "being",
        "thus",
        "depend",
        "mere",
        "thought",
        "italos",
        "distinguishes",
        "two",
        "kind",
        "being",
        "standard",
        "example",
        "thing",
        "subsist",
        "ie",
        "goatstags",
        "centaur",
        "well",
        "example",
        "manyeyed",
        "men",
        "fourheaded",
        "horse",
        "view",
        "nothing",
        "fabrication",
        "human",
        "mind",
        "product",
        "imagination",
        "phantasmata",
        "hand",
        "also",
        "important",
        "overlook",
        "difference",
        "subsistence",
        "being",
        "subsist",
        "something",
        "else",
        "although",
        "first",
        "subsist",
        "per",
        "se",
        "latter",
        "thought",
        "subsist",
        "something",
        "else",
        "hence",
        "italos",
        "position",
        "three",
        "type",
        "genus",
        "could",
        "summarized",
        "follows",
        "type",
        "genus",
        "incorporeal",
        "being",
        "genus",
        "particular",
        "subsistence",
        "whereas",
        "genus",
        "particular",
        "well",
        "genus",
        "particular",
        "being",
        "subsist",
        "something",
        "else",
        "say",
        "although",
        "god",
        "god",
        "thought",
        "perceptible",
        "individual",
        "exist",
        "strong",
        "sense",
        "subsistence",
        "type",
        "genus",
        "being",
        "may",
        "being",
        "different",
        "sense",
        "being",
        "construction",
        "mind",
        "devoid",
        "reality",
        "reason",
        "would",
        "perhaps",
        "misleading",
        "label",
        "italos",
        "nominalist",
        "since",
        "defend",
        "view",
        "rebus",
        "post",
        "re",
        "genus",
        "mere",
        "expression",
        "would",
        "also",
        "misleading",
        "label",
        "realist",
        "since",
        "think",
        "rebus",
        "post",
        "re",
        "genus",
        "subsistence",
        "presumably",
        "difficulty",
        "pinning",
        "italos",
        "position",
        "led",
        "introduction",
        "intermediate",
        "label",
        "conceptualist",
        "conceptual",
        "moderate",
        "realist"
    ]
}