{
    "main_text": "Criticism of Aristotle and Championing of Telesio’s Natural Philosophy\n2. Criticism of Aristotle and Championing of Telesio’s Natural Philosophy\n\nCampanella’s first printed work, Philosophia sensibus\ndemonstrata, was written when the twenty-one year old Dominican\nfriar was living in a monastery in the Calabrian village of Altomonte.\nIt was published in Naples in 1591. The work is divided into eight\ndisputationes (‘disputations’), in which he\ndefends Telesio’s new philosophy of nature against the attack of the\nAristotelian Giacomo Antonio Marta. In the preface Campanella traces\nthe course of his intellectual development and presents the\n“new” aspects of his own thought. It is no accident that\nthese pages begin with the word “truth,” depicted\nallegorically on the title-page as a sphere floating on water, as\nwinds blowing from all sides threaten to submerge it and a young friar\nswims out to reach it. Truth can be hidden and persecuted, Campanella\nmaintains, but it cannot be held prisoner by injustice; in the end it\nemerges from the darkness and is once again resplendent. These\nintroductory pages offer us a lively account of the doubts of the\nyoung friar who, recalling the years he spent in Dominican monasteries\nin Calabria, cannot conceal his disillusionment. The works of ancient\nand modern philosophers have convinced him that human knowledge had\nbecome ever more obscure and confused because it had distanced itself\nprogressively from the direct experience of nature and had turned\ninstead to reading and commenting on books written by human beings.\nThis attitude was particularly evident in the followers of Aristotle\nwho directed their energies toward the words of their master, without\nattempting to compare them to the natural world. In this way\nphilosophical research had degenerated into sophistical disputes and a\nseries of pointless battles over words. Reflecting on all this, the\nyoung Campanella formed a conviction that he would never abandon: an\nadequate knowledge of things is one that comes from the things\nthemselves, which we must investigate on the basis of sense\nexperience.\n\nThis forms the context for his fundamental encounter with the\nphilosophy of Telesio. Reading the first edition of De rerum\nnatura iuxta propria principia, Campanella intuited, right from\nthe beginning, the novelty and cogency of Telesio’s approach. In\naccordance with Campanella’s own aspirations, Telesio believed in\nderiving the truth from a direct examination of natural facts, so that\nthe correct connections between words and things, which had gotten\nlost in the Aristotelian tradition, could now be re-established.\nReviving and developing, in an original manner, a time-honored\nmetaphor, Campanella affirmed that the philosophical investigator must\nread and study the “book of nature.” In a famous\nsonnet—he was also the author of an extraordinary collection of\nphilosophical poetry—he stated: “The world is the book on\nwhich the Eternal Wisdom / wrote its own thoughts”\n(Poesie, 1998, p. 46). In order to construct an authentic\nnatural philosophy, a continual comparison between the books written\nby human beings and the infinite book of nature was necessary, so as\nto correct the errors in the human “copies,” that were\ninevitably imperfect, partial and consequently in need of revision. In\nanother sonnet, Campanella rendered homage to “Telesio from\nCosenza” (“Telesio cosentino”) for having used his\narrows to pierce and kill Aristotle, described as the “tyrant of\nminds”, and for having in this way restored to mankind the\nlibertas philosophandi (freedom to philosophize), which is\ninseparable from the truth (Poesie, 1998, p. 278).\n\nIn his own treatise, Philosophia sensibus demonstrata,\nCampanella produced a systematic critique of the axioms of\nAristotelian philosophy, bringing to light their limitations and\nincoherence on the physical, cosmological and metaphysical level, by\ndrawing on Telesian principles integrated with notions deriving from\nother philosophies. Campanella had a secure knowledge of Aristotle’s\nworks and those of his commentators and followers, whether ancient\n(Themistius, Alexander of Aphrodisias, Philoponus), medieval (Averroes\nwas frequently cited alongside Thomas Aquinas and, above all, the\n“divine” Albertus Magnus) or contemporary (such as\nAgostino Nifo). He re-evaluated the Presocratic philosophers, who had\nbeen criticized by Aristotle, and was well acquainted with medical\nwriters from Hippocrates and Galen to Pietro d’Abano, Jean Fernel and\nVesalius. He had read the works of astronomers and of natural\nphilosophers—Pliny the Elder’s Natural History played a\nrole of primary importance for him. One of the authors most cited by\nCampanella, in close conjunction with the philosophy of Telesio, was\nMarsilio Ficino. He quoted in particular passages from Ficino’s\ncommentaries on Plato (especially the Timaeus and\nSymposium) and on the Enneads of Plotinus.\n\nIn his attack on the Aristotelian tradition, Campanella criticized the\ndoctrines of form and of privation; of the four elements as principles\nof the sublunary world; of matter as privation; of the derivation of\ncelestial heat from the friction of the spheres; and of the\ndistinction between natural and violent motion. The culmination of his\nefforts to dismantle the Aristotelian system was a radical critique of\ntraditional cosmology, with regard both to the nature of the heavens\nand to the trajectories and mechanisms of celestial movements. In\nparallel to the destructive side of Campanella’s argument, the\nconstructive element consisted of defending the doctrines of Telesio’s\nphilosophy. According to Telesio, all being derived from modifications\nresulting from the actions of the two principles of hot and cold on\nmatter, which he did not regard as an abstract ens rationis\n(an entity existing in the mind) but rather as an inert corporeal\nmass, dark and entirely formless but capable of receiving any form.\nFrom the subtle and detailed argumentative structure of the eight\nweighty disputationes emerges a powerful unitary notion: the\ncentrality, nobility and primacy of solar heat, that connects all\nbeings and confers life on them. It is within this context that the\nassimilation of solar heat to the World Soul acquires a particular\nsignificance, a theme that is at the heart of the third disputation,\nentitled “De coelo et mundo” (“On the heavens and\nthe world”). Campanella here transcribes verbatim a passage from\nFicino’s commentary on Plotinus’s Enneads in which he dwells\non the World Soul and its “vital and sensual breath”\n(Philosophia sensibus demonstrata, pp. 322–23). Ficino\nassociates this hot breath, that penetrates and is infused into the\nentire world, with a well-known line from Virgil’s Aeneid\n(VI.726: “spiritus intus alit”; “the spirit\nnourishes from within”) and also with the divine spirit of\nGenesis 1:2: “the spirit of God moved upon the face of the\nwaters”. The heavens are composed of this breath and divine\nword, that vivifies and nourishes everything.\n\nCampanella set out this philosophy of nature, inspired by Telesio but\nreworked in an original manner, in successive treatises such as the\nEpilogo magno (Great Epilogue), that, when\ntranslated into Latin, would become the “Physiologia,” the\nfirst of the four parts of his Philosophia realis, first\npublished in Frankfurt in 1623; the other three parts were entitled\n“Ethica,” “Politica” and\n“Oeconomica”. In the second and definitive edition,\npublished in Paris in 1637, all four parts, and in particular the\nfirst, were accompanied by numerous and lengthy quaestiones\nconcerning specific problems, in which the views of ancient and modern\nphilosophers were discussed. Campanella begins the\n“Physiologia” by stating that when the first\nBeing—most powerful, most wise and best—decided to create\nthe world, defined as its “effigy” and the\n“image” of its infinite goods, it unfolded an\n“almost infinite” space in which that effigy was placed.\nThis occurred at the outset of that enduring vicissitude of things\nthat we call time and that is the image of eternity from which it\nflows. Space is defined as “a primary substance or seat or\nimmobile and incorporeal capacity, able to receive any body.” It\nis homogeneous: human terms such as “high” and\n“low”, “behind and in front of”,\n“right” and “left”, refer to bodies that are\nplaced within it; and if the world did not exist, we would imagine\nspace to be empty. In reality, however, it desires fullness, is\nendowed with attractive force and abhors remaining empty. Bodies, in\nturn, enjoy mutual contact and hate the void that separates them\n(Physiologia, in Opera latina, II, pp. 575–77).\n\nWithin space God places matter that in clear contrast to the\nconception of Aristotle and Averroes, who defined it as privation and\nas a pure ens rationis, is regarded by Campanella as a\nphysical entity, deprived of form, shape and action, but capable of\nbeing extended, divided, united and of assuming any shape, just as wax\ncan receive an impression from any seal. Into this corporeal mass God\ninserts heat and coldness, the two active principles, that are\nself-disseminating and incorporeal but can only subsist in bodies.\nFrom their conflict, deriving from the fact that each wants to take\npossession of and occupy the greatest possible quantity of matter,\ncome the two primary bodies and elements of the world: the heavens,\nthat are extremely hot, subtle and mobile, since they are formed of\nmatter transformed by heat; and the earth, composed of matter made\nimmobile, dark and dense by cold. The clash between the heavens and\nthe earth, between heat and coldness—instruments and\n‘craftsmen’ that God uses to produce the infinite modes of\nhis creative wisdom in the wondrous effigy that is the\nworld—gives birth to all individual entities. By means of these\nprinciples Campanella explains every aspect of the natural world, from\ncelestial and meteorological phenomena to the formation of the waters,\nfrom the composition of minerals to that of plants. Animals and human\nbeings he analyzes with particular attention. At the origin of these\norganisms, that are more complex and have more parts, lies an\nespecially attenuated celestial heat, the spiritus.\nConsisting of matter made extremely subtle by solar heat, it is a warm\nbreath that, thanks to its tenuousness and motion, is able to separate\nitself from the portion of matter in which it finds itself enclosed\nand to act on it. Unable to exhale itself from corporeality in order\nto return to the heavens from which it has its origin, this plasma\nconstructs, in ways that suit its needs and avoid the external dangers\nthreatening it from within, the organs that guarantee its\nconservation and life. Proud of his medical knowledge (among his works\nis one entitled Medicina, made up of eight books and\npublished in Lyons in 1635), here and in other treatises Campanella\ndelighted in highlighting the wondrous structure of the human body and\nits parts, revealing how the functions and purposes specific and\nparticular to individual organs harmonize in the marvelous order of\nthe totality and confirm the presence of divine craftsmanship in every\nfiber of natural reality.\n",
    "section_title": "2. Criticism of Aristotle and Championing of Telesio’s Natural Philosophy",
    "entry_title": "Tommaso Campanella",
    "hierarchy_title": "Tommaso Campanella || Criticism of Aristotle and Championing of Telesio’s Natural Philosophy",
    "tokenized_text": [
        "criticism",
        "aristotle",
        "championing",
        "telesio",
        "natural",
        "philosophy",
        "criticism",
        "aristotle",
        "championing",
        "telesio",
        "natural",
        "philosophy",
        "campanella",
        "first",
        "printed",
        "work",
        "philosophia",
        "sensibus",
        "demonstrata",
        "written",
        "twentyone",
        "year",
        "old",
        "dominican",
        "friar",
        "living",
        "monastery",
        "calabrian",
        "village",
        "altomonte",
        "published",
        "naples",
        "work",
        "divided",
        "eight",
        "disputationes",
        "disputation",
        "defends",
        "telesio",
        "new",
        "philosophy",
        "nature",
        "attack",
        "aristotelian",
        "giacomo",
        "antonio",
        "marta",
        "preface",
        "campanella",
        "trace",
        "course",
        "intellectual",
        "development",
        "present",
        "new",
        "aspect",
        "thought",
        "accident",
        "page",
        "begin",
        "word",
        "truth",
        "depicted",
        "allegorically",
        "titlepage",
        "sphere",
        "floating",
        "water",
        "wind",
        "blowing",
        "side",
        "threaten",
        "submerge",
        "young",
        "friar",
        "swim",
        "reach",
        "truth",
        "hidden",
        "persecuted",
        "campanella",
        "maintains",
        "held",
        "prisoner",
        "injustice",
        "end",
        "emerges",
        "darkness",
        "resplendent",
        "introductory",
        "page",
        "offer",
        "u",
        "lively",
        "account",
        "doubt",
        "young",
        "friar",
        "recalling",
        "year",
        "spent",
        "dominican",
        "monastery",
        "calabria",
        "conceal",
        "disillusionment",
        "work",
        "ancient",
        "modern",
        "philosopher",
        "convinced",
        "human",
        "knowledge",
        "become",
        "ever",
        "obscure",
        "confused",
        "distanced",
        "progressively",
        "direct",
        "experience",
        "nature",
        "turned",
        "instead",
        "reading",
        "commenting",
        "book",
        "written",
        "human",
        "being",
        "attitude",
        "particularly",
        "evident",
        "follower",
        "aristotle",
        "directed",
        "energy",
        "toward",
        "word",
        "master",
        "without",
        "attempting",
        "compare",
        "natural",
        "world",
        "way",
        "philosophical",
        "research",
        "degenerated",
        "sophistical",
        "dispute",
        "series",
        "pointless",
        "battle",
        "word",
        "reflecting",
        "young",
        "campanella",
        "formed",
        "conviction",
        "would",
        "never",
        "abandon",
        "adequate",
        "knowledge",
        "thing",
        "one",
        "come",
        "thing",
        "must",
        "investigate",
        "basis",
        "sense",
        "experience",
        "form",
        "context",
        "fundamental",
        "encounter",
        "philosophy",
        "telesio",
        "reading",
        "first",
        "edition",
        "de",
        "rerum",
        "natura",
        "iuxta",
        "propria",
        "principia",
        "campanella",
        "intuited",
        "right",
        "beginning",
        "novelty",
        "cogency",
        "telesio",
        "approach",
        "accordance",
        "campanella",
        "aspiration",
        "telesio",
        "believed",
        "deriving",
        "truth",
        "direct",
        "examination",
        "natural",
        "fact",
        "correct",
        "connection",
        "word",
        "thing",
        "gotten",
        "lost",
        "aristotelian",
        "tradition",
        "could",
        "reestablished",
        "reviving",
        "developing",
        "original",
        "manner",
        "timehonored",
        "metaphor",
        "campanella",
        "affirmed",
        "philosophical",
        "investigator",
        "must",
        "read",
        "study",
        "book",
        "nature",
        "famous",
        "sonnethe",
        "also",
        "author",
        "extraordinary",
        "collection",
        "philosophical",
        "poetryhe",
        "stated",
        "world",
        "book",
        "eternal",
        "wisdom",
        "wrote",
        "thought",
        "poesie",
        "p",
        "order",
        "construct",
        "authentic",
        "natural",
        "philosophy",
        "continual",
        "comparison",
        "book",
        "written",
        "human",
        "being",
        "infinite",
        "book",
        "nature",
        "necessary",
        "correct",
        "error",
        "human",
        "copy",
        "inevitably",
        "imperfect",
        "partial",
        "consequently",
        "need",
        "revision",
        "another",
        "sonnet",
        "campanella",
        "rendered",
        "homage",
        "telesio",
        "cosenza",
        "telesio",
        "cosentino",
        "used",
        "arrow",
        "pierce",
        "kill",
        "aristotle",
        "described",
        "tyrant",
        "mind",
        "way",
        "restored",
        "mankind",
        "libertas",
        "philosophandi",
        "freedom",
        "philosophize",
        "inseparable",
        "truth",
        "poesie",
        "p",
        "treatise",
        "philosophia",
        "sensibus",
        "demonstrata",
        "campanella",
        "produced",
        "systematic",
        "critique",
        "axiom",
        "aristotelian",
        "philosophy",
        "bringing",
        "light",
        "limitation",
        "incoherence",
        "physical",
        "cosmological",
        "metaphysical",
        "level",
        "drawing",
        "telesian",
        "principle",
        "integrated",
        "notion",
        "deriving",
        "philosophy",
        "campanella",
        "secure",
        "knowledge",
        "aristotle",
        "work",
        "commentator",
        "follower",
        "whether",
        "ancient",
        "themistius",
        "alexander",
        "aphrodisia",
        "philoponus",
        "medieval",
        "averroes",
        "frequently",
        "cited",
        "alongside",
        "thomas",
        "aquinas",
        "divine",
        "albertus",
        "magnus",
        "contemporary",
        "agostino",
        "nifo",
        "reevaluated",
        "presocratic",
        "philosopher",
        "criticized",
        "aristotle",
        "well",
        "acquainted",
        "medical",
        "writer",
        "hippocrates",
        "galen",
        "pietro",
        "abano",
        "jean",
        "fernel",
        "vesalius",
        "read",
        "work",
        "astronomer",
        "natural",
        "philosopherspliny",
        "elder",
        "natural",
        "history",
        "played",
        "role",
        "primary",
        "importance",
        "one",
        "author",
        "cited",
        "campanella",
        "close",
        "conjunction",
        "philosophy",
        "telesio",
        "marsilio",
        "ficino",
        "quoted",
        "particular",
        "passage",
        "ficino",
        "commentary",
        "plato",
        "especially",
        "timaeus",
        "symposium",
        "ennead",
        "plotinus",
        "attack",
        "aristotelian",
        "tradition",
        "campanella",
        "criticized",
        "doctrine",
        "form",
        "privation",
        "four",
        "element",
        "principle",
        "sublunary",
        "world",
        "matter",
        "privation",
        "derivation",
        "celestial",
        "heat",
        "friction",
        "sphere",
        "distinction",
        "natural",
        "violent",
        "motion",
        "culmination",
        "effort",
        "dismantle",
        "aristotelian",
        "system",
        "radical",
        "critique",
        "traditional",
        "cosmology",
        "regard",
        "nature",
        "heaven",
        "trajectory",
        "mechanism",
        "celestial",
        "movement",
        "parallel",
        "destructive",
        "side",
        "campanella",
        "argument",
        "constructive",
        "element",
        "consisted",
        "defending",
        "doctrine",
        "telesio",
        "philosophy",
        "according",
        "telesio",
        "derived",
        "modification",
        "resulting",
        "action",
        "two",
        "principle",
        "hot",
        "cold",
        "matter",
        "regard",
        "abstract",
        "en",
        "rationis",
        "entity",
        "existing",
        "mind",
        "rather",
        "inert",
        "corporeal",
        "mass",
        "dark",
        "entirely",
        "formless",
        "capable",
        "receiving",
        "form",
        "subtle",
        "detailed",
        "argumentative",
        "structure",
        "eight",
        "weighty",
        "disputationes",
        "emerges",
        "powerful",
        "unitary",
        "notion",
        "centrality",
        "nobility",
        "primacy",
        "solar",
        "heat",
        "connects",
        "being",
        "confers",
        "life",
        "within",
        "context",
        "assimilation",
        "solar",
        "heat",
        "world",
        "soul",
        "acquires",
        "particular",
        "significance",
        "theme",
        "heart",
        "third",
        "disputation",
        "entitled",
        "de",
        "coelo",
        "et",
        "mundo",
        "heaven",
        "world",
        "campanella",
        "transcribes",
        "verbatim",
        "passage",
        "ficino",
        "commentary",
        "plotinus",
        "ennead",
        "dwells",
        "world",
        "soul",
        "vital",
        "sensual",
        "breath",
        "philosophia",
        "sensibus",
        "demonstrata",
        "pp",
        "ficino",
        "associate",
        "hot",
        "breath",
        "penetrates",
        "infused",
        "entire",
        "world",
        "wellknown",
        "line",
        "virgil",
        "aeneid",
        "vi",
        "spiritus",
        "intus",
        "alit",
        "spirit",
        "nourishes",
        "within",
        "also",
        "divine",
        "spirit",
        "genesis",
        "spirit",
        "god",
        "moved",
        "upon",
        "face",
        "water",
        "heaven",
        "composed",
        "breath",
        "divine",
        "word",
        "vivifies",
        "nourishes",
        "everything",
        "campanella",
        "set",
        "philosophy",
        "nature",
        "inspired",
        "telesio",
        "reworked",
        "original",
        "manner",
        "successive",
        "treatise",
        "epilogo",
        "magno",
        "great",
        "epilogue",
        "translated",
        "latin",
        "would",
        "become",
        "physiologia",
        "first",
        "four",
        "part",
        "philosophia",
        "realis",
        "first",
        "published",
        "frankfurt",
        "three",
        "part",
        "entitled",
        "ethica",
        "politica",
        "oeconomica",
        "second",
        "definitive",
        "edition",
        "published",
        "paris",
        "four",
        "part",
        "particular",
        "first",
        "accompanied",
        "numerous",
        "lengthy",
        "quaestiones",
        "concerning",
        "specific",
        "problem",
        "view",
        "ancient",
        "modern",
        "philosopher",
        "discussed",
        "campanella",
        "begin",
        "physiologia",
        "stating",
        "first",
        "beingmost",
        "powerful",
        "wise",
        "bestdecided",
        "create",
        "world",
        "defined",
        "effigy",
        "image",
        "infinite",
        "good",
        "unfolded",
        "almost",
        "infinite",
        "space",
        "effigy",
        "placed",
        "occurred",
        "outset",
        "enduring",
        "vicissitude",
        "thing",
        "call",
        "time",
        "image",
        "eternity",
        "flow",
        "space",
        "defined",
        "primary",
        "substance",
        "seat",
        "immobile",
        "incorporeal",
        "capacity",
        "able",
        "receive",
        "body",
        "homogeneous",
        "human",
        "term",
        "high",
        "low",
        "behind",
        "front",
        "right",
        "left",
        "refer",
        "body",
        "placed",
        "within",
        "world",
        "exist",
        "would",
        "imagine",
        "space",
        "empty",
        "reality",
        "however",
        "desire",
        "fullness",
        "endowed",
        "attractive",
        "force",
        "abhors",
        "remaining",
        "empty",
        "body",
        "turn",
        "enjoy",
        "mutual",
        "contact",
        "hate",
        "void",
        "separate",
        "physiologia",
        "opera",
        "latina",
        "ii",
        "pp",
        "within",
        "space",
        "god",
        "place",
        "matter",
        "clear",
        "contrast",
        "conception",
        "aristotle",
        "averroes",
        "defined",
        "privation",
        "pure",
        "en",
        "rationis",
        "regarded",
        "campanella",
        "physical",
        "entity",
        "deprived",
        "form",
        "shape",
        "action",
        "capable",
        "extended",
        "divided",
        "united",
        "assuming",
        "shape",
        "wax",
        "receive",
        "impression",
        "seal",
        "corporeal",
        "mass",
        "god",
        "insert",
        "heat",
        "coldness",
        "two",
        "active",
        "principle",
        "selfdisseminating",
        "incorporeal",
        "subsist",
        "body",
        "conflict",
        "deriving",
        "fact",
        "want",
        "take",
        "possession",
        "occupy",
        "greatest",
        "possible",
        "quantity",
        "matter",
        "come",
        "two",
        "primary",
        "body",
        "element",
        "world",
        "heaven",
        "extremely",
        "hot",
        "subtle",
        "mobile",
        "since",
        "formed",
        "matter",
        "transformed",
        "heat",
        "earth",
        "composed",
        "matter",
        "made",
        "immobile",
        "dark",
        "dense",
        "cold",
        "clash",
        "heaven",
        "earth",
        "heat",
        "coldnessinstruments",
        "craftsman",
        "god",
        "us",
        "produce",
        "infinite",
        "mode",
        "creative",
        "wisdom",
        "wondrous",
        "effigy",
        "worldgives",
        "birth",
        "individual",
        "entity",
        "mean",
        "principle",
        "campanella",
        "explains",
        "every",
        "aspect",
        "natural",
        "world",
        "celestial",
        "meteorological",
        "phenomenon",
        "formation",
        "water",
        "composition",
        "mineral",
        "plant",
        "animal",
        "human",
        "being",
        "analyzes",
        "particular",
        "attention",
        "origin",
        "organism",
        "complex",
        "part",
        "lie",
        "especially",
        "attenuated",
        "celestial",
        "heat",
        "spiritus",
        "consisting",
        "matter",
        "made",
        "extremely",
        "subtle",
        "solar",
        "heat",
        "warm",
        "breath",
        "thanks",
        "tenuousness",
        "motion",
        "able",
        "separate",
        "portion",
        "matter",
        "find",
        "enclosed",
        "act",
        "unable",
        "exhale",
        "corporeality",
        "order",
        "return",
        "heaven",
        "origin",
        "plasma",
        "construct",
        "way",
        "suit",
        "need",
        "avoid",
        "external",
        "danger",
        "threatening",
        "within",
        "organ",
        "guarantee",
        "conservation",
        "life",
        "proud",
        "medical",
        "knowledge",
        "among",
        "work",
        "one",
        "entitled",
        "medicina",
        "made",
        "eight",
        "book",
        "published",
        "lyon",
        "treatise",
        "campanella",
        "delighted",
        "highlighting",
        "wondrous",
        "structure",
        "human",
        "body",
        "part",
        "revealing",
        "function",
        "purpose",
        "specific",
        "particular",
        "individual",
        "organ",
        "harmonize",
        "marvelous",
        "order",
        "totality",
        "confirm",
        "presence",
        "divine",
        "craftsmanship",
        "every",
        "fiber",
        "natural",
        "reality"
    ]
}