{
    "main_text": "Cancer as a Byproduct: Evolution, Development, and Aging\n4. The Science-Value Interface and Aims of Cancer Research\n\nThere are several ways in which biomedical and public health research\non cancer intersects with debates about the proper role of values in\nscience. First, epidemiological and toxicological research is used in\nsupport of regulatory policy and toxic tort law. Decisions about when\nand what is “carcinogenic” have significant public health\nimport, and thus raise a variety of philosophical questions about\nevidence, values, risk, precaution, and communication of scientific\nresults (Mayo & Hollander 1994; Cranor, 1993, 2006, 2011, 2017;\nValles, 2018; Elliott & Resnick, 2014; John, 2018).\n\nEvidence for claims about carcinogenicity is often indirect, and\nunderdetermination is rife. In establishing claims about\ncarcinogenicity, there are a variety of choices regarding methodology,\nsource and type of evidence, and standards of significance (Elliott,\n2011; Broadbent, 2013; Valles, 2018, 2021). Even optimally done\nepidemiological studies, or toxicological studies at best lend high\nprobability to claims about health risk, in part because such studies\noften “black box” the intermediate causes. In such\ncontexts, there is “inductive risk”, or the risk of error\neither in over- or under-estimation of actual risk of cancer, and\nthus, room for values to play a role. Several philosophers of science\nhave weighed in on this matter of when and whether values ought to\nplay a role in such contexts, whether precautionary judgments are\nappropriate, as well as whether “opening” the black box is\nalways ideal (see, e.g., Mayo 1988; Douglas 2000, 2009; Brown 2013;\nSteel 2007, 2010, 2015; Elliott 2011; Shrader-Frechette 1993, 1994,\n2002, 2004; Mitchell 2009; Russo & Williamson, 2007; Broadbent,\n2011; DiMarco, 2021). As one might imagine, there is also a\nsubstantive history of debate among epidemiologists, public health\nscientists, scholars of the law, around when we have good reason to\nclaim that X or Y is carcinogenic, or what counts as good evidence,\ngoing back to the dispute between Doll and Hill and their detractors\nregarding the causal link between smoking and lung cancer (Hill,\n1965). For a compelling history of this literature, see, e.g., Proctor\n(1996), or more recently, Oreskes and Conway (2011), or Shostack\n(2013). Problems of underdetermination are no less rife in the context\nof assessments of “effectiveness” of cancer screening and\nprevention (see, e.g., Solomon 2015; Stegenga 2018; Plutynski 2017)\n(For a discussion, see the entry on\n philosophy of medicine.)\n\nSecond, much of basic cancer research—e.g., research on the cell\nand molecular bases of the disease—is supported by federal\nfunds, which are allocated in the hopes that such research will\n(eventually) yield better health outcomes. Yet, the relationship\nbetween “bench and bedside” is indirect, and shaped by\neconomic, social, and political factors, some more pernicious than\nothers (Prasad, 2020; Tabery, 2023). So, it’s unclear whether\nand how “basic” cancer science ought to be evaluated in\nlight of whether or how it leads to better health outcomes. However,\nthis is hard to avoid, particularly when so many lives depend upon a\nresearch program’s promised outcomes.\n\nThis whole matter is complicated by the fact that the study of cancer\nis itself big business. Cancer pharmaceuticals, medical devices, and\ncancer research are major drivers of the economy. The average annual\nprice for a new cancer medicine is rising rapidly and now approaches\n$150,000 (Booth, et. al., 2022); and some estimate cost of cancer care\nis globally to be in the region of $458 billion by 2030 (Callahan\n& Darzi, 2015). These high costs brings into focus several ethical\nconcerns regarding the economics of cancer prevention and care.\nCritics have raised questions about the quality of research and\nregulatory standards, economic incentives misaligned with promoting\noverall quality of life, misleading representation of public health\nand clinical information, and rising costs and downstream impact on\nunderserved populations, and equity in access to care (World Health\nOrganization, 2022). Several have expressed concerns regarding whether\nthe vast funds invested in cancer research—at least during the\npast 25 years or so—have shifted mortality rates sufficiently to\nwarrant the expense. According to one line of thinking, the centrality\nof cancer in biomedical research is a product of several historical,\neconomic, institutional, and social forces in combination, some of\nwhich are self-perpetuating, primarily driving by commercial interests\n(Proctor 1996; Fujimura 1996; Clarke & Fujimura 2014; World Health\nOrganization, 2022). Ever since Nixon’s 1971 call for a\n“war” on cancer, advertised implications for cancer\ntreatment or prevention have been used to bolster much of basic\nresearch into genetics, genomics, and cell and molecular biology,\nfostering investment in biotechnology. Some have argued that this has\nled to an unduly excessive, or disproportionate fear of cancer as a\ndisease, an excess of anxiety, and perhaps also unnecessary or\nunwarranted use of medical screening and testing (Aronowitz 2007,\n2009, 2015; Welch & Black, 2010).\n\nOn the other hand, cancer research has led to important innovations in\nscience and medicine with impacts much wider than cancer itself. In\nthe U.S., excessive regulations on research by, e.g., the FDA on the\ndesign and conduct of clinical trials for approval of drugs, some\nargue, may in part be slowing research. Some argue that we ought to\nlift restrictions on such tests for novel and more\n“precise” (or targeted) drugs that might benefit very few.\nSuch matters are of course intertwined with larger debates around when\nand whether we have sufficient evidence to claim that, e.g., this or\nthat mode of intervention is effective (Ashcroft 2002; Cartwright\n2011; Howick 2011; Stegenga 2015; Teira 2011; Teira, et al. 2015;\nGonzález-Moreno, et al. 2015; Deaton & Cartwright\n2018).\n\nOne area where such questions are particularly fraught is\n“precision” medicine. In service of this end, several\ntools and technologies have been developed. One is simply sequencing\nof individual cancers, with the idea that a more fine-grained analysis\nof the molecular and genomic features of each cancer promotes more\neffective prediction and control of cancer risk, enables detection of\ncancers at much earlier stages, and promotes less debilitating, more\ntargeted treatments. But it comes with the risk of overdiagnosis and\novertreatment (Vogt, et. al., 2019). With sensitive technologies and\nmore fine-tuned risk information, the practice of medicine has been\nshifting from diagnosis (and treatment) of disease, to constant\nsurveillance and intervention on disease risk, as well as higher rates\nof overdiagnosis and overtreatment (diagnosis and treatment for a\nproto-disease state that may never have progressed in the lifetime of\na patient) (Welch, et al. 2011; Esserman, et al. 2014). Other tools of\nprecision medicine include models such as organoids and\npatient-derived xenografts (PDXs). Organoids are 3D cultures developed\nfrom tumor samples of individual patients, in service of developing\npatient-specific drug screening (Huang et al. 2015; Ooft et al. 2019;\nSachs et al. 2018). PDXs are immunodeficient mice engrafted with human\ntumors that are used as surrogate models. Use of these technologies\nhas both immense potential benefit and carries some risks. On the one\nhand, attention to the particular genetic variation unique to a given\npatient variation will presumably allow for more targeted, effective\nprognoses and therapies (Boniolo, 2017). On the other hand, use of\nthese tools involves both setting aside the assumption that sample\nsize is an important component in clinical trials, and assuming or\nhoping that the organoid or mouse model is representational of the\ntarget (Lillie et al. 2011; Green et al. 2019, 2021, 2022). Some\nquestion whether the methods of testing new drugs in oncology suffer\nfrom systematic problems, leading to less successful outcomes than\nhoped or advertised. In particular, some have argued that surrogate\nendpoints used in many clinical trials fail to predict which drugs\nimprove overall survival, accelerated approval is granted for drugs\nthat do not meet the criterion of serving an “unmet” need,\napproval is granted for drugs that are tested against poor\ncomparators, in unrepresentative populations, or approved for minimal\nimprovements in surrogate outcomes, enthusiasts hype drugs before\ndemonstrated to be effective, and that there is a revolving door\nbetween the FDA and the very same pharmaceutical companies that seek\napproval for new drugs. Moreover, it seems pharmaceutical prices are\nnot determined by clinical benefit, nor are they justified by research\nand development costs (Prasad, 2020; Prasad & Gale 2016; Prasad,\net al. 2016; Beneduce & Bertolasao, 2022). Such skepticism should\nraise genuine concerns—especially given the hopes of patients\nand families hanging upon the promises of such treatments, and the\noverall costs of both cancer care, and precision medicine research.\nHowever, there are several solutions that have been proposed (Prasad,\n2020), such as eliminating consulting payments from the pharmaceutical\nindustry to researchers, conducting trials to study outcomes that\nmatter to patients (such as overall mortality, as opposed to surrogate\noutcomes), comparing tested drugs to the current standard of care (as\nopposed to poor comparators), testing drugs in populations that are\naverage type of people with cancer (not exceptionally healthy), or by\nand large promoting more affordable drugs (globally).\n\nIn sum, current practices of cancer research, screening and treatment\nraise a number of both methodological and ethical questions: Is\ninvestment in precision medicine likely to yield the benefits\npromised? When is medical intervention on disease risk (rather than\ndisease itself) unduly excessive? What exactly does it mean to speak\nof effective medical intervention? Is overdiagnosis and overtreatment\na serious harm, or is it simply an inevitable byproduct of an\notherwise effective strategy—treating disease risk? How ought\nclinicians to communicate about risk and benefit of novel targeted\ninterventions to patients, especially where there are gray areas of\nbenefit and harm? Are the (frequently) excessive costs of, and\ninequitable access to, cancer care, matters of justice?\n\nCancer research—and especially the hope and hype surrounding\nprecision medicine—provides a focused lens through which to\nconsider problems central to critical examination of the concepts and\nmethods of the biomedical sciences. That is, cancer and the scientific\nstudy of cancer illustrate challenges facing disease classification,\nfuzzy borders between disease versus health, the problems with genetic\nessentialism, the ever-present reference class problem and ever\npromised solutions, as well as specific ways in which\nunderdetermination of evidence in biomedicine shapes matters of\njustice in public health. Moreover, it provides a case study in how\nmatters of evidence, disease status, and questions of values and\njustice are deeply intertwined.\n",
    "section_title": "4. The Science-Value Interface and Aims of Cancer Research",
    "entry_title": "Cancer",
    "hierarchy_title": "Cancer || Cancer as a Byproduct: Evolution, Development, and Aging",
    "tokenized_text": [
        "cancer",
        "byproduct",
        "evolution",
        "development",
        "aging",
        "sciencevalue",
        "interface",
        "aim",
        "cancer",
        "research",
        "several",
        "way",
        "biomedical",
        "public",
        "health",
        "research",
        "cancer",
        "intersects",
        "debate",
        "proper",
        "role",
        "value",
        "science",
        "first",
        "epidemiological",
        "toxicological",
        "research",
        "used",
        "support",
        "regulatory",
        "policy",
        "toxic",
        "tort",
        "law",
        "decision",
        "carcinogenic",
        "significant",
        "public",
        "health",
        "import",
        "thus",
        "raise",
        "variety",
        "philosophical",
        "question",
        "evidence",
        "value",
        "risk",
        "precaution",
        "communication",
        "scientific",
        "result",
        "mayo",
        "hollander",
        "cranor",
        "valles",
        "elliott",
        "resnick",
        "john",
        "evidence",
        "claim",
        "carcinogenicity",
        "often",
        "indirect",
        "underdetermination",
        "rife",
        "establishing",
        "claim",
        "carcinogenicity",
        "variety",
        "choice",
        "regarding",
        "methodology",
        "source",
        "type",
        "evidence",
        "standard",
        "significance",
        "elliott",
        "broadbent",
        "valles",
        "even",
        "optimally",
        "done",
        "epidemiological",
        "study",
        "toxicological",
        "study",
        "best",
        "lend",
        "high",
        "probability",
        "claim",
        "health",
        "risk",
        "part",
        "study",
        "often",
        "black",
        "box",
        "intermediate",
        "cause",
        "context",
        "inductive",
        "risk",
        "risk",
        "error",
        "either",
        "over",
        "underestimation",
        "actual",
        "risk",
        "cancer",
        "thus",
        "room",
        "value",
        "play",
        "role",
        "several",
        "philosopher",
        "science",
        "weighed",
        "matter",
        "whether",
        "value",
        "ought",
        "play",
        "role",
        "context",
        "whether",
        "precautionary",
        "judgment",
        "appropriate",
        "well",
        "whether",
        "opening",
        "black",
        "box",
        "always",
        "ideal",
        "see",
        "eg",
        "mayo",
        "douglas",
        "brown",
        "steel",
        "elliott",
        "shraderfrechette",
        "mitchell",
        "russo",
        "williamson",
        "broadbent",
        "dimarco",
        "one",
        "might",
        "imagine",
        "also",
        "substantive",
        "history",
        "debate",
        "among",
        "epidemiologist",
        "public",
        "health",
        "scientist",
        "scholar",
        "law",
        "around",
        "good",
        "reason",
        "claim",
        "x",
        "carcinogenic",
        "count",
        "good",
        "evidence",
        "going",
        "back",
        "dispute",
        "doll",
        "hill",
        "detractor",
        "regarding",
        "causal",
        "link",
        "smoking",
        "lung",
        "cancer",
        "hill",
        "compelling",
        "history",
        "literature",
        "see",
        "eg",
        "proctor",
        "recently",
        "oreskes",
        "conway",
        "shostack",
        "problem",
        "underdetermination",
        "le",
        "rife",
        "context",
        "assessment",
        "effectiveness",
        "cancer",
        "screening",
        "prevention",
        "see",
        "eg",
        "solomon",
        "stegenga",
        "plutynski",
        "discussion",
        "see",
        "entry",
        "philosophy",
        "medicine",
        "second",
        "much",
        "basic",
        "cancer",
        "researcheg",
        "research",
        "cell",
        "molecular",
        "base",
        "diseaseis",
        "supported",
        "federal",
        "fund",
        "allocated",
        "hope",
        "research",
        "eventually",
        "yield",
        "better",
        "health",
        "outcome",
        "yet",
        "relationship",
        "bench",
        "bedside",
        "indirect",
        "shaped",
        "economic",
        "social",
        "political",
        "factor",
        "pernicious",
        "others",
        "prasad",
        "tabery",
        "unclear",
        "whether",
        "basic",
        "cancer",
        "science",
        "ought",
        "evaluated",
        "light",
        "whether",
        "lead",
        "better",
        "health",
        "outcome",
        "however",
        "hard",
        "avoid",
        "particularly",
        "many",
        "life",
        "depend",
        "upon",
        "research",
        "program",
        "promised",
        "outcome",
        "whole",
        "matter",
        "complicated",
        "fact",
        "study",
        "cancer",
        "big",
        "business",
        "cancer",
        "pharmaceutical",
        "medical",
        "device",
        "cancer",
        "research",
        "major",
        "driver",
        "economy",
        "average",
        "annual",
        "price",
        "new",
        "cancer",
        "medicine",
        "rising",
        "rapidly",
        "approach",
        "booth",
        "et",
        "al",
        "estimate",
        "cost",
        "cancer",
        "care",
        "globally",
        "region",
        "billion",
        "callahan",
        "darzi",
        "high",
        "cost",
        "brings",
        "focus",
        "several",
        "ethical",
        "concern",
        "regarding",
        "economics",
        "cancer",
        "prevention",
        "care",
        "critic",
        "raised",
        "question",
        "quality",
        "research",
        "regulatory",
        "standard",
        "economic",
        "incentive",
        "misaligned",
        "promoting",
        "overall",
        "quality",
        "life",
        "misleading",
        "representation",
        "public",
        "health",
        "clinical",
        "information",
        "rising",
        "cost",
        "downstream",
        "impact",
        "underserved",
        "population",
        "equity",
        "access",
        "care",
        "world",
        "health",
        "organization",
        "several",
        "expressed",
        "concern",
        "regarding",
        "whether",
        "vast",
        "fund",
        "invested",
        "cancer",
        "researchat",
        "least",
        "past",
        "year",
        "sohave",
        "shifted",
        "mortality",
        "rate",
        "sufficiently",
        "warrant",
        "expense",
        "according",
        "one",
        "line",
        "thinking",
        "centrality",
        "cancer",
        "biomedical",
        "research",
        "product",
        "several",
        "historical",
        "economic",
        "institutional",
        "social",
        "force",
        "combination",
        "selfperpetuating",
        "primarily",
        "driving",
        "commercial",
        "interest",
        "proctor",
        "fujimura",
        "clarke",
        "fujimura",
        "world",
        "health",
        "organization",
        "ever",
        "since",
        "nixon",
        "call",
        "war",
        "cancer",
        "advertised",
        "implication",
        "cancer",
        "treatment",
        "prevention",
        "used",
        "bolster",
        "much",
        "basic",
        "research",
        "genetics",
        "genomics",
        "cell",
        "molecular",
        "biology",
        "fostering",
        "investment",
        "biotechnology",
        "argued",
        "led",
        "unduly",
        "excessive",
        "disproportionate",
        "fear",
        "cancer",
        "disease",
        "excess",
        "anxiety",
        "perhaps",
        "also",
        "unnecessary",
        "unwarranted",
        "use",
        "medical",
        "screening",
        "testing",
        "aronowitz",
        "welch",
        "black",
        "hand",
        "cancer",
        "research",
        "led",
        "important",
        "innovation",
        "science",
        "medicine",
        "impact",
        "much",
        "wider",
        "cancer",
        "us",
        "excessive",
        "regulation",
        "research",
        "eg",
        "fda",
        "design",
        "conduct",
        "clinical",
        "trial",
        "approval",
        "drug",
        "argue",
        "may",
        "part",
        "slowing",
        "research",
        "argue",
        "ought",
        "lift",
        "restriction",
        "test",
        "novel",
        "precise",
        "targeted",
        "drug",
        "might",
        "benefit",
        "matter",
        "course",
        "intertwined",
        "larger",
        "debate",
        "around",
        "whether",
        "sufficient",
        "evidence",
        "claim",
        "eg",
        "mode",
        "intervention",
        "effective",
        "ashcroft",
        "cartwright",
        "howick",
        "stegenga",
        "teira",
        "teira",
        "et",
        "al",
        "gonzálezmoreno",
        "et",
        "al",
        "deaton",
        "cartwright",
        "one",
        "area",
        "question",
        "particularly",
        "fraught",
        "precision",
        "medicine",
        "service",
        "end",
        "several",
        "tool",
        "technology",
        "developed",
        "one",
        "simply",
        "sequencing",
        "individual",
        "cancer",
        "idea",
        "finegrained",
        "analysis",
        "molecular",
        "genomic",
        "feature",
        "cancer",
        "promotes",
        "effective",
        "prediction",
        "control",
        "cancer",
        "risk",
        "enables",
        "detection",
        "cancer",
        "much",
        "earlier",
        "stage",
        "promotes",
        "le",
        "debilitating",
        "targeted",
        "treatment",
        "come",
        "risk",
        "overdiagnosis",
        "overtreatment",
        "vogt",
        "et",
        "al",
        "sensitive",
        "technology",
        "finetuned",
        "risk",
        "information",
        "practice",
        "medicine",
        "shifting",
        "diagnosis",
        "treatment",
        "disease",
        "constant",
        "surveillance",
        "intervention",
        "disease",
        "risk",
        "well",
        "higher",
        "rate",
        "overdiagnosis",
        "overtreatment",
        "diagnosis",
        "treatment",
        "protodisease",
        "state",
        "may",
        "never",
        "progressed",
        "lifetime",
        "patient",
        "welch",
        "et",
        "al",
        "esserman",
        "et",
        "al",
        "tool",
        "precision",
        "medicine",
        "include",
        "model",
        "organoids",
        "patientderived",
        "xenograft",
        "pdxs",
        "organoids",
        "d",
        "culture",
        "developed",
        "tumor",
        "sample",
        "individual",
        "patient",
        "service",
        "developing",
        "patientspecific",
        "drug",
        "screening",
        "huang",
        "et",
        "al",
        "ooft",
        "et",
        "al",
        "sachs",
        "et",
        "al",
        "pdxs",
        "immunodeficient",
        "mouse",
        "engrafted",
        "human",
        "tumor",
        "used",
        "surrogate",
        "model",
        "use",
        "technology",
        "immense",
        "potential",
        "benefit",
        "carry",
        "risk",
        "one",
        "hand",
        "attention",
        "particular",
        "genetic",
        "variation",
        "unique",
        "given",
        "patient",
        "variation",
        "presumably",
        "allow",
        "targeted",
        "effective",
        "prognosis",
        "therapy",
        "boniolo",
        "hand",
        "use",
        "tool",
        "involves",
        "setting",
        "aside",
        "assumption",
        "sample",
        "size",
        "important",
        "component",
        "clinical",
        "trial",
        "assuming",
        "hoping",
        "organoid",
        "mouse",
        "model",
        "representational",
        "target",
        "lillie",
        "et",
        "al",
        "green",
        "et",
        "al",
        "question",
        "whether",
        "method",
        "testing",
        "new",
        "drug",
        "oncology",
        "suffer",
        "systematic",
        "problem",
        "leading",
        "le",
        "successful",
        "outcome",
        "hoped",
        "advertised",
        "particular",
        "argued",
        "surrogate",
        "endpoint",
        "used",
        "many",
        "clinical",
        "trial",
        "fail",
        "predict",
        "drug",
        "improve",
        "overall",
        "survival",
        "accelerated",
        "approval",
        "granted",
        "drug",
        "meet",
        "criterion",
        "serving",
        "unmet",
        "need",
        "approval",
        "granted",
        "drug",
        "tested",
        "poor",
        "comparators",
        "unrepresentative",
        "population",
        "approved",
        "minimal",
        "improvement",
        "surrogate",
        "outcome",
        "enthusiast",
        "hype",
        "drug",
        "demonstrated",
        "effective",
        "revolving",
        "door",
        "fda",
        "pharmaceutical",
        "company",
        "seek",
        "approval",
        "new",
        "drug",
        "moreover",
        "seems",
        "pharmaceutical",
        "price",
        "determined",
        "clinical",
        "benefit",
        "justified",
        "research",
        "development",
        "cost",
        "prasad",
        "prasad",
        "gale",
        "prasad",
        "et",
        "al",
        "beneduce",
        "bertolasao",
        "skepticism",
        "raise",
        "genuine",
        "concernsespecially",
        "given",
        "hope",
        "patient",
        "family",
        "hanging",
        "upon",
        "promise",
        "treatment",
        "overall",
        "cost",
        "cancer",
        "care",
        "precision",
        "medicine",
        "research",
        "however",
        "several",
        "solution",
        "proposed",
        "prasad",
        "eliminating",
        "consulting",
        "payment",
        "pharmaceutical",
        "industry",
        "researcher",
        "conducting",
        "trial",
        "study",
        "outcome",
        "matter",
        "patient",
        "overall",
        "mortality",
        "opposed",
        "surrogate",
        "outcome",
        "comparing",
        "tested",
        "drug",
        "current",
        "standard",
        "care",
        "opposed",
        "poor",
        "comparators",
        "testing",
        "drug",
        "population",
        "average",
        "type",
        "people",
        "cancer",
        "exceptionally",
        "healthy",
        "large",
        "promoting",
        "affordable",
        "drug",
        "globally",
        "sum",
        "current",
        "practice",
        "cancer",
        "research",
        "screening",
        "treatment",
        "raise",
        "number",
        "methodological",
        "ethical",
        "question",
        "investment",
        "precision",
        "medicine",
        "likely",
        "yield",
        "benefit",
        "promised",
        "medical",
        "intervention",
        "disease",
        "risk",
        "rather",
        "disease",
        "unduly",
        "excessive",
        "exactly",
        "mean",
        "speak",
        "effective",
        "medical",
        "intervention",
        "overdiagnosis",
        "overtreatment",
        "serious",
        "harm",
        "simply",
        "inevitable",
        "byproduct",
        "otherwise",
        "effective",
        "strategytreating",
        "disease",
        "risk",
        "ought",
        "clinician",
        "communicate",
        "risk",
        "benefit",
        "novel",
        "targeted",
        "intervention",
        "patient",
        "especially",
        "gray",
        "area",
        "benefit",
        "harm",
        "frequently",
        "excessive",
        "cost",
        "inequitable",
        "access",
        "cancer",
        "care",
        "matter",
        "justice",
        "cancer",
        "researchand",
        "especially",
        "hope",
        "hype",
        "surrounding",
        "precision",
        "medicineprovides",
        "focused",
        "lens",
        "consider",
        "problem",
        "central",
        "critical",
        "examination",
        "concept",
        "method",
        "biomedical",
        "science",
        "cancer",
        "scientific",
        "study",
        "cancer",
        "illustrate",
        "challenge",
        "facing",
        "disease",
        "classification",
        "fuzzy",
        "border",
        "disease",
        "versus",
        "health",
        "problem",
        "genetic",
        "essentialism",
        "everpresent",
        "reference",
        "class",
        "problem",
        "ever",
        "promised",
        "solution",
        "well",
        "specific",
        "way",
        "underdetermination",
        "evidence",
        "biomedicine",
        "shape",
        "matter",
        "justice",
        "public",
        "health",
        "moreover",
        "provides",
        "case",
        "study",
        "matter",
        "evidence",
        "disease",
        "status",
        "question",
        "value",
        "justice",
        "deeply",
        "intertwined"
    ]
}