{
    "main_text": "Why the capability approach || \n2.2 for a discussion of real/substantive freedom.) A person’s ‘capability-set’ denotes the set of capabilities that he or she can choose from, while the term ‘basic capabilities’ refers either to “the innate equipment of individuals that is necessary for developing the more advanced capabilities”, such as the capability of speech and language, which is present in a newborn but needs to be fostered (Nussbaum 2000, 84), or to the freedom to do some basic things considered necessary for survival and to avoid or escape poverty or other serious deprivation (Sen 1992, 45, fn. 19). The relevance of basic capabilities is “not so much in ranking living standards, but in deciding on a cut-off point for the purpose of assessing poverty and deprivation” (Sen 1987b, 109).\nRecently, there has been a discussion within the capability literature about whether capabilities and functionings should be limited to only encompass positively valued doings and beings — such as according to a normative theory, those that we have reason to value, or those which promote some ultimate normative aim, such as human dignity or agency — or whether capabilities and functionings are value-neutral concepts that encompass not only normatively positive but also negative and neutral doings and beings (Byskov 2020; Robeyns 2017).\nWhy is the value-laden definition of capabilities problematic, according to its critics? First, if what counts as a capability is - by definition - normatively valuable then it risks ignoring that the value of a certain set of capabilities and functionings may also crucially depend on what it does not allow one to do or be or if it allows one to realize morally bad functionings, such as committing murder or polluting (Carter 2014; Dowding and Van Hees 2009). The value-laden conception of capabilities analytically excludes such non-normatively valued doings and beings from consideration, even though they may be just as important for the valuation of a capability-set as positively valued doings and beings.\nThe second reason why the value-laden definition might be problematic is because it excludes applications of the capability framework that are not concerned with what is valuable or not, and in some cases are concerned with morally bad capabilities. Two such capability applications are the conceptualization of phenomena and empirical purposes. For example, an empirical study that investigates the prevalence of domestic violence in a society would be concerned with whether husbands have capability (and functioning) of exercising such violence - a clear-cut case of a morally bad, yet highly relevant, capability. Thus, if the definition of capabilities and functionings is limited to only encompass normatively valuable or positive doings and beings, it excludes applications of the capability approach that are concerned with morally bad doings and beings and capability applications that are not concerned with whether capabilities are valuable or not.  \nIn contrast to the value-laden definition, proponents of the value-neutral definition of capabilities and functionings hold that doings and beings can be both positively and negatively valued as well as normatively neutral. A capability, according to this definition, is simply the freedom that people have to do or be certain things. Examples of capabilities that are usually evaluated positively are being well-nourished, sheltered, and educated, while examples of capabilities that are usually negatively valued are the ability to kill (Stewart and Deneulin 2002, 67), the ability to rape, being vulnerable to natural hazards, and being able to pollute (Holland 2008, 418; Nussbaum 2006, 166). Because both positively and negatively valued capabilities determine how well-off we are, it is necessary that capabilities are defined in a way that includes both.\nOther capabilities, meanwhile, are morally ambiguous or morally neutral. An example of a morally ambiguous capability is the capability to care or provide care, which can at different times either be rewarding, for example for parents caring for a child, and a burden, especially for women who often face societal pressure to take on the brunt of care activities. An example of a morally neutral capability is the ability to choose between two equally effective and sustainable brands of washing liquid (Williams 1987). On the face of it, whether we can choose between different brands of washing liquid is of little relevance if our purpose is to conceptualize healthcare or if we are interested in measuring a rural community’s access to infrastructure. However, that is not to say that prima facie irrelevant doings and beings cannot become relevant. If, for example, one brand of washing liquid were shown to have a positive or negative effect on health, then it would be relevant for a capabilitarian conceptualization of health to include the capability to choose between different brands of washing liquid. No doings and beings are a priori irrelevant and, according to its proponents, only a value-neutral definition of capabilities can accommodate for this fact.\nLastly, it should be noted that it is only necessary to adopt the value-neutral definition at the level of the capability approach as a general framework. Although the concept of capabilities is value-neutral, for more particular purposes and theories it will be useful and probably necessary to further specify by which criteria we make a selection of capabilities, according to that purpose or theory, and whether it will only focus on valuable doings and beings or also take bad capabilities into account (see section 3.2 for a discussion of the selection of capabilities).   \n2.2 Capabilities as real freedoms\nIt has been mentioned above that capabilities are defined as the real, or substantive, freedoms that people have to achieve certain doings and beings. A frequent misunderstanding in the secondary literature concerns the use of the term ‘freedom’. Especially in his later work, Sen often equates capabilities with freedoms, without always specifying in more detail what kind of freedoms he is referring to. Yet this equation can easily be misunderstood since, as Sen himself acknowledges, there are many kinds of freedom (some valuable, some detrimental, and some trivial) and ‘freedom’ means very different things to different people.\nOne important misunderstanding to get out of the way is that capabilities as freedoms refer exclusively to the “free market.” Sen (1993b) does argue that people have reason to value the freedom or liberty to produce, buy, and sell in markets. This point, however, is part of his more general work on development, and is a very different matter than the highly disputed question in economics and politics regarding the benefits and limits of the market as a system of economic production and distribution. Functionings and capabilities are conceptualizations of well-being achievements and well-being freedoms, and the question which economic institutions are the best institutional means to foster functionings and capabilities is both analytically but also politically a question that can only be settled after we first agree what economic outcomes we should be aiming at—and this is a question to which the capability approach gives a (partial) answer.\nYet if Sen and other capability scholars label capabilities as freedoms, then what kind of freedoms are capabilities? As Kaufman (2006a) has shown, understanding capability as an opportunity concept of freedom, rather than some other kind of freedom, may undermine mistaken critiques on Sen’s work. A careful reading of Sen’s work clarifies that capabilities are freedoms conceived as real opportunities (Sen 1985a, 3–4; 1985d, 201; 2002, chapter 20). \nReal freedom in this sense means that one has all the required means necessary to achieve that doing and being if one wishes to. That is, it is not merely the formal freedom to do or be something, but the substantial opportunity to achieve it. Someone might, for example, have the formal freedom to vote in elections in the sense that she has the right to do so and that no one will stop her from doing so, but she might lack the substantial possibility to vote because the closest voting station is 200 kilometers away and she does not own a car and does not have access to other means of transportation. Conversely, someone may be living close to the voting station but still may not have the real freedom to vote because females are not permitted to vote in that particular society or they risk bodily harm if exercising their formal voting rights. Capabilities are thus real freedoms in the sense that they are corrected for any potential impediments. Functionings simply denotes those capabilities that have been achieved whether voluntarily or by chance. For example, someone might have the real freedom to vote but chooses not to do so and thus does not have the functioning of voting.\nAnother question about freedom in the capability approach concerns whether, or the extent to which, it corresponds to other concepts of freedom within the philosophical literature, such as positive and negative freedom. While more research is needed in this regard, some scholars have argued that the concept of freedom in the capability approach most resembles the concept of freedom as non-domination within republicanism, albeit with some notable caveats and disagreement (Alexander 2010; List 2004; Pettit 2001; 2009; Sen 1983; 2001). \n",
    "section_title": "2.2 ",
    "entry_title": "The Capability Approach",
    "hierarchy_title": "The Capability Approach || Why the capability approach || ",
    "tokenized_text": [
        "capability",
        "approach",
        "discussion",
        "realsubstantive",
        "freedom",
        "person",
        "capabilityset",
        "denotes",
        "set",
        "capability",
        "choose",
        "term",
        "basic",
        "capability",
        "refers",
        "either",
        "innate",
        "equipment",
        "individual",
        "necessary",
        "developing",
        "advanced",
        "capability",
        "capability",
        "speech",
        "language",
        "present",
        "newborn",
        "need",
        "fostered",
        "nussbaum",
        "freedom",
        "basic",
        "thing",
        "considered",
        "necessary",
        "survival",
        "avoid",
        "escape",
        "poverty",
        "serious",
        "deprivation",
        "sen",
        "fn",
        "relevance",
        "basic",
        "capability",
        "much",
        "ranking",
        "living",
        "standard",
        "deciding",
        "cutoff",
        "point",
        "purpose",
        "assessing",
        "poverty",
        "deprivation",
        "sen",
        "b",
        "recently",
        "discussion",
        "within",
        "capability",
        "literature",
        "whether",
        "capability",
        "functioning",
        "limited",
        "encompass",
        "positively",
        "valued",
        "doings",
        "being",
        "according",
        "normative",
        "theory",
        "reason",
        "value",
        "promote",
        "ultimate",
        "normative",
        "aim",
        "human",
        "dignity",
        "agency",
        "whether",
        "capability",
        "functioning",
        "valueneutral",
        "concept",
        "encompass",
        "normatively",
        "positive",
        "also",
        "negative",
        "neutral",
        "doings",
        "being",
        "byskov",
        "robeyns",
        "valueladen",
        "definition",
        "capability",
        "problematic",
        "according",
        "critic",
        "first",
        "count",
        "capability",
        "definition",
        "normatively",
        "valuable",
        "risk",
        "ignoring",
        "value",
        "certain",
        "set",
        "capability",
        "functioning",
        "may",
        "also",
        "crucially",
        "depend",
        "allow",
        "one",
        "allows",
        "one",
        "realize",
        "morally",
        "bad",
        "functioning",
        "committing",
        "murder",
        "polluting",
        "carter",
        "dowding",
        "van",
        "hees",
        "valueladen",
        "conception",
        "capability",
        "analytically",
        "excludes",
        "nonnormatively",
        "valued",
        "doings",
        "being",
        "consideration",
        "even",
        "though",
        "may",
        "important",
        "valuation",
        "capabilityset",
        "positively",
        "valued",
        "doings",
        "being",
        "second",
        "reason",
        "valueladen",
        "definition",
        "might",
        "problematic",
        "excludes",
        "application",
        "capability",
        "framework",
        "concerned",
        "valuable",
        "case",
        "concerned",
        "morally",
        "bad",
        "capability",
        "two",
        "capability",
        "application",
        "conceptualization",
        "phenomenon",
        "empirical",
        "purpose",
        "example",
        "empirical",
        "study",
        "investigates",
        "prevalence",
        "domestic",
        "violence",
        "society",
        "would",
        "concerned",
        "whether",
        "husband",
        "capability",
        "functioning",
        "exercising",
        "violence",
        "clearcut",
        "case",
        "morally",
        "bad",
        "yet",
        "highly",
        "relevant",
        "capability",
        "thus",
        "definition",
        "capability",
        "functioning",
        "limited",
        "encompass",
        "normatively",
        "valuable",
        "positive",
        "doings",
        "being",
        "excludes",
        "application",
        "capability",
        "approach",
        "concerned",
        "morally",
        "bad",
        "doings",
        "being",
        "capability",
        "application",
        "concerned",
        "whether",
        "capability",
        "valuable",
        "contrast",
        "valueladen",
        "definition",
        "proponent",
        "valueneutral",
        "definition",
        "capability",
        "functioning",
        "hold",
        "doings",
        "being",
        "positively",
        "negatively",
        "valued",
        "well",
        "normatively",
        "neutral",
        "capability",
        "according",
        "definition",
        "simply",
        "freedom",
        "people",
        "certain",
        "thing",
        "example",
        "capability",
        "usually",
        "evaluated",
        "positively",
        "wellnourished",
        "sheltered",
        "educated",
        "example",
        "capability",
        "usually",
        "negatively",
        "valued",
        "ability",
        "kill",
        "stewart",
        "deneulin",
        "ability",
        "rape",
        "vulnerable",
        "natural",
        "hazard",
        "able",
        "pollute",
        "holland",
        "nussbaum",
        "positively",
        "negatively",
        "valued",
        "capability",
        "determine",
        "welloff",
        "necessary",
        "capability",
        "defined",
        "way",
        "includes",
        "capability",
        "meanwhile",
        "morally",
        "ambiguous",
        "morally",
        "neutral",
        "example",
        "morally",
        "ambiguous",
        "capability",
        "capability",
        "care",
        "provide",
        "care",
        "different",
        "time",
        "either",
        "rewarding",
        "example",
        "parent",
        "caring",
        "child",
        "burden",
        "especially",
        "woman",
        "often",
        "face",
        "societal",
        "pressure",
        "take",
        "brunt",
        "care",
        "activity",
        "example",
        "morally",
        "neutral",
        "capability",
        "ability",
        "choose",
        "two",
        "equally",
        "effective",
        "sustainable",
        "brand",
        "washing",
        "liquid",
        "williams",
        "face",
        "whether",
        "choose",
        "different",
        "brand",
        "washing",
        "liquid",
        "little",
        "relevance",
        "purpose",
        "conceptualize",
        "healthcare",
        "interested",
        "measuring",
        "rural",
        "community",
        "access",
        "infrastructure",
        "however",
        "say",
        "prima",
        "facie",
        "irrelevant",
        "doings",
        "being",
        "become",
        "relevant",
        "example",
        "one",
        "brand",
        "washing",
        "liquid",
        "shown",
        "positive",
        "negative",
        "effect",
        "health",
        "would",
        "relevant",
        "capabilitarian",
        "conceptualization",
        "health",
        "include",
        "capability",
        "choose",
        "different",
        "brand",
        "washing",
        "liquid",
        "doings",
        "being",
        "priori",
        "irrelevant",
        "according",
        "proponent",
        "valueneutral",
        "definition",
        "capability",
        "accommodate",
        "fact",
        "lastly",
        "noted",
        "necessary",
        "adopt",
        "valueneutral",
        "definition",
        "level",
        "capability",
        "approach",
        "general",
        "framework",
        "although",
        "concept",
        "capability",
        "valueneutral",
        "particular",
        "purpose",
        "theory",
        "useful",
        "probably",
        "necessary",
        "specify",
        "criterion",
        "make",
        "selection",
        "capability",
        "according",
        "purpose",
        "theory",
        "whether",
        "focus",
        "valuable",
        "doings",
        "being",
        "also",
        "take",
        "bad",
        "capability",
        "account",
        "see",
        "section",
        "discussion",
        "selection",
        "capability",
        "capability",
        "real",
        "freedom",
        "mentioned",
        "capability",
        "defined",
        "real",
        "substantive",
        "freedom",
        "people",
        "achieve",
        "certain",
        "doings",
        "being",
        "frequent",
        "misunderstanding",
        "secondary",
        "literature",
        "concern",
        "use",
        "term",
        "freedom",
        "especially",
        "later",
        "work",
        "sen",
        "often",
        "equates",
        "capability",
        "freedom",
        "without",
        "always",
        "specifying",
        "detail",
        "kind",
        "freedom",
        "referring",
        "yet",
        "equation",
        "easily",
        "misunderstood",
        "since",
        "sen",
        "acknowledges",
        "many",
        "kind",
        "freedom",
        "valuable",
        "detrimental",
        "trivial",
        "freedom",
        "mean",
        "different",
        "thing",
        "different",
        "people",
        "one",
        "important",
        "misunderstanding",
        "get",
        "way",
        "capability",
        "freedom",
        "refer",
        "exclusively",
        "free",
        "market",
        "sen",
        "b",
        "argue",
        "people",
        "reason",
        "value",
        "freedom",
        "liberty",
        "produce",
        "buy",
        "sell",
        "market",
        "point",
        "however",
        "part",
        "general",
        "work",
        "development",
        "different",
        "matter",
        "highly",
        "disputed",
        "question",
        "economics",
        "politics",
        "regarding",
        "benefit",
        "limit",
        "market",
        "system",
        "economic",
        "production",
        "distribution",
        "functioning",
        "capability",
        "conceptualization",
        "wellbeing",
        "achievement",
        "wellbeing",
        "freedom",
        "question",
        "economic",
        "institution",
        "best",
        "institutional",
        "mean",
        "foster",
        "functioning",
        "capability",
        "analytically",
        "also",
        "politically",
        "question",
        "settled",
        "first",
        "agree",
        "economic",
        "outcome",
        "aiming",
        "atand",
        "question",
        "capability",
        "approach",
        "give",
        "partial",
        "answer",
        "yet",
        "sen",
        "capability",
        "scholar",
        "label",
        "capability",
        "freedom",
        "kind",
        "freedom",
        "capability",
        "kaufman",
        "a",
        "shown",
        "understanding",
        "capability",
        "opportunity",
        "concept",
        "freedom",
        "rather",
        "kind",
        "freedom",
        "may",
        "undermine",
        "mistaken",
        "critique",
        "sen",
        "work",
        "careful",
        "reading",
        "sen",
        "work",
        "clarifies",
        "capability",
        "freedom",
        "conceived",
        "real",
        "opportunity",
        "sen",
        "a",
        "d",
        "chapter",
        "real",
        "freedom",
        "sense",
        "mean",
        "one",
        "required",
        "mean",
        "necessary",
        "achieve",
        "one",
        "wish",
        "merely",
        "formal",
        "freedom",
        "something",
        "substantial",
        "opportunity",
        "achieve",
        "someone",
        "might",
        "example",
        "formal",
        "freedom",
        "vote",
        "election",
        "sense",
        "right",
        "one",
        "stop",
        "might",
        "lack",
        "substantial",
        "possibility",
        "vote",
        "closest",
        "voting",
        "station",
        "kilometer",
        "away",
        "car",
        "access",
        "mean",
        "transportation",
        "conversely",
        "someone",
        "may",
        "living",
        "close",
        "voting",
        "station",
        "still",
        "may",
        "real",
        "freedom",
        "vote",
        "female",
        "permitted",
        "vote",
        "particular",
        "society",
        "risk",
        "bodily",
        "harm",
        "exercising",
        "formal",
        "voting",
        "right",
        "capability",
        "thus",
        "real",
        "freedom",
        "sense",
        "corrected",
        "potential",
        "impediment",
        "functioning",
        "simply",
        "denotes",
        "capability",
        "achieved",
        "whether",
        "voluntarily",
        "chance",
        "example",
        "someone",
        "might",
        "real",
        "freedom",
        "vote",
        "chooses",
        "thus",
        "functioning",
        "voting",
        "another",
        "question",
        "freedom",
        "capability",
        "approach",
        "concern",
        "whether",
        "extent",
        "corresponds",
        "concept",
        "freedom",
        "within",
        "philosophical",
        "literature",
        "positive",
        "negative",
        "freedom",
        "research",
        "needed",
        "regard",
        "scholar",
        "argued",
        "concept",
        "freedom",
        "capability",
        "approach",
        "resembles",
        "concept",
        "freedom",
        "nondomination",
        "within",
        "republicanism",
        "albeit",
        "notable",
        "caveat",
        "disagreement",
        "alexander",
        "list",
        "pettit",
        "sen"
    ]
}