{
    "main_text": "Moral Philosophy: The Two Levels of Wisdom || Divine Providence, Immortality of the Soul, and the Highest Good\n4.1 Divine Providence, Immortality of the Soul, and the Highest Good\n\nDespite the emphasis he places on the benefits of prudent action,\nCardano believes that real, lasting happiness can be possible only if\nwe demonstrate in a persuasive way that the human soul is immortal and\nthat God intervenes actively in the human world, sanctioning a\nprovidential regime of the world. Two principles, more than any other,\nunderlie Cardano’s moral philosophy: that the human soul is\nimmortal, and that universal order, being a direct emanation of the\nOne, governs all aspects of reality. Everything that happens has been\nplanned by God, and all that God has established can only be good.\nRegarding the immortality of the soul, Cardano maintains that, in\norder to lead a meaningful existence and act accordingly, people need\nto know whether there is life after death and whether the nature of\ntheir afterlife will depend on the way they behaved in this world. In\nhis opinion, Aristotle and the Stoics took the value of virtue for\ngranted. In actual life, human beings will never be persuaded that\nvirtue should be pursued for its own sake, unless they are convinced\nthat their soul is immortal (De utilitate, OO, II, 3). In\nthis sense, Cardano defends the immortality of the soul on strong\npragmatic grounds. Referring to Seneca’s renowned instructions\non how to cope with the thought of death, he points out that\nmeditating about death while maintaining that the soul is mortal is\nsimply absurd. In his eyes, Seneca is a bad rhetorician and an\nEpicurean in disguise, who exhorts us to die serenely while claiming\nthat there is nothing after death (De utilitate, OO, II, 10a;\nsee Giglioni 2012, 187).\n\nAs we have seen while examining his natural philosophy,\nCardano’s moral views assign a central role to the soul:\n“The soul is the most important thing we own; everything refers\nto it, for riches, honors, and health are nothing without a sound\nsoul” (De utilitate, OO, II, 10a). Mental\nself-awareness, in particular, is the principal argument through which\nCardano advocates the immortality of the soul, for a human being is\nthe same thing as his mind (homo animus est) (De\nutilitate, OO, II, 12; on Cardano’s notion of the mind, see\nGiglioni 2005–2007; García Valverde 2013). The same\nemphasis on mental awareness can be found in Cardano’s moral\ninvestigations, for in his opinion human beings cannot understand what\nthe ends of their actions are if they lack a clear knowledge of\nthemselves (De utilitate, OO, II, 2). The highest good for\nthem can only lie in those attributes and activities that are part of\ntheir minds (quae animo coniuncta sunt) (De\nutilitate, OO, II, 27a). In this sense, the relationship between\ntranquillity and awareness is biunique: human beings can be peaceful\nonly when they know what the highest good is and know that they have\nattained it (Theonoston, OO, II, 303b). According to the\nHermit’s definition of tranquillity in Theonoston,\ntranquillitas coincides with securitas, that is, a\ncondition of unbreakable inner peace, free from cares and anxiety, and\nit is a level of wisdom that would even suit God. In this respect,\ntrue tranquillity for human beings coincides with their being\n“assimilated” to God, so that, when this condition of\nserenity is reached, nothing is any longer felt as lacking in meaning\nand substance. This level of happiness is a “kind of\npleasure” that derives from the awareness of “being in the\npossession of goods” (Theonoston, OO, II, 302a; De\noptimo vitae genere, OO, I, 488b). Intellectual pleasure should\nnever be a monstrum, that is to say, a hybrid creature\nresulting from combining the goods of reason with those of the body\nand external luck (Theonoston, OO, II, 313b–314a).\n\nBy doing so, Cardano provides a definition of happiness which is\ninclusive of both knowledge and pleasure. Happiness consists in a\n“perception of pleasure” that is great (magna),\nfull (plena), pure (pura), untroubled\n(secura), and safe (tuta) (De utilitate,\nOO, II, 37b; Theonoston, OO, II, 305b; De libris\npropriis, OO, I, 76b; ed. Maclean, 212–213). In\nTheonoston, happiness is said to coincide with a kind of\ninner composure understood not in terms of lack of sensibility\n(indolentia), but as a condition of mental vigour stemming\nfrom the contemplation of the true nature of things. If tranquillity\nconsisted in mere refractoriness to unsettling experiences, the\nimpassive state of a stone should then be viewed as the best condition\n(Theonoston, OO, II, 299b, 305b, 313b). By contrast, ethical\npeace rests on a state of cognitive tension and focus. In ways that\nremind us of the sea and the air, undisturbed calm (tranquilla\nquies) is always accompanied by a current of “light\nmotion,” i.e., a state of balance between opposite conditions\n“which does not unsettle, but delights us.”\nCardano’s tranquillitas is therefore not the same as\nabsolute rest: “in its state of highest tranquillity, our soul\nis as it were tremulous and breathing” (Theonoston, OO,\nII, 300a, 305b). The incessant vitality of our being demonstrates that\n“the matter we are made of, being of a celestial origin,\nproduced and entwined with motion, does not enjoy rest, but thrives on\nmotion,” a motion that, in the final analysis, is no bodily\nactivity, but an expression of knowledge and intellect\n(Theonoston, OO, II, 304a). True tranquillity results from a\ncondition of inviolable self-fulfilment (securitas) based on\nresources that are in our power (in nostra potestate esse).\nCardano is not convinced by the Senecan view of tranquillity as a\nbalanced active life (vita actuosa), or by Socrates’s\nkind of ‘engaged’ tranquillity; in both cases, their\nbehaviour is for Cardano symptomatic of ambition rather than being the\nindication of a truly committed philosophical life\n(Theonoston, OO, II, 306b). Finally, Cardano rejects the\nideals of tranquillity championed by Plutarch, Antoninus and Cicero,\nviewed as models of ethical escapism devised by men who in their life\nnever managed to reach a condition of stable serenity\n(Theonoston, OO, II, 305a).\n\nIn outlining his views about the nature of the good, Cardano is\nfollowing a deliberately eclectic approach. He combines the Stoic\nconception of virtue with Epicurus’ emphasis on indifference\n(indolentia), Aristotle’s notion of virtuous life with\nAverroes’ characterization of happiness as the highest level of\nknowledge accessible to human beings. He justifies his eclectic\nposition by arguing that philosophers who were so clever in their\nfields are likely to have come up with closely related ideas and that\ntherefore “two or more of their opinions can converge into\none” (De utilitate, OO, II, 24b). From Socrates, for\ninstance, Cardano draws the principle that only wise people can be\ntruly happy because virtue lies in knowledge (De utilitate,\nOO, II, 90b). From medical authors, he borrows the view that pleasure\nalways follows release from a condition of tension or pain (De\nutilitate, OO, II, 28a). Following traditional argumentative\npatterns in moral philosophy, Cardano distinguishes among goods of the\nmind (virtues), goods of the body (health, longevity), and goods of\nfortune. Among the goods of fortune, Cardano lists finding the right\nwife, a lasting fame, and a painless death (De utilitate, OO,\nII, 19b). Goods of the body, such as enjoying good health and\nfollowing a healthy regimen, are also part of one’s happiness\n(De utilitate, OO, II, 19a; on Cardano’s notion of\nhealth, see Siraisi, 70–90).\n\nStrictly speaking, goods and ills are values. As such, they transcend\nthe level of nature and therefore cannot be treated as if they were\nnatural or against nature: “Goods and ills reside in the soul;\nfaculties and defects in the body; helps and impediments in fortune\nand its occurrences” (Theonoston, OO, II, 314b). In\ngeneral terms, Cardano defines the good as “what is longed for\nby the majority of human beings,” such as health, wealth,\nfriends, glory, offspring and wisdom. In a more specific sense\n(simpliciter), good is what is everlasting\n(perpetuum), safe (securum), and unchangeable\n(immutabile) (De utilitate, OO, II, 23ab). In order\nto achieve a stable condition of inner peace people need to commit to\na good that cannot be taken away from them. Ultimately, since only God\nhas all the requisites to be this kind of imperishable good, the more\ngenuine meaning of good is that which brings us closer to God or make\nus similar to Him (Theonoston, OO, II, 307b–308a,\n313b). The difference between human beings and God is that in God the\ngood (bonum) coincides entirely with self-preservation\n(vita incolumis), whereas in human beings these two\nconditions are generally separate. Human beings need to take care of\ntheir life and aim at a life that is marked by reason. There cannot be\nany discourse on happiness where the primary requisites for life are\nlacking (due to mental illness or death) (Theonoston, OO, II,\n309b).\n\nGoods of the mind are virtues. By virtue, Cardano means the principle\nthat teaches human beings to behave in the best way towards God,\nanimals and our fellow human beings. Hence the key virtues are sense\nof duty (pietas), compassion (humanitas), and\nkindness (benignitas) (Theonoston, OO, II, 312ab).\nGiven their importance, virtues are among the foundations of human\naction: “by its nature, virtue is eternal and a divine good in\nus; all the rest rots in time and depends on circumstances”\n(De utilitate, OO, II, 21a. See ibid., 38b) . Emanating from\nthe innermost part of our rational soul, virtues have the power to\nretroact on our mind, thus fortifying and safeguarding its faculties.\nThe most prophylactic among virtues are fortitude, prudence and\nmoderation, and they result from the combined actions of nature, habit\nand reason, establishing a delicate balance between control of natural\nimpulses (impetus naturae), education, and the process of\ndecision making.\n\nAs already said, Cardano’s moral philosophy rests on a series of\ninterrelated principles which also play a key foundational role in\nnatural philosophy: that the soul is immortal; that incorporeal lives\nare everlasting; and that mental awareness is the defining\ncharacteristic of the soul. Since the intellect is the only thing that\nhumans can boast about themselves as being truly immortal,\nintellectual self-knowledge is regarded by Cardano as the highest good\nthat a human being may ever attain. Inevitably, this assumption\nre-proposes the Averroist conundrum about whether the mind belongs to\nhumankind as a whole or it informs the life and knowledge of each\nindividual human being. Cardano seems to suggest that the mind\ntranscends individual human beings ([mens] superior est\nhomini), for happiness coincides with eternal life: “he who\ndoes not live long cannot be happy for long” (De\nutilitate, OO, II, 23ab; on Averroism in Cardano, see\nGarcía Valverde 2013). There cannot be happiness in human life\nif there is no afterlife for the soul. On this point, Cardano follows\nSt Paul’s argument in his Letter to the Romans (8:\n20–22):\n\nIf our soul did not survive death, we would be much unhappier than\nanimals are. For, besides the fact that no animal, apart from the\nhuman being, knows that it is going to die, all non human animals\n(bruta) enjoy some happiness for the very fact that they\nexist, since they live as if they were to live forever, and therefore\nthey participate in eternal bliss. Only human beings are separated\nfrom eternity, even in their thought, for not only do they know that\nthey can die, but they also are aware that they will inevitably die,\nand die within a pre-established time (De utilitate, OO, II,\n24a).\n\n\nCardano’s reflections on mental happiness, assimilation to God,\nand universal intelligibility should be read against the background of\ncontemporary discussions about the Averroist notion of intellectual\nbeatitude. There is no doubt that, when Cardano characterizes the\nhighest good as the union of the soul with God, his definition is full\nof Aristotelian and Averroistic resonances. The summum bonum,\nhe argues in De utilitate ex adversis capienda, is “to\nbe assimilated to the highest good,” i.e., God. Unlike other\nkinds of love, love of God is “honest” and\n“safe,” for its object never deserts the seeking soul\n(De utilitate, OO, II, 6, 25a. 500a; De sapientia,\nOO, I, 500–501; ed. Bracali, 30–36). Elsewhere,\nCardano’s definition of summum bonum is suppler and\nimplies such components as wisdom (sapientia), virtue\n(especially fortitude and prudence), and progeny: wisdom is\ndistinctively human; expressions of fortitude and prudence can also be\nseen in several animals; to have children, finally, is a prerogative\nthat belongs to almost all living beings. It is a sort of pyramidal\nmodel of virtue, with fertility at the basis and wisdom at the top\n(only very few people can reach wisdom) (De utilitate, OO,\nII, 25b; Theonoston, OO, II, 302b; on Cardano’s views\non virtue, see Ingegno 1980, 318–76).\n",
    "section_title": "4.1 Divine Providence, Immortality of the Soul, and the Highest Good",
    "entry_title": "Girolamo [Geronimo] Cardano",
    "hierarchy_title": "Girolamo [Geronimo] Cardano || Moral Philosophy: The Two Levels of Wisdom || Divine Providence, Immortality of the Soul, and the Highest Good",
    "tokenized_text": [
        "moral",
        "philosophy",
        "two",
        "level",
        "wisdom",
        "divine",
        "providence",
        "immortality",
        "soul",
        "highest",
        "good",
        "divine",
        "providence",
        "immortality",
        "soul",
        "highest",
        "good",
        "despite",
        "emphasis",
        "place",
        "benefit",
        "prudent",
        "action",
        "cardano",
        "belief",
        "real",
        "lasting",
        "happiness",
        "possible",
        "demonstrate",
        "persuasive",
        "way",
        "human",
        "soul",
        "immortal",
        "god",
        "intervenes",
        "actively",
        "human",
        "world",
        "sanctioning",
        "providential",
        "regime",
        "world",
        "two",
        "principle",
        "underlie",
        "cardano",
        "moral",
        "philosophy",
        "human",
        "soul",
        "immortal",
        "universal",
        "order",
        "direct",
        "emanation",
        "one",
        "governs",
        "aspect",
        "reality",
        "everything",
        "happens",
        "planned",
        "god",
        "god",
        "established",
        "good",
        "regarding",
        "immortality",
        "soul",
        "cardano",
        "maintains",
        "order",
        "lead",
        "meaningful",
        "existence",
        "act",
        "accordingly",
        "people",
        "need",
        "know",
        "whether",
        "life",
        "death",
        "whether",
        "nature",
        "afterlife",
        "depend",
        "way",
        "behaved",
        "world",
        "opinion",
        "aristotle",
        "stoic",
        "took",
        "value",
        "virtue",
        "granted",
        "actual",
        "life",
        "human",
        "being",
        "never",
        "persuaded",
        "virtue",
        "pursued",
        "sake",
        "unless",
        "convinced",
        "soul",
        "immortal",
        "de",
        "utilitate",
        "oo",
        "ii",
        "sense",
        "cardano",
        "defends",
        "immortality",
        "soul",
        "strong",
        "pragmatic",
        "ground",
        "referring",
        "seneca",
        "renowned",
        "instruction",
        "cope",
        "thought",
        "death",
        "point",
        "meditating",
        "death",
        "maintaining",
        "soul",
        "mortal",
        "simply",
        "absurd",
        "eye",
        "seneca",
        "bad",
        "rhetorician",
        "epicurean",
        "disguise",
        "exhorts",
        "u",
        "die",
        "serenely",
        "claiming",
        "nothing",
        "death",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "see",
        "giglioni",
        "seen",
        "examining",
        "natural",
        "philosophy",
        "cardano",
        "moral",
        "view",
        "assign",
        "central",
        "role",
        "soul",
        "soul",
        "important",
        "thing",
        "everything",
        "refers",
        "rich",
        "honor",
        "health",
        "nothing",
        "without",
        "sound",
        "soul",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "mental",
        "selfawareness",
        "particular",
        "principal",
        "argument",
        "cardano",
        "advocate",
        "immortality",
        "soul",
        "human",
        "thing",
        "mind",
        "homo",
        "animus",
        "est",
        "de",
        "utilitate",
        "oo",
        "ii",
        "cardano",
        "notion",
        "mind",
        "see",
        "giglioni",
        "garcía",
        "valverde",
        "emphasis",
        "mental",
        "awareness",
        "found",
        "cardano",
        "moral",
        "investigation",
        "opinion",
        "human",
        "being",
        "understand",
        "end",
        "action",
        "lack",
        "clear",
        "knowledge",
        "de",
        "utilitate",
        "oo",
        "ii",
        "highest",
        "good",
        "lie",
        "attribute",
        "activity",
        "part",
        "mind",
        "quae",
        "animo",
        "coniuncta",
        "sunt",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "sense",
        "relationship",
        "tranquillity",
        "awareness",
        "biunique",
        "human",
        "being",
        "peaceful",
        "know",
        "highest",
        "good",
        "know",
        "attained",
        "theonoston",
        "oo",
        "ii",
        "b",
        "according",
        "hermit",
        "definition",
        "tranquillity",
        "theonoston",
        "tranquillitas",
        "coincides",
        "securitas",
        "condition",
        "unbreakable",
        "inner",
        "peace",
        "free",
        "care",
        "anxiety",
        "level",
        "wisdom",
        "would",
        "even",
        "suit",
        "god",
        "respect",
        "true",
        "tranquillity",
        "human",
        "being",
        "coincides",
        "assimilated",
        "god",
        "condition",
        "serenity",
        "reached",
        "nothing",
        "longer",
        "felt",
        "lacking",
        "meaning",
        "substance",
        "level",
        "happiness",
        "kind",
        "pleasure",
        "derives",
        "awareness",
        "possession",
        "good",
        "theonoston",
        "oo",
        "ii",
        "a",
        "de",
        "optimo",
        "vitae",
        "genere",
        "oo",
        "b",
        "intellectual",
        "pleasure",
        "never",
        "monstrum",
        "say",
        "hybrid",
        "creature",
        "resulting",
        "combining",
        "good",
        "reason",
        "body",
        "external",
        "luck",
        "theonoston",
        "oo",
        "ii",
        "ba",
        "cardano",
        "provides",
        "definition",
        "happiness",
        "inclusive",
        "knowledge",
        "pleasure",
        "happiness",
        "consists",
        "perception",
        "pleasure",
        "great",
        "magna",
        "full",
        "plenum",
        "pure",
        "pura",
        "untroubled",
        "secura",
        "safe",
        "tuta",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "theonoston",
        "oo",
        "ii",
        "b",
        "de",
        "libris",
        "propriis",
        "oo",
        "b",
        "ed",
        "maclean",
        "theonoston",
        "happiness",
        "said",
        "coincide",
        "kind",
        "inner",
        "composure",
        "understood",
        "term",
        "lack",
        "sensibility",
        "indolentia",
        "condition",
        "mental",
        "vigour",
        "stemming",
        "contemplation",
        "true",
        "nature",
        "thing",
        "tranquillity",
        "consisted",
        "mere",
        "refractoriness",
        "unsettling",
        "experience",
        "impassive",
        "state",
        "stone",
        "viewed",
        "best",
        "condition",
        "theonoston",
        "oo",
        "ii",
        "b",
        "b",
        "b",
        "contrast",
        "ethical",
        "peace",
        "rest",
        "state",
        "cognitive",
        "tension",
        "focus",
        "way",
        "remind",
        "u",
        "sea",
        "air",
        "undisturbed",
        "calm",
        "tranquilla",
        "quies",
        "always",
        "accompanied",
        "current",
        "light",
        "motion",
        "ie",
        "state",
        "balance",
        "opposite",
        "condition",
        "unsettle",
        "delight",
        "us",
        "cardano",
        "tranquillitas",
        "therefore",
        "absolute",
        "rest",
        "state",
        "highest",
        "tranquillity",
        "soul",
        "tremulous",
        "breathing",
        "theonoston",
        "oo",
        "ii",
        "a",
        "b",
        "incessant",
        "vitality",
        "demonstrates",
        "matter",
        "made",
        "celestial",
        "origin",
        "produced",
        "entwined",
        "motion",
        "enjoy",
        "rest",
        "thrives",
        "motion",
        "motion",
        "final",
        "analysis",
        "bodily",
        "activity",
        "expression",
        "knowledge",
        "intellect",
        "theonoston",
        "oo",
        "ii",
        "a",
        "true",
        "tranquillity",
        "result",
        "condition",
        "inviolable",
        "selffulfilment",
        "securitas",
        "based",
        "resource",
        "power",
        "nostra",
        "potestate",
        "esse",
        "cardano",
        "convinced",
        "senecan",
        "view",
        "tranquillity",
        "balanced",
        "active",
        "life",
        "vita",
        "actuosa",
        "socrates",
        "kind",
        "engaged",
        "tranquillity",
        "case",
        "behaviour",
        "cardano",
        "symptomatic",
        "ambition",
        "rather",
        "indication",
        "truly",
        "committed",
        "philosophical",
        "life",
        "theonoston",
        "oo",
        "ii",
        "b",
        "finally",
        "cardano",
        "reject",
        "ideal",
        "tranquillity",
        "championed",
        "plutarch",
        "antoninus",
        "cicero",
        "viewed",
        "model",
        "ethical",
        "escapism",
        "devised",
        "men",
        "life",
        "never",
        "managed",
        "reach",
        "condition",
        "stable",
        "serenity",
        "theonoston",
        "oo",
        "ii",
        "a",
        "outlining",
        "view",
        "nature",
        "good",
        "cardano",
        "following",
        "deliberately",
        "eclectic",
        "approach",
        "combine",
        "stoic",
        "conception",
        "virtue",
        "epicurus",
        "emphasis",
        "indifference",
        "indolentia",
        "aristotle",
        "notion",
        "virtuous",
        "life",
        "averroes",
        "characterization",
        "happiness",
        "highest",
        "level",
        "knowledge",
        "accessible",
        "human",
        "being",
        "justifies",
        "eclectic",
        "position",
        "arguing",
        "philosopher",
        "clever",
        "field",
        "likely",
        "come",
        "closely",
        "related",
        "idea",
        "therefore",
        "two",
        "opinion",
        "converge",
        "one",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "socrates",
        "instance",
        "cardano",
        "draw",
        "principle",
        "wise",
        "people",
        "truly",
        "happy",
        "virtue",
        "lie",
        "knowledge",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "medical",
        "author",
        "borrows",
        "view",
        "pleasure",
        "always",
        "follows",
        "release",
        "condition",
        "tension",
        "pain",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "following",
        "traditional",
        "argumentative",
        "pattern",
        "moral",
        "philosophy",
        "cardano",
        "distinguishes",
        "among",
        "good",
        "mind",
        "virtue",
        "good",
        "body",
        "health",
        "longevity",
        "good",
        "fortune",
        "among",
        "good",
        "fortune",
        "cardano",
        "list",
        "finding",
        "right",
        "wife",
        "lasting",
        "fame",
        "painless",
        "death",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "good",
        "body",
        "enjoying",
        "good",
        "health",
        "following",
        "healthy",
        "regimen",
        "also",
        "part",
        "one",
        "happiness",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "cardano",
        "notion",
        "health",
        "see",
        "siraisi",
        "strictly",
        "speaking",
        "good",
        "ill",
        "value",
        "transcend",
        "level",
        "nature",
        "therefore",
        "treated",
        "natural",
        "nature",
        "good",
        "ill",
        "reside",
        "soul",
        "faculty",
        "defect",
        "body",
        "help",
        "impediment",
        "fortune",
        "occurrence",
        "theonoston",
        "oo",
        "ii",
        "b",
        "general",
        "term",
        "cardano",
        "defines",
        "good",
        "longed",
        "majority",
        "human",
        "being",
        "health",
        "wealth",
        "friend",
        "glory",
        "offspring",
        "wisdom",
        "specific",
        "sense",
        "simpliciter",
        "good",
        "everlasting",
        "perpetuum",
        "safe",
        "securum",
        "unchangeable",
        "immutabile",
        "de",
        "utilitate",
        "oo",
        "ii",
        "ab",
        "order",
        "achieve",
        "stable",
        "condition",
        "inner",
        "peace",
        "people",
        "need",
        "commit",
        "good",
        "taken",
        "away",
        "ultimately",
        "since",
        "god",
        "requisite",
        "kind",
        "imperishable",
        "good",
        "genuine",
        "meaning",
        "good",
        "brings",
        "u",
        "closer",
        "god",
        "make",
        "u",
        "similar",
        "theonoston",
        "oo",
        "ii",
        "ba",
        "b",
        "difference",
        "human",
        "being",
        "god",
        "god",
        "good",
        "bonum",
        "coincides",
        "entirely",
        "selfpreservation",
        "vita",
        "incolumis",
        "whereas",
        "human",
        "being",
        "two",
        "condition",
        "generally",
        "separate",
        "human",
        "being",
        "need",
        "take",
        "care",
        "life",
        "aim",
        "life",
        "marked",
        "reason",
        "discourse",
        "happiness",
        "primary",
        "requisite",
        "life",
        "lacking",
        "due",
        "mental",
        "illness",
        "death",
        "theonoston",
        "oo",
        "ii",
        "b",
        "good",
        "mind",
        "virtue",
        "virtue",
        "cardano",
        "mean",
        "principle",
        "teach",
        "human",
        "being",
        "behave",
        "best",
        "way",
        "towards",
        "god",
        "animal",
        "fellow",
        "human",
        "being",
        "hence",
        "key",
        "virtue",
        "sense",
        "duty",
        "pieta",
        "compassion",
        "humanitas",
        "kindness",
        "benignitas",
        "theonoston",
        "oo",
        "ii",
        "ab",
        "given",
        "importance",
        "virtue",
        "among",
        "foundation",
        "human",
        "action",
        "nature",
        "virtue",
        "eternal",
        "divine",
        "good",
        "u",
        "rest",
        "rot",
        "time",
        "depends",
        "circumstance",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "see",
        "ibid",
        "b",
        "emanating",
        "innermost",
        "part",
        "rational",
        "soul",
        "virtue",
        "power",
        "retroact",
        "mind",
        "thus",
        "fortifying",
        "safeguarding",
        "faculty",
        "prophylactic",
        "among",
        "virtue",
        "fortitude",
        "prudence",
        "moderation",
        "result",
        "combined",
        "action",
        "nature",
        "habit",
        "reason",
        "establishing",
        "delicate",
        "balance",
        "control",
        "natural",
        "impulse",
        "impetus",
        "naturae",
        "education",
        "process",
        "decision",
        "making",
        "already",
        "said",
        "cardano",
        "moral",
        "philosophy",
        "rest",
        "series",
        "interrelated",
        "principle",
        "also",
        "play",
        "key",
        "foundational",
        "role",
        "natural",
        "philosophy",
        "soul",
        "immortal",
        "incorporeal",
        "life",
        "everlasting",
        "mental",
        "awareness",
        "defining",
        "characteristic",
        "soul",
        "since",
        "intellect",
        "thing",
        "human",
        "boast",
        "truly",
        "immortal",
        "intellectual",
        "selfknowledge",
        "regarded",
        "cardano",
        "highest",
        "good",
        "human",
        "may",
        "ever",
        "attain",
        "inevitably",
        "assumption",
        "reproposes",
        "averroist",
        "conundrum",
        "whether",
        "mind",
        "belongs",
        "humankind",
        "whole",
        "informs",
        "life",
        "knowledge",
        "individual",
        "human",
        "cardano",
        "seems",
        "suggest",
        "mind",
        "transcends",
        "individual",
        "human",
        "being",
        "men",
        "superior",
        "est",
        "homini",
        "happiness",
        "coincides",
        "eternal",
        "life",
        "live",
        "long",
        "happy",
        "long",
        "de",
        "utilitate",
        "oo",
        "ii",
        "ab",
        "averroism",
        "cardano",
        "see",
        "garcía",
        "valverde",
        "happiness",
        "human",
        "life",
        "afterlife",
        "soul",
        "point",
        "cardano",
        "follows",
        "st",
        "paul",
        "argument",
        "letter",
        "roman",
        "soul",
        "survive",
        "death",
        "would",
        "much",
        "unhappier",
        "animal",
        "besides",
        "fact",
        "animal",
        "apart",
        "human",
        "know",
        "going",
        "die",
        "non",
        "human",
        "animal",
        "bruta",
        "enjoy",
        "happiness",
        "fact",
        "exist",
        "since",
        "live",
        "live",
        "forever",
        "therefore",
        "participate",
        "eternal",
        "bliss",
        "human",
        "being",
        "separated",
        "eternity",
        "even",
        "thought",
        "know",
        "die",
        "also",
        "aware",
        "inevitably",
        "die",
        "die",
        "within",
        "preestablished",
        "time",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "cardano",
        "reflection",
        "mental",
        "happiness",
        "assimilation",
        "god",
        "universal",
        "intelligibility",
        "read",
        "background",
        "contemporary",
        "discussion",
        "averroist",
        "notion",
        "intellectual",
        "beatitude",
        "doubt",
        "cardano",
        "characterizes",
        "highest",
        "good",
        "union",
        "soul",
        "god",
        "definition",
        "full",
        "aristotelian",
        "averroistic",
        "resonance",
        "summum",
        "bonum",
        "argues",
        "de",
        "utilitate",
        "ex",
        "adversis",
        "capienda",
        "assimilated",
        "highest",
        "good",
        "ie",
        "god",
        "unlike",
        "kind",
        "love",
        "love",
        "god",
        "honest",
        "safe",
        "object",
        "never",
        "desert",
        "seeking",
        "soul",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "a",
        "de",
        "sapientia",
        "oo",
        "ed",
        "bracali",
        "elsewhere",
        "cardano",
        "definition",
        "summum",
        "bonum",
        "suppler",
        "implies",
        "component",
        "wisdom",
        "sapientia",
        "virtue",
        "especially",
        "fortitude",
        "prudence",
        "progeny",
        "wisdom",
        "distinctively",
        "human",
        "expression",
        "fortitude",
        "prudence",
        "also",
        "seen",
        "several",
        "animal",
        "child",
        "finally",
        "prerogative",
        "belongs",
        "almost",
        "living",
        "being",
        "sort",
        "pyramidal",
        "model",
        "virtue",
        "fertility",
        "basis",
        "wisdom",
        "top",
        "people",
        "reach",
        "wisdom",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "theonoston",
        "oo",
        "ii",
        "b",
        "cardano",
        "view",
        "virtue",
        "see",
        "ingegno"
    ]
}