{
    "main_text": "Moral Philosophy: The Two Levels of Wisdom || Prudence and Practical Wisdom\n4.2 Prudence and Practical Wisdom\n\nThe characteristic oscillation between intellectual good and\nprosperous life is particularly evident in De utilitate ex\nadversis capienda. This work is meant to provide directions on\nhow to overcome difficult situations and lead a reasonably serene life\nrelying only on the material conditions of one’s existence and\non the information that one can get from sensible experience. Contrary\nto the approach followed in Theonoston, in De\nutilitate Cardano focuses on the kind of happiness that one can\nreach in this life, advancing the hypothesis – to be understood\nin an experimental sense – that there is no survival of the soul\n(etiam sublata immortalitate) (De utilitate, II, 5).\nIn this case, the moral actor is confronted not so much with the goods\nattainable by the mind as with the ills that the mind needs to\ntransform into opportunities for inner exercise or practical gain.\nCardano divides ills (mala) into external and internal. They\nboth can be measured according to the impact they have on our lives\n(magnitudo) and the level of constraint they impose on our\nactions (necessitas). External ills depend on the variable\narrangement of external events (fortunae arbitrium) and on\nthe shifting states of the body. Although, properly speaking, the body\nis “no part of ourselves,” nevertheless, it communicates\nwith our mind. Internal ills are all those passions that can be hardly\neradicated from our soul, such as madness, anger, fear, and envy.\nSince they are located within the soul (animus), it is\nexceedingly difficult to turn them into something useful and\nproductive unless we undergo a radical transformation of our self\n(De utilitate, OO, II, 11b–12a, 13b).\n\nCardano claims that there can be five kinds of responses to calamities\nin one’s life. The first two are “paradoxical” and\nhave nothing relevant to say about possible applications to the\npractical aspects of one’s life. These are the Christian and the\nStoic responses: adversities are either good in themselves, or they\nhave absolutely no incidence in someone’s happiness. The\nremaining three kinds of response are of a “pragmatic”\nnature, for they appeal to the human senses and have possible social\noutcomes. First, they teach us how to avoid misfortunes or mitigate\nthe impact they have on our life; second, in case they happen, they\ndirect our attention to ways of coping with misfortunes or escape\ndangerous consequences; third, they tell us how to gain “some\ngood” out of “any kind of ill” (De\nutilitate, OO, II, 10b, 27b, 39a). For Cardano, this ethical\nprogram in three stages is an approach that suits people involved in\nthe many activities of civic life and helps meet their social\ncommitments. The distinctive trait of prudent people is their ability\nto turn difficulties into opportunities of knowledge and moral\nbetterment (De utilitate, OO, II, 11a). Regarding the\n“paradoxical” attitudes to calamities displayed by Stoic\nand Christian sages, Cardano thinks that there is a great difference\nbetween the situation in which the wise man is deemed capable of\n“bearing calamities with fortitude” (the Stoic approach)\nand that in which he is supposed to look at them as part of\n“one’s goods” (the Christian attitude). Even more\ndifferent, however, is to interpret calamities as useful and\nproductive means of experience, as suggested by Cardano. Otherwise, to\npraise the ills of life remains a futile rhetorical exercise, and for\nthis reason Cardano does not hesitate to place Erasmus’ Laus\nstultitiae (“Praise of Folly”) in this category of\nedifying but useless rhetoric. With the exception of irreparable\nlosses, which can only be assuaged by resorting to a whole range of\nconsolatory techniques, Cardano maintains that any other ill can\nalways be turned into something useful and therefore no consolation is\nneeded. To sum up, he identifies different levels – rhetorical,\ncognitive, and pragmatic – within the domain of moral\nphilosophy: “To praise adversities is the eloquent\nrhetorician’s task; to bear them with fortitude belongs to a\ngenerous soul or a person who knows divine truths; to draw useful\ninstruction from them is the mark of a prudent man” (De\nutilitate, OO, II, 11a).\n\nAs in the case of intellectual happiness, relief from emergencies is\npredicated on knowledge. Cardano characterizes his method\n(ratio) for avoiding misfortunes and preparing against\ncalamities as based on a particular kind of knowledge\n(scientia) – both useful and necessary – which\n“teaches us to recognize and obtain known goods, and once they\nare obtained, it tells us how to use them and how to protect us with\nthem against ills” (De utilitate, OO, II, 17a). The\nambivalent role of animus in Cardano’s moral philosophy\nis particularly evident in his directions on how to draw profit from\nmisfortunes, for both misery and happiness depend on awareness\n(“the fact that we know our condition”) (De\nutilitate, OO, II, 88b). Our thinking activity is a key element\nin turning adversities into opportunities of growth in self-awareness.\nAny philosophical discussion of ethical matters presupposes that the\nethical subject is aware of his or her happiness or unhappiness:\n“the mind (animus) alone is the one who is happy or\nunhappy.” We have previously noted how closely Cardano’s\nnotion of the summum bonum is connected to the principle of\nsoul’s awareness. In the same way, all forms of external goods\n(riches, physical beauty, health, friends, offspring, country, honors)\nare no part of happiness unless they are related to the mind\n(quatenus ad animum referuntur).\n\nThe principal resources through which human beings may learn to draw\nadvantages from adversities are fortitude, prudence, worldly knowledge\n(rerum experientia), and all sorts of helps\n(auxilia), such as material means, friends, authority, bodily\nstrength and practical experience (exercitatio) (De\nutilitate, OO, II, 12a). Among the resources provided by reason,\nCardano shares with Seneca the belief that meditating about\none’s death (meditatio mortis) can trigger active and\npointed responses to everyday problems: “although death is a\nnecessary event, nevertheless, it contains in an eminent way, so to\nsay, all the reasons that sadden our life.” Thinking about\ndeath, regardless of whether people may be sure that they are going to\nsurvive after death, “can dissolve almost any form of\nsorrow” (De utilitate, OO, II, 17b). When methodically\nstructured, far from producing anxiety, the thought of death and of\nthe transient nature of all human affairs injects a sense of purpose\nand order into our existence, making us gradually adjusted to a\nuniverse in a constant flux. Cardano’s method of drawing profit\nfrom adversities is based on the general principle that everything in\nnature is subject to incessant change: “I usually compare human\naffairs, this whole sublunary frame (machina sublunaris) and\nall that happens in it to a mass of wax in which, while it is\ncompressed, protrusions become cavities and cavities protrude, all\nforms change, and now they change into similar ones, now into\ndissimilar ones, into charming or foul, horrible and pleasant\nones.” The principle of the unremitting transformation of\nreality (vicissitudo rerum) is therefore the ontological\nrationale behind our belief that ills can be turned into goods (De\nutilitate, OO, II, 14b). Closely related to this principle is\nCardano’s striking assumption that, when considered from the\npoint of view of happiness, all things are on a par (omnia\naequalia sunt): “God levelled the conditions not only for\nall human beings, but also for all things which are under the\nsky” (De utilitate, OO, II, 18a, 24b).\n\nIt is while examining the essence of humane misfortune that Cardano\nreaches the important conclusion that loss and want are the ultimate\ncauses of one’s hardships. The ability to anticipate and feel in\nadvance the effect of losing something or someone (sensus\namissionis) can therefore prepare us to face calamities in our\nlife (De utilitate, OO, II, 7). While Cardano insists that\nexperience of adversities in life (sensus calamitatum)\nprovides people with a richer sense of their happiness, however, he is\nalso well aware that there are limits in the human ability to process\nmisfortunes into material for inner transformation (De\nutilitate, OO, II, 38b). Material destitution is certainly one of\nthese limits. Among the circumstances that affect our perception of\nwant, penury prevents us from focusing on the improvement of our\nknowledge and level of awareness. When in his division of the goods\n(of the mind, of the body and of fortune) Cardano describes material\nmeans as a pre-condition for the exercise of virtue and happiness, he\ntakes special care in specifying that the ethical inconvenience in\nbeing poor does not lie in not having access to the advantages of\nmaterial prosperity, but in the inability to work towards one’s\nown happiness: “if someone does not have the means to raise his\nchildren, to look for wisdom or to practice justice, he will certainly\nbe unhappy, not because he is poor, but because he cannot practice the\nworks of happiness” (De utilitate, OO, II, 26a). Mental\npain is another situation in which human ability to turn misfortunes\ninto positive experiences is tested to the limit. The way Cardano\ninsists on the severe reality of mental pain (molestia animi,\ndolor animi) is one of the most characteristic aspects of his\nmoral philosophy: “No disease, if there is not fear of death,\ncan equal mental pain (dolor animi)” (De\nutilitate, OO, II, 18a).\n\nIn promoting (whenever possible) the value of happiness in all\ncircumstances of human life, Cardano does not intend to humour any\nhuman tendency to self-delusion. On the contrary, he sees his effort\nto dispel false beliefs and to curb proclivities to self-deception as\nhis main contribution to moral philosophy, for there is no greater\nmerit than “to free mankind from false opinions” (De\nutilitate, OO, II, 26a). Indeed, sometimes he goes so far as to\ncriticize Averroes’ notion of mental happiness as a form of\nentertaining false hopes (in this case, the hope to achieve\nintellectual bliss). Cardano thinks that the principal task of a moral\nphilosopher should be that of freeing the mind from misapprehensions\nand prejudices: “There are many people who prefer to be happy in\na mistaken way rather than acknowledge the reality of their affairs\nand their condition” (De utilitate, OO, II, 24b). As\nalready said, mental securitas cannot be premised on forms of\nself-distraction and self-delusion, which turn our mind away from the\ncauses of our discontent. A good physician would never try to assuage\nthe pain of the patient by recommending him to buy “paintings\nand precious stones” (Theonoston, OO, II, 307a).\nCardano’s method of drawing profit from adversities is therefore\nan attempt to promote endurance while insisting on a courageous\nacceptance of the human condition.\n\nThe clash between appearance and reality, which represents the\nhallmark of Cardano’s ontology and theory of knowledge, has\ntherefore its obvious counterpart in his moral philosophy, where he\noften associates human misery with unrealistic ambitions triggered by\nhuman desires: “Since human nature is driven to the infinite by\nappetites, it can never be satisfied, for it cannot contain the\ninfinite, indeed, not even a great part of what it desires.”\nTherefore, he who is not capable of restraining his own appetites, be\nhe the greatest of the kings, will certainly be the unhappiest person\n(De utilitate, OO, II, 5; De sapientia, OO, I, 532a,\n544b–545a; ed. Bracali, 135, 174–175). To fight our\npropensity to cherish illusory dreams of happiness (somnium\numbrae and umbra somnii), Cardano recommends us to\nbecome more aware of the precarious nature of the human condition\n(humana fragilitas) and to increase our level of\nself-mastery. The combined action of self-knowledge (nosce te\nipsum) and self-control (impera te ipsum) contributes to\nnarrow the otherwise unmanageable scope of our desires\n(Theonoston, OO, II, 310b; De consolatione, OO, I,\n615a; De utilitate, OO, II, 89b-90a). Self-awareness and\nself-control contribute to create positive habits (mores) out\nof actions and passions. Unlike nonhuman animals (belluae),\nhuman beings are capable of disciplining themselves (imperare\nsibiipsis) and to shape their nature (et naturam et mores\nsibi formare) (Paralipomena, OO, X, 448a). They modify\ntheir behavior through thought (cogitatio), language\n(sermo), and action (actio). Actions are primarily\ndirected to what is useful for us and are ruled by the criterion of\ninterest (utile), by pleasure, nature, and habit. Thought\nconcentrates on what is either useful or harmful for us. Language\nadjusts our actions and thought to the variable circumstances that\npresent themselves from time to time (De utilitate, OO, II,\n19a, 20b; De minimis, I, 693a). Once we manage to strike a\nbalance between the scope of our desires and the reality in which we\nlive, two things become most necessary (maxime necessaria):\nto obtain what we wish to have (habere quod velis) and to\nknow how to use what we have (his quae habes uti commode\nscire) (De utilitate, OO, II, 1). To facilitate this\ntask, Cardano distinguishes between disciplines in which the\ntheoretical aspect is more prevalent (such as geometry and theology),\ndisciplines which are characterized by a balanced interplay of theory\n(scientia) and practice (usus), such as medicine and\nlaw, and finally disciplines in which practice (exercitatio)\nis essential, like moral philosophy. Cardano enumerates five\nrequisites that define the nature of an accomplished action (in terms\nof attaining the right means for the right end (adeptio),\nreadiness of execution (promptitudo), and completion\n(perfectio)). These requisites are nature, art, diligence,\npractice, and familiarity with the experts in the field (De\nutilitate, OO, II, 1–2; De sapientia, OO, I, 494b;\ned. Bracali, 15).\n",
    "section_title": "4.2 Prudence and Practical Wisdom",
    "entry_title": "Girolamo [Geronimo] Cardano",
    "hierarchy_title": "Girolamo [Geronimo] Cardano || Moral Philosophy: The Two Levels of Wisdom || Prudence and Practical Wisdom",
    "tokenized_text": [
        "moral",
        "philosophy",
        "two",
        "level",
        "wisdom",
        "prudence",
        "practical",
        "wisdom",
        "prudence",
        "practical",
        "wisdom",
        "characteristic",
        "oscillation",
        "intellectual",
        "good",
        "prosperous",
        "life",
        "particularly",
        "evident",
        "de",
        "utilitate",
        "ex",
        "adversis",
        "capienda",
        "work",
        "meant",
        "provide",
        "direction",
        "overcome",
        "difficult",
        "situation",
        "lead",
        "reasonably",
        "serene",
        "life",
        "relying",
        "material",
        "condition",
        "one",
        "existence",
        "information",
        "one",
        "get",
        "sensible",
        "experience",
        "contrary",
        "approach",
        "followed",
        "theonoston",
        "de",
        "utilitate",
        "cardano",
        "focus",
        "kind",
        "happiness",
        "one",
        "reach",
        "life",
        "advancing",
        "hypothesis",
        "understood",
        "experimental",
        "sense",
        "survival",
        "soul",
        "etiam",
        "sublata",
        "immortalitate",
        "de",
        "utilitate",
        "ii",
        "case",
        "moral",
        "actor",
        "confronted",
        "much",
        "good",
        "attainable",
        "mind",
        "ill",
        "mind",
        "need",
        "transform",
        "opportunity",
        "inner",
        "exercise",
        "practical",
        "gain",
        "cardano",
        "divide",
        "ill",
        "mala",
        "external",
        "internal",
        "measured",
        "according",
        "impact",
        "life",
        "magnitudo",
        "level",
        "constraint",
        "impose",
        "action",
        "necessitas",
        "external",
        "ill",
        "depend",
        "variable",
        "arrangement",
        "external",
        "event",
        "fortunae",
        "arbitrium",
        "shifting",
        "state",
        "body",
        "although",
        "properly",
        "speaking",
        "body",
        "part",
        "nevertheless",
        "communicates",
        "mind",
        "internal",
        "ill",
        "passion",
        "hardly",
        "eradicated",
        "soul",
        "madness",
        "anger",
        "fear",
        "envy",
        "since",
        "located",
        "within",
        "soul",
        "animus",
        "exceedingly",
        "difficult",
        "turn",
        "something",
        "useful",
        "productive",
        "unless",
        "undergo",
        "radical",
        "transformation",
        "self",
        "de",
        "utilitate",
        "oo",
        "ii",
        "ba",
        "b",
        "cardano",
        "claim",
        "five",
        "kind",
        "response",
        "calamity",
        "one",
        "life",
        "first",
        "two",
        "paradoxical",
        "nothing",
        "relevant",
        "say",
        "possible",
        "application",
        "practical",
        "aspect",
        "one",
        "life",
        "christian",
        "stoic",
        "response",
        "adversity",
        "either",
        "good",
        "absolutely",
        "incidence",
        "someone",
        "happiness",
        "remaining",
        "three",
        "kind",
        "response",
        "pragmatic",
        "nature",
        "appeal",
        "human",
        "sens",
        "possible",
        "social",
        "outcome",
        "first",
        "teach",
        "u",
        "avoid",
        "misfortune",
        "mitigate",
        "impact",
        "life",
        "second",
        "case",
        "happen",
        "direct",
        "attention",
        "way",
        "coping",
        "misfortune",
        "escape",
        "dangerous",
        "consequence",
        "third",
        "tell",
        "u",
        "gain",
        "good",
        "kind",
        "ill",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "b",
        "a",
        "cardano",
        "ethical",
        "program",
        "three",
        "stage",
        "approach",
        "suit",
        "people",
        "involved",
        "many",
        "activity",
        "civic",
        "life",
        "help",
        "meet",
        "social",
        "commitment",
        "distinctive",
        "trait",
        "prudent",
        "people",
        "ability",
        "turn",
        "difficulty",
        "opportunity",
        "knowledge",
        "moral",
        "betterment",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "regarding",
        "paradoxical",
        "attitude",
        "calamity",
        "displayed",
        "stoic",
        "christian",
        "sage",
        "cardano",
        "think",
        "great",
        "difference",
        "situation",
        "wise",
        "man",
        "deemed",
        "capable",
        "bearing",
        "calamity",
        "fortitude",
        "stoic",
        "approach",
        "supposed",
        "look",
        "part",
        "one",
        "good",
        "christian",
        "attitude",
        "even",
        "different",
        "however",
        "interpret",
        "calamity",
        "useful",
        "productive",
        "mean",
        "experience",
        "suggested",
        "cardano",
        "otherwise",
        "praise",
        "ill",
        "life",
        "remains",
        "futile",
        "rhetorical",
        "exercise",
        "reason",
        "cardano",
        "hesitate",
        "place",
        "erasmus",
        "laus",
        "stultitiae",
        "praise",
        "folly",
        "category",
        "edifying",
        "useless",
        "rhetoric",
        "exception",
        "irreparable",
        "loss",
        "assuaged",
        "resorting",
        "whole",
        "range",
        "consolatory",
        "technique",
        "cardano",
        "maintains",
        "ill",
        "always",
        "turned",
        "something",
        "useful",
        "therefore",
        "consolation",
        "needed",
        "sum",
        "identifies",
        "different",
        "level",
        "rhetorical",
        "cognitive",
        "pragmatic",
        "within",
        "domain",
        "moral",
        "philosophy",
        "praise",
        "adversity",
        "eloquent",
        "rhetorician",
        "task",
        "bear",
        "fortitude",
        "belongs",
        "generous",
        "soul",
        "person",
        "know",
        "divine",
        "truth",
        "draw",
        "useful",
        "instruction",
        "mark",
        "prudent",
        "man",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "case",
        "intellectual",
        "happiness",
        "relief",
        "emergency",
        "predicated",
        "knowledge",
        "cardano",
        "characterizes",
        "method",
        "ratio",
        "avoiding",
        "misfortune",
        "preparing",
        "calamity",
        "based",
        "particular",
        "kind",
        "knowledge",
        "scientia",
        "useful",
        "necessary",
        "teach",
        "u",
        "recognize",
        "obtain",
        "known",
        "good",
        "obtained",
        "tell",
        "u",
        "use",
        "protect",
        "u",
        "ill",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "ambivalent",
        "role",
        "animus",
        "cardano",
        "moral",
        "philosophy",
        "particularly",
        "evident",
        "direction",
        "draw",
        "profit",
        "misfortune",
        "misery",
        "happiness",
        "depend",
        "awareness",
        "fact",
        "know",
        "condition",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "thinking",
        "activity",
        "key",
        "element",
        "turning",
        "adversity",
        "opportunity",
        "growth",
        "selfawareness",
        "philosophical",
        "discussion",
        "ethical",
        "matter",
        "presupposes",
        "ethical",
        "subject",
        "aware",
        "happiness",
        "unhappiness",
        "mind",
        "animus",
        "alone",
        "one",
        "happy",
        "unhappy",
        "previously",
        "noted",
        "closely",
        "cardano",
        "notion",
        "summum",
        "bonum",
        "connected",
        "principle",
        "soul",
        "awareness",
        "way",
        "form",
        "external",
        "good",
        "rich",
        "physical",
        "beauty",
        "health",
        "friend",
        "offspring",
        "country",
        "honor",
        "part",
        "happiness",
        "unless",
        "related",
        "mind",
        "quatenus",
        "ad",
        "animum",
        "referuntur",
        "principal",
        "resource",
        "human",
        "being",
        "may",
        "learn",
        "draw",
        "advantage",
        "adversity",
        "fortitude",
        "prudence",
        "worldly",
        "knowledge",
        "rerum",
        "experientia",
        "sort",
        "help",
        "auxilia",
        "material",
        "mean",
        "friend",
        "authority",
        "bodily",
        "strength",
        "practical",
        "experience",
        "exercitatio",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "among",
        "resource",
        "provided",
        "reason",
        "cardano",
        "share",
        "seneca",
        "belief",
        "meditating",
        "one",
        "death",
        "meditatio",
        "mortis",
        "trigger",
        "active",
        "pointed",
        "response",
        "everyday",
        "problem",
        "although",
        "death",
        "necessary",
        "event",
        "nevertheless",
        "contains",
        "eminent",
        "way",
        "say",
        "reason",
        "sadden",
        "life",
        "thinking",
        "death",
        "regardless",
        "whether",
        "people",
        "may",
        "sure",
        "going",
        "survive",
        "death",
        "dissolve",
        "almost",
        "form",
        "sorrow",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "methodically",
        "structured",
        "far",
        "producing",
        "anxiety",
        "thought",
        "death",
        "transient",
        "nature",
        "human",
        "affair",
        "injects",
        "sense",
        "purpose",
        "order",
        "existence",
        "making",
        "u",
        "gradually",
        "adjusted",
        "universe",
        "constant",
        "flux",
        "cardano",
        "method",
        "drawing",
        "profit",
        "adversity",
        "based",
        "general",
        "principle",
        "everything",
        "nature",
        "subject",
        "incessant",
        "change",
        "usually",
        "compare",
        "human",
        "affair",
        "whole",
        "sublunary",
        "frame",
        "machina",
        "sublunaris",
        "happens",
        "mass",
        "wax",
        "compressed",
        "protrusion",
        "become",
        "cavity",
        "cavity",
        "protrude",
        "form",
        "change",
        "change",
        "similar",
        "one",
        "dissimilar",
        "one",
        "charming",
        "foul",
        "horrible",
        "pleasant",
        "ones",
        "principle",
        "unremitting",
        "transformation",
        "reality",
        "vicissitudo",
        "rerum",
        "therefore",
        "ontological",
        "rationale",
        "behind",
        "belief",
        "ill",
        "turned",
        "good",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "closely",
        "related",
        "principle",
        "cardano",
        "striking",
        "assumption",
        "considered",
        "point",
        "view",
        "happiness",
        "thing",
        "par",
        "omnia",
        "aequalia",
        "sunt",
        "god",
        "levelled",
        "condition",
        "human",
        "being",
        "also",
        "thing",
        "sky",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "b",
        "examining",
        "essence",
        "humane",
        "misfortune",
        "cardano",
        "reach",
        "important",
        "conclusion",
        "loss",
        "want",
        "ultimate",
        "cause",
        "one",
        "hardship",
        "ability",
        "anticipate",
        "feel",
        "advance",
        "effect",
        "losing",
        "something",
        "someone",
        "sensus",
        "amissionis",
        "therefore",
        "prepare",
        "u",
        "face",
        "calamity",
        "life",
        "de",
        "utilitate",
        "oo",
        "ii",
        "cardano",
        "insists",
        "experience",
        "adversity",
        "life",
        "sensus",
        "calamitatum",
        "provides",
        "people",
        "richer",
        "sense",
        "happiness",
        "however",
        "also",
        "well",
        "aware",
        "limit",
        "human",
        "ability",
        "process",
        "misfortune",
        "material",
        "inner",
        "transformation",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "material",
        "destitution",
        "certainly",
        "one",
        "limit",
        "among",
        "circumstance",
        "affect",
        "perception",
        "want",
        "penury",
        "prevents",
        "u",
        "focusing",
        "improvement",
        "knowledge",
        "level",
        "awareness",
        "division",
        "good",
        "mind",
        "body",
        "fortune",
        "cardano",
        "describes",
        "material",
        "mean",
        "precondition",
        "exercise",
        "virtue",
        "happiness",
        "take",
        "special",
        "care",
        "specifying",
        "ethical",
        "inconvenience",
        "poor",
        "lie",
        "access",
        "advantage",
        "material",
        "prosperity",
        "inability",
        "work",
        "towards",
        "one",
        "happiness",
        "someone",
        "mean",
        "raise",
        "child",
        "look",
        "wisdom",
        "practice",
        "justice",
        "certainly",
        "unhappy",
        "poor",
        "practice",
        "work",
        "happiness",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "mental",
        "pain",
        "another",
        "situation",
        "human",
        "ability",
        "turn",
        "misfortune",
        "positive",
        "experience",
        "tested",
        "limit",
        "way",
        "cardano",
        "insists",
        "severe",
        "reality",
        "mental",
        "pain",
        "molestia",
        "animi",
        "dolor",
        "animi",
        "one",
        "characteristic",
        "aspect",
        "moral",
        "philosophy",
        "disease",
        "fear",
        "death",
        "equal",
        "mental",
        "pain",
        "dolor",
        "animi",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "promoting",
        "whenever",
        "possible",
        "value",
        "happiness",
        "circumstance",
        "human",
        "life",
        "cardano",
        "intend",
        "humour",
        "human",
        "tendency",
        "selfdelusion",
        "contrary",
        "see",
        "effort",
        "dispel",
        "false",
        "belief",
        "curb",
        "proclivity",
        "selfdeception",
        "main",
        "contribution",
        "moral",
        "philosophy",
        "greater",
        "merit",
        "free",
        "mankind",
        "false",
        "opinion",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "indeed",
        "sometimes",
        "go",
        "far",
        "criticize",
        "averroes",
        "notion",
        "mental",
        "happiness",
        "form",
        "entertaining",
        "false",
        "hope",
        "case",
        "hope",
        "achieve",
        "intellectual",
        "bliss",
        "cardano",
        "think",
        "principal",
        "task",
        "moral",
        "philosopher",
        "freeing",
        "mind",
        "misapprehension",
        "prejudice",
        "many",
        "people",
        "prefer",
        "happy",
        "mistaken",
        "way",
        "rather",
        "acknowledge",
        "reality",
        "affair",
        "condition",
        "de",
        "utilitate",
        "oo",
        "ii",
        "b",
        "already",
        "said",
        "mental",
        "securitas",
        "premised",
        "form",
        "selfdistraction",
        "selfdelusion",
        "turn",
        "mind",
        "away",
        "cause",
        "discontent",
        "good",
        "physician",
        "would",
        "never",
        "try",
        "assuage",
        "pain",
        "patient",
        "recommending",
        "buy",
        "painting",
        "precious",
        "stone",
        "theonoston",
        "oo",
        "ii",
        "a",
        "cardano",
        "method",
        "drawing",
        "profit",
        "adversity",
        "therefore",
        "attempt",
        "promote",
        "endurance",
        "insisting",
        "courageous",
        "acceptance",
        "human",
        "condition",
        "clash",
        "appearance",
        "reality",
        "represents",
        "hallmark",
        "cardano",
        "ontology",
        "theory",
        "knowledge",
        "therefore",
        "obvious",
        "counterpart",
        "moral",
        "philosophy",
        "often",
        "associate",
        "human",
        "misery",
        "unrealistic",
        "ambition",
        "triggered",
        "human",
        "desire",
        "since",
        "human",
        "nature",
        "driven",
        "infinite",
        "appetite",
        "never",
        "satisfied",
        "contain",
        "infinite",
        "indeed",
        "even",
        "great",
        "part",
        "desires",
        "therefore",
        "capable",
        "restraining",
        "appetite",
        "greatest",
        "king",
        "certainly",
        "unhappiest",
        "person",
        "de",
        "utilitate",
        "oo",
        "ii",
        "de",
        "sapientia",
        "oo",
        "a",
        "ba",
        "ed",
        "bracali",
        "fight",
        "propensity",
        "cherish",
        "illusory",
        "dream",
        "happiness",
        "somnium",
        "umbra",
        "umbra",
        "somnii",
        "cardano",
        "recommends",
        "u",
        "become",
        "aware",
        "precarious",
        "nature",
        "human",
        "condition",
        "humana",
        "fragilitas",
        "increase",
        "level",
        "selfmastery",
        "combined",
        "action",
        "selfknowledge",
        "nosce",
        "te",
        "ipsum",
        "selfcontrol",
        "impera",
        "te",
        "ipsum",
        "contributes",
        "narrow",
        "otherwise",
        "unmanageable",
        "scope",
        "desire",
        "theonoston",
        "oo",
        "ii",
        "b",
        "de",
        "consolatione",
        "oo",
        "a",
        "de",
        "utilitate",
        "oo",
        "ii",
        "ba",
        "selfawareness",
        "selfcontrol",
        "contribute",
        "create",
        "positive",
        "habit",
        "more",
        "action",
        "passion",
        "unlike",
        "nonhuman",
        "animal",
        "belluae",
        "human",
        "being",
        "capable",
        "disciplining",
        "imperare",
        "sibiipsis",
        "shape",
        "nature",
        "et",
        "naturam",
        "et",
        "more",
        "sibi",
        "formare",
        "paralipomena",
        "oo",
        "x",
        "a",
        "modify",
        "behavior",
        "thought",
        "cogitatio",
        "language",
        "sermo",
        "action",
        "actio",
        "action",
        "primarily",
        "directed",
        "useful",
        "u",
        "ruled",
        "criterion",
        "interest",
        "utile",
        "pleasure",
        "nature",
        "habit",
        "thought",
        "concentrate",
        "either",
        "useful",
        "harmful",
        "u",
        "language",
        "adjusts",
        "action",
        "thought",
        "variable",
        "circumstance",
        "present",
        "time",
        "time",
        "de",
        "utilitate",
        "oo",
        "ii",
        "a",
        "b",
        "de",
        "minimis",
        "a",
        "manage",
        "strike",
        "balance",
        "scope",
        "desire",
        "reality",
        "live",
        "two",
        "thing",
        "become",
        "necessary",
        "maxime",
        "necessaria",
        "obtain",
        "wish",
        "habere",
        "quod",
        "velis",
        "know",
        "use",
        "quae",
        "habes",
        "uti",
        "commode",
        "scire",
        "de",
        "utilitate",
        "oo",
        "ii",
        "facilitate",
        "task",
        "cardano",
        "distinguishes",
        "discipline",
        "theoretical",
        "aspect",
        "prevalent",
        "geometry",
        "theology",
        "discipline",
        "characterized",
        "balanced",
        "interplay",
        "theory",
        "scientia",
        "practice",
        "usus",
        "medicine",
        "law",
        "finally",
        "discipline",
        "practice",
        "exercitatio",
        "essential",
        "like",
        "moral",
        "philosophy",
        "cardano",
        "enumerates",
        "five",
        "requisite",
        "define",
        "nature",
        "accomplished",
        "action",
        "term",
        "attaining",
        "right",
        "mean",
        "right",
        "end",
        "adeptio",
        "readiness",
        "execution",
        "promptitudo",
        "completion",
        "perfectio",
        "requisite",
        "nature",
        "art",
        "diligence",
        "practice",
        "familiarity",
        "expert",
        "field",
        "de",
        "utilitate",
        "oo",
        "ii",
        "de",
        "sapientia",
        "oo",
        "b",
        "ed",
        "bracali"
    ]
}