{
    "main_text": "Philosophy of Mathematics and Natural Science\n3. Philosophy of Mathematics and Natural Science\n\nIt was noted above that Cassirer’s early historical works\ninterpret the development of modern thought as a whole (embracing both\nphilosophy and the sciences) from the perspective of the philosophical\nprinciples of Marburg neo-Kantianism, as initially articulated in\n[Cohen 1871]. On the “genetic” conception of scientific\nknowledge, in particular, the a priori synthetic activity of thought\n– the activity Kant himself had called “productive\nsynthesis” – is understood as a temporal and historical\ndevelopmental process in which the object of science is gradually and\nsuccessively constituted as a never completed “X” towards\nwhich the developmental process is converging. For Cohen, this process\nis modelled on the methods of the infinitesimal calculus (in this\nconnection, especially, see [Cohen 1883]). Beginning with the idea of\na continuous series or function, our problem is to see how such a\nseries can be a priori generated step-by-step. The mathematical\nconcept of a differential shows us how this can be done, for the\ndifferential at a point in the domain of a given function indicates\nhow it is to be continued on succeeding points. The differential\ntherefore infinitesimally captures the rule of the series as a whole,\nand thus expresses, at any given point or moment of time, the general\nform of the series valid for all times,\n\nCassirer’s first “systematic” work, Substance\nand Function [Cassirer 1910], takes an essential philosophical\nstep beyond Cohen by explicitly engaging with the late\nnineteenth-century developments in the foundations of mathematics and\nmathematical logic that exerted a profound influence on\ntwentieth-century philosophy of mathematics and natural science.\nCassirer begins by discussing the problem of concept formation, and by\ncriticizing, in particular, the “abstractionist” theory\ncharacteristic of philosophical empiricism, according to which general\nconcepts are arrived at by ascending inductively from sensory\nparticulars. This theory, for Cassirer, is an artifact of traditional\nAristotelian logic; and his main idea, accordingly, is that\ndevelopments in modern formal logic (the mathematical theory of\nrelations) allows us definitively to reject such abstractionism (and\nthus philosophical empiricism) on behalf of the genetic conception of\nknowledge. In particular, the modern axiomatic conception of\nmathematics, as exemplified especially in Richard Dedekind’s\nwork on the foundations of arithmetic and David Hilbert’s work\non the foundations of geometry, has shown that mathematics itself has\na purely formal and ideal, and thus entirely non-sensible meaning.\nPure mathematics describes abstract “systems of order”\n– what we would now call relational structures – whose\nconcepts can in no way be accommodated within abstractionist or\ninductivist philosophical empiricism. Cassirer then employs this\n“formalist” conception of mathematics characteristic of\nthe late nineteenth century to craft a new, and more abstract, version\nof the genetic conception of knowledge. We conceive the developmental\nprocess in question as a series or sequence of abstract formal\nstructures (“systems of order”), which is itself ordered\nby the abstract mathematical relation of approximate\nbackwards-directed inclusion (as, for example, the new non-Euclidean\ngeometries contain the older geometry of Euclid as a continuously\napproximated limiting case). In this way, we can conceive all the\nstructures in our sequence as continuously converging, as it were, on\na final or limit structure, such that all previous structures in the\nsequence are approximate special or limiting cases of this final\nstructure. The idea of such an endpoint of the sequence is only a\nregulative ideal in the Kantian sense – it is only progressively\napproximated but never in fact actually realized. Nevertheless, it\nstill constitutes the a priori “general serial form” of\nour properly empirical mathematical theorizing, and, at the same time,\nit bestows on this theorizing its characteristic form of\nobjectivity.\n\nIn explicitly embracing late nineteenth-century work on the\nfoundations of mathematics, Cassirer comes into very close proximity\nwith early twentieth-century analytic philosophy. Indeed, Cassirer\ntakes the modern mathematical logic implicit in the work of Dedekind\nand Hilbert, and explicit in the work of Gottlob Frege and the early\nBertrand Russell, as providing us with our primary tool for moving\nbeyond the empiricist abstractionism due ultimately to Aristotelian\nsyllogistic. The modern “theory of the concept,”\naccordingly, is based on the fundamental notions of function, series,\nand order (relational structure) – where these notions, from the\npoint of view of pure mathematics and pure logic, are entirely formal\nand abstract, having no intuitive relation, in particular, to either\nspace or time. Nevertheless, and here is where Cassirer diverges from\nmost of the analytic tradition, this modern theory of the concept only\nprovides us with a genuine and complete alternative to Aristotelian\nabstractionism and philosophical empiricism when it is embedded within\nthe genetic conception of knowledge. What is primary is the generative\nhistorical process by which modern mathematical natural science\nsuccessively develops or evolves, and pure mathematics and pure logic\nonly have philosophical significance as elements of or abstractions\nfrom this more fundamental developmental process of “productive\nsynthesis” aimed at the application of such pure formal\nstructures in empirical knowledge (see especially [Cassirer\n1907b]).\n\nCassirer’s next important contribution to scientific\nepistemology [Cassirer 1921] explores the relationship between\nEinstein’s general theory of relativity and the\n“critical” (Marburg neo-Kantian) conception of knowledge.\nCassirer argues that Einstein’s theory in fact stands as a\nbrilliant confirmation of this conception. On the one hand, the\nincreasing use of abstract mathematical representations in\nEinstein’s theory entirely supports the attack on Aristotelian\nabstractionism and philosophical empiricism. On the other hand,\nhowever, Einstein’s use of non-Euclidean geometry presents no\nobstacle at all to our purified and generalized form of\n(neo-)Kantianism. For we no longer require that any particular\nmathematical structure be fixed for all time, but only that the\nhistorical-developmental sequence of such structures continuously\nconverge. Einstein’s theory satisfies this requirement perfectly\nwell, since the Euclidean geometry fundamental to Newtonian physics is\nindeed contained in the more general geometry (of variable curvature)\nemployed by Einstein as an approximate special case (as the regions\nconsidered become infinitely small, for example). Moritz Schlick\npublished a review of Cassirer’s book immediately after its\nfirst appearance [Schlick 1921], taking the occasion to argue (what\nlater became a prominent theme in the philosophy of logical\nempiricism) that Einstein’s theory of relativity provides us\nwith a decisive refutation of Kantianism in all of its forms. This\nreview marked the beginnings of a respectful philosophical exchange\nbetween the two, as noted above, and it was continued, in the context\nof Cassirer’s later work on the philosophy of symbolic forms, in\n[Cassirer 1927b] (see [Friedman 2000, chap. 7]).\n\nCassirer’s assimilation of Einstein’s general theory of\nrelativity marked a watershed in the development of his thought. It\nnot only gave him an opportunity, as we have just seen, to reinterpret\nthe Kantian theory of the a priori conditions of objective experience\n(especially as involving space and time) in terms of Cassirer’s\nown version of the genetic conception of knowledge, but it also\nprovided him with an impetus to generalize and extend the original\nMarburg view in such a way that modern mathematical scientific\nknowledge in general is now seen as just one possible “symbolic\nform” among other equally valid and legitimate such forms.\nIndeed, [Cassirer 1921] first officially announces the project of a\ngeneral “philosophy of symbolic forms,” conceived, in this\ncontext, as a philosophical extension of “the general postulate\nof relativity.” Just as, according to the general postulate of\nrelativity, all possible reference frames and coordinate systems are\nviewed as equally good representations of physical reality, and, as a\ntotality, are together interrelated and embraced by precisely this\npostulate, similarly the totality of “symbolic forms”\n– aesthetic, ethical, religious, scientific – are here\nenvisioned by Cassirer as standing in a closely analogous\nrelationship. So it is no wonder that, subsequent to taking up the\nprofessorship at Hamburg in 1919, Cassirer devotes the rest of his\ncareer to this new philosophy of symbolic forms. (Cassirer’s\nwork in the philosophy of natural science in particular also\ncontinued, notably in [Cassirer 1936].)\n",
    "section_title": "3. Philosophy of Mathematics and Natural Science",
    "entry_title": "Ernst Cassirer",
    "hierarchy_title": "Ernst Cassirer || Philosophy of Mathematics and Natural Science",
    "tokenized_text": [
        "philosophy",
        "mathematics",
        "natural",
        "science",
        "philosophy",
        "mathematics",
        "natural",
        "science",
        "noted",
        "cassirer",
        "early",
        "historical",
        "work",
        "interpret",
        "development",
        "modern",
        "thought",
        "whole",
        "embracing",
        "philosophy",
        "science",
        "perspective",
        "philosophical",
        "principle",
        "marburg",
        "neokantianism",
        "initially",
        "articulated",
        "cohen",
        "genetic",
        "conception",
        "scientific",
        "knowledge",
        "particular",
        "priori",
        "synthetic",
        "activity",
        "thought",
        "activity",
        "kant",
        "called",
        "productive",
        "synthesis",
        "understood",
        "temporal",
        "historical",
        "developmental",
        "process",
        "object",
        "science",
        "gradually",
        "successively",
        "constituted",
        "never",
        "completed",
        "x",
        "towards",
        "developmental",
        "process",
        "converging",
        "cohen",
        "process",
        "modelled",
        "method",
        "infinitesimal",
        "calculus",
        "connection",
        "especially",
        "see",
        "cohen",
        "beginning",
        "idea",
        "continuous",
        "series",
        "function",
        "problem",
        "see",
        "series",
        "priori",
        "generated",
        "stepbystep",
        "mathematical",
        "concept",
        "differential",
        "show",
        "u",
        "done",
        "differential",
        "point",
        "domain",
        "given",
        "function",
        "indicates",
        "continued",
        "succeeding",
        "point",
        "differential",
        "therefore",
        "infinitesimally",
        "capture",
        "rule",
        "series",
        "whole",
        "thus",
        "express",
        "given",
        "point",
        "moment",
        "time",
        "general",
        "form",
        "series",
        "valid",
        "time",
        "cassirer",
        "first",
        "systematic",
        "work",
        "substance",
        "function",
        "cassirer",
        "take",
        "essential",
        "philosophical",
        "step",
        "beyond",
        "cohen",
        "explicitly",
        "engaging",
        "late",
        "nineteenthcentury",
        "development",
        "foundation",
        "mathematics",
        "mathematical",
        "logic",
        "exerted",
        "profound",
        "influence",
        "twentiethcentury",
        "philosophy",
        "mathematics",
        "natural",
        "science",
        "cassirer",
        "begin",
        "discussing",
        "problem",
        "concept",
        "formation",
        "criticizing",
        "particular",
        "abstractionist",
        "theory",
        "characteristic",
        "philosophical",
        "empiricism",
        "according",
        "general",
        "concept",
        "arrived",
        "ascending",
        "inductively",
        "sensory",
        "particular",
        "theory",
        "cassirer",
        "artifact",
        "traditional",
        "aristotelian",
        "logic",
        "main",
        "idea",
        "accordingly",
        "development",
        "modern",
        "formal",
        "logic",
        "mathematical",
        "theory",
        "relation",
        "allows",
        "u",
        "definitively",
        "reject",
        "abstractionism",
        "thus",
        "philosophical",
        "empiricism",
        "behalf",
        "genetic",
        "conception",
        "knowledge",
        "particular",
        "modern",
        "axiomatic",
        "conception",
        "mathematics",
        "exemplified",
        "especially",
        "richard",
        "dedekind",
        "work",
        "foundation",
        "arithmetic",
        "david",
        "hilbert",
        "work",
        "foundation",
        "geometry",
        "shown",
        "mathematics",
        "purely",
        "formal",
        "ideal",
        "thus",
        "entirely",
        "nonsensible",
        "meaning",
        "pure",
        "mathematics",
        "describes",
        "abstract",
        "system",
        "order",
        "would",
        "call",
        "relational",
        "structure",
        "whose",
        "concept",
        "way",
        "accommodated",
        "within",
        "abstractionist",
        "inductivist",
        "philosophical",
        "empiricism",
        "cassirer",
        "employ",
        "formalist",
        "conception",
        "mathematics",
        "characteristic",
        "late",
        "nineteenth",
        "century",
        "craft",
        "new",
        "abstract",
        "version",
        "genetic",
        "conception",
        "knowledge",
        "conceive",
        "developmental",
        "process",
        "question",
        "series",
        "sequence",
        "abstract",
        "formal",
        "structure",
        "system",
        "order",
        "ordered",
        "abstract",
        "mathematical",
        "relation",
        "approximate",
        "backwardsdirected",
        "inclusion",
        "example",
        "new",
        "noneuclidean",
        "geometry",
        "contain",
        "older",
        "geometry",
        "euclid",
        "continuously",
        "approximated",
        "limiting",
        "case",
        "way",
        "conceive",
        "structure",
        "sequence",
        "continuously",
        "converging",
        "final",
        "limit",
        "structure",
        "previous",
        "structure",
        "sequence",
        "approximate",
        "special",
        "limiting",
        "case",
        "final",
        "structure",
        "idea",
        "endpoint",
        "sequence",
        "regulative",
        "ideal",
        "kantian",
        "sense",
        "progressively",
        "approximated",
        "never",
        "fact",
        "actually",
        "realized",
        "nevertheless",
        "still",
        "constitutes",
        "priori",
        "general",
        "serial",
        "form",
        "properly",
        "empirical",
        "mathematical",
        "theorizing",
        "time",
        "bestows",
        "theorizing",
        "characteristic",
        "form",
        "objectivity",
        "explicitly",
        "embracing",
        "late",
        "nineteenthcentury",
        "work",
        "foundation",
        "mathematics",
        "cassirer",
        "come",
        "close",
        "proximity",
        "early",
        "twentiethcentury",
        "analytic",
        "philosophy",
        "indeed",
        "cassirer",
        "take",
        "modern",
        "mathematical",
        "logic",
        "implicit",
        "work",
        "dedekind",
        "hilbert",
        "explicit",
        "work",
        "gottlob",
        "frege",
        "early",
        "bertrand",
        "russell",
        "providing",
        "u",
        "primary",
        "tool",
        "moving",
        "beyond",
        "empiricist",
        "abstractionism",
        "due",
        "ultimately",
        "aristotelian",
        "syllogistic",
        "modern",
        "theory",
        "concept",
        "accordingly",
        "based",
        "fundamental",
        "notion",
        "function",
        "series",
        "order",
        "relational",
        "structure",
        "notion",
        "point",
        "view",
        "pure",
        "mathematics",
        "pure",
        "logic",
        "entirely",
        "formal",
        "abstract",
        "intuitive",
        "relation",
        "particular",
        "either",
        "space",
        "time",
        "nevertheless",
        "cassirer",
        "diverges",
        "analytic",
        "tradition",
        "modern",
        "theory",
        "concept",
        "provides",
        "u",
        "genuine",
        "complete",
        "alternative",
        "aristotelian",
        "abstractionism",
        "philosophical",
        "empiricism",
        "embedded",
        "within",
        "genetic",
        "conception",
        "knowledge",
        "primary",
        "generative",
        "historical",
        "process",
        "modern",
        "mathematical",
        "natural",
        "science",
        "successively",
        "develops",
        "evolves",
        "pure",
        "mathematics",
        "pure",
        "logic",
        "philosophical",
        "significance",
        "element",
        "abstraction",
        "fundamental",
        "developmental",
        "process",
        "productive",
        "synthesis",
        "aimed",
        "application",
        "pure",
        "formal",
        "structure",
        "empirical",
        "knowledge",
        "see",
        "especially",
        "cassirer",
        "b",
        "cassirer",
        "next",
        "important",
        "contribution",
        "scientific",
        "epistemology",
        "cassirer",
        "explores",
        "relationship",
        "einstein",
        "general",
        "theory",
        "relativity",
        "critical",
        "marburg",
        "neokantian",
        "conception",
        "knowledge",
        "cassirer",
        "argues",
        "einstein",
        "theory",
        "fact",
        "stand",
        "brilliant",
        "confirmation",
        "conception",
        "one",
        "hand",
        "increasing",
        "use",
        "abstract",
        "mathematical",
        "representation",
        "einstein",
        "theory",
        "entirely",
        "support",
        "attack",
        "aristotelian",
        "abstractionism",
        "philosophical",
        "empiricism",
        "hand",
        "however",
        "einstein",
        "use",
        "noneuclidean",
        "geometry",
        "present",
        "obstacle",
        "purified",
        "generalized",
        "form",
        "neo",
        "kantianism",
        "longer",
        "require",
        "particular",
        "mathematical",
        "structure",
        "fixed",
        "time",
        "historicaldevelopmental",
        "sequence",
        "structure",
        "continuously",
        "converge",
        "einstein",
        "theory",
        "satisfies",
        "requirement",
        "perfectly",
        "well",
        "since",
        "euclidean",
        "geometry",
        "fundamental",
        "newtonian",
        "physic",
        "indeed",
        "contained",
        "general",
        "geometry",
        "variable",
        "curvature",
        "employed",
        "einstein",
        "approximate",
        "special",
        "case",
        "region",
        "considered",
        "become",
        "infinitely",
        "small",
        "example",
        "moritz",
        "schlick",
        "published",
        "review",
        "cassirer",
        "book",
        "immediately",
        "first",
        "appearance",
        "schlick",
        "taking",
        "occasion",
        "argue",
        "later",
        "became",
        "prominent",
        "theme",
        "philosophy",
        "logical",
        "empiricism",
        "einstein",
        "theory",
        "relativity",
        "provides",
        "u",
        "decisive",
        "refutation",
        "kantianism",
        "form",
        "review",
        "marked",
        "beginning",
        "respectful",
        "philosophical",
        "exchange",
        "two",
        "noted",
        "continued",
        "context",
        "cassirer",
        "later",
        "work",
        "philosophy",
        "symbolic",
        "form",
        "cassirer",
        "b",
        "see",
        "friedman",
        "chap",
        "cassirer",
        "assimilation",
        "einstein",
        "general",
        "theory",
        "relativity",
        "marked",
        "watershed",
        "development",
        "thought",
        "gave",
        "opportunity",
        "seen",
        "reinterpret",
        "kantian",
        "theory",
        "priori",
        "condition",
        "objective",
        "experience",
        "especially",
        "involving",
        "space",
        "time",
        "term",
        "cassirer",
        "version",
        "genetic",
        "conception",
        "knowledge",
        "also",
        "provided",
        "impetus",
        "generalize",
        "extend",
        "original",
        "marburg",
        "view",
        "way",
        "modern",
        "mathematical",
        "scientific",
        "knowledge",
        "general",
        "seen",
        "one",
        "possible",
        "symbolic",
        "form",
        "among",
        "equally",
        "valid",
        "legitimate",
        "form",
        "indeed",
        "cassirer",
        "first",
        "officially",
        "announces",
        "project",
        "general",
        "philosophy",
        "symbolic",
        "form",
        "conceived",
        "context",
        "philosophical",
        "extension",
        "general",
        "postulate",
        "relativity",
        "according",
        "general",
        "postulate",
        "relativity",
        "possible",
        "reference",
        "frame",
        "coordinate",
        "system",
        "viewed",
        "equally",
        "good",
        "representation",
        "physical",
        "reality",
        "totality",
        "together",
        "interrelated",
        "embraced",
        "precisely",
        "postulate",
        "similarly",
        "totality",
        "symbolic",
        "form",
        "aesthetic",
        "ethical",
        "religious",
        "scientific",
        "envisioned",
        "cassirer",
        "standing",
        "closely",
        "analogous",
        "relationship",
        "wonder",
        "subsequent",
        "taking",
        "professorship",
        "hamburg",
        "cassirer",
        "devotes",
        "rest",
        "career",
        "new",
        "philosophy",
        "symbolic",
        "form",
        "cassirer",
        "work",
        "philosophy",
        "natural",
        "science",
        "particular",
        "also",
        "continued",
        "notably",
        "cassirer"
    ]
}