{
    "main_text": "Cassirer, Hegel and the Cultural Sciences\n6. The Myth of the State\n\nIn the Preface to the third volume of The Philosophy of Symbolic\nForms, the Phenomenology of Knowledge (1929), Cassirer\nexplains that his concept of phenomenology is precisely the\nHegelian one [Cassirer (1929, vi–vii)]: “When I speak of a\n‘Phenomenology of Knowledge,’ I do not align\nmyself with modern usage, but I go back to the fundamental meaning of\n‘phenomenology’ as Hegel established and systematically\ngrounded and justified it. For Hegel phenomenology becomes the\nfundamental presupposition of philosophical knowledge, because he\nrequires of the latter that it comprehend the totality of spiritual\nforms, and because this totality, according to him, can only be made\nvisible in the transition from one form to another. [There follows a\nquote from the Preface to the effect that the individual has a\nright to demand that (philosophical) science provide a ladder by which\nto reach up to it.] It cannot be expressed more sharply that the\nend, the ‘telos’ of spirit cannot be grasped and expressed\nif one takes it as something self-subsistent, if one takes it as\ndissolved and separated from the beginning and the middle.\nPhilosophical reflection does not set the end against the middle and\nthe beginning in this way, but rather takes all three as integrating\nmoments of a unitary total development.”\n\nThe Preface to the second volume, on Mythical Thought (1925),\ninvokes Hegel in the same vein, while also indicating Cassirer’s\nremaining fundamental disagreement with him. For Hegel [Hegel (GW 9,\n23)]: “Science for its part demands that self-consciousness\nraise itself into this ether, in order that it may live with and for\nscience. Conversely, the individual has the right to demand that\nscience shall at least provide him with a ladder by which to reach to\nthis height, and show it to him in himself. This right is based on the\nabsolute independence which he knows himself to possess in every form\nof knowledge; for in each form, whether it be recognized by science or\nnot, and regardless of what its content may be, it is absolute\nform – that is, it is the immediate certainty of itself, and, if\nthis term be preferred, it is therefore absolute being.”\n\nCassirer modifies Hegel in 1925 [Cassirer (1925, ix–x)]:\n“Seen in this way, the problem of myth bursts the bounds of\npsychology and psychologism and takes its place in that universal\ndomain of problems which Hegel designated as ‘phenomenology of\nspirit.’ That myth stands to the universal task of the\nphenomenology of spirit in an internal and necessary relationship can\nbe mediately derived from Hegel’s own conception and\ndetermination of this concept: ‘The spirit which … knows\nitself as developed spirit,’ he writes in the preface to the\nPhänomenologie des Geistes, ‘is science.’\n[Thus begins a considerably longer quotation from (GW 9, 22–4),\nwhich concludes ‘Knowledge in its first phase, or immediate\nspirit, is non-spiritual, i.e., sensible\nconsciousness.’] These propositions, in which Hegel\ncharacterizes the relationship of ‘science’ to sensible\nconsciousness, are valid to the full extent and with full precision\nfor the relationship of knowledge to mythical consciousness. For the\nproper point of departure for all becoming of science, its beginning\nin the immediate, lies not so much in the sphere of sensible intuition\nas in that of mythical [intuition]… If, therefore, in\naccordance with Hegel’s demand, ‘science’ is\nsupposed to offer the ladder to natural consciousness that leads to\nitself, then it must set this ladder one more rung lower.”\n\nIn going beyond sensible consciousness to mythical consciousness,\nCassirer emphasizes a non-rational symbolic form as the basis\nof all the rest. This emphasis had its most striking philosophical\npayoff in one of Cassirer’s last works, The Myth of the\nState, which appeared in the year after his death in 1945.\nCassirer had written this work encouraged by his colleagues at Yale,\nas a way in which he could apply his philosophy of symbolic forms to\nthe great calamity of the time – the rise of National Socialism in\nGermany and the resulting Second World War. Cassirer’s diagnosis\nof this situation is that it depended on the use of modern\ntechnologies of mass communication to awaken, manipulate, and exploit\nthe essentially non-rational mythical functions of thought that are\nalways still present in every human being. Cassirer singles out two\nGerman thinkers, Hegel and Spengler, as contributing especially to the\nNazi glorification of the totalitarian state – the former less\nculpably as the most important political philosopher in the nineteenth\ncentury background to what Cassirer calls the “modern political\nmyth,” the latter much more culpably as this myth was just\ncoming into being in the twentieth.\n\nCassirer developed in Göteborg his characteristic perspective on\nthe relationship between the natural and cultural sciences, which also\nappealed especially to the expressive function of thought. It\nwas in connection with this work that he articulated a pithy defense\nof Kant’s regulative conception of infinitely distant practical\nideals (e.g., the Kingdom of Ends) against what he takes to\nbe the oppressive (speculative) infinity of Hegel’s Absolute\nReason [Cassirer (1939, 28)]: “In his philosophy of history\nHegel wanted to provide the definitive speculative demonstration that\nreason is substance and infinite power. For this, however, we must,\naccording to him, above all attain the insight that reason is\n‘not so powerless as to pass for a mere ideal, a mere\nought.’ This form of proof has become shaky; the\ncritique of the foundations of the Hegelian system has pulled the\nground out from under it. If we turn back from the Hegelian meaning of\nidea to the Kantian, from the idea as ‘absolute power’\nback to the idea as ‘infinite problem,’ we must of course\ngive up the speculative optimism of the Hegelian view of history. But,\nat the same time, we thereby also avoid fatalistic pessimism with its\nprophecies and visions of decline [Untergangsprophezeiungen und\nUntergangsvisionen]. [Our] acting again has a free path to decide\nfor itself out of its own force and responsibility, and it knows that\nthe direction and future of culture will depend on the manner of this\ndecision.”\n\nHere one already sees, in the two penultimate sentences, the fateful\njuxtaposition of Hegel and Spengler: the former as philosopher of\nhistory and of right; the latter as the author of The Decline of\nthe West (1918), which can only be called a totalitarian social\ntechnology.\n\nHegel’s historical and political writings should be\ndistinguished from the earlier Phenomenology of Spirit. Hegel\nwas then a creature of the Enlightenment – albeit at a time later\nthan Kant’s when the aftermath of the French Revolution and the\nNapoleonic wars had begun in earnest along with the Industrial\nRevolution.\n\nThe first topic addressed in Hegel’s Phenomenology is\nconsciousness, beginning with the well-known discussion of\nsense-certainty and the this. The next topic is\nself-consciousness, which begins with the famous discussion\nof mastery and servitude. It here becomes clear that\nthe self-consciousness in question is that of what is sometimes called\n“modern subjectivity,” focusing on the first-person\nsingular pronoun I – but equally, in this case, on the\nsecond-person singular you and the first-person plural\nwe. Here Hegel follows in the footsteps of the Fichtean\nconception of recognition. But Hegel also adds an essential element of\nstruggle, conflict, and competition depending on inequalities between\nI and you, or, more generally, among the members of\nany community of self-conscious human beings (we). This\nelement is indebted to Rousseau’s Discourse on the Origin of\nInequality (1755), to which Kant’s conception of\n“unsocial sociability,” introduced in Ideas towards a\nUniversal History with a Cosmopolitan Aim (1784), is also\nindebted. The difference between Kant and Hegel, in this respect, is\nthat such ideas arise only in the context of Kant’s practical\nphilosophy, while they arise at the beginning of the discussion of\nself-consciousness in Hegel’s Phenomenology. Or, to put\nit another way, while Kant distinguishes between theoretical and\npractical reason, only then to build a bridge between them in the\nCritique of the Power of Judgement, Hegel’s discussion\nof self-consciousness in the Phenomenology initiates the\ndevelopment of a unified conception of reason as such, at once both\ntheoretical and practical.\n\nWhat is at issue is the actualization or realization of rational\nconcepts or ideas, as typified, for Kant, by the ideas of God,\nFreedom, and Immortality produced by pure practical reason.\nKant holds that, as a matter of fact (the Fact of Reason), we have\nsuch a faculty, which produces these ideas and also gives them\nmotivating force for us. But there is still always the question of\nwhether we shall actually choose to follow this purely rational\nmotivation, and so Kant develops an elaborate theory of how we can\ncultivate and develop the means for strengthening and supporting it at\nthe expense of motivations to the contrary (always still present due\nto unsocial sociability).\n\nFor Hegel, by contrast, a rational idea is a normative conception or\nstructure, which, to be normative at all, needs to function as a\nnorm (as a law) within some actual human community.\nRational ideas, as such, are actualized or realized in human history,\nso that the questions then becomes one of understanding the\nhistorical-conceptual processes that can lead us towards higher forms\nof consciousness through increasingly comprehensive and coherent\nnormative structures. This leads to the pivotal section on\nspirit in the Phenomenology, where the historical\npart of the exposition reaches a culmination, of sorts, in the\ndiscussion of the Enlightenment and the French Revolution, the\nhistorical context wherein Hegel himself is located. And this sets the\nstage for the penultimate discussion of religion as the means for\nsolving the remaining problem of fully internalizing the norms of\nmorality by all members of a human community located within this same\nhistorical context.\n\nThe problem of internalization involves the need to unify the\nuniversal objective laws of morality with the particular individuals\nwho make up the relevant community. These laws must be incorporated,\nthat is, within the subjective consciousness of each individual, and\nHegel interprets the doctrine of the incarnation thusly. In\nparticular, it is within a philosophically enlightened Christianity,\npracticed within a philosophically enlightened religious community,\nthat the divine is incarnated within the lives of human beings. As\nHegel puts it at the end of the section on morality [Hegel\n(GW 9, 362)]: “[I]t is God manifested in the midst of those who\nknow themselves in the form of pure knowledge.”\n\nKant develops an Enlightenment version of moral religion in his\nReligion within the Boundaries of Pure Reason (1793).\nVirtue, for Kant, is an enduring disposition to follow the\nmoral law at the expense of motivation to the contrary, and it is this\ndisposition, in particular, that needs to be cultivated and nurtured\nwithin our moral sentiments. However, since the problem of unsocial\nsociability is the primary obstacle to virtue, we need a social\nsolution to the problem. This solution, for Kant, is an ethical\ncommunity or “ethical state” (in contrast to a legal\n“juridical state”), in which mutual encouragement and\nsupport in the development of the required disposition (rather than\nfear of legal sanctions) is the primary means of achieving the desired\nresult. Such an ethical community is what Kant calls a\n“church.” And he goes on to say that we must look to the\nhistory of religion to trace the development of such communities,\nasserts (not surprisingly) that Christianity (through the doctrine of\nChrist as the redeemer) is the best we have so far, and concludes,\nfinally, that only the regulative ideal of a universal church\nembracing all of humanity – a church of reason – can fully\nserve the goal of developing perfect, and therefore universal\nvirtue.\n\nKant and Hegel are not so very different in their Enlightenment\nambitions. They are both concerned with universal normative principles\nand the actualization of these principles in existing human\ncommunities. Moreover, they both find a culmination of this process in\nwhat they take to be the best form of religion of the\ntime – Christianity, and, in particular, Lutheranism – which\nonly needs to be fully rationalized and universalized in accordance\nwith Enlightenment demands. The difference between the two, once\nagain, is that, while Kant attempts to meet these demands by sharply\ndistinguishing among different faculties of the mind – in this\ncase, theoretical and practical reason – between which he then\nbuilds a bridge, Hegel attempts to meet these same demands by\narticulating a unified conception of reason as such, at once both\ntheoretical and practical.\n\nIn the case of Cassirer, by contrast, although he is certainly a\nfollower and champion of the Enlightenment, he is by no means a\nthinker of the Enlightenment itself. He is instead a creature\nof the twentieth century, confronted with forms of science, and also\nof socio-political organization, technology, warfare, and much else,\nwhich could not have been envisaged by either Kant or Hegel. Moreover,\nthe unprecedented horrors of the first half of the twentieth century\nput Cassirer in a very different moral universe in which no religious\nor cultural tradition could simply be taken for granted. This is clear\nin Cassirer’s discussion of religion at the end of Mythical\nThought, which, in contrast to both Kant and Hegel, ranks art\nrather than religion as the highest development of the expressive\nfunction of symbolic meaning. We must, in the end, acknowledge that\nCassirer’s discussion of myth sheds a bright light on one of the\nmost important problems of his time, namely, the rise of the\ntechnologically driven totalitarian state – a problem that\ncontinues increasingly to threaten us even today.\n",
    "section_title": "6. The Myth of the State",
    "entry_title": "Ernst Cassirer",
    "hierarchy_title": "Ernst Cassirer || Cassirer, Hegel and the Cultural Sciences",
    "tokenized_text": [
        "cassirer",
        "hegel",
        "cultural",
        "science",
        "myth",
        "state",
        "preface",
        "third",
        "volume",
        "philosophy",
        "symbolic",
        "form",
        "phenomenology",
        "knowledge",
        "cassirer",
        "explains",
        "concept",
        "phenomenology",
        "precisely",
        "hegelian",
        "one",
        "cassirer",
        "vivii",
        "speak",
        "phenomenology",
        "knowledge",
        "align",
        "modern",
        "usage",
        "go",
        "back",
        "fundamental",
        "meaning",
        "phenomenology",
        "hegel",
        "established",
        "systematically",
        "grounded",
        "justified",
        "hegel",
        "phenomenology",
        "becomes",
        "fundamental",
        "presupposition",
        "philosophical",
        "knowledge",
        "requires",
        "latter",
        "comprehend",
        "totality",
        "spiritual",
        "form",
        "totality",
        "according",
        "made",
        "visible",
        "transition",
        "one",
        "form",
        "another",
        "follows",
        "quote",
        "preface",
        "effect",
        "individual",
        "right",
        "demand",
        "philosophical",
        "science",
        "provide",
        "ladder",
        "reach",
        "expressed",
        "sharply",
        "end",
        "telos",
        "spirit",
        "grasped",
        "expressed",
        "one",
        "take",
        "something",
        "selfsubsistent",
        "one",
        "take",
        "dissolved",
        "separated",
        "beginning",
        "middle",
        "philosophical",
        "reflection",
        "set",
        "end",
        "middle",
        "beginning",
        "way",
        "rather",
        "take",
        "three",
        "integrating",
        "moment",
        "unitary",
        "total",
        "development",
        "preface",
        "second",
        "volume",
        "mythical",
        "thought",
        "invokes",
        "hegel",
        "vein",
        "also",
        "indicating",
        "cassirer",
        "remaining",
        "fundamental",
        "disagreement",
        "hegel",
        "hegel",
        "gw",
        "science",
        "part",
        "demand",
        "selfconsciousness",
        "raise",
        "ether",
        "order",
        "may",
        "live",
        "science",
        "conversely",
        "individual",
        "right",
        "demand",
        "science",
        "shall",
        "least",
        "provide",
        "ladder",
        "reach",
        "height",
        "show",
        "right",
        "based",
        "absolute",
        "independence",
        "know",
        "posse",
        "every",
        "form",
        "knowledge",
        "form",
        "whether",
        "recognized",
        "science",
        "regardless",
        "content",
        "may",
        "absolute",
        "form",
        "immediate",
        "certainty",
        "term",
        "preferred",
        "therefore",
        "absolute",
        "being",
        "cassirer",
        "modifies",
        "hegel",
        "cassirer",
        "ixx",
        "seen",
        "way",
        "problem",
        "myth",
        "burst",
        "bound",
        "psychology",
        "psychologism",
        "take",
        "place",
        "universal",
        "domain",
        "problem",
        "hegel",
        "designated",
        "phenomenology",
        "spirit",
        "myth",
        "stand",
        "universal",
        "task",
        "phenomenology",
        "spirit",
        "internal",
        "necessary",
        "relationship",
        "mediately",
        "derived",
        "hegel",
        "conception",
        "determination",
        "concept",
        "spirit",
        "know",
        "developed",
        "spirit",
        "writes",
        "preface",
        "phänomenologie",
        "de",
        "geistes",
        "science",
        "thus",
        "begin",
        "considerably",
        "longer",
        "quotation",
        "gw",
        "concludes",
        "knowledge",
        "first",
        "phase",
        "immediate",
        "spirit",
        "nonspiritual",
        "ie",
        "sensible",
        "consciousness",
        "proposition",
        "hegel",
        "characterizes",
        "relationship",
        "science",
        "sensible",
        "consciousness",
        "valid",
        "full",
        "extent",
        "full",
        "precision",
        "relationship",
        "knowledge",
        "mythical",
        "consciousness",
        "proper",
        "point",
        "departure",
        "becoming",
        "science",
        "beginning",
        "immediate",
        "lie",
        "much",
        "sphere",
        "sensible",
        "intuition",
        "mythical",
        "intuition",
        "therefore",
        "accordance",
        "hegel",
        "demand",
        "science",
        "supposed",
        "offer",
        "ladder",
        "natural",
        "consciousness",
        "lead",
        "must",
        "set",
        "ladder",
        "one",
        "rung",
        "lower",
        "going",
        "beyond",
        "sensible",
        "consciousness",
        "mythical",
        "consciousness",
        "cassirer",
        "emphasizes",
        "nonrational",
        "symbolic",
        "form",
        "basis",
        "rest",
        "emphasis",
        "striking",
        "philosophical",
        "payoff",
        "one",
        "cassirer",
        "last",
        "work",
        "myth",
        "state",
        "appeared",
        "year",
        "death",
        "cassirer",
        "written",
        "work",
        "encouraged",
        "colleague",
        "yale",
        "way",
        "could",
        "apply",
        "philosophy",
        "symbolic",
        "form",
        "great",
        "calamity",
        "time",
        "rise",
        "national",
        "socialism",
        "germany",
        "resulting",
        "second",
        "world",
        "war",
        "cassirer",
        "diagnosis",
        "situation",
        "depended",
        "use",
        "modern",
        "technology",
        "mass",
        "communication",
        "awaken",
        "manipulate",
        "exploit",
        "essentially",
        "nonrational",
        "mythical",
        "function",
        "thought",
        "always",
        "still",
        "present",
        "every",
        "human",
        "cassirer",
        "single",
        "two",
        "german",
        "thinker",
        "hegel",
        "spengler",
        "contributing",
        "especially",
        "nazi",
        "glorification",
        "totalitarian",
        "state",
        "former",
        "le",
        "culpably",
        "important",
        "political",
        "philosopher",
        "nineteenth",
        "century",
        "background",
        "cassirer",
        "call",
        "modern",
        "political",
        "myth",
        "latter",
        "much",
        "culpably",
        "myth",
        "coming",
        "twentieth",
        "cassirer",
        "developed",
        "göteborg",
        "characteristic",
        "perspective",
        "relationship",
        "natural",
        "cultural",
        "science",
        "also",
        "appealed",
        "especially",
        "expressive",
        "function",
        "thought",
        "connection",
        "work",
        "articulated",
        "pithy",
        "defense",
        "kant",
        "regulative",
        "conception",
        "infinitely",
        "distant",
        "practical",
        "ideal",
        "eg",
        "kingdom",
        "end",
        "take",
        "oppressive",
        "speculative",
        "infinity",
        "hegel",
        "absolute",
        "reason",
        "cassirer",
        "philosophy",
        "history",
        "hegel",
        "wanted",
        "provide",
        "definitive",
        "speculative",
        "demonstration",
        "reason",
        "substance",
        "infinite",
        "power",
        "however",
        "must",
        "according",
        "attain",
        "insight",
        "reason",
        "powerless",
        "pas",
        "mere",
        "ideal",
        "mere",
        "ought",
        "form",
        "proof",
        "become",
        "shaky",
        "critique",
        "foundation",
        "hegelian",
        "system",
        "pulled",
        "ground",
        "turn",
        "back",
        "hegelian",
        "meaning",
        "idea",
        "kantian",
        "idea",
        "absolute",
        "power",
        "back",
        "idea",
        "infinite",
        "problem",
        "must",
        "course",
        "give",
        "speculative",
        "optimism",
        "hegelian",
        "view",
        "history",
        "time",
        "thereby",
        "also",
        "avoid",
        "fatalistic",
        "pessimism",
        "prophecy",
        "vision",
        "decline",
        "untergangsprophezeiungen",
        "und",
        "untergangsvisionen",
        "acting",
        "free",
        "path",
        "decide",
        "force",
        "responsibility",
        "know",
        "direction",
        "future",
        "culture",
        "depend",
        "manner",
        "decision",
        "one",
        "already",
        "see",
        "two",
        "penultimate",
        "sentence",
        "fateful",
        "juxtaposition",
        "hegel",
        "spengler",
        "former",
        "philosopher",
        "history",
        "right",
        "latter",
        "author",
        "decline",
        "west",
        "called",
        "totalitarian",
        "social",
        "technology",
        "hegel",
        "historical",
        "political",
        "writing",
        "distinguished",
        "earlier",
        "phenomenology",
        "spirit",
        "hegel",
        "creature",
        "enlightenment",
        "albeit",
        "time",
        "later",
        "kant",
        "aftermath",
        "french",
        "revolution",
        "napoleonic",
        "war",
        "begun",
        "earnest",
        "along",
        "industrial",
        "revolution",
        "first",
        "topic",
        "addressed",
        "hegel",
        "phenomenology",
        "consciousness",
        "beginning",
        "wellknown",
        "discussion",
        "sensecertainty",
        "next",
        "topic",
        "selfconsciousness",
        "begin",
        "famous",
        "discussion",
        "mastery",
        "servitude",
        "becomes",
        "clear",
        "selfconsciousness",
        "question",
        "sometimes",
        "called",
        "modern",
        "subjectivity",
        "focusing",
        "firstperson",
        "singular",
        "pronoun",
        "equally",
        "case",
        "secondperson",
        "singular",
        "firstperson",
        "plural",
        "hegel",
        "follows",
        "footstep",
        "fichtean",
        "conception",
        "recognition",
        "hegel",
        "also",
        "add",
        "essential",
        "element",
        "struggle",
        "conflict",
        "competition",
        "depending",
        "inequality",
        "generally",
        "among",
        "member",
        "community",
        "selfconscious",
        "human",
        "being",
        "element",
        "indebted",
        "rousseau",
        "discourse",
        "origin",
        "inequality",
        "kant",
        "conception",
        "unsocial",
        "sociability",
        "introduced",
        "idea",
        "towards",
        "universal",
        "history",
        "cosmopolitan",
        "aim",
        "also",
        "indebted",
        "difference",
        "kant",
        "hegel",
        "respect",
        "idea",
        "arise",
        "context",
        "kant",
        "practical",
        "philosophy",
        "arise",
        "beginning",
        "discussion",
        "selfconsciousness",
        "hegel",
        "phenomenology",
        "put",
        "another",
        "way",
        "kant",
        "distinguishes",
        "theoretical",
        "practical",
        "reason",
        "build",
        "bridge",
        "critique",
        "power",
        "judgement",
        "hegel",
        "discussion",
        "selfconsciousness",
        "phenomenology",
        "initiate",
        "development",
        "unified",
        "conception",
        "reason",
        "theoretical",
        "practical",
        "issue",
        "actualization",
        "realization",
        "rational",
        "concept",
        "idea",
        "typified",
        "kant",
        "idea",
        "god",
        "freedom",
        "immortality",
        "produced",
        "pure",
        "practical",
        "reason",
        "kant",
        "hold",
        "matter",
        "fact",
        "fact",
        "reason",
        "faculty",
        "produce",
        "idea",
        "also",
        "give",
        "motivating",
        "force",
        "u",
        "still",
        "always",
        "question",
        "whether",
        "shall",
        "actually",
        "choose",
        "follow",
        "purely",
        "rational",
        "motivation",
        "kant",
        "develops",
        "elaborate",
        "theory",
        "cultivate",
        "develop",
        "mean",
        "strengthening",
        "supporting",
        "expense",
        "motivation",
        "contrary",
        "always",
        "still",
        "present",
        "due",
        "unsocial",
        "sociability",
        "hegel",
        "contrast",
        "rational",
        "idea",
        "normative",
        "conception",
        "structure",
        "normative",
        "need",
        "function",
        "norm",
        "law",
        "within",
        "actual",
        "human",
        "community",
        "rational",
        "idea",
        "actualized",
        "realized",
        "human",
        "history",
        "question",
        "becomes",
        "one",
        "understanding",
        "historicalconceptual",
        "process",
        "lead",
        "u",
        "towards",
        "higher",
        "form",
        "consciousness",
        "increasingly",
        "comprehensive",
        "coherent",
        "normative",
        "structure",
        "lead",
        "pivotal",
        "section",
        "spirit",
        "phenomenology",
        "historical",
        "part",
        "exposition",
        "reach",
        "culmination",
        "sort",
        "discussion",
        "enlightenment",
        "french",
        "revolution",
        "historical",
        "context",
        "wherein",
        "hegel",
        "located",
        "set",
        "stage",
        "penultimate",
        "discussion",
        "religion",
        "mean",
        "solving",
        "remaining",
        "problem",
        "fully",
        "internalizing",
        "norm",
        "morality",
        "member",
        "human",
        "community",
        "located",
        "within",
        "historical",
        "context",
        "problem",
        "internalization",
        "involves",
        "need",
        "unify",
        "universal",
        "objective",
        "law",
        "morality",
        "particular",
        "individual",
        "make",
        "relevant",
        "community",
        "law",
        "must",
        "incorporated",
        "within",
        "subjective",
        "consciousness",
        "individual",
        "hegel",
        "interprets",
        "doctrine",
        "incarnation",
        "thusly",
        "particular",
        "within",
        "philosophically",
        "enlightened",
        "christianity",
        "practiced",
        "within",
        "philosophically",
        "enlightened",
        "religious",
        "community",
        "divine",
        "incarnated",
        "within",
        "life",
        "human",
        "being",
        "hegel",
        "put",
        "end",
        "section",
        "morality",
        "hegel",
        "gw",
        "god",
        "manifested",
        "midst",
        "know",
        "form",
        "pure",
        "knowledge",
        "kant",
        "develops",
        "enlightenment",
        "version",
        "moral",
        "religion",
        "religion",
        "within",
        "boundary",
        "pure",
        "reason",
        "virtue",
        "kant",
        "enduring",
        "disposition",
        "follow",
        "moral",
        "law",
        "expense",
        "motivation",
        "contrary",
        "disposition",
        "particular",
        "need",
        "cultivated",
        "nurtured",
        "within",
        "moral",
        "sentiment",
        "however",
        "since",
        "problem",
        "unsocial",
        "sociability",
        "primary",
        "obstacle",
        "virtue",
        "need",
        "social",
        "solution",
        "problem",
        "solution",
        "kant",
        "ethical",
        "community",
        "ethical",
        "state",
        "contrast",
        "legal",
        "juridical",
        "state",
        "mutual",
        "encouragement",
        "support",
        "development",
        "required",
        "disposition",
        "rather",
        "fear",
        "legal",
        "sanction",
        "primary",
        "mean",
        "achieving",
        "desired",
        "result",
        "ethical",
        "community",
        "kant",
        "call",
        "church",
        "go",
        "say",
        "must",
        "look",
        "history",
        "religion",
        "trace",
        "development",
        "community",
        "asserts",
        "surprisingly",
        "christianity",
        "doctrine",
        "christ",
        "redeemer",
        "best",
        "far",
        "concludes",
        "finally",
        "regulative",
        "ideal",
        "universal",
        "church",
        "embracing",
        "humanity",
        "church",
        "reason",
        "fully",
        "serve",
        "goal",
        "developing",
        "perfect",
        "therefore",
        "universal",
        "virtue",
        "kant",
        "hegel",
        "different",
        "enlightenment",
        "ambition",
        "concerned",
        "universal",
        "normative",
        "principle",
        "actualization",
        "principle",
        "existing",
        "human",
        "community",
        "moreover",
        "find",
        "culmination",
        "process",
        "take",
        "best",
        "form",
        "religion",
        "time",
        "christianity",
        "particular",
        "lutheranism",
        "need",
        "fully",
        "rationalized",
        "universalized",
        "accordance",
        "enlightenment",
        "demand",
        "difference",
        "two",
        "kant",
        "attempt",
        "meet",
        "demand",
        "sharply",
        "distinguishing",
        "among",
        "different",
        "faculty",
        "mind",
        "case",
        "theoretical",
        "practical",
        "reason",
        "build",
        "bridge",
        "hegel",
        "attempt",
        "meet",
        "demand",
        "articulating",
        "unified",
        "conception",
        "reason",
        "theoretical",
        "practical",
        "case",
        "cassirer",
        "contrast",
        "although",
        "certainly",
        "follower",
        "champion",
        "enlightenment",
        "mean",
        "thinker",
        "enlightenment",
        "instead",
        "creature",
        "twentieth",
        "century",
        "confronted",
        "form",
        "science",
        "also",
        "sociopolitical",
        "organization",
        "technology",
        "warfare",
        "much",
        "else",
        "could",
        "envisaged",
        "either",
        "kant",
        "hegel",
        "moreover",
        "unprecedented",
        "horror",
        "first",
        "half",
        "twentieth",
        "century",
        "put",
        "cassirer",
        "different",
        "moral",
        "universe",
        "religious",
        "cultural",
        "tradition",
        "could",
        "simply",
        "taken",
        "granted",
        "clear",
        "cassirer",
        "discussion",
        "religion",
        "end",
        "mythical",
        "thought",
        "contrast",
        "kant",
        "hegel",
        "rank",
        "art",
        "rather",
        "religion",
        "highest",
        "development",
        "expressive",
        "function",
        "symbolic",
        "meaning",
        "must",
        "end",
        "acknowledge",
        "cassirer",
        "discussion",
        "myth",
        "shed",
        "bright",
        "light",
        "one",
        "important",
        "problem",
        "time",
        "namely",
        "rise",
        "technologically",
        "driven",
        "totalitarian",
        "state",
        "problem",
        "continues",
        "increasingly",
        "threaten",
        "u",
        "even",
        "today"
    ]
}