{
    "main_text": "Explanatory Depth\n4. Explanatory Depth\n\nPresumably all models of causal explanation (and certainly all of the\nmodels considered above) agree that a causal explanation involves the\nassembly of causal information that is relevant to the explanandum of\ninterest, although different models may disagree about how to\nunderstand causation, causal relevance, and exactly what causal\ninformation is needed for explanation. There is also widespread\nagreement (at least among the models considered above) that causal\nexplanations can differ in how deep or good they are. Capturing what\nis involved in variations in depth is thus an important task for a\ntheory of causal explanation (or for that matter, for any theory of\nexplanation, causal or non-causal). Unsurprisingly different\ntreatments of causal explanation provide different accounts of what\nexplanatory depth consists in. One common idea is that explanations\nthat drill down (provide information) about lower-level realizing\ndetail are (to that extent) better – this is taken to be one\ndimension of depth even if not the only one.\n\nThis idea is discussed by Sober (1999) in the context of reduction,\nmultiple realizability, and causal explanations in biology. Sober\nsuggests that lower-level details provide objectively superior\nexplanations compared to higher-level ones and he supports this in\nthree main ways. First, he suggests that for any explanatory target,\nlower-level details can always be included without detracting from an\nexplanation. The worst offense committed by this extra detail is that\nit “explains too much,” while the same cannot be said for\nhigher-level detail (Sober 1999: 547). Second, Sober claims that\nlower-level details do the “work” in producing\nhigher-level phenomena and that this justifies their privilege or\npriority in explanations. A similar view is expressed by Waters, who\nclaims that higher-level detail, while more general, provides\n“shallow explanations” compared to the “deeper\naccounts” provided by lower-level detail (1990: 131). A third\nreason is that physics has a kind of “causal completeness”\nthat other sciences do not have. It is argued that this causal\ncompleteness provides an objective measure of explanatory strength, in\ncontrast to the more “subjective” measures sometimes\ninvoked in defenses of the explanatory credentials of upper\nlevel-sciences. As Sober (1999: 561) puts it,\n\n\nillumination is to some degree in the eye of the beholder; however,\nthe sense in which physics can provide complete explanations is\nsupposed to be perfectly objective.\n\n\nFurthermore,\n\n\nif singular occurrences can be explained by citing their causes, then\nthe causal completeness of physics [ensures] that physics has a\nvariety of explanatory completeness that other sciences do not\npossess. (1999: 562)\n\n\nCases where some type-level effect (e.g., a disease) has a shared\ncausal etiology at higher-levels, but where this etiology is\nmultiply-realized at lower ones present challenges for such views\n(Ross 2020). In Sober’s example, “smoking causes lung\ncancer” is a higher-level (macro) causal relationship. He\nsuggests that lower-level realizers of smoking (distinct carcinogens)\nprovide deeper explanations of this outcome. One problem with this\nclaim is that any single lower-level carcinogen only “makes a\ndifference to” and explains a narrow subset of all cases of the\ndisease. By contrast, the higher-level causal factor\n“smoking” makes a difference to all (or most) cases\nof this disease. This is reflected in the fact that biomedical\nresearchers and nonexperts appeal to smoking as the cause of lung\ncancer and explicitly target smoking cessation in efforts to control\nand prevent this disease. This suggests that there can be drawbacks to\nincluding too much lower-level detail.\n\nThe kairetic theory also incorporates, in some respects, the idea that\nexplanatory depth is connected to tracking lower-level detail. This is\nreflected in the requirement that deeper explanations are those that\nare cohesive with respect to fundamental physics – at the very\nleast we will be in a better position to see that this requirement is\nsatisfied when there is supporting information about low-level\n realizers.[15]\n On the other hand, as we have seen, the kairetic abstraction\nprocedure taken in itself pushes away from the inclusion of specific\nlower-level detail in the direction of greater generality which, in\nsome form or other, is also regarded by most as a desirable feature in\nexplanations, the result being a trade-off between these two\ndesiderata. The role of lower-level detail is somewhat different in\nmechanistic models since in typical formulations generality per se is\nnot given independent weight, and depth is associated with the\nprovision of more rather than less relevant detail. Of course a great\ndeal depends on what is meant by “relevant detail”. As\nnoted above, this issue is taken up by Craver in several papers,\nincluding most recently, Craver and Kaplan (2020) who discuss what\nthey call “norms of completeness” for mechanistic\nexplanations, the idea being that there needs to be some\n“stopping point” at which a mechanistic explanation is\ncomplete in the sense that no further detail needs to be provided.\nClearly, whatever “relevant detail” in this connection\nmeans it cannot mean all factors any variation in which would make a\ndifference to some feature of the phenomenon P which is the\nexplanatory target. After all, in a molecular level explanation of\nsome P, variations at the quantum mechanical level –\nsay in the potential functions governing the behavior of individual\natoms will often make some difference to P, thus requiring\n(on this understanding of relevance) the addition of this information.\nTypically, however, such an explanation is taken by mechanists to be\ncomplete just at the molecular level – no need to drill down\nfurther. Similarly, from a mechanistic point of view an explanation\nT of the behavior of a gas in terms of thermodynamic\nvariables like pressure and temperature is presumably less than fully\nadequate since the gas laws are regarded by some if not most\nmechanists as merely “phenomenological” and not as\ndescribing a mechanism. A statistical mechanical explanation (SM) of\nthe behavior of the gas is better qua mechanistic explanation\nbut ordinarily such explanations don’t advert to, say, the\ndetails of the potentials (DP) governing molecular interactions, even\nthough variations in these would make some difference to some aspects\nof the behavior of the gas. The problem is thus to describe a norm of\ncompleteness that allows one to say that SM is superior to T\nwithout requiring DP rather than SM. Craver and Kaplan’s\ndiscussion (2020) is complex and we will not try to summarize it\nfurther here except to say that it does try to find this happy medium\nof capturing how a norm of completeness can be met, despite its being\nlegitimate to omit some detail.\n\nA closely related issue is this: fine-grained details can be relevant\nto an explanandum in the sense that variations in those details may\nmake a difference to the explanandum but it can also be the case that\nthose details sometimes can be “screened off” from or\nrendered conditionally irrelevant to this explanandum (or\napproximately so) by other, more coarse grained variables that provide\nless detail, as described in Woodward 2021. For example, thermodynamic\nvariables can approximately screen off statistical mechanical\nvariables from one another. In such a case is it legitimate to omit\n(do norms about completeness permit omitting) the more fine-grained\ndetails as long as the more coarse-grained but screening off detail is\nincluded?\n\nInterventionist accounts, at least in the form described by Woodward\n(2003), Hitchcock and Woodward (2003) offer a somewhat different\ntreatment of explanatory depth. Some candidate explanations will\nanswer no w-questions and thus fail to be explanatory at all. Above\nthis threshold explanations may differ in degree of goodness or depth,\ndepending on the extent to which they provide more rather than less\ninformation relevant to answering w-questions about the explanandum\n– and thus more information about what the explanandum depends\non. For example, an explanation of the behavior of a body falling near\nthe earth’s surface in terms of Galileo’s law \\(v=gt\\) is\nless deep than an explanation in terms of the Newtonian law of\ngravitation since the latter makes explicit how the rate of fall\ndepends on the mass of the earth and the distance of the body above\nthe earth’s surface. That is, the Newtonian explanation provides\nanswers to questions about how the velocity of the fall would have\nbeen different if the mass of the earth had been different, if the\nbody was falling some substantial distance away from the earth’s\nsurface and so on, thus answering more w-questions than the\nexplanation appealing to Galileo’s law.\n\nThis account associates generality with explanatory depth but this\nconnection holds only for a particular kind of generality. Consider\nthe conjunction of Galileo’s law and Boyle’s law. In one\nobvious sense, this conjunction is more general than either\nGalileo’s law or Boyle’s law taken alone – more\nsystems will satisfy either the antecedent of Galileo’s law or\nthe antecedent of Boyle’s law than one of these generalizations\nalone. On the other hand, given an explanandum having to do with the\npressure P exerted by a particular gas, the conjunctive law\nwill tell us no more about what P depends on than\nBoyle’s law by itself does. In other words, the addition of\nGalileo’s law does not allow us to answer any additional\nw-questions about the pressure than are answered by Boyle’s law\nalone. For this reason, this version of interventionism judges that\nthe conjunctive law does not provide a deeper explanation of\nP than Boyle’s law despite the conjunctive law being in\none sense more general (Hitchcock & Woodward 2003).\n\nTo develop this idea in a bit more detail, let us say that the\nscope of a generalization has to do with the number of\ndifferent systems or kinds of systems to which the generalization\napplies (in the sense that the systems satisfy the antecedent and\nconsequents of the generalization). Then the interventionist analysis\nclaims that greater scope per se does not contribute to explanatory\ndepth. The conjunction of Galileo’s and Boyle’s law has\ngreater scope than either law alone, but it does not provide deeper\nexplanations.\n\nAs another, perhaps more controversial, illustration consider a set of\ngeneralizations N1 that successfully explain (by interventionist\ncriteria) the behavior of a kind of neural circuit found only in a\ncertain kind K of animal. Would the explanatory credentials\nof N1 or the depth of the explanations it provides be improved if this\nkind of neural circuit was instead found in many different kinds of\nanimals or if N1 had many more instances? According to the\ninterventionist treatment of depth under consideration, the answer to\nthis question is “no” (Woodward 2003: 367). Such an\nextension of the application of N1 is a mere increase in scope.\nLearning that N1 applies to other kinds of animals does not tell us\nanything more about what the behavior of the original circuit depends\non than if N1 applied just to a single kind of animal.\n\nIt is interesting that philosophical discussions of the explanatory\ncredentials of various generalizations often assume (perhaps tacitly)\nthat greater scope (or even greater potential scope in the sense that\nthere are possible – perhaps merely metaphysically possible\n– but not actual systems to which the generalization would\napply) per se contributes to explanatory goodness. For example, Fodor\nand many others argue for the explanatory value of folk psychology on\nthe grounds that its generalizations apply not just to humans but\nwould apply to other systems with the appropriate structure were these\nto exist (perhaps certain AI systems, Martians if appropriately\nsimilar to humans etc.) (Fodor 1981: 8–9). The interventionist\ntreatment of depth denies there is any reason to think the explanatory\nvalue of folk psychology would be better in the circumstances imagined\nabove than if it applied only to humans. As another illustration,\nWeslake (2010) argues that upper-level generalizations can provide\nbetter or deeper explanations of the same explananda than lower-level\ngeneralizations if there are physically impossible [but metaphysically\npossible] systems to which the upper-level explanation applies but to\nwhich the lower-level explanation does not (2010: 287), the reason\nbeing that in such cases the upper- level explanation is more general\nin the sense of applying to a wider variety of systems. Suppose for\nexample, that for some systems governed by the laws of thermodynamics,\nthe underlying micro theory is Newtonian mechanics and for other\n“possible” or actual systems governed by the same\nthermodynamic laws, the correct underlying micro-theory is quite\ndifferent. Then, according to Weslake, thermodynamics provides a\ndeeper explanation than the either of the two micro-theories. This is\nalso an argument that identifies greater depth with greater scope. The\nunderlying intuition about depth here is, so to speak, the opposite of\nStrevens’ since he would presumably draw the conclusion that in\nthis scenario the generalizations of thermodynamics would lack causal\ncohesion if the different realizing microsystems were actual.\n\nThis section has focused on recent discussion of the roles played by\nthe provision of more underlying detail, and generality (in several\ninterpretations of that notion) in assessments of the depth of causal\nexplanation. It is arguable that there are a number of other\ndimensions of depth that we do not discuss – readers are\nreferred to Glymour (1980), Wigner (1967), Woodward (2010), Deutsch\n(2011) among many others.\n",
    "section_title": "4. Explanatory Depth",
    "entry_title": "Causal Approaches to Scientific Explanation",
    "hierarchy_title": "Causal Approaches to Scientific Explanation || Explanatory Depth",
    "tokenized_text": [
        "explanatory",
        "depth",
        "explanatory",
        "depth",
        "presumably",
        "model",
        "causal",
        "explanation",
        "certainly",
        "model",
        "considered",
        "agree",
        "causal",
        "explanation",
        "involves",
        "assembly",
        "causal",
        "information",
        "relevant",
        "explanandum",
        "interest",
        "although",
        "different",
        "model",
        "may",
        "disagree",
        "understand",
        "causation",
        "causal",
        "relevance",
        "exactly",
        "causal",
        "information",
        "needed",
        "explanation",
        "also",
        "widespread",
        "agreement",
        "least",
        "among",
        "model",
        "considered",
        "causal",
        "explanation",
        "differ",
        "deep",
        "good",
        "capturing",
        "involved",
        "variation",
        "depth",
        "thus",
        "important",
        "task",
        "theory",
        "causal",
        "explanation",
        "matter",
        "theory",
        "explanation",
        "causal",
        "noncausal",
        "unsurprisingly",
        "different",
        "treatment",
        "causal",
        "explanation",
        "provide",
        "different",
        "account",
        "explanatory",
        "depth",
        "consists",
        "one",
        "common",
        "idea",
        "explanation",
        "drill",
        "provide",
        "information",
        "lowerlevel",
        "realizing",
        "detail",
        "extent",
        "better",
        "taken",
        "one",
        "dimension",
        "depth",
        "even",
        "one",
        "idea",
        "discussed",
        "sober",
        "context",
        "reduction",
        "multiple",
        "realizability",
        "causal",
        "explanation",
        "biology",
        "sober",
        "suggests",
        "lowerlevel",
        "detail",
        "provide",
        "objectively",
        "superior",
        "explanation",
        "compared",
        "higherlevel",
        "one",
        "support",
        "three",
        "main",
        "way",
        "first",
        "suggests",
        "explanatory",
        "target",
        "lowerlevel",
        "detail",
        "always",
        "included",
        "without",
        "detracting",
        "explanation",
        "worst",
        "offense",
        "committed",
        "extra",
        "detail",
        "explains",
        "much",
        "said",
        "higherlevel",
        "detail",
        "sober",
        "second",
        "sober",
        "claim",
        "lowerlevel",
        "detail",
        "work",
        "producing",
        "higherlevel",
        "phenomenon",
        "justifies",
        "privilege",
        "priority",
        "explanation",
        "similar",
        "view",
        "expressed",
        "water",
        "claim",
        "higherlevel",
        "detail",
        "general",
        "provides",
        "shallow",
        "explanation",
        "compared",
        "deeper",
        "account",
        "provided",
        "lowerlevel",
        "detail",
        "third",
        "reason",
        "physic",
        "kind",
        "causal",
        "completeness",
        "science",
        "argued",
        "causal",
        "completeness",
        "provides",
        "objective",
        "measure",
        "explanatory",
        "strength",
        "contrast",
        "subjective",
        "measure",
        "sometimes",
        "invoked",
        "defense",
        "explanatory",
        "credential",
        "upper",
        "levelsciences",
        "sober",
        "put",
        "illumination",
        "degree",
        "eye",
        "beholder",
        "however",
        "sense",
        "physic",
        "provide",
        "complete",
        "explanation",
        "supposed",
        "perfectly",
        "objective",
        "furthermore",
        "singular",
        "occurrence",
        "explained",
        "citing",
        "cause",
        "causal",
        "completeness",
        "physic",
        "ensures",
        "physic",
        "variety",
        "explanatory",
        "completeness",
        "science",
        "posse",
        "case",
        "typelevel",
        "effect",
        "eg",
        "disease",
        "shared",
        "causal",
        "etiology",
        "higherlevels",
        "etiology",
        "multiplyrealized",
        "lower",
        "one",
        "present",
        "challenge",
        "view",
        "ross",
        "sober",
        "example",
        "smoking",
        "cause",
        "lung",
        "cancer",
        "higherlevel",
        "macro",
        "causal",
        "relationship",
        "suggests",
        "lowerlevel",
        "realizers",
        "smoking",
        "distinct",
        "carcinogen",
        "provide",
        "deeper",
        "explanation",
        "outcome",
        "one",
        "problem",
        "claim",
        "single",
        "lowerlevel",
        "carcinogen",
        "make",
        "difference",
        "explains",
        "narrow",
        "subset",
        "case",
        "disease",
        "contrast",
        "higherlevel",
        "causal",
        "factor",
        "smoking",
        "make",
        "difference",
        "case",
        "disease",
        "reflected",
        "fact",
        "biomedical",
        "researcher",
        "nonexperts",
        "appeal",
        "smoking",
        "cause",
        "lung",
        "cancer",
        "explicitly",
        "target",
        "smoking",
        "cessation",
        "effort",
        "control",
        "prevent",
        "disease",
        "suggests",
        "drawback",
        "including",
        "much",
        "lowerlevel",
        "detail",
        "kairetic",
        "theory",
        "also",
        "incorporates",
        "respect",
        "idea",
        "explanatory",
        "depth",
        "connected",
        "tracking",
        "lowerlevel",
        "detail",
        "reflected",
        "requirement",
        "deeper",
        "explanation",
        "cohesive",
        "respect",
        "fundamental",
        "physic",
        "least",
        "better",
        "position",
        "see",
        "requirement",
        "satisfied",
        "supporting",
        "information",
        "lowlevel",
        "realizers",
        "hand",
        "seen",
        "kairetic",
        "abstraction",
        "procedure",
        "taken",
        "push",
        "away",
        "inclusion",
        "specific",
        "lowerlevel",
        "detail",
        "direction",
        "greater",
        "generality",
        "form",
        "also",
        "regarded",
        "desirable",
        "feature",
        "explanation",
        "result",
        "tradeoff",
        "two",
        "desideratum",
        "role",
        "lowerlevel",
        "detail",
        "somewhat",
        "different",
        "mechanistic",
        "model",
        "since",
        "typical",
        "formulation",
        "generality",
        "per",
        "se",
        "given",
        "independent",
        "weight",
        "depth",
        "associated",
        "provision",
        "rather",
        "le",
        "relevant",
        "detail",
        "course",
        "great",
        "deal",
        "depends",
        "meant",
        "relevant",
        "detail",
        "noted",
        "issue",
        "taken",
        "craver",
        "several",
        "paper",
        "including",
        "recently",
        "craver",
        "kaplan",
        "discus",
        "call",
        "norm",
        "completeness",
        "mechanistic",
        "explanation",
        "idea",
        "need",
        "stopping",
        "point",
        "mechanistic",
        "explanation",
        "complete",
        "sense",
        "detail",
        "need",
        "provided",
        "clearly",
        "whatever",
        "relevant",
        "detail",
        "connection",
        "mean",
        "mean",
        "factor",
        "variation",
        "would",
        "make",
        "difference",
        "feature",
        "phenomenon",
        "p",
        "explanatory",
        "target",
        "molecular",
        "level",
        "explanation",
        "p",
        "variation",
        "quantum",
        "mechanical",
        "level",
        "say",
        "potential",
        "function",
        "governing",
        "behavior",
        "individual",
        "atom",
        "often",
        "make",
        "difference",
        "p",
        "thus",
        "requiring",
        "understanding",
        "relevance",
        "addition",
        "information",
        "typically",
        "however",
        "explanation",
        "taken",
        "mechanist",
        "complete",
        "molecular",
        "level",
        "need",
        "drill",
        "similarly",
        "mechanistic",
        "point",
        "view",
        "explanation",
        "behavior",
        "gas",
        "term",
        "thermodynamic",
        "variable",
        "like",
        "pressure",
        "temperature",
        "presumably",
        "le",
        "fully",
        "adequate",
        "since",
        "gas",
        "law",
        "regarded",
        "mechanist",
        "merely",
        "phenomenological",
        "describing",
        "mechanism",
        "statistical",
        "mechanical",
        "explanation",
        "sm",
        "behavior",
        "gas",
        "better",
        "qua",
        "mechanistic",
        "explanation",
        "ordinarily",
        "explanation",
        "advert",
        "say",
        "detail",
        "potential",
        "dp",
        "governing",
        "molecular",
        "interaction",
        "even",
        "though",
        "variation",
        "would",
        "make",
        "difference",
        "aspect",
        "behavior",
        "gas",
        "problem",
        "thus",
        "describe",
        "norm",
        "completeness",
        "allows",
        "one",
        "say",
        "sm",
        "superior",
        "without",
        "requiring",
        "dp",
        "rather",
        "sm",
        "craver",
        "kaplan",
        "discussion",
        "complex",
        "try",
        "summarize",
        "except",
        "say",
        "try",
        "find",
        "happy",
        "medium",
        "capturing",
        "norm",
        "completeness",
        "met",
        "despite",
        "legitimate",
        "omit",
        "detail",
        "closely",
        "related",
        "issue",
        "finegrained",
        "detail",
        "relevant",
        "explanandum",
        "sense",
        "variation",
        "detail",
        "may",
        "make",
        "difference",
        "explanandum",
        "also",
        "case",
        "detail",
        "sometimes",
        "screened",
        "rendered",
        "conditionally",
        "irrelevant",
        "explanandum",
        "approximately",
        "coarse",
        "grained",
        "variable",
        "provide",
        "le",
        "detail",
        "described",
        "woodward",
        "example",
        "thermodynamic",
        "variable",
        "approximately",
        "screen",
        "statistical",
        "mechanical",
        "variable",
        "one",
        "another",
        "case",
        "legitimate",
        "omit",
        "norm",
        "completeness",
        "permit",
        "omitting",
        "finegrained",
        "detail",
        "long",
        "coarsegrained",
        "screening",
        "detail",
        "included",
        "interventionist",
        "account",
        "least",
        "form",
        "described",
        "woodward",
        "hitchcock",
        "woodward",
        "offer",
        "somewhat",
        "different",
        "treatment",
        "explanatory",
        "depth",
        "candidate",
        "explanation",
        "answer",
        "wquestions",
        "thus",
        "fail",
        "explanatory",
        "threshold",
        "explanation",
        "may",
        "differ",
        "degree",
        "goodness",
        "depth",
        "depending",
        "extent",
        "provide",
        "rather",
        "le",
        "information",
        "relevant",
        "answering",
        "wquestions",
        "explanandum",
        "thus",
        "information",
        "explanandum",
        "depends",
        "example",
        "explanation",
        "behavior",
        "body",
        "falling",
        "near",
        "earth",
        "surface",
        "term",
        "galileo",
        "law",
        "vgt",
        "le",
        "deep",
        "explanation",
        "term",
        "newtonian",
        "law",
        "gravitation",
        "since",
        "latter",
        "make",
        "explicit",
        "rate",
        "fall",
        "depends",
        "mass",
        "earth",
        "distance",
        "body",
        "earth",
        "surface",
        "newtonian",
        "explanation",
        "provides",
        "answer",
        "question",
        "velocity",
        "fall",
        "would",
        "different",
        "mass",
        "earth",
        "different",
        "body",
        "falling",
        "substantial",
        "distance",
        "away",
        "earth",
        "surface",
        "thus",
        "answering",
        "wquestions",
        "explanation",
        "appealing",
        "galileo",
        "law",
        "account",
        "associate",
        "generality",
        "explanatory",
        "depth",
        "connection",
        "hold",
        "particular",
        "kind",
        "generality",
        "consider",
        "conjunction",
        "galileo",
        "law",
        "boyle",
        "law",
        "one",
        "obvious",
        "sense",
        "conjunction",
        "general",
        "either",
        "galileo",
        "law",
        "boyle",
        "law",
        "taken",
        "alone",
        "system",
        "satisfy",
        "either",
        "antecedent",
        "galileo",
        "law",
        "antecedent",
        "boyle",
        "law",
        "one",
        "generalization",
        "alone",
        "hand",
        "given",
        "explanandum",
        "pressure",
        "p",
        "exerted",
        "particular",
        "gas",
        "conjunctive",
        "law",
        "tell",
        "u",
        "p",
        "depends",
        "boyle",
        "law",
        "word",
        "addition",
        "galileo",
        "law",
        "allow",
        "u",
        "answer",
        "additional",
        "wquestions",
        "pressure",
        "answered",
        "boyle",
        "law",
        "alone",
        "reason",
        "version",
        "interventionism",
        "judge",
        "conjunctive",
        "law",
        "provide",
        "deeper",
        "explanation",
        "p",
        "boyle",
        "law",
        "despite",
        "conjunctive",
        "law",
        "one",
        "sense",
        "general",
        "hitchcock",
        "woodward",
        "develop",
        "idea",
        "bit",
        "detail",
        "let",
        "u",
        "say",
        "scope",
        "generalization",
        "number",
        "different",
        "system",
        "kind",
        "system",
        "generalization",
        "applies",
        "sense",
        "system",
        "satisfy",
        "antecedent",
        "consequents",
        "generalization",
        "interventionist",
        "analysis",
        "claim",
        "greater",
        "scope",
        "per",
        "se",
        "contribute",
        "explanatory",
        "depth",
        "conjunction",
        "galileo",
        "boyle",
        "law",
        "greater",
        "scope",
        "either",
        "law",
        "alone",
        "provide",
        "deeper",
        "explanation",
        "another",
        "perhaps",
        "controversial",
        "illustration",
        "consider",
        "set",
        "generalization",
        "n",
        "successfully",
        "explain",
        "interventionist",
        "criterion",
        "behavior",
        "kind",
        "neural",
        "circuit",
        "found",
        "certain",
        "kind",
        "k",
        "animal",
        "would",
        "explanatory",
        "credential",
        "n",
        "depth",
        "explanation",
        "provides",
        "improved",
        "kind",
        "neural",
        "circuit",
        "instead",
        "found",
        "many",
        "different",
        "kind",
        "animal",
        "n",
        "many",
        "instance",
        "according",
        "interventionist",
        "treatment",
        "depth",
        "consideration",
        "answer",
        "question",
        "woodward",
        "extension",
        "application",
        "n",
        "mere",
        "increase",
        "scope",
        "learning",
        "n",
        "applies",
        "kind",
        "animal",
        "tell",
        "u",
        "anything",
        "behavior",
        "original",
        "circuit",
        "depends",
        "n",
        "applied",
        "single",
        "kind",
        "animal",
        "interesting",
        "philosophical",
        "discussion",
        "explanatory",
        "credential",
        "various",
        "generalization",
        "often",
        "assume",
        "perhaps",
        "tacitly",
        "greater",
        "scope",
        "even",
        "greater",
        "potential",
        "scope",
        "sense",
        "possible",
        "perhaps",
        "merely",
        "metaphysically",
        "possible",
        "actual",
        "system",
        "generalization",
        "would",
        "apply",
        "per",
        "se",
        "contributes",
        "explanatory",
        "goodness",
        "example",
        "fodor",
        "many",
        "others",
        "argue",
        "explanatory",
        "value",
        "folk",
        "psychology",
        "ground",
        "generalization",
        "apply",
        "human",
        "would",
        "apply",
        "system",
        "appropriate",
        "structure",
        "exist",
        "perhaps",
        "certain",
        "ai",
        "system",
        "martian",
        "appropriately",
        "similar",
        "human",
        "etc",
        "fodor",
        "interventionist",
        "treatment",
        "depth",
        "denies",
        "reason",
        "think",
        "explanatory",
        "value",
        "folk",
        "psychology",
        "would",
        "better",
        "circumstance",
        "imagined",
        "applied",
        "human",
        "another",
        "illustration",
        "weslake",
        "argues",
        "upperlevel",
        "generalization",
        "provide",
        "better",
        "deeper",
        "explanation",
        "explananda",
        "lowerlevel",
        "generalization",
        "physically",
        "impossible",
        "metaphysically",
        "possible",
        "system",
        "upperlevel",
        "explanation",
        "applies",
        "lowerlevel",
        "explanation",
        "reason",
        "case",
        "upper",
        "level",
        "explanation",
        "general",
        "sense",
        "applying",
        "wider",
        "variety",
        "system",
        "suppose",
        "example",
        "system",
        "governed",
        "law",
        "thermodynamics",
        "underlying",
        "micro",
        "theory",
        "newtonian",
        "mechanic",
        "possible",
        "actual",
        "system",
        "governed",
        "thermodynamic",
        "law",
        "correct",
        "underlying",
        "microtheory",
        "quite",
        "different",
        "according",
        "weslake",
        "thermodynamics",
        "provides",
        "deeper",
        "explanation",
        "either",
        "two",
        "microtheories",
        "also",
        "argument",
        "identifies",
        "greater",
        "depth",
        "greater",
        "scope",
        "underlying",
        "intuition",
        "depth",
        "speak",
        "opposite",
        "strevens",
        "since",
        "would",
        "presumably",
        "draw",
        "conclusion",
        "scenario",
        "generalization",
        "thermodynamics",
        "would",
        "lack",
        "causal",
        "cohesion",
        "different",
        "realizing",
        "microsystems",
        "actual",
        "section",
        "focused",
        "recent",
        "discussion",
        "role",
        "played",
        "provision",
        "underlying",
        "detail",
        "generality",
        "several",
        "interpretation",
        "notion",
        "assessment",
        "depth",
        "causal",
        "explanation",
        "arguable",
        "number",
        "dimension",
        "depth",
        "discus",
        "reader",
        "referred",
        "glymour",
        "wigner",
        "woodward",
        "deutsch",
        "among",
        "many",
        "others"
    ]
}