{
    "main_text": "Regularity Theories of Causation || Humean Regularity Theory\n1.1 Humean Regularity Theory\n\nThe most influential regularity theory is due to Hume. He defines a\ncause to be\n\n\n[a]n object precedent and contiguous to another, and where all the\nobjects resembling the former are plac’d in like relations of\npriority and contiguity to those objects, that resemble the latter.\n(Hume 1739: book I, part III, section XIV [1978: 169])\n\n\nThis definition contains three conditions for a cause. First, a cause\ntemporally precedes its effect. Second, a cause is contiguous to its\neffect. That is, a cause is in spatiotemporal vicinity to its effect.\nThird, all objects similar to the cause are in a “like\nrelation” to objects similar to the effect. This third\nresemblance condition says that cause and effect instantiate a\nregularity. To see this, note the presupposition of the resemblance\ncondition: causes and effects can be sorted into types. The objects\nwhich are like the cause are of a certain type and so are the objects\nwhich are like the effect. The third condition thus says that all\nobjects of a certain type are followed by an effect of a certain\ntype.\n\nA Humean Regularity Theory (HRT), which may or may not coincide with\nHume’s genuine analysis of causation, can be summarized as\nfollows: where \\(c\\) and \\(e\\) denote token events of the types \\(C\\)\nand \\(E\\), respectively,\n\n\\(c\\) is a cause of \\(e\\) iff\n\n(i)\n\\(c\\) is spatiotemporally contiguous to \\(e\\),\n(ii)\n\\(c\\) precedes \\(e\\) in time, and\n(iii)\nall events of type \\(C\\) are followed by an event of type\n\\(E\\).\n\n\nCausation is thus analysed in terms of spatiotemporal contiguity,\ntemporal precedence, and regular connection. The causal relation is\nreduced to non-causal entities: the two particular facts about\nspatiotemporal contiguity and temporal precedence, and the general\nregularity. There is nothing more to causation according to HRT. In\nparticular, causation does not involve a necessary connection, a\nproductive relation, causal powers, or the like—not even to\nground the regularities. This stance against metaphysically thick\nconceptions of causation is characteristic for the regularity theory\n(see, e.g., Dowe 2000: Ch. 2; Psillos 2009).\n\nLet us explain some of the corollaries of HRT. The spatiotemporal\ncontiguity of cause and effect excludes causation at a distance: a\ncause is proximate to its effect, either directly or via a chain of\ncontiguous events (Hume 1739: book 1, part III, section II [1978:\n75]). The temporal precedence of the cause and the direction of time\nimply that causation is asymmetric: if \\(c\\) causes \\(e\\), then it is\nnot the case that \\(e\\) causes \\(c\\). Temporal precedence thus\nexplains the asymmetry of causation, and how we can distinguish\nbetween cause and effect. However, it also rules out the possibility\nof simultaneous and backwards-in-time causation; and it dampens the\nprospects of a non-circular theory of time defined in terms of\ncausation.\n\nCondition (iii) relates a particular instance of causation, \\(c\\) is a\ncause of \\(e\\), to the class of all like cases, the types of \\(c\\) and\n\\(e\\). Hume takes causation to be primarily a relation between\nparticular matters of fact. Yet the causal relation between these\nactual particulars holds in virtue of a certain regularity. Any causal\nrelation thus supervenes on a regularity in the sense that there can\nbe no change in the causal relation without a change in the\nregularity. Any regularity, in turn, supervenes on particular matters\nof fact: there can be no change in the regularity without a change of\nparticular matters of fact. Whether a regularity is true is thus\ndetermined by which particular matters of fact obtain. Likewise,\nwhether a causal relation obtains is determined by which regularity\nobtains. In the end, only the particular matters of fact determine\nwhether or not a causal relation obtains, since the relation of\nsupervenience is transitive. (For details, see the entries on\n supervenience\n and\n David Lewis, section on Humean supervenience.)\n\nAccording to condition (iii), a cause is a sufficient\ncondition for its effect in this sense: all \\(c\\)-like events\noccurring in the actual world are in fact followed by an \\(e\\), where\nthe actual world is understood as the collection of all particular\nspatiotemporal matters of facts. The sufficiency of the cause for the\neffect is not to be understood in a modally stronger sense (Dowe 2000:\n20). In particular, Hume denies that a cause necessitates its effect.\nIn the world, there is—to use Hume’s phrase—just a\n“constant conjunction” between cause and effect.\n\nOn HRT, every effect has a sufficient cause. This does not imply that\nany event has a sufficient cause, but it says that, if there is a\ncausal relation, it is deterministic. Probabilistic causation is thus\nnot covered by HRT. And while the theory is compatible with a\nprobabilistic analog of causation, we follow Hume in restricting\nourselves to deterministic causation in this entry. (See the entry on\n probabilistic causation\n for an overview of theories of causation, where the underlying\nprocesses may be indeterministic.)\n\nHRT allows us to discover causal relations. We may observe\nspatiotemporal contiguity, temporal precedence, and that a certain\ntype of event is generally followed by another type of event. Upon\nrepeated observation of an invariable pattern of succession, we begin\nto expect that this particular event of a certain type is followed by\nthat particular event of a certain type. We develop an inferential\nhabit due to the experienced constant conjunction of types. Or as Hume\nputs it:\n\n\nA cause is an object precedent and contiguous to another, and\nso united with it, that the idea of the one determines the mind to\nform the idea of the other. (Hume 1739: book 1, part III, section XIV\n[1978: 170])\n\n\nOur mind forms a habit to expect or to infer the effect from a cause\nupon repeatedly experiencing events which occur in sequence. Thereby,\nwe produce a connection between objects or events that goes\n“beyond what is immediately present to the senses” (1739:\nbook I, part III, section II [1978: 73]). Our senses and our memory\nprovide us only with finitely many instances of objects or events\nwhich occur jointly, and from which our minds form inferential habits.\nStill these inferential habits apply also to future, as of yet\nunobserved instances of the regularity. In Hume’s words,\n\n\nafter the discovery of the constant conjunction of any objects, we\nalways draw an inference from one object to another, […].\nPerhaps ’twill appear in the end, that the necessary connexion\ndepends on the inference, instead of the inference’s depending\non the necessary connexion. (Hume 1739: book 1, part III, section VI\n[1978: 88])\n\n\nAnd indeed, Hume says that “[n]ecessity is something that exists\nin the minds, not in objects” (1739: book I, part III, section\nXIV [1978: 165]). So there is no necessary connection in the\nworld which would go beyond regular association. However, the\ninferential habits we develop based on the perceived regularities\nmakes us feel that the connection between cause and effect is stronger\nthan mere invariable succession. The necessary connection exists\nin our minds but not in the objects (see section in\nthe entry on\n Hume on Necessary Connection: Constructive Phase).\n\nAccording to the standard interpretation, the regularities themselves\nare real. There really are jointly and repeatedly occurring events of\ncertain types that are spatially contiguous and some temporally\nprecede others. And the regularities are mind-independent: even if\nthere were no minds around, the regularities would exist as patterns\nin the Humean mosaic of particular facts.\n\nIs causation in the world, as expressed by HRT, extensionally\nequivalent to causation in the mind? The difference between the two\ndefinitions seems to be that condition (iii) of HRT is replaced by the\nfollowing condition: \\(c\\) of type \\(C\\) makes us infer \\(e\\) of type\n\\(E\\). While HRT does not require the presence of an epistemic agent,\nthe other definition seems to require such an agent and is thus\nmind-dependent. And an epistemic agent may infer an event from another\nevent, even though there is no regularity connecting the two events.\nHaving said that the two definitions are not extensionally equivalent,\nthe definitions can be read in ways which make them coextensive. The\nepistemic agent of the second definition, for example, can be seen as\na hypothetical omniscient observer who always and only infers in\naccordance with all and only true regularities (for details, see\nGarrett 1997: Ch. 5).\n\nWhat is Hume’s view on causation? We will not enter this\nexegetical debate here. Suffice it to say that the interpretations of\nHume are manifold. Psillos (2009: 132) says that HRT “was\nHume’s view, too, give or take a bit” and argues for it in\nPsillos (2002: Ch. 1). But there are many deviating interpretations\n(Beebee 2006; Garrett 2009; Strawson 1989; J. Wright 1983). The\nrelation between causation in the world and causation in the mind, in\nparticular, has remained a matter of debate among Hume scholars (see\ne.g., Garrett 1993).\n\nLet’s go back to the Humean Regularity Theory. HRT enjoys two\nbenefits. As we have observed, no substantive metaphysics is needed to\nexplain causation. No entities like causal powers or a necessary\nconnection between cause and effect need to be posited. Causation is\nrather reduced to spatiotemporal contiguity, temporal precedence, and\nregular association. Second, Hume’s regularity theory explains\nhow we can figure out what causes what. A cause is simply the event\nwhich temporally precedes and is spatiotemporally contiguous to\nanother event such that the former and latter event instantiate a\nregularity. Since temporal precedence and spatiotemporal precedence\ncan be observed, the problem of identifying causes reduces to the\nproblem of identifying regularities.\n\nHowever, HRT also faces serious problems. Recall that it presupposes\nthat causes and effects can be sorted into types which are connected\nby a regularity. But it is unclear how the sorting can be achieved.\nWhat makes an event “like” another? Which aspects of the\nobjects or events are relevant for the sorting? Many contemporary\nphilosophers explicate the relevant notion of resemblance or\nsimilarity in terms of laws of nature. If there is a law of the form\n\\(\\forall x (A(x) \\rightarrow B(x))\\), then events similar to a token\nevent \\(a\\) are simply events of the same type—other\ninstantiations of \\(A\\)—and events similar to \\(b\\) are also\njust token events of the same type. However, it is a non-trivial task\nto give a satisfying account of what a law of nature is—to say\nthe least.\n\nA second problem runs as follows. Assume, plausibly, that a giant\nmeteor caused the dinosaurs to go extinct. For the meteor to be a\ncause on HRT, there must be a regularity saying that events like giant\nmeteors hitting the Earth are followed by events like the extinction\nof the dinosaurs. But it seems as if such a regularity does not exist:\nthe next giant meteor hitting the Earth will not cause the dinosaurs\nto go extinct. The dinosaurs are already extinct. The problem is that\nthe meteor is only a cause of the extinction on a single occasion. But\naccording to HRT this one meteor hitting the Earth is only a cause if\nsome other meteors hitting the Earth also satisfy the regularity. But\nwhy would events far away in space and time determine whether or not\nthis giant meteor caused the extinction of the dinosaurs on this\noccasion? It seems as if we can have causation without regularity on a\nsingle occasion. We will refer to this problem as the problem of\nsingular causal relations.\n\nA third problem is that there can be regularity without causation. The\ncry of the cock precedes the rise of the sun and the two events are\nregularly associated. And yet the cry of the cock is not a cause of\nthe sunrise. A special case of this problem arises from joint effects\nof a common cause. Suppose an instantiation \\(c\\) of \\(C\\) is a common\ncause of the instantiations \\(a\\) of \\(A\\) and \\(b\\) of \\(B\\), where\nthe token event \\(a\\) precedes the token event \\(b\\) in time (see\n Figure 1).\n Further suppose \\(C\\) is instantiated whenever \\(A\\) is. That is,\nwhenever a token event of type \\(A\\) occurs, a token event of type\n\\(C\\) occurs. Then there is a regular connection between \\(A\\) and\n\\(B\\), which we normally do not count as a causal relation. This\nproblem remains a central challenge for regularity theories to\ndate.\n\n\n\nFigure 1\n\n\nSetting aside the possibilities of remote and backwards causation for\nnow, a regularity theory of causation is only tenable when the three\nproblems can be answered. The next section focuses on how laws of\nnature may help overcome the problem of sorting events into\nappropriate types and how they may exclude the cry of the cock as a\ncause of the sunrise.\n",
    "section_title": "1.1 Humean Regularity Theory",
    "entry_title": "Regularity and Inferential Theories of Causation",
    "hierarchy_title": "Regularity and Inferential Theories of Causation || Regularity Theories of Causation || Humean Regularity Theory",
    "tokenized_text": [
        "regularity",
        "theory",
        "causation",
        "humean",
        "regularity",
        "theory",
        "humean",
        "regularity",
        "theory",
        "influential",
        "regularity",
        "theory",
        "due",
        "hume",
        "defines",
        "cause",
        "n",
        "object",
        "precedent",
        "contiguous",
        "another",
        "object",
        "resembling",
        "former",
        "plac",
        "like",
        "relation",
        "priority",
        "contiguity",
        "object",
        "resemble",
        "latter",
        "hume",
        "book",
        "part",
        "iii",
        "section",
        "xiv",
        "definition",
        "contains",
        "three",
        "condition",
        "cause",
        "first",
        "cause",
        "temporally",
        "precedes",
        "effect",
        "second",
        "cause",
        "contiguous",
        "effect",
        "cause",
        "spatiotemporal",
        "vicinity",
        "effect",
        "third",
        "object",
        "similar",
        "cause",
        "like",
        "relation",
        "object",
        "similar",
        "effect",
        "third",
        "resemblance",
        "condition",
        "say",
        "cause",
        "effect",
        "instantiate",
        "regularity",
        "see",
        "note",
        "presupposition",
        "resemblance",
        "condition",
        "cause",
        "effect",
        "sorted",
        "type",
        "object",
        "like",
        "cause",
        "certain",
        "type",
        "object",
        "like",
        "effect",
        "third",
        "condition",
        "thus",
        "say",
        "object",
        "certain",
        "type",
        "followed",
        "effect",
        "certain",
        "type",
        "humean",
        "regularity",
        "theory",
        "hrt",
        "may",
        "may",
        "coincide",
        "hume",
        "genuine",
        "analysis",
        "causation",
        "summarized",
        "follows",
        "c",
        "e",
        "denote",
        "token",
        "event",
        "type",
        "c",
        "e",
        "respectively",
        "c",
        "cause",
        "e",
        "iff",
        "c",
        "spatiotemporally",
        "contiguous",
        "e",
        "ii",
        "c",
        "precedes",
        "e",
        "time",
        "iii",
        "event",
        "type",
        "c",
        "followed",
        "event",
        "type",
        "e",
        "causation",
        "thus",
        "analysed",
        "term",
        "spatiotemporal",
        "contiguity",
        "temporal",
        "precedence",
        "regular",
        "connection",
        "causal",
        "relation",
        "reduced",
        "noncausal",
        "entity",
        "two",
        "particular",
        "fact",
        "spatiotemporal",
        "contiguity",
        "temporal",
        "precedence",
        "general",
        "regularity",
        "nothing",
        "causation",
        "according",
        "hrt",
        "particular",
        "causation",
        "involve",
        "necessary",
        "connection",
        "productive",
        "relation",
        "causal",
        "power",
        "likenot",
        "even",
        "ground",
        "regularity",
        "stance",
        "metaphysically",
        "thick",
        "conception",
        "causation",
        "characteristic",
        "regularity",
        "theory",
        "see",
        "eg",
        "dowe",
        "ch",
        "psillos",
        "let",
        "u",
        "explain",
        "corollary",
        "hrt",
        "spatiotemporal",
        "contiguity",
        "cause",
        "effect",
        "excludes",
        "causation",
        "distance",
        "cause",
        "proximate",
        "effect",
        "either",
        "directly",
        "via",
        "chain",
        "contiguous",
        "event",
        "hume",
        "book",
        "part",
        "iii",
        "section",
        "ii",
        "temporal",
        "precedence",
        "cause",
        "direction",
        "time",
        "imply",
        "causation",
        "asymmetric",
        "c",
        "cause",
        "e",
        "case",
        "e",
        "cause",
        "c",
        "temporal",
        "precedence",
        "thus",
        "explains",
        "asymmetry",
        "causation",
        "distinguish",
        "cause",
        "effect",
        "however",
        "also",
        "rule",
        "possibility",
        "simultaneous",
        "backwardsintime",
        "causation",
        "dampens",
        "prospect",
        "noncircular",
        "theory",
        "time",
        "defined",
        "term",
        "causation",
        "condition",
        "iii",
        "relates",
        "particular",
        "instance",
        "causation",
        "c",
        "cause",
        "e",
        "class",
        "like",
        "case",
        "type",
        "c",
        "e",
        "hume",
        "take",
        "causation",
        "primarily",
        "relation",
        "particular",
        "matter",
        "fact",
        "yet",
        "causal",
        "relation",
        "actual",
        "particular",
        "hold",
        "virtue",
        "certain",
        "regularity",
        "causal",
        "relation",
        "thus",
        "supervenes",
        "regularity",
        "sense",
        "change",
        "causal",
        "relation",
        "without",
        "change",
        "regularity",
        "regularity",
        "turn",
        "supervenes",
        "particular",
        "matter",
        "fact",
        "change",
        "regularity",
        "without",
        "change",
        "particular",
        "matter",
        "fact",
        "whether",
        "regularity",
        "true",
        "thus",
        "determined",
        "particular",
        "matter",
        "fact",
        "obtain",
        "likewise",
        "whether",
        "causal",
        "relation",
        "obtains",
        "determined",
        "regularity",
        "obtains",
        "end",
        "particular",
        "matter",
        "fact",
        "determine",
        "whether",
        "causal",
        "relation",
        "obtains",
        "since",
        "relation",
        "supervenience",
        "transitive",
        "detail",
        "see",
        "entry",
        "supervenience",
        "david",
        "lewis",
        "section",
        "humean",
        "supervenience",
        "according",
        "condition",
        "iii",
        "cause",
        "sufficient",
        "condition",
        "effect",
        "sense",
        "c",
        "like",
        "event",
        "occurring",
        "actual",
        "world",
        "fact",
        "followed",
        "e",
        "actual",
        "world",
        "understood",
        "collection",
        "particular",
        "spatiotemporal",
        "matter",
        "fact",
        "sufficiency",
        "cause",
        "effect",
        "understood",
        "modally",
        "stronger",
        "sense",
        "dowe",
        "particular",
        "hume",
        "denies",
        "cause",
        "necessitates",
        "effect",
        "world",
        "isto",
        "use",
        "hume",
        "phrasejust",
        "constant",
        "conjunction",
        "cause",
        "effect",
        "hrt",
        "every",
        "effect",
        "sufficient",
        "cause",
        "imply",
        "event",
        "sufficient",
        "cause",
        "say",
        "causal",
        "relation",
        "deterministic",
        "probabilistic",
        "causation",
        "thus",
        "covered",
        "hrt",
        "theory",
        "compatible",
        "probabilistic",
        "analog",
        "causation",
        "follow",
        "hume",
        "restricting",
        "deterministic",
        "causation",
        "entry",
        "see",
        "entry",
        "probabilistic",
        "causation",
        "overview",
        "theory",
        "causation",
        "underlying",
        "process",
        "may",
        "indeterministic",
        "hrt",
        "allows",
        "u",
        "discover",
        "causal",
        "relation",
        "may",
        "observe",
        "spatiotemporal",
        "contiguity",
        "temporal",
        "precedence",
        "certain",
        "type",
        "event",
        "generally",
        "followed",
        "another",
        "type",
        "event",
        "upon",
        "repeated",
        "observation",
        "invariable",
        "pattern",
        "succession",
        "begin",
        "expect",
        "particular",
        "event",
        "certain",
        "type",
        "followed",
        "particular",
        "event",
        "certain",
        "type",
        "develop",
        "inferential",
        "habit",
        "due",
        "experienced",
        "constant",
        "conjunction",
        "type",
        "hume",
        "put",
        "cause",
        "object",
        "precedent",
        "contiguous",
        "another",
        "united",
        "idea",
        "one",
        "determines",
        "mind",
        "form",
        "idea",
        "hume",
        "book",
        "part",
        "iii",
        "section",
        "xiv",
        "mind",
        "form",
        "habit",
        "expect",
        "infer",
        "effect",
        "cause",
        "upon",
        "repeatedly",
        "experiencing",
        "event",
        "occur",
        "sequence",
        "thereby",
        "produce",
        "connection",
        "object",
        "event",
        "go",
        "beyond",
        "immediately",
        "present",
        "sens",
        "book",
        "part",
        "iii",
        "section",
        "ii",
        "sens",
        "memory",
        "provide",
        "u",
        "finitely",
        "many",
        "instance",
        "object",
        "event",
        "occur",
        "jointly",
        "mind",
        "form",
        "inferential",
        "habit",
        "still",
        "inferential",
        "habit",
        "apply",
        "also",
        "future",
        "yet",
        "unobserved",
        "instance",
        "regularity",
        "hume",
        "word",
        "discovery",
        "constant",
        "conjunction",
        "object",
        "always",
        "draw",
        "inference",
        "one",
        "object",
        "another",
        "perhaps",
        "twill",
        "appear",
        "end",
        "necessary",
        "connexion",
        "depends",
        "inference",
        "instead",
        "inference",
        "depending",
        "necessary",
        "connexion",
        "hume",
        "book",
        "part",
        "iii",
        "section",
        "vi",
        "indeed",
        "hume",
        "say",
        "n",
        "ecessity",
        "something",
        "exists",
        "mind",
        "object",
        "book",
        "part",
        "iii",
        "section",
        "xiv",
        "necessary",
        "connection",
        "world",
        "would",
        "go",
        "beyond",
        "regular",
        "association",
        "however",
        "inferential",
        "habit",
        "develop",
        "based",
        "perceived",
        "regularity",
        "make",
        "u",
        "feel",
        "connection",
        "cause",
        "effect",
        "stronger",
        "mere",
        "invariable",
        "succession",
        "necessary",
        "connection",
        "exists",
        "mind",
        "object",
        "see",
        "section",
        "entry",
        "hume",
        "necessary",
        "connection",
        "constructive",
        "phase",
        "according",
        "standard",
        "interpretation",
        "regularity",
        "real",
        "really",
        "jointly",
        "repeatedly",
        "occurring",
        "event",
        "certain",
        "type",
        "spatially",
        "contiguous",
        "temporally",
        "precede",
        "others",
        "regularity",
        "mindindependent",
        "even",
        "mind",
        "around",
        "regularity",
        "would",
        "exist",
        "pattern",
        "humean",
        "mosaic",
        "particular",
        "fact",
        "causation",
        "world",
        "expressed",
        "hrt",
        "extensionally",
        "equivalent",
        "causation",
        "mind",
        "difference",
        "two",
        "definition",
        "seems",
        "condition",
        "iii",
        "hrt",
        "replaced",
        "following",
        "condition",
        "c",
        "type",
        "c",
        "make",
        "u",
        "infer",
        "e",
        "type",
        "e",
        "hrt",
        "require",
        "presence",
        "epistemic",
        "agent",
        "definition",
        "seems",
        "require",
        "agent",
        "thus",
        "minddependent",
        "epistemic",
        "agent",
        "may",
        "infer",
        "event",
        "another",
        "event",
        "even",
        "though",
        "regularity",
        "connecting",
        "two",
        "event",
        "said",
        "two",
        "definition",
        "extensionally",
        "equivalent",
        "definition",
        "read",
        "way",
        "make",
        "coextensive",
        "epistemic",
        "agent",
        "second",
        "definition",
        "example",
        "seen",
        "hypothetical",
        "omniscient",
        "observer",
        "always",
        "infers",
        "accordance",
        "true",
        "regularity",
        "detail",
        "see",
        "garrett",
        "ch",
        "hume",
        "view",
        "causation",
        "enter",
        "exegetical",
        "debate",
        "suffice",
        "say",
        "interpretation",
        "hume",
        "manifold",
        "psillos",
        "say",
        "hrt",
        "hume",
        "view",
        "give",
        "take",
        "bit",
        "argues",
        "psillos",
        "ch",
        "many",
        "deviating",
        "interpretation",
        "beebee",
        "garrett",
        "strawson",
        "j",
        "wright",
        "relation",
        "causation",
        "world",
        "causation",
        "mind",
        "particular",
        "remained",
        "matter",
        "debate",
        "among",
        "hume",
        "scholar",
        "see",
        "eg",
        "garrett",
        "let",
        "go",
        "back",
        "humean",
        "regularity",
        "theory",
        "hrt",
        "enjoys",
        "two",
        "benefit",
        "observed",
        "substantive",
        "metaphysics",
        "needed",
        "explain",
        "causation",
        "entity",
        "like",
        "causal",
        "power",
        "necessary",
        "connection",
        "cause",
        "effect",
        "need",
        "posited",
        "causation",
        "rather",
        "reduced",
        "spatiotemporal",
        "contiguity",
        "temporal",
        "precedence",
        "regular",
        "association",
        "second",
        "hume",
        "regularity",
        "theory",
        "explains",
        "figure",
        "cause",
        "cause",
        "simply",
        "event",
        "temporally",
        "precedes",
        "spatiotemporally",
        "contiguous",
        "another",
        "event",
        "former",
        "latter",
        "event",
        "instantiate",
        "regularity",
        "since",
        "temporal",
        "precedence",
        "spatiotemporal",
        "precedence",
        "observed",
        "problem",
        "identifying",
        "cause",
        "reduces",
        "problem",
        "identifying",
        "regularity",
        "however",
        "hrt",
        "also",
        "face",
        "serious",
        "problem",
        "recall",
        "presupposes",
        "cause",
        "effect",
        "sorted",
        "type",
        "connected",
        "regularity",
        "unclear",
        "sorting",
        "achieved",
        "make",
        "event",
        "like",
        "another",
        "aspect",
        "object",
        "event",
        "relevant",
        "sorting",
        "many",
        "contemporary",
        "philosopher",
        "explicate",
        "relevant",
        "notion",
        "resemblance",
        "similarity",
        "term",
        "law",
        "nature",
        "law",
        "form",
        "forall",
        "x",
        "x",
        "rightarrow",
        "b",
        "x",
        "event",
        "similar",
        "token",
        "event",
        "a",
        "simply",
        "event",
        "typeother",
        "instantiation",
        "a",
        "and",
        "event",
        "similar",
        "b",
        "also",
        "token",
        "event",
        "type",
        "however",
        "nontrivial",
        "task",
        "give",
        "satisfying",
        "account",
        "law",
        "nature",
        "isto",
        "say",
        "least",
        "second",
        "problem",
        "run",
        "follows",
        "assume",
        "plausibly",
        "giant",
        "meteor",
        "caused",
        "dinosaur",
        "go",
        "extinct",
        "meteor",
        "cause",
        "hrt",
        "must",
        "regularity",
        "saying",
        "event",
        "like",
        "giant",
        "meteor",
        "hitting",
        "earth",
        "followed",
        "event",
        "like",
        "extinction",
        "dinosaur",
        "seems",
        "regularity",
        "exist",
        "next",
        "giant",
        "meteor",
        "hitting",
        "earth",
        "cause",
        "dinosaur",
        "go",
        "extinct",
        "dinosaur",
        "already",
        "extinct",
        "problem",
        "meteor",
        "cause",
        "extinction",
        "single",
        "occasion",
        "according",
        "hrt",
        "one",
        "meteor",
        "hitting",
        "earth",
        "cause",
        "meteor",
        "hitting",
        "earth",
        "also",
        "satisfy",
        "regularity",
        "would",
        "event",
        "far",
        "away",
        "space",
        "time",
        "determine",
        "whether",
        "giant",
        "meteor",
        "caused",
        "extinction",
        "dinosaur",
        "occasion",
        "seems",
        "causation",
        "without",
        "regularity",
        "single",
        "occasion",
        "refer",
        "problem",
        "problem",
        "singular",
        "causal",
        "relation",
        "third",
        "problem",
        "regularity",
        "without",
        "causation",
        "cry",
        "cock",
        "precedes",
        "rise",
        "sun",
        "two",
        "event",
        "regularly",
        "associated",
        "yet",
        "cry",
        "cock",
        "cause",
        "sunrise",
        "special",
        "case",
        "problem",
        "arises",
        "joint",
        "effect",
        "common",
        "cause",
        "suppose",
        "instantiation",
        "c",
        "c",
        "common",
        "cause",
        "instantiation",
        "a",
        "a",
        "b",
        "b",
        "token",
        "event",
        "a",
        "precedes",
        "token",
        "event",
        "b",
        "time",
        "see",
        "figure",
        "suppose",
        "c",
        "instantiated",
        "whenever",
        "a",
        "whenever",
        "token",
        "event",
        "type",
        "a",
        "occurs",
        "token",
        "event",
        "type",
        "c",
        "occurs",
        "regular",
        "connection",
        "a",
        "b",
        "normally",
        "count",
        "causal",
        "relation",
        "problem",
        "remains",
        "central",
        "challenge",
        "regularity",
        "theory",
        "date",
        "figure",
        "setting",
        "aside",
        "possibility",
        "remote",
        "backwards",
        "causation",
        "regularity",
        "theory",
        "causation",
        "tenable",
        "three",
        "problem",
        "answered",
        "next",
        "section",
        "focus",
        "law",
        "nature",
        "may",
        "help",
        "overcome",
        "problem",
        "sorting",
        "event",
        "appropriate",
        "type",
        "may",
        "exclude",
        "cry",
        "cock",
        "cause",
        "sunrise"
    ]
}