{
    "main_text": "Problems for Lewis’s Counterfactual Theory || Preemption\n2.3 Preemption\n\n2.1 Temporal Asymmetry\n\nThere have been several important critical discussions of\nLewis’s explanation of the temporal asymmetry of causation. (For\nsome early discussions see Horwich 1987: Chap. 10; Hausman 1998: Chap.\n6; Price 1996: Chap. 6.) One important criticism concerns the\n‘asymmetry of miracles’ that is central to Lewis’s\naccount of the temporal asymmetry of causation: a miracle that\nrealises a counterfactual antecedent about particular facts at time\nt by having a possible world diverge from the actual world\njust before the time t is, Lewis claims, smaller and less\ndiverse than a miracle that realises the same counterfactual\nantecedent and makes a possible world converge to the actual world\nafter the time t. Adam Elga (2000) has argued that the\nasymmetry of miracles does not hold in many cases. \n\nElga’s argument proceeds by way of the example of Gretta cracking an\negg described earlier, and the basic idea is that in fact World 2\nabove – the closest world where particular fact in the past up\nuntil shortly after 8.00 doesn’t match actuality (and, in\nparticular, Gretta doesn’t crack the egg), there is a miracle\nshortly after 8.00, and thereafter World 2 evolves according to the\nactual world’s laws and matches actuality perfectly with respect to\nparticular fact. Thinking in the future-to-past direction for now,\nconsider what happens at the actual world from a time-reversed point\nof view: Gretta transfers the egg from her plate to the hot pan, the\npan cools down and the egg uncooks, and then it leaps up into the\nwaiting shell, which closes neatly around it. Now (to get us to World\n2) insert a small miracle – at 8.05, say, when the egg is\nnicely cooked in the pan – altering just the positions of a few\nmolecules, say, so that what happens (again, proceeding from future to\npast) is that (lawfully, once the miracle has occurred) the egg just\nsits in the pan, cooling down and transferring heat to the pan in the\nprocess, and then gradually rots in the way that eggs normally do\n(except that they normally do that in the past-to-future direction).\nThe idea is that, while World 2 (viewed from past to future) looks\nexceedingly strange – after all, it involves Gretta devouring\nwhat was once a horrible rotten egg that somehow found its way into\nher pan and then bizarrely de-rotted – none of that is unlawful.\nIt is just, thanks to the laws of thermodynamics, spectacularly\nunlikely.\n\nBut how does this help us with the original problem with World 2,\nnamely the fact that all of the traces of Gretta’s actual\negg-cracking, such as her remembering cracking it, the presence of the\nempty, broken eggshell in the bin, and so on, would have to somehow be\nindividually be brought about in World 2 by additional miracles, in\norder to preserve perfect match of particular fact from 8.05 onwards?\nThe short answer is that they don’t. The ‘traces’ are there in\nWorld 2 all right, and of course we would normally expect such\n‘traces’ to point pretty conclusively to Gretta having recently\ncracked an egg. But they don’t lawfully entail that she did.\nAgain looking at World 2 from a time-reversed perspective, we take the\nworld as it is after 8.05, ‘traces’ and all, and run the laws\nbackwards (apart from the small miracle that makes the egg rot slowly\nin the pan rather than leaping up into the waiting shell). What\n‘follows’ (still going backwards in time) is anyone’s guess, and\nwhatever it is it will doubtless look bizarre when viewed in the\nusual, past-to-future direction. Be that as it may, World 2 is a world\nwith a single, small miracle at 8.05, with perfect match of particular\nfact thereafter, which is just as close to the actual world as is\nWorld 1, where there is a small miracle before Gretta cracks\nthe egg. So, Elga argues, there is no asymmetry of counterfactual\ndependence, as Lewis defines it.\n\nSeveral authors have come to the conclusion that a viable account of\nthe asymmetry of counterfactual dependence must derive not from the\nasymmetry of miracles, as Lewis claims, but from thermodynamic\nasymmetry: from the fact that entropy increases towards the future. In\nparticular, David Albert (2000) proposes that we need to assume the\n‘Past Hypothesis’: the assumption that the universe began in an\nextremely low entropy condition. The Past Hypothesis and its\nrelationship to the asymmetry of counterfactual dependence has been\nmuch discussed. (See Frisch 2005, 2007; Loewer 2007; Price and Weslake\n2009; Kutach 2002, 2013.)\n2.2 Transitivity\n\nAs we have seen, Lewis builds transitivity into causation by defining\ncausation in terms of chains of causal dependence. However, a number\nof alleged counter-examples have been presented which cast doubt on\ntransitivity. (Lewis 2004a presents a short catalogue of these\ncounterexamples.) Here is a sample of two counterexamples.\n\nFirst, an unpublished but much-discussed example due to Ned Hall. A\nhiker is walking along a mountain trail, when a boulder high above is\ndislodged and comes careering down the mountain slopes. The hiker\nnotices the boulder and ducks at the appropriate time. The careering\nboulder causes the hiker to duck and this, in turn, causes his\ncontinued stride. (This second causal link involves double\nprevention: the duck prevents the collision between hiker and\nboulder which, had it occurred, would have prevented the hiker’s\ncontinued stride.) However, the careering boulder is the sort of thing\nthat would normally prevent the hiker’s continued stride and so\nit seems counterintuitive to say that it causes the stride.\n\nSecond, an example due to Douglas Ehring (1987). Jones puts some\npotassium salts into a hot fire. Because potassium compounds produce a\npurple flame when heated, the flame changes to a purple colour, though\neverything else remains the same. The purple flame ignites some\nflammable material nearby. Here we judge that putting the potassium\nsalts in the fire caused the purple flame, which in turn caused the\nflammable material to ignite. But it seems implausible to judge that\nputting the potassium salts in the fire caused the flammable material\nto ignite.\n\nVarious replies have been made to these counterexamples. L.A. Paul\n(2004) offers a response to the second example that involves\nconceiving of the relata of causation as event aspects: she\nargues that there is mismatch between the event aspect that is the\neffect of the first causal link (the flame’s being a purple\ncolour) and the event aspect that is the cause of the second causal\nlink (the flame’s touching the flammable material). Thus, while\nit’s true that the purple flame did not cause the ignition,\nthere is no failure of transitivity after all. Maslen (2004) solves\nthe problem by appealing to a contrastivist account of causation (see\n§4 below): the contrast situation at the effect-end of the first\ncausal statement does not match up with the contrast situation at the\ncause-end of the second causal statement. Thus, the first causal\nstatement should be interpreted as saying that Jones’s putting\npotassium salts in the fire rather not doing so caused the flame to\nturn purple rather than yellow; but the second causal\nstatement should be interpreted as saying that the purple\nfire’s occurring rather than not occurring caused the\nflammable material to ignite rather not to ignite. Where there is a\nmismatch of this kind, we do not have a genuine counterexample to\ntransitivity. \n\nThe first example cannot be handled in the same way. Some defenders of\ntransitivity have replied that our intuitions about the intransitivity\nof causation in these examples are misleading. For instance, Lewis\n(2004a) points out that the counterexamples to transitivity typically\ninvolve a structure in which a c-type event generally\nprevents an e-type but in the particular case the\nc-event actually causes another event that counters the\nthreat and causes the e-event. If we mix up questions of what\nis generally conducive to what, with questions about what caused what\nin this particular case, he says, we may think that it is reasonable\nto deny that c causes e. But if we keep the focus\nsharply on the particular case, we must insist that c does in\nfact cause e.\n\nThe debate about the transitivity of causation is not easily settled,\npartly because it is tied up with the issue of how it is best for a\ncounterfactual theory to deal with examples of preemption. As we have\nseen, Lewis’s counterfactual theory relies on the transitivity\nof causation to handle cases of preemption. If such cases could be\nhandled in some other way, that would take some of the theoretical\npressure off the theory, allowing it to concede the alleged\ncounterexamples to transitivity without succumbing to the difficulties\nposed by preemption. (For more on this point see Hitchcock 2001. For\nan extensive discussion of the issues around transitivity see Paul and\nHall 2013: Chap. 5.)\n2.3 Preemption\n\nAs we have seen, Lewis employs his strategy of defining causation in\nterms of chains of causal dependence not only to make causation\ntransitive, but also to deal with preemption examples. However, there\nare preemption examples that this strategy cannot deal with\nsatisfactorily. Difficulties concerning preemption have proven to be\nthe biggest bugbear for Lewis’s theory. (Paul and Hall 2013:\nChap. 3 contains an extensive discussion of the problems posed by\npreemption and other kinds of redundant causation for counterfactual\ntheories.) \n\nIn his (1986c: 200), Lewis distinguishes cases of early and\nlate preemption. In early preemption examples, the process\nrunning from the preempted alternative is cut short before the main\nprocess running from the preempting cause has gone to completion. The\nexample of the two assassins, given above, is an example of this sort.\nThe theory of causation in terms of chains of causal dependence can\nhandle this sort of example. In contrast, cases of late preemption are\nones in which the process running from the preempted cause is cut\nshort by the main process running to completion and bringing about the\neffect before the preempted potential cause has the opportunity to do\nso. The following is an example of late preemption due to Hall\n(2004).\n\nBilly and Suzy throw rocks at a bottle. Suzy throws first so that her\nrock arrives first and shatters the glass; Billy’s rock sails\nthrough the air where the bottle had stood moments earlier. Without\nSuzy’s throw, Billy’s throw would have shattered the\nbottle. However, Suzy’s throw caused the bottle to shatter,\nwhile Billy’s throw is merely a preempted potential cause. This\nis a case of late preemption because the alternative process\n(Billy’s throw) is cut short by the main process (Suzy’s\nthrow) running to completion.\n\nLewis’s theory cannot explain the judgement that Suzy’s\nthrow caused the shattering of the bottle. For there is no causal\ndependence between Suzy’s throw and the shattering, since even\nif Suzy had not thrown her rock, the bottle would have shattered due\nto Billy’s throw. Nor is there a chain of stepwise dependences\nrunning cause to effect, because there is no event intermediate\nbetween Suzy’s throw and the shattering that links them up into\na chain of dependences. Take, for instance, Suzy’s rock in\nmid-trajectory.  This event depends on Suzy’s initial\nthrow, but the problem is that the shattering of the bottle does not\ndepend on it, because even without it the bottle would still have\nshattered because of Billy’s throw.\n\nTo be sure, the bottle shattering that would have occurred without\nSuzy’s throw would be different from the bottle shattering that\nactually occurred with Suzy’s throw. For a start, it would have\noccurred later. This observation suggests that one solution to the\nproblem of late preemption might be to insist that the events involved\nshould be construed as fragile events. Accordingly, it will be true\nrather than false that if Suzy had not thrown her rock, then the\nactual bottle shattering, taken as a fragile event with an essential\ntime and manner of occurrence, would not have occurred. Lewis himself\ndoes not endorse this response on the grounds that a uniform policy of\nconstruing events as fragile would go against our usual practices, and\nwould generate many spurious causal dependences. For example, suppose\nthat a poison kills its victim more slowly and painfully when taken on\na full stomach. Then the victim’s eating dinner before he drinks\nthe poison would count as a cause of his death since the time and\nmanner of the death depend on the eating of the dinner. (For\ndiscussion of the limitations of this response see Lewis 1986c,\n2000.)\n\nThe solution to the late preemption problem that Lewis cautiously\nendorses in his 1986c appeals to the notion of quasi-dependence.\nConsider a case that resembles the case of Billy and Suzy throwing\nrocks at a bottle. Suzy throws a rock (c) and shatters the\nbottle (e) in exactly the same way in which she does in the\noriginal case. But in this case Billy and his rock are entirely\nabsent. In the original case, e is caused by but does not\ncounterfactually depend on c, whereas in this second case\ne is caused by and does counterfactually depend on c.\nBut the intrinsic character of the process leading from c to\ne is just the same in both cases. Thus, Lewis says, in the\noriginal case (with Billy also throwing), e quasi-depends on\nc. So “we could redefine a causal chain as a sequence of\ntwo or more events, with either dependence or quasi-dependence at each\nstep. And as always, one event is a cause of another iff there is a\ncausal chain from one to the other” (1986c, 206). (A related\nidea is pursued in Menzies 1996 and 1999.) Note that, this proposed\ndefinition of a causal chain notwithstanding, the quasi-dependence\nsolution does not demand transitivity in the way that Lewis’s\nearlier solution to the problem of early preemption did: with back-up\npotential causes safely out of the way, in all cases of preemption\n(early and late), the effect should straightforwardly quasi-depend on\nits cause.\n\nLewis’s dissatisfaction with his own attempts to deal with the\nproblem of late preemption, as well as his theory’s inability to\ndeal with ‘trumping preemption’ (Schaffer 2000a), led to\nthe development of his 2000 theory. A further problem relating to\npreemption that arises for chancy causation – which the 2000\ntheory does not address – is discussed in\n §5.4\n below.\n",
    "section_title": "2.3 Preemption",
    "entry_title": "Counterfactual Theories of Causation",
    "hierarchy_title": "Counterfactual Theories of Causation || Problems for Lewis’s Counterfactual Theory || Preemption",
    "tokenized_text": [
        "problem",
        "lewis",
        "counterfactual",
        "theory",
        "preemption",
        "preemption",
        "temporal",
        "asymmetry",
        "several",
        "important",
        "critical",
        "discussion",
        "lewis",
        "explanation",
        "temporal",
        "asymmetry",
        "causation",
        "early",
        "discussion",
        "see",
        "horwich",
        "chap",
        "hausman",
        "chap",
        "price",
        "chap",
        "one",
        "important",
        "criticism",
        "concern",
        "asymmetry",
        "miracle",
        "central",
        "lewis",
        "account",
        "temporal",
        "asymmetry",
        "causation",
        "miracle",
        "realises",
        "counterfactual",
        "antecedent",
        "particular",
        "fact",
        "time",
        "possible",
        "world",
        "diverge",
        "actual",
        "world",
        "time",
        "lewis",
        "claim",
        "smaller",
        "le",
        "diverse",
        "miracle",
        "realises",
        "counterfactual",
        "antecedent",
        "make",
        "possible",
        "world",
        "converge",
        "actual",
        "world",
        "time",
        "t",
        "adam",
        "elga",
        "argued",
        "asymmetry",
        "miracle",
        "hold",
        "many",
        "case",
        "elga",
        "argument",
        "proceeds",
        "way",
        "example",
        "gretta",
        "cracking",
        "egg",
        "described",
        "earlier",
        "basic",
        "idea",
        "fact",
        "world",
        "closest",
        "world",
        "particular",
        "fact",
        "past",
        "shortly",
        "match",
        "actuality",
        "particular",
        "gretta",
        "crack",
        "egg",
        "miracle",
        "shortly",
        "thereafter",
        "world",
        "evolves",
        "according",
        "actual",
        "world",
        "law",
        "match",
        "actuality",
        "perfectly",
        "respect",
        "particular",
        "fact",
        "thinking",
        "futuretopast",
        "direction",
        "consider",
        "happens",
        "actual",
        "world",
        "timereversed",
        "point",
        "view",
        "gretta",
        "transfer",
        "egg",
        "plate",
        "hot",
        "pan",
        "pan",
        "cool",
        "egg",
        "uncooks",
        "leap",
        "waiting",
        "shell",
        "close",
        "neatly",
        "around",
        "get",
        "u",
        "world",
        "insert",
        "small",
        "miracle",
        "say",
        "egg",
        "nicely",
        "cooked",
        "pan",
        "altering",
        "position",
        "molecule",
        "say",
        "happens",
        "proceeding",
        "future",
        "past",
        "lawfully",
        "miracle",
        "occurred",
        "egg",
        "sits",
        "pan",
        "cooling",
        "transferring",
        "heat",
        "pan",
        "process",
        "gradually",
        "rot",
        "way",
        "egg",
        "normally",
        "except",
        "normally",
        "pasttofuture",
        "direction",
        "idea",
        "world",
        "viewed",
        "past",
        "future",
        "look",
        "exceedingly",
        "strange",
        "involves",
        "gretta",
        "devouring",
        "horrible",
        "rotten",
        "egg",
        "somehow",
        "found",
        "way",
        "pan",
        "bizarrely",
        "derotted",
        "none",
        "unlawful",
        "thanks",
        "law",
        "thermodynamics",
        "spectacularly",
        "unlikely",
        "help",
        "u",
        "original",
        "problem",
        "world",
        "namely",
        "fact",
        "trace",
        "gretta",
        "actual",
        "eggcracking",
        "remembering",
        "cracking",
        "presence",
        "empty",
        "broken",
        "eggshell",
        "bin",
        "would",
        "somehow",
        "individually",
        "brought",
        "world",
        "additional",
        "miracle",
        "order",
        "preserve",
        "perfect",
        "match",
        "particular",
        "fact",
        "onwards",
        "short",
        "answer",
        "trace",
        "world",
        "right",
        "course",
        "would",
        "normally",
        "expect",
        "trace",
        "point",
        "pretty",
        "conclusively",
        "gretta",
        "recently",
        "cracked",
        "egg",
        "lawfully",
        "entail",
        "looking",
        "world",
        "timereversed",
        "perspective",
        "take",
        "world",
        "trace",
        "run",
        "law",
        "backwards",
        "apart",
        "small",
        "miracle",
        "make",
        "egg",
        "rot",
        "slowly",
        "pan",
        "rather",
        "leaping",
        "waiting",
        "shell",
        "follows",
        "still",
        "going",
        "backwards",
        "time",
        "anyone",
        "guess",
        "whatever",
        "doubtless",
        "look",
        "bizarre",
        "viewed",
        "usual",
        "pasttofuture",
        "direction",
        "may",
        "world",
        "world",
        "single",
        "small",
        "miracle",
        "perfect",
        "match",
        "particular",
        "fact",
        "thereafter",
        "close",
        "actual",
        "world",
        "world",
        "small",
        "miracle",
        "gretta",
        "crack",
        "egg",
        "elga",
        "argues",
        "asymmetry",
        "counterfactual",
        "dependence",
        "lewis",
        "defines",
        "several",
        "author",
        "come",
        "conclusion",
        "viable",
        "account",
        "asymmetry",
        "counterfactual",
        "dependence",
        "must",
        "derive",
        "asymmetry",
        "miracle",
        "lewis",
        "claim",
        "thermodynamic",
        "asymmetry",
        "fact",
        "entropy",
        "increase",
        "towards",
        "future",
        "particular",
        "david",
        "albert",
        "proposes",
        "need",
        "assume",
        "past",
        "hypothesis",
        "assumption",
        "universe",
        "began",
        "extremely",
        "low",
        "entropy",
        "condition",
        "past",
        "hypothesis",
        "relationship",
        "asymmetry",
        "counterfactual",
        "dependence",
        "much",
        "discussed",
        "see",
        "frisch",
        "loewer",
        "price",
        "weslake",
        "kutach",
        "transitivity",
        "seen",
        "lewis",
        "build",
        "transitivity",
        "causation",
        "defining",
        "causation",
        "term",
        "chain",
        "causal",
        "dependence",
        "however",
        "number",
        "alleged",
        "counterexamples",
        "presented",
        "cast",
        "doubt",
        "transitivity",
        "lewis",
        "a",
        "present",
        "short",
        "catalogue",
        "counterexample",
        "sample",
        "two",
        "counterexample",
        "first",
        "unpublished",
        "muchdiscussed",
        "example",
        "due",
        "ned",
        "hall",
        "hiker",
        "walking",
        "along",
        "mountain",
        "trail",
        "boulder",
        "high",
        "dislodged",
        "come",
        "careering",
        "mountain",
        "slope",
        "hiker",
        "notice",
        "boulder",
        "duck",
        "appropriate",
        "time",
        "careering",
        "boulder",
        "cause",
        "hiker",
        "duck",
        "turn",
        "cause",
        "continued",
        "stride",
        "second",
        "causal",
        "link",
        "involves",
        "double",
        "prevention",
        "duck",
        "prevents",
        "collision",
        "hiker",
        "boulder",
        "occurred",
        "would",
        "prevented",
        "hiker",
        "continued",
        "stride",
        "however",
        "careering",
        "boulder",
        "sort",
        "thing",
        "would",
        "normally",
        "prevent",
        "hiker",
        "continued",
        "stride",
        "seems",
        "counterintuitive",
        "say",
        "cause",
        "stride",
        "second",
        "example",
        "due",
        "douglas",
        "ehring",
        "jones",
        "put",
        "potassium",
        "salt",
        "hot",
        "fire",
        "potassium",
        "compound",
        "produce",
        "purple",
        "flame",
        "heated",
        "flame",
        "change",
        "purple",
        "colour",
        "though",
        "everything",
        "else",
        "remains",
        "purple",
        "flame",
        "ignites",
        "flammable",
        "material",
        "nearby",
        "judge",
        "putting",
        "potassium",
        "salt",
        "fire",
        "caused",
        "purple",
        "flame",
        "turn",
        "caused",
        "flammable",
        "material",
        "ignite",
        "seems",
        "implausible",
        "judge",
        "putting",
        "potassium",
        "salt",
        "fire",
        "caused",
        "flammable",
        "material",
        "ignite",
        "various",
        "reply",
        "made",
        "counterexample",
        "la",
        "paul",
        "offer",
        "response",
        "second",
        "example",
        "involves",
        "conceiving",
        "relatum",
        "causation",
        "event",
        "aspect",
        "argues",
        "mismatch",
        "event",
        "aspect",
        "effect",
        "first",
        "causal",
        "link",
        "flame",
        "purple",
        "colour",
        "event",
        "aspect",
        "cause",
        "second",
        "causal",
        "link",
        "flame",
        "touching",
        "flammable",
        "material",
        "thus",
        "true",
        "purple",
        "flame",
        "cause",
        "ignition",
        "failure",
        "transitivity",
        "maslen",
        "solves",
        "problem",
        "appealing",
        "contrastivist",
        "account",
        "causation",
        "see",
        "contrast",
        "situation",
        "effectend",
        "first",
        "causal",
        "statement",
        "match",
        "contrast",
        "situation",
        "causeend",
        "second",
        "causal",
        "statement",
        "thus",
        "first",
        "causal",
        "statement",
        "interpreted",
        "saying",
        "jones",
        "putting",
        "potassium",
        "salt",
        "fire",
        "rather",
        "caused",
        "flame",
        "turn",
        "purple",
        "rather",
        "yellow",
        "second",
        "causal",
        "statement",
        "interpreted",
        "saying",
        "purple",
        "fire",
        "occurring",
        "rather",
        "occurring",
        "caused",
        "flammable",
        "material",
        "ignite",
        "rather",
        "ignite",
        "mismatch",
        "kind",
        "genuine",
        "counterexample",
        "transitivity",
        "first",
        "example",
        "handled",
        "way",
        "defender",
        "transitivity",
        "replied",
        "intuition",
        "intransitivity",
        "causation",
        "example",
        "misleading",
        "instance",
        "lewis",
        "a",
        "point",
        "counterexample",
        "transitivity",
        "typically",
        "involve",
        "structure",
        "ctype",
        "event",
        "generally",
        "prevents",
        "etype",
        "particular",
        "case",
        "cevent",
        "actually",
        "cause",
        "another",
        "event",
        "counter",
        "threat",
        "cause",
        "eevent",
        "mix",
        "question",
        "generally",
        "conducive",
        "question",
        "caused",
        "particular",
        "case",
        "say",
        "may",
        "think",
        "reasonable",
        "deny",
        "c",
        "cause",
        "e",
        "keep",
        "focus",
        "sharply",
        "particular",
        "case",
        "must",
        "insist",
        "c",
        "fact",
        "cause",
        "e",
        "debate",
        "transitivity",
        "causation",
        "easily",
        "settled",
        "partly",
        "tied",
        "issue",
        "best",
        "counterfactual",
        "theory",
        "deal",
        "example",
        "preemption",
        "seen",
        "lewis",
        "counterfactual",
        "theory",
        "relies",
        "transitivity",
        "causation",
        "handle",
        "case",
        "preemption",
        "case",
        "could",
        "handled",
        "way",
        "would",
        "take",
        "theoretical",
        "pressure",
        "theory",
        "allowing",
        "concede",
        "alleged",
        "counterexample",
        "transitivity",
        "without",
        "succumbing",
        "difficulty",
        "posed",
        "preemption",
        "point",
        "see",
        "hitchcock",
        "extensive",
        "discussion",
        "issue",
        "around",
        "transitivity",
        "see",
        "paul",
        "hall",
        "chap",
        "preemption",
        "seen",
        "lewis",
        "employ",
        "strategy",
        "defining",
        "causation",
        "term",
        "chain",
        "causal",
        "dependence",
        "make",
        "causation",
        "transitive",
        "also",
        "deal",
        "preemption",
        "example",
        "however",
        "preemption",
        "example",
        "strategy",
        "deal",
        "satisfactorily",
        "difficulty",
        "concerning",
        "preemption",
        "proven",
        "biggest",
        "bugbear",
        "lewis",
        "theory",
        "paul",
        "hall",
        "chap",
        "contains",
        "extensive",
        "discussion",
        "problem",
        "posed",
        "preemption",
        "kind",
        "redundant",
        "causation",
        "counterfactual",
        "theory",
        "c",
        "lewis",
        "distinguishes",
        "case",
        "early",
        "late",
        "preemption",
        "early",
        "preemption",
        "example",
        "process",
        "running",
        "preempted",
        "alternative",
        "cut",
        "short",
        "main",
        "process",
        "running",
        "preempting",
        "cause",
        "gone",
        "completion",
        "example",
        "two",
        "assassin",
        "given",
        "example",
        "sort",
        "theory",
        "causation",
        "term",
        "chain",
        "causal",
        "dependence",
        "handle",
        "sort",
        "example",
        "contrast",
        "case",
        "late",
        "preemption",
        "one",
        "process",
        "running",
        "preempted",
        "cause",
        "cut",
        "short",
        "main",
        "process",
        "running",
        "completion",
        "bringing",
        "effect",
        "preempted",
        "potential",
        "cause",
        "opportunity",
        "following",
        "example",
        "late",
        "preemption",
        "due",
        "hall",
        "billy",
        "suzy",
        "throw",
        "rock",
        "bottle",
        "suzy",
        "throw",
        "first",
        "rock",
        "arrives",
        "first",
        "shatters",
        "glass",
        "billy",
        "rock",
        "sail",
        "air",
        "bottle",
        "stood",
        "moment",
        "earlier",
        "without",
        "suzy",
        "throw",
        "billy",
        "throw",
        "would",
        "shattered",
        "bottle",
        "however",
        "suzy",
        "throw",
        "caused",
        "bottle",
        "shatter",
        "billy",
        "throw",
        "merely",
        "preempted",
        "potential",
        "cause",
        "case",
        "late",
        "preemption",
        "alternative",
        "process",
        "billy",
        "throw",
        "cut",
        "short",
        "main",
        "process",
        "suzy",
        "throw",
        "running",
        "completion",
        "lewis",
        "theory",
        "explain",
        "judgement",
        "suzy",
        "throw",
        "caused",
        "shattering",
        "bottle",
        "causal",
        "dependence",
        "suzy",
        "throw",
        "shattering",
        "since",
        "even",
        "suzy",
        "thrown",
        "rock",
        "bottle",
        "would",
        "shattered",
        "due",
        "billy",
        "throw",
        "chain",
        "stepwise",
        "dependence",
        "running",
        "cause",
        "effect",
        "event",
        "intermediate",
        "suzy",
        "throw",
        "shattering",
        "link",
        "chain",
        "dependence",
        "take",
        "instance",
        "suzy",
        "rock",
        "midtrajectory",
        "event",
        "depends",
        "suzy",
        "initial",
        "throw",
        "problem",
        "shattering",
        "bottle",
        "depend",
        "even",
        "without",
        "bottle",
        "would",
        "still",
        "shattered",
        "billy",
        "throw",
        "sure",
        "bottle",
        "shattering",
        "would",
        "occurred",
        "without",
        "suzy",
        "throw",
        "would",
        "different",
        "bottle",
        "shattering",
        "actually",
        "occurred",
        "suzy",
        "throw",
        "start",
        "would",
        "occurred",
        "later",
        "observation",
        "suggests",
        "one",
        "solution",
        "problem",
        "late",
        "preemption",
        "might",
        "insist",
        "event",
        "involved",
        "construed",
        "fragile",
        "event",
        "accordingly",
        "true",
        "rather",
        "false",
        "suzy",
        "thrown",
        "rock",
        "actual",
        "bottle",
        "shattering",
        "taken",
        "fragile",
        "event",
        "essential",
        "time",
        "manner",
        "occurrence",
        "would",
        "occurred",
        "lewis",
        "endorse",
        "response",
        "ground",
        "uniform",
        "policy",
        "construing",
        "event",
        "fragile",
        "would",
        "go",
        "usual",
        "practice",
        "would",
        "generate",
        "many",
        "spurious",
        "causal",
        "dependence",
        "example",
        "suppose",
        "poison",
        "kill",
        "victim",
        "slowly",
        "painfully",
        "taken",
        "full",
        "stomach",
        "victim",
        "eating",
        "dinner",
        "drink",
        "poison",
        "would",
        "count",
        "cause",
        "death",
        "since",
        "time",
        "manner",
        "death",
        "depend",
        "eating",
        "dinner",
        "discussion",
        "limitation",
        "response",
        "see",
        "lewis",
        "c",
        "solution",
        "late",
        "preemption",
        "problem",
        "lewis",
        "cautiously",
        "endorses",
        "c",
        "appeal",
        "notion",
        "quasidependence",
        "consider",
        "case",
        "resembles",
        "case",
        "billy",
        "suzy",
        "throwing",
        "rock",
        "bottle",
        "suzy",
        "throw",
        "rock",
        "c",
        "shatters",
        "bottle",
        "e",
        "exactly",
        "way",
        "original",
        "case",
        "case",
        "billy",
        "rock",
        "entirely",
        "absent",
        "original",
        "case",
        "e",
        "caused",
        "counterfactually",
        "depend",
        "c",
        "whereas",
        "second",
        "case",
        "e",
        "caused",
        "counterfactually",
        "depend",
        "c",
        "intrinsic",
        "character",
        "process",
        "leading",
        "c",
        "e",
        "case",
        "thus",
        "lewis",
        "say",
        "original",
        "case",
        "billy",
        "also",
        "throwing",
        "e",
        "quasidepends",
        "c",
        "could",
        "redefine",
        "causal",
        "chain",
        "sequence",
        "two",
        "event",
        "either",
        "dependence",
        "quasidependence",
        "step",
        "always",
        "one",
        "event",
        "cause",
        "another",
        "iff",
        "causal",
        "chain",
        "one",
        "c",
        "related",
        "idea",
        "pursued",
        "menzies",
        "note",
        "proposed",
        "definition",
        "causal",
        "chain",
        "notwithstanding",
        "quasidependence",
        "solution",
        "demand",
        "transitivity",
        "way",
        "lewis",
        "earlier",
        "solution",
        "problem",
        "early",
        "preemption",
        "backup",
        "potential",
        "cause",
        "safely",
        "way",
        "case",
        "preemption",
        "early",
        "late",
        "effect",
        "straightforwardly",
        "quasidepend",
        "cause",
        "lewis",
        "dissatisfaction",
        "attempt",
        "deal",
        "problem",
        "late",
        "preemption",
        "well",
        "theory",
        "inability",
        "deal",
        "trumping",
        "preemption",
        "schaffer",
        "a",
        "led",
        "development",
        "theory",
        "problem",
        "relating",
        "preemption",
        "arises",
        "chancy",
        "causation",
        "theory",
        "address",
        "discussed"
    ]
}