{
    "main_text": "Physics || Quantum Mechanics\n4.4 Two alternatives\n\nThese alleged examples of backward causation have one thing in common.\nThey are all based on the idea that fundamental physical processes are\nby themselves symmetric in nature. Our ordinary notion of causation\ndoes not track any nomological feature of the world. What counts as\nthe cause and the effect depends on the observer’s projection of\nhis or her temporal sense onto the world. So it is still an open\nquestion how a coherent notion of backward causation can fit into this\ngeneral understanding of nature. The question we therefore have to\nanswer is the following:\n\n How can we distinguish between forward causation and backward\ncausation if all basic physical processes are time symmetric according\nto our description of nature? \n\n\nTwo very different reactions to this problem seem possible.\n4.4.1 Boundary Conditions\n\nOne proposal is to say that if we came across reversed cases of de\nfacto irreversible processes, such as running a film backwards in\nwhich the cream converged in a coffee cup, such cases should be\ninterpreted as examples of backward causation (Price 1996). Such a\nclaim build on a common interpretation of time reversal invariance of\nprocesses according to which this descriptive feature of the dynamical\nequations of physics makes reversal processes symmetric in time. Many\nphilosophers have defended such an interpretation, in particular Hans\nReichenbach (1956, 1929 [1958]) and Adolf Grünbaum (1963). This\nalso led them to argued that only de facto irreversible\nprocesses, such as those described by statistical thermodynamics,\ncould be used to defined a physical orientation of time. Thus, it\nseems to be the case that the actual world consisting of mostly de\nfacto irreversible processes on the macroscopic level due to a\nprevalent set of boundary conditions is temporally and causally\nsymmetric on the microscopic level. On the macroscopic level, de\nfacto irreversible processes emerge, because the boundary\nconditions are a result of the huge degree of freedom among\nmicroprocesses or coherence conditions forced upon the underlying\nmicroscopic processes.\n\nThe point is here to argue that it is the absence of the right initial\nor boundary conditions on the macroscopic level that makes backward\ncausation so rare or nearly empirically impossible. This suggestion is\nbased on three basic assumptions: (i) there is no objective asymmetry\nin the world, causal processes are intrinsically symmetric in nature,\nor causation is bidirectional, and therefore the fundamental processes\nof the micro-world are temporally symmetric; (ii) causal asymmetry is\nsubjective in the sense that any attribution of an asymmetry between\ncause and effect depends on our use of counterfactuals and our own\ntemporal orientation; (iii) backward causation, or advanced action, is\nnonetheless possible because sometimes the correlation of certain past\nevents depends on the existence of causally symmetric processes and\nsome future boundary conditions. For instance, advanced actions in\nelectrodynamics require that the existence of transmitters in the\nfuture are centered on organized incoming wave fronts; and advanced\nactions in quantum mechanics require that their present states are in\npart determined by the future conditions (measurements) they are to\nencounter. This feature is then taken to explain quantum entanglement\nand the violation of Bell’s inequalities in quantum\nmechanics.\n\nA simple consideration seems to support this interpretation. Think of\na particle travelling between two boxes. The normal observer and the\ncounter-observer who has an inverse time sense will describe the\nexchange in conflicting terms. To the normal observer Box 1, say, will\nbe considered as the emitter because it loses energy before anything\nin Box 2 happens. Therefore, Box 2 will be considered as the receiver\nsince it gains energy at a later time. So in relation to the normal\nobserver, the particle travels from Box 1 to Box 2. The\ncounter-observer, however, sees the situation with opposite eyes. In\nrelation to him, Box 2 loses energy and not until thereafter does Box\n1 gain a similar amount of energy. Accordingly, in relation to the\ncounter-observer, the particle moves from Box 2 to Box 1. In other\nwords whether a box is considered to be an emitter or a receiver\ndepends on the observer’s time sense.\n4.4.2 Nomic conditions\n\nThe other proposal denies that basic physical processes are time\nsymmetric and argues, in contrast, that the causal asymmetry is\nobjective and therefore that there exists an intrinsic difference\nbetween the cause and the effect of all physical processes. John\nEarman (1967b and 1969) may be the first who argued against the\ninterpretation that time reversal invariance of processes is identical\nwith invariance under the exchange of the temporal order between\nearlier and later. Two reversed tokens of the same\ntype of physical process do not developed in the opposite direction of\ntime.\n\nHence, backward causation should not be considered as a notion about\nboundary conditions but as a notion concerned with processes that\nnomically distinguish themselves from forward causal processes. Thus,\nif there are processes in the world that might be seen as a\nmanifestation of backward causation, these are not to be depicted by a\ndescription that leaves them to be time reversed cases of ordinary\nforward causal processes (Faye 1981/1989, 1997, 2002). This\nalternative interpretation rests on a basic claim and four\nassumptions.\n\nThe fundamental claim is that for any observer it is possible to\nidentify experimentally the cause and the effect so that these remain\nthe same even in relation to counter-observers, i.e., observers having\nthe opposite time sense of ours. In support of this claim consider the\nfollowing thought experiment. Two boxes, each having a shutter, are\nfacing each other. Assume, ex hypothesis, that Box 1 is the particle\nsource and Box 2 is the particle receiver. The question is how a\nnormal observer and a counter-observer can come to agreement that\nparticles move from Box 1 to Box 2. The answer can be found through a\nseries of manipulations with the shutters, I would say. There are four\npossible combinations of the two shutters: open-open, close-close,\nopen-close, close-open. Let us call any change of energy in Box 1,\nregardless of whether it emits or receives a particle, \\(A\\) and,\nsimilarly, any change of energy in Box \\(2 B\\). Whether \\(A\\) or \\(B\\)\nstand for a gain or a loss of energy can be determined by weighing the\ntwo boxes. (i) In case both boxes are closed, no particle will leave\nBox 1 and no particle is received by Box 2, thus no gain or loss of\nenergy occurs, and both the normal observer and the counter-observer\nsee a situation of not-\\(A\\), not-\\(B\\). (ii) In case both boxes are\nopen a particle leaves Box 1 and is received by Box 2. Again this can\nbe observed by measuring the change of energy in the two boxes. Thus\nthe observers will see a situation of both \\(A\\) and \\(B\\). (iii) In\ncase Box 1 is closed and Box 2 is open, they will observe no change of\nenergy in Box 1 (because it is closed) and, since no particle is\nleaving Box 1, no particle will reach Box 2 although its shutter is\nopen. Hence the observers measure no energy change in this box. Thus\nthey see not-\\(A\\) and not-\\(B\\). (iv) Finally, if Box 1 is open and\nBox 2 is closed, a particle leaves Box 1, but none is received by Box\n2. In other words, there is a loss or a gain of energy in Box 1, but\nno loss or gain of energy in Box 2. So the observers see \\(A\\) and\nnot-\\(B\\). The upshot of this toy experiment is that the normal\nobserver as well as the counter-observer experience two \\(A\\)s but\nonly one \\(B\\), and one not-\\(A\\) but two not-\\(B\\)s; therefore both\nwill agree that the particles move from Box 1 to Box 2.\n\nThis means that what a normal observer identifies as a forward causal\nprocess will be regarded as a backward causal process in relation to\nthe counter-observer in the sense that the very same event acting as a\npast cause for the normal observer will act as a future cause for the\ncounter-observer. This indicates, too, that in relation to a normal\nobserver forward causation and backward causation cannot be regarded\nas two different manifestations of nomologically reversible (but\nde facto irreversible) processes since both\nmanifestations—the common process and the very improbable\nreversed process—would develop forward in time. If this claim is\ntrue, it implies that the description of physical processes should\nreflect such an intrinsic asymmetry in a way that the nomic\ndescription varies according to whether the process in question goes\nforward or backwards in time. Moreover, we must also be able to\ndistinguish theoretically (and not only experimentally) between the\nnormal observer’s report and the counter-observer’s report\nof the same process by a separate convention in respect to whether the\nprocess is forward moving or backward moving. What we want is a\ncharacterization of every physical process so that the invariance of\ncause and effect corresponds to nomological\nirreversibility.\n\nIn order to establish a nomic, intrinsic distinction between forward\ncausal processes and backward causal processes one has to take\ndeparture in four assumptions. (i) Process tokens and process\ntypes are distinct in the sense that only process types are\nreversible, process tokens are not. (ii) A normal observer will\ndescribe causal processes propagating forward in time in terms of\npositive mass and positive energy states pointing into her future\nwhereas she will describe the same tokens in terms of negative\nmass and energy states pointing into her past. This reflects two\npossible solutions of the four-momentum vector in the theory of\nrelativity. (iii)Thus, one must distinguish between a passive\ntime reversal operation and an active time reversal\noperation. The passive transformation is applied to the same process\ntoken by describing it in terms of opposite coordinates and\nopposite energy states. The active transformation, in contrast, brings\nabout another token of the same process type in virtue of some\nphysical translation or rotation of the system itself, both tokens\nhaving the same energy sign pointing in the same direction of time.\n(iv) The description in terms of positive mass and the positive\nenergy flow corresponds to the intrinsic order of the propagation.\n\nNow, let us try to apply the nomic interpretation to the above\nconsideration concerning the exchange of a particle between two boxes.\nIn relation to the normal observer who describes the particle in terms\nof its positive energy component, it travels from Box 1 to\nBox 2 because Box 1 looses energy at an earlier time and Box 2 gains\nenergy at a later time. The same situation is by the counter-observer\ndescribed in terms of the particle’s negative energy\ncomponent as a situation where something happens in Box 2 before\nit happens in Box 1. In relation to the counter-observer, Box 2 would\nnot, as the boundary interpretation suggests, loose energy. On the\ncontrary, Box 2 would seem to gain energy, but the counter-observer\nwould describe the particle as a series of negative energy states\nreaching into his future supposing the particle to be moving from Box\n2 to Box 1 carrying negative energy. But, as we have just argued, the\nparticle really moves from Box 1 to Box 2, from the\ncounter-observer’s future into his past carrying positive\nenergy.\n\nConsequently, the nomic interpretation holds that in relation to our\nnormal time sense the causal direction of ordinary processes is\nidentical with that of their reversed processes. In other words, take\ntwo tokens of a nomologically reversible process type, say \\(A\\) and\n\\(B\\), and let \\(B\\) be the actively time reversed process of \\(A\\),\nthen this interpretation claims that \\(A\\) and \\(B\\) causally develop\nin the same direction of time. So, according to this view, neither\nincoming, contracting electromagnetic waves nor the decrease of\nentropy would count as examples of backward causation as long as such\nprocesses involve ordinary types of matter, i.e., matter that\npossesses positive mass and/or energy pointing, in relation to our\nnormal time sense, towards the future. The notion of backward\ncausation should instead be applied to matter of a different type,\nparticles that appear to have, according to usual conventions,\nnegative mass and/or energy pointing, in relation to our normal\ntime sense, towards the future but positive mass and/or energy\npointing towards the past. Such advanced matter, if it exists,\nshould be distinguished from both ordinary retarded matter as well as\ntachyons by always being described with respect to our time sense in\nterms of negative mass and energy stretching forward in time. A\nconsequence is that a world in which advanced matter exists together\nwith retarded matter, and where advanced matter is able to interact\ndirectly with the same amount of retarded matter, both would, in case\nthey actually did interact, annihilate without leaving any trace of\nenergy.\n\nHow and whether the notion of backward causation has a role to play in\nphysics has yet to be seen. But as long as no common agreement exists\namong philosophers and physicists about what in the physical\ndescription of the world corresponds to our everyday notion of\ncausation, it would still be a matter of theoretical dispute what\ncounts as empirical examples of backward causation.\n",
    "section_title": "4.4 Two alternatives",
    "entry_title": "Backward Causation",
    "hierarchy_title": "Backward Causation || Physics || Quantum Mechanics",
    "tokenized_text": [
        "physic",
        "quantum",
        "mechanic",
        "two",
        "alternative",
        "alleged",
        "example",
        "backward",
        "causation",
        "one",
        "thing",
        "common",
        "based",
        "idea",
        "fundamental",
        "physical",
        "process",
        "symmetric",
        "nature",
        "ordinary",
        "notion",
        "causation",
        "track",
        "nomological",
        "feature",
        "world",
        "count",
        "cause",
        "effect",
        "depends",
        "observer",
        "projection",
        "temporal",
        "sense",
        "onto",
        "world",
        "still",
        "open",
        "question",
        "coherent",
        "notion",
        "backward",
        "causation",
        "fit",
        "general",
        "understanding",
        "nature",
        "question",
        "therefore",
        "answer",
        "following",
        "distinguish",
        "forward",
        "causation",
        "backward",
        "causation",
        "basic",
        "physical",
        "process",
        "time",
        "symmetric",
        "according",
        "description",
        "nature",
        "two",
        "different",
        "reaction",
        "problem",
        "seem",
        "possible",
        "boundary",
        "condition",
        "one",
        "proposal",
        "say",
        "came",
        "across",
        "reversed",
        "case",
        "de",
        "facto",
        "irreversible",
        "process",
        "running",
        "film",
        "backwards",
        "cream",
        "converged",
        "coffee",
        "cup",
        "case",
        "interpreted",
        "example",
        "backward",
        "causation",
        "price",
        "claim",
        "build",
        "common",
        "interpretation",
        "time",
        "reversal",
        "invariance",
        "process",
        "according",
        "descriptive",
        "feature",
        "dynamical",
        "equation",
        "physic",
        "make",
        "reversal",
        "process",
        "symmetric",
        "time",
        "many",
        "philosopher",
        "defended",
        "interpretation",
        "particular",
        "han",
        "reichenbach",
        "adolf",
        "grünbaum",
        "also",
        "led",
        "argued",
        "de",
        "facto",
        "irreversible",
        "process",
        "described",
        "statistical",
        "thermodynamics",
        "could",
        "used",
        "defined",
        "physical",
        "orientation",
        "time",
        "thus",
        "seems",
        "case",
        "actual",
        "world",
        "consisting",
        "mostly",
        "de",
        "facto",
        "irreversible",
        "process",
        "macroscopic",
        "level",
        "due",
        "prevalent",
        "set",
        "boundary",
        "condition",
        "temporally",
        "causally",
        "symmetric",
        "microscopic",
        "level",
        "macroscopic",
        "level",
        "de",
        "facto",
        "irreversible",
        "process",
        "emerge",
        "boundary",
        "condition",
        "result",
        "huge",
        "degree",
        "freedom",
        "among",
        "microprocesses",
        "coherence",
        "condition",
        "forced",
        "upon",
        "underlying",
        "microscopic",
        "process",
        "point",
        "argue",
        "absence",
        "right",
        "initial",
        "boundary",
        "condition",
        "macroscopic",
        "level",
        "make",
        "backward",
        "causation",
        "rare",
        "nearly",
        "empirically",
        "impossible",
        "suggestion",
        "based",
        "three",
        "basic",
        "assumption",
        "objective",
        "asymmetry",
        "world",
        "causal",
        "process",
        "intrinsically",
        "symmetric",
        "nature",
        "causation",
        "bidirectional",
        "therefore",
        "fundamental",
        "process",
        "microworld",
        "temporally",
        "symmetric",
        "ii",
        "causal",
        "asymmetry",
        "subjective",
        "sense",
        "attribution",
        "asymmetry",
        "cause",
        "effect",
        "depends",
        "use",
        "counterfactuals",
        "temporal",
        "orientation",
        "iii",
        "backward",
        "causation",
        "advanced",
        "action",
        "nonetheless",
        "possible",
        "sometimes",
        "correlation",
        "certain",
        "past",
        "event",
        "depends",
        "existence",
        "causally",
        "symmetric",
        "process",
        "future",
        "boundary",
        "condition",
        "instance",
        "advanced",
        "action",
        "electrodynamics",
        "require",
        "existence",
        "transmitter",
        "future",
        "centered",
        "organized",
        "incoming",
        "wave",
        "front",
        "advanced",
        "action",
        "quantum",
        "mechanic",
        "require",
        "present",
        "state",
        "part",
        "determined",
        "future",
        "condition",
        "measurement",
        "encounter",
        "feature",
        "taken",
        "explain",
        "quantum",
        "entanglement",
        "violation",
        "bell",
        "inequality",
        "quantum",
        "mechanic",
        "simple",
        "consideration",
        "seems",
        "support",
        "interpretation",
        "think",
        "particle",
        "travelling",
        "two",
        "box",
        "normal",
        "observer",
        "counterobserver",
        "inverse",
        "time",
        "sense",
        "describe",
        "exchange",
        "conflicting",
        "term",
        "normal",
        "observer",
        "box",
        "say",
        "considered",
        "emitter",
        "loses",
        "energy",
        "anything",
        "box",
        "happens",
        "therefore",
        "box",
        "considered",
        "receiver",
        "since",
        "gain",
        "energy",
        "later",
        "time",
        "relation",
        "normal",
        "observer",
        "particle",
        "travel",
        "box",
        "box",
        "counterobserver",
        "however",
        "see",
        "situation",
        "opposite",
        "eye",
        "relation",
        "box",
        "loses",
        "energy",
        "thereafter",
        "box",
        "gain",
        "similar",
        "amount",
        "energy",
        "accordingly",
        "relation",
        "counterobserver",
        "particle",
        "move",
        "box",
        "box",
        "word",
        "whether",
        "box",
        "considered",
        "emitter",
        "receiver",
        "depends",
        "observer",
        "time",
        "sense",
        "nomic",
        "condition",
        "proposal",
        "denies",
        "basic",
        "physical",
        "process",
        "time",
        "symmetric",
        "argues",
        "contrast",
        "causal",
        "asymmetry",
        "objective",
        "therefore",
        "exists",
        "intrinsic",
        "difference",
        "cause",
        "effect",
        "physical",
        "process",
        "john",
        "earman",
        "b",
        "may",
        "first",
        "argued",
        "interpretation",
        "time",
        "reversal",
        "invariance",
        "process",
        "identical",
        "invariance",
        "exchange",
        "temporal",
        "order",
        "earlier",
        "later",
        "two",
        "reversed",
        "token",
        "type",
        "physical",
        "process",
        "developed",
        "opposite",
        "direction",
        "time",
        "hence",
        "backward",
        "causation",
        "considered",
        "notion",
        "boundary",
        "condition",
        "notion",
        "concerned",
        "process",
        "nomically",
        "distinguish",
        "forward",
        "causal",
        "process",
        "thus",
        "process",
        "world",
        "might",
        "seen",
        "manifestation",
        "backward",
        "causation",
        "depicted",
        "description",
        "leaf",
        "time",
        "reversed",
        "case",
        "ordinary",
        "forward",
        "causal",
        "process",
        "faye",
        "alternative",
        "interpretation",
        "rest",
        "basic",
        "claim",
        "four",
        "assumption",
        "fundamental",
        "claim",
        "observer",
        "possible",
        "identify",
        "experimentally",
        "cause",
        "effect",
        "remain",
        "even",
        "relation",
        "counterobservers",
        "ie",
        "observer",
        "opposite",
        "time",
        "sense",
        "support",
        "claim",
        "consider",
        "following",
        "thought",
        "experiment",
        "two",
        "box",
        "shutter",
        "facing",
        "assume",
        "ex",
        "hypothesis",
        "box",
        "particle",
        "source",
        "box",
        "particle",
        "receiver",
        "question",
        "normal",
        "observer",
        "counterobserver",
        "come",
        "agreement",
        "particle",
        "move",
        "box",
        "box",
        "answer",
        "found",
        "series",
        "manipulation",
        "shutter",
        "would",
        "say",
        "four",
        "possible",
        "combination",
        "two",
        "shutter",
        "openopen",
        "closeclose",
        "openclose",
        "closeopen",
        "let",
        "u",
        "call",
        "change",
        "energy",
        "box",
        "regardless",
        "whether",
        "emits",
        "receives",
        "particle",
        "a",
        "similarly",
        "change",
        "energy",
        "box",
        "b",
        "whether",
        "a",
        "b",
        "stand",
        "gain",
        "loss",
        "energy",
        "determined",
        "weighing",
        "two",
        "box",
        "case",
        "box",
        "closed",
        "particle",
        "leave",
        "box",
        "particle",
        "received",
        "box",
        "thus",
        "gain",
        "loss",
        "energy",
        "occurs",
        "normal",
        "observer",
        "counterobserver",
        "see",
        "situation",
        "not",
        "a",
        "not",
        "b",
        "ii",
        "case",
        "box",
        "open",
        "particle",
        "leaf",
        "box",
        "received",
        "box",
        "observed",
        "measuring",
        "change",
        "energy",
        "two",
        "box",
        "thus",
        "observer",
        "see",
        "situation",
        "a",
        "b",
        "iii",
        "case",
        "box",
        "closed",
        "box",
        "open",
        "observe",
        "change",
        "energy",
        "box",
        "closed",
        "since",
        "particle",
        "leaving",
        "box",
        "particle",
        "reach",
        "box",
        "although",
        "shutter",
        "open",
        "hence",
        "observer",
        "measure",
        "energy",
        "change",
        "box",
        "thus",
        "see",
        "not",
        "a",
        "not",
        "b",
        "iv",
        "finally",
        "box",
        "open",
        "box",
        "closed",
        "particle",
        "leaf",
        "box",
        "none",
        "received",
        "box",
        "word",
        "loss",
        "gain",
        "energy",
        "box",
        "loss",
        "gain",
        "energy",
        "box",
        "observer",
        "see",
        "a",
        "not",
        "b",
        "upshot",
        "toy",
        "experiment",
        "normal",
        "observer",
        "well",
        "counterobserver",
        "experience",
        "two",
        "a",
        "one",
        "b",
        "one",
        "not",
        "a",
        "two",
        "not",
        "b",
        "therefore",
        "agree",
        "particle",
        "move",
        "box",
        "box",
        "mean",
        "normal",
        "observer",
        "identifies",
        "forward",
        "causal",
        "process",
        "regarded",
        "backward",
        "causal",
        "process",
        "relation",
        "counterobserver",
        "sense",
        "event",
        "acting",
        "past",
        "cause",
        "normal",
        "observer",
        "act",
        "future",
        "cause",
        "counterobserver",
        "indicates",
        "relation",
        "normal",
        "observer",
        "forward",
        "causation",
        "backward",
        "causation",
        "regarded",
        "two",
        "different",
        "manifestation",
        "nomologically",
        "reversible",
        "de",
        "facto",
        "irreversible",
        "process",
        "since",
        "manifestationsthe",
        "common",
        "process",
        "improbable",
        "reversed",
        "processwould",
        "develop",
        "forward",
        "time",
        "claim",
        "true",
        "implies",
        "description",
        "physical",
        "process",
        "reflect",
        "intrinsic",
        "asymmetry",
        "way",
        "nomic",
        "description",
        "varies",
        "according",
        "whether",
        "process",
        "question",
        "go",
        "forward",
        "backwards",
        "time",
        "moreover",
        "must",
        "also",
        "able",
        "distinguish",
        "theoretically",
        "experimentally",
        "normal",
        "observer",
        "report",
        "counterobserver",
        "report",
        "process",
        "separate",
        "convention",
        "respect",
        "whether",
        "process",
        "forward",
        "moving",
        "backward",
        "moving",
        "want",
        "characterization",
        "every",
        "physical",
        "process",
        "invariance",
        "cause",
        "effect",
        "corresponds",
        "nomological",
        "irreversibility",
        "order",
        "establish",
        "nomic",
        "intrinsic",
        "distinction",
        "forward",
        "causal",
        "process",
        "backward",
        "causal",
        "process",
        "one",
        "take",
        "departure",
        "four",
        "assumption",
        "process",
        "token",
        "process",
        "type",
        "distinct",
        "sense",
        "process",
        "type",
        "reversible",
        "process",
        "token",
        "ii",
        "normal",
        "observer",
        "describe",
        "causal",
        "process",
        "propagating",
        "forward",
        "time",
        "term",
        "positive",
        "mass",
        "positive",
        "energy",
        "state",
        "pointing",
        "future",
        "whereas",
        "describe",
        "token",
        "term",
        "negative",
        "mass",
        "energy",
        "state",
        "pointing",
        "past",
        "reflects",
        "two",
        "possible",
        "solution",
        "fourmomentum",
        "vector",
        "theory",
        "relativity",
        "iii",
        "thus",
        "one",
        "must",
        "distinguish",
        "passive",
        "time",
        "reversal",
        "operation",
        "active",
        "time",
        "reversal",
        "operation",
        "passive",
        "transformation",
        "applied",
        "process",
        "token",
        "describing",
        "term",
        "opposite",
        "coordinate",
        "opposite",
        "energy",
        "state",
        "active",
        "transformation",
        "contrast",
        "brings",
        "another",
        "token",
        "process",
        "type",
        "virtue",
        "physical",
        "translation",
        "rotation",
        "system",
        "token",
        "energy",
        "sign",
        "pointing",
        "direction",
        "time",
        "iv",
        "description",
        "term",
        "positive",
        "mass",
        "positive",
        "energy",
        "flow",
        "corresponds",
        "intrinsic",
        "order",
        "propagation",
        "let",
        "u",
        "try",
        "apply",
        "nomic",
        "interpretation",
        "consideration",
        "concerning",
        "exchange",
        "particle",
        "two",
        "box",
        "relation",
        "normal",
        "observer",
        "describes",
        "particle",
        "term",
        "positive",
        "energy",
        "component",
        "travel",
        "box",
        "box",
        "box",
        "loos",
        "energy",
        "earlier",
        "time",
        "box",
        "gain",
        "energy",
        "later",
        "time",
        "situation",
        "counterobserver",
        "described",
        "term",
        "particle",
        "negative",
        "energy",
        "component",
        "situation",
        "something",
        "happens",
        "box",
        "happens",
        "box",
        "relation",
        "counterobserver",
        "box",
        "would",
        "boundary",
        "interpretation",
        "suggests",
        "loose",
        "energy",
        "contrary",
        "box",
        "would",
        "seem",
        "gain",
        "energy",
        "counterobserver",
        "would",
        "describe",
        "particle",
        "series",
        "negative",
        "energy",
        "state",
        "reaching",
        "future",
        "supposing",
        "particle",
        "moving",
        "box",
        "box",
        "carrying",
        "negative",
        "energy",
        "argued",
        "particle",
        "really",
        "move",
        "box",
        "box",
        "counterobserver",
        "future",
        "past",
        "carrying",
        "positive",
        "energy",
        "consequently",
        "nomic",
        "interpretation",
        "hold",
        "relation",
        "normal",
        "time",
        "sense",
        "causal",
        "direction",
        "ordinary",
        "process",
        "identical",
        "reversed",
        "process",
        "word",
        "take",
        "two",
        "token",
        "nomologically",
        "reversible",
        "process",
        "type",
        "say",
        "a",
        "b",
        "let",
        "b",
        "actively",
        "time",
        "reversed",
        "process",
        "a",
        "interpretation",
        "claim",
        "a",
        "b",
        "causally",
        "develop",
        "direction",
        "time",
        "according",
        "view",
        "neither",
        "incoming",
        "contracting",
        "electromagnetic",
        "wave",
        "decrease",
        "entropy",
        "would",
        "count",
        "example",
        "backward",
        "causation",
        "long",
        "process",
        "involve",
        "ordinary",
        "type",
        "matter",
        "ie",
        "matter",
        "posse",
        "positive",
        "mass",
        "andor",
        "energy",
        "pointing",
        "relation",
        "normal",
        "time",
        "sense",
        "towards",
        "future",
        "notion",
        "backward",
        "causation",
        "instead",
        "applied",
        "matter",
        "different",
        "type",
        "particle",
        "appear",
        "according",
        "usual",
        "convention",
        "negative",
        "mass",
        "andor",
        "energy",
        "pointing",
        "relation",
        "normal",
        "time",
        "sense",
        "towards",
        "future",
        "positive",
        "mass",
        "andor",
        "energy",
        "pointing",
        "towards",
        "past",
        "advanced",
        "matter",
        "exists",
        "distinguished",
        "ordinary",
        "retarded",
        "matter",
        "well",
        "tachyons",
        "always",
        "described",
        "respect",
        "time",
        "sense",
        "term",
        "negative",
        "mass",
        "energy",
        "stretching",
        "forward",
        "time",
        "consequence",
        "world",
        "advanced",
        "matter",
        "exists",
        "together",
        "retarded",
        "matter",
        "advanced",
        "matter",
        "able",
        "interact",
        "directly",
        "amount",
        "retarded",
        "matter",
        "would",
        "case",
        "actually",
        "interact",
        "annihilate",
        "without",
        "leaving",
        "trace",
        "energy",
        "whether",
        "notion",
        "backward",
        "causation",
        "role",
        "play",
        "physic",
        "yet",
        "seen",
        "long",
        "common",
        "agreement",
        "exists",
        "among",
        "philosopher",
        "physicist",
        "physical",
        "description",
        "world",
        "corresponds",
        "everyday",
        "notion",
        "causation",
        "would",
        "still",
        "matter",
        "theoretical",
        "dispute",
        "count",
        "empirical",
        "example",
        "backward",
        "causation"
    ]
}