{
    "main_text": "Interventionist Theories\n3. Interventionist Theories\n\nInterventionist theories are intended both as theories of causation\nand of causal explanation. Here we provide only a very quick overview\nof the former, referring readers to the entry\n causation and manipulability\n for more detailed discussion of the former and instead focus on\ncausal explanation. Consider a causal claim (generalization) of the\nform\n\n(G)\n“C causes E”\n\n\nwhere “C” and “E” are\nvariables – that is, they refer to properties or quantities that\ncan take at least two values. Examples are “forces cause\naccelerations” and “Smoking causes lung cancer”.\nAccording to interventionist accounts (G) is true if and only if there\nis a possible intervention I such that if I were to\nchange the value of C, the value of E or the\nprobability distribution of E would change (Woodward 2003).\nThe notion of an intervention is described in more detail in the\n causation and manipulability\n entry, but the basic idea is that this is an unconfounded\nexperimental manipulation of C that changes E, if at\nall, via a route that goes through C and not in any other\nway. Counterfactuals that describe would happen if an intervention\nwere to be performed are called interventionist\ncounterfactuals. A randomized experiment provides one paradigm of\nan intervention.\n\nCausal explanations can take several different forms within an\ninterventionist\n framework[13]\n – for instance, a causal explanation of some explanandum \\(E\n=e\\) requires:\n\n(3.1)\nSpecification of a true causal generalization \\(E= f(C)\\) –\nthat is, some set of values of \\(C\\) is mapped into values of \\(E\\) by\n\\(f\\) – meeting the interventionist criterion for causation\ndescribed above,\n\n\nas well as\n\n(3.2)\nOne or more initial conditions \\(C=c\\) (\\(C\\) being the\nindependent variable or variables that figure in\n (3.1))\n such that \\(E\\) is derivable from (3.1) and\n (3.2)\n\n\nand also meeting the condition\n\n(3.3)\nWhen combined with other initial conditions\n (3.1)\n tells us how the value e of E would change under\nchanges in the initial conditions in specified in\n (3.2).\n\n\nBy meeting these conditions (and especially in virtue of satisfying\n(3.3)) an explanation answers what Woodward (2003) calls\n“what-if-things-had-been-different questions”\n(w-questions) about E – it tells us how E\nwould have been different under changes in the values of the\nC variable from the value specified in (3.2).\n\nAs an example, consider an explanation of why the strength (E) of the\nelectrical field created by a long straight wire along which the\ncharge is uniformly distributed is described by \\(E= \\lambda/2 \\pi r\n\\epsilon_{o}\\) where \\(\\lambda\\) is the charge density and \\(r\\) is\nthe distance from the wire. An explanation of this can be constructed\nby appealing to Coulomb’s law (playing the role of\n (3.1)\n above) in conjunction with information about the shape of the wire\nand the charge distribution along it\n ((3.2)\n above). This information allows for the derivation of \\(E= \\lambda/2\n\\pi r \\epsilon_{o}\\) but it also can be used to provide answers to a\nnumber of other w-questions. For example, Coulomb’s law and a\nsimilar modeling strategy can be used to answer questions about what\nthe field would be if the wire had a different shape (e.g., if twisted\nto form a loop) or if it was somehow flattened into a plane or\ndeformed into a sphere.\n\nThe condition that the explanans answer a range of w-questions is\nintended to capture the requirement that the explanans must be\nexplanatorily relevant to the explanandum. That is, factors having to\ndo with the charge density and the shape of the conductor are\nexplanatorily relevant to the field intensity because changes in these\nfactors would lead to changes in the field intensity. Other factors\nsuch as the color of the conductor are irrelevant and should be\nomitted from the explanation because changes in them will not lead to\nchanges in the field intensity. As an additional illustration,\nconsider Salmon’s (1971a: 34) example of a purported explanation\nof (F) a male’s failure to get pregnant that appeals to\nhis taking birth control pills (B). Intuitively (B)\nis explanatorily irrelevant to (F). The interventionist model\ncaptures this by observing that B fails to satisfy the\nwhat-if-things-had-been-different requirement with respect to\nF: F would not change if B were to change.\n(Note the contrast with the rather different way in which the kairetic\nmodel captures explanatory relevance.)\n\nAnother key idea of the interventionist model is the notion of\ninvariance of a causal generalization (Woodward &\nHitchcock 2003). Consider again a generalization (G) relating \\(C\\) to\n\\(E\\), \\(E= f(C)\\). As we have seen, for (G) to describe a causal\nrelationship at all it must at least be the case that (G) correctly\ntells how E would change under at least some interventions on\nC. However, causal generalizations can vary according to the\nrange of interventions over which this is true. It might be that (G)\ncorrectly describes how E would change under some substantial\nrange R of interventions that set C to different\nvalues or this might instead be true only for some restricted range of\ninterventions on C. The interventions on C over\nwhich (G) continues to hold are the interventions over which (G) is\ninvariant. As an illustration consider a type of spring for\nwhich the restoring force F under extensions X is\ncorrectly described by Hooke’s law:\n\n(3.4)\n\\(F=-kX\\)\n\n\nfor some range R of interventions on X. Extending\nthe spring too much will cause it to break so that its behavior will\nno longer be described by Hooke’s law.\n (3.4)\n is invariant under interventions in R but not so for\ninterventions outside of R. (3.4) is, intuitively, invariant\nonly under a somewhat narrow range of interventions. Contrast (3.4)\nwith the gravitational inverse square law:\n\n(3.5)\n\\(F= Gm_{1}m_{2}/r^{2}\\).\n\n\n(3.5)\n is invariant under a rather wide range of interventions that set\n\\(m_1,\\) \\(m_2,\\) and \\(r\\) to different values but there are also\nvalues for these variables for which (3.5) fails to hold – e.g.,\nvalues at which general relativistic effects become important.\nMoreover, invariance under interventions is just one variety of\ninvariance. One may also talk about the invariance of a generalization\nunder many other sorts of changes – for example, changes in\nbackground conditions, understood as conditions that are not\nexplicitly included in the generalization itself. As an illustration,\nthe causal connection between smoking and lung cancer holds for\nsubjects with different diets, in different environmental conditions,\nwith different demographic characteristics and so\n on.[14]\n However, as explained below, it is invariance under interventions\nthat is most crucial to evaluating whether an explanation is good or\ndeep within the interventionist framework.\n\nGiven the account of causal explanation above it follows that for a\ngeneralization to figure in a causal explanation it must be invariant\nunder at least some interventions. As a general rule a generalization\nthat is invariant under a wider range of interventions and other\nchanges will be such that it can be used to answer a wider range of\nw-questions. (See\n section 4\n below.) In this respect such a generalization might be regarded as\nhaving superior explanatory credentials – it at least explains\nmore than generalizations with a narrower range of invariance.\nGeneralizations that are invariant under a very wide range of\ninterventions and that have the sort of mathematical formulation that\nallows for precise predictions are those that we tend to regard as\nlaws of nature. Generalizations that have a narrower range of\ninvariance like Hooke’s “law” capture causal\ninformation but are not plausible candidates for laws of nature. An\ninterventionist model of form\n (3.1–3.3)\n above thus requires generalizations with some degree of invariance or\nrelationships that support interventionist counterfactuals, but it\ndoes not require laws. In this respect, like the other models\nconsidered in this entry, it departs from the DN model which does\nrequire laws for successful explanation (see the entry on\n scientific explanation).\n\nTurning now to criticisms of the interventionist model, some of these\nare also criticisms of interventionist accounts of causation. Several\nof these (and particularly the delicate question of what it means for\nan intervention to be “possible”) are addressed if not\nresolved in the\n causation and manipulability\n entry.\n\nAnother criticism, not addressed in the above entry, concerns the\n“truth makers” or “grounds” for the\ninterventionist counterfactuals that figure in causal explanation.\nMany philosophers hold that it is necessary to provide a metaphysical\naccount of some kind for these. There are a variety of different\nproposals – perhaps interventionist counterfactuals or causal\nclaims more generally are made true by “powers” or\n“dispositions”. Perhaps instead such counterfactuals are\ngrounded in laws of nature, with the latter being understood in terms\nof some metaphysical framework, as in the Best Systems Analysis. For\nthe most part interventionists, have declined to provide truth\nconditions of this sort and this has struck some metaphysically minded\nphilosophers as a serious omission. One response is that while it\ncertainly makes sense to ask for deeper explanations of why various\ninterventionist counterfactuals hold, the only explanation that is\nneeded is an ordinary scientific explanation in terms of some deeper\ntheory, rather than any kind of distinctively\n“metaphysical” explanation (Woodward 2017b). For example,\none might explain why the interventionist counterfactual “if I\nwere to drop this bottle it will fall to the ground” is true by\nappealing to Newtonian gravitational theory and\n“grounding” it in this way. (There is also the task of\nproviding a semantics for interventionist counterfactuals and here\nthere have been a variety of proposals – see, e.g., Briggs 2012.\nBut again, this needn’t take the form of providing metaphysical\ngrounding.) This response raises the question of whether in addition\nto ordinary scientific explanations there are metaphysical\nexplanations (of counterfactuals, laws and so on) that it is the task\nof philosophy to provide – a very large topic that is beyond the\nscope of this entry.\n\nYet another criticism (pressed by Franklin-Hall 2016 and Weslake 2010)\nis that the w-condition implies that explanations at the lowest level\nof detail are always superior to explanations employing upper-level\nvariables – the argument being that lower-level explanations\nwill always answer more w-questions than upper-level explanations.\n(But see Woodward (2021) for further discussion.)\n",
    "section_title": "3. Interventionist Theories",
    "entry_title": "Causal Approaches to Scientific Explanation",
    "hierarchy_title": "Causal Approaches to Scientific Explanation || Interventionist Theories",
    "tokenized_text": [
        "interventionist",
        "theory",
        "interventionist",
        "theory",
        "interventionist",
        "theory",
        "intended",
        "theory",
        "causation",
        "causal",
        "explanation",
        "provide",
        "quick",
        "overview",
        "former",
        "referring",
        "reader",
        "entry",
        "causation",
        "manipulability",
        "detailed",
        "discussion",
        "former",
        "instead",
        "focus",
        "causal",
        "explanation",
        "consider",
        "causal",
        "claim",
        "generalization",
        "form",
        "g",
        "c",
        "cause",
        "e",
        "c",
        "e",
        "variable",
        "refer",
        "property",
        "quantity",
        "take",
        "least",
        "two",
        "value",
        "example",
        "force",
        "cause",
        "acceleration",
        "smoking",
        "cause",
        "lung",
        "cancer",
        "according",
        "interventionist",
        "account",
        "g",
        "true",
        "possible",
        "intervention",
        "change",
        "value",
        "c",
        "value",
        "e",
        "probability",
        "distribution",
        "e",
        "would",
        "change",
        "woodward",
        "notion",
        "intervention",
        "described",
        "detail",
        "causation",
        "manipulability",
        "entry",
        "basic",
        "idea",
        "unconfounded",
        "experimental",
        "manipulation",
        "c",
        "change",
        "e",
        "via",
        "route",
        "go",
        "c",
        "way",
        "counterfactuals",
        "describe",
        "would",
        "happen",
        "intervention",
        "performed",
        "called",
        "interventionist",
        "counterfactuals",
        "randomized",
        "experiment",
        "provides",
        "one",
        "paradigm",
        "intervention",
        "causal",
        "explanation",
        "take",
        "several",
        "different",
        "form",
        "within",
        "interventionist",
        "framework",
        "instance",
        "causal",
        "explanation",
        "explanandum",
        "e",
        "e",
        "requires",
        "specification",
        "true",
        "causal",
        "generalization",
        "e",
        "f",
        "c",
        "set",
        "value",
        "c",
        "mapped",
        "value",
        "e",
        "f",
        "meeting",
        "interventionist",
        "criterion",
        "causation",
        "described",
        "well",
        "one",
        "initial",
        "condition",
        "cc",
        "c",
        "independent",
        "variable",
        "variable",
        "figure",
        "e",
        "derivable",
        "also",
        "meeting",
        "condition",
        "combined",
        "initial",
        "condition",
        "tell",
        "u",
        "value",
        "e",
        "e",
        "would",
        "change",
        "change",
        "initial",
        "condition",
        "specified",
        "meeting",
        "condition",
        "especially",
        "virtue",
        "satisfying",
        "explanation",
        "answer",
        "woodward",
        "call",
        "whatifthingshadbeendifferent",
        "question",
        "wquestions",
        "e",
        "tell",
        "u",
        "e",
        "would",
        "different",
        "change",
        "value",
        "c",
        "variable",
        "value",
        "specified",
        "example",
        "consider",
        "explanation",
        "strength",
        "e",
        "electrical",
        "field",
        "created",
        "long",
        "straight",
        "wire",
        "along",
        "charge",
        "uniformly",
        "distributed",
        "described",
        "e",
        "lambda",
        "pi",
        "r",
        "epsilon_",
        "lambda",
        "charge",
        "density",
        "r",
        "distance",
        "wire",
        "explanation",
        "constructed",
        "appealing",
        "coulomb",
        "law",
        "playing",
        "role",
        "conjunction",
        "information",
        "shape",
        "wire",
        "charge",
        "distribution",
        "along",
        "information",
        "allows",
        "derivation",
        "e",
        "lambda",
        "pi",
        "r",
        "epsilon_",
        "also",
        "used",
        "provide",
        "answer",
        "number",
        "wquestions",
        "example",
        "coulomb",
        "law",
        "similar",
        "modeling",
        "strategy",
        "used",
        "answer",
        "question",
        "field",
        "would",
        "wire",
        "different",
        "shape",
        "eg",
        "twisted",
        "form",
        "loop",
        "somehow",
        "flattened",
        "plane",
        "deformed",
        "sphere",
        "condition",
        "explanans",
        "answer",
        "range",
        "wquestions",
        "intended",
        "capture",
        "requirement",
        "explanans",
        "must",
        "explanatorily",
        "relevant",
        "explanandum",
        "factor",
        "charge",
        "density",
        "shape",
        "conductor",
        "explanatorily",
        "relevant",
        "field",
        "intensity",
        "change",
        "factor",
        "would",
        "lead",
        "change",
        "field",
        "intensity",
        "factor",
        "color",
        "conductor",
        "irrelevant",
        "omitted",
        "explanation",
        "change",
        "lead",
        "change",
        "field",
        "intensity",
        "additional",
        "illustration",
        "consider",
        "salmon",
        "a",
        "example",
        "purported",
        "explanation",
        "f",
        "male",
        "failure",
        "get",
        "pregnant",
        "appeal",
        "taking",
        "birth",
        "control",
        "pill",
        "b",
        "intuitively",
        "b",
        "explanatorily",
        "irrelevant",
        "f",
        "interventionist",
        "model",
        "capture",
        "observing",
        "b",
        "fails",
        "satisfy",
        "whatifthingshadbeendifferent",
        "requirement",
        "respect",
        "f",
        "f",
        "would",
        "change",
        "b",
        "change",
        "note",
        "contrast",
        "rather",
        "different",
        "way",
        "kairetic",
        "model",
        "capture",
        "explanatory",
        "relevance",
        "another",
        "key",
        "idea",
        "interventionist",
        "model",
        "notion",
        "invariance",
        "causal",
        "generalization",
        "woodward",
        "hitchcock",
        "consider",
        "generalization",
        "g",
        "relating",
        "c",
        "e",
        "e",
        "f",
        "c",
        "seen",
        "g",
        "describe",
        "causal",
        "relationship",
        "must",
        "least",
        "case",
        "g",
        "correctly",
        "tell",
        "e",
        "would",
        "change",
        "least",
        "intervention",
        "c",
        "however",
        "causal",
        "generalization",
        "vary",
        "according",
        "range",
        "intervention",
        "true",
        "might",
        "g",
        "correctly",
        "describes",
        "e",
        "would",
        "change",
        "substantial",
        "range",
        "r",
        "intervention",
        "set",
        "c",
        "different",
        "value",
        "might",
        "instead",
        "true",
        "restricted",
        "range",
        "intervention",
        "c",
        "intervention",
        "c",
        "g",
        "continues",
        "hold",
        "intervention",
        "g",
        "invariant",
        "illustration",
        "consider",
        "type",
        "spring",
        "restoring",
        "force",
        "f",
        "extension",
        "x",
        "correctly",
        "described",
        "hooke",
        "law",
        "fkx",
        "range",
        "r",
        "intervention",
        "x",
        "extending",
        "spring",
        "much",
        "cause",
        "break",
        "behavior",
        "longer",
        "described",
        "hooke",
        "law",
        "invariant",
        "intervention",
        "r",
        "intervention",
        "outside",
        "r",
        "intuitively",
        "invariant",
        "somewhat",
        "narrow",
        "range",
        "intervention",
        "contrast",
        "gravitational",
        "inverse",
        "square",
        "law",
        "f",
        "gm_",
        "m_",
        "r",
        "invariant",
        "rather",
        "wide",
        "range",
        "intervention",
        "set",
        "m_",
        "m_",
        "r",
        "different",
        "value",
        "also",
        "value",
        "variable",
        "fails",
        "hold",
        "eg",
        "value",
        "general",
        "relativistic",
        "effect",
        "become",
        "important",
        "moreover",
        "invariance",
        "intervention",
        "one",
        "variety",
        "invariance",
        "one",
        "may",
        "also",
        "talk",
        "invariance",
        "generalization",
        "many",
        "sort",
        "change",
        "example",
        "change",
        "background",
        "condition",
        "understood",
        "condition",
        "explicitly",
        "included",
        "generalization",
        "illustration",
        "causal",
        "connection",
        "smoking",
        "lung",
        "cancer",
        "hold",
        "subject",
        "different",
        "diet",
        "different",
        "environmental",
        "condition",
        "different",
        "demographic",
        "characteristic",
        "however",
        "explained",
        "invariance",
        "intervention",
        "crucial",
        "evaluating",
        "whether",
        "explanation",
        "good",
        "deep",
        "within",
        "interventionist",
        "framework",
        "given",
        "account",
        "causal",
        "explanation",
        "follows",
        "generalization",
        "figure",
        "causal",
        "explanation",
        "must",
        "invariant",
        "least",
        "intervention",
        "general",
        "rule",
        "generalization",
        "invariant",
        "wider",
        "range",
        "intervention",
        "change",
        "used",
        "answer",
        "wider",
        "range",
        "wquestions",
        "see",
        "section",
        "respect",
        "generalization",
        "might",
        "regarded",
        "superior",
        "explanatory",
        "credential",
        "least",
        "explains",
        "generalization",
        "narrower",
        "range",
        "invariance",
        "generalization",
        "invariant",
        "wide",
        "range",
        "intervention",
        "sort",
        "mathematical",
        "formulation",
        "allows",
        "precise",
        "prediction",
        "tend",
        "regard",
        "law",
        "nature",
        "generalization",
        "narrower",
        "range",
        "invariance",
        "like",
        "hooke",
        "law",
        "capture",
        "causal",
        "information",
        "plausible",
        "candidate",
        "law",
        "nature",
        "interventionist",
        "model",
        "form",
        "thus",
        "requires",
        "generalization",
        "degree",
        "invariance",
        "relationship",
        "support",
        "interventionist",
        "counterfactuals",
        "require",
        "law",
        "respect",
        "like",
        "model",
        "considered",
        "entry",
        "departs",
        "dn",
        "model",
        "require",
        "law",
        "successful",
        "explanation",
        "see",
        "entry",
        "scientific",
        "explanation",
        "turning",
        "criticism",
        "interventionist",
        "model",
        "also",
        "criticism",
        "interventionist",
        "account",
        "causation",
        "several",
        "particularly",
        "delicate",
        "question",
        "mean",
        "intervention",
        "possible",
        "addressed",
        "resolved",
        "causation",
        "manipulability",
        "entry",
        "another",
        "criticism",
        "addressed",
        "entry",
        "concern",
        "truth",
        "maker",
        "ground",
        "interventionist",
        "counterfactuals",
        "figure",
        "causal",
        "explanation",
        "many",
        "philosopher",
        "hold",
        "necessary",
        "provide",
        "metaphysical",
        "account",
        "kind",
        "variety",
        "different",
        "proposal",
        "perhaps",
        "interventionist",
        "counterfactuals",
        "causal",
        "claim",
        "generally",
        "made",
        "true",
        "power",
        "disposition",
        "perhaps",
        "instead",
        "counterfactuals",
        "grounded",
        "law",
        "nature",
        "latter",
        "understood",
        "term",
        "metaphysical",
        "framework",
        "best",
        "system",
        "analysis",
        "part",
        "interventionists",
        "declined",
        "provide",
        "truth",
        "condition",
        "sort",
        "struck",
        "metaphysically",
        "minded",
        "philosopher",
        "serious",
        "omission",
        "one",
        "response",
        "certainly",
        "make",
        "sense",
        "ask",
        "deeper",
        "explanation",
        "various",
        "interventionist",
        "counterfactuals",
        "hold",
        "explanation",
        "needed",
        "ordinary",
        "scientific",
        "explanation",
        "term",
        "deeper",
        "theory",
        "rather",
        "kind",
        "distinctively",
        "metaphysical",
        "explanation",
        "woodward",
        "b",
        "example",
        "one",
        "might",
        "explain",
        "interventionist",
        "counterfactual",
        "drop",
        "bottle",
        "fall",
        "ground",
        "true",
        "appealing",
        "newtonian",
        "gravitational",
        "theory",
        "grounding",
        "way",
        "also",
        "task",
        "providing",
        "semantics",
        "interventionist",
        "counterfactuals",
        "variety",
        "proposal",
        "see",
        "eg",
        "briggs",
        "take",
        "form",
        "providing",
        "metaphysical",
        "grounding",
        "response",
        "raise",
        "question",
        "whether",
        "addition",
        "ordinary",
        "scientific",
        "explanation",
        "metaphysical",
        "explanation",
        "counterfactuals",
        "law",
        "task",
        "philosophy",
        "provide",
        "large",
        "topic",
        "beyond",
        "scope",
        "entry",
        "yet",
        "another",
        "criticism",
        "pressed",
        "franklinhall",
        "weslake",
        "wcondition",
        "implies",
        "explanation",
        "lowest",
        "level",
        "detail",
        "always",
        "superior",
        "explanation",
        "employing",
        "upperlevel",
        "variable",
        "argument",
        "lowerlevel",
        "explanation",
        "always",
        "answer",
        "wquestions",
        "upperlevel",
        "explanation",
        "see",
        "woodward",
        "discussion"
    ]
}