{
    "main_text": "Inconsistent Motion\n6. Inconsistent Motion\n\n\nMany of the above themes come together in Graham Priest’s\ninconsistent account of motion in In Contradiction (1987). Priest\nsets up the opposing consistent account of change as what he calls\nthe cinematic view of change. This is the view that an object in\nmotion does no more than simply occupy different points of space at\ndifferent times, like a succession of stills in a film only\ncontinuously connected. He attributes the view to Russell and\nHume. It is an extrinsic view of change, in the sense that change is\nseen as a matter of a relation to states at nearby instants of time.\nThe best-worked-out version of this view is the usual mathematical\ndescription of change of position by a suitable function of time; and\nthen motion as velocity, that is rate of change of position, is given\nby the first derivative, which is a relation to nearby intervals.\n\n\nPriest wishes instead to have an intrinsic account of change, in which\nit is a matter of the features of the object solely at the instant\nwhether it is changing at the instant. He offers three arguments\nagainst the extrinsic account. First there is the\n“abutment” argument (p. 203). Taking the usual view of\ntime as a continuously distributed collection of point-instants, in\nany change there must be an interval throughout which \\(p\\) holds\nabutting an interval throughout which \\(\\neg p\\) holds. It makes\nno difference whether there is a last instant for \\(p\\) and no\nfirst instant for \\(\\neg p\\), or no last instant for \\(p\\)\nand a first instant for \\(\\neg p\\); either way there is no room\nfor a time at which the system is changing. For example, if we said\nthat the change was at the boundary point, then there would be nothing\nabout that point to distinguish it from the situation where there was\nno change at all because the abutting intervals had the same\nproposition holding throughout each. Hence says Priest there is no\nchange at all in the cinematic view: for change there would have to be\na time when change was occurring, and that is absent in this case.\n\n\nPriest’s second argument (p. 217) appeals to causation. It is at least\nimaginable that the universe is “Laplacean,” by which he\nmeans that the state at any time is determined by the states at prior\ntimes. But if change is cinematic, then there is no sense to saying\nthat the instantaneous state of the world at the prior time determines\nits state at subsequent times: for example, not even velocity is\ndetermined by the intrinsic instantaneous state of a body. Now a\nLaplacean universe is possible, but the cinematic view makes Laplacean\nchange a priori false. Hence Priest concludes by rejecting\nthe Laplacean view. \n\n\nPriest’s third argument (p. 218) is his version of Zeno’s arrow\nargument mentioned earlier. In the cinematic view of change, there is\nnothing about the arrow at any instant to contribute to its motion:\nit is indistinguishable from an arrow at rest. But then there is\nnothing to constitute its motion: an infinite number of zero motions\ndoes not add up to anything but zero motion. In response to the reply\nthat according to measure theory a (nondenumerably) infinite number\nof points of measure zero can have a non-zero measure, Priest argues\nthat this is just mathematics: “…it does not ease the\ndiscomfort … when one tries to understand how the arrow actually\nachieves its motion. At any point in its motion it advances not at\nall. Yet in some apparently magical way, in a collection of these it\nadvances. Now a sum of nothings, even infinitely many nothings, is\nnothing. So how does it do it?” (pp. 218–9)\n\n\nSetting aside questions about the strength of these arguments for the\npresent, how then are we to give an acceptable intrinsic account of\nmotion? According to Priest, the only acceptable answer is Hegel’s:\nthat motion is inconsistent. Support comes from Leibniz’ Continuity\nCondition (LCC). This is essentially the thesis, suitably qualified,\nthat whatever holds up to a limit, holds at the limit. Priest’s\nargument for the LCC appeals to causality. He describes change\nviolating the LCC as “capricious” (p. 210). Humeans might\nbe able to accept it, but for them there are no connections, nothing\nto constitute past states’ determination of future states. He also\nargues if the LCC fails, change would occur, but “at no\ntime” (p. 210): for a proposition switching values\ndiscontinuously at a boundary there would be no instant identifiable\nby its intrinsic properties alone as the one at which the change\noccurred.\n\n\nPriest’s qualification to the LCC is that it applies only to atomic\nsentences and their negations: otherwise we would have to admit the\ncase where a disjunction \\(p \\vee q\\) held right up to a limit in virtue\nof \\(p\\) holding at the rational points and \\(q\\) holding at\nthe irrational points: this would be capricious behaviour in which we\ncan make no sense of the past determining the future. We would also\nadmit problems if we allowed the LCC to apply to tense operators:\nFuture-\\(p\\) can obviously hold up to a limit without holding at\nthe limit.\n\n\nBut now we observe that the LCC so qualified implies that continuous\nchange is contradictory. For consider any particle with equation of\nmotion \\(x = f(t)\\). Then at \\(t = a\\) its position \\(x =\nf(a)\\). However if it is in motion then in the neighbourhood we have\n\\(\\neg(x = f(a))\\), so by the LCC at the limit also \\(\\neg(x =\nf(a))\\), along with of course \\(x = f(a)\\) as well. Priest amplifies\nthis account by proposing that no moving body can be consistently\nlocalised. Rather, in moving at time \\(t\\) it inconsistently occupies\na small finite (Planck length) lozenge of space, which is made up of\nthe positions it takes in the corresponding lozenge of time\nsurrounding \\(t\\). This gives a natural intrinsic account of\nmotionlessness at \\(t\\), namely that there is no contradiction in its\nposition at \\(t\\). One can propose an account of velocity, as varying\nwith the length of the lozenge or spread of position in the direction\nof motion. There are applications in Quantum Theory, too. The\nHeisenberg uncertainty of position may simply be the size of the\nspread or smeared position. Moreover, there is a possibility for\nbackward causation implicit in the advanced wave front of\ninconsistency affecting earlier states in the inconsistently\nidentified smear of spatial positions; and backward causation may be\nthe way to go with quantum nonlocality, as Huw Price (1996) has\nargued.\n\n\nOne quick objection does not succeed. One might argue that since\nmotion and rest are not relativistically invariant, neither could the\ncontradictoriness in motion be part of the absolute character of\nreality. This may be so, but it does not prevent the concept being of\nuse in the analysis of phenomena by means of frames: frame-relative\ninconsistencies would still be a (relational) part of the world. More\nimportantly, the concept may find its natural home in QM rather than\nGR. It is well-known that there are deep incompatibilities between\nthem as they now stand, but the jury is still out on how to resolve\nthem, and it may well be that absolute motion is a part of the\nsolution.\n\n\nIn asking how strong are the arguments in favour of this well-crafted\nposition, we return to Priest’s three arguments against the rival,\nconsistent, extrinsic, cinematic view. We recall the first argument\nwas the “abutment” argument: consistent change cannot allow\nthat there is a (single) time at which the change takes place. This\nwill not sway the opposition, who will reply that it is the nature of\nchange, even change at a point, that it is relational in that it\nrequires comparison with nearby points; hence the demand for an\nintrinsic conception of change is a mistake.\n\n\nThe second argument was that the cinematic view is incompatible with\nthe Laplacean view that the past determines the present. The way\nPriest puts it is not so plausible: he says that Laplaceanism is\npossible, whereas the cinematic view rules it out “a\npriori” (p. 217). But this is a modal fallacy: the\ncinematic view is only ruled out when one adopts the Laplacean view,\nand so that is only relatively apriori.\n\n\nThe third argument, Zeno’s arrow, has greater force though. How can\nany number, even an infinite number, of zeros add up to a nonzero?\nThe mathematics of measure theory may say that intervals have a\nnon-zero measure whereas individual points are zero, but so what?\nWhat is needed is a story which makes its application intelligible\nand non-arbitrary. If this is not forthcoming, there is the strong\ncounter-intuition that zero marks the absence of existence; and no\nnumber of absent or non-existent things or quantities makes a\npresent, existent thing or quantity.\n\n\nSo Zeno’s argument after all seems to be the most resilient. But the\nLaplacean universe also has appeal. Many philosophers have felt\nuneasy about Hume’s views on causation: if the past does not\ndetermine the future then the universe is indeed capricious. \n\n\nNow one might endeavour to support Russell’s contrary view by arguing\nthat non-zero speed is both necessary and sufficient for motion. But\nboth sides of this equivalence might be disputed. On the necessity of\nnon-zero speed for motion, a challenge might be mounted that zero\nspeed but non-zero acceleration is motion. On the question of the\nsufficiency of non-zero speed for motion, Priest in the second edition\nof In Contradiction (2006) says that he does not deny this. But this\nopens him up a possible objection, namely that if non-zero (speed or\nacceleration) is necessary and sufficient for motion, then the extra\nelement of inconsistency would seem to be explanatorily otiose, since\nthere is no need to add the extra element of inconsistency in order to\nconstitute motion. Such an objection does not refute his view, but it\nwould seem to make it unsimple. Moreover, one might still adopt an\ninconsistent view coupled with the denial of sufficiency, which avoids\nthis objection.\n\n\nIn (2006), Priest extends his account to time itself. Hitherto,\nquantities other than times were regarded as changing to the extent\nthat they were inconsistently smeared out in a small lozenge or spread\nof time. In 2006, even the identity conditions for times are smeared\nout: if \\(t_1\\) and \\(t_2\\) are in the same spread then both \\(t_1 =\nt_2\\) and not-\\((t_1 = t_2)\\) hold, and in particular not-\\((t=t)\\)\nholds for each \\(t\\). Priest proposes that this gives explanations of\nseveral perennially puzzling features of time, specifically its flow,\nhow it differs from space, and its direction. Focussing just on flow,\nit is the fact that not-\\((t=t)\\) is constant for all t which supplies\nthe intrinsic feature of time necessary in Hegelian terms for its\nchangingness or flow. The view faces some interesting objections, one\nof which is a sorites-like problem that if times in the same spread\nare (inconsistently) identical with each other, then since any time\nwill be identical with others in the same spread, and those others\nidentical with further times in other spreads, identity will be spread\neverywhere.  Of course, many replies have been made to the sorites,\nbut one might also observe that none are particularly appealing. At\nleast, the arguments need to be worked through for the particular\ncase. \n",
    "section_title": "6. Inconsistent Motion",
    "entry_title": "Change and Inconsistency",
    "hierarchy_title": "Change and Inconsistency || Inconsistent Motion",
    "tokenized_text": [
        "inconsistent",
        "motion",
        "inconsistent",
        "motion",
        "many",
        "theme",
        "come",
        "together",
        "graham",
        "priest",
        "inconsistent",
        "account",
        "motion",
        "contradiction",
        "priest",
        "set",
        "opposing",
        "consistent",
        "account",
        "change",
        "call",
        "cinematic",
        "view",
        "change",
        "view",
        "object",
        "motion",
        "simply",
        "occupy",
        "different",
        "point",
        "space",
        "different",
        "time",
        "like",
        "succession",
        "still",
        "film",
        "continuously",
        "connected",
        "attribute",
        "view",
        "russell",
        "hume",
        "extrinsic",
        "view",
        "change",
        "sense",
        "change",
        "seen",
        "matter",
        "relation",
        "state",
        "nearby",
        "instant",
        "time",
        "bestworkedout",
        "version",
        "view",
        "usual",
        "mathematical",
        "description",
        "change",
        "position",
        "suitable",
        "function",
        "time",
        "motion",
        "velocity",
        "rate",
        "change",
        "position",
        "given",
        "first",
        "derivative",
        "relation",
        "nearby",
        "interval",
        "priest",
        "wish",
        "instead",
        "intrinsic",
        "account",
        "change",
        "matter",
        "feature",
        "object",
        "solely",
        "instant",
        "whether",
        "changing",
        "instant",
        "offer",
        "three",
        "argument",
        "extrinsic",
        "account",
        "first",
        "abutment",
        "argument",
        "p",
        "taking",
        "usual",
        "view",
        "time",
        "continuously",
        "distributed",
        "collection",
        "pointinstants",
        "change",
        "must",
        "interval",
        "throughout",
        "p",
        "hold",
        "abutting",
        "interval",
        "throughout",
        "neg",
        "p",
        "hold",
        "make",
        "difference",
        "whether",
        "last",
        "instant",
        "p",
        "first",
        "instant",
        "neg",
        "p",
        "last",
        "instant",
        "p",
        "first",
        "instant",
        "neg",
        "p",
        "either",
        "way",
        "room",
        "time",
        "system",
        "changing",
        "example",
        "said",
        "change",
        "boundary",
        "point",
        "would",
        "nothing",
        "point",
        "distinguish",
        "situation",
        "change",
        "abutting",
        "interval",
        "proposition",
        "holding",
        "throughout",
        "hence",
        "say",
        "priest",
        "change",
        "cinematic",
        "view",
        "change",
        "would",
        "time",
        "change",
        "occurring",
        "absent",
        "case",
        "priest",
        "second",
        "argument",
        "p",
        "appeal",
        "causation",
        "least",
        "imaginable",
        "universe",
        "laplacean",
        "mean",
        "state",
        "time",
        "determined",
        "state",
        "prior",
        "time",
        "change",
        "cinematic",
        "sense",
        "saying",
        "instantaneous",
        "state",
        "world",
        "prior",
        "time",
        "determines",
        "state",
        "subsequent",
        "time",
        "example",
        "even",
        "velocity",
        "determined",
        "intrinsic",
        "instantaneous",
        "state",
        "body",
        "laplacean",
        "universe",
        "possible",
        "cinematic",
        "view",
        "make",
        "laplacean",
        "change",
        "priori",
        "false",
        "hence",
        "priest",
        "concludes",
        "rejecting",
        "laplacean",
        "view",
        "priest",
        "third",
        "argument",
        "p",
        "version",
        "zeno",
        "arrow",
        "argument",
        "mentioned",
        "earlier",
        "cinematic",
        "view",
        "change",
        "nothing",
        "arrow",
        "instant",
        "contribute",
        "motion",
        "indistinguishable",
        "arrow",
        "rest",
        "nothing",
        "constitute",
        "motion",
        "infinite",
        "number",
        "zero",
        "motion",
        "add",
        "anything",
        "zero",
        "motion",
        "response",
        "reply",
        "according",
        "measure",
        "theory",
        "nondenumerably",
        "infinite",
        "number",
        "point",
        "measure",
        "zero",
        "nonzero",
        "measure",
        "priest",
        "argues",
        "mathematics",
        "it",
        "ease",
        "discomfort",
        "one",
        "try",
        "understand",
        "arrow",
        "actually",
        "achieves",
        "motion",
        "point",
        "motion",
        "advance",
        "yet",
        "apparently",
        "magical",
        "way",
        "collection",
        "advance",
        "sum",
        "nothing",
        "even",
        "infinitely",
        "many",
        "nothing",
        "nothing",
        "pp",
        "setting",
        "aside",
        "question",
        "strength",
        "argument",
        "present",
        "give",
        "acceptable",
        "intrinsic",
        "account",
        "motion",
        "according",
        "priest",
        "acceptable",
        "answer",
        "hegel",
        "motion",
        "inconsistent",
        "support",
        "come",
        "leibniz",
        "continuity",
        "condition",
        "lcc",
        "essentially",
        "thesis",
        "suitably",
        "qualified",
        "whatever",
        "hold",
        "limit",
        "hold",
        "limit",
        "priest",
        "argument",
        "lcc",
        "appeal",
        "causality",
        "describes",
        "change",
        "violating",
        "lcc",
        "capricious",
        "p",
        "humeans",
        "might",
        "able",
        "accept",
        "connection",
        "nothing",
        "constitute",
        "past",
        "state",
        "determination",
        "future",
        "state",
        "also",
        "argues",
        "lcc",
        "fails",
        "change",
        "would",
        "occur",
        "time",
        "p",
        "proposition",
        "switching",
        "value",
        "discontinuously",
        "boundary",
        "would",
        "instant",
        "identifiable",
        "intrinsic",
        "property",
        "alone",
        "one",
        "change",
        "occurred",
        "priest",
        "qualification",
        "lcc",
        "applies",
        "atomic",
        "sentence",
        "negation",
        "otherwise",
        "would",
        "admit",
        "case",
        "disjunction",
        "p",
        "vee",
        "q",
        "held",
        "right",
        "limit",
        "virtue",
        "p",
        "holding",
        "rational",
        "point",
        "q",
        "holding",
        "irrational",
        "point",
        "would",
        "capricious",
        "behaviour",
        "make",
        "sense",
        "past",
        "determining",
        "future",
        "would",
        "also",
        "admit",
        "problem",
        "allowed",
        "lcc",
        "apply",
        "tense",
        "operator",
        "future",
        "p",
        "obviously",
        "hold",
        "limit",
        "without",
        "holding",
        "limit",
        "observe",
        "lcc",
        "qualified",
        "implies",
        "continuous",
        "change",
        "contradictory",
        "consider",
        "particle",
        "equation",
        "motion",
        "x",
        "f",
        "a",
        "position",
        "x",
        "f",
        "however",
        "motion",
        "neighbourhood",
        "neg",
        "x",
        "f",
        "lcc",
        "limit",
        "also",
        "neg",
        "x",
        "f",
        "along",
        "course",
        "x",
        "f",
        "well",
        "priest",
        "amplifies",
        "account",
        "proposing",
        "moving",
        "body",
        "consistently",
        "localised",
        "rather",
        "moving",
        "time",
        "t",
        "inconsistently",
        "occupies",
        "small",
        "finite",
        "planck",
        "length",
        "lozenge",
        "space",
        "made",
        "position",
        "take",
        "corresponding",
        "lozenge",
        "time",
        "surrounding",
        "t",
        "give",
        "natural",
        "intrinsic",
        "account",
        "motionlessness",
        "t",
        "namely",
        "contradiction",
        "position",
        "t",
        "one",
        "propose",
        "account",
        "velocity",
        "varying",
        "length",
        "lozenge",
        "spread",
        "position",
        "direction",
        "motion",
        "application",
        "quantum",
        "theory",
        "heisenberg",
        "uncertainty",
        "position",
        "may",
        "simply",
        "size",
        "spread",
        "smeared",
        "position",
        "moreover",
        "possibility",
        "backward",
        "causation",
        "implicit",
        "advanced",
        "wave",
        "front",
        "inconsistency",
        "affecting",
        "earlier",
        "state",
        "inconsistently",
        "identified",
        "smear",
        "spatial",
        "position",
        "backward",
        "causation",
        "may",
        "way",
        "go",
        "quantum",
        "nonlocality",
        "huw",
        "price",
        "argued",
        "one",
        "quick",
        "objection",
        "succeed",
        "one",
        "might",
        "argue",
        "since",
        "motion",
        "rest",
        "relativistically",
        "invariant",
        "neither",
        "could",
        "contradictoriness",
        "motion",
        "part",
        "absolute",
        "character",
        "reality",
        "may",
        "prevent",
        "concept",
        "use",
        "analysis",
        "phenomenon",
        "mean",
        "frame",
        "framerelative",
        "inconsistency",
        "would",
        "still",
        "relational",
        "part",
        "world",
        "importantly",
        "concept",
        "may",
        "find",
        "natural",
        "home",
        "qm",
        "rather",
        "gr",
        "wellknown",
        "deep",
        "incompatibility",
        "stand",
        "jury",
        "still",
        "resolve",
        "may",
        "well",
        "absolute",
        "motion",
        "part",
        "solution",
        "asking",
        "strong",
        "argument",
        "favour",
        "wellcrafted",
        "position",
        "return",
        "priest",
        "three",
        "argument",
        "rival",
        "consistent",
        "extrinsic",
        "cinematic",
        "view",
        "recall",
        "first",
        "argument",
        "abutment",
        "argument",
        "consistent",
        "change",
        "allow",
        "single",
        "time",
        "change",
        "take",
        "place",
        "sway",
        "opposition",
        "reply",
        "nature",
        "change",
        "even",
        "change",
        "point",
        "relational",
        "requires",
        "comparison",
        "nearby",
        "point",
        "hence",
        "demand",
        "intrinsic",
        "conception",
        "change",
        "mistake",
        "second",
        "argument",
        "cinematic",
        "view",
        "incompatible",
        "laplacean",
        "view",
        "past",
        "determines",
        "present",
        "way",
        "priest",
        "put",
        "plausible",
        "say",
        "laplaceanism",
        "possible",
        "whereas",
        "cinematic",
        "view",
        "rule",
        "priori",
        "p",
        "modal",
        "fallacy",
        "cinematic",
        "view",
        "ruled",
        "one",
        "adopts",
        "laplacean",
        "view",
        "relatively",
        "apriori",
        "third",
        "argument",
        "zeno",
        "arrow",
        "greater",
        "force",
        "though",
        "number",
        "even",
        "infinite",
        "number",
        "zero",
        "add",
        "nonzero",
        "mathematics",
        "measure",
        "theory",
        "may",
        "say",
        "interval",
        "nonzero",
        "measure",
        "whereas",
        "individual",
        "point",
        "zero",
        "needed",
        "story",
        "make",
        "application",
        "intelligible",
        "nonarbitrary",
        "forthcoming",
        "strong",
        "counterintuition",
        "zero",
        "mark",
        "absence",
        "existence",
        "number",
        "absent",
        "nonexistent",
        "thing",
        "quantity",
        "make",
        "present",
        "existent",
        "thing",
        "quantity",
        "zeno",
        "argument",
        "seems",
        "resilient",
        "laplacean",
        "universe",
        "also",
        "appeal",
        "many",
        "philosopher",
        "felt",
        "uneasy",
        "hume",
        "view",
        "causation",
        "past",
        "determine",
        "future",
        "universe",
        "indeed",
        "capricious",
        "one",
        "might",
        "endeavour",
        "support",
        "russell",
        "contrary",
        "view",
        "arguing",
        "nonzero",
        "speed",
        "necessary",
        "sufficient",
        "motion",
        "side",
        "equivalence",
        "might",
        "disputed",
        "necessity",
        "nonzero",
        "speed",
        "motion",
        "challenge",
        "might",
        "mounted",
        "zero",
        "speed",
        "nonzero",
        "acceleration",
        "motion",
        "question",
        "sufficiency",
        "nonzero",
        "speed",
        "motion",
        "priest",
        "second",
        "edition",
        "contradiction",
        "say",
        "deny",
        "open",
        "possible",
        "objection",
        "namely",
        "nonzero",
        "speed",
        "acceleration",
        "necessary",
        "sufficient",
        "motion",
        "extra",
        "element",
        "inconsistency",
        "would",
        "seem",
        "explanatorily",
        "otiose",
        "since",
        "need",
        "add",
        "extra",
        "element",
        "inconsistency",
        "order",
        "constitute",
        "motion",
        "objection",
        "refute",
        "view",
        "would",
        "seem",
        "make",
        "unsimple",
        "moreover",
        "one",
        "might",
        "still",
        "adopt",
        "inconsistent",
        "view",
        "coupled",
        "denial",
        "sufficiency",
        "avoids",
        "objection",
        "priest",
        "extends",
        "account",
        "time",
        "hitherto",
        "quantity",
        "time",
        "regarded",
        "changing",
        "extent",
        "inconsistently",
        "smeared",
        "small",
        "lozenge",
        "spread",
        "time",
        "even",
        "identity",
        "condition",
        "time",
        "smeared",
        "t_",
        "t_",
        "spread",
        "t_",
        "t_",
        "not",
        "t_",
        "t_",
        "hold",
        "particular",
        "not",
        "tt",
        "hold",
        "t",
        "priest",
        "proposes",
        "give",
        "explanation",
        "several",
        "perennially",
        "puzzling",
        "feature",
        "time",
        "specifically",
        "flow",
        "differs",
        "space",
        "direction",
        "focussing",
        "flow",
        "fact",
        "not",
        "tt",
        "constant",
        "supply",
        "intrinsic",
        "feature",
        "time",
        "necessary",
        "hegelian",
        "term",
        "changingness",
        "flow",
        "view",
        "face",
        "interesting",
        "objection",
        "one",
        "soriteslike",
        "problem",
        "time",
        "spread",
        "inconsistently",
        "identical",
        "since",
        "time",
        "identical",
        "others",
        "spread",
        "others",
        "identical",
        "time",
        "spread",
        "identity",
        "spread",
        "everywhere",
        "course",
        "many",
        "reply",
        "made",
        "sorites",
        "one",
        "might",
        "also",
        "observe",
        "none",
        "particularly",
        "appealing",
        "least",
        "argument",
        "need",
        "worked",
        "particular",
        "case"
    ]
}