{
    "main_text": "Cognition of Motion\n8. Cognition of Motion\n\nAs we saw earlier, the basic case for the inconsistency of change\nturns on the following premisses: (i) \\(Fa\\), (ii) \\(Gb\\),\n(iii) \\(Fx \\rightarrow {\\sim}Gx\\), (iv)\n\\(a=b\\). Up to the last premiss all is consistent, but the\nidentification of the entities a and b from different times gives one\nand the same thing incompatible properties. It was suggested in\nSection 5, taking a lead from Hegel, that even if we say that change\nis a consistent process, the perception of change might well\ninvolve inconsistent representations. It is time to take a closer look\nat what cognitive science can tell us about this. It turns out that\nthe argument is inconclusive, but suggestive. It is useful to\nconcentrate on the example of the perception of motion. A thorough\nsurvey can be found in Palmer (1999), Chapter 10.\n\nA basic mechanism for perceived motion is the Reichardt detector. It\nseems not to be entirely settled whether there are such mechanisms in\nthe CNS. On the other hand, as we see, it is so simple that it is hard\nto imagine that we don’t have Reichardt detectors in our brains. \n\nThe original Reichardt detector involved two spatially-separated\nretinal transducers responding to intensities \\(I_{1}\\), \\(I_{2}\\) of\nincident light respectively at times \\(t_{1}\\),\n\\(t_{2}\\). Essentially, I measures the number of incident photons on a\nsingle retinal cell at a time. (For convenience we can regard the\ninput into a given retinal cell as the same as its output, though the\noutput is electrochemical, as befits a transducer.) One of the two\ninputs, say \\(I_{1}\\), undergoes a delay, and so is compared at a\nlater time \\(t_{2}\\) with the other input \\(I_{2}\\) undelayed. There\nare different ways to make the comparison: Reichardt suggested both\naddition and multiplication, but it is more reasonable to consider\nsubtraction of one from the other (a fixed operation for a given\nReichardt detector). The difference between \\(I_{1}\\) and \\(I_{2}\\) is\nthen propagated further into the CNS. Thus we have a change\ndetector, there is no change in intensity from \\(I_{1}\\) at\n\\(t_{1}\\) to \\(I_{2}\\) at \\(t_{2}\\) iff \\(I_{2} - I_{1}=0\\).\n To see better what this means, we notice that the above detector\ncan be pulled apart into two even simpler mechanisms.\n\nThe first of these is a spatial change or spatial\ndifference detector. This consists of two transducers whose\noutputs without a delay are compared by subtraction. If the two\ninput cells have positions \\(x_{1}\\), \\(x_{2}\\), then\nthe quotient \\((I_{2} - I_{1}) / (x_{2} - x_{1})\\) measures the\ndifference in simultaneous values of I over the spatial\ndistance \\(x_{2}-x_{1}\\). This can be written as the derivative \\(dI /\ndx\\). It, and its numerator, are zero iff there is no difference in\n\\(I\\) measured by the two input cells at the same time. The temporal\nvariable \\(t\\) is fixed here. In passing, we can also see a mechanism\nhere for the perception of spatial relations as emphasised\nby Gestalt psychologists.\n\nThe second of these simpler mechanisms is a  temporal change\ndetector. It consists of a single input cell, whose output \\(I_{1}\\)\nat \\(t_{1}\\) is split into two, one of which passes through a delay,\nthen compared with the undelayed signal \\(I_{2}\\) from the next moment\n\\(t_{2}\\). The quotient \\((I_{2}-I_{1}) / (t_{2}-t_{1})\\) measures\nchange in I at a single input over the time period. This can be\nwritten \\(dI / dt\\). This, and its numerator, are zero iff there is no\nchange in the intensities presented to the same cell at different\ntimes. The spatial variable \\(x\\) is fixed here.\n\nThese two mechanisms give ways to register and measure spatial and\ntemporal change. Now it is clear that these two mechanisms, when\ncoupled together, are exactly the original Reichardt detector. But now\nwe can see exactly what that measures. Calculus allows us to write\n\\(dx/dt =(dI/dt)/(dI/dx)\\). But \\(dx/dt\\) is the rate change of\nposition over time, which is speed. Importantly, it is the\nintensity variable \\(I\\) which is fixed here. Thus what this measures\nis how a single intensity, such as that of a moving dot, an\nedge, or a shadow, is varying its spatial position over time. This\nis motion. For a given pair of input cells, the direction of\nthe motion is fixed (different detectors for different directions), so\nwe have a register for velocity.\n\nIn passing, acceleration detection is also straightforward to explain:\nsplit the output from a motion-detector, delay one signal, and\ncompare.\n\nWe can see that the sense in which information about different times\nis compared, is by delaying information from one time. A delay is a\nkind of buffer. Then the information is “superimposed” on the\ninformation from the next time, by presenting the two informations\ntogether at the one comparator. A “composite picture” is obtained by\nsubtracting one from the other. This is conjunction of sorts, since it\nputs two pieces of information together. But it does not obviously\nmake for a state with contradictory content. Indeed, it does not make\nfor a picture of a thing enduring over time, since the same intensity\n\\(I\\) at different place-times might be due to quite unrelated events. But\nthere is more to be said about perceived motion\n\nWe can learn more by considering a family of phenomena known\ncollectively as phi, which is in turn more generally classified\nunder the heading of apparent motion. The simplest example is\nof two intermittently illuminated lights, flashing back-and-forth. We\nnaturally represent it as a single, moving light. This is not\nmere sameness of intensity, but representation as an enduring\nthing. Moreover, it is not surprising that we should evolve to have\nthis response, if we are to successfully track game, or danger,\nthrough intermittent presentations. Or think of a row of lights, as in\na neon sign, with either a single bulb illuminated but its position\nvarying, or a single bulb unilluminated, again with systematically\nvarying position. Or think of a clock dial, with one bulb out, moving\naround the circle. The content of our experience is as an enduring\nsingle thing, having different positions at different times. This is\nthe phi phenomenon. Speed things up (sometimes\ncalled magni-phi), and it ceases to look discrete, instead\npresenting as a continuously moving thing, which enhances the\neffect.\n\nThink of the example of a black dot moving across our visual\nfield. Recalling our general rubric for change at the beginning of\nthis section, we can affirm the first three premisses as statements\nabout the content of our experience: (i) \\(a\\) is at \\(x_{1}\\) at\n\\(t_{1}\\), (ii) \\(b\\) is at \\(x_{2}\\) at \\(t_{2}\\), (iii) if anything\nis at place \\(x_{1}\\) at a time \\(t_{1}\\), then it is not at place\n\\(x_{2}\\) at \\(t_{2}\\). Now add in the content of the phi-experience:\n(iv) \\(a=b\\), and we deduce that \\(a\\) is also not at \\(x_{1}\\) at\n\\(t_{1}\\).\n\nA consistentist about the phenomenology of motion might support (iii)\nand challenge (iv), borrowing from Dharmakirti, or from Lewis’\nperdurance/counterpart account. An alternative consistentist position\nwould be to challenge (iii) and support (iv). In favour of (iii), it\nmight be said that if the moving black dot is slowed down\nsufficiently, and particularly if its positions are discrete, or it\njumps about, then (iii) finds intuitive assent: \\(a\\) and \\(b\\) just\nare the sorts of things (events) that occupy distinct places at\ndistinct times. This may be what happens. Again, imagine perception\ncut off after \\(t_{1}\\) but before \\(t_{2}\\) (close the eyes, or\notherwise vanish the dot). Then (iii) holds, the phenomenal dot at\n\\(t_{1}\\) is a distinct existence from a dot at \\(t_{2}\\). Our\ncognitive system responds to stimuli both as events, where (iii)\nholds; and as enduring objects, where (iv) holds. If nothing moves,\nthen there is no contradiction, but when we see motion, the\nobject-recognition mechanism identifies distinct things at different\ntimes and so a contradictory content is born. That, I suspect, is the\nphenomenological content of motion.\n\n\nThis model has a number of features, which are only briefly summarised\nhere. A now box is postulated, distinguished by its distinctive\nmulti-modal inputs and outputs. Information enters the now box and is\nretained for a brief time, the “specious\npresent”. Dismissal from the now box cannot be instantaneous,\nbut takes some time to “fade” or reduce in intensity. Thus\nthe now contains new contents and fading, older contents; and a\nnatural direction of time. The delay and comparisons of Reichardt\ndetectors are enlisted in this process. The endurance or persistence\nof contents suggests an account of apparent motion, phi or beta, in\nwhich identical states close in time and space but not identical, are\ncounted as identical. The important thing for our purposes is that the\nidentity of different and changing temporal stages of a perceptual\nprocess (the perceived moving dot), gives the necessary premiss for\ninconsistency, as discussed earlier.\n\nIn passing, this model gives natural accounts of akinetopsia, and of\nthe “moving now”. Akinetopsia, that is motion blindness,\nhas a “stop-start” phenomenology where a thing is\nperceived as distant, then suddenly up close, without any awareness of\nthe in-between. This suggests that something has gone wrong with the\nfade mechanism, and the contents of the now do not fade, but persist\nfull strength for a time, crowding out new updates. Eventually it\ncollapses, and then no in-between has been registered. As for the\nmoving now, it is noted that the contents of the now change over time,\nbut it seems to the experiencer as if the now is a single thing\npersisting or enduring over time, and moving from event to\nevent. These matters are expanded on in Mortensen (2013). \n\nAn independent account of the flow of time, with striking similarities\nis to be found in Gruber, Bach and Block (2015). The flow of time has\ntwo levels of explanation, and is described as an\n“illusion” insofar as experience is in conflict with\nmeasurement (compare Muller-Lyer). It would appear that the levels,\nupper and lower, correspond to \\(A\\) and \\(B\\) concepts respectively,\nso that the upper level, the passage of time, is an illusion. The\nauthors postulate two mechanisms, perceptual completion and object\npersistence, to account for the flow of time. Perceptual completion\ninvolves adding to an experience to complete it some way, for example\napparent motion, that is phi or beta. Object persistence requires that\nan object be perceived as the same (thing) now as it was then. It is\nessentially the same mechanism that identifies an object at a time,\nwith itself at a later time. This is conceptually necessary for an\norder of past/present/future, the \\(A\\) series. This account also has\na specious present or now, which is similar to our now box.\n\nWe cannot hope to do justice to this complex paper here. However,\nfocussing on the theme of inconsistency, one question that could be\nasked is how much these mechanisms, perceptual completion and object\npersistence, are really different, as against being species of the\nsame genus. It would seem that the illusion is pervasive because of\nthe mechanism of identification of earlier/later stages. But this is\nwhat we saw was sufficient for contradiction. If these models of\nmotion perception are right, it follows that contradiction is\npervasive in our experience as the phenomenology of change, which is\nto say, everywhere.\n",
    "section_title": "8. Cognition of Motion",
    "entry_title": "Change and Inconsistency",
    "hierarchy_title": "Change and Inconsistency || Cognition of Motion",
    "tokenized_text": [
        "cognition",
        "motion",
        "cognition",
        "motion",
        "saw",
        "earlier",
        "basic",
        "case",
        "inconsistency",
        "change",
        "turn",
        "following",
        "premiss",
        "fa",
        "ii",
        "gb",
        "iii",
        "fx",
        "rightarrow",
        "sim",
        "gx",
        "iv",
        "ab",
        "last",
        "premiss",
        "consistent",
        "identification",
        "entity",
        "b",
        "different",
        "time",
        "give",
        "one",
        "thing",
        "incompatible",
        "property",
        "suggested",
        "section",
        "taking",
        "lead",
        "hegel",
        "even",
        "say",
        "change",
        "consistent",
        "process",
        "perception",
        "change",
        "might",
        "well",
        "involve",
        "inconsistent",
        "representation",
        "time",
        "take",
        "closer",
        "look",
        "cognitive",
        "science",
        "tell",
        "u",
        "turn",
        "argument",
        "inconclusive",
        "suggestive",
        "useful",
        "concentrate",
        "example",
        "perception",
        "motion",
        "thorough",
        "survey",
        "found",
        "palmer",
        "chapter",
        "basic",
        "mechanism",
        "perceived",
        "motion",
        "reichardt",
        "detector",
        "seems",
        "entirely",
        "settled",
        "whether",
        "mechanism",
        "cns",
        "hand",
        "see",
        "simple",
        "hard",
        "imagine",
        "reichardt",
        "detector",
        "brain",
        "original",
        "reichardt",
        "detector",
        "involved",
        "two",
        "spatiallyseparated",
        "retinal",
        "transducer",
        "responding",
        "intensity",
        "i_",
        "i_",
        "incident",
        "light",
        "respectively",
        "time",
        "t_",
        "t_",
        "essentially",
        "measure",
        "number",
        "incident",
        "photon",
        "single",
        "retinal",
        "cell",
        "time",
        "convenience",
        "regard",
        "input",
        "given",
        "retinal",
        "cell",
        "output",
        "though",
        "output",
        "electrochemical",
        "befits",
        "transducer",
        "one",
        "two",
        "input",
        "say",
        "i_",
        "undergoes",
        "delay",
        "compared",
        "later",
        "time",
        "t_",
        "input",
        "i_",
        "undelayed",
        "different",
        "way",
        "make",
        "comparison",
        "reichardt",
        "suggested",
        "addition",
        "multiplication",
        "reasonable",
        "consider",
        "subtraction",
        "one",
        "fixed",
        "operation",
        "given",
        "reichardt",
        "detector",
        "difference",
        "i_",
        "i_",
        "propagated",
        "cns",
        "thus",
        "change",
        "detector",
        "change",
        "intensity",
        "i_",
        "t_",
        "i_",
        "t_",
        "iff",
        "i_",
        "i_",
        "see",
        "better",
        "mean",
        "notice",
        "detector",
        "pulled",
        "apart",
        "two",
        "even",
        "simpler",
        "mechanism",
        "first",
        "spatial",
        "change",
        "spatial",
        "difference",
        "detector",
        "consists",
        "two",
        "transducer",
        "whose",
        "output",
        "without",
        "delay",
        "compared",
        "subtraction",
        "two",
        "input",
        "cell",
        "position",
        "x_",
        "x_",
        "quotient",
        "i_",
        "i_",
        "x_",
        "x_",
        "measure",
        "difference",
        "simultaneous",
        "value",
        "spatial",
        "distance",
        "x_",
        "x_",
        "written",
        "derivative",
        "di",
        "dx",
        "numerator",
        "zero",
        "iff",
        "difference",
        "i",
        "measured",
        "two",
        "input",
        "cell",
        "time",
        "temporal",
        "variable",
        "t",
        "fixed",
        "passing",
        "also",
        "see",
        "mechanism",
        "perception",
        "spatial",
        "relation",
        "emphasised",
        "gestalt",
        "psychologist",
        "second",
        "simpler",
        "mechanism",
        "temporal",
        "change",
        "detector",
        "consists",
        "single",
        "input",
        "cell",
        "whose",
        "output",
        "i_",
        "t_",
        "split",
        "two",
        "one",
        "pass",
        "delay",
        "compared",
        "undelayed",
        "signal",
        "i_",
        "next",
        "moment",
        "t_",
        "quotient",
        "i_",
        "i_",
        "t_",
        "t_",
        "measure",
        "change",
        "single",
        "input",
        "time",
        "period",
        "written",
        "di",
        "dt",
        "numerator",
        "zero",
        "iff",
        "change",
        "intensity",
        "presented",
        "cell",
        "different",
        "time",
        "spatial",
        "variable",
        "x",
        "fixed",
        "two",
        "mechanism",
        "give",
        "way",
        "register",
        "measure",
        "spatial",
        "temporal",
        "change",
        "clear",
        "two",
        "mechanism",
        "coupled",
        "together",
        "exactly",
        "original",
        "reichardt",
        "detector",
        "see",
        "exactly",
        "measure",
        "calculus",
        "allows",
        "u",
        "write",
        "dxdt",
        "didt",
        "didx",
        "dxdt",
        "rate",
        "change",
        "position",
        "time",
        "speed",
        "importantly",
        "intensity",
        "variable",
        "i",
        "fixed",
        "thus",
        "measure",
        "single",
        "intensity",
        "moving",
        "dot",
        "edge",
        "shadow",
        "varying",
        "spatial",
        "position",
        "time",
        "motion",
        "given",
        "pair",
        "input",
        "cell",
        "direction",
        "motion",
        "fixed",
        "different",
        "detector",
        "different",
        "direction",
        "register",
        "velocity",
        "passing",
        "acceleration",
        "detection",
        "also",
        "straightforward",
        "explain",
        "split",
        "output",
        "motiondetector",
        "delay",
        "one",
        "signal",
        "compare",
        "see",
        "sense",
        "information",
        "different",
        "time",
        "compared",
        "delaying",
        "information",
        "one",
        "time",
        "delay",
        "kind",
        "buffer",
        "information",
        "superimposed",
        "information",
        "next",
        "time",
        "presenting",
        "two",
        "information",
        "together",
        "one",
        "comparator",
        "composite",
        "picture",
        "obtained",
        "subtracting",
        "one",
        "conjunction",
        "sort",
        "since",
        "put",
        "two",
        "piece",
        "information",
        "together",
        "obviously",
        "make",
        "state",
        "contradictory",
        "content",
        "indeed",
        "make",
        "picture",
        "thing",
        "enduring",
        "time",
        "since",
        "intensity",
        "i",
        "different",
        "placetimes",
        "might",
        "due",
        "quite",
        "unrelated",
        "event",
        "said",
        "perceived",
        "motion",
        "learn",
        "considering",
        "family",
        "phenomenon",
        "known",
        "collectively",
        "phi",
        "turn",
        "generally",
        "classified",
        "heading",
        "apparent",
        "motion",
        "simplest",
        "example",
        "two",
        "intermittently",
        "illuminated",
        "light",
        "flashing",
        "backandforth",
        "naturally",
        "represent",
        "single",
        "moving",
        "light",
        "mere",
        "sameness",
        "intensity",
        "representation",
        "enduring",
        "thing",
        "moreover",
        "surprising",
        "evolve",
        "response",
        "successfully",
        "track",
        "game",
        "danger",
        "intermittent",
        "presentation",
        "think",
        "row",
        "light",
        "neon",
        "sign",
        "either",
        "single",
        "bulb",
        "illuminated",
        "position",
        "varying",
        "single",
        "bulb",
        "unilluminated",
        "systematically",
        "varying",
        "position",
        "think",
        "clock",
        "dial",
        "one",
        "bulb",
        "moving",
        "around",
        "circle",
        "content",
        "experience",
        "enduring",
        "single",
        "thing",
        "different",
        "position",
        "different",
        "time",
        "phi",
        "phenomenon",
        "speed",
        "thing",
        "sometimes",
        "called",
        "magniphi",
        "cease",
        "look",
        "discrete",
        "instead",
        "presenting",
        "continuously",
        "moving",
        "thing",
        "enhances",
        "effect",
        "think",
        "example",
        "black",
        "dot",
        "moving",
        "across",
        "visual",
        "field",
        "recalling",
        "general",
        "rubric",
        "change",
        "beginning",
        "section",
        "affirm",
        "first",
        "three",
        "premiss",
        "statement",
        "content",
        "experience",
        "a",
        "x_",
        "t_",
        "ii",
        "b",
        "x_",
        "t_",
        "iii",
        "anything",
        "place",
        "x_",
        "time",
        "t_",
        "place",
        "x_",
        "t_",
        "add",
        "content",
        "phiexperience",
        "iv",
        "ab",
        "deduce",
        "a",
        "also",
        "x_",
        "t_",
        "consistentist",
        "phenomenology",
        "motion",
        "might",
        "support",
        "iii",
        "challenge",
        "iv",
        "borrowing",
        "dharmakirti",
        "lewis",
        "perdurancecounterpart",
        "account",
        "alternative",
        "consistentist",
        "position",
        "would",
        "challenge",
        "iii",
        "support",
        "iv",
        "favour",
        "iii",
        "might",
        "said",
        "moving",
        "black",
        "dot",
        "slowed",
        "sufficiently",
        "particularly",
        "position",
        "discrete",
        "jump",
        "iii",
        "find",
        "intuitive",
        "assent",
        "a",
        "b",
        "sort",
        "thing",
        "event",
        "occupy",
        "distinct",
        "place",
        "distinct",
        "time",
        "may",
        "happens",
        "imagine",
        "perception",
        "cut",
        "t_",
        "t_",
        "close",
        "eye",
        "otherwise",
        "vanish",
        "dot",
        "iii",
        "hold",
        "phenomenal",
        "dot",
        "t_",
        "distinct",
        "existence",
        "dot",
        "t_",
        "cognitive",
        "system",
        "responds",
        "stimulus",
        "event",
        "iii",
        "hold",
        "enduring",
        "object",
        "iv",
        "hold",
        "nothing",
        "move",
        "contradiction",
        "see",
        "motion",
        "objectrecognition",
        "mechanism",
        "identifies",
        "distinct",
        "thing",
        "different",
        "time",
        "contradictory",
        "content",
        "born",
        "suspect",
        "phenomenological",
        "content",
        "motion",
        "model",
        "number",
        "feature",
        "briefly",
        "summarised",
        "box",
        "postulated",
        "distinguished",
        "distinctive",
        "multimodal",
        "input",
        "output",
        "information",
        "enters",
        "box",
        "retained",
        "brief",
        "time",
        "specious",
        "present",
        "dismissal",
        "box",
        "instantaneous",
        "take",
        "time",
        "fade",
        "reduce",
        "intensity",
        "thus",
        "contains",
        "new",
        "content",
        "fading",
        "older",
        "content",
        "natural",
        "direction",
        "time",
        "delay",
        "comparison",
        "reichardt",
        "detector",
        "enlisted",
        "process",
        "endurance",
        "persistence",
        "content",
        "suggests",
        "account",
        "apparent",
        "motion",
        "phi",
        "beta",
        "identical",
        "state",
        "close",
        "time",
        "space",
        "identical",
        "counted",
        "identical",
        "important",
        "thing",
        "purpose",
        "identity",
        "different",
        "changing",
        "temporal",
        "stage",
        "perceptual",
        "process",
        "perceived",
        "moving",
        "dot",
        "give",
        "necessary",
        "premiss",
        "inconsistency",
        "discussed",
        "earlier",
        "passing",
        "model",
        "give",
        "natural",
        "account",
        "akinetopsia",
        "moving",
        "akinetopsia",
        "motion",
        "blindness",
        "stopstart",
        "phenomenology",
        "thing",
        "perceived",
        "distant",
        "suddenly",
        "close",
        "without",
        "awareness",
        "inbetween",
        "suggests",
        "something",
        "gone",
        "wrong",
        "fade",
        "mechanism",
        "content",
        "fade",
        "persist",
        "full",
        "strength",
        "time",
        "crowding",
        "new",
        "update",
        "eventually",
        "collapse",
        "inbetween",
        "registered",
        "moving",
        "noted",
        "content",
        "change",
        "time",
        "seems",
        "experiencer",
        "single",
        "thing",
        "persisting",
        "enduring",
        "time",
        "moving",
        "event",
        "event",
        "matter",
        "expanded",
        "mortensen",
        "independent",
        "account",
        "flow",
        "time",
        "striking",
        "similarity",
        "found",
        "gruber",
        "bach",
        "block",
        "flow",
        "time",
        "two",
        "level",
        "explanation",
        "described",
        "illusion",
        "insofar",
        "experience",
        "conflict",
        "measurement",
        "compare",
        "mullerlyer",
        "would",
        "appear",
        "level",
        "upper",
        "lower",
        "correspond",
        "a",
        "b",
        "concept",
        "respectively",
        "upper",
        "level",
        "passage",
        "time",
        "illusion",
        "author",
        "postulate",
        "two",
        "mechanism",
        "perceptual",
        "completion",
        "object",
        "persistence",
        "account",
        "flow",
        "time",
        "perceptual",
        "completion",
        "involves",
        "adding",
        "experience",
        "complete",
        "way",
        "example",
        "apparent",
        "motion",
        "phi",
        "beta",
        "object",
        "persistence",
        "requires",
        "object",
        "perceived",
        "thing",
        "essentially",
        "mechanism",
        "identifies",
        "object",
        "time",
        "later",
        "time",
        "conceptually",
        "necessary",
        "order",
        "pastpresentfuture",
        "a",
        "series",
        "account",
        "also",
        "specious",
        "present",
        "similar",
        "box",
        "hope",
        "justice",
        "complex",
        "paper",
        "however",
        "focussing",
        "theme",
        "inconsistency",
        "one",
        "question",
        "could",
        "asked",
        "much",
        "mechanism",
        "perceptual",
        "completion",
        "object",
        "persistence",
        "really",
        "different",
        "specie",
        "genus",
        "would",
        "seem",
        "illusion",
        "pervasive",
        "mechanism",
        "identification",
        "earlierlater",
        "stage",
        "saw",
        "sufficient",
        "contradiction",
        "model",
        "motion",
        "perception",
        "right",
        "follows",
        "contradiction",
        "pervasive",
        "experience",
        "phenomenology",
        "change",
        "say",
        "everywhere"
    ]
}