{
    "main_text": "What is Chaos “Theory”?\n2. What is Chaos “Theory”?\n\nOne often finds references in the literature to “chaos\ntheory.” For instance, Kellert characterizes chaos theory as\n“the qualitative study of unstable aperiodic behavior in\ndeterministic nonlinear systems” (Kellert 1993, p. 2). In what\nsense is chaos a theory? Is it a theory in the same sense that\nelectrodynamics or quantum mechanics are theories?\n\n\nAnswering such questions is difficult if for no other reason than that\nthere is no consensus about what a theory is. Scientists often treat\ntheories as systematic bodies of knowledge that provide explanations\nand predictions for actual-world phenomena. But trying to get more\nspecific or precise than this generates significant differences for\nhow to conceptualize theories. Options here range from the axiomatic\nor syntactic view of the logical positivists and empiricists (see\n Vienna Circle)\n to the semantic or model-theoretic view\n(see\n models in science),\n to Kuhnian (see\n Thomas Kuhn) \n and less rigorous conceptions of theories. The axiomatic view of\ntheories appears to be inapplicable to chaos. There are no\naxioms—no laws—no deductive structures, no linking of\nobservational statements to theoretical statements whatsoever in the\nliterature on chaotic dynamics. \n\nKellert’s (1993) focus on chaos models is suggestive of the\nsemantic view of theories, and many texts and articles on chaos focus\non models (e.g., logistic map, Henon map, Lorenz attractor). Briefly,\non the semantic view, a theory is characterized by (1) some set of\nmodels and (2) the hypotheses linking these models with idealized\nphysical systems. The mathematical models discussed in the literature\nare concrete and fairly well understood, but what about the hypotheses\nlinking chaos models with idealized physical systems? In the chaos\nliterature, there is a great deal of discussion of various robust or\nuniversal patterns and the kinds of predictions that can and cannot be\nmade using chaotic models. Moreover, there is a lot of emphasis on\nqualitative predictions, geometric “mechanisms” and\npatterns, but this all comes up short of spelling out hypotheses\nlinking chaos models with idealized physical systems.\n\n\nOne possibility is to look for hypotheses about how such models are\ndeployed when studying actual physical systems. Chaos models seem to be\ndeployed to ascertain various kinds of information about bifurcation\npoints, period doubling sequences, the onset of chaotic dynamics, strange\nattractors and other denizens of the chaos zoo of behaviors. The\nhypotheses connecting chaos models to physical systems would have to be\nfilled in if we are to employ the semantic conception fully. I take it\nthese would be hypotheses about, for example, how strange attractors\nreconstructed from physical data relate to the physical system from\nwhich the data were originally recorded. Or about how a\none-dimensional map for a particular full nonlinear model (idealized\nphysical system) developed using, say, Poincaré surface of\nsection techniques, relates to the target system being modeled.\n\n\nSuch an approach does seem consistent with the semantic view as\nillustrated with classical mechanics. There we have various models\nsuch as the harmonic oscillator and hypotheses about how these models\napply to idealized physical systems, including specifications of\nspring constants and their identification with mathematical terms in a\nmodel, small oscillation limits, and so forth. But in classical mechanics there\nis a clear association between the models of a theory and the state\nspaces definable over the variables of those models, with a further\nhypothesis about the relationship between the model state space and\nthat of the physical system being modeled (the faithful model\nassumption,\n§1.2.3).\n One can translate between the state spaces and the models and, in the\ncase of classical mechanics, can read the laws off as well (e.g.,\nNewton’s laws of motion are encoded in the possibilities allowed in\nthe state spaces of classical mechanics). \n\nUnfortunately, the connection between state spaces, chaotic models\nand laws is less clear. Indeed, there currently are no good candidates for laws\nof chaos over and above the laws of classical mechanics, and some, such as\nKellert, explicitly deny that chaos modeling is getting at laws at all\n(1993, ch. 4). Furthermore, the relationship between the state\nspaces of chaotic models and the spaces of idealized physical systems\nis quite delicate, which seems to be a dissimilarity between classical\nmechanics and “chaos theory.” In the former case, we seem\nto be able to translate between models and state\nspaces.[3] In the\nlatter, we can derive a state space for chaotic models from the full\nnonlinear model, but we cannot reverse the process and get back to the\nnonlinear model state space from that of the chaotic model. One might\nexpect the hypotheses connecting chaos models with idealized physical\nsystems to piggy back on the hypotheses connecting classical mechanics\nmodels with their corresponding idealized physical systems. But it is\nneither clear how this would work in the case of nonlinear systems in\nclassical mechanics, nor how this would work for chaotic models in\nbiology, economics and other \ndisciplines.[4]\n\n\nAdditionally, there is another potential problem that arises from\nthinking about the faithful model assumption, namely what is the\nrelationship or mapping between model and target system? Is it\none-to-one as we standardly assume? Or is it a one-to-many relation\n(several different nonlinear models of the same target system or,\npotentially, vice versa) or a many-to-many\n relationship?[5] For many\nclassical mechanics problems—namely, where linear models or\nforce functions are used in Newton’s second law—the\nmapping or translation between model and target system appears to be\nstraightforwardly one-to-one. However, in nonlinear contexts, where one\nmight be constructing a model from a data set generated by observing a\nsystem, there are potentially many nonlinear models that can be\nconstructed, where each model is as empirically adequate to the system\nbehavior as any other. Is there really only one unique model for each\ntarget system and we simply do not know which is the\n“true” one (say, because of underdeterminiation\nproblems—see\n scientific realism)?\n Or is there really no one-to-one relationship between\nour mathematical models and target systems?\n\n\nMoreover, an important feature of the semantic view is that models\nare only intended to capture the crucial features of target systems\nand always involve various forms of abstraction and idealization (see\n models in science).\n These caveats are potentially deadly in the context of nonlinear\ndynamics. Any errors in our models for such systems, no matter how\naccurate our initial data, will lead to errors in predicting actual\nsystems as these errors will grow (perhaps rapidly) with time. This\nbrings out one of the problems with the faithful model assumption that\nis hidden, so to speak, in the context of linear systems. In the\nlatter context, models can be erroneous by leaving out\n“negligible” factors and, at least for reasonable times,\nour model predictions do not differ significantly with the target\nsystems we are modeling (wait long enough, however, and such\npredictions will differ significantly). In nonlinear contexts, by\ncontrast, it is not so clear there are any “negligible” factors. Even the\nsmallest omission in a nonlinear model can lead to disastrous effects\nbecause the differences these terms would have made versus their\nabsence potentially can be rapidly amplified as the model evolves (see\n §3).\n\n\nAnother possibility is to drop hypotheses connecting models with\ntarget systems and simply focus on the defining models of the semantic\nview of theories. This is very much the spirit of the mathematical\ntheory of dynamical systems. There the focus is on models and their\nrelations, but there is no emphasis on hypotheses connecting these\nmodels with actual systems, idealized or otherwise. Unfortunately,\nthis would mean that chaos theory would be only a mathematical theory\nand not a physical one.\n\n\nBoth the syntactic and semantic views of theories focus on the\nformal structure of theoretical bodies, and their “fit”\nwith theorizing about chaotic dynamics seems quite problematic. In\ncontrast, perhaps one should conceive of chaos theory in a more\ninformal or paradigmatic way, say along the lines of Kuhn’s (1996) analysis of\nscientific paradigms. There is no emphasis on the precise structure of\nscientific theories in Kuhn’s picture of science. Rather,\ntheories are cohesive, systematic bodies of knowledge defined mainly by\nthe roles they play in normal science practice within a dominant\nparadigm. There is a very strong sense in literature about chaos that a\n“new paradigm” has emerged out of chaos research with its\nemphasis on unstable rather than stable behavior, on dynamical\npatterns rather than on mechanisms, on universal features (e.g.,\nFeigenbaum’s number) rather than laws, and on qualitative\nunderstanding rather than on precise prediction. Whether or not chaotic\ndynamics represents a genuine scientific paradigm, the use of the term\n‘chaos theory’ in much of the scientific and philosophical\nliterature has the definite flavor of characterizing and understanding\ncomplex behavior rather than an emphasis on the formal structure of\nprinciples and hypotheses.\n\n",
    "section_title": "2. What is Chaos “Theory”?",
    "entry_title": "Chaos",
    "hierarchy_title": "Chaos || What is Chaos “Theory”?",
    "tokenized_text": [
        "chaos",
        "theory",
        "chaos",
        "theory",
        "one",
        "often",
        "find",
        "reference",
        "literature",
        "chaos",
        "theory",
        "instance",
        "kellert",
        "characterizes",
        "chaos",
        "theory",
        "qualitative",
        "study",
        "unstable",
        "aperiodic",
        "behavior",
        "deterministic",
        "nonlinear",
        "system",
        "kellert",
        "p",
        "sense",
        "chaos",
        "theory",
        "theory",
        "sense",
        "electrodynamics",
        "quantum",
        "mechanic",
        "theory",
        "answering",
        "question",
        "difficult",
        "reason",
        "consensus",
        "theory",
        "scientist",
        "often",
        "treat",
        "theory",
        "systematic",
        "body",
        "knowledge",
        "provide",
        "explanation",
        "prediction",
        "actualworld",
        "phenomenon",
        "trying",
        "get",
        "specific",
        "precise",
        "generates",
        "significant",
        "difference",
        "conceptualize",
        "theory",
        "option",
        "range",
        "axiomatic",
        "syntactic",
        "view",
        "logical",
        "positivist",
        "empiricist",
        "see",
        "vienna",
        "circle",
        "semantic",
        "modeltheoretic",
        "view",
        "see",
        "model",
        "science",
        "kuhnian",
        "see",
        "thomas",
        "kuhn",
        "le",
        "rigorous",
        "conception",
        "theory",
        "axiomatic",
        "view",
        "theory",
        "appears",
        "inapplicable",
        "chaos",
        "axiomsno",
        "lawsno",
        "deductive",
        "structure",
        "linking",
        "observational",
        "statement",
        "theoretical",
        "statement",
        "whatsoever",
        "literature",
        "chaotic",
        "dynamic",
        "kellert",
        "focus",
        "chaos",
        "model",
        "suggestive",
        "semantic",
        "view",
        "theory",
        "many",
        "text",
        "article",
        "chaos",
        "focus",
        "model",
        "eg",
        "logistic",
        "map",
        "henon",
        "map",
        "lorenz",
        "attractor",
        "briefly",
        "semantic",
        "view",
        "theory",
        "characterized",
        "set",
        "model",
        "hypothesis",
        "linking",
        "model",
        "idealized",
        "physical",
        "system",
        "mathematical",
        "model",
        "discussed",
        "literature",
        "concrete",
        "fairly",
        "well",
        "understood",
        "hypothesis",
        "linking",
        "chaos",
        "model",
        "idealized",
        "physical",
        "system",
        "chaos",
        "literature",
        "great",
        "deal",
        "discussion",
        "various",
        "robust",
        "universal",
        "pattern",
        "kind",
        "prediction",
        "made",
        "using",
        "chaotic",
        "model",
        "moreover",
        "lot",
        "emphasis",
        "qualitative",
        "prediction",
        "geometric",
        "mechanism",
        "pattern",
        "come",
        "short",
        "spelling",
        "hypothesis",
        "linking",
        "chaos",
        "model",
        "idealized",
        "physical",
        "system",
        "one",
        "possibility",
        "look",
        "hypothesis",
        "model",
        "deployed",
        "studying",
        "actual",
        "physical",
        "system",
        "chaos",
        "model",
        "seem",
        "deployed",
        "ascertain",
        "various",
        "kind",
        "information",
        "bifurcation",
        "point",
        "period",
        "doubling",
        "sequence",
        "onset",
        "chaotic",
        "dynamic",
        "strange",
        "attractor",
        "denizen",
        "chaos",
        "zoo",
        "behavior",
        "hypothesis",
        "connecting",
        "chaos",
        "model",
        "physical",
        "system",
        "would",
        "filled",
        "employ",
        "semantic",
        "conception",
        "fully",
        "take",
        "would",
        "hypothesis",
        "example",
        "strange",
        "attractor",
        "reconstructed",
        "physical",
        "data",
        "relate",
        "physical",
        "system",
        "data",
        "originally",
        "recorded",
        "onedimensional",
        "map",
        "particular",
        "full",
        "nonlinear",
        "model",
        "idealized",
        "physical",
        "system",
        "developed",
        "using",
        "say",
        "poincaré",
        "surface",
        "section",
        "technique",
        "relates",
        "target",
        "system",
        "modeled",
        "approach",
        "seem",
        "consistent",
        "semantic",
        "view",
        "illustrated",
        "classical",
        "mechanic",
        "various",
        "model",
        "harmonic",
        "oscillator",
        "hypothesis",
        "model",
        "apply",
        "idealized",
        "physical",
        "system",
        "including",
        "specification",
        "spring",
        "constant",
        "identification",
        "mathematical",
        "term",
        "model",
        "small",
        "oscillation",
        "limit",
        "forth",
        "classical",
        "mechanic",
        "clear",
        "association",
        "model",
        "theory",
        "state",
        "space",
        "definable",
        "variable",
        "model",
        "hypothesis",
        "relationship",
        "model",
        "state",
        "space",
        "physical",
        "system",
        "modeled",
        "faithful",
        "model",
        "assumption",
        "one",
        "translate",
        "state",
        "space",
        "model",
        "case",
        "classical",
        "mechanic",
        "read",
        "law",
        "well",
        "eg",
        "newton",
        "law",
        "motion",
        "encoded",
        "possibility",
        "allowed",
        "state",
        "space",
        "classical",
        "mechanic",
        "unfortunately",
        "connection",
        "state",
        "space",
        "chaotic",
        "model",
        "law",
        "le",
        "clear",
        "indeed",
        "currently",
        "good",
        "candidate",
        "law",
        "chaos",
        "law",
        "classical",
        "mechanic",
        "kellert",
        "explicitly",
        "deny",
        "chaos",
        "modeling",
        "getting",
        "law",
        "ch",
        "furthermore",
        "relationship",
        "state",
        "space",
        "chaotic",
        "model",
        "space",
        "idealized",
        "physical",
        "system",
        "quite",
        "delicate",
        "seems",
        "dissimilarity",
        "classical",
        "mechanic",
        "chaos",
        "theory",
        "former",
        "case",
        "seem",
        "able",
        "translate",
        "model",
        "state",
        "space",
        "latter",
        "derive",
        "state",
        "space",
        "chaotic",
        "model",
        "full",
        "nonlinear",
        "model",
        "reverse",
        "process",
        "get",
        "back",
        "nonlinear",
        "model",
        "state",
        "space",
        "chaotic",
        "model",
        "one",
        "might",
        "expect",
        "hypothesis",
        "connecting",
        "chaos",
        "model",
        "idealized",
        "physical",
        "system",
        "piggy",
        "back",
        "hypothesis",
        "connecting",
        "classical",
        "mechanic",
        "model",
        "corresponding",
        "idealized",
        "physical",
        "system",
        "neither",
        "clear",
        "would",
        "work",
        "case",
        "nonlinear",
        "system",
        "classical",
        "mechanic",
        "would",
        "work",
        "chaotic",
        "model",
        "biology",
        "economics",
        "discipline",
        "additionally",
        "another",
        "potential",
        "problem",
        "arises",
        "thinking",
        "faithful",
        "model",
        "assumption",
        "namely",
        "relationship",
        "mapping",
        "model",
        "target",
        "system",
        "onetoone",
        "standardly",
        "assume",
        "onetomany",
        "relation",
        "several",
        "different",
        "nonlinear",
        "model",
        "target",
        "system",
        "potentially",
        "vice",
        "versa",
        "manytomany",
        "relationship",
        "many",
        "classical",
        "mechanic",
        "problemsnamely",
        "linear",
        "model",
        "force",
        "function",
        "used",
        "newton",
        "second",
        "lawthe",
        "mapping",
        "translation",
        "model",
        "target",
        "system",
        "appears",
        "straightforwardly",
        "onetoone",
        "however",
        "nonlinear",
        "context",
        "one",
        "might",
        "constructing",
        "model",
        "data",
        "set",
        "generated",
        "observing",
        "system",
        "potentially",
        "many",
        "nonlinear",
        "model",
        "constructed",
        "model",
        "empirically",
        "adequate",
        "system",
        "behavior",
        "really",
        "one",
        "unique",
        "model",
        "target",
        "system",
        "simply",
        "know",
        "true",
        "one",
        "say",
        "underdeterminiation",
        "problemssee",
        "scientific",
        "realism",
        "really",
        "onetoone",
        "relationship",
        "mathematical",
        "model",
        "target",
        "system",
        "moreover",
        "important",
        "feature",
        "semantic",
        "view",
        "model",
        "intended",
        "capture",
        "crucial",
        "feature",
        "target",
        "system",
        "always",
        "involve",
        "various",
        "form",
        "abstraction",
        "idealization",
        "see",
        "model",
        "science",
        "caveat",
        "potentially",
        "deadly",
        "context",
        "nonlinear",
        "dynamic",
        "error",
        "model",
        "system",
        "matter",
        "accurate",
        "initial",
        "data",
        "lead",
        "error",
        "predicting",
        "actual",
        "system",
        "error",
        "grow",
        "perhaps",
        "rapidly",
        "time",
        "brings",
        "one",
        "problem",
        "faithful",
        "model",
        "assumption",
        "hidden",
        "speak",
        "context",
        "linear",
        "system",
        "latter",
        "context",
        "model",
        "erroneous",
        "leaving",
        "negligible",
        "factor",
        "least",
        "reasonable",
        "time",
        "model",
        "prediction",
        "differ",
        "significantly",
        "target",
        "system",
        "modeling",
        "wait",
        "long",
        "enough",
        "however",
        "prediction",
        "differ",
        "significantly",
        "nonlinear",
        "context",
        "contrast",
        "clear",
        "negligible",
        "factor",
        "even",
        "smallest",
        "omission",
        "nonlinear",
        "model",
        "lead",
        "disastrous",
        "effect",
        "difference",
        "term",
        "would",
        "made",
        "versus",
        "absence",
        "potentially",
        "rapidly",
        "amplified",
        "model",
        "evolves",
        "see",
        "another",
        "possibility",
        "drop",
        "hypothesis",
        "connecting",
        "model",
        "target",
        "system",
        "simply",
        "focus",
        "defining",
        "model",
        "semantic",
        "view",
        "theory",
        "much",
        "spirit",
        "mathematical",
        "theory",
        "dynamical",
        "system",
        "focus",
        "model",
        "relation",
        "emphasis",
        "hypothesis",
        "connecting",
        "model",
        "actual",
        "system",
        "idealized",
        "otherwise",
        "unfortunately",
        "would",
        "mean",
        "chaos",
        "theory",
        "would",
        "mathematical",
        "theory",
        "physical",
        "one",
        "syntactic",
        "semantic",
        "view",
        "theory",
        "focus",
        "formal",
        "structure",
        "theoretical",
        "body",
        "fit",
        "theorizing",
        "chaotic",
        "dynamic",
        "seems",
        "quite",
        "problematic",
        "contrast",
        "perhaps",
        "one",
        "conceive",
        "chaos",
        "theory",
        "informal",
        "paradigmatic",
        "way",
        "say",
        "along",
        "line",
        "kuhn",
        "analysis",
        "scientific",
        "paradigm",
        "emphasis",
        "precise",
        "structure",
        "scientific",
        "theory",
        "kuhn",
        "picture",
        "science",
        "rather",
        "theory",
        "cohesive",
        "systematic",
        "body",
        "knowledge",
        "defined",
        "mainly",
        "role",
        "play",
        "normal",
        "science",
        "practice",
        "within",
        "dominant",
        "paradigm",
        "strong",
        "sense",
        "literature",
        "chaos",
        "new",
        "paradigm",
        "emerged",
        "chaos",
        "research",
        "emphasis",
        "unstable",
        "rather",
        "stable",
        "behavior",
        "dynamical",
        "pattern",
        "rather",
        "mechanism",
        "universal",
        "feature",
        "eg",
        "feigenbaum",
        "number",
        "rather",
        "law",
        "qualitative",
        "understanding",
        "rather",
        "precise",
        "prediction",
        "whether",
        "chaotic",
        "dynamic",
        "represents",
        "genuine",
        "scientific",
        "paradigm",
        "use",
        "term",
        "chaos",
        "theory",
        "much",
        "scientific",
        "philosophical",
        "literature",
        "definite",
        "flavor",
        "characterizing",
        "understanding",
        "complex",
        "behavior",
        "rather",
        "emphasis",
        "formal",
        "structure",
        "principle",
        "hypothesis"
    ]
}