{
    "main_text": "Quantum Chaos || Does Quantum Chaos Exist? Isolated Systems\n6.1 Does Quantum Chaos Exist? Isolated Systems\n\nOne difference between classical chaotic dynamics and quantum dynamics\nis that the state space of the former supports fractal structure while\nthe state space of the latter does not. A second difference is that\nclassical chaotic dynamics has a continuous energy spectrum associated\nwith its motion. As previously noted, classical chaos is considered to\nbe a property of bounded macroscopic systems. In comparison, the\nquantum dynamics in bounded, isolated systems has a discrete energy\nspectrum associated with its motion. Moreover, phenomena such as SDIC\ncould only be possible in quantum systems that appropriately mirror\nclassical system behaviors. From semi-classical considerations, Berry\net al. (1979) showed that semi-classical quantum systems (see below\nfor how such systems are constructed) could be expected to mirror the\nbehavior of their corresponding classical systems only up to the\nEhrenfest time \\(t_{E}\\), of the order \\(\\ln(2\\pi/h)\\) secs, \nan estimate also known as the log time\nreflecting the exponential instability of classical chaotic\ntrajectories. In these semi-classical studies, \\(h/2\\pi\\) often is\ntreated as a parameter that is reduced in magnitude as the classical\ndomain is approached. On this view, the smaller \\(h/2\\pi\\), the\nmore “classical” the system’s behavior becomes. For\ninstance, assuming the value of Planck’s constant in KMS\nunits, \\(t_{E} \\sim 80\\) secs. As Planck’s constant\ndecreases, \\(t_{E}\\) grows. In nonchaotic\nclassical systems the orbits in state space are well isolated and\neverything well behaved for very long times. In contrast for bound\nchaotic systems the orbits start coalescing in increasing numbers on\nthe scale of\n\\(t_{E}\\), implying that the semi-classical\napproximation fails by \\(t_{E}\\). On the other\nhand, a Gaussian wave packet centered on a classical trajectory is\nthought to be able to shadow that trajectory up\nto \\(t_{E}\\) before becoming too spread out over\nthe energy surface since \\(t_{E}\\) is a measure\nof when quantum wave packets have spread too much to mimic classical\ntrajectories and the Ehrenfest theorem breaks down. So there are two\neffects at work in semi-classical systems over time: (1) the\ncoalescing of classical chaotic trajectories and (2) the spreading of\nquantum wave packets. Between the lack of nonlinearity in quantum\nmechanics and the latter two effects, things look rather bleak for\nfinding close quantum analogs of classical chaos.\n\n\nWhile \\(t_{E}\\) represents an important limit\nfor how long quantum state vectors can be expected to shadow classical\ntrajectories, there are interesting behaviors in the semi-classical\nquantum models corresponding to classical chaotic systems on longer\ntime scales. By performing some more detailed analysis, Tomsovic and\nHeller (1993) showed that comparing the full quantum solutions with\nsuitably chosen semi-classical solutions for some billiards problems\nprovided excellent agreement well\nafter \\(t_{E}\\) including fine details of the\nenergy spectra. For their techniques semi-classical mechanics remains\naccurate for modeling quantum systems up to a time that scales with\n\\((h/2\\pi)^{-1/2}\\).\n\n\nThe vast majority of these quantum chaology studies focus on three questions:\n\nCan classically chaotic systems be quantized?\nAre there any quantum mechanical manifestations, \n“precursors,” of classical chaos?\nIs there a rigorous distinction between chaotic and non-chaotic \nquantum systems?[10]\n\n\nThe first two questions focus on different directions of research,\nboth related to what is known as semi-classical mechanics. In the\nfirst, investigation starts with a classical chaotic system and seeks\nto quantize it to study its quantum behavior. To quantize a classical\nmodel, one replaces functions in the equations of motion with their\ncorresponding quantum operators. Here, there are various results\ndemonstrating that strongly ergodic classical billiards, when\nquantized, exhibit quantum ergodicity. But this is not the same as\nshowing that a classical chaotic system, when quantized, exhibits\nchaotic behavior. There are no examples of the latter due to the\nreasons listed at the beginning of this subsection.\n\nFurthermore, there are interesting numerical results on quantum\ninterference in quantized classical billiards (Casati 2005). Consider\na double slit with the source enclosed in a two-dimensional wave\nresonator with the shape of a classical billiard. Adjust the Gaussian\nwave packet’s initial average energy to be one 1600th of an excited\nstate of the quantized billiard and send it toward the double slit\nopening of the resonator. Let the slit width be three De Broglie\nwavelengths, and suppose that the wave packet is sharply peaked in\nmomentum so that its spatial spread, by the Heisenberg relations, is\nthe width of the resonator. If the shape of the resonator corresponds\nto a classical chaotic billiard, then there is almost no\nquantum interference. In the classical case, the multiply reflected\nwaves would become randomized in phase. On the other hand, if the\nshape of the resonator corresponds to a classical regular\nbilliard, then the well-known interference patterns emerge. So\ndepending on whether the classical billiard is chaotic or not\ndetermines whether the quantized quantum analogue exhibits\ninterference.\n\n\nThe second question starts with a quantum system that has some\nrelationship with a classical chaotic system via an appropriate\nsemi-classical limit. The classical-to-quantum direction often follows\nthe pioneering work of Martin Gutzweiller (1971) in quantizing the\nclassical chaotic system. The quantum-to-classical direction is much\nmore difficult and fraught with conceptual problems. Standard\napproaches, here, are to start with a quantum analogue to a classical\nchaotic system and then derive a semi-classical system that represents\nthe quantum system in some kind of classical limit (Berry 1987 and\n2001; Bokulich 2008). This work results in statistics of suitably\nnormalized energy levels for the semi-classical systems with universal\nfeatures. For classical systems that behave non-chaotically, the\nenergy levels of the semi-classical system approximate a Poisson\ndistribution, where small spacings dominate. In contrast when the\nclassical system behaves chaotically, the energy levels of the\nsemi-classical system take on a distribution originally derived by\nEugene Wigner (1951) to describe nuclear energy spectra (for\ndiscussion see Guhr et al. 1998). These latter distributions depend\nonly on some symmetry properties (e.g., the presence or absence of\ntime-reversal symmetry in the\n system).[11]\n Moreover, the presence of periodic orbits\nin the analog classical systems largely determine the properties of\nsemi-classical systems (Berry 1977).\n\n\nInterestingly, many classically chaotic models systems also display\nuniversal energy level fluctuations that are well described by\nWigner’s methods (Casati, Guarneri and Valz-Gris 1980; Bohigas,\nGiannoni and Schmit 1984). This has led to the quantum chaos\nconjecture:\n\n(Quantum Chaos Conjecture)  The short-range\n correlations in the energy spectra of semi-classical quantum systems which are\n strongly chaotic in the classical limit obey universal fluctuation\n laws based on ensembles of random matrices without free parameters.\n\nThis conjecture is motivated by the accumulated evidence over the\ndecades that the energy spectra of very simple non-integrable\nclassically chaotic systems contain universal level fluctuations\ndescribed by random matrix theory. Given random matrix theory’s\nsuccessful application to nuclear spectra and these classical results,\nthe question of whether there were analog results for quantum systems\nwith chaotic systems as an appropriate limit seems reasonable. The\nconjecture basically means that the energy spectra for the semi-classical analogues of classical chaotic systems are structurally the same as those classical systems. This\nconjecture remains unproven, though it appears to hold for the case of\nclassical chaotic billiards and their semi-classical counterparts. Since this is a conjecture about semi-classical systems, this means that the structure of the energy spectra of semi-classical systems is strictly dependent on chaos in the corresponding classical systems  not on any chaotic behavior in quantum or semi-classical systems.\n\nOne can raise serious questions about these quantum-to-classical\nstudies, however. The semi-classical systems are derived using various\nasymptotic procedures (Berry 1987 and 2001), but these procedures do\nnot yield the actual classical systems that are supposed to be the\nlimiting cases of the quantum systems. More importantly, the actual\nkinds of limiting relations between the quantum and classical domains\nare different than are typically considered in semi-classical\napproaches (§6.3 below). The actual\nrelationship between the mathematical results and actual quantum and\nclassical physical systems is tenuous at best leaving us, again, with\nthe worry that chaos is an artifact of the mathematics\n(§5). One of the reasons the quantum\nchaos conjecture remains unproven likely is that inappropriate notions\nof “the classical limit” are being used. Even though the\nenergy level statistics for quantum billiards in the semi-classical\ncounterparts to classical billiard systems share universal properties,\nthe actual behavior of the trajectories in the two systems is\nsubstantially different (under Schrödinger evolution Hilbert \nspace vectors never diverge from one another).\n\n\nAnother fundamental problem is that classical chaos is a function of\nnonlinearities whereas Schrödinger’s equation describing quantum\nsystems is linear. Empirical investigation of quantum chaology, hence,\nusually focuses on externally driven quantum systems (see next\nsection) and scattering processes (e.g., quantum billiards). The focus\nin these studies is on the unpredictability of the time evolution of\nsuch systems and processes. Although unpredictability is a feature of\nclassical chaotic systems, there are many reasons why the time\nevolution of quantum systems may be as unpredictable (e.g., if\ncommuting observables undergo complicated dynamics). It is not clear\nthat unpredictability in externally driven quantum systems and\nscattering processes is due to any form of chaos.\n\n\nQuantum systems do sometimes exhibit bifurcations. For instance, rotating\nmolecules under some circumstances will undergo several consecutive\nqualitative changes that are interpreted as bifurcations\n(Zhilinskií 2001). Whether there is a series of bifurcations in\nsuch systems that could eventually lead to a transition to some form\nof quantum chaotic behavior is currently unknown.\n\n\nAt best, quantum chaology in isolated systems has produced results\nthat have interesting relationships with integrable and non-integrable\nclassical systems and some important experimental results (e.g.,\nBayfield and Koch 1974; Casati, Chirikov, Izrailev and Ford 1979;\nFishman, Grempel and Prange 1982; Casati, Chirikov and Shepelyanski\n1984; Berry 2001). These relationships are all statistical as\nindicated. One issue with studying isolated, closed quantum systems is\nthat the state spaces of these systems do not allow the formation of\nthe state-space structures typically associated with classical chaotic\nsystems. There are some exceptions discussed in the literature, but it\nis actually ambiguous if these are genuine cases of chaos. One example\ndiscussed in the literature is a quantum Hamiltonian operator for\nan \\(N\\)-dimensional torus:\n\\(\\bfrac{1}{2}(g_{k} n_{k} + n_{k} g_{k})\\),\nwhere \\(n_{k} = -i\\partial / \\partial \\theta_{k}, \\theta_{k}\\) \nis an angle variable, and \\(d\\theta_{i} /dt = g_{i}(\\theta_{k})\\)\nfor \\(i, k = 1, 2,3,..., N\\) (Chirikov,\nIzrailev and Shepelyanski 1988, p. 79). The probability density for\nmomentum grows exponentially fast, which seems to parallel SDIC for\ntrajectories in the classical case. Again, it is far from clear that\nthis is chaos; there is no principled reason for considering the\nexponential growth in some quantity as a mark of chaos (recall the\nexample in the first paragraph\nof §1.2.6 above).\n\n\nBuilding on the numerical results of the double-slit/billiard wave\nresonator described above, it may be possible to apply quantum\nchaology to the quantum measurement problem. Typically, models for\nquantum measurement describe the destruction of coherent quantum\nstates as an effect of external noise or the environment. These\nquantum chaology results could allow the development of a dynamical\ntheory of quantum decoherence due to the interaction between a\nclassical chaotic (or at least non-integrable) system and coherent\nquantum states producing the incoherent mixtures observed in\nmeasurement devices. These considerations lead us to interacting systems.\n\n",
    "section_title": "6.1 Does Quantum Chaos Exist? Isolated Systems",
    "entry_title": "Chaos",
    "hierarchy_title": "Chaos || Quantum Chaos || Does Quantum Chaos Exist? Isolated Systems",
    "tokenized_text": [
        "quantum",
        "chaos",
        "quantum",
        "chaos",
        "exist",
        "isolated",
        "system",
        "quantum",
        "chaos",
        "exist",
        "isolated",
        "system",
        "one",
        "difference",
        "classical",
        "chaotic",
        "dynamic",
        "quantum",
        "dynamic",
        "state",
        "space",
        "former",
        "support",
        "fractal",
        "structure",
        "state",
        "space",
        "latter",
        "second",
        "difference",
        "classical",
        "chaotic",
        "dynamic",
        "continuous",
        "energy",
        "spectrum",
        "associated",
        "motion",
        "previously",
        "noted",
        "classical",
        "chaos",
        "considered",
        "property",
        "bounded",
        "macroscopic",
        "system",
        "comparison",
        "quantum",
        "dynamic",
        "bounded",
        "isolated",
        "system",
        "discrete",
        "energy",
        "spectrum",
        "associated",
        "motion",
        "moreover",
        "phenomenon",
        "sdic",
        "could",
        "possible",
        "quantum",
        "system",
        "appropriately",
        "mirror",
        "classical",
        "system",
        "behavior",
        "semiclassical",
        "consideration",
        "berry",
        "et",
        "al",
        "showed",
        "semiclassical",
        "quantum",
        "system",
        "see",
        "system",
        "constructed",
        "could",
        "expected",
        "mirror",
        "behavior",
        "corresponding",
        "classical",
        "system",
        "ehrenfest",
        "time",
        "t_",
        "e",
        "order",
        "ln",
        "pih",
        "sec",
        "estimate",
        "also",
        "known",
        "log",
        "time",
        "reflecting",
        "exponential",
        "instability",
        "classical",
        "chaotic",
        "trajectory",
        "semiclassical",
        "study",
        "hpi",
        "often",
        "treated",
        "parameter",
        "reduced",
        "magnitude",
        "classical",
        "domain",
        "approached",
        "view",
        "smaller",
        "hpi",
        "classical",
        "system",
        "behavior",
        "becomes",
        "instance",
        "assuming",
        "value",
        "planck",
        "constant",
        "km",
        "unit",
        "t_",
        "e",
        "sim",
        "sec",
        "planck",
        "constant",
        "decrease",
        "t_",
        "e",
        "grows",
        "nonchaotic",
        "classical",
        "system",
        "orbit",
        "state",
        "space",
        "well",
        "isolated",
        "everything",
        "well",
        "behaved",
        "long",
        "time",
        "contrast",
        "bound",
        "chaotic",
        "system",
        "orbit",
        "start",
        "coalescing",
        "increasing",
        "number",
        "scale",
        "t_",
        "e",
        "implying",
        "semiclassical",
        "approximation",
        "fails",
        "t_",
        "e",
        "hand",
        "gaussian",
        "wave",
        "packet",
        "centered",
        "classical",
        "trajectory",
        "thought",
        "able",
        "shadow",
        "trajectory",
        "t_",
        "e",
        "becoming",
        "spread",
        "energy",
        "surface",
        "since",
        "t_",
        "e",
        "measure",
        "quantum",
        "wave",
        "packet",
        "spread",
        "much",
        "mimic",
        "classical",
        "trajectory",
        "ehrenfest",
        "theorem",
        "break",
        "two",
        "effect",
        "work",
        "semiclassical",
        "system",
        "time",
        "coalescing",
        "classical",
        "chaotic",
        "trajectory",
        "spreading",
        "quantum",
        "wave",
        "packet",
        "lack",
        "nonlinearity",
        "quantum",
        "mechanic",
        "latter",
        "two",
        "effect",
        "thing",
        "look",
        "rather",
        "bleak",
        "finding",
        "close",
        "quantum",
        "analog",
        "classical",
        "chaos",
        "t_",
        "e",
        "represents",
        "important",
        "limit",
        "long",
        "quantum",
        "state",
        "vector",
        "expected",
        "shadow",
        "classical",
        "trajectory",
        "interesting",
        "behavior",
        "semiclassical",
        "quantum",
        "model",
        "corresponding",
        "classical",
        "chaotic",
        "system",
        "longer",
        "time",
        "scale",
        "performing",
        "detailed",
        "analysis",
        "tomsovic",
        "heller",
        "showed",
        "comparing",
        "full",
        "quantum",
        "solution",
        "suitably",
        "chosen",
        "semiclassical",
        "solution",
        "billiards",
        "problem",
        "provided",
        "excellent",
        "agreement",
        "well",
        "t_",
        "e",
        "including",
        "fine",
        "detail",
        "energy",
        "spectrum",
        "technique",
        "semiclassical",
        "mechanic",
        "remains",
        "accurate",
        "modeling",
        "quantum",
        "system",
        "time",
        "scale",
        "hpi",
        "vast",
        "majority",
        "quantum",
        "chaology",
        "study",
        "focus",
        "three",
        "question",
        "classically",
        "chaotic",
        "system",
        "quantized",
        "quantum",
        "mechanical",
        "manifestation",
        "precursor",
        "classical",
        "chaos",
        "rigorous",
        "distinction",
        "chaotic",
        "nonchaotic",
        "quantum",
        "system",
        "first",
        "two",
        "question",
        "focus",
        "different",
        "direction",
        "research",
        "related",
        "known",
        "semiclassical",
        "mechanic",
        "first",
        "investigation",
        "start",
        "classical",
        "chaotic",
        "system",
        "seek",
        "quantize",
        "study",
        "quantum",
        "behavior",
        "quantize",
        "classical",
        "model",
        "one",
        "replaces",
        "function",
        "equation",
        "motion",
        "corresponding",
        "quantum",
        "operator",
        "various",
        "result",
        "demonstrating",
        "strongly",
        "ergodic",
        "classical",
        "billiards",
        "quantized",
        "exhibit",
        "quantum",
        "ergodicity",
        "showing",
        "classical",
        "chaotic",
        "system",
        "quantized",
        "exhibit",
        "chaotic",
        "behavior",
        "example",
        "latter",
        "due",
        "reason",
        "listed",
        "beginning",
        "subsection",
        "furthermore",
        "interesting",
        "numerical",
        "result",
        "quantum",
        "interference",
        "quantized",
        "classical",
        "billiards",
        "casati",
        "consider",
        "double",
        "slit",
        "source",
        "enclosed",
        "twodimensional",
        "wave",
        "resonator",
        "shape",
        "classical",
        "billiard",
        "adjust",
        "gaussian",
        "wave",
        "packet",
        "initial",
        "average",
        "energy",
        "one",
        "th",
        "excited",
        "state",
        "quantized",
        "billiard",
        "send",
        "toward",
        "double",
        "slit",
        "opening",
        "resonator",
        "let",
        "slit",
        "width",
        "three",
        "de",
        "broglie",
        "wavelength",
        "suppose",
        "wave",
        "packet",
        "sharply",
        "peaked",
        "momentum",
        "spatial",
        "spread",
        "heisenberg",
        "relation",
        "width",
        "resonator",
        "shape",
        "resonator",
        "corresponds",
        "classical",
        "chaotic",
        "billiard",
        "almost",
        "quantum",
        "interference",
        "classical",
        "case",
        "multiply",
        "reflected",
        "wave",
        "would",
        "become",
        "randomized",
        "phase",
        "hand",
        "shape",
        "resonator",
        "corresponds",
        "classical",
        "regular",
        "billiard",
        "wellknown",
        "interference",
        "pattern",
        "emerge",
        "depending",
        "whether",
        "classical",
        "billiard",
        "chaotic",
        "determines",
        "whether",
        "quantized",
        "quantum",
        "analogue",
        "exhibit",
        "interference",
        "second",
        "question",
        "start",
        "quantum",
        "system",
        "relationship",
        "classical",
        "chaotic",
        "system",
        "via",
        "appropriate",
        "semiclassical",
        "limit",
        "classicaltoquantum",
        "direction",
        "often",
        "follows",
        "pioneering",
        "work",
        "martin",
        "gutzweiller",
        "quantizing",
        "classical",
        "chaotic",
        "system",
        "quantumtoclassical",
        "direction",
        "much",
        "difficult",
        "fraught",
        "conceptual",
        "problem",
        "standard",
        "approach",
        "start",
        "quantum",
        "analogue",
        "classical",
        "chaotic",
        "system",
        "derive",
        "semiclassical",
        "system",
        "represents",
        "quantum",
        "system",
        "kind",
        "classical",
        "limit",
        "berry",
        "bokulich",
        "work",
        "result",
        "statistic",
        "suitably",
        "normalized",
        "energy",
        "level",
        "semiclassical",
        "system",
        "universal",
        "feature",
        "classical",
        "system",
        "behave",
        "nonchaotically",
        "energy",
        "level",
        "semiclassical",
        "system",
        "approximate",
        "poisson",
        "distribution",
        "small",
        "spacing",
        "dominate",
        "contrast",
        "classical",
        "system",
        "behaves",
        "chaotically",
        "energy",
        "level",
        "semiclassical",
        "system",
        "take",
        "distribution",
        "originally",
        "derived",
        "eugene",
        "wigner",
        "describe",
        "nuclear",
        "energy",
        "spectrum",
        "discussion",
        "see",
        "guhr",
        "et",
        "al",
        "latter",
        "distribution",
        "depend",
        "symmetry",
        "property",
        "eg",
        "presence",
        "absence",
        "timereversal",
        "symmetry",
        "system",
        "moreover",
        "presence",
        "periodic",
        "orbit",
        "analog",
        "classical",
        "system",
        "largely",
        "determine",
        "property",
        "semiclassical",
        "system",
        "berry",
        "interestingly",
        "many",
        "classically",
        "chaotic",
        "model",
        "system",
        "also",
        "display",
        "universal",
        "energy",
        "level",
        "fluctuation",
        "well",
        "described",
        "wigner",
        "method",
        "casati",
        "guarneri",
        "valzgris",
        "bohigas",
        "giannoni",
        "schmit",
        "led",
        "quantum",
        "chaos",
        "conjecture",
        "quantum",
        "chaos",
        "conjecture",
        "shortrange",
        "correlation",
        "energy",
        "spectrum",
        "semiclassical",
        "quantum",
        "system",
        "strongly",
        "chaotic",
        "classical",
        "limit",
        "obey",
        "universal",
        "fluctuation",
        "law",
        "based",
        "ensemble",
        "random",
        "matrix",
        "without",
        "free",
        "parameter",
        "conjecture",
        "motivated",
        "accumulated",
        "evidence",
        "decade",
        "energy",
        "spectrum",
        "simple",
        "nonintegrable",
        "classically",
        "chaotic",
        "system",
        "contain",
        "universal",
        "level",
        "fluctuation",
        "described",
        "random",
        "matrix",
        "theory",
        "given",
        "random",
        "matrix",
        "theory",
        "successful",
        "application",
        "nuclear",
        "spectrum",
        "classical",
        "result",
        "question",
        "whether",
        "analog",
        "result",
        "quantum",
        "system",
        "chaotic",
        "system",
        "appropriate",
        "limit",
        "seems",
        "reasonable",
        "conjecture",
        "basically",
        "mean",
        "energy",
        "spectrum",
        "semiclassical",
        "analogue",
        "classical",
        "chaotic",
        "system",
        "structurally",
        "classical",
        "system",
        "conjecture",
        "remains",
        "unproven",
        "though",
        "appears",
        "hold",
        "case",
        "classical",
        "chaotic",
        "billiards",
        "semiclassical",
        "counterpart",
        "since",
        "conjecture",
        "semiclassical",
        "system",
        "mean",
        "structure",
        "energy",
        "spectrum",
        "semiclassical",
        "system",
        "strictly",
        "dependent",
        "chaos",
        "corresponding",
        "classical",
        "system",
        "chaotic",
        "behavior",
        "quantum",
        "semiclassical",
        "system",
        "one",
        "raise",
        "serious",
        "question",
        "quantumtoclassical",
        "study",
        "however",
        "semiclassical",
        "system",
        "derived",
        "using",
        "various",
        "asymptotic",
        "procedure",
        "berry",
        "procedure",
        "yield",
        "actual",
        "classical",
        "system",
        "supposed",
        "limiting",
        "case",
        "quantum",
        "system",
        "importantly",
        "actual",
        "kind",
        "limiting",
        "relation",
        "quantum",
        "classical",
        "domain",
        "different",
        "typically",
        "considered",
        "semiclassical",
        "approach",
        "actual",
        "relationship",
        "mathematical",
        "result",
        "actual",
        "quantum",
        "classical",
        "physical",
        "system",
        "tenuous",
        "best",
        "leaving",
        "u",
        "worry",
        "chaos",
        "artifact",
        "mathematics",
        "one",
        "reason",
        "quantum",
        "chaos",
        "conjecture",
        "remains",
        "unproven",
        "likely",
        "inappropriate",
        "notion",
        "classical",
        "limit",
        "used",
        "even",
        "though",
        "energy",
        "level",
        "statistic",
        "quantum",
        "billiards",
        "semiclassical",
        "counterpart",
        "classical",
        "billiard",
        "system",
        "share",
        "universal",
        "property",
        "actual",
        "behavior",
        "trajectory",
        "two",
        "system",
        "substantially",
        "different",
        "schrödinger",
        "evolution",
        "hilbert",
        "space",
        "vector",
        "never",
        "diverge",
        "one",
        "another",
        "another",
        "fundamental",
        "problem",
        "classical",
        "chaos",
        "function",
        "nonlinearities",
        "whereas",
        "schrödinger",
        "equation",
        "describing",
        "quantum",
        "system",
        "linear",
        "empirical",
        "investigation",
        "quantum",
        "chaology",
        "hence",
        "usually",
        "focus",
        "externally",
        "driven",
        "quantum",
        "system",
        "see",
        "next",
        "section",
        "scattering",
        "process",
        "eg",
        "quantum",
        "billiards",
        "focus",
        "study",
        "unpredictability",
        "time",
        "evolution",
        "system",
        "process",
        "although",
        "unpredictability",
        "feature",
        "classical",
        "chaotic",
        "system",
        "many",
        "reason",
        "time",
        "evolution",
        "quantum",
        "system",
        "may",
        "unpredictable",
        "eg",
        "commuting",
        "observables",
        "undergo",
        "complicated",
        "dynamic",
        "clear",
        "unpredictability",
        "externally",
        "driven",
        "quantum",
        "system",
        "scattering",
        "process",
        "due",
        "form",
        "chaos",
        "quantum",
        "system",
        "sometimes",
        "exhibit",
        "bifurcation",
        "instance",
        "rotating",
        "molecule",
        "circumstance",
        "undergo",
        "several",
        "consecutive",
        "qualitative",
        "change",
        "interpreted",
        "bifurcation",
        "zhilinskií",
        "whether",
        "series",
        "bifurcation",
        "system",
        "could",
        "eventually",
        "lead",
        "transition",
        "form",
        "quantum",
        "chaotic",
        "behavior",
        "currently",
        "unknown",
        "best",
        "quantum",
        "chaology",
        "isolated",
        "system",
        "produced",
        "result",
        "interesting",
        "relationship",
        "integrable",
        "nonintegrable",
        "classical",
        "system",
        "important",
        "experimental",
        "result",
        "eg",
        "bayfield",
        "koch",
        "casati",
        "chirikov",
        "izrailev",
        "ford",
        "fishman",
        "grempel",
        "prange",
        "casati",
        "chirikov",
        "shepelyanski",
        "berry",
        "relationship",
        "statistical",
        "indicated",
        "one",
        "issue",
        "studying",
        "isolated",
        "closed",
        "quantum",
        "system",
        "state",
        "space",
        "system",
        "allow",
        "formation",
        "statespace",
        "structure",
        "typically",
        "associated",
        "classical",
        "chaotic",
        "system",
        "exception",
        "discussed",
        "literature",
        "actually",
        "ambiguous",
        "genuine",
        "case",
        "chaos",
        "one",
        "example",
        "discussed",
        "literature",
        "quantum",
        "hamiltonian",
        "operator",
        "n",
        "dimensional",
        "torus",
        "bfrac",
        "g_",
        "k",
        "n_",
        "k",
        "n_",
        "k",
        "g_",
        "k",
        "n_",
        "k",
        "ipartial",
        "partial",
        "theta_",
        "k",
        "theta_",
        "k",
        "angle",
        "variable",
        "dtheta_",
        "dt",
        "g_",
        "theta_",
        "k",
        "k",
        "n",
        "chirikov",
        "izrailev",
        "shepelyanski",
        "p",
        "probability",
        "density",
        "momentum",
        "grows",
        "exponentially",
        "fast",
        "seems",
        "parallel",
        "sdic",
        "trajectory",
        "classical",
        "case",
        "far",
        "clear",
        "chaos",
        "principled",
        "reason",
        "considering",
        "exponential",
        "growth",
        "quantity",
        "mark",
        "chaos",
        "recall",
        "example",
        "first",
        "paragraph",
        "building",
        "numerical",
        "result",
        "doubleslitbilliard",
        "wave",
        "resonator",
        "described",
        "may",
        "possible",
        "apply",
        "quantum",
        "chaology",
        "quantum",
        "measurement",
        "problem",
        "typically",
        "model",
        "quantum",
        "measurement",
        "describe",
        "destruction",
        "coherent",
        "quantum",
        "state",
        "effect",
        "external",
        "noise",
        "environment",
        "quantum",
        "chaology",
        "result",
        "could",
        "allow",
        "development",
        "dynamical",
        "theory",
        "quantum",
        "decoherence",
        "due",
        "interaction",
        "classical",
        "chaotic",
        "least",
        "nonintegrable",
        "system",
        "coherent",
        "quantum",
        "state",
        "producing",
        "incoherent",
        "mixture",
        "observed",
        "measurement",
        "device",
        "consideration",
        "lead",
        "u",
        "interacting",
        "system"
    ]
}