{
    "main_text": "Substances, Elements, and Chemical Combination || Aristotle’s Chemistry\n1.1 Aristotle’s Chemistry\n\nThe earliest conceptual analyses concerning matter and its\ntransformations come in the Aristotelian tradition. As in modern\nchemistry, the focus of Aristotle’s theories was the nature of\nsubstances and their transformations. He offered the first systematic\ntreatises of chemical theory in On Generation and Corruption\n(De Generatione et Corruptione), Meteorology, and\nparts of Physics and On the Heavens (De\nCaelo).\n\nAristotle recognized that most ordinary, material things are composed\nof multiple substances, although he thought that some of them could be\ncomposed of a single, pure substance. Thus, he needed to give a\ncriterion of purity that would individuate a single substance. His\ncriterion was that pure substances are homoeomerous: they are\ncomposed of like parts at every level. “[I]f combination has\ntaken place, the compound must be uniform—any part of\nsuch a compound is the same as the whole, just as any part of water is\nwater” (De Generatione et Corruptione,\nhenceforth DG, I.10,\n328a10ff).[1] So\nwhen we encounter diamond in rock, oil in water, or smoke in air,\nAristotelian chemistry tells us that there is more than one substance\npresent.\n\nLike some of his predecessors, Aristotle held that the elements Fire,\nWater, Air, and Earth were the building blocks of all substances. But\nunlike his predecessors, Aristotle established this list from\nfundamental principles. He argued that “it is impossible for the\nsame thing to be hot and cold, or moist and dry … Fire is hot\nand dry, whereas Air is hot and moist …; and Water is cold and\nmoist, while Earth is cold and dry” (DG II.3,\n330a30–330b5). Aristotle supposed hot and moist to be maximal\ndegrees of heat and humidity, and cold and dry to be minimal degrees.\nNon-elemental substances are characterized by intermediate degrees of\nthe primary qualities of warmth and humidity.\n\nAristotle used this elemental theory to account for many properties of\nsubstances. For example he distinguished between liquids and solids by\nnoting the different properties imposed by two characteristic\nproperties of elements, moist and dry. “[M]oist is that which,\nbeing readily adaptable in shape, is not determinable by any limit of\nits own; while dry is that which is readily determinable by its own\nlimit, but not readily adaptable in shape” (DG II.2,\n329b30f.). Solid bodies have a shape and volume of their own, liquids\nonly have a volume of their own. He further distinguished liquids from\ngases, which don’t even have their own volume. He reasoned that while\nwater and air are both fluid because they are moist, cold renders\nwater liquid and hot makes air gas. On the other hand, dry together\nwith cold makes earth solid, but together with hot we get fire.\n\nChemistry focuses on more than just the building blocks of substances:\nIt attempts to account for the transformations that change substances\ninto other kinds of substances. Aristotle also contributed the first\nimportant analyses of this process, distinguishing between\ntransmutation, where one substance overwhelms and eliminates\nanother and proper mixing. The former is closest to what we\nwould now call change of phase and the latter to what we would now\ncall chemical combination.\n\nAristotle thought that proper mixing could occur when substances of\ncomparable amounts are brought together to yield other substances\ncalled\n ‘compounds.’[2]\n Accordingly, the substances we typically encounter are compounds, and\nall compounds have the feature that there are some ingredients from\nwhich they could be made.\n\nWhat happens to the original ingredients when they are mixed together\nto form a compound? Like modern chemists, Aristotle argued that the\noriginal ingredients can, at least in principle, be obtained by\nfurther transformations. He presumably knew that salt and water can be\nobtained from sea water and metals can be obtained from alloys. But he\nexplains this with a conceptual argument, not a detailed list of\nobservations.\n\nAristotle first argues that heterogeneous mixtures can be\ndecomposed:\n\nObservation shows that even mixed bodies are often divisible into\nhomoeomerous parts; examples are flesh, bone, wood, and stone. Since\nthen the composite cannot be an element, not every homoeomerous body\ncan be an element; only, as we said before, that which is not\ndivisible into bodies different in form (De caelo, III.4,\n302b15–20).\n\n\nHe then goes on to offer an explicit definition of the concept of an\nelement in terms of simple bodies, specifically mentioning recovery in\nanalysis. \n\nAn element, we take it, is a body into which other bodies may be\nanalyzed, present in them potentially or in actuality (which of these\nis still disputable), and not itself divisible into bodies different\nin form. That, or something like it, is what all men in every case\nmean by element (De caelo, III.3, 302a15ff).\n\n\nThe notion of simplicity implicit here is introduced late in\nDG where in book II Aristotle claims that “All the\ncompound bodies … are composed of all the simple bodies”\n(334b31). But if all simple bodies (elements) are present in all\ncompounds, how are the various compounds distinguished? With an eye to\nmore recent chemistry, it is natural to think that the differing\ndegrees of the primary qualities of warmth and humidity that\ncharacterize different substances arise from mixing different\nproportions of the elements. Perhaps Aristotle makes a fleeting\nreference to this idea when he expresses the uniformity of a product\nof mixing by saying that “the part exhibit[s] the same ratio\nbetween its constituents as the whole” (DG I.10,\n328a8–9 and again at DG II.7, 334b15).\n\nBut what does “proportions of the elements” mean? The\ncontemporary laws of constant and multiple proportions deal with a\nconcept of elemental proportions understood on the basis of the\nconcept of mass. No such concept was available to Aristotle. The\nextant texts give little indication of how Aristotle might have\nunderstood the idea of elemental proportions, and we have to resort to\nspeculation (Needham 2009a).\n\nRegardless of how he understood elemental proportions, Aristotle was\nquite explicit that while recoverable, elements were not actually\npresent in compounds. In DG I.10 he argues that the original\ningredients are only potentially, and not actually, present in the\nresulting compounds of a mixing process.\n\nThere are two reasons why in Aristotle’s theory the elements are not\nactually present in compounds. The first concerns the manner in which\nmixing occurs. Mixing only occurs because of the primary powers and\nsusceptibilities of substances to affect and be affected by other\nsubstances. This implies that all of the original matter is\nchanged when a new compound is formed. Aristotle tells us\nthat compounds are formed when the opposing contraries are neutralized\nand an intermediate state results:\n\nsince there are differences in degree in hot and cold, … [when]\nboth by combining destroy one another’s excesses so that there exist\ninstead a hot which (for a hot) is cold and a cold which (for a cold)\nis hot; then there will exist … an intermediate. … It is\nthus, then, … that out of the elements there come-to-be flesh\nand bones and the like—the hot becoming cold and the cold\nbecoming hot when they have been brought to the mean. For at the mean\nis neither hot nor cold. The mean, however, is of considerable extent\nand not indivisible. Similarly, it is in virtue of a mean condition\nthat the dry and the moist and the rest produce flesh and bone and the\nremaining compounds. (DG II.7, 334b8–30)\n\n\nThe second reason has to do with the homogeneity requirement of pure\nsubstances. Aristotle tells us that “if combination has taken\nplace, the compound must be uniform—any part of such a\ncompound is the same as the whole, just as any part of water is\nwater” (DG I.10, 328a10f.). Since the elements are\ndefined in terms of the extremes of warmth and humidity, what has\nintermediate degrees of these qualities is not an element. Being\nhomogeneous, every part of a compound has the same intermediate\ndegrees of these qualities. Thus, there are no parts with extremal\nqualities, and hence no elements actually present. His theory of the\nappearance of new substances therefore implies that the elements are\nnot actually present in compounds.\n\nSo we reach an interesting theoretical impasse. Aristotle defined the\nelements by conditions they exhibit in isolation and argued that all\ncompounds are composed of the elements. However, the properties\nelements have in isolation are nothing that any part of an actually\nexisting compound could have. So how is it possible to recover the\nelements?\n\nIt is certainly not easy to understand what would induce a compound to\ndissociate into its elements on Aristotle’s theory, which seems\nentirely geared to showing how a stable equilibrium results from\nmixing. The overwhelming kind of mixing process doesn’t seem to be\napplicable. How, for example, could it explain the separation of salt\nand water from sea water? But the problem for the advocates of the\nactual presence of elements is to characterize them in terms of\nproperties exhibited in both isolated and combined states.\nThe general problem of adequately meeting this challenge, either in\ndefense of the potential presence or actual presence view, is the\nproblem of mixture (Cooper 2004; Fine 1995, Wood &\nWeisberg 2004).\n\nIn summary, Aristotle laid the philosophical groundwork for all\nsubsequent discussions of elements, pure substances, and chemical\ncombination. He asserted that all pure substances were homoeomerous\nand composed of the elements air, earth, fire, and water. These\nelements were not actually present in these substances; rather, the\nfour elements were potentially present. Their potential presence could\nbe revealed by further analysis and transformation.\n",
    "section_title": "1.1 Aristotle’s Chemistry",
    "entry_title": "Philosophy of Chemistry",
    "hierarchy_title": "Philosophy of Chemistry || Substances, Elements, and Chemical Combination || Aristotle’s Chemistry",
    "tokenized_text": [
        "substance",
        "element",
        "chemical",
        "combination",
        "aristotle",
        "chemistry",
        "aristotle",
        "chemistry",
        "earliest",
        "conceptual",
        "analysis",
        "concerning",
        "matter",
        "transformation",
        "come",
        "aristotelian",
        "tradition",
        "modern",
        "chemistry",
        "focus",
        "aristotle",
        "theory",
        "nature",
        "substance",
        "transformation",
        "offered",
        "first",
        "systematic",
        "treatise",
        "chemical",
        "theory",
        "generation",
        "corruption",
        "de",
        "generatione",
        "et",
        "corruptione",
        "meteorology",
        "part",
        "physic",
        "heaven",
        "de",
        "caelo",
        "aristotle",
        "recognized",
        "ordinary",
        "material",
        "thing",
        "composed",
        "multiple",
        "substance",
        "although",
        "thought",
        "could",
        "composed",
        "single",
        "pure",
        "substance",
        "thus",
        "needed",
        "give",
        "criterion",
        "purity",
        "would",
        "individuate",
        "single",
        "substance",
        "criterion",
        "pure",
        "substance",
        "homoeomerous",
        "composed",
        "like",
        "part",
        "every",
        "level",
        "f",
        "combination",
        "taken",
        "place",
        "compound",
        "must",
        "uniformany",
        "part",
        "compound",
        "whole",
        "part",
        "water",
        "water",
        "de",
        "generatione",
        "et",
        "corruptione",
        "henceforth",
        "dg",
        "i",
        "aff",
        "encounter",
        "diamond",
        "rock",
        "oil",
        "water",
        "smoke",
        "air",
        "aristotelian",
        "chemistry",
        "tell",
        "u",
        "one",
        "substance",
        "present",
        "like",
        "predecessor",
        "aristotle",
        "held",
        "element",
        "fire",
        "water",
        "air",
        "earth",
        "building",
        "block",
        "substance",
        "unlike",
        "predecessor",
        "aristotle",
        "established",
        "list",
        "fundamental",
        "principle",
        "argued",
        "impossible",
        "thing",
        "hot",
        "cold",
        "moist",
        "dry",
        "fire",
        "hot",
        "dry",
        "whereas",
        "air",
        "hot",
        "moist",
        "water",
        "cold",
        "moist",
        "earth",
        "cold",
        "dry",
        "dg",
        "ii",
        "ab",
        "aristotle",
        "supposed",
        "hot",
        "moist",
        "maximal",
        "degree",
        "heat",
        "humidity",
        "cold",
        "dry",
        "minimal",
        "degree",
        "nonelemental",
        "substance",
        "characterized",
        "intermediate",
        "degree",
        "primary",
        "quality",
        "warmth",
        "humidity",
        "aristotle",
        "used",
        "elemental",
        "theory",
        "account",
        "many",
        "property",
        "substance",
        "example",
        "distinguished",
        "liquid",
        "solid",
        "noting",
        "different",
        "property",
        "imposed",
        "two",
        "characteristic",
        "property",
        "element",
        "moist",
        "dry",
        "oist",
        "readily",
        "adaptable",
        "shape",
        "determinable",
        "limit",
        "dry",
        "readily",
        "determinable",
        "limit",
        "readily",
        "adaptable",
        "shape",
        "dg",
        "ii",
        "bf",
        "solid",
        "body",
        "shape",
        "volume",
        "liquid",
        "volume",
        "distinguished",
        "liquid",
        "gas",
        "even",
        "volume",
        "reasoned",
        "water",
        "air",
        "fluid",
        "moist",
        "cold",
        "render",
        "water",
        "liquid",
        "hot",
        "make",
        "air",
        "gas",
        "hand",
        "dry",
        "together",
        "cold",
        "make",
        "earth",
        "solid",
        "together",
        "hot",
        "get",
        "fire",
        "chemistry",
        "focus",
        "building",
        "block",
        "substance",
        "attempt",
        "account",
        "transformation",
        "change",
        "substance",
        "kind",
        "substance",
        "aristotle",
        "also",
        "contributed",
        "first",
        "important",
        "analysis",
        "process",
        "distinguishing",
        "transmutation",
        "one",
        "substance",
        "overwhelms",
        "eliminates",
        "another",
        "proper",
        "mixing",
        "former",
        "closest",
        "would",
        "call",
        "change",
        "phase",
        "latter",
        "would",
        "call",
        "chemical",
        "combination",
        "aristotle",
        "thought",
        "proper",
        "mixing",
        "could",
        "occur",
        "substance",
        "comparable",
        "amount",
        "brought",
        "together",
        "yield",
        "substance",
        "called",
        "compounds",
        "accordingly",
        "substance",
        "typically",
        "encounter",
        "compound",
        "compound",
        "feature",
        "ingredient",
        "could",
        "made",
        "happens",
        "original",
        "ingredient",
        "mixed",
        "together",
        "form",
        "compound",
        "like",
        "modern",
        "chemist",
        "aristotle",
        "argued",
        "original",
        "ingredient",
        "least",
        "principle",
        "obtained",
        "transformation",
        "presumably",
        "knew",
        "salt",
        "water",
        "obtained",
        "sea",
        "water",
        "metal",
        "obtained",
        "alloy",
        "explains",
        "conceptual",
        "argument",
        "detailed",
        "list",
        "observation",
        "aristotle",
        "first",
        "argues",
        "heterogeneous",
        "mixture",
        "decomposed",
        "observation",
        "show",
        "even",
        "mixed",
        "body",
        "often",
        "divisible",
        "homoeomerous",
        "part",
        "example",
        "flesh",
        "bone",
        "wood",
        "stone",
        "since",
        "composite",
        "element",
        "every",
        "homoeomerous",
        "body",
        "element",
        "said",
        "divisible",
        "body",
        "different",
        "form",
        "de",
        "caelo",
        "iii",
        "b",
        "go",
        "offer",
        "explicit",
        "definition",
        "concept",
        "element",
        "term",
        "simple",
        "body",
        "specifically",
        "mentioning",
        "recovery",
        "analysis",
        "element",
        "take",
        "body",
        "body",
        "may",
        "analyzed",
        "present",
        "potentially",
        "actuality",
        "still",
        "disputable",
        "divisible",
        "body",
        "different",
        "form",
        "something",
        "like",
        "men",
        "every",
        "case",
        "mean",
        "element",
        "de",
        "caelo",
        "iii",
        "aff",
        "notion",
        "simplicity",
        "implicit",
        "introduced",
        "late",
        "dg",
        "book",
        "ii",
        "aristotle",
        "claim",
        "compound",
        "body",
        "composed",
        "simple",
        "body",
        "b",
        "simple",
        "body",
        "element",
        "present",
        "compound",
        "various",
        "compound",
        "distinguished",
        "eye",
        "recent",
        "chemistry",
        "natural",
        "think",
        "differing",
        "degree",
        "primary",
        "quality",
        "warmth",
        "humidity",
        "characterize",
        "different",
        "substance",
        "arise",
        "mixing",
        "different",
        "proportion",
        "element",
        "perhaps",
        "aristotle",
        "make",
        "fleeting",
        "reference",
        "idea",
        "express",
        "uniformity",
        "product",
        "mixing",
        "saying",
        "part",
        "exhibit",
        "ratio",
        "constituent",
        "whole",
        "dg",
        "i",
        "a",
        "dg",
        "ii",
        "b",
        "proportion",
        "element",
        "mean",
        "contemporary",
        "law",
        "constant",
        "multiple",
        "proportion",
        "deal",
        "concept",
        "elemental",
        "proportion",
        "understood",
        "basis",
        "concept",
        "mass",
        "concept",
        "available",
        "aristotle",
        "extant",
        "text",
        "give",
        "little",
        "indication",
        "aristotle",
        "might",
        "understood",
        "idea",
        "elemental",
        "proportion",
        "resort",
        "speculation",
        "needham",
        "a",
        "regardless",
        "understood",
        "elemental",
        "proportion",
        "aristotle",
        "quite",
        "explicit",
        "recoverable",
        "element",
        "actually",
        "present",
        "compound",
        "dg",
        "i",
        "argues",
        "original",
        "ingredient",
        "potentially",
        "actually",
        "present",
        "resulting",
        "compound",
        "mixing",
        "process",
        "two",
        "reason",
        "aristotle",
        "theory",
        "element",
        "actually",
        "present",
        "compound",
        "first",
        "concern",
        "manner",
        "mixing",
        "occurs",
        "mixing",
        "occurs",
        "primary",
        "power",
        "susceptibility",
        "substance",
        "affect",
        "affected",
        "substance",
        "implies",
        "original",
        "matter",
        "changed",
        "new",
        "compound",
        "formed",
        "aristotle",
        "tell",
        "u",
        "compound",
        "formed",
        "opposing",
        "contrary",
        "neutralized",
        "intermediate",
        "state",
        "result",
        "since",
        "difference",
        "degree",
        "hot",
        "cold",
        "combining",
        "destroy",
        "one",
        "another",
        "excess",
        "exist",
        "instead",
        "hot",
        "hot",
        "cold",
        "cold",
        "cold",
        "hot",
        "exist",
        "intermediate",
        "thus",
        "element",
        "cometobe",
        "flesh",
        "bone",
        "likethe",
        "hot",
        "becoming",
        "cold",
        "cold",
        "becoming",
        "hot",
        "brought",
        "mean",
        "mean",
        "neither",
        "hot",
        "cold",
        "mean",
        "however",
        "considerable",
        "extent",
        "indivisible",
        "similarly",
        "virtue",
        "mean",
        "condition",
        "dry",
        "moist",
        "rest",
        "produce",
        "flesh",
        "bone",
        "remaining",
        "compound",
        "dg",
        "ii",
        "b",
        "second",
        "reason",
        "homogeneity",
        "requirement",
        "pure",
        "substance",
        "aristotle",
        "tell",
        "u",
        "combination",
        "taken",
        "place",
        "compound",
        "must",
        "uniformany",
        "part",
        "compound",
        "whole",
        "part",
        "water",
        "water",
        "dg",
        "i",
        "af",
        "since",
        "element",
        "defined",
        "term",
        "extreme",
        "warmth",
        "humidity",
        "intermediate",
        "degree",
        "quality",
        "element",
        "homogeneous",
        "every",
        "part",
        "compound",
        "intermediate",
        "degree",
        "quality",
        "thus",
        "part",
        "extremal",
        "quality",
        "hence",
        "element",
        "actually",
        "present",
        "theory",
        "appearance",
        "new",
        "substance",
        "therefore",
        "implies",
        "element",
        "actually",
        "present",
        "compound",
        "reach",
        "interesting",
        "theoretical",
        "impasse",
        "aristotle",
        "defined",
        "element",
        "condition",
        "exhibit",
        "isolation",
        "argued",
        "compound",
        "composed",
        "element",
        "however",
        "property",
        "element",
        "isolation",
        "nothing",
        "part",
        "actually",
        "existing",
        "compound",
        "could",
        "possible",
        "recover",
        "element",
        "certainly",
        "easy",
        "understand",
        "would",
        "induce",
        "compound",
        "dissociate",
        "element",
        "aristotle",
        "theory",
        "seems",
        "entirely",
        "geared",
        "showing",
        "stable",
        "equilibrium",
        "result",
        "mixing",
        "overwhelming",
        "kind",
        "mixing",
        "process",
        "seem",
        "applicable",
        "example",
        "could",
        "explain",
        "separation",
        "salt",
        "water",
        "sea",
        "water",
        "problem",
        "advocate",
        "actual",
        "presence",
        "element",
        "characterize",
        "term",
        "property",
        "exhibited",
        "isolated",
        "combined",
        "state",
        "general",
        "problem",
        "adequately",
        "meeting",
        "challenge",
        "either",
        "defense",
        "potential",
        "presence",
        "actual",
        "presence",
        "view",
        "problem",
        "mixture",
        "cooper",
        "fine",
        "wood",
        "weisberg",
        "summary",
        "aristotle",
        "laid",
        "philosophical",
        "groundwork",
        "subsequent",
        "discussion",
        "element",
        "pure",
        "substance",
        "chemical",
        "combination",
        "asserted",
        "pure",
        "substance",
        "homoeomerous",
        "composed",
        "element",
        "air",
        "earth",
        "fire",
        "water",
        "element",
        "actually",
        "present",
        "substance",
        "rather",
        "four",
        "element",
        "potentially",
        "present",
        "potential",
        "presence",
        "could",
        "revealed",
        "analysis",
        "transformation"
    ]
}