{
    "main_text": "Structure in Chemistry || The Structural Conception of Bonding and its Challenges\n4.3 The Structural Conception of Bonding and its Challenges\n\nThe new philosophical literature about the chemical bond begins with\nthe structural conception of chemical bonding (Hendry 2008).\nOn the structural conception, chemical bonds are sub-molecular,\nmaterial parts of molecules, which are localized between individual\natomic centers and are responsible for holding the molecule together.\nThis is the notion of the chemical bond that arose at the end of the\n19th century, which continues to inform the practice of\nsynthetic and analytical chemistry. But is the structural conception\nof bonding correct? Several distinct challenges have been raised in\nthe philosophical literature.\n\nThe first challenge comes from the incompatibility between the\nontology of quantum mechanics and the apparent ontology of the\nchemical bonds. Electrons cannot be distinguished in principle\n (Identity and Individuality in Quantum Theory)\n and hence quantum mechanical descriptions of bonds cannot depend on\nthe identity of particular electrons. If we interpret the structural\nconception of bonding in a Lewis-like fashion, where bonds are\ncomposed of specific pairs of electrons donated by particular atoms,\nwe can see that this picture is incompatible with quantum mechanics. A\nrelated objection notes that both experimental and theoretical\nevidence suggest that electrons are delocalized,\n“smeared out” over whole molecules. Quantum mechanics\ntells us not to expect pairs of electrons to be localized between\nbonded atoms. Furthermore, Mulliken argued that pairing was\nunnecessary for covalent bond formation. Electrons in a hydrogen\nmolecule “are more firmly bound when they have two hydrogen\nnuclei to run around than when each has only one. The fact that two\nelectrons become paired … seems to be largely incidental”\n(1931, p. 360). Later authors point to the stability of the\nH2+ ion in support of this contention.\n\nDefenders of the structural conception of bonding respond to these\nchallenges by noting that G.N. Lewis’ particular structural account\nisn’t the only possible one. While bonds on the structural conception\nmust be sub-molecular and directional, they need not be electron\npairs. Responding specifically to the challenge from quantum ontology,\nthey argue that bonds should be individuated by the atomic centers\nthey link, not by the electrons. Insofar as electrons participate\nphysically in the bond, they do so not as individuals. All of the\nelectrons are associated with the whole molecule, but portions of the\nelectron density can be localized. To the objection from\ndelocalization, they argue that all the structural account requires is\nthat some part of the total electron density of the molecule\nis responsible for the features associated with the bond and there\nneed be no assumption that it is localized directly between the atoms\nas in Lewis’ model (Hendry 2008, 2010b).\n\nA second challenge to the structural conception of bonding comes from\ncomputational chemistry, the application of quantum mechanics to make\npredictions about chemical phenomena. Drawing on the work of quantum\nchemist Charles Coulson (1910–1974), Weisberg (2008) has argued\nthat the structural conception of chemical bonding is not robust in\nquantum chemistry. This argument looks to the history of quantum\nmechanical models of molecular structure. In the earliest quantum\nmechanical models, something very much like the structural conception\nof bonding was preserved; electron density was, for the most part,\nlocalized between atomic centers and was responsible for holding\nmolecules together. However, these early models made empirical\npredictions about bond energies and bond lengths that were only in\nqualitative accord with experiment.\n\nSubsequent models of molecular structure yielded much better agreement\nwith experiment when electron density was “allowed” to\nleave the area between the atoms and delocalize throughout the\nmolecule. As the models were further improved, bonding came to be seen\nas a whole-molecule, not sub-molecular, phenomenon. Weisberg argues\nthat such considerations should lead us to reject the structural\nconception of bonding and replace it with a molecule-wide conception.\nOne possibility is the energetic conception of bonding that\nsays that bonding is the energetic stabilization of molecules.\nStrictly speaking, according to this view, chemical bonds do not\nexist; bonding is real, bonds are not (Weisberg 2008; also see\nCoulson 1952, 1960).\n\nThe challenges to the structural view of bonding have engendered\nseveral responses in the philosophical and chemical literatures. The\nfirst appeals to chemical practice: Chemists engaged in synthetic and\nanalytic activities rely on the structural conception of bonding.\nThere are well over 100,000,000 compounds that have been discovered or\nsynthesized, all of which have been formally characterized. How can\nthis success be explained if a central chemical concept such as the\nstructural conception of the bond does not pick out anything real in\nnature?  Throughout his life, Linus Pauling\n(1901–1994) defended this view.\n\nAnother line of objection comes from Berson (2008), who discusses the\nsignificance of very weakly bonded molecules. For example, there are\nfour structural isomers of 2-methylenecyclopentane-1,3-diyl. The most\nstable of the structures does not correspond to a normal bonding\ninteraction because of an unusually stable singlet state, a state\nwhere the electron spins are parallel. Berson suggests that this is a\ncase where “the formation of a bond actually produces a\ndestabilized molecule.” In other words, the energetic conception\nbreaks down because bonding and molecule-wide stabilization come\napart.\n\nFinally, the “Atoms in Molecules” program (Bader 1991;\nsee Gillespie and Popelier 2001, Chs. 6 & 7 for an exposition)\nsuggests that we can hold on to the structural conception of the bond\nunderstood functionally, but reject Lewis’ ideas about how electrons\nrealize this relationship. Bader, for example, argues that we can\ndefine ‘bond paths’ in terms of topological features of\nthe molecule-wide electron density. Such bond paths have physical\nlocations, and generally correspond closely to classical covalent\nbonds. Moreover they partially vindicate the idea that bonding\ninvolves an increase in electron density between atoms: a bond path is\nan axis of maximal electron density (leaving a bond path in a\ndirection perpendicular to it involves a decrease in electron\ndensity). There are also many technical advantages to this approach.\nMolecule-wide electron density exists within the ontology of quantum\nmechanics, so no quantum-mechanical model could exclude it. Further,\nelectron density is considerably easier to calculate than other\nquantum mechanical properties, and it can be measured empirically\nusing X-ray diffraction techniques.\n\n\nFigure 5. Too many bonds? 60 bond paths from each carbon atom in\nC60 to a trapped Ar atom in the interior.\n\n\nUnfortunately, Bader’s approach does not necessarily save the day for\nthe structural conception of the bond. His critics point out that his\naccount is extremely permissive and puts bond paths in places that\nseem chemically suspect. For example, his account says that when you\ntake the soccer-ball shaped buckminster fullerene molecule\n(C60) and trap an argon atom inside it, there are 60 bonds\nbetween the carbon atoms and the argon atom as depicted in Figure 5\n(Cerpa et al. 2008). Most chemists would think this implausible\nbecause one of the most basic principles of chemical combination is\nthe fact that argon almost never forms bonds (see Bader 2009 for a\nresponse).\n\nA generally acknowledged problem for the delocalized account is the\nlack of what chemists call transferability. Central to the structural\nview, as we saw, is the occurrence of functional groups common to\ndifferent substances. Alcohols, for example, are characterized by\nhaving the hydroxyl OH group in common. This is reflected in the\nstrong infra red absorption at 3600cm–1 being taken\nas a tell-tale sign of the OH group. But ab initio QM treatments just\nsee different problems posed by different numbers of electrons, and\nfail to reflect that there are parts of a molecular structure, such as\nan OH group, which are transferable from one molecule to another, and\nwhich they may have in common (Woody 2000, 2012).\n\nA further issue is the detailed understanding of the cause of chemical\nbonding. For many years, the dominant view, based on the\nHellman-Feynman theorem, has been that it is essentially an\nelectrostatic attraction between positive nuclei and negative electron\nclouds (Feynman 1939). But an alternative, originally suggested by\nHellman and developed by Rüdenberg, has recently come into\nprominence. This emphasizes the quantum mechanical analogue of the\nkinetic energy (Needham 2014). Contemporary accounts may draw on a\nnumber of subtle quantum mechanical features. But these details\nshouldn’t obscure the overriding thermodynamic principle governing\nthe formation of stable compounds by chemical reaction. As Atkins puts\nit,\n\nAlthough … the substances involved have dropped to a lower\nenergy, this is not the reason why the reaction takes place. Overall\nthe energy of the Universe remains constant; … All that has\nhappened is that some initially localized energy has dispersed.\nThat is the cause of chemical change: in chemistry as in physics,\nthe driving force of natural change is the chaotic, purposeless,\nundirected dispersal of energy. (Atkins 1994, p. 112)\n\n\nThe difficulties faced by this and every other model of bonding have\nled a number of chemists and philosophers to argue for pluralism.\nQuantum chemist Roald Hoffmann writes “A bond will be a bond by\nsome criteria and not by others … have fun with the concept and\nspare us the hype” (Hoffmann 2009, Other Internet Resources).\n",
    "section_title": "4.3 The Structural Conception of Bonding and its Challenges",
    "entry_title": "Philosophy of Chemistry",
    "hierarchy_title": "Philosophy of Chemistry || Structure in Chemistry || The Structural Conception of Bonding and its Challenges",
    "tokenized_text": [
        "structure",
        "chemistry",
        "structural",
        "conception",
        "bonding",
        "challenge",
        "structural",
        "conception",
        "bonding",
        "challenge",
        "new",
        "philosophical",
        "literature",
        "chemical",
        "bond",
        "begin",
        "structural",
        "conception",
        "chemical",
        "bonding",
        "hendry",
        "structural",
        "conception",
        "chemical",
        "bond",
        "submolecular",
        "material",
        "part",
        "molecule",
        "localized",
        "individual",
        "atomic",
        "center",
        "responsible",
        "holding",
        "molecule",
        "together",
        "notion",
        "chemical",
        "bond",
        "arose",
        "end",
        "th",
        "century",
        "continues",
        "inform",
        "practice",
        "synthetic",
        "analytical",
        "chemistry",
        "structural",
        "conception",
        "bonding",
        "correct",
        "several",
        "distinct",
        "challenge",
        "raised",
        "philosophical",
        "literature",
        "first",
        "challenge",
        "come",
        "incompatibility",
        "ontology",
        "quantum",
        "mechanic",
        "apparent",
        "ontology",
        "chemical",
        "bond",
        "electron",
        "distinguished",
        "principle",
        "identity",
        "individuality",
        "quantum",
        "theory",
        "hence",
        "quantum",
        "mechanical",
        "description",
        "bond",
        "depend",
        "identity",
        "particular",
        "electron",
        "interpret",
        "structural",
        "conception",
        "bonding",
        "lewislike",
        "fashion",
        "bond",
        "composed",
        "specific",
        "pair",
        "electron",
        "donated",
        "particular",
        "atom",
        "see",
        "picture",
        "incompatible",
        "quantum",
        "mechanic",
        "related",
        "objection",
        "note",
        "experimental",
        "theoretical",
        "evidence",
        "suggest",
        "electron",
        "delocalized",
        "smeared",
        "whole",
        "molecule",
        "quantum",
        "mechanic",
        "tell",
        "u",
        "expect",
        "pair",
        "electron",
        "localized",
        "bonded",
        "atom",
        "furthermore",
        "mulliken",
        "argued",
        "pairing",
        "unnecessary",
        "covalent",
        "bond",
        "formation",
        "electron",
        "hydrogen",
        "molecule",
        "firmly",
        "bound",
        "two",
        "hydrogen",
        "nucleus",
        "run",
        "around",
        "one",
        "fact",
        "two",
        "electron",
        "become",
        "paired",
        "seems",
        "largely",
        "incidental",
        "p",
        "later",
        "author",
        "point",
        "stability",
        "h",
        "ion",
        "support",
        "contention",
        "defender",
        "structural",
        "conception",
        "bonding",
        "respond",
        "challenge",
        "noting",
        "gn",
        "lewis",
        "particular",
        "structural",
        "account",
        "possible",
        "one",
        "bond",
        "structural",
        "conception",
        "must",
        "submolecular",
        "directional",
        "need",
        "electron",
        "pair",
        "responding",
        "specifically",
        "challenge",
        "quantum",
        "ontology",
        "argue",
        "bond",
        "individuated",
        "atomic",
        "center",
        "link",
        "electron",
        "insofar",
        "electron",
        "participate",
        "physically",
        "bond",
        "individual",
        "electron",
        "associated",
        "whole",
        "molecule",
        "portion",
        "electron",
        "density",
        "localized",
        "objection",
        "delocalization",
        "argue",
        "structural",
        "account",
        "requires",
        "part",
        "total",
        "electron",
        "density",
        "molecule",
        "responsible",
        "feature",
        "associated",
        "bond",
        "need",
        "assumption",
        "localized",
        "directly",
        "atom",
        "lewis",
        "model",
        "hendry",
        "b",
        "second",
        "challenge",
        "structural",
        "conception",
        "bonding",
        "come",
        "computational",
        "chemistry",
        "application",
        "quantum",
        "mechanic",
        "make",
        "prediction",
        "chemical",
        "phenomenon",
        "drawing",
        "work",
        "quantum",
        "chemist",
        "charles",
        "coulson",
        "weisberg",
        "argued",
        "structural",
        "conception",
        "chemical",
        "bonding",
        "robust",
        "quantum",
        "chemistry",
        "argument",
        "look",
        "history",
        "quantum",
        "mechanical",
        "model",
        "molecular",
        "structure",
        "earliest",
        "quantum",
        "mechanical",
        "model",
        "something",
        "much",
        "like",
        "structural",
        "conception",
        "bonding",
        "preserved",
        "electron",
        "density",
        "part",
        "localized",
        "atomic",
        "center",
        "responsible",
        "holding",
        "molecule",
        "together",
        "however",
        "early",
        "model",
        "made",
        "empirical",
        "prediction",
        "bond",
        "energy",
        "bond",
        "length",
        "qualitative",
        "accord",
        "experiment",
        "subsequent",
        "model",
        "molecular",
        "structure",
        "yielded",
        "much",
        "better",
        "agreement",
        "experiment",
        "electron",
        "density",
        "allowed",
        "leave",
        "area",
        "atom",
        "delocalize",
        "throughout",
        "molecule",
        "model",
        "improved",
        "bonding",
        "came",
        "seen",
        "wholemolecule",
        "submolecular",
        "phenomenon",
        "weisberg",
        "argues",
        "consideration",
        "lead",
        "u",
        "reject",
        "structural",
        "conception",
        "bonding",
        "replace",
        "moleculewide",
        "conception",
        "one",
        "possibility",
        "energetic",
        "conception",
        "bonding",
        "say",
        "bonding",
        "energetic",
        "stabilization",
        "molecule",
        "strictly",
        "speaking",
        "according",
        "view",
        "chemical",
        "bond",
        "exist",
        "bonding",
        "real",
        "bond",
        "weisberg",
        "also",
        "see",
        "coulson",
        "challenge",
        "structural",
        "view",
        "bonding",
        "engendered",
        "several",
        "response",
        "philosophical",
        "chemical",
        "literature",
        "first",
        "appeal",
        "chemical",
        "practice",
        "chemist",
        "engaged",
        "synthetic",
        "analytic",
        "activity",
        "rely",
        "structural",
        "conception",
        "bonding",
        "well",
        "compound",
        "discovered",
        "synthesized",
        "formally",
        "characterized",
        "success",
        "explained",
        "central",
        "chemical",
        "concept",
        "structural",
        "conception",
        "bond",
        "pick",
        "anything",
        "real",
        "nature",
        "throughout",
        "life",
        "linus",
        "pauling",
        "defended",
        "view",
        "another",
        "line",
        "objection",
        "come",
        "berson",
        "discus",
        "significance",
        "weakly",
        "bonded",
        "molecule",
        "example",
        "four",
        "structural",
        "isomer",
        "methylenecyclopentanediyl",
        "stable",
        "structure",
        "correspond",
        "normal",
        "bonding",
        "interaction",
        "unusually",
        "stable",
        "singlet",
        "state",
        "state",
        "electron",
        "spin",
        "parallel",
        "berson",
        "suggests",
        "case",
        "formation",
        "bond",
        "actually",
        "produce",
        "destabilized",
        "molecule",
        "word",
        "energetic",
        "conception",
        "break",
        "bonding",
        "moleculewide",
        "stabilization",
        "come",
        "apart",
        "finally",
        "atom",
        "molecule",
        "program",
        "bader",
        "see",
        "gillespie",
        "popelier",
        "chs",
        "exposition",
        "suggests",
        "hold",
        "structural",
        "conception",
        "bond",
        "understood",
        "functionally",
        "reject",
        "lewis",
        "idea",
        "electron",
        "realize",
        "relationship",
        "bader",
        "example",
        "argues",
        "define",
        "bond",
        "path",
        "term",
        "topological",
        "feature",
        "moleculewide",
        "electron",
        "density",
        "bond",
        "path",
        "physical",
        "location",
        "generally",
        "correspond",
        "closely",
        "classical",
        "covalent",
        "bond",
        "moreover",
        "partially",
        "vindicate",
        "idea",
        "bonding",
        "involves",
        "increase",
        "electron",
        "density",
        "atom",
        "bond",
        "path",
        "axis",
        "maximal",
        "electron",
        "density",
        "leaving",
        "bond",
        "path",
        "direction",
        "perpendicular",
        "involves",
        "decrease",
        "electron",
        "density",
        "also",
        "many",
        "technical",
        "advantage",
        "approach",
        "moleculewide",
        "electron",
        "density",
        "exists",
        "within",
        "ontology",
        "quantum",
        "mechanic",
        "quantummechanical",
        "model",
        "could",
        "exclude",
        "electron",
        "density",
        "considerably",
        "easier",
        "calculate",
        "quantum",
        "mechanical",
        "property",
        "measured",
        "empirically",
        "using",
        "xray",
        "diffraction",
        "technique",
        "figure",
        "many",
        "bond",
        "bond",
        "path",
        "carbon",
        "atom",
        "c",
        "trapped",
        "ar",
        "atom",
        "interior",
        "unfortunately",
        "bader",
        "approach",
        "necessarily",
        "save",
        "day",
        "structural",
        "conception",
        "bond",
        "critic",
        "point",
        "account",
        "extremely",
        "permissive",
        "put",
        "bond",
        "path",
        "place",
        "seem",
        "chemically",
        "suspect",
        "example",
        "account",
        "say",
        "take",
        "soccerball",
        "shaped",
        "buckminster",
        "fullerene",
        "molecule",
        "c",
        "trap",
        "argon",
        "atom",
        "inside",
        "bond",
        "carbon",
        "atom",
        "argon",
        "atom",
        "depicted",
        "figure",
        "cerpa",
        "et",
        "al",
        "chemist",
        "would",
        "think",
        "implausible",
        "one",
        "basic",
        "principle",
        "chemical",
        "combination",
        "fact",
        "argon",
        "almost",
        "never",
        "form",
        "bond",
        "see",
        "bader",
        "response",
        "generally",
        "acknowledged",
        "problem",
        "delocalized",
        "account",
        "lack",
        "chemist",
        "call",
        "transferability",
        "central",
        "structural",
        "view",
        "saw",
        "occurrence",
        "functional",
        "group",
        "common",
        "different",
        "substance",
        "alcohol",
        "example",
        "characterized",
        "hydroxyl",
        "oh",
        "group",
        "common",
        "reflected",
        "strong",
        "infra",
        "red",
        "absorption",
        "cm",
        "taken",
        "telltale",
        "sign",
        "oh",
        "group",
        "ab",
        "initio",
        "qm",
        "treatment",
        "see",
        "different",
        "problem",
        "posed",
        "different",
        "number",
        "electron",
        "fail",
        "reflect",
        "part",
        "molecular",
        "structure",
        "oh",
        "group",
        "transferable",
        "one",
        "molecule",
        "another",
        "may",
        "common",
        "woody",
        "issue",
        "detailed",
        "understanding",
        "cause",
        "chemical",
        "bonding",
        "many",
        "year",
        "dominant",
        "view",
        "based",
        "hellmanfeynman",
        "theorem",
        "essentially",
        "electrostatic",
        "attraction",
        "positive",
        "nucleus",
        "negative",
        "electron",
        "cloud",
        "feynman",
        "alternative",
        "originally",
        "suggested",
        "hellman",
        "developed",
        "rüdenberg",
        "recently",
        "come",
        "prominence",
        "emphasizes",
        "quantum",
        "mechanical",
        "analogue",
        "kinetic",
        "energy",
        "needham",
        "contemporary",
        "account",
        "may",
        "draw",
        "number",
        "subtle",
        "quantum",
        "mechanical",
        "feature",
        "detail",
        "obscure",
        "overriding",
        "thermodynamic",
        "principle",
        "governing",
        "formation",
        "stable",
        "compound",
        "chemical",
        "reaction",
        "atkins",
        "put",
        "although",
        "substance",
        "involved",
        "dropped",
        "lower",
        "energy",
        "reason",
        "reaction",
        "take",
        "place",
        "overall",
        "energy",
        "universe",
        "remains",
        "constant",
        "happened",
        "initially",
        "localized",
        "energy",
        "dispersed",
        "cause",
        "chemical",
        "change",
        "chemistry",
        "physic",
        "driving",
        "force",
        "natural",
        "change",
        "chaotic",
        "purposeless",
        "undirected",
        "dispersal",
        "energy",
        "atkins",
        "p",
        "difficulty",
        "faced",
        "every",
        "model",
        "bonding",
        "led",
        "number",
        "chemist",
        "philosopher",
        "argue",
        "pluralism",
        "quantum",
        "chemist",
        "roald",
        "hoffmann",
        "writes",
        "bond",
        "bond",
        "criterion",
        "others",
        "fun",
        "concept",
        "spare",
        "u",
        "hype",
        "hoffmann",
        "internet",
        "resource"
    ]
}