{
    "main_text": "Atomism || Atomic Realism in Contemporary Chemistry\n2.2 Atomic Realism in Contemporary Chemistry\n\nContemporary textbooks typically locate discussions of chemical\natomism in the 19th century work of John Dalton\n(1766–1844). Boyle’s ambitions of reducing elemental minima to\nstructured constellations of mechanical atoms had been abandoned by\nthis time, and Dalton’s theory simply assumes that each element has\nsmallest parts of characteristic size and mass which have the property\nof being of that elemental kind. Lavoisier’s elements\nare considered to be collections of such characteristic atoms. Dalton\nargued that this atomic hypothesis explained the law of constant\nproportions (see section 1.5).\n\nDalton’s theory gives expression to the idea of the real presence of\nelements in compounds. He believed that atoms survive chemical change,\nwhich underwrites the claim that elements are actually present in\ncompounds. He assumed that atoms of the same element are alike in\ntheir weight. On the assumption that atoms combine with the atoms of\nother elements in fixed ratios, Dalton claimed to explain why, when\nelements combine, they do so with fixed proportions between their\nweights. He also introduced the law of multiple proportions,\naccording to which the elements in distinct compounds of the same\nelements stand in simple proportions. He argued that this principle\nwas also explained by his atomic theory.\n\nDalton’s theory divided the chemical community and while he had many\nsupporters, a considerable number of chemists remained anti-atomistic.\nPart of the reason for this was controversy surrounding the empirical\napplication of Dalton’s atomic theory: How should one estimate atomic\nweights since atoms were such small quantities of matter? Daltonians\nargued that although such tiny quantities could not be measured\nabsolutely, they could be measured relative to a reference atom (the\nnatural choice being hydrogen as 1). This still left a problem in\nsetting the ratio between the weights of different atoms in compounds.\nDalton assumed that, if only one compound of two elements is known, it\nshould be assumed that they combine in equal proportions. Thus, he\nunderstood water, for instance, as though it would have been\nrepresented by HO in terms of the formulas that Berzelius was to\nintroduce (Berzelius, 1813). But Dalton’s response to this problem\nseemed arbitrary. Finding a more natural solution became pressing\nduring the first half of the nineteenth century as more and more\nelements were being discovered, and the elemental compositions of more\nand more chemical substances were being determined qualitatively\n(Duhem 2002; Needham 2004; Chalmers 2005a, 2005b, and 2008).\n\nDalton’s contemporaries raised other objections as well. Jacob\nBerzelius (1779–1848) argued that Daltonian atomism provided no\nexplanation of chemical combination, how elements hold together to\nform compounds (Berzelius, 1815). Since his atoms are intrinsically\nunchanging, they can suffer no modification of the kind Aristotle\nthought necessary for combination to occur. Lacking anything like the\nmodern idea of a molecule, Dalton was forced to explain chemical\ncombination in terms of atomic packing. He endowed his atoms with\natmospheres of caloric whose mutual repulsion was supposed to explain\nhow atoms pack together efficiently. But few were persuaded by this\nidea, and what came later to be known as Daltonian atomism abandoned\nthe idea of caloric shells altogether.\n\nThe situation was made more complex when chemists realized that\nelemental composition was not in general sufficient to distinguish\nsubstances. Dalton was aware that the same elements sometimes give\nrise to several compounds; there are several oxides of nitrogen, for\nexample. But given the law of constant proportions, these can be\ndistinguished by specifying the combining proportions, which is what\nis represented by distinct chemical formulas, for example\nN2O, NO and N2O3 for different oxides\nof nitrogen. However, as more organic compounds were isolated and\nanalyzed, it became clear that elemental composition doesn’t uniquely\ndistinguish substances. Distinct compounds with the same elemental\ncomposition are called isomers. The term was coined by\nBerzelius in 1832 when organic compounds with the same composition,\nbut different properties, were first recognized. It was later\ndiscovered that isomerism is ubiquitous, and not confined to organic\ncompounds.\n\nIsomers may differ radically in “physical” properties such\nas melting points and boiling points as well as patterns of chemical\nreactivity. This is the case with dimethyl ether and ethyl alcohol,\nwhich have the compositional formula\nC2H6O in common, but are represented by two\ndistinct structural formulas: (CH3)2O\nand C2H5OH. These formulas identify different\nfunctional groups, which govern patterns of chemical\nreactivity. The notion of a structural formula was developed to\naccommodate other isomers that are even more similar. This was the\ncase with a subgroup of stereoisomers called optical\nisomers, which are alike in many of their physical properties such as\nmelting points and boiling points and (when first discovered) seemed\nto be alike in chemical reactivity too. Pasteur famously separated\nenantiomers (stereoisomers of one another) of tartaric acid\nby preparing a solution of the sodium ammonium salt and allowing\nrelatively large crystals to form by slow evaporation. Using tweezers,\nhe assembled the crystals into two piles, members of the one having\nshapes which are mirror images of the shapes of those in the other\npile. Optical isomers are so called because they have the\ndistinguishing feature of rotating the plane of plane polarized light\nin opposite directions, a phenomenon first observed in quartz crystals\nat the beginning of the 19th century. These isomers are\nrepresented by three-dimensional structural formulas which are mirror\nimages of one another as we show in Figure 2.\n\n\nFigure 2.\nThe enantiomers of tartaric acid. D-tartaric acid is on the\nleft and L-tartaric acid is on the right. The dotted vertical line\nrepresents a mirror plane. The solid wedges represent bonds coming out\nof the plane, while the dashed wedges represent bonds going behind the\nplane. These molecular structures are mirror images of one another.\n\n\nAlthough these discoveries are often presented as having been\nexplained by the atomic or molecular hypothesis, skepticism about the\nstatus of atomism persisted throughout the 19th century. Late 19th\ncentury skeptics such as Ernst Mach, Georg Helm, Wilhelm Ostwald, and\nPierre Duhem did not see atomism as an adequate explanation of these\nphenomena, nor did they believe that there was sufficient evidence to\naccept the existence of atoms. Instead, they advocated non-atomistic\ntheories of chemical change grounded in thermodynamics (on Helm and\nOstwald, see the introduction to Deltete 2000).\n\nDuhem’s objections to atomism are particularly instructive. Despite\nbeing represented as a positivist in some literature (e.g. Fox 1971),\nhis objections to atomism in chemistry made no appeal to the\nunobservability of atoms. Instead, he argued that a molecule was a\ntheoretical impossibility according to 19th century physics, which\ncould say nothing about how atoms can hold together but could give\nmany reasons why they couldn’t be stable entities over reasonable\nperiods of time. He also argued that the notion of valency attributed\nto atoms to explain their combining power was simply a macroscopic\ncharacterization projected into the microscopic level. He showed that\nchemical formulae could be interpreted without resorting to atoms and\nthe notion of valency could be defined on this basis (Duhem 1892,\n1902; for an exposition, see Needham 1996). Atomists failed to meet\nthis challenge, and he criticized them for not saying what the\nfeatures of their atoms were beyond simply reading into them\nproperties defined on a macroscopic basis (Needham 2004). Duhem did\nrecognize that an atomic theory was developed in the 19th\ncentury, the vortex theory (Kragh 2002), but rejected it as\ninadequate for explaining chemical phenomena.\n\nSkeptics about atomism finally became convinced at the beginning of\nthe 20th century by careful experimental and theoretical\nwork on Brownian motion, the fluctuation of particles in an\nemulsion. With the development of kinetic theory it was suspected that\nthis motion was due to invisible particles within the emulsion pushing\nthe visible particles. But it wasn’t until the first decade of the\n20th century that Einstein’s theoretical analysis and Perrin’s\nexperimental work gave substance to those suspicions and provided an\nestimate of Avogadro’s number, which Perrin famously argued was\nsubstantially correct because it agreed with determinations made by\nseveral other, independent, methods. This was the decisive argument\nfor the existence of microentities which led most of those still\nskeptical of the atomic hypotheses to change their views (Einstein\n1905; Perrin 1913; Nye 1972; Maiocchi 1990).\n\nIt is important to appreciate, however, that establishing the\nexistence of atoms in this way left many of the questions raised by\nthe skeptics unanswered. A theory of the nature of atoms which would\nexplain how they can combine to form molecules was yet to be\nformulated. And it remains to this day an open question whether a\npurely microscopic theory is available which is adequate to explain\nthe whole range of chemical phenomena. This issue is pursued in\nSection 6 where we discuss reduction.\n",
    "section_title": "2.2 Atomic Realism in Contemporary Chemistry",
    "entry_title": "Philosophy of Chemistry",
    "hierarchy_title": "Philosophy of Chemistry || Atomism || Atomic Realism in Contemporary Chemistry",
    "tokenized_text": [
        "atomism",
        "atomic",
        "realism",
        "contemporary",
        "chemistry",
        "atomic",
        "realism",
        "contemporary",
        "chemistry",
        "contemporary",
        "textbook",
        "typically",
        "locate",
        "discussion",
        "chemical",
        "atomism",
        "th",
        "century",
        "work",
        "john",
        "dalton",
        "boyle",
        "ambition",
        "reducing",
        "elemental",
        "minimum",
        "structured",
        "constellation",
        "mechanical",
        "atom",
        "abandoned",
        "time",
        "dalton",
        "theory",
        "simply",
        "assumes",
        "element",
        "smallest",
        "part",
        "characteristic",
        "size",
        "mass",
        "property",
        "elemental",
        "kind",
        "lavoisier",
        "element",
        "considered",
        "collection",
        "characteristic",
        "atom",
        "dalton",
        "argued",
        "atomic",
        "hypothesis",
        "explained",
        "law",
        "constant",
        "proportion",
        "see",
        "section",
        "dalton",
        "theory",
        "give",
        "expression",
        "idea",
        "real",
        "presence",
        "element",
        "compound",
        "believed",
        "atom",
        "survive",
        "chemical",
        "change",
        "underwrites",
        "claim",
        "element",
        "actually",
        "present",
        "compound",
        "assumed",
        "atom",
        "element",
        "alike",
        "weight",
        "assumption",
        "atom",
        "combine",
        "atom",
        "element",
        "fixed",
        "ratio",
        "dalton",
        "claimed",
        "explain",
        "element",
        "combine",
        "fixed",
        "proportion",
        "weight",
        "also",
        "introduced",
        "law",
        "multiple",
        "proportion",
        "according",
        "element",
        "distinct",
        "compound",
        "element",
        "stand",
        "simple",
        "proportion",
        "argued",
        "principle",
        "also",
        "explained",
        "atomic",
        "theory",
        "dalton",
        "theory",
        "divided",
        "chemical",
        "community",
        "many",
        "supporter",
        "considerable",
        "number",
        "chemist",
        "remained",
        "antiatomistic",
        "part",
        "reason",
        "controversy",
        "surrounding",
        "empirical",
        "application",
        "dalton",
        "atomic",
        "theory",
        "one",
        "estimate",
        "atomic",
        "weight",
        "since",
        "atom",
        "small",
        "quantity",
        "matter",
        "daltonians",
        "argued",
        "although",
        "tiny",
        "quantity",
        "could",
        "measured",
        "absolutely",
        "could",
        "measured",
        "relative",
        "reference",
        "atom",
        "natural",
        "choice",
        "hydrogen",
        "still",
        "left",
        "problem",
        "setting",
        "ratio",
        "weight",
        "different",
        "atom",
        "compound",
        "dalton",
        "assumed",
        "one",
        "compound",
        "two",
        "element",
        "known",
        "assumed",
        "combine",
        "equal",
        "proportion",
        "thus",
        "understood",
        "water",
        "instance",
        "though",
        "would",
        "represented",
        "ho",
        "term",
        "formula",
        "berzelius",
        "introduce",
        "berzelius",
        "dalton",
        "response",
        "problem",
        "seemed",
        "arbitrary",
        "finding",
        "natural",
        "solution",
        "became",
        "pressing",
        "first",
        "half",
        "nineteenth",
        "century",
        "element",
        "discovered",
        "elemental",
        "composition",
        "chemical",
        "substance",
        "determined",
        "qualitatively",
        "duhem",
        "needham",
        "chalmers",
        "a",
        "b",
        "dalton",
        "contemporary",
        "raised",
        "objection",
        "well",
        "jacob",
        "berzelius",
        "argued",
        "daltonian",
        "atomism",
        "provided",
        "explanation",
        "chemical",
        "combination",
        "element",
        "hold",
        "together",
        "form",
        "compound",
        "berzelius",
        "since",
        "atom",
        "intrinsically",
        "unchanging",
        "suffer",
        "modification",
        "kind",
        "aristotle",
        "thought",
        "necessary",
        "combination",
        "occur",
        "lacking",
        "anything",
        "like",
        "modern",
        "idea",
        "molecule",
        "dalton",
        "forced",
        "explain",
        "chemical",
        "combination",
        "term",
        "atomic",
        "packing",
        "endowed",
        "atom",
        "atmosphere",
        "caloric",
        "whose",
        "mutual",
        "repulsion",
        "supposed",
        "explain",
        "atom",
        "pack",
        "together",
        "efficiently",
        "persuaded",
        "idea",
        "came",
        "later",
        "known",
        "daltonian",
        "atomism",
        "abandoned",
        "idea",
        "caloric",
        "shell",
        "altogether",
        "situation",
        "made",
        "complex",
        "chemist",
        "realized",
        "elemental",
        "composition",
        "general",
        "sufficient",
        "distinguish",
        "substance",
        "dalton",
        "aware",
        "element",
        "sometimes",
        "give",
        "rise",
        "several",
        "compound",
        "several",
        "oxide",
        "nitrogen",
        "example",
        "given",
        "law",
        "constant",
        "proportion",
        "distinguished",
        "specifying",
        "combining",
        "proportion",
        "represented",
        "distinct",
        "chemical",
        "formula",
        "example",
        "no",
        "no",
        "different",
        "oxide",
        "nitrogen",
        "however",
        "organic",
        "compound",
        "isolated",
        "analyzed",
        "became",
        "clear",
        "elemental",
        "composition",
        "uniquely",
        "distinguish",
        "substance",
        "distinct",
        "compound",
        "elemental",
        "composition",
        "called",
        "isomer",
        "term",
        "coined",
        "berzelius",
        "organic",
        "compound",
        "composition",
        "different",
        "property",
        "first",
        "recognized",
        "later",
        "discovered",
        "isomerism",
        "ubiquitous",
        "confined",
        "organic",
        "compound",
        "isomer",
        "may",
        "differ",
        "radically",
        "physical",
        "property",
        "melting",
        "point",
        "boiling",
        "point",
        "well",
        "pattern",
        "chemical",
        "reactivity",
        "case",
        "dimethyl",
        "ether",
        "ethyl",
        "alcohol",
        "compositional",
        "formula",
        "cho",
        "common",
        "represented",
        "two",
        "distinct",
        "structural",
        "formula",
        "ch",
        "o",
        "choh",
        "formula",
        "identify",
        "different",
        "functional",
        "group",
        "govern",
        "pattern",
        "chemical",
        "reactivity",
        "notion",
        "structural",
        "formula",
        "developed",
        "accommodate",
        "isomer",
        "even",
        "similar",
        "case",
        "subgroup",
        "stereoisomers",
        "called",
        "optical",
        "isomer",
        "alike",
        "many",
        "physical",
        "property",
        "melting",
        "point",
        "boiling",
        "point",
        "first",
        "discovered",
        "seemed",
        "alike",
        "chemical",
        "reactivity",
        "pasteur",
        "famously",
        "separated",
        "enantiomer",
        "stereoisomers",
        "one",
        "another",
        "tartaric",
        "acid",
        "preparing",
        "solution",
        "sodium",
        "ammonium",
        "salt",
        "allowing",
        "relatively",
        "large",
        "crystal",
        "form",
        "slow",
        "evaporation",
        "using",
        "tweezer",
        "assembled",
        "crystal",
        "two",
        "pile",
        "member",
        "one",
        "shape",
        "mirror",
        "image",
        "shape",
        "pile",
        "optical",
        "isomer",
        "called",
        "distinguishing",
        "feature",
        "rotating",
        "plane",
        "plane",
        "polarized",
        "light",
        "opposite",
        "direction",
        "phenomenon",
        "first",
        "observed",
        "quartz",
        "crystal",
        "beginning",
        "th",
        "century",
        "isomer",
        "represented",
        "threedimensional",
        "structural",
        "formula",
        "mirror",
        "image",
        "one",
        "another",
        "show",
        "figure",
        "figure",
        "enantiomer",
        "tartaric",
        "acid",
        "dtartaric",
        "acid",
        "left",
        "ltartaric",
        "acid",
        "right",
        "dotted",
        "vertical",
        "line",
        "represents",
        "mirror",
        "plane",
        "solid",
        "wedge",
        "represent",
        "bond",
        "coming",
        "plane",
        "dashed",
        "wedge",
        "represent",
        "bond",
        "going",
        "behind",
        "plane",
        "molecular",
        "structure",
        "mirror",
        "image",
        "one",
        "another",
        "although",
        "discovery",
        "often",
        "presented",
        "explained",
        "atomic",
        "molecular",
        "hypothesis",
        "skepticism",
        "status",
        "atomism",
        "persisted",
        "throughout",
        "th",
        "century",
        "late",
        "th",
        "century",
        "skeptic",
        "ernst",
        "mach",
        "georg",
        "helm",
        "wilhelm",
        "ostwald",
        "pierre",
        "duhem",
        "see",
        "atomism",
        "adequate",
        "explanation",
        "phenomenon",
        "believe",
        "sufficient",
        "evidence",
        "accept",
        "existence",
        "atom",
        "instead",
        "advocated",
        "nonatomistic",
        "theory",
        "chemical",
        "change",
        "grounded",
        "thermodynamics",
        "helm",
        "ostwald",
        "see",
        "introduction",
        "deltete",
        "duhem",
        "objection",
        "atomism",
        "particularly",
        "instructive",
        "despite",
        "represented",
        "positivist",
        "literature",
        "eg",
        "fox",
        "objection",
        "atomism",
        "chemistry",
        "made",
        "appeal",
        "unobservability",
        "atom",
        "instead",
        "argued",
        "molecule",
        "theoretical",
        "impossibility",
        "according",
        "th",
        "century",
        "physic",
        "could",
        "say",
        "nothing",
        "atom",
        "hold",
        "together",
        "could",
        "give",
        "many",
        "reason",
        "stable",
        "entity",
        "reasonable",
        "period",
        "time",
        "also",
        "argued",
        "notion",
        "valency",
        "attributed",
        "atom",
        "explain",
        "combining",
        "power",
        "simply",
        "macroscopic",
        "characterization",
        "projected",
        "microscopic",
        "level",
        "showed",
        "chemical",
        "formula",
        "could",
        "interpreted",
        "without",
        "resorting",
        "atom",
        "notion",
        "valency",
        "could",
        "defined",
        "basis",
        "duhem",
        "exposition",
        "see",
        "needham",
        "atomists",
        "failed",
        "meet",
        "challenge",
        "criticized",
        "saying",
        "feature",
        "atom",
        "beyond",
        "simply",
        "reading",
        "property",
        "defined",
        "macroscopic",
        "basis",
        "needham",
        "duhem",
        "recognize",
        "atomic",
        "theory",
        "developed",
        "th",
        "century",
        "vortex",
        "theory",
        "kragh",
        "rejected",
        "inadequate",
        "explaining",
        "chemical",
        "phenomenon",
        "skeptic",
        "atomism",
        "finally",
        "became",
        "convinced",
        "beginning",
        "th",
        "century",
        "careful",
        "experimental",
        "theoretical",
        "work",
        "brownian",
        "motion",
        "fluctuation",
        "particle",
        "emulsion",
        "development",
        "kinetic",
        "theory",
        "suspected",
        "motion",
        "due",
        "invisible",
        "particle",
        "within",
        "emulsion",
        "pushing",
        "visible",
        "particle",
        "first",
        "decade",
        "th",
        "century",
        "einstein",
        "theoretical",
        "analysis",
        "perrin",
        "experimental",
        "work",
        "gave",
        "substance",
        "suspicion",
        "provided",
        "estimate",
        "avogadro",
        "number",
        "perrin",
        "famously",
        "argued",
        "substantially",
        "correct",
        "agreed",
        "determination",
        "made",
        "several",
        "independent",
        "method",
        "decisive",
        "argument",
        "existence",
        "microentities",
        "led",
        "still",
        "skeptical",
        "atomic",
        "hypothesis",
        "change",
        "view",
        "einstein",
        "perrin",
        "nye",
        "maiocchi",
        "important",
        "appreciate",
        "however",
        "establishing",
        "existence",
        "atom",
        "way",
        "left",
        "many",
        "question",
        "raised",
        "skeptic",
        "unanswered",
        "theory",
        "nature",
        "atom",
        "would",
        "explain",
        "combine",
        "form",
        "molecule",
        "yet",
        "formulated",
        "remains",
        "day",
        "open",
        "question",
        "whether",
        "purely",
        "microscopic",
        "theory",
        "available",
        "adequate",
        "explain",
        "whole",
        "range",
        "chemical",
        "phenomenon",
        "issue",
        "pursued",
        "section",
        "discus",
        "reduction"
    ]
}