{
    "main_text": "Normative conceptions of the person || The Daodejing\n2.3 The Daodejing\n\nThe Daodejing (道德經 The Book of the\nWay and Its Power) may have begun to take shape in fifth century\nBCE and reached the form as we know it in the second century CE\n(references to the Chinese text will be to the Daodejing in\nCTP). It shares with the Mozi the attribution of impartiality\nto the natural source of norms—tian’s dao.\nHowever, impartiality in the Daodejing is broader than it is\nin the Mozi. Chapter 10 celebrates its giving of life and its\nnurturance of all things, not only humans. Chapter 5 declares\nthat Tian and earth are not ren, that it treats the\nmyriad things as “straw dogs”, i.e., ritual objects\ntreated reverently during the season of rites but afterwards tossed\naside. Rather than attributing callousness or cruelty to Tian\nand earth, the message is that each thing is given its time, which\nthen inevitably passes. It is not just that the desires fostered by\nConfucians and Mohists have no basis in Tian and earth. We\nproject our time and place’s human concerns onto the natural\nworld in both social daos.\n\nThe Daodejing reminds us that the dao path metaphor\nused by the social moralists to talk about how people should live was\ntaken from its home domain of how things naturally came into being\n(ch. 14). It says both dao and tian follow\nziran natural or spontaneous (self-realized) unfolding (ch.\n25). The Daoist conception of paths is this natural path structure.\nLanguage and human social daos have path structure, but not all path\nstructure is in language or human affairs. Natural, tian\ndao’s structure is a distribution of what is and what is\nnot—you (being) and wu (non-being). The\nstructure of nature also emerges and evolves in nature. The first\nchapter says, the Daos can be dao-ed (guided or\nevolved). They are not constant daos. So dao only\nmoves forward, unlike physical law that applies forward and backward\nin time. The actual environmental context of unfolding of all things,\nnamed or not, moves in one direction as things self-realize their\nnon-being possibilities, the possibles which are not yet part of\nbeing. “Non-being” names the beginning of the cosmos\n(Tian and earth). “Being” names “the mother\nof 10,000 kinds of things”. Cosmic dao unfolds in\nsilence and effortlessly. It exists where there is emptiness that\ninvites filling with behavior (ch. 11).\n\nDao makes no names constant. Natural material (uncarved wood)\ncan be distributed to make utensils (ch. 28). But no human authority\ncan make uncarved wood its servant. When we take it into a human\nstructure, we use names. When we have names, we will know “to\nstop” (ch. 32). Why stop? Names of things generate desires that\ngo beyond natural desires. Nameless uncarved nature is free from such\ndesires and these are dangerous, competitive desires, e.g., for social\nstatus. This is the crux of Laozi’s (“Old Master” or\nthe anonymous author’s) view of psychology. Acquiring any social\ndao through learning names and ritual behaviors, takes us\naway from our natural self. Going back to that natural self is to\ncease to guide our behavior using social\nconstructs—無為 wuwei is the paradigm of\nself-realization without social domination.\n\nThe Daodejing hints at other ways our self-nature is changed\nby learning language and a social dao. The distinctions\nmarked in language are poverty stricken in comparison to the ability\nof our eyes and ears to register hues and tones (ch. 11). Linguistic\ninstructions using names are more rigid and less\naccurate—imagine trying to explain how to follow a forest trail\nby recipe-like instructions such as, “Walk 7 steps NNE then turn\n12º west and take 4 steps, then …”. compared to\npointing to the trail. With natural dao, we respond to the\nsuppleness and constantly changing flux of ongoing experience of the\nworld (ch. 76). It could be said of much of Chinese philosophy but is\nmost dramatically presented in the Daodejing’s stress\non constant, ceaseless transforming.\n\nNote that this view of the match between human naming and\nclassificatory capacity and the world runs against the view\npresupposed by the Mohists. Usefulness often presupposes some socially\nconstructed of name-influenced desire or value. So, it cannot mediate\nbetween different systems of constructing such values.\n\nThe Daodejing prizes attentiveness and responsiveness to the\npresent situation. Terms in language elide the differences in\nsituations. We see the world through the filter of our desires and try\nto manipulate things and other people to make names apply. We cannot\nstop the process of ceaseless change and unfolding.\n\nWe should neither elevate some people above others (so-called\nworthies), nor value things for their rarity only, nor seek out things\nof desire. These confuse the heart-mind. To achieve peaceful stable\nlife, sage leadership works to empty the people’s minds of such\nthings so they focus simply on natural goals of adequate clothing,\nhealth, and control of our own lives. In the battle of nature and\nnurture, Laozi chooses nature. That is why the sage is for the belly\nand not the eye (beauty) (ch. 3).\n\nThis goal of emptying the heart-mind of inculcated desires and the\ncrude distinctions behind names forms the basis of the later blending\nof Daoism and Buddhism. We see hints of breath control and meditation\nmotivated by the paradox implicit in their goal—nirvana or empty\nmind (ch. 10). The achievement is likened to returning to being a\nnewborn infant. A child’s receptivity to the world is\ncelebrated. It finds its way as streams and rivers find valleys (ch. 6\nand 15). The ideal for the heart-mind is to find its own equilibrium\nin the world without the domination of a past culture’s\npresuppositions. The heart-mind’s calmness (stillness) and\nemptiness underpin this receptivity to undistorted nature. (ch. 16).\nThe heart-mind can attune to dao and follow its invitations\nto behavior. This conception of forming a unity, becoming one with\ndao, makes the heart-mind’s self-realization the\nstandard guiding the changing dao (ch. 25). The heart-mind\nthat empties itself is able to attune to and participate in this\nprimordial movement of dao.\n\nThis unity of the empty and still heart-mind with the dao of\nunfolding is why wuwei can be efficacious. It emerges from\nsupple receptiveness to the moment or situation at hand. In the\nDaodejing, this is described as practicing teachings without\nwords, producing things without “owning” them, acting\nwithout expectation of reward, and not lingering after one’s\nwork is done (ch. 2). Wu wei is contrasted with behavior to\nachieve a socially motivated end. Sometimes wuwei is\nidentified with spontaneous action, but not in the sense of impulsive\naction but of self-realization of possibilities offered by\ndao.\n\nThe text adopts various devices to help. Chapter 63 says to overcome\nthe hard while it is still easy and to achieve the large while it is\nsmall. Difficult things start with what is easy, and great things\nbegin with the small. Chapter 64 says to set things in order before\nthey become chaotic. These sayings suggest careful attending to things\nand a foresight born of perceiving incipient patterns of development.\nSuch careful attending may give rise to action that might be called\nspontaneous, not impulsive, but instead supremely responsive to\nothers. The responsiveness is transparent to the shape of\ndao’s invitation to behavior.\n\nThe text signal’s awareness that wuwei is practically\ncontradictory since it recommends a type of behavior using two social\nconcepts—wu and wei (ch. 48). The text\n(especially the 2nd de book) charges into social\nand political ethics implied in this conception despite their\nnotorious tension with this anti-social domination beginning. The\ninvitations to behavior include social contexts. An open, transparent\npursuit of natural options include how one’s actions are\ncomplementary to others as in a dance. One is sensitive to others so\nas to blend and complement one’s energies with theirs.\nOur joint receptiveness gives us a dao\nwhich we self-realize in our joint behavior.\n\nThe political implication is the greatest sage rulers are barely known\nto the people; the next greatest are those who are loved; after that\ncome those who are feared, and after that those who are ridiculed.\nTasks are completed and duties are fulfilled, and the people simply\nsay that this is their natural way (ch. 17). Sage rulers do this by\nemptying their heart-mind and making the people’s heart-minds\ntheir heart-mind (ch. 49).\n\nSome descriptions of how sage rulers do this seem controlling and\nmanipulative, where ancients good at enacting dao do not\nenlighten the people but keep them stupid and ignorant (ch. 65). This,\nhowever, is consistent with the basic worry about conventional\nknowledge as frustrating self-realization. Sage rulers themselves\nshould be “without [such] knowledge” and nurture the\npeople’s unfolding future without commanding it (ch. 10). In\nchapter 20 the speaker refers to their own heart-mind as belonging to\na fool, empty of conventional wisdom.\n\nThe contrast is also with conventional morality. From the perspective\nof the Daodejing, the Confucians and Mohists are locked into\nan untenably anthropocentric view of Tian and earth that sees\nthem as somehow favoring humanity. The straw-dogs metaphor de-centers\nhumanity, placing it simply among the myriad things. Conventional\nmorality not only embodies an illusion. Following it does not make\nmatters better. Ren and yi, along with cleverness\nand deception, emerge when Dao is abandoned (ch. 18). When\nadopted to steer us toward a better course, its fixed values are too\nrigid to allow the flexible response to the flow of experience\nnecessary for efficacy; moreover, they become instruments of personal\nambition and attempts to outdo others. It is better renounce\nren, abandon yi, along with cleverness and profit,\nmaintaining simplicity and embracing plainness, reducing desires (ch.\n19).\n\nLaozi’s philosophical psychology is reflected in\nThe Mengzi’s more elaborate theory of the\nheart-mind’s natural moral unfolding. A late chapter lists\nci 慈 (compassion) among “my three\ntreasures” (ch. 67). Ci figures centrally in how that\nConfucian text seeks to rehabilitate the Mozi’s\nren (benevolence) and yi (morality). Mozi and Laozi\nhad put guidance in the natural world to which the heart-mind through\nits training could be attuned or prejudiced and unreceptive. Laozi and\nMengzi share a concern about the arbitrariness of education in mores.\nLaozi finds the map in the natural world; Mencius will find it in the\noriginal human mind.\n\nThe shared attitude in the ancient Chinese conception of mind in\nnature is the basic goodness of the world, but the rejection of\nanthropocentrism in Daoism’s interpretation of Tian and\nearth puts into question the meaning of what this goodness could\nbe.\n",
    "section_title": "2.3 The Daodejing",
    "entry_title": "Mind (Heart-Mind) in Chinese Philosophy",
    "hierarchy_title": "Mind (Heart-Mind) in Chinese Philosophy || Normative conceptions of the person || The Daodejing",
    "tokenized_text": [
        "normative",
        "conception",
        "person",
        "daodejing",
        "daodejing",
        "daodejing",
        "道德經",
        "book",
        "way",
        "power",
        "may",
        "begun",
        "take",
        "shape",
        "fifth",
        "century",
        "bce",
        "reached",
        "form",
        "know",
        "second",
        "century",
        "ce",
        "reference",
        "chinese",
        "text",
        "daodejing",
        "ctp",
        "share",
        "mozi",
        "attribution",
        "impartiality",
        "natural",
        "source",
        "normstian",
        "dao",
        "however",
        "impartiality",
        "daodejing",
        "broader",
        "mozi",
        "chapter",
        "celebrates",
        "giving",
        "life",
        "nurturance",
        "thing",
        "human",
        "chapter",
        "declares",
        "tian",
        "earth",
        "ren",
        "treat",
        "myriad",
        "thing",
        "straw",
        "dog",
        "ie",
        "ritual",
        "object",
        "treated",
        "reverently",
        "season",
        "rite",
        "afterwards",
        "tossed",
        "aside",
        "rather",
        "attributing",
        "callousness",
        "cruelty",
        "tian",
        "earth",
        "message",
        "thing",
        "given",
        "time",
        "inevitably",
        "pass",
        "desire",
        "fostered",
        "confucian",
        "mohists",
        "basis",
        "tian",
        "earth",
        "project",
        "time",
        "place",
        "human",
        "concern",
        "onto",
        "natural",
        "world",
        "social",
        "daos",
        "daodejing",
        "reminds",
        "u",
        "dao",
        "path",
        "metaphor",
        "used",
        "social",
        "moralist",
        "talk",
        "people",
        "live",
        "taken",
        "home",
        "domain",
        "thing",
        "naturally",
        "came",
        "ch",
        "say",
        "dao",
        "tian",
        "follow",
        "ziran",
        "natural",
        "spontaneous",
        "selfrealized",
        "unfolding",
        "ch",
        "daoist",
        "conception",
        "path",
        "natural",
        "path",
        "structure",
        "language",
        "human",
        "social",
        "daos",
        "path",
        "structure",
        "path",
        "structure",
        "language",
        "human",
        "affair",
        "natural",
        "tian",
        "dao",
        "structure",
        "distribution",
        "notyou",
        "wu",
        "nonbeing",
        "structure",
        "nature",
        "also",
        "emerges",
        "evolves",
        "nature",
        "first",
        "chapter",
        "say",
        "daos",
        "daoed",
        "guided",
        "evolved",
        "constant",
        "daos",
        "dao",
        "move",
        "forward",
        "unlike",
        "physical",
        "law",
        "applies",
        "forward",
        "backward",
        "time",
        "actual",
        "environmental",
        "context",
        "unfolding",
        "thing",
        "named",
        "move",
        "one",
        "direction",
        "thing",
        "selfrealize",
        "nonbeing",
        "possibility",
        "possible",
        "yet",
        "part",
        "nonbeing",
        "name",
        "beginning",
        "cosmos",
        "tian",
        "earth",
        "name",
        "mother",
        "kind",
        "thing",
        "cosmic",
        "dao",
        "unfolds",
        "silence",
        "effortlessly",
        "exists",
        "emptiness",
        "invite",
        "filling",
        "behavior",
        "ch",
        "dao",
        "make",
        "name",
        "constant",
        "natural",
        "material",
        "uncarved",
        "wood",
        "distributed",
        "make",
        "utensil",
        "ch",
        "human",
        "authority",
        "make",
        "uncarved",
        "wood",
        "servant",
        "take",
        "human",
        "structure",
        "use",
        "name",
        "name",
        "know",
        "stop",
        "ch",
        "stop",
        "name",
        "thing",
        "generate",
        "desire",
        "go",
        "beyond",
        "natural",
        "desire",
        "nameless",
        "uncarved",
        "nature",
        "free",
        "desire",
        "dangerous",
        "competitive",
        "desire",
        "eg",
        "social",
        "status",
        "crux",
        "laozi",
        "old",
        "master",
        "anonymous",
        "author",
        "view",
        "psychology",
        "acquiring",
        "social",
        "dao",
        "learning",
        "name",
        "ritual",
        "behavior",
        "take",
        "u",
        "away",
        "natural",
        "self",
        "going",
        "back",
        "natural",
        "self",
        "cease",
        "guide",
        "behavior",
        "using",
        "social",
        "constructs無為",
        "wuwei",
        "paradigm",
        "selfrealization",
        "without",
        "social",
        "domination",
        "daodejing",
        "hint",
        "way",
        "selfnature",
        "changed",
        "learning",
        "language",
        "social",
        "dao",
        "distinction",
        "marked",
        "language",
        "poverty",
        "stricken",
        "comparison",
        "ability",
        "eye",
        "ear",
        "register",
        "hue",
        "tone",
        "ch",
        "linguistic",
        "instruction",
        "using",
        "name",
        "rigid",
        "le",
        "accurateimagine",
        "trying",
        "explain",
        "follow",
        "forest",
        "trail",
        "recipelike",
        "instruction",
        "walk",
        "step",
        "nne",
        "turn",
        "º",
        "west",
        "take",
        "step",
        "compared",
        "pointing",
        "trail",
        "natural",
        "dao",
        "respond",
        "suppleness",
        "constantly",
        "changing",
        "flux",
        "ongoing",
        "experience",
        "world",
        "ch",
        "could",
        "said",
        "much",
        "chinese",
        "philosophy",
        "dramatically",
        "presented",
        "daodejing",
        "stress",
        "constant",
        "ceaseless",
        "transforming",
        "note",
        "view",
        "match",
        "human",
        "naming",
        "classificatory",
        "capacity",
        "world",
        "run",
        "view",
        "presupposed",
        "mohists",
        "usefulness",
        "often",
        "presupposes",
        "socially",
        "constructed",
        "nameinfluenced",
        "desire",
        "value",
        "mediate",
        "different",
        "system",
        "constructing",
        "value",
        "daodejing",
        "prize",
        "attentiveness",
        "responsiveness",
        "present",
        "situation",
        "term",
        "language",
        "elide",
        "difference",
        "situation",
        "see",
        "world",
        "filter",
        "desire",
        "try",
        "manipulate",
        "thing",
        "people",
        "make",
        "name",
        "apply",
        "stop",
        "process",
        "ceaseless",
        "change",
        "unfolding",
        "neither",
        "elevate",
        "people",
        "others",
        "socalled",
        "worthy",
        "value",
        "thing",
        "rarity",
        "seek",
        "thing",
        "desire",
        "confuse",
        "heartmind",
        "achieve",
        "peaceful",
        "stable",
        "life",
        "sage",
        "leadership",
        "work",
        "empty",
        "people",
        "mind",
        "thing",
        "focus",
        "simply",
        "natural",
        "goal",
        "adequate",
        "clothing",
        "health",
        "control",
        "life",
        "battle",
        "nature",
        "nurture",
        "laozi",
        "chooses",
        "nature",
        "sage",
        "belly",
        "eye",
        "beauty",
        "ch",
        "goal",
        "emptying",
        "heartmind",
        "inculcated",
        "desire",
        "crude",
        "distinction",
        "behind",
        "name",
        "form",
        "basis",
        "later",
        "blending",
        "daoism",
        "buddhism",
        "see",
        "hint",
        "breath",
        "control",
        "meditation",
        "motivated",
        "paradox",
        "implicit",
        "goalnirvana",
        "empty",
        "mind",
        "ch",
        "achievement",
        "likened",
        "returning",
        "newborn",
        "infant",
        "child",
        "receptivity",
        "world",
        "celebrated",
        "find",
        "way",
        "stream",
        "river",
        "find",
        "valley",
        "ch",
        "ideal",
        "heartmind",
        "find",
        "equilibrium",
        "world",
        "without",
        "domination",
        "past",
        "culture",
        "presupposition",
        "heartmind",
        "calmness",
        "stillness",
        "emptiness",
        "underpin",
        "receptivity",
        "undistorted",
        "nature",
        "ch",
        "heartmind",
        "attune",
        "dao",
        "follow",
        "invitation",
        "behavior",
        "conception",
        "forming",
        "unity",
        "becoming",
        "one",
        "dao",
        "make",
        "heartmind",
        "selfrealization",
        "standard",
        "guiding",
        "changing",
        "dao",
        "ch",
        "heartmind",
        "empty",
        "able",
        "attune",
        "participate",
        "primordial",
        "movement",
        "dao",
        "unity",
        "empty",
        "still",
        "heartmind",
        "dao",
        "unfolding",
        "wuwei",
        "efficacious",
        "emerges",
        "supple",
        "receptiveness",
        "moment",
        "situation",
        "hand",
        "daodejing",
        "described",
        "practicing",
        "teaching",
        "without",
        "word",
        "producing",
        "thing",
        "without",
        "owning",
        "acting",
        "without",
        "expectation",
        "reward",
        "lingering",
        "one",
        "work",
        "done",
        "ch",
        "wu",
        "wei",
        "contrasted",
        "behavior",
        "achieve",
        "socially",
        "motivated",
        "end",
        "sometimes",
        "wuwei",
        "identified",
        "spontaneous",
        "action",
        "sense",
        "impulsive",
        "action",
        "selfrealization",
        "possibility",
        "offered",
        "dao",
        "text",
        "adopts",
        "various",
        "device",
        "help",
        "chapter",
        "say",
        "overcome",
        "hard",
        "still",
        "easy",
        "achieve",
        "large",
        "small",
        "difficult",
        "thing",
        "start",
        "easy",
        "great",
        "thing",
        "begin",
        "small",
        "chapter",
        "say",
        "set",
        "thing",
        "order",
        "become",
        "chaotic",
        "saying",
        "suggest",
        "careful",
        "attending",
        "thing",
        "foresight",
        "born",
        "perceiving",
        "incipient",
        "pattern",
        "development",
        "careful",
        "attending",
        "may",
        "give",
        "rise",
        "action",
        "might",
        "called",
        "spontaneous",
        "impulsive",
        "instead",
        "supremely",
        "responsive",
        "others",
        "responsiveness",
        "transparent",
        "shape",
        "dao",
        "invitation",
        "behavior",
        "text",
        "signal",
        "awareness",
        "wuwei",
        "practically",
        "contradictory",
        "since",
        "recommends",
        "type",
        "behavior",
        "using",
        "two",
        "social",
        "conceptswu",
        "wei",
        "ch",
        "text",
        "especially",
        "nd",
        "de",
        "book",
        "charge",
        "social",
        "political",
        "ethic",
        "implied",
        "conception",
        "despite",
        "notorious",
        "tension",
        "antisocial",
        "domination",
        "beginning",
        "invitation",
        "behavior",
        "include",
        "social",
        "context",
        "open",
        "transparent",
        "pursuit",
        "natural",
        "option",
        "include",
        "one",
        "action",
        "complementary",
        "others",
        "dance",
        "one",
        "sensitive",
        "others",
        "blend",
        "complement",
        "one",
        "energy",
        "joint",
        "receptiveness",
        "give",
        "u",
        "dao",
        "selfrealize",
        "joint",
        "behavior",
        "political",
        "implication",
        "greatest",
        "sage",
        "ruler",
        "barely",
        "known",
        "people",
        "next",
        "greatest",
        "loved",
        "come",
        "feared",
        "ridiculed",
        "task",
        "completed",
        "duty",
        "fulfilled",
        "people",
        "simply",
        "say",
        "natural",
        "way",
        "ch",
        "sage",
        "ruler",
        "emptying",
        "heartmind",
        "making",
        "people",
        "heartminds",
        "heartmind",
        "ch",
        "description",
        "sage",
        "ruler",
        "seem",
        "controlling",
        "manipulative",
        "ancient",
        "good",
        "enacting",
        "dao",
        "enlighten",
        "people",
        "keep",
        "stupid",
        "ignorant",
        "ch",
        "however",
        "consistent",
        "basic",
        "worry",
        "conventional",
        "knowledge",
        "frustrating",
        "selfrealization",
        "sage",
        "ruler",
        "without",
        "knowledge",
        "nurture",
        "people",
        "unfolding",
        "future",
        "without",
        "commanding",
        "ch",
        "chapter",
        "speaker",
        "refers",
        "heartmind",
        "belonging",
        "fool",
        "empty",
        "conventional",
        "wisdom",
        "contrast",
        "also",
        "conventional",
        "morality",
        "perspective",
        "daodejing",
        "confucian",
        "mohists",
        "locked",
        "untenably",
        "anthropocentric",
        "view",
        "tian",
        "earth",
        "see",
        "somehow",
        "favoring",
        "humanity",
        "strawdogs",
        "metaphor",
        "decenters",
        "humanity",
        "placing",
        "simply",
        "among",
        "myriad",
        "thing",
        "conventional",
        "morality",
        "embodies",
        "illusion",
        "following",
        "make",
        "matter",
        "better",
        "ren",
        "yi",
        "along",
        "cleverness",
        "deception",
        "emerge",
        "dao",
        "abandoned",
        "ch",
        "adopted",
        "steer",
        "u",
        "toward",
        "better",
        "course",
        "fixed",
        "value",
        "rigid",
        "allow",
        "flexible",
        "response",
        "flow",
        "experience",
        "necessary",
        "efficacy",
        "moreover",
        "become",
        "instrument",
        "personal",
        "ambition",
        "attempt",
        "outdo",
        "others",
        "better",
        "renounce",
        "ren",
        "abandon",
        "yi",
        "along",
        "cleverness",
        "profit",
        "maintaining",
        "simplicity",
        "embracing",
        "plainness",
        "reducing",
        "desire",
        "ch",
        "laozi",
        "philosophical",
        "psychology",
        "reflected",
        "mengzi",
        "elaborate",
        "theory",
        "heartmind",
        "natural",
        "moral",
        "unfolding",
        "late",
        "chapter",
        "list",
        "ci",
        "慈",
        "compassion",
        "among",
        "three",
        "treasure",
        "ch",
        "ci",
        "figure",
        "centrally",
        "confucian",
        "text",
        "seek",
        "rehabilitate",
        "mozi",
        "ren",
        "benevolence",
        "yi",
        "morality",
        "mozi",
        "laozi",
        "put",
        "guidance",
        "natural",
        "world",
        "heartmind",
        "training",
        "could",
        "attuned",
        "prejudiced",
        "unreceptive",
        "laozi",
        "mengzi",
        "share",
        "concern",
        "arbitrariness",
        "education",
        "more",
        "laozi",
        "find",
        "map",
        "natural",
        "world",
        "mencius",
        "find",
        "original",
        "human",
        "mind",
        "shared",
        "attitude",
        "ancient",
        "chinese",
        "conception",
        "mind",
        "nature",
        "basic",
        "goodness",
        "world",
        "rejection",
        "anthropocentrism",
        "daoism",
        "interpretation",
        "tian",
        "earth",
        "put",
        "question",
        "meaning",
        "goodness",
        "could"
    ]
}