{
    "main_text": "The Text of the Book of Changes || Human Finitude\n1.1 Human Finitude\n\nUnderlying the philosophy of the Changes is the notion that\nthe cosmos is an organismic process without beginning or end. As a\nprocess, the cosmos resembles a great flow in which “all of the\nparts of the entire cosmos belong to one organic whole” and all\nthe parts “interact as participants in one spontaneously\nself-generating process” (Tu 1985: 35). As such, there are three\ncharacteristics of this great flow: continuity, wholeness, and\ndynamism. It is continuous because it never stops in renewing itself.\nIt is holistic because it includes everything in the universe and\npermeates in all aspects of life. It is dynamic because it is full of\nmotion and movement, generating energy and strength all the time (Tu\n1985: 38–39). In this cosmic flow, there is no distinction\nbetween the natural realm and the human realm, between an observing\nsubject and an observed object, and between the inner world and the\nouter world. Everything is part of a totality, a group dance that\nnever stops.\n\nBecause of its origin, the philosophy of the Changes was\nembedded in the practices of divination. In early China, divination\nwas intrinsically philosophical because they were undertaken by the\nupper classes to make critical decisions, such as starting a war,\nstopping a natural disaster, or choosing a spouse to continue the\nfamily line. Before divination, an inquirer must have a question in\nmind to seek guidance from a deity or the spirit of an ancestor. The\nresult of a divination would be transmitted to the inquirer in a code\n(as shown in the engravings in the oracle bones) and the inquirer must\ninterpret the code to formulate an action plan. In the whole process,\ninterpreting the code—known as prognostication—was the\nmost important step where the inquirer, aided by experts, made\ncritical decisions based on the message (Shaughnessy 2014: 1–36;\n2022: 68–84). Hence, divination was not a blind faith in a\nsupernatural power. Rather, it was an attempt to make an informed\ndecision based on a reflection of the past, an apprehension of the\npresent, and an anticipation of the future (Allan 1991; Gotshalk 1999;\nMarshall 2001; Raphals 2013, Redmond 2017; Shaughnessy 1992\n[1997]).\n\nMore importantly, underlying the practice of divination was the notion\nthat human beings must accept their limitations. First and foremost,\nhuman beings cannot fully understand the cosmos because it is an\norganismic process. As part of the great flow, human beings are bound\nby specific time and space. Like a drop of water in an ocean, we are\nconditioned by the totality of the ocean and its dynamism. We act,\nreact, push, and pull, but we never know the vastness and depth of the\nocean.\n\nParadoxically, acknowledging our finitude gives us courage and\nflexibility to actively involve into our lives. As a drop of water in\nan ocean, we can reinvent ourselves in every moment. Our\naction—intentional or unintentional—will cause a change in\nthe world; through the butterfly effect, our action will subsequently\ncome back to affect us in our lives. Consequently, every action we\ntake is both a result of a precedent situation and a cause of the\nfollowing situation. Bounded and yet free, we are part of the process\nof creative-creation where, as Alfred North Whitehead puts it,\n“the many become one and are increased by one” (Whitehead\n1929 [1978]: 342–351).\n\nIn the Changes, this interdependence of subject and object,\ninner and outer, cause and effect, are presented graphically in the\nsymbols of yin 陰 (the passive force), a broken line (‒\n‒), and yang 陽 (the active force), a straight line\n(―). By mixing the straight and broken lines, trigrams\n(three-line grids) and hexagrams (six-line grids) are formed.\nAllegedly developed by Fu Xi, these trigrams and hexagrams can be seen\nas coded messages from a supernatural power. But these trigrams and\nhexagrams can also be understood as a system of signs that helps us\nunderstand the fluidity and complexity of the cosmic flow. In the\nXici 繋辭 (The Attached Statements, one of the\nTen Wings), we find a description of how Fu Xi developed the eight\ntrigrams to represent the world:\n\n\nWhen in early antiquity Pao Hsi [Fu Xi] ruled the world, he looked\nupward and contemplated the images in the heavens; he looked downward\nand contemplated the patterns on earth. He contemplated the markings\nof birds and beasts and the adaptations to the regions. He proceeded\ndirectly from himself and indirectly from objects. Thus he invented\nthe eight trigrams in order to enter into connection with the virtues\nof the light of the gods and to regulate the conditions of all beings.\n(WB67: 328–329)\n\n\nFor the authors of Xici, the eight trigrams (☰,\n☱, ☲, ☳, ☴, ☵, ☶, ☷) ) are\npotent symbols. They are “signifiers” that help us, the\nperceivers, develop a sense of what the “signified” may\nlook like. With different combinations of a straight line (—)\nand a broken line (‒ ‒), the trigrams symbolize the ebb\nand flow of the yin and the yang cosmic forces. Similarly, a hexagram\n(a six-lines grid) is also a symbol of the unfolding of the universe.\nFor example, a hexagram can be divided into two trigrams: the lower\ntrigram (lines 1–3) and the upper trigram (lines 4–6).\nWith one trigram below and one trigram above, a hexagram symbolizes\nthe interaction of two sets of yin-yang configuration, demonstrating\nthe multiple ways in which the yin and yang forces interact and\ntransform each other. One may also take the lower two lines of a\nhexagram as representing the earth (di 地), the middle\ntwo lines as representing humankind (ren 人), and the\ntop two lines as representing heaven (tian 天). Then,\nwe have a trigram within a hexagram. Known as the “three\npotencies” (san cai 三才), the relation of\nheaven, earth, and humankind highlights the co-dependence between the\nnatural realm (tian and di) and the human realm\n(ren).\n\nFor the authors of Xugua 序卦 (Explaining the\nSequence of Hexagrams, one of the Ten Wings), there are meanings in\nthe sequence of the 64 hexagrams. The sequence depicts a continuous\ndevelopment of human society. The process begins with satisfying basic\nhuman needs (such as food, shelter, and security) and founding a\npatrilineal family structure. Subsequently, the patrilineal family\nstructure is further expanded into a complex socio-political system\nbased on the distinctions between kings and officials and rulers and\nthe ruled. Yet, this seemingly triumphant march to perfect human\nsociety is repeatedly interrupted by hesitations and disruptions,\nobstacles and blunders, and reforms and rebellions. At the end, this\nquest for a better society becomes a never-ending process, like the\ngreat flow of the cosmos.\n\nTo the authors of Xugua, this never-ending process of\nbuilding a better society is symbolized by the last hexagram,\nWeiji 未濟 (䷿ Ferrying Incomplete, #64).\nIf ended with Jiji 既濟 (䷾ Ferrying\nComplete, #63), the Changes would have been perfect because\nJiji is the best hexagram in terms of yin-yang\ncorrespondence. Reading Jiji\n\n\n䷾\n\n\nfrom the bottom to the top, the first yang line of Jiji\ncorresponds with the fourth yin line, the second yin line corresponds\nwith the fifth yang line, and the third yang line corresponds with the\ntop yin line. In addition, Jiji is perfect in the position of\nthe six lines: a yang line at the first position, a yin line at the\nsecond position, a yang line at the third position, a yin line at the\nfourth position, a yang line at the fifth position, and a yin line at\nthe top position. Ended with Jiji, the Changes would\nhave an optimistic tone. It would suggest that if not now, at least in\nthe distant future, all problems in this world are going to be\nresolved. Sooner or later, we will reach the paradise.\n\nEnded with Weiji, however, the Changes becomes\nominous and open-ended. On the surface, the configuration of\nWeiji\n\n\n䷿\n\n\nis undesirable. Looking at the hexagram line positions, Weiji\nmust be in a dreadful condition: its yang positions (first, third, and\nfifth) are occupied by yin lines, and its yin positions (second,\nfourth, and sixth) are occupied by yang lines. Being in the wrong\npositions, all six lines cannot fully utilize their potential. It is\nsomewhat like what we see during the Covid-19 pandemic where the\nsupply chains and production lines were disrupted, dislocated, and\ndisplaced due to travel bans and shutdowns. At the same time, although\nall positions of Weiji are in the wrong order, the lines\ncorrespond with one another in terms of their yin-yang nature: the yin\nlines at the first and third positions correspond respectively with\nthe yang lines at the fourth and sixth positions, and the yang line at\nthe second position corresponds with the yin line at the fifth\nposition. Because of the correspondence amongst the six lines,\nWeiji is full of vital potentials. Once these vital\npotentials are activated, Weiji will flourish. It is similar\nto the potentials of inter- and intra-regional collaborations in the\nworld system that have developed over the last four decades. The\ntemporary disruptions and shutdowns during the pandemic did not cause\ndamages the structure of the system. The system bounces back quickly\nafter the travel bans and shutdowns are lifted.\n",
    "section_title": "1.1 Human Finitude",
    "entry_title": "Chinese Philosophy of Change (Yijing)",
    "hierarchy_title": "Chinese Philosophy of Change (Yijing) || The Text of the Book of Changes || Human Finitude",
    "tokenized_text": [
        "text",
        "book",
        "change",
        "human",
        "finitude",
        "human",
        "finitude",
        "underlying",
        "philosophy",
        "change",
        "notion",
        "cosmos",
        "organismic",
        "process",
        "without",
        "beginning",
        "end",
        "process",
        "cosmos",
        "resembles",
        "great",
        "flow",
        "part",
        "entire",
        "cosmos",
        "belong",
        "one",
        "organic",
        "whole",
        "part",
        "interact",
        "participant",
        "one",
        "spontaneously",
        "selfgenerating",
        "process",
        "tu",
        "three",
        "characteristic",
        "great",
        "flow",
        "continuity",
        "wholeness",
        "dynamism",
        "continuous",
        "never",
        "stop",
        "renewing",
        "holistic",
        "includes",
        "everything",
        "universe",
        "permeates",
        "aspect",
        "life",
        "dynamic",
        "full",
        "motion",
        "movement",
        "generating",
        "energy",
        "strength",
        "time",
        "tu",
        "cosmic",
        "flow",
        "distinction",
        "natural",
        "realm",
        "human",
        "realm",
        "observing",
        "subject",
        "observed",
        "object",
        "inner",
        "world",
        "outer",
        "world",
        "everything",
        "part",
        "totality",
        "group",
        "dance",
        "never",
        "stop",
        "origin",
        "philosophy",
        "change",
        "embedded",
        "practice",
        "divination",
        "early",
        "china",
        "divination",
        "intrinsically",
        "philosophical",
        "undertaken",
        "upper",
        "class",
        "make",
        "critical",
        "decision",
        "starting",
        "war",
        "stopping",
        "natural",
        "disaster",
        "choosing",
        "spouse",
        "continue",
        "family",
        "line",
        "divination",
        "inquirer",
        "must",
        "question",
        "mind",
        "seek",
        "guidance",
        "deity",
        "spirit",
        "ancestor",
        "result",
        "divination",
        "would",
        "transmitted",
        "inquirer",
        "code",
        "shown",
        "engraving",
        "oracle",
        "bone",
        "inquirer",
        "must",
        "interpret",
        "code",
        "formulate",
        "action",
        "plan",
        "whole",
        "process",
        "interpreting",
        "codeknown",
        "prognosticationwas",
        "important",
        "step",
        "inquirer",
        "aided",
        "expert",
        "made",
        "critical",
        "decision",
        "based",
        "message",
        "shaughnessy",
        "hence",
        "divination",
        "blind",
        "faith",
        "supernatural",
        "power",
        "rather",
        "attempt",
        "make",
        "informed",
        "decision",
        "based",
        "reflection",
        "past",
        "apprehension",
        "present",
        "anticipation",
        "future",
        "allan",
        "gotshalk",
        "marshall",
        "raphals",
        "redmond",
        "shaughnessy",
        "importantly",
        "underlying",
        "practice",
        "divination",
        "notion",
        "human",
        "being",
        "must",
        "accept",
        "limitation",
        "first",
        "foremost",
        "human",
        "being",
        "fully",
        "understand",
        "cosmos",
        "organismic",
        "process",
        "part",
        "great",
        "flow",
        "human",
        "being",
        "bound",
        "specific",
        "time",
        "space",
        "like",
        "drop",
        "water",
        "ocean",
        "conditioned",
        "totality",
        "ocean",
        "dynamism",
        "act",
        "react",
        "push",
        "pull",
        "never",
        "know",
        "vastness",
        "depth",
        "ocean",
        "paradoxically",
        "acknowledging",
        "finitude",
        "give",
        "u",
        "courage",
        "flexibility",
        "actively",
        "involve",
        "life",
        "drop",
        "water",
        "ocean",
        "reinvent",
        "every",
        "moment",
        "actionintentional",
        "unintentionalwill",
        "cause",
        "change",
        "world",
        "butterfly",
        "effect",
        "action",
        "subsequently",
        "come",
        "back",
        "affect",
        "u",
        "life",
        "consequently",
        "every",
        "action",
        "take",
        "result",
        "precedent",
        "situation",
        "cause",
        "following",
        "situation",
        "bounded",
        "yet",
        "free",
        "part",
        "process",
        "creativecreation",
        "alfred",
        "north",
        "whitehead",
        "put",
        "many",
        "become",
        "one",
        "increased",
        "one",
        "whitehead",
        "change",
        "interdependence",
        "subject",
        "object",
        "inner",
        "outer",
        "cause",
        "effect",
        "presented",
        "graphically",
        "symbol",
        "yin",
        "陰",
        "passive",
        "force",
        "broken",
        "line",
        "yang",
        "陽",
        "active",
        "force",
        "straight",
        "line",
        "mixing",
        "straight",
        "broken",
        "line",
        "trigram",
        "threeline",
        "grid",
        "hexagram",
        "sixline",
        "grid",
        "formed",
        "allegedly",
        "developed",
        "fu",
        "xi",
        "trigram",
        "hexagram",
        "seen",
        "coded",
        "message",
        "supernatural",
        "power",
        "trigram",
        "hexagram",
        "also",
        "understood",
        "system",
        "sign",
        "help",
        "u",
        "understand",
        "fluidity",
        "complexity",
        "cosmic",
        "flow",
        "xici",
        "繋辭",
        "attached",
        "statement",
        "one",
        "ten",
        "wing",
        "find",
        "description",
        "fu",
        "xi",
        "developed",
        "eight",
        "trigram",
        "represent",
        "world",
        "early",
        "antiquity",
        "pao",
        "hsi",
        "fu",
        "xi",
        "ruled",
        "world",
        "looked",
        "upward",
        "contemplated",
        "image",
        "heaven",
        "looked",
        "downward",
        "contemplated",
        "pattern",
        "earth",
        "contemplated",
        "marking",
        "bird",
        "beast",
        "adaptation",
        "region",
        "proceeded",
        "directly",
        "indirectly",
        "object",
        "thus",
        "invented",
        "eight",
        "trigram",
        "order",
        "enter",
        "connection",
        "virtue",
        "light",
        "god",
        "regulate",
        "condition",
        "being",
        "wb",
        "author",
        "xici",
        "eight",
        "trigram",
        "potent",
        "symbol",
        "signifier",
        "help",
        "u",
        "perceiver",
        "develop",
        "sense",
        "signified",
        "may",
        "look",
        "like",
        "different",
        "combination",
        "straight",
        "line",
        "broken",
        "line",
        "trigram",
        "symbolize",
        "ebb",
        "flow",
        "yin",
        "yang",
        "cosmic",
        "force",
        "similarly",
        "hexagram",
        "sixlines",
        "grid",
        "also",
        "symbol",
        "unfolding",
        "universe",
        "example",
        "hexagram",
        "divided",
        "two",
        "trigram",
        "lower",
        "trigram",
        "line",
        "upper",
        "trigram",
        "line",
        "one",
        "trigram",
        "one",
        "trigram",
        "hexagram",
        "symbolizes",
        "interaction",
        "two",
        "set",
        "yinyang",
        "configuration",
        "demonstrating",
        "multiple",
        "way",
        "yin",
        "yang",
        "force",
        "interact",
        "transform",
        "one",
        "may",
        "also",
        "take",
        "lower",
        "two",
        "line",
        "hexagram",
        "representing",
        "earth",
        "di",
        "地",
        "middle",
        "two",
        "line",
        "representing",
        "humankind",
        "ren",
        "人",
        "top",
        "two",
        "line",
        "representing",
        "heaven",
        "tian",
        "天",
        "trigram",
        "within",
        "hexagram",
        "known",
        "three",
        "potency",
        "san",
        "cai",
        "三才",
        "relation",
        "heaven",
        "earth",
        "humankind",
        "highlight",
        "codependence",
        "natural",
        "realm",
        "tian",
        "di",
        "human",
        "realm",
        "ren",
        "author",
        "xugua",
        "序卦",
        "explaining",
        "sequence",
        "hexagram",
        "one",
        "ten",
        "wing",
        "meaning",
        "sequence",
        "hexagram",
        "sequence",
        "depicts",
        "continuous",
        "development",
        "human",
        "society",
        "process",
        "begin",
        "satisfying",
        "basic",
        "human",
        "need",
        "food",
        "shelter",
        "security",
        "founding",
        "patrilineal",
        "family",
        "structure",
        "subsequently",
        "patrilineal",
        "family",
        "structure",
        "expanded",
        "complex",
        "sociopolitical",
        "system",
        "based",
        "distinction",
        "king",
        "official",
        "ruler",
        "ruled",
        "yet",
        "seemingly",
        "triumphant",
        "march",
        "perfect",
        "human",
        "society",
        "repeatedly",
        "interrupted",
        "hesitation",
        "disruption",
        "obstacle",
        "blunder",
        "reform",
        "rebellion",
        "end",
        "quest",
        "better",
        "society",
        "becomes",
        "neverending",
        "process",
        "like",
        "great",
        "flow",
        "cosmos",
        "author",
        "xugua",
        "neverending",
        "process",
        "building",
        "better",
        "society",
        "symbolized",
        "last",
        "hexagram",
        "weiji",
        "未濟",
        "ferrying",
        "incomplete",
        "ended",
        "jiji",
        "既濟",
        "ferrying",
        "complete",
        "change",
        "would",
        "perfect",
        "jiji",
        "best",
        "hexagram",
        "term",
        "yinyang",
        "correspondence",
        "reading",
        "jiji",
        "bottom",
        "top",
        "first",
        "yang",
        "line",
        "jiji",
        "corresponds",
        "fourth",
        "yin",
        "line",
        "second",
        "yin",
        "line",
        "corresponds",
        "fifth",
        "yang",
        "line",
        "third",
        "yang",
        "line",
        "corresponds",
        "top",
        "yin",
        "line",
        "addition",
        "jiji",
        "perfect",
        "position",
        "six",
        "line",
        "yang",
        "line",
        "first",
        "position",
        "yin",
        "line",
        "second",
        "position",
        "yang",
        "line",
        "third",
        "position",
        "yin",
        "line",
        "fourth",
        "position",
        "yang",
        "line",
        "fifth",
        "position",
        "yin",
        "line",
        "top",
        "position",
        "ended",
        "jiji",
        "change",
        "would",
        "optimistic",
        "tone",
        "would",
        "suggest",
        "least",
        "distant",
        "future",
        "problem",
        "world",
        "going",
        "resolved",
        "sooner",
        "later",
        "reach",
        "paradise",
        "ended",
        "weiji",
        "however",
        "change",
        "becomes",
        "ominous",
        "openended",
        "surface",
        "configuration",
        "weiji",
        "undesirable",
        "looking",
        "hexagram",
        "line",
        "position",
        "weiji",
        "must",
        "dreadful",
        "condition",
        "yang",
        "position",
        "first",
        "third",
        "fifth",
        "occupied",
        "yin",
        "line",
        "yin",
        "position",
        "second",
        "fourth",
        "sixth",
        "occupied",
        "yang",
        "line",
        "wrong",
        "position",
        "six",
        "line",
        "fully",
        "utilize",
        "potential",
        "somewhat",
        "like",
        "see",
        "covid",
        "pandemic",
        "supply",
        "chain",
        "production",
        "line",
        "disrupted",
        "dislocated",
        "displaced",
        "due",
        "travel",
        "ban",
        "shutdown",
        "time",
        "although",
        "position",
        "weiji",
        "wrong",
        "order",
        "line",
        "correspond",
        "one",
        "another",
        "term",
        "yinyang",
        "nature",
        "yin",
        "line",
        "first",
        "third",
        "position",
        "correspond",
        "respectively",
        "yang",
        "line",
        "fourth",
        "sixth",
        "position",
        "yang",
        "line",
        "second",
        "position",
        "corresponds",
        "yin",
        "line",
        "fifth",
        "position",
        "correspondence",
        "amongst",
        "six",
        "line",
        "weiji",
        "full",
        "vital",
        "potential",
        "vital",
        "potential",
        "activated",
        "weiji",
        "flourish",
        "similar",
        "potential",
        "inter",
        "intraregional",
        "collaboration",
        "world",
        "system",
        "developed",
        "last",
        "four",
        "decade",
        "temporary",
        "disruption",
        "shutdown",
        "pandemic",
        "cause",
        "damage",
        "structure",
        "system",
        "system",
        "bounce",
        "back",
        "quickly",
        "travel",
        "ban",
        "shutdown",
        "lifted"
    ]
}