{
    "main_text": "\n\nWhile growing attention has been paid in recent years to the logical\ninsights and contributions of philosophers of other major traditions\nof early China, particularly those of the\n School of Names,\n scholarship on early Chinese views on logic and language still tends\nto concentrate on the contributions of the school of\n Mohism,\n which played a central role in the debates of philosophers of all\nmajor schools of thought during China’s Warring States period\n(479–221 BCE). The Mohists helped to critically refine early\nChinese conceptions of the content and function of logic and language\nin relation to their aspirations for developing a comprehensive\nethical theory about the proper governance of the state and of the\nindividual’s role within it. Arguably, much of the\nMohists’ motivation for developing this theory should be\ncredited to those whom the Mohists themselves identified as their\nphilosophical adversaries or antagonists, and this point extends to\nthe determination they exhibited in developing an explicit\nphilosophical theory of logical reasoning. Among those adversaries\nwere the followers of\n Confucius,\n whose appeals to authority and established traditions for the\njustification of ethical views the Mohists found objectionable, and\nthe advocates of\n Daoism,\n whose views appeared to undermine the possibility of any invariable\nand objective standards for ethical conduct. But quite possibly a more\ncompelling influence, at least in regards to the development of Mohist\nlogic, sprang from the medley of thinkers and dialecticians who have\ntraditionally been associated with the School of Names. While no\nexplicit theory of logical reasoning is attributed to this school, the\nthinkers associated with it had a reputation for unexampled deftness\nin the practice of dialectics and argumentation, and are regarded by\nmany scholars today as among early China’s most subtle\npractitioners of logic (Fung 2020a). On the other hand, these thinkers\nwere also derided by their contemporaries, including by the Mohists,\nfor their sophistry, for their dispositions to muddle and confuse, and\nfor their apparent desire to obscure the proper use of language.\nWhether masters of logical reasoning or merely performers of\nfallacious dialectics, they were taken seriously enough by their\nopponents to be regarded as threats to the order, stability and\nharmony of society. The later Mohists, in particular, whose views on\nlogic and language occupy the greater part of this entry, framed many\nof their own arguments in ways that are plausibly interpreted as\nresponses to their views, and probably many of the later\nMohists’ own logical and linguistic insights are owed to the\nvery puzzles and frustrations they experienced in their efforts to\nsupplant these views with the honest integrity of more rigorous and\ntranspicuous ideas.\n\nIt is somewhat difficult to distinguish the Mohists’ logical\ninsights from their views on language in part because they made no\nattempt at investigating formal logic independently of their interests\nin analyzing the semantics of the terms of language (ming, or\n“names”). They developed a clear theory of inference, and\nsupported this theory with versions of basic principles we would\nrecognize today as central to the study of logic, but argued that the\nrules governing inference are partly determined by the semantics of\nindividual terms and terms in combination, as opposed to rules merely\noperating on an argument’s logical form. It is also difficult to\ndistinguish the Mohists’ attempts at offering a descriptive account of\nthe content and function of language from their normative views about\nthe roles names should be expected to play if they are to contribute\nto the elevation of human character and proper conduct in society.\nThese normative views were held more broadly in early China, and they\nare especially clear in the writings of Xunzi, a Confucian scholar of\nthe late Warring States period who attempted to assimilate the key\ninsights of the Mohists on language and logic into a general Confucian\ntheory of ethics (Lin 2011). In Book 22 of the Xunzi\n(“Correct Naming”), he explains:\n\n\nWhen with differences in expression and divergence in thought we\ncommunicate with each other, and different things are obscurely\nconfounded in name or as objects, the noble and the base will not be\nclarified, the same and different will not be distinguished; in such\ncases intent will inevitably suffer from frustration and obstruction.\nTherefore the wise made for them apportionments and distinctions and\ninstituted names to point out objects, in the first place in order to\nclarify noble and base, secondly to distinguish same and different.\nWhen noble and base are clarified, and same and different\ndistinguished, intent is not hampered by failure to communicate and\naction does not suffer from frustration and obstruction. This is the\npurpose of having names. (tr. Graham 1989)\n\n\nThe presupposition here is that people cannot live together\ncooperatively or harmoniously if they cannot communicate with one\nanother effectively—if they are inadvertently calling different\nthings by the same names or the same things by different names. They\nwill think they are agreeing or disagreeing with one another when they\naren’t, and their intentions will be frustrated or blocked\n– notably, not by the conflict of wills that would result from\nambition, greed or selfishness (which might be true apart from this),\nbut by something more basic: the dumb incompetence of failing to use\nlanguage properly. The solution, accordingly, is to determine the\ncorrect use of language, the proper conditions under which its terms\nare used. “Is this object a horse?” “Is this ruler a\nking?” As Xunzi indicates, part of the method here hinges on the\ndescriptive program of comparing objects in question to others that\nare referred to by the same names and making judgments of similarity\nor difference. But Xunzi goes deeper. To make a judgment of similarity\nor difference, certain criteria must be used. But what, in turn,\njustifies these criteria? Xunzi insists that the analysis of language\nmust also “clarify the noble and base,” and this seems\nintended as an answer to just this question; it explains why he\nidentifies it as his first basic purpose in the analysis of\nterms. For only then is one in a position to undertake the second\npurpose of distinguishing the same and the different. That is, we know\nthat a judgment of similarity or difference is correct when it\ndistinguishes the noble from the base, the good from the bad.\nXunzi’s prioritizing of these two basic purposes suggests that\nthe ultimate aim of the investigation of language is to guide\nbehavior, to serve the normative function of providing standards for\nclarifying communicative intentions in a way that establishes a\njustificatory framework for resolving ethical disputes. Such a view\nseems to have been held widely in early China; it is suggested in the\nAnalects of Confucius in regards to the ordering of names,\nand it is clearly evident as a general orientation in the writings of\nthe Mohists, who hoped that the analysis of language would help to\nreveal semantic distinctions relevant to proper ethical conduct. The\nresult was an inevitable blending of disinterested analysis and\ndefinitional stipulation, insofar as it was held that language as a\nmedium for human discourse must not be neutral with respect to ethical\naims.\n\nGiven the great abundance of literature explicitly devoted to\ninterpreting and reconstructing early Chinese views on language, it is\nimpractical to attempt any exhaustive treatment here. To maintain\ncommon points of focus, attention will be restricted to those issues\nthat appear to have obvious bearing on early Chinese\nphilosophers’ interest in logic, specifically as it pertains to\ntheories of reason and inference, generally construed. Our main\nquestions are: How did early Chinese philosophers’ views about\nthe content and function of language contribute to their understanding\nof logic as the study of valid or correct inference? Secondly, in what\nway did their logical investigations influence their views about\nlanguage? Arguably, from the logician’s point of view, the\ngreatest insights of early Chinese philosophers’ studies of\nlogic and language are to be found in the later Mohists’ studies\nof intensionality, which appear to have influenced not only their\nspecific theories on the efficacy of argumentation but also their core\nideas about the nature and purpose of language. Further remarks\naddress central points of disagreement the Mohists had with their\nDaoist critics, particularly as evident in the writings of\n Zhuangzi,\n and Xunzi’s reinterpretation of Mohist logic from the vantage\npoint of his Confucian theory of ethics.\n",
    "section_title": "Preamble",
    "entry_title": "Logic and Language in Early Chinese Philosophy",
    "hierarchy_title": "Logic and Language in Early Chinese Philosophy || Preamble",
    "tokenized_text": [
        "growing",
        "attention",
        "paid",
        "recent",
        "year",
        "logical",
        "insight",
        "contribution",
        "philosopher",
        "major",
        "tradition",
        "early",
        "china",
        "particularly",
        "school",
        "name",
        "scholarship",
        "early",
        "chinese",
        "view",
        "logic",
        "language",
        "still",
        "tends",
        "concentrate",
        "contribution",
        "school",
        "mohism",
        "played",
        "central",
        "role",
        "debate",
        "philosopher",
        "major",
        "school",
        "thought",
        "china",
        "warring",
        "state",
        "period",
        "bce",
        "mohists",
        "helped",
        "critically",
        "refine",
        "early",
        "chinese",
        "conception",
        "content",
        "function",
        "logic",
        "language",
        "relation",
        "aspiration",
        "developing",
        "comprehensive",
        "ethical",
        "theory",
        "proper",
        "governance",
        "state",
        "individual",
        "role",
        "within",
        "arguably",
        "much",
        "mohists",
        "motivation",
        "developing",
        "theory",
        "credited",
        "mohists",
        "identified",
        "philosophical",
        "adversary",
        "antagonist",
        "point",
        "extends",
        "determination",
        "exhibited",
        "developing",
        "explicit",
        "philosophical",
        "theory",
        "logical",
        "reasoning",
        "among",
        "adversary",
        "follower",
        "confucius",
        "whose",
        "appeal",
        "authority",
        "established",
        "tradition",
        "justification",
        "ethical",
        "view",
        "mohists",
        "found",
        "objectionable",
        "advocate",
        "daoism",
        "whose",
        "view",
        "appeared",
        "undermine",
        "possibility",
        "invariable",
        "objective",
        "standard",
        "ethical",
        "conduct",
        "quite",
        "possibly",
        "compelling",
        "influence",
        "least",
        "regard",
        "development",
        "mohist",
        "logic",
        "sprang",
        "medley",
        "thinker",
        "dialectician",
        "traditionally",
        "associated",
        "school",
        "name",
        "explicit",
        "theory",
        "logical",
        "reasoning",
        "attributed",
        "school",
        "thinker",
        "associated",
        "reputation",
        "unexampled",
        "deftness",
        "practice",
        "dialectic",
        "argumentation",
        "regarded",
        "many",
        "scholar",
        "today",
        "among",
        "early",
        "china",
        "subtle",
        "practitioner",
        "logic",
        "fung",
        "a",
        "hand",
        "thinker",
        "also",
        "derided",
        "contemporary",
        "including",
        "mohists",
        "sophistry",
        "disposition",
        "muddle",
        "confuse",
        "apparent",
        "desire",
        "obscure",
        "proper",
        "use",
        "language",
        "whether",
        "master",
        "logical",
        "reasoning",
        "merely",
        "performer",
        "fallacious",
        "dialectic",
        "taken",
        "seriously",
        "enough",
        "opponent",
        "regarded",
        "threat",
        "order",
        "stability",
        "harmony",
        "society",
        "later",
        "mohists",
        "particular",
        "whose",
        "view",
        "logic",
        "language",
        "occupy",
        "greater",
        "part",
        "entry",
        "framed",
        "many",
        "argument",
        "way",
        "plausibly",
        "interpreted",
        "response",
        "view",
        "probably",
        "many",
        "later",
        "mohists",
        "logical",
        "linguistic",
        "insight",
        "owed",
        "puzzle",
        "frustration",
        "experienced",
        "effort",
        "supplant",
        "view",
        "honest",
        "integrity",
        "rigorous",
        "transpicuous",
        "idea",
        "somewhat",
        "difficult",
        "distinguish",
        "mohists",
        "logical",
        "insight",
        "view",
        "language",
        "part",
        "made",
        "attempt",
        "investigating",
        "formal",
        "logic",
        "independently",
        "interest",
        "analyzing",
        "semantics",
        "term",
        "language",
        "ming",
        "name",
        "developed",
        "clear",
        "theory",
        "inference",
        "supported",
        "theory",
        "version",
        "basic",
        "principle",
        "would",
        "recognize",
        "today",
        "central",
        "study",
        "logic",
        "argued",
        "rule",
        "governing",
        "inference",
        "partly",
        "determined",
        "semantics",
        "individual",
        "term",
        "term",
        "combination",
        "opposed",
        "rule",
        "merely",
        "operating",
        "argument",
        "logical",
        "form",
        "also",
        "difficult",
        "distinguish",
        "mohists",
        "attempt",
        "offering",
        "descriptive",
        "account",
        "content",
        "function",
        "language",
        "normative",
        "view",
        "role",
        "name",
        "expected",
        "play",
        "contribute",
        "elevation",
        "human",
        "character",
        "proper",
        "conduct",
        "society",
        "normative",
        "view",
        "held",
        "broadly",
        "early",
        "china",
        "especially",
        "clear",
        "writing",
        "xunzi",
        "confucian",
        "scholar",
        "late",
        "warring",
        "state",
        "period",
        "attempted",
        "assimilate",
        "key",
        "insight",
        "mohists",
        "language",
        "logic",
        "general",
        "confucian",
        "theory",
        "ethic",
        "lin",
        "book",
        "xunzi",
        "correct",
        "naming",
        "explains",
        "difference",
        "expression",
        "divergence",
        "thought",
        "communicate",
        "different",
        "thing",
        "obscurely",
        "confounded",
        "name",
        "object",
        "noble",
        "base",
        "clarified",
        "different",
        "distinguished",
        "case",
        "intent",
        "inevitably",
        "suffer",
        "frustration",
        "obstruction",
        "therefore",
        "wise",
        "made",
        "apportionment",
        "distinction",
        "instituted",
        "name",
        "point",
        "object",
        "first",
        "place",
        "order",
        "clarify",
        "noble",
        "base",
        "secondly",
        "distinguish",
        "different",
        "noble",
        "base",
        "clarified",
        "different",
        "distinguished",
        "intent",
        "hampered",
        "failure",
        "communicate",
        "action",
        "suffer",
        "frustration",
        "obstruction",
        "purpose",
        "name",
        "tr",
        "graham",
        "presupposition",
        "people",
        "live",
        "together",
        "cooperatively",
        "harmoniously",
        "communicate",
        "one",
        "another",
        "effectivelyif",
        "inadvertently",
        "calling",
        "different",
        "thing",
        "name",
        "thing",
        "different",
        "name",
        "think",
        "agreeing",
        "disagreeing",
        "one",
        "another",
        "intention",
        "frustrated",
        "blocked",
        "notably",
        "conflict",
        "will",
        "would",
        "result",
        "ambition",
        "greed",
        "selfishness",
        "might",
        "true",
        "apart",
        "something",
        "basic",
        "dumb",
        "incompetence",
        "failing",
        "use",
        "language",
        "properly",
        "solution",
        "accordingly",
        "determine",
        "correct",
        "use",
        "language",
        "proper",
        "condition",
        "term",
        "used",
        "object",
        "horse",
        "ruler",
        "king",
        "xunzi",
        "indicates",
        "part",
        "method",
        "hinge",
        "descriptive",
        "program",
        "comparing",
        "object",
        "question",
        "others",
        "referred",
        "name",
        "making",
        "judgment",
        "similarity",
        "difference",
        "xunzi",
        "go",
        "deeper",
        "make",
        "judgment",
        "similarity",
        "difference",
        "certain",
        "criterion",
        "must",
        "used",
        "turn",
        "justifies",
        "criterion",
        "xunzi",
        "insists",
        "analysis",
        "language",
        "must",
        "also",
        "clarify",
        "noble",
        "base",
        "seems",
        "intended",
        "answer",
        "question",
        "explains",
        "identifies",
        "first",
        "basic",
        "purpose",
        "analysis",
        "term",
        "one",
        "position",
        "undertake",
        "second",
        "purpose",
        "distinguishing",
        "different",
        "know",
        "judgment",
        "similarity",
        "difference",
        "correct",
        "distinguishes",
        "noble",
        "base",
        "good",
        "bad",
        "xunzi",
        "prioritizing",
        "two",
        "basic",
        "purpose",
        "suggests",
        "ultimate",
        "aim",
        "investigation",
        "language",
        "guide",
        "behavior",
        "serve",
        "normative",
        "function",
        "providing",
        "standard",
        "clarifying",
        "communicative",
        "intention",
        "way",
        "establishes",
        "justificatory",
        "framework",
        "resolving",
        "ethical",
        "dispute",
        "view",
        "seems",
        "held",
        "widely",
        "early",
        "china",
        "suggested",
        "analects",
        "confucius",
        "regard",
        "ordering",
        "name",
        "clearly",
        "evident",
        "general",
        "orientation",
        "writing",
        "mohists",
        "hoped",
        "analysis",
        "language",
        "would",
        "help",
        "reveal",
        "semantic",
        "distinction",
        "relevant",
        "proper",
        "ethical",
        "conduct",
        "result",
        "inevitable",
        "blending",
        "disinterested",
        "analysis",
        "definitional",
        "stipulation",
        "insofar",
        "held",
        "language",
        "medium",
        "human",
        "discourse",
        "must",
        "neutral",
        "respect",
        "ethical",
        "aim",
        "given",
        "great",
        "abundance",
        "literature",
        "explicitly",
        "devoted",
        "interpreting",
        "reconstructing",
        "early",
        "chinese",
        "view",
        "language",
        "impractical",
        "attempt",
        "exhaustive",
        "treatment",
        "maintain",
        "common",
        "point",
        "focus",
        "attention",
        "restricted",
        "issue",
        "appear",
        "obvious",
        "bearing",
        "early",
        "chinese",
        "philosopher",
        "interest",
        "logic",
        "specifically",
        "pertains",
        "theory",
        "reason",
        "inference",
        "generally",
        "construed",
        "main",
        "question",
        "early",
        "chinese",
        "philosopher",
        "view",
        "content",
        "function",
        "language",
        "contribute",
        "understanding",
        "logic",
        "study",
        "valid",
        "correct",
        "inference",
        "secondly",
        "way",
        "logical",
        "investigation",
        "influence",
        "view",
        "language",
        "arguably",
        "logician",
        "point",
        "view",
        "greatest",
        "insight",
        "early",
        "chinese",
        "philosopher",
        "study",
        "logic",
        "language",
        "found",
        "later",
        "mohists",
        "study",
        "intensionality",
        "appear",
        "influenced",
        "specific",
        "theory",
        "efficacy",
        "argumentation",
        "also",
        "core",
        "idea",
        "nature",
        "purpose",
        "language",
        "remark",
        "address",
        "central",
        "point",
        "disagreement",
        "mohists",
        "daoist",
        "critic",
        "particularly",
        "evident",
        "writing",
        "zhuangzi",
        "xunzi",
        "reinterpretation",
        "mohist",
        "logic",
        "vantage",
        "point",
        "confucian",
        "theory",
        "ethic"
    ]
}