{
    "main_text": "Why Interrogate Chinese Philosophical Texts? || The Comparative Approach\n3.2 The Comparative Approach\n For the great majority of Anglophone and European comparative\nphilosophers of China the Western philosophical heritage is the basis\nfor the comparisons. This may or may not be regrettable, but is in\nsome measure unavoidable because it is obviously the more familiar\ntradition and the ground of the comparativist’s views. It is\nhard to imagine any scholar essaying a translation of a text without\nsome knowledge of what it’s about, and its importance, and for\nphilosophers that “aboutness” and the importance stem from\nconceptions drawn from the translator’s own philosophical\ntraining, which is the kernel from which the interpretation will\ngrow. Obviously close and careful readings of the text can\nalter—perhaps significantly—the original interpretation\ngiven to it, but an interpretation of some kind we tend to have at all\ntimes when working with a Chinese classical text (or any other).\nSome texts wear their interpretations pretty much on their sleeves;\nit is hard to interpret the “Legalist” Hanfeizi\ntext as a Confucian treatise because of the extent to which it is a\ncriticism thereof, championing a system of regulations and laws that\nwas an anathema to The Master. Most Chinese classical texts are not,\nhowever, of this kind, as we should already expect from our earlier\ndiscussion about the classical language. They require a good deal of\ninterpretive analysis and evaluation. Almost none of them are pure,\nthe work of a single author and unaffected by the vagaries of history\nor the ravages of time. They are composites, with fragments of several\ntexts often strung together by we-know-not who, then burned in large\nquantities during the bibliographic holocaust of 213 BCE and the\ndestruction of the libraries during the civil war that followed soon\nafterward; with remaining copies re-assembled—again by the\nnameless—and that is pretty much the way they have come down to\nus. Greater understanding of several texts has come from unearthing\nvery old copies of them written on bamboo or silk at recently\nexcavated archaeological sites, particularly those at Mawangdui in\nHunan and Guodian in Hubei; but it remains that virtually every work\nwe have today is more or less corrupt.\n The composite nature of most texts also means there can be no tidy\nclassification system for them either, nor even for their parts at\ntimes: labelling this chapter of a text Daoist, or Mohist, and that\none more or less Confucian ignores the fact that there were a large\nnumber of ideas current in the classical period, with different\nthinkers adopting and adapting them in different ways. We may speak of\nlineages—the followers of a particularly gifted\nteacher—but few scholars any longer think of clear and distinct\nphilosophical “schools”.\nOne highly composite text—both ideologically and\ntemporally—is the Analects of Confucius, a long string\nof abbreviated statements by or about Confucius and his students, not\nput into its present form until at least two centuries after he died\nin 479 BCE (Kim and Csikszentmilhalyi 2014). Most translations and\nexegeses of the text place great emphasis on his ethics, and those of\nhis successors, especially Mencius. They have been interpreted against\nthe background of consequentialism (Im 2011); Christianity (Legge\n1871); Kantian (many mainland scholars ever since Liang Qichao and his\nstudent Mou Zongsan a century ago); as virtue ethics, Aristotelian and\notherwise (most comparativists working in the field today; see Tiwald\n2010); as Character ethicists (Kupperman 2004); as one among several\n“natural moralities” (Wong\n2006); or their views\nhave been addressed against the background of differing strands of\nfeminist ethics (Raphals 1998; Li 2000; Wang 2003; Rosenlee 2007).\n It would be a mistake to ask which of these readings of\nthe Analects or the early Confucians in general is\nthe correct one. In the first place, we must note that all of the\nethical theories save one are Western, and the questions focus on\nwhich one best fits with early Confucian writings. Even more\nbasically, the concept of ethics as a delimitable field of\nphilosophy is itself Western, not Chinese, which problematizes\neven more the question of “correctness”. Consequently the\ntranslator/exegete must constantly guard against reading out of the\ntext simply what he or she has read into it. Rather obviously\nConfucius and his successors could not hold all these ethical\npositions, and perhaps they didn’t hold any of them, or any\nethical theory at all. Thus all these interpretations can’t\npossibly be right, and more probably they are all of them wrong in at\nleast some respects.\nIndeed, perhaps even to suggest right and wrong is wrong here. If\nthe reader wants only to know what the statements in\nthe Analects originally meant to those who first heard them\nthen all these philosophical readings must be suspect in some\ndegree. A more purely narrative and less analytic/evaluative approach\nis called for.  Asking how much like Aristotle the sayings of Mencius\nmay be is different from ascertaining how King Liang heard them when\nMencius supposedly first spoke to him.\nAnswering the latter question is more often done by sinologists\nwith disciplinary training other than philosophy, in which the issues\nare more philological, etymological and historical (see Brooks and\nBrooks 2001), but a number of philosophers have well served the\nprofession by focusing heavily on the translation rather than\nexegetical side of comparative work, saving their exegetical remarks,\nif any, for introductions or notes (an older example is\nD.C. Lau’s Tao Te Ching (1963), a newer one Eric\nHutton’s Xunzi (2014)). Again, textual problems arising\nfrom this kind of activity tend to be more philological and historical\nthan exegetical or philosophical, even though the texts are basically\nphilosophical.\n Both questions, however, are important ones with respect to\ntranslation and textual exegesis, for both can generate significant\ninsights. Asking whether Confucius may be legitimately construed as a\ncloset consequentialist, or feminist, can enlarge the reader’s\nview of these ethical orientations, as well as illumine a number of\ndimensions of the Master’s views. On the other hand, striving to\ngive an account of a thinker or group of them at the time they lived\nallows readers more conceptual room to form their own judgements about\nthe value of the views in the translation and/or exegesis.\n We may see the same points with another type of comparative\ntextual scholarship done philosophically, examining similarities and\ndifferences between a specific Chinese and a specific Western\nthinker. One might take two intellectual giants from their cultures\nand juxtapose them, like Aristotle and Confucius (Sim 2007; Yu 2007;\nIvanhoe 2014). Or investigate how much like Kierkegaard’s\nanti-rationalist reaction to Hegel is Zhuangzi’s skepticism\nabout reason (Carr and Ivanhoe 2000). Or choose two disparate\nthinkers, and employ new comparative practices to elucidate some\nostensibly similar concepts in differing cultural contexts (Yearley\n1990).\n What can be learned from such studies? Taking the\nAristotle/Confucius comparisons, we learn just how much weight\nConfucius gave to rituals, family, customs and traditions as\nprerequisite for flourishing personal lives and social harmony, for\nexample. The weight grows even heavier when we reflect that Aristotle\nsaid almost nothing about rituals, family, customs and traditions,\nthough he dealt in great detail with great sensitivity in virtually\nall aspects of human life personal and social.  By his silence on\nritual matters he obliges us to look at Confucius’s insistence\non those dimensions of human life again.  He was deeply\nconcerned with ritual performance; why?\nIn the same way we may obtain new insights into Aristotelianism:\nthere are libraries full of commentaries on the writings of Aristotle\ngathered over the past two millennia, but it is doubtful that any of\nthem commented on the significance of the absence of any concern with\nritual matters in those writings. By placing Confucius alongside him\nthe lacunae quickly becomes obvious, and invites our\ncontemplation.\nAnother dimension of the comparative approach involves focusing on\na specific audience for the comparativist’s translation work and\ncommentary. If we believe the Mozi resembles Utilitarianism\nin many respects for instance, the writings of Bentham and Mill can\nserve well as the interpretive framework for our efforts. The specific\nsyntactic patterns and lexical items we employ, however, plus notes\nand commentary, will be somewhat different if we are basically writing\nfor a general audience of undergraduates or the general reader than if\nwe are trying to engage other philosophers of a Utilitarian persuasion\nin dialogue about the contribution(s) the Mohist views can\nmake to the further sophistication of the views of Bentham and Mill\n(Angle 2014: 229). And with only minor caveats, the same may be said\nfor exegeses of the text in comparative contexts.\n Many comparative philosophers also do strict exegeses no less than\ncomparative ones, focusing on simply explicating, against a\nphilosophical background, the dominant views of a person,\n“school”, text or concept.  Examples of each are Leo\nChang’s The Philosophical Foundations of Han Fei’s\nPolitical Theory (1986); Daoism Explained, by Hans-Georg\nMoeller (2011); Heaven, Earth and Man in the Book of Changes,\nby Hellmut Wilhelm (1977); and Ironies of Oneness and Difference:\nCoherence in Early Chinese Thought by Brook Ziporyn (2013).\n",
    "section_title": "3.2 The Comparative Approach",
    "entry_title": "Translating and Interpreting Chinese Philosophy",
    "hierarchy_title": "Translating and Interpreting Chinese Philosophy || Why Interrogate Chinese Philosophical Texts? || The Comparative Approach",
    "tokenized_text": [
        "interrogate",
        "chinese",
        "philosophical",
        "text",
        "comparative",
        "approach",
        "comparative",
        "approach",
        "great",
        "majority",
        "anglophone",
        "european",
        "comparative",
        "philosopher",
        "china",
        "western",
        "philosophical",
        "heritage",
        "basis",
        "comparison",
        "may",
        "may",
        "regrettable",
        "measure",
        "unavoidable",
        "obviously",
        "familiar",
        "tradition",
        "ground",
        "comparativist",
        "view",
        "hard",
        "imagine",
        "scholar",
        "essaying",
        "translation",
        "text",
        "without",
        "knowledge",
        "importance",
        "philosopher",
        "aboutness",
        "importance",
        "stem",
        "conception",
        "drawn",
        "translator",
        "philosophical",
        "training",
        "kernel",
        "interpretation",
        "grow",
        "obviously",
        "close",
        "careful",
        "reading",
        "text",
        "alterperhaps",
        "significantlythe",
        "original",
        "interpretation",
        "given",
        "interpretation",
        "kind",
        "tend",
        "time",
        "working",
        "chinese",
        "classical",
        "text",
        "text",
        "wear",
        "interpretation",
        "pretty",
        "much",
        "sleeve",
        "hard",
        "interpret",
        "legalist",
        "hanfeizi",
        "text",
        "confucian",
        "treatise",
        "extent",
        "criticism",
        "thereof",
        "championing",
        "system",
        "regulation",
        "law",
        "anathema",
        "master",
        "chinese",
        "classical",
        "text",
        "however",
        "kind",
        "already",
        "expect",
        "earlier",
        "discussion",
        "classical",
        "language",
        "require",
        "good",
        "deal",
        "interpretive",
        "analysis",
        "evaluation",
        "almost",
        "none",
        "pure",
        "work",
        "single",
        "author",
        "unaffected",
        "vagary",
        "history",
        "ravage",
        "time",
        "composite",
        "fragment",
        "several",
        "text",
        "often",
        "strung",
        "together",
        "weknownot",
        "burned",
        "large",
        "quantity",
        "bibliographic",
        "holocaust",
        "bce",
        "destruction",
        "library",
        "civil",
        "war",
        "followed",
        "soon",
        "afterward",
        "remaining",
        "copy",
        "reassembledagain",
        "namelessand",
        "pretty",
        "much",
        "way",
        "come",
        "u",
        "greater",
        "understanding",
        "several",
        "text",
        "come",
        "unearthing",
        "old",
        "copy",
        "written",
        "bamboo",
        "silk",
        "recently",
        "excavated",
        "archaeological",
        "site",
        "particularly",
        "mawangdui",
        "hunan",
        "guodian",
        "hubei",
        "remains",
        "virtually",
        "every",
        "work",
        "today",
        "le",
        "corrupt",
        "composite",
        "nature",
        "text",
        "also",
        "mean",
        "tidy",
        "classification",
        "system",
        "either",
        "even",
        "part",
        "time",
        "labelling",
        "chapter",
        "text",
        "daoist",
        "mohist",
        "one",
        "le",
        "confucian",
        "ignores",
        "fact",
        "large",
        "number",
        "idea",
        "current",
        "classical",
        "period",
        "different",
        "thinker",
        "adopting",
        "adapting",
        "different",
        "way",
        "may",
        "speak",
        "lineagesthe",
        "follower",
        "particularly",
        "gifted",
        "teacherbut",
        "scholar",
        "longer",
        "think",
        "clear",
        "distinct",
        "philosophical",
        "school",
        "one",
        "highly",
        "composite",
        "textboth",
        "ideologically",
        "temporallyis",
        "analects",
        "confucius",
        "long",
        "string",
        "abbreviated",
        "statement",
        "confucius",
        "student",
        "put",
        "present",
        "form",
        "least",
        "two",
        "century",
        "died",
        "bce",
        "kim",
        "csikszentmilhalyi",
        "translation",
        "exegesis",
        "text",
        "place",
        "great",
        "emphasis",
        "ethic",
        "successor",
        "especially",
        "mencius",
        "interpreted",
        "background",
        "consequentialism",
        "im",
        "christianity",
        "legge",
        "kantian",
        "many",
        "mainland",
        "scholar",
        "ever",
        "since",
        "liang",
        "qichao",
        "student",
        "mou",
        "zongsan",
        "century",
        "ago",
        "virtue",
        "ethic",
        "aristotelian",
        "otherwise",
        "comparativists",
        "working",
        "field",
        "today",
        "see",
        "tiwald",
        "character",
        "ethicist",
        "kupperman",
        "one",
        "among",
        "several",
        "natural",
        "morality",
        "wong",
        "view",
        "addressed",
        "background",
        "differing",
        "strand",
        "feminist",
        "ethic",
        "raphals",
        "li",
        "wang",
        "rosenlee",
        "would",
        "mistake",
        "ask",
        "reading",
        "analects",
        "early",
        "confucian",
        "general",
        "correct",
        "one",
        "first",
        "place",
        "must",
        "note",
        "ethical",
        "theory",
        "save",
        "one",
        "western",
        "question",
        "focus",
        "one",
        "best",
        "fit",
        "early",
        "confucian",
        "writing",
        "even",
        "basically",
        "concept",
        "ethic",
        "delimitable",
        "field",
        "philosophy",
        "western",
        "chinese",
        "problematizes",
        "even",
        "question",
        "correctness",
        "consequently",
        "translatorexegete",
        "must",
        "constantly",
        "guard",
        "reading",
        "text",
        "simply",
        "read",
        "rather",
        "obviously",
        "confucius",
        "successor",
        "could",
        "hold",
        "ethical",
        "position",
        "perhaps",
        "hold",
        "ethical",
        "theory",
        "thus",
        "interpretation",
        "possibly",
        "right",
        "probably",
        "wrong",
        "least",
        "respect",
        "indeed",
        "perhaps",
        "even",
        "suggest",
        "right",
        "wrong",
        "wrong",
        "reader",
        "want",
        "know",
        "statement",
        "analects",
        "originally",
        "meant",
        "first",
        "heard",
        "philosophical",
        "reading",
        "must",
        "suspect",
        "degree",
        "purely",
        "narrative",
        "le",
        "analyticevaluative",
        "approach",
        "called",
        "asking",
        "much",
        "like",
        "aristotle",
        "saying",
        "mencius",
        "may",
        "different",
        "ascertaining",
        "king",
        "liang",
        "heard",
        "mencius",
        "supposedly",
        "first",
        "spoke",
        "answering",
        "latter",
        "question",
        "often",
        "done",
        "sinologist",
        "disciplinary",
        "training",
        "philosophy",
        "issue",
        "philological",
        "etymological",
        "historical",
        "see",
        "brook",
        "brook",
        "number",
        "philosopher",
        "well",
        "served",
        "profession",
        "focusing",
        "heavily",
        "translation",
        "rather",
        "exegetical",
        "side",
        "comparative",
        "work",
        "saving",
        "exegetical",
        "remark",
        "introduction",
        "note",
        "older",
        "example",
        "dc",
        "lau",
        "tao",
        "te",
        "ching",
        "newer",
        "one",
        "eric",
        "hutton",
        "xunzi",
        "textual",
        "problem",
        "arising",
        "kind",
        "activity",
        "tend",
        "philological",
        "historical",
        "exegetical",
        "philosophical",
        "even",
        "though",
        "text",
        "basically",
        "philosophical",
        "question",
        "however",
        "important",
        "one",
        "respect",
        "translation",
        "textual",
        "exegesis",
        "generate",
        "significant",
        "insight",
        "asking",
        "whether",
        "confucius",
        "may",
        "legitimately",
        "construed",
        "closet",
        "consequentialist",
        "feminist",
        "enlarge",
        "reader",
        "view",
        "ethical",
        "orientation",
        "well",
        "illumine",
        "number",
        "dimension",
        "master",
        "view",
        "hand",
        "striving",
        "give",
        "account",
        "thinker",
        "group",
        "time",
        "lived",
        "allows",
        "reader",
        "conceptual",
        "room",
        "form",
        "judgement",
        "value",
        "view",
        "translation",
        "andor",
        "exegesis",
        "may",
        "see",
        "point",
        "another",
        "type",
        "comparative",
        "textual",
        "scholarship",
        "done",
        "philosophically",
        "examining",
        "similarity",
        "difference",
        "specific",
        "chinese",
        "specific",
        "western",
        "thinker",
        "one",
        "might",
        "take",
        "two",
        "intellectual",
        "giant",
        "culture",
        "juxtapose",
        "like",
        "aristotle",
        "confucius",
        "sim",
        "yu",
        "ivanhoe",
        "investigate",
        "much",
        "like",
        "kierkegaard",
        "antirationalist",
        "reaction",
        "hegel",
        "zhuangzi",
        "skepticism",
        "reason",
        "carr",
        "ivanhoe",
        "choose",
        "two",
        "disparate",
        "thinker",
        "employ",
        "new",
        "comparative",
        "practice",
        "elucidate",
        "ostensibly",
        "similar",
        "concept",
        "differing",
        "cultural",
        "context",
        "yearley",
        "learned",
        "study",
        "taking",
        "aristotleconfucius",
        "comparison",
        "learn",
        "much",
        "weight",
        "confucius",
        "gave",
        "ritual",
        "family",
        "custom",
        "tradition",
        "prerequisite",
        "flourishing",
        "personal",
        "life",
        "social",
        "harmony",
        "example",
        "weight",
        "grows",
        "even",
        "heavier",
        "reflect",
        "aristotle",
        "said",
        "almost",
        "nothing",
        "ritual",
        "family",
        "custom",
        "tradition",
        "though",
        "dealt",
        "great",
        "detail",
        "great",
        "sensitivity",
        "virtually",
        "aspect",
        "human",
        "life",
        "personal",
        "social",
        "silence",
        "ritual",
        "matter",
        "obliges",
        "u",
        "look",
        "confucius",
        "insistence",
        "dimension",
        "human",
        "life",
        "deeply",
        "concerned",
        "ritual",
        "performance",
        "way",
        "may",
        "obtain",
        "new",
        "insight",
        "aristotelianism",
        "library",
        "full",
        "commentary",
        "writing",
        "aristotle",
        "gathered",
        "past",
        "two",
        "millennium",
        "doubtful",
        "commented",
        "significance",
        "absence",
        "concern",
        "ritual",
        "matter",
        "writing",
        "placing",
        "confucius",
        "alongside",
        "lacuna",
        "quickly",
        "becomes",
        "obvious",
        "invite",
        "contemplation",
        "another",
        "dimension",
        "comparative",
        "approach",
        "involves",
        "focusing",
        "specific",
        "audience",
        "comparativist",
        "translation",
        "work",
        "commentary",
        "believe",
        "mozi",
        "resembles",
        "utilitarianism",
        "many",
        "respect",
        "instance",
        "writing",
        "bentham",
        "mill",
        "serve",
        "well",
        "interpretive",
        "framework",
        "effort",
        "specific",
        "syntactic",
        "pattern",
        "lexical",
        "item",
        "employ",
        "however",
        "plus",
        "note",
        "commentary",
        "somewhat",
        "different",
        "basically",
        "writing",
        "general",
        "audience",
        "undergraduate",
        "general",
        "reader",
        "trying",
        "engage",
        "philosopher",
        "utilitarian",
        "persuasion",
        "dialogue",
        "contribution",
        "mohist",
        "view",
        "make",
        "sophistication",
        "view",
        "bentham",
        "mill",
        "angle",
        "minor",
        "caveat",
        "may",
        "said",
        "exegesis",
        "text",
        "comparative",
        "context",
        "many",
        "comparative",
        "philosopher",
        "also",
        "strict",
        "exegesis",
        "le",
        "comparative",
        "one",
        "focusing",
        "simply",
        "explicating",
        "philosophical",
        "background",
        "dominant",
        "view",
        "person",
        "school",
        "text",
        "concept",
        "example",
        "leo",
        "chang",
        "philosophical",
        "foundation",
        "han",
        "fei",
        "political",
        "theory",
        "daoism",
        "explained",
        "hansgeorg",
        "moeller",
        "heaven",
        "earth",
        "man",
        "book",
        "change",
        "hellmut",
        "wilhelm",
        "irony",
        "oneness",
        "difference",
        "coherence",
        "early",
        "chinese",
        "thought",
        "brook",
        "ziporyn"
    ]
}