{
    "main_text": "The Larger Philosophical Issues || Mind and Body\n5.3 Mind and Body\n\nSeveral critics have noted that there are metaphysical issues at stake\nin the original argument. The Systems Reply draws attention to the\nmetaphysical problem of the relation of mind to body. It does this in\nholding that understanding is a property of the system as a whole, not\nthe physical implementer. The Virtual Mind Reply holds that minds or\npersons – the entities that understand and are conscious –\nare more abstract than any physical system, and that there could be a\nmany-to-one relation between minds and physical systems. (Even if\neverything is physical, in principle a single body could be shared by\nmultiple minds, and a single mind could have a sequence of bodies over\ntime.) Thus larger issues about personal identity and the relation of\nmind and body are in play in the debate between Searle and some of his\ncritics.\n\nSearle’s view is that the problem the relation of mind and body\n“has a rather simple solution. Here it is: Conscious states are\ncaused by lower level neurobiological processes in the brain and are\nthemselves higher level features of the brain” (Searle 2002b, p.\n9). In his early discussion of the CRA, Searle spoke of the causal\npowers of the brain. Thus his view appears to be that brain states\ncause consciousness and understanding, and “consciousness is\njust a feature of the brain” (ibid). However, as we have seen,\neven if this is true it begs the question of just whose consciousness\na brain creates. Roger Sperry’s split-brain experiments suggest\nthat perhaps there can be two centers of consciousness, and so in that\nsense two minds, implemented by a single brain. While both display at\nleast some language comprehension, only one (typically created by the\nleft hemisphere) controls language production. Thus many current\napproaches to understanding the relation of brain and consciousness\nemphasize connectedness and information flow (see e.g. Dehaene 2014).\n\n\nConsciousness and understanding are features of persons, so it appears\nthat Searle accepts a metaphysics in which I, my conscious self, am\nidentical with my brain – a form of mind-brain identity theory.\nThis very concrete metaphysics is reflected in Searle’s original\npresentation of the CR argument, in which Strong AI was described by\nhim as the claim that “the appropriately programmed computer\nreally is a mind” (Searle 1980). This is an identity claim, and\nhas odd consequences. If A and B are identical, any property of A is a\nproperty of B. Computers are physical objects. Some computers weigh 6\nlbs and have stereo speakers. So the claim that Searle called Strong\nAI would entail that some minds weigh 6 lbs and have stereo speakers.\nHowever it seems to be clear that while humans may weigh 150 pounds;\nhuman minds do not weigh 150 pounds. This suggests that neither bodies\nnor machines can literally be minds. Such considerations support the\nview that minds are more abstract that brains, and if so that at least\none version of the claim that Searle calls Strong AI, the version that\nsays that computers literally are minds, is metaphysically untenable\non the face of it, apart from any thought-experiments.\n\nSearle’s CR argument was thus directed against the claim that a\ncomputer is a mind, that a suitably programmed digital computer\nunderstands language, or that its program does. Searle’s thought\nexperiment appeals to our strong intuition that someone who did\nexactly what the computer does would not thereby come to understand\nChinese. As noted above, many critics have held that Searle is quite\nright on this point – no matter how you program a computer, the\ncomputer will not literally be a mind and the computer will not\nunderstand natural language. But if minds are not physical objects\nthis inability of a computer to be a mind does not show that running\nan AI program cannot produce understanding of natural\nlanguage, by something other than the computer (See section 4.1\nabove.) \n\nFunctionalism\n is a theory of the relation of minds to bodies that was developed in\nthe two decades prior to Searle’s CRA. Functionalism is an\nalternative to the identity theory that is implicit in much of\nSearle’s discussion, as well as to the dominant behaviorism of\nthe mid-Twentieth Century. If functionalism is correct, there appears\nto be no intrinsic reason why a computer couldn’t have mental\nstates. Hence the CRA’s conclusion that a computer is\nintrinsically incapable of mental states is an important consideration\nagainst functionalism. Julian Baggini (2009, 37) writes that Searle\n“came up with perhaps the most famous counter-example in history\n– the Chinese room argument – and in one intellectual\npunch inflicted so much damage on the then dominant theory of\nfunctionalism that many would argue it has never recovered.”\n\nFunctionalists hold that a mental state is what a mental\nstate does – the causal (or “functional”)\nrole that the state plays determines what state it is. A functionalist\nmight hold that pain, for example, is a state that is typically caused\nby damage to the body, is located in a body-image, and is aversive.\nFunctionalists distance themselves both from behaviorists and identity\ntheorists. In contrast with the former, functionalists hold that the\ninternal causal processes are important for the possession of\nmental states. Thus functionalists may agree with Searle in rejecting\nthe Turing Test as too behavioristic. In contrast with identity\ntheorists (who might e.g. hold “pain is identical with C-fiber\nfiring”), functionalists hold that mental states might be had by\na variety of physical systems (or non-physical, as in Cole and Foelber\n1984, in which a mind changes from a material to an immaterial\nimplementation, neuron by neuron). Thus while an identity theorist\nwill identify pain with certain neuron firings, a functionalist will\nidentify pain with something more abstract and higher level, a\nfunctional role that might be had by many different types of\nunderlying system. \n\nFunctionalists accuse identity theorists of substance chauvinism.\nHowever, functionalism remains controversial: functionalism is\nvulnerable to the Chinese Nation type objections discussed above, and\nfunctionalists notoriously have trouble explaining qualia, a problem\nhighlighted by the apparent possibility of an inverted spectrum, where\nqualitatively different states might have the same functional role\n(e.g. Block 1978, Maudlin 1989, Cole 1990).\n\nComputationalism\n is the sub-species of functionalism that holds that the important\ncausal role of brain processes is information processing. Milkowski\n2017 notes that computational approaches have been fruitful in\ncognitive science; he surveys objections to computationalism and\nconcludes that the majority target a strawman version. However Jerry\nFodor, an early proponent of computational approaches, argues in Fodor\n2005 that key mental processes, such as inference to the best\nexplanation, which depend on non-local properties of representations,\ncannot be explained by computational modules in the brain. If Fodor is\nright, understanding language and interpretation appear to involve\nglobal considerations such as linguistic and non-linguistic context\nand theory of mind and so might resist computational explanation. If\nso, we reach Searle’s conclusion on the basis of different\nconsiderations. \n\nSearle’s 2010 statement of the conclusion of the CRA has it\nshowing that computational accounts cannot explain consciousness.\nThere has been considerable interest in the decades since 1980 in\ndetermining what does explain consciousness, and this has been an\nextremely active research area across disciplines. One interest has\nbeen in the neural correlates of consciousness. This bears directly on\nSearle’s claim that consciousness is intrinsically biological\nand not computational or information processing. There is no\ndefinitive answer yet, though some recent work on anesthesia suggests\nthat consciousness is lost when cortical (and cortico-thalamic)\nconnections and information flow are disrupted (e.g.Hudetz 2012, a\nreview article). \n\nIn general, if the basis of consciousness is confirmed to be at the\nrelatively abstract level of information flow through neural networks,\nit will be friendly to functionalism, and if it is turns out to be\nlower and more biological (or sub-neuronal), it will be friendly to\nSearle’s account.\n\nThese controversial biological and metaphysical issues bear on the\ncentral inference in the Chinese Room argument. From the intuition\nthat in the CR thought experiment he would not understand Chinese by\nrunning a program, Searle infers that there is no understanding\ncreated by running a program. Clearly, whether that inference is valid\nor not turns on a metaphysical question about the identity of persons\nand minds. If the person understanding is not identical with the room\noperator, then the inference is unsound.\n",
    "section_title": "5.3 Mind and Body",
    "entry_title": "The Chinese Room Argument",
    "hierarchy_title": "The Chinese Room Argument || The Larger Philosophical Issues || Mind and Body",
    "tokenized_text": [
        "larger",
        "philosophical",
        "issue",
        "mind",
        "body",
        "mind",
        "body",
        "several",
        "critic",
        "noted",
        "metaphysical",
        "issue",
        "stake",
        "original",
        "argument",
        "system",
        "reply",
        "draw",
        "attention",
        "metaphysical",
        "problem",
        "relation",
        "mind",
        "body",
        "holding",
        "understanding",
        "property",
        "system",
        "whole",
        "physical",
        "implementer",
        "virtual",
        "mind",
        "reply",
        "hold",
        "mind",
        "person",
        "entity",
        "understand",
        "conscious",
        "abstract",
        "physical",
        "system",
        "could",
        "manytoone",
        "relation",
        "mind",
        "physical",
        "system",
        "even",
        "everything",
        "physical",
        "principle",
        "single",
        "body",
        "could",
        "shared",
        "multiple",
        "mind",
        "single",
        "mind",
        "could",
        "sequence",
        "body",
        "time",
        "thus",
        "larger",
        "issue",
        "personal",
        "identity",
        "relation",
        "mind",
        "body",
        "play",
        "debate",
        "searle",
        "critic",
        "searle",
        "view",
        "problem",
        "relation",
        "mind",
        "body",
        "rather",
        "simple",
        "solution",
        "conscious",
        "state",
        "caused",
        "lower",
        "level",
        "neurobiological",
        "process",
        "brain",
        "higher",
        "level",
        "feature",
        "brain",
        "searle",
        "b",
        "p",
        "early",
        "discussion",
        "cra",
        "searle",
        "spoke",
        "causal",
        "power",
        "brain",
        "thus",
        "view",
        "appears",
        "brain",
        "state",
        "cause",
        "consciousness",
        "understanding",
        "consciousness",
        "feature",
        "brain",
        "ibid",
        "however",
        "seen",
        "even",
        "true",
        "begs",
        "question",
        "whose",
        "consciousness",
        "brain",
        "creates",
        "roger",
        "sperry",
        "splitbrain",
        "experiment",
        "suggest",
        "perhaps",
        "two",
        "center",
        "consciousness",
        "sense",
        "two",
        "mind",
        "implemented",
        "single",
        "brain",
        "display",
        "least",
        "language",
        "comprehension",
        "one",
        "typically",
        "created",
        "left",
        "hemisphere",
        "control",
        "language",
        "production",
        "thus",
        "many",
        "current",
        "approach",
        "understanding",
        "relation",
        "brain",
        "consciousness",
        "emphasize",
        "connectedness",
        "information",
        "flow",
        "see",
        "eg",
        "dehaene",
        "consciousness",
        "understanding",
        "feature",
        "person",
        "appears",
        "searle",
        "accepts",
        "metaphysics",
        "conscious",
        "self",
        "identical",
        "brain",
        "form",
        "mindbrain",
        "identity",
        "theory",
        "concrete",
        "metaphysics",
        "reflected",
        "searle",
        "original",
        "presentation",
        "cr",
        "argument",
        "strong",
        "ai",
        "described",
        "claim",
        "appropriately",
        "programmed",
        "computer",
        "really",
        "mind",
        "searle",
        "identity",
        "claim",
        "odd",
        "consequence",
        "b",
        "identical",
        "property",
        "property",
        "b",
        "computer",
        "physical",
        "object",
        "computer",
        "weigh",
        "lb",
        "stereo",
        "speaker",
        "claim",
        "searle",
        "called",
        "strong",
        "ai",
        "would",
        "entail",
        "mind",
        "weigh",
        "lb",
        "stereo",
        "speaker",
        "however",
        "seems",
        "clear",
        "human",
        "may",
        "weigh",
        "pound",
        "human",
        "mind",
        "weigh",
        "pound",
        "suggests",
        "neither",
        "body",
        "machine",
        "literally",
        "mind",
        "consideration",
        "support",
        "view",
        "mind",
        "abstract",
        "brain",
        "least",
        "one",
        "version",
        "claim",
        "searle",
        "call",
        "strong",
        "ai",
        "version",
        "say",
        "computer",
        "literally",
        "mind",
        "metaphysically",
        "untenable",
        "face",
        "apart",
        "thoughtexperiments",
        "searle",
        "cr",
        "argument",
        "thus",
        "directed",
        "claim",
        "computer",
        "mind",
        "suitably",
        "programmed",
        "digital",
        "computer",
        "understands",
        "language",
        "program",
        "searle",
        "thought",
        "experiment",
        "appeal",
        "strong",
        "intuition",
        "someone",
        "exactly",
        "computer",
        "would",
        "thereby",
        "come",
        "understand",
        "chinese",
        "noted",
        "many",
        "critic",
        "held",
        "searle",
        "quite",
        "right",
        "point",
        "matter",
        "program",
        "computer",
        "computer",
        "literally",
        "mind",
        "computer",
        "understand",
        "natural",
        "language",
        "mind",
        "physical",
        "object",
        "inability",
        "computer",
        "mind",
        "show",
        "running",
        "ai",
        "program",
        "produce",
        "understanding",
        "natural",
        "language",
        "something",
        "computer",
        "see",
        "section",
        "functionalism",
        "theory",
        "relation",
        "mind",
        "body",
        "developed",
        "two",
        "decade",
        "prior",
        "searle",
        "cra",
        "functionalism",
        "alternative",
        "identity",
        "theory",
        "implicit",
        "much",
        "searle",
        "discussion",
        "well",
        "dominant",
        "behaviorism",
        "midtwentieth",
        "century",
        "functionalism",
        "correct",
        "appears",
        "intrinsic",
        "reason",
        "computer",
        "mental",
        "state",
        "hence",
        "cra",
        "conclusion",
        "computer",
        "intrinsically",
        "incapable",
        "mental",
        "state",
        "important",
        "consideration",
        "functionalism",
        "julian",
        "baggini",
        "writes",
        "searle",
        "came",
        "perhaps",
        "famous",
        "counterexample",
        "history",
        "chinese",
        "room",
        "argument",
        "one",
        "intellectual",
        "punch",
        "inflicted",
        "much",
        "damage",
        "dominant",
        "theory",
        "functionalism",
        "many",
        "would",
        "argue",
        "never",
        "recovered",
        "functionalist",
        "hold",
        "mental",
        "state",
        "mental",
        "state",
        "causal",
        "functional",
        "role",
        "state",
        "play",
        "determines",
        "state",
        "functionalist",
        "might",
        "hold",
        "pain",
        "example",
        "state",
        "typically",
        "caused",
        "damage",
        "body",
        "located",
        "bodyimage",
        "aversive",
        "functionalist",
        "distance",
        "behaviorist",
        "identity",
        "theorist",
        "contrast",
        "former",
        "functionalist",
        "hold",
        "internal",
        "causal",
        "process",
        "important",
        "possession",
        "mental",
        "state",
        "thus",
        "functionalist",
        "may",
        "agree",
        "searle",
        "rejecting",
        "turing",
        "test",
        "behavioristic",
        "contrast",
        "identity",
        "theorist",
        "might",
        "eg",
        "hold",
        "pain",
        "identical",
        "cfiber",
        "firing",
        "functionalist",
        "hold",
        "mental",
        "state",
        "might",
        "variety",
        "physical",
        "system",
        "nonphysical",
        "cole",
        "foelber",
        "mind",
        "change",
        "material",
        "immaterial",
        "implementation",
        "neuron",
        "neuron",
        "thus",
        "identity",
        "theorist",
        "identify",
        "pain",
        "certain",
        "neuron",
        "firing",
        "functionalist",
        "identify",
        "pain",
        "something",
        "abstract",
        "higher",
        "level",
        "functional",
        "role",
        "might",
        "many",
        "different",
        "type",
        "underlying",
        "system",
        "functionalist",
        "accuse",
        "identity",
        "theorist",
        "substance",
        "chauvinism",
        "however",
        "functionalism",
        "remains",
        "controversial",
        "functionalism",
        "vulnerable",
        "chinese",
        "nation",
        "type",
        "objection",
        "discussed",
        "functionalist",
        "notoriously",
        "trouble",
        "explaining",
        "qualia",
        "problem",
        "highlighted",
        "apparent",
        "possibility",
        "inverted",
        "spectrum",
        "qualitatively",
        "different",
        "state",
        "might",
        "functional",
        "role",
        "eg",
        "block",
        "maudlin",
        "cole",
        "computationalism",
        "subspecies",
        "functionalism",
        "hold",
        "important",
        "causal",
        "role",
        "brain",
        "process",
        "information",
        "processing",
        "milkowski",
        "note",
        "computational",
        "approach",
        "fruitful",
        "cognitive",
        "science",
        "survey",
        "objection",
        "computationalism",
        "concludes",
        "majority",
        "target",
        "strawman",
        "version",
        "however",
        "jerry",
        "fodor",
        "early",
        "proponent",
        "computational",
        "approach",
        "argues",
        "fodor",
        "key",
        "mental",
        "process",
        "inference",
        "best",
        "explanation",
        "depend",
        "nonlocal",
        "property",
        "representation",
        "explained",
        "computational",
        "module",
        "brain",
        "fodor",
        "right",
        "understanding",
        "language",
        "interpretation",
        "appear",
        "involve",
        "global",
        "consideration",
        "linguistic",
        "nonlinguistic",
        "context",
        "theory",
        "mind",
        "might",
        "resist",
        "computational",
        "explanation",
        "reach",
        "searle",
        "conclusion",
        "basis",
        "different",
        "consideration",
        "searle",
        "statement",
        "conclusion",
        "cra",
        "showing",
        "computational",
        "account",
        "explain",
        "consciousness",
        "considerable",
        "interest",
        "decade",
        "since",
        "determining",
        "explain",
        "consciousness",
        "extremely",
        "active",
        "research",
        "area",
        "across",
        "discipline",
        "one",
        "interest",
        "neural",
        "correlate",
        "consciousness",
        "bear",
        "directly",
        "searle",
        "claim",
        "consciousness",
        "intrinsically",
        "biological",
        "computational",
        "information",
        "processing",
        "definitive",
        "answer",
        "yet",
        "though",
        "recent",
        "work",
        "anesthesia",
        "suggests",
        "consciousness",
        "lost",
        "cortical",
        "corticothalamic",
        "connection",
        "information",
        "flow",
        "disrupted",
        "eghudetz",
        "review",
        "article",
        "general",
        "basis",
        "consciousness",
        "confirmed",
        "relatively",
        "abstract",
        "level",
        "information",
        "flow",
        "neural",
        "network",
        "friendly",
        "functionalism",
        "turn",
        "lower",
        "biological",
        "subneuronal",
        "friendly",
        "searle",
        "account",
        "controversial",
        "biological",
        "metaphysical",
        "issue",
        "bear",
        "central",
        "inference",
        "chinese",
        "room",
        "argument",
        "intuition",
        "cr",
        "thought",
        "experiment",
        "would",
        "understand",
        "chinese",
        "running",
        "program",
        "searle",
        "infers",
        "understanding",
        "created",
        "running",
        "program",
        "clearly",
        "whether",
        "inference",
        "valid",
        "turn",
        "metaphysical",
        "question",
        "identity",
        "person",
        "mind",
        "person",
        "understanding",
        "identical",
        "room",
        "operator",
        "inference",
        "unsound"
    ]
}