{
    "main_text": "Nurturing Life (yang sheng)\n2. Nurturing Life (yang sheng)\n\n\nSeveral Warring States texts express the need to preserve\none’s person, self, or essential nature:\n\n\nTherefore the sage puts his person last and it comes first, Treats\nit as extraneous and it is preserved. (Daode jing, chap.\n7)\n\n\nOne way to do this was to maintain health by nurturing life\n(yang sheng), an area of common ground for speculative\nthinkers and practitioners of traditional medical arts. The term\nyang sheng first appears in the Zhuangzi and\nthen throughout a range of second (BCE) century medical literature.\n\n\nThe third chapter of the Zhuangzi is titled “The Lord\nof Nurturing Life” (Yang sheng zhu\n養生主). In it, the expert butcher Pao Ding\ninstructs Duke Hui of Liang. Pao Ding describes the process of\nmastering his skill. His method is initially analytic; he begins by\nstudying oxen as wholes, next as parts, and finally with faculties\nbeyond ordinary vision. This discourse is presented as an instruction\nto the Lord Wenhui, who ends by saying that: “Pao Ding has taught\nme how to nurture life” (yang sheng, Zhuangzi\n3, 124, cf. Watson 2013, 20).\n\n\nAnother passage in the Outer Chapters refers to some of these\nexercises. It contrasts “real sages” who follow the way of\nheaven and earth with (among others) practitioners of “nurturing\nlife” traditions who:\n\n\nblow out, breathe in, old out, new in, dormant like the bear,\nneck-stretched like the bird, their only care for longevity; these are\nthe practitioners of “guide-and-pull” [dao yin\n導引] and “nourishing the body” [yang\nxing 養形] who desire the longevity of Pengzu\n(Zhuangzi 15, 535, cf. Watson 2013, 119).\n\n\nThe passage continues. Real sages:\n\n\ncultivate [their persons] without benevolence and righteousness,\ngovern without merit or fame, are at ease without needing rivers and\nseas, attain longevity without “guiding and pulling,”\nforget everything but lack for nothing, placid without limit, things of\nvalue follow upon them (ch. 15, 537, cf. Graham 1986a, 265;\nWatson 2013, 119).\n\n\nSince the whole point of the Zhuangzi passage is to oppose\n“guiding and pulling” and other longevity techniques to\ntrue sagehood, it does not dwell on their details. We can get a better\nidea of what he might have been talking about from other sources. Some\nof these ideas are elaborated in a chapter of the Guanzi\ntitled “Inner Cultivation” (Nei ye), which\ndescribes the cultivation of qi, as well as vital essence\n(jing), and spirit (shen). It describes Dao as\nliterally pervading the body or the person of a sage:\n\n\nSo long as the wellspring is not exhausted, \nThe passages of the nine apertures will remain clear.\nThus it is possible to explore the limits of Heaven and Earth, and\ncover the four seas. (Guanzi 16.3a8–3b1; trans. Rickett\n1998, 48).\n\n\nThe Zhuangzi and other texts refer to the figure of the\nspirit person or shen ren 神人 as someone who has\neffectively transformed the physical body and the qi that\nconstitutes it. The Zhuangzi describes spirit person of Guye,\nwho concentrates his spirit (shen), avoids the five grains,\nrides the clouds, and, through the concentration of his shen\nprotects others against sicknesses and epidemics and makes the harvest\nripen (Zhuangzi 1, 28; cf. Graham, 1986a, 46). This passage\nsuggests that a sage can have a nurturing effect on the world by acting\nat a distance, possibly as an unintended by-product of self-cultivation\npractices.\n\n\nOther passages in the Zhuangzi extol the abilities of\nspecialized craftsmen who possess highly technical skills. These\nstories liken mastery of the Way to mastery of a craft. They also\nemphasize the technical skills of commoners. Commoners, rather than\nrulers, are presented as sage-like figures. These technical experts\ninclude arrow makers, bell-stand carvers, boatmen, butchers, cicada\ncatchers, potters, sword makers, and wheelwrights (Raphals 2005). It is\ncurious that these passages never include physicians. \n\n\nIn the Han dynasty, “nurturing life” techniques became a\nmajor concern of the Recipe Masters (fang shi) of the Han\ncourt (Ngo 1976). Texts on nurturing life include methods for absorbing\nand circulating qi in the body—for example, breathing and\nmeditation exercises, diet, drugs and sexual techniques.\n\n\nMedical and mantic texts excavated from tombs make it clear that a\nwide range of longevity techniques had been developed before the Han\ndynasty (Harper 1998, 33). Most important is a corpus of medical\nmanuscripts excavated from Mawangdui 馬王堆\n(Changsha, Hubei), dated to 169 BCE. This tomb is best known for its\ntwo versions of the Daode jing, but it is meaningful to locate\nthose texts among other texts of a scientific provenance found in the\ntomb (Harper 1998 and 2000, Ma Jixing 1992, Zhou Yimou 1994, Zhou \nYimou and Xiao Zuotai 1987).\n\n\nSix of the medical manuscripts are concerned with nurturing life in\nvarious ways. “Harmonizing Yin and Yang” (He yin\nyang 合陰陽) and “Discussion of the\nRealized Way of All Under Heaven” (Tianxia zhi dao tan\n天下至道談) are concerned with sexual\ncultivation. They refer to the movements and postures of animals as\nwhole-body metaphors for sexual techniques. An example is the\ndescription of ten postures in “Harmonizing Yin and\nYang”:\n\n\nThe ten postures: the first is “tiger roving”; the second\nis “cicada clinging”; the third is “measuring\nworm”; the fourth is “river deer butting”; the fifth\nis “locust splayed”; the sixth is “gibbon\ngrabbing”; the seventh is “toad”; the eighth is\n“rabbit bolting”; the ninth is “dragonfly”;\nthe tenth is “fish gobbling.” (Harper 1998,\n418)\n\n\nThese texts emphasize that sexual activity is a natural process, but\none that must be regulated. As the “Realized Way of All Under\nHeaven” puts it, people know by nature how to breathe and how to\neat, but everything else is a matter of learning and habit. “What\nassists life is eating; what injures life is lust. Therefore the sage\nwhen conjoining male and female invariably possesses a model”\n(Zhou and Xiao 1989, 431; Harper 1998, 432).\n\n\n“Recipes for Nurturing Life” (Yang sheng fang\n養生方) consists of eighty-seven recipes, including\nfood, drugs, and beverages, along with several sexual cultivation\nexercises. “Eliminating Grain and Eating Vapor” (Que gu\nshi qi 卻榖食氣) specifies diet and\nbreathing exercises to be performed in the morning and evening, and a\nseasonal regimen of breath cultivation through consuming six qi and\navoiding another five (Harper 1998, 25–30). Another text, the\n“Ten Questions” (Shi wen 十問) gives\nadvice on techniques for nurturing life (Harper 1998, 22–30), for\nexample:\n\n\nYao asked Shun: “In Under-heaven what is most\nvaluable?”\n\nShun replied: “Life is most valuable.”\n\nYao said: “How can life be cultivated?” Shun said:\n“Investigate yin and yang.” (Zhou Yimou and Xiao Zuotao\n1989, 379; Harper 1998, 399)\n\n\n\nFinally, the “Drawings of Guiding and Pulling”\n(Daoyin tu 導引圖) is a series of forty-four\ndrawings of human figures performing exercises, some with captions.\nSome are described in another excavated text from tomb no. 247,\nZhangjiashan 張家山 (Jiangling, Hubei). The\n“Pulling Book” (Yin shu 引書) from\nZhangjiashan describes exercises that refer to or are named after\nanimals, including inchworms, snakes, mantises, wild ducks, owls,\ntigers, chickens, bears, frogs, deer, and dragons. Both exemplify a\ntradition of exercise for both therapy and health known as\ndaoyin (pulling and guiding).\n\n\nThe “yang sheng culture” of these texts\nemphasized control over physiological and mental processes, both\nunderstood as self-cultivation, through the transformation of qi.\n“Self-cultivation” in this context included moral\nexcellence, health, and longevity (V. Lo 2001).\n\n\nWe can get a broader notion of what these techniques were like if we\nturn to the list of titles from the “Recipes and Methods”\nsection of the Han shu Bibliographic Treatise, mentioned\nabove. One of the few extant texts it lists is the Huang Di\nneijing, along with the titles of lost medical works on nurturing\nlife, health, and longevity. The “Classical Recipes”\n(jing fang) section includes titles such as “Recipes for\nMarried Women and Infants” (Furen ying er fang\n婦人嬰兒方) and “Food Prohibitions\nof Shen Nong and Huang Di” (Shen Nong Huang Di shi jin\n神農黃帝食禁). The sexual arts\nsection includes “Recipes of Huang Di and the Three Sage-Kings\nfor Nurturing Yang” (Huang Di san wang yang yang fang\n黃帝三王養陽方) and\n“Inner Chamber Recipes of the Three Schools for Having\nChildren” (San jia nei ju you zi fang\n三家內房有子方). Other\nsections describe physical exercises and therapeutic techniques, such\nas the “Stepping and Pulling Book of Huang Di and Other Masters”\n(Huang Di za zi bu yin\n黃帝雜子步引 (Han shu 30,\n1778–79).\n\n\nAnother medical text from Mawangdui is a recipe (fang\n方) manual titled Recipes for Fifty-Two Ailments\n(Wushier bing fang 五十二病方,\ntranslated and discussed in Harper 1998). Recipe texts also have been\nexcavated from Zhangjiashan (Li Ling 1993 and 2000). In addition, the\nMawangdui tombs also contained hexagram divination texts and charts and\ndiagrams on cloud divination and physiognomy, including the oldest\nknown representation of a comet (Li Ling 1993).\n\n\nIn summary, most of these texts can be described as part of a\nyang sheng culture, which offered and emphasized control over\nphysiological processes of the body and mind that were understood as\ntransformations of qi. What is the relation of these detailed\ntechnical texts to philosophy? These technical arts form a continuum\nwith philosophy because their transformations were understood as\nself-cultivation in the coterminous senses of moral excellence, health,\nand longevity (rather than medical pathology), and physiological\ntransformation through the manipulation of qi (V. Lo\n2001).\n\n\nMark Csikszentmihalyi (2004) describes them as part of an\n“embodied virtue” tradition of self-cultivation practices.\nThey structured much of early Daoist philosophy and medical theory, and\nalso had profound effects on early Chinese ethics and metaphysics (V.\nLo 2005). Such “material virtue” traditions held that the\nbody-mind was constructed of qi and that embodied\nself-cultivation practices could transform qi. These views\ninformed Warring States accounts of dietary practices, exercise\nregimens, breath meditation, sexual cultivation techniques, and other\ntechnical traditions associated with fang shi. Material virtue\ntraditions also had important links with Daoist texts, southern\nschools, and the “moralization” of health in traditions\nthat culminated in the Huang Di neijing. Accounts of these\npractices appear in passing in the texts of the received tradition.\nMany more come from texts excavated from tombs.\n",
    "section_title": "2. Nurturing Life (yang sheng)",
    "entry_title": "Chinese Philosophy and Chinese Medicine",
    "hierarchy_title": "Chinese Philosophy and Chinese Medicine || Nurturing Life (yang sheng)",
    "tokenized_text": [
        "nurturing",
        "life",
        "yang",
        "sheng",
        "nurturing",
        "life",
        "yang",
        "sheng",
        "several",
        "warring",
        "state",
        "text",
        "express",
        "need",
        "preserve",
        "one",
        "person",
        "self",
        "essential",
        "nature",
        "therefore",
        "sage",
        "put",
        "person",
        "last",
        "come",
        "first",
        "treat",
        "extraneous",
        "preserved",
        "daode",
        "jing",
        "chap",
        "one",
        "way",
        "maintain",
        "health",
        "nurturing",
        "life",
        "yang",
        "sheng",
        "area",
        "common",
        "ground",
        "speculative",
        "thinker",
        "practitioner",
        "traditional",
        "medical",
        "art",
        "term",
        "yang",
        "sheng",
        "first",
        "appears",
        "zhuangzi",
        "throughout",
        "range",
        "second",
        "bce",
        "century",
        "medical",
        "literature",
        "third",
        "chapter",
        "zhuangzi",
        "titled",
        "lord",
        "nurturing",
        "life",
        "yang",
        "sheng",
        "zhu",
        "養生主",
        "expert",
        "butcher",
        "pao",
        "ding",
        "instructs",
        "duke",
        "hui",
        "liang",
        "pao",
        "ding",
        "describes",
        "process",
        "mastering",
        "skill",
        "method",
        "initially",
        "analytic",
        "begin",
        "studying",
        "ox",
        "whole",
        "next",
        "part",
        "finally",
        "faculty",
        "beyond",
        "ordinary",
        "vision",
        "discourse",
        "presented",
        "instruction",
        "lord",
        "wenhui",
        "end",
        "saying",
        "pao",
        "ding",
        "taught",
        "nurture",
        "life",
        "yang",
        "sheng",
        "zhuangzi",
        "cf",
        "watson",
        "another",
        "passage",
        "outer",
        "chapter",
        "refers",
        "exercise",
        "contrast",
        "real",
        "sage",
        "follow",
        "way",
        "heaven",
        "earth",
        "among",
        "others",
        "practitioner",
        "nurturing",
        "life",
        "tradition",
        "blow",
        "breathe",
        "old",
        "new",
        "dormant",
        "like",
        "bear",
        "neckstretched",
        "like",
        "bird",
        "care",
        "longevity",
        "practitioner",
        "guideandpull",
        "dao",
        "yin",
        "導引",
        "nourishing",
        "body",
        "yang",
        "xing",
        "養形",
        "desire",
        "longevity",
        "pengzu",
        "zhuangzi",
        "cf",
        "watson",
        "passage",
        "continues",
        "real",
        "sage",
        "cultivate",
        "person",
        "without",
        "benevolence",
        "righteousness",
        "govern",
        "without",
        "merit",
        "fame",
        "ease",
        "without",
        "needing",
        "river",
        "sea",
        "attain",
        "longevity",
        "without",
        "guiding",
        "pulling",
        "forget",
        "everything",
        "lack",
        "nothing",
        "placid",
        "without",
        "limit",
        "thing",
        "value",
        "follow",
        "upon",
        "ch",
        "cf",
        "graham",
        "a",
        "watson",
        "since",
        "whole",
        "point",
        "zhuangzi",
        "passage",
        "oppose",
        "guiding",
        "pulling",
        "longevity",
        "technique",
        "true",
        "sagehood",
        "dwell",
        "detail",
        "get",
        "better",
        "idea",
        "might",
        "talking",
        "source",
        "idea",
        "elaborated",
        "chapter",
        "guanzi",
        "titled",
        "inner",
        "cultivation",
        "nei",
        "ye",
        "describes",
        "cultivation",
        "qi",
        "well",
        "vital",
        "essence",
        "jing",
        "spirit",
        "shen",
        "describes",
        "dao",
        "literally",
        "pervading",
        "body",
        "person",
        "sage",
        "long",
        "wellspring",
        "exhausted",
        "passage",
        "nine",
        "aperture",
        "remain",
        "clear",
        "thus",
        "possible",
        "explore",
        "limit",
        "heaven",
        "earth",
        "cover",
        "four",
        "sea",
        "guanzi",
        "ab",
        "trans",
        "rickett",
        "zhuangzi",
        "text",
        "refer",
        "figure",
        "spirit",
        "person",
        "shen",
        "ren",
        "神人",
        "someone",
        "effectively",
        "transformed",
        "physical",
        "body",
        "qi",
        "constitutes",
        "zhuangzi",
        "describes",
        "spirit",
        "person",
        "guye",
        "concentrate",
        "spirit",
        "shen",
        "avoids",
        "five",
        "grain",
        "ride",
        "cloud",
        "concentration",
        "shen",
        "protects",
        "others",
        "sickness",
        "epidemic",
        "make",
        "harvest",
        "ripen",
        "zhuangzi",
        "cf",
        "graham",
        "a",
        "passage",
        "suggests",
        "sage",
        "nurturing",
        "effect",
        "world",
        "acting",
        "distance",
        "possibly",
        "unintended",
        "byproduct",
        "selfcultivation",
        "practice",
        "passage",
        "zhuangzi",
        "extol",
        "ability",
        "specialized",
        "craftsman",
        "posse",
        "highly",
        "technical",
        "skill",
        "story",
        "liken",
        "mastery",
        "way",
        "mastery",
        "craft",
        "also",
        "emphasize",
        "technical",
        "skill",
        "commoner",
        "commoner",
        "rather",
        "ruler",
        "presented",
        "sagelike",
        "figure",
        "technical",
        "expert",
        "include",
        "arrow",
        "maker",
        "bellstand",
        "carver",
        "boatman",
        "butcher",
        "cicada",
        "catcher",
        "potter",
        "sword",
        "maker",
        "wheelwright",
        "raphals",
        "curious",
        "passage",
        "never",
        "include",
        "physician",
        "han",
        "dynasty",
        "nurturing",
        "life",
        "technique",
        "became",
        "major",
        "concern",
        "recipe",
        "master",
        "fang",
        "shi",
        "han",
        "court",
        "ngo",
        "text",
        "nurturing",
        "life",
        "include",
        "method",
        "absorbing",
        "circulating",
        "qi",
        "bodyfor",
        "example",
        "breathing",
        "meditation",
        "exercise",
        "diet",
        "drug",
        "sexual",
        "technique",
        "medical",
        "mantic",
        "text",
        "excavated",
        "tomb",
        "make",
        "clear",
        "wide",
        "range",
        "longevity",
        "technique",
        "developed",
        "han",
        "dynasty",
        "harper",
        "important",
        "corpus",
        "medical",
        "manuscript",
        "excavated",
        "mawangdui",
        "馬王堆",
        "changsha",
        "hubei",
        "dated",
        "bce",
        "tomb",
        "best",
        "known",
        "two",
        "version",
        "daode",
        "jing",
        "meaningful",
        "locate",
        "text",
        "among",
        "text",
        "scientific",
        "provenance",
        "found",
        "tomb",
        "harper",
        "jixing",
        "zhou",
        "yimou",
        "zhou",
        "yimou",
        "xiao",
        "zuotai",
        "six",
        "medical",
        "manuscript",
        "concerned",
        "nurturing",
        "life",
        "various",
        "way",
        "harmonizing",
        "yin",
        "yang",
        "yin",
        "yang",
        "合陰陽",
        "discussion",
        "realized",
        "way",
        "heaven",
        "tianxia",
        "zhi",
        "dao",
        "tan",
        "天下至道談",
        "concerned",
        "sexual",
        "cultivation",
        "refer",
        "movement",
        "posture",
        "animal",
        "wholebody",
        "metaphor",
        "sexual",
        "technique",
        "example",
        "description",
        "ten",
        "posture",
        "harmonizing",
        "yin",
        "yang",
        "ten",
        "posture",
        "first",
        "tiger",
        "roving",
        "second",
        "cicada",
        "clinging",
        "third",
        "measuring",
        "worm",
        "fourth",
        "river",
        "deer",
        "butting",
        "fifth",
        "locust",
        "splayed",
        "sixth",
        "gibbon",
        "grabbing",
        "seventh",
        "toad",
        "eighth",
        "rabbit",
        "bolting",
        "ninth",
        "dragonfly",
        "tenth",
        "fish",
        "gobbling",
        "harper",
        "text",
        "emphasize",
        "sexual",
        "activity",
        "natural",
        "process",
        "one",
        "must",
        "regulated",
        "realized",
        "way",
        "heaven",
        "put",
        "people",
        "know",
        "nature",
        "breathe",
        "eat",
        "everything",
        "else",
        "matter",
        "learning",
        "habit",
        "assist",
        "life",
        "eating",
        "injures",
        "life",
        "lust",
        "therefore",
        "sage",
        "conjoining",
        "male",
        "female",
        "invariably",
        "posse",
        "model",
        "zhou",
        "xiao",
        "harper",
        "recipe",
        "nurturing",
        "life",
        "yang",
        "sheng",
        "fang",
        "養生方",
        "consists",
        "eightyseven",
        "recipe",
        "including",
        "food",
        "drug",
        "beverage",
        "along",
        "several",
        "sexual",
        "cultivation",
        "exercise",
        "eliminating",
        "grain",
        "eating",
        "vapor",
        "que",
        "gu",
        "shi",
        "qi",
        "卻榖食氣",
        "specifies",
        "diet",
        "breathing",
        "exercise",
        "performed",
        "morning",
        "evening",
        "seasonal",
        "regimen",
        "breath",
        "cultivation",
        "consuming",
        "six",
        "qi",
        "avoiding",
        "another",
        "five",
        "harper",
        "another",
        "text",
        "ten",
        "question",
        "shi",
        "wen",
        "十問",
        "give",
        "advice",
        "technique",
        "nurturing",
        "life",
        "harper",
        "example",
        "yao",
        "asked",
        "shun",
        "underheaven",
        "valuable",
        "shun",
        "replied",
        "life",
        "valuable",
        "yao",
        "said",
        "life",
        "cultivated",
        "shun",
        "said",
        "investigate",
        "yin",
        "yang",
        "zhou",
        "yimou",
        "xiao",
        "zuotao",
        "harper",
        "finally",
        "drawing",
        "guiding",
        "pulling",
        "daoyin",
        "tu",
        "導引圖",
        "series",
        "fortyfour",
        "drawing",
        "human",
        "figure",
        "performing",
        "exercise",
        "caption",
        "described",
        "another",
        "excavated",
        "text",
        "tomb",
        "zhangjiashan",
        "張家山",
        "jiangling",
        "hubei",
        "pulling",
        "book",
        "yin",
        "shu",
        "引書",
        "zhangjiashan",
        "describes",
        "exercise",
        "refer",
        "named",
        "animal",
        "including",
        "inchworm",
        "snake",
        "mantis",
        "wild",
        "duck",
        "owl",
        "tiger",
        "chicken",
        "bear",
        "frog",
        "deer",
        "dragon",
        "exemplify",
        "tradition",
        "exercise",
        "therapy",
        "health",
        "known",
        "daoyin",
        "pulling",
        "guiding",
        "yang",
        "sheng",
        "culture",
        "text",
        "emphasized",
        "control",
        "physiological",
        "mental",
        "process",
        "understood",
        "selfcultivation",
        "transformation",
        "qi",
        "selfcultivation",
        "context",
        "included",
        "moral",
        "excellence",
        "health",
        "longevity",
        "v",
        "lo",
        "get",
        "broader",
        "notion",
        "technique",
        "like",
        "turn",
        "list",
        "title",
        "recipe",
        "method",
        "section",
        "han",
        "shu",
        "bibliographic",
        "treatise",
        "mentioned",
        "one",
        "extant",
        "text",
        "list",
        "huang",
        "di",
        "neijing",
        "along",
        "title",
        "lost",
        "medical",
        "work",
        "nurturing",
        "life",
        "health",
        "longevity",
        "classical",
        "recipe",
        "jing",
        "fang",
        "section",
        "includes",
        "title",
        "recipe",
        "married",
        "woman",
        "infant",
        "furen",
        "ying",
        "er",
        "fang",
        "婦人嬰兒方",
        "food",
        "prohibition",
        "shen",
        "nong",
        "huang",
        "di",
        "shen",
        "nong",
        "huang",
        "di",
        "shi",
        "jin",
        "神農黃帝食禁",
        "sexual",
        "art",
        "section",
        "includes",
        "recipe",
        "huang",
        "di",
        "three",
        "sagekings",
        "nurturing",
        "yang",
        "huang",
        "di",
        "san",
        "wang",
        "yang",
        "yang",
        "fang",
        "黃帝三王養陽方",
        "inner",
        "chamber",
        "recipe",
        "three",
        "school",
        "child",
        "san",
        "jia",
        "nei",
        "ju",
        "zi",
        "fang",
        "三家內房有子方",
        "section",
        "describe",
        "physical",
        "exercise",
        "therapeutic",
        "technique",
        "stepping",
        "pulling",
        "book",
        "huang",
        "di",
        "master",
        "huang",
        "di",
        "za",
        "zi",
        "bu",
        "yin",
        "黃帝雜子步引",
        "han",
        "shu",
        "another",
        "medical",
        "text",
        "mawangdui",
        "recipe",
        "fang",
        "方",
        "manual",
        "titled",
        "recipe",
        "fiftytwo",
        "ailment",
        "wushier",
        "bing",
        "fang",
        "五十二病方",
        "translated",
        "discussed",
        "harper",
        "recipe",
        "text",
        "also",
        "excavated",
        "zhangjiashan",
        "li",
        "ling",
        "addition",
        "mawangdui",
        "tomb",
        "also",
        "contained",
        "hexagram",
        "divination",
        "text",
        "chart",
        "diagram",
        "cloud",
        "divination",
        "physiognomy",
        "including",
        "oldest",
        "known",
        "representation",
        "comet",
        "li",
        "ling",
        "summary",
        "text",
        "described",
        "part",
        "yang",
        "sheng",
        "culture",
        "offered",
        "emphasized",
        "control",
        "physiological",
        "process",
        "body",
        "mind",
        "understood",
        "transformation",
        "qi",
        "relation",
        "detailed",
        "technical",
        "text",
        "philosophy",
        "technical",
        "art",
        "form",
        "continuum",
        "philosophy",
        "transformation",
        "understood",
        "selfcultivation",
        "coterminous",
        "sens",
        "moral",
        "excellence",
        "health",
        "longevity",
        "rather",
        "medical",
        "pathology",
        "physiological",
        "transformation",
        "manipulation",
        "qi",
        "v",
        "lo",
        "mark",
        "csikszentmihalyi",
        "describes",
        "part",
        "embodied",
        "virtue",
        "tradition",
        "selfcultivation",
        "practice",
        "structured",
        "much",
        "early",
        "daoist",
        "philosophy",
        "medical",
        "theory",
        "also",
        "profound",
        "effect",
        "early",
        "chinese",
        "ethic",
        "metaphysics",
        "v",
        "lo",
        "material",
        "virtue",
        "tradition",
        "held",
        "bodymind",
        "constructed",
        "qi",
        "embodied",
        "selfcultivation",
        "practice",
        "could",
        "transform",
        "qi",
        "view",
        "informed",
        "warring",
        "state",
        "account",
        "dietary",
        "practice",
        "exercise",
        "regimen",
        "breath",
        "meditation",
        "sexual",
        "cultivation",
        "technique",
        "technical",
        "tradition",
        "associated",
        "fang",
        "shi",
        "material",
        "virtue",
        "tradition",
        "also",
        "important",
        "link",
        "daoist",
        "text",
        "southern",
        "school",
        "moralization",
        "health",
        "tradition",
        "culminated",
        "huang",
        "di",
        "neijing",
        "account",
        "practice",
        "appear",
        "passing",
        "text",
        "received",
        "tradition",
        "many",
        "come",
        "text",
        "excavated",
        "tomb"
    ]
}