{
    "main_text": "Metaphysics I — The Nature of Persons\n5. Metaphysics I — The Nature of Persons\n\nThroughout his career, Chisholm thought and wrote about the\nmetaphysics of persons. His book, Person and Object, contains\nan extended discussion of the topic and the claims he makes there\nprovide a good illustration of his views about persons. Chisholm\nmaintained that a fully satisfactory metaphysics of persons would have\nto accommodate certain bits of preanalytic data, or else explain how\nthey can be false. He took these bits of data to be “innocent\nuntil proven guilty”. Among these is the notion that persons are\ngenuine objects, and not merely logical fictions. Talk about persons\nmust be taken seriously, and not as a mere figure of speech. Chisholm\nmentioned further data (which he presented in the first person): (1) I\nhave various beliefs, feelings, desires, attitudes; (2) I have a body;\n(3) I am intentionally bringing about various things that I could have\nrefrained from bringing about. He went on to affirm past-tense\nversions of (1)–(3): at various times in the past I had certain\nother beliefs, etc. Chisholm emphasized a kind of “unity of\nconsciousness” thesis according to which the contemporaneous\npsychological facts pertain to one and the same thing. Additionally,\nhe thought he was entitled (at least until strong evidence to the\ncontrary is provided) to assume that there is one thing that has\nbeliefs, and also has a body, and also engages in intentional\naction.\n\nChisholm argued that many of the alternative conceptions of persons\ndid not conform to the preanalytic data. One prominent alternative is\nthe so-called “Bundle Theory”, which illustrates a\nstrikingly different conception of persons. On this view, there is no\nthinker of my thoughts, no “owner” of my body, and no doer\nof my deeds. Instead, there is just a “bundle of\nperceptions”. The locus classicus of this view is a\nwell-known passage in Hume’s Treatise where he\nsays:\n\nFor my part, when I enter most intimately into what I call myself, I\nalways stumble on some particular perception or other, of heat or\ncold, light or shade, love or hatred, pain or pleasure. I never can\ncatch myself at any time without a perception, and never can observe\nany thing but the perception. When my perceptions are removed for any\ntime, as by sound sleep; so long am I insensible of myself, and may\ntruly be said not to exist. (Treatise of Human Nature\nI.iv.vi)\n\n\nChisholm points out that this view is in sharp conflict with the\npreanalytic data since, if taken seriously, it implies that there is\nnothing that is having the perceptions, or feeling the pains and\npleasures. He goes on to claim that Hume’s argument for the\nBundle Theory is based on a bit of evidence that presupposes (contrary\nto the theory) that there is an object that is doing the perceiving,\nand thinking the thoughts. Chisholm points out that Hume mentions\noccasions on which he enters into what he calls himself; Hume\nsays that on these occasions he stumbles on some particular\nperception; he says that he never notices anything other than\nthe perceptions. Who or what is this thing that is doing all this\nentering and stumbling and failing to notice? Is it some single thing?\nDoes it persist through the time of entering and stumbling and failing\nto notice? If it does, then it is the very thing whose existence Hume\nseems to be concerned to reject.\n\nCertain forms of materialism have been endorsed by many philosophers.\nAccording to some of these theories, each person is to be identified\nwith his or her body. The body is the bearer of both physical and\nmental properties. The person persists so long as his or her body\npersists. Chisholm, however, was always uneasy about such theories.\nOne of his most distinctive lines of objection involves the use of\nsome metaphysical distinctions. Consider a ship that persists through\nsuccessive replacements of parts. First one plank is replaced, then\nanother, until after some time many of the ship’s original parts\nare no longer present. Chisholm describes the situation by saying that\nat each time that the ship exists, it exists in virtue of the fact\nthat a certain collection of parts exists then. The collection of\nparts that exists at a moment is an “ens per se”\n— it exists in its own right; but the ship is an “ens\nper alio” — it exists in virtue of the fact that some\nother things exist. Different collections of parts do duty for, or\nstand in for, the ship at different times. In some cases, a thing has\na property at a time in virtue of facts about happenings at other\ntimes. Thus, for example, a person might be a widow at a certain time,\nbut that’s because of marriages and deaths that happened\nearlier. Other properties are not in this way “rooted” in\nfacts about other times. With respect to properties that are not\nrooted outside the times they are had, Chisholm makes an interesting\nclaim about a difference between things that exist in their own right\nand things that exist in virtue of others. The ship (an ens per\nalio) has properties at times in virtue of the fact that its\nstand ins (entia per se) have those properties at those\ntimes.\n\nA famous old argument reveals something important about the identity\nof the ship through time. Suppose a ship (call it “Theseus\n1”) was constituted by a certain collection of parts at a\ncertain time long ago. Suppose the parts in that collection were\ngradually replaced by newer parts. Eventually we find ourselves with a\nship (“Theseus 2”) that is the result of all this gradual\nreplacement. It is the apparent “descendant” of Theseus 1.\nSuppose, however, that the cast-off parts were all saved and\neventually were reassembled so as to constitute a ship (call it\n“Theseus 3”). Suppose Theseus 3 contains all and only the\nparts that constituted the original ship Theseus 1 at the outset.\nSince Theseus 3 is part-for-part indiscernible from Theseus 1, there\nis an inclination to identify Theseus 3 with Theseus 1. But since\nTheseus 2 emerged from Theseus 1 by a series of individually minor\nreplacements, there is also an inclination to identify Theseus 2 with\nTheseus 1. We cannot consistently give in to both of these\ninclinations since it is obvious that Theseus 2 is distinct from\nTheseus 3. Chisholm suggests that the facts in the world leave this\nsomewhat indeterminate. If a case like this were to arise in the real\nworld, we would leave it to the courts to make a determination of\nwhich ship is the legitimate successor to the original. If the courts\ndecide that Theseus 2 is the “real” descendant of Theseus\n1, then we will have to accept this conclusion for all practical\npurposes.\n\nWhen a thing — like the persisting Ship of Theseus — is a\nlogical construction out of more fundamental entities, questions of\nidentity through time become somewhat conventional. Thus Theseus 2 can\nbe identical with Theseus 1 only in a “loose and popular”\nsense of ‘identical’. In the “strict and\nphilosophical” sense a collection of parts, C1, can be identical\nwith a collection of parts, C2, only if C1 and C2 contain exactly the\nsame parts. In this strict sense, Theseus 2 is not identical with\nTheseus 1.\n\nAt least some of what has been said about the Ship of Theseus holds\nalso for human bodies. Old parts are steadily being replaced by new\nones. After a period of time the body may contain little of the stuff\nthat originally constituted it. As a result, the body of an old person\nmay be said to be identical to the childish body with which he started\nonly in the loose and popular sense. This has implications for\nmaterialism.\n\nIf some typical form of materialism is true, then each person is his\nor her body. The implication is that an old person may be said to be\nidentical to himself as a child only in a loose and popular sense. If\nwe take this sort of materialism seriously, we will have to say that\nno person strictly persists through any change of parts. Chisholm\nfinds this incredible. He recalls an argument attributed to C. S.\nPeirce: suppose you are about to undergo surgery. Suppose you are told\nthat you can save a lot of money by taking the surgery without\nanesthesia. Instead, you will be given amnesia-inducing drugs that\nwill make you forget the pain afterwards. Still you might be uneasy,\nsince you might fear that the man undergoing the painful surgery will\nbe you. Chisholm then continues:\n\nSuppose that others come to you — friends, relatives, judges,\nclergymen — and they offer the following advice and assurance.\n“Have no fear,” they will say. “Take the cheaper\noperation and we will take care of everything. We will lay down the\nconvention that the man on the table is not you, Jones, but is\nSmith.” What ought to be obvious to you, it seems to\nme, is that the laying down of this convention should have no effect\nat all upon your decision. For you may still ask, “But\nwon’t that person be I?” and, it seems to me, the question\nhas an answer. ([P&O]: 111)\n\n\nChisholm’s Peircean argument has considerable intuitive force.\nIt surely seems to many of us that our persistence through time is not\nsimply a matter of convention. No matter what the courts decide,\neither the person undergoing the painful surgery will be you, or he\nwon’t be you. If this intuition is right, then materialism of\nthe imagined kind is false. For materialism implies that you are an\nens per alio, a logical construction. Yet each of us takes\nhimself or herself to be an ens per se.\n\nIn several places (e.g., 1991, 168), Chisholm hinted at a modal\nargument against materialism. He noted that he himself could survive\nthe loss of his hand. Thus, he has this modal property: being such\nthat it is possible for him to exist without the hand that he actually\nhas. But Chisholm contended that his body was identical with the\nparticular collection of human bodily parts that then constituted his\nbody. That collection of parts could not survive the loss of\nChisholm’s hand. If Chisholm’s hand were annihilated, that\ncollection would cease to exist. Thus the collection of parts does not\nhave the property of being such that it is possible for it to exist\nwithout the hand that Chisholm actually had. One application of\nLeibniz’s Law implies that Chisholm is not the collection of\nparts that then constituted his body. The argument clearly presupposes\nthe doctrine of mereological essentialism, according to which if a\ncompound thing W has a certain part P, then\nW cannot exist without having P as a part.\n\nIn yet other places ([P&O], 104), Chisholm pursues another line of\nthought. Note for example that if a certain ship (an ens per\nalio) has a property such as the property of weighing so-and-so\nmany pounds at a certain time, it has this property in virtue of the\nfact that the ens per se that constitutes it at that time\nactually has that property. The “stand-in” really has the\nproperty; the logical construction “borrows” the property\nfrom the stand-in. But Chisholm considers himself at a time when he\nhas the property of hoping for rain. He asks whether he himself\nactually has that property, or whether instead he just borrows it from\nsome stand-in. He dismisses this suggestion, saying that it ‘is\nnot to be taken seriously’. If there are two things present (the\npersistent Chisholm and the temporary stand in), and each of them is\nhoping for rain, then surely it is Chisholm himself who more\nfundamentally has the property and his stand-in who has it\nderivatively. In this case, Chisholm himself must be an ens per\nse.\n\nPerhaps persons are somehow simple entities. It might appear that they\ncould be simple bodily substances — perhaps like extra-small\nversions of the Luz Bone mentioned by Leibniz (in Book II, Chapter\nxxvii of the New Essays). But Chisholm had defined\n‘bodily substance’ as ‘substance with parts’.\nThus on his view, there cannot be a simple bodily substances. So if\nthe person is a simple substance, it must be simple and immaterial\n— a “monad” as Chisholm\n says.[1]\n\nIn “On the Simplicity of the Soul” (1991), Chisholm\npursues this Leibnizian line. He identifies a sort of property that he\ncharacterizes as “qualitative”. Any such property would\ncharacterize substances (rather than other properties, or states, or\nabstract objects); it would be a property that could characterize a\nsimple thing; it would be an internal (or, as some might prefer to\nsay, “intrinsic”) property of anything it characterized\n– thus a thing existing in isolation could have such a\nqualitative property. Chisholm says that the familiar mental\nproperties that we know ourselves to have (e.g., the property of\nhoping for rain) are in this way qualitative. So we know that we have\nqualitative properties. But, as he says, we never know, with respect\nto any compound thing, that it has any such qualitative property.\nThus, there is reason to doubt that we are compound things. We know\nourselves to have properties of a kind such that we do not know, of\nany compound thing, that it has properties of that kind. It’s\nnot entirely clear that this argument establishes that people are not\ncompound things. Perhaps it shows only that for all we know\nwe might be simple entities.\n",
    "section_title": "5. Metaphysics I — The Nature of Persons",
    "entry_title": "Roderick Chisholm",
    "hierarchy_title": "Roderick Chisholm || Metaphysics I — The Nature of Persons",
    "tokenized_text": [
        "metaphysics",
        "nature",
        "person",
        "metaphysics",
        "nature",
        "person",
        "throughout",
        "career",
        "chisholm",
        "thought",
        "wrote",
        "metaphysics",
        "person",
        "book",
        "person",
        "object",
        "contains",
        "extended",
        "discussion",
        "topic",
        "claim",
        "make",
        "provide",
        "good",
        "illustration",
        "view",
        "person",
        "chisholm",
        "maintained",
        "fully",
        "satisfactory",
        "metaphysics",
        "person",
        "would",
        "accommodate",
        "certain",
        "bit",
        "preanalytic",
        "data",
        "else",
        "explain",
        "false",
        "took",
        "bit",
        "data",
        "innocent",
        "proven",
        "guilty",
        "among",
        "notion",
        "person",
        "genuine",
        "object",
        "merely",
        "logical",
        "fiction",
        "talk",
        "person",
        "must",
        "taken",
        "seriously",
        "mere",
        "figure",
        "speech",
        "chisholm",
        "mentioned",
        "data",
        "presented",
        "first",
        "person",
        "various",
        "belief",
        "feeling",
        "desire",
        "attitude",
        "body",
        "intentionally",
        "bringing",
        "various",
        "thing",
        "could",
        "refrained",
        "bringing",
        "went",
        "affirm",
        "pasttense",
        "version",
        "various",
        "time",
        "past",
        "certain",
        "belief",
        "etc",
        "chisholm",
        "emphasized",
        "kind",
        "unity",
        "consciousness",
        "thesis",
        "according",
        "contemporaneous",
        "psychological",
        "fact",
        "pertain",
        "one",
        "thing",
        "additionally",
        "thought",
        "entitled",
        "least",
        "strong",
        "evidence",
        "contrary",
        "provided",
        "assume",
        "one",
        "thing",
        "belief",
        "also",
        "body",
        "also",
        "engages",
        "intentional",
        "action",
        "chisholm",
        "argued",
        "many",
        "alternative",
        "conception",
        "person",
        "conform",
        "preanalytic",
        "data",
        "one",
        "prominent",
        "alternative",
        "socalled",
        "bundle",
        "theory",
        "illustrates",
        "strikingly",
        "different",
        "conception",
        "person",
        "view",
        "thinker",
        "thought",
        "owner",
        "body",
        "doer",
        "deed",
        "instead",
        "bundle",
        "perception",
        "locus",
        "classicus",
        "view",
        "wellknown",
        "passage",
        "hume",
        "treatise",
        "say",
        "part",
        "enter",
        "intimately",
        "call",
        "always",
        "stumble",
        "particular",
        "perception",
        "heat",
        "cold",
        "light",
        "shade",
        "love",
        "hatred",
        "pain",
        "pleasure",
        "never",
        "catch",
        "time",
        "without",
        "perception",
        "never",
        "observe",
        "thing",
        "perception",
        "perception",
        "removed",
        "time",
        "sound",
        "sleep",
        "long",
        "insensible",
        "may",
        "truly",
        "said",
        "exist",
        "treatise",
        "human",
        "nature",
        "iivvi",
        "chisholm",
        "point",
        "view",
        "sharp",
        "conflict",
        "preanalytic",
        "data",
        "since",
        "taken",
        "seriously",
        "implies",
        "nothing",
        "perception",
        "feeling",
        "pain",
        "pleasure",
        "go",
        "claim",
        "hume",
        "argument",
        "bundle",
        "theory",
        "based",
        "bit",
        "evidence",
        "presupposes",
        "contrary",
        "theory",
        "object",
        "perceiving",
        "thinking",
        "thought",
        "chisholm",
        "point",
        "hume",
        "mention",
        "occasion",
        "enters",
        "call",
        "hume",
        "say",
        "occasion",
        "stumble",
        "particular",
        "perception",
        "say",
        "never",
        "notice",
        "anything",
        "perception",
        "thing",
        "entering",
        "stumbling",
        "failing",
        "notice",
        "single",
        "thing",
        "persist",
        "time",
        "entering",
        "stumbling",
        "failing",
        "notice",
        "thing",
        "whose",
        "existence",
        "hume",
        "seems",
        "concerned",
        "reject",
        "certain",
        "form",
        "materialism",
        "endorsed",
        "many",
        "philosopher",
        "according",
        "theory",
        "person",
        "identified",
        "body",
        "body",
        "bearer",
        "physical",
        "mental",
        "property",
        "person",
        "persists",
        "long",
        "body",
        "persists",
        "chisholm",
        "however",
        "always",
        "uneasy",
        "theory",
        "one",
        "distinctive",
        "line",
        "objection",
        "involves",
        "use",
        "metaphysical",
        "distinction",
        "consider",
        "ship",
        "persists",
        "successive",
        "replacement",
        "part",
        "first",
        "one",
        "plank",
        "replaced",
        "another",
        "time",
        "many",
        "ship",
        "original",
        "part",
        "longer",
        "present",
        "chisholm",
        "describes",
        "situation",
        "saying",
        "time",
        "ship",
        "exists",
        "exists",
        "virtue",
        "fact",
        "certain",
        "collection",
        "part",
        "exists",
        "collection",
        "part",
        "exists",
        "moment",
        "en",
        "per",
        "se",
        "exists",
        "right",
        "ship",
        "en",
        "per",
        "alio",
        "exists",
        "virtue",
        "fact",
        "thing",
        "exist",
        "different",
        "collection",
        "part",
        "duty",
        "stand",
        "ship",
        "different",
        "time",
        "case",
        "thing",
        "property",
        "time",
        "virtue",
        "fact",
        "happening",
        "time",
        "thus",
        "example",
        "person",
        "might",
        "widow",
        "certain",
        "time",
        "marriage",
        "death",
        "happened",
        "earlier",
        "property",
        "way",
        "rooted",
        "fact",
        "time",
        "respect",
        "property",
        "rooted",
        "outside",
        "time",
        "chisholm",
        "make",
        "interesting",
        "claim",
        "difference",
        "thing",
        "exist",
        "right",
        "thing",
        "exist",
        "virtue",
        "others",
        "ship",
        "en",
        "per",
        "alio",
        "property",
        "time",
        "virtue",
        "fact",
        "stand",
        "in",
        "entia",
        "per",
        "se",
        "property",
        "time",
        "famous",
        "old",
        "argument",
        "reveals",
        "something",
        "important",
        "identity",
        "ship",
        "time",
        "suppose",
        "ship",
        "call",
        "theseus",
        "constituted",
        "certain",
        "collection",
        "part",
        "certain",
        "time",
        "long",
        "ago",
        "suppose",
        "part",
        "collection",
        "gradually",
        "replaced",
        "newer",
        "part",
        "eventually",
        "find",
        "ship",
        "theseus",
        "result",
        "gradual",
        "replacement",
        "apparent",
        "descendant",
        "theseus",
        "suppose",
        "however",
        "castoff",
        "part",
        "saved",
        "eventually",
        "reassembled",
        "constitute",
        "ship",
        "call",
        "theseus",
        "suppose",
        "theseus",
        "contains",
        "part",
        "constituted",
        "original",
        "ship",
        "theseus",
        "outset",
        "since",
        "theseus",
        "partforpart",
        "indiscernible",
        "theseus",
        "inclination",
        "identify",
        "theseus",
        "theseus",
        "since",
        "theseus",
        "emerged",
        "theseus",
        "series",
        "individually",
        "minor",
        "replacement",
        "also",
        "inclination",
        "identify",
        "theseus",
        "theseus",
        "consistently",
        "give",
        "inclination",
        "since",
        "obvious",
        "theseus",
        "distinct",
        "theseus",
        "chisholm",
        "suggests",
        "fact",
        "world",
        "leave",
        "somewhat",
        "indeterminate",
        "case",
        "like",
        "arise",
        "real",
        "world",
        "would",
        "leave",
        "court",
        "make",
        "determination",
        "ship",
        "legitimate",
        "successor",
        "original",
        "court",
        "decide",
        "theseus",
        "real",
        "descendant",
        "theseus",
        "accept",
        "conclusion",
        "practical",
        "purpose",
        "thing",
        "like",
        "persisting",
        "ship",
        "theseus",
        "logical",
        "construction",
        "fundamental",
        "entity",
        "question",
        "identity",
        "time",
        "become",
        "somewhat",
        "conventional",
        "thus",
        "theseus",
        "identical",
        "theseus",
        "loose",
        "popular",
        "sense",
        "identical",
        "strict",
        "philosophical",
        "sense",
        "collection",
        "part",
        "c",
        "identical",
        "collection",
        "part",
        "c",
        "c",
        "c",
        "contain",
        "exactly",
        "part",
        "strict",
        "sense",
        "theseus",
        "identical",
        "theseus",
        "least",
        "said",
        "ship",
        "theseus",
        "hold",
        "also",
        "human",
        "body",
        "old",
        "part",
        "steadily",
        "replaced",
        "new",
        "one",
        "period",
        "time",
        "body",
        "may",
        "contain",
        "little",
        "stuff",
        "originally",
        "constituted",
        "result",
        "body",
        "old",
        "person",
        "may",
        "said",
        "identical",
        "childish",
        "body",
        "started",
        "loose",
        "popular",
        "sense",
        "implication",
        "materialism",
        "typical",
        "form",
        "materialism",
        "true",
        "person",
        "body",
        "implication",
        "old",
        "person",
        "may",
        "said",
        "identical",
        "child",
        "loose",
        "popular",
        "sense",
        "take",
        "sort",
        "materialism",
        "seriously",
        "say",
        "person",
        "strictly",
        "persists",
        "change",
        "part",
        "chisholm",
        "find",
        "incredible",
        "recall",
        "argument",
        "attributed",
        "c",
        "s",
        "peirce",
        "suppose",
        "undergo",
        "surgery",
        "suppose",
        "told",
        "save",
        "lot",
        "money",
        "taking",
        "surgery",
        "without",
        "anesthesia",
        "instead",
        "given",
        "amnesiainducing",
        "drug",
        "make",
        "forget",
        "pain",
        "afterwards",
        "still",
        "might",
        "uneasy",
        "since",
        "might",
        "fear",
        "man",
        "undergoing",
        "painful",
        "surgery",
        "chisholm",
        "continues",
        "suppose",
        "others",
        "come",
        "friend",
        "relative",
        "judge",
        "clergyman",
        "offer",
        "following",
        "advice",
        "assurance",
        "fear",
        "say",
        "take",
        "cheaper",
        "operation",
        "take",
        "care",
        "everything",
        "lay",
        "convention",
        "man",
        "table",
        "jones",
        "smith",
        "ought",
        "obvious",
        "seems",
        "laying",
        "convention",
        "effect",
        "upon",
        "decision",
        "may",
        "still",
        "ask",
        "person",
        "seems",
        "question",
        "answer",
        "p",
        "chisholm",
        "peircean",
        "argument",
        "considerable",
        "intuitive",
        "force",
        "surely",
        "seems",
        "many",
        "u",
        "persistence",
        "time",
        "simply",
        "matter",
        "convention",
        "matter",
        "court",
        "decide",
        "either",
        "person",
        "undergoing",
        "painful",
        "surgery",
        "intuition",
        "right",
        "materialism",
        "imagined",
        "kind",
        "false",
        "materialism",
        "implies",
        "en",
        "per",
        "alio",
        "logical",
        "construction",
        "yet",
        "u",
        "take",
        "en",
        "per",
        "se",
        "several",
        "place",
        "eg",
        "chisholm",
        "hinted",
        "modal",
        "argument",
        "materialism",
        "noted",
        "could",
        "survive",
        "loss",
        "hand",
        "thus",
        "modal",
        "property",
        "possible",
        "exist",
        "without",
        "hand",
        "actually",
        "chisholm",
        "contended",
        "body",
        "identical",
        "particular",
        "collection",
        "human",
        "bodily",
        "part",
        "constituted",
        "body",
        "collection",
        "part",
        "could",
        "survive",
        "loss",
        "chisholm",
        "hand",
        "chisholm",
        "hand",
        "annihilated",
        "collection",
        "would",
        "cease",
        "exist",
        "thus",
        "collection",
        "part",
        "property",
        "possible",
        "exist",
        "without",
        "hand",
        "chisholm",
        "actually",
        "one",
        "application",
        "leibniz",
        "law",
        "implies",
        "chisholm",
        "collection",
        "part",
        "constituted",
        "body",
        "argument",
        "clearly",
        "presupposes",
        "doctrine",
        "mereological",
        "essentialism",
        "according",
        "compound",
        "thing",
        "w",
        "certain",
        "part",
        "p",
        "w",
        "exist",
        "without",
        "p",
        "part",
        "yet",
        "place",
        "p",
        "chisholm",
        "pursues",
        "another",
        "line",
        "thought",
        "note",
        "example",
        "certain",
        "ship",
        "en",
        "per",
        "alio",
        "property",
        "property",
        "weighing",
        "soandso",
        "many",
        "pound",
        "certain",
        "time",
        "property",
        "virtue",
        "fact",
        "en",
        "per",
        "se",
        "constitutes",
        "time",
        "actually",
        "property",
        "standin",
        "really",
        "property",
        "logical",
        "construction",
        "borrows",
        "property",
        "standin",
        "chisholm",
        "considers",
        "time",
        "property",
        "hoping",
        "rain",
        "asks",
        "whether",
        "actually",
        "property",
        "whether",
        "instead",
        "borrows",
        "standin",
        "dismisses",
        "suggestion",
        "saying",
        "taken",
        "seriously",
        "two",
        "thing",
        "present",
        "persistent",
        "chisholm",
        "temporary",
        "stand",
        "hoping",
        "rain",
        "surely",
        "chisholm",
        "fundamentally",
        "property",
        "standin",
        "derivatively",
        "case",
        "chisholm",
        "must",
        "en",
        "per",
        "se",
        "perhaps",
        "person",
        "somehow",
        "simple",
        "entity",
        "might",
        "appear",
        "could",
        "simple",
        "bodily",
        "substance",
        "perhaps",
        "like",
        "extrasmall",
        "version",
        "luz",
        "bone",
        "mentioned",
        "leibniz",
        "book",
        "ii",
        "chapter",
        "xxvii",
        "new",
        "essay",
        "chisholm",
        "defined",
        "bodily",
        "substance",
        "substance",
        "part",
        "thus",
        "view",
        "simple",
        "bodily",
        "substance",
        "person",
        "simple",
        "substance",
        "must",
        "simple",
        "immaterial",
        "monad",
        "chisholm",
        "say",
        "simplicity",
        "soul",
        "chisholm",
        "pursues",
        "leibnizian",
        "line",
        "identifies",
        "sort",
        "property",
        "characterizes",
        "qualitative",
        "property",
        "would",
        "characterize",
        "substance",
        "rather",
        "property",
        "state",
        "abstract",
        "object",
        "would",
        "property",
        "could",
        "characterize",
        "simple",
        "thing",
        "would",
        "internal",
        "might",
        "prefer",
        "say",
        "intrinsic",
        "property",
        "anything",
        "characterized",
        "thus",
        "thing",
        "existing",
        "isolation",
        "could",
        "qualitative",
        "property",
        "chisholm",
        "say",
        "familiar",
        "mental",
        "property",
        "know",
        "eg",
        "property",
        "hoping",
        "rain",
        "way",
        "qualitative",
        "know",
        "qualitative",
        "property",
        "say",
        "never",
        "know",
        "respect",
        "compound",
        "thing",
        "qualitative",
        "property",
        "thus",
        "reason",
        "doubt",
        "compound",
        "thing",
        "know",
        "property",
        "kind",
        "know",
        "compound",
        "thing",
        "property",
        "kind",
        "entirely",
        "clear",
        "argument",
        "establishes",
        "people",
        "compound",
        "thing",
        "perhaps",
        "show",
        "know",
        "might",
        "simple",
        "entity"
    ]
}