{
    "main_text": "Ethics I — Intrinsic Value, Defeat, Theodicy\n10. Ethics I — Intrinsic Value, Defeat, Theodicy\n\nA reader starting out with [B&IV] for the first time might not\nanticipate how it is going to end. Indeed, even as the reader\npatiently works his way through definitions, principles, remarks about\nwhat Brentano might have said, etc., the eventual point remains in the\nbackground. Nevertheless, as becomes clear in the final pages, the\nbook as a whole may be seen as one long argument for a distinctive\nsolution to the problem of evil.\n\nChisholm starts by explicating some of Brentano’s idiosyncratic\nmetaphysical views. Soon, however, Chisholm turns to some central\nethical doctrines. Perhaps the first among these involves the\nintroduction of the concept of correctness. In the first\ninstance, we think of certain judgments as being correct. Thus, for\nexample, suppose it now seems to me that I am seeing something red. If\nI judge that I am now seeing something red, it will be clear to me\nthat my judgment is correct. If another person judges that I am not\nseeing something red, it will be clear to me that his judgment is\nincorrect. A similar thing could happen in the case of a judgment to\nthe effect that all squares are rectangles. If I make that judgment\nwith full understanding of the concepts of squareness and\nrectangularity, it will be clear to me that my judgment is correct.\nBrentano evidently made use of this concept of correct judgment in an\nattempt to explain the notion of truth.\n\nChisholm claims that Brentano extended the application of the concept\nof correctness so that it would apply to emotions as well. On\nChisholm’s view, emotions are analogous to judgments in certain\nways. Corresponding to the notion of affirmation or “positive\njudgment” we have the notion of love, or positive emotion.\nCorresponding to the notion of denial we have the notion of hatred, or\nnegative emotion. In addition, there is the concept of preference. If\nI love one thing and hate another, then I prefer the one to the other.\nSimilarly if I love one thing and am neutral about (neither loving nor\nhating) the other, then I prefer the one to the other. And if I am\nneutral about one thing and hate the other, then I prefer the one to\nthe other. So we have the concept of preference as well.\n\nSuppose I feel some pleasure. Suppose I love the fact that I am\nfeeling that pleasure. Suppose my love of this pleasure is intrinsic\n— I love the pleasure “in and for itself”. If I\nreflect on this situation, I may recognize that my love is correct.\nThis seems to mean, roughly, that I can see that it is appropriate, or\nfitting, for me to feel this strong pro-attitude toward this\nexperience. The feeling of pleasure deserves, or merits, this sort of\npositive emotional reaction. If another person were to hate that\npleasure, or were to feel an equally strong anti-attitude toward it\n“in and for itself”, his hatred would be incorrect. We can\njust see that a feeling of pleasure does not deserve this sort of\nnegative emotional reaction.\n\nChisholm prefers to formulate these claims about the fittingness of\ncertain emotional reactions to certain objects by appeal to a\nfundamental concept in his ethics. This is the concept of\nrequirement. Instead of saying that it is correct, or\nfitting, to have a certain emotional reaction to a certain object, we\ncan say that contemplation of that object requires that\nemotional reaction. With these concepts at our disposal, Chisholm\nsuggests, we can define all the central concepts of ethics\n([B&IV], 53).\n\nTo say that one thing A is intrinsically better than\nanother thing B, according to Chisholm, is just to say that,\nfor any person, x, contemplation of just A and\nB by x requires that x prefer A to\nB. Consider the fact that there are stones. While of course\nwe might be glad that there are stones in virtue of their usefulness,\nit would not be correct to love this state of affairs for its own\nsake. Mere contemplation of this state of affairs does not require\neither love or hate. It seems to be intrinsically neutral. An\nintrinsically good thing is one that is intrinsically better than a\nneutral thing; an intrinsically bad thing is one such that an\nintrinsically neutral thing is intrinsically better than it. Thus\naccording to Chisholm we may define intrinsic goodness, badness, and\nneutrality entirely in terms of preference and requirement.\n\nIn some cases a complex state of affairs contains some good parts and\nsome bad parts. We can assign positive numbers to the good parts and\nnegative numbers to the bad parts in order to represent their\nrespective amounts of intrinsic value. The intrinsic value of the\nwhole state of affairs may just be the sum of the values of those\nparts. In such cases Chisholm would say that the positive value of the\ngood parts is “balanced off” by the negative value of the\nbad parts.\n\nIn other cases the interaction among the parts is not in this way just\na matter of summation. Chisholm asks us to compare two cases. In Case\n1, I take pleasure in what I take to be Smith’s pleasure. In\nCase 2, I take an equal amount of pleasure in what I take to be\nJones’s pain. So here we are comparing two instances of\npleasure. Imagine that they are alike in what we may call the\n“raw amount” of pleasure involved. They differ in that one\nis pleasure in something good whereas the other is pleasure in\nsomething bad. Chisholm stipulates that the objects of these pleasures\n(Smith’s pleasure and Jones’s pain) are “intentional\nobjects” — I take them to be happening, but I may be\nmistaken. Maybe they are just figments of my imagination.\n\nFollowing Brentano (and Moore as well) Chisholm assumes that pleasure\nin the good is extra good, while pleasure in the bad is not so good.\nIn these cases the value of the whole is either greater than, or less\nthan, the sum of the values of the parts. (Since Jones’s pain is\nan intentional object of my pleasure in Case 2, its actual occurrence\nis not entailed by the fact that I take pleasure in it; hence,\naccording to Chisholm, it is not a “part” of the that\nlarger state of affairs.) As a result, Case 1 is better than Case 2 in\nspite of the fact that Case 1 and Case 2 contain the same parts, with\nthe same values. The difference in value arises because of the\nappropriateness of the object of pleasure in Case 1, and the\ncorresponding inappropriateness of the object of the pleasure in Case\n2.\n\nCase 2 illustrates what Chisholm calls “the defeat of\ngood”. Case 2 contains a good part and no bad part; but the\nvalue of the whole is less than the value of the good part. Somehow,\nthe value of the good part has been defeated without being balanced\noff.\n\nThe defeat of evil would occur in a case in which some state of\naffairs contains a bad part that is worse than the whole, even though\nthe whole does not contain any good part that balances off the evil of\nthe bad part. Consider Case 3 in which I take pain in what I take to\nbe my bad behavior. The badness of my pain may be mitigated by the\nfact that the object of this pain is something that requires that pain\nbe taken in it — my own bad behavior. But it is possible that I\nam mistaken about my bad behavior; maybe it never really happened.\nThus, Case 3 does not contain that bad behavior as an actual part. The\nstate of affairs may have no good part to balance off the badness of\nmy pain, and yet it may be, as a whole, not as bad as its worst part.\n(It may be neutral; or even good.)\n\nIn the final five pages of [B&IV], Chisholm turns to theodicy. He\nraises the question whether an omnipotent, omniscient, and benevolent\ndeity could create a world that contains some things that are\nintrinsically evil. Standard theistic answers are quickly rejected.\n(1) We cannot claim that evil is just an illusion, for in the case of\npain (for example) it is evident to the one who suffers it that it is\ngenuinely evil. Nor can we say (2) that some evils are required as\nmeans to good. For if God is omnipotent, he could find a way to\nproduce the good without making use of the evil means. (3) Some might\nsay that God produces only “positive” states, such as\nexperiences of pleasure. The evil in the world occurs in\n“negative” states, and these are not due to God’s\ncreative efforts. But Chisholm points out that the negation of a good\nstate is neutral, not bad. Furthermore, the actual existence of pain\nis not a mere negation. It is as “positive” as the\nexistence of pleasure. (4) Some have claimed that God gave us freedom,\nwhich we then misused. Thus, it’s not God’s fault that\nthere is evil in this world. But this “free will defense”\nis quickly rejected. The problem is that if God is omnipotent, he\ncould have created a different world in which we always freely choose\nto act in the better way. Surely there must be such a world; surely it\nmust be better than the actual world in which we freely misbehave. Why\ndidn’t God actualize a world like that?\n\nChisholm then sketches his own solution to the problem of evil. He\nsays ‘Some of the evil in the world is necessary for the\nenhancement of goodness. And the rest of the evil is defeated’\n([B&IV], 100). In a characteristically careful way, Chisholm does\nnot assert that all the evil in this world is actually to be explained\nin this way. He restricts himself to suggesting that Brentano would\nhave said such a thing, and that the conceptual machinery he has\ndeveloped shows us how it is possible that the world could contain\nsome evil even though the world was created by an omnipotent,\nomniscient, and benevolent god. Whether the evil in this world is in\nfact defeated is another question. Chisholm concludes by saying\n‘The wise theodicist, I should think, would say that he\ndoesn’t know’ ([B&IV], 102).\n",
    "section_title": "10. Ethics I — Intrinsic Value, Defeat, Theodicy",
    "entry_title": "Roderick Chisholm",
    "hierarchy_title": "Roderick Chisholm || Ethics I — Intrinsic Value, Defeat, Theodicy",
    "tokenized_text": [
        "ethic",
        "intrinsic",
        "value",
        "defeat",
        "theodicy",
        "ethic",
        "intrinsic",
        "value",
        "defeat",
        "theodicy",
        "reader",
        "starting",
        "b",
        "iv",
        "first",
        "time",
        "might",
        "anticipate",
        "going",
        "end",
        "indeed",
        "even",
        "reader",
        "patiently",
        "work",
        "way",
        "definition",
        "principle",
        "remark",
        "brentano",
        "might",
        "said",
        "etc",
        "eventual",
        "point",
        "remains",
        "background",
        "nevertheless",
        "becomes",
        "clear",
        "final",
        "page",
        "book",
        "whole",
        "may",
        "seen",
        "one",
        "long",
        "argument",
        "distinctive",
        "solution",
        "problem",
        "evil",
        "chisholm",
        "start",
        "explicating",
        "brentano",
        "idiosyncratic",
        "metaphysical",
        "view",
        "soon",
        "however",
        "chisholm",
        "turn",
        "central",
        "ethical",
        "doctrine",
        "perhaps",
        "first",
        "among",
        "involves",
        "introduction",
        "concept",
        "correctness",
        "first",
        "instance",
        "think",
        "certain",
        "judgment",
        "correct",
        "thus",
        "example",
        "suppose",
        "seems",
        "seeing",
        "something",
        "red",
        "judge",
        "seeing",
        "something",
        "red",
        "clear",
        "judgment",
        "correct",
        "another",
        "person",
        "judge",
        "seeing",
        "something",
        "red",
        "clear",
        "judgment",
        "incorrect",
        "similar",
        "thing",
        "could",
        "happen",
        "case",
        "judgment",
        "effect",
        "square",
        "rectangle",
        "make",
        "judgment",
        "full",
        "understanding",
        "concept",
        "squareness",
        "rectangularity",
        "clear",
        "judgment",
        "correct",
        "brentano",
        "evidently",
        "made",
        "use",
        "concept",
        "correct",
        "judgment",
        "attempt",
        "explain",
        "notion",
        "truth",
        "chisholm",
        "claim",
        "brentano",
        "extended",
        "application",
        "concept",
        "correctness",
        "would",
        "apply",
        "emotion",
        "well",
        "chisholm",
        "view",
        "emotion",
        "analogous",
        "judgment",
        "certain",
        "way",
        "corresponding",
        "notion",
        "affirmation",
        "positive",
        "judgment",
        "notion",
        "love",
        "positive",
        "emotion",
        "corresponding",
        "notion",
        "denial",
        "notion",
        "hatred",
        "negative",
        "emotion",
        "addition",
        "concept",
        "preference",
        "love",
        "one",
        "thing",
        "hate",
        "another",
        "prefer",
        "one",
        "similarly",
        "love",
        "one",
        "thing",
        "neutral",
        "neither",
        "loving",
        "hating",
        "prefer",
        "one",
        "neutral",
        "one",
        "thing",
        "hate",
        "prefer",
        "one",
        "concept",
        "preference",
        "well",
        "suppose",
        "feel",
        "pleasure",
        "suppose",
        "love",
        "fact",
        "feeling",
        "pleasure",
        "suppose",
        "love",
        "pleasure",
        "intrinsic",
        "love",
        "pleasure",
        "reflect",
        "situation",
        "may",
        "recognize",
        "love",
        "correct",
        "seems",
        "mean",
        "roughly",
        "see",
        "appropriate",
        "fitting",
        "feel",
        "strong",
        "proattitude",
        "toward",
        "experience",
        "feeling",
        "pleasure",
        "deserves",
        "merit",
        "sort",
        "positive",
        "emotional",
        "reaction",
        "another",
        "person",
        "hate",
        "pleasure",
        "feel",
        "equally",
        "strong",
        "antiattitude",
        "toward",
        "hatred",
        "would",
        "incorrect",
        "see",
        "feeling",
        "pleasure",
        "deserve",
        "sort",
        "negative",
        "emotional",
        "reaction",
        "chisholm",
        "prefers",
        "formulate",
        "claim",
        "fittingness",
        "certain",
        "emotional",
        "reaction",
        "certain",
        "object",
        "appeal",
        "fundamental",
        "concept",
        "ethic",
        "concept",
        "requirement",
        "instead",
        "saying",
        "correct",
        "fitting",
        "certain",
        "emotional",
        "reaction",
        "certain",
        "object",
        "say",
        "contemplation",
        "object",
        "requires",
        "emotional",
        "reaction",
        "concept",
        "disposal",
        "chisholm",
        "suggests",
        "define",
        "central",
        "concept",
        "ethic",
        "b",
        "iv",
        "say",
        "one",
        "thing",
        "intrinsically",
        "better",
        "another",
        "thing",
        "b",
        "according",
        "chisholm",
        "say",
        "person",
        "x",
        "contemplation",
        "b",
        "x",
        "requires",
        "x",
        "prefer",
        "b",
        "consider",
        "fact",
        "stone",
        "course",
        "might",
        "glad",
        "stone",
        "virtue",
        "usefulness",
        "would",
        "correct",
        "love",
        "state",
        "affair",
        "sake",
        "mere",
        "contemplation",
        "state",
        "affair",
        "require",
        "either",
        "love",
        "hate",
        "seems",
        "intrinsically",
        "neutral",
        "intrinsically",
        "good",
        "thing",
        "one",
        "intrinsically",
        "better",
        "neutral",
        "thing",
        "intrinsically",
        "bad",
        "thing",
        "one",
        "intrinsically",
        "neutral",
        "thing",
        "intrinsically",
        "better",
        "thus",
        "according",
        "chisholm",
        "may",
        "define",
        "intrinsic",
        "goodness",
        "badness",
        "neutrality",
        "entirely",
        "term",
        "preference",
        "requirement",
        "case",
        "complex",
        "state",
        "affair",
        "contains",
        "good",
        "part",
        "bad",
        "part",
        "assign",
        "positive",
        "number",
        "good",
        "part",
        "negative",
        "number",
        "bad",
        "part",
        "order",
        "represent",
        "respective",
        "amount",
        "intrinsic",
        "value",
        "intrinsic",
        "value",
        "whole",
        "state",
        "affair",
        "may",
        "sum",
        "value",
        "part",
        "case",
        "chisholm",
        "would",
        "say",
        "positive",
        "value",
        "good",
        "part",
        "balanced",
        "negative",
        "value",
        "bad",
        "part",
        "case",
        "interaction",
        "among",
        "part",
        "way",
        "matter",
        "summation",
        "chisholm",
        "asks",
        "u",
        "compare",
        "two",
        "case",
        "case",
        "take",
        "pleasure",
        "take",
        "smith",
        "pleasure",
        "case",
        "take",
        "equal",
        "amount",
        "pleasure",
        "take",
        "jones",
        "pain",
        "comparing",
        "two",
        "instance",
        "pleasure",
        "imagine",
        "alike",
        "may",
        "call",
        "raw",
        "amount",
        "pleasure",
        "involved",
        "differ",
        "one",
        "pleasure",
        "something",
        "good",
        "whereas",
        "pleasure",
        "something",
        "bad",
        "chisholm",
        "stipulates",
        "object",
        "pleasure",
        "smith",
        "pleasure",
        "jones",
        "pain",
        "intentional",
        "object",
        "take",
        "happening",
        "may",
        "mistaken",
        "maybe",
        "figment",
        "imagination",
        "following",
        "brentano",
        "moore",
        "well",
        "chisholm",
        "assumes",
        "pleasure",
        "good",
        "extra",
        "good",
        "pleasure",
        "bad",
        "good",
        "case",
        "value",
        "whole",
        "either",
        "greater",
        "le",
        "sum",
        "value",
        "part",
        "since",
        "jones",
        "pain",
        "intentional",
        "object",
        "pleasure",
        "case",
        "actual",
        "occurrence",
        "entailed",
        "fact",
        "take",
        "pleasure",
        "hence",
        "according",
        "chisholm",
        "part",
        "larger",
        "state",
        "affair",
        "result",
        "case",
        "better",
        "case",
        "spite",
        "fact",
        "case",
        "case",
        "contain",
        "part",
        "value",
        "difference",
        "value",
        "arises",
        "appropriateness",
        "object",
        "pleasure",
        "case",
        "corresponding",
        "inappropriateness",
        "object",
        "pleasure",
        "case",
        "case",
        "illustrates",
        "chisholm",
        "call",
        "defeat",
        "good",
        "case",
        "contains",
        "good",
        "part",
        "bad",
        "part",
        "value",
        "whole",
        "le",
        "value",
        "good",
        "part",
        "somehow",
        "value",
        "good",
        "part",
        "defeated",
        "without",
        "balanced",
        "defeat",
        "evil",
        "would",
        "occur",
        "case",
        "state",
        "affair",
        "contains",
        "bad",
        "part",
        "worse",
        "whole",
        "even",
        "though",
        "whole",
        "contain",
        "good",
        "part",
        "balance",
        "evil",
        "bad",
        "part",
        "consider",
        "case",
        "take",
        "pain",
        "take",
        "bad",
        "behavior",
        "badness",
        "pain",
        "may",
        "mitigated",
        "fact",
        "object",
        "pain",
        "something",
        "requires",
        "pain",
        "taken",
        "bad",
        "behavior",
        "possible",
        "mistaken",
        "bad",
        "behavior",
        "maybe",
        "never",
        "really",
        "happened",
        "thus",
        "case",
        "contain",
        "bad",
        "behavior",
        "actual",
        "part",
        "state",
        "affair",
        "may",
        "good",
        "part",
        "balance",
        "badness",
        "pain",
        "yet",
        "may",
        "whole",
        "bad",
        "worst",
        "part",
        "may",
        "neutral",
        "even",
        "good",
        "final",
        "five",
        "page",
        "b",
        "iv",
        "chisholm",
        "turn",
        "theodicy",
        "raise",
        "question",
        "whether",
        "omnipotent",
        "omniscient",
        "benevolent",
        "deity",
        "could",
        "create",
        "world",
        "contains",
        "thing",
        "intrinsically",
        "evil",
        "standard",
        "theistic",
        "answer",
        "quickly",
        "rejected",
        "claim",
        "evil",
        "illusion",
        "case",
        "pain",
        "example",
        "evident",
        "one",
        "suffers",
        "genuinely",
        "evil",
        "say",
        "evil",
        "required",
        "mean",
        "good",
        "god",
        "omnipotent",
        "could",
        "find",
        "way",
        "produce",
        "good",
        "without",
        "making",
        "use",
        "evil",
        "mean",
        "might",
        "say",
        "god",
        "produce",
        "positive",
        "state",
        "experience",
        "pleasure",
        "evil",
        "world",
        "occurs",
        "negative",
        "state",
        "due",
        "god",
        "creative",
        "effort",
        "chisholm",
        "point",
        "negation",
        "good",
        "state",
        "neutral",
        "bad",
        "furthermore",
        "actual",
        "existence",
        "pain",
        "mere",
        "negation",
        "positive",
        "existence",
        "pleasure",
        "claimed",
        "god",
        "gave",
        "u",
        "freedom",
        "misused",
        "thus",
        "god",
        "fault",
        "evil",
        "world",
        "free",
        "defense",
        "quickly",
        "rejected",
        "problem",
        "god",
        "omnipotent",
        "could",
        "created",
        "different",
        "world",
        "always",
        "freely",
        "choose",
        "act",
        "better",
        "way",
        "surely",
        "must",
        "world",
        "surely",
        "must",
        "better",
        "actual",
        "world",
        "freely",
        "misbehave",
        "god",
        "actualize",
        "world",
        "like",
        "chisholm",
        "sketch",
        "solution",
        "problem",
        "evil",
        "say",
        "evil",
        "world",
        "necessary",
        "enhancement",
        "goodness",
        "rest",
        "evil",
        "defeated",
        "b",
        "iv",
        "characteristically",
        "careful",
        "way",
        "chisholm",
        "assert",
        "evil",
        "world",
        "actually",
        "explained",
        "way",
        "restricts",
        "suggesting",
        "brentano",
        "would",
        "said",
        "thing",
        "conceptual",
        "machinery",
        "developed",
        "show",
        "u",
        "possible",
        "world",
        "could",
        "contain",
        "evil",
        "even",
        "though",
        "world",
        "created",
        "omnipotent",
        "omniscient",
        "benevolent",
        "god",
        "whether",
        "evil",
        "world",
        "fact",
        "defeated",
        "another",
        "question",
        "chisholm",
        "concludes",
        "saying",
        "wise",
        "theodicist",
        "think",
        "would",
        "say",
        "know",
        "b",
        "iv"
    ]
}