{
    "main_text": "Philosophy of Religion, Philosophical Theology, Christian Theology: Is There A Difference and Does it Matter? || Analytic Philosophy of Religion: Too Theological?\n3.1 Analytic Philosophy of Religion: Too Theological?\n\nThe charge that APR is “too theological” can be\ndisambiguated into two distinct worries. The first worry concerns the\nscope of APR when considered as a whole: APR is too narrow,\nbecause it focuses excessively on Christian theological topics, to the\nexclusion of other equally important matters. The second worry\nconcerns the sources and methods of Christian APR\nspecifically: the sources and methods of Christian APR belong more\nproperly to theology than to philosophy.\n3.1.1 Narrowness of Scope?\n\nThe charge that APR as a discipline is “too Christian” or\n“too theological” could be understood as a worry about its\nscope: perhaps APR focuses too much on Christian theological topics,\nor at least on versions of monotheism that are compatible with\nChristianity, and is therefore too narrow in scope. Critics who\nadvance the narrowness worry include Trakakis 2008, Wildman 2010,\nKnepper 2013, Schilbrack 2014, Lewis 2015, Jones 2019, Draper 2019,\nTimpe & Hereth 2019, Mizrahi 2020. Although the narrowness worry\nhas wide currency, it is not always clear how to understand it as a\nproperly philosophical criticism. This problem is exacerbated by the\nfact that the narrowness worry is more often aimed at the field of APR\nas a whole, rather than at individual instances of APR. After all, the\ngeneral claim that APR is “too Christian” does not entail\nthat any specific argument of any specific philosopher is unsound.\nSimilarly, even if it is true that APR as a whole should be\n“less Christian”, it is hard to see why that fact would\nrequire any individual philosopher to change her research and teaching\nfocus (Schilbrack 2014: 12).\n\nStill, some versions of the narrowness worry are more philosophical\nthan others. According to more philosophical versions, Christian APR\nfrequently fails as philosophy: as a result of their\nChristian-theological biases, analytic philosophers of religion\ninadvertently make bad arguments. On this line, Christian analytic\nphilosophers are especially likely to engage in motivated reasoning\nand ignore counter-arguments or alternative points of view drawn from\nother religious traditions. Because APR is so narrow, Christian\nphilosophers unwittingly work in an echo-chamber or an epistemic\nbubble (Schilbrack 2014: 14; Draper 2019: 5; De Cruz 2020). As a\nresult, according to critics, the conclusions of their putatively\nphilosophical arguments are often unwarranted for anyone outside the\nChristian community, even when they purport to be generally\nprobative.\n\nLess philosophical versions of the narrowness worry assert the general\nprinciple that APR should be more capacious, and should include more\nnon-Christian voices, without explicitly challenging the soundness of\nspecific analytic arguments (Knepper 2013; Carroll 2016; Mizrahi\n2020). Here the worry is simply that APR does not—but\nshould—reflect the diversity of religious and non-religious\nviewpoints that actually obtain in the world. Phrased differently, APR\nas a field wrongly excludes too much good philosophical work that just\nhappens not to fit into the dominant Christian, monotheistic paradigm.\nYet one can hold this view without also agreeing that existing APR\nfails on its own terms or that any specific philosophers should alter\ntheir practices.\n3.1.2 Inappropriate Methods?\n\nThe charge that APR is too theological could also be understood as a\nquestion about philosophical methodology. On this version of the\ncharge, Christian APR does not begin from generally accessible\nassumptions and argue toward generally acceptable conclusions, as good\nphilosophy should. Instead, it typically begins from Christian\nassumptions and argues toward Christian conclusions, like\ntheology.\n\nJ.L. Schellenberg, for example, argues that philosophy must seek\nsolutions to philosophical problems that are in principle\n“shareable” by any member of the philosophical community.\nBecause much Christian APR assumes the truth of Christianity, its\nsolutions cannot satisfy this condition, and should properly count as\ntheology rather than philosophy (Schellenberg 2018). J. Aaron Simmons\nagrees: even though theology “can and should” appeal to\nevidence restricted to “determinate communities defined by\nrevelational authorities”, philosophy should appeal to\n“evidence that is, in principle, accessible by all members of\nthe philosophical community” (2019: 147). According to Simmons,\nthe dominant strand of APR has ignored this criterion, and threatens\nto “become simply a subset of Christian theological\npractice” (2019: 149; see also Oppy 2018; Draper 2019: 2).\n3.1.3 Responses to the Worry that APR is “Too Theological”\n\nAnalytic philosophers of religion have a variety of ways to respond to\nthe charge that APR is too theological. First, with respect to the\nnarrowness charge, they can accuse critics of mistaking the part for\nthe whole, by denying that the charge applies to APR as such, and by\npointing to those analytic philosophers of religion who neither assume\nnor defend the truth of Christianity. Yet this response is undercut by\nthe fact that non-Christian practitioners of APR often make the\nnarrowness themselves (Schellenberg 2018; Oppy 2018; Draper 2019).\nSecond, its defenders also emphasize that much Christian APR does not\nactually assume the truth of Christianity at all, but instead\nargues for that truth. (Hasker 2018a: 90; citing Swinburne is\na paradigmatic example). This kind of philosophy would clear even\nSchellenberg’s “shareable in principle” bar.\nSimilarly, even those philosophical projects that eschew\nSwinburne-style natural theology might still clear the “sharable\nin principle” bar so long as they engage only in defensive\nmaneuvers—for example, by answering philosophical objections to\nthe plausibility of Christian claims (e.g., van Inwagen 1995; Pawl\n2014).\n\nOthers argue that even explicit appeals to Christian revelation could\nin principle still count as philosophical appeals, albeit indirectly.\nSuppose we agree that theology can appeal to revelation, while\nphilosophy trades only in “generally accessible”\narguments. We still must distinguish between direct, first-order\nappeals to revelation, and indirect, second-order arguments that it is\nsometimes permissible to appeal to revelation (Wood 2021:\n213–215). The second-order arguments could still be generally\naccessible philosophical arguments, even though the first-order\nappeals are not. For example, a first-order “theological”\nappeal might be: “The New Testament asserts p;\ntherefore p”. But a philosopher might offer a general\nepistemological argument, accessible to anyone in the philosophical\ncommunity, to defend the rationality of that same first-order appeal.\n(For example, she might offer a general argument that it is rational\nto form beliefs based on testimony, and the same general argument\nmight establish that it is rational to treat the New Testament as\ntestimonial evidence.) In a similar vein, Plantinga’s claim that\nbelief in God may be “properly basic” is not itself\npresented as a Christian assumption or a revealed truth, but as a\nspecific application of his general philosophical theory of warrant,\nwhich he has defended at length (1983, 1993a, 1993b).\n\nFinally, because there is no single uncontested way to understand the\nboundaries between philosophy and theology, it is open to Christian\nphilosophers of religion simply to deny the sharp distinction\npresupposed by critics like Schellenberg and Simmons (see, for\nexample, Plantinga 1984, Wolterstorff 2009). In so doing, they would\nimplicitly endorse a more Patristic “Integration” model\ninstead of either the Medieval “Cooperation” model or the\nmodern “Disjunction” model (see\n Section 2\n above).\n3.2 Or Not Theological Enough? Theological Critiques of Analytic Philosophy of Religion\n\nWhile one set of critics accuse APR of becoming too theological,\nanother set takes the opposite line. According to several prominent\ntheologians and philosophers, something about the analytic style of\nphilosophizing makes APR particularly unsuitable for investigating\nChristian doctrines. On this line of criticism, far from becoming a\nspecies of Christian theology, APR is constitutively opposed to\nChristian theology, and the problem with analytic philosophical\ntheology is not that it is too theological but that it is too\nanalytic. This criticism takes several forms.\n\nSometimes, theological objections to APR simply reiterate Barthian\nobjections to natural theology, presumably on the assumption that most\nAPR is really a form of natural theology (Moore 2007). Other critics\ncharge analytic philosophers of religion with historical anachronism\nand ignorance of the Christian tradition. Perhaps\n“a-historical” analytic philosophers of religion do not\nunderstand pre-modern ways of thinking and reading (so runs the\ncharge), and so they wrongly believe that their own constructive work\nis congruent with the historic Christian tradition, when it in fact\ndepends modern assumptions that are inimical to the Christian\ntradition (Hart 2013: 123, 129; Milbank 2009: 320). Other critics\npress the related worry that APR ignores the real Christian tradition\naltogether in favor of theorizing its own abstract, self-constructed\nversion of the Christian god. Here APR\n\n\ndoes not deal with the God of any tradition or encounter, but with a\nconceptual construct, a simulacrum or ‘the God of the\nphilosophers’…. (Oliver 2010: 467–468; see also\nHyman 2010)\n\n\nAnother multi-faceted line of theological criticism criticizes APR for\n“idolatry”, “univocity”, and\n“ontotheology”. This line reflects the general worry that\nAPR does not take divine mystery or transcendence seriously enough.\n“Ontotheology” is a theological term of opprobrium that,\nin its current usage, derives from Heidegger (1957; see also Marion\n1982 [1995]). It means, roughly, treating God like “a\nbeing” or “a thing in the world”. According to its\ntheological critics, APR constitutively assumes that God is a possible\nobject of human knowledge, even apart from revelation, and therefore\ntreats God as fundamentally similar to any other object “out\nthere” passively waiting to be discovered. Yet a God like this\n(so runs the worry) is not really God at all, but something\nelse—an idol.\n\nThe worry about ontotheology and idolatry is also a worry about\nunivocity—the view that our terms bear the same meaning when\napplied to God and creatures (Trakakis 2010). According to opponents\nof theological univocity, precisely because God is not “a\nbeing” or a “thing in the world”, God and creatures\ndiffer absolutely; they share no properties and so cannot be described\nby univocal predications. (So, e.g., the word “good”\ncannot have the same meaning in the statements “God is\ngood”, and “Socrates is good”.) Worries about\ntheological predication and univocity date back to the Patristic\nperiod, but in contemporary philosophy of religion, they are best\nunderstood as continuations of the late medieval disputes between\nfollowers of Duns Scotus, who defends univocal predication, and his\nThomist opponents (T. Williams 2005; Burrell 2008; Cross 2008). As a\ngeneralization, most contemporary analytic philosophers of religion\nendorse a univocal account of theological language, whereas\ncontemporary Christian theologians are more likely to deny univocity\nin favor of analogical or metaphorical predication, or even\nnon-predicative forms of theological language (Pickstock 2005; Marion\n1999).\n\nNotwithstanding the sharp rhetoric, there has been very little direct\nengagement between analytic philosophers of religion and their\ntheological opponents on these questions. T. Williams (2005), Cross\n(2008) defend univocal predication, and Adams (2014) tries to\nrehabilitate ontotheology. Other analytic thinkers offer their own\npositive accounts of divine transcendence (Crisp and Rea [eds.] 2009:\n9–11; Rea 2015, 2020; Jacobs 2015). More generally, analytic\nphilosophers and theologians have a variety of strategies for avoiding\nthe deleterious consequences of univocity and ontotheology (Wood 2021:\n130–74). ",
    "section_title": "3.1 Analytic Philosophy of Religion: Too Theological?",
    "entry_title": "Philosophy and Christian Theology",
    "hierarchy_title": "Philosophy and Christian Theology || Philosophy of Religion, Philosophical Theology, Christian Theology: Is There A Difference and Does it Matter? || Analytic Philosophy of Religion: Too Theological?",
    "tokenized_text": [
        "philosophy",
        "religion",
        "philosophical",
        "theology",
        "christian",
        "theology",
        "difference",
        "matter",
        "analytic",
        "philosophy",
        "religion",
        "theological",
        "analytic",
        "philosophy",
        "religion",
        "theological",
        "charge",
        "apr",
        "theological",
        "disambiguated",
        "two",
        "distinct",
        "worry",
        "first",
        "worry",
        "concern",
        "scope",
        "apr",
        "considered",
        "whole",
        "apr",
        "narrow",
        "focus",
        "excessively",
        "christian",
        "theological",
        "topic",
        "exclusion",
        "equally",
        "important",
        "matter",
        "second",
        "worry",
        "concern",
        "source",
        "method",
        "christian",
        "apr",
        "specifically",
        "source",
        "method",
        "christian",
        "apr",
        "belong",
        "properly",
        "theology",
        "philosophy",
        "narrowness",
        "scope",
        "charge",
        "apr",
        "discipline",
        "christian",
        "theological",
        "could",
        "understood",
        "worry",
        "scope",
        "perhaps",
        "apr",
        "focus",
        "much",
        "christian",
        "theological",
        "topic",
        "least",
        "version",
        "monotheism",
        "compatible",
        "christianity",
        "therefore",
        "narrow",
        "scope",
        "critic",
        "advance",
        "narrowness",
        "worry",
        "include",
        "trakakis",
        "wildman",
        "knepper",
        "schilbrack",
        "lewis",
        "jones",
        "draper",
        "timpe",
        "hereth",
        "mizrahi",
        "although",
        "narrowness",
        "worry",
        "wide",
        "currency",
        "always",
        "clear",
        "understand",
        "properly",
        "philosophical",
        "criticism",
        "problem",
        "exacerbated",
        "fact",
        "narrowness",
        "worry",
        "often",
        "aimed",
        "field",
        "apr",
        "whole",
        "rather",
        "individual",
        "instance",
        "apr",
        "general",
        "claim",
        "apr",
        "christian",
        "entail",
        "specific",
        "argument",
        "specific",
        "philosopher",
        "unsound",
        "similarly",
        "even",
        "true",
        "apr",
        "whole",
        "le",
        "christian",
        "hard",
        "see",
        "fact",
        "would",
        "require",
        "individual",
        "philosopher",
        "change",
        "research",
        "teaching",
        "focus",
        "schilbrack",
        "still",
        "version",
        "narrowness",
        "worry",
        "philosophical",
        "others",
        "according",
        "philosophical",
        "version",
        "christian",
        "apr",
        "frequently",
        "fails",
        "philosophy",
        "result",
        "christiantheological",
        "bias",
        "analytic",
        "philosopher",
        "religion",
        "inadvertently",
        "make",
        "bad",
        "argument",
        "line",
        "christian",
        "analytic",
        "philosopher",
        "especially",
        "likely",
        "engage",
        "motivated",
        "reasoning",
        "ignore",
        "counterarguments",
        "alternative",
        "point",
        "view",
        "drawn",
        "religious",
        "tradition",
        "apr",
        "narrow",
        "christian",
        "philosopher",
        "unwittingly",
        "work",
        "echochamber",
        "epistemic",
        "bubble",
        "schilbrack",
        "draper",
        "de",
        "cruz",
        "result",
        "according",
        "critic",
        "conclusion",
        "putatively",
        "philosophical",
        "argument",
        "often",
        "unwarranted",
        "anyone",
        "outside",
        "christian",
        "community",
        "even",
        "purport",
        "generally",
        "probative",
        "le",
        "philosophical",
        "version",
        "narrowness",
        "worry",
        "assert",
        "general",
        "principle",
        "apr",
        "capacious",
        "include",
        "nonchristian",
        "voice",
        "without",
        "explicitly",
        "challenging",
        "soundness",
        "specific",
        "analytic",
        "argument",
        "knepper",
        "carroll",
        "mizrahi",
        "worry",
        "simply",
        "apr",
        "notbut",
        "shouldreflect",
        "diversity",
        "religious",
        "nonreligious",
        "viewpoint",
        "actually",
        "obtain",
        "world",
        "phrased",
        "differently",
        "apr",
        "field",
        "wrongly",
        "excludes",
        "much",
        "good",
        "philosophical",
        "work",
        "happens",
        "fit",
        "dominant",
        "christian",
        "monotheistic",
        "paradigm",
        "yet",
        "one",
        "hold",
        "view",
        "without",
        "also",
        "agreeing",
        "existing",
        "apr",
        "fails",
        "term",
        "specific",
        "philosopher",
        "alter",
        "practice",
        "inappropriate",
        "method",
        "charge",
        "apr",
        "theological",
        "could",
        "also",
        "understood",
        "question",
        "philosophical",
        "methodology",
        "version",
        "charge",
        "christian",
        "apr",
        "begin",
        "generally",
        "accessible",
        "assumption",
        "argue",
        "toward",
        "generally",
        "acceptable",
        "conclusion",
        "good",
        "philosophy",
        "instead",
        "typically",
        "begin",
        "christian",
        "assumption",
        "argues",
        "toward",
        "christian",
        "conclusion",
        "like",
        "theology",
        "jl",
        "schellenberg",
        "example",
        "argues",
        "philosophy",
        "must",
        "seek",
        "solution",
        "philosophical",
        "problem",
        "principle",
        "shareable",
        "member",
        "philosophical",
        "community",
        "much",
        "christian",
        "apr",
        "assumes",
        "truth",
        "christianity",
        "solution",
        "satisfy",
        "condition",
        "properly",
        "count",
        "theology",
        "rather",
        "philosophy",
        "schellenberg",
        "j",
        "aaron",
        "simmons",
        "agrees",
        "even",
        "though",
        "theology",
        "appeal",
        "evidence",
        "restricted",
        "determinate",
        "community",
        "defined",
        "revelational",
        "authority",
        "philosophy",
        "appeal",
        "evidence",
        "principle",
        "accessible",
        "member",
        "philosophical",
        "community",
        "according",
        "simmons",
        "dominant",
        "strand",
        "apr",
        "ignored",
        "criterion",
        "threatens",
        "become",
        "simply",
        "subset",
        "christian",
        "theological",
        "practice",
        "see",
        "also",
        "oppy",
        "draper",
        "response",
        "worry",
        "apr",
        "theological",
        "analytic",
        "philosopher",
        "religion",
        "variety",
        "way",
        "respond",
        "charge",
        "apr",
        "theological",
        "first",
        "respect",
        "narrowness",
        "charge",
        "accuse",
        "critic",
        "mistaking",
        "part",
        "whole",
        "denying",
        "charge",
        "applies",
        "apr",
        "pointing",
        "analytic",
        "philosopher",
        "religion",
        "neither",
        "assume",
        "defend",
        "truth",
        "christianity",
        "yet",
        "response",
        "undercut",
        "fact",
        "nonchristian",
        "practitioner",
        "apr",
        "often",
        "make",
        "narrowness",
        "schellenberg",
        "oppy",
        "draper",
        "second",
        "defender",
        "also",
        "emphasize",
        "much",
        "christian",
        "apr",
        "actually",
        "assume",
        "truth",
        "christianity",
        "instead",
        "argues",
        "truth",
        "hasker",
        "a",
        "citing",
        "swinburne",
        "paradigmatic",
        "example",
        "kind",
        "philosophy",
        "would",
        "clear",
        "even",
        "schellenberg",
        "shareable",
        "principle",
        "bar",
        "similarly",
        "even",
        "philosophical",
        "project",
        "eschew",
        "swinburnestyle",
        "natural",
        "theology",
        "might",
        "still",
        "clear",
        "sharable",
        "principle",
        "bar",
        "long",
        "engage",
        "defensive",
        "maneuversfor",
        "example",
        "answering",
        "philosophical",
        "objection",
        "plausibility",
        "christian",
        "claim",
        "eg",
        "van",
        "inwagen",
        "pawl",
        "others",
        "argue",
        "even",
        "explicit",
        "appeal",
        "christian",
        "revelation",
        "could",
        "principle",
        "still",
        "count",
        "philosophical",
        "appeal",
        "albeit",
        "indirectly",
        "suppose",
        "agree",
        "theology",
        "appeal",
        "revelation",
        "philosophy",
        "trade",
        "generally",
        "accessible",
        "argument",
        "still",
        "must",
        "distinguish",
        "direct",
        "firstorder",
        "appeal",
        "revelation",
        "indirect",
        "secondorder",
        "argument",
        "sometimes",
        "permissible",
        "appeal",
        "revelation",
        "wood",
        "secondorder",
        "argument",
        "could",
        "still",
        "generally",
        "accessible",
        "philosophical",
        "argument",
        "even",
        "though",
        "firstorder",
        "appeal",
        "example",
        "firstorder",
        "theological",
        "appeal",
        "might",
        "new",
        "testament",
        "asserts",
        "p",
        "therefore",
        "p",
        "philosopher",
        "might",
        "offer",
        "general",
        "epistemological",
        "argument",
        "accessible",
        "anyone",
        "philosophical",
        "community",
        "defend",
        "rationality",
        "firstorder",
        "appeal",
        "example",
        "might",
        "offer",
        "general",
        "argument",
        "rational",
        "form",
        "belief",
        "based",
        "testimony",
        "general",
        "argument",
        "might",
        "establish",
        "rational",
        "treat",
        "new",
        "testament",
        "testimonial",
        "evidence",
        "similar",
        "vein",
        "plantinga",
        "claim",
        "belief",
        "god",
        "may",
        "properly",
        "basic",
        "presented",
        "christian",
        "assumption",
        "revealed",
        "truth",
        "specific",
        "application",
        "general",
        "philosophical",
        "theory",
        "warrant",
        "defended",
        "length",
        "a",
        "b",
        "finally",
        "single",
        "uncontested",
        "way",
        "understand",
        "boundary",
        "philosophy",
        "theology",
        "open",
        "christian",
        "philosopher",
        "religion",
        "simply",
        "deny",
        "sharp",
        "distinction",
        "presupposed",
        "critic",
        "like",
        "schellenberg",
        "simmons",
        "see",
        "example",
        "plantinga",
        "wolterstorff",
        "would",
        "implicitly",
        "endorse",
        "patristic",
        "integration",
        "model",
        "instead",
        "either",
        "medieval",
        "cooperation",
        "model",
        "modern",
        "disjunction",
        "model",
        "see",
        "section",
        "theological",
        "enough",
        "theological",
        "critique",
        "analytic",
        "philosophy",
        "religion",
        "one",
        "set",
        "critic",
        "accuse",
        "apr",
        "becoming",
        "theological",
        "another",
        "set",
        "take",
        "opposite",
        "line",
        "according",
        "several",
        "prominent",
        "theologian",
        "philosopher",
        "something",
        "analytic",
        "style",
        "philosophizing",
        "make",
        "apr",
        "particularly",
        "unsuitable",
        "investigating",
        "christian",
        "doctrine",
        "line",
        "criticism",
        "far",
        "becoming",
        "specie",
        "christian",
        "theology",
        "apr",
        "constitutively",
        "opposed",
        "christian",
        "theology",
        "problem",
        "analytic",
        "philosophical",
        "theology",
        "theological",
        "analytic",
        "criticism",
        "take",
        "several",
        "form",
        "sometimes",
        "theological",
        "objection",
        "apr",
        "simply",
        "reiterate",
        "barthian",
        "objection",
        "natural",
        "theology",
        "presumably",
        "assumption",
        "apr",
        "really",
        "form",
        "natural",
        "theology",
        "moore",
        "critic",
        "charge",
        "analytic",
        "philosopher",
        "religion",
        "historical",
        "anachronism",
        "ignorance",
        "christian",
        "tradition",
        "perhaps",
        "ahistorical",
        "analytic",
        "philosopher",
        "religion",
        "understand",
        "premodern",
        "way",
        "thinking",
        "reading",
        "run",
        "charge",
        "wrongly",
        "believe",
        "constructive",
        "work",
        "congruent",
        "historic",
        "christian",
        "tradition",
        "fact",
        "depends",
        "modern",
        "assumption",
        "inimical",
        "christian",
        "tradition",
        "hart",
        "milbank",
        "critic",
        "press",
        "related",
        "worry",
        "apr",
        "ignores",
        "real",
        "christian",
        "tradition",
        "altogether",
        "favor",
        "theorizing",
        "abstract",
        "selfconstructed",
        "version",
        "christian",
        "god",
        "apr",
        "deal",
        "god",
        "tradition",
        "encounter",
        "conceptual",
        "construct",
        "simulacrum",
        "god",
        "philosopher",
        "oliver",
        "see",
        "also",
        "hyman",
        "another",
        "multifaceted",
        "line",
        "theological",
        "criticism",
        "criticizes",
        "apr",
        "idolatry",
        "univocity",
        "ontotheology",
        "line",
        "reflects",
        "general",
        "worry",
        "apr",
        "take",
        "divine",
        "mystery",
        "transcendence",
        "seriously",
        "enough",
        "ontotheology",
        "theological",
        "term",
        "opprobrium",
        "current",
        "usage",
        "derives",
        "heidegger",
        "see",
        "also",
        "marion",
        "mean",
        "roughly",
        "treating",
        "god",
        "like",
        "thing",
        "world",
        "according",
        "theological",
        "critic",
        "apr",
        "constitutively",
        "assumes",
        "god",
        "possible",
        "object",
        "human",
        "knowledge",
        "even",
        "apart",
        "revelation",
        "therefore",
        "treat",
        "god",
        "fundamentally",
        "similar",
        "object",
        "passively",
        "waiting",
        "discovered",
        "yet",
        "god",
        "like",
        "run",
        "worry",
        "really",
        "god",
        "something",
        "elsean",
        "idol",
        "worry",
        "ontotheology",
        "idolatry",
        "also",
        "worry",
        "univocitythe",
        "view",
        "term",
        "bear",
        "meaning",
        "applied",
        "god",
        "creature",
        "trakakis",
        "according",
        "opponent",
        "theological",
        "univocity",
        "precisely",
        "god",
        "thing",
        "world",
        "god",
        "creature",
        "differ",
        "absolutely",
        "share",
        "property",
        "described",
        "univocal",
        "predication",
        "eg",
        "word",
        "good",
        "meaning",
        "statement",
        "god",
        "good",
        "socrates",
        "good",
        "worry",
        "theological",
        "predication",
        "univocity",
        "date",
        "back",
        "patristic",
        "period",
        "contemporary",
        "philosophy",
        "religion",
        "best",
        "understood",
        "continuation",
        "late",
        "medieval",
        "dispute",
        "follower",
        "dun",
        "scotus",
        "defends",
        "univocal",
        "predication",
        "thomist",
        "opponent",
        "t",
        "williams",
        "burrell",
        "cross",
        "generalization",
        "contemporary",
        "analytic",
        "philosopher",
        "religion",
        "endorse",
        "univocal",
        "account",
        "theological",
        "language",
        "whereas",
        "contemporary",
        "christian",
        "theologian",
        "likely",
        "deny",
        "univocity",
        "favor",
        "analogical",
        "metaphorical",
        "predication",
        "even",
        "nonpredicative",
        "form",
        "theological",
        "language",
        "pickstock",
        "marion",
        "notwithstanding",
        "sharp",
        "rhetoric",
        "little",
        "direct",
        "engagement",
        "analytic",
        "philosopher",
        "religion",
        "theological",
        "opponent",
        "question",
        "t",
        "williams",
        "cross",
        "defend",
        "univocal",
        "predication",
        "adam",
        "try",
        "rehabilitate",
        "ontotheology",
        "analytic",
        "thinker",
        "offer",
        "positive",
        "account",
        "divine",
        "transcendence",
        "crisp",
        "rea",
        "ed",
        "rea",
        "jacob",
        "generally",
        "analytic",
        "philosopher",
        "theologian",
        "variety",
        "strategy",
        "avoiding",
        "deleterious",
        "consequence",
        "univocity",
        "ontotheology",
        "wood"
    ]
}