{
    "main_text": "The First Period: Philosophical Politics || The Laws\n5.3 The Laws\n\nIn Republic 5, Scipio had affirmed that the political leader\nrequires knowledge of justice and of the laws and will have studied\ntheir foundations. The discussion of natural law in Laws 1\noffers an account of those foundations. The purpose of such an account\nis to set the parameters within which more concrete laws must fall and\nbe judged. The natural law is god’s law; it is also what human\nbeings who have perfected their reason would follow. Law is to be\nidentified with right reason (1.23), or more specifically with right\nreason in the realm of what is commanded or forbidden (1.33, 1.42).\nThis, then, is a normative account: it tells us what law, properly\nspeaking, is; and that may be very different from the actual laws that\nparticular states have enacted.\n\nGiven the normative character of Cicero’s enquiry, it is not\ndifficult to see why law should be identified with right reason.\nRationality, after all, is itself a normative concept. Not every piece\nof thinking counts as rational, and rationality can be exercised\nimperfectly and so, at least in principle, perfectly. If one reasons\ncorrectly about the relevant matters in the case of what is just and\nunjust, then it seems fair to conclude that one will enunciate\nstandards against which, for example, actual laws will be required to\nmeasure up. Law in the normative sense is ‘what distinguishes\njust things from unjust’ (2.13).\n\nIt is not as obvious why the concept of nature, or the natural, looms\nlarge in Cicero’s account of law. One of its main purposes is,\nagain, to stress that he is conducting a normative enquiry. We are, he\nsays, ‘born for justice’, and what is right is a matter\nnot of opinion but of nature (1.28). Here Cicero draws upon a\ntradition, already going back at least as far as Plato, in which\nnature stands in contrast with convention. What is merely a matter of\nconvention or opinion is not the same as what is really –\n‘by nature’ – the case. Thus the fact that a certain\n(human-made) law states that something is right or wrong does not mean\nthat its pronouncements are correct.\n\nWhat is this nature that is thus contrasted with matters of opinion or\nconvention? It is, in the first instance, human nature, as witnessed\nby Cicero’s statement that ‘we’ are born for\njustice. We all belong to the same species, and to that extent are all\nalike (1.29), in particular in our possession of reason, which\ndistinguishes us from other creatures (1.30). This explains the sense\nof mutual fellowship and union between human beings (1.28) and means\nthat we are formed by nature to share justice and impart it to all\n(1.33). This does not mean that we necessarily do this. Nature is\nitself a normative concept, so humans can fail to live up to their own\nnature, corrupted by the effects of bad habit and opinion (1.29,\n1.33). Nonetheless, Cicero argues, if one considers the endowments\nthat humans share, one will conclude that justice is the natural human\ncondition.\n\nBut nature also refers, compatibly, to the nature of the universe as a\nwhole, since on the Stoic theory that Cicero draws upon (a theory set\nout more fully in Book 2 of Cicero’s On the Nature of the\nGods, see esp. 2.73–90), the universe – ‘all of\nnature’, as Cicero puts it – is governed by god (1.21).\nGod in turn exercises governing power through the activity of right\nreason, which we humans, at least in our best condition, share with\ngod (1.23). Reason is thus natural, in that it underlies the workings\nof the universe; and since we possess it too, as the divine element in\nus, in expressing our human nature it expresses our kinship with the\ngods as well. Hence Cicero can refer in Book 2 of the Laws to\nthe ‘true and original law’ as identified with the right\nreason of god (2.10).\n\nCicero’s thinking seems to be that to regard laws as no more\nthan human artefacts – that is, as not based in nature –\nis to concede that reward and punishment are the only motivations for\nobedience. But then it will be the rewards and punishments, not the\njustice or injustice of the act in question, that will have normative\nforce. But if that is so, then if one calculates correctly that, say,\ngreater utility will arise from breaking than obeying a law, it seems\nthat one has no reason to obey it. What is needed, rather, is a\nconception of justice as something to be sought, as Cicero puts it,\n‘for its own sake’ (1.48). That is, we must think of what\nis just as having an inherent normative force, to be pursued because\nit is just. And that means, for Cicero, that justice must be based in\nnature and not simply a matter of human convention.\n\nWhether or not we find this stance convincing, there is a specific\ntheory of justice that Cicero appears to have in mind as the object of\nhis critique: the Epicurean theory. Epicurus regarded justice as\nprecisely a matter of social agreements concluded with the aim of\nmaximizing utility. One should further note that Cicero’s friend\nAtticus is, along with Cicero’s brother Quintus, one of\nCicero’s two main interlocutors in the dialogue, and that\nAtticus is an adherent of Epicureanism. His presence seems to\nemphasize that there is an alternative point of view that is not being\ngiven the opportunity to defend itself. Strikingly, Cicero does not\neven say that he thinks the Epicurean theory is wrong; rather, he bids\nthe Epicureans abstain from all matters of government, which they\nneither know about nor have wished to know about (1.39). It is true\nthat the Epicureans, unlike the Stoics, generally maintained a\nquietist outlook and believed that by and large one should not be\npolitically active. But they did have a specific theory of justice. So\nCicero seems a little high-handed in excluding them from a\nconversation featuring that as one of its principal topics.\n\nEpicureans are not the only ones whose views Cicero seems intent on\nmarginalizing in this context. Remarkably, he asks the adherents of\nthe New (that is, sceptical) Academy to ‘be silent’, since\ntheir habit of attacking any doctrinal view will cause\n‘confusion’ and result in the ruin of Cicero’s\n‘elegantly arranged edifice’ (1.39). We have indeed just\nbeen reminded that Cicero himself is a follower of the sceptical\nAcademy, with Atticus’ ironical comment that Cicero is of course\nsomeone who does not follow his own judgement in debate but the\nauthority of others (1.36). Cicero replies that he indeed does not\nalways accept the authority of others but that he is here trying to\nestablish a foundation for states and cities (1.37).\n\nShould we take Cicero at face value here? Although one can understand\nthat having to deal with opposing views may make it more difficult to\nestablish the kind of basis for systems of law and justice that he has\nin mind, that could surely apply to any philosophical thesis and any\nsort of opposition. One might even suppose that attacking an edifice,\nhowever elegantly constructed, might lead to a stronger edifice being\nbuilt. Cicero in fact says that he would like to appease the sceptics\nand does not dare drive them off (1.39). So why does Cicero attempt\njust here to stifle debate? Why, in particular, does he draw attention\nto the fact that that is what he is doing? He need not have mentioned\nthe sceptics, nor for that matter the Epicureans. He need not have\nchosen Atticus as a participant whom he could then ask not to dispute\nhis basic premise.\n\nCicero clearly expects his readers to notice these moves. One might\nsay that to announce loudly that one is closing down debate is itself\nto initiate a debate. Cicero thus uses the notion of uniformity of\noutlook both to illustrate and critique a crucial feature of the\ntheory he is advocating. The idea of natural law is precisely the idea\nthat there is a universal set of normative principles of equal\napplicability in all contexts. If that idea is correct, then there is\nno room for divergence of opinion about what justice is. At the same\ntime, Cicero’s dismissal of the Epicurean and sceptical\nviewpoints reminds us that, in the real world as opposed to the ideal\none of perfected reason, there are competing and critical opinions,\nand that the universalist theory is itself a product of a particular\nphilosophical school (Stoicism).\n\nOn the one hand, then, we have a vision of uniformity, representing a\nkind of ideal endpoint in which all is organized and measured in\naccordance with the same basic principles. On the other, we have\nconcrete and divergent voices that embody a range of perspectives and\nshow where we are now and perhaps – though the voices may change\n– where we will be at any specific historical moment: at some\ndistance from an undisputed endpoint. In the very process of apparent\nsuppression of dissent, Cicero uses the resources of the dialogue form\nto draw readers into critical participation in his enquiry.\n",
    "section_title": "5.3 The Laws",
    "entry_title": "Cicero",
    "hierarchy_title": "Cicero || The First Period: Philosophical Politics || The Laws",
    "tokenized_text": [
        "first",
        "period",
        "philosophical",
        "politics",
        "law",
        "law",
        "republic",
        "scipio",
        "affirmed",
        "political",
        "leader",
        "requires",
        "knowledge",
        "justice",
        "law",
        "studied",
        "foundation",
        "discussion",
        "natural",
        "law",
        "law",
        "offer",
        "account",
        "foundation",
        "purpose",
        "account",
        "set",
        "parameter",
        "within",
        "concrete",
        "law",
        "must",
        "fall",
        "judged",
        "natural",
        "law",
        "god",
        "law",
        "also",
        "human",
        "being",
        "perfected",
        "reason",
        "would",
        "follow",
        "law",
        "identified",
        "right",
        "reason",
        "specifically",
        "right",
        "reason",
        "realm",
        "commanded",
        "forbidden",
        "normative",
        "account",
        "tell",
        "u",
        "law",
        "properly",
        "speaking",
        "may",
        "different",
        "actual",
        "law",
        "particular",
        "state",
        "enacted",
        "given",
        "normative",
        "character",
        "cicero",
        "enquiry",
        "difficult",
        "see",
        "law",
        "identified",
        "right",
        "reason",
        "rationality",
        "normative",
        "concept",
        "every",
        "piece",
        "thinking",
        "count",
        "rational",
        "rationality",
        "exercised",
        "imperfectly",
        "least",
        "principle",
        "perfectly",
        "one",
        "reason",
        "correctly",
        "relevant",
        "matter",
        "case",
        "unjust",
        "seems",
        "fair",
        "conclude",
        "one",
        "enunciate",
        "standard",
        "example",
        "actual",
        "law",
        "required",
        "measure",
        "law",
        "normative",
        "sense",
        "distinguishes",
        "thing",
        "unjust",
        "obvious",
        "concept",
        "nature",
        "natural",
        "loom",
        "large",
        "cicero",
        "account",
        "law",
        "one",
        "main",
        "purpose",
        "stress",
        "conducting",
        "normative",
        "enquiry",
        "say",
        "born",
        "justice",
        "right",
        "matter",
        "opinion",
        "nature",
        "cicero",
        "draw",
        "upon",
        "tradition",
        "already",
        "going",
        "back",
        "least",
        "far",
        "plato",
        "nature",
        "stand",
        "contrast",
        "convention",
        "merely",
        "matter",
        "convention",
        "opinion",
        "really",
        "nature",
        "case",
        "thus",
        "fact",
        "certain",
        "humanmade",
        "law",
        "state",
        "something",
        "right",
        "wrong",
        "mean",
        "pronouncement",
        "correct",
        "nature",
        "thus",
        "contrasted",
        "matter",
        "opinion",
        "convention",
        "first",
        "instance",
        "human",
        "nature",
        "witnessed",
        "cicero",
        "statement",
        "born",
        "justice",
        "belong",
        "specie",
        "extent",
        "alike",
        "particular",
        "possession",
        "reason",
        "distinguishes",
        "u",
        "creature",
        "explains",
        "sense",
        "mutual",
        "fellowship",
        "union",
        "human",
        "being",
        "mean",
        "formed",
        "nature",
        "share",
        "justice",
        "impart",
        "mean",
        "necessarily",
        "nature",
        "normative",
        "concept",
        "human",
        "fail",
        "live",
        "nature",
        "corrupted",
        "effect",
        "bad",
        "habit",
        "opinion",
        "nonetheless",
        "cicero",
        "argues",
        "one",
        "considers",
        "endowment",
        "human",
        "share",
        "one",
        "conclude",
        "justice",
        "natural",
        "human",
        "condition",
        "nature",
        "also",
        "refers",
        "compatibly",
        "nature",
        "universe",
        "whole",
        "since",
        "stoic",
        "theory",
        "cicero",
        "draw",
        "upon",
        "theory",
        "set",
        "fully",
        "book",
        "cicero",
        "nature",
        "god",
        "see",
        "esp",
        "universe",
        "nature",
        "cicero",
        "put",
        "governed",
        "god",
        "god",
        "turn",
        "exercise",
        "governing",
        "power",
        "activity",
        "right",
        "reason",
        "human",
        "least",
        "best",
        "condition",
        "share",
        "god",
        "reason",
        "thus",
        "natural",
        "underlies",
        "working",
        "universe",
        "since",
        "posse",
        "divine",
        "element",
        "u",
        "expressing",
        "human",
        "nature",
        "express",
        "kinship",
        "god",
        "well",
        "hence",
        "cicero",
        "refer",
        "book",
        "law",
        "true",
        "original",
        "law",
        "identified",
        "right",
        "reason",
        "god",
        "cicero",
        "thinking",
        "seems",
        "regard",
        "law",
        "human",
        "artefact",
        "based",
        "nature",
        "concede",
        "reward",
        "punishment",
        "motivation",
        "obedience",
        "reward",
        "punishment",
        "justice",
        "injustice",
        "act",
        "question",
        "normative",
        "force",
        "one",
        "calculates",
        "correctly",
        "say",
        "greater",
        "utility",
        "arise",
        "breaking",
        "obeying",
        "law",
        "seems",
        "one",
        "reason",
        "obey",
        "needed",
        "rather",
        "conception",
        "justice",
        "something",
        "sought",
        "cicero",
        "put",
        "sake",
        "must",
        "think",
        "inherent",
        "normative",
        "force",
        "pursued",
        "mean",
        "cicero",
        "justice",
        "must",
        "based",
        "nature",
        "simply",
        "matter",
        "human",
        "convention",
        "whether",
        "find",
        "stance",
        "convincing",
        "specific",
        "theory",
        "justice",
        "cicero",
        "appears",
        "mind",
        "object",
        "critique",
        "epicurean",
        "theory",
        "epicurus",
        "regarded",
        "justice",
        "precisely",
        "matter",
        "social",
        "agreement",
        "concluded",
        "aim",
        "maximizing",
        "utility",
        "one",
        "note",
        "cicero",
        "friend",
        "atticus",
        "along",
        "cicero",
        "brother",
        "quintus",
        "one",
        "cicero",
        "two",
        "main",
        "interlocutor",
        "dialogue",
        "atticus",
        "adherent",
        "epicureanism",
        "presence",
        "seems",
        "emphasize",
        "alternative",
        "point",
        "view",
        "given",
        "opportunity",
        "defend",
        "strikingly",
        "cicero",
        "even",
        "say",
        "think",
        "epicurean",
        "theory",
        "wrong",
        "rather",
        "bid",
        "epicurean",
        "abstain",
        "matter",
        "government",
        "neither",
        "know",
        "wished",
        "know",
        "true",
        "epicurean",
        "unlike",
        "stoic",
        "generally",
        "maintained",
        "quietist",
        "outlook",
        "believed",
        "large",
        "one",
        "politically",
        "active",
        "specific",
        "theory",
        "justice",
        "cicero",
        "seems",
        "little",
        "highhanded",
        "excluding",
        "conversation",
        "featuring",
        "one",
        "principal",
        "topic",
        "epicurean",
        "one",
        "whose",
        "view",
        "cicero",
        "seems",
        "intent",
        "marginalizing",
        "context",
        "remarkably",
        "asks",
        "adherent",
        "new",
        "sceptical",
        "academy",
        "silent",
        "since",
        "habit",
        "attacking",
        "doctrinal",
        "view",
        "cause",
        "confusion",
        "result",
        "ruin",
        "cicero",
        "elegantly",
        "arranged",
        "edifice",
        "indeed",
        "reminded",
        "cicero",
        "follower",
        "sceptical",
        "academy",
        "atticus",
        "ironical",
        "comment",
        "cicero",
        "course",
        "someone",
        "follow",
        "judgement",
        "debate",
        "authority",
        "others",
        "cicero",
        "reply",
        "indeed",
        "always",
        "accept",
        "authority",
        "others",
        "trying",
        "establish",
        "foundation",
        "state",
        "city",
        "take",
        "cicero",
        "face",
        "value",
        "although",
        "one",
        "understand",
        "deal",
        "opposing",
        "view",
        "may",
        "make",
        "difficult",
        "establish",
        "kind",
        "basis",
        "system",
        "law",
        "justice",
        "mind",
        "could",
        "surely",
        "apply",
        "philosophical",
        "thesis",
        "sort",
        "opposition",
        "one",
        "might",
        "even",
        "suppose",
        "attacking",
        "edifice",
        "however",
        "elegantly",
        "constructed",
        "might",
        "lead",
        "stronger",
        "edifice",
        "built",
        "cicero",
        "fact",
        "say",
        "would",
        "like",
        "appease",
        "sceptic",
        "dare",
        "drive",
        "cicero",
        "attempt",
        "stifle",
        "debate",
        "particular",
        "draw",
        "attention",
        "fact",
        "need",
        "mentioned",
        "sceptic",
        "matter",
        "epicurean",
        "need",
        "chosen",
        "atticus",
        "participant",
        "could",
        "ask",
        "dispute",
        "basic",
        "premise",
        "cicero",
        "clearly",
        "expects",
        "reader",
        "notice",
        "move",
        "one",
        "might",
        "say",
        "announce",
        "loudly",
        "one",
        "closing",
        "debate",
        "initiate",
        "debate",
        "cicero",
        "thus",
        "us",
        "notion",
        "uniformity",
        "outlook",
        "illustrate",
        "critique",
        "crucial",
        "feature",
        "theory",
        "advocating",
        "idea",
        "natural",
        "law",
        "precisely",
        "idea",
        "universal",
        "set",
        "normative",
        "principle",
        "equal",
        "applicability",
        "context",
        "idea",
        "correct",
        "room",
        "divergence",
        "opinion",
        "justice",
        "time",
        "cicero",
        "dismissal",
        "epicurean",
        "sceptical",
        "viewpoint",
        "reminds",
        "u",
        "real",
        "world",
        "opposed",
        "ideal",
        "one",
        "perfected",
        "reason",
        "competing",
        "critical",
        "opinion",
        "universalist",
        "theory",
        "product",
        "particular",
        "philosophical",
        "school",
        "stoicism",
        "one",
        "hand",
        "vision",
        "uniformity",
        "representing",
        "kind",
        "ideal",
        "endpoint",
        "organized",
        "measured",
        "accordance",
        "basic",
        "principle",
        "concrete",
        "divergent",
        "voice",
        "embody",
        "range",
        "perspective",
        "show",
        "perhaps",
        "though",
        "voice",
        "may",
        "change",
        "specific",
        "historical",
        "moment",
        "distance",
        "undisputed",
        "endpoint",
        "process",
        "apparent",
        "suppression",
        "dissent",
        "cicero",
        "us",
        "resource",
        "dialogue",
        "form",
        "draw",
        "reader",
        "critical",
        "participation",
        "enquiry"
    ]
}