{
    "main_text": "The Second Period: An Encyclopedia of Philosophy || Epistemology\n6.1 Epistemology\n\nAlthough it has come down to us in a rather misshapen state,\ncontaining portions of two quite different editions of the work,\nOn Academic Scepticism (in Latin Academica) cannot\nbe passed over, since it presents an account of the epistemological\nviewpoint of the sceptical Academy and so in effect serves as a\ndefence of the method that Cicero employs in much of his philosophical\nwriting. At the same time, Cicero does not present a one-sided\npicture. In the segment sometimes known (after its leading character)\nas the Lucullus, critique of the New, or sceptical, Academy\nis mounted, with Cicero responding on behalf of the sceptic.\n\nAgainst a position that denies that certainty is attainable, Lucullus\nargues that intellectual enquiry, which aims at proof, will be\nhamstrung, since proof requires certainty (2.26). Moreover, the\nsceptic’s refusal to allow that there can be\n‘cataleptic’ impressions – the Stoic technical term\nfor impressions that can be grasped with certainty – will\nsubject the sceptic to the charge of inconsistency (cf. 2.44): the\nsceptic holds that nothing can be grasped with certainty, but surely\nthe claim that ‘nothing can be grasped with certainty’\nmust itself be graspable with certainty, or else the sceptic position\nlacks firm foundation.\n\nIf the sceptics have their own counterpart of a criterion of truth, in\nterms of the notion of plausibility, they must surely regard that\nnotion as beyond dispute if it is to play its allotted role (2.29).\nGiven the importance of correctly identifying the proper basis for\none’s decisions and actions, it cannot for the sceptic be merely\nplausible, but must be certain, that plausibility is the right\ncriterion. Sceptics are thus impaled on a dilemma: their system\nundermines itself by being either inconsistent (if ‘nothing can\nbe grasped’ is graspable) or ineffectual (if it is not\ngraspable).\n\nLucullus continues to take aim at the notion of plausibility that\nfeatures as the sceptics’ criterion for determining what we\naccept and do (2.32); but he approaches it in a way that might seem to\nbeg the question, asking how the sceptic can maintain a criterion of\ntruth and falsehood if truth and falsehood are indistinguishable\n(2.33). It seems as if the sceptic could reply that they do not in\nfact have such a criterion. They do not, unlike their dogmatic\nopponents, claim to pronounce one thing true, another false. What they\ncan do – what, if they are right, is the most one can do –\nis identify one thing as plausible, another as implausible.\n\nLucullus has an interesting riposte to this, which involves\nquestioning the intelligibility of being able to determine what is\nplausible and what is not without a criterion for determining what is\ntrue and what is not. He points out that in rejecting the cataleptic\nimpression, the sceptic does not allow that there are impressions\ndistinctively marked out as truth-bearing. But if so, it follows that\nthere is no difference between true and false, in the sense that there\nis nothing about a given impression that will mark it out as true\nrather than false. So, says Lucullus, ‘there will be no\ncriterion’ (2.34). In other words, without a means of\ndetermining which is true, no impression will be more deserving of\ncredence than any other.\n\nMoreover, the notion of plausibility is, logically, tied to the notion\nof truth: what is plausible is what ‘resembles truth’, in\nLatin veri simile, the phrase Cicero uses as an alternative\nfor probabile to represent the concept of plausibility. If\nsomething is plausible, then it is likely (though not certain) to be\ntrue. But the sceptics by their own admission have no criterion for\ndetermining what is true. Hence, they have no way of judging something\nas likely to be true, since that presupposes a standard of truth\nagainst which the purported plausibility would be judged.\n\nCicero responds by sketching a distinction, made by the sceptical\nphilosopher Clitomachus, of two ways in which one might withhold\nassent: by refraining (a) from ‘completely’ assenting to\nanything, and (b) from approving or disapproving. The wise sceptic\nwill never completely assent to any impression but will\n‘approve’ those that are plausible and\n‘disapprove’ those that are not. One will then be able to\nact on the basis of those impressions one approves, without having\nentirely assented to them (2.104).\n\nThe distinction has an air of sophistry about it, but it corresponds\nreasonably well to the way we actually make decisions. Take a simple\ncase of my deciding whether to drink the tap water in my glass. It\nlooks and smells healthy, there seems nothing to suggest otherwise.\nNonetheless it might always be the case that it is unhealthy. I\n‘approve’ the impression that it is healthy and drink the\nwater, while accepting that it cannot, strictly speaking, be certain\nbut at most plausible that the water is healthy; hence I do not\n‘completely’ assent to the impression. If it turns out to\nbe unhealthy, my original impression was not mistaken, because I only\ntook it to be plausible, rather than true, that the water was healthy,\nwhich is consistent with its being unhealthy. Thus the wise sceptic\ncan act on the basis of mere plausibility while in an intelligible\nsense not getting things wrong.\n\nCicero suggests that even the Stoic sage will follow many things on\nthe basis of plausibility, if life is to be possible at all (2.99);\nand his point, I take it, is supposed to apply not just in case it\nturns out that there are no cataleptic impressions, but even in those\n(presumably frequent) situations where such impressions, should they\nexist, are not present. The wise still have to live. Indeed, if one\nincludes the crucial refinement made by the leading sceptical\nphilosopher Carneades as part of the plausibility criterion –\nnamely that the impression must be ‘unimpeded’ (2.104)\n– then we seem to have a way of addressing Lucullus’ point\nthat to have a notion of plausibility, or being likely to be true,\ndepends on one’s having a prior notion of truth as such.\n\nWhat does ‘unimpeded’ mean? Cicero spoke at 2.99 in terms\nof there being nothing that presents itself in opposition to the\nplausibility of the impression. Take the example of the water again.\nIt looks healthy in my glass, it comes from a generally reliable\nsource (my tap), there is nothing to indicate that it is not healthy\n– nothing, therefore, ‘impeding’, or presenting\nitself in opposition to, the plausibility of the impression that it is\nhealthy. Say, further, that I then hear on the radio a news report\nthat the water supply in my area has been contaminated. At this point\nthere is something opposing – undercutting, one might say\n– the plausibility of the impression that the water is healthy\nand I would not therefore drink it.\n\nHow does this tell against Lucullus’ criticism? It suggests\nthat, rather than plausibility being dependent on truth, we might\nbuild a notion of truth upon that of unimpeded plausibility. Take the\nwater case once again. What would it mean to be able to identify as\ntrue the impression that ‘this water is healthy’? It could\nbe argued that its truth would be a matter of there being nothing to\noppose the impression of plausibility – no\n‘defeaters’, as it were. Say, then, that I turn on the\nradio and hear no news reports pertaining to my water; but being the\nultra-cautious type I send the water to a lab for testing. It turns\nout that the sample is laden with harmful microbes. There is thus\nsomething opposing the plausibility of the impression that the water\nis healthy.\n\nIt seems as if one could move towards a notion of truth by utilising\nthe condition that there is nothing opposing an initial impression\nthat things are a certain way – in the water case, no news\nreport, no adverse lab results, and so forth. This would still be a\nnotion of truth as something possessed fallibly. But the sceptic can\nnow speak of identifying some things as true (rather than as simply\nplausible) and others as the contrary (2.111). Carneades at any rate\nis not trying to provide an equivalent of the Stoic notion of\ninfallible truth-possession. His ‘unimpeded’ condition is\na refinement designed to give a criterion of reasonable action in the\nabsence of such a notion. What one can do, using Carneades’\nmethod, is start with the impression of something’s being the\ncase and approach, but never reach, a position of certainty. It is a\nquestion of increasing the likelihood of correctness, not eliminating\ncompletely the possibility of error.\n\nIf so, then Cicero can likewise reject Lucullus’ assertion that\nthe sceptic must (inconsistently) hold their own theory of\nplausibility as certain. He reiterates Carneades’ view that the\ntheory, like any other claim, could at most have the status of\nplausibility by the very terms of the theory (2.110). Seen in the\nlight of the ‘unimpeded’ condition, plausibility now looks\na more robust notion than it may have appeared, and so the resting of\none’s whole procedure for decision and action on such a basis\nlooks correspondingly less fragile, though of course it is still\nfallible. But scepticism deserves to be rejected not if it cannot\nclaim certainty for its guiding principle, but if it fails to apply to\nitself the same standards of critical scrutiny that it does\nelsewhere.\n\nIn perhaps Cicero’s most technical work, he rarely allows us to\nlose sight of what purpose the technicality serves. Lucullus had ended\nhis speech in critique of scepticism by addressing Cicero himself,\nmaking what looks like a light-hearted jest that Cicero supports a\nphilosophy that keeps things in the dark despite his having brought\nthe most deeply hidden matters to light (2.62). He refers to the\nuncovering by Cicero of Catiline’s conspiracy, a plot whose\nnature and significance remain a matter of debate, but whose thwarting\nCicero refers to often and takes to represent his having more or less\nsingle-handedly saved the republic from catastrophe.\n\nThe punning contrast of obscurity and illumination that Lucullus\nemploys thus has a serious point, reminding us that what turns on the\nsometimes abstruse epistemology is the vital practical question of\nwhether the sceptical viewpoint allows there to be a proper basis for\ndecision and action, especially on the political stage. Roman –\nand of course not just Roman – politicians, including Cicero\nhimself and those whom he might hope to win over to the sceptical\ncause, must at times take life-and-death decisions.\n\nOne of the most controversial aspects of Cicero’s actions\nagainst Catiline was the execution without trial of five of the\nalleged co-conspirators, an act that ultimately led to Cicero’s\nexile. Is mere likelihood sufficient to justify the weight of\none’s actions in such cases? Should not certainty be the only\nproper basis? And is a criterion of plausibility even intelligible\nwithout a notion of certainty? Whatever we think of Cicero’s\nanswers to these questions, he leaves us in no doubt about why the\nquestions matter. Even at its most abstract, philosophy’s\nrelation to the concrete and practical lies at the heart of his\nenterprise.\n",
    "section_title": "6.1 Epistemology",
    "entry_title": "Cicero",
    "hierarchy_title": "Cicero || The Second Period: An Encyclopedia of Philosophy || Epistemology",
    "tokenized_text": [
        "second",
        "period",
        "encyclopedia",
        "philosophy",
        "epistemology",
        "epistemology",
        "although",
        "come",
        "u",
        "rather",
        "misshapen",
        "state",
        "containing",
        "portion",
        "two",
        "quite",
        "different",
        "edition",
        "work",
        "academic",
        "scepticism",
        "latin",
        "academica",
        "passed",
        "since",
        "present",
        "account",
        "epistemological",
        "viewpoint",
        "sceptical",
        "academy",
        "effect",
        "serf",
        "defence",
        "method",
        "cicero",
        "employ",
        "much",
        "philosophical",
        "writing",
        "time",
        "cicero",
        "present",
        "onesided",
        "picture",
        "segment",
        "sometimes",
        "known",
        "leading",
        "character",
        "lucullus",
        "critique",
        "new",
        "sceptical",
        "academy",
        "mounted",
        "cicero",
        "responding",
        "behalf",
        "sceptic",
        "position",
        "denies",
        "certainty",
        "attainable",
        "lucullus",
        "argues",
        "intellectual",
        "enquiry",
        "aim",
        "proof",
        "hamstrung",
        "since",
        "proof",
        "requires",
        "certainty",
        "moreover",
        "sceptic",
        "refusal",
        "allow",
        "cataleptic",
        "impression",
        "stoic",
        "technical",
        "term",
        "impression",
        "grasped",
        "certainty",
        "subject",
        "sceptic",
        "charge",
        "inconsistency",
        "cf",
        "sceptic",
        "hold",
        "nothing",
        "grasped",
        "certainty",
        "surely",
        "claim",
        "nothing",
        "grasped",
        "certainty",
        "must",
        "graspable",
        "certainty",
        "else",
        "sceptic",
        "position",
        "lack",
        "firm",
        "foundation",
        "sceptic",
        "counterpart",
        "criterion",
        "truth",
        "term",
        "notion",
        "plausibility",
        "must",
        "surely",
        "regard",
        "notion",
        "beyond",
        "dispute",
        "play",
        "allotted",
        "role",
        "given",
        "importance",
        "correctly",
        "identifying",
        "proper",
        "basis",
        "one",
        "decision",
        "action",
        "sceptic",
        "merely",
        "plausible",
        "must",
        "certain",
        "plausibility",
        "right",
        "criterion",
        "sceptic",
        "thus",
        "impaled",
        "dilemma",
        "system",
        "undermines",
        "either",
        "inconsistent",
        "nothing",
        "grasped",
        "graspable",
        "ineffectual",
        "graspable",
        "lucullus",
        "continues",
        "take",
        "aim",
        "notion",
        "plausibility",
        "feature",
        "sceptic",
        "criterion",
        "determining",
        "accept",
        "approach",
        "way",
        "might",
        "seem",
        "beg",
        "question",
        "asking",
        "sceptic",
        "maintain",
        "criterion",
        "truth",
        "falsehood",
        "truth",
        "falsehood",
        "indistinguishable",
        "seems",
        "sceptic",
        "could",
        "reply",
        "fact",
        "criterion",
        "unlike",
        "dogmatic",
        "opponent",
        "claim",
        "pronounce",
        "one",
        "thing",
        "true",
        "another",
        "false",
        "right",
        "one",
        "identify",
        "one",
        "thing",
        "plausible",
        "another",
        "implausible",
        "lucullus",
        "interesting",
        "riposte",
        "involves",
        "questioning",
        "intelligibility",
        "able",
        "determine",
        "plausible",
        "without",
        "criterion",
        "determining",
        "true",
        "point",
        "rejecting",
        "cataleptic",
        "impression",
        "sceptic",
        "allow",
        "impression",
        "distinctively",
        "marked",
        "truthbearing",
        "follows",
        "difference",
        "true",
        "false",
        "sense",
        "nothing",
        "given",
        "impression",
        "mark",
        "true",
        "rather",
        "false",
        "say",
        "lucullus",
        "criterion",
        "word",
        "without",
        "mean",
        "determining",
        "true",
        "impression",
        "deserving",
        "credence",
        "moreover",
        "notion",
        "plausibility",
        "logically",
        "tied",
        "notion",
        "truth",
        "plausible",
        "resembles",
        "truth",
        "latin",
        "veri",
        "simile",
        "phrase",
        "cicero",
        "us",
        "alternative",
        "probabile",
        "represent",
        "concept",
        "plausibility",
        "something",
        "plausible",
        "likely",
        "though",
        "certain",
        "true",
        "sceptic",
        "admission",
        "criterion",
        "determining",
        "true",
        "hence",
        "way",
        "judging",
        "something",
        "likely",
        "true",
        "since",
        "presupposes",
        "standard",
        "truth",
        "purported",
        "plausibility",
        "would",
        "judged",
        "cicero",
        "responds",
        "sketching",
        "distinction",
        "made",
        "sceptical",
        "philosopher",
        "clitomachus",
        "two",
        "way",
        "one",
        "might",
        "withhold",
        "assent",
        "refraining",
        "completely",
        "assenting",
        "anything",
        "b",
        "approving",
        "disapproving",
        "wise",
        "sceptic",
        "never",
        "completely",
        "assent",
        "impression",
        "approve",
        "plausible",
        "disapprove",
        "one",
        "able",
        "act",
        "basis",
        "impression",
        "one",
        "approves",
        "without",
        "entirely",
        "assented",
        "distinction",
        "air",
        "sophistry",
        "corresponds",
        "reasonably",
        "well",
        "way",
        "actually",
        "make",
        "decision",
        "take",
        "simple",
        "case",
        "deciding",
        "whether",
        "drink",
        "tap",
        "water",
        "glass",
        "look",
        "smell",
        "healthy",
        "seems",
        "nothing",
        "suggest",
        "otherwise",
        "nonetheless",
        "might",
        "always",
        "case",
        "unhealthy",
        "approve",
        "impression",
        "healthy",
        "drink",
        "water",
        "accepting",
        "strictly",
        "speaking",
        "certain",
        "plausible",
        "water",
        "healthy",
        "hence",
        "completely",
        "assent",
        "impression",
        "turn",
        "unhealthy",
        "original",
        "impression",
        "mistaken",
        "took",
        "plausible",
        "rather",
        "true",
        "water",
        "healthy",
        "consistent",
        "unhealthy",
        "thus",
        "wise",
        "sceptic",
        "act",
        "basis",
        "mere",
        "plausibility",
        "intelligible",
        "sense",
        "getting",
        "thing",
        "wrong",
        "cicero",
        "suggests",
        "even",
        "stoic",
        "sage",
        "follow",
        "many",
        "thing",
        "basis",
        "plausibility",
        "life",
        "possible",
        "point",
        "take",
        "supposed",
        "apply",
        "case",
        "turn",
        "cataleptic",
        "impression",
        "even",
        "presumably",
        "frequent",
        "situation",
        "impression",
        "exist",
        "present",
        "wise",
        "still",
        "live",
        "indeed",
        "one",
        "includes",
        "crucial",
        "refinement",
        "made",
        "leading",
        "sceptical",
        "philosopher",
        "carneades",
        "part",
        "plausibility",
        "criterion",
        "namely",
        "impression",
        "must",
        "unimpeded",
        "seem",
        "way",
        "addressing",
        "lucullus",
        "point",
        "notion",
        "plausibility",
        "likely",
        "true",
        "depends",
        "one",
        "prior",
        "notion",
        "truth",
        "unimpeded",
        "mean",
        "cicero",
        "spoke",
        "term",
        "nothing",
        "present",
        "opposition",
        "plausibility",
        "impression",
        "take",
        "example",
        "water",
        "look",
        "healthy",
        "glass",
        "come",
        "generally",
        "reliable",
        "source",
        "tap",
        "nothing",
        "indicate",
        "healthy",
        "nothing",
        "therefore",
        "impeding",
        "presenting",
        "opposition",
        "plausibility",
        "impression",
        "healthy",
        "say",
        "hear",
        "radio",
        "news",
        "report",
        "water",
        "supply",
        "area",
        "contaminated",
        "point",
        "something",
        "opposing",
        "undercutting",
        "one",
        "might",
        "say",
        "plausibility",
        "impression",
        "water",
        "healthy",
        "would",
        "therefore",
        "drink",
        "tell",
        "lucullus",
        "criticism",
        "suggests",
        "rather",
        "plausibility",
        "dependent",
        "truth",
        "might",
        "build",
        "notion",
        "truth",
        "upon",
        "unimpeded",
        "plausibility",
        "take",
        "water",
        "case",
        "would",
        "mean",
        "able",
        "identify",
        "true",
        "impression",
        "water",
        "healthy",
        "could",
        "argued",
        "truth",
        "would",
        "matter",
        "nothing",
        "oppose",
        "impression",
        "plausibility",
        "defeaters",
        "say",
        "turn",
        "radio",
        "hear",
        "news",
        "report",
        "pertaining",
        "water",
        "ultracautious",
        "type",
        "send",
        "water",
        "lab",
        "testing",
        "turn",
        "sample",
        "laden",
        "harmful",
        "microbe",
        "thus",
        "something",
        "opposing",
        "plausibility",
        "impression",
        "water",
        "healthy",
        "seems",
        "one",
        "could",
        "move",
        "towards",
        "notion",
        "truth",
        "utilising",
        "condition",
        "nothing",
        "opposing",
        "initial",
        "impression",
        "thing",
        "certain",
        "way",
        "water",
        "case",
        "news",
        "report",
        "adverse",
        "lab",
        "result",
        "forth",
        "would",
        "still",
        "notion",
        "truth",
        "something",
        "possessed",
        "fallibly",
        "sceptic",
        "speak",
        "identifying",
        "thing",
        "true",
        "rather",
        "simply",
        "plausible",
        "others",
        "contrary",
        "carneades",
        "rate",
        "trying",
        "provide",
        "equivalent",
        "stoic",
        "notion",
        "infallible",
        "truthpossession",
        "unimpeded",
        "condition",
        "refinement",
        "designed",
        "give",
        "criterion",
        "reasonable",
        "action",
        "absence",
        "notion",
        "one",
        "using",
        "carneades",
        "method",
        "start",
        "impression",
        "something",
        "case",
        "approach",
        "never",
        "reach",
        "position",
        "certainty",
        "question",
        "increasing",
        "likelihood",
        "correctness",
        "eliminating",
        "completely",
        "possibility",
        "error",
        "cicero",
        "likewise",
        "reject",
        "lucullus",
        "assertion",
        "sceptic",
        "must",
        "inconsistently",
        "hold",
        "theory",
        "plausibility",
        "certain",
        "reiterates",
        "carneades",
        "view",
        "theory",
        "like",
        "claim",
        "could",
        "status",
        "plausibility",
        "term",
        "theory",
        "seen",
        "light",
        "unimpeded",
        "condition",
        "plausibility",
        "look",
        "robust",
        "notion",
        "may",
        "appeared",
        "resting",
        "one",
        "whole",
        "procedure",
        "decision",
        "action",
        "basis",
        "look",
        "correspondingly",
        "le",
        "fragile",
        "though",
        "course",
        "still",
        "fallible",
        "scepticism",
        "deserves",
        "rejected",
        "claim",
        "certainty",
        "guiding",
        "principle",
        "fails",
        "apply",
        "standard",
        "critical",
        "scrutiny",
        "elsewhere",
        "perhaps",
        "cicero",
        "technical",
        "work",
        "rarely",
        "allows",
        "u",
        "lose",
        "sight",
        "purpose",
        "technicality",
        "serf",
        "lucullus",
        "ended",
        "speech",
        "critique",
        "scepticism",
        "addressing",
        "cicero",
        "making",
        "look",
        "like",
        "lighthearted",
        "jest",
        "cicero",
        "support",
        "philosophy",
        "keep",
        "thing",
        "dark",
        "despite",
        "brought",
        "deeply",
        "hidden",
        "matter",
        "light",
        "refers",
        "uncovering",
        "cicero",
        "catiline",
        "conspiracy",
        "plot",
        "whose",
        "nature",
        "significance",
        "remain",
        "matter",
        "debate",
        "whose",
        "thwarting",
        "cicero",
        "refers",
        "often",
        "take",
        "represent",
        "le",
        "singlehandedly",
        "saved",
        "republic",
        "catastrophe",
        "punning",
        "contrast",
        "obscurity",
        "illumination",
        "lucullus",
        "employ",
        "thus",
        "serious",
        "point",
        "reminding",
        "u",
        "turn",
        "sometimes",
        "abstruse",
        "epistemology",
        "vital",
        "practical",
        "question",
        "whether",
        "sceptical",
        "viewpoint",
        "allows",
        "proper",
        "basis",
        "decision",
        "action",
        "especially",
        "political",
        "stage",
        "roman",
        "course",
        "roman",
        "politician",
        "including",
        "cicero",
        "might",
        "hope",
        "win",
        "sceptical",
        "cause",
        "must",
        "time",
        "take",
        "lifeanddeath",
        "decision",
        "one",
        "controversial",
        "aspect",
        "cicero",
        "action",
        "catiline",
        "execution",
        "without",
        "trial",
        "five",
        "alleged",
        "coconspirators",
        "act",
        "ultimately",
        "led",
        "cicero",
        "exile",
        "mere",
        "likelihood",
        "sufficient",
        "justify",
        "weight",
        "one",
        "action",
        "case",
        "certainty",
        "proper",
        "basis",
        "criterion",
        "plausibility",
        "even",
        "intelligible",
        "without",
        "notion",
        "certainty",
        "whatever",
        "think",
        "cicero",
        "answer",
        "question",
        "leaf",
        "u",
        "doubt",
        "question",
        "matter",
        "even",
        "abstract",
        "philosophy",
        "relation",
        "concrete",
        "practical",
        "lie",
        "heart",
        "enterprise"
    ]
}