{
    "main_text": "The challenge of internal diversity || Liberal nationalists vs postnationalists\n2.2 Liberal nationalists vs postnationalists\n\nThe debate between supporters and critics of differentiated\ncitizenship centres on the model’s supposed effect on civic\nintegration. It is assumed that democratic citizenship, properly\nconstrued, can indeed function as a significant lever for integration.\nThe idea is that citizenship as a set of civil, political and social\nrights and as a political practice can help generate desirable\nfeelings of identity and belonging. This statement hides significant\ndisagreement over how to characterize the relation between citizenship\nand nationality. Some consider that citizenship’s capacity to\nfulfil its integrative function depends on, and feeds upon, the prior\nexistence of a common nationality while others counter that, under\nconditions of pluralism, nationality cannot function as a suitable\nfocus of allegiance and identity. The collective identity of modern\ndemocratic states should rather be based upon more abstract and\nuniversalistic political and legal principles that transcend cultural\ndifference. This debate brings to the fore differing assessments of\nthe role that citizenship can play in contemporary societies\ncharacterized by a high degree of complexity and internal\ndiversity.\n\nLiberal nationalists like David Miller have argued that only specific\nforms of political practice can produce high levels of trust and\nloyalty between citizens (Miller 2000, 87). The political activities\nof the citizens of Athens or of Rousseau’s ideal Republic\npresumed face-to-face relations of cooperation that favour the growth\nof such sentiments. The scale and complexity of modern states have\nmade the kind of political practice envisaged by Rousseau and\ndescribed by Aristotle at best marginal. Citizens do not meet under an\noak tree to formulate the laws; they are basically strangers and\ncitizens’ involvement in the politics of representative\ndemocracies is episodic and diluted. Politics in this context cannot\nbe expected to play a central role in most individuals’ lives;\nsomething else must generate the trust and loyalty necessary to the\nfunctioning of a political community. Historically, it is the nation\nthat has allowed large numbers of individuals to feel a sense of\ncommonality, setting them apart from others and making solidarity\namong strangers possible.\n\nPostnationalists do not dispute the key role played by the nation in\nmaking republican politics possible in large modern states. They agree\nthat reference to a common nationality allowed the political\nmobilization of their inhabitants, calling on their shared descent,\nhistory, or language. However, democracy’s association with the\nnation-state is contingent rather than necessary. Democratic politics\ncan, in principle, free itself from its historical moorings.\nPostnationalists claim that this dissociation is not only possible,\nbut necessary for moral and pragmatic reasons (Habermas 1998,\n132).\n\nOn the one hand, the historical balance sheet of the nation-state\nreveals a legacy of oppression of minority cultures within and\ncultural, political, and economic imperialism outside its borders. On\nthe other hand, the acknowledgment of the nation-state’s\n(growing) internal diversity and sensitivity to the injustice of\nforced assimilation undermine its ability to continue playing the role\nit fulfilled in the 19th and early 20th\ncenturies. Imposing the majority culture upon minorities may simply\nmake it more difficult for them to identify with the nation-state and\nweaken its legitimacy.\n\nIn conditions of pluralism, therefore, the majority culture cannot\nserve as the grounding of a shared identity. It must be replaced by\nuniversalistic principles of human rights and the rule of law, which\ndo not, it is argued, imply the imposition of a particular majority\nculture on minorities. Each political community develops distinctive\ninterpretations of the meaning of these principles over time, which\nbecome embodied in its political and legal institutions and practices.\nThese in turn form a political culture that crystallizes around the\ncountry’s constitution and makes those principles into a\n‘concrete universal’. This embedding of democratic and\nliberal principles in a distinctive political culture can, in turn,\ngive rise to what Jürgen Habermas has called a\n“constitutional patriotism”, which should replace\nnationalism as the focus of a common identity. In countries that have\nachieved a strong national consciousness, the political culture has\nlong been entangled with the majority culture. This\n“fusion”, argues Habermas, “must be dissolved if it\nis to be possible for different cultural, ethnic, and religious forms\nof life to coexist and interact on equal terms within the\nsame political community” (Habermas 1998, 118).\n\nThe thrust of the argument is that democratic political practice can\nprovide a sufficient stimulus to integration in complex democratic\nsocieties and is indeed the only one properly available to them. There\nis no need for a background consensus based on cultural homogeneity to\nact as a ‘catalyzing condition’ for democracy to the\nextent that the democratic political process, involving public\ndeliberation and decision-making, makes “a reasonable political\nunderstanding possible, even among strangers.” Democracy, as a\nset of procedures, can secure legitimacy in the absence of more\nsubstantive commonalities between citizens and achieve social\nintegration. Since it is not wedded to particular cultural premises,\nit can be responsive to changes in the cultural composition of the\ncitizenry and generate a common political culture (Habermas 2001a,\n73–74). Habermas’s position, then, gives pride of place to\nthe democratic process and to the political participation of citizens,\nwhich play a key role in securing social integration: “In\ncomplex societies, it is the deliberative opinion- and will-formation\nof citizens, grounded in the principles of popular sovereignty, that\nforms the ultimate medium for a form of abstract, legally constructed\nsolidarity that reproduces itself through political\nparticipation” (Habermas 2001a, 76).\n\nHowever, the democratic process can fulfil its role only if it\nachieves a certain level of output legitimacy: appropriate levels of\nsolidarity are sustainable only if basic standards of social justice\nare satisfied (Habermas 2001a, 76). If it is to remain a source of\nsolidarity, citizenship must be seen as a valuable status, associated\nnot only with civil and political rights, but also with the fulfilment\nof fundamental social and cultural rights (Habermas 1998,\n118–119).\n\nFor most liberal nationalists, this seems like putting the cart before\nthe horse since a successful welfare state, they argue, is possible\nonly if citizens already enjoy high levels of mutual trust and\nloyalty. Welfare policies suppose that we make sacrifices for\nanonymous others who differ from us in terms of their ethnic origin,\nreligion, and way of life. But in democracies, redistributive policies\ncan be sustained only if they enjoy strong levels of public support.\nThis support is dependent on a sense of common identity that\ntranscends difference and motivates citizens to share their revenues\nwith people whom they do not know, but to whom they feel related by\ncommon bonds. This sentiment implies reciprocity: the expectation\nthat, in times of need, one could also benefit from the solidarity of\nfellow citizens (Miller, 1995; Canovan, 1996).\n\nLiberal nationalists and other critics of the postnationalist position\ngo on to argue that freeing the liberal democratic state from its\nhistorical moorings is neither possible, nor necessary. They recognize\nthat the link between liberal democracy and the nation is historically\ncontingent rather than necessary or conceptual while adding that this\ndoes not mean that they can or should be dissociated (Miller 1995,\n29–30; Kymlicka 2003). Calling for the separation of a\ncountry’s political culture from the majority group’s\nculture is easier said than done. While it may be comparably easy to\ndiscard the most egregious forms of fusion, if there is the political\nwill to do so (for instance, by de-establishing the Anglican church in\nthe case of England), any political culture will be ethically\npatterned in ways that are difficult for members of the majority to\nappreciate. Expressions such as “cutting the umbilical\ncord” or “dissolving” the fusion overstate the\nextent to which a political culture may be disengaged from the\nbackground culture. This is not necessarily cause for alarm, it is\nargued, since the nation need not be construed in ways that exclude\nminorities. Nationhood can be understood in sufficiently\n‘thin’ terms to accommodate minorities while being\n‘thick’ enough to generate appropriate sentiments of\nsolidarity, loyalty, and trust.\n\nThere are different versions of this thin understanding of nationhood.\nWhat they share is the downplaying of substantive commonalities of\ndescent, culture and religion in favour of political and legal\nprinciples and institutions as well as a description of national\nidentity as flexible and open to change\n .[11]\n Once immigrants are citizens, they can participate in the collective\nconversation in which citizens debate and constantly reinterpret the\nnation’s identity. What immigrants are required to display is a\n“willingness to accept current political structures and to\nengage with the host community so that a new common identity can be\nforged” (Miller 1995, 129). They are expected “to speak a\ncommon national language”, “feel loyalty to national\ninstitutions” and “share a commitment to maintaining the\nnation as a single, self-governing community into the indefinite\nfuture” (Kymlicka 2003, 273).\n\nGiven the thin version of national identity they propose, one might\nconclude that liberal nationalists are not that far from the\nconstitutional patriotism of Habermas. After all, both positions seem\nto give the central role to a common political culture. The distance\nseparating them becomes clear when we look at the political\nimplications of their respective views, like when evaluating the\nprospects of the European Union. Liberal nationalists are often\nsceptical towards the European experiment while postnationalists are\nfirm\n supporters.[12]\n This difference flows from their respective conceptions of what makes\nand sustains a political culture as a source of integration. For\nliberal nationalists, continuity is essential: a political culture\nderives much of its strength from an anchoring in the history and\nnarrative of a distinct political community extending backwards and\nforwards in time. They are sceptical of political voluntarism and of\nwhat can be achieved through formal political institutions. Democratic\nprocedures alone, divorced from a richer background, can neither\ngenerate nor sustain a robust political culture or a sense of common\nidentity.\n\nIn contrast, postnationalists like Habermas consider that the\ndemocratic process is crucial. The postnationalist conception gives\ngreater weight to political practice and to the legal and political\ninstitutions that sustain it rather than to their cultural and\nhistorical moorings. This explains Habermas’s militant support\nof the European project and his belief that adopting a constitution\ncould have a “catalytic effect” on the process of\nconstructing a ‘more perfect Union’ (Habermas 2001b,\n16).\n",
    "section_title": "2.2 Liberal nationalists vs postnationalists",
    "entry_title": "Citizenship",
    "hierarchy_title": "Citizenship || The challenge of internal diversity || Liberal nationalists vs postnationalists",
    "tokenized_text": [
        "challenge",
        "internal",
        "diversity",
        "liberal",
        "nationalist",
        "v",
        "postnationalists",
        "liberal",
        "nationalist",
        "v",
        "postnationalists",
        "debate",
        "supporter",
        "critic",
        "differentiated",
        "citizenship",
        "centre",
        "model",
        "supposed",
        "effect",
        "civic",
        "integration",
        "assumed",
        "democratic",
        "citizenship",
        "properly",
        "construed",
        "indeed",
        "function",
        "significant",
        "lever",
        "integration",
        "idea",
        "citizenship",
        "set",
        "civil",
        "political",
        "social",
        "right",
        "political",
        "practice",
        "help",
        "generate",
        "desirable",
        "feeling",
        "identity",
        "belonging",
        "statement",
        "hide",
        "significant",
        "disagreement",
        "characterize",
        "relation",
        "citizenship",
        "nationality",
        "consider",
        "citizenship",
        "capacity",
        "fulfil",
        "integrative",
        "function",
        "depends",
        "feed",
        "upon",
        "prior",
        "existence",
        "common",
        "nationality",
        "others",
        "counter",
        "condition",
        "pluralism",
        "nationality",
        "function",
        "suitable",
        "focus",
        "allegiance",
        "identity",
        "collective",
        "identity",
        "modern",
        "democratic",
        "state",
        "rather",
        "based",
        "upon",
        "abstract",
        "universalistic",
        "political",
        "legal",
        "principle",
        "transcend",
        "cultural",
        "difference",
        "debate",
        "brings",
        "fore",
        "differing",
        "assessment",
        "role",
        "citizenship",
        "play",
        "contemporary",
        "society",
        "characterized",
        "high",
        "degree",
        "complexity",
        "internal",
        "diversity",
        "liberal",
        "nationalist",
        "like",
        "david",
        "miller",
        "argued",
        "specific",
        "form",
        "political",
        "practice",
        "produce",
        "high",
        "level",
        "trust",
        "loyalty",
        "citizen",
        "miller",
        "political",
        "activity",
        "citizen",
        "athens",
        "rousseau",
        "ideal",
        "republic",
        "presumed",
        "facetoface",
        "relation",
        "cooperation",
        "favour",
        "growth",
        "sentiment",
        "scale",
        "complexity",
        "modern",
        "state",
        "made",
        "kind",
        "political",
        "practice",
        "envisaged",
        "rousseau",
        "described",
        "aristotle",
        "best",
        "marginal",
        "citizen",
        "meet",
        "oak",
        "tree",
        "formulate",
        "law",
        "basically",
        "stranger",
        "citizen",
        "involvement",
        "politics",
        "representative",
        "democracy",
        "episodic",
        "diluted",
        "politics",
        "context",
        "expected",
        "play",
        "central",
        "role",
        "individual",
        "life",
        "something",
        "else",
        "must",
        "generate",
        "trust",
        "loyalty",
        "necessary",
        "functioning",
        "political",
        "community",
        "historically",
        "nation",
        "allowed",
        "large",
        "number",
        "individual",
        "feel",
        "sense",
        "commonality",
        "setting",
        "apart",
        "others",
        "making",
        "solidarity",
        "among",
        "stranger",
        "possible",
        "postnationalists",
        "dispute",
        "key",
        "role",
        "played",
        "nation",
        "making",
        "republican",
        "politics",
        "possible",
        "large",
        "modern",
        "state",
        "agree",
        "reference",
        "common",
        "nationality",
        "allowed",
        "political",
        "mobilization",
        "inhabitant",
        "calling",
        "shared",
        "descent",
        "history",
        "language",
        "however",
        "democracy",
        "association",
        "nationstate",
        "contingent",
        "rather",
        "necessary",
        "democratic",
        "politics",
        "principle",
        "free",
        "historical",
        "mooring",
        "postnationalists",
        "claim",
        "dissociation",
        "possible",
        "necessary",
        "moral",
        "pragmatic",
        "reason",
        "habermas",
        "one",
        "hand",
        "historical",
        "balance",
        "sheet",
        "nationstate",
        "reveals",
        "legacy",
        "oppression",
        "minority",
        "culture",
        "within",
        "cultural",
        "political",
        "economic",
        "imperialism",
        "outside",
        "border",
        "hand",
        "acknowledgment",
        "nationstate",
        "growing",
        "internal",
        "diversity",
        "sensitivity",
        "injustice",
        "forced",
        "assimilation",
        "undermine",
        "ability",
        "continue",
        "playing",
        "role",
        "fulfilled",
        "th",
        "early",
        "th",
        "century",
        "imposing",
        "majority",
        "culture",
        "upon",
        "minority",
        "may",
        "simply",
        "make",
        "difficult",
        "identify",
        "nationstate",
        "weaken",
        "legitimacy",
        "condition",
        "pluralism",
        "therefore",
        "majority",
        "culture",
        "serve",
        "grounding",
        "shared",
        "identity",
        "must",
        "replaced",
        "universalistic",
        "principle",
        "human",
        "right",
        "rule",
        "law",
        "argued",
        "imply",
        "imposition",
        "particular",
        "majority",
        "culture",
        "minority",
        "political",
        "community",
        "develops",
        "distinctive",
        "interpretation",
        "meaning",
        "principle",
        "time",
        "become",
        "embodied",
        "political",
        "legal",
        "institution",
        "practice",
        "turn",
        "form",
        "political",
        "culture",
        "crystallizes",
        "around",
        "country",
        "constitution",
        "make",
        "principle",
        "concrete",
        "universal",
        "embedding",
        "democratic",
        "liberal",
        "principle",
        "distinctive",
        "political",
        "culture",
        "turn",
        "give",
        "rise",
        "jürgen",
        "habermas",
        "called",
        "constitutional",
        "patriotism",
        "replace",
        "nationalism",
        "focus",
        "common",
        "identity",
        "country",
        "achieved",
        "strong",
        "national",
        "consciousness",
        "political",
        "culture",
        "long",
        "entangled",
        "majority",
        "culture",
        "fusion",
        "argues",
        "habermas",
        "must",
        "dissolved",
        "possible",
        "different",
        "cultural",
        "ethnic",
        "religious",
        "form",
        "life",
        "coexist",
        "interact",
        "equal",
        "term",
        "within",
        "political",
        "community",
        "habermas",
        "thrust",
        "argument",
        "democratic",
        "political",
        "practice",
        "provide",
        "sufficient",
        "stimulus",
        "integration",
        "complex",
        "democratic",
        "society",
        "indeed",
        "one",
        "properly",
        "available",
        "need",
        "background",
        "consensus",
        "based",
        "cultural",
        "homogeneity",
        "act",
        "catalyzing",
        "condition",
        "democracy",
        "extent",
        "democratic",
        "political",
        "process",
        "involving",
        "public",
        "deliberation",
        "decisionmaking",
        "make",
        "reasonable",
        "political",
        "understanding",
        "possible",
        "even",
        "among",
        "strangers",
        "democracy",
        "set",
        "procedure",
        "secure",
        "legitimacy",
        "absence",
        "substantive",
        "commonality",
        "citizen",
        "achieve",
        "social",
        "integration",
        "since",
        "wedded",
        "particular",
        "cultural",
        "premise",
        "responsive",
        "change",
        "cultural",
        "composition",
        "citizenry",
        "generate",
        "common",
        "political",
        "culture",
        "habermas",
        "a",
        "habermas",
        "position",
        "give",
        "pride",
        "place",
        "democratic",
        "process",
        "political",
        "participation",
        "citizen",
        "play",
        "key",
        "role",
        "securing",
        "social",
        "integration",
        "complex",
        "society",
        "deliberative",
        "opinion",
        "willformation",
        "citizen",
        "grounded",
        "principle",
        "popular",
        "sovereignty",
        "form",
        "ultimate",
        "medium",
        "form",
        "abstract",
        "legally",
        "constructed",
        "solidarity",
        "reproduces",
        "political",
        "participation",
        "habermas",
        "a",
        "however",
        "democratic",
        "process",
        "fulfil",
        "role",
        "achieves",
        "certain",
        "level",
        "output",
        "legitimacy",
        "appropriate",
        "level",
        "solidarity",
        "sustainable",
        "basic",
        "standard",
        "social",
        "justice",
        "satisfied",
        "habermas",
        "a",
        "remain",
        "source",
        "solidarity",
        "citizenship",
        "must",
        "seen",
        "valuable",
        "status",
        "associated",
        "civil",
        "political",
        "right",
        "also",
        "fulfilment",
        "fundamental",
        "social",
        "cultural",
        "right",
        "habermas",
        "liberal",
        "nationalist",
        "seems",
        "like",
        "putting",
        "cart",
        "horse",
        "since",
        "successful",
        "welfare",
        "state",
        "argue",
        "possible",
        "citizen",
        "already",
        "enjoy",
        "high",
        "level",
        "mutual",
        "trust",
        "loyalty",
        "welfare",
        "policy",
        "suppose",
        "make",
        "sacrifice",
        "anonymous",
        "others",
        "differ",
        "u",
        "term",
        "ethnic",
        "origin",
        "religion",
        "way",
        "life",
        "democracy",
        "redistributive",
        "policy",
        "sustained",
        "enjoy",
        "strong",
        "level",
        "public",
        "support",
        "support",
        "dependent",
        "sense",
        "common",
        "identity",
        "transcends",
        "difference",
        "motivates",
        "citizen",
        "share",
        "revenue",
        "people",
        "know",
        "feel",
        "related",
        "common",
        "bond",
        "sentiment",
        "implies",
        "reciprocity",
        "expectation",
        "time",
        "need",
        "one",
        "could",
        "also",
        "benefit",
        "solidarity",
        "fellow",
        "citizen",
        "miller",
        "canovan",
        "liberal",
        "nationalist",
        "critic",
        "postnationalist",
        "position",
        "go",
        "argue",
        "freeing",
        "liberal",
        "democratic",
        "state",
        "historical",
        "mooring",
        "neither",
        "possible",
        "necessary",
        "recognize",
        "link",
        "liberal",
        "democracy",
        "nation",
        "historically",
        "contingent",
        "rather",
        "necessary",
        "conceptual",
        "adding",
        "mean",
        "dissociated",
        "miller",
        "kymlicka",
        "calling",
        "separation",
        "country",
        "political",
        "culture",
        "majority",
        "group",
        "culture",
        "easier",
        "said",
        "done",
        "may",
        "comparably",
        "easy",
        "discard",
        "egregious",
        "form",
        "fusion",
        "political",
        "instance",
        "deestablishing",
        "anglican",
        "church",
        "case",
        "england",
        "political",
        "culture",
        "ethically",
        "patterned",
        "way",
        "difficult",
        "member",
        "majority",
        "appreciate",
        "expression",
        "cutting",
        "umbilical",
        "cord",
        "dissolving",
        "fusion",
        "overstate",
        "extent",
        "political",
        "culture",
        "may",
        "disengaged",
        "background",
        "culture",
        "necessarily",
        "cause",
        "alarm",
        "argued",
        "since",
        "nation",
        "need",
        "construed",
        "way",
        "exclude",
        "minority",
        "nationhood",
        "understood",
        "sufficiently",
        "thin",
        "term",
        "accommodate",
        "minority",
        "thick",
        "enough",
        "generate",
        "appropriate",
        "sentiment",
        "solidarity",
        "loyalty",
        "trust",
        "different",
        "version",
        "thin",
        "understanding",
        "nationhood",
        "share",
        "downplaying",
        "substantive",
        "commonality",
        "descent",
        "culture",
        "religion",
        "favour",
        "political",
        "legal",
        "principle",
        "institution",
        "well",
        "description",
        "national",
        "identity",
        "flexible",
        "open",
        "change",
        "immigrant",
        "citizen",
        "participate",
        "collective",
        "conversation",
        "citizen",
        "debate",
        "constantly",
        "reinterpret",
        "nation",
        "identity",
        "immigrant",
        "required",
        "display",
        "willingness",
        "accept",
        "current",
        "political",
        "structure",
        "engage",
        "host",
        "community",
        "new",
        "common",
        "identity",
        "forged",
        "miller",
        "expected",
        "speak",
        "common",
        "national",
        "language",
        "feel",
        "loyalty",
        "national",
        "institution",
        "share",
        "commitment",
        "maintaining",
        "nation",
        "single",
        "selfgoverning",
        "community",
        "indefinite",
        "future",
        "kymlicka",
        "given",
        "thin",
        "version",
        "national",
        "identity",
        "propose",
        "one",
        "might",
        "conclude",
        "liberal",
        "nationalist",
        "far",
        "constitutional",
        "patriotism",
        "habermas",
        "position",
        "seem",
        "give",
        "central",
        "role",
        "common",
        "political",
        "culture",
        "distance",
        "separating",
        "becomes",
        "clear",
        "look",
        "political",
        "implication",
        "respective",
        "view",
        "like",
        "evaluating",
        "prospect",
        "european",
        "union",
        "liberal",
        "nationalist",
        "often",
        "sceptical",
        "towards",
        "european",
        "experiment",
        "postnationalists",
        "firm",
        "supporter",
        "difference",
        "flow",
        "respective",
        "conception",
        "make",
        "sustains",
        "political",
        "culture",
        "source",
        "integration",
        "liberal",
        "nationalist",
        "continuity",
        "essential",
        "political",
        "culture",
        "derives",
        "much",
        "strength",
        "anchoring",
        "history",
        "narrative",
        "distinct",
        "political",
        "community",
        "extending",
        "backwards",
        "forward",
        "time",
        "sceptical",
        "political",
        "voluntarism",
        "achieved",
        "formal",
        "political",
        "institution",
        "democratic",
        "procedure",
        "alone",
        "divorced",
        "richer",
        "background",
        "neither",
        "generate",
        "sustain",
        "robust",
        "political",
        "culture",
        "sense",
        "common",
        "identity",
        "contrast",
        "postnationalists",
        "like",
        "habermas",
        "consider",
        "democratic",
        "process",
        "crucial",
        "postnationalist",
        "conception",
        "give",
        "greater",
        "weight",
        "political",
        "practice",
        "legal",
        "political",
        "institution",
        "sustain",
        "rather",
        "cultural",
        "historical",
        "mooring",
        "explains",
        "habermas",
        "militant",
        "support",
        "european",
        "project",
        "belief",
        "adopting",
        "constitution",
        "could",
        "catalytic",
        "effect",
        "process",
        "constructing",
        "perfect",
        "union",
        "habermas",
        "b"
    ]
}