{
    "main_text": "Clinical Research and Clinical Care\n4. Clinical Research and Clinical Care\n\nLind’s experiments on scurvy exemplify the fact that clinical\nresearch is often conducted by clinicians and often is conducted on\npatients. Many commentators have thus assumed that clinical\nresearch should be governed by the ethics of clinical care, and the\nmethods of research should not diverge from the methods that are\nacceptable in clinical care. On this approach, participants should not\nbe denied any beneficial treatments available in the clinical setting\nand they should not be exposed to any risks not present in the\nclinical setting.\n\nSome proponents (Rothman 2000) argue that this approach is implied by\nthe kind of treatment that patients, understood as individuals who\nhave a condition or illness needing treatment, are owed. Such\nindividuals are owed treatment that promotes, or at least is\nconsistent with their medical interests. Others (Miller & Weijer\n2006) argue that the norms of clinical research derive largely from\nthe obligations that bear on clinicians. These commentators argue that\nit is unacceptable for a physician to participate in, or even support\nthe participation of her patients in a clinical trial unless that\ntrial is consistent with the patients’ medical interests. To do\nless is to provide substandard medical treatment and to violate\none’s obligations as a clinician.\n\nThe claim that the treatment of research participants should be\nconsistent with the norms which govern clinical care has been applied\nmost prominently to the ethics of randomized clinical trials (Hellman\n& Hellman 1991). Randomized trials determine which treatment a\ngiven research participant receives based on a random process, not\nbased on clinical judgment of which treatment would be best for that\npatient. Lind assigned the different existing treatments for scurvy to\nthe sailors in his study based not on what he thought was best for\nthem, but based on what he thought would yield an effective\ncomparative test. Lind did not give each intervention to the same\nnumber of sailors because he thought that all the interventions had an\nequal chance of being effective. To the contrary, he did this because\nhe was confident that several of the interventions were harmful and\nthis design was the best way to show it. Contemporary clinical\nresearchers go even further, assigning participants to treatments\nrandomly. Because this aspect of clinical research represents a clear\ndeparture from the practice of clinical medicine it appears to\nsacrifice the interests of participants in order to collect valid\ndata.\n\nOne of the most influential responses to this concern (Freedman 1987)\nargues that randomization is acceptable when the study in question\nsatisfies what has come to be known as ‘clinical\nequipoise.’ Clinical equipoise obtains when, for the population\nof patients from which participants will be selected, the available\nclinical evidence does not favor one of the treatments being used over\nthe others. In addition, it must be the case that there are no\ntreatments available outside the trial that are better than those used\nin the trial. Satisfaction of these conditions seems to imply that the\ninterests of research participants will not be undermined in the\nservice of collecting scientific information. If the available data do\nnot favor any of the treatments being used, randomizing participants\nseems as good a process as any other for choosing which treatment they\nreceive.\n\nProponents of clinical equipoise as an ethical requirement for\nclinical research determine whether equipoise obtains not by appeal to\nthe belief states of individual clinicians, but based on whether there\nis consensus among the community of experts regarding which treatment\nis best. Lind believed that sea water was ineffective for the\ntreatment of scurvy. Yet, in the absence of agreement among the\ncommunity of experts, this view essentially constituted an individual\npreference rather than a clinical norm. This suggests that it was\nacceptable for Lind to randomly assign sailors under his care to the\nprevailing treatments in order to test, in essence, whose preferred\ntreatment was the best. In this way, the existence of uncertainty\nwithin the community of experts seems to offer a way to reconcile the\nmethods of clinical research with the norms of clinical medicine.\n\nCritics respond that even when clinical equipoise obtains for the\npopulation of patients, the specific circumstances of individual\npatients within that population might imply that one of the treatments\nunder investigation is better for them (Gifford 2007). A specific\npatient may have reduced liver function which places her at greater\nrisk of harm if she receives a treatment metabolized by the liver. And\nsome patients may have personal preferences which incline them toward\none treatment over another (e.g., they may prefer a one-time riskier\nprocedure to multiple, lower risk procedures which pose the same\ncollective risk). Current debate focuses on whether randomized\nclinical trials can take these possibilities into account in a way\nthat is consistent with the norms of clinical medicine.\n\nEven if the existence of clinical equipoise can justify some\nrandomized trials, a significant problem remains, namely, many studies\nand procedures which are crucial to the identification and development\nof improved methods for protecting and advancing health and well-being\nare inconsistent with participants’ medical interests. This\nconcern arises for many phase 1 studies which offer essentially no\nchance for medical benefit and pose at least some risks, and to that\nextent are inconsistent with the participants’ medical\ninterests.\n\nPhase 3 studies which randomize participants to a potential new\ntreatment or existing standard treatment, and satisfy clinical\nequipoise, typically include purely research procedures, such as\nadditional blood draws, to evaluate the drugs being tested. Enrollment\nin these studies may be consistent with participants’ medical\ninterests in the sense that the overall risk-benefit ratio is at\nleast as favorable as the available alternatives. Yet, evaluation of\nthe overall risk-benefit profile of the study masks the fact that it\nincludes individual procedures which are contrary to\nparticipants’ medical interests, and contrary to the norms of\nclinical medicine.\n\nThe attempt to protect research participants by appeal to the\nobligations clinicians have to promote the medical interests of their\npatients also seems to leave healthy volunteers unprotected.\nAlternatively, proponents might characterize this position in terms of\nclinicians’ obligations to others in general: clinicians should\nnot perform procedures on others unless doing so promotes the\nindividual’s clinical interests. This approach seems to preclude\nessentially all research with healthy volunteers. For example, many\nphase 1 studies are conducted in healthy volunteers to determine a\nsafe dose of the drug under study. These studies, vital to drug\ndevelopment, are inconsistent with the principle that clinicians\nshould expose individuals to risks only when doing so is consistent\nwith their clinical interests. It follows that appeal to clinical\nequipoise alone cannot render clinical research consistent with the\nnorms of clinical practice.\n\nCommentators sometimes attempt to justify net-risk procedures that are\nincluded within studies, and studies that overall pose net risks by\ndistinguishing between ‘therapeutic’ and\n‘non-therapeutic’ research (Miller and Weijer 2006). The\nclaim here is that the demand of consistency with participants’\nmedical interests applies only to therapeutic research;\nnon-therapeutic research studies and procedures may diverge from these\nnorms to a certain extent, provided participants’ medical\ninterests are not significantly compromised. The distinction between\ntherapeutic and non-therapeutic research is sometimes based on the\ndesign of the studies in question, and sometimes based on the\nintentions of the investigators. Studies designed to benefit\nparticipants, or investigators who intend to benefit participants are\nconducting therapeutic studies. Those designed to collect\ngeneralizable knowledge or in which the investigators intend to do so\nconstitute non-therapeutic research.\n\nThe problem with the distinction between therapeutic and\nnon-therapeutic research so defined is that research itself often is\ndefined as a practice designed to collect generalizable knowledge and\nconducted by investigators who intend to achieve this end (Levine\n1988). On this definition, all research qualifies as non-therapeutic.\nConversely, most investigators intend to benefit their participants in\nsome way or other. Perhaps they design the study in a way that\nprovides participants with clinically useful findings, or they provide\nminor care not required for research purposes, or referrals to\ncolleagues. Even if proponents can make good on the distinction\nbetween therapeutic and non-therapeutic research in theory, these\npractices appear to render it irrelevant to the practice of clinical\nresearch. More importantly, it is not clear why investigators’\nresponsibilities to patients, or patients’ claims on\ninvestigators, should vary as a function of this distinction. Why\nthink that investigators are allowed to expose patients to some risks\nfor the benefit of others, but only in the context of research that is\nnot designed to benefit the participants? To apply this proposed\nresolution to pediatric research, why might it be acceptable to expose\ninfants to risks for the benefit of others, but only in the context of\nstudies which offer the infants no chance for personal benefit?\n\nTo take one possibility, it is not clear that this view can be\ndefended by appeal to physicians’ role responsibilities. A prima\nfacie plausible view holds that physicians’ role\nresponsibilities apply to all encounters between physicians and\npatients who need medical treatment. This view would imply that\nphysicians may not compromise patients’ medical interests when\nconducting therapeutic studies, but also seems to prohibit\nnon-therapeutic research procedures with patients. Alternatively, one\nmight argue that physicians’ role responsibilities apply only in\nthe context of clinical care and so do not apply in the context of\nclinical research at all. This articulation yields a more plausible\nview, but does not support the use of the therapeutic/ non-therapeutic\ndistinction. It provides no reason to think that physicians’\nobligations differ based on the type of research in question.\n\nCritics argue that these problems highlight the fundamental confusion\nthat results when one attempts to evaluate clinical research based on\nnorms appropriate to clinical medicine. They instead distinguish\nbetween the ethics of clinical research and the ethics of clinical\ncare, arguing that it is inappropriate to assume that investigators\nare subject to the claims and obligations which apply to physicians,\ndespite the fact that the individuals who conduct clinical research\noften are physicians (Miller and Brody 2007).\n\nThe claim that clinical research should satisfy the norms of clinical\nmedicine has this strong virtue: it provides a clear method to protect\nindividual research participants and reassure the public that they are\nbeing so protected. If research participants are treated consistent\nwith their medical interests, we can be reasonably confident that\nimprovements in clinical medicine will not be won at the expense of\nexploiting them. Most accounts of the ethics of clinical research now\nrecognize the limitations of this approach and search for ways to\nensure that research participants are not exposed to excessive risks\nwithout assuming that the claims of clinical medicine apply to\nclinical researchers (Emanuel, Wendler, and Grady 2000; CIOMS 2002).\nDismissal of the distinction between therapeutic and non-therapeutic\nresearch thus yields an increase in both conceptual clarity and\nconcern regarding the potential for abuse of research\nparticipants.\n\nClinicians, first trained as physicians taught to act in the best\ninterests of the patient in front of them, often struggle with the\nprocess of exposing some patients to risky procedures for the benefit\nof others. It is one thing for philosophers to insist, no matter how\naccurately, that research participants are not patients and need not\nbe treated according to the norms of clinical medicine. It is another\nthing for clinical researchers to regard research participants who are\nsuffering from disease and illness as anything other than patients.\nThese clinical instincts, while understandable and laudable, have the\npotential to obscure the true nature of clinical research, as\ninvestigators and participants alike try to convince themselves that\nclinical research involves nothing more than the provision of clinical\ncare. One way to try to address this collective and often willful\nconfusion would be to identify a justification for exposing research\nparticipants to net risks for the benefit of others.\n",
    "section_title": "4. Clinical Research and Clinical Care",
    "entry_title": "The Ethics of Clinical Research",
    "hierarchy_title": "The Ethics of Clinical Research || Clinical Research and Clinical Care",
    "tokenized_text": [
        "clinical",
        "research",
        "clinical",
        "care",
        "clinical",
        "research",
        "clinical",
        "care",
        "lind",
        "experiment",
        "scurvy",
        "exemplify",
        "fact",
        "clinical",
        "research",
        "often",
        "conducted",
        "clinician",
        "often",
        "conducted",
        "patient",
        "many",
        "commentator",
        "thus",
        "assumed",
        "clinical",
        "research",
        "governed",
        "ethic",
        "clinical",
        "care",
        "method",
        "research",
        "diverge",
        "method",
        "acceptable",
        "clinical",
        "care",
        "approach",
        "participant",
        "denied",
        "beneficial",
        "treatment",
        "available",
        "clinical",
        "setting",
        "exposed",
        "risk",
        "present",
        "clinical",
        "setting",
        "proponent",
        "rothman",
        "argue",
        "approach",
        "implied",
        "kind",
        "treatment",
        "patient",
        "understood",
        "individual",
        "condition",
        "illness",
        "needing",
        "treatment",
        "owed",
        "individual",
        "owed",
        "treatment",
        "promotes",
        "least",
        "consistent",
        "medical",
        "interest",
        "others",
        "miller",
        "weijer",
        "argue",
        "norm",
        "clinical",
        "research",
        "derive",
        "largely",
        "obligation",
        "bear",
        "clinician",
        "commentator",
        "argue",
        "unacceptable",
        "physician",
        "participate",
        "even",
        "support",
        "participation",
        "patient",
        "clinical",
        "trial",
        "unless",
        "trial",
        "consistent",
        "patient",
        "medical",
        "interest",
        "le",
        "provide",
        "substandard",
        "medical",
        "treatment",
        "violate",
        "one",
        "obligation",
        "clinician",
        "claim",
        "treatment",
        "research",
        "participant",
        "consistent",
        "norm",
        "govern",
        "clinical",
        "care",
        "applied",
        "prominently",
        "ethic",
        "randomized",
        "clinical",
        "trial",
        "hellman",
        "hellman",
        "randomized",
        "trial",
        "determine",
        "treatment",
        "given",
        "research",
        "participant",
        "receives",
        "based",
        "random",
        "process",
        "based",
        "clinical",
        "judgment",
        "treatment",
        "would",
        "best",
        "patient",
        "lind",
        "assigned",
        "different",
        "existing",
        "treatment",
        "scurvy",
        "sailor",
        "study",
        "based",
        "thought",
        "best",
        "based",
        "thought",
        "would",
        "yield",
        "effective",
        "comparative",
        "test",
        "lind",
        "give",
        "intervention",
        "number",
        "sailor",
        "thought",
        "intervention",
        "equal",
        "chance",
        "effective",
        "contrary",
        "confident",
        "several",
        "intervention",
        "harmful",
        "design",
        "best",
        "way",
        "show",
        "contemporary",
        "clinical",
        "researcher",
        "go",
        "even",
        "assigning",
        "participant",
        "treatment",
        "randomly",
        "aspect",
        "clinical",
        "research",
        "represents",
        "clear",
        "departure",
        "practice",
        "clinical",
        "medicine",
        "appears",
        "sacrifice",
        "interest",
        "participant",
        "order",
        "collect",
        "valid",
        "data",
        "one",
        "influential",
        "response",
        "concern",
        "freedman",
        "argues",
        "randomization",
        "acceptable",
        "study",
        "question",
        "satisfies",
        "come",
        "known",
        "clinical",
        "equipoise",
        "clinical",
        "equipoise",
        "obtains",
        "population",
        "patient",
        "participant",
        "selected",
        "available",
        "clinical",
        "evidence",
        "favor",
        "one",
        "treatment",
        "used",
        "others",
        "addition",
        "must",
        "case",
        "treatment",
        "available",
        "outside",
        "trial",
        "better",
        "used",
        "trial",
        "satisfaction",
        "condition",
        "seems",
        "imply",
        "interest",
        "research",
        "participant",
        "undermined",
        "service",
        "collecting",
        "scientific",
        "information",
        "available",
        "data",
        "favor",
        "treatment",
        "used",
        "randomizing",
        "participant",
        "seems",
        "good",
        "process",
        "choosing",
        "treatment",
        "receive",
        "proponent",
        "clinical",
        "equipoise",
        "ethical",
        "requirement",
        "clinical",
        "research",
        "determine",
        "whether",
        "equipoise",
        "obtains",
        "appeal",
        "belief",
        "state",
        "individual",
        "clinician",
        "based",
        "whether",
        "consensus",
        "among",
        "community",
        "expert",
        "regarding",
        "treatment",
        "best",
        "lind",
        "believed",
        "sea",
        "water",
        "ineffective",
        "treatment",
        "scurvy",
        "yet",
        "absence",
        "agreement",
        "among",
        "community",
        "expert",
        "view",
        "essentially",
        "constituted",
        "individual",
        "preference",
        "rather",
        "clinical",
        "norm",
        "suggests",
        "acceptable",
        "lind",
        "randomly",
        "assign",
        "sailor",
        "care",
        "prevailing",
        "treatment",
        "order",
        "test",
        "essence",
        "whose",
        "preferred",
        "treatment",
        "best",
        "way",
        "existence",
        "uncertainty",
        "within",
        "community",
        "expert",
        "seems",
        "offer",
        "way",
        "reconcile",
        "method",
        "clinical",
        "research",
        "norm",
        "clinical",
        "medicine",
        "critic",
        "respond",
        "even",
        "clinical",
        "equipoise",
        "obtains",
        "population",
        "patient",
        "specific",
        "circumstance",
        "individual",
        "patient",
        "within",
        "population",
        "might",
        "imply",
        "one",
        "treatment",
        "investigation",
        "better",
        "gifford",
        "specific",
        "patient",
        "may",
        "reduced",
        "liver",
        "function",
        "place",
        "greater",
        "risk",
        "harm",
        "receives",
        "treatment",
        "metabolized",
        "liver",
        "patient",
        "may",
        "personal",
        "preference",
        "incline",
        "toward",
        "one",
        "treatment",
        "another",
        "eg",
        "may",
        "prefer",
        "onetime",
        "riskier",
        "procedure",
        "multiple",
        "lower",
        "risk",
        "procedure",
        "pose",
        "collective",
        "risk",
        "current",
        "debate",
        "focus",
        "whether",
        "randomized",
        "clinical",
        "trial",
        "take",
        "possibility",
        "account",
        "way",
        "consistent",
        "norm",
        "clinical",
        "medicine",
        "even",
        "existence",
        "clinical",
        "equipoise",
        "justify",
        "randomized",
        "trial",
        "significant",
        "problem",
        "remains",
        "namely",
        "many",
        "study",
        "procedure",
        "crucial",
        "identification",
        "development",
        "improved",
        "method",
        "protecting",
        "advancing",
        "health",
        "wellbeing",
        "inconsistent",
        "participant",
        "medical",
        "interest",
        "concern",
        "arises",
        "many",
        "phase",
        "study",
        "offer",
        "essentially",
        "chance",
        "medical",
        "benefit",
        "pose",
        "least",
        "risk",
        "extent",
        "inconsistent",
        "participant",
        "medical",
        "interest",
        "phase",
        "study",
        "randomize",
        "participant",
        "potential",
        "new",
        "treatment",
        "existing",
        "standard",
        "treatment",
        "satisfy",
        "clinical",
        "equipoise",
        "typically",
        "include",
        "purely",
        "research",
        "procedure",
        "additional",
        "blood",
        "draw",
        "evaluate",
        "drug",
        "tested",
        "enrollment",
        "study",
        "may",
        "consistent",
        "participant",
        "medical",
        "interest",
        "sense",
        "overall",
        "riskbenefit",
        "ratio",
        "least",
        "favorable",
        "available",
        "alternative",
        "yet",
        "evaluation",
        "overall",
        "riskbenefit",
        "profile",
        "study",
        "mask",
        "fact",
        "includes",
        "individual",
        "procedure",
        "contrary",
        "participant",
        "medical",
        "interest",
        "contrary",
        "norm",
        "clinical",
        "medicine",
        "attempt",
        "protect",
        "research",
        "participant",
        "appeal",
        "obligation",
        "clinician",
        "promote",
        "medical",
        "interest",
        "patient",
        "also",
        "seems",
        "leave",
        "healthy",
        "volunteer",
        "unprotected",
        "alternatively",
        "proponent",
        "might",
        "characterize",
        "position",
        "term",
        "clinician",
        "obligation",
        "others",
        "general",
        "clinician",
        "perform",
        "procedure",
        "others",
        "unless",
        "promotes",
        "individual",
        "clinical",
        "interest",
        "approach",
        "seems",
        "preclude",
        "essentially",
        "research",
        "healthy",
        "volunteer",
        "example",
        "many",
        "phase",
        "study",
        "conducted",
        "healthy",
        "volunteer",
        "determine",
        "safe",
        "dose",
        "drug",
        "study",
        "study",
        "vital",
        "drug",
        "development",
        "inconsistent",
        "principle",
        "clinician",
        "expose",
        "individual",
        "risk",
        "consistent",
        "clinical",
        "interest",
        "follows",
        "appeal",
        "clinical",
        "equipoise",
        "alone",
        "render",
        "clinical",
        "research",
        "consistent",
        "norm",
        "clinical",
        "practice",
        "commentator",
        "sometimes",
        "attempt",
        "justify",
        "netrisk",
        "procedure",
        "included",
        "within",
        "study",
        "study",
        "overall",
        "pose",
        "net",
        "risk",
        "distinguishing",
        "therapeutic",
        "nontherapeutic",
        "research",
        "miller",
        "weijer",
        "claim",
        "demand",
        "consistency",
        "participant",
        "medical",
        "interest",
        "applies",
        "therapeutic",
        "research",
        "nontherapeutic",
        "research",
        "study",
        "procedure",
        "may",
        "diverge",
        "norm",
        "certain",
        "extent",
        "provided",
        "participant",
        "medical",
        "interest",
        "significantly",
        "compromised",
        "distinction",
        "therapeutic",
        "nontherapeutic",
        "research",
        "sometimes",
        "based",
        "design",
        "study",
        "question",
        "sometimes",
        "based",
        "intention",
        "investigator",
        "study",
        "designed",
        "benefit",
        "participant",
        "investigator",
        "intend",
        "benefit",
        "participant",
        "conducting",
        "therapeutic",
        "study",
        "designed",
        "collect",
        "generalizable",
        "knowledge",
        "investigator",
        "intend",
        "constitute",
        "nontherapeutic",
        "research",
        "problem",
        "distinction",
        "therapeutic",
        "nontherapeutic",
        "research",
        "defined",
        "research",
        "often",
        "defined",
        "practice",
        "designed",
        "collect",
        "generalizable",
        "knowledge",
        "conducted",
        "investigator",
        "intend",
        "achieve",
        "end",
        "levine",
        "definition",
        "research",
        "qualifies",
        "nontherapeutic",
        "conversely",
        "investigator",
        "intend",
        "benefit",
        "participant",
        "way",
        "perhaps",
        "design",
        "study",
        "way",
        "provides",
        "participant",
        "clinically",
        "useful",
        "finding",
        "provide",
        "minor",
        "care",
        "required",
        "research",
        "purpose",
        "referral",
        "colleague",
        "even",
        "proponent",
        "make",
        "good",
        "distinction",
        "therapeutic",
        "nontherapeutic",
        "research",
        "theory",
        "practice",
        "appear",
        "render",
        "irrelevant",
        "practice",
        "clinical",
        "research",
        "importantly",
        "clear",
        "investigator",
        "responsibility",
        "patient",
        "patient",
        "claim",
        "investigator",
        "vary",
        "function",
        "distinction",
        "think",
        "investigator",
        "allowed",
        "expose",
        "patient",
        "risk",
        "benefit",
        "others",
        "context",
        "research",
        "designed",
        "benefit",
        "participant",
        "apply",
        "proposed",
        "resolution",
        "pediatric",
        "research",
        "might",
        "acceptable",
        "expose",
        "infant",
        "risk",
        "benefit",
        "others",
        "context",
        "study",
        "offer",
        "infant",
        "chance",
        "personal",
        "benefit",
        "take",
        "one",
        "possibility",
        "clear",
        "view",
        "defended",
        "appeal",
        "physician",
        "role",
        "responsibility",
        "prima",
        "facie",
        "plausible",
        "view",
        "hold",
        "physician",
        "role",
        "responsibility",
        "apply",
        "encounter",
        "physician",
        "patient",
        "need",
        "medical",
        "treatment",
        "view",
        "would",
        "imply",
        "physician",
        "may",
        "compromise",
        "patient",
        "medical",
        "interest",
        "conducting",
        "therapeutic",
        "study",
        "also",
        "seems",
        "prohibit",
        "nontherapeutic",
        "research",
        "procedure",
        "patient",
        "alternatively",
        "one",
        "might",
        "argue",
        "physician",
        "role",
        "responsibility",
        "apply",
        "context",
        "clinical",
        "care",
        "apply",
        "context",
        "clinical",
        "research",
        "articulation",
        "yield",
        "plausible",
        "view",
        "support",
        "use",
        "therapeutic",
        "nontherapeutic",
        "distinction",
        "provides",
        "reason",
        "think",
        "physician",
        "obligation",
        "differ",
        "based",
        "type",
        "research",
        "question",
        "critic",
        "argue",
        "problem",
        "highlight",
        "fundamental",
        "confusion",
        "result",
        "one",
        "attempt",
        "evaluate",
        "clinical",
        "research",
        "based",
        "norm",
        "appropriate",
        "clinical",
        "medicine",
        "instead",
        "distinguish",
        "ethic",
        "clinical",
        "research",
        "ethic",
        "clinical",
        "care",
        "arguing",
        "inappropriate",
        "assume",
        "investigator",
        "subject",
        "claim",
        "obligation",
        "apply",
        "physician",
        "despite",
        "fact",
        "individual",
        "conduct",
        "clinical",
        "research",
        "often",
        "physician",
        "miller",
        "brody",
        "claim",
        "clinical",
        "research",
        "satisfy",
        "norm",
        "clinical",
        "medicine",
        "strong",
        "virtue",
        "provides",
        "clear",
        "method",
        "protect",
        "individual",
        "research",
        "participant",
        "reassure",
        "public",
        "protected",
        "research",
        "participant",
        "treated",
        "consistent",
        "medical",
        "interest",
        "reasonably",
        "confident",
        "improvement",
        "clinical",
        "medicine",
        "expense",
        "exploiting",
        "account",
        "ethic",
        "clinical",
        "research",
        "recognize",
        "limitation",
        "approach",
        "search",
        "way",
        "ensure",
        "research",
        "participant",
        "exposed",
        "excessive",
        "risk",
        "without",
        "assuming",
        "claim",
        "clinical",
        "medicine",
        "apply",
        "clinical",
        "researcher",
        "emanuel",
        "wendler",
        "grady",
        "cioms",
        "dismissal",
        "distinction",
        "therapeutic",
        "nontherapeutic",
        "research",
        "thus",
        "yield",
        "increase",
        "conceptual",
        "clarity",
        "concern",
        "regarding",
        "potential",
        "abuse",
        "research",
        "participant",
        "clinician",
        "first",
        "trained",
        "physician",
        "taught",
        "act",
        "best",
        "interest",
        "patient",
        "front",
        "often",
        "struggle",
        "process",
        "exposing",
        "patient",
        "risky",
        "procedure",
        "benefit",
        "others",
        "one",
        "thing",
        "philosopher",
        "insist",
        "matter",
        "accurately",
        "research",
        "participant",
        "patient",
        "need",
        "treated",
        "according",
        "norm",
        "clinical",
        "medicine",
        "another",
        "thing",
        "clinical",
        "researcher",
        "regard",
        "research",
        "participant",
        "suffering",
        "disease",
        "illness",
        "anything",
        "patient",
        "clinical",
        "instinct",
        "understandable",
        "laudable",
        "potential",
        "obscure",
        "true",
        "nature",
        "clinical",
        "research",
        "investigator",
        "participant",
        "alike",
        "try",
        "convince",
        "clinical",
        "research",
        "involves",
        "nothing",
        "provision",
        "clinical",
        "care",
        "one",
        "way",
        "try",
        "address",
        "collective",
        "often",
        "willful",
        "confusion",
        "would",
        "identify",
        "justification",
        "exposing",
        "research",
        "participant",
        "net",
        "risk",
        "benefit",
        "others"
    ]
}