{
    "main_text": "Human Reproductive Cloning || Harm to the Individual Conceived through Cloning\n3.2 Harm to the Individual Conceived through Cloning\n3.2.1 A Threat to Autonomy\n\nSome fear that cloning threatens the identity and individuality of the\nclone, thus reducing her autonomy (Ramsey 1966; Kitcher 1997; Annas\n1998; Kass 1998). This may be bad in itself, or bad because it might\nreduce the clone’s wellbeing. It may also be bad because it will\nseverely restrict the array of life plans open to the clone, thus\nviolating her ‘right to an open future’ (a concept\ndeveloped in Feinberg 1980). In its report ‘Human Cloning and\nHuman Dignity: An Ethical Inquiry’, the US President’s\nCouncil on Bioethics (2002) wrote that being genetically unique is\n“an emblem of independence and individuality” and allows\nus to go forward “with a relatively indeterminate future in\nfront of us” (Ch. 5, Section c). Such concerns have formed the\nbasis of strong opposition to cloning.\n\nThe concern that cloning threatens the clone’s identity and\nindividuality has been criticized for relying on the mistaken belief\nthat who and what we become is entirely determined by our genes. Such\ngenetic determinism is clearly false. Though genes influence our\npersonal development, so does the complex and irreproducible context\nin which our lives take place. We know this, among others, from\nstudying monozygotic twins. Notwithstanding the fact that such twins\nare genetically identical to each other and, therefore, sometimes look\nvery similar and often share many character traits, habits and\npreferences, they are different individuals, with different\nidentities (Segal 2000). Thus, it is argued, having a genetic\nduplicate does not threaten one’s individuality, or one’s\ndistinct identity.\n\nBrock (2002) has pointed out that one could nevertheless argue that\neven though individuals created through cloning would be unique\nindividuals with a distinct identity, they might not experience it\nthat way. What is threatened by cloning then is not the\nindividual’s identity or individuality, but her sense\nof identity and individuality, and this may reduce her autonomy. So\neven if a clone has a unique identity, she may experience more\ndifficulties in establishing her identity than if she had not been a\nclone.\n\nBut here too critics have relied on the comparison with monozygotic\ntwins. Harris (1997, 2004) and Tooley (1998), for example, have\npointed out that each twin not only has a distinct identity, but\ngenerally also views him or herself as having a distinct identity, as\ndo their relatives and friends. Moreover, so they argue, an individual\ncreated through cloning would likely be of a different age than her\nprogenitor. There may even be several generations between them. A\nclone would thus in essence be a ‘delayed’ twin.\nPresumably this would make it even easier for the clone to view\nherself as distinct from the progenitor than if she had been\ngenetically identical to someone her same age.\n\nHowever, the reference to twins as a model to think about reproductive\ncloning has been criticized, for example, because it fails to reflect\nimportant aspects of the parent-child relationship that would incur if\nthe child were a clone of one of the rearing parents (Jonas 1974;\nLevick 2004). Because of the dominance of the progenitor, the risk of\nreduced autonomy and confused identity may be greater in such a\nsituation than in the case of ordinary twins. Moreover, just\nbecause the clone would be a delayed twin, she may have the\nfeeling that her life has already been lived or that she is\npredetermined to do the same things as her progenitor (Levy & Lotz\n2005). This problem may be exacerbated by others constantly comparing\nher life with that of the progenitor, and having problematic\nexpectations based on these comparisons. The clone may feel under\nconstant pressure to live up to these expectations (Kass 1998; Levick\n2004, 101; Sandel 2007, 57–62), or may have the feeling she\nleads ‘a life in the shadow’ of the progenitor (Holm 1998;\nPCBE 2002, Ch.5). This may especially be the case if the clone was\ncreated as a ‘replacement’ for a deceased child. (Some\nprivate companies already offer to clone dead pets to create\nreplacements pets.) The fear is that the ‘ghost of the dead\nchild’ will get more attention and devotion than the replacement\nchild. Parents may expect the clone to be like the lost child, or some\nidealized image of it, which could hamper the development of her\nidentity and adversely affect her self-esteem (Levick 2004,\n111–132). Finally, another reason why the clone’s autonomy\nmay be reduced is because she would be involuntarily informed about\nher genetic predispositions. A clone who knows that her genetic parent\ndeveloped a severe single gene disease at the age of forty will\nrealise it is very likely that she will undergo the same fate. Unlike\nindividuals who choose to have themselves genetically tested,\nclones who know their genetic parent’s medical history will be\ninvoluntarily informed.\n\nThese concerns have been challenged on several grounds. Some believe\nthat it is plausible that, through adequate information, we could\nlargely correct mistaken beliefs about the link between genetic and\npersonal identity, and thus reduce the risk of problematic\nexpectations toward the clone (Harris 1997, 2004; Tooley 1998,\n84–5; Brock 1998, Pence 1998). Brock (1998) and Buchanan et al.\n(2000, 198) have argued that even if people persist in these mistaken\nbeliefs and their attitudes or actions lead to cloned individuals\nbelieving they do not have an open future, this does not\nimply that the clone’s right to ignorance about one’s\npersonal future or to an open future has actually been\nviolated. Pence (1998, 138) has argued that having high expectations,\neven if based on false beliefs, is not necessarily a bad thing.\nParents with high expectations often give their children the best\nchances to lead a happy and successful life. Brock (2002, 316) has\nargued that parents now also constantly restrict the array of\navailable life plans open to their children, for example, by selecting\ntheir school or by raising them according to certain values. Though\nthis may somewhat restrict the child’s autonomy, there will\nalways be enough decisions to take for the child to be autonomous, and\nto realize this. According to Brock, it is not clear why this should\nbe different in the case of cloning. He also points out that there may\nbe advantages to being a ‘delayed twin’ (154). For\nexample, one may acquire knowledge about the progenitor’s\nmedical history and use this knowledge to live longer, or to increase\none’s autonomy. One could, for example, use the information to\nreduce the risk of getting the disease or condition, or to at least\npostpone its onset, by behavioral changes, an appropriate diet and/or\npreventive medication. This would not be possible, however, if the\ndisease is untreatable (for example, Huntington’s Disease).\nHarris (2004, Ch.1) has stressed that information about one’s\ngenetic predispositions for certain diseases would also allow one to\ntake better informed reproductive decisions. Cloning would allow us to\ngive our child a ‘tried and tested’ genome, not one\ncreated by the genetic lottery of sexual reproduction and the random\ncombination of chromosomes.\n3.2.2 The clone will be treated as a means\n\nCloning arouses people’s imagination about the clone, but also\nabout those who will choose to have a child through cloning. Often\ndubious motives are ascribed to them: they would want a child that is\n‘just like so-and-so’ causing people to view children as\nobjects or as commodities like a new car or a new house (Putnam 1997,\n7–8). They would want an attractive child (a clone of Scarlett\nJohansson) or a child with tennis talent (a clone of Victoria\nAzarenka) purely to show off. Dictators would want armies of clones to\nachieve their political goals. People would clone themselves out of\nvanity. Parents would clone their existing child so that the clone can\nserve as an organ bank for that child, or would clone their deceased\nchild to have a replacement child. The conclusion is then that cloning\nis wrong because the clone will be used as a mere means to\nothers’ ends. These critiques have also been expressed with\nregard to other forms of assisted reproduction; but some worry that\nindividuals created through cloning may be more likely to be viewed as\ncommodities because their total genetic blueprint would be chosen\n– they would be “fully made and not begotten”\n(Ramsey 1966; Kass 1998; PCBE 2002, 107).\n\nStrong (2008) has argued that these concerns are based on a fallacious\ninference. It is one thing to desire genetically related children, and\nsomething else to believe that one owns one’s children or that\none considers one’s children as objects, he writes. Other\ncommentators, however, have pointed out that even if parents\nthemselves do not commodify their children, cloning might still have\nan impact on society as a whole, thereby increasing the tendency of\nothers to do so (Levy & Lotz 2005; Sandel 2007). A related concern\nexpressed by Levick (2004, 184–5) is that allowing cloning might\nresult in a society where ‘production on demand’ clones\nare sold for adoption to people who are seeking to have children with\nspecial abilities – a clearer case of treating children as\nobjects.\n\nBut suppose some people create a clone for instrumental reasons, for\nexample, as a stem cell donor for a sick sibling. Does this imply that\nthe clone will be treated merely as a means? Critics of this argument\nhave pointed out that parents have children for all kinds of\ninstrumental reasons, including the benefit for the husband-wife\nrelationship, continuity of the family name, and the economic and\npsychological benefits children provide when their parents become old\n(Harris 2004, 41–2, Pence 1998). This is generally not\nconsidered problematic as long as the child is also valued in its own\nright. What is most important in a parent-child relationship is the\nlove and care inherent in that relationship. They stress the fact that\nwe judge people on their attitudes toward children, rather than on\ntheir motives for having them. They also deny that there is a strong\nlink between one’s intention or motive to have a child, and the\nway one will treat the child.\n3.2.3 Societal Prejudice and Respect for Clones\n\nAnother concern is that clones may be the victims of unjustified\ndiscrimination and will not be respected as persons (Deech 1999;\nLevick 2004, 185–187). Savulescu (2005, Other Internet\nResources) has referred to such negative attitudes towards clones as\n‘clonism’: a new form of discrimination against a group of\nhumans who are different in a non-morally significant way. But does a\nfear for ‘clonism’ constitute a good reason for rejecting\ncloning? Savulescu and others have argued that, if it is, then we must\nconclude that racist attitudes and discriminatory behavior towards\npeople with a certain ethnicity provides a good reason for people with\nthat ethnicity not to procreate. This, according to these critics, is\na morally objectionable way to solve the problem of racism. Instead of\nlimiting people’s procreative liberty we should combat existing\nprejudices and discrimination. Likewise, it is argued, instead of\nprohibiting cloning out of concern for clonism, we should combat\npossible prejudices and discrimination against clones (see also Pence\n1998, 46; Harris 2004, 92–93). Macintosh (2005, 119–21)\nhas warned that by expressing certain concerns about cloning one may\nactually reinforce certain prejudices and misguided stereotypes about\nclones. For example, saying that a clone would not have a personal\nidentity prejudges the clone as inferior or fraudulent (the idea that\noriginals are more valuable than their copies) or even less than human\n(as individuality is seen as an essential characteristic of human\nnature).\n3.2.4 Complex Family Relationships\n\nSome worry that cloning will threaten traditional family structures; a\nfear that has come up in debates about gay people adopting children,\nIVF and other assisted reproduction techniques. But in cloning the\nsituation would be more complex as it may blur generational boundaries\n(McGee 2000) and the clone would likely be confused about her kinship\nties (Kass 1998; O’Neil 2002, 67–68). For example, a woman\nwho has a child conceived through cloning would actually be the twin\nof her child and the woman’s mother would, genetically, be its\nmother, not grandmother. Some have argued against these concerns,\nreplying that a cloned child would not necessarily be more confused\nabout her family ties than other children. Many have four nurturing\nparents because of a divorce, never knew their genetic parents, have\nnurturing parents that are not their genetic parents, or think that\ntheir nurturing father is also their genetic father when in fact he is\nnot. While these complex family relationships can be troubling for\nsome children, they are not insurmountable, critics say. Harris (2004,\n77–78) argues that there are many aspects about the situation\none is born and raised in that may be troublesome. As with all\nchildren, the most important thing is the relation with people who\nnurture and educate them, and children usually know very well who\nthese people are. There is no reason to believe that with cloning,\nthis will be any different. Onora O’Neil (2002, 67–8)\nargues that such responses are misplaced. While she acknowledges that\nthere are already children now with confused family relationships, she\nargues that it is very different when prospective parents seek such\npotentially confused relationships for their children from the\nstart.\n",
    "section_title": "3.2 Harm to the Individual Conceived through Cloning",
    "entry_title": "Cloning",
    "hierarchy_title": "Cloning || Human Reproductive Cloning || Harm to the Individual Conceived through Cloning",
    "tokenized_text": [
        "human",
        "reproductive",
        "cloning",
        "harm",
        "individual",
        "conceived",
        "cloning",
        "harm",
        "individual",
        "conceived",
        "cloning",
        "threat",
        "autonomy",
        "fear",
        "cloning",
        "threatens",
        "identity",
        "individuality",
        "clone",
        "thus",
        "reducing",
        "autonomy",
        "ramsey",
        "kitcher",
        "anna",
        "ka",
        "may",
        "bad",
        "bad",
        "might",
        "reduce",
        "clone",
        "wellbeing",
        "may",
        "also",
        "bad",
        "severely",
        "restrict",
        "array",
        "life",
        "plan",
        "open",
        "clone",
        "thus",
        "violating",
        "right",
        "open",
        "future",
        "concept",
        "developed",
        "feinberg",
        "report",
        "human",
        "cloning",
        "human",
        "dignity",
        "ethical",
        "inquiry",
        "u",
        "president",
        "council",
        "bioethics",
        "wrote",
        "genetically",
        "unique",
        "emblem",
        "independence",
        "individuality",
        "allows",
        "u",
        "go",
        "forward",
        "relatively",
        "indeterminate",
        "future",
        "front",
        "u",
        "ch",
        "section",
        "c",
        "concern",
        "formed",
        "basis",
        "strong",
        "opposition",
        "cloning",
        "concern",
        "cloning",
        "threatens",
        "clone",
        "identity",
        "individuality",
        "criticized",
        "relying",
        "mistaken",
        "belief",
        "become",
        "entirely",
        "determined",
        "gene",
        "genetic",
        "determinism",
        "clearly",
        "false",
        "though",
        "gene",
        "influence",
        "personal",
        "development",
        "complex",
        "irreproducible",
        "context",
        "life",
        "take",
        "place",
        "know",
        "among",
        "others",
        "studying",
        "monozygotic",
        "twin",
        "notwithstanding",
        "fact",
        "twin",
        "genetically",
        "identical",
        "therefore",
        "sometimes",
        "look",
        "similar",
        "often",
        "share",
        "many",
        "character",
        "trait",
        "habit",
        "preference",
        "different",
        "individual",
        "different",
        "identity",
        "segal",
        "thus",
        "argued",
        "genetic",
        "duplicate",
        "threaten",
        "one",
        "individuality",
        "one",
        "distinct",
        "identity",
        "brock",
        "pointed",
        "one",
        "could",
        "nevertheless",
        "argue",
        "even",
        "though",
        "individual",
        "created",
        "cloning",
        "would",
        "unique",
        "individual",
        "distinct",
        "identity",
        "might",
        "experience",
        "way",
        "threatened",
        "cloning",
        "individual",
        "identity",
        "individuality",
        "sense",
        "identity",
        "individuality",
        "may",
        "reduce",
        "autonomy",
        "even",
        "clone",
        "unique",
        "identity",
        "may",
        "experience",
        "difficulty",
        "establishing",
        "identity",
        "clone",
        "critic",
        "relied",
        "comparison",
        "monozygotic",
        "twin",
        "harris",
        "tooley",
        "example",
        "pointed",
        "twin",
        "distinct",
        "identity",
        "generally",
        "also",
        "view",
        "distinct",
        "identity",
        "relative",
        "friend",
        "moreover",
        "argue",
        "individual",
        "created",
        "cloning",
        "would",
        "likely",
        "different",
        "age",
        "progenitor",
        "may",
        "even",
        "several",
        "generation",
        "clone",
        "would",
        "thus",
        "essence",
        "delayed",
        "twin",
        "presumably",
        "would",
        "make",
        "even",
        "easier",
        "clone",
        "view",
        "distinct",
        "progenitor",
        "genetically",
        "identical",
        "someone",
        "age",
        "however",
        "reference",
        "twin",
        "model",
        "think",
        "reproductive",
        "cloning",
        "criticized",
        "example",
        "fails",
        "reflect",
        "important",
        "aspect",
        "parentchild",
        "relationship",
        "would",
        "incur",
        "child",
        "clone",
        "one",
        "rearing",
        "parent",
        "jonas",
        "levick",
        "dominance",
        "progenitor",
        "risk",
        "reduced",
        "autonomy",
        "confused",
        "identity",
        "may",
        "greater",
        "situation",
        "case",
        "ordinary",
        "twin",
        "moreover",
        "clone",
        "would",
        "delayed",
        "twin",
        "may",
        "feeling",
        "life",
        "already",
        "lived",
        "predetermined",
        "thing",
        "progenitor",
        "levy",
        "lotz",
        "problem",
        "may",
        "exacerbated",
        "others",
        "constantly",
        "comparing",
        "life",
        "progenitor",
        "problematic",
        "expectation",
        "based",
        "comparison",
        "clone",
        "may",
        "feel",
        "constant",
        "pressure",
        "live",
        "expectation",
        "ka",
        "levick",
        "sandel",
        "may",
        "feeling",
        "lead",
        "life",
        "shadow",
        "progenitor",
        "holm",
        "pcbe",
        "ch",
        "may",
        "especially",
        "case",
        "clone",
        "created",
        "replacement",
        "deceased",
        "child",
        "private",
        "company",
        "already",
        "offer",
        "clone",
        "dead",
        "pet",
        "create",
        "replacement",
        "pet",
        "fear",
        "ghost",
        "dead",
        "child",
        "get",
        "attention",
        "devotion",
        "replacement",
        "child",
        "parent",
        "may",
        "expect",
        "clone",
        "like",
        "lost",
        "child",
        "idealized",
        "image",
        "could",
        "hamper",
        "development",
        "identity",
        "adversely",
        "affect",
        "selfesteem",
        "levick",
        "finally",
        "another",
        "reason",
        "clone",
        "autonomy",
        "may",
        "reduced",
        "would",
        "involuntarily",
        "informed",
        "genetic",
        "predisposition",
        "clone",
        "know",
        "genetic",
        "parent",
        "developed",
        "severe",
        "single",
        "gene",
        "disease",
        "age",
        "forty",
        "realise",
        "likely",
        "undergo",
        "fate",
        "unlike",
        "individual",
        "choose",
        "genetically",
        "tested",
        "clone",
        "know",
        "genetic",
        "parent",
        "medical",
        "history",
        "involuntarily",
        "informed",
        "concern",
        "challenged",
        "several",
        "ground",
        "believe",
        "plausible",
        "adequate",
        "information",
        "could",
        "largely",
        "correct",
        "mistaken",
        "belief",
        "link",
        "genetic",
        "personal",
        "identity",
        "thus",
        "reduce",
        "risk",
        "problematic",
        "expectation",
        "toward",
        "clone",
        "harris",
        "tooley",
        "brock",
        "penny",
        "brock",
        "buchanan",
        "et",
        "al",
        "argued",
        "even",
        "people",
        "persist",
        "mistaken",
        "belief",
        "attitude",
        "action",
        "lead",
        "cloned",
        "individual",
        "believing",
        "open",
        "future",
        "imply",
        "clone",
        "right",
        "ignorance",
        "one",
        "personal",
        "future",
        "open",
        "future",
        "actually",
        "violated",
        "penny",
        "argued",
        "high",
        "expectation",
        "even",
        "based",
        "false",
        "belief",
        "necessarily",
        "bad",
        "thing",
        "parent",
        "high",
        "expectation",
        "often",
        "give",
        "child",
        "best",
        "chance",
        "lead",
        "happy",
        "successful",
        "life",
        "brock",
        "argued",
        "parent",
        "also",
        "constantly",
        "restrict",
        "array",
        "available",
        "life",
        "plan",
        "open",
        "child",
        "example",
        "selecting",
        "school",
        "raising",
        "according",
        "certain",
        "value",
        "though",
        "may",
        "somewhat",
        "restrict",
        "child",
        "autonomy",
        "always",
        "enough",
        "decision",
        "take",
        "child",
        "autonomous",
        "realize",
        "according",
        "brock",
        "clear",
        "different",
        "case",
        "cloning",
        "also",
        "point",
        "may",
        "advantage",
        "delayed",
        "twin",
        "example",
        "one",
        "may",
        "acquire",
        "knowledge",
        "progenitor",
        "medical",
        "history",
        "use",
        "knowledge",
        "live",
        "longer",
        "increase",
        "one",
        "autonomy",
        "one",
        "could",
        "example",
        "use",
        "information",
        "reduce",
        "risk",
        "getting",
        "disease",
        "condition",
        "least",
        "postpone",
        "onset",
        "behavioral",
        "change",
        "appropriate",
        "diet",
        "andor",
        "preventive",
        "medication",
        "would",
        "possible",
        "however",
        "disease",
        "untreatable",
        "example",
        "huntington",
        "disease",
        "harris",
        "ch",
        "stressed",
        "information",
        "one",
        "genetic",
        "predisposition",
        "certain",
        "disease",
        "would",
        "also",
        "allow",
        "one",
        "take",
        "better",
        "informed",
        "reproductive",
        "decision",
        "cloning",
        "would",
        "allow",
        "u",
        "give",
        "child",
        "tried",
        "tested",
        "genome",
        "one",
        "created",
        "genetic",
        "lottery",
        "sexual",
        "reproduction",
        "random",
        "combination",
        "chromosome",
        "clone",
        "treated",
        "mean",
        "cloning",
        "arouses",
        "people",
        "imagination",
        "clone",
        "also",
        "choose",
        "child",
        "cloning",
        "often",
        "dubious",
        "motif",
        "ascribed",
        "would",
        "want",
        "child",
        "like",
        "soandso",
        "causing",
        "people",
        "view",
        "child",
        "object",
        "commodity",
        "like",
        "new",
        "car",
        "new",
        "house",
        "putnam",
        "would",
        "want",
        "attractive",
        "child",
        "clone",
        "scarlett",
        "johansson",
        "child",
        "tennis",
        "talent",
        "clone",
        "victoria",
        "azarenka",
        "purely",
        "show",
        "dictator",
        "would",
        "want",
        "army",
        "clone",
        "achieve",
        "political",
        "goal",
        "people",
        "would",
        "clone",
        "vanity",
        "parent",
        "would",
        "clone",
        "existing",
        "child",
        "clone",
        "serve",
        "organ",
        "bank",
        "child",
        "would",
        "clone",
        "deceased",
        "child",
        "replacement",
        "child",
        "conclusion",
        "cloning",
        "wrong",
        "clone",
        "used",
        "mere",
        "mean",
        "others",
        "end",
        "critique",
        "also",
        "expressed",
        "regard",
        "form",
        "assisted",
        "reproduction",
        "worry",
        "individual",
        "created",
        "cloning",
        "may",
        "likely",
        "viewed",
        "commodity",
        "total",
        "genetic",
        "blueprint",
        "would",
        "chosen",
        "would",
        "fully",
        "made",
        "begotten",
        "ramsey",
        "ka",
        "pcbe",
        "strong",
        "argued",
        "concern",
        "based",
        "fallacious",
        "inference",
        "one",
        "thing",
        "desire",
        "genetically",
        "related",
        "child",
        "something",
        "else",
        "believe",
        "one",
        "owns",
        "one",
        "child",
        "one",
        "considers",
        "one",
        "child",
        "object",
        "writes",
        "commentator",
        "however",
        "pointed",
        "even",
        "parent",
        "commodify",
        "child",
        "cloning",
        "might",
        "still",
        "impact",
        "society",
        "whole",
        "thereby",
        "increasing",
        "tendency",
        "others",
        "levy",
        "lotz",
        "sandel",
        "related",
        "concern",
        "expressed",
        "levick",
        "allowing",
        "cloning",
        "might",
        "result",
        "society",
        "production",
        "demand",
        "clone",
        "sold",
        "adoption",
        "people",
        "seeking",
        "child",
        "special",
        "ability",
        "clearer",
        "case",
        "treating",
        "child",
        "object",
        "suppose",
        "people",
        "create",
        "clone",
        "instrumental",
        "reason",
        "example",
        "stem",
        "cell",
        "donor",
        "sick",
        "sibling",
        "imply",
        "clone",
        "treated",
        "merely",
        "mean",
        "critic",
        "argument",
        "pointed",
        "parent",
        "child",
        "kind",
        "instrumental",
        "reason",
        "including",
        "benefit",
        "husbandwife",
        "relationship",
        "continuity",
        "family",
        "name",
        "economic",
        "psychological",
        "benefit",
        "child",
        "provide",
        "parent",
        "become",
        "old",
        "harris",
        "penny",
        "generally",
        "considered",
        "problematic",
        "long",
        "child",
        "also",
        "valued",
        "right",
        "important",
        "parentchild",
        "relationship",
        "love",
        "care",
        "inherent",
        "relationship",
        "stress",
        "fact",
        "judge",
        "people",
        "attitude",
        "toward",
        "child",
        "rather",
        "motif",
        "also",
        "deny",
        "strong",
        "link",
        "one",
        "intention",
        "motive",
        "child",
        "way",
        "one",
        "treat",
        "child",
        "societal",
        "prejudice",
        "respect",
        "clone",
        "another",
        "concern",
        "clone",
        "may",
        "victim",
        "unjustified",
        "discrimination",
        "respected",
        "person",
        "deech",
        "levick",
        "savulescu",
        "internet",
        "resource",
        "referred",
        "negative",
        "attitude",
        "towards",
        "clone",
        "clonism",
        "new",
        "form",
        "discrimination",
        "group",
        "human",
        "different",
        "nonmorally",
        "significant",
        "way",
        "fear",
        "clonism",
        "constitute",
        "good",
        "reason",
        "rejecting",
        "cloning",
        "savulescu",
        "others",
        "argued",
        "must",
        "conclude",
        "racist",
        "attitude",
        "discriminatory",
        "behavior",
        "towards",
        "people",
        "certain",
        "ethnicity",
        "provides",
        "good",
        "reason",
        "people",
        "ethnicity",
        "procreate",
        "according",
        "critic",
        "morally",
        "objectionable",
        "way",
        "solve",
        "problem",
        "racism",
        "instead",
        "limiting",
        "people",
        "procreative",
        "liberty",
        "combat",
        "existing",
        "prejudice",
        "discrimination",
        "likewise",
        "argued",
        "instead",
        "prohibiting",
        "cloning",
        "concern",
        "clonism",
        "combat",
        "possible",
        "prejudice",
        "discrimination",
        "clone",
        "see",
        "also",
        "penny",
        "harris",
        "macintosh",
        "warned",
        "expressing",
        "certain",
        "concern",
        "cloning",
        "one",
        "may",
        "actually",
        "reinforce",
        "certain",
        "prejudice",
        "misguided",
        "stereotype",
        "clone",
        "example",
        "saying",
        "clone",
        "would",
        "personal",
        "identity",
        "prejudges",
        "clone",
        "inferior",
        "fraudulent",
        "idea",
        "original",
        "valuable",
        "copy",
        "even",
        "le",
        "human",
        "individuality",
        "seen",
        "essential",
        "characteristic",
        "human",
        "nature",
        "complex",
        "family",
        "relationship",
        "worry",
        "cloning",
        "threaten",
        "traditional",
        "family",
        "structure",
        "fear",
        "come",
        "debate",
        "gay",
        "people",
        "adopting",
        "child",
        "ivf",
        "assisted",
        "reproduction",
        "technique",
        "cloning",
        "situation",
        "would",
        "complex",
        "may",
        "blur",
        "generational",
        "boundary",
        "mcgee",
        "clone",
        "would",
        "likely",
        "confused",
        "kinship",
        "tie",
        "ka",
        "neil",
        "example",
        "woman",
        "child",
        "conceived",
        "cloning",
        "would",
        "actually",
        "twin",
        "child",
        "woman",
        "mother",
        "would",
        "genetically",
        "mother",
        "grandmother",
        "argued",
        "concern",
        "replying",
        "cloned",
        "child",
        "would",
        "necessarily",
        "confused",
        "family",
        "tie",
        "child",
        "many",
        "four",
        "nurturing",
        "parent",
        "divorce",
        "never",
        "knew",
        "genetic",
        "parent",
        "nurturing",
        "parent",
        "genetic",
        "parent",
        "think",
        "nurturing",
        "father",
        "also",
        "genetic",
        "father",
        "fact",
        "complex",
        "family",
        "relationship",
        "troubling",
        "child",
        "insurmountable",
        "critic",
        "say",
        "harris",
        "argues",
        "many",
        "aspect",
        "situation",
        "one",
        "born",
        "raised",
        "may",
        "troublesome",
        "child",
        "important",
        "thing",
        "relation",
        "people",
        "nurture",
        "educate",
        "child",
        "usually",
        "know",
        "well",
        "people",
        "reason",
        "believe",
        "cloning",
        "different",
        "onora",
        "neil",
        "argues",
        "response",
        "misplaced",
        "acknowledges",
        "already",
        "child",
        "confused",
        "family",
        "relationship",
        "argues",
        "different",
        "prospective",
        "parent",
        "seek",
        "potentially",
        "confused",
        "relationship",
        "child",
        "start"
    ]
}