{
    "main_text": "Contemporary philosophical accounts of coercion || Nozick and a new approach to coercion\n2.1 Nozick and a new approach to coercion\n\nBeginning in 1969, a spate of short articles was published on\ncoercion. The earliest of significance was Robert Nozick’s\n“Coercion.” It was followed shortly by a collection of\nessays by political philosophers published in a volume of the\nNomos series, focused on coercion (Pennock and Chapman 1972).\nThese articles were in turn followed by an outpouring of responses and\noriginal discussions of coercion that continued throughout the 1970s\nand 80s. The influence of these early discussions of coercion remains\nstrong. So it is useful to begin thinking about contemporary\ntreatments of coercion by looking at how these early articles framed\nthe topic.\n\nNozick’s essay was by far the most influential of these early\nworks. Besides being first, his essay established a framework for\nthinking about coercion which provided an intuitively compelling\npicture of how coercion works. Nozick analyzed coercion by offering a\nlist of necessary and sufficient conditions for judging the truth of\nthe claim that P coerces Q. Somewhat simplified, he\nargued that P coerces Q if and only if:\n\nP aims to keep Q from choosing to perform action\nA;\nP communicates a claim to Q;\nP’s claim indicates that if Q performs\nA, then P will bring about some consequence that\nwould make Q’s A-ing less desirable to\nQ than Q’s not A-ing;\nP’s claim is credible to Q;\nQ does not do A;\nPart of Q’s reason for not doing A is to\nlessen the likelihood that P will bring about the consequence\nannounced in (3) (Nozick 1969,\n 441–445).[5]\n\n\nMany theorists adopted this framework explicitly or implicitly, and it\nhas influenced almost all subsequent analytic philosophical\ndiscussions of the topic. Subsequent sections will address the aspects\nof Nozick’s analysis which have received the most attention and\ndebate. The remainder of this section sketches some of the less\nremarked ways in which Nozick’s analysis differs from the more\ntraditional understanding of coercion, exhibited in the historical\nsurvey above. Specifically, (1) it associates coercion only with\nproposals (e.g., conditional\n threats[6]),\n and excludes direct uses of force or\n violence[7];\n (2) it insists that coercion takes place only when the coercee\nacquiesces to it; and (3) it makes coercion explicitly dependent on\nthe coercee’s choice to take or not take a specific action\nA, and mandates that a judgment about coercion must refer to\nfacts about the coercee’s psychology, such as her assessment of\nthe consequences A-ing in light of the coercer’s\nproposal. The overall effect of these differences is to focus the\nanalysis of coercion on how the coercee is affected by it, rather than\non what the coercer does, and what is required for him to do it\nsuccessfully. (See Anderson 2008b.)\n2.1.1 Coercion via threats, and (not) via force\n\nOne significant departure from the traditional approach is that Nozick\nlimits his discussion of coercion to techniques that influence or\nalter the will of the coercee, by altering the intentions or\ndispositions of the coercee. Such coercion usually takes the form of a\nconditional threat (or sometimes a conditional offer). Though a few\nsubsequent writers, like Michael Bayles (Bayles 1972; and Gunderson\n1979, following Bayles) and Grant Lamond (Lamond 1996 and 2000), have\naccepted direct force as equally a means of\n coercion,[8]\n Nozick’s restriction of the topic to the use of threats —\nthat is, coercion that operates through the will of the coercee\n— has been the much more frequently accepted view, whether\nexplicitly or implicitly.\n\nHowever, some theorists argue that there are good reasons to treat\ncoercion via the will and direct force or constraint applied to the\nbody as two methods of a single kind of activity. First, though direct\nforce is usually unsuited to get an agent to perform a specific\naction, both are well suited to preventing an agent from taking a\nvariety of actions, with direct force or constraint often being more\ndecisive. Second, the two techniques are often used hand-in-hand. For\ninstance, police officers will shackle and manhandle someone in\ncustody who refuses to cooperate when given instructions to move or\nstay still. Also, prison inmates are coerced into remaining there by a\ncombination of penalties for attempting escape along with physical\nobstacles that limit the feasibility of doing so. So using both\ntechniques is often part of one and the same activity aimed at\naffecting or constraining what an agent will do (sometimes by\naffecting what she can do) (Anderson 2008a and 2010). Of\ncourse, under direct force, it will usually be true that the coercee\ndoes not act, but rather is acted upon, as H. J. McCloskey puts it\n(McCloskey 1980). However, from the coercer’s perspective, it\nmay be just as well, in enforcing his decisions, to prevent the\ncoercee from acting at all as it would be to induce her to choose not\nto act.\n2.1.2 (No) unsuccessful coercion\n\nNozick’s framing indicates that coercion is necessarily\nsuccessful: if the coercee does not act as demanded, then there is no\ninstance of coercion. At most, it seems, there is an instance of\nattempted coercion. One might say that Nozick builds a “success\ncondition” into his analysis of coercion. Others have disagreed\nwith the success condition, though Nozick’s is apparently a\nmajority view. (Those who agree include McCloskey 1980; Gorr 1986;\nMurray and Dudrick 1995; Berman 2002; Garnett 2018; one who disagrees\nis Carr 1988). The disagreement seems to be over whether to identify\ninstances of coercion with one or the other of the two faces mentioned\nat the outset: that is, to identify it with a kind of behavior by the\ncoercer (which may or may not be successful), or to identify it with\nspecific events in the life of the coercee (namely, those that alter\nor constrain her activities). Several authors, picking up on the\ndisagreement, have suggested that we might distinguish coercion from\ncoerciveness, associating the former with completed, successful\nattempts, and the latter with qualities of the attempt itself (Lamond,\n2000).\n\nOf course, if the coercee defies the coercer, there is no coerced\naction to investigate, nor any question to answer about responsibility\nfor such an action. There is also reason to doubt that what the\ncoercer did in such cases rises to meet the bar at which we should\nconsider it coercive. (If a threat is trivial, we would likely resist\nsaying that an agent was coerced by it even if she acts to prevent its\nexecution.) On the other hand, it may be unwise to make a categorical\ndistinction between cases in which coercion succeeds and cases where\nit fails: the difference between them on some occasions may be nothing\nmore than what mood the coercee happened to be in at the time. Since\nthe coercer has the final and definitive say over whether he will\nengage in coercive activity (and who will be engaged by it), it may\nmake more sense to identify our phenomenon of interest with a certain\nform of activity by the coercer, admitting that such activity may or\nmay not result in any further noticeable consequences. (The would-be\ncoercer may of course be bluffing, and the prospective coercee may\ncall the bluff; this would not, by itself, give reason to deny that we\nhave here an instance of the technique under study.)\n2.1.3 Is coercion conceptually limited to specific coerced acts?\n\nFinally, Nozick frames his analysis with respect to some particular\naction A taken or not taken by the coercee. The connection of\ncoercion to a specific action taken or foregone has seemed natural to\nalmost all subsequent commentators, even though it raises some\nproblems of which at least Nozick himself seems to have been aware. In\nthe short detour that is the second section of his essay, Nozick poses\nquestions of the following sort: If P coerces Q into\ndoing A, and B and C are the only ways to\ndo A, does P coerce Q into doing B\n(assuming that is the means Q chose)? Similarly, if\nP coerces Q into not doing A, and\nA is a necessary precursor to B, does P\ncoerce Q into not doing B? Does it matter whether\nQ was already aiming/hoping/expecting to do B? More\ngenerally, if as a result of prior acts of coercion by P, an\nact A is no longer possible for Q (perhaps\nQ doesn’t think about it at all), has P\ncoerced Q into not A-ing? Nozick broaches questions\nof these sorts, but leaves them aside without much mention of their\nsignificance (See Nozick 1969, 445–47). Taken seriously,\nhowever, they would force some significant revisions to the way\ntheorists have analyzed coercion. They show that there may be\ndifficulties in identifying coercion strictly with actions taken or\nforegone, since it may be impossible to determine just what actions\nthis description includes.\n\nMore generally, Nozick’s analysis emphasizes the alteration in\nthe coercee’s choice of actions which results from the way the\ncoercer’s proposal affects her reasons for acting. While this is\ncertainly a plausible approach for distinguishing coerced from\nuncoerced acts, it puts the focus on how the coercee perceives her\nsituation; it is only via this reflection that it takes into account\nhow the coercer is able to create this perception. That is, it leaves\nthe standard sorts of means (force, violence, perhaps even economic\ndeprivation) that coercers use out of the account, and instead treats\nall kinds of alterations to the coercee’s costs and benefits to\nacting as possible indications of coercion. While this more ecumenical\napproach to coercion may succeed in encompassing ways of coercing that\nthe traditional theories would leave out, it creates a difficult\nchallenge for the theory to distinguish coercive from non-coercive\nproposals. It is not surprising, therefore, that these are the issues\nthat have been the focus of most subsequent theorizing on the\nsubject.\n",
    "section_title": "2.1 Nozick and a new approach to coercion",
    "entry_title": "Coercion",
    "hierarchy_title": "Coercion || Contemporary philosophical accounts of coercion || Nozick and a new approach to coercion",
    "tokenized_text": [
        "contemporary",
        "philosophical",
        "account",
        "coercion",
        "nozick",
        "new",
        "approach",
        "coercion",
        "nozick",
        "new",
        "approach",
        "coercion",
        "beginning",
        "spate",
        "short",
        "article",
        "published",
        "coercion",
        "earliest",
        "significance",
        "robert",
        "nozick",
        "coercion",
        "followed",
        "shortly",
        "collection",
        "essay",
        "political",
        "philosopher",
        "published",
        "volume",
        "nomos",
        "series",
        "focused",
        "coercion",
        "pennock",
        "chapman",
        "article",
        "turn",
        "followed",
        "outpouring",
        "response",
        "original",
        "discussion",
        "coercion",
        "continued",
        "throughout",
        "s",
        "influence",
        "early",
        "discussion",
        "coercion",
        "remains",
        "strong",
        "useful",
        "begin",
        "thinking",
        "contemporary",
        "treatment",
        "coercion",
        "looking",
        "early",
        "article",
        "framed",
        "topic",
        "nozick",
        "essay",
        "far",
        "influential",
        "early",
        "work",
        "besides",
        "first",
        "essay",
        "established",
        "framework",
        "thinking",
        "coercion",
        "provided",
        "intuitively",
        "compelling",
        "picture",
        "coercion",
        "work",
        "nozick",
        "analyzed",
        "coercion",
        "offering",
        "list",
        "necessary",
        "sufficient",
        "condition",
        "judging",
        "truth",
        "claim",
        "p",
        "coerces",
        "q",
        "somewhat",
        "simplified",
        "argued",
        "p",
        "coerces",
        "q",
        "p",
        "aim",
        "keep",
        "q",
        "choosing",
        "perform",
        "action",
        "p",
        "communicates",
        "claim",
        "q",
        "p",
        "claim",
        "indicates",
        "q",
        "performs",
        "p",
        "bring",
        "consequence",
        "would",
        "make",
        "q",
        "aing",
        "le",
        "desirable",
        "q",
        "q",
        "aing",
        "p",
        "claim",
        "credible",
        "q",
        "q",
        "part",
        "q",
        "reason",
        "lessen",
        "likelihood",
        "p",
        "bring",
        "consequence",
        "announced",
        "nozick",
        "many",
        "theorist",
        "adopted",
        "framework",
        "explicitly",
        "implicitly",
        "influenced",
        "almost",
        "subsequent",
        "analytic",
        "philosophical",
        "discussion",
        "topic",
        "subsequent",
        "section",
        "address",
        "aspect",
        "nozick",
        "analysis",
        "received",
        "attention",
        "debate",
        "remainder",
        "section",
        "sketch",
        "le",
        "remarked",
        "way",
        "nozick",
        "analysis",
        "differs",
        "traditional",
        "understanding",
        "coercion",
        "exhibited",
        "historical",
        "survey",
        "specifically",
        "associate",
        "coercion",
        "proposal",
        "eg",
        "conditional",
        "threat",
        "excludes",
        "direct",
        "us",
        "force",
        "violence",
        "insists",
        "coercion",
        "take",
        "place",
        "coercee",
        "acquiesces",
        "make",
        "coercion",
        "explicitly",
        "dependent",
        "coercee",
        "choice",
        "take",
        "take",
        "specific",
        "action",
        "mandate",
        "judgment",
        "coercion",
        "must",
        "refer",
        "fact",
        "coercee",
        "psychology",
        "assessment",
        "consequence",
        "aing",
        "light",
        "coercer",
        "proposal",
        "overall",
        "effect",
        "difference",
        "focus",
        "analysis",
        "coercion",
        "coercee",
        "affected",
        "rather",
        "coercer",
        "required",
        "successfully",
        "see",
        "anderson",
        "b",
        "coercion",
        "via",
        "threat",
        "via",
        "force",
        "one",
        "significant",
        "departure",
        "traditional",
        "approach",
        "nozick",
        "limit",
        "discussion",
        "coercion",
        "technique",
        "influence",
        "alter",
        "coercee",
        "altering",
        "intention",
        "disposition",
        "coercee",
        "coercion",
        "usually",
        "take",
        "form",
        "conditional",
        "threat",
        "sometimes",
        "conditional",
        "offer",
        "though",
        "subsequent",
        "writer",
        "like",
        "michael",
        "bayles",
        "bayles",
        "gunderson",
        "following",
        "bayles",
        "grant",
        "lamond",
        "lamond",
        "accepted",
        "direct",
        "force",
        "equally",
        "mean",
        "coercion",
        "nozick",
        "restriction",
        "topic",
        "use",
        "threat",
        "coercion",
        "operates",
        "coercee",
        "much",
        "frequently",
        "accepted",
        "view",
        "whether",
        "explicitly",
        "implicitly",
        "however",
        "theorist",
        "argue",
        "good",
        "reason",
        "treat",
        "coercion",
        "via",
        "direct",
        "force",
        "constraint",
        "applied",
        "body",
        "two",
        "method",
        "single",
        "kind",
        "activity",
        "first",
        "though",
        "direct",
        "force",
        "usually",
        "unsuited",
        "get",
        "agent",
        "perform",
        "specific",
        "action",
        "well",
        "suited",
        "preventing",
        "agent",
        "taking",
        "variety",
        "action",
        "direct",
        "force",
        "constraint",
        "often",
        "decisive",
        "second",
        "two",
        "technique",
        "often",
        "used",
        "handinhand",
        "instance",
        "police",
        "officer",
        "shackle",
        "manhandle",
        "someone",
        "custody",
        "refuse",
        "cooperate",
        "given",
        "instruction",
        "move",
        "stay",
        "still",
        "also",
        "prison",
        "inmate",
        "coerced",
        "remaining",
        "combination",
        "penalty",
        "attempting",
        "escape",
        "along",
        "physical",
        "obstacle",
        "limit",
        "feasibility",
        "using",
        "technique",
        "often",
        "part",
        "one",
        "activity",
        "aimed",
        "affecting",
        "constraining",
        "agent",
        "sometimes",
        "affecting",
        "anderson",
        "a",
        "course",
        "direct",
        "force",
        "usually",
        "true",
        "coercee",
        "act",
        "rather",
        "acted",
        "upon",
        "h",
        "j",
        "mccloskey",
        "put",
        "mccloskey",
        "however",
        "coercer",
        "perspective",
        "may",
        "well",
        "enforcing",
        "decision",
        "prevent",
        "coercee",
        "acting",
        "would",
        "induce",
        "choose",
        "act",
        "unsuccessful",
        "coercion",
        "nozick",
        "framing",
        "indicates",
        "coercion",
        "necessarily",
        "successful",
        "coercee",
        "act",
        "demanded",
        "instance",
        "coercion",
        "seems",
        "instance",
        "attempted",
        "coercion",
        "one",
        "might",
        "say",
        "nozick",
        "build",
        "success",
        "condition",
        "analysis",
        "coercion",
        "others",
        "disagreed",
        "success",
        "condition",
        "though",
        "nozick",
        "apparently",
        "majority",
        "view",
        "agree",
        "include",
        "mccloskey",
        "gorr",
        "murray",
        "dudrick",
        "berman",
        "garnett",
        "one",
        "disagrees",
        "carr",
        "disagreement",
        "seems",
        "whether",
        "identify",
        "instance",
        "coercion",
        "one",
        "two",
        "face",
        "mentioned",
        "outset",
        "identify",
        "kind",
        "behavior",
        "coercer",
        "may",
        "may",
        "successful",
        "identify",
        "specific",
        "event",
        "life",
        "coercee",
        "namely",
        "alter",
        "constrain",
        "activity",
        "several",
        "author",
        "picking",
        "disagreement",
        "suggested",
        "might",
        "distinguish",
        "coercion",
        "coerciveness",
        "associating",
        "former",
        "completed",
        "successful",
        "attempt",
        "latter",
        "quality",
        "attempt",
        "lamond",
        "course",
        "coercee",
        "defies",
        "coercer",
        "coerced",
        "action",
        "investigate",
        "question",
        "answer",
        "responsibility",
        "action",
        "also",
        "reason",
        "doubt",
        "coercer",
        "case",
        "rise",
        "meet",
        "bar",
        "consider",
        "coercive",
        "threat",
        "trivial",
        "would",
        "likely",
        "resist",
        "saying",
        "agent",
        "coerced",
        "even",
        "act",
        "prevent",
        "execution",
        "hand",
        "may",
        "unwise",
        "make",
        "categorical",
        "distinction",
        "case",
        "coercion",
        "succeeds",
        "case",
        "fails",
        "difference",
        "occasion",
        "may",
        "nothing",
        "mood",
        "coercee",
        "happened",
        "time",
        "since",
        "coercer",
        "final",
        "definitive",
        "say",
        "whether",
        "engage",
        "coercive",
        "activity",
        "engaged",
        "may",
        "make",
        "sense",
        "identify",
        "phenomenon",
        "interest",
        "certain",
        "form",
        "activity",
        "coercer",
        "admitting",
        "activity",
        "may",
        "may",
        "result",
        "noticeable",
        "consequence",
        "wouldbe",
        "coercer",
        "may",
        "course",
        "bluffing",
        "prospective",
        "coercee",
        "may",
        "call",
        "bluff",
        "would",
        "give",
        "reason",
        "deny",
        "instance",
        "technique",
        "study",
        "coercion",
        "conceptually",
        "limited",
        "specific",
        "coerced",
        "act",
        "finally",
        "nozick",
        "frame",
        "analysis",
        "respect",
        "particular",
        "action",
        "taken",
        "taken",
        "coercee",
        "connection",
        "coercion",
        "specific",
        "action",
        "taken",
        "foregone",
        "seemed",
        "natural",
        "almost",
        "subsequent",
        "commentator",
        "even",
        "though",
        "raise",
        "problem",
        "least",
        "nozick",
        "seems",
        "aware",
        "short",
        "detour",
        "second",
        "section",
        "essay",
        "nozick",
        "pose",
        "question",
        "following",
        "sort",
        "p",
        "coerces",
        "q",
        "b",
        "c",
        "way",
        "p",
        "coerce",
        "q",
        "b",
        "assuming",
        "mean",
        "q",
        "chose",
        "similarly",
        "p",
        "coerces",
        "q",
        "necessary",
        "precursor",
        "b",
        "p",
        "coerce",
        "q",
        "b",
        "matter",
        "whether",
        "q",
        "already",
        "aiminghopingexpecting",
        "b",
        "generally",
        "result",
        "prior",
        "act",
        "coercion",
        "p",
        "act",
        "longer",
        "possible",
        "q",
        "perhaps",
        "q",
        "think",
        "p",
        "coerced",
        "q",
        "aing",
        "nozick",
        "broach",
        "question",
        "sort",
        "leaf",
        "aside",
        "without",
        "much",
        "mention",
        "significance",
        "see",
        "nozick",
        "taken",
        "seriously",
        "however",
        "would",
        "force",
        "significant",
        "revision",
        "way",
        "theorist",
        "analyzed",
        "coercion",
        "show",
        "may",
        "difficulty",
        "identifying",
        "coercion",
        "strictly",
        "action",
        "taken",
        "foregone",
        "since",
        "may",
        "impossible",
        "determine",
        "action",
        "description",
        "includes",
        "generally",
        "nozick",
        "analysis",
        "emphasizes",
        "alteration",
        "coercee",
        "choice",
        "action",
        "result",
        "way",
        "coercer",
        "proposal",
        "affect",
        "reason",
        "acting",
        "certainly",
        "plausible",
        "approach",
        "distinguishing",
        "coerced",
        "uncoerced",
        "act",
        "put",
        "focus",
        "coercee",
        "perceives",
        "situation",
        "via",
        "reflection",
        "take",
        "account",
        "coercer",
        "able",
        "create",
        "perception",
        "leaf",
        "standard",
        "sort",
        "mean",
        "force",
        "violence",
        "perhaps",
        "even",
        "economic",
        "deprivation",
        "coercers",
        "use",
        "account",
        "instead",
        "treat",
        "kind",
        "alteration",
        "coercee",
        "cost",
        "benefit",
        "acting",
        "possible",
        "indication",
        "coercion",
        "ecumenical",
        "approach",
        "coercion",
        "may",
        "succeed",
        "encompassing",
        "way",
        "coercing",
        "traditional",
        "theory",
        "would",
        "leave",
        "creates",
        "difficult",
        "challenge",
        "theory",
        "distinguish",
        "coercive",
        "noncoercive",
        "proposal",
        "surprising",
        "therefore",
        "issue",
        "focus",
        "subsequent",
        "theorizing",
        "subject"
    ]
}