{
    "main_text": "Uses for thought about coercion || The effect of coercion on coercee responsibility\n3.2 The effect of coercion on coercee responsibility\n\nThere is no single, widely agreed upon theory that explains when an\nagent is or is not responsible for something that happens in the\nworld. Judgments of responsibility are normative, and may depend on\nother normative facts specific to the particular sort of action or\npractice in question. For instance, facts that might limit one’s\nresponsibility for signing or violating a contract might fail to limit\none’s responsibility for killing someone. So the effect of\ncoercion or its kin (duress, extortion) may differ depending upon the\nsort of action for which one seeks to limit one’s\nresponsibility, or upon the moral context in which one acted.\nNonetheless, a few central cases and some general tendencies can be\ngiven with some confidence.\n\nThere are two traditional sorts of grounds on which an agent’s\nresponsibility might be truncated or attenuated because he was\ncoerced. The first is by virtue of being excused for his action; the\nsecond is by virtue of his action’s being justified. The exact\nunderstanding of this distinction is under continuing dispute, but\nhere is one way of understanding its most salient points. One may be\nexcused, in whole or in part, for an action performed under\ncoercion if that action (or its consequences) was beyond one’s\ncontrol or willpower to prevent, or if that action (or its\nconsequences) was unintentional. This latter condition might obtain\nif, for instance, one acquiesces under coercion to do something\nintentionally (like driving a car), but in so doing one does something\nelse unintentionally (like helping a murderer escape). One is\njustified in acquiescing to coercion if one’s action\n(or its consequences) is morally required, or is morally permissible\nunder the circumstances even if the action will foreseeably result in\nharm to others. (One obvious category of actions that carry such\njustifications are those taken to disable an attacker in self-defense\nor the defense of others.) However, the predominant recent accounts of\ncoercion seem to need additional filling in when queried for guidance\nto determine whether the target of coercion may be excused or\njustified for actions taken or forgone due to coercion.\n\nMost questions about coercion’s effect on responsibility arise\nin cases of coercion via conditional threats. When an agent is\nconfronted by a threat, one ground on which her acquiescence may be\nexcused is if the threat causes a total breakdown in her will. Like\nother incapacities, this can affect her responsibility for actions\ntaken because she was truly unable to do otherwise. (This excuse may\nlead to questions about how the agent became vulnerable to suffering\nsuch a breakdown in agency; but in such cases she may be responsible\nfor her weakness of character, though perhaps not for her action.)\nExcuse may also be invoked when the coerced person acts in ignorance\nor if the harm she causes is unintentional (excuses which are\navailable regardless of whether one is coerced). But many people are\nable to react deliberately and rationally in response to coercive\nthreats. So it seems that most cases of diminished responsibility\nunder coercion will appeal to justification rather than excuse.\n\nSome accounts of coercion apply a moralized test to the\ncoercee’s situation, holding that one may avoid responsibility\nfor an act taken under coercion if the coercer’s proposal is\nsuch that one “is entitled to yield to [the coercer’s]\nproposal and then be released from the normal moral and legal\nconsequences of [one’s] act” (Wertheimer 1987, 267).\nSimilarly, Pallikkathayil argues that individuals have a right to a\n“moral veto” over proposals that impermissibly restrain\ntheir options for action. When someone makes a coercive proposal that\nviolates this moral right of veto, this undermines the normative power\nof the coercee’s will to consent to the terms of the proposal,\nand thus renders supposed consent ineffective, and thus undercuts\ntheir responsibility (Pallikkathayil 2011). Such moralized theories\nthus shift the explanatory burden from a theory of coercion to the\nbackground moral or normative theory they call upon to explain the\neffect of coercion on moral responsibility. Although there are some\nspecific moralized or normative tests one might use to decide\nresponsibility for action under coercion, it is unclear that any of\nthem is robust enough to handle more than a fraction of the\n cases.[21]\n\nOne test of responsibility that might be proposed would limit the\nresponsibility of someone acting under coercion if she acts in a way\nthat minimizes the total amount of harm (invoking the\n“lesser-evil principle”). So, for instance, we might deny\nthat a person is responsible for choosing to injure another to avoid\nbeing killed, but hold her responsible if she chooses to kill someone\nto avoid being injured herself. Though this principle is intuitively\nplausible, we clearly do not accept it in other, non-coercive\ncontexts. For instance, we do not permit one to snatch a spare kidney\nfrom one individual to save the life of another. Although we might add\nconditions to this test to make the limitation of one’s\nresponsibility harder to obtain, and therefore more in line with our\nintuitions, it remains unclear that there is any widely-accepted moral\nprinciple of this sort that would cover all cases equally well.\n\nInstead of a moral test, one might propose a psychological test, on\nwhich acquiescing to a coercer’s demands in a way that harms\nothers is justified if the net value of doing so is sufficiently great\nto the coercee. Roughly speaking, this is Feinberg’s approach,\ntaken up by Murray and Dudrick as well. (See Feinberg 1986; and Murray\nand Dudrick 1995.) The point of such a standard is to recognize that\nsome pressures on the will are too much to bear, without implying that\nin such cases it is literally impossible for the coercee to make\nchoices because of an overborne will. The difficulty with this\napproach is that it lets the degree of inducement alone justify\none’s yielding to it. A number of causes other than coercion can\ncreate extreme inducements to do harm to others; consider what some\nhave done for fame, wealth, or love. Because most would be reluctant\nto accept that even extraordinarily tempting offers limit one’s\nresponsibility for yielding to them, the magnitude of the inducement\nby itself seems not to suffice to explain our judgments of\nresponsibility. Although we might add other conditions to restrict the\nlimiting effect on responsibility exclusively to threats and not\noffers, if the justification lies in the pressure on the will, then it\nwould seem one might have the same justification for yielding to\ntemptation that one has for acquiescing to a mortal threat. (Note that\nsome tempting offers have life or death riding on them.)\n\nLaw is sometimes required to make judgments about actions performed\nunder necessity due to exigent circumstances. Sometimes persons harm\nthe interests of others in order to save themselves or others from\ndeath or serious injury from causes beyond their\n control.[22]\n Coercion, however, presents a more complicated set of issues for\nmaking judgments of responsibility than do cases of natural necessity.\nCoercion involves a strategic and dynamic interaction between two\nagents — coercer and coercee — and the standard used to\njudge the coercee’s responsibility for acting under coercion can\naffect that strategic situation. The principles by which we judge a\ncoercee’s responsibility for acquiescing to coercion may affect\nwhether it is rational or productive for a would-be coercer to attempt\ncoercion in the first place. (By comparison, in cases of bad luck and\nnatural disaster, the situation is simpler because the behavior of the\nweather, unlike the behavior of coercers, is unaffected by the\nincentives facing those who might be pressured into acting under its\npower.) If we are permissive in limiting the responsibility of\ncoercees, this will make acquiescing to coercion a more reasonable\noption; if instead we are stingy in limiting responsibility for harms\ncaused under coercion, coercees may be much less likely to acquiesce\nto a coercer’s threats. But if a (would-be) coercer knows that a\npotential victim will be unyielding to his threats, then coercion\nbecomes a less productive or reasonable means to use. So in choosing a\nprinciple that justifies coercees in acquiescing under coercion, we\nneed to take into account that this principle may alter the dynamic\nbetween coercer and coercee in ways that may in turn affect the\nrationality and fruitfulness of using coercion.\n\nThere are, however, some cases in which coercion may alter an\nagent’s responsibility for what happens as a result of coercion\nthat don’t raise the difficulties with justifications noted\nabove. If, like some older ideas about coercion, we count uses of\ndirect physical interference among the means of coercion —\nthrough restraint, incapacitation, or denial of essential means to\nachieve a purpose — then in some cases it is comparatively easy\nto see how coercion can provide an individual an excuse for things\ndone or not done because of coercion (See Anderson 2010). Relying on\nthe principle of “ought implies can,” when one cannot do\nsomething, this provides a good excuse for why one is not responsible\nfor failing to do it. Related questions may arise about how one came\nto be incapacitated; for instance, if one fails to care for\none’s children, and seeks to be excused for this neglect because\none was incarcerated, we may want to know why one was incarcerated\nbefore crediting the excuse. Nonetheless, there will be some cases\nwhere the answers to these questions will show that the coercee played\nno role in his own incapacitation, and is therefore not to be held\nresponsible for things the coercer caused him to do or not do.\n\nSimilarly, it is worth noting that there are some cases in which\ncoercees may be justified, and not just excused, for acquiescing to\nthreats, even if they do so calmly and deliberately. This sort of\njustification can be granted when the coercer has structured a\ncoercee’s situation in such a way that the coercee’s will\nbecomes essentially redundant to the outcome. If, for instance, a\nbouncer is able to remove a patron from the bar whether she likes it\nor not, then if the bouncer threatens to do so, her walking out of the\nbar in response to such a threat may be regarded as no more voluntary\nthan her being carried out by force. When a coercer has the power to\nenforce his decision regardless of what the coercee chooses to do,\nthis may provide the coercee a justification for failing to engage in\nan exercise in\n futility.[23]\n Generalizing this situation somewhat, Stephen Galoob and Erin Sheley\nargue that in contexts where a coercer has “coercive\ncontrol” over a someone, such as in a long-term violent and\nabusive relationship, if such a coercer directs the coercee to act\nunlawfully, the criminal law should allow a legal defense for actions\nunder the influence of such control. “A defendant should be\nentitled to a coercion-based defense when the coercer has usurped the\ntarget’s decisional authority—that is, when the coercer\nhas usurped control over the target’s decision about what to\ndo” (Galoob and Sheley 2021, 314).\n\nAn additional wrinkle with respect to responsibility under coercion\narises in cases sometimes referred to as involving “third-party\ncoercion”: where X coerces Y to consent to something that Z does\nto Y. For instance, a patient might consent to a medical procedure\nunder pressure from family members (assuming such pressure rises to a\nlevel that qualifies as coercion), or a person might consent to have\nsex with someone due to threats of harm from an third party\nunconnected to the person who receives her consent. While it is\ngenerally agreed that a coercer’s threats invalidate any consent\nthat the coercee might give to subsequent actions by the coercer, in\nthird-party cases the consent is given to action by a bystander with\nrespect to the coercion. Issues here may involve the extent to which\nthe third-party is aware (or should be aware) of the coercee’s\nsituation, the question of what action by the third-party would most\nbenefit the coercee, and whether the third party seeks to take\nadvantage of the coercee’s situation. Such cases have only\nrecently received focused attention by philosophers, such as Joseph\nMillum and Mollie Gerver, though issues of this sort have been\nidentified in applied ethics and in the context of international and\nhumanitarian aid for some time (Millum 2014, Gerver 2021).\n",
    "section_title": "3.2 The effect of coercion on coercee responsibility",
    "entry_title": "Coercion",
    "hierarchy_title": "Coercion || Uses for thought about coercion || The effect of coercion on coercee responsibility",
    "tokenized_text": [
        "us",
        "thought",
        "coercion",
        "effect",
        "coercion",
        "coercee",
        "responsibility",
        "effect",
        "coercion",
        "coercee",
        "responsibility",
        "single",
        "widely",
        "agreed",
        "upon",
        "theory",
        "explains",
        "agent",
        "responsible",
        "something",
        "happens",
        "world",
        "judgment",
        "responsibility",
        "normative",
        "may",
        "depend",
        "normative",
        "fact",
        "specific",
        "particular",
        "sort",
        "action",
        "practice",
        "question",
        "instance",
        "fact",
        "might",
        "limit",
        "one",
        "responsibility",
        "signing",
        "violating",
        "contract",
        "might",
        "fail",
        "limit",
        "one",
        "responsibility",
        "killing",
        "someone",
        "effect",
        "coercion",
        "kin",
        "duress",
        "extortion",
        "may",
        "differ",
        "depending",
        "upon",
        "sort",
        "action",
        "one",
        "seek",
        "limit",
        "one",
        "responsibility",
        "upon",
        "moral",
        "context",
        "one",
        "acted",
        "nonetheless",
        "central",
        "case",
        "general",
        "tendency",
        "given",
        "confidence",
        "two",
        "traditional",
        "sort",
        "ground",
        "agent",
        "responsibility",
        "might",
        "truncated",
        "attenuated",
        "coerced",
        "first",
        "virtue",
        "excused",
        "action",
        "second",
        "virtue",
        "action",
        "justified",
        "exact",
        "understanding",
        "distinction",
        "continuing",
        "dispute",
        "one",
        "way",
        "understanding",
        "salient",
        "point",
        "one",
        "may",
        "excused",
        "whole",
        "part",
        "action",
        "performed",
        "coercion",
        "action",
        "consequence",
        "beyond",
        "one",
        "control",
        "willpower",
        "prevent",
        "action",
        "consequence",
        "unintentional",
        "latter",
        "condition",
        "might",
        "obtain",
        "instance",
        "one",
        "acquiesces",
        "coercion",
        "something",
        "intentionally",
        "like",
        "driving",
        "car",
        "one",
        "something",
        "else",
        "unintentionally",
        "like",
        "helping",
        "murderer",
        "escape",
        "one",
        "justified",
        "acquiescing",
        "coercion",
        "one",
        "action",
        "consequence",
        "morally",
        "required",
        "morally",
        "permissible",
        "circumstance",
        "even",
        "action",
        "foreseeably",
        "result",
        "harm",
        "others",
        "one",
        "obvious",
        "category",
        "action",
        "carry",
        "justification",
        "taken",
        "disable",
        "attacker",
        "selfdefense",
        "defense",
        "others",
        "however",
        "predominant",
        "recent",
        "account",
        "coercion",
        "seem",
        "need",
        "additional",
        "filling",
        "queried",
        "guidance",
        "determine",
        "whether",
        "target",
        "coercion",
        "may",
        "excused",
        "justified",
        "action",
        "taken",
        "forgone",
        "due",
        "coercion",
        "question",
        "coercion",
        "effect",
        "responsibility",
        "arise",
        "case",
        "coercion",
        "via",
        "conditional",
        "threat",
        "agent",
        "confronted",
        "threat",
        "one",
        "ground",
        "acquiescence",
        "may",
        "excused",
        "threat",
        "cause",
        "total",
        "breakdown",
        "like",
        "incapacity",
        "affect",
        "responsibility",
        "action",
        "taken",
        "truly",
        "unable",
        "otherwise",
        "excuse",
        "may",
        "lead",
        "question",
        "agent",
        "became",
        "vulnerable",
        "suffering",
        "breakdown",
        "agency",
        "case",
        "may",
        "responsible",
        "weakness",
        "character",
        "though",
        "perhaps",
        "action",
        "excuse",
        "may",
        "also",
        "invoked",
        "coerced",
        "person",
        "act",
        "ignorance",
        "harm",
        "cause",
        "unintentional",
        "excuse",
        "available",
        "regardless",
        "whether",
        "one",
        "coerced",
        "many",
        "people",
        "able",
        "react",
        "deliberately",
        "rationally",
        "response",
        "coercive",
        "threat",
        "seems",
        "case",
        "diminished",
        "responsibility",
        "coercion",
        "appeal",
        "justification",
        "rather",
        "excuse",
        "account",
        "coercion",
        "apply",
        "moralized",
        "test",
        "coercee",
        "situation",
        "holding",
        "one",
        "may",
        "avoid",
        "responsibility",
        "act",
        "taken",
        "coercion",
        "coercer",
        "proposal",
        "one",
        "entitled",
        "yield",
        "coercer",
        "proposal",
        "released",
        "normal",
        "moral",
        "legal",
        "consequence",
        "one",
        "act",
        "wertheimer",
        "similarly",
        "pallikkathayil",
        "argues",
        "individual",
        "right",
        "moral",
        "veto",
        "proposal",
        "impermissibly",
        "restrain",
        "option",
        "action",
        "someone",
        "make",
        "coercive",
        "proposal",
        "violates",
        "moral",
        "right",
        "veto",
        "undermines",
        "normative",
        "power",
        "coercee",
        "consent",
        "term",
        "proposal",
        "thus",
        "render",
        "supposed",
        "consent",
        "ineffective",
        "thus",
        "undercut",
        "responsibility",
        "pallikkathayil",
        "moralized",
        "theory",
        "thus",
        "shift",
        "explanatory",
        "burden",
        "theory",
        "coercion",
        "background",
        "moral",
        "normative",
        "theory",
        "call",
        "upon",
        "explain",
        "effect",
        "coercion",
        "moral",
        "responsibility",
        "although",
        "specific",
        "moralized",
        "normative",
        "test",
        "one",
        "might",
        "use",
        "decide",
        "responsibility",
        "action",
        "coercion",
        "unclear",
        "robust",
        "enough",
        "handle",
        "fraction",
        "case",
        "one",
        "test",
        "responsibility",
        "might",
        "proposed",
        "would",
        "limit",
        "responsibility",
        "someone",
        "acting",
        "coercion",
        "act",
        "way",
        "minimizes",
        "total",
        "amount",
        "harm",
        "invoking",
        "lesserevil",
        "principle",
        "instance",
        "might",
        "deny",
        "person",
        "responsible",
        "choosing",
        "injure",
        "another",
        "avoid",
        "killed",
        "hold",
        "responsible",
        "chooses",
        "kill",
        "someone",
        "avoid",
        "injured",
        "though",
        "principle",
        "intuitively",
        "plausible",
        "clearly",
        "accept",
        "noncoercive",
        "context",
        "instance",
        "permit",
        "one",
        "snatch",
        "spare",
        "kidney",
        "one",
        "individual",
        "save",
        "life",
        "another",
        "although",
        "might",
        "add",
        "condition",
        "test",
        "make",
        "limitation",
        "one",
        "responsibility",
        "harder",
        "obtain",
        "therefore",
        "line",
        "intuition",
        "remains",
        "unclear",
        "widelyaccepted",
        "moral",
        "principle",
        "sort",
        "would",
        "cover",
        "case",
        "equally",
        "well",
        "instead",
        "moral",
        "test",
        "one",
        "might",
        "propose",
        "psychological",
        "test",
        "acquiescing",
        "coercer",
        "demand",
        "way",
        "harm",
        "others",
        "justified",
        "net",
        "value",
        "sufficiently",
        "great",
        "coercee",
        "roughly",
        "speaking",
        "feinberg",
        "approach",
        "taken",
        "murray",
        "dudrick",
        "well",
        "see",
        "feinberg",
        "murray",
        "dudrick",
        "point",
        "standard",
        "recognize",
        "pressure",
        "much",
        "bear",
        "without",
        "implying",
        "case",
        "literally",
        "impossible",
        "coercee",
        "make",
        "choice",
        "overborne",
        "difficulty",
        "approach",
        "let",
        "degree",
        "inducement",
        "alone",
        "justify",
        "one",
        "yielding",
        "number",
        "cause",
        "coercion",
        "create",
        "extreme",
        "inducement",
        "harm",
        "others",
        "consider",
        "done",
        "fame",
        "wealth",
        "love",
        "would",
        "reluctant",
        "accept",
        "even",
        "extraordinarily",
        "tempting",
        "offer",
        "limit",
        "one",
        "responsibility",
        "yielding",
        "magnitude",
        "inducement",
        "seems",
        "suffice",
        "explain",
        "judgment",
        "responsibility",
        "although",
        "might",
        "add",
        "condition",
        "restrict",
        "limiting",
        "effect",
        "responsibility",
        "exclusively",
        "threat",
        "offer",
        "justification",
        "lie",
        "pressure",
        "would",
        "seem",
        "one",
        "might",
        "justification",
        "yielding",
        "temptation",
        "one",
        "acquiescing",
        "mortal",
        "threat",
        "note",
        "tempting",
        "offer",
        "life",
        "death",
        "riding",
        "law",
        "sometimes",
        "required",
        "make",
        "judgment",
        "action",
        "performed",
        "necessity",
        "due",
        "exigent",
        "circumstance",
        "sometimes",
        "person",
        "harm",
        "interest",
        "others",
        "order",
        "save",
        "others",
        "death",
        "serious",
        "injury",
        "cause",
        "beyond",
        "control",
        "coercion",
        "however",
        "present",
        "complicated",
        "set",
        "issue",
        "making",
        "judgment",
        "responsibility",
        "case",
        "natural",
        "necessity",
        "coercion",
        "involves",
        "strategic",
        "dynamic",
        "interaction",
        "two",
        "agent",
        "coercer",
        "coercee",
        "standard",
        "used",
        "judge",
        "coercee",
        "responsibility",
        "acting",
        "coercion",
        "affect",
        "strategic",
        "situation",
        "principle",
        "judge",
        "coercee",
        "responsibility",
        "acquiescing",
        "coercion",
        "may",
        "affect",
        "whether",
        "rational",
        "productive",
        "wouldbe",
        "coercer",
        "attempt",
        "coercion",
        "first",
        "place",
        "comparison",
        "case",
        "bad",
        "luck",
        "natural",
        "disaster",
        "situation",
        "simpler",
        "behavior",
        "weather",
        "unlike",
        "behavior",
        "coercers",
        "unaffected",
        "incentive",
        "facing",
        "might",
        "pressured",
        "acting",
        "power",
        "permissive",
        "limiting",
        "responsibility",
        "coercees",
        "make",
        "acquiescing",
        "coercion",
        "reasonable",
        "option",
        "instead",
        "stingy",
        "limiting",
        "responsibility",
        "harm",
        "caused",
        "coercion",
        "coercees",
        "may",
        "much",
        "le",
        "likely",
        "acquiesce",
        "coercer",
        "threat",
        "wouldbe",
        "coercer",
        "know",
        "potential",
        "victim",
        "unyielding",
        "threat",
        "coercion",
        "becomes",
        "le",
        "productive",
        "reasonable",
        "mean",
        "use",
        "choosing",
        "principle",
        "justifies",
        "coercees",
        "acquiescing",
        "coercion",
        "need",
        "take",
        "account",
        "principle",
        "may",
        "alter",
        "dynamic",
        "coercer",
        "coercee",
        "way",
        "may",
        "turn",
        "affect",
        "rationality",
        "fruitfulness",
        "using",
        "coercion",
        "however",
        "case",
        "coercion",
        "may",
        "alter",
        "agent",
        "responsibility",
        "happens",
        "result",
        "coercion",
        "raise",
        "difficulty",
        "justification",
        "noted",
        "like",
        "older",
        "idea",
        "coercion",
        "count",
        "us",
        "direct",
        "physical",
        "interference",
        "among",
        "mean",
        "coercion",
        "restraint",
        "incapacitation",
        "denial",
        "essential",
        "mean",
        "achieve",
        "purpose",
        "case",
        "comparatively",
        "easy",
        "see",
        "coercion",
        "provide",
        "individual",
        "excuse",
        "thing",
        "done",
        "done",
        "coercion",
        "see",
        "anderson",
        "relying",
        "principle",
        "ought",
        "implies",
        "one",
        "something",
        "provides",
        "good",
        "excuse",
        "one",
        "responsible",
        "failing",
        "related",
        "question",
        "may",
        "arise",
        "one",
        "came",
        "incapacitated",
        "instance",
        "one",
        "fails",
        "care",
        "one",
        "child",
        "seek",
        "excused",
        "neglect",
        "one",
        "incarcerated",
        "may",
        "want",
        "know",
        "one",
        "incarcerated",
        "crediting",
        "excuse",
        "nonetheless",
        "case",
        "answer",
        "question",
        "show",
        "coercee",
        "played",
        "role",
        "incapacitation",
        "therefore",
        "held",
        "responsible",
        "thing",
        "coercer",
        "caused",
        "similarly",
        "worth",
        "noting",
        "case",
        "coercees",
        "may",
        "justified",
        "excused",
        "acquiescing",
        "threat",
        "even",
        "calmly",
        "deliberately",
        "sort",
        "justification",
        "granted",
        "coercer",
        "structured",
        "coercee",
        "situation",
        "way",
        "coercee",
        "becomes",
        "essentially",
        "redundant",
        "outcome",
        "instance",
        "bouncer",
        "able",
        "remove",
        "patron",
        "bar",
        "whether",
        "like",
        "bouncer",
        "threatens",
        "walking",
        "bar",
        "response",
        "threat",
        "may",
        "regarded",
        "voluntary",
        "carried",
        "force",
        "coercer",
        "power",
        "enforce",
        "decision",
        "regardless",
        "coercee",
        "chooses",
        "may",
        "provide",
        "coercee",
        "justification",
        "failing",
        "engage",
        "exercise",
        "futility",
        "generalizing",
        "situation",
        "somewhat",
        "stephen",
        "galoob",
        "erin",
        "sheley",
        "argue",
        "context",
        "coercer",
        "coercive",
        "control",
        "someone",
        "longterm",
        "violent",
        "abusive",
        "relationship",
        "coercer",
        "directs",
        "coercee",
        "act",
        "unlawfully",
        "criminal",
        "law",
        "allow",
        "legal",
        "defense",
        "action",
        "influence",
        "control",
        "defendant",
        "entitled",
        "coercionbased",
        "defense",
        "coercer",
        "usurped",
        "target",
        "decisional",
        "authoritythat",
        "coercer",
        "usurped",
        "control",
        "target",
        "decision",
        "galoob",
        "sheley",
        "additional",
        "wrinkle",
        "respect",
        "responsibility",
        "coercion",
        "arises",
        "case",
        "sometimes",
        "referred",
        "involving",
        "thirdparty",
        "coercion",
        "x",
        "coerces",
        "consent",
        "something",
        "z",
        "y",
        "instance",
        "patient",
        "might",
        "consent",
        "medical",
        "procedure",
        "pressure",
        "family",
        "member",
        "assuming",
        "pressure",
        "rise",
        "level",
        "qualifies",
        "coercion",
        "person",
        "might",
        "consent",
        "sex",
        "someone",
        "due",
        "threat",
        "harm",
        "third",
        "party",
        "unconnected",
        "person",
        "receives",
        "consent",
        "generally",
        "agreed",
        "coercer",
        "threat",
        "invalidate",
        "consent",
        "coercee",
        "might",
        "give",
        "subsequent",
        "action",
        "coercer",
        "thirdparty",
        "case",
        "consent",
        "given",
        "action",
        "bystander",
        "respect",
        "coercion",
        "issue",
        "may",
        "involve",
        "extent",
        "thirdparty",
        "aware",
        "aware",
        "coercee",
        "situation",
        "question",
        "action",
        "thirdparty",
        "would",
        "benefit",
        "coercee",
        "whether",
        "third",
        "party",
        "seek",
        "take",
        "advantage",
        "coercee",
        "situation",
        "case",
        "recently",
        "received",
        "focused",
        "attention",
        "philosopher",
        "joseph",
        "millum",
        "mollie",
        "gerver",
        "though",
        "issue",
        "sort",
        "identified",
        "applied",
        "ethic",
        "context",
        "international",
        "humanitarian",
        "aid",
        "time",
        "millum",
        "gerver"
    ]
}