{
    "main_text": "Uses for thought about coercion || The ethics of coercion\n3.1 The ethics of coercion\n\nIn section 3.3, we’ll consider how coercion is thought to\nimpinge upon freedom, something that raises obvious ethical\nimplications in its own right. So consideration of these sorts of\nethical issues will be postponed until there. The present section\nlooks at certain more basic questions about whether and why employing\ncoercion is necessarily or contingently wrongful, as well as whether\nits wrongfulness is intrinsic to it or derivative, and what else might\nbe wrong with it besides its effect on freedom or autonomy.\n\nThere has been considerable debate over the question of whether\nemploying coercion is necessarily or contingently wrongful. There seem\nto be three categories in which answers to this question might fall:\ncoercion is necessarily wrongful; it is prima facie or\npro tanto wrongful, though it may be justified by further\nfacts; and it is intrinsically morally neutral, though some uses of it\nmay be wrongful because of specific facts about them. Differences in\nunderstanding what is wrongful about it may account for these\ndifferent positions. Further, in cases where coercion is wrongful, we\nmight distinguish two different ways of explaining the nature of its\nwrongfulness. It might be a basic wrong, in that being coercive is\nsufficient to justify the judgment that it is wrongful; or, otherwise,\nwe can explain its wrongfulness as deriving from some component\nactivity that is wrongful, so that coercion’s wrongfulness is\nderivative, rather than\n basic.[17]\n\nOne route to finding coercion is necessarily wrongful is to define\ncoercion as constitutively involving a violation or threatened\nviolation of the coercee’s rights, or a proposal to violate\none’s normative obligations. For instance, Cheyney Ryan argues\nfor such a normative conception of coercion. (See Ryan 1980.) Tying\ncoercion closely to immoral action captures a number of intuitions we\nhave about coercion, reflecting also a lot of ordinary language.\nPeople often associate uses of coercion with injustices done to\nthemselves or others. This tie also provides a sharper division\nbetween coercive and non-coercive activity than might otherwise be\nfound: if an activity is morally unobjectionable, then it is ipso\nfacto not coercive.\n\nIf coercion is not necessarily wrongful, it might still involve moral\njudgment by being defined as requiring some prima facie or\npro tanto immoral element; this is probably the most commonly\nheld view. There have been a variety of different attempts, especially\nin the 21st century, to find and describe the immoral\nfactor in coercion that will then suffice to explain its wrongfulness\nwhen not rebutted, while avoiding the miscategorization of cases.\n\nOne suggestion holds that what is distinctive about coercion and gives\nit its moral character is that it involves an instrumental making of a\nthreat to do something wrongful. Following Niko Kolodny we might call\nthis the “inheritance” view (Kolodny 2017). For instance,\nMitchell Berman has argued that when a coercer threatens to do\nsomething, the rightness or wrongness of the use of such a threat to\ncoerce depends on whether it would be rightful or wrongful for that\nagent to carry through with that threat (Berman 2002; see also Haksar\n1976; Wertheimer 1987, ch. 12). Berman’s account of wrongful\ncoercion thus apparently relies on a principle of inference that holds\nthat if it is wrong to do A, then it is wrong to\nthreaten to do A, and vice versa. Japa\nPallikkathayil sketches a similar view, holding that if the\ncoercer’s proposal has motivational force only because it\nproposes to do something that the recipient should have a right to\nveto, then such a proposal (in at least paradigmatic cases of\ncoercion) wrongfully constrains the recipient, and wrongfully impinges\non their normative powers. Here too, the wrongfulness of the proposal\ndepends on the wrongfulness of the thing the coercer proposes to do\n(Pallikkathayil 2011). Benjamin Sachs suggests a claim that might\nbolster Berman’s position, namely, that the very making of the\nthreat has the tendency to increase the likelihood that the threatener\nwill carry out the wrongful act threatened, which he describes as\n“self-incitement” (Sachs 2013). The\n“inheritance” view is similarly defended by James Shaw\n(2012), in his account of the immorality of blackmail.\n\nThe inheritance view does not seem to correctly categorize or explain\nthe morality of all cases that are intuitively regarded as coercive.\nAt least sometimes it appears appropriate to threaten to do something\nwhich would be wrong to carry out (nuclear deterrence is sometimes\nthought to be like this; see Section 4.1 below). And sometimes it may\nbe wrongful to threaten what it would be right to carry out (some\ninstances of blackmail and extortion seem to fit this description).\nThe inheritance view also does not explain why making a conditional\nthreat may be more ethically problematic than a plain,\nunconditional\n threat.[18]\n Unfortunately, the complexities due particularly to the\nconditionality of coercive threats have been little explored to date\nby those more centrally interested in\n coercion.[19]\n\nA second suggestion holds that there’s something special about\nthe coercer’s intention vis-à-vis the coercee that makes\ncoercion frequently problematic. Grant Lamond suggests that the\nwrongness of wrongful coercion derives from the fact that it involves\na “proposal deliberately to impose a disadvantage on\nanother” (Lamond 2000, 49). “The distinctive wrong\ninvolved in [coercive conditional] threats is to propose to take an\naction because it is unwelcome to the recipient, i.e.,\nbecause he does not want it done” (Lamond 1996, 228). It is thus\nthe coercer’s intention to harm or disadvantage the coercee (or\nto propose to do so) that creates coercion’s special burden of\njustification (though Lamond does not suppose such justifications are\nparticularly difficult to find). But it isn’t clear either that\nwhen one proposes to harm another that one thereby intends to\nbring about any harm (one could be\n bluffing).[20]\n More importantly, it’s also unclear that all intentions to\nimpose disadvantages are even prima facie in need of\njustification. Unless we accept that all activities are prima\nfacie unjustified absent specific justifications, it requires an\nargument to show that disadvantaging another person is itself\nsomething that always must clear a hurdle to count as justified.\nCertainly some kinds of disadvantage require special justification,\nbut some may not. One might, for instance, intend to disadvantage\none’s social rival by arranging to have him seated between two\ndreary bores at a dinner party. While perhaps not nice, it seems to\nrequire no special moral justification for this action (or the threat\nof this action) to be ethically permissible. We might say that so long\nas one respects the rights of others (a set as rich as one likes), one\nneeds no special justification to act towards them as one likes. And\nsurely no one has the right that no one else will ever act for the\nsake of disadvantaging one. If this is the case, then the mere\nintention to disadvantage someone, perhaps conditionally, does not\nsuffice to violate her rights.\n\nStephen White takes notice of the fact that sometimes we find coercion\nproblematic even if the coercer’s threat involves something that\nit would not be wrongful for the coercer to do (White 2017). Cases of\nblackmail, both conventional and “emotional blackmail,”\noften have this form: the threatener threatens to do something they\nmay well have legal and moral right to do considered by itself, but\nsomething that would not otherwise be tied to the actions of the\nthreat’s recipient. White argues that what coercers do in making\nconditional threats is to make the coercee responsible for the\ncoercer’s execution of their threat, a responsibility that in\nmany cases they should not have to bear. This seems most clear in\ncases where the coercer threatens to do something independently\nwrongful, since they are obligated not to carry out such a threat, so\ntransferring that responsibility to the coercee is clearly wrongful.\nBut even if the act threatened, such as self-harm, is not\nindependently wrongful, forcing another to regard this outcome as\ntheir responsibility to prevent generates an unfair burden. This\nanalysis is argued to help explain some other intuitions we have\nregarding the threat of wrongful coercion to autonomy and its\ndeforming of the coercee’s choice situation.\n\nBeyond wronging the target of coercion, there are arguably other\nethical implications of coercion. While acknowledging that the concept\nof coercion is often invoked to play a role in “deontic”\njudgments, identifying interpersonal wrongs, Michael Garnett aims to\nexpand the scope of our ethical concern with coercion by\ndistinguishing this deontic role from a principally\neudaimonistic role for a concept of coercion. Garnett argues\nthat coercion is bad for the individual insofar as it amounts to\none’s will being subjected to a foreign will—that of the\ncoercer—independently of whether the coercion is wrongful\n(Garnett 2018; similar concerns with coercion are raised in Julius\n2013 and Kolodny 2017). Similarly, Elinor Mason holds that coercion is\na kind of violation of agent integrity, by virtue of being subjected\nto the domination of the coercer. She claims, “The coercer makes\na proposal to the coercee, and provides substantial reasons for the\ncoercee to do what the coercer desires. The coercer is attempting to\ndominate the coercee: the coercer is not treating the coercee as an\nagent, but as an object to be manipulated. The coercee finds the\nproposal credible, and accepts the reasons provided as substantial. As\na result of the proposal, the coercee is dominated: she is alienated\nfrom her action” (Mason 2012, 201). In a similar vein, Ambrose\nY. K. Lee argues that legal coercion used to incentivize people to do\nwhat they have otherwise good reason to do already fails to respect\npeople as “reasons-responsive agents” (Lee 2014, 853). And\nJan-Willem van der Rijt suggests that it is a criterion of coercion\nthat the coercee feels subjectively wronged by it, thus making such\nfelt wrongness part of its essential meaning (van der Rijt 2011).\n\nThere are some situations in which the coerciveness of an action\nappears obvious even though it may be difficult or impossible to\nascertain its rightfulness or wrongfulness. Thus some (e.g., Zimmerman\n2002; Anderson 2010) have argued against making judgments of coercion\ndepend on prior moral judgments. For accounts of coercion that do not\ninvoke moral judgments to define it, the ethical implications of\ncoercion may be more contextual and determined by the particular uses\nto which it is put. If one holds the common view that coercion is\nrightly employed for purposes such as self-defense, defense of\ninnocent others, and the enforcement of just laws, such views may\nencourage one to evaluate its use based on factors such as why and how\nit is used, who uses it, against whom, in what circumstances, and what\nother means were possible instead. Coercion is no ordinary means, but\nif it can be defined in non-moralized terms, it’s unclear why we\nshould suppose that it is intrinsically (even prima facie or\npro tanto) immoral, instead of simply noting that it is a\nvery potent means, prone to abuse, and something that deserves ethical\nscrutiny whenever it is used.\n",
    "section_title": "3.1 The ethics of coercion",
    "entry_title": "Coercion",
    "hierarchy_title": "Coercion || Uses for thought about coercion || The ethics of coercion",
    "tokenized_text": [
        "us",
        "thought",
        "coercion",
        "ethic",
        "coercion",
        "ethic",
        "coercion",
        "section",
        "consider",
        "coercion",
        "thought",
        "impinge",
        "upon",
        "freedom",
        "something",
        "raise",
        "obvious",
        "ethical",
        "implication",
        "right",
        "consideration",
        "sort",
        "ethical",
        "issue",
        "postponed",
        "present",
        "section",
        "look",
        "certain",
        "basic",
        "question",
        "whether",
        "employing",
        "coercion",
        "necessarily",
        "contingently",
        "wrongful",
        "well",
        "whether",
        "wrongfulness",
        "intrinsic",
        "derivative",
        "else",
        "might",
        "wrong",
        "besides",
        "effect",
        "freedom",
        "autonomy",
        "considerable",
        "debate",
        "question",
        "whether",
        "employing",
        "coercion",
        "necessarily",
        "contingently",
        "wrongful",
        "seem",
        "three",
        "category",
        "answer",
        "question",
        "might",
        "fall",
        "coercion",
        "necessarily",
        "wrongful",
        "prima",
        "facie",
        "pro",
        "tanto",
        "wrongful",
        "though",
        "may",
        "justified",
        "fact",
        "intrinsically",
        "morally",
        "neutral",
        "though",
        "us",
        "may",
        "wrongful",
        "specific",
        "fact",
        "difference",
        "understanding",
        "wrongful",
        "may",
        "account",
        "different",
        "position",
        "case",
        "coercion",
        "wrongful",
        "might",
        "distinguish",
        "two",
        "different",
        "way",
        "explaining",
        "nature",
        "wrongfulness",
        "might",
        "basic",
        "wrong",
        "coercive",
        "sufficient",
        "justify",
        "judgment",
        "wrongful",
        "otherwise",
        "explain",
        "wrongfulness",
        "deriving",
        "component",
        "activity",
        "wrongful",
        "coercion",
        "wrongfulness",
        "derivative",
        "rather",
        "basic",
        "one",
        "route",
        "finding",
        "coercion",
        "necessarily",
        "wrongful",
        "define",
        "coercion",
        "constitutively",
        "involving",
        "violation",
        "threatened",
        "violation",
        "coercee",
        "right",
        "proposal",
        "violate",
        "one",
        "normative",
        "obligation",
        "instance",
        "cheyney",
        "ryan",
        "argues",
        "normative",
        "conception",
        "coercion",
        "see",
        "ryan",
        "tying",
        "coercion",
        "closely",
        "immoral",
        "action",
        "capture",
        "number",
        "intuition",
        "coercion",
        "reflecting",
        "also",
        "lot",
        "ordinary",
        "language",
        "people",
        "often",
        "associate",
        "us",
        "coercion",
        "injustice",
        "done",
        "others",
        "tie",
        "also",
        "provides",
        "sharper",
        "division",
        "coercive",
        "noncoercive",
        "activity",
        "might",
        "otherwise",
        "found",
        "activity",
        "morally",
        "unobjectionable",
        "ipso",
        "facto",
        "coercive",
        "coercion",
        "necessarily",
        "wrongful",
        "might",
        "still",
        "involve",
        "moral",
        "judgment",
        "defined",
        "requiring",
        "prima",
        "facie",
        "pro",
        "tanto",
        "immoral",
        "element",
        "probably",
        "commonly",
        "held",
        "view",
        "variety",
        "different",
        "attempt",
        "especially",
        "st",
        "century",
        "find",
        "describe",
        "immoral",
        "factor",
        "coercion",
        "suffice",
        "explain",
        "wrongfulness",
        "rebutted",
        "avoiding",
        "miscategorization",
        "case",
        "one",
        "suggestion",
        "hold",
        "distinctive",
        "coercion",
        "give",
        "moral",
        "character",
        "involves",
        "instrumental",
        "making",
        "threat",
        "something",
        "wrongful",
        "following",
        "niko",
        "kolodny",
        "might",
        "call",
        "inheritance",
        "view",
        "kolodny",
        "instance",
        "mitchell",
        "berman",
        "argued",
        "coercer",
        "threatens",
        "something",
        "rightness",
        "wrongness",
        "use",
        "threat",
        "coerce",
        "depends",
        "whether",
        "would",
        "rightful",
        "wrongful",
        "agent",
        "carry",
        "threat",
        "berman",
        "see",
        "also",
        "haksar",
        "wertheimer",
        "ch",
        "berman",
        "account",
        "wrongful",
        "coercion",
        "thus",
        "apparently",
        "relies",
        "principle",
        "inference",
        "hold",
        "wrong",
        "wrong",
        "threaten",
        "vice",
        "versa",
        "japa",
        "pallikkathayil",
        "sketch",
        "similar",
        "view",
        "holding",
        "coercer",
        "proposal",
        "motivational",
        "force",
        "proposes",
        "something",
        "recipient",
        "right",
        "veto",
        "proposal",
        "least",
        "paradigmatic",
        "case",
        "coercion",
        "wrongfully",
        "constrains",
        "recipient",
        "wrongfully",
        "impinges",
        "normative",
        "power",
        "wrongfulness",
        "proposal",
        "depends",
        "wrongfulness",
        "thing",
        "coercer",
        "proposes",
        "pallikkathayil",
        "benjamin",
        "sachs",
        "suggests",
        "claim",
        "might",
        "bolster",
        "berman",
        "position",
        "namely",
        "making",
        "threat",
        "tendency",
        "increase",
        "likelihood",
        "threatener",
        "carry",
        "wrongful",
        "act",
        "threatened",
        "describes",
        "selfincitement",
        "sachs",
        "inheritance",
        "view",
        "similarly",
        "defended",
        "james",
        "shaw",
        "account",
        "immorality",
        "blackmail",
        "inheritance",
        "view",
        "seem",
        "correctly",
        "categorize",
        "explain",
        "morality",
        "case",
        "intuitively",
        "regarded",
        "coercive",
        "least",
        "sometimes",
        "appears",
        "appropriate",
        "threaten",
        "something",
        "would",
        "wrong",
        "carry",
        "nuclear",
        "deterrence",
        "sometimes",
        "thought",
        "like",
        "see",
        "section",
        "sometimes",
        "may",
        "wrongful",
        "threaten",
        "would",
        "right",
        "carry",
        "instance",
        "blackmail",
        "extortion",
        "seem",
        "fit",
        "description",
        "inheritance",
        "view",
        "also",
        "explain",
        "making",
        "conditional",
        "threat",
        "may",
        "ethically",
        "problematic",
        "plain",
        "unconditional",
        "threat",
        "unfortunately",
        "complexity",
        "due",
        "particularly",
        "conditionality",
        "coercive",
        "threat",
        "little",
        "explored",
        "date",
        "centrally",
        "interested",
        "coercion",
        "second",
        "suggestion",
        "hold",
        "something",
        "special",
        "coercer",
        "intention",
        "visàvis",
        "coercee",
        "make",
        "coercion",
        "frequently",
        "problematic",
        "grant",
        "lamond",
        "suggests",
        "wrongness",
        "wrongful",
        "coercion",
        "derives",
        "fact",
        "involves",
        "proposal",
        "deliberately",
        "impose",
        "disadvantage",
        "another",
        "lamond",
        "distinctive",
        "wrong",
        "involved",
        "coercive",
        "conditional",
        "threat",
        "propose",
        "take",
        "action",
        "unwelcome",
        "recipient",
        "ie",
        "want",
        "done",
        "lamond",
        "thus",
        "coercer",
        "intention",
        "harm",
        "disadvantage",
        "coercee",
        "propose",
        "creates",
        "coercion",
        "special",
        "burden",
        "justification",
        "though",
        "lamond",
        "suppose",
        "justification",
        "particularly",
        "difficult",
        "find",
        "clear",
        "either",
        "one",
        "proposes",
        "harm",
        "another",
        "one",
        "thereby",
        "intends",
        "bring",
        "harm",
        "one",
        "could",
        "bluffing",
        "importantly",
        "also",
        "unclear",
        "intention",
        "impose",
        "disadvantage",
        "even",
        "prima",
        "facie",
        "need",
        "justification",
        "unless",
        "accept",
        "activity",
        "prima",
        "facie",
        "unjustified",
        "absent",
        "specific",
        "justification",
        "requires",
        "argument",
        "show",
        "disadvantaging",
        "another",
        "person",
        "something",
        "always",
        "must",
        "clear",
        "hurdle",
        "count",
        "justified",
        "certainly",
        "kind",
        "disadvantage",
        "require",
        "special",
        "justification",
        "may",
        "one",
        "might",
        "instance",
        "intend",
        "disadvantage",
        "one",
        "social",
        "rival",
        "arranging",
        "seated",
        "two",
        "dreary",
        "bore",
        "dinner",
        "party",
        "perhaps",
        "nice",
        "seems",
        "require",
        "special",
        "moral",
        "justification",
        "action",
        "threat",
        "action",
        "ethically",
        "permissible",
        "might",
        "say",
        "long",
        "one",
        "respect",
        "right",
        "others",
        "set",
        "rich",
        "one",
        "like",
        "one",
        "need",
        "special",
        "justification",
        "act",
        "towards",
        "one",
        "like",
        "surely",
        "one",
        "right",
        "one",
        "else",
        "ever",
        "act",
        "sake",
        "disadvantaging",
        "one",
        "case",
        "mere",
        "intention",
        "disadvantage",
        "someone",
        "perhaps",
        "conditionally",
        "suffice",
        "violate",
        "right",
        "stephen",
        "white",
        "take",
        "notice",
        "fact",
        "sometimes",
        "find",
        "coercion",
        "problematic",
        "even",
        "coercer",
        "threat",
        "involves",
        "something",
        "would",
        "wrongful",
        "coercer",
        "white",
        "case",
        "blackmail",
        "conventional",
        "emotional",
        "blackmail",
        "often",
        "form",
        "threatener",
        "threatens",
        "something",
        "may",
        "well",
        "legal",
        "moral",
        "right",
        "considered",
        "something",
        "would",
        "otherwise",
        "tied",
        "action",
        "threat",
        "recipient",
        "white",
        "argues",
        "coercers",
        "making",
        "conditional",
        "threat",
        "make",
        "coercee",
        "responsible",
        "coercer",
        "execution",
        "threat",
        "responsibility",
        "many",
        "case",
        "bear",
        "seems",
        "clear",
        "case",
        "coercer",
        "threatens",
        "something",
        "independently",
        "wrongful",
        "since",
        "obligated",
        "carry",
        "threat",
        "transferring",
        "responsibility",
        "coercee",
        "clearly",
        "wrongful",
        "even",
        "act",
        "threatened",
        "selfharm",
        "independently",
        "wrongful",
        "forcing",
        "another",
        "regard",
        "outcome",
        "responsibility",
        "prevent",
        "generates",
        "unfair",
        "burden",
        "analysis",
        "argued",
        "help",
        "explain",
        "intuition",
        "regarding",
        "threat",
        "wrongful",
        "coercion",
        "autonomy",
        "deforming",
        "coercee",
        "choice",
        "situation",
        "beyond",
        "wronging",
        "target",
        "coercion",
        "arguably",
        "ethical",
        "implication",
        "coercion",
        "acknowledging",
        "concept",
        "coercion",
        "often",
        "invoked",
        "play",
        "role",
        "deontic",
        "judgment",
        "identifying",
        "interpersonal",
        "wrong",
        "michael",
        "garnett",
        "aim",
        "expand",
        "scope",
        "ethical",
        "concern",
        "coercion",
        "distinguishing",
        "deontic",
        "role",
        "principally",
        "eudaimonistic",
        "role",
        "concept",
        "coercion",
        "garnett",
        "argues",
        "coercion",
        "bad",
        "individual",
        "insofar",
        "amount",
        "one",
        "subjected",
        "foreign",
        "willthat",
        "coercerindependently",
        "whether",
        "coercion",
        "wrongful",
        "garnett",
        "similar",
        "concern",
        "coercion",
        "raised",
        "julius",
        "kolodny",
        "similarly",
        "elinor",
        "mason",
        "hold",
        "coercion",
        "kind",
        "violation",
        "agent",
        "integrity",
        "virtue",
        "subjected",
        "domination",
        "coercer",
        "claim",
        "coercer",
        "make",
        "proposal",
        "coercee",
        "provides",
        "substantial",
        "reason",
        "coercee",
        "coercer",
        "desire",
        "coercer",
        "attempting",
        "dominate",
        "coercee",
        "coercer",
        "treating",
        "coercee",
        "agent",
        "object",
        "manipulated",
        "coercee",
        "find",
        "proposal",
        "credible",
        "accepts",
        "reason",
        "provided",
        "substantial",
        "result",
        "proposal",
        "coercee",
        "dominated",
        "alienated",
        "action",
        "mason",
        "similar",
        "vein",
        "ambrose",
        "y",
        "k",
        "lee",
        "argues",
        "legal",
        "coercion",
        "used",
        "incentivize",
        "people",
        "otherwise",
        "good",
        "reason",
        "already",
        "fails",
        "respect",
        "people",
        "reasonsresponsive",
        "agent",
        "lee",
        "janwillem",
        "van",
        "der",
        "rijt",
        "suggests",
        "criterion",
        "coercion",
        "coercee",
        "feel",
        "subjectively",
        "wronged",
        "thus",
        "making",
        "felt",
        "wrongness",
        "part",
        "essential",
        "meaning",
        "van",
        "der",
        "rijt",
        "situation",
        "coerciveness",
        "action",
        "appears",
        "obvious",
        "even",
        "though",
        "may",
        "difficult",
        "impossible",
        "ascertain",
        "rightfulness",
        "wrongfulness",
        "thus",
        "eg",
        "zimmerman",
        "anderson",
        "argued",
        "making",
        "judgment",
        "coercion",
        "depend",
        "prior",
        "moral",
        "judgment",
        "account",
        "coercion",
        "invoke",
        "moral",
        "judgment",
        "define",
        "ethical",
        "implication",
        "coercion",
        "may",
        "contextual",
        "determined",
        "particular",
        "us",
        "put",
        "one",
        "hold",
        "common",
        "view",
        "coercion",
        "rightly",
        "employed",
        "purpose",
        "selfdefense",
        "defense",
        "innocent",
        "others",
        "enforcement",
        "law",
        "view",
        "may",
        "encourage",
        "one",
        "evaluate",
        "use",
        "based",
        "factor",
        "used",
        "us",
        "circumstance",
        "mean",
        "possible",
        "instead",
        "coercion",
        "ordinary",
        "mean",
        "defined",
        "nonmoralized",
        "term",
        "unclear",
        "suppose",
        "intrinsically",
        "even",
        "prima",
        "facie",
        "pro",
        "tanto",
        "immoral",
        "instead",
        "simply",
        "noting",
        "potent",
        "mean",
        "prone",
        "abuse",
        "something",
        "deserves",
        "ethical",
        "scrutiny",
        "whenever",
        "used"
    ]
}