{
    "main_text": "Contemporary philosophical accounts of coercion || Non-baseline approaches\n2.5 Non-baseline approaches\n\nThe need to establish a baseline is generated by a need to distinguish\nthreats from offers as a central criterion of coercion. Threats and\noffers are both proposals put to the coercee, aiming to influence her\nbehavior, and distinguished with respect to how they affect what is\nnormal for the coercee. There are two main ways in which some\ntheorists have diverged from the baseline-style account that Nozick\nproposed, each of these ways admitting of both moralized and\nnon-moralized versions. Instead of distinguishing threats and offers\nfrom what’s normal for the agent, we might instead see threats\nas applying a special sort or degree of pressure on the\ncoercee’s will. Or, we might move away from focusing on the\ncoercee’s will as the locus of coercion, and instead look at the\npowers, intentions, and activities of coercers. A\n“coercer-focused” account seeks to determine what is\nspecial about coercive actions, rather than trying to distinguish\ncoerced from non-coerced actions.\n\nOne way to identify coercive threats is by looking for a distinctive\nway that pressure can affect a coercee’s will. Sometimes, a use\nof threats conditioned on the agent’s activities may affect not\njust the coercee’s choice but also her ability to choose at all.\nUnder severe psychological pressure, faced with grave dangers or\nsignificant evils, people sometimes react in ways that diverge from\n(or at least do not follow from) their more rational, considered\ndesires. Harry Frankfurt seems to make this effect a requirement for\nsomething to count as coercive, saying “A coercive threat\narouses in its victim a desire — i.e. to avoid the penalty\n— so powerful that it will move him to perform the required\naction whether he wants to perform it or considers that it would be\nreasonable for him to do so” (Frankfurt 1988 [1973], 78).\nFrankfurt has several reasons for insisting on this strong\nrequirement, but perhaps most central is his view that coercion must\nhave such an overbearing effect if it is to override the\ncoercee’s moral responsibility for acting (Frankfurt 1988\n[1973], 75–76). However, if one treats such overburdening as a\nsufficient condition for coercion, then this again lends support to\nthe view that some offers — irresistible ones — will also\nturn out to be coercive. Though the fact that Q’s will was\noverborne would seem compatible with the claim that Q has been\ncoerced, few besides Frankfurt have taken such overburdening to be a\nnecessary condition for coercion to take\n place.[14]\n\nShort of generating psychological compulsion, one might hold that\ncoercion involves the imposition of an option which no one could\nreasonably refuse to take. Several have tried to characterize such\nsituations in a way that neither reduces to a form of psychological\ndeterminism, nor implicitly invokes baseline comparisons. For\ninstance, Mark Fowler argues that “coercion generally involves\nthe prima facie immoral imposition of practical imperatives by use of\nthreats” (Fowler 1982, 330). While this approach must be\nsupplemented with further details (including, perhaps, a resort to a\nbaseline to distinguish threats from offers), its principal\ncontribution is its reliance on “practical imperatives.”\nFowler suggests that we need to see coercion in relation to our\nunderstanding of how practical reason works. When we say that the\ncoercer leaves the coercee “no choice,” we don’t\nnecessarily mean that the coercee is literally unable to choose, but\nthat for the coercee to choose otherwise than the coercer demands\nwould be contrary to practical reason (Fowler 1982, 331).\n\nThe normative approach Fowler favors links this criterion to a Kantian\naccount of autonomy, and suggests that the test of a coercive threat\nis that it violates the coercee’s autonomy. This would appear to\nproduce a mismatch between our pre-theoretic understanding of coercion\nand the cases that will satisfy Fowler’s conditions — for\ninstance, giving someone a false “warning” arguably\nviolates her autonomy, but this seems different than coercion. Yet if\nthere is a way to make sense of the notion of imposing a practical\nimperative, this seems a useful element of an account of coercion.\n\nJoel Feinberg identifies coercion with a special degree or kind of\npressure imposed on the coercee’s will, but avoids connecting\npressure to a normative judgment. His account is tailored to cases\nwhere the coercer seeks to obtain a token of “consent” to\nsome harmful or dangerous activity from the coercee, but it could\neasily be generalized to cover other sorts of coerced activities. His\naccount starts by offering a helpful description of the role of the\ncoercer, stipulating that the coercer:\n\nthreatens to “cause or fail to prevent some consequences that\n[the coercee] finds unwelcome”; and\n\n\n“gives some evidence of the credibility of the threat”;\nand\n\n“has actively intervened in [the coercee’s]\noption-network, to acquire control of the relevant option-switches; in\nparticular he can close tight the conjunctive option that consists of\n[the coercee’s] noncompliance with the demand and [the\ncoercee’s] avoidance of the threatened unwelcome\nconsequences” (Feinberg 1986, 198).\n [15]\n\n\nThese stipulations are useful supplements to the Nozickian-style\naccount, in that they require the coercer to demonstrate his power,\nand to actively use it to create the situation facing the coercee, in\nparticular by preventing the coercee from finding ways to avoid the\nforced\n choice.[16]\n\nThe bulk of Feinberg’s account focuses instead, however, on how\ncoercive proposals can generate pressure on the coercee’s will\nthat, if not irresistible, is sufficiently strong to make the\ncoercee’s choice unfree. This account avoids a reliance on\nbaselines because it makes the coercee’s judgment of the\nfrightfulness, unwelcomeness and pressure involved in the threat the\nkey criterion for determining whether it coerces. Feinberg goes on to\ngive a detailed discussion of how one might compare the pressures\ninvolved when coercers issue various sorts of demands coupled with\nvarious sorts of threats, suggesting ways of calculating the\n“total coercive burden” a threat creates for a\ncoercee.\n\nFeinberg’s account generates a number of apparently troubling\nresults. For one thing, it will allow that extremely tempting offers\nare coercive if they create pressure similar to that associated with\ncoercive threats; the only thing that seems to count is how much\npressure one feels to act. It will also treat people with non-standard\npreferences or fears (say, a dire fear of being patted on the back) as\nhaving been “coerced” by threats to do what are,\nobjectively speaking, trivial things (Feinberg 1986, 212).\n\nA different way of understanding coercion moves away from focusing on\nits impact on the coercee. Some approaches, like McGregor’s\nnoted above, look for coercion in the coercer’s taking advantage\nof certain sorts of power differentials between coercer and coercee.\nOthers identify coercion with the making of threats, but seek to\ndistinguish threats from offers in ways that avoid reference to a\nbaseline, and instead look at the qualities of the coercer and his\nactivities. Mitchell Berman, following Vinit Haksar, has argued for an\napproach the crux of which holds that immoral coercive threats propose\nto do something that would be immoral to do if carried out. (See\nBerman 2002; Haksar 1976.) (Berman does not, it appears, offer a\ndefinition of coercion per se, but only of wrongful\ncoercion.) Grant Lamond focuses instead on the coercer’s\nintentional attempt to use pressure to alter the activities of the\ncoercee, where that pressure comes from an intention to deliberately\nset back the interests of the coercee. (See Lamond 1996 and 2000.)\nBecause McGregor’s, Berman’s and Lamond’s ways of\ncapturing coercion attend to the coercer’s actions and\nintentions, they avoid the need to distinguish coercive from other\nproposals based on specific effects on the coercee. (For that reason,\nthey could also reject the “success” condition on coercion\nfound in Nozick’s and most subsequent accounts of coercion.)\n\nScott Anderson, drawing upon some remarks of J. R. Lucas (1966), takes\na different tack, and associates coercion with the use of an ability\nsome agents have to enforce their decisions about what another will or\nwill not do, “where the sense of enforceability here is\nexemplified by the use of force, violence and the threats thereof to\nconstrain, disable, harm or undermine an agent’s ability to\nact” (Anderson 2010, 6). Anderson thus rejects Nozick’s\ninnovations in this area (see above Section 2.1) by refocusing the\nanalysis on the powers and acts of the coercer (rather than on the\nwill or actions of the coercee), by allowing that direct force (and\nnot just threats) can be used to coerce, and denying that coercion is\ncoextensive with particular acts taken or avoided by the coercee.\nAnderson requires that the coercer engage in activity either to create\na power differential between himself and the coercee (say, by taking\nup arms), or else draw upon some existing differential between agents\nof the sorts to which coercer and coercee belong (say, policeman and\ncitizen, respectively). This “enforcement approach”\nsuggests that uses of these sorts of powers are distinctive, and thus\ncan be used to pick out long-standing threats (such as the criminal\nlaw) as coercive, even if it is difficult to identify specific actions\nthat they alter.\n",
    "section_title": "2.5 Non-baseline approaches",
    "entry_title": "Coercion",
    "hierarchy_title": "Coercion || Contemporary philosophical accounts of coercion || Non-baseline approaches",
    "tokenized_text": [
        "contemporary",
        "philosophical",
        "account",
        "coercion",
        "nonbaseline",
        "approach",
        "nonbaseline",
        "approach",
        "need",
        "establish",
        "baseline",
        "generated",
        "need",
        "distinguish",
        "threat",
        "offer",
        "central",
        "criterion",
        "coercion",
        "threat",
        "offer",
        "proposal",
        "put",
        "coercee",
        "aiming",
        "influence",
        "behavior",
        "distinguished",
        "respect",
        "affect",
        "normal",
        "coercee",
        "two",
        "main",
        "way",
        "theorist",
        "diverged",
        "baselinestyle",
        "account",
        "nozick",
        "proposed",
        "way",
        "admitting",
        "moralized",
        "nonmoralized",
        "version",
        "instead",
        "distinguishing",
        "threat",
        "offer",
        "normal",
        "agent",
        "might",
        "instead",
        "see",
        "threat",
        "applying",
        "special",
        "sort",
        "degree",
        "pressure",
        "coercee",
        "might",
        "move",
        "away",
        "focusing",
        "coercee",
        "locus",
        "coercion",
        "instead",
        "look",
        "power",
        "intention",
        "activity",
        "coercers",
        "coercerfocused",
        "account",
        "seek",
        "determine",
        "special",
        "coercive",
        "action",
        "rather",
        "trying",
        "distinguish",
        "coerced",
        "noncoerced",
        "action",
        "one",
        "way",
        "identify",
        "coercive",
        "threat",
        "looking",
        "distinctive",
        "way",
        "pressure",
        "affect",
        "coercee",
        "sometimes",
        "use",
        "threat",
        "conditioned",
        "agent",
        "activity",
        "may",
        "affect",
        "coercee",
        "choice",
        "also",
        "ability",
        "choose",
        "severe",
        "psychological",
        "pressure",
        "faced",
        "grave",
        "danger",
        "significant",
        "evil",
        "people",
        "sometimes",
        "react",
        "way",
        "diverge",
        "least",
        "follow",
        "rational",
        "considered",
        "desire",
        "harry",
        "frankfurt",
        "seems",
        "make",
        "effect",
        "requirement",
        "something",
        "count",
        "coercive",
        "saying",
        "coercive",
        "threat",
        "arouses",
        "victim",
        "desire",
        "ie",
        "avoid",
        "penalty",
        "powerful",
        "move",
        "perform",
        "required",
        "action",
        "whether",
        "want",
        "perform",
        "considers",
        "would",
        "reasonable",
        "frankfurt",
        "frankfurt",
        "several",
        "reason",
        "insisting",
        "strong",
        "requirement",
        "perhaps",
        "central",
        "view",
        "coercion",
        "must",
        "overbearing",
        "effect",
        "override",
        "coercee",
        "moral",
        "responsibility",
        "acting",
        "frankfurt",
        "however",
        "one",
        "treat",
        "overburdening",
        "sufficient",
        "condition",
        "coercion",
        "lends",
        "support",
        "view",
        "offer",
        "irresistible",
        "one",
        "also",
        "turn",
        "coercive",
        "though",
        "fact",
        "q",
        "overborne",
        "would",
        "seem",
        "compatible",
        "claim",
        "q",
        "coerced",
        "besides",
        "frankfurt",
        "taken",
        "overburdening",
        "necessary",
        "condition",
        "coercion",
        "take",
        "place",
        "short",
        "generating",
        "psychological",
        "compulsion",
        "one",
        "might",
        "hold",
        "coercion",
        "involves",
        "imposition",
        "option",
        "one",
        "could",
        "reasonably",
        "refuse",
        "take",
        "several",
        "tried",
        "characterize",
        "situation",
        "way",
        "neither",
        "reduces",
        "form",
        "psychological",
        "determinism",
        "implicitly",
        "invokes",
        "baseline",
        "comparison",
        "instance",
        "mark",
        "fowler",
        "argues",
        "coercion",
        "generally",
        "involves",
        "prima",
        "facie",
        "immoral",
        "imposition",
        "practical",
        "imperative",
        "use",
        "threat",
        "fowler",
        "approach",
        "must",
        "supplemented",
        "detail",
        "including",
        "perhaps",
        "resort",
        "baseline",
        "distinguish",
        "threat",
        "offer",
        "principal",
        "contribution",
        "reliance",
        "practical",
        "imperatives",
        "fowler",
        "suggests",
        "need",
        "see",
        "coercion",
        "relation",
        "understanding",
        "practical",
        "reason",
        "work",
        "say",
        "coercer",
        "leaf",
        "coercee",
        "choice",
        "necessarily",
        "mean",
        "coercee",
        "literally",
        "unable",
        "choose",
        "coercee",
        "choose",
        "otherwise",
        "coercer",
        "demand",
        "would",
        "contrary",
        "practical",
        "reason",
        "fowler",
        "normative",
        "approach",
        "fowler",
        "favor",
        "link",
        "criterion",
        "kantian",
        "account",
        "autonomy",
        "suggests",
        "test",
        "coercive",
        "threat",
        "violates",
        "coercee",
        "autonomy",
        "would",
        "appear",
        "produce",
        "mismatch",
        "pretheoretic",
        "understanding",
        "coercion",
        "case",
        "satisfy",
        "fowler",
        "condition",
        "instance",
        "giving",
        "someone",
        "false",
        "warning",
        "arguably",
        "violates",
        "autonomy",
        "seems",
        "different",
        "coercion",
        "yet",
        "way",
        "make",
        "sense",
        "notion",
        "imposing",
        "practical",
        "imperative",
        "seems",
        "useful",
        "element",
        "account",
        "coercion",
        "joel",
        "feinberg",
        "identifies",
        "coercion",
        "special",
        "degree",
        "kind",
        "pressure",
        "imposed",
        "coercee",
        "avoids",
        "connecting",
        "pressure",
        "normative",
        "judgment",
        "account",
        "tailored",
        "case",
        "coercer",
        "seek",
        "obtain",
        "token",
        "consent",
        "harmful",
        "dangerous",
        "activity",
        "coercee",
        "could",
        "easily",
        "generalized",
        "cover",
        "sort",
        "coerced",
        "activity",
        "account",
        "start",
        "offering",
        "helpful",
        "description",
        "role",
        "coercer",
        "stipulating",
        "coercer",
        "threatens",
        "cause",
        "fail",
        "prevent",
        "consequence",
        "coercee",
        "find",
        "unwelcome",
        "give",
        "evidence",
        "credibility",
        "threat",
        "actively",
        "intervened",
        "coercee",
        "optionnetwork",
        "acquire",
        "control",
        "relevant",
        "optionswitches",
        "particular",
        "close",
        "tight",
        "conjunctive",
        "option",
        "consists",
        "coercee",
        "noncompliance",
        "demand",
        "coercee",
        "avoidance",
        "threatened",
        "unwelcome",
        "consequence",
        "feinberg",
        "stipulation",
        "useful",
        "supplement",
        "nozickianstyle",
        "account",
        "require",
        "coercer",
        "demonstrate",
        "power",
        "actively",
        "use",
        "create",
        "situation",
        "facing",
        "coercee",
        "particular",
        "preventing",
        "coercee",
        "finding",
        "way",
        "avoid",
        "forced",
        "choice",
        "bulk",
        "feinberg",
        "account",
        "focus",
        "instead",
        "however",
        "coercive",
        "proposal",
        "generate",
        "pressure",
        "coercee",
        "irresistible",
        "sufficiently",
        "strong",
        "make",
        "coercee",
        "choice",
        "unfree",
        "account",
        "avoids",
        "reliance",
        "baseline",
        "make",
        "coercee",
        "judgment",
        "frightfulness",
        "unwelcomeness",
        "pressure",
        "involved",
        "threat",
        "key",
        "criterion",
        "determining",
        "whether",
        "coerces",
        "feinberg",
        "go",
        "give",
        "detailed",
        "discussion",
        "one",
        "might",
        "compare",
        "pressure",
        "involved",
        "coercers",
        "issue",
        "various",
        "sort",
        "demand",
        "coupled",
        "various",
        "sort",
        "threat",
        "suggesting",
        "way",
        "calculating",
        "total",
        "coercive",
        "burden",
        "threat",
        "creates",
        "coercee",
        "feinberg",
        "account",
        "generates",
        "number",
        "apparently",
        "troubling",
        "result",
        "one",
        "thing",
        "allow",
        "extremely",
        "tempting",
        "offer",
        "coercive",
        "create",
        "pressure",
        "similar",
        "associated",
        "coercive",
        "threat",
        "thing",
        "seems",
        "count",
        "much",
        "pressure",
        "one",
        "feel",
        "act",
        "also",
        "treat",
        "people",
        "nonstandard",
        "preference",
        "fear",
        "say",
        "dire",
        "fear",
        "patted",
        "back",
        "coerced",
        "threat",
        "objectively",
        "speaking",
        "trivial",
        "thing",
        "feinberg",
        "different",
        "way",
        "understanding",
        "coercion",
        "move",
        "away",
        "focusing",
        "impact",
        "coercee",
        "approach",
        "like",
        "mcgregor",
        "noted",
        "look",
        "coercion",
        "coercer",
        "taking",
        "advantage",
        "certain",
        "sort",
        "power",
        "differential",
        "coercer",
        "coercee",
        "others",
        "identify",
        "coercion",
        "making",
        "threat",
        "seek",
        "distinguish",
        "threat",
        "offer",
        "way",
        "avoid",
        "reference",
        "baseline",
        "instead",
        "look",
        "quality",
        "coercer",
        "activity",
        "mitchell",
        "berman",
        "following",
        "vinit",
        "haksar",
        "argued",
        "approach",
        "crux",
        "hold",
        "immoral",
        "coercive",
        "threat",
        "propose",
        "something",
        "would",
        "immoral",
        "carried",
        "see",
        "berman",
        "haksar",
        "berman",
        "appears",
        "offer",
        "definition",
        "coercion",
        "per",
        "se",
        "wrongful",
        "coercion",
        "grant",
        "lamond",
        "focus",
        "instead",
        "coercer",
        "intentional",
        "attempt",
        "use",
        "pressure",
        "alter",
        "activity",
        "coercee",
        "pressure",
        "come",
        "intention",
        "deliberately",
        "set",
        "back",
        "interest",
        "coercee",
        "see",
        "lamond",
        "mcgregor",
        "berman",
        "lamond",
        "way",
        "capturing",
        "coercion",
        "attend",
        "coercer",
        "action",
        "intention",
        "avoid",
        "need",
        "distinguish",
        "coercive",
        "proposal",
        "based",
        "specific",
        "effect",
        "coercee",
        "reason",
        "could",
        "also",
        "reject",
        "success",
        "condition",
        "coercion",
        "found",
        "nozick",
        "subsequent",
        "account",
        "coercion",
        "scott",
        "anderson",
        "drawing",
        "upon",
        "remark",
        "j",
        "r",
        "lucas",
        "take",
        "different",
        "tack",
        "associate",
        "coercion",
        "use",
        "ability",
        "agent",
        "enforce",
        "decision",
        "another",
        "sense",
        "enforceability",
        "exemplified",
        "use",
        "force",
        "violence",
        "threat",
        "thereof",
        "constrain",
        "disable",
        "harm",
        "undermine",
        "agent",
        "ability",
        "act",
        "anderson",
        "anderson",
        "thus",
        "reject",
        "nozick",
        "innovation",
        "area",
        "see",
        "section",
        "refocusing",
        "analysis",
        "power",
        "act",
        "coercer",
        "rather",
        "action",
        "coercee",
        "allowing",
        "direct",
        "force",
        "threat",
        "used",
        "coerce",
        "denying",
        "coercion",
        "coextensive",
        "particular",
        "act",
        "taken",
        "avoided",
        "coercee",
        "anderson",
        "requires",
        "coercer",
        "engage",
        "activity",
        "either",
        "create",
        "power",
        "differential",
        "coercee",
        "say",
        "taking",
        "arm",
        "else",
        "draw",
        "upon",
        "existing",
        "differential",
        "agent",
        "sort",
        "coercer",
        "coercee",
        "belong",
        "say",
        "policeman",
        "citizen",
        "respectively",
        "enforcement",
        "approach",
        "suggests",
        "us",
        "sort",
        "power",
        "distinctive",
        "thus",
        "used",
        "pick",
        "longstanding",
        "threat",
        "criminal",
        "law",
        "coercive",
        "even",
        "difficult",
        "identify",
        "specific",
        "action",
        "alter"
    ]
}