{
    "main_text": "Group-Based Accounts of Moral Status || Humanity as the Ground of Full Moral Status\n5.2 Humanity as the Ground of Full Moral Status\n\nTo explain the moral significance of species co-membership, some\nphilosophers embrace a strongly anthropocentric view, which denies\nthat we can step outside of our humanity to assess the moral status of\nthe world’s inhabitants. On this view, the concept of a human\nbeing is prior to, and inseparable from, that of a\n person.[12]\n As Stephen Mulhall (2002) argues:\n\n\n[O]ur concept of a person is an outgrowth or aspect of our concept of\na human being; and that concept is not merely biological but rather a\ncrystallisation of everything we have made of our distinctive species\nnature. To see another as a human being is to see her as a\nfellow-creature—another being whose embodiment embeds her in a\ndistinctive form of common life with language and culture, and whose\nexistence constitutes a particular kind of claim on us. (7)\n\n\nThis view, which, following Williams (2006), we will call\n“humanist,” has two variants. The first, per Mulhall, is\nlinguistic or conceptual, influenced by Wittgenstein (1958). We come\nto understand notions like thinking, deciding, and feeling in terms of\nthe behavior of other human beings, and, although we can attribute\nsome of these capacities or states to other beings, it is only by\nextension or analogy (Hanfling 2001). We also learn the appropriate\nways of acting toward fellow human beings in learning the very\nconcept: for example, human beings are to be named, and not eaten even\nwhen they are dead. We do not conclude that human beings must\nbe treated this way; the recognition that they must is already part of\nthe meaning of the concept (Diamond 1978; Gleeson\n 2008).[13]\n This “thick” concept of human being is not a biological\none, and need not have the same extension as the class of Homo\n sapiens[14].\n For some humanists of this type, a newly-created embryo is not a\nhuman being, and it is not part of the meaning of human being that the\nlife of a newly-fertilized embryo must be protected to the same extent\nas the life of a newborn human infant (Crary 2007). But the very fact\nthat other humanists do regard early embryos as human beings\nsuggests the need for an account of how such a deeply-embedded concept\ncan be so vague or debatable at the margins.\n\nBecause of the role of our language and concepts in our moral\nunderstanding, the justification and criticism of our moral practices\ncan only be internal to them, on humanist accounts. As Byrne\nmaintains,\n\n\nreason operates in ethics properly when it functions immanently.\nOffering a sound moral argument in criticism of any one of our moral\npractices would be a matter of drawing upon insight from some other\npart of our moral life. (2000, 70–71)\n\n\nThe case against eating animals, for example, cannot be made by citing\nattributes they share with us, but only by exposing tensions or\ncontradictions with our other practices (Diamond 1978). Presumably,\nsimilar but more acute tensions would confront any view of humanity\nthat excluded some biological human beings or denied some of them full\nmoral status, making racism and sexism untenable without placing any\npressure on the concept of humanity itself.\n\nThe second variant denies the possibility of an impartial basis for\nassessing moral status. To attempt to grade or evaluate the\nworld’s inhabitants in absolute terms is to treat the universe\nas having a point of view—the perspective of a deity or a\nutilitarian Ideal Observer (Williams 2006). Without such a vantage\npoint, human beings can judge the rest of the world only in terms of\ntheir own concerns, values and civilization. Indeed, it is only in\nthose terms that we value those characteristics, like rationality and\nself-consciousness, regarded by individual-attribute theorists as\ncriteria for full moral status (Grau, 2016). Our humanity thus gives\nus an indispensable frame of reference for evaluating the rest of the\nworld. It also grounds a defensible partiality toward each other that\nhas little in common with racism or sexism. Not only do almost all of\nus accept naked appeals to the humanity of another being, as opposed\nto her sex or race, as the basis for action or restraint, we appeal to\nhumanity in rejecting racism and sexism. Naked appeals to race or sex,\nunsupported by claims about morally relevant attributes, are rarely\nmade by the most unapologetic racist or sexist. The “human\nprejudice” is more akin to the affinity and loyalty of\nparticipants in a shared culture. If it is difficult to see “the\nhuman prejudice” this way, it may be because “[h]uman\nbeings do not have to deal with any other creature that, in terms of\nargument, principle, worldview, or whatever, can answer back”\n(Williams 2006, 148). A distinctively human “culture” is\nboth pervasive and barely visible in a world that offers no rivals.\nWilliams does not claim that our commitment to that culture would\nnecessarily trump an appeal to participate in a more advanced\nuniversal community and relinquish cherished but parochial aspects of\nour own culture. Nevertheless, that commitment would give us a morally\ndefensible reason, not just a prejudice, against such\nassimilation.\n\nHumanist accounts recognize that species norms have moral\nsignificance, but they do not assign them the criterial role they play\nin accounts that ground moral status in relational attributes. In the\npassage from which we quoted earlier, Mulhall regards radically\ndisabled humans as suffering a grave misfortune in lacking\ncharacteristically human capacities:\n\n\nWe do not strive (when we do strive) to treat human infants and\nchildren, the senile and the severely disabled as fully human because\nwe mistakenly attribute capacities to them that they lack, or because\nwe are blind to the merely biological significance of a species\nboundary. We do it (when we do) because they are fellow human beings,\nembodied creatures who will come to share, or have already shared, in\nour common life, or whose inability to do so is a result of the shocks\nand ills to which all human flesh and blood is heir—because\nthere but for the grace of God go I. (Mulhall 2002, 7)\n\n\nFor a humanist like Mulhall, the capacity to participate in\ndistinctively human forms of life is neither necessary nor sufficient\nfor full moral status (as McMahan (2005) appears to assume). That\nstatus is established merely by our recognition of an individual as a\nhuman being, heir to the same “shocks and ills” as we are.\nHuman beings with radical cognitive disabilities suffer “grave\nmisfortune,” not reduced status if they are unable to share in\nthe distinctive forms of our common life in which their embodiment has\n“embedded” them. Non-human animals with similar attributes\nhave lower moral status but suffer no comparable estrangement or loss.\nTheir participation in their own species’ distinctive forms of\nlife—if there are any—does not depend upon, and might well\nbe impaired by, their possession of the cognitive attributes of normal\nadult humans. \n\nA critic might concede that we in fact hold these divergent attitudes\ntoward humans and non-human animals but would question their moral\nsignificance: why should we regard the congenital absence of certain\ncapacities as a tragedy for the individual lacking them if\nand only if that individual is human (McMahan 1996)? A humanist would\nrespond that the question itself reveals that the critic simply is not\nclear on the concept of “human being”—a concept that\nincludes the notion of a common life, based on shared embodiment, from\nwhich radically impaired humans are excluded.\n\nHumanists are wary of grounding the full moral status of\nradically-impaired humans in their relationship to a species-norm like\nrationality. Thus, Byrne (2000) argues that appeal to the rational\nnature of human beings as the basis for respect is too reliant on\nexternal justification and too narrow. It is too reliant on claims\nabout the respect owed to beings that are rational-by-nature, which\nByrne doubts are any more self-evident or plausible than claims about\nthe respect owed human beings. It is too narrow because it ignores\nother aspects of humanity that make the concept of “human\nbeing” so rich and powerful.\n\nThe position of humanists on the species-relativity of moral status is\nuncertain. Given the critical role they assign to “the\ndistinctive form of common life” of human beings for moral\nrecognition and obligation, it is not obvious that Mulhall or Diamond\nwould require an intelligent Martian to recognize and respect the\nmoral status of cognitively normal human beings, let alone of human\nbeings with radical cognitive impairments. Indeed, it is not clear how\nhumans could confidently impute intelligence to Martians if their\nembodiment was sufficiently different from ours, let alone whether we\ncould regard them as subject to moral obligations of any kind.\nSimilarly, it is not clear whether Mulhall and Diamond would hold that\nhumans were required to treat Martians as moral equals, even if they\ncould attribute intelligence and moral sensitivity to them. The role\nthey assign to distinctively human forms of life raises doubts about\nthe possibility of mutual comprehension, recognition, and respect.\n\nIn contrast, Williams’ account, and others less wedded to a\nWittgenstinian view of language and concepts, can more readily address\nthe prospect of close encounters with other intelligent beings.\nWilliams himself considers such encounters, and acknowledges the\npossibility of mutual recognition, though he thinks it might be\nreasonably qualified by partiality towards the members of one’s\nown species and its culture.\n\nThese two humanist accounts leave critical questions about the\nboundaries of the thick concept of “human being.” Does\nthat concept encompass early embryos, or human-like beings produced by\na future synthetic biology? Can we answer such questions in terms of\nthe “fit” of a proposed boundary with the other beliefs\nand practices associated with the concept, or are such questions\ndecided less self-consciously by gradual shifts in our actual\npractices? Without a better sense of how boundary questions can be\nresolved, it is not clear how humanist accounts will meet the\nchallenges of exclusion.\n",
    "section_title": "5.2 Humanity as the Ground of Full Moral Status",
    "entry_title": "Cognitive Disability and Moral Status",
    "hierarchy_title": "Cognitive Disability and Moral Status || Group-Based Accounts of Moral Status || Humanity as the Ground of Full Moral Status",
    "tokenized_text": [
        "groupbased",
        "account",
        "moral",
        "status",
        "humanity",
        "ground",
        "full",
        "moral",
        "status",
        "humanity",
        "ground",
        "full",
        "moral",
        "status",
        "explain",
        "moral",
        "significance",
        "specie",
        "comembership",
        "philosopher",
        "embrace",
        "strongly",
        "anthropocentric",
        "view",
        "denies",
        "step",
        "outside",
        "humanity",
        "ass",
        "moral",
        "status",
        "world",
        "inhabitant",
        "view",
        "concept",
        "human",
        "prior",
        "inseparable",
        "person",
        "stephen",
        "mulhall",
        "argues",
        "ur",
        "concept",
        "person",
        "outgrowth",
        "aspect",
        "concept",
        "human",
        "concept",
        "merely",
        "biological",
        "rather",
        "crystallisation",
        "everything",
        "made",
        "distinctive",
        "specie",
        "nature",
        "see",
        "another",
        "human",
        "see",
        "fellowcreatureanother",
        "whose",
        "embodiment",
        "embeds",
        "distinctive",
        "form",
        "common",
        "life",
        "language",
        "culture",
        "whose",
        "existence",
        "constitutes",
        "particular",
        "kind",
        "claim",
        "u",
        "view",
        "following",
        "williams",
        "call",
        "humanist",
        "two",
        "variant",
        "first",
        "per",
        "mulhall",
        "linguistic",
        "conceptual",
        "influenced",
        "wittgenstein",
        "come",
        "understand",
        "notion",
        "like",
        "thinking",
        "deciding",
        "feeling",
        "term",
        "behavior",
        "human",
        "being",
        "although",
        "attribute",
        "capacity",
        "state",
        "being",
        "extension",
        "analogy",
        "hanfling",
        "also",
        "learn",
        "appropriate",
        "way",
        "acting",
        "toward",
        "fellow",
        "human",
        "being",
        "learning",
        "concept",
        "example",
        "human",
        "being",
        "named",
        "eaten",
        "even",
        "dead",
        "conclude",
        "human",
        "being",
        "must",
        "treated",
        "way",
        "recognition",
        "must",
        "already",
        "part",
        "meaning",
        "concept",
        "diamond",
        "gleeson",
        "thick",
        "concept",
        "human",
        "biological",
        "one",
        "need",
        "extension",
        "class",
        "homo",
        "sapiens",
        "humanist",
        "type",
        "newlycreated",
        "embryo",
        "human",
        "part",
        "meaning",
        "human",
        "life",
        "newlyfertilized",
        "embryo",
        "must",
        "protected",
        "extent",
        "life",
        "newborn",
        "human",
        "infant",
        "crary",
        "fact",
        "humanist",
        "regard",
        "early",
        "embryo",
        "human",
        "being",
        "suggests",
        "need",
        "account",
        "deeplyembedded",
        "concept",
        "vague",
        "debatable",
        "margin",
        "role",
        "language",
        "concept",
        "moral",
        "understanding",
        "justification",
        "criticism",
        "moral",
        "practice",
        "internal",
        "humanist",
        "account",
        "byrne",
        "maintains",
        "reason",
        "operates",
        "ethic",
        "properly",
        "function",
        "immanently",
        "offering",
        "sound",
        "moral",
        "argument",
        "criticism",
        "one",
        "moral",
        "practice",
        "would",
        "matter",
        "drawing",
        "upon",
        "insight",
        "part",
        "moral",
        "life",
        "case",
        "eating",
        "animal",
        "example",
        "made",
        "citing",
        "attribute",
        "share",
        "u",
        "exposing",
        "tension",
        "contradiction",
        "practice",
        "diamond",
        "presumably",
        "similar",
        "acute",
        "tension",
        "would",
        "confront",
        "view",
        "humanity",
        "excluded",
        "biological",
        "human",
        "being",
        "denied",
        "full",
        "moral",
        "status",
        "making",
        "racism",
        "sexism",
        "untenable",
        "without",
        "placing",
        "pressure",
        "concept",
        "humanity",
        "second",
        "variant",
        "denies",
        "possibility",
        "impartial",
        "basis",
        "assessing",
        "moral",
        "status",
        "attempt",
        "grade",
        "evaluate",
        "world",
        "inhabitant",
        "absolute",
        "term",
        "treat",
        "universe",
        "point",
        "viewthe",
        "perspective",
        "deity",
        "utilitarian",
        "ideal",
        "observer",
        "williams",
        "without",
        "vantage",
        "point",
        "human",
        "being",
        "judge",
        "rest",
        "world",
        "term",
        "concern",
        "value",
        "civilization",
        "indeed",
        "term",
        "value",
        "characteristic",
        "like",
        "rationality",
        "selfconsciousness",
        "regarded",
        "individualattribute",
        "theorist",
        "criterion",
        "full",
        "moral",
        "status",
        "grau",
        "humanity",
        "thus",
        "give",
        "u",
        "indispensable",
        "frame",
        "reference",
        "evaluating",
        "rest",
        "world",
        "also",
        "ground",
        "defensible",
        "partiality",
        "toward",
        "little",
        "common",
        "racism",
        "sexism",
        "almost",
        "u",
        "accept",
        "naked",
        "appeal",
        "humanity",
        "another",
        "opposed",
        "sex",
        "race",
        "basis",
        "action",
        "restraint",
        "appeal",
        "humanity",
        "rejecting",
        "racism",
        "sexism",
        "naked",
        "appeal",
        "race",
        "sex",
        "unsupported",
        "claim",
        "morally",
        "relevant",
        "attribute",
        "rarely",
        "made",
        "unapologetic",
        "racist",
        "sexist",
        "human",
        "prejudice",
        "akin",
        "affinity",
        "loyalty",
        "participant",
        "shared",
        "culture",
        "difficult",
        "see",
        "human",
        "prejudice",
        "way",
        "may",
        "h",
        "uman",
        "being",
        "deal",
        "creature",
        "term",
        "argument",
        "principle",
        "worldview",
        "whatever",
        "answer",
        "back",
        "williams",
        "distinctively",
        "human",
        "culture",
        "pervasive",
        "barely",
        "visible",
        "world",
        "offer",
        "rival",
        "williams",
        "claim",
        "commitment",
        "culture",
        "would",
        "necessarily",
        "trump",
        "appeal",
        "participate",
        "advanced",
        "universal",
        "community",
        "relinquish",
        "cherished",
        "parochial",
        "aspect",
        "culture",
        "nevertheless",
        "commitment",
        "would",
        "give",
        "u",
        "morally",
        "defensible",
        "reason",
        "prejudice",
        "assimilation",
        "humanist",
        "account",
        "recognize",
        "specie",
        "norm",
        "moral",
        "significance",
        "assign",
        "criterial",
        "role",
        "play",
        "account",
        "ground",
        "moral",
        "status",
        "relational",
        "attribute",
        "passage",
        "quoted",
        "earlier",
        "mulhall",
        "regard",
        "radically",
        "disabled",
        "human",
        "suffering",
        "grave",
        "misfortune",
        "lacking",
        "characteristically",
        "human",
        "capacity",
        "strive",
        "strive",
        "treat",
        "human",
        "infant",
        "child",
        "senile",
        "severely",
        "disabled",
        "fully",
        "human",
        "mistakenly",
        "attribute",
        "capacity",
        "lack",
        "blind",
        "merely",
        "biological",
        "significance",
        "specie",
        "boundary",
        "fellow",
        "human",
        "being",
        "embodied",
        "creature",
        "come",
        "share",
        "already",
        "shared",
        "common",
        "life",
        "whose",
        "inability",
        "result",
        "shock",
        "ill",
        "human",
        "flesh",
        "blood",
        "heirbecause",
        "grace",
        "god",
        "go",
        "mulhall",
        "humanist",
        "like",
        "mulhall",
        "capacity",
        "participate",
        "distinctively",
        "human",
        "form",
        "life",
        "neither",
        "necessary",
        "sufficient",
        "full",
        "moral",
        "status",
        "mcmahan",
        "appears",
        "assume",
        "status",
        "established",
        "merely",
        "recognition",
        "individual",
        "human",
        "heir",
        "shock",
        "ill",
        "human",
        "being",
        "radical",
        "cognitive",
        "disability",
        "suffer",
        "grave",
        "misfortune",
        "reduced",
        "status",
        "unable",
        "share",
        "distinctive",
        "form",
        "common",
        "life",
        "embodiment",
        "embedded",
        "nonhuman",
        "animal",
        "similar",
        "attribute",
        "lower",
        "moral",
        "status",
        "suffer",
        "comparable",
        "estrangement",
        "loss",
        "participation",
        "specie",
        "distinctive",
        "form",
        "lifeif",
        "anydoes",
        "depend",
        "upon",
        "might",
        "well",
        "impaired",
        "possession",
        "cognitive",
        "attribute",
        "normal",
        "adult",
        "human",
        "critic",
        "might",
        "concede",
        "fact",
        "hold",
        "divergent",
        "attitude",
        "toward",
        "human",
        "nonhuman",
        "animal",
        "would",
        "question",
        "moral",
        "significance",
        "regard",
        "congenital",
        "absence",
        "certain",
        "capacity",
        "tragedy",
        "individual",
        "lacking",
        "individual",
        "human",
        "mcmahan",
        "humanist",
        "would",
        "respond",
        "question",
        "reveals",
        "critic",
        "simply",
        "clear",
        "concept",
        "human",
        "a",
        "concept",
        "includes",
        "notion",
        "common",
        "life",
        "based",
        "shared",
        "embodiment",
        "radically",
        "impaired",
        "human",
        "excluded",
        "humanist",
        "wary",
        "grounding",
        "full",
        "moral",
        "status",
        "radicallyimpaired",
        "human",
        "relationship",
        "speciesnorm",
        "like",
        "rationality",
        "thus",
        "byrne",
        "argues",
        "appeal",
        "rational",
        "nature",
        "human",
        "being",
        "basis",
        "respect",
        "reliant",
        "external",
        "justification",
        "narrow",
        "reliant",
        "claim",
        "respect",
        "owed",
        "being",
        "rationalbynature",
        "byrne",
        "doubt",
        "selfevident",
        "plausible",
        "claim",
        "respect",
        "owed",
        "human",
        "being",
        "narrow",
        "ignores",
        "aspect",
        "humanity",
        "make",
        "concept",
        "human",
        "rich",
        "powerful",
        "position",
        "humanist",
        "speciesrelativity",
        "moral",
        "status",
        "uncertain",
        "given",
        "critical",
        "role",
        "assign",
        "distinctive",
        "form",
        "common",
        "life",
        "human",
        "being",
        "moral",
        "recognition",
        "obligation",
        "obvious",
        "mulhall",
        "diamond",
        "would",
        "require",
        "intelligent",
        "martian",
        "recognize",
        "respect",
        "moral",
        "status",
        "cognitively",
        "normal",
        "human",
        "being",
        "let",
        "alone",
        "human",
        "being",
        "radical",
        "cognitive",
        "impairment",
        "indeed",
        "clear",
        "human",
        "could",
        "confidently",
        "impute",
        "intelligence",
        "martian",
        "embodiment",
        "sufficiently",
        "different",
        "let",
        "alone",
        "whether",
        "could",
        "regard",
        "subject",
        "moral",
        "obligation",
        "kind",
        "similarly",
        "clear",
        "whether",
        "mulhall",
        "diamond",
        "would",
        "hold",
        "human",
        "required",
        "treat",
        "martian",
        "moral",
        "equal",
        "even",
        "could",
        "attribute",
        "intelligence",
        "moral",
        "sensitivity",
        "role",
        "assign",
        "distinctively",
        "human",
        "form",
        "life",
        "raise",
        "doubt",
        "possibility",
        "mutual",
        "comprehension",
        "recognition",
        "respect",
        "contrast",
        "williams",
        "account",
        "others",
        "le",
        "wedded",
        "wittgenstinian",
        "view",
        "language",
        "concept",
        "readily",
        "address",
        "prospect",
        "close",
        "encounter",
        "intelligent",
        "being",
        "williams",
        "considers",
        "encounter",
        "acknowledges",
        "possibility",
        "mutual",
        "recognition",
        "though",
        "think",
        "might",
        "reasonably",
        "qualified",
        "partiality",
        "towards",
        "member",
        "one",
        "specie",
        "culture",
        "two",
        "humanist",
        "account",
        "leave",
        "critical",
        "question",
        "boundary",
        "thick",
        "concept",
        "human",
        "being",
        "concept",
        "encompass",
        "early",
        "embryo",
        "humanlike",
        "being",
        "produced",
        "future",
        "synthetic",
        "biology",
        "answer",
        "question",
        "term",
        "fit",
        "proposed",
        "boundary",
        "belief",
        "practice",
        "associated",
        "concept",
        "question",
        "decided",
        "le",
        "selfconsciously",
        "gradual",
        "shift",
        "actual",
        "practice",
        "without",
        "better",
        "sense",
        "boundary",
        "question",
        "resolved",
        "clear",
        "humanist",
        "account",
        "meet",
        "challenge",
        "exclusion"
    ]
}