{
    "main_text": "Philosophy of Religion and the Correlation between the Individual and God\n8. Philosophy of Religion and the Correlation between the Individual and God\n\nCohen retired from Marburg in 1912, in order to teach at the Academy\nof Jewish Sciences, a rabbinical seminary in Berlin, where he remained\nuntil his death. In 1908 he had written his Ethics of\nMaimonides, and after 1912 he worked above all else on religious\nphilosophy, writing The Concept of Religion in the System of\nPhilosophy (1915) and his monumental Religion of Reason Out\nof the Sources of Judaism, which appeared in 1919, after his\ndeath. The Religion’s significance is difficult to\noverstate: it has been called “the single most consequential\nwork of Judaic thought in the period of the nineteenth and twentieth\ncenturies” (Dietrich 2000). In it, Cohen articulates a\nconception of a “religion of reason,” and argues that\nfundamental concepts of Judaism, as they are revealed in historical\nJewish texts, were the original sources of that religion of\nreason.\n\nCohen initially faces a problem in defining the relation of religion\nto systematic philosophy (Holzhey 2000). In both the Concept of\nReligion and the Religion of Reason, he identifies the\ntwo central concepts of religion as humanity and God (Cohen 1972\n[1919], 11ff.) But he had already offered philosophical accounts of\nthose concepts in his ethics. For Cohen, ethics is the theory\nprecisely of humanity. But also, in his Ethics of Pure Will,\nCohen defined God as the conjunction of two ideas: the concept of\nideal ethical laws unifying all humanity into a harmonious realm of\nends, and the faith that, at the end of history, this ideal would be\nrealized. Thus Cohen’s ethics seem to offer complete, systematic\naccounts of both of religion’s central concepts. Consequently,\nCohen appears to face a dilemma: religion has a distinctive role to\nplay in philosophy just in case his philosophical ethics offered only\nincomplete accounts of humanity and God. But this is unacceptable to\nCohen.\n\nCohen must thus offer an account of the distinctiveness of religion in\nrelation to systematic philosophy, and do so in a way that does not\nentail the incompleteness of his ethics. The crux of his account of\nreligion’s distinctiveness seems to be the vaguely Tolstoyan\nassumption that insofar as individuals are moral, they are alike, but\nthat every individual is immoral in his or her own way. In the\nReligion, Cohen claims that systematic philosophical ethics\nis concerned with individuals only insofar as they are members of\npluralities or humanity as a whole—that is, only insofar as they\nare bound by ethical laws. But this is not the only way to conceive of\nindividuals. We can also recognize an individual’s particular\nmoral failings, and we can recognize the particular ways an individual\nsuffers because of those failings (Zank 2000). When we recognize an\nindividual this way, Cohen says (appropriating Feuerbach’s\nvocabulary) we recognize the individual as a “Thou,”\nrather than merely as a “He,” a generic representative of\nhumanity. On Cohen’s account, it thus turns out that systematic\nphilosophical ethics does not address certain pervasive features of\nour lived moral experience: our varied, multiple, and particular moral\nfailings, as well the suffering they bring us (Bonaunet 2005, 49ff.).\nThis is not, he thinks, a criticism of ethics for being incomplete. It\nis only the recognition of what ethics is, and is not, concerned\nwith.\n\nReligion, however, is concerned precisely with the individual’s\nparticular moral failings (Zank 1996 and 2000). While we can recognize\nanother individual as a “Thou,” and so assess her\nparticular moral failings, Cohen thinks the most important person to\nrecognize as a “Thou” is ourselves. As he puts it, we\ndiscover the “I” only by means of the “Thou.”\nThat is, we recognize our moral selves by recognizing our own\nparticular moral failings. As he puts it, “[i]n myself, I have\nto study sin, and through sin I must learn to know myself”\n(Cohen 1972 [1919], 22). Without first discovering our own particular\nmoral failings, we could not strive for moral improvement. But for\nCohen, this process of moral improvement is inherently religious.\nPrayer gives us the strength to overcome our hypocrisy and\nself-deceit. And only when we do that can we confess, that is,\nacknowledge our own moral failings. This in turn makes it possible for\nus to atone, that is, to strive to realize our ethical ideals in ways\nthat respond appropriately to our particular failings (Horwitz 2000;\nZank 2000). Thus, for Cohen, knowledge of our own moral selves is the\n“deepest ground” of religion: “[t]he discovery of\nhumanity through sin is the source from which every religious\ndevelopment flows” (Cohen 1972 [1919], 20).\n\nBy striving for moral improvement, the individual relates herself to\nher ethical ideals. But since for Cohen our concept of ideal ethical\nlaws just is our idea of God (or at least a component of our idea of\nGod), an individual’s striving for moral improvement relates her\nto God. In Cohen’s terms, striving for moral improvement\nestablishes a “correlation” between the individual and\nGod. This correlation is a profoundly personal relationship: since the\nindividual confesses and atones for her own particular sins, she\nrelates herself to God in a way that is similarly particular to her.\nIn relating herself to God, Cohen thinks, the individual thereby\nconstitutes herself as a unique moral and religious self, and God\nbecomes her “guide on the long road from sin to virtue”\n(Cohen 1919, 20).\n\nThus Cohen maintains that there is a distinctive role in philosophy\nfor a religion of reason: its distinctive concern is precisely with\nthe particularities of individual humans’ lived moral\nexperience, and their attempts to overcome their various and different\nmoral failings as they strive to realize ideal ethical laws.\n\nNevertheless, almost since before Cohen’s ink was dry, there\nhave been significant disagreements about the proper interpretation of\nCohen’s account of the relation between religion and his\nsystematic philosophy, and of his account of the individual’s\nrelation to God.\n\nAn early and enormously influential reaction to Cohen’s view was\nhis friend Franz Rosenzweig’s. Rosenzweig argued that\nCohen’s concern in the Religion with the concrete\nindividual, expressed in the idea of the individual’s\n“correlation” with God, constituted a decisive break from\nthe Ethics of Pure Will’s concern with universal laws\nof human action (Rosenzweig 1924). On Rosenzweig’s\ninterpretation, in the Religion Cohen abandons the\nrationalism that characterizes his earlier conception of humanity\nworking out its relation to God in a historical process of improving\nthe laws by which it governs itself. Instead, Rosenzweig suggests,\nCohen commits himself to a conception of the religious individual that\nis more fundamental than universal, rational ethical considerations.\nThus for Rosenzweig, despite Cohen’s claims to the contrary, his\nviews in the Religion are fundamentally discontinuous with\nhis views in his systematic ethics.\n\nMore recently, Robert Erlewine (2010) has offered a different account\nof how Cohen’s Religion might break decisively with his\nsystematic ethics. Cohen’s ethics are concerned with how\npluralities of different wills are unified into law-governed\ntotalities (cf §6 above). In his Ethics of Pure Will,\nCohen argues that different wills are so unified in the ideal state.\nBut, Erlewine argues, Cohen defends a different view in his Ethics\nof Maimonides and his Religion. For Cohen in those\nworks, on Erlewine’s account, different wills are unified in the\nlaw-governed community of the religious, and specifically Jewish,\ncongregation.\n\nIn contrast, others have defended the consistency of Cohen’s\nviews, arguing that the Religion completes the systematic\nethical project he had started in his Ethics of Pure Will.\nCohen’s ethics is concerned with the constitution of the will,\nthat is, the moral self. But this moral self is an ideal, and thus it\nis only in the Religion that Cohen takes up the question of\nthe human self as a concrete individual. Consequently, Schwarzschild\n(1975) argues that Cohen’s account of the concrete individual in\nthe Religion completes the theory of moral selfhood begun in\nthe Ethics of Pure Will. Alternatively, Poma (1988) argues\nthat the religious idea of God, since it is the idea not only of\nuniversal ethical ideals, but of humanity’s progress towards\nthose ideals, provides a connection between the descriptive and\nnormative aspects of Cohen’s philosophy.\n\nHowever, if Cohen’s philosophy of religion completes\nthe project of his systematic ethics, it is difficult to see how to\navoid the implication that Cohen’s systematic ethics were,\nconsidered on their own, incomplete – a claim Cohen himself was\nat pains to deny.\n\nThe debate about these two broad interpretive strategies has, at\ntimes, taken on the significance of a debate about how best to view\nCohen an an intellectual. That is, the debate is not simply about\nwhether to prefer an interpretation emphasizing a sharp discontinuity\nbetween Cohen’s views in the Religion and his earlier\nviews, or an interpretation emphasizing continuity in his views.\nRather, as Daniel Weiss points out, the debate has sometimes been\nabout whether to understand Cohen first and foremost as a Jewish\nthinker or primarily as a neo-Kantian philosopher (Weiss 2012,\n5ff).\n\nHowever, a third interpretive strategy seeks to avoid this dichotomy,\nby avoiding both the claim that Cohen’s Religion is a\ndecisive “break” with his systematic ethics and the claim\nthat his religion “completes” those ethics. Michael Zank\n(1996 and especially 2000) has emphasized that Cohen did not intend\nhis philosophy of religion to be part of the System of\nPhilosophy, but nor can the philosophy of religion be in any\nsense a “break” from the Ethics of Pure Will in\nhis System, since he started working on both projects at\nroughly the same time around the turn of the century. Cohen’s\nsystematic philosophy and his philosophy of religion thus stand as\ncomplements to each other: whereas one conceives the human as an ideal\nagent constituted by universal ethical laws, the other treats the\nhuman as a concrete individual, constituted by the particularities of\nhis own moral failings and attempts to atone for them. Similarly,\nWeiss (2012) argues that the religious and ethical conception of the\nindividual are different “voices” in Cohen that cannot be\nreduced to a simple, theoretical unity (in the System of\nPhilosophy), but that both voices are necessary.\n",
    "section_title": "8. Philosophy of Religion and the Correlation between the Individual and God",
    "entry_title": "Hermann Cohen",
    "hierarchy_title": "Hermann Cohen || Philosophy of Religion and the Correlation between the Individual and God",
    "tokenized_text": [
        "philosophy",
        "religion",
        "correlation",
        "individual",
        "god",
        "philosophy",
        "religion",
        "correlation",
        "individual",
        "god",
        "cohen",
        "retired",
        "marburg",
        "order",
        "teach",
        "academy",
        "jewish",
        "science",
        "rabbinical",
        "seminary",
        "berlin",
        "remained",
        "death",
        "written",
        "ethic",
        "maimonides",
        "worked",
        "else",
        "religious",
        "philosophy",
        "writing",
        "concept",
        "religion",
        "system",
        "philosophy",
        "monumental",
        "religion",
        "reason",
        "source",
        "judaism",
        "appeared",
        "death",
        "religion",
        "significance",
        "difficult",
        "overstate",
        "called",
        "single",
        "consequential",
        "work",
        "judaic",
        "thought",
        "period",
        "nineteenth",
        "twentieth",
        "century",
        "dietrich",
        "cohen",
        "articulates",
        "conception",
        "religion",
        "reason",
        "argues",
        "fundamental",
        "concept",
        "judaism",
        "revealed",
        "historical",
        "jewish",
        "text",
        "original",
        "source",
        "religion",
        "reason",
        "cohen",
        "initially",
        "face",
        "problem",
        "defining",
        "relation",
        "religion",
        "systematic",
        "philosophy",
        "holzhey",
        "concept",
        "religion",
        "religion",
        "reason",
        "identifies",
        "two",
        "central",
        "concept",
        "religion",
        "humanity",
        "god",
        "cohen",
        "ff",
        "already",
        "offered",
        "philosophical",
        "account",
        "concept",
        "ethic",
        "cohen",
        "ethic",
        "theory",
        "precisely",
        "humanity",
        "also",
        "ethic",
        "pure",
        "cohen",
        "defined",
        "god",
        "conjunction",
        "two",
        "idea",
        "concept",
        "ideal",
        "ethical",
        "law",
        "unifying",
        "humanity",
        "harmonious",
        "realm",
        "end",
        "faith",
        "end",
        "history",
        "ideal",
        "would",
        "realized",
        "thus",
        "cohen",
        "ethic",
        "seem",
        "offer",
        "complete",
        "systematic",
        "account",
        "religion",
        "central",
        "concept",
        "consequently",
        "cohen",
        "appears",
        "face",
        "dilemma",
        "religion",
        "distinctive",
        "role",
        "play",
        "philosophy",
        "case",
        "philosophical",
        "ethic",
        "offered",
        "incomplete",
        "account",
        "humanity",
        "god",
        "unacceptable",
        "cohen",
        "cohen",
        "must",
        "thus",
        "offer",
        "account",
        "distinctiveness",
        "religion",
        "relation",
        "systematic",
        "philosophy",
        "way",
        "entail",
        "incompleteness",
        "ethic",
        "crux",
        "account",
        "religion",
        "distinctiveness",
        "seems",
        "vaguely",
        "tolstoyan",
        "assumption",
        "insofar",
        "individual",
        "moral",
        "alike",
        "every",
        "individual",
        "immoral",
        "way",
        "religion",
        "cohen",
        "claim",
        "systematic",
        "philosophical",
        "ethic",
        "concerned",
        "individual",
        "insofar",
        "member",
        "plurality",
        "humanity",
        "wholethat",
        "insofar",
        "bound",
        "ethical",
        "law",
        "way",
        "conceive",
        "individual",
        "also",
        "recognize",
        "individual",
        "particular",
        "moral",
        "failing",
        "recognize",
        "particular",
        "way",
        "individual",
        "suffers",
        "failing",
        "zank",
        "recognize",
        "individual",
        "way",
        "cohen",
        "say",
        "appropriating",
        "feuerbach",
        "vocabulary",
        "recognize",
        "individual",
        "thou",
        "rather",
        "merely",
        "generic",
        "representative",
        "humanity",
        "cohen",
        "account",
        "thus",
        "turn",
        "systematic",
        "philosophical",
        "ethic",
        "address",
        "certain",
        "pervasive",
        "feature",
        "lived",
        "moral",
        "experience",
        "varied",
        "multiple",
        "particular",
        "moral",
        "failing",
        "well",
        "suffering",
        "bring",
        "u",
        "bonaunet",
        "ff",
        "think",
        "criticism",
        "ethic",
        "incomplete",
        "recognition",
        "ethic",
        "concerned",
        "religion",
        "however",
        "concerned",
        "precisely",
        "individual",
        "particular",
        "moral",
        "failing",
        "zank",
        "recognize",
        "another",
        "individual",
        "thou",
        "ass",
        "particular",
        "moral",
        "failing",
        "cohen",
        "think",
        "important",
        "person",
        "recognize",
        "thou",
        "put",
        "discover",
        "mean",
        "thou",
        "recognize",
        "moral",
        "self",
        "recognizing",
        "particular",
        "moral",
        "failing",
        "put",
        "n",
        "study",
        "sin",
        "sin",
        "must",
        "learn",
        "know",
        "cohen",
        "without",
        "first",
        "discovering",
        "particular",
        "moral",
        "failing",
        "could",
        "strive",
        "moral",
        "improvement",
        "cohen",
        "process",
        "moral",
        "improvement",
        "inherently",
        "religious",
        "prayer",
        "give",
        "u",
        "strength",
        "overcome",
        "hypocrisy",
        "selfdeceit",
        "confess",
        "acknowledge",
        "moral",
        "failing",
        "turn",
        "make",
        "possible",
        "u",
        "atone",
        "strive",
        "realize",
        "ethical",
        "ideal",
        "way",
        "respond",
        "appropriately",
        "particular",
        "failing",
        "horwitz",
        "zank",
        "thus",
        "cohen",
        "knowledge",
        "moral",
        "self",
        "deepest",
        "ground",
        "religion",
        "discovery",
        "humanity",
        "sin",
        "source",
        "every",
        "religious",
        "development",
        "flow",
        "cohen",
        "striving",
        "moral",
        "improvement",
        "individual",
        "relates",
        "ethical",
        "ideal",
        "since",
        "cohen",
        "concept",
        "ideal",
        "ethical",
        "law",
        "idea",
        "god",
        "least",
        "component",
        "idea",
        "god",
        "individual",
        "striving",
        "moral",
        "improvement",
        "relates",
        "god",
        "cohen",
        "term",
        "striving",
        "moral",
        "improvement",
        "establishes",
        "correlation",
        "individual",
        "god",
        "correlation",
        "profoundly",
        "personal",
        "relationship",
        "since",
        "individual",
        "confesses",
        "atones",
        "particular",
        "sin",
        "relates",
        "god",
        "way",
        "similarly",
        "particular",
        "relating",
        "god",
        "cohen",
        "think",
        "individual",
        "thereby",
        "constitutes",
        "unique",
        "moral",
        "religious",
        "self",
        "god",
        "becomes",
        "guide",
        "long",
        "road",
        "sin",
        "virtue",
        "cohen",
        "thus",
        "cohen",
        "maintains",
        "distinctive",
        "role",
        "philosophy",
        "religion",
        "reason",
        "distinctive",
        "concern",
        "precisely",
        "particularity",
        "individual",
        "human",
        "lived",
        "moral",
        "experience",
        "attempt",
        "overcome",
        "various",
        "different",
        "moral",
        "failing",
        "strive",
        "realize",
        "ideal",
        "ethical",
        "law",
        "nevertheless",
        "almost",
        "since",
        "cohen",
        "ink",
        "dry",
        "significant",
        "disagreement",
        "proper",
        "interpretation",
        "cohen",
        "account",
        "relation",
        "religion",
        "systematic",
        "philosophy",
        "account",
        "individual",
        "relation",
        "god",
        "early",
        "enormously",
        "influential",
        "reaction",
        "cohen",
        "view",
        "friend",
        "franz",
        "rosenzweig",
        "rosenzweig",
        "argued",
        "cohen",
        "concern",
        "religion",
        "concrete",
        "individual",
        "expressed",
        "idea",
        "individual",
        "correlation",
        "god",
        "constituted",
        "decisive",
        "break",
        "ethic",
        "pure",
        "concern",
        "universal",
        "law",
        "human",
        "action",
        "rosenzweig",
        "rosenzweig",
        "interpretation",
        "religion",
        "cohen",
        "abandon",
        "rationalism",
        "characterizes",
        "earlier",
        "conception",
        "humanity",
        "working",
        "relation",
        "god",
        "historical",
        "process",
        "improving",
        "law",
        "governs",
        "instead",
        "rosenzweig",
        "suggests",
        "cohen",
        "commits",
        "conception",
        "religious",
        "individual",
        "fundamental",
        "universal",
        "rational",
        "ethical",
        "consideration",
        "thus",
        "rosenzweig",
        "despite",
        "cohen",
        "claim",
        "contrary",
        "view",
        "religion",
        "fundamentally",
        "discontinuous",
        "view",
        "systematic",
        "ethic",
        "recently",
        "robert",
        "erlewine",
        "offered",
        "different",
        "account",
        "cohen",
        "religion",
        "might",
        "break",
        "decisively",
        "systematic",
        "ethic",
        "cohen",
        "ethic",
        "concerned",
        "plurality",
        "different",
        "will",
        "unified",
        "lawgoverned",
        "totality",
        "cf",
        "ethic",
        "pure",
        "cohen",
        "argues",
        "different",
        "will",
        "unified",
        "ideal",
        "state",
        "erlewine",
        "argues",
        "cohen",
        "defends",
        "different",
        "view",
        "ethic",
        "maimonides",
        "religion",
        "cohen",
        "work",
        "erlewine",
        "account",
        "different",
        "will",
        "unified",
        "lawgoverned",
        "community",
        "religious",
        "specifically",
        "jewish",
        "congregation",
        "contrast",
        "others",
        "defended",
        "consistency",
        "cohen",
        "view",
        "arguing",
        "religion",
        "completes",
        "systematic",
        "ethical",
        "project",
        "started",
        "ethic",
        "pure",
        "cohen",
        "ethic",
        "concerned",
        "constitution",
        "moral",
        "self",
        "moral",
        "self",
        "ideal",
        "thus",
        "religion",
        "cohen",
        "take",
        "question",
        "human",
        "self",
        "concrete",
        "individual",
        "consequently",
        "schwarzschild",
        "argues",
        "cohen",
        "account",
        "concrete",
        "individual",
        "religion",
        "completes",
        "theory",
        "moral",
        "selfhood",
        "begun",
        "ethic",
        "pure",
        "alternatively",
        "poma",
        "argues",
        "religious",
        "idea",
        "god",
        "since",
        "idea",
        "universal",
        "ethical",
        "ideal",
        "humanity",
        "progress",
        "towards",
        "ideal",
        "provides",
        "connection",
        "descriptive",
        "normative",
        "aspect",
        "cohen",
        "philosophy",
        "however",
        "cohen",
        "philosophy",
        "religion",
        "completes",
        "project",
        "systematic",
        "ethic",
        "difficult",
        "see",
        "avoid",
        "implication",
        "cohen",
        "systematic",
        "ethic",
        "considered",
        "incomplete",
        "claim",
        "cohen",
        "pain",
        "deny",
        "debate",
        "two",
        "broad",
        "interpretive",
        "strategy",
        "time",
        "taken",
        "significance",
        "debate",
        "best",
        "view",
        "cohen",
        "intellectual",
        "debate",
        "simply",
        "whether",
        "prefer",
        "interpretation",
        "emphasizing",
        "sharp",
        "discontinuity",
        "cohen",
        "view",
        "religion",
        "earlier",
        "view",
        "interpretation",
        "emphasizing",
        "continuity",
        "view",
        "rather",
        "daniel",
        "wei",
        "point",
        "debate",
        "sometimes",
        "whether",
        "understand",
        "cohen",
        "first",
        "foremost",
        "jewish",
        "thinker",
        "primarily",
        "neokantian",
        "philosopher",
        "wei",
        "ff",
        "however",
        "third",
        "interpretive",
        "strategy",
        "seek",
        "avoid",
        "dichotomy",
        "avoiding",
        "claim",
        "cohen",
        "religion",
        "decisive",
        "break",
        "systematic",
        "ethic",
        "claim",
        "religion",
        "completes",
        "ethic",
        "michael",
        "zank",
        "especially",
        "emphasized",
        "cohen",
        "intend",
        "philosophy",
        "religion",
        "part",
        "system",
        "philosophy",
        "philosophy",
        "religion",
        "sense",
        "break",
        "ethic",
        "pure",
        "system",
        "since",
        "started",
        "working",
        "project",
        "roughly",
        "time",
        "around",
        "turn",
        "century",
        "cohen",
        "systematic",
        "philosophy",
        "philosophy",
        "religion",
        "thus",
        "stand",
        "complement",
        "whereas",
        "one",
        "conceives",
        "human",
        "ideal",
        "agent",
        "constituted",
        "universal",
        "ethical",
        "law",
        "treat",
        "human",
        "concrete",
        "individual",
        "constituted",
        "particularity",
        "moral",
        "failing",
        "attempt",
        "atone",
        "similarly",
        "wei",
        "argues",
        "religious",
        "ethical",
        "conception",
        "individual",
        "different",
        "voice",
        "cohen",
        "reduced",
        "simple",
        "theoretical",
        "unity",
        "system",
        "philosophy",
        "voice",
        "necessary"
    ]
}