{
    "main_text": "History and Science || Re-enactment\n3.3 The argument against methodological unity\n\nCollingwood’s philosophy of history is a sustained attempt to\ndelineate the subject matter of history and why this subject matter\ncannot be captured by adopting the methods of natural science. He is\ncritical of the argument, advanced by John Stuart Mill that the\ndistinction between the human and the natural sciences is merely a\ndistinction in the degree of accuracy that can be reached in their\nrespective domains of inquiry. In his System of Logic (1843),\nMill argued that the subject matter of psychology differs from that of\nthe natural sciences because psychology studies human actions. Yet the\nmethod by which the psychologist studies human actions is the same\n(inductive) method that is operative in natural science. Psychologists\npredict human behaviour in the same way in which natural scientists\npredict natural events, by inferring it from certain antecedent\nconditions and empirical generalisations. While the generalisations of\npsychologists invoke psychological rather than natural laws, the\nmethod is the same. The difference between psychology and natural\nscience lies in the fact that the predictions of psychologists unlike,\nsay, those of astronomers are imprecise. Such a difference, for Mill,\nis insufficiently robust to support the claim for disunity in the\nsciences. The most accurate way of drawing the distinction between\npsychology and astronomy is not to deny that psychology is a (natural)\nscience, but to acknowledge that there are two kinds of natural\nsciences, those which are precise (like astronomy) and those which are\nimprecise (like psychology). According to Mill’s way of drawing\nthe distinction psychology is, like tidology and meteorology, an\ninexact (natural) science. The contrast (for Mill) is therefore not\nbetween two kinds of sciences in the Latin sense of scientia,\nmeaning two distinct kinds of knowledge, but between different kinds\nof natural sciences: exact and inexact. Collingwood rejected\nMill’s suggestion that the reconstruction of the thoughts of\nhistorical agents is a past-directed empirical psychology. The study\nof mind is, as we saw earlier, a normative or criteriological\nendeavour because to understand past agents historically is to\nunderstand the conceptual connections they made by reconstructing\ntheir thought-context. The subject matter of history, Collingwood\nclaims, is not merely human actions but res gestae. These\n\n\nare not the actions, in the widest sense of that word, which are done\nby animals of the species called human; they are actions in another\nsense of the same word, equally familiar but narrower, actions done by\nreasonable agents in pursuit of ends determined by their reason. (PH:\n46)\n\n\nPsychology, as understood by Mill, is what in An Essay on\nMetaphysics Collingwood calls a “pseudo-science of\nthought” (EM 1998: 142) because it fails to acknowledge\nthat the concept of mind is, in the words of Gallie (1956), an\nessentially contested concept that (like “cause”,\n“action”, “science”, and “the\npast”) needs to be disambiguated. This is not to say that\nempirical psychology is not a legitimate scientific pursuit, but that\nthe subject matter of empirical psychology and that of history are not\nthe same and that the attempt to capture the mind by the methods of\nempirical science should be denounced as the attempt by one form of\nknowledge to trespass on the territory of another.\n\nThe distinction between the method of history and that of science is\nnot a distinction between the explanations of psychology understood as\nan empirical science of the mind and those of physics or astronomy. It\nis a distinction between two different forms of knowing with\ndistinctive explananda: actions and events. The action/event\ndistinction designates therefore not a distinction between\ninner/private psychological processes and outward/observable\nphenomena, but between two different ways of knowing the past:\nqua actions or qua events. The description of the\npast qua actions is the correlative of a certain kind of\n(historical) explanation; the description of the past qua\nevents is the correlative of a certain kind of scientific/nomological\nexplanation. The action/event distinction is, in the vocabulary of\nAn Essay on Philosophical Method a philosophical distinction\nwhich does not capture two separate classes of things, but brings the\npast under different descriptions, qua natural and\nqua historical past.\n\nThe relevance of Collingwood’s defence of the autonomy of\nhistory to debates concerning the unity/disunity of science was\nbrought to the attention of a wider audience by W. H. Dray during the\n1950s and 60s. Dray (1958, 1963) located Collingwood’s\naction/event distinction within the context of contemporary debates in\nthe philosophy of social science and drew on the work of Collingwood\nto reject the claim for methodological unity advanced by Hempel in his\ninfluential 1942 article: “The Function of General Laws in\nHistory”. Hempel claimed that explanations in history are\ncovertly nomological explanations because historians, just as natural\nscientists, rely upon general laws, even if they do not explicitly\nmention them. Dray argued that Hempel failed to see that what\ndistinguishes action from event explanations is the nature of the\nconnection between the explanans and the\nexplanandum. In naturalistic explanations the\nexplanans is an antecedent condition, a state of affairs\nwhich precedes in time the event whose cause it is said to be; in the\nhistorical explanation of action the explanans is the logical\nground of an action, the thought that renders the action intelligible.\nWhilst in the 1950s and 60s Collingwood played an important role in\nthe debate concerning the logical form of action explanation and how\nit differs from the causal explanation of events, his work became less\ninfluential in the second half of the twentieth century. The neglect\ninto which Collingwood’s account of action and its explanation\nhas fallen is linked to a change in metaphilosophical assumptions and\nthe return of the kind of metaphysics which he had sought to replace\nwith the presuppositional analysis described in An Essay on\nMetaphysics.\n\nAs we saw, according to Collingwood the distinction between the\nexplanation of action and of events was a distinction between\ndifferent forms of inferences or, as he put it in An Essay on\nMetaphysics, between the different senses that the term\n“cause” or “because” has in different\nexplanatory contexts. Collingwood’s metaphysics of absolute\npresuppositions committed him to a form of explanatory pluralism in\nwhich different kinds of explanations do not compete because they\nanswer different questions, which arise because of different\npresuppositions; the choice between one kind of explanation and\nanother depends on whether they are fit for purpose, i.e., whether\nthey satisfy the curiosity of the person who is asking the question.\nWith the return of a more robust form of metaphysics, the suggestion\nthat the choice between one type of explanation and another could be\nresolved by disambiguating which sense of causation needs to be\ninvoked in order to satisfy the curiosity of the questioner came to be\ndismissed as an attempt to get away with ontologically light weight\nsolutions to the problem of the relation between the science of mind\nand nature. The predominant problem in the philosophy of mind and\naction became that of how the mind can fit in the natural world, a\nquestion which presupposes the kind of metaphysics that Collingwood\nsought to leave behind.\n\nMuch philosophy of history tends to be governed by an epistemological\nconcern with how historical knowledge is possible beginning from the\nassumption that historical knowledge is knowledge of the past. The\nprimary task of a philosophy of history is consequently taken to be\nthat of explaining how the past can be known given that, unlike the\npresent, it is not available for observation, nor can it be reproduced\nunder experimental conditions. Collingwood’s approach to the\nphilosophy of history is quite different. He denied that a mere\nconcern with the past is sufficient to identify a distinctive subject\nmatter for historical inquiry, one which justifies considering history\nas a science, in the Latin sense of scientia, i.e., a form of\nknowing. The past after all is studied by geologists, as well as\nhistorians so if history is a distinctive form of knowing it must do\nmore than merely study the past. He therefore took the primary task of\na philosophy of history to be that of articulating not an\nepistemological theory accounting for how the past can be known, but\nthat of disambiguating the subject matter of history from that of\nnatural science by applying the presuppositional analysis that he had\nexpounded in An Essay on Metaphysics to historical knowledge.\nThe application of this presuppositional analysis yields the claim\nthat the presuppositions of history are different from those of\nnatural science because reenacting the thoughts of past agents\ninvolves re-thinking conceptual connections. Historians presuppose\nthat past agents are responsive to norms, not that their behaviour\nconforms to natural laws. The task of philosophical analysis is to\nuncover these different presuppositions with a view to showing that\nthere is no conflict between the claims of history and those of\nscience, not because historical explanations are incomplete\nnomological explanations, but because they are complete explanations\nof a different kind, which answer different kinds of questions. This\nof course is not to deny that there are important epistemological\nquestions concerning the past but rather that the distinctive\nepistemology of historical knowing can be articulated only once the\nkind of past with which history is concerned is clearly\nidentified:\n\n\n… a great many things which deeply concern human beings are\nnot, and never have been, traditionally included in the subject-matter\nof history. People are born, eat and breathe and sleep, and beget\nchildren and become ill and recover again, and die; and these things\ninterest them, most of them at any rate, far more than art and\nscience, industry and politics and war. Yet none of these things have\nbeen traditionally regarded as possessing historical interest. Most of\nthem have given rise to institutions like dining and marrying and the\nvarious rituals that surround birth and death, sickness and recovery;\nand of these rituals and institutions people write histories; but the\nhistory of dining is not the history of eating, and the history of\ndeath-rituals is not the history of death. (PH: 46).\n\n\nIf Collingwood’s philosophy of history is an attempt to identify\nthe distinctive subject matter of history and the logical form of\nhistorical judgements, then his metaphilosophy should be understood as\ndefending a form of explanatory pluralism, not a form of historical\nrelativism (D’Oro 2018b). The latter claims that belief systems\nare beyond criticism because truth and falsity are relative to what\ncertain people, at certain times, believe to be true. The former, by\ncontrast, claims that different kinds of explanations are answers to\ndifferent kinds of questions and that the task of philosophical\nanalysis is to undo the conceptual knots in which we get tangled when\nwe fail to order our thoughts with due care. This of course is an\ninterpretative claim that advocates of the radical conversion\nhypothesis (see section 2.3 above) are likely to deny insofar as they\ntend to read Collingwood’s metaphilosophy as articulating not a\ndefence of the autonomy of philosophy, but as dissolving philosophy\ninto a descriptive study of the belief systems that different people\nhad through time.\n",
    "section_title": "3.3 The argument against methodological unity",
    "entry_title": "Robin George Collingwood",
    "hierarchy_title": "Robin George Collingwood || History and Science || Re-enactment",
    "tokenized_text": [
        "history",
        "science",
        "reenactment",
        "argument",
        "methodological",
        "unity",
        "collingwood",
        "philosophy",
        "history",
        "sustained",
        "attempt",
        "delineate",
        "subject",
        "matter",
        "history",
        "subject",
        "matter",
        "captured",
        "adopting",
        "method",
        "natural",
        "science",
        "critical",
        "argument",
        "advanced",
        "john",
        "stuart",
        "mill",
        "distinction",
        "human",
        "natural",
        "science",
        "merely",
        "distinction",
        "degree",
        "accuracy",
        "reached",
        "respective",
        "domain",
        "inquiry",
        "system",
        "logic",
        "mill",
        "argued",
        "subject",
        "matter",
        "psychology",
        "differs",
        "natural",
        "science",
        "psychology",
        "study",
        "human",
        "action",
        "yet",
        "method",
        "psychologist",
        "study",
        "human",
        "action",
        "inductive",
        "method",
        "operative",
        "natural",
        "science",
        "psychologist",
        "predict",
        "human",
        "behaviour",
        "way",
        "natural",
        "scientist",
        "predict",
        "natural",
        "event",
        "inferring",
        "certain",
        "antecedent",
        "condition",
        "empirical",
        "generalisation",
        "generalisation",
        "psychologist",
        "invoke",
        "psychological",
        "rather",
        "natural",
        "law",
        "method",
        "difference",
        "psychology",
        "natural",
        "science",
        "lie",
        "fact",
        "prediction",
        "psychologist",
        "unlike",
        "say",
        "astronomer",
        "imprecise",
        "difference",
        "mill",
        "insufficiently",
        "robust",
        "support",
        "claim",
        "disunity",
        "science",
        "accurate",
        "way",
        "drawing",
        "distinction",
        "psychology",
        "astronomy",
        "deny",
        "psychology",
        "natural",
        "science",
        "acknowledge",
        "two",
        "kind",
        "natural",
        "science",
        "precise",
        "like",
        "astronomy",
        "imprecise",
        "like",
        "psychology",
        "according",
        "mill",
        "way",
        "drawing",
        "distinction",
        "psychology",
        "like",
        "tidology",
        "meteorology",
        "inexact",
        "natural",
        "science",
        "contrast",
        "mill",
        "therefore",
        "two",
        "kind",
        "science",
        "latin",
        "sense",
        "scientia",
        "meaning",
        "two",
        "distinct",
        "kind",
        "knowledge",
        "different",
        "kind",
        "natural",
        "science",
        "exact",
        "inexact",
        "collingwood",
        "rejected",
        "mill",
        "suggestion",
        "reconstruction",
        "thought",
        "historical",
        "agent",
        "pastdirected",
        "empirical",
        "psychology",
        "study",
        "mind",
        "saw",
        "earlier",
        "normative",
        "criteriological",
        "endeavour",
        "understand",
        "past",
        "agent",
        "historically",
        "understand",
        "conceptual",
        "connection",
        "made",
        "reconstructing",
        "thoughtcontext",
        "subject",
        "matter",
        "history",
        "collingwood",
        "claim",
        "merely",
        "human",
        "action",
        "re",
        "gestae",
        "action",
        "widest",
        "sense",
        "word",
        "done",
        "animal",
        "specie",
        "called",
        "human",
        "action",
        "another",
        "sense",
        "word",
        "equally",
        "familiar",
        "narrower",
        "action",
        "done",
        "reasonable",
        "agent",
        "pursuit",
        "end",
        "determined",
        "reason",
        "ph",
        "psychology",
        "understood",
        "mill",
        "essay",
        "metaphysics",
        "collingwood",
        "call",
        "pseudoscience",
        "thought",
        "em",
        "fails",
        "acknowledge",
        "concept",
        "mind",
        "word",
        "gallie",
        "essentially",
        "contested",
        "concept",
        "like",
        "cause",
        "action",
        "science",
        "past",
        "need",
        "disambiguated",
        "say",
        "empirical",
        "psychology",
        "legitimate",
        "scientific",
        "pursuit",
        "subject",
        "matter",
        "empirical",
        "psychology",
        "history",
        "attempt",
        "capture",
        "mind",
        "method",
        "empirical",
        "science",
        "denounced",
        "attempt",
        "one",
        "form",
        "knowledge",
        "trespass",
        "territory",
        "another",
        "distinction",
        "method",
        "history",
        "science",
        "distinction",
        "explanation",
        "psychology",
        "understood",
        "empirical",
        "science",
        "mind",
        "physic",
        "astronomy",
        "distinction",
        "two",
        "different",
        "form",
        "knowing",
        "distinctive",
        "explananda",
        "action",
        "event",
        "actionevent",
        "distinction",
        "designates",
        "therefore",
        "distinction",
        "innerprivate",
        "psychological",
        "process",
        "outwardobservable",
        "phenomenon",
        "two",
        "different",
        "way",
        "knowing",
        "past",
        "qua",
        "action",
        "qua",
        "event",
        "description",
        "past",
        "qua",
        "action",
        "correlative",
        "certain",
        "kind",
        "historical",
        "explanation",
        "description",
        "past",
        "qua",
        "event",
        "correlative",
        "certain",
        "kind",
        "scientificnomological",
        "explanation",
        "actionevent",
        "distinction",
        "vocabulary",
        "essay",
        "philosophical",
        "method",
        "philosophical",
        "distinction",
        "capture",
        "two",
        "separate",
        "class",
        "thing",
        "brings",
        "past",
        "different",
        "description",
        "qua",
        "natural",
        "qua",
        "historical",
        "past",
        "relevance",
        "collingwood",
        "defence",
        "autonomy",
        "history",
        "debate",
        "concerning",
        "unitydisunity",
        "science",
        "brought",
        "attention",
        "wider",
        "audience",
        "w",
        "h",
        "dray",
        "s",
        "dray",
        "located",
        "collingwood",
        "actionevent",
        "distinction",
        "within",
        "context",
        "contemporary",
        "debate",
        "philosophy",
        "social",
        "science",
        "drew",
        "work",
        "collingwood",
        "reject",
        "claim",
        "methodological",
        "unity",
        "advanced",
        "hempel",
        "influential",
        "article",
        "function",
        "general",
        "law",
        "history",
        "hempel",
        "claimed",
        "explanation",
        "history",
        "covertly",
        "nomological",
        "explanation",
        "historian",
        "natural",
        "scientist",
        "rely",
        "upon",
        "general",
        "law",
        "even",
        "explicitly",
        "mention",
        "dray",
        "argued",
        "hempel",
        "failed",
        "see",
        "distinguishes",
        "action",
        "event",
        "explanation",
        "nature",
        "connection",
        "explanans",
        "explanandum",
        "naturalistic",
        "explanation",
        "explanans",
        "antecedent",
        "condition",
        "state",
        "affair",
        "precedes",
        "time",
        "event",
        "whose",
        "cause",
        "said",
        "historical",
        "explanation",
        "action",
        "explanans",
        "logical",
        "ground",
        "action",
        "thought",
        "render",
        "action",
        "intelligible",
        "whilst",
        "s",
        "collingwood",
        "played",
        "important",
        "role",
        "debate",
        "concerning",
        "logical",
        "form",
        "action",
        "explanation",
        "differs",
        "causal",
        "explanation",
        "event",
        "work",
        "became",
        "le",
        "influential",
        "second",
        "half",
        "twentieth",
        "century",
        "neglect",
        "collingwood",
        "account",
        "action",
        "explanation",
        "fallen",
        "linked",
        "change",
        "metaphilosophical",
        "assumption",
        "return",
        "kind",
        "metaphysics",
        "sought",
        "replace",
        "presuppositional",
        "analysis",
        "described",
        "essay",
        "metaphysics",
        "saw",
        "according",
        "collingwood",
        "distinction",
        "explanation",
        "action",
        "event",
        "distinction",
        "different",
        "form",
        "inference",
        "put",
        "essay",
        "metaphysics",
        "different",
        "sens",
        "term",
        "cause",
        "different",
        "explanatory",
        "context",
        "collingwood",
        "metaphysics",
        "absolute",
        "presupposition",
        "committed",
        "form",
        "explanatory",
        "pluralism",
        "different",
        "kind",
        "explanation",
        "compete",
        "answer",
        "different",
        "question",
        "arise",
        "different",
        "presupposition",
        "choice",
        "one",
        "kind",
        "explanation",
        "another",
        "depends",
        "whether",
        "fit",
        "purpose",
        "ie",
        "whether",
        "satisfy",
        "curiosity",
        "person",
        "asking",
        "question",
        "return",
        "robust",
        "form",
        "metaphysics",
        "suggestion",
        "choice",
        "one",
        "type",
        "explanation",
        "another",
        "could",
        "resolved",
        "disambiguating",
        "sense",
        "causation",
        "need",
        "invoked",
        "order",
        "satisfy",
        "curiosity",
        "questioner",
        "came",
        "dismissed",
        "attempt",
        "get",
        "away",
        "ontologically",
        "light",
        "weight",
        "solution",
        "problem",
        "relation",
        "science",
        "mind",
        "nature",
        "predominant",
        "problem",
        "philosophy",
        "mind",
        "action",
        "became",
        "mind",
        "fit",
        "natural",
        "world",
        "question",
        "presupposes",
        "kind",
        "metaphysics",
        "collingwood",
        "sought",
        "leave",
        "behind",
        "much",
        "philosophy",
        "history",
        "tends",
        "governed",
        "epistemological",
        "concern",
        "historical",
        "knowledge",
        "possible",
        "beginning",
        "assumption",
        "historical",
        "knowledge",
        "knowledge",
        "past",
        "primary",
        "task",
        "philosophy",
        "history",
        "consequently",
        "taken",
        "explaining",
        "past",
        "known",
        "given",
        "unlike",
        "present",
        "available",
        "observation",
        "reproduced",
        "experimental",
        "condition",
        "collingwood",
        "approach",
        "philosophy",
        "history",
        "quite",
        "different",
        "denied",
        "mere",
        "concern",
        "past",
        "sufficient",
        "identify",
        "distinctive",
        "subject",
        "matter",
        "historical",
        "inquiry",
        "one",
        "justifies",
        "considering",
        "history",
        "science",
        "latin",
        "sense",
        "scientia",
        "ie",
        "form",
        "knowing",
        "past",
        "studied",
        "geologist",
        "well",
        "historian",
        "history",
        "distinctive",
        "form",
        "knowing",
        "must",
        "merely",
        "study",
        "past",
        "therefore",
        "took",
        "primary",
        "task",
        "philosophy",
        "history",
        "articulating",
        "epistemological",
        "theory",
        "accounting",
        "past",
        "known",
        "disambiguating",
        "subject",
        "matter",
        "history",
        "natural",
        "science",
        "applying",
        "presuppositional",
        "analysis",
        "expounded",
        "essay",
        "metaphysics",
        "historical",
        "knowledge",
        "application",
        "presuppositional",
        "analysis",
        "yield",
        "claim",
        "presupposition",
        "history",
        "different",
        "natural",
        "science",
        "reenacting",
        "thought",
        "past",
        "agent",
        "involves",
        "rethinking",
        "conceptual",
        "connection",
        "historian",
        "presuppose",
        "past",
        "agent",
        "responsive",
        "norm",
        "behaviour",
        "conforms",
        "natural",
        "law",
        "task",
        "philosophical",
        "analysis",
        "uncover",
        "different",
        "presupposition",
        "view",
        "showing",
        "conflict",
        "claim",
        "history",
        "science",
        "historical",
        "explanation",
        "incomplete",
        "nomological",
        "explanation",
        "complete",
        "explanation",
        "different",
        "kind",
        "answer",
        "different",
        "kind",
        "question",
        "course",
        "deny",
        "important",
        "epistemological",
        "question",
        "concerning",
        "past",
        "rather",
        "distinctive",
        "epistemology",
        "historical",
        "knowing",
        "articulated",
        "kind",
        "past",
        "history",
        "concerned",
        "clearly",
        "identified",
        "great",
        "many",
        "thing",
        "deeply",
        "concern",
        "human",
        "being",
        "never",
        "traditionally",
        "included",
        "subjectmatter",
        "history",
        "people",
        "born",
        "eat",
        "breathe",
        "sleep",
        "beget",
        "child",
        "become",
        "ill",
        "recover",
        "die",
        "thing",
        "interest",
        "rate",
        "far",
        "art",
        "science",
        "industry",
        "politics",
        "war",
        "yet",
        "none",
        "thing",
        "traditionally",
        "regarded",
        "possessing",
        "historical",
        "interest",
        "given",
        "rise",
        "institution",
        "like",
        "dining",
        "marrying",
        "various",
        "ritual",
        "surround",
        "birth",
        "death",
        "sickness",
        "recovery",
        "ritual",
        "institution",
        "people",
        "write",
        "history",
        "history",
        "dining",
        "history",
        "eating",
        "history",
        "deathrituals",
        "history",
        "death",
        "ph",
        "collingwood",
        "philosophy",
        "history",
        "attempt",
        "identify",
        "distinctive",
        "subject",
        "matter",
        "history",
        "logical",
        "form",
        "historical",
        "judgement",
        "metaphilosophy",
        "understood",
        "defending",
        "form",
        "explanatory",
        "pluralism",
        "form",
        "historical",
        "relativism",
        "oro",
        "b",
        "latter",
        "claim",
        "belief",
        "system",
        "beyond",
        "criticism",
        "truth",
        "falsity",
        "relative",
        "certain",
        "people",
        "certain",
        "time",
        "believe",
        "true",
        "former",
        "contrast",
        "claim",
        "different",
        "kind",
        "explanation",
        "answer",
        "different",
        "kind",
        "question",
        "task",
        "philosophical",
        "analysis",
        "undo",
        "conceptual",
        "knot",
        "get",
        "tangled",
        "fail",
        "order",
        "thought",
        "due",
        "care",
        "course",
        "interpretative",
        "claim",
        "advocate",
        "radical",
        "conversion",
        "hypothesis",
        "see",
        "section",
        "likely",
        "deny",
        "insofar",
        "tend",
        "read",
        "collingwood",
        "metaphilosophy",
        "articulating",
        "defence",
        "autonomy",
        "philosophy",
        "dissolving",
        "philosophy",
        "descriptive",
        "study",
        "belief",
        "system",
        "different",
        "people",
        "time"
    ]
}