{
    "main_text": "Determinism and Free Will || A Philosophical Inquiry Concerning Human Liberty, 1717\n3.3 A Philosophical Inquiry Concerning Human Liberty, 1717\n\nAt the beginning of his discussion of Collins and determinism Jacopo\nAgnesina remarks: “Determinism is the aspect of Anthony Collins\nthought that has always met with the most success” (Agnesina\n2018: 97). In A Philosophical Inquiry Concerning Human\nLiberty Collins briefly states his position. He rejects the view\nthat there is any freedom from necessity and claims that insofar as\nthere is human freedom it is “liberty or freedom from outward\nimpediment to action”. Such freedom is compatible with\nnecessity. Collins holds that every action has been caused and must\nnecessarily have occurred. The future is as much determined as the\npast. He then gives six arguments for this form of determinism.\n\nThe first of Collins’ arguments has to do with experience.\nDefenders of free will hold that the experience of even ordinary\npeople shows that they choose freely. Collins’ response is much\nthe same as that of Hobbes and Spinoza. He claims that those who say\nsuch things are either not attending to, or not seeing, the causes of\ntheir actions. Collins goes on to claim that some defenders of free\nwill admit that the issues are tangled and not to be resolved by\nappeals to vulgar experience (Collins 1717: 12–31 [1976:\n60–69]).\n\nWilliam Rowe notes that Collins and Clarke share a volitional theory\nof action. Rowe describes the theory in this way: \n\n\nAccording to this theory, actions are of two sorts: thoughts and\nmotions of the body. What makes a thought or bodily motion an action\nis its being preceded by a certain act of will (volitions) which bring\nabout the thought or motion. Volitions, then, are “action\nstarters”. (Rowe 1987: 54) \n\n\nRowe also notes that Collins and Clarke share the assumption that if a\nvolition is causally determined then the person doing the act does not\nhave free will (Rowe 1987: 53). Rowe says that as the two antagonists\nagree on these points, they play little or no part in the debate. But\nthey do explain the strategy that Collins uses to argue that\nexperience actually shows that we are determined. He examines\nexperience under four topics relating to choice and action: (1)\nPerception of Ideas; (2) Judging of Propositions; (3) Willing; and (4)\nDoing as we will. Collins argues that each of these is causally\ndetermined.\n\nHe holds that perception of ideas of sensation and reflection are not\nvoluntary. So, perception can hardly be free. In respect to judging,\nhe claims that we judge in terms of how things appear to us and that\nwe can’t change these appearances. In respect to the will, he\nclaims that there are two questions to be considered. One is whether\nwe are at liberty to will or not. The second is whether we are at\nliberty to will “one or the other of two or more objects”.\nIn respect to the first question, he claims that Locke made a mistake\nin holding that people are at liberty to will because they can suspend\nwilling. So, Collins holds that Locke’s answer to the first\nquestion would be affirmative. Collins claims that suspense of willing\nis as much an act of will as any other. So, his answer is negative. In\nrespect to the second question, Collins argues for a value determinism\nthat makes the answer to the second question negative as well. In\ndefining willing, he remarks: “Willing or preferring is the same\nwith respect to good and evil, that judging is with respect to truth\nor falsehood”. So, if something seems better than the\nalternatives we will choose it. Collins is thus a moral determinist\nwho holds that we must do what seems best to us. In giving his\nnegative answer to his second question, Collins is also rejecting the\nclaim that we could have done otherwise in cases where we have decided\nwhich of the alternative choices is best (Collins 1717: 31–40\n[1976: 69–73]). Collins then proceeds to consider cases where we\ncan see no difference between the objects we are to choose among,\ne.g., which of two eggs we will take. Collins’ response is\nthat:\n\n\nIt is not enough to render things equal to the will, that they are\nequal or alike in themselves. All the various modifications of the\nman, his opinions, prejudices, temper, habit, and circumstances, are\nto be taken in and considered as causes of the election no less than\nthe objects without us among which we chuse; and these will ever\nincline or determine our wills, and make the choice we do make,\npreferable to us, though the external objects of our choice are ever\nso much alike to each other. (Collins 1717: 47 [1976: 77])\n\n\nIf one were truly indifferent one simply would not choose. But once\nthere is a will to choose, the cascade of causes that leads to action\nwill determine the choice one way or the other. What Collins means by\n“doing as we will” is what we do consequent to willing.\nHere again, he finds no freedom from necessity. We do what we have\nwilled unless some external impediment or intervening cause hinders us\nfrom doing so. Finally, he compares the actions of animals to those of\nmen. He claims that while animals are supposed to be necessary agents\nand humans free agents, there is no perceivable difference between\ntheir actions that would allow us to make this distinction (Collins\n1717: 53–57 [1976: 80–82]).\n\nCollins’ second argument is that man is a necessary agent\nbecause all his actions have a beginning. He holds that whatever has a\nbeginning has a cause and all causes are necessary. Collins (as he had\nin the Clarke Collins controversy) also rejects the proposition that\nthe same causes could produce different effects. Thus Collins rejects\nthe doctrine of free will because it violates the basic principle of\ncausal explanations. The third argument claimed that liberty is an\nimperfection. Going back to judging propositions, Collins points out\nthat if we were free, we would be able to judge probable what is\nimprobable, and so on. This is the analog of moral determinism to the\nepistemic realm. Just as we are not free to knowingly choose the worse\nover the better, we cannot affirm that what seems improbable to us is\nprobable. If we could we would be worse off than we are. The fourth\nargument is that liberty is inconsistent with God’s\nforeknowledge. This is again similar to the view that Hobbes held and\nrepeats the assertions of Collins’ first book An Essay\nconcerning the Use of Reason. The fifth is that if man were not a\nnecessary agent, and determined by pleasure and pain, there would be\nno foundation for rewards and punishments. The sixth is that if a man\nwere not a necessary agent he would be ignorant of morality and have\nno motive to practice it. These last two arguments make the point that\ncausality is necessary for the operation of morality in the world, and\nto introduce a causeless free will is to make the teaching of morality\nor its motivation by punishment or reward pointless (Collins 1717:\n57–108 [1976: 82–108]).\n\nJames Harris and Jacopo Agnesina have both argued that the An\nInquiry Concerning Human Liberty was in fact a response to Dr.\nClarke and rational theology. They claim that Collins was attempting\nto demonstrate that determinism follows from Clarke’s first\nprinciples (Agnesina 2011, 2018: 105; Harris 2005: 58). Agnesina has\nalso been at pains to argue that Collins’ determinism is a\nlogical and not just a causal determinism.\n\nAgnesina characterizes the distinction between these two kinds of\ndeterminism in this way. Causal determinists maintain: \n\n\n…that present and future events are determined causally by\ntheir antecedents. This theory has its roots in the principle of\ncausality or the principle of sufficient reason: all events\nhave a sufficient cause that determines them. Thus causal determinism\nexcludes events that arise ex abrupto, but without stating\nthat this is the only possible and conceivable world: unrealized\npossibilities exist that, though they are not logically contradictory,\ncannot come about because they are incompatible with the law of\nnature, that is with the causal chain of events of this world.\nNecessitarianism strengthens causal determinism from just this latter\nstandpoint: all unrealized possibilities are excluded and it is held\nthat the current law of nature is the only possible one. (Agnesina\n2018: 98)\n\n\nIn this regard, he thinks Collin’ position is that of a logical\ndeterminist, and so close to that of Spinoza. O’Higgins claimed\nthat it was possible that Collins did not understand the Spinozistic\nimplications of his position (Collins 1717 [1976: 45 note 114]).\nO’Higgins seems to be suggesting that Collins, if he read\nSpinoza’s  Ethics, might have been confused by the\nbook, even though Collins had also read the critiques of Spinoza by\nPierre Bayle and G. W. Leibniz. Agnesina counters that even if Collins\nhad not read the Ethics, he had read the critiques of Spinoza\nby Bayle and Leibniz and that these critics of Spinoza had clearly\nspelled out the implications of the kind of logical determinism that\nCollins seems perfectly willing to adopt (Agnesina 2018:\n120–125). One problem with taking Collins to be a logical\ndeterminist is that Collins is a compatibilist, thus regarding freedom\nas freedom from outside obstruction. But it would seem that while\ncompatibilism is possible under causal determinism; it is not under\nlogical determinism. But, Hobbes too claimed to be a compatibilist and\nhad the same kind of tendencies towards logical determinism that\nCollins has.\n\nInterestingly, there was only one response to Collins’ book in\nEngland. Samuel Clarke reviewed it and argued that the notion of a\n’necessary agent’ was incoherent, for to be an agent one\nmust be active and Collins’ position was that the humans are\ncompletely passive and thus (in Clarke’s sense) not agents at\nall. Clarke charges that in discussing being able to do otherwise,\nCollins fails to distinguish between physical and moral necessity (see\nHarris 2005: 59). Clarke also complained that Collins treated\nperception as actions, when in fact, perception is passive (Clarke\n1738 [1928: 722]). Clarke develops his own account of free will\narguing that motives, pleasures and pains, reasons and arguments, are\nsimply occasions for the self-moving power that is active to freely\ndetermine action. What we have again is a competing set of\nexplanations for the same phenomena. It appears that Clarke failed to\ntake a number of Collins’ arguments seriously, because the free\nwill arguments being refuted were not his arguments.\n\nIn a series of letters, Collins discussed Clarke’s review of his\nbook with his long time friend and collaborator Pierre Desmaizeaux. He\nhad written up a reply. Eventually, however, Collins concluded that\nClarke had been threatening him with civil action, and that to reply\nwould provide Clarke with the opportunity to do so (Dybikowski 2011:\n260–1, 269 and 281). Consequently, Collins made no reply to\nClarke’s review.\n\nIn 1729 a short book, A Dissertation of Liberty and\nNecessity, with the initials A.C. on the title page, was\npublished. For a number of reasons O’Higgins holds that Collins\nis not the author of this work. O’Higgins first reason for\nrejecting Collins’ authorship is that the book treats the\nsubstance of the soul as unknown—a Lockean doctrine that Collins\nhad rejected. O’Higgins also cites contemporary reviews that\nclaim the arguments of the book are weak compared to the\nInquiry. Jacopo Agnesina agrees with O’Higgins that the\nwork is not by Collins and gives a full discussion of the argument\nover attribution (Agnesina 2018: 125–132, see also Harris 2005:\n60). Still while making claims that Collins would not make about the\nsoul and substance, the arguments are certainly consistent with the\ndeterminist position that Collins was holding in the earlier work. The\nauthor also takes into account at least one of Clarke’s\ncriticisms of the Inquiry.\n\nThe author of A Dissertation remarks that he will \n\n\nattempt to solve the Point of Free Will, by tracing the progress of\nthe Soul through all its Operations which we are conscious of, and\nexamining in each whether “tis Active or Passive”.\n(Collins 1729: 1) \n\n\nThe point is that at every stage in the process, from perception to\naction, we are passive. The author apparently accepted Clarke’s\npoint in his review of Collins’ Inquiry that perception\nis not an action, for he calls it not an ‘action’ but an\n‘operation.’ The author explicitly takes up Clarke’s\nviews when he argues that we are passive in judgment. He quotes Clarke\nat length. Clarke holds that judgment is passive but distinguishes\nbetween judging and acting. The author continues: \n\n\nBut I conceive the doctor here begs the Question, by asserting the\nSelf-motive Power in the Soul without proving it, and then reasons\nfrom it as granted to him. (1729: 6) \n\n\nThe author of A Dissertation thus returns to Clarke a charge\nthat Clarke had made about Collins in his 1717 review of A\nPhilosophical Inquiry Concerning Human Liberty.\n",
    "section_title": "3.3 A Philosophical Inquiry Concerning Human Liberty, 1717",
    "entry_title": "Anthony Collins",
    "hierarchy_title": "Anthony Collins || Determinism and Free Will || A Philosophical Inquiry Concerning Human Liberty, 1717",
    "tokenized_text": [
        "determinism",
        "free",
        "philosophical",
        "inquiry",
        "concerning",
        "human",
        "liberty",
        "philosophical",
        "inquiry",
        "concerning",
        "human",
        "liberty",
        "beginning",
        "discussion",
        "collins",
        "determinism",
        "jacopo",
        "agnesina",
        "remark",
        "determinism",
        "aspect",
        "anthony",
        "collins",
        "thought",
        "always",
        "met",
        "success",
        "agnesina",
        "philosophical",
        "inquiry",
        "concerning",
        "human",
        "liberty",
        "collins",
        "briefly",
        "state",
        "position",
        "reject",
        "view",
        "freedom",
        "necessity",
        "claim",
        "insofar",
        "human",
        "freedom",
        "liberty",
        "freedom",
        "outward",
        "impediment",
        "action",
        "freedom",
        "compatible",
        "necessity",
        "collins",
        "hold",
        "every",
        "action",
        "caused",
        "must",
        "necessarily",
        "occurred",
        "future",
        "much",
        "determined",
        "past",
        "give",
        "six",
        "argument",
        "form",
        "determinism",
        "first",
        "collins",
        "argument",
        "experience",
        "defender",
        "free",
        "hold",
        "experience",
        "even",
        "ordinary",
        "people",
        "show",
        "choose",
        "freely",
        "collins",
        "response",
        "much",
        "hobbes",
        "spinoza",
        "claim",
        "say",
        "thing",
        "either",
        "attending",
        "seeing",
        "cause",
        "action",
        "collins",
        "go",
        "claim",
        "defender",
        "free",
        "admit",
        "issue",
        "tangled",
        "resolved",
        "appeal",
        "vulgar",
        "experience",
        "collins",
        "william",
        "rowe",
        "note",
        "collins",
        "clarke",
        "share",
        "volitional",
        "theory",
        "action",
        "rowe",
        "describes",
        "theory",
        "way",
        "according",
        "theory",
        "action",
        "two",
        "sort",
        "thought",
        "motion",
        "body",
        "make",
        "thought",
        "bodily",
        "motion",
        "action",
        "preceded",
        "certain",
        "act",
        "volition",
        "bring",
        "thought",
        "motion",
        "volition",
        "action",
        "starter",
        "rowe",
        "rowe",
        "also",
        "note",
        "collins",
        "clarke",
        "share",
        "assumption",
        "volition",
        "causally",
        "determined",
        "person",
        "act",
        "free",
        "rowe",
        "rowe",
        "say",
        "two",
        "antagonist",
        "agree",
        "point",
        "play",
        "little",
        "part",
        "debate",
        "explain",
        "strategy",
        "collins",
        "us",
        "argue",
        "experience",
        "actually",
        "show",
        "determined",
        "examines",
        "experience",
        "four",
        "topic",
        "relating",
        "choice",
        "action",
        "perception",
        "idea",
        "judging",
        "proposition",
        "willing",
        "collins",
        "argues",
        "causally",
        "determined",
        "hold",
        "perception",
        "idea",
        "sensation",
        "reflection",
        "voluntary",
        "perception",
        "hardly",
        "free",
        "respect",
        "judging",
        "claim",
        "judge",
        "term",
        "thing",
        "appear",
        "u",
        "change",
        "appearance",
        "respect",
        "claim",
        "two",
        "question",
        "considered",
        "one",
        "whether",
        "liberty",
        "second",
        "whether",
        "liberty",
        "one",
        "two",
        "object",
        "respect",
        "first",
        "question",
        "claim",
        "locke",
        "made",
        "mistake",
        "holding",
        "people",
        "liberty",
        "suspend",
        "willing",
        "collins",
        "hold",
        "locke",
        "answer",
        "first",
        "question",
        "would",
        "affirmative",
        "collins",
        "claim",
        "suspense",
        "willing",
        "much",
        "act",
        "answer",
        "negative",
        "respect",
        "second",
        "question",
        "collins",
        "argues",
        "value",
        "determinism",
        "make",
        "answer",
        "second",
        "question",
        "negative",
        "well",
        "defining",
        "willing",
        "remark",
        "willing",
        "preferring",
        "respect",
        "good",
        "evil",
        "judging",
        "respect",
        "truth",
        "falsehood",
        "something",
        "seems",
        "better",
        "alternative",
        "choose",
        "collins",
        "thus",
        "moral",
        "determinist",
        "hold",
        "must",
        "seems",
        "best",
        "u",
        "giving",
        "negative",
        "answer",
        "second",
        "question",
        "collins",
        "also",
        "rejecting",
        "claim",
        "could",
        "done",
        "otherwise",
        "case",
        "decided",
        "alternative",
        "choice",
        "best",
        "collins",
        "collins",
        "proceeds",
        "consider",
        "case",
        "see",
        "difference",
        "object",
        "choose",
        "among",
        "eg",
        "two",
        "egg",
        "take",
        "collins",
        "response",
        "enough",
        "render",
        "thing",
        "equal",
        "equal",
        "alike",
        "various",
        "modification",
        "man",
        "opinion",
        "prejudice",
        "temper",
        "habit",
        "circumstance",
        "taken",
        "considered",
        "cause",
        "election",
        "le",
        "object",
        "without",
        "u",
        "among",
        "chuse",
        "ever",
        "incline",
        "determine",
        "will",
        "make",
        "choice",
        "make",
        "preferable",
        "u",
        "though",
        "external",
        "object",
        "choice",
        "ever",
        "much",
        "alike",
        "collins",
        "one",
        "truly",
        "indifferent",
        "one",
        "simply",
        "would",
        "choose",
        "choose",
        "cascade",
        "cause",
        "lead",
        "action",
        "determine",
        "choice",
        "one",
        "way",
        "collins",
        "mean",
        "consequent",
        "willing",
        "find",
        "freedom",
        "necessity",
        "willed",
        "unless",
        "external",
        "impediment",
        "intervening",
        "cause",
        "hinders",
        "u",
        "finally",
        "compare",
        "action",
        "animal",
        "men",
        "claim",
        "animal",
        "supposed",
        "necessary",
        "agent",
        "human",
        "free",
        "agent",
        "perceivable",
        "difference",
        "action",
        "would",
        "allow",
        "u",
        "make",
        "distinction",
        "collins",
        "collins",
        "second",
        "argument",
        "man",
        "necessary",
        "agent",
        "action",
        "beginning",
        "hold",
        "whatever",
        "beginning",
        "cause",
        "cause",
        "necessary",
        "collins",
        "clarke",
        "collins",
        "controversy",
        "also",
        "reject",
        "proposition",
        "cause",
        "could",
        "produce",
        "different",
        "effect",
        "thus",
        "collins",
        "reject",
        "doctrine",
        "free",
        "violates",
        "basic",
        "principle",
        "causal",
        "explanation",
        "third",
        "argument",
        "claimed",
        "liberty",
        "imperfection",
        "going",
        "back",
        "judging",
        "proposition",
        "collins",
        "point",
        "free",
        "would",
        "able",
        "judge",
        "probable",
        "improbable",
        "analog",
        "moral",
        "determinism",
        "epistemic",
        "realm",
        "free",
        "knowingly",
        "choose",
        "worse",
        "better",
        "affirm",
        "seems",
        "improbable",
        "u",
        "probable",
        "could",
        "would",
        "worse",
        "fourth",
        "argument",
        "liberty",
        "inconsistent",
        "god",
        "foreknowledge",
        "similar",
        "view",
        "hobbes",
        "held",
        "repeat",
        "assertion",
        "collins",
        "first",
        "book",
        "essay",
        "concerning",
        "use",
        "reason",
        "fifth",
        "man",
        "necessary",
        "agent",
        "determined",
        "pleasure",
        "pain",
        "would",
        "foundation",
        "reward",
        "punishment",
        "sixth",
        "man",
        "necessary",
        "agent",
        "would",
        "ignorant",
        "morality",
        "motive",
        "practice",
        "last",
        "two",
        "argument",
        "make",
        "point",
        "causality",
        "necessary",
        "operation",
        "morality",
        "world",
        "introduce",
        "causeless",
        "free",
        "make",
        "teaching",
        "morality",
        "motivation",
        "punishment",
        "reward",
        "pointless",
        "collins",
        "james",
        "harris",
        "jacopo",
        "agnesina",
        "argued",
        "inquiry",
        "concerning",
        "human",
        "liberty",
        "fact",
        "response",
        "dr",
        "clarke",
        "rational",
        "theology",
        "claim",
        "collins",
        "attempting",
        "demonstrate",
        "determinism",
        "follows",
        "clarke",
        "first",
        "principle",
        "agnesina",
        "harris",
        "agnesina",
        "also",
        "pain",
        "argue",
        "collins",
        "determinism",
        "logical",
        "causal",
        "determinism",
        "agnesina",
        "characterizes",
        "distinction",
        "two",
        "kind",
        "determinism",
        "way",
        "causal",
        "determinist",
        "maintain",
        "that",
        "present",
        "future",
        "event",
        "determined",
        "causally",
        "antecedent",
        "theory",
        "root",
        "principle",
        "causality",
        "principle",
        "sufficient",
        "reason",
        "event",
        "sufficient",
        "cause",
        "determines",
        "thus",
        "causal",
        "determinism",
        "excludes",
        "event",
        "arise",
        "ex",
        "abrupto",
        "without",
        "stating",
        "possible",
        "conceivable",
        "world",
        "unrealized",
        "possibility",
        "exist",
        "though",
        "logically",
        "contradictory",
        "come",
        "incompatible",
        "law",
        "nature",
        "causal",
        "chain",
        "event",
        "world",
        "necessitarianism",
        "strengthens",
        "causal",
        "determinism",
        "latter",
        "standpoint",
        "unrealized",
        "possibility",
        "excluded",
        "held",
        "current",
        "law",
        "nature",
        "possible",
        "one",
        "agnesina",
        "regard",
        "think",
        "collin",
        "position",
        "logical",
        "determinist",
        "close",
        "spinoza",
        "higgins",
        "claimed",
        "possible",
        "collins",
        "understand",
        "spinozistic",
        "implication",
        "position",
        "collins",
        "note",
        "higgins",
        "seems",
        "suggesting",
        "collins",
        "read",
        "spinoza",
        "ethic",
        "might",
        "confused",
        "book",
        "even",
        "though",
        "collins",
        "also",
        "read",
        "critique",
        "spinoza",
        "pierre",
        "bayle",
        "g",
        "w",
        "leibniz",
        "agnesina",
        "counter",
        "even",
        "collins",
        "read",
        "ethic",
        "read",
        "critique",
        "spinoza",
        "bayle",
        "leibniz",
        "critic",
        "spinoza",
        "clearly",
        "spelled",
        "implication",
        "kind",
        "logical",
        "determinism",
        "collins",
        "seems",
        "perfectly",
        "willing",
        "adopt",
        "agnesina",
        "one",
        "problem",
        "taking",
        "collins",
        "logical",
        "determinist",
        "collins",
        "compatibilist",
        "thus",
        "regarding",
        "freedom",
        "freedom",
        "outside",
        "obstruction",
        "would",
        "seem",
        "compatibilism",
        "possible",
        "causal",
        "determinism",
        "logical",
        "determinism",
        "hobbes",
        "claimed",
        "compatibilist",
        "kind",
        "tendency",
        "towards",
        "logical",
        "determinism",
        "collins",
        "interestingly",
        "one",
        "response",
        "collins",
        "book",
        "england",
        "samuel",
        "clarke",
        "reviewed",
        "argued",
        "notion",
        "necessary",
        "agent",
        "incoherent",
        "agent",
        "one",
        "must",
        "active",
        "collins",
        "position",
        "human",
        "completely",
        "passive",
        "thus",
        "clarke",
        "sense",
        "agent",
        "clarke",
        "charge",
        "discussing",
        "able",
        "otherwise",
        "collins",
        "fails",
        "distinguish",
        "physical",
        "moral",
        "necessity",
        "see",
        "harris",
        "clarke",
        "also",
        "complained",
        "collins",
        "treated",
        "perception",
        "action",
        "fact",
        "perception",
        "passive",
        "clarke",
        "clarke",
        "develops",
        "account",
        "free",
        "arguing",
        "motif",
        "pleasure",
        "pain",
        "reason",
        "argument",
        "simply",
        "occasion",
        "selfmoving",
        "power",
        "active",
        "freely",
        "determine",
        "action",
        "competing",
        "set",
        "explanation",
        "phenomenon",
        "appears",
        "clarke",
        "failed",
        "take",
        "number",
        "collins",
        "argument",
        "seriously",
        "free",
        "argument",
        "refuted",
        "argument",
        "series",
        "letter",
        "collins",
        "discussed",
        "clarke",
        "review",
        "book",
        "long",
        "time",
        "friend",
        "collaborator",
        "pierre",
        "desmaizeaux",
        "written",
        "reply",
        "eventually",
        "however",
        "collins",
        "concluded",
        "clarke",
        "threatening",
        "civil",
        "action",
        "reply",
        "would",
        "provide",
        "clarke",
        "opportunity",
        "dybikowski",
        "consequently",
        "collins",
        "made",
        "reply",
        "clarke",
        "review",
        "short",
        "book",
        "dissertation",
        "liberty",
        "necessity",
        "initial",
        "ac",
        "title",
        "page",
        "published",
        "number",
        "reason",
        "higgins",
        "hold",
        "collins",
        "author",
        "work",
        "higgins",
        "first",
        "reason",
        "rejecting",
        "collins",
        "authorship",
        "book",
        "treat",
        "substance",
        "soul",
        "unknowna",
        "lockean",
        "doctrine",
        "collins",
        "rejected",
        "higgins",
        "also",
        "cite",
        "contemporary",
        "review",
        "claim",
        "argument",
        "book",
        "weak",
        "compared",
        "inquiry",
        "jacopo",
        "agnesina",
        "agrees",
        "higgins",
        "work",
        "collins",
        "give",
        "full",
        "discussion",
        "argument",
        "attribution",
        "agnesina",
        "see",
        "also",
        "harris",
        "still",
        "making",
        "claim",
        "collins",
        "would",
        "make",
        "soul",
        "substance",
        "argument",
        "certainly",
        "consistent",
        "determinist",
        "position",
        "collins",
        "holding",
        "earlier",
        "work",
        "author",
        "also",
        "take",
        "account",
        "least",
        "one",
        "clarke",
        "criticism",
        "inquiry",
        "author",
        "dissertation",
        "remark",
        "attempt",
        "solve",
        "point",
        "free",
        "tracing",
        "progress",
        "soul",
        "operation",
        "conscious",
        "examining",
        "whether",
        "ti",
        "active",
        "passive",
        "collins",
        "point",
        "every",
        "stage",
        "process",
        "perception",
        "action",
        "passive",
        "author",
        "apparently",
        "accepted",
        "clarke",
        "point",
        "review",
        "collins",
        "inquiry",
        "perception",
        "action",
        "call",
        "action",
        "operation",
        "author",
        "explicitly",
        "take",
        "clarke",
        "view",
        "argues",
        "passive",
        "judgment",
        "quote",
        "clarke",
        "length",
        "clarke",
        "hold",
        "judgment",
        "passive",
        "distinguishes",
        "judging",
        "acting",
        "author",
        "continues",
        "conceive",
        "doctor",
        "begs",
        "question",
        "asserting",
        "selfmotive",
        "power",
        "soul",
        "without",
        "proving",
        "reason",
        "granted",
        "author",
        "dissertation",
        "thus",
        "return",
        "clarke",
        "charge",
        "clarke",
        "made",
        "collins",
        "review",
        "philosophical",
        "inquiry",
        "concerning",
        "human",
        "liberty"
    ]
}