{
    "main_text": "The Clarke Collins Correspondence (1707–08) || Evaluating the Clarke Collins Correspondence\n2.3 Evaluating the Clarke Collins Correspondence\n\nOne might ask who won the debate? In the eighteenth century, the\nanswer largely depended on whether you were a dualist or a\nmaterialist. If you were a dualist you saw Clarke as the winner. If\nyou were a materialist you saw Collins as the winner. In her 2009\narticle focusing on Collins’ emergentism, Marleen Rozemond gives\nan account of the way she thinks the dialogue proceeded and concludes\nthat Clarke was the victor. She holds that Collins, in fact, conceded\na crucial point and as a result subsequently changed his position.\n\nIn order to understand why she thinks this we need to grasp the\ndistinction Collins makes between numerical and generical powers in\nhis “Reflections on Mr. Clarke’s Second Defence of his\nLetter to Mr Dodwell”. He writes: \n\n\nBy numerical powers I understand such powers as motions and\nfigures of the same species. The power of the eye to contribute\ntowards seeing is a species of motion, and the roundness of a body is\na species of figure. By generical powers I understand all the\nseveral species of numerical powers—as motion signifies\nall the various species of motion, and figure all the various species\nof figure. (Clarke 1738 [1928: 805–806]; Clarke and Collins\n2011: 124–125) \n\n\nRozemond notes that after making this distinction Collins admits that\nall generical powers conform to the Homogeneity Principle. In her 2008\narticle, Rozemond claims that Locke did not accept that emergent\nproperties are possible, because in his proof for the existence of God\nin Chapter 10 of Book IV of An Essay Concerning Human\nUnderstanding he invokes the Homogeneity Principle to show that\nan eternal and Intelligent Being could not be created by matter\n(Rozemond 2008:163). In fact, Clarke draws Collins’ attention to\nthis very passage in the Essay (Clarke 1738 [1928: 837]; Clarke and\nCollins 2011: 170–171). If this were the only reference to the\nHomogeneity Principle in the Essay it would be difficult to see how\nLocke could also maintain that it would be possible for God to cause\nmatter to think even if it were arranged in the right\nway. Clarke’s point to Collins is that on this basis he should\ngive up the idea that thinking matter is possible. I take it that this\nis Rozemond’s point as well and she holds that in saying that\nthe Homogeneity Principle applies to all generical powers, Collins is\nconceding the crucial point.\n\nRozemond notes that there is one other way that Collins could have\nproceeded. \n\n\nOne way to reject Clarke’s position is to reject his qualitative\nconstraints on causation. One could do this by becoming a Humean about\ncausation. Collins did not do this and the world had to wait another\nwhile for Hume. (Rozemond 2009: 186–7) \n\n\nSo, on her view, Collins gives up the possibility of emergent\nproperties and does not have the kind of empiricist theory of\ncausality that Hume has. And there seem to be no other alternatives.\nShe claims that after this Collins substantively changes his position\nby suggesting that consciousness is a mode of motion. She takes this\nto be a quite unattractive version of mind-brain identity theory\n(Rozemond 2009: 187).\n\nThere is, however an alternative view of how the Correspondence ends.\nThis view is that Collins has not changed his position, or at least\nnot changed it in the way Rozemond suggests. He is conceding nothing\nto Clarke. In introducing the distinction between numerical and\ngenerical powers he writes that \n\n\nhaving set forth the entire strength of what can be said against my\ninstances, an answer to it will set this dispute in a clearer light\nthan possibly it has hitherto been, and perhaps give Mr.\nClarke particular satisfaction with relation to the\ninconclusiveness of hiss argument, by detecting what I conceive has\npreviously imposed upon him. (Clarke 1738: [1928: 805], Clarke and\nCollins 2011: 124) \n\n\nHis response to Clarke’s attack on his examples is to make the\ndistinction between numerical and generical properties. This is hardly\nthe words of someone who is about to concede the decisive point being\ndebated.\n\nThere are a couple of possibilities about what Collins has in mind for\nnumerical powers. One is that numerical powers would include both\npowers that conform to the Composition Principle (figure and motion),\nand powers that do not (the power of the eye to see). Generical\npowers, by contrast, simply treat powers that are numerically\ndifferent (such as different kinds of motion) just as motions. Thus,\nall material powers, treated as generical, conform to the Homogeneity\nPrinciple (Clarke 1738 [1928: 806–807]; Clarke and Collins 2011:\n28–30).\n\nThe second possibility, which is what the examples Collins gives\nreally suggest, is that all numerical powers are emergent and do not\nconform to the Composition Principle. All generical powers, on the\nother hand, do conform to the Homogeneity Principle. If the second\ninterpretation is true, Collins thinks that all of Clarke’s\nfirst category powers, or at least his favorite ones, can be treated\nas wholes that have properties not had by the parts. This would indeed\nbe a change of position, but in just the opposite direction to the one\nthat Rozemond supposes. But, even on this second interpretation, all\ngenerical properties conform to the Homogeneity Principle. So, why\nisn’t Collins in trouble in the way Rozemond claims? The answer\nis that the use of the Homogeneity Principle in Locke’s proof\nfor the existence of God is not the only reference to that principle\nin Locke’s Essay.\n\nIn replying to Clarke in “An Answer to Mr. Clarke’s Third\nDefense of A Letter to Mr. Dodell”, Collins points out to Clarke\nthat Locke had distinguished two situations involving the Homogeneity\nPrinciple (Clarke 1738 [1928: 868]; Clarke and Collins 2011:\n220–221). In the proof for the existence of God as an immaterial\nintelligence, the Principle applies in full force to show that matter\ncould not create an eternal, immaterial, intelligent being. The second\ncase is the creation of human thought. In this second case, Locke\nsupposes that an omnipotent, immaterial God exists and that God,\nbecause He is omnipotent, could violate the Principle of Homogeneity.\nIn fact, Locke claims that God has in fact done so – in the case\nof secondary properties, such as color and sound, where what is\nproduced in the mind bears no resemblance to the causes of those ideas\nin the material world or motions in the brain. Thus, Locke holds,\nthere is good reason to think that God could produce thinking\nmatter. He is explicit that there is no contradiction between the two\ncases, knowing as he did that some people thought his use of the\nHomogeneity Principle in the proof for the existence of God ruled out\nthe possibility of thinking matter (Locke 1690: IV. iii. 6 [1975:\n541).  Collins adopts this position as well (Clarke 1738 [1928: 837];\nClarke and Collins 2011: 170–171; see also Uzgalis 2018:\n270–271). If this is right Collins can continue to maintain that\nemergent properties are possible as they are all numerical properties\nand so need not conform to the Homogeneity Principle and actually\nexist and that God’s omnipotence allows him to make matter duly\narranged to think. Clarke, in his next Defense, rejects both\nCollins’ distinction between numerical and generical powers and\nthe Lockean distinction concerning the Homogeneity Principle (Clarke\n1738 [1928: 829–830]; Clarke and Collins: 158–159). He\nclaims in respect to the Homogeneity principle that the reasoning is\nthe same in both cases. Clarke’s view is that even an omnipotent\nGod cannot violate the Homogeneity Principle (Clarke 1738: 901; Clarke\nand Collins 2011: 268–269). As a consequence, he holds that\nemergent properties are not possible, nor can matter think. So. on\nthis alternative view of who won the debate, if the criteria for\nvictory is a concession by one side or the other, the Correspondence\nends not in a victory for Clarke, but in a stand-off. \n\nIn evaluating the controversy, one would have to say that of all the\nencounters between the Newtonians and the free thinkers, the one\nbetween Collins and Clarke was the most philosophically significant\nand influential. O’Higgins holds that Collins is important to us\nmainly because he defends an early version of materialism. While there\nis surely some truth to this, O’Higgins is clearly damning\nCollins with faint praise. What we should recognize is that Collins\nwas indeed a pioneer in trying to show that consciousness is a real\nemergent property of the brain and in this regard certainly showed\nmuch more originality than O’Higgins gives him credit for (see\n note 2).\n One need only compare Locke’s claim that we would need\nrevelation to understand how matter could think and his use of the\nterm ’superaddition’ with Collins account of emergent\nproperties to see what an improvement in explanatory power the latter\nhas over the former. O’Higgins also claims that Collins’\narguments are not very good. This also does not give Collins enough\ncredit. It is true that Collins does give some arguments that are not\nvery good. On the other hand, Collins forced Clarke to clarify his\nposition in a number of respects. He also uncovered a number of weak\npoints in Clarke’s position. Clarke’s poor treatment of\nCollins’ example of the power of a rose to produce a sweet smell\nin us is one example. He answered as if Collins was talking about the\nsmell of the rose and claims that this secondary quality belongs in\nhis second class of properties. But Collins properly objects that he\nwas talking about the organization of the particles of the\nrose—the cause of this effect, and not the effect on us.\nClarke’s response is weak. One of Collins’ strongest\npoints was his critique of Clarke’s doctrine that though the\nsoul is immaterial it is extended (Vailati 1993). One can also see how\nmuch pressure Collins is applying to Clarke’s system as the\nnumber of properties in Clarke’s third class—fictional\nproperties—continues to mount in the course of the\ncorrespondence.\n\nIn respect to the central issues of the debate, Collins is struggling\nto articulate a materialist and empiricist metaphysics that can\ncompete with the well developed dualist, a priori metaphysics\nthat Clarke deploys. As Barresi and Martin comment: \n\n\nHis faltering, but often successful attempts to reformulate\ntraditional metaphysical issues empirically, embodies the birth pangs\nof a new approach. (Martin and Barresi 2000: 51) \n\n\nBut perhaps most strikingly, Collins is attempting to defend a\ndoctrine of emergent properties that does not become prominent in\nEnglish philosophy until Mill’s System of Logic (1843)\nand the twentieth century British Emergentism movement.\n",
    "section_title": "2.3 Evaluating the Clarke Collins Correspondence",
    "entry_title": "Anthony Collins",
    "hierarchy_title": "Anthony Collins || The Clarke Collins Correspondence (1707–08) || Evaluating the Clarke Collins Correspondence",
    "tokenized_text": [
        "clarke",
        "collins",
        "correspondence",
        "evaluating",
        "clarke",
        "collins",
        "correspondence",
        "evaluating",
        "clarke",
        "collins",
        "correspondence",
        "one",
        "might",
        "ask",
        "debate",
        "eighteenth",
        "century",
        "answer",
        "largely",
        "depended",
        "whether",
        "dualist",
        "materialist",
        "dualist",
        "saw",
        "clarke",
        "winner",
        "materialist",
        "saw",
        "collins",
        "winner",
        "article",
        "focusing",
        "collins",
        "emergentism",
        "marleen",
        "rozemond",
        "give",
        "account",
        "way",
        "think",
        "dialogue",
        "proceeded",
        "concludes",
        "clarke",
        "victor",
        "hold",
        "collins",
        "fact",
        "conceded",
        "crucial",
        "point",
        "result",
        "subsequently",
        "changed",
        "position",
        "order",
        "understand",
        "think",
        "need",
        "grasp",
        "distinction",
        "collins",
        "make",
        "numerical",
        "generical",
        "power",
        "reflection",
        "mr",
        "clarke",
        "second",
        "defence",
        "letter",
        "mr",
        "dodwell",
        "writes",
        "numerical",
        "power",
        "understand",
        "power",
        "motion",
        "figure",
        "specie",
        "power",
        "eye",
        "contribute",
        "towards",
        "seeing",
        "specie",
        "motion",
        "roundness",
        "body",
        "specie",
        "figure",
        "generical",
        "power",
        "understand",
        "several",
        "specie",
        "numerical",
        "powersas",
        "motion",
        "signifies",
        "various",
        "specie",
        "motion",
        "figure",
        "various",
        "specie",
        "figure",
        "clarke",
        "clarke",
        "collins",
        "rozemond",
        "note",
        "making",
        "distinction",
        "collins",
        "admits",
        "generical",
        "power",
        "conform",
        "homogeneity",
        "principle",
        "article",
        "rozemond",
        "claim",
        "locke",
        "accept",
        "emergent",
        "property",
        "possible",
        "proof",
        "existence",
        "god",
        "chapter",
        "book",
        "iv",
        "essay",
        "concerning",
        "human",
        "understanding",
        "invokes",
        "homogeneity",
        "principle",
        "show",
        "eternal",
        "intelligent",
        "could",
        "created",
        "matter",
        "rozemond",
        "fact",
        "clarke",
        "draw",
        "collins",
        "attention",
        "passage",
        "essay",
        "clarke",
        "clarke",
        "collins",
        "reference",
        "homogeneity",
        "principle",
        "essay",
        "would",
        "difficult",
        "see",
        "locke",
        "could",
        "also",
        "maintain",
        "would",
        "possible",
        "god",
        "cause",
        "matter",
        "think",
        "even",
        "arranged",
        "right",
        "way",
        "clarke",
        "point",
        "collins",
        "basis",
        "give",
        "idea",
        "thinking",
        "matter",
        "possible",
        "take",
        "rozemond",
        "point",
        "well",
        "hold",
        "saying",
        "homogeneity",
        "principle",
        "applies",
        "generical",
        "power",
        "collins",
        "conceding",
        "crucial",
        "point",
        "rozemond",
        "note",
        "one",
        "way",
        "collins",
        "could",
        "proceeded",
        "one",
        "way",
        "reject",
        "clarke",
        "position",
        "reject",
        "qualitative",
        "constraint",
        "causation",
        "one",
        "could",
        "becoming",
        "humean",
        "causation",
        "collins",
        "world",
        "wait",
        "another",
        "hume",
        "rozemond",
        "view",
        "collins",
        "give",
        "possibility",
        "emergent",
        "property",
        "kind",
        "empiricist",
        "theory",
        "causality",
        "hume",
        "seem",
        "alternative",
        "claim",
        "collins",
        "substantively",
        "change",
        "position",
        "suggesting",
        "consciousness",
        "mode",
        "motion",
        "take",
        "quite",
        "unattractive",
        "version",
        "mindbrain",
        "identity",
        "theory",
        "rozemond",
        "however",
        "alternative",
        "view",
        "correspondence",
        "end",
        "view",
        "collins",
        "changed",
        "position",
        "least",
        "changed",
        "way",
        "rozemond",
        "suggests",
        "conceding",
        "nothing",
        "clarke",
        "introducing",
        "distinction",
        "numerical",
        "generical",
        "power",
        "writes",
        "set",
        "forth",
        "entire",
        "strength",
        "said",
        "instance",
        "answer",
        "set",
        "dispute",
        "clearer",
        "light",
        "possibly",
        "hitherto",
        "perhaps",
        "give",
        "mr",
        "clarke",
        "particular",
        "satisfaction",
        "relation",
        "inconclusiveness",
        "hiss",
        "argument",
        "detecting",
        "conceive",
        "previously",
        "imposed",
        "upon",
        "clarke",
        "clarke",
        "collins",
        "response",
        "clarke",
        "attack",
        "example",
        "make",
        "distinction",
        "numerical",
        "generical",
        "property",
        "hardly",
        "word",
        "someone",
        "concede",
        "decisive",
        "point",
        "debated",
        "couple",
        "possibility",
        "collins",
        "mind",
        "numerical",
        "power",
        "one",
        "numerical",
        "power",
        "would",
        "include",
        "power",
        "conform",
        "composition",
        "principle",
        "figure",
        "motion",
        "power",
        "power",
        "eye",
        "see",
        "generical",
        "power",
        "contrast",
        "simply",
        "treat",
        "power",
        "numerically",
        "different",
        "different",
        "kind",
        "motion",
        "motion",
        "thus",
        "material",
        "power",
        "treated",
        "generical",
        "conform",
        "homogeneity",
        "principle",
        "clarke",
        "clarke",
        "collins",
        "second",
        "possibility",
        "example",
        "collins",
        "give",
        "really",
        "suggest",
        "numerical",
        "power",
        "emergent",
        "conform",
        "composition",
        "principle",
        "generical",
        "power",
        "hand",
        "conform",
        "homogeneity",
        "principle",
        "second",
        "interpretation",
        "true",
        "collins",
        "think",
        "clarke",
        "first",
        "category",
        "power",
        "least",
        "favorite",
        "one",
        "treated",
        "whole",
        "property",
        "part",
        "would",
        "indeed",
        "change",
        "position",
        "opposite",
        "direction",
        "one",
        "rozemond",
        "supposes",
        "even",
        "second",
        "interpretation",
        "generical",
        "property",
        "conform",
        "homogeneity",
        "principle",
        "collins",
        "trouble",
        "way",
        "rozemond",
        "claim",
        "answer",
        "use",
        "homogeneity",
        "principle",
        "locke",
        "proof",
        "existence",
        "god",
        "reference",
        "principle",
        "locke",
        "essay",
        "replying",
        "clarke",
        "answer",
        "mr",
        "clarke",
        "third",
        "defense",
        "letter",
        "mr",
        "dodell",
        "collins",
        "point",
        "clarke",
        "locke",
        "distinguished",
        "two",
        "situation",
        "involving",
        "homogeneity",
        "principle",
        "clarke",
        "clarke",
        "collins",
        "proof",
        "existence",
        "god",
        "immaterial",
        "intelligence",
        "principle",
        "applies",
        "full",
        "force",
        "show",
        "matter",
        "could",
        "create",
        "eternal",
        "immaterial",
        "intelligent",
        "second",
        "case",
        "creation",
        "human",
        "thought",
        "second",
        "case",
        "locke",
        "supposes",
        "omnipotent",
        "immaterial",
        "god",
        "exists",
        "god",
        "omnipotent",
        "could",
        "violate",
        "principle",
        "homogeneity",
        "fact",
        "locke",
        "claim",
        "god",
        "fact",
        "done",
        "case",
        "secondary",
        "property",
        "color",
        "sound",
        "produced",
        "mind",
        "bear",
        "resemblance",
        "cause",
        "idea",
        "material",
        "world",
        "motion",
        "brain",
        "thus",
        "locke",
        "hold",
        "good",
        "reason",
        "think",
        "god",
        "could",
        "produce",
        "thinking",
        "matter",
        "explicit",
        "contradiction",
        "two",
        "case",
        "knowing",
        "people",
        "thought",
        "use",
        "homogeneity",
        "principle",
        "proof",
        "existence",
        "god",
        "ruled",
        "possibility",
        "thinking",
        "matter",
        "locke",
        "iv",
        "iii",
        "collins",
        "adopts",
        "position",
        "well",
        "clarke",
        "clarke",
        "collins",
        "see",
        "also",
        "uzgalis",
        "right",
        "collins",
        "continue",
        "maintain",
        "emergent",
        "property",
        "possible",
        "numerical",
        "property",
        "need",
        "conform",
        "homogeneity",
        "principle",
        "actually",
        "exist",
        "god",
        "omnipotence",
        "allows",
        "make",
        "matter",
        "duly",
        "arranged",
        "think",
        "clarke",
        "next",
        "defense",
        "reject",
        "collins",
        "distinction",
        "numerical",
        "generical",
        "power",
        "lockean",
        "distinction",
        "concerning",
        "homogeneity",
        "principle",
        "clarke",
        "clarke",
        "collins",
        "claim",
        "respect",
        "homogeneity",
        "principle",
        "reasoning",
        "case",
        "clarke",
        "view",
        "even",
        "omnipotent",
        "god",
        "violate",
        "homogeneity",
        "principle",
        "clarke",
        "clarke",
        "collins",
        "consequence",
        "hold",
        "emergent",
        "property",
        "possible",
        "matter",
        "think",
        "alternative",
        "view",
        "debate",
        "criterion",
        "victory",
        "concession",
        "one",
        "side",
        "correspondence",
        "end",
        "victory",
        "clarke",
        "standoff",
        "evaluating",
        "controversy",
        "one",
        "would",
        "say",
        "encounter",
        "newtonian",
        "free",
        "thinker",
        "one",
        "collins",
        "clarke",
        "philosophically",
        "significant",
        "influential",
        "higgins",
        "hold",
        "collins",
        "important",
        "u",
        "mainly",
        "defends",
        "early",
        "version",
        "materialism",
        "surely",
        "truth",
        "higgins",
        "clearly",
        "damning",
        "collins",
        "faint",
        "praise",
        "recognize",
        "collins",
        "indeed",
        "pioneer",
        "trying",
        "show",
        "consciousness",
        "real",
        "emergent",
        "property",
        "brain",
        "regard",
        "certainly",
        "showed",
        "much",
        "originality",
        "higgins",
        "give",
        "credit",
        "see",
        "note",
        "one",
        "need",
        "compare",
        "locke",
        "claim",
        "would",
        "need",
        "revelation",
        "understand",
        "matter",
        "could",
        "think",
        "use",
        "term",
        "superaddition",
        "collins",
        "account",
        "emergent",
        "property",
        "see",
        "improvement",
        "explanatory",
        "power",
        "latter",
        "former",
        "higgins",
        "also",
        "claim",
        "collins",
        "argument",
        "good",
        "also",
        "give",
        "collins",
        "enough",
        "credit",
        "true",
        "collins",
        "give",
        "argument",
        "good",
        "hand",
        "collins",
        "forced",
        "clarke",
        "clarify",
        "position",
        "number",
        "respect",
        "also",
        "uncovered",
        "number",
        "weak",
        "point",
        "clarke",
        "position",
        "clarke",
        "poor",
        "treatment",
        "collins",
        "example",
        "power",
        "rose",
        "produce",
        "sweet",
        "smell",
        "u",
        "one",
        "example",
        "answered",
        "collins",
        "talking",
        "smell",
        "rose",
        "claim",
        "secondary",
        "quality",
        "belongs",
        "second",
        "class",
        "property",
        "collins",
        "properly",
        "object",
        "talking",
        "organization",
        "particle",
        "rosethe",
        "cause",
        "effect",
        "effect",
        "u",
        "clarke",
        "response",
        "weak",
        "one",
        "collins",
        "strongest",
        "point",
        "critique",
        "clarke",
        "doctrine",
        "though",
        "soul",
        "immaterial",
        "extended",
        "vailati",
        "one",
        "also",
        "see",
        "much",
        "pressure",
        "collins",
        "applying",
        "clarke",
        "system",
        "number",
        "property",
        "clarke",
        "third",
        "classfictional",
        "propertiescontinues",
        "mount",
        "course",
        "correspondence",
        "respect",
        "central",
        "issue",
        "debate",
        "collins",
        "struggling",
        "articulate",
        "materialist",
        "empiricist",
        "metaphysics",
        "compete",
        "well",
        "developed",
        "dualist",
        "priori",
        "metaphysics",
        "clarke",
        "deploys",
        "barresi",
        "martin",
        "comment",
        "faltering",
        "often",
        "successful",
        "attempt",
        "reformulate",
        "traditional",
        "metaphysical",
        "issue",
        "empirically",
        "embodies",
        "birth",
        "pang",
        "new",
        "approach",
        "martin",
        "barresi",
        "perhaps",
        "strikingly",
        "collins",
        "attempting",
        "defend",
        "doctrine",
        "emergent",
        "property",
        "become",
        "prominent",
        "english",
        "philosophy",
        "mill",
        "system",
        "logic",
        "twentieth",
        "century",
        "british",
        "emergentism",
        "movement"
    ]
}