{
    "main_text": "Connections to logic and philosophy || Logical knowledge and the complexity of deductive reasoning\n4.7 Logical knowledge and the complexity of deductive reasoning\nThe most direct links between complexity theory and epistemology which have thus far been discussed are mediated by the observation that deciding logical validity (and related properties) is generally a computationally difficult task. For on the one hand, a traditional view in epistemology is that logical knowledge – e.g. knowledge that certain statements are logical validities – is a paradigm case of a priori knowledge. If this is correct, then it would seem that we should credit normal epistemic agents with knowledge of the class of logically valid sentences of systems such as propositional and first-order logic which are commonly taken to underlie everyday reasoning. But on the other hand, the results presented in \n Section 4.2  make clear that the problem of deciding whether \\(\\phi\\) is a validity of one of these systems is computationally intractable.\nThe apparent clash between philosophical views about knowledge which predict that logical validities ought to be easy to come to know (e.g. in virtue of the fact that they do not require empirical confirmation) and the technical fact that the validity and satisfiability problems for even the weakest familiar systems are intractable is the origin of two developments which traditionally have been of interest to epistemologists: the problem of logical omniscience and the study of theories of minimal or bounded rationality.\nThe problem of logical omniscience is often presented as having originated from within the subject known as epistemic logic. In this setting, knowledge is treated as a modal operator \\(K_i\\) where sentences of the form \\(K_i \\phi\\) are assigned the intended interpretation agent \\(i\\) knows that \\(\\phi\\). The goal is to then set down axioms and rules which characterize how we should reason about statements of this form. For instance the principle that knowledge of a statement entails its truth is rendered as \\(K_i \\phi \\rightarrow \\phi\\) and the principle that knowledge of a conjunction entails knowledge of its conjuncts is rendered as \\(K_i(\\phi \\wedge \\psi) \\rightarrow (K_i \\phi \\wedge K_i \\psi)\\). Other principles – e.g. \\(\\neg K_i \\phi \\rightarrow K_i \\neg K_i \\phi\\), which expresses that \\(i\\)’s failure to know \\(\\phi\\) entails that he knows of this failure – are considered more controversial. However the consensus view (e.g., Hintikka 1962; Lenzen 1978; Fagin et al. 1995) is that the most defensible choices of logics of knowledge lie between the modal systems \\(\\textsf{S4}\\) and \\(\\textsf{S5}\\).\nThe precise axiomatization which is adopted for \\(K_i\\) notwithstanding, the use of modal logic to model reasoning about knowledge has the following two consequences:\n\n\n\\(K_i \\phi\\) for all \\(\\phi \\in \\sc{VALID}\\)\n\nif \\(\\Gamma \\models \\phi\\) and \\(K_i \\psi\\) for all \\(\\psi \\in \\Gamma\\), then \\(K_i \\phi\\)\n\n(i) and (ii) respectively report that an agent’s knowledge includes all propositional tautologies and that the set of sentences he knows is closed under logical consequence.[56] Note, however, that both of these results seem prima facie implausible relative to our everyday understanding of knowledge. For on the one hand, not only are there infinitely many distinct propositional tautologies, but there are even relatively short ones which many otherwise normal epistemic agents will fail to recognize as such. And on the other, it is generally acknowledged that the set of sentences which we know or believe (at least in an explicit sense) is not closed under logical consequence. This is often illustrated by observing that an otherwise competent epistemic agent might know the axioms of a mathematical theory (e.g. \\(\\mathsf{PA}\\)) without knowing all of its theorems (e.g. the Infinitude of Primes).\nThe results summarized in Sections \n 4.2 and \n 4.3 underscore just how severe these problems are. Note first that the problem of deciding whether a given formula is a tautology is \\(\\textbf{coNP}\\)-complete, and hence very likely to be intractable. But we have also seen that results from proof complexity strongly suggest that any proof system which an agent is likely to adopt for reasoning about propositional logic (e.g. natural deduction) will be such that there are infinitely many statements whose simplest proofs are of length at least exponential relative to their size. It is thus likely that there will exist ‘short’ tautologies – e.g. with fewer than 100 propositional letters – whose shortest proof in a conventional natural deduction system will be astronomically long. Similar remarks apply to the problem of determining whether a finite set of sentences \\(\\{\\psi_1, \\ldots, \\psi_n\\}\\) is consistent – a task which is surely of epistemic import in everyday reasoning. In particular, it is readily seen that consistency checking is simply a re-description of the canonical \\(\\textbf{NP}\\)-complete problem \\(\\sc{SAT}\\).\nIt is already a consequence of the Cobham-Edmonds Thesis (together with the expected positive answers to Open Questions 1 and 2) that such problems are computationally intractable. But if we abandon the simplifying assumption that everyday reasoning is based on classical propositional logic, then validity and consistency checking only become harder. For instance, if we think that agents can reason about their own knowledge or that of others using a modal logic such as \\(\\mathsf{S4}\\) or \\(\\mathsf{S5}_2\\), then the corresponding validity and satisfiability problems become \\(\\textbf{PSPACE}\\)-complete. And if we assume that they reason in propositional relevance logic, classical first-order logic, or intuitionistic first-order logic, then the validity problem becomes \\(\\textbf{RE}\\)-complete (i.e. as hard as the Halting Problem).\nOne common reaction to these observations is to acknowledge that as plausible as the axioms of traditional epistemic logics may appear, they formalize not our everyday understanding of knowledge but rather an idealized or ‘implicit’ notion more closely resembling ‘knowability in principle’ (e.g. Levesque 1984; Stalnaker 1991; 1999). Another reaction has been to attempt to modify the interpretation of the language of epistemic logic to mitigate the effects of (i) and (ii). This can be achieved by altering the account of semantic validity for the modal language in question – e.g. through the use of so-called impossible worlds (Rantala 1982), awareness models (Fagin and Halpern 1988), or local models (Fagin and Halpern 1988). But although these techniques can be used to circumvent particular cases of (i) and (ii), they also typically complicate the task of explaining why the set of sentences known by an agent may exhibit some potentially desirable closure properties (e.g. that knowledge of a conjunction entails knowledge of its conjuncts).\nAn approach to logical omniscience which explicitly takes computational complexity into account is proposed by Artemov and Kuznets (2014). They suggest that a logic of knowledge should formalize not just statements of the form ‘\\(\\phi\\) is knowable by agent \\(i\\)’ but also ones of the form ‘\\(\\phi\\) is known by agent \\(i\\) on the basis of evidence \\(t\\)’. They then exhibit a family of Justification Logics for reasoning about statements of the latter form which satisfy the so-called Strong Logical Omniscience Test – i.e. if a statement of the form ‘\\(\\phi\\) is known by agent \\(i\\) on the basis of evidence \\(t\\)’ is derivable, then a proof of \\(\\phi\\) can be found in time polynomial in the size of \\(t\\) and \\(\\phi\\).\nThe foregoing modifications to epistemic logic fall broadly within the scope of the subject which has come to be known as bounded rationality – c.f., e.g., (Simon 1957; Simon 1972; Rubinstein 1998; Gigerenzer and Selten 2002; Kahneman 2003). This development can be traced to work in decision theory and cognitive psychology which attempts to take into account that human agents face resource limitations in everyday decision making. The attempt to develop models of decision which take resource limitations into account is sometimes presented as a counterpoint to the normative models of rational choice which are often employed in economics and political science. In this context, decision making is often modeled as a form of optimization. In particular, it is traditionally required that fully rational agents be able to find an optimal choice among an array of alternatives,  the potential infeasibility of carrying out a search amongst them notwithstanding.\nThese developments serve as part of the background to a debate in epistemology which originated with Cherniak’s (1981; 1984; 1986) theory of minimal rationality. Cherniak attempts to provide a characterization of rationality which is responsive to both traditional normative characterizations as well as complexity theoretic results about the difficulty of deductive inference of the sort discussed above. According to his account, a minimally rational agent need only make some of the valid inferences which follow from his beliefs in a proof system for classical logic. He further suggests that the inferences which are selected may depend on the sorts of heuristics considered by cognitive psychologists such as Tversky and Kahneman (1974). As such, Cherniak proposes that the use of heuristics which may be of benefit to an agent in certain circumstances – even potentially unsound ones – should be regarded as falling under a generalized account of rationality informed by computational complexity theory. Related themes are discussed by Harman (1986) and Morton (2004; 2012).\n",
    "section_title": "4.7 Logical knowledge and the complexity of deductive reasoning",
    "entry_title": "Computational Complexity Theory",
    "hierarchy_title": "Computational Complexity Theory || Connections to logic and philosophy || Logical knowledge and the complexity of deductive reasoning",
    "tokenized_text": [
        "connection",
        "logic",
        "philosophy",
        "logical",
        "knowledge",
        "complexity",
        "deductive",
        "reasoning",
        "logical",
        "knowledge",
        "complexity",
        "deductive",
        "reasoning",
        "direct",
        "link",
        "complexity",
        "theory",
        "epistemology",
        "thus",
        "far",
        "discussed",
        "mediated",
        "observation",
        "deciding",
        "logical",
        "validity",
        "related",
        "property",
        "generally",
        "computationally",
        "difficult",
        "task",
        "one",
        "hand",
        "traditional",
        "view",
        "epistemology",
        "logical",
        "knowledge",
        "eg",
        "knowledge",
        "certain",
        "statement",
        "logical",
        "validity",
        "paradigm",
        "case",
        "priori",
        "knowledge",
        "correct",
        "would",
        "seem",
        "credit",
        "normal",
        "epistemic",
        "agent",
        "knowledge",
        "class",
        "logically",
        "valid",
        "sentence",
        "system",
        "propositional",
        "firstorder",
        "logic",
        "commonly",
        "taken",
        "underlie",
        "everyday",
        "reasoning",
        "hand",
        "result",
        "presented",
        "section",
        "make",
        "clear",
        "problem",
        "deciding",
        "whether",
        "phi",
        "validity",
        "one",
        "system",
        "computationally",
        "intractable",
        "apparent",
        "clash",
        "philosophical",
        "view",
        "knowledge",
        "predict",
        "logical",
        "validity",
        "ought",
        "easy",
        "come",
        "know",
        "eg",
        "virtue",
        "fact",
        "require",
        "empirical",
        "confirmation",
        "technical",
        "fact",
        "validity",
        "satisfiability",
        "problem",
        "even",
        "weakest",
        "familiar",
        "system",
        "intractable",
        "origin",
        "two",
        "development",
        "traditionally",
        "interest",
        "epistemologist",
        "problem",
        "logical",
        "omniscience",
        "study",
        "theory",
        "minimal",
        "bounded",
        "rationality",
        "problem",
        "logical",
        "omniscience",
        "often",
        "presented",
        "originated",
        "within",
        "subject",
        "known",
        "epistemic",
        "logic",
        "setting",
        "knowledge",
        "treated",
        "modal",
        "operator",
        "k_i",
        "sentence",
        "form",
        "k_i",
        "phi",
        "assigned",
        "intended",
        "interpretation",
        "agent",
        "i",
        "know",
        "phi",
        "goal",
        "set",
        "axiom",
        "rule",
        "characterize",
        "reason",
        "statement",
        "form",
        "instance",
        "principle",
        "knowledge",
        "statement",
        "entail",
        "truth",
        "rendered",
        "k_i",
        "phi",
        "rightarrow",
        "phi",
        "principle",
        "knowledge",
        "conjunction",
        "entail",
        "knowledge",
        "conjuncts",
        "rendered",
        "k_i",
        "phi",
        "wedge",
        "psi",
        "rightarrow",
        "k_i",
        "phi",
        "wedge",
        "k_i",
        "psi",
        "principle",
        "eg",
        "neg",
        "k_i",
        "phi",
        "rightarrow",
        "k_i",
        "neg",
        "k_i",
        "phi",
        "express",
        "i",
        "failure",
        "know",
        "phi",
        "entail",
        "know",
        "failure",
        "considered",
        "controversial",
        "however",
        "consensus",
        "view",
        "eg",
        "hintikka",
        "lenzen",
        "fagin",
        "et",
        "al",
        "defensible",
        "choice",
        "logic",
        "knowledge",
        "lie",
        "modal",
        "system",
        "textsf",
        "s",
        "textsf",
        "s",
        "precise",
        "axiomatization",
        "adopted",
        "k_i",
        "notwithstanding",
        "use",
        "modal",
        "logic",
        "model",
        "reasoning",
        "knowledge",
        "following",
        "two",
        "consequence",
        "k_i",
        "phi",
        "phi",
        "in",
        "sc",
        "valid",
        "gamma",
        "models",
        "phi",
        "k_i",
        "psi",
        "psi",
        "in",
        "gamma",
        "k_i",
        "phi",
        "ii",
        "respectively",
        "report",
        "agent",
        "knowledge",
        "includes",
        "propositional",
        "tautology",
        "set",
        "sentence",
        "know",
        "closed",
        "logical",
        "consequence",
        "note",
        "however",
        "result",
        "seem",
        "prima",
        "facie",
        "implausible",
        "relative",
        "everyday",
        "understanding",
        "knowledge",
        "one",
        "hand",
        "infinitely",
        "many",
        "distinct",
        "propositional",
        "tautology",
        "even",
        "relatively",
        "short",
        "one",
        "many",
        "otherwise",
        "normal",
        "epistemic",
        "agent",
        "fail",
        "recognize",
        "generally",
        "acknowledged",
        "set",
        "sentence",
        "know",
        "believe",
        "least",
        "explicit",
        "sense",
        "closed",
        "logical",
        "consequence",
        "often",
        "illustrated",
        "observing",
        "otherwise",
        "competent",
        "epistemic",
        "agent",
        "might",
        "know",
        "axiom",
        "mathematical",
        "theory",
        "eg",
        "mathsf",
        "pa",
        "without",
        "knowing",
        "theorem",
        "eg",
        "infinitude",
        "prime",
        "result",
        "summarized",
        "section",
        "underscore",
        "severe",
        "problem",
        "note",
        "first",
        "problem",
        "deciding",
        "whether",
        "given",
        "formula",
        "tautology",
        "textbf",
        "conp",
        "complete",
        "hence",
        "likely",
        "intractable",
        "also",
        "seen",
        "result",
        "proof",
        "complexity",
        "strongly",
        "suggest",
        "proof",
        "system",
        "agent",
        "likely",
        "adopt",
        "reasoning",
        "propositional",
        "logic",
        "eg",
        "natural",
        "deduction",
        "infinitely",
        "many",
        "statement",
        "whose",
        "simplest",
        "proof",
        "length",
        "least",
        "exponential",
        "relative",
        "size",
        "thus",
        "likely",
        "exist",
        "short",
        "tautology",
        "eg",
        "fewer",
        "propositional",
        "letter",
        "whose",
        "shortest",
        "proof",
        "conventional",
        "natural",
        "deduction",
        "system",
        "astronomically",
        "long",
        "similar",
        "remark",
        "apply",
        "problem",
        "determining",
        "whether",
        "finite",
        "set",
        "sentence",
        "psi_",
        "ldots",
        "psi_n",
        "consistent",
        "task",
        "surely",
        "epistemic",
        "import",
        "everyday",
        "reasoning",
        "particular",
        "readily",
        "seen",
        "consistency",
        "checking",
        "simply",
        "redescription",
        "canonical",
        "textbf",
        "np",
        "complete",
        "problem",
        "sc",
        "sat",
        "already",
        "consequence",
        "cobhamedmonds",
        "thesis",
        "together",
        "expected",
        "positive",
        "answer",
        "open",
        "question",
        "problem",
        "computationally",
        "intractable",
        "abandon",
        "simplifying",
        "assumption",
        "everyday",
        "reasoning",
        "based",
        "classical",
        "propositional",
        "logic",
        "validity",
        "consistency",
        "checking",
        "become",
        "harder",
        "instance",
        "think",
        "agent",
        "reason",
        "knowledge",
        "others",
        "using",
        "modal",
        "logic",
        "mathsf",
        "s",
        "mathsf",
        "s",
        "_",
        "corresponding",
        "validity",
        "satisfiability",
        "problem",
        "become",
        "textbf",
        "pspace",
        "complete",
        "assume",
        "reason",
        "propositional",
        "relevance",
        "logic",
        "classical",
        "firstorder",
        "logic",
        "intuitionistic",
        "firstorder",
        "logic",
        "validity",
        "problem",
        "becomes",
        "textbf",
        "complete",
        "ie",
        "hard",
        "halting",
        "problem",
        "one",
        "common",
        "reaction",
        "observation",
        "acknowledge",
        "plausible",
        "axiom",
        "traditional",
        "epistemic",
        "logic",
        "may",
        "appear",
        "formalize",
        "everyday",
        "understanding",
        "knowledge",
        "rather",
        "idealized",
        "implicit",
        "notion",
        "closely",
        "resembling",
        "knowability",
        "principle",
        "eg",
        "levesque",
        "stalnaker",
        "another",
        "reaction",
        "attempt",
        "modify",
        "interpretation",
        "language",
        "epistemic",
        "logic",
        "mitigate",
        "effect",
        "ii",
        "achieved",
        "altering",
        "account",
        "semantic",
        "validity",
        "modal",
        "language",
        "question",
        "eg",
        "use",
        "socalled",
        "impossible",
        "world",
        "rantala",
        "awareness",
        "model",
        "fagin",
        "halpern",
        "local",
        "model",
        "fagin",
        "halpern",
        "although",
        "technique",
        "used",
        "circumvent",
        "particular",
        "case",
        "ii",
        "also",
        "typically",
        "complicate",
        "task",
        "explaining",
        "set",
        "sentence",
        "known",
        "agent",
        "may",
        "exhibit",
        "potentially",
        "desirable",
        "closure",
        "property",
        "eg",
        "knowledge",
        "conjunction",
        "entail",
        "knowledge",
        "conjuncts",
        "approach",
        "logical",
        "omniscience",
        "explicitly",
        "take",
        "computational",
        "complexity",
        "account",
        "proposed",
        "artemov",
        "kuznets",
        "suggest",
        "logic",
        "knowledge",
        "formalize",
        "statement",
        "form",
        "phi",
        "knowable",
        "agent",
        "i",
        "also",
        "one",
        "form",
        "phi",
        "known",
        "agent",
        "i",
        "basis",
        "evidence",
        "t",
        "exhibit",
        "family",
        "justification",
        "logic",
        "reasoning",
        "statement",
        "latter",
        "form",
        "satisfy",
        "socalled",
        "strong",
        "logical",
        "omniscience",
        "test",
        "ie",
        "statement",
        "form",
        "phi",
        "known",
        "agent",
        "i",
        "basis",
        "evidence",
        "t",
        "derivable",
        "proof",
        "phi",
        "found",
        "time",
        "polynomial",
        "size",
        "t",
        "phi",
        "foregoing",
        "modification",
        "epistemic",
        "logic",
        "fall",
        "broadly",
        "within",
        "scope",
        "subject",
        "come",
        "known",
        "bounded",
        "rationality",
        "cf",
        "eg",
        "simon",
        "simon",
        "rubinstein",
        "gigerenzer",
        "selten",
        "kahneman",
        "development",
        "traced",
        "work",
        "decision",
        "theory",
        "cognitive",
        "psychology",
        "attempt",
        "take",
        "account",
        "human",
        "agent",
        "face",
        "resource",
        "limitation",
        "everyday",
        "decision",
        "making",
        "attempt",
        "develop",
        "model",
        "decision",
        "take",
        "resource",
        "limitation",
        "account",
        "sometimes",
        "presented",
        "counterpoint",
        "normative",
        "model",
        "rational",
        "choice",
        "often",
        "employed",
        "economics",
        "political",
        "science",
        "context",
        "decision",
        "making",
        "often",
        "modeled",
        "form",
        "optimization",
        "particular",
        "traditionally",
        "required",
        "fully",
        "rational",
        "agent",
        "able",
        "find",
        "optimal",
        "choice",
        "among",
        "array",
        "alternative",
        "potential",
        "infeasibility",
        "carrying",
        "search",
        "amongst",
        "notwithstanding",
        "development",
        "serve",
        "part",
        "background",
        "debate",
        "epistemology",
        "originated",
        "cherniak",
        "theory",
        "minimal",
        "rationality",
        "cherniak",
        "attempt",
        "provide",
        "characterization",
        "rationality",
        "responsive",
        "traditional",
        "normative",
        "characterization",
        "well",
        "complexity",
        "theoretic",
        "result",
        "difficulty",
        "deductive",
        "inference",
        "sort",
        "discussed",
        "according",
        "account",
        "minimally",
        "rational",
        "agent",
        "need",
        "make",
        "valid",
        "inference",
        "follow",
        "belief",
        "proof",
        "system",
        "classical",
        "logic",
        "suggests",
        "inference",
        "selected",
        "may",
        "depend",
        "sort",
        "heuristic",
        "considered",
        "cognitive",
        "psychologist",
        "tversky",
        "kahneman",
        "cherniak",
        "proposes",
        "use",
        "heuristic",
        "may",
        "benefit",
        "agent",
        "certain",
        "circumstance",
        "even",
        "potentially",
        "unsound",
        "one",
        "regarded",
        "falling",
        "generalized",
        "account",
        "rationality",
        "informed",
        "computational",
        "complexity",
        "theory",
        "related",
        "theme",
        "discussed",
        "harman",
        "morton"
    ]
}