{
    "main_text": "Evaluating Computational Philosophy || Critiques\n4.1 Critiques\n\nAlthough computational instantiations of logic are of an importantly\ndifferent character, simulation—including agent-based\nsimulation—plays a major role in much of computational\nphilosophy. Beyond philosophy, across all disciplines of its\napplication, simulation often raises suspicions.\n\nA standard suspicion of simulation in various fields is that one\n“can prove anything” by manipulation of model structure\nand parameters. The worry is that an anticipated or desired effect\ncould always be “baked in”, programmed as an artefact of\nthe model itself. Production of a simulation would thus demonstrate\nnot the plausibility of a hypothesis or a fact about the world but\nmerely the cleverness of the programmer. In a somewhat different\ncontext, Rodney Brooks has written that the problem with simulations\nis that they are “doomed to succeed” (Brooks & Mataric\n1993).\n\nBut consider a similar critique of logical argument: that one\n“can prove anything” by careful choice of premises and\nrules of inference. The proper response in the case of logical\nargument is to concede the fact that a derivation for any proposition\ncan be produced from carefully chosen premises and rules, but to\nemphasize that it may be difficult or impossible to produce a\nderivation from agreed rules and clear and plausible premises.\n\nA similar response is appropriate here. The effectiveness of\nsimulation as argument depends on the strength of its assumptions and\nthe soundness of its mechanisms just as the effectiveness of logical\nproof depends on the strength of its premises and the validity of its\nrules of inference. The legitimate force of the critique, then, is not\nthat simulation is inherently untrustworthy but simply that the\nassumptions of any simulation are always open to further\nexamination.\n\nAnyone who has attempted computer simulation can testify that it is\noften extremely difficult or impossible to produce an expected effect,\nparticularly a robust effect across a plausible range of parameters\nand with a plausible basic mechanism. Like experiment, simulation can\ndemonstrate both the surprising fragility of a favored hypothesis and\nthe surprising robustness of an unexpected effect.\n\nFar from being “doomed to succeed”, simulations fail quite\nregularly in several important ways (Grim, Rosenberger, Rosenfeld,\nAnderson, & Eason 2013). Two standard forms of simulation failure\nare failure of verification and failure of validation (Kleijnen 1995;\nWindrum, Fabiolo, & Moneta 2007; Sargent 2013). Verification of a\nmodel demands assuring that it accurately reflects design intention.\nIf a computational model is intended to instantiate a particular\ntheory of belief change, for example, it fails verification if it does\nnot accurately represent the dynamics of that theory. Validation is\nperhaps the more difficult demand, particularly for philosophical\ncomputation: that the computational model adequately reflects those\naspects of the real world it is intended to capture or explain.\n\nIf its critics are right, a simple example of verification failure is the original Weisberg and\nMuldoon model of scientific exploration outlined above (Weisberg &\nMuldoon 2009). The model was intended to include two kinds of\nepistemic agents—followers and mavericks—with distinct\npatterns of exploration. Mavericks avoid previously investigated\npoints in their neighborhood. Followers move to neighboring points\nthat have been investigated but that have a higher significance. In\ncontrast to their description in the text, the critics argue, the software\nfor the model used “>=” in place of “>”\nat a crucial place, with the result that followers moved to\nneighboring points with a higher or equal significance, resulting in\ntheir often getting stuck in a very local oscillation (Alexander, Himmelreich, & Thomson 2015). If so, Weisberg and\nMuldoon’s original model fails to match its design\nintention—it fails verification—though some of their\ngeneral conclusions regarding epistemic diversity have been vindicated\nin further studies.\n\nValidation is a very different and more difficult demand: that a\nsimulation model adequately captures relevant aspects of what it is\nintended to model. A common critique of specific models is that they\nare too simple, leaving out some crucial aspect of the modeled\nphenomenon. When properly targeted, this can be an entirely\nappropriate critique. But what it calls for is not the abandonment of\nmodeling but better construction of a better model.\n\n\nIn time…the Cartographers Guilds struck a Map of the Empire\nwhose size was that of the Empire, and which coincided point for point\nwith it. The following Generations, saw that that vast Map was\nUseless…. (Jorge Luis Borges, “On Exactitude in\nScience”, 1946 [1998 English translation: 325])\n\n\nBorges’ story is often quoted in illustration of the fact that\nno model—and no scientific theory—can include all\ncharacteristics of what it is intended to model (Weisberg 2013).\nModels and theories would be useless if they did: the purpose of both\ntheories and models is to present simpler representations or\nmechanisms that capture the relevant features or dynamics of\na phenomenon. What aspects of a phenomenon are in fact the relevant\naspects for understanding that phenomenon calls for evaluative input\noutside of the model. But where relevant aspects are omitted,\nirrelevant aspects included, or unrealistic or artificial constraints\nimposed, what a critique calls for is a better model (Martini &\nPinto 2017; Thicke forthcoming).\n\nThere is one aspect of validation that can sometimes be gauged at the\nlevel of modeling itself and with modeling tools alone. Where the\ntarget is some general phenomenon—opinion polarization or the\nemergence of communication, for example—a model which produces\nthat phenomenon within only a tiny range of parameters should be\nsuspicious. Our estimate of the parameters actually in play in the\nactual phenomenon may be merely intuitive or extremely rough, and the\nreal phenomenon may be ubiquitous in a wide range of settings. In such\na case, it would seem prima facie unlikely that a model which produced\na parallel effect within only a tiny window of parameters could be\ncapturing the general mechanism of a general phenomenon. In such cases\nrobustness testing is called for, a test for one aspect of validation\nthat can still be performed on the computer. To what extent do\nconclusions drawn from the modeling effect hold up under a range of\nparameter variations?\n\nThe Hong-Page model of the value of diversity in exploration, outlined\nabove, has been widely appealed to quite generally as support for\ncognitive diversity in groups. It has been cited in NASA internal\ndocuments, offered in support of diversity requirements at UCLA, and\nappears in an amicus curiae brief before the Supreme Court in\nsupport of promoting diversity in the armed forces (Fisher v. Univ. of\nTexas 2016). But the model is not robust across its several parameters\nto support sweepingly general claims that have been made on its basis\nregarding diversity and ability or expertise (Grim et al. 2019). Is that a problem internal to the model, or an external matter\nof its interpretation or application? There is much to be said for the\nlatter alternative. The model is and remains an interesting\none—interesting often in the ways in which it does show\nsensitivity to different parameters. Thus a failure of one aspect of\nvalidation—robustness—with an eye to one type of general\nclaim can also call for further modelling: modeling intended to\nexplore different effects in different contexts. Rosenstock, Bruner,\nand O’Connor (2017) offer a robustness test for the Zollman\nmodel outlined above. Borg, Frey, Šešelja, and\nStraßer (2018) offer new modeling grounded precisely in a\nrobustness critique of their predecessors.\n\nIt is noteworthy that the simulation failures mentioned have been\ndetected and corrected within the literature of simulation itself.\nThese are effective critiques within disciplines employing simulation,\nrather than from outside. An illustration of a such a case with both\nverification and validation in play is that of the Bruch and Mare\ncritique of the Schelling segregation model and the response to it in\nvan Rooij, Siegel, and Macy (Schelling 1971, 1978; Bruch & Mare\n2006; van de Rijt, Siegel, & Macy 2009). Many aspects of that\nmodel are clearly artificial: a limitation to two groups,\nspatialization on a cellular automata grid, and\n“unhappiness” or moving in terms of a sharp threshold\ncut-off of tolerance for neighbors of the other group. Bruch and Mare\noffered clear empirical evidence that residential preferences do not\nfit a sharp threshold. More importantly, they built a variation of the\nSchelling model in order to show that the Schelling effect disappeared\nwith more realistic preference profiles. What Bruch and Mare\nchallenged, in other words, was validation: not merely that\naspects of the target phenomenon of residential segregation were left\nout (as they would be in any model), but that relevant aspects were\nleft out: differences that made an important difference. Van de Rijt,\nSiegel, and Macy failed to understand why the smooth preference curves\nin Bruch and Mare’s data wouldn’t support rather than\ndefeat a Schelling effect. On investigation they found that they\nwould: Bruch and Mare’s validation claim against Schelling was\nitself founded in a programming error. De Rijt, Siegel and\nMacy’s verdict was that Bruch and Mare’s attack itself\nfailed model verification.\n\nIn the case of both Weisberg and Muldoon, and Bruch and Mare, original\ncode was made freely available to their critics. In both cases, the\noriginal authors recognized the problems revealed, though emphasizing\naspects of their work that survived the criticisms. Here again an\nimportant point is that critiques and responses of this type have\narisen and been addressed within philosophical and scientific\nsimulation itself, working toward better models and practices.\n",
    "section_title": "4.1 Critiques",
    "entry_title": "Computational Philosophy",
    "hierarchy_title": "Computational Philosophy || Evaluating Computational Philosophy || Critiques",
    "tokenized_text": [
        "evaluating",
        "computational",
        "philosophy",
        "critique",
        "critique",
        "although",
        "computational",
        "instantiation",
        "logic",
        "importantly",
        "different",
        "character",
        "simulationincluding",
        "agentbased",
        "simulationplays",
        "major",
        "role",
        "much",
        "computational",
        "philosophy",
        "beyond",
        "philosophy",
        "across",
        "discipline",
        "application",
        "simulation",
        "often",
        "raise",
        "suspicion",
        "standard",
        "suspicion",
        "simulation",
        "various",
        "field",
        "one",
        "prove",
        "anything",
        "manipulation",
        "model",
        "structure",
        "parameter",
        "worry",
        "anticipated",
        "desired",
        "effect",
        "could",
        "always",
        "baked",
        "programmed",
        "artefact",
        "model",
        "production",
        "simulation",
        "would",
        "thus",
        "demonstrate",
        "plausibility",
        "hypothesis",
        "fact",
        "world",
        "merely",
        "cleverness",
        "programmer",
        "somewhat",
        "different",
        "context",
        "rodney",
        "brook",
        "written",
        "problem",
        "simulation",
        "doomed",
        "succeed",
        "brook",
        "mataric",
        "consider",
        "similar",
        "critique",
        "logical",
        "argument",
        "one",
        "prove",
        "anything",
        "careful",
        "choice",
        "premise",
        "rule",
        "inference",
        "proper",
        "response",
        "case",
        "logical",
        "argument",
        "concede",
        "fact",
        "derivation",
        "proposition",
        "produced",
        "carefully",
        "chosen",
        "premise",
        "rule",
        "emphasize",
        "may",
        "difficult",
        "impossible",
        "produce",
        "derivation",
        "agreed",
        "rule",
        "clear",
        "plausible",
        "premise",
        "similar",
        "response",
        "appropriate",
        "effectiveness",
        "simulation",
        "argument",
        "depends",
        "strength",
        "assumption",
        "soundness",
        "mechanism",
        "effectiveness",
        "logical",
        "proof",
        "depends",
        "strength",
        "premise",
        "validity",
        "rule",
        "inference",
        "legitimate",
        "force",
        "critique",
        "simulation",
        "inherently",
        "untrustworthy",
        "simply",
        "assumption",
        "simulation",
        "always",
        "open",
        "examination",
        "anyone",
        "attempted",
        "computer",
        "simulation",
        "testify",
        "often",
        "extremely",
        "difficult",
        "impossible",
        "produce",
        "expected",
        "effect",
        "particularly",
        "robust",
        "effect",
        "across",
        "plausible",
        "range",
        "parameter",
        "plausible",
        "basic",
        "mechanism",
        "like",
        "experiment",
        "simulation",
        "demonstrate",
        "surprising",
        "fragility",
        "favored",
        "hypothesis",
        "surprising",
        "robustness",
        "unexpected",
        "effect",
        "far",
        "doomed",
        "succeed",
        "simulation",
        "fail",
        "quite",
        "regularly",
        "several",
        "important",
        "way",
        "grim",
        "rosenberger",
        "rosenfeld",
        "anderson",
        "eason",
        "two",
        "standard",
        "form",
        "simulation",
        "failure",
        "failure",
        "verification",
        "failure",
        "validation",
        "kleijnen",
        "windrum",
        "fabiolo",
        "moneta",
        "sargent",
        "verification",
        "model",
        "demand",
        "assuring",
        "accurately",
        "reflects",
        "design",
        "intention",
        "computational",
        "model",
        "intended",
        "instantiate",
        "particular",
        "theory",
        "belief",
        "change",
        "example",
        "fails",
        "verification",
        "accurately",
        "represent",
        "dynamic",
        "theory",
        "validation",
        "perhaps",
        "difficult",
        "demand",
        "particularly",
        "philosophical",
        "computation",
        "computational",
        "model",
        "adequately",
        "reflects",
        "aspect",
        "real",
        "world",
        "intended",
        "capture",
        "explain",
        "critic",
        "right",
        "simple",
        "example",
        "verification",
        "failure",
        "original",
        "weisberg",
        "muldoon",
        "model",
        "scientific",
        "exploration",
        "outlined",
        "weisberg",
        "muldoon",
        "model",
        "intended",
        "include",
        "two",
        "kind",
        "epistemic",
        "agentsfollowers",
        "maverickswith",
        "distinct",
        "pattern",
        "exploration",
        "maverick",
        "avoid",
        "previously",
        "investigated",
        "point",
        "neighborhood",
        "follower",
        "move",
        "neighboring",
        "point",
        "investigated",
        "higher",
        "significance",
        "contrast",
        "description",
        "text",
        "critic",
        "argue",
        "software",
        "model",
        "used",
        "place",
        "crucial",
        "place",
        "result",
        "follower",
        "moved",
        "neighboring",
        "point",
        "higher",
        "equal",
        "significance",
        "resulting",
        "often",
        "getting",
        "stuck",
        "local",
        "oscillation",
        "alexander",
        "himmelreich",
        "thomson",
        "weisberg",
        "muldoon",
        "original",
        "model",
        "fails",
        "match",
        "design",
        "intentionit",
        "fails",
        "verificationthough",
        "general",
        "conclusion",
        "regarding",
        "epistemic",
        "diversity",
        "vindicated",
        "study",
        "validation",
        "different",
        "difficult",
        "demand",
        "simulation",
        "model",
        "adequately",
        "capture",
        "relevant",
        "aspect",
        "intended",
        "model",
        "common",
        "critique",
        "specific",
        "model",
        "simple",
        "leaving",
        "crucial",
        "aspect",
        "modeled",
        "phenomenon",
        "properly",
        "targeted",
        "entirely",
        "appropriate",
        "critique",
        "call",
        "abandonment",
        "modeling",
        "better",
        "construction",
        "better",
        "model",
        "timethe",
        "cartographer",
        "guild",
        "struck",
        "map",
        "empire",
        "whose",
        "size",
        "empire",
        "coincided",
        "point",
        "point",
        "following",
        "generation",
        "saw",
        "vast",
        "map",
        "useless",
        "jorge",
        "luis",
        "borges",
        "exactitude",
        "science",
        "english",
        "translation",
        "borges",
        "story",
        "often",
        "quoted",
        "illustration",
        "fact",
        "modeland",
        "scientific",
        "theorycan",
        "include",
        "characteristic",
        "intended",
        "model",
        "weisberg",
        "model",
        "theory",
        "would",
        "useless",
        "purpose",
        "theory",
        "model",
        "present",
        "simpler",
        "representation",
        "mechanism",
        "capture",
        "relevant",
        "feature",
        "dynamic",
        "phenomenon",
        "aspect",
        "phenomenon",
        "fact",
        "relevant",
        "aspect",
        "understanding",
        "phenomenon",
        "call",
        "evaluative",
        "input",
        "outside",
        "model",
        "relevant",
        "aspect",
        "omitted",
        "irrelevant",
        "aspect",
        "included",
        "unrealistic",
        "artificial",
        "constraint",
        "imposed",
        "critique",
        "call",
        "better",
        "model",
        "martini",
        "pinto",
        "thicke",
        "forthcoming",
        "one",
        "aspect",
        "validation",
        "sometimes",
        "gauged",
        "level",
        "modeling",
        "modeling",
        "tool",
        "alone",
        "target",
        "general",
        "phenomenonopinion",
        "polarization",
        "emergence",
        "communication",
        "examplea",
        "model",
        "produce",
        "phenomenon",
        "within",
        "tiny",
        "range",
        "parameter",
        "suspicious",
        "estimate",
        "parameter",
        "actually",
        "play",
        "actual",
        "phenomenon",
        "may",
        "merely",
        "intuitive",
        "extremely",
        "rough",
        "real",
        "phenomenon",
        "may",
        "ubiquitous",
        "wide",
        "range",
        "setting",
        "case",
        "would",
        "seem",
        "prima",
        "facie",
        "unlikely",
        "model",
        "produced",
        "parallel",
        "effect",
        "within",
        "tiny",
        "window",
        "parameter",
        "could",
        "capturing",
        "general",
        "mechanism",
        "general",
        "phenomenon",
        "case",
        "robustness",
        "testing",
        "called",
        "test",
        "one",
        "aspect",
        "validation",
        "still",
        "performed",
        "computer",
        "extent",
        "conclusion",
        "drawn",
        "modeling",
        "effect",
        "hold",
        "range",
        "parameter",
        "variation",
        "hongpage",
        "model",
        "value",
        "diversity",
        "exploration",
        "outlined",
        "widely",
        "appealed",
        "quite",
        "generally",
        "support",
        "cognitive",
        "diversity",
        "group",
        "cited",
        "nasa",
        "internal",
        "document",
        "offered",
        "support",
        "diversity",
        "requirement",
        "ucla",
        "appears",
        "amicus",
        "curia",
        "brief",
        "supreme",
        "court",
        "support",
        "promoting",
        "diversity",
        "armed",
        "force",
        "fisher",
        "v",
        "univ",
        "texas",
        "model",
        "robust",
        "across",
        "several",
        "parameter",
        "support",
        "sweepingly",
        "general",
        "claim",
        "made",
        "basis",
        "regarding",
        "diversity",
        "ability",
        "expertise",
        "grim",
        "et",
        "al",
        "problem",
        "internal",
        "model",
        "external",
        "matter",
        "interpretation",
        "application",
        "much",
        "said",
        "latter",
        "alternative",
        "model",
        "remains",
        "interesting",
        "oneinteresting",
        "often",
        "way",
        "show",
        "sensitivity",
        "different",
        "parameter",
        "thus",
        "failure",
        "one",
        "aspect",
        "validationrobustnesswith",
        "eye",
        "one",
        "type",
        "general",
        "claim",
        "also",
        "call",
        "modelling",
        "modeling",
        "intended",
        "explore",
        "different",
        "effect",
        "different",
        "context",
        "rosenstock",
        "bruner",
        "connor",
        "offer",
        "robustness",
        "test",
        "zollman",
        "model",
        "outlined",
        "borg",
        "frey",
        "šešelja",
        "straßer",
        "offer",
        "new",
        "modeling",
        "grounded",
        "precisely",
        "robustness",
        "critique",
        "predecessor",
        "noteworthy",
        "simulation",
        "failure",
        "mentioned",
        "detected",
        "corrected",
        "within",
        "literature",
        "simulation",
        "effective",
        "critique",
        "within",
        "discipline",
        "employing",
        "simulation",
        "rather",
        "outside",
        "illustration",
        "case",
        "verification",
        "validation",
        "play",
        "bruch",
        "mare",
        "critique",
        "schelling",
        "segregation",
        "model",
        "response",
        "van",
        "rooij",
        "siegel",
        "macy",
        "schelling",
        "bruch",
        "mare",
        "van",
        "de",
        "rijt",
        "siegel",
        "macy",
        "many",
        "aspect",
        "model",
        "clearly",
        "artificial",
        "limitation",
        "two",
        "group",
        "spatialization",
        "cellular",
        "automaton",
        "grid",
        "unhappiness",
        "moving",
        "term",
        "sharp",
        "threshold",
        "cutoff",
        "tolerance",
        "neighbor",
        "group",
        "bruch",
        "mare",
        "offered",
        "clear",
        "empirical",
        "evidence",
        "residential",
        "preference",
        "fit",
        "sharp",
        "threshold",
        "importantly",
        "built",
        "variation",
        "schelling",
        "model",
        "order",
        "show",
        "schelling",
        "effect",
        "disappeared",
        "realistic",
        "preference",
        "profile",
        "bruch",
        "mare",
        "challenged",
        "word",
        "validation",
        "merely",
        "aspect",
        "target",
        "phenomenon",
        "residential",
        "segregation",
        "left",
        "would",
        "model",
        "relevant",
        "aspect",
        "left",
        "difference",
        "made",
        "important",
        "difference",
        "van",
        "de",
        "rijt",
        "siegel",
        "macy",
        "failed",
        "understand",
        "smooth",
        "preference",
        "curve",
        "bruch",
        "mare",
        "data",
        "support",
        "rather",
        "defeat",
        "schelling",
        "effect",
        "investigation",
        "found",
        "would",
        "bruch",
        "mare",
        "validation",
        "claim",
        "schelling",
        "founded",
        "programming",
        "error",
        "de",
        "rijt",
        "siegel",
        "macy",
        "verdict",
        "bruch",
        "mare",
        "attack",
        "failed",
        "model",
        "verification",
        "case",
        "weisberg",
        "muldoon",
        "bruch",
        "mare",
        "original",
        "code",
        "made",
        "freely",
        "available",
        "critic",
        "case",
        "original",
        "author",
        "recognized",
        "problem",
        "revealed",
        "though",
        "emphasizing",
        "aspect",
        "work",
        "survived",
        "criticism",
        "important",
        "point",
        "critique",
        "response",
        "type",
        "arisen",
        "addressed",
        "within",
        "philosophical",
        "scientific",
        "simulation",
        "working",
        "toward",
        "better",
        "model",
        "practice"
    ]
}