{
    "main_text": "Syntax and parsing || Syntax\n2.2 Syntax\nBefore considering how grammatical structure can be represented,\nanalyzed and used, we should ask what basis we might have for\nconsidering a particular grammar “correct”, or a particular sentence\n“grammatical,” in the first place. Of course, these are primarily\nquestions for linguistics proper, but the answers we give certainly\nhave consequences for computational linguistics.\nTraditionally, formal grammars have been designed to capture linguists'\nintuitions about well-formedness as concisely as possible, in a way\nthat also allows generalizations about a particular language (e.g.,\nsubject-auxiliary inversion in English questions) and across languages\n(e.g., a consistent ordering\nof nominal subject, verb, and nominal\nobject for declarative, pragmatically neutral main clauses). Concerning\nlinguists' specific well-formedness judgments, it is worth noting that\nthese are largely in agreement not only with each other, but also with\njudgments of non-linguists—at least for “clearly grammatical” and\n“clearly ungrammatical” sentences (Pinker 2007). Also the discovery\nthat conventional phrase structure supports elegant compositional\ntheories of meaning lends credence to the traditional theoretical\nmethodology.\nHowever, traditional formal grammars have generally not covered any\none language comprehensively, and have drawn sharp boundaries between\nwell-formedness and ill-formedness, when in fact people's (including\nlinguists') grammaticality judgments for many sentences are uncertain\nor equivocal. Moreover, when we seek to process sentences “in the\nwild”, we would like to accommodate regional, genre-specific, and\nregister-dependent variations in language, dialects, and erroneous and\nsloppy language (e.g., misspellings, unpunctuated run-on sentences,\nhesitations and repairs in speech, faulty constituent orderings\nproduced by non-native speakers, and fossilized errors by native\nspeakers, such as “for you and I”—possibly a product of\nschoolteachers inveighing against “you and me” in subject position).\nConsequently linguists' idealized grammars need to be made\nvariation-tolerant in most practical applications. The way this need\nhas typically been met is by admitting a far greater number of phrase\nstructure rules than linguistic parsimony would sanction—say,\n10,000 or more rules instead of a few hundred. These rules are not\ndirectly supplied by linguists (computational or otherwise), but\nrather can be “read off” corpora of written or spoken language that\nhave been decorated by trained annotators (such as linguistics\ngraduate students) with their basic phrasal tree\nstructure. Unsupervised grammar acquisition (often starting with\nPOS-tagged training corpora) is another avenue \n(see section 9), but\nresults are apt to be less satisfactory. In conjunction with\nstatistical training and parsing techniques, this loosening of grammar\nleads to a rather different conception of what comprises a\ngrammatically flawed sentence: It is not necessarily one rejected by\nthe grammar, but one whose analysis requires some rarely used\nrules.\nAs mentioned in section 1.2, the representations of grammars used\nin computational linguistics have varied from procedural ones to ones\ndeveloped in formal linguistics, and systematic, tractably parsable\nvariants developed by computationally oriented linguists. Winograd's\nshrdlu program, for example, contained code in\nhis programmar language expressing,\n\nTo parse a\nsentence, try parsing a noun phrase (NP); if this fails, return NIL,\notherwise try parsing a verb phrase (VP) next and if this fails, or\nsucceeds with words remaining, return NIL, otherwise return success.\n\nSimilarly Woods' grammar for lunar was based on a\ncertain kind of procedurally interpreted transition graph (an\naugmented transition network, or ATN), where the sentence subgraph\nmight contain an edge labeled NP (analyze an NP using the NP\nsubgraph) followed by an edge labeled VP (analogously\ninterpreted). In both cases, local feature values (e.g.,\nthe number and person of a NP and VP) are\nregistered, and checked for agreement as a condition for success. A\nclosely related formalism is that of definite clause grammars (e.g.,\nPereira & Warren 1982), which employ Prolog to assert “facts” such\nas that if the input word sequence contains an NP reaching from\nindex I1 to index I2 and a VP reaching from\nindex I2 to index I3, then the input contains a\nsentence reaching from index I1 to index I3. (Again,\nfeature agreement constraints can be incorporated into such assertions\nas well.) Given the goal of proving the presence of a sentence, the\ngoal-chaining mechanism of Prolog then provides a procedural\ninterpretation of these assertions.\nAt present the most commonly employed declarative representations\nof grammatical structure are context-free grammars\n(CFGs) as defined by Noam Chomsky (1956, 1957), because of\ntheir simplicity and efficient parsability.  Chomsky had argued that\nonly deep linguistic representations are context-free, while surface\nform is generated by transformations (for example, in English\npassivization and in question formation) that result in a\nnon-context-free language. However, it was later shown that on the one\nhand, unrestricted Chomskian transformational grammars allowed for\ncomputationally intractable and even undecidable languages, and on the\nother, that the phenomena regarded by Chomsky as calling for a\ntransformational analysis could be handled within a context-free\nframework by use of suitable features in the specification of\nsyntactic categories. Notably, unbounded movement, such as\nthe apparent movement of the final verb object to the front of the\nsentence in “Which car did Jack urge you to buy?”, was shown to be\nanalyzable in terms of a gap (or slash) feature of\ntype /NP[wh] that is carried by each of the two embedded VPs,\nproviding a pathway for matching the category of the fronted object to\nthe category of the vacated object position. Within\nnon-transformational grammar frameworks, one therefore speaks of\nunbounded (or long-distance) dependencies\ninstead of unbounded movement. At the same time it should be noted\nthat at least some natural languages have been shown to be mildly\ncontext-sensitive (e.g., Dutch and Swiss German exhibit cross-serial\ndependencies where a series of nominals “NP1 NP2 NP3 …”\nneed to be  matched, in the same order, with a subsequent series\nof verbs, “V1 V2 V3 …”).  Grammatical frameworks that\nseem to allow for approximately the right degree of mild context\nsensitivity include Head Grammar, Tree-Adjoining Grammar (TAG),\nCombinatory Categorial Grammar (CCG), and Linear Indexed Grammar\n(LIG). Head grammars allow insertion of a complement between the head\nof a phrase (e.g., the initial verb of a VP, the final noun of a NP,\nor the VP of a sentence) and an already present complement; they were\na historical predecessor of Head-Driven Phrase Structure Grammar\n(HPSG), a type of unification grammar (see below) that has received\nmuch attention in computational linguistics. However, unrestricted\nHPSG can generate the recursively enumerable (in general only\nsemi-decidable) languages.\nA typical (somewhat simplified) sample fragment of a context-free\ngrammar is the following, where phrase types are annotated with\nfeature-value pairs:\n\nS[vform:v]\n →\n NP[pers:p\nnumb:n case:subj] VP[vform:v pers:p\nnumb:n]\n\nVP[vform:v pers:p\nnumb:n]\n →\n V[subcat:_np\nvform:v pers:p numb:n] NP[case:obj]\n\n\nNP[pers:3 numb:n]\n →\n Det[pers:3\nnumb:n] N[numb:n]\n\n NP[numb:n\npers:3 case:c]\n →\n\nName[numb:n pers:3 case:c]\n\n\nHere v, n, p, c are variables that can assume values such\nas ‘past’, ‘pres’, ‘base’,\n‘pastparticiple’, … (i.e., various verb forms),\n‘1’, ‘2’, ‘3’ (1st,\n2nd, and 3rd person), ‘sing’,\n‘plur’, and ‘subj’,\n‘obj’. The subcat feature indicates the\ncomplement requirements of the verb. The lexicon would supply entries\nsuch as\n\n\nV[subcat:_np\n vform:pres numb:sing pers:3]\n\n→\n\nloves\n\n\nDet[pers:3 numb:sing]\n →\n a\n\n\nN[pers:3 numb:sing]\n →\n\nmortal\n\n\nName[pers:3 numb:sing gend:fem case:subj]\n →\n\nThetis,\n\n\n\nallowing, for example, a phrase structure analysis of the sentence\n“Thetis loves a mortal” (where we have omitted the feature\nnames for simplicity, leaving only their values, and ignored the case\nfeature):\n\n \nFigure 1: Syntactic analysis of a sentence as a parse tree\n\nAs a variant of CFGs, dependency grammars (DGs)\nalso enjoy wide popularity. The difference from CFGs is that\nhierarchical grouping is achieved by directly subordinating words to\nwords (allowing for multiple dependents of\na head word), rather than phrases to phrases. For\nexample, in the sentence of figure 1 we would treat Thetis\nand mortal as dependents of loves, using dependency\nlinks labeled subj and obj respectively, and the\ndeterminer a would in turn be a dependent\nof mortal, via a dependency link mod\n(for modifier). Projective dependency grammars are\nones with no crossing dependencies (so that the descendants of a node\nform a continuous text segment), and these generate the same languages\nas CFGs. Significantly, mildly non-projective dependency grammars,\nallowing a head word to dominate two separated blocks, provide the\nsame generative capacity as the previously mentioned mildly\ncontext-sensitive frameworks that are needed for some languages\n(Kuhlmann 2013).\nAs noted at the beginning of this section, traditional formal\ngrammars proved too limited in coverage and too rigid in their\ngrammaticality criteria to provide a basis for robust coverage of\nnatural languages as actually used, and this situation persisted until\nthe advent of probabilistic grammars derived from sizable\nphrase-bracketed corpora (notably the Penn Treebank). The simplest\nexample of this type of grammar is a probabilistic context-free\ngrammar or PCFG. In a PCFG, each phrase structure rule X\n→ Y1 … Yk is assigned a probability,\nviewed as the probability that a constituent of type X will be\nexpanded into a sequence of (immediate) constituents of\ntypes Y1, …, Yk. At the lowest level, the\nexpansion probabilities specify how frequently a given part of speech\n(such as Det, N, or V) will be realized as a particular word. Such a\ngrammar provides not only a structural but also a distributional model\nof language, predicting the frequency of occurrence of various phrase\nsequences and, at the lowest level, word sequences. \nHowever, the simplest models of this type do not model the\nstatistics of actual language corpora very accurately, because the\nexpansion probabilities for a given phrase type (or part of speech) X\nignore the surrounding phrasal context and the more detailed\nproperties (such as head words) of the generated constituents. Yet\ncontext and detailed properties are very influential; for example,\nwhether the final prepositional phrase in “She detected a\nstar with {binoculars, planets}” modifies detected\nor planets is very dependent on word choice. Such modeling\ninaccuracies lead to parsing inaccuracies (see next subsection), and\ntherefore generative grammar models have been refined in various ways,\nfor example (in so-called lexicalized models) allowing for\nspecification of particular phrasal head words in rules, or\n(in tree substitution grammars) allowing expansion of\nnonterminals into subtrees of depth 2 or more. Nevertheless, it seems\nlikely that fully accurate distributional modeling of language would\nneed to take account of semantic content, discourse structure, and\nintentions in communication, not only of phrase\nstructure. Possibly construction grammars (e.g., Goldberg\n2003), which emphasize the coupling between the entrenched patterns of\nlanguage (including ordinary phrase structure, clichés, and\nidioms) and their meanings and discourse function, will provide a\nconceptual basis for building statistical  models of language\nthat are sufficiently accurate to enable more nearly human-like\nparsing accuracy. \n",
    "section_title": "2.2 Syntax",
    "entry_title": "Computational Linguistics",
    "hierarchy_title": "Computational Linguistics || Syntax and parsing || Syntax",
    "tokenized_text": [
        "syntax",
        "parsing",
        "syntax",
        "syntax",
        "considering",
        "grammatical",
        "structure",
        "represented",
        "analyzed",
        "used",
        "ask",
        "basis",
        "might",
        "considering",
        "particular",
        "grammar",
        "correct",
        "particular",
        "sentence",
        "grammatical",
        "first",
        "place",
        "course",
        "primarily",
        "question",
        "linguistics",
        "proper",
        "answer",
        "give",
        "certainly",
        "consequence",
        "computational",
        "linguistics",
        "traditionally",
        "formal",
        "grammar",
        "designed",
        "capture",
        "linguist",
        "intuition",
        "wellformedness",
        "concisely",
        "possible",
        "way",
        "also",
        "allows",
        "generalization",
        "particular",
        "language",
        "eg",
        "subjectauxiliary",
        "inversion",
        "english",
        "question",
        "across",
        "language",
        "eg",
        "consistent",
        "ordering",
        "nominal",
        "subject",
        "verb",
        "nominal",
        "object",
        "declarative",
        "pragmatically",
        "neutral",
        "main",
        "clause",
        "concerning",
        "linguist",
        "specific",
        "wellformedness",
        "judgment",
        "worth",
        "noting",
        "largely",
        "agreement",
        "also",
        "judgment",
        "nonlinguistsat",
        "least",
        "clearly",
        "grammatical",
        "clearly",
        "ungrammatical",
        "sentence",
        "pinker",
        "also",
        "discovery",
        "conventional",
        "phrase",
        "structure",
        "support",
        "elegant",
        "compositional",
        "theory",
        "meaning",
        "lends",
        "credence",
        "traditional",
        "theoretical",
        "methodology",
        "however",
        "traditional",
        "formal",
        "grammar",
        "generally",
        "covered",
        "one",
        "language",
        "comprehensively",
        "drawn",
        "sharp",
        "boundary",
        "wellformedness",
        "illformedness",
        "fact",
        "people",
        "s",
        "including",
        "linguist",
        "grammaticality",
        "judgment",
        "many",
        "sentence",
        "uncertain",
        "equivocal",
        "moreover",
        "seek",
        "process",
        "sentence",
        "wild",
        "would",
        "like",
        "accommodate",
        "regional",
        "genrespecific",
        "registerdependent",
        "variation",
        "language",
        "dialect",
        "erroneous",
        "sloppy",
        "language",
        "eg",
        "misspelling",
        "unpunctuated",
        "runon",
        "sentence",
        "hesitation",
        "repair",
        "speech",
        "faulty",
        "constituent",
        "ordering",
        "produced",
        "nonnative",
        "speaker",
        "fossilized",
        "error",
        "native",
        "speaker",
        "possibly",
        "product",
        "schoolteacher",
        "inveighing",
        "subject",
        "position",
        "consequently",
        "linguist",
        "idealized",
        "grammar",
        "need",
        "made",
        "variationtolerant",
        "practical",
        "application",
        "way",
        "need",
        "typically",
        "met",
        "admitting",
        "far",
        "greater",
        "number",
        "phrase",
        "structure",
        "rule",
        "linguistic",
        "parsimony",
        "would",
        "sanctionsay",
        "rule",
        "instead",
        "hundred",
        "rule",
        "directly",
        "supplied",
        "linguist",
        "computational",
        "otherwise",
        "rather",
        "read",
        "corpus",
        "written",
        "spoken",
        "language",
        "decorated",
        "trained",
        "annotator",
        "linguistics",
        "graduate",
        "student",
        "basic",
        "phrasal",
        "tree",
        "structure",
        "unsupervised",
        "grammar",
        "acquisition",
        "often",
        "starting",
        "postagged",
        "training",
        "corpus",
        "another",
        "avenue",
        "see",
        "section",
        "result",
        "apt",
        "le",
        "satisfactory",
        "conjunction",
        "statistical",
        "training",
        "parsing",
        "technique",
        "loosening",
        "grammar",
        "lead",
        "rather",
        "different",
        "conception",
        "comprises",
        "grammatically",
        "flawed",
        "sentence",
        "necessarily",
        "one",
        "rejected",
        "grammar",
        "one",
        "whose",
        "analysis",
        "requires",
        "rarely",
        "used",
        "rule",
        "mentioned",
        "section",
        "representation",
        "grammar",
        "used",
        "computational",
        "linguistics",
        "varied",
        "procedural",
        "one",
        "one",
        "developed",
        "formal",
        "linguistics",
        "systematic",
        "tractably",
        "parsable",
        "variant",
        "developed",
        "computationally",
        "oriented",
        "linguist",
        "winograd",
        "s",
        "shrdlu",
        "program",
        "example",
        "contained",
        "code",
        "programmar",
        "language",
        "expressing",
        "parse",
        "sentence",
        "try",
        "parsing",
        "noun",
        "phrase",
        "np",
        "fails",
        "return",
        "nil",
        "otherwise",
        "try",
        "parsing",
        "verb",
        "phrase",
        "vp",
        "next",
        "fails",
        "succeeds",
        "word",
        "remaining",
        "return",
        "nil",
        "otherwise",
        "return",
        "success",
        "similarly",
        "wood",
        "grammar",
        "lunar",
        "based",
        "certain",
        "kind",
        "procedurally",
        "interpreted",
        "transition",
        "graph",
        "augmented",
        "transition",
        "network",
        "atn",
        "sentence",
        "subgraph",
        "might",
        "contain",
        "edge",
        "labeled",
        "np",
        "analyze",
        "np",
        "using",
        "np",
        "subgraph",
        "followed",
        "edge",
        "labeled",
        "vp",
        "analogously",
        "interpreted",
        "case",
        "local",
        "feature",
        "value",
        "eg",
        "number",
        "person",
        "np",
        "vp",
        "registered",
        "checked",
        "agreement",
        "condition",
        "success",
        "closely",
        "related",
        "formalism",
        "definite",
        "clause",
        "grammar",
        "eg",
        "pereira",
        "warren",
        "employ",
        "prolog",
        "assert",
        "fact",
        "input",
        "word",
        "sequence",
        "contains",
        "np",
        "reaching",
        "index",
        "i",
        "index",
        "i",
        "vp",
        "reaching",
        "index",
        "i",
        "index",
        "i",
        "input",
        "contains",
        "sentence",
        "reaching",
        "index",
        "i",
        "index",
        "i",
        "feature",
        "agreement",
        "constraint",
        "incorporated",
        "assertion",
        "well",
        "given",
        "goal",
        "proving",
        "presence",
        "sentence",
        "goalchaining",
        "mechanism",
        "prolog",
        "provides",
        "procedural",
        "interpretation",
        "assertion",
        "present",
        "commonly",
        "employed",
        "declarative",
        "representation",
        "grammatical",
        "structure",
        "contextfree",
        "grammar",
        "cfgs",
        "defined",
        "noam",
        "chomsky",
        "simplicity",
        "efficient",
        "parsability",
        "chomsky",
        "argued",
        "deep",
        "linguistic",
        "representation",
        "contextfree",
        "surface",
        "form",
        "generated",
        "transformation",
        "example",
        "english",
        "passivization",
        "question",
        "formation",
        "result",
        "noncontextfree",
        "language",
        "however",
        "later",
        "shown",
        "one",
        "hand",
        "unrestricted",
        "chomskian",
        "transformational",
        "grammar",
        "allowed",
        "computationally",
        "intractable",
        "even",
        "undecidable",
        "language",
        "phenomenon",
        "regarded",
        "chomsky",
        "calling",
        "transformational",
        "analysis",
        "could",
        "handled",
        "within",
        "contextfree",
        "framework",
        "use",
        "suitable",
        "feature",
        "specification",
        "syntactic",
        "category",
        "notably",
        "unbounded",
        "movement",
        "apparent",
        "movement",
        "final",
        "verb",
        "object",
        "front",
        "sentence",
        "car",
        "jack",
        "urge",
        "buy",
        "shown",
        "analyzable",
        "term",
        "gap",
        "slash",
        "feature",
        "type",
        "np",
        "wh",
        "carried",
        "two",
        "embedded",
        "vps",
        "providing",
        "pathway",
        "matching",
        "category",
        "fronted",
        "object",
        "category",
        "vacated",
        "object",
        "position",
        "within",
        "nontransformational",
        "grammar",
        "framework",
        "one",
        "therefore",
        "speaks",
        "unbounded",
        "longdistance",
        "dependency",
        "instead",
        "unbounded",
        "movement",
        "time",
        "noted",
        "least",
        "natural",
        "language",
        "shown",
        "mildly",
        "contextsensitive",
        "eg",
        "dutch",
        "swiss",
        "german",
        "exhibit",
        "crossserial",
        "dependency",
        "series",
        "nominal",
        "np",
        "np",
        "np",
        "need",
        "matched",
        "order",
        "subsequent",
        "series",
        "verb",
        "v",
        "v",
        "v",
        "grammatical",
        "framework",
        "seem",
        "allow",
        "approximately",
        "right",
        "degree",
        "mild",
        "context",
        "sensitivity",
        "include",
        "head",
        "grammar",
        "treeadjoining",
        "grammar",
        "tag",
        "combinatory",
        "categorial",
        "grammar",
        "ccg",
        "linear",
        "indexed",
        "grammar",
        "lig",
        "head",
        "grammar",
        "allow",
        "insertion",
        "complement",
        "head",
        "phrase",
        "eg",
        "initial",
        "verb",
        "vp",
        "final",
        "noun",
        "np",
        "vp",
        "sentence",
        "already",
        "present",
        "complement",
        "historical",
        "predecessor",
        "headdriven",
        "phrase",
        "structure",
        "grammar",
        "hpsg",
        "type",
        "unification",
        "grammar",
        "see",
        "received",
        "much",
        "attention",
        "computational",
        "linguistics",
        "however",
        "unrestricted",
        "hpsg",
        "generate",
        "recursively",
        "enumerable",
        "general",
        "semidecidable",
        "language",
        "typical",
        "somewhat",
        "simplified",
        "sample",
        "fragment",
        "contextfree",
        "grammar",
        "following",
        "phrase",
        "type",
        "annotated",
        "featurevalue",
        "pair",
        "vform",
        "v",
        "np",
        "pers",
        "p",
        "numb",
        "n",
        "case",
        "subj",
        "vp",
        "vform",
        "v",
        "pers",
        "p",
        "numb",
        "n",
        "vp",
        "vform",
        "v",
        "pers",
        "p",
        "numb",
        "n",
        "v",
        "subcat",
        "_np",
        "vform",
        "v",
        "pers",
        "p",
        "numb",
        "n",
        "np",
        "case",
        "obj",
        "np",
        "pers",
        "numb",
        "n",
        "det",
        "pers",
        "numb",
        "n",
        "n",
        "numb",
        "n",
        "np",
        "numb",
        "n",
        "pers",
        "case",
        "c",
        "name",
        "numb",
        "n",
        "pers",
        "case",
        "c",
        "v",
        "n",
        "p",
        "c",
        "variable",
        "assume",
        "value",
        "past",
        "pres",
        "base",
        "pastparticiple",
        "ie",
        "various",
        "verb",
        "form",
        "st",
        "nd",
        "rd",
        "person",
        "sing",
        "plur",
        "subj",
        "obj",
        "subcat",
        "feature",
        "indicates",
        "complement",
        "requirement",
        "verb",
        "lexicon",
        "would",
        "supply",
        "entry",
        "v",
        "subcat",
        "_np",
        "vform",
        "pres",
        "numb",
        "sing",
        "pers",
        "love",
        "det",
        "pers",
        "numb",
        "sing",
        "n",
        "pers",
        "numb",
        "sing",
        "mortal",
        "name",
        "pers",
        "numb",
        "sing",
        "gend",
        "fem",
        "case",
        "subj",
        "thetis",
        "allowing",
        "example",
        "phrase",
        "structure",
        "analysis",
        "sentence",
        "thetis",
        "love",
        "mortal",
        "omitted",
        "feature",
        "name",
        "simplicity",
        "leaving",
        "value",
        "ignored",
        "case",
        "feature",
        "figure",
        "syntactic",
        "analysis",
        "sentence",
        "parse",
        "tree",
        "variant",
        "cfgs",
        "dependency",
        "grammar",
        "dg",
        "also",
        "enjoy",
        "wide",
        "popularity",
        "difference",
        "cfgs",
        "hierarchical",
        "grouping",
        "achieved",
        "directly",
        "subordinating",
        "word",
        "word",
        "allowing",
        "multiple",
        "dependent",
        "head",
        "word",
        "rather",
        "phrase",
        "phrase",
        "example",
        "sentence",
        "figure",
        "would",
        "treat",
        "thetis",
        "mortal",
        "dependent",
        "love",
        "using",
        "dependency",
        "link",
        "labeled",
        "subj",
        "obj",
        "respectively",
        "determiner",
        "would",
        "turn",
        "dependent",
        "mortal",
        "via",
        "dependency",
        "link",
        "mod",
        "modifier",
        "projective",
        "dependency",
        "grammar",
        "one",
        "crossing",
        "dependency",
        "descendant",
        "node",
        "form",
        "continuous",
        "text",
        "segment",
        "generate",
        "language",
        "cfgs",
        "significantly",
        "mildly",
        "nonprojective",
        "dependency",
        "grammar",
        "allowing",
        "head",
        "word",
        "dominate",
        "two",
        "separated",
        "block",
        "provide",
        "generative",
        "capacity",
        "previously",
        "mentioned",
        "mildly",
        "contextsensitive",
        "framework",
        "needed",
        "language",
        "kuhlmann",
        "noted",
        "beginning",
        "section",
        "traditional",
        "formal",
        "grammar",
        "proved",
        "limited",
        "coverage",
        "rigid",
        "grammaticality",
        "criterion",
        "provide",
        "basis",
        "robust",
        "coverage",
        "natural",
        "language",
        "actually",
        "used",
        "situation",
        "persisted",
        "advent",
        "probabilistic",
        "grammar",
        "derived",
        "sizable",
        "phrasebracketed",
        "corpus",
        "notably",
        "penn",
        "treebank",
        "simplest",
        "example",
        "type",
        "grammar",
        "probabilistic",
        "contextfree",
        "grammar",
        "pcfg",
        "pcfg",
        "phrase",
        "structure",
        "rule",
        "x",
        "y",
        "yk",
        "assigned",
        "probability",
        "viewed",
        "probability",
        "constituent",
        "type",
        "x",
        "expanded",
        "sequence",
        "immediate",
        "constituent",
        "type",
        "y",
        "yk",
        "lowest",
        "level",
        "expansion",
        "probability",
        "specify",
        "frequently",
        "given",
        "part",
        "speech",
        "det",
        "n",
        "v",
        "realized",
        "particular",
        "word",
        "grammar",
        "provides",
        "structural",
        "also",
        "distributional",
        "model",
        "language",
        "predicting",
        "frequency",
        "occurrence",
        "various",
        "phrase",
        "sequence",
        "lowest",
        "level",
        "word",
        "sequence",
        "however",
        "simplest",
        "model",
        "type",
        "model",
        "statistic",
        "actual",
        "language",
        "corpus",
        "accurately",
        "expansion",
        "probability",
        "given",
        "phrase",
        "type",
        "part",
        "speech",
        "x",
        "ignore",
        "surrounding",
        "phrasal",
        "context",
        "detailed",
        "property",
        "head",
        "word",
        "generated",
        "constituent",
        "yet",
        "context",
        "detailed",
        "property",
        "influential",
        "example",
        "whether",
        "final",
        "prepositional",
        "phrase",
        "detected",
        "star",
        "binoculars",
        "planet",
        "modifies",
        "detected",
        "planet",
        "dependent",
        "word",
        "choice",
        "modeling",
        "inaccuracy",
        "lead",
        "parsing",
        "inaccuracy",
        "see",
        "next",
        "subsection",
        "therefore",
        "generative",
        "grammar",
        "model",
        "refined",
        "various",
        "way",
        "example",
        "socalled",
        "lexicalized",
        "model",
        "allowing",
        "specification",
        "particular",
        "phrasal",
        "head",
        "word",
        "rule",
        "tree",
        "substitution",
        "grammar",
        "allowing",
        "expansion",
        "nonterminals",
        "subtrees",
        "depth",
        "nevertheless",
        "seems",
        "likely",
        "fully",
        "accurate",
        "distributional",
        "modeling",
        "language",
        "would",
        "need",
        "take",
        "account",
        "semantic",
        "content",
        "discourse",
        "structure",
        "intention",
        "communication",
        "phrase",
        "structure",
        "possibly",
        "construction",
        "grammar",
        "eg",
        "goldberg",
        "emphasize",
        "coupling",
        "entrenched",
        "pattern",
        "language",
        "including",
        "ordinary",
        "phrase",
        "structure",
        "clichés",
        "idiom",
        "meaning",
        "discourse",
        "function",
        "provide",
        "conceptual",
        "basis",
        "building",
        "statistical",
        "model",
        "language",
        "sufficiently",
        "accurate",
        "enable",
        "nearly",
        "humanlike",
        "parsing",
        "accuracy"
    ]
}