{
    "main_text": "Accounts of Concrete Computation || The Semantic Account\n2.3 The Semantic Account\n\nIn our everyday life, we usually employ computations to process\nmeaningful symbols in order to extract information from them. The\nsemantic account of computation turns this practice into a\nmetaphysical doctrine: computation is the processing of\nrepresentations—or at least, the processing of appropriate\nrepresentations in appropriate ways. Opinions as to which\nrepresentational manipulations constitute computation vary a great\ndeal (Fodor 1975; Cummins 1983; Pylyshyn 1984; Churchland and\nSejnowski 1992; Shagrir 2006, forthcoming). What all versions of the\nsemantic account have in common is that they take seriously the\nreference to symbols in Putnam’s original account of computation:\nthere is “no computation without representation” (Fodor\n1981, 180).\n\nThe semantic account may be seen as imposing a further restriction on\nacceptable mappings. In addition to the causal restriction imposed by\nthe causal account (mutatis mutandis for the counterfactual and\ndispositional accounts), the semantic account imposes a semantic\nrestriction. Only physical states that qualify as representations may\nbe mapped onto computational descriptions, thereby qualifying as\ncomputational states. If a state is not representational, it is not\ncomputational either.\n\nThe semantic account is probably the most popular in the philosophy of\nmind, because it appears to best fit what is required of a\nphilosophical account of cognition. Since minds and digital computers\nare generally assumed to manipulate (the right kind of)\nrepresentations, they turn out to compute. Since most other systems\nare generally assumed not to manipulate (the relevant kind of)\nrepresentations, they do not compute. Thus, the semantic account\nappears to accommodate some common intuitions about what does and does\nnot count as a computing system. It keeps minds and computers in while\nleaving most everything else out, thereby vindicating the\ncomputational theory of cognition as a strong and nontrivial\ntheory.\n\nThe semantic account raises three important questions. First, how are\nrepresentations to be individuated? Second, what counts as a\nrepresentation of the relevant kind? Finally, what gives\nrepresentations their semantic content?\n\nThe main debate regarding the individuation of computational states\ndivides internalists from externalists. According to externalists,\ncomputational vehicles are symbols individuated by their wide\ncognitive contents—paradigmatically, the things that the\nsymbols stand for (Burge 1986, Shapiro 1997, Shagrir 2001). By\ncontrast, most internalists maintain that computational vehicles are\nsymbols individuated by narrow cognitive contents (Segal 1991).\nNarrow contents are, roughly speaking, semantic contents defined in\nterms of intrinsic properties of the system. Cognitive\ncontents, in turn, are contents ascribed to a system by a cognitive\npsychological theory. For instance, the cognitive contents of the\nvisual system are visual contents, whereas the cognitive contents of\nthe auditory system are auditory contents.\n\nTo illustrate the dispute, consider two physically identical cognitive\nsystems A and B. Among the symbols processed by A\nis symbol S. A produces instances of S whenever\nA is in front of bodies of water, when A is thinking of\nwater, when A is forming plans to interact with water, and so\non. In short, symbol S appears to stand for water. Every time\nA processes S, system B processes symbol\nS′, which is physically identical to S. But system\nB lives in an environment different from A’s\nenvironment. Whenever A is surrounded by water, B is\nsurrounded by twin-water, which is a substance superficially\nindistinguishable, yet physically different, from water. Thus, symbol\nS′ appears to stand for twin-water (cf. Putnam 1975b). In\nsummary, A and B live in relevantly different\nenvironments, such that S appears to stand for water while\nS′ appears to stand for twin-water; A processes\nS in the same way that B processes S′; and\nthere is no intrinsic physical difference between A and\nB or between S and S′.\n\nAccording to externalists, when A is processing S and\nB is processing S′, they are in computational\nstates of different types. According to internalists, A\nand B are in computational states of the same type. In\nother words, externalists maintain that computational states are\nindividuated in part by their reference, which is determined at least\nin part by physical properties external to the system. By contrast,\ninternalists maintain that computational states are individuated in a\nway that depends solely on the intrinsic physical properties of\ncognitive systems.\n\nSo far, externalists and internalists agree on one thing:\ncomputational states are individuated by cognitive contents.\nThis requirement can be relaxed without abandoning the semantic\naccount of computation. According to Egan (1999), computational\nvehicles are not individuated by cognitive contents of any kind,\nwhether wide or narrow. Rather, they are individuated by their\nmathematical contents—that is, mathematical functions and\nobjects ascribed as semantic contents to the computational vehicles by\na computational theory of the system. Since mathematical contents are\nthe same across physical duplicates, Egan maintains that her\nmathematical contents are a kind of narrow content—she is a kind\nof internalist.\n\nLet us now turn to what counts as a representation. This debate is\nless clearly delineated. According to some authors, only structures\nthat have a language-like combinatorial syntax, which supports a\ncompositional semantics, count as computational vehicles, and only\nmanipulations that respect the semantic properties of such structures\ncount as computations (Fodor 1975, Pylyshyn 1984). This suggestion\nflies in the face of both computability theory and analog computation\n(Maley forthcoming), neither of which impose any such requirement on\nwhat counts as a computational vehicle.\n\nOther authors are more inclusive on what kinds of manipulations on\nrepresentations count as computations, but they have not been\nespecially successful in drawing the line between computational and\nnon-computational processes. Few would include all manipulations of\nrepresentations—including, say, painting a picture or recording\na speech—as computations, but there is no consensus on where to\ndraw the boundary between representational manipulations that count as\ncomputations and representational manipulations that do not.\n\nA third question is what gives representations their semantic content.\nThere are three families of views. Instrumentalists believe that\nascribing semantic content to things is just heuristically useful for\nprediction and explanation; semantic properties are not real\nproperties of computational states (e.g., Dennett 1987, Egan 2010).\nRealists who are not naturalists believe semantic properties are real\nproperties of computational states, but they are irreducible to\nnon-semantic properties. Finally, realists who are also naturalists\nbelieve semantic properties are both real and reducible to\nnon-semantic properties, though they disagree on exactly how to reduce\nthem (e.g., Fodor 2008, Harman 1987).\n\nThe semantic account of computation is closely related to the common\nview that computation is information processing. This idea is less\nclear than it may seem, because there are several relevant notions of\ninformation. The connection between information processing and\ncomputation is different depending on which notion of information is\nat stake. What follows is a brief disambiguation of the view that\ncomputation is information processing based on four relevant notions\nof information (cf. Piccinini and Scarantino 2011).\n\nInformation in the sense of thermodynamics is closely related to\nthermodynamic entropy. Entropy is a property of every physical\nsystem. Thermodynamic entropy is, roughly, a measure of an observer’s\nuncertainty about the microscopic state of a system after she\nconsiders the observable macroscopic properties of the system. The\nstudy of the thermodynamics of computation is a lively field with many\nimplications in the foundations of physics (Leff and Rex 2003). In\nthis thermodynamic sense of “information,” any difference\nbetween two distinguishable states of a system may be said to carry\ninformation. Computation may well be said to be information processing\nin this sense, but this has little to do with semantics properly so\ncalled. However, the connections between thermodynamics, computation,\nand information theory are one possible source of inspiration for the\nview that every physical system is a computing system (see Section\n3.4).\nInformation in the sense of information theory is a measure of the\nlikelihood that a given event occurs, and the mutual information of\ntwo random variables is a measure of the mutual dependence between the\nvariables (Shannon and Weaver 1949). These measures can then be used\nto analyze and design robust communication systems that reliably\ntransfer signals in the presence of noise. Computation may well be\nsaid to be information processing in this sense as well. Again, this\nis not explicitly about semantics. But mutual information can tell us\nhow much information a variable carries about another, so mutual\ninformation may be the basis for a notion of semantic information\ncarried by a variable about another (cf. Isaac 2019).\nInformation in one semantic sense is approximately the same as\n“natural meaning” (Grice 1957). A signal carries\ninformation in this sense just in case it reliably correlates with a\nsource (Dretske 1981). The view that computation is information\nprocessing in this sense is prima facie implausible, because many\ncomputations—such as arithmetical calculations carried out on\ndigital computers—do not seem to carry any natural meaning.\nNevertheless, this notion of semantic information is relevant here\nbecause it has been used by some theorists to ground an account of\nrepresentation (Dretske 1981, Fodor 2008).\nInformation in another semantic sense is just ordinary semantic\ncontent or “non-natural meaning” (Grice 1957). This is the\nkind of semantic content that most philosophers discuss. The view that\ncomputation is information processing in this sense is similar to a\ngeneric semantic account of computation.\n\n\nAlthough the semantic account of computation appears to fit the needs\nof philosophers of mind, it appears less suited to make sense of other\nsciences. Most pertinently, representation does not seem to be\npresupposed by the notion of computation employed in at least some\nareas of cognitive science as well as computability theory and\ncomputer science—the very sciences that gave rise to the notion\nof computation and the origin of the computational theory of cognition\n(Fresco 2010). If this is correct, the semantic account may not even\nbe adequate to the needs of philosophers of mind—at least those\nphilosophers of mind who wish to make sense of the analogy between\nminds and the systems designed and studied by computer scientists and\ncomputability theorists. Another criticism of the semantic account is\nthat specifying the kind of representation and representational\nmanipulation that is relevant to computation may require a\nnon-semantic way of individuating computations (Piccinini 2004). These\nconcerns motivate efforts to account for computation in non-semantic\nterms.\n",
    "section_title": "2.3 The Semantic Account",
    "entry_title": "Computation in Physical Systems",
    "hierarchy_title": "Computation in Physical Systems || Accounts of Concrete Computation || The Semantic Account",
    "tokenized_text": [
        "account",
        "concrete",
        "computation",
        "semantic",
        "account",
        "semantic",
        "account",
        "everyday",
        "life",
        "usually",
        "employ",
        "computation",
        "process",
        "meaningful",
        "symbol",
        "order",
        "extract",
        "information",
        "semantic",
        "account",
        "computation",
        "turn",
        "practice",
        "metaphysical",
        "doctrine",
        "computation",
        "processing",
        "representationsor",
        "least",
        "processing",
        "appropriate",
        "representation",
        "appropriate",
        "way",
        "opinion",
        "representational",
        "manipulation",
        "constitute",
        "computation",
        "vary",
        "great",
        "deal",
        "fodor",
        "cummins",
        "pylyshyn",
        "churchland",
        "sejnowski",
        "shagrir",
        "forthcoming",
        "version",
        "semantic",
        "account",
        "common",
        "take",
        "seriously",
        "reference",
        "symbol",
        "putnam",
        "original",
        "account",
        "computation",
        "computation",
        "without",
        "representation",
        "fodor",
        "semantic",
        "account",
        "may",
        "seen",
        "imposing",
        "restriction",
        "acceptable",
        "mapping",
        "addition",
        "causal",
        "restriction",
        "imposed",
        "causal",
        "account",
        "mutatis",
        "mutandis",
        "counterfactual",
        "dispositional",
        "account",
        "semantic",
        "account",
        "imposes",
        "semantic",
        "restriction",
        "physical",
        "state",
        "qualify",
        "representation",
        "may",
        "mapped",
        "onto",
        "computational",
        "description",
        "thereby",
        "qualifying",
        "computational",
        "state",
        "state",
        "representational",
        "computational",
        "either",
        "semantic",
        "account",
        "probably",
        "popular",
        "philosophy",
        "mind",
        "appears",
        "best",
        "fit",
        "required",
        "philosophical",
        "account",
        "cognition",
        "since",
        "mind",
        "digital",
        "computer",
        "generally",
        "assumed",
        "manipulate",
        "right",
        "kind",
        "representation",
        "turn",
        "compute",
        "since",
        "system",
        "generally",
        "assumed",
        "manipulate",
        "relevant",
        "kind",
        "representation",
        "compute",
        "thus",
        "semantic",
        "account",
        "appears",
        "accommodate",
        "common",
        "intuition",
        "count",
        "computing",
        "system",
        "keep",
        "mind",
        "computer",
        "leaving",
        "everything",
        "else",
        "thereby",
        "vindicating",
        "computational",
        "theory",
        "cognition",
        "strong",
        "nontrivial",
        "theory",
        "semantic",
        "account",
        "raise",
        "three",
        "important",
        "question",
        "first",
        "representation",
        "individuated",
        "second",
        "count",
        "representation",
        "relevant",
        "kind",
        "finally",
        "give",
        "representation",
        "semantic",
        "content",
        "main",
        "debate",
        "regarding",
        "individuation",
        "computational",
        "state",
        "divide",
        "internalists",
        "externalists",
        "according",
        "externalists",
        "computational",
        "vehicle",
        "symbol",
        "individuated",
        "wide",
        "cognitive",
        "contentsparadigmatically",
        "thing",
        "symbol",
        "stand",
        "burge",
        "shapiro",
        "shagrir",
        "contrast",
        "internalists",
        "maintain",
        "computational",
        "vehicle",
        "symbol",
        "individuated",
        "narrow",
        "cognitive",
        "content",
        "segal",
        "narrow",
        "content",
        "roughly",
        "speaking",
        "semantic",
        "content",
        "defined",
        "term",
        "intrinsic",
        "property",
        "system",
        "cognitive",
        "content",
        "turn",
        "content",
        "ascribed",
        "system",
        "cognitive",
        "psychological",
        "theory",
        "instance",
        "cognitive",
        "content",
        "visual",
        "system",
        "visual",
        "content",
        "whereas",
        "cognitive",
        "content",
        "auditory",
        "system",
        "auditory",
        "content",
        "illustrate",
        "dispute",
        "consider",
        "two",
        "physically",
        "identical",
        "cognitive",
        "system",
        "b",
        "among",
        "symbol",
        "processed",
        "symbol",
        "s",
        "produce",
        "instance",
        "whenever",
        "front",
        "body",
        "water",
        "thinking",
        "water",
        "forming",
        "plan",
        "interact",
        "water",
        "short",
        "symbol",
        "appears",
        "stand",
        "water",
        "every",
        "time",
        "process",
        "system",
        "b",
        "process",
        "symbol",
        "s",
        "physically",
        "identical",
        "s",
        "system",
        "b",
        "life",
        "environment",
        "different",
        "environment",
        "whenever",
        "surrounded",
        "water",
        "b",
        "surrounded",
        "twinwater",
        "substance",
        "superficially",
        "indistinguishable",
        "yet",
        "physically",
        "different",
        "water",
        "thus",
        "symbol",
        "s",
        "appears",
        "stand",
        "twinwater",
        "cf",
        "putnam",
        "b",
        "summary",
        "b",
        "live",
        "relevantly",
        "different",
        "environment",
        "appears",
        "stand",
        "water",
        "s",
        "appears",
        "stand",
        "twinwater",
        "process",
        "way",
        "b",
        "process",
        "s",
        "intrinsic",
        "physical",
        "difference",
        "b",
        "s",
        "according",
        "externalists",
        "processing",
        "b",
        "processing",
        "s",
        "computational",
        "state",
        "different",
        "type",
        "according",
        "internalists",
        "b",
        "computational",
        "state",
        "type",
        "word",
        "externalists",
        "maintain",
        "computational",
        "state",
        "individuated",
        "part",
        "reference",
        "determined",
        "least",
        "part",
        "physical",
        "property",
        "external",
        "system",
        "contrast",
        "internalists",
        "maintain",
        "computational",
        "state",
        "individuated",
        "way",
        "depends",
        "solely",
        "intrinsic",
        "physical",
        "property",
        "cognitive",
        "system",
        "far",
        "externalists",
        "internalists",
        "agree",
        "one",
        "thing",
        "computational",
        "state",
        "individuated",
        "cognitive",
        "content",
        "requirement",
        "relaxed",
        "without",
        "abandoning",
        "semantic",
        "account",
        "computation",
        "according",
        "egan",
        "computational",
        "vehicle",
        "individuated",
        "cognitive",
        "content",
        "kind",
        "whether",
        "wide",
        "narrow",
        "rather",
        "individuated",
        "mathematical",
        "contentsthat",
        "mathematical",
        "function",
        "object",
        "ascribed",
        "semantic",
        "content",
        "computational",
        "vehicle",
        "computational",
        "theory",
        "system",
        "since",
        "mathematical",
        "content",
        "across",
        "physical",
        "duplicate",
        "egan",
        "maintains",
        "mathematical",
        "content",
        "kind",
        "narrow",
        "contentshe",
        "kind",
        "internalist",
        "let",
        "u",
        "turn",
        "count",
        "representation",
        "debate",
        "le",
        "clearly",
        "delineated",
        "according",
        "author",
        "structure",
        "languagelike",
        "combinatorial",
        "syntax",
        "support",
        "compositional",
        "semantics",
        "count",
        "computational",
        "vehicle",
        "manipulation",
        "respect",
        "semantic",
        "property",
        "structure",
        "count",
        "computation",
        "fodor",
        "pylyshyn",
        "suggestion",
        "fly",
        "face",
        "computability",
        "theory",
        "analog",
        "computation",
        "maley",
        "forthcoming",
        "neither",
        "impose",
        "requirement",
        "count",
        "computational",
        "vehicle",
        "author",
        "inclusive",
        "kind",
        "manipulation",
        "representation",
        "count",
        "computation",
        "especially",
        "successful",
        "drawing",
        "line",
        "computational",
        "noncomputational",
        "process",
        "would",
        "include",
        "manipulation",
        "representationsincluding",
        "say",
        "painting",
        "picture",
        "recording",
        "speechas",
        "computation",
        "consensus",
        "draw",
        "boundary",
        "representational",
        "manipulation",
        "count",
        "computation",
        "representational",
        "manipulation",
        "third",
        "question",
        "give",
        "representation",
        "semantic",
        "content",
        "three",
        "family",
        "view",
        "instrumentalist",
        "believe",
        "ascribing",
        "semantic",
        "content",
        "thing",
        "heuristically",
        "useful",
        "prediction",
        "explanation",
        "semantic",
        "property",
        "real",
        "property",
        "computational",
        "state",
        "eg",
        "dennett",
        "egan",
        "realist",
        "naturalist",
        "believe",
        "semantic",
        "property",
        "real",
        "property",
        "computational",
        "state",
        "irreducible",
        "nonsemantic",
        "property",
        "finally",
        "realist",
        "also",
        "naturalist",
        "believe",
        "semantic",
        "property",
        "real",
        "reducible",
        "nonsemantic",
        "property",
        "though",
        "disagree",
        "exactly",
        "reduce",
        "eg",
        "fodor",
        "harman",
        "semantic",
        "account",
        "computation",
        "closely",
        "related",
        "common",
        "view",
        "computation",
        "information",
        "processing",
        "idea",
        "le",
        "clear",
        "may",
        "seem",
        "several",
        "relevant",
        "notion",
        "information",
        "connection",
        "information",
        "processing",
        "computation",
        "different",
        "depending",
        "notion",
        "information",
        "stake",
        "follows",
        "brief",
        "disambiguation",
        "view",
        "computation",
        "information",
        "processing",
        "based",
        "four",
        "relevant",
        "notion",
        "information",
        "cf",
        "piccinini",
        "scarantino",
        "information",
        "sense",
        "thermodynamics",
        "closely",
        "related",
        "thermodynamic",
        "entropy",
        "entropy",
        "property",
        "every",
        "physical",
        "system",
        "thermodynamic",
        "entropy",
        "roughly",
        "measure",
        "observer",
        "uncertainty",
        "microscopic",
        "state",
        "system",
        "considers",
        "observable",
        "macroscopic",
        "property",
        "system",
        "study",
        "thermodynamics",
        "computation",
        "lively",
        "field",
        "many",
        "implication",
        "foundation",
        "physic",
        "leff",
        "rex",
        "thermodynamic",
        "sense",
        "information",
        "difference",
        "two",
        "distinguishable",
        "state",
        "system",
        "may",
        "said",
        "carry",
        "information",
        "computation",
        "may",
        "well",
        "said",
        "information",
        "processing",
        "sense",
        "little",
        "semantics",
        "properly",
        "called",
        "however",
        "connection",
        "thermodynamics",
        "computation",
        "information",
        "theory",
        "one",
        "possible",
        "source",
        "inspiration",
        "view",
        "every",
        "physical",
        "system",
        "computing",
        "system",
        "see",
        "section",
        "information",
        "sense",
        "information",
        "theory",
        "measure",
        "likelihood",
        "given",
        "event",
        "occurs",
        "mutual",
        "information",
        "two",
        "random",
        "variable",
        "measure",
        "mutual",
        "dependence",
        "variable",
        "shannon",
        "weaver",
        "measure",
        "used",
        "analyze",
        "design",
        "robust",
        "communication",
        "system",
        "reliably",
        "transfer",
        "signal",
        "presence",
        "noise",
        "computation",
        "may",
        "well",
        "said",
        "information",
        "processing",
        "sense",
        "well",
        "explicitly",
        "semantics",
        "mutual",
        "information",
        "tell",
        "u",
        "much",
        "information",
        "variable",
        "carry",
        "another",
        "mutual",
        "information",
        "may",
        "basis",
        "notion",
        "semantic",
        "information",
        "carried",
        "variable",
        "another",
        "cf",
        "isaac",
        "information",
        "one",
        "semantic",
        "sense",
        "approximately",
        "natural",
        "meaning",
        "grice",
        "signal",
        "carry",
        "information",
        "sense",
        "case",
        "reliably",
        "correlate",
        "source",
        "dretske",
        "view",
        "computation",
        "information",
        "processing",
        "sense",
        "prima",
        "facie",
        "implausible",
        "many",
        "computationssuch",
        "arithmetical",
        "calculation",
        "carried",
        "digital",
        "computersdo",
        "seem",
        "carry",
        "natural",
        "meaning",
        "nevertheless",
        "notion",
        "semantic",
        "information",
        "relevant",
        "used",
        "theorist",
        "ground",
        "account",
        "representation",
        "dretske",
        "fodor",
        "information",
        "another",
        "semantic",
        "sense",
        "ordinary",
        "semantic",
        "content",
        "nonnatural",
        "meaning",
        "grice",
        "kind",
        "semantic",
        "content",
        "philosopher",
        "discus",
        "view",
        "computation",
        "information",
        "processing",
        "sense",
        "similar",
        "generic",
        "semantic",
        "account",
        "computation",
        "although",
        "semantic",
        "account",
        "computation",
        "appears",
        "fit",
        "need",
        "philosopher",
        "mind",
        "appears",
        "le",
        "suited",
        "make",
        "sense",
        "science",
        "pertinently",
        "representation",
        "seem",
        "presupposed",
        "notion",
        "computation",
        "employed",
        "least",
        "area",
        "cognitive",
        "science",
        "well",
        "computability",
        "theory",
        "computer",
        "sciencethe",
        "science",
        "gave",
        "rise",
        "notion",
        "computation",
        "origin",
        "computational",
        "theory",
        "cognition",
        "fresco",
        "correct",
        "semantic",
        "account",
        "may",
        "even",
        "adequate",
        "need",
        "philosopher",
        "mindat",
        "least",
        "philosopher",
        "mind",
        "wish",
        "make",
        "sense",
        "analogy",
        "mind",
        "system",
        "designed",
        "studied",
        "computer",
        "scientist",
        "computability",
        "theorist",
        "another",
        "criticism",
        "semantic",
        "account",
        "specifying",
        "kind",
        "representation",
        "representational",
        "manipulation",
        "relevant",
        "computation",
        "may",
        "require",
        "nonsemantic",
        "way",
        "individuating",
        "computation",
        "piccinini",
        "concern",
        "motivate",
        "effort",
        "account",
        "computation",
        "nonsemantic",
        "term"
    ]
}