{
    "main_text": "Physical Computability || The Physical Church-Turing Thesis: Bold\n4.1 The Physical Church-Turing Thesis: Bold\n\nPhysical CTT is often formulated in very strong forms. To a first\napproximation, Bold Physical CTT holds that any physical\nprocess—anything doable by a physical system—is\ncomputable by some TM.\n\nBold Physical CTT can be made more precise in a number of ways. Here\nis a representative sample, followed by references to where they are\ndiscussed:\n\nAny physical process can be simulated by some TM (e.g., Deutsch\n1985, Wolfram 1985, Pitowsky 2002).\nIf a physical system can be modeled by a certain kind of idealized\ncomputing machine that manipulates real-valued quantities, then that\nphysical system can only compute Turing-computable functions on\ndenumerable domains (Blum et al. 1989 show this to be false).\nAny system of equations describing a physical system gives rise to\ncomputable solutions (cf. Earman 1986, Pour-El 1999). A solution is\nsaid to be computable just in case, given computable real numbers as\ninitial conditions, it returns computable real numbers as values\n(where, following Turing, a real number is said to be computable just\nin case there is a TM whose output produces any desired number of\ndigits of that number).\nFor any physical system S and observable W, there is a\nTuring-computable function f: N\n→ N such that for all times t\n∈ N, f(t) = W(t) (Pitowsky 1990).\n\n\nThesis (A) is ambiguous between two notions of simulation. In one\nsense, simulation is the process by which a digital computing system\n(such as a TM) computes the same function as another digital computing\nsystem. This is the sense in which universal TMs can simulate any\nother TM. If (A) is interpreted using this first notion of simulation,\nit entails that everything in the universe is a digital computing\nsystem. This is (a variant of) ontic pancomputationalism (Section\n3.4).\n\nIn another sense, simulation is the process by which the output of a\ndigital computing system represents an approximate description of the\ndynamical evolution of another system. This is the sense in which\ncomputational models of the weather simulate the weather. If (A) is\ninterpreted using this second notion of simulation, then (A) is true\nonly if we do not care how close our computational approximations are.\nIf we want close computational approximations—as we usually\ndo—then (A) turns into the claim that any physical process can\nbe computationally approximated to the degree of accuracy that is\ndesired in any given case. Whether that is true varies from case to\ncase depending on the dynamical properties of the system, how much is\nknown about them, what idealizations and simplifications are adopted\nin the model, what numerical methods are used in the computation, and\nhow many computational resources (such as time, processing speed, and\nmemory) are available (Piccinini 2015, Chap 4).\n\nThesis (B) is straightforwardly and radically false, as shown by Blum\net al. (1989). Blum et al. set up a mathematical theory\nof computation over real-valued quantities, which they see as a\nfruitful extension of ordinary computability theory. Within such a\ntheory, they define idealized “computing” machines that\nperform addition, subtraction, multiplication, division, and equality\ntesting as primitive operations on arbitrary real-valued quantities.\nThey easily prove that such machines can compute all sets defined over\ndenumerable domains by encoding their characteristic function as a\nreal-valued constant (ibid., 405). Although they do not discuss this\nresult as a refutation of Physical CTT, their work is often cited in\ndiscussions of physical computability and Physical CTT.\n\nTheses (C) and (D) have interesting counterexamples that are\nconsistent with some physical theories (cf. below and Pour-El 1999).\nThese theoretical counterexamples may or may not occur in our concrete\nphysical universe.\n\nEach of (A)–(D) raises important questions pertaining to the\nfoundations of computer science, physics, and mathematics. It is not\nclear, however, that any of these theses bears an interesting analogy\nto Mathematical CTT. Below are two reasons why.\n\nFirst, (A)–(D) are falsified by processes that cannot be built\nand used as computing devices. The most obvious example is (B). Blum\net al.’s result is equivalent to demonstrating that all\nfunctions over denumerable domains—including the uncountably\nmany functions that are not Turing-computable—are computable by\nBlum et al.’s “computing” systems, which are\nallowed to manipulate the exact values of arbitrary real numbers.\nHence, (B) is radically false. But at the same time, this result has\nno direct practical applications, as there is no evidence that\nconcrete physical systems can manipulate arbitrary real-valued\nquantities in the way that Blum et al.’s systems do.\n\nMore generally, formulations (A)–(D) would be falsified by a\nsequence generated by a random (i.e., nondeterministic) physical\nprocess. According to quantum mechanics, some physical\nprocesses—such as atom decay—contain an objectively random\nelement. Hidden variable interpretations dispute this, but the\npossibility of genuine randomness is sufficiently plausible that it\nshould be taken into account.\n\nConsider a random process that produces discrete outputs over an\ninfinite period of time, e.g., the decay of atoms from a radioactive\nsample. Its output at regular time intervals is a string of\ndigits—‘0’ if no atoms decay during a time interval,\n‘1’ if one or more atoms decay during a time interval. A\nsimple consideration shows that, with probability one, the sequence\nproduced by our random process is not Turing-computable. There are\nuncountably many infinite strings of digits (even more strongly, there\nare uncountably many infinite strings of digits with any given\nlimiting frequency of ‘0’s and ‘1’s). But there are only\ncountably many Turing-computable infinite strings. Therefore, assuming\nthat each infinite string has the same probability of occurring as a\nresult of a random process, the probability that a random process\nwould generate a Turing-computable string of digits is zero, whereas\nthe probability that the string of digits is not Turing-computable is\none (for the stronger conclusion that no such string of digits is\nTuring-computable, see Calude & Svozil 2008). Thus, simply by\nusing a truly random process to generate a string, we would have the\nphysical means to go beyond what is Turing-computable. As Turing\n(1950, 438–439) pointed out, a machine with a “random\nelement” can do “more” than a TM. But doing\nmore is not the same as computing more. Contrary to what is\nsometimes suggested (e.g., Calude 2005, 10), the combination of a TM\nand a random process does not threaten Physical CTT.\n\nRandom processes should not count as computations: unlike\ncomputations properly so called, the values of random processes\ncannot, by definition, be the output of a function. Random processes\ncan be exploited by a computation, of course—there are\nimportant computational techniques that rely on random or\npseudo-random choices at some stages of a computation. If some quantum\nrandom sequences were random in the sense of algorithmic information\ntheory, they may even raise the probability of obtaining correct\nsolutions from computational techniques that rely on random choices\n(Calude 2005, 10). But no computational technique can amount to a mere\nsequence of random choices. So, any thesis, such as Bold Physical CTT,\nthat would be falsified by a sequence generated by a random process is\ntoo strong to capture the notion of physical\ncomputability—the physical analogue of algorithmic\ncomputability. Thus, contrary to what some authors seem to assume,\nBold Physical CTT is too strong to be a physical analogue of\nMathematical CTT.\n\nAnother feature that theses (A)–(D) have in common is that they\nappeal quite freely to arbitrary real-valued quantities. This is\nexplicit in (B). To see why they all appeal to arbitrary real-valued\nquantities, consider that most physical theories assume that many\nphysical magnitudes, including time, can take arbitrary real numbers\nas values. Hence, systems of physical equations, whose simulations,\nsolutions, or observables are appealed to, respectively, by (A), (C),\nand (D), involve arbitrary real numbers. Therefore, all formulations\nof Bold Physical CTT involve, explicitly or implicitly, arbitrary real\nnumbers.\n\nThe expressive power of real numbers may be used to generate a simple\nrecipe to obtain the values of a Turing-uncomputable function.\nConsider that the digital expansion of a real number contains\ncountably many digits. Hence, for any characteristic function (i.e., a\nfunction whose values are ‘0’ or ‘1’) defined\nover a countable domain, including all Turing-uncomputable such\nfunctions, there is a real number whose binary expansion encodes its\nvalues. This is because for all values of a characteristic function,\nthe nth value of the function may be defined to be\nthe nth digit of the binary expansion of a real\nnumber.\n\nSuppose you wish to know the value of a specific Turing-uncomputable\ncharacteristic function, such as the halting function for TMs, for its\nnth argument. Take the real number r whose\ndigital expansion encodes the values of the halting function. Then,\nobtain the value of the nth digit in the binary\nexpansion of r and you have the result you desire. If you can\ndo this, you may obtain any value of any characteristic function\ndefined over strings, including all Turing-uncomputable such\nfunctions.\n\nThe above recipe, if feasible, is a trivial consequence of the\nexpressive power of real numbers. Yet it is discussed in the\nliterature as an example of perhaps possible physical computation\nbeyond the power of TMs (e.g., Copeland 2000)—something that\nwould falsify Physical CTT. There is no reason to believe such a\nrecipe can be implemented, because it requires either the measurement\nor the preparation of a Turing-uncomputable real-valued quantities\nwith unbounded precision. There is no evidence that either is\ndoable.\n\nBy relying quite freely on arbitrary real-valued quantities, many\nversions of Bold Physical CTT make themselves vulnerable to\nfalsification by relatively trivial (though presumably unfeasible)\nrecipes such as the one just mentioned. This casts doubt on the\nassumption—made by some who seek ways to falsify Bold Physical\nCTT—that Bold Physical CTT is actually an interesting physical\nanalogue of Mathematical CTT.\n\n(The point just made does not impugn analog computation in the\nstandard sense of Pour-El (1974). Analog computation does not\nmanipulate exact values of arbitrary real-valued quantities but rather\ncontinuous variables. Although the continuous variables used in\nmost analog computations may be assumed to take any real value within\na relevant interval, concrete analog computation requires only the\nmanipulation and measurement of real variables within some\ndegree of approximation. So, analog computation does not falsify Bold\nPhysical CTT (cf. Rubel 1989).)\n\nSimilar doubts about the alleged analogy between Mathematical CTT and\nBold Physical CTT may be generated by a related observation. Many\ncurrent physical theories assume that nature contains real-valued\nquantities that vary along a continuum. These may include the velocity\nof objects, the coordinates that define the position of their center\nof gravity in the spacetime manifold, and more. If these physical\ntheories are correct, then many properties of many entities take\narbitrary real numbers as their values. And most real numbers in any\ncontinuous interval are Turing-uncomputable (i.e. there are only\ncountably many computable numbers, but any continuous interval\ncontains uncountably many real numbers). Thus, the probability is zero\nthat an arbitrary real-valued quantity is computable. Hence, if our\nphysical theories are correct, most transformations of the relevant\nphysical properties are transformations of Turing-uncomputable\nquantities into one another.\n\nFor instance, an object’s change of speed, or even its simple change\nof spatial location, may be transformations of one Turing-uncomputable\nreal-valued quantity into another. A transformation of one\nTuring-uncomputable value into another Turing-uncomputable value is a\nTuring-uncomputable operation—if nothing else, because no TM can\nwrite down the input and output of such an operation. On this picture,\nthe physical world is chock-full of operations that outstrip the power\nof TMs, thus Bold Physical CTT is falsified.\n\nThere is no reason to believe that we can use the Turing-uncomputable\noperations just mentioned to compute in the epistemological\nsense that motivates our interest in computation in the first\nplace—to solve problems, to generate the values of desired\nfunctions for desired arguments, to understand certain physical\nsystems, and so on. In other words, the operations in question should\nnot count as computations. Bold Physical CTT, which is threatened by\nsuch operations, is not interestingly analogous to Mathematical\nCTT.\n\nTo conclude our discussion of Bold Physical CTT, it may be helpful to\ndistinguish the issue of physical computability proper—the issue\nthat pertains to the physical analogue of Mathematical CTT—from\nother issues that connect computability and physics. Many questions\nabout the relationship between physical processes and computability\ndeserve to be asked. What are the physically computable functions?\nThis is the question that should motivate Physical CTT. What can be\ncomputationally approximated to what degree under what circumstances?\nThis is presumably what (A) is after. As important and interesting as\nthis question is, it is different from the question of what can be\nphysically computed. Yet other questions motivate theses (B)-(D) above\nas well as other versions of Bold Physical CTT to be found in the\nliterature. Many of these questions are interesting and deserve to be\ninvestigated. Nevertheless, they do not properly belong in discussions\nof CTT, because they are different from the computability question\nthat motivates CTT in the first place.\n",
    "section_title": "4.1 The Physical Church-Turing Thesis: Bold",
    "entry_title": "Computation in Physical Systems",
    "hierarchy_title": "Computation in Physical Systems || Physical Computability || The Physical Church-Turing Thesis: Bold",
    "tokenized_text": [
        "physical",
        "computability",
        "physical",
        "churchturing",
        "thesis",
        "bold",
        "physical",
        "churchturing",
        "thesis",
        "bold",
        "physical",
        "ctt",
        "often",
        "formulated",
        "strong",
        "form",
        "first",
        "approximation",
        "bold",
        "physical",
        "ctt",
        "hold",
        "physical",
        "processanything",
        "doable",
        "physical",
        "systemis",
        "computable",
        "tm",
        "bold",
        "physical",
        "ctt",
        "made",
        "precise",
        "number",
        "way",
        "representative",
        "sample",
        "followed",
        "reference",
        "discussed",
        "physical",
        "process",
        "simulated",
        "tm",
        "eg",
        "deutsch",
        "wolfram",
        "pitowsky",
        "physical",
        "system",
        "modeled",
        "certain",
        "kind",
        "idealized",
        "computing",
        "machine",
        "manipulates",
        "realvalued",
        "quantity",
        "physical",
        "system",
        "compute",
        "turingcomputable",
        "function",
        "denumerable",
        "domain",
        "blum",
        "et",
        "al",
        "show",
        "false",
        "system",
        "equation",
        "describing",
        "physical",
        "system",
        "give",
        "rise",
        "computable",
        "solution",
        "cf",
        "earman",
        "pourel",
        "solution",
        "said",
        "computable",
        "case",
        "given",
        "computable",
        "real",
        "number",
        "initial",
        "condition",
        "return",
        "computable",
        "real",
        "number",
        "value",
        "following",
        "turing",
        "real",
        "number",
        "said",
        "computable",
        "case",
        "tm",
        "whose",
        "output",
        "produce",
        "desired",
        "number",
        "digit",
        "number",
        "physical",
        "system",
        "observable",
        "w",
        "turingcomputable",
        "function",
        "f",
        "n",
        "n",
        "time",
        "n",
        "f",
        "w",
        "pitowsky",
        "thesis",
        "ambiguous",
        "two",
        "notion",
        "simulation",
        "one",
        "sense",
        "simulation",
        "process",
        "digital",
        "computing",
        "system",
        "tm",
        "computes",
        "function",
        "another",
        "digital",
        "computing",
        "system",
        "sense",
        "universal",
        "tm",
        "simulate",
        "tm",
        "interpreted",
        "using",
        "first",
        "notion",
        "simulation",
        "entail",
        "everything",
        "universe",
        "digital",
        "computing",
        "system",
        "variant",
        "ontic",
        "pancomputationalism",
        "section",
        "another",
        "sense",
        "simulation",
        "process",
        "output",
        "digital",
        "computing",
        "system",
        "represents",
        "approximate",
        "description",
        "dynamical",
        "evolution",
        "another",
        "system",
        "sense",
        "computational",
        "model",
        "weather",
        "simulate",
        "weather",
        "interpreted",
        "using",
        "second",
        "notion",
        "simulation",
        "true",
        "care",
        "close",
        "computational",
        "approximation",
        "want",
        "close",
        "computational",
        "approximationsas",
        "usually",
        "dothen",
        "turn",
        "claim",
        "physical",
        "process",
        "computationally",
        "approximated",
        "degree",
        "accuracy",
        "desired",
        "given",
        "case",
        "whether",
        "true",
        "varies",
        "case",
        "case",
        "depending",
        "dynamical",
        "property",
        "system",
        "much",
        "known",
        "idealization",
        "simplification",
        "adopted",
        "model",
        "numerical",
        "method",
        "used",
        "computation",
        "many",
        "computational",
        "resource",
        "time",
        "processing",
        "speed",
        "memory",
        "available",
        "piccinini",
        "chap",
        "thesis",
        "b",
        "straightforwardly",
        "radically",
        "false",
        "shown",
        "blum",
        "et",
        "al",
        "blum",
        "et",
        "al",
        "set",
        "mathematical",
        "theory",
        "computation",
        "realvalued",
        "quantity",
        "see",
        "fruitful",
        "extension",
        "ordinary",
        "computability",
        "theory",
        "within",
        "theory",
        "define",
        "idealized",
        "computing",
        "machine",
        "perform",
        "addition",
        "subtraction",
        "multiplication",
        "division",
        "equality",
        "testing",
        "primitive",
        "operation",
        "arbitrary",
        "realvalued",
        "quantity",
        "easily",
        "prove",
        "machine",
        "compute",
        "set",
        "defined",
        "denumerable",
        "domain",
        "encoding",
        "characteristic",
        "function",
        "realvalued",
        "constant",
        "ibid",
        "although",
        "discus",
        "result",
        "refutation",
        "physical",
        "ctt",
        "work",
        "often",
        "cited",
        "discussion",
        "physical",
        "computability",
        "physical",
        "ctt",
        "thesis",
        "c",
        "interesting",
        "counterexample",
        "consistent",
        "physical",
        "theory",
        "cf",
        "pourel",
        "theoretical",
        "counterexample",
        "may",
        "may",
        "occur",
        "concrete",
        "physical",
        "universe",
        "raise",
        "important",
        "question",
        "pertaining",
        "foundation",
        "computer",
        "science",
        "physic",
        "mathematics",
        "clear",
        "however",
        "thesis",
        "bear",
        "interesting",
        "analogy",
        "mathematical",
        "ctt",
        "two",
        "reason",
        "first",
        "falsified",
        "process",
        "built",
        "used",
        "computing",
        "device",
        "obvious",
        "example",
        "b",
        "blum",
        "et",
        "al",
        "result",
        "equivalent",
        "demonstrating",
        "function",
        "denumerable",
        "domainsincluding",
        "uncountably",
        "many",
        "function",
        "turingcomputableare",
        "computable",
        "blum",
        "et",
        "al",
        "computing",
        "system",
        "allowed",
        "manipulate",
        "exact",
        "value",
        "arbitrary",
        "real",
        "number",
        "hence",
        "b",
        "radically",
        "false",
        "time",
        "result",
        "direct",
        "practical",
        "application",
        "evidence",
        "concrete",
        "physical",
        "system",
        "manipulate",
        "arbitrary",
        "realvalued",
        "quantity",
        "way",
        "blum",
        "et",
        "al",
        "system",
        "generally",
        "formulation",
        "would",
        "falsified",
        "sequence",
        "generated",
        "random",
        "ie",
        "nondeterministic",
        "physical",
        "process",
        "according",
        "quantum",
        "mechanic",
        "physical",
        "processessuch",
        "atom",
        "decaycontain",
        "objectively",
        "random",
        "element",
        "hidden",
        "variable",
        "interpretation",
        "dispute",
        "possibility",
        "genuine",
        "randomness",
        "sufficiently",
        "plausible",
        "taken",
        "account",
        "consider",
        "random",
        "process",
        "produce",
        "discrete",
        "output",
        "infinite",
        "period",
        "time",
        "eg",
        "decay",
        "atom",
        "radioactive",
        "sample",
        "output",
        "regular",
        "time",
        "interval",
        "string",
        "digits",
        "atom",
        "decay",
        "time",
        "interval",
        "one",
        "atom",
        "decay",
        "time",
        "interval",
        "simple",
        "consideration",
        "show",
        "probability",
        "one",
        "sequence",
        "produced",
        "random",
        "process",
        "turingcomputable",
        "uncountably",
        "many",
        "infinite",
        "string",
        "digit",
        "even",
        "strongly",
        "uncountably",
        "many",
        "infinite",
        "string",
        "digit",
        "given",
        "limiting",
        "frequency",
        "countably",
        "many",
        "turingcomputable",
        "infinite",
        "string",
        "therefore",
        "assuming",
        "infinite",
        "string",
        "probability",
        "occurring",
        "result",
        "random",
        "process",
        "probability",
        "random",
        "process",
        "would",
        "generate",
        "turingcomputable",
        "string",
        "digit",
        "zero",
        "whereas",
        "probability",
        "string",
        "digit",
        "turingcomputable",
        "one",
        "stronger",
        "conclusion",
        "string",
        "digit",
        "turingcomputable",
        "see",
        "calude",
        "svozil",
        "thus",
        "simply",
        "using",
        "truly",
        "random",
        "process",
        "generate",
        "string",
        "would",
        "physical",
        "mean",
        "go",
        "beyond",
        "turingcomputable",
        "turing",
        "pointed",
        "machine",
        "random",
        "element",
        "tm",
        "computing",
        "contrary",
        "sometimes",
        "suggested",
        "eg",
        "calude",
        "combination",
        "tm",
        "random",
        "process",
        "threaten",
        "physical",
        "ctt",
        "random",
        "process",
        "count",
        "computation",
        "unlike",
        "computation",
        "properly",
        "called",
        "value",
        "random",
        "process",
        "definition",
        "output",
        "function",
        "random",
        "process",
        "exploited",
        "computation",
        "coursethere",
        "important",
        "computational",
        "technique",
        "rely",
        "random",
        "pseudorandom",
        "choice",
        "stage",
        "computation",
        "quantum",
        "random",
        "sequence",
        "random",
        "sense",
        "algorithmic",
        "information",
        "theory",
        "may",
        "even",
        "raise",
        "probability",
        "obtaining",
        "correct",
        "solution",
        "computational",
        "technique",
        "rely",
        "random",
        "choice",
        "calude",
        "computational",
        "technique",
        "amount",
        "mere",
        "sequence",
        "random",
        "choice",
        "thesis",
        "bold",
        "physical",
        "ctt",
        "would",
        "falsified",
        "sequence",
        "generated",
        "random",
        "process",
        "strong",
        "capture",
        "notion",
        "physical",
        "computabilitythe",
        "physical",
        "analogue",
        "algorithmic",
        "computability",
        "thus",
        "contrary",
        "author",
        "seem",
        "assume",
        "bold",
        "physical",
        "ctt",
        "strong",
        "physical",
        "analogue",
        "mathematical",
        "ctt",
        "another",
        "feature",
        "thesis",
        "common",
        "appeal",
        "quite",
        "freely",
        "arbitrary",
        "realvalued",
        "quantity",
        "explicit",
        "b",
        "see",
        "appeal",
        "arbitrary",
        "realvalued",
        "quantity",
        "consider",
        "physical",
        "theory",
        "assume",
        "many",
        "physical",
        "magnitude",
        "including",
        "time",
        "take",
        "arbitrary",
        "real",
        "number",
        "value",
        "hence",
        "system",
        "physical",
        "equation",
        "whose",
        "simulation",
        "solution",
        "observables",
        "appealed",
        "respectively",
        "c",
        "involve",
        "arbitrary",
        "real",
        "number",
        "therefore",
        "formulation",
        "bold",
        "physical",
        "ctt",
        "involve",
        "explicitly",
        "implicitly",
        "arbitrary",
        "real",
        "number",
        "expressive",
        "power",
        "real",
        "number",
        "may",
        "used",
        "generate",
        "simple",
        "recipe",
        "obtain",
        "value",
        "turinguncomputable",
        "function",
        "consider",
        "digital",
        "expansion",
        "real",
        "number",
        "contains",
        "countably",
        "many",
        "digit",
        "hence",
        "characteristic",
        "function",
        "ie",
        "function",
        "whose",
        "value",
        "defined",
        "countable",
        "domain",
        "including",
        "turinguncomputable",
        "function",
        "real",
        "number",
        "whose",
        "binary",
        "expansion",
        "encodes",
        "value",
        "value",
        "characteristic",
        "function",
        "nth",
        "value",
        "function",
        "may",
        "defined",
        "nth",
        "digit",
        "binary",
        "expansion",
        "real",
        "number",
        "suppose",
        "wish",
        "know",
        "value",
        "specific",
        "turinguncomputable",
        "characteristic",
        "function",
        "halting",
        "function",
        "tm",
        "nth",
        "argument",
        "take",
        "real",
        "number",
        "r",
        "whose",
        "digital",
        "expansion",
        "encodes",
        "value",
        "halting",
        "function",
        "obtain",
        "value",
        "nth",
        "digit",
        "binary",
        "expansion",
        "r",
        "result",
        "desire",
        "may",
        "obtain",
        "value",
        "characteristic",
        "function",
        "defined",
        "string",
        "including",
        "turinguncomputable",
        "function",
        "recipe",
        "feasible",
        "trivial",
        "consequence",
        "expressive",
        "power",
        "real",
        "number",
        "yet",
        "discussed",
        "literature",
        "example",
        "perhaps",
        "possible",
        "physical",
        "computation",
        "beyond",
        "power",
        "tm",
        "eg",
        "copeland",
        "something",
        "would",
        "falsify",
        "physical",
        "ctt",
        "reason",
        "believe",
        "recipe",
        "implemented",
        "requires",
        "either",
        "measurement",
        "preparation",
        "turinguncomputable",
        "realvalued",
        "quantity",
        "unbounded",
        "precision",
        "evidence",
        "either",
        "doable",
        "relying",
        "quite",
        "freely",
        "arbitrary",
        "realvalued",
        "quantity",
        "many",
        "version",
        "bold",
        "physical",
        "ctt",
        "make",
        "vulnerable",
        "falsification",
        "relatively",
        "trivial",
        "though",
        "presumably",
        "unfeasible",
        "recipe",
        "one",
        "mentioned",
        "cast",
        "doubt",
        "assumptionmade",
        "seek",
        "way",
        "falsify",
        "bold",
        "physical",
        "cttthat",
        "bold",
        "physical",
        "ctt",
        "actually",
        "interesting",
        "physical",
        "analogue",
        "mathematical",
        "ctt",
        "point",
        "made",
        "impugn",
        "analog",
        "computation",
        "standard",
        "sense",
        "pourel",
        "analog",
        "computation",
        "manipulate",
        "exact",
        "value",
        "arbitrary",
        "realvalued",
        "quantity",
        "rather",
        "continuous",
        "variable",
        "although",
        "continuous",
        "variable",
        "used",
        "analog",
        "computation",
        "may",
        "assumed",
        "take",
        "real",
        "value",
        "within",
        "relevant",
        "interval",
        "concrete",
        "analog",
        "computation",
        "requires",
        "manipulation",
        "measurement",
        "real",
        "variable",
        "within",
        "degree",
        "approximation",
        "analog",
        "computation",
        "falsify",
        "bold",
        "physical",
        "ctt",
        "cf",
        "rubel",
        "similar",
        "doubt",
        "alleged",
        "analogy",
        "mathematical",
        "ctt",
        "bold",
        "physical",
        "ctt",
        "may",
        "generated",
        "related",
        "observation",
        "many",
        "current",
        "physical",
        "theory",
        "assume",
        "nature",
        "contains",
        "realvalued",
        "quantity",
        "vary",
        "along",
        "continuum",
        "may",
        "include",
        "velocity",
        "object",
        "coordinate",
        "define",
        "position",
        "center",
        "gravity",
        "spacetime",
        "manifold",
        "physical",
        "theory",
        "correct",
        "many",
        "property",
        "many",
        "entity",
        "take",
        "arbitrary",
        "real",
        "number",
        "value",
        "real",
        "number",
        "continuous",
        "interval",
        "turinguncomputable",
        "ie",
        "countably",
        "many",
        "computable",
        "number",
        "continuous",
        "interval",
        "contains",
        "uncountably",
        "many",
        "real",
        "number",
        "thus",
        "probability",
        "zero",
        "arbitrary",
        "realvalued",
        "quantity",
        "computable",
        "hence",
        "physical",
        "theory",
        "correct",
        "transformation",
        "relevant",
        "physical",
        "property",
        "transformation",
        "turinguncomputable",
        "quantity",
        "one",
        "another",
        "instance",
        "object",
        "change",
        "speed",
        "even",
        "simple",
        "change",
        "spatial",
        "location",
        "may",
        "transformation",
        "one",
        "turinguncomputable",
        "realvalued",
        "quantity",
        "another",
        "transformation",
        "one",
        "turinguncomputable",
        "value",
        "another",
        "turinguncomputable",
        "value",
        "turinguncomputable",
        "operationif",
        "nothing",
        "else",
        "tm",
        "write",
        "input",
        "output",
        "operation",
        "picture",
        "physical",
        "world",
        "chockfull",
        "operation",
        "outstrip",
        "power",
        "tm",
        "thus",
        "bold",
        "physical",
        "ctt",
        "falsified",
        "reason",
        "believe",
        "use",
        "turinguncomputable",
        "operation",
        "mentioned",
        "compute",
        "epistemological",
        "sense",
        "motivates",
        "interest",
        "computation",
        "first",
        "placeto",
        "solve",
        "problem",
        "generate",
        "value",
        "desired",
        "function",
        "desired",
        "argument",
        "understand",
        "certain",
        "physical",
        "system",
        "word",
        "operation",
        "question",
        "count",
        "computation",
        "bold",
        "physical",
        "ctt",
        "threatened",
        "operation",
        "interestingly",
        "analogous",
        "mathematical",
        "ctt",
        "conclude",
        "discussion",
        "bold",
        "physical",
        "ctt",
        "may",
        "helpful",
        "distinguish",
        "issue",
        "physical",
        "computability",
        "properthe",
        "issue",
        "pertains",
        "physical",
        "analogue",
        "mathematical",
        "cttfrom",
        "issue",
        "connect",
        "computability",
        "physic",
        "many",
        "question",
        "relationship",
        "physical",
        "process",
        "computability",
        "deserve",
        "asked",
        "physically",
        "computable",
        "function",
        "question",
        "motivate",
        "physical",
        "ctt",
        "computationally",
        "approximated",
        "degree",
        "circumstance",
        "presumably",
        "important",
        "interesting",
        "question",
        "different",
        "question",
        "physically",
        "computed",
        "yet",
        "question",
        "motivate",
        "thesis",
        "b",
        "well",
        "version",
        "bold",
        "physical",
        "ctt",
        "found",
        "literature",
        "many",
        "question",
        "interesting",
        "deserve",
        "investigated",
        "nevertheless",
        "properly",
        "belong",
        "discussion",
        "ctt",
        "different",
        "computability",
        "question",
        "motivates",
        "ctt",
        "first",
        "place"
    ]
}