{
    "main_text": "Contemporary Theories of Evil Character/Personhood || Dispositional Accounts\n4.5 Dispositional Accounts\n\nMost theorists writing about evil personhood adopt dispositional\naccounts (See, e.g., Barry 2013, 87; Haybron 2002a, 70; Russell 2010\nand 2014, 154–195). Broadly speaking, dispositional accounts\ncontend that someone is an evil person if, and only if, she is\ndisposed to have evil-making properties.\n\nA potential problem for dispositional accounts is that they seem to\nconflict with the intuition that evil persons are rare since most of\nus are disposed to have evil-making properties in certain sorts of\nsituations (Russell 2014, 159). For example, assuming for the moment\nthat evil actions are evil-making properties, Stanley Milgram has\nshown that most of us are disposed to perform evil actions\n(specifically, administering potentially lethal electric shocks to\ninnocent people) when in certain experimental conditions (i.e. when\nasked to do so by a researcher working for a prestigious institution\nin the context of a study on punishment and learning) (Milgram 1974).\nMilgram’s experiments were designed to explain how thousands of\nordinary people could have played a role in bringing about the\nHolocaust during the Nazi era. Milgram’s research suggests that\nmost of us are disposed to perform evil actions when influenced,\nmanipulated, or pressed to do so by authority figures, as many people\nwere in Nazi Germany (Russell 2014, 170–173). But if most of us\nare disposed to perform evil actions in these situations then it seems\nthat on the dispositional account of evil personhood, most of us are\nevil, and thus, evil is not rare.\n\nTo make sense of the rarity of evil personhood, Luke Russell proposes\na restricted dispositional account according to which someone is an\nevil person if, and only if, she is strongly disposed to perform evil\nactions in only autonomy-favoring conditions (Russell 2014,\n72–75. Peter Barry argues for a similar view [See Barry 2013,\n82–90]).To be “strongly” disposed (as opposed to\nmerely disposed) to have evil-making properties is to be very likely,\nas opposed to merely able, to have evil-making properties (Russell\n2014, 156). Autonomy-favoring conditions are conditions in which an\nevildoer is not “deceived, threatened, coerced, or\npressed” (Russell 2014, 173), and thus, able to do what she\ntruly wants to do. According to Russell, although most of us are\nstrongly disposed to perform evil actions in Milgram scenarios, since\nMilgram scenarios are not autonomy-favoring conditions, most of us are\nnot evil persons.\n\nSeveral objections have been raised against Russell’s\nautonomy-favoring dispositional account (Calder 2015b). One objection\nis that it isn’t clear that Russell’s restricted\ndispositional account is an improvement over a more basic\ndispositional account according to which evil persons are simply\nstrongly disposed to perform evil actions (Calder 2015b,\n356–357). For it might be argued that since most of the subjects\nof Milgram’s experiments were surprised and distressed by what\nthey were asked to do, they would not have taken part in further\niterations of the experiment. If so, the subjects of Milgram’s\nexperiments were strongly disposed to perform evil actions only when\nsurprised by the novel circumstances of Milgram’s experiment,\nand not on an on-going basis in those circumstances. But if we do not\nhave a disposition to perform evil actions on an on-going basis, then\nwe do not really have a strong disposition to perform evil actions, or\nat least, one could argue, not in the sense implicitly meant by the\nbasic dispositional account. Furthermore, if some subjects of\nMilgram’s experiments would have willingly taken part in further\niterations of the experiment, it isn’t clear that they\nwouldn’t have been evil persons, which runs counter to\nRussell’s autonomy-favoring dispositional account.\n\nA second objection to Russell’s autonomy-favoring dispositional\naccount is that it is tailor-made to capture an intuition that some of\nus do not share: that most people could not be evil persons in any\nenvironment, even hostile political ones. Russell’s theory is\nbased on the idea that if most of us would be strongly disposed to\nperform evil actions in certain sorts of environments, such as in Nazi\nGermany, then we aren’t evil persons if we are disposed to\nperform evil actions in only those situations. But we might reject\nthis reasoning and argue instead that most of us are susceptible to\nbecoming evil persons in these environments, and so, need to be wary\nof these environments.\n4.6 Additional Theses about Evil Personhood\n\nIn addition to arguing for regularity or dispositional accounts on the\none hand, and action-based, affect-based, or motivation-based accounts\non the other, theorists have argued for several additional theses\nconcerning evil personhood.\n4.6.1 The Fixity Thesis\n\nAccording to the fixity thesis, evil persons have particularly fixed,\nor durable, characters such that it is very difficult to go from evil\nto non-evil, and changes of this sort rarely occur. Theorists add\nfixity components to their theories of evil personhood to capture the\nintuition that evil persons are near moral write-offs, beyond\n“communication and negotiation, reform and redemption”\n(Russell 2014 169. See also, Barry 2013, 82–87).\n\nTodd Calder has argued against the fixity thesis. Imagine that Darlene\nhas a highly fixed disposition to perform evil actions that she does\nlittle to resist. Geoff also has a disposition to perform evil\nactions, but this disposition is not highly fixed because he is\nindifferent about whether he should be disposed to perform evil\nactions and is, in general, capricious and unprincipled. It\nisn’t clear that Darlene is an evil person while Geoff is not.\nIf so, the characters of evil persons need not be highly fixed (Calder\n2015b, 354).\n4.6.2 The Consistency Thesis\n\nAccording to the consistency thesis, evil persons have evil-making\nproperties, or are disposed to have evil-making properties,\nconsistently, or almost all of the time. For instance, Daniel Haybron\nargues that “To be evil is ... to be consistently vicious in the\nfollowing sense: one is not aligned with the good to a morally\nsignificant extent” (Haybron 2002b, 269). By this he means that\nevil people almost always lack empathy and concern for others, and\nthey are in no way motivated to help others or to do what is morally\nright.\n\nSome theorists contrast the consistency thesis with the extremity\nthesis according to which evil persons have some set of character\ntraits to an extreme degree, e.g. extreme callousness or extreme\nmaliciousness (Haybron 2002a; Barry 2013, 56–71). The extremity\nthesis is consistent with most theories of evil personhood. The\nconsistency thesis is more controversial.\n\nCritics of the consistency thesis argue that it is too restrictive\n(Calder 2009, 22–27; Russell 2010, 241). Imagine that Bob loves\nto torture children and does so frequently, but that Bob also displays\ngenuine compassion for the elderly, perhaps by volunteering at a\nlong-term care facility on a regular basis. According to the\nconsistency thesis, Bob is not an evil person because he does not have\nevil-making characteristics consistently. And yet most people would\nwant to say that torturing children for fun on a regular basis is\nenough to make Bob an evil person (Calder 2009, 22–27).\n4.6.3 The Mirror Thesis\n\nAccording to the mirror thesis an evil person is the mirror-image of a\nmoral saint. Several theorists who write about evil personhood endorse\nthis thesis and use it to argue for their theories (Barry 2009; 2013;\nHaybron 2002b). For instance, Daniel Haybron argues that one reason to\naccept his contention that evil persons are wholly (or almost wholly)\nunaligned with the good is that it fits well with the intuition that\nmoral saints are “perfectly, or near-perfectly, aligned with the\ngood” (Haybron 2002b, 274. This argument makes an implicit\nappeal to the mirror thesis.\n\nLuke Russell rejects the mirror thesis, arguing that while moral\nsaints are morally admirable in all respects, some paradigmatic evil\npersons possess some morally admirable traits, such as courage,\ncommitment, and loyalty, which help them achieve their immoral goals\n(Russell 2010, 241–242). Since evil persons need not be bad in\nevery respect and moral saints must be good in every respect, we\nshould reject the mirror thesis. In response, Peter Brian Barry argues\nthat on plausible conceptions of moral sainthood, i.e. those that can\nmake sense of actual moral saints such as Mahatma Gandhi, Martin\nLuther King Jr., and Mother Teresa, moral saints can have some moral\nflaws (Barry 2011). Thus, the fact that some evil persons have some\nadmirable traits shouldn’t convince us to reject the mirror\nthesis.\n5. Evil Institutions\n\nWhile most theorists writing about evil focus on evil action and evil\ncharacter, there has also been some discussion of evil institutions.\nWhen we speak of ‘evil institutions’ we might mean one of\ntwo things: (1) organizations that are evil or that perform evil\nactions, or (2) social practices that are evil, such as slavery and\ngenocide. Since an organization can only be evil, or perform evil\nactions, if it is morally responsible for what it does, the debate\nconcerning the concept of evil institutions in sense (1) is discussed\nunder the heading of ‘collective responsibility.’ Evil\ninstitutions in this sense will not be discussed in this entry. (For a\nrecent contribution to this literature which makes explicit reference\nto evil collectives, see Scarre 2012.)\n\nAccording to Claudia Card, an institution, in sense (2), i.e., a\nsocial practice, is evil if it is reasonably foreseeable that\nintolerable harm will result from its normal or correct operation\nwithout justification or moral excuse (2002, 20; 2010, 18,\n27–35). For instance, genocide is an evil institution since\nsignificant suffering and a loss of social vitality result from its\nnormal and correct operation without moral justification (Card 2010,\n237–293).\n\nHowever, while Card’s account of evil institutions correctly\nidentifies genocide and other paradigmatically evil institutions as\nevil, her account also classifies as evil some institutions which are\nless obviously evil such as capital punishment, marriage, and\nmotherhood (Card 2002, 2010). Her classification of marriage and\nmotherhood as evil has been particularly controversial.\n\nAccording to Card, marriage and motherhood are evil institutions\nbecause it is reasonably foreseeable that their normal, or correct,\noperation will lead to intolerable harm in the form of domestic abuse\nwithout justification or excuse (Card 2002, 139–165). For\ninstance, Card argues that the normal, or correct, operation of\nmarriage leads to spousal abuse “because it provides incentives\nfor partners to stay in broken relationships, places obstacles in the\nway of escaping from broken relationships, gives perpetrators of abuse\nvirtually unlimited rights of access to their victims, and makes some\nforms of abuse difficult or impossible to detect or prove”\n(Calder 2009, 28). Card argues that there is no moral justification\nfor the intolerable harm that results from the institution of marriage\nsince nothing prevents us from abolishing marriage in favour of other\nless dangerous institutions.\n\nCritics argue that even if Card is correct that it is reasonably\nforeseeable that the institution of marriage will lead to intolerable\nharms, it is too heavy-handed to call marriage an evil institution.\nFor instance, Todd Calder has argued that an institution should be\nconsidered evil only if intolerable harm is an essential component of\nthe institution. Since suffering and a loss of social vitality are\nessential components of genocide, genocide is an evil institution. But\nsince spousal abuse is not an essential component of marriage,\nmarriage is not an evil institution (Calder 2009, 27–30).",
    "section_title": "4.5 Dispositional Accounts",
    "entry_title": "The Concept of Evil",
    "hierarchy_title": "The Concept of Evil || Contemporary Theories of Evil Character/Personhood || Dispositional Accounts",
    "tokenized_text": [
        "contemporary",
        "theory",
        "evil",
        "characterpersonhood",
        "dispositional",
        "account",
        "dispositional",
        "account",
        "theorist",
        "writing",
        "evil",
        "personhood",
        "adopt",
        "dispositional",
        "account",
        "see",
        "eg",
        "barry",
        "haybron",
        "a",
        "russell",
        "broadly",
        "speaking",
        "dispositional",
        "account",
        "contend",
        "someone",
        "evil",
        "person",
        "disposed",
        "evilmaking",
        "property",
        "potential",
        "problem",
        "dispositional",
        "account",
        "seem",
        "conflict",
        "intuition",
        "evil",
        "person",
        "rare",
        "since",
        "u",
        "disposed",
        "evilmaking",
        "property",
        "certain",
        "sort",
        "situation",
        "russell",
        "example",
        "assuming",
        "moment",
        "evil",
        "action",
        "evilmaking",
        "property",
        "stanley",
        "milgram",
        "shown",
        "u",
        "disposed",
        "perform",
        "evil",
        "action",
        "specifically",
        "administering",
        "potentially",
        "lethal",
        "electric",
        "shock",
        "innocent",
        "people",
        "certain",
        "experimental",
        "condition",
        "ie",
        "asked",
        "researcher",
        "working",
        "prestigious",
        "institution",
        "context",
        "study",
        "punishment",
        "learning",
        "milgram",
        "milgram",
        "experiment",
        "designed",
        "explain",
        "thousand",
        "ordinary",
        "people",
        "could",
        "played",
        "role",
        "bringing",
        "holocaust",
        "nazi",
        "era",
        "milgram",
        "research",
        "suggests",
        "u",
        "disposed",
        "perform",
        "evil",
        "action",
        "influenced",
        "manipulated",
        "pressed",
        "authority",
        "figure",
        "many",
        "people",
        "nazi",
        "germany",
        "russell",
        "u",
        "disposed",
        "perform",
        "evil",
        "action",
        "situation",
        "seems",
        "dispositional",
        "account",
        "evil",
        "personhood",
        "u",
        "evil",
        "thus",
        "evil",
        "rare",
        "make",
        "sense",
        "rarity",
        "evil",
        "personhood",
        "luke",
        "russell",
        "proposes",
        "restricted",
        "dispositional",
        "account",
        "according",
        "someone",
        "evil",
        "person",
        "strongly",
        "disposed",
        "perform",
        "evil",
        "action",
        "autonomyfavoring",
        "condition",
        "russell",
        "peter",
        "barry",
        "argues",
        "similar",
        "view",
        "see",
        "barry",
        "to",
        "strongly",
        "disposed",
        "opposed",
        "merely",
        "disposed",
        "evilmaking",
        "property",
        "likely",
        "opposed",
        "merely",
        "able",
        "evilmaking",
        "property",
        "russell",
        "autonomyfavoring",
        "condition",
        "condition",
        "evildoer",
        "deceived",
        "threatened",
        "coerced",
        "pressed",
        "russell",
        "thus",
        "able",
        "truly",
        "want",
        "according",
        "russell",
        "although",
        "u",
        "strongly",
        "disposed",
        "perform",
        "evil",
        "action",
        "milgram",
        "scenario",
        "since",
        "milgram",
        "scenario",
        "autonomyfavoring",
        "condition",
        "u",
        "evil",
        "person",
        "several",
        "objection",
        "raised",
        "russell",
        "autonomyfavoring",
        "dispositional",
        "account",
        "calder",
        "b",
        "one",
        "objection",
        "clear",
        "russell",
        "restricted",
        "dispositional",
        "account",
        "improvement",
        "basic",
        "dispositional",
        "account",
        "according",
        "evil",
        "person",
        "simply",
        "strongly",
        "disposed",
        "perform",
        "evil",
        "action",
        "calder",
        "b",
        "might",
        "argued",
        "since",
        "subject",
        "milgram",
        "experiment",
        "surprised",
        "distressed",
        "asked",
        "would",
        "taken",
        "part",
        "iteration",
        "experiment",
        "subject",
        "milgram",
        "experiment",
        "strongly",
        "disposed",
        "perform",
        "evil",
        "action",
        "surprised",
        "novel",
        "circumstance",
        "milgram",
        "experiment",
        "ongoing",
        "basis",
        "circumstance",
        "disposition",
        "perform",
        "evil",
        "action",
        "ongoing",
        "basis",
        "really",
        "strong",
        "disposition",
        "perform",
        "evil",
        "action",
        "least",
        "one",
        "could",
        "argue",
        "sense",
        "implicitly",
        "meant",
        "basic",
        "dispositional",
        "account",
        "furthermore",
        "subject",
        "milgram",
        "experiment",
        "would",
        "willingly",
        "taken",
        "part",
        "iteration",
        "experiment",
        "clear",
        "evil",
        "person",
        "run",
        "counter",
        "russell",
        "autonomyfavoring",
        "dispositional",
        "account",
        "second",
        "objection",
        "russell",
        "autonomyfavoring",
        "dispositional",
        "account",
        "tailormade",
        "capture",
        "intuition",
        "u",
        "share",
        "people",
        "could",
        "evil",
        "person",
        "environment",
        "even",
        "hostile",
        "political",
        "one",
        "russell",
        "theory",
        "based",
        "idea",
        "u",
        "would",
        "strongly",
        "disposed",
        "perform",
        "evil",
        "action",
        "certain",
        "sort",
        "environment",
        "nazi",
        "germany",
        "evil",
        "person",
        "disposed",
        "perform",
        "evil",
        "action",
        "situation",
        "might",
        "reject",
        "reasoning",
        "argue",
        "instead",
        "u",
        "susceptible",
        "becoming",
        "evil",
        "person",
        "environment",
        "need",
        "wary",
        "environment",
        "additional",
        "thesis",
        "evil",
        "personhood",
        "addition",
        "arguing",
        "regularity",
        "dispositional",
        "account",
        "one",
        "hand",
        "actionbased",
        "affectbased",
        "motivationbased",
        "account",
        "theorist",
        "argued",
        "several",
        "additional",
        "thesis",
        "concerning",
        "evil",
        "personhood",
        "fixity",
        "thesis",
        "according",
        "fixity",
        "thesis",
        "evil",
        "person",
        "particularly",
        "fixed",
        "durable",
        "character",
        "difficult",
        "go",
        "evil",
        "nonevil",
        "change",
        "sort",
        "rarely",
        "occur",
        "theorist",
        "add",
        "fixity",
        "component",
        "theory",
        "evil",
        "personhood",
        "capture",
        "intuition",
        "evil",
        "person",
        "near",
        "moral",
        "writeoff",
        "beyond",
        "communication",
        "negotiation",
        "reform",
        "redemption",
        "russell",
        "see",
        "also",
        "barry",
        "todd",
        "calder",
        "argued",
        "fixity",
        "thesis",
        "imagine",
        "darlene",
        "highly",
        "fixed",
        "disposition",
        "perform",
        "evil",
        "action",
        "little",
        "resist",
        "geoff",
        "also",
        "disposition",
        "perform",
        "evil",
        "action",
        "disposition",
        "highly",
        "fixed",
        "indifferent",
        "whether",
        "disposed",
        "perform",
        "evil",
        "action",
        "general",
        "capricious",
        "unprincipled",
        "clear",
        "darlene",
        "evil",
        "person",
        "geoff",
        "character",
        "evil",
        "person",
        "need",
        "highly",
        "fixed",
        "calder",
        "b",
        "consistency",
        "thesis",
        "according",
        "consistency",
        "thesis",
        "evil",
        "person",
        "evilmaking",
        "property",
        "disposed",
        "evilmaking",
        "property",
        "consistently",
        "almost",
        "time",
        "instance",
        "daniel",
        "haybron",
        "argues",
        "evil",
        "consistently",
        "vicious",
        "following",
        "sense",
        "one",
        "aligned",
        "good",
        "morally",
        "significant",
        "extent",
        "haybron",
        "b",
        "mean",
        "evil",
        "people",
        "almost",
        "always",
        "lack",
        "empathy",
        "concern",
        "others",
        "way",
        "motivated",
        "help",
        "others",
        "morally",
        "right",
        "theorist",
        "contrast",
        "consistency",
        "thesis",
        "extremity",
        "thesis",
        "according",
        "evil",
        "person",
        "set",
        "character",
        "trait",
        "extreme",
        "degree",
        "eg",
        "extreme",
        "callousness",
        "extreme",
        "maliciousness",
        "haybron",
        "a",
        "barry",
        "extremity",
        "thesis",
        "consistent",
        "theory",
        "evil",
        "personhood",
        "consistency",
        "thesis",
        "controversial",
        "critic",
        "consistency",
        "thesis",
        "argue",
        "restrictive",
        "calder",
        "russell",
        "imagine",
        "bob",
        "love",
        "torture",
        "child",
        "frequently",
        "bob",
        "also",
        "display",
        "genuine",
        "compassion",
        "elderly",
        "perhaps",
        "volunteering",
        "longterm",
        "care",
        "facility",
        "regular",
        "basis",
        "according",
        "consistency",
        "thesis",
        "bob",
        "evil",
        "person",
        "evilmaking",
        "characteristic",
        "consistently",
        "yet",
        "people",
        "would",
        "want",
        "say",
        "torturing",
        "child",
        "fun",
        "regular",
        "basis",
        "enough",
        "make",
        "bob",
        "evil",
        "person",
        "calder",
        "mirror",
        "thesis",
        "according",
        "mirror",
        "thesis",
        "evil",
        "person",
        "mirrorimage",
        "moral",
        "saint",
        "several",
        "theorist",
        "write",
        "evil",
        "personhood",
        "endorse",
        "thesis",
        "use",
        "argue",
        "theory",
        "barry",
        "haybron",
        "b",
        "instance",
        "daniel",
        "haybron",
        "argues",
        "one",
        "reason",
        "accept",
        "contention",
        "evil",
        "person",
        "wholly",
        "almost",
        "wholly",
        "unaligned",
        "good",
        "fit",
        "well",
        "intuition",
        "moral",
        "saint",
        "perfectly",
        "nearperfectly",
        "aligned",
        "good",
        "haybron",
        "b",
        "argument",
        "make",
        "implicit",
        "appeal",
        "mirror",
        "thesis",
        "luke",
        "russell",
        "reject",
        "mirror",
        "thesis",
        "arguing",
        "moral",
        "saint",
        "morally",
        "admirable",
        "respect",
        "paradigmatic",
        "evil",
        "person",
        "posse",
        "morally",
        "admirable",
        "trait",
        "courage",
        "commitment",
        "loyalty",
        "help",
        "achieve",
        "immoral",
        "goal",
        "russell",
        "since",
        "evil",
        "person",
        "need",
        "bad",
        "every",
        "respect",
        "moral",
        "saint",
        "must",
        "good",
        "every",
        "respect",
        "reject",
        "mirror",
        "thesis",
        "response",
        "peter",
        "brian",
        "barry",
        "argues",
        "plausible",
        "conception",
        "moral",
        "sainthood",
        "ie",
        "make",
        "sense",
        "actual",
        "moral",
        "saint",
        "mahatma",
        "gandhi",
        "martin",
        "luther",
        "king",
        "jr",
        "mother",
        "teresa",
        "moral",
        "saint",
        "moral",
        "flaw",
        "barry",
        "thus",
        "fact",
        "evil",
        "person",
        "admirable",
        "trait",
        "convince",
        "u",
        "reject",
        "mirror",
        "thesis",
        "evil",
        "institution",
        "theorist",
        "writing",
        "evil",
        "focus",
        "evil",
        "action",
        "evil",
        "character",
        "also",
        "discussion",
        "evil",
        "institution",
        "speak",
        "evil",
        "institution",
        "might",
        "mean",
        "one",
        "two",
        "thing",
        "organization",
        "evil",
        "perform",
        "evil",
        "action",
        "social",
        "practice",
        "evil",
        "slavery",
        "genocide",
        "since",
        "organization",
        "evil",
        "perform",
        "evil",
        "action",
        "morally",
        "responsible",
        "debate",
        "concerning",
        "concept",
        "evil",
        "institution",
        "sense",
        "discussed",
        "heading",
        "collective",
        "responsibility",
        "evil",
        "institution",
        "sense",
        "discussed",
        "entry",
        "recent",
        "contribution",
        "literature",
        "make",
        "explicit",
        "reference",
        "evil",
        "collective",
        "see",
        "scarre",
        "according",
        "claudia",
        "card",
        "institution",
        "sense",
        "ie",
        "social",
        "practice",
        "evil",
        "reasonably",
        "foreseeable",
        "intolerable",
        "harm",
        "result",
        "normal",
        "correct",
        "operation",
        "without",
        "justification",
        "moral",
        "excuse",
        "instance",
        "genocide",
        "evil",
        "institution",
        "since",
        "significant",
        "suffering",
        "loss",
        "social",
        "vitality",
        "result",
        "normal",
        "correct",
        "operation",
        "without",
        "moral",
        "justification",
        "card",
        "however",
        "card",
        "account",
        "evil",
        "institution",
        "correctly",
        "identifies",
        "genocide",
        "paradigmatically",
        "evil",
        "institution",
        "evil",
        "account",
        "also",
        "classifies",
        "evil",
        "institution",
        "le",
        "obviously",
        "evil",
        "capital",
        "punishment",
        "marriage",
        "motherhood",
        "card",
        "classification",
        "marriage",
        "motherhood",
        "evil",
        "particularly",
        "controversial",
        "according",
        "card",
        "marriage",
        "motherhood",
        "evil",
        "institution",
        "reasonably",
        "foreseeable",
        "normal",
        "correct",
        "operation",
        "lead",
        "intolerable",
        "harm",
        "form",
        "domestic",
        "abuse",
        "without",
        "justification",
        "excuse",
        "card",
        "instance",
        "card",
        "argues",
        "normal",
        "correct",
        "operation",
        "marriage",
        "lead",
        "spousal",
        "abuse",
        "provides",
        "incentive",
        "partner",
        "stay",
        "broken",
        "relationship",
        "place",
        "obstacle",
        "way",
        "escaping",
        "broken",
        "relationship",
        "give",
        "perpetrator",
        "abuse",
        "virtually",
        "unlimited",
        "right",
        "access",
        "victim",
        "make",
        "form",
        "abuse",
        "difficult",
        "impossible",
        "detect",
        "prove",
        "calder",
        "card",
        "argues",
        "moral",
        "justification",
        "intolerable",
        "harm",
        "result",
        "institution",
        "marriage",
        "since",
        "nothing",
        "prevents",
        "u",
        "abolishing",
        "marriage",
        "favour",
        "le",
        "dangerous",
        "institution",
        "critic",
        "argue",
        "even",
        "card",
        "correct",
        "reasonably",
        "foreseeable",
        "institution",
        "marriage",
        "lead",
        "intolerable",
        "harm",
        "heavyhanded",
        "call",
        "marriage",
        "evil",
        "institution",
        "instance",
        "todd",
        "calder",
        "argued",
        "institution",
        "considered",
        "evil",
        "intolerable",
        "harm",
        "essential",
        "component",
        "institution",
        "since",
        "suffering",
        "loss",
        "social",
        "vitality",
        "essential",
        "component",
        "genocide",
        "genocide",
        "evil",
        "institution",
        "since",
        "spousal",
        "abuse",
        "essential",
        "component",
        "marriage",
        "marriage",
        "evil",
        "institution",
        "calder"
    ]
}