{
    "main_text": "Languages as Analytic Methods\n7. Languages as Analytic Methods\n\nIn later works (Treatise of Animals [1755], Grammar,\npart of the Course of Study for the Prince of Parma, [1768],\nand Logic [1780]), Condillac explained more clearly the\ntransition from a language of natural signs to the language of action\nmade up of institutional signs.\n\nHe explicitly distinguished two types of “language of\naction.” The first one is “natural” (and thus\nappears to correspond to the use of natural signs also described in\nthe Essay). Its signs depend on the conformation of the\norgans (Treatise of Animals II. 4, Grammar I.1,\nLogic II.2). As a consequence, different species of animals\nhave a different natural language insofar as they have different\norgans (Treatise of Animals II.4). This language is innate in\nits expression since different signs are naturally caused by different\nideas independently of any learning. However, the interpretation of\nthis language is not innate: we have to learn to interpret its signs\n(Grammar I.1, Logic II.2). (Strictly speaking,\ncries, facial expressions, and gestures are signs only insofar as we\ninterpret them: before any interpretation they are just the effects on\nour body of some ideas occurring in our minds.) The second type of\nlanguage of action is institutional or artificial. Condillac makes\nclear that its signs are artificial but they are not arbitrary\n(Grammar I.1). They are not arbitrary because they are chosen\naccording to a rule of analogy with the natural signs\n(Grammar I.1, Logic II.2).\n\nThe transition from the natural language of action to the\ninstitutional language of action is a gradual process dictated by the\nneed to analyze natural signs. As Condillac explains, there is no\nsuccession of various ideas in the mind of the speaker of the natural\nlanguage of action: the idea of the external object affecting him or\nher, a judgment about the object, and the passions it arouses occur\nmore or less at the same time. In a similar fashion their visible and\naudible natural signs (the gestures, facial expressions, and cries\nmade) occur more or less at the same time, although the beginning of a\ndecomposition of these signs is already prompted by the mere\nspatio-temporal constraints of any visible action: it takes some time\nto jump around or to extend one own’s arm. Let’s imagine a\nsituation in which we have a speaker of the natural language and its\nfirst interpreter. In the presence of an animal, previously\nexperienced as dangerous, the speaker goes into a fright. The action\nthat follows appears to be confused to the interpreter, since it is\nthe immediate expression of a variety of ideas all occurring at the\nsame time in the mind of the speaker. The desire to understand leads\nthe interpreter to the beginning of an analysis of the action and, as\na consequence, to an analysis of ideas: for example, the attention of\nthe interpreter is drawn first to the object pointed at by the\nspeaker’s finger and then to speaker’s face expressing\nfear. The related ideas that were simultaneous in the mind of the\nspeaker become successive for the interpreter. The success and failure\nof the interpreter incites the speaker to be clear to herself and to\nothers: the speaker is motivated to analyze her own ideas so that she\nmay break down the corresponding visible and audible signs and be\nbetter understood. This breaking down of signs makes the job easier\nfor the interpreter who in her turn replies by decomposing her own\ngestures in accordance with the analysis of ideas. This gradual\nprocess of decomposition or articulation of gestures, cries, and\nfacial expressions marks the passage from a natural language of action\nto an institutional language of action (Grammar I.1 &\nI.7, Logic II.2).\n\nThus, language of action and analysis of ideas mutually enrich each\nother, according to a hierarchy of needs (at first, communication will\nbe about food and immediate dangers). The decomposing of signs\nmatching the analysis of ideas leads to the creation of new signs,\nfollowing a rule of analogy with the signs already known and this\nprocess allows the consideration of further ideas. Conversely, no\nconsideration of more refined ideas would be possible without the\ncorresponding signs. An example that Condillac favors is that of the\nsystem of numeration based on the ten fingers, which allows for the\nprogress of arithmetic: a single finger is first used to designate the\nunit but can subsequently be used for designating 10, 100, and so on\n(Language of Calculi I.1).\n\nFrom the primitive artificial language of action a language of\narticulated sounds emerged, as Condillac had already explained in\ndetail in the Essay: cries of different tonality were deemed\nsuitable to express different emotions. This phenomenon is at the\norigin of the tonal accent of Greek and Latin, which Condillac took to\nbe closer to the first spoken languages of humanity. Onomatopeia, he\nspeculated, may have been at the origin of certain words used to\ndesignate certain things, while other words were chosen by way of\nanalogy: for example, words for mental operations originally indicated\nwords for the operations of the sense-organs (Essay II.i.2-3,\nGrammar I.7). Grammar gradually emerged, first reflecting the\nmost basic needs of humanity and then gaining in complexity as needs\nmultiplied. (Condillac makes the conjecture that in the syntax of\nthese first languages the object of the action came first and preceded\nthe verb, since the object was the most vital point of interest for\nprimitive people: Essay II.i.9, Grammar II.8)\n\nThe first spoken languages of humanity combined a language of\narticulated sounds with the language of action. They resembled more a\nkind of chant accompanied by a “dance” of gestures and\nsteps: this fact also explains why a Roman or Greek orator could be\nunderstood by a large crowd of people, while a modern Frenchman could\nnot (Essay II.i.1-3).\n\nAfter a phase in which the language of action had been fruitfully\ncombined with the language of articulated sounds, different elements\nof this mix began to develop autonomously. They also recombined later\nin various guises. On this basis, Condillac attempted to account for\nthe development of arts and forms of expression such as music, dance,\ntheatre, poetry. For example, the language of action can dispense\naltogether with sounds of any kind, while extending the range of its\nexpressive gestures: already impressed by accounts of ancient\npantomimes, Condillac saw this point confirmed by the modern\ndevelopment of the language of signs for deaf-and-dumb people in the\nschool of the Abbé de l’Epée (Essay\nII.i.4, Grammar I.1). By developing only the tonal part of\nthe sounds, the language of action can turn into music, unaccompanied\nby any words and gestures (Essay II.i.5).\n\nThe details of this account of the development of arts are highly\ndebatable, but Condillac thought that on its basis he had been able to\nexplain the reasons for some disputes in art criticism. Whatever\nworked for an ancient language does not work for a modern language\nthat has shed most of its language of action component. Thus we should\nnot expect modern tragedy in French to replicate modes of expression\nprecisely designed for a more expressive language like that of ancient\ntragedy. (Essay II.i.3)\n\nThe transition from the natural language of action to the artificial\nlanguage of action and from this latter to the language of articulate\nsounds is recapitulated in an amplified form in the general movement\nof arts and civilization away from primitive forms of languages that\nare more expressive of emotions towards forms of language that are\nmore descriptive. All historical languages can be considered as\n“analytic methods,” since their grammar, prosody, and\nvocabulary reflect a certain stage in the development of analysis.\nHowever, in the formation of historical languages various\ncontingencies such as the climate and the temper of people played a\nrole. Historical languages contain many errors made in the analysis of\nfacts and these errors are passed on from generation to generation\n(Grammar I.1-8, Logic II.3-4). Science should strive\nto be based on a “well-formed language.” Late in his life,\nCondillac took algebra to be the best model of such a well-formed\nlanguage (Logic II.5). In algebra we show clearly and by a\nlimited number of steps how to find certain unknown quantities given\ncertain known quantities. Condillac took himself to have done\nsomething similar for philosophy. What is initially known is\nsensation. Condillac took himself to have shown in his work the\ngenesis of all mental life from this primitive element (Logic\nII.7-8).\n",
    "section_title": "7. Languages as Analytic Methods",
    "entry_title": "Étienne Bonnot de Condillac",
    "hierarchy_title": "Étienne Bonnot de Condillac || Languages as Analytic Methods",
    "tokenized_text": [
        "language",
        "analytic",
        "method",
        "language",
        "analytic",
        "method",
        "later",
        "work",
        "treatise",
        "animal",
        "grammar",
        "part",
        "course",
        "study",
        "prince",
        "parma",
        "logic",
        "condillac",
        "explained",
        "clearly",
        "transition",
        "language",
        "natural",
        "sign",
        "language",
        "action",
        "made",
        "institutional",
        "sign",
        "explicitly",
        "distinguished",
        "two",
        "type",
        "language",
        "action",
        "first",
        "one",
        "natural",
        "thus",
        "appears",
        "correspond",
        "use",
        "natural",
        "sign",
        "also",
        "described",
        "essay",
        "sign",
        "depend",
        "conformation",
        "organ",
        "treatise",
        "animal",
        "ii",
        "grammar",
        "i",
        "logic",
        "ii",
        "consequence",
        "different",
        "specie",
        "animal",
        "different",
        "natural",
        "language",
        "insofar",
        "different",
        "organ",
        "treatise",
        "animal",
        "ii",
        "language",
        "innate",
        "expression",
        "since",
        "different",
        "sign",
        "naturally",
        "caused",
        "different",
        "idea",
        "independently",
        "learning",
        "however",
        "interpretation",
        "language",
        "innate",
        "learn",
        "interpret",
        "sign",
        "grammar",
        "i",
        "logic",
        "ii",
        "strictly",
        "speaking",
        "cry",
        "facial",
        "expression",
        "gesture",
        "sign",
        "insofar",
        "interpret",
        "interpretation",
        "effect",
        "body",
        "idea",
        "occurring",
        "mind",
        "second",
        "type",
        "language",
        "action",
        "institutional",
        "artificial",
        "condillac",
        "make",
        "clear",
        "sign",
        "artificial",
        "arbitrary",
        "grammar",
        "i",
        "arbitrary",
        "chosen",
        "according",
        "rule",
        "analogy",
        "natural",
        "sign",
        "grammar",
        "i",
        "logic",
        "ii",
        "transition",
        "natural",
        "language",
        "action",
        "institutional",
        "language",
        "action",
        "gradual",
        "process",
        "dictated",
        "need",
        "analyze",
        "natural",
        "sign",
        "condillac",
        "explains",
        "succession",
        "various",
        "idea",
        "mind",
        "speaker",
        "natural",
        "language",
        "action",
        "idea",
        "external",
        "object",
        "affecting",
        "judgment",
        "object",
        "passion",
        "arouses",
        "occur",
        "le",
        "time",
        "similar",
        "fashion",
        "visible",
        "audible",
        "natural",
        "sign",
        "gesture",
        "facial",
        "expression",
        "cry",
        "made",
        "occur",
        "le",
        "time",
        "although",
        "beginning",
        "decomposition",
        "sign",
        "already",
        "prompted",
        "mere",
        "spatiotemporal",
        "constraint",
        "visible",
        "action",
        "take",
        "time",
        "jump",
        "around",
        "extend",
        "one",
        "arm",
        "let",
        "imagine",
        "situation",
        "speaker",
        "natural",
        "language",
        "first",
        "interpreter",
        "presence",
        "animal",
        "previously",
        "experienced",
        "dangerous",
        "speaker",
        "go",
        "fright",
        "action",
        "follows",
        "appears",
        "confused",
        "interpreter",
        "since",
        "immediate",
        "expression",
        "variety",
        "idea",
        "occurring",
        "time",
        "mind",
        "speaker",
        "desire",
        "understand",
        "lead",
        "interpreter",
        "beginning",
        "analysis",
        "action",
        "consequence",
        "analysis",
        "idea",
        "example",
        "attention",
        "interpreter",
        "drawn",
        "first",
        "object",
        "pointed",
        "speaker",
        "finger",
        "speaker",
        "face",
        "expressing",
        "fear",
        "related",
        "idea",
        "simultaneous",
        "mind",
        "speaker",
        "become",
        "successive",
        "interpreter",
        "success",
        "failure",
        "interpreter",
        "incites",
        "speaker",
        "clear",
        "others",
        "speaker",
        "motivated",
        "analyze",
        "idea",
        "may",
        "break",
        "corresponding",
        "visible",
        "audible",
        "sign",
        "better",
        "understood",
        "breaking",
        "sign",
        "make",
        "job",
        "easier",
        "interpreter",
        "turn",
        "reply",
        "decomposing",
        "gesture",
        "accordance",
        "analysis",
        "idea",
        "gradual",
        "process",
        "decomposition",
        "articulation",
        "gesture",
        "cry",
        "facial",
        "expression",
        "mark",
        "passage",
        "natural",
        "language",
        "action",
        "institutional",
        "language",
        "action",
        "grammar",
        "i",
        "i",
        "logic",
        "ii",
        "thus",
        "language",
        "action",
        "analysis",
        "idea",
        "mutually",
        "enrich",
        "according",
        "hierarchy",
        "need",
        "first",
        "communication",
        "food",
        "immediate",
        "danger",
        "decomposing",
        "sign",
        "matching",
        "analysis",
        "idea",
        "lead",
        "creation",
        "new",
        "sign",
        "following",
        "rule",
        "analogy",
        "sign",
        "already",
        "known",
        "process",
        "allows",
        "consideration",
        "idea",
        "conversely",
        "consideration",
        "refined",
        "idea",
        "would",
        "possible",
        "without",
        "corresponding",
        "sign",
        "example",
        "condillac",
        "favor",
        "system",
        "numeration",
        "based",
        "ten",
        "finger",
        "allows",
        "progress",
        "arithmetic",
        "single",
        "finger",
        "first",
        "used",
        "designate",
        "unit",
        "subsequently",
        "used",
        "designating",
        "language",
        "calculus",
        "i",
        "primitive",
        "artificial",
        "language",
        "action",
        "language",
        "articulated",
        "sound",
        "emerged",
        "condillac",
        "already",
        "explained",
        "detail",
        "essay",
        "cry",
        "different",
        "tonality",
        "deemed",
        "suitable",
        "express",
        "different",
        "emotion",
        "phenomenon",
        "origin",
        "tonal",
        "accent",
        "greek",
        "latin",
        "condillac",
        "took",
        "closer",
        "first",
        "spoken",
        "language",
        "humanity",
        "onomatopeia",
        "speculated",
        "may",
        "origin",
        "certain",
        "word",
        "used",
        "designate",
        "certain",
        "thing",
        "word",
        "chosen",
        "way",
        "analogy",
        "example",
        "word",
        "mental",
        "operation",
        "originally",
        "indicated",
        "word",
        "operation",
        "senseorgans",
        "essay",
        "iii",
        "grammar",
        "i",
        "grammar",
        "gradually",
        "emerged",
        "first",
        "reflecting",
        "basic",
        "need",
        "humanity",
        "gaining",
        "complexity",
        "need",
        "multiplied",
        "condillac",
        "make",
        "conjecture",
        "syntax",
        "first",
        "language",
        "object",
        "action",
        "came",
        "first",
        "preceded",
        "verb",
        "since",
        "object",
        "vital",
        "point",
        "interest",
        "primitive",
        "people",
        "essay",
        "iii",
        "grammar",
        "ii",
        "first",
        "spoken",
        "language",
        "humanity",
        "combined",
        "language",
        "articulated",
        "sound",
        "language",
        "action",
        "resembled",
        "kind",
        "chant",
        "accompanied",
        "dance",
        "gesture",
        "step",
        "fact",
        "also",
        "explains",
        "roman",
        "greek",
        "orator",
        "could",
        "understood",
        "large",
        "crowd",
        "people",
        "modern",
        "frenchman",
        "could",
        "essay",
        "iii",
        "phase",
        "language",
        "action",
        "fruitfully",
        "combined",
        "language",
        "articulated",
        "sound",
        "different",
        "element",
        "mix",
        "began",
        "develop",
        "autonomously",
        "also",
        "recombined",
        "later",
        "various",
        "guise",
        "basis",
        "condillac",
        "attempted",
        "account",
        "development",
        "art",
        "form",
        "expression",
        "music",
        "dance",
        "theatre",
        "poetry",
        "example",
        "language",
        "action",
        "dispense",
        "altogether",
        "sound",
        "kind",
        "extending",
        "range",
        "expressive",
        "gesture",
        "already",
        "impressed",
        "account",
        "ancient",
        "pantomime",
        "condillac",
        "saw",
        "point",
        "confirmed",
        "modern",
        "development",
        "language",
        "sign",
        "deafanddumb",
        "people",
        "school",
        "abbé",
        "de",
        "l",
        "epée",
        "essay",
        "iii",
        "grammar",
        "i",
        "developing",
        "tonal",
        "part",
        "sound",
        "language",
        "action",
        "turn",
        "music",
        "unaccompanied",
        "word",
        "gesture",
        "essay",
        "iii",
        "detail",
        "account",
        "development",
        "art",
        "highly",
        "debatable",
        "condillac",
        "thought",
        "basis",
        "able",
        "explain",
        "reason",
        "dispute",
        "art",
        "criticism",
        "whatever",
        "worked",
        "ancient",
        "language",
        "work",
        "modern",
        "language",
        "shed",
        "language",
        "action",
        "component",
        "thus",
        "expect",
        "modern",
        "tragedy",
        "french",
        "replicate",
        "mode",
        "expression",
        "precisely",
        "designed",
        "expressive",
        "language",
        "like",
        "ancient",
        "tragedy",
        "essay",
        "iii",
        "transition",
        "natural",
        "language",
        "action",
        "artificial",
        "language",
        "action",
        "latter",
        "language",
        "articulate",
        "sound",
        "recapitulated",
        "amplified",
        "form",
        "general",
        "movement",
        "art",
        "civilization",
        "away",
        "primitive",
        "form",
        "language",
        "expressive",
        "emotion",
        "towards",
        "form",
        "language",
        "descriptive",
        "historical",
        "language",
        "considered",
        "analytic",
        "method",
        "since",
        "grammar",
        "prosody",
        "vocabulary",
        "reflect",
        "certain",
        "stage",
        "development",
        "analysis",
        "however",
        "formation",
        "historical",
        "language",
        "various",
        "contingency",
        "climate",
        "temper",
        "people",
        "played",
        "role",
        "historical",
        "language",
        "contain",
        "many",
        "error",
        "made",
        "analysis",
        "fact",
        "error",
        "passed",
        "generation",
        "generation",
        "grammar",
        "i",
        "logic",
        "ii",
        "science",
        "strive",
        "based",
        "wellformed",
        "language",
        "late",
        "life",
        "condillac",
        "took",
        "algebra",
        "best",
        "model",
        "wellformed",
        "language",
        "logic",
        "ii",
        "algebra",
        "show",
        "clearly",
        "limited",
        "number",
        "step",
        "find",
        "certain",
        "unknown",
        "quantity",
        "given",
        "certain",
        "known",
        "quantity",
        "condillac",
        "took",
        "done",
        "something",
        "similar",
        "philosophy",
        "initially",
        "known",
        "sensation",
        "condillac",
        "took",
        "shown",
        "work",
        "genesis",
        "mental",
        "life",
        "primitive",
        "element",
        "logic",
        "ii"
    ]
}