{
    "main_text": "Sources for Confucius’s Life and Thought\n2. Sources for Confucius’s Life and Thought\n\nBiographical treatments of Confucius, beginning with the\n“Hereditary House of Confucius” (Kongzi shijia\n孔子世家), a chapter of Sima Qian’s\n司馬遷 (c.145–c.86 BCE) Records of the\nGrand Historian (Shiji 史記), were initially\nbased on information from compilations of independently circulating\ndialogues and prose accounts. Tying particular elements of his\nphilosophy to the life experiences of Confucius is a risky and\npotentially circular exercise, since many of the details of his\nbiography were first recorded in instructive anecdotes linked to the\nexpression of didactic messages. Nevertheless, since Sima Qian’s\ntime, the biography of Confucius has been intimately linked with the\ninterpretation of his philosophy, and so this section begins with a\nbrief treatment of traditional tropes about his family background,\nofficial career, and teaching of 72 disciples, before turning to the\ndialogue and prose accounts upon which early biographers like Sima\nQian drew.\n\nConfucius was born in the domain of Zou, in modern Shandong Province,\nsouth of the larger kingdom of Lu. A date of 551 BCE is given for his\nbirth in the Gongyang Commentary (Gongyang zhuan\n公羊傳) to the classic Spring and Autumn\nAnnals (Chunqiu 春秋), which places him in\nthe period when the influence of the Zhou polity was declining, and\nregional domains were becoming independent states.  His father, who\ncame from Lu, was descended from a noble clan that included, in Sima\nQian’s telling, several people known for their modesty and\nritual mastery. His father died when Confucius was a small child,\nleaving the family poor but with some social status, and as a young\nman Confucius became known for expertise in the classical ritual and\nceremonial forms of the Zhou. In adulthood, Confucius travelled to Lu\nand began a career as an official in the employ of aristocratic\nfamilies.\n\nDifferent sources identify Confucius as having held a large number of\ndifferent offices in Lu. Entries in the Zuo Commentary\n(Zuozhuan 左傳) to the Spring and Autumn\nAnnals for 509 and 500 BCE identify him as Director of\nCorrections (Sikou 司寇), and say he was charged\nwith assisting the ruler with the rituals surrounding a visiting\ndignitary from the state of Qi, respectively.  The Mencius\n(Mengzi 孟子), a text centered on a figure\ngenerally regarded as the most important early developer of the\nthought of Confucius, Mencius (trad. 372–289 BCE), says\nConfucius was Foodstuffs Scribe (Weili 委吏) and\nScribe in the Field (Chengtian 乘田), involved\nwith managing the accounting at the granary and keeping the books on\nthe pasturing of different animals\n(11.14).[1] In the\nfirst biography, Sima Qian mentions these offices, but then adds a\nsecond set of more powerful positions in Lu including Steward\n(Zai 宰) managing an estate in the district of Zhongdu,\nMinister of Works (Sikong 司空), and even acting\nChancellor (Xiang 相). Following his departure from Lu,\ndifferent stories place Confucius in the kingdoms of Wei, Song, Chen,\nCai, and Chu. Sima Qian crafted these stories into a serial narrative\nof rulers failing to appreciate the moral worth of Confucius, whose\nhigh standards forced him to continue to travel in search of an\nincorrupt ruler.\n\nLate in life, Confucius left service and turned to teaching. In Sima\nQian’s time, the sheer number of independently circulating texts\ncentering on dialogues that Confucius had with his disciples led the\nbiographer to include a separate chapter on “The arranged\ntraditions of the disciples of Confucius” (Zhongni dizi\nliezhuan 仲尼弟子列傳). His\naccount identifies 77 direct disciples, whom Sima Qian says Confucius\ntrained in ritual practice and the Classic of Odes\n(Shijing 詩經), Classic of Documents\n(Shujing 書經, also called Documents of the\nPredecessors or Shangshu 尚書), Records\nof Ritual (Liji 禮記) and\nClassic of Music (Yuejing 樂經). Altogether, some 3000\nstudents received some form of this training regimen. Sima\nQian’s editorial practice in systematizing dialogues was\ninclusive, and the fact that he was able to collect so much\ninformation some three centuries after the death of Confucius\ntestifies to the latter’s importance in the Han period. Looked\nat in a different way, the prodigious numbers of direct disciples and\nstudents of Confucius, and the inconsistent accounts of the offices in\nwhich he served, may also be due to a proliferation of texts\nassociating the increasingly authoritative figure of Confucius with\ndivergent regional or interpretive traditions during those intervening\ncenturies.\n\nThe many sources of quotations and dialogues of Confucius, both\ntransmitted and recently excavated, provide a wealth of materials\nabout the philosophy of Confucius, but an incomplete sense of which\nmaterials are authoritative. The last millennium has seen the\ndevelopment of a conventional view that materials preserved in the\ntwenty chapters of the transmitted Analects most accurately\nrepresent Confucius’s original teachings. This derives in part\nfrom a second century CE account by Ban Gu 班固\n(39–92 CE) of the composition of the Analects that\ndescribes the work as having been compiled by first and second\ngeneration disciples of Confucius and then transmitted privately for\ncenturies, making it arguably the oldest stratum of extant Confucius\nsources. In the centuries since, some scholars have come up with\nvariations on this basic account, such as Liu Baonan’s\n劉寳楠 (1791–1855) view in Corrected Meanings\nof the Analects (Lunyu zhengyi\n論語正義) that each chapter was written by a\ndifferent disciple. Recently, several centuries of doubts about\ninternal inconsistencies in the text and a lack of references to the\ntitle in early sources were marshaled by classicist Zhu Weizheng\n朱維錚 in an influential 1986 article which argued\nthat the lack of attributed quotations from the Analects, and\nof explicit references to it, prior to the second century BCE, meant\nthat its traditional status as the oldest stratum of the teachings of\nConfucius was undeserved. Since then a number of historians, including\nMichael J. Hunter, have systematically shown that writers started to\ndemonstrate an acute interest in the Analects only in the\nlate second and first centuries BCE, suggesting that other\nConfucius-related records from those centuries should also be\nconsidered as potentially authoritative sources. Some have suggested\nthis critical approach to sources is an attack on the historicity of\nConfucius, but a more reasonable description is that it is an attack\non the authoritativeness of the Analects that broadens and\ndiversifies the sources that may be used to reconstruct the historical\nConfucius.\n\nExpanding the corpus of Confucius quotations and dialogues beyond the\nAnalects, then, requires attention to three additional types\nof sources. First, dialogues preserved in transmitted sources like the\nRecords of Ritual, the Elder Dai’s Records of\nRitual (DaDai Liji 大戴禮記),\nand Han collections like the\nFamily Discussions of Confucius (Kongzi jiayu\n孔子家語) contain a large number of diverse\nteachings. Second, quotations attached to the interpretation of\npassages in the classics preserved in works like the Zuo\nCommentary to the Spring and Autumn Annals,\nor Han’s Intertextual Commentary on the Odes (Han\nShi waizhuan 韓詩外傳) are particularly\nrich sources for readings of history and poetry. Finally, a number of\nrecently archaeologically recovered texts from the Han period and\nbefore have also expanded the corpus.\n\nNewly discovered sources include three recently excavated versions of\ntexts with parallel to the transmitted Analects. These are\nthe 1973 excavation at the Dingzhou site in Hebei Province dating to\n55 BCE; the 1990’s excavation of a partial parallel version at\nJongbaekdong in Pyongyang, North Korea, dating to between 62 and 45\nBCE; and most recently the 2011-2015 excavation of the tomb of the Marquis\nof Haihun in Jiangxi Province dating to 59 BCE. The Haihun excavation\nis particularly important because it is thought to contain the two\nlost chapters of what Han period sources identify as a 22-chapter\nversion of the Analects that circulated in the state of Qi,\nthe titles of which appear to be “Understanding the Way”\n(Zhi dao 智道) and “Questions about\nJade” (Wen yu 問玉). While the\nHaihun Analects has yet to be published, the content of the\nlost chapters overlaps with a handful of fragments dating to the late\nfirst century BCE that were found at the Jianshui Jinguan site in\nJinta county in Gansu Province in 1973. All in all, these finds\nconfirm the sudden wide circulation of the Analects in the\nmiddle of the first century BCE.\n\nPreviously unknown Confucius dialogues and quotations have also been\nunearthed. The Dingzhou site also yielded texts given the titles\n“Sayings of the Ru” (Rujiazhe yan\n儒家者言) and “Duke Ai asked about the\nfive kinds of righteousness” (Aigong wen wuyi\n哀公問五義). A significantly different\ntext also given the name “Sayings of the Ru” was found in\n1977 in a Han tomb at Fuyang in Anhui Province. Several texts dating\nto 168 BCE recording statements by Confucius about the\nClassic of Changes (Yijing 易經) were\nexcavated from the Mawangdui site in Hunan Province in\n1973. Additionally, a number of Warring States period dialogical texts\ncentered on particular disciples, and a text with interpretative\ncomments by Confucius on the Classic of Poetry given the name\n“Confucius discusses the Odes” (Kongzi\nshilun 孔子詩論), were looted from tombs in the 1990s, sold on the black market, \nand made their way to the Shanghai Museum. Finally, the 59 BCE tomb of the\nMarquis of Haihun also contains a number of previously unknown\nConfucius dialogues and quotations on ritual and filial piety, along\nwith materials that overlap with sections of transmitted texts\nincluding the Analects, Records of Ritual and the\nElder Dai’s Records of Ritual.\n\nSome excavated texts, like the pre-Han period “Thicket of\nSayings” (Yucong 語叢) apothegms excavated\nat the Guodian site in Hubei Province in 1993, contain fragments of\nthe\nAnalects in circulation without attribution to Confucius.\nTransmitted materials also show some of the quotations attributed to\nConfucius in the Analects in the mouths of other historical\nfigures. The fluidity and diversity of Confucius-related materials in\ncirculation prior to the fixing of the Analects text in the\nsecond century BCE, suggest that the Analects itself, with\nits keen interest in ritual, personal ethics, and politics, may well\nhave been in part a topical selection from a larger and more diverse\nset of available Confucius-related materials. In other words, there\nwere already multiple topical foci prior to any horizon by which we\ncan definitively deem any single focus to be authoritative. It is for\nthis reason that the essential core of the teachings of Confucius is\nhistorically underdetermined, and the correct identification of the\ncore teachings is still avidly debated. The following sections treat\nthree key aspects of the philosophy of Confucius, each different but\nall interrelated, found throughout many of these diverse sets of\nsources: a theory of how ritual and musical performance functioned to\npromote unselfishness and train emotions, advice on how to inculcate a\nset of personal virtues to prepare people to behave morally in\ndifferent domains of their lives, and a social and political\nphilosophy that abstracted classical ideals of proper conduct in\nfamily and official contexts to apply to more general contexts.\n",
    "section_title": "2. Sources for Confucius’s Life and Thought",
    "entry_title": "Confucius",
    "hierarchy_title": "Confucius || Sources for Confucius’s Life and Thought",
    "tokenized_text": [
        "source",
        "confucius",
        "life",
        "thought",
        "source",
        "confucius",
        "life",
        "thought",
        "biographical",
        "treatment",
        "confucius",
        "beginning",
        "hereditary",
        "house",
        "confucius",
        "kongzi",
        "shijia",
        "孔子世家",
        "chapter",
        "sima",
        "qian",
        "司馬遷",
        "cc",
        "bce",
        "record",
        "grand",
        "historian",
        "shiji",
        "史記",
        "initially",
        "based",
        "information",
        "compilation",
        "independently",
        "circulating",
        "dialogue",
        "prose",
        "account",
        "tying",
        "particular",
        "element",
        "philosophy",
        "life",
        "experience",
        "confucius",
        "risky",
        "potentially",
        "circular",
        "exercise",
        "since",
        "many",
        "detail",
        "biography",
        "first",
        "recorded",
        "instructive",
        "anecdote",
        "linked",
        "expression",
        "didactic",
        "message",
        "nevertheless",
        "since",
        "sima",
        "qian",
        "time",
        "biography",
        "confucius",
        "intimately",
        "linked",
        "interpretation",
        "philosophy",
        "section",
        "begin",
        "brief",
        "treatment",
        "traditional",
        "trope",
        "family",
        "background",
        "official",
        "career",
        "teaching",
        "disciple",
        "turning",
        "dialogue",
        "prose",
        "account",
        "upon",
        "early",
        "biographer",
        "like",
        "sima",
        "qian",
        "drew",
        "confucius",
        "born",
        "domain",
        "zou",
        "modern",
        "shandong",
        "province",
        "south",
        "larger",
        "kingdom",
        "lu",
        "date",
        "bce",
        "given",
        "birth",
        "gongyang",
        "commentary",
        "gongyang",
        "zhuan",
        "公羊傳",
        "classic",
        "spring",
        "autumn",
        "annals",
        "chunqiu",
        "春秋",
        "place",
        "period",
        "influence",
        "zhou",
        "polity",
        "declining",
        "regional",
        "domain",
        "becoming",
        "independent",
        "state",
        "father",
        "came",
        "lu",
        "descended",
        "noble",
        "clan",
        "included",
        "sima",
        "qian",
        "telling",
        "several",
        "people",
        "known",
        "modesty",
        "ritual",
        "mastery",
        "father",
        "died",
        "confucius",
        "small",
        "child",
        "leaving",
        "family",
        "poor",
        "social",
        "status",
        "young",
        "man",
        "confucius",
        "became",
        "known",
        "expertise",
        "classical",
        "ritual",
        "ceremonial",
        "form",
        "zhou",
        "adulthood",
        "confucius",
        "travelled",
        "lu",
        "began",
        "career",
        "official",
        "employ",
        "aristocratic",
        "family",
        "different",
        "source",
        "identify",
        "confucius",
        "held",
        "large",
        "number",
        "different",
        "office",
        "lu",
        "entry",
        "zuo",
        "commentary",
        "zuozhuan",
        "左傳",
        "spring",
        "autumn",
        "annals",
        "bce",
        "identify",
        "director",
        "correction",
        "sikou",
        "司寇",
        "say",
        "charged",
        "assisting",
        "ruler",
        "ritual",
        "surrounding",
        "visiting",
        "dignitary",
        "state",
        "qi",
        "respectively",
        "mencius",
        "mengzi",
        "孟子",
        "text",
        "centered",
        "figure",
        "generally",
        "regarded",
        "important",
        "early",
        "developer",
        "thought",
        "confucius",
        "mencius",
        "trad",
        "bce",
        "say",
        "confucius",
        "foodstuff",
        "scribe",
        "weili",
        "委吏",
        "scribe",
        "field",
        "chengtian",
        "乘田",
        "involved",
        "managing",
        "accounting",
        "granary",
        "keeping",
        "book",
        "pasturing",
        "different",
        "animal",
        "first",
        "biography",
        "sima",
        "qian",
        "mention",
        "office",
        "add",
        "second",
        "set",
        "powerful",
        "position",
        "lu",
        "including",
        "steward",
        "zai",
        "宰",
        "managing",
        "estate",
        "district",
        "zhongdu",
        "minister",
        "work",
        "sikong",
        "司空",
        "even",
        "acting",
        "chancellor",
        "xiang",
        "相",
        "following",
        "departure",
        "lu",
        "different",
        "story",
        "place",
        "confucius",
        "kingdom",
        "wei",
        "song",
        "chen",
        "cai",
        "chu",
        "sima",
        "qian",
        "crafted",
        "story",
        "serial",
        "narrative",
        "ruler",
        "failing",
        "appreciate",
        "moral",
        "worth",
        "confucius",
        "whose",
        "high",
        "standard",
        "forced",
        "continue",
        "travel",
        "search",
        "incorrupt",
        "ruler",
        "late",
        "life",
        "confucius",
        "left",
        "service",
        "turned",
        "teaching",
        "sima",
        "qian",
        "time",
        "sheer",
        "number",
        "independently",
        "circulating",
        "text",
        "centering",
        "dialogue",
        "confucius",
        "disciple",
        "led",
        "biographer",
        "include",
        "separate",
        "chapter",
        "arranged",
        "tradition",
        "disciple",
        "confucius",
        "zhongni",
        "dizi",
        "liezhuan",
        "仲尼弟子列傳",
        "account",
        "identifies",
        "direct",
        "disciple",
        "sima",
        "qian",
        "say",
        "confucius",
        "trained",
        "ritual",
        "practice",
        "classic",
        "ode",
        "shijing",
        "詩經",
        "classic",
        "document",
        "shujing",
        "書經",
        "also",
        "called",
        "document",
        "predecessor",
        "shangshu",
        "尚書",
        "record",
        "ritual",
        "liji",
        "禮記",
        "classic",
        "music",
        "yuejing",
        "樂經",
        "altogether",
        "student",
        "received",
        "form",
        "training",
        "regimen",
        "sima",
        "qian",
        "editorial",
        "practice",
        "systematizing",
        "dialogue",
        "inclusive",
        "fact",
        "able",
        "collect",
        "much",
        "information",
        "three",
        "century",
        "death",
        "confucius",
        "testifies",
        "latter",
        "importance",
        "han",
        "period",
        "looked",
        "different",
        "way",
        "prodigious",
        "number",
        "direct",
        "disciple",
        "student",
        "confucius",
        "inconsistent",
        "account",
        "office",
        "served",
        "may",
        "also",
        "due",
        "proliferation",
        "text",
        "associating",
        "increasingly",
        "authoritative",
        "figure",
        "confucius",
        "divergent",
        "regional",
        "interpretive",
        "tradition",
        "intervening",
        "century",
        "many",
        "source",
        "quotation",
        "dialogue",
        "confucius",
        "transmitted",
        "recently",
        "excavated",
        "provide",
        "wealth",
        "material",
        "philosophy",
        "confucius",
        "incomplete",
        "sense",
        "material",
        "authoritative",
        "last",
        "millennium",
        "seen",
        "development",
        "conventional",
        "view",
        "material",
        "preserved",
        "twenty",
        "chapter",
        "transmitted",
        "analects",
        "accurately",
        "represent",
        "confucius",
        "original",
        "teaching",
        "derives",
        "part",
        "second",
        "century",
        "ce",
        "account",
        "ban",
        "gu",
        "班固",
        "ce",
        "composition",
        "analects",
        "describes",
        "work",
        "compiled",
        "first",
        "second",
        "generation",
        "disciple",
        "confucius",
        "transmitted",
        "privately",
        "century",
        "making",
        "arguably",
        "oldest",
        "stratum",
        "extant",
        "confucius",
        "source",
        "century",
        "since",
        "scholar",
        "come",
        "variation",
        "basic",
        "account",
        "liu",
        "baonan",
        "劉寳楠",
        "view",
        "corrected",
        "meaning",
        "analects",
        "lunyu",
        "zhengyi",
        "論語正義",
        "chapter",
        "written",
        "different",
        "disciple",
        "recently",
        "several",
        "century",
        "doubt",
        "internal",
        "inconsistency",
        "text",
        "lack",
        "reference",
        "title",
        "early",
        "source",
        "marshaled",
        "classicist",
        "zhu",
        "weizheng",
        "朱維錚",
        "influential",
        "article",
        "argued",
        "lack",
        "attributed",
        "quotation",
        "analects",
        "explicit",
        "reference",
        "prior",
        "second",
        "century",
        "bce",
        "meant",
        "traditional",
        "status",
        "oldest",
        "stratum",
        "teaching",
        "confucius",
        "undeserved",
        "since",
        "number",
        "historian",
        "including",
        "michael",
        "j",
        "hunter",
        "systematically",
        "shown",
        "writer",
        "started",
        "demonstrate",
        "acute",
        "interest",
        "analects",
        "late",
        "second",
        "first",
        "century",
        "bce",
        "suggesting",
        "confuciusrelated",
        "record",
        "century",
        "also",
        "considered",
        "potentially",
        "authoritative",
        "source",
        "suggested",
        "critical",
        "approach",
        "source",
        "attack",
        "historicity",
        "confucius",
        "reasonable",
        "description",
        "attack",
        "authoritativeness",
        "analects",
        "broadens",
        "diversifies",
        "source",
        "may",
        "used",
        "reconstruct",
        "historical",
        "confucius",
        "expanding",
        "corpus",
        "confucius",
        "quotation",
        "dialogue",
        "beyond",
        "analects",
        "requires",
        "attention",
        "three",
        "additional",
        "type",
        "source",
        "first",
        "dialogue",
        "preserved",
        "transmitted",
        "source",
        "like",
        "record",
        "ritual",
        "elder",
        "dai",
        "record",
        "ritual",
        "dadai",
        "liji",
        "大戴禮記",
        "han",
        "collection",
        "like",
        "family",
        "discussion",
        "confucius",
        "kongzi",
        "jiayu",
        "孔子家語",
        "contain",
        "large",
        "number",
        "diverse",
        "teaching",
        "second",
        "quotation",
        "attached",
        "interpretation",
        "passage",
        "classic",
        "preserved",
        "work",
        "like",
        "zuo",
        "commentary",
        "spring",
        "autumn",
        "annals",
        "han",
        "intertextual",
        "commentary",
        "ode",
        "han",
        "shi",
        "waizhuan",
        "韓詩外傳",
        "particularly",
        "rich",
        "source",
        "reading",
        "history",
        "poetry",
        "finally",
        "number",
        "recently",
        "archaeologically",
        "recovered",
        "text",
        "han",
        "period",
        "also",
        "expanded",
        "corpus",
        "newly",
        "discovered",
        "source",
        "include",
        "three",
        "recently",
        "excavated",
        "version",
        "text",
        "parallel",
        "transmitted",
        "analects",
        "excavation",
        "dingzhou",
        "site",
        "hebei",
        "province",
        "dating",
        "bce",
        "excavation",
        "partial",
        "parallel",
        "version",
        "jongbaekdong",
        "pyongyang",
        "north",
        "korea",
        "dating",
        "bce",
        "recently",
        "excavation",
        "tomb",
        "marquis",
        "haihun",
        "jiangxi",
        "province",
        "dating",
        "bce",
        "haihun",
        "excavation",
        "particularly",
        "important",
        "thought",
        "contain",
        "two",
        "lost",
        "chapter",
        "han",
        "period",
        "source",
        "identify",
        "chapter",
        "version",
        "analects",
        "circulated",
        "state",
        "qi",
        "title",
        "appear",
        "understanding",
        "way",
        "zhi",
        "dao",
        "智道",
        "question",
        "jade",
        "wen",
        "yu",
        "問玉",
        "haihun",
        "analects",
        "yet",
        "published",
        "content",
        "lost",
        "chapter",
        "overlap",
        "handful",
        "fragment",
        "dating",
        "late",
        "first",
        "century",
        "bce",
        "found",
        "jianshui",
        "jinguan",
        "site",
        "jinta",
        "county",
        "gansu",
        "province",
        "find",
        "confirm",
        "sudden",
        "wide",
        "circulation",
        "analects",
        "middle",
        "first",
        "century",
        "bce",
        "previously",
        "unknown",
        "confucius",
        "dialogue",
        "quotation",
        "also",
        "unearthed",
        "dingzhou",
        "site",
        "also",
        "yielded",
        "text",
        "given",
        "title",
        "saying",
        "ru",
        "rujiazhe",
        "yan",
        "儒家者言",
        "duke",
        "ai",
        "asked",
        "five",
        "kind",
        "righteousness",
        "aigong",
        "wen",
        "wuyi",
        "哀公問五義",
        "significantly",
        "different",
        "text",
        "also",
        "given",
        "name",
        "saying",
        "ru",
        "found",
        "han",
        "tomb",
        "fuyang",
        "anhui",
        "province",
        "several",
        "text",
        "dating",
        "bce",
        "recording",
        "statement",
        "confucius",
        "classic",
        "change",
        "yijing",
        "易經",
        "excavated",
        "mawangdui",
        "site",
        "hunan",
        "province",
        "additionally",
        "number",
        "warring",
        "state",
        "period",
        "dialogical",
        "text",
        "centered",
        "particular",
        "disciple",
        "text",
        "interpretative",
        "comment",
        "confucius",
        "classic",
        "poetry",
        "given",
        "name",
        "confucius",
        "discus",
        "ode",
        "kongzi",
        "shilun",
        "孔子詩論",
        "looted",
        "tomb",
        "s",
        "sold",
        "black",
        "market",
        "made",
        "way",
        "shanghai",
        "museum",
        "finally",
        "bce",
        "tomb",
        "marquis",
        "haihun",
        "also",
        "contains",
        "number",
        "previously",
        "unknown",
        "confucius",
        "dialogue",
        "quotation",
        "ritual",
        "filial",
        "piety",
        "along",
        "material",
        "overlap",
        "section",
        "transmitted",
        "text",
        "including",
        "analects",
        "record",
        "ritual",
        "elder",
        "dai",
        "record",
        "ritual",
        "excavated",
        "text",
        "like",
        "prehan",
        "period",
        "thicket",
        "saying",
        "yucong",
        "語叢",
        "apothegm",
        "excavated",
        "guodian",
        "site",
        "hubei",
        "province",
        "contain",
        "fragment",
        "analects",
        "circulation",
        "without",
        "attribution",
        "confucius",
        "transmitted",
        "material",
        "also",
        "show",
        "quotation",
        "attributed",
        "confucius",
        "analects",
        "mouth",
        "historical",
        "figure",
        "fluidity",
        "diversity",
        "confuciusrelated",
        "material",
        "circulation",
        "prior",
        "fixing",
        "analects",
        "text",
        "second",
        "century",
        "bce",
        "suggest",
        "analects",
        "keen",
        "interest",
        "ritual",
        "personal",
        "ethic",
        "politics",
        "may",
        "well",
        "part",
        "topical",
        "selection",
        "larger",
        "diverse",
        "set",
        "available",
        "confuciusrelated",
        "material",
        "word",
        "already",
        "multiple",
        "topical",
        "focus",
        "prior",
        "horizon",
        "definitively",
        "deem",
        "single",
        "focus",
        "authoritative",
        "reason",
        "essential",
        "core",
        "teaching",
        "confucius",
        "historically",
        "underdetermined",
        "correct",
        "identification",
        "core",
        "teaching",
        "still",
        "avidly",
        "debated",
        "following",
        "section",
        "treat",
        "three",
        "key",
        "aspect",
        "philosophy",
        "confucius",
        "different",
        "interrelated",
        "found",
        "throughout",
        "many",
        "diverse",
        "set",
        "source",
        "theory",
        "ritual",
        "musical",
        "performance",
        "functioned",
        "promote",
        "unselfishness",
        "train",
        "emotion",
        "advice",
        "inculcate",
        "set",
        "personal",
        "virtue",
        "prepare",
        "people",
        "behave",
        "morally",
        "different",
        "domain",
        "life",
        "social",
        "political",
        "philosophy",
        "abstracted",
        "classical",
        "ideal",
        "proper",
        "conduct",
        "family",
        "official",
        "context",
        "apply",
        "general",
        "context"
    ]
}