{
    "main_text": "Predictive Coding Models of Cognition\n10. Predictive Coding Models of Cognition\n\nAs connectionist research has matured from its “Golden\nAge” in the 1980s, the main paradigm has radiated into a number\nof distinct approaches. Two important trends worth mention are\npredicative coding and deep learning (which will be covered in the\nfollowing section). Predictive coding is a well-established\ninformation processing tool with a wide range of applications. It is\nuseful, for example, in compressing the size of data sets. Suppose you\nwish to transmit a picture of a landscape with a blue sky. Since most\nof the pixels in the top half of your image are roughly the same\nshade, it is very inefficient to record the color value (say Red: 46\nGreen: 78 Blue: FF in hexadecimal) over and over again for each pixel\nin the top half of the image. Since the value of one pixel strongly\npredicts the value of its neighbor, the efficient thing to do is\nrecord at each pixel location, the difference between the predicted\nvalue (an average of its neighbors) and the actual value for that\npixel. (In the case of representing an even shaded sky, we would only\nneed to record the blue value once, followed by lots of zeros.) This\nway, major coding resources are only needed to keep track of points in\nthe image (such as edges) where there are large changes, that is\npoints of “surprise” or “unexpected”\nvariation.\n\nIt is well known that early visual processing in the brain involves\ntaking differences between nearby values, (for example, to identify\nvisual boundaries). It is only natural then to explore how the brain\nmight take advantage of predictive coding in perception, inference, or\neven action. (See Clark 2013 for an excellent summary and entry point\nto the literature.) There is wide variety in the models presented in\nthe predictive coding paradigm, and they tend to be specified at a\nhigher level of generality than are connectionist models so far\ndiscussed. Assume we have a neural net with input, hidden and output\nlevels that has been trained on a task (say face recognition) and so\npresumably has information about faces stored in the weights\nconnecting the hidden level nodes. Three features would classify this\nnet as a predictive coding (PC) model. First, the model will have\ndownward connections from the higher levels that are able to predict\nthe next input for that task. (The prediction might be a\nrepresentation of a generic face.) Second, the data sent to the higher\nlevels for a given input is not the value recorded at the input nodes,\nbut the difference between the predicted values and the values\nactually present. (So in the example, the data provided tracks the\ndifferences between the face to be recognized and the generic face.)\nIn this way the data being received by the net is already preprocessed\nfor coding efficiency. Third, the model is trained by adjusting the\nweights in such a way that the error is minimized at the inputs. In\nother words, the trained net reduces as much as possible the\n“surprise” registered in the difference between the raw\ninput and its prediction. In so doing it comes to be able to predict\nthe face of the individual to be recognized to eliminate the error.\nSome advocates of predictive coding models suggest that this scheme\nprovides a unified account of all cognitive phenomena, including\nperception, reasoning, planning and motor control. By minimizing\nprediction error in interacting with the environment, the net is\nforced to develop the conceptual resources to model the causal\nstructure of the external world, and so navigate that world more\neffectively. \n\nThe predictive coding (PC) paradigm has attracted a lot of attention.\nThere is ample evidence that PC models capture essential details of\nvisual function in the mammalian brain (Rao & Ballard 1999; Huang\n& Rao 2011). For example, when trained on typical visual input, PC\nmodels spontaneously develop functional areas for edge, orientation\nand motion detection known to exist in visual cortex. This work also\nraises the interesting point that the visual architecture may develop\nin response to the statistics of the scenes being encountered, so that\norganisms in different environments have visual systems specially\ntuned to their needs.\n\nIt must be admitted that there is still no convincing evidence that\nthe essential features of PC models are directly implemented as\nanatomical structures in the brain. Although it is conjectured that\nsuperficial pyramidal cells may transmit prediction error, and deep\npyramidal cells predictions, we do not know that that is how they\nactually function. On the other hand, PC models do appear more\nneurally plausible than backpropagation architectures, for there is no\nneed for a separate process of training on an externally provided set\nof training samples. Instead, predictions replace the role of the\ntraining set, so that learning and interacting with the environment\nare two sides of a unified unsupervised process. \n\nPC models also show promise for explaining higher-level cognitive\nphenomena. An often-cited example is binocular rivalry. When presented\nwith entirely different images in two eyes, humans report an\noscillation between the two images as each in turn comes into\n“focus”. The PC explanation is that the system succeeds in\neliminating error by predicting the scene for one eye, but only to\nincrease the error for the other eye. So the system is unstable,\n“hunting” from one prediction to the other. Predictive\ncoding also has a natural explanation for why we are unaware of our\nblind spot, for the lack of input in that area amounts to a report of\nno error, with the result that one perceives “more of the\nsame”.\n\nPC accounts of attention have also been championed. For example, Hohwy\n(2012) notes that realistic PC models, which must tolerate noisy\ninputs, need to include parameters that track the desired precision to\nbe used in reporting error. So PC models need to make predictions of\nthe error precision relevant for a given situation. Hohwy explores the\nidea that mechanisms for optimizing precision expectations map onto\nthose that account for attention, and argues that attentional\nphenomena such as change blindness can be explained within the PC\nparadigm. \n\nPredictive coding has interesting implications for themes in the\nphilosophy of cognitive science. By integrating the processes of\ntop-down prediction with bottom-up error detection, the PC account of\nperception views it as intrinsically theory-laden. Deployment of the\nconceptual categorization of the world embodied in higher levels of\nthe net is essential to the very process of gathering data about the\nworld. This underscores, as well, tight linkages between belief,\nimaginative abilities, and perception (Grush 2004). The PC paradigm\nalso tends to support situated or embodied conceptions of cognition,\nfor it views action as a dynamic interaction between the\norganism’s effects on the environment, its predictions\nconcerning those effects (its plans), and its continual monitoring of\nerror, which provides feedback to help ensure success.\n\nIt is too early to evaluate the importance and scope of PC models in\naccounting for the various aspects of cognition. Providing a unified\ntheory of brain function in general is, after all, an impossibly high\nstandard. Clark’s target article (2013) provides a useful forum\nfor airing complaints against PC models and some possible responses.\nOne objection that is often heard is that an organism with a PC brain\ncan be expected to curl up in a dark room and die, for this is the\nbest way to minimize error at its sensory inputs. However, that view\nmay take too narrow a view of the sophistication of the predictions\navailable to the organism. If it is to survive at all, its genetic\nendowment coupled with what it can learn along the way may very well\nendow it with the expectation that it go out and seek needed resources\nin the environment. Minimizing error for that prediction of its\nbehavior will get it out of the dark room. However, it remains to be\nseen whether a theory of biological urges is usefully recast in PC\nterminology in this way, or whether PC theory is better characterized\nas only part of the explanation. Another complaint is that the\ntop-down influence on our perception coupled with the constraint that\nthe brain receives error signals rather than raw data would impose an\nunrealistic divide between a represented world of fantasy and the\nworld as it really is. It is hard to evaluate whether that qualifies\nas a serious objection. Were PC models actually to provide an account\nof our phenomenological experience, and characterize the relations\nbetween that experience and what we count as real, then skeptical\nconclusions to be drawn would count as features of the view rather\nthan objections to it. A number of responders to Clark’s target\narticle also worry that PC-models count as overly general. In trying\nto explain everything they explain nothing. Without sufficient\nconstraints on the architecture, it is too easy to pretend to explain\ncognitive phenomena by merely redescribing them in a story written in\nthe vocabulary of prediction, comparison, error minimization, and\noptimized precision. The real proof of the pudding will come with the\ndevelopment of more complex and detailed computer models in the PC\nframework that are biologically plausible, and able to demonstrate the\ndefining features of cognition.",
    "section_title": "10. Predictive Coding Models of Cognition",
    "entry_title": "Connectionism",
    "hierarchy_title": "Connectionism || Predictive Coding Models of Cognition",
    "tokenized_text": [
        "predictive",
        "coding",
        "model",
        "cognition",
        "predictive",
        "coding",
        "model",
        "cognition",
        "connectionist",
        "research",
        "matured",
        "golden",
        "age",
        "s",
        "main",
        "paradigm",
        "radiated",
        "number",
        "distinct",
        "approach",
        "two",
        "important",
        "trend",
        "worth",
        "mention",
        "predicative",
        "coding",
        "deep",
        "learning",
        "covered",
        "following",
        "section",
        "predictive",
        "coding",
        "wellestablished",
        "information",
        "processing",
        "tool",
        "wide",
        "range",
        "application",
        "useful",
        "example",
        "compressing",
        "size",
        "data",
        "set",
        "suppose",
        "wish",
        "transmit",
        "picture",
        "landscape",
        "blue",
        "sky",
        "since",
        "pixel",
        "top",
        "half",
        "image",
        "roughly",
        "shade",
        "inefficient",
        "record",
        "color",
        "value",
        "say",
        "red",
        "green",
        "blue",
        "ff",
        "hexadecimal",
        "pixel",
        "top",
        "half",
        "image",
        "since",
        "value",
        "one",
        "pixel",
        "strongly",
        "predicts",
        "value",
        "neighbor",
        "efficient",
        "thing",
        "record",
        "pixel",
        "location",
        "difference",
        "predicted",
        "value",
        "average",
        "neighbor",
        "actual",
        "value",
        "pixel",
        "case",
        "representing",
        "even",
        "shaded",
        "sky",
        "would",
        "need",
        "record",
        "blue",
        "value",
        "followed",
        "lot",
        "zero",
        "way",
        "major",
        "coding",
        "resource",
        "needed",
        "keep",
        "track",
        "point",
        "image",
        "edge",
        "large",
        "change",
        "point",
        "surprise",
        "unexpected",
        "variation",
        "well",
        "known",
        "early",
        "visual",
        "processing",
        "brain",
        "involves",
        "taking",
        "difference",
        "nearby",
        "value",
        "example",
        "identify",
        "visual",
        "boundary",
        "natural",
        "explore",
        "brain",
        "might",
        "take",
        "advantage",
        "predictive",
        "coding",
        "perception",
        "inference",
        "even",
        "action",
        "see",
        "clark",
        "excellent",
        "summary",
        "entry",
        "point",
        "literature",
        "wide",
        "variety",
        "model",
        "presented",
        "predictive",
        "coding",
        "paradigm",
        "tend",
        "specified",
        "higher",
        "level",
        "generality",
        "connectionist",
        "model",
        "far",
        "discussed",
        "assume",
        "neural",
        "net",
        "input",
        "hidden",
        "output",
        "level",
        "trained",
        "task",
        "say",
        "face",
        "recognition",
        "presumably",
        "information",
        "face",
        "stored",
        "weight",
        "connecting",
        "hidden",
        "level",
        "node",
        "three",
        "feature",
        "would",
        "classify",
        "net",
        "predictive",
        "coding",
        "pc",
        "model",
        "first",
        "model",
        "downward",
        "connection",
        "higher",
        "level",
        "able",
        "predict",
        "next",
        "input",
        "task",
        "prediction",
        "might",
        "representation",
        "generic",
        "face",
        "second",
        "data",
        "sent",
        "higher",
        "level",
        "given",
        "input",
        "value",
        "recorded",
        "input",
        "node",
        "difference",
        "predicted",
        "value",
        "value",
        "actually",
        "present",
        "example",
        "data",
        "provided",
        "track",
        "difference",
        "face",
        "recognized",
        "generic",
        "face",
        "way",
        "data",
        "received",
        "net",
        "already",
        "preprocessed",
        "coding",
        "efficiency",
        "third",
        "model",
        "trained",
        "adjusting",
        "weight",
        "way",
        "error",
        "minimized",
        "input",
        "word",
        "trained",
        "net",
        "reduces",
        "much",
        "possible",
        "surprise",
        "registered",
        "difference",
        "raw",
        "input",
        "prediction",
        "come",
        "able",
        "predict",
        "face",
        "individual",
        "recognized",
        "eliminate",
        "error",
        "advocate",
        "predictive",
        "coding",
        "model",
        "suggest",
        "scheme",
        "provides",
        "unified",
        "account",
        "cognitive",
        "phenomenon",
        "including",
        "perception",
        "reasoning",
        "planning",
        "motor",
        "control",
        "minimizing",
        "prediction",
        "error",
        "interacting",
        "environment",
        "net",
        "forced",
        "develop",
        "conceptual",
        "resource",
        "model",
        "causal",
        "structure",
        "external",
        "world",
        "navigate",
        "world",
        "effectively",
        "predictive",
        "coding",
        "pc",
        "paradigm",
        "attracted",
        "lot",
        "attention",
        "ample",
        "evidence",
        "pc",
        "model",
        "capture",
        "essential",
        "detail",
        "visual",
        "function",
        "mammalian",
        "brain",
        "rao",
        "ballard",
        "huang",
        "rao",
        "example",
        "trained",
        "typical",
        "visual",
        "input",
        "pc",
        "model",
        "spontaneously",
        "develop",
        "functional",
        "area",
        "edge",
        "orientation",
        "motion",
        "detection",
        "known",
        "exist",
        "visual",
        "cortex",
        "work",
        "also",
        "raise",
        "interesting",
        "point",
        "visual",
        "architecture",
        "may",
        "develop",
        "response",
        "statistic",
        "scene",
        "encountered",
        "organism",
        "different",
        "environment",
        "visual",
        "system",
        "specially",
        "tuned",
        "need",
        "must",
        "admitted",
        "still",
        "convincing",
        "evidence",
        "essential",
        "feature",
        "pc",
        "model",
        "directly",
        "implemented",
        "anatomical",
        "structure",
        "brain",
        "although",
        "conjectured",
        "superficial",
        "pyramidal",
        "cell",
        "may",
        "transmit",
        "prediction",
        "error",
        "deep",
        "pyramidal",
        "cell",
        "prediction",
        "know",
        "actually",
        "function",
        "hand",
        "pc",
        "model",
        "appear",
        "neurally",
        "plausible",
        "backpropagation",
        "architecture",
        "need",
        "separate",
        "process",
        "training",
        "externally",
        "provided",
        "set",
        "training",
        "sample",
        "instead",
        "prediction",
        "replace",
        "role",
        "training",
        "set",
        "learning",
        "interacting",
        "environment",
        "two",
        "side",
        "unified",
        "unsupervised",
        "process",
        "pc",
        "model",
        "also",
        "show",
        "promise",
        "explaining",
        "higherlevel",
        "cognitive",
        "phenomenon",
        "oftencited",
        "example",
        "binocular",
        "rivalry",
        "presented",
        "entirely",
        "different",
        "image",
        "two",
        "eye",
        "human",
        "report",
        "oscillation",
        "two",
        "image",
        "turn",
        "come",
        "focus",
        "pc",
        "explanation",
        "system",
        "succeeds",
        "eliminating",
        "error",
        "predicting",
        "scene",
        "one",
        "eye",
        "increase",
        "error",
        "eye",
        "system",
        "unstable",
        "hunting",
        "one",
        "prediction",
        "predictive",
        "coding",
        "also",
        "natural",
        "explanation",
        "unaware",
        "blind",
        "spot",
        "lack",
        "input",
        "area",
        "amount",
        "report",
        "error",
        "result",
        "one",
        "perceives",
        "pc",
        "account",
        "attention",
        "also",
        "championed",
        "example",
        "hohwy",
        "note",
        "realistic",
        "pc",
        "model",
        "must",
        "tolerate",
        "noisy",
        "input",
        "need",
        "include",
        "parameter",
        "track",
        "desired",
        "precision",
        "used",
        "reporting",
        "error",
        "pc",
        "model",
        "need",
        "make",
        "prediction",
        "error",
        "precision",
        "relevant",
        "given",
        "situation",
        "hohwy",
        "explores",
        "idea",
        "mechanism",
        "optimizing",
        "precision",
        "expectation",
        "map",
        "onto",
        "account",
        "attention",
        "argues",
        "attentional",
        "phenomenon",
        "change",
        "blindness",
        "explained",
        "within",
        "pc",
        "paradigm",
        "predictive",
        "coding",
        "interesting",
        "implication",
        "theme",
        "philosophy",
        "cognitive",
        "science",
        "integrating",
        "process",
        "topdown",
        "prediction",
        "bottomup",
        "error",
        "detection",
        "pc",
        "account",
        "perception",
        "view",
        "intrinsically",
        "theoryladen",
        "deployment",
        "conceptual",
        "categorization",
        "world",
        "embodied",
        "higher",
        "level",
        "net",
        "essential",
        "process",
        "gathering",
        "data",
        "world",
        "underscore",
        "well",
        "tight",
        "linkage",
        "belief",
        "imaginative",
        "ability",
        "perception",
        "grush",
        "pc",
        "paradigm",
        "also",
        "tends",
        "support",
        "situated",
        "embodied",
        "conception",
        "cognition",
        "view",
        "action",
        "dynamic",
        "interaction",
        "organism",
        "effect",
        "environment",
        "prediction",
        "concerning",
        "effect",
        "plan",
        "continual",
        "monitoring",
        "error",
        "provides",
        "feedback",
        "help",
        "ensure",
        "success",
        "early",
        "evaluate",
        "importance",
        "scope",
        "pc",
        "model",
        "accounting",
        "various",
        "aspect",
        "cognition",
        "providing",
        "unified",
        "theory",
        "brain",
        "function",
        "general",
        "impossibly",
        "high",
        "standard",
        "clark",
        "target",
        "article",
        "provides",
        "useful",
        "forum",
        "airing",
        "complaint",
        "pc",
        "model",
        "possible",
        "response",
        "one",
        "objection",
        "often",
        "heard",
        "organism",
        "pc",
        "brain",
        "expected",
        "curl",
        "dark",
        "room",
        "die",
        "best",
        "way",
        "minimize",
        "error",
        "sensory",
        "input",
        "however",
        "view",
        "may",
        "take",
        "narrow",
        "view",
        "sophistication",
        "prediction",
        "available",
        "organism",
        "survive",
        "genetic",
        "endowment",
        "coupled",
        "learn",
        "along",
        "way",
        "may",
        "well",
        "endow",
        "expectation",
        "go",
        "seek",
        "needed",
        "resource",
        "environment",
        "minimizing",
        "error",
        "prediction",
        "behavior",
        "get",
        "dark",
        "room",
        "however",
        "remains",
        "seen",
        "whether",
        "theory",
        "biological",
        "urge",
        "usefully",
        "recast",
        "pc",
        "terminology",
        "way",
        "whether",
        "pc",
        "theory",
        "better",
        "characterized",
        "part",
        "explanation",
        "another",
        "complaint",
        "topdown",
        "influence",
        "perception",
        "coupled",
        "constraint",
        "brain",
        "receives",
        "error",
        "signal",
        "rather",
        "raw",
        "data",
        "would",
        "impose",
        "unrealistic",
        "divide",
        "represented",
        "world",
        "fantasy",
        "world",
        "really",
        "hard",
        "evaluate",
        "whether",
        "qualifies",
        "serious",
        "objection",
        "pc",
        "model",
        "actually",
        "provide",
        "account",
        "phenomenological",
        "experience",
        "characterize",
        "relation",
        "experience",
        "count",
        "real",
        "skeptical",
        "conclusion",
        "drawn",
        "would",
        "count",
        "feature",
        "view",
        "rather",
        "objection",
        "number",
        "responder",
        "clark",
        "target",
        "article",
        "also",
        "worry",
        "pcmodels",
        "count",
        "overly",
        "general",
        "trying",
        "explain",
        "everything",
        "explain",
        "nothing",
        "without",
        "sufficient",
        "constraint",
        "architecture",
        "easy",
        "pretend",
        "explain",
        "cognitive",
        "phenomenon",
        "merely",
        "redescribing",
        "story",
        "written",
        "vocabulary",
        "prediction",
        "comparison",
        "error",
        "minimization",
        "optimized",
        "precision",
        "real",
        "proof",
        "pudding",
        "come",
        "development",
        "complex",
        "detailed",
        "computer",
        "model",
        "pc",
        "framework",
        "biologically",
        "plausible",
        "able",
        "demonstrate",
        "defining",
        "feature",
        "cognition"
    ]
}