{
    "main_text": "The Later-Scholastic Tradition || St Thomas Aquinas: Synderesis and Conscience as Cognitive\n3.3 William of Ockham: New Directions in the Understanding of Synderesis and Conscience\n\nWith the fourteenth-century theologian William of Ockham\n(1285–1347) we encounter some radically new developments on the\ntopics of synderesis and conscience. While Ockham’s Franciscan\npredecessor John Duns Scotus had disagreements with Aquinas about the\nnature of the moral law, Scotus fundamentally agreed with the\nDominican in viewing synderesis and conscience a habit and an act of\nthe practical reason, respectively, whose jobs were to apprehend the\nbasic principles of morality in the case of synderesis, and to apply\nthem in the case of conscience (John Duns Scotus, Ordinatio\n2, d. 39; Wolter trans. 1997: 162–163). Like Scotus, Ockham also\nagrees with Aquinas in several crucial respects. Where Ockham departs\nfrom Aquinas, and indeed with the entire scholastic tradition which\npreceded him, however, is in his abandonment of the concept of\nsynderesis, and in his unique approach to the invincibly erroneous\nconscience.\n\nIt is difficult to know for certain why Ockham abandoned the concept\nof synderesis. Michael Baylor, however, has suggested two\npossibilities. The first is that, as we have seen, synderesis was\nregarded by Ockham’s predecessors, like Aquinas, as an inborn\nhabit. But for Ockham, rational agents only come to possess habits by\nacquiring them, and they can only acquire them by doing the relevant\nacts repeatedly. The notion that a habit could be innate, then, would\nhave seemed incoherent to Ockham (Baylor 1977: 78; Fuchs 1952:\n5–6).\n\nThe second possible explanation—though Baylor thinks this\nimplausible—has to do with the way that Ockham understands the\nfoundations of morality as compared with Aquinas. For Ockham, there is\nno essential connection between the moral order as it currently exists\nand the divine wisdom. The highest norm of morality is the divine\nwill. It just so happens that murder, for example, is wrong today. But\nthere is no reason that God could not make murder right tomorrow if he\nso willed. The moral order, in short, is contingent. On the Thomistic\nview, however, the natural law is a participation in the eternal law.\nIt is the point of contact between God’s plan for us as\nconceived in the divine mind, on the one hand, and the human\nintellect, on the other. Synderesis, as we saw above, plays a key role\nin this connection insofar as it grasps the moral principles that lead\nhuman beings to their final destiny. Moreover, the moral principles\nthat guide us in how to achieve our final end are as true today as\nthey were yesterday, and indeed will be for all time, owing to the\nnatures that God has bestowed upon us. As Baylor writes:\n\n\nAs the element of man’s original nature which was substantially\nundamaged after Adam’s fall, the synteresis was the\nanthropological point of connection between an abiding moral order,\nwhich manifested ideas in the divine intellect according to which\ncreation was necessarily ordered, and man’s certain knowledge of\nuniversal principles of that moral order. Ockham, however, stressed\nthe absolute contingency of creation […] For Ockham,\nGod’s will, as manifested in the moral precepts he has ordained,\nconstitutes the ultimate and objective norm of morality. God is under\nno obligation; rather, it is divine will which determines moral\nobligation. This awesome conception of divine liberty and omnipotence,\nand the contingency of the created order has led many to the\nconclusion that the objective basis of Ockham’s ethics is\nauthoritarian or positivistic and inherently unstable since it appears\nto depend only upon an alterable divine fiat. If this were so, then it\nwould appear odd also to posit within man an inborn and inalienable\nknowledge of moral principles in the form of synteresis.\n(Baylor 1977: 79–80)\n\n\nA distinguished proponent of the interpretation Baylor describes was\nServais Pinckaers. Because the foundations of morality are rooted in\nthe divine will, which can change, there was no need for Ockham to\nresort to a mechanism that discovers the eternal principles of\nmorality as these emerge from human nature since, for Ockham, no such\nprinciples exist. Rather, according to Pinckaers’ interpretation\nof Ockham, moral principles are known through revelation. (Pinckaers\n1993: 258). While Pinckaers was correct in his assessment of\nOckham’s metaethics—which is fundamentally authoritarian\ndespite elements of rationalism—he was wrong in his\ncharacterization of Ockham’s moral epistemology. This is\nbecause, while it is indeed possible to come to know the principles of\nmorality via divine revelation, on Ockham’s account, it is also\npossible, despite their grounding in God’s will, to come to know\nthem via natural reason and experience (see Eardley 2013:\n82–87). Examples of the former, that is, of principles that are\nself-evidently true, are “every blameworthy evil is to be\navoided” and “the will ought to conform itself to right\nreason”. An example of a moral proposition that is grounded in\nexperience, on the other hand, is “an angry man should be calmed\nwith soothing words” (Eardley 2013: 86–87). God obviously\nwills that we should follow such injunctions. But how can we know his\nwill if not through revelation? Although the contemporary philosopher\nPeter Geach was not a particularly sympathetic reader of Ockham, he\nwas willing to concede the possibility that a metaethics grounded in\ndivine commands could nonetheless yield a naturalistic moral\nepistemology. As he put it:\n\n\nthe rational recognition that a practice is generally undesirable and\nthat it is best for people on the whole not even to think of resorting\nto it is thus in fact a promulgation to a man of the Divine law\nforbidding the practice, even if he does not realise that this is a\npromulgation of the Divine law, even if he does not believe there is a\nGod. (Geach 1981: 170)\n\n\nOckham would have agreed.\n\nA second and related way in which Pinckaers misinterpreted\nOckham’s moral epistemology was Pinckaers’ assumption\nthat, because Ockham discarded the traditional notion of synderesis,\nhe must have done the same for its twin concept of conscience.\nPinckaers conceded that moral principles, even if rooted in the divine\nwill, still need to be applied to particular situations on\nOckham’s account. This role was, of course, reserved for\nconscience in the earlier tradition. In Ockham, according to\nPinckaers, this role now became associated with practical reason and\nprudence (Pinckaers 1993: 259).\n\nA closer reading of the textual evidence suggests that Ockham very\nmuch made use of the traditional concept of conscience. Indeed, much\nof how he employed the concept was consistent with the tradition,\nespecially as articulated by Aquinas. Ockham associates the dictates\nof practical reason, for example, with judgements of conscience. He is\nalso emphatic in his belief that rational agents have an absolute\nobligation to follow their consciences, which can be correct or\nerroneous (Quaestiones variae, q. 8, a. 1, OTh 8: 411). A\nconscience is correct when it is in accord with right reason; it is\nerroneous when it is not. Finally, an erroneous conscience, for\nOckham, as with Aquinas, is either in a state of\nvincible—voluntary and therefore culpable—ignorance, or in\na state of invincible—or involuntary—ignorance. Where\nconscience is in a state of vincible ignorance, we must do our best to\nset it aside. In all these cases Ockham follows the tradition, with\none exception: that of the invincibly erroneous conscience (Eardley\n2013: 94–98), the state in which the agent finds himself with\nthe correct universal principles, but non-culpably errs with respect\nto his grasp of the circumstances in which he finds himself.\n\nIn what sense does Ockham depart from the tradition? For Ockham, the\nact of following an invincibly erroneous conscience is not merely\nexcusable, as it was For Aquinas, but “virtuous and\nmeritorious”. Consider the following example from Ockham. While\nwalking down the street one day you pass a homeless person who asks\nyou for money. He appears to have a moral claim on you since you\nassent to the moral principle that “help is to be given to every\nneedy person in extreme need lest he die”. Does he appear needy,\nand indeed desperate to you? Yes. Sizing him up, you determine that,\nalthough it is theoretically possible that he could be fraud, this\nseems unlikely. For Ockham, you are obliged in this instance to follow\nyour conscience, and indeed you do. It turns out, however, that this\napparent homeless person is in fact a very wealthy person who is\nimpersonating a beggar. For Ockham, in following your conscience, you\nare not merely excused or absolved of your error, but your (ignorant)\nact is virtuous and, indeed, regarded by God as meritorious (so long,\nthat is, that your act of charity is done out of love for God). As\nOckham puts it:\n\n\nConsequently, [in the above case] a right act of the will and an error\nof the intellect remain at the same time with respect to the same\nobject. And the whole reason is because that error is not in the power\nof the one who is mistaken, who took all due diligence to find out the\ntruth, and therefore that error excuses from every sin. And\nconsequently, the will that elicits the act in conformity to such\n[invincibly] erroneous reason acts virtuously and meritoriously.\nIndeed, had he not, while in such error, willed to help that person,\nhe would have performed a vicious and demeritorious act because such\nan act would have been knowingly elicited against conscience and\nagainst non-culpable reason, because in the aforementioned case he\ndoes not know that he is in error but believes that he possesses right\nreason, and consequently by despising reason [in this way] he sins\nmortally. (Quaestiones varie q. 8, a. 2, Oth 8:\n423–424)\n\n\nWhat is motivating Ockham’s novel suggestion? Even Aquinas\nadmitted that we have an obligation to follow our consciences, whether\nright or erroneous. When we do not do so, according to Aquinas, we\nsin. Of course, when our consciences are in a state of voluntary or\nvincible ignorance we also have a duty to put aside our error,\notherwise we sin. It is obviously not possible, however, to put error\naside in the case of invincible ignorance since such ignorance is by\ndefinition involuntary. Accordingly, for Aquinas, we are obliged to\nfollow such a conscience. Although we act wrongly, in such cases, we\nare, for Aquinas, excused on the grounds that we could not have known\nbetter. To return to Aquinas’s example of inadvertently sleeping\nwith someone who is not your spouse: this might be excusable, for\nAquinas, but there is no possibility that such an act might be\nconsidered virtuous, much less meritorious. But for Ockham, if it is\nvicious and therefore punishable not to follow an invincibly\nerroneous conscience, then merely being excused for following it when\nwe are under a moral obligation to do so would be an insufficient\nreward. Rather, it should logically follow that it is virtuous and\ntherefore meritorious.\n",
    "section_title": "3.3 William of Ockham: New Directions in the Understanding of Synderesis and Conscience",
    "entry_title": "Medieval Theories of Conscience",
    "hierarchy_title": "Medieval Theories of Conscience || The Later-Scholastic Tradition || St Thomas Aquinas: Synderesis and Conscience as Cognitive",
    "tokenized_text": [
        "laterscholastic",
        "tradition",
        "st",
        "thomas",
        "aquinas",
        "synderesis",
        "conscience",
        "cognitive",
        "william",
        "ockham",
        "new",
        "direction",
        "understanding",
        "synderesis",
        "conscience",
        "fourteenthcentury",
        "theologian",
        "william",
        "ockham",
        "encounter",
        "radically",
        "new",
        "development",
        "topic",
        "synderesis",
        "conscience",
        "ockham",
        "franciscan",
        "predecessor",
        "john",
        "dun",
        "scotus",
        "disagreement",
        "aquinas",
        "nature",
        "moral",
        "law",
        "scotus",
        "fundamentally",
        "agreed",
        "dominican",
        "viewing",
        "synderesis",
        "conscience",
        "habit",
        "act",
        "practical",
        "reason",
        "respectively",
        "whose",
        "job",
        "apprehend",
        "basic",
        "principle",
        "morality",
        "case",
        "synderesis",
        "apply",
        "case",
        "conscience",
        "john",
        "dun",
        "scotus",
        "ordinatio",
        "d",
        "wolter",
        "trans",
        "like",
        "scotus",
        "ockham",
        "also",
        "agrees",
        "aquinas",
        "several",
        "crucial",
        "respect",
        "ockham",
        "departs",
        "aquinas",
        "indeed",
        "entire",
        "scholastic",
        "tradition",
        "preceded",
        "however",
        "abandonment",
        "concept",
        "synderesis",
        "unique",
        "approach",
        "invincibly",
        "erroneous",
        "conscience",
        "difficult",
        "know",
        "certain",
        "ockham",
        "abandoned",
        "concept",
        "synderesis",
        "michael",
        "baylor",
        "however",
        "suggested",
        "two",
        "possibility",
        "first",
        "seen",
        "synderesis",
        "regarded",
        "ockham",
        "predecessor",
        "like",
        "aquinas",
        "inborn",
        "habit",
        "ockham",
        "rational",
        "agent",
        "come",
        "posse",
        "habit",
        "acquiring",
        "acquire",
        "relevant",
        "act",
        "repeatedly",
        "notion",
        "habit",
        "could",
        "innate",
        "would",
        "seemed",
        "incoherent",
        "ockham",
        "baylor",
        "fuchs",
        "second",
        "possible",
        "explanationthough",
        "baylor",
        "think",
        "implausiblehas",
        "way",
        "ockham",
        "understands",
        "foundation",
        "morality",
        "compared",
        "aquinas",
        "ockham",
        "essential",
        "connection",
        "moral",
        "order",
        "currently",
        "exists",
        "divine",
        "wisdom",
        "highest",
        "norm",
        "morality",
        "divine",
        "happens",
        "murder",
        "example",
        "wrong",
        "today",
        "reason",
        "god",
        "could",
        "make",
        "murder",
        "right",
        "tomorrow",
        "willed",
        "moral",
        "order",
        "short",
        "contingent",
        "thomistic",
        "view",
        "however",
        "natural",
        "law",
        "participation",
        "eternal",
        "law",
        "point",
        "contact",
        "god",
        "plan",
        "u",
        "conceived",
        "divine",
        "mind",
        "one",
        "hand",
        "human",
        "intellect",
        "synderesis",
        "saw",
        "play",
        "key",
        "role",
        "connection",
        "insofar",
        "grasp",
        "moral",
        "principle",
        "lead",
        "human",
        "being",
        "final",
        "destiny",
        "moreover",
        "moral",
        "principle",
        "guide",
        "u",
        "achieve",
        "final",
        "end",
        "true",
        "today",
        "yesterday",
        "indeed",
        "time",
        "owing",
        "nature",
        "god",
        "bestowed",
        "upon",
        "u",
        "baylor",
        "writes",
        "element",
        "man",
        "original",
        "nature",
        "substantially",
        "undamaged",
        "adam",
        "fall",
        "synteresis",
        "anthropological",
        "point",
        "connection",
        "abiding",
        "moral",
        "order",
        "manifested",
        "idea",
        "divine",
        "intellect",
        "according",
        "creation",
        "necessarily",
        "ordered",
        "man",
        "certain",
        "knowledge",
        "universal",
        "principle",
        "moral",
        "order",
        "ockham",
        "however",
        "stressed",
        "absolute",
        "contingency",
        "creation",
        "ockham",
        "god",
        "manifested",
        "moral",
        "precept",
        "ordained",
        "constitutes",
        "ultimate",
        "objective",
        "norm",
        "morality",
        "god",
        "obligation",
        "rather",
        "divine",
        "determines",
        "moral",
        "obligation",
        "awesome",
        "conception",
        "divine",
        "liberty",
        "omnipotence",
        "contingency",
        "created",
        "order",
        "led",
        "many",
        "conclusion",
        "objective",
        "basis",
        "ockham",
        "ethic",
        "authoritarian",
        "positivistic",
        "inherently",
        "unstable",
        "since",
        "appears",
        "depend",
        "upon",
        "alterable",
        "divine",
        "fiat",
        "would",
        "appear",
        "odd",
        "also",
        "posit",
        "within",
        "man",
        "inborn",
        "inalienable",
        "knowledge",
        "moral",
        "principle",
        "form",
        "synteresis",
        "baylor",
        "distinguished",
        "proponent",
        "interpretation",
        "baylor",
        "describes",
        "servais",
        "pinckaers",
        "foundation",
        "morality",
        "rooted",
        "divine",
        "change",
        "need",
        "ockham",
        "resort",
        "mechanism",
        "discovers",
        "eternal",
        "principle",
        "morality",
        "emerge",
        "human",
        "nature",
        "since",
        "ockham",
        "principle",
        "exist",
        "rather",
        "according",
        "pinckaers",
        "interpretation",
        "ockham",
        "moral",
        "principle",
        "known",
        "revelation",
        "pinckaers",
        "pinckaers",
        "correct",
        "assessment",
        "ockham",
        "metaethicswhich",
        "fundamentally",
        "authoritarian",
        "despite",
        "element",
        "rationalismhe",
        "wrong",
        "characterization",
        "ockham",
        "moral",
        "epistemology",
        "indeed",
        "possible",
        "come",
        "know",
        "principle",
        "morality",
        "via",
        "divine",
        "revelation",
        "ockham",
        "account",
        "also",
        "possible",
        "despite",
        "grounding",
        "god",
        "come",
        "know",
        "via",
        "natural",
        "reason",
        "experience",
        "see",
        "eardley",
        "example",
        "former",
        "principle",
        "selfevidently",
        "true",
        "every",
        "blameworthy",
        "evil",
        "avoided",
        "ought",
        "conform",
        "right",
        "reason",
        "example",
        "moral",
        "proposition",
        "grounded",
        "experience",
        "hand",
        "angry",
        "man",
        "calmed",
        "soothing",
        "word",
        "eardley",
        "god",
        "obviously",
        "will",
        "follow",
        "injunction",
        "know",
        "revelation",
        "although",
        "contemporary",
        "philosopher",
        "peter",
        "geach",
        "particularly",
        "sympathetic",
        "reader",
        "ockham",
        "willing",
        "concede",
        "possibility",
        "metaethics",
        "grounded",
        "divine",
        "command",
        "could",
        "nonetheless",
        "yield",
        "naturalistic",
        "moral",
        "epistemology",
        "put",
        "rational",
        "recognition",
        "practice",
        "generally",
        "undesirable",
        "best",
        "people",
        "whole",
        "even",
        "think",
        "resorting",
        "thus",
        "fact",
        "promulgation",
        "man",
        "divine",
        "law",
        "forbidding",
        "practice",
        "even",
        "realise",
        "promulgation",
        "divine",
        "law",
        "even",
        "believe",
        "god",
        "geach",
        "ockham",
        "would",
        "agreed",
        "second",
        "related",
        "way",
        "pinckaers",
        "misinterpreted",
        "ockham",
        "moral",
        "epistemology",
        "pinckaers",
        "assumption",
        "ockham",
        "discarded",
        "traditional",
        "notion",
        "synderesis",
        "must",
        "done",
        "twin",
        "concept",
        "conscience",
        "pinckaers",
        "conceded",
        "moral",
        "principle",
        "even",
        "rooted",
        "divine",
        "still",
        "need",
        "applied",
        "particular",
        "situation",
        "ockham",
        "account",
        "role",
        "course",
        "reserved",
        "conscience",
        "earlier",
        "tradition",
        "ockham",
        "according",
        "pinckaers",
        "role",
        "became",
        "associated",
        "practical",
        "reason",
        "prudence",
        "pinckaers",
        "closer",
        "reading",
        "textual",
        "evidence",
        "suggests",
        "ockham",
        "much",
        "made",
        "use",
        "traditional",
        "concept",
        "conscience",
        "indeed",
        "much",
        "employed",
        "concept",
        "consistent",
        "tradition",
        "especially",
        "articulated",
        "aquinas",
        "ockham",
        "associate",
        "dictate",
        "practical",
        "reason",
        "example",
        "judgement",
        "conscience",
        "also",
        "emphatic",
        "belief",
        "rational",
        "agent",
        "absolute",
        "obligation",
        "follow",
        "conscience",
        "correct",
        "erroneous",
        "quaestiones",
        "variae",
        "q",
        "oth",
        "conscience",
        "correct",
        "accord",
        "right",
        "reason",
        "erroneous",
        "finally",
        "erroneous",
        "conscience",
        "ockham",
        "aquinas",
        "either",
        "state",
        "vinciblevoluntary",
        "therefore",
        "culpableignorance",
        "state",
        "invincibleor",
        "involuntaryignorance",
        "conscience",
        "state",
        "vincible",
        "ignorance",
        "must",
        "best",
        "set",
        "aside",
        "case",
        "ockham",
        "follows",
        "tradition",
        "one",
        "exception",
        "invincibly",
        "erroneous",
        "conscience",
        "eardley",
        "state",
        "agent",
        "find",
        "correct",
        "universal",
        "principle",
        "nonculpably",
        "errs",
        "respect",
        "grasp",
        "circumstance",
        "find",
        "sense",
        "ockham",
        "depart",
        "tradition",
        "ockham",
        "act",
        "following",
        "invincibly",
        "erroneous",
        "conscience",
        "merely",
        "excusable",
        "aquinas",
        "virtuous",
        "meritorious",
        "consider",
        "following",
        "example",
        "ockham",
        "walking",
        "street",
        "one",
        "day",
        "pas",
        "homeless",
        "person",
        "asks",
        "money",
        "appears",
        "moral",
        "claim",
        "since",
        "assent",
        "moral",
        "principle",
        "help",
        "given",
        "every",
        "needy",
        "person",
        "extreme",
        "need",
        "lest",
        "die",
        "appear",
        "needy",
        "indeed",
        "desperate",
        "yes",
        "sizing",
        "determine",
        "although",
        "theoretically",
        "possible",
        "could",
        "fraud",
        "seems",
        "unlikely",
        "ockham",
        "obliged",
        "instance",
        "follow",
        "conscience",
        "indeed",
        "turn",
        "however",
        "apparent",
        "homeless",
        "person",
        "fact",
        "wealthy",
        "person",
        "impersonating",
        "beggar",
        "ockham",
        "following",
        "conscience",
        "merely",
        "excused",
        "absolved",
        "error",
        "ignorant",
        "act",
        "virtuous",
        "indeed",
        "regarded",
        "god",
        "meritorious",
        "long",
        "act",
        "charity",
        "done",
        "love",
        "god",
        "ockham",
        "put",
        "consequently",
        "case",
        "right",
        "act",
        "error",
        "intellect",
        "remain",
        "time",
        "respect",
        "object",
        "whole",
        "reason",
        "error",
        "power",
        "one",
        "mistaken",
        "took",
        "due",
        "diligence",
        "find",
        "truth",
        "therefore",
        "error",
        "excuse",
        "every",
        "sin",
        "consequently",
        "elicits",
        "act",
        "conformity",
        "invincibly",
        "erroneous",
        "reason",
        "act",
        "virtuously",
        "meritoriously",
        "indeed",
        "error",
        "willed",
        "help",
        "person",
        "would",
        "performed",
        "vicious",
        "demeritorious",
        "act",
        "act",
        "would",
        "knowingly",
        "elicited",
        "conscience",
        "nonculpable",
        "reason",
        "aforementioned",
        "case",
        "know",
        "error",
        "belief",
        "posse",
        "right",
        "reason",
        "consequently",
        "despising",
        "reason",
        "way",
        "sin",
        "mortally",
        "quaestiones",
        "varie",
        "q",
        "oth",
        "motivating",
        "ockham",
        "novel",
        "suggestion",
        "even",
        "aquinas",
        "admitted",
        "obligation",
        "follow",
        "conscience",
        "whether",
        "right",
        "erroneous",
        "according",
        "aquinas",
        "sin",
        "course",
        "conscience",
        "state",
        "voluntary",
        "vincible",
        "ignorance",
        "also",
        "duty",
        "put",
        "aside",
        "error",
        "otherwise",
        "sin",
        "obviously",
        "possible",
        "however",
        "put",
        "error",
        "aside",
        "case",
        "invincible",
        "ignorance",
        "since",
        "ignorance",
        "definition",
        "involuntary",
        "accordingly",
        "aquinas",
        "obliged",
        "follow",
        "conscience",
        "although",
        "act",
        "wrongly",
        "case",
        "aquinas",
        "excused",
        "ground",
        "could",
        "known",
        "better",
        "return",
        "aquinas",
        "example",
        "inadvertently",
        "sleeping",
        "someone",
        "spouse",
        "might",
        "excusable",
        "aquinas",
        "possibility",
        "act",
        "might",
        "considered",
        "virtuous",
        "much",
        "le",
        "meritorious",
        "ockham",
        "vicious",
        "therefore",
        "punishable",
        "follow",
        "invincibly",
        "erroneous",
        "conscience",
        "merely",
        "excused",
        "following",
        "moral",
        "obligation",
        "would",
        "insufficient",
        "reward",
        "rather",
        "logically",
        "follow",
        "virtuous",
        "therefore",
        "meritorious"
    ]
}