{
    "main_text": "Objections to Consequentializing || Act-Consequentialist Counterpart Theories Are Explanatorily Inadequate\n4.4 Act-Consequentialist Counterpart Theories Are Explanatorily Inadequate\n\nEven if the act-consequentialist counterpart theories that earnest\nconsequentializers produce aren’t gimmicky, they could be\nobjectionable for other reasons. Indeed, some argue that they are\nexplanatorily inadequate. For whereas many earnest consequentializers\nadopt\n Reasons for Preferring Ground Deontic Statuses\n and, so, hold that the deontic statuses of actions are grounded in\nthe reasons that agents have for preferring (or dispreferring) the\noutcomes in which they are performed, others believe that it’s\nthe other way around. As they see it, these act-consequentialist\ncounterpart theories invert the true explanatory direction. For\nwhereas the earnest consequentializer holds that the impermissibility\nof Abe’s breaking his promise is grounded in the fact that he\nought to prefer the outcome in which he keeps it, they believe instead\nthat Abe’s reason for preferring the outcome in which he keeps\nit is grounded in the fact that it’s impermissible for him to\nbreak it. And precursors of this objection go as far back as E. F.\nCarritt (1928: 72–3) and W. D. Ross (1939: 289), both of whom\nargued that even if we think that promise-breakings are bad, we should\nthink this only because it’s wrong to break a promise. And, so,\nthe wrongness of promise-breakings explains their badness, not the\nother way around, as the act-consequentialist might suppose.\n\nEarnest consequentializers retort that it’s actually\nnon-consequentialists who invert the true order of explanation. They\nargue that the deontic statuses of actions are grounded in reasons for\nperforming them and that it’s more plausible to think that\nreasons for actions are grounded in reasons for preferring their\noutcomes than vice versa (see, e.g., Portmore 2011: chap. 3,\nespecially 78–82).\n\nMore recently, however, Stephen Emet (2010) and Christopher Howard\n(2021) have argued that act-consequentialist counterpart theories are\nexplanatorily inadequate for a different reason. They argue that, in\ntaking the Compelling Idea to be something such as\n Reasons for Preferring Ground Deontic Statuses,\n the earnest consequentializer is forced to give up a plausible\nrationale for certain deontic verdicts. Take, for instance, the\ndeontic verdict that it would be wrong for you to kill even in a\nsituation in which the mafia has credibly threatened to kill five\ninnocent strangers unless you kill a sixth (C. Howard 2021: 728).\nHoward claims that, in providing a rationale for this verdict, the\nearnest consequentializer must eschew the plausible view that it lies\nwith the fact that your potential victim has the kind of value that\ncalls for your not treating them as a mere means and must instead\nembrace the implausible view that it lies with the fact that you, the\nagent, ought to have a self-centered, and self-indulgent, preference\nfor keeping your own hands clean. He argues that since your reasons\nfor refraining from treating your potential victim as a mere means\n\n\nhave their source in the value of [your potential victim],\n…they’re reasons…[that] don’t derive\nfrom…[your] reasons for preferring some outcomes to others.\n(2021: 749)\n\n\nBut this reasoning is fallacious. From the fact that A\nultimately derives from (and, thus, has its source in) C, it\ndoesn’t follow that A doesn’t derive from\nB. For it could be that A derives from B,\nwhich in turn derives from C.\n\nAct-consequentialists are committed to the evaluative rankings of\noutcomes being explanatorily prior to the deontic statuses of the\nactions that produce them, but they’re not committed to the\nevaluative rankings of outcomes being explanatory prior to the deontic\nstatuses of attitudes, such as the attitude of respect towards\nends-in-themselves. Given this, earnest consequentializers can argue\nthat there’s nothing that precludes them from holding either\nthat persons are ends-in-themselves who are owed respect or that this\nfact is explanatorily prior to the evaluative rankings of outcomes.\nThat is, earnest consequentializers can argue that you have a duty to\nrespect persons and that this duty gives rise to a duty to prefer that\nyou not treat them as a mere means—even as a mere means to that\nof preventing the mafia from killing five others. What’s more,\ngiven this duty to prefer the outcome in which you refrain from\nkilling the one to the outcome in which you kill the one as a mere\nmeans to preventing the mafia from killing the five, the former\noutranks the latter from your evaluative position. And this, given\nact-consequentialism, explains the impermissibility of your killing\nthe one to prevent the five from being killed by the mafia. Thus, the\nearnest consequentializer hopes to consequentialize the deontic\nverdict that it’s wrong for you to kill the one even to prevent\nthe mafia from killing the five without giving up the plausible\nthought that the rationale for this ultimately lies with your\nwould-be victim and their value as an end-in-themself (see Portmore\nforthcoming and Portmore 2019: 235–7).\n\nNow, one may object that if someone concedes that the rationale for\nthe impermissibility of your killing the one to prevent the five from\nbeing killed by the mafia ultimately lies with your would-be victim\nand their value as an end-in-themself, then they thereby commit\nthemself to Kantianism as opposed to act-consequentialism. But earnest\nconsequentializers argue that this is a mistake. They believe that the\ndifference between Kantianism and act-consequentialism is that whereas\nthe former holds that the ultimate right-making feature of an act is\nthat it shows the proper respect for humanity, the latter holds that\nthe ultimate right-making feature of an act is instead that its\noutcome is not outranked by that of any available alternative. Thus,\nthe act-consequentialist can hold that what determines whether one\noutcome is outranked by another is anything other than the deontic\nstatuses of the acts that produce them. So, they can even hold that\nwhat determines whether the one outranks the other is whether the\nagent treats someone who is an end-in-themself as a mere means in the\none but not the other.\n\nAs the earnest consequentializer sees things, moral theories are to be\ndifferentiated by what they take the ultimate right- and wrong-making\nfeatures of actions to be, not by what they take the ultimate\nrationale for an act’s being right or wrong to be. To\nillustrate, consider utilitarian theological voluntarism again. It\nholds both that the ultimate right-making feature of an act is that it\naccords with God’s will and that God is perfectly good and, so,\nwills each of us to maximize the good, which they take to be hedonic\nutility. In their view, the ultimate rationale for an act’s\nbeing obligatory is that it produces the best outcome. For they hold\nthat an act’s outcome being best is what explains why God (being\nperfectly good) wills the agent to perform it. And God’s willing\nthe agent to perform it, in turn, explains why it’s obligatory.\nBut, as earnest consequentializers see things, this doesn’t make\nthe view act-consequentialist. Indeed, they see it as a rival to\nact-consequentialism given that it holds that the ultimate\nright-making feature of an act is that it accords with God’s\nwill, not that its outcome is not outranked by that of any available\nalternative. And this does seem to be a significant difference. For if\nthe theological voluntarist were to be convinced that, in fact, God\nisn’t perfectly good and even wills us to torture children for\nfun, they would be forced to concede that it would be right to do so.\nBy contrast, the act-consequentialist’s view of what’s\nright is independent of their view on what God wills. Given this,\nearnest consequentializers think that we should conclude that a theory\nthat holds that the ultimate right-making feature of an act is that\nits outcome is not outranked by that of any available alternative is\nact-consequentialist even if it holds that the rationale for the\nwrongness of your killing the one to prevent the mafia from killing\nthe five ultimately lies with your would-be victim and their value as\nan end-in-themself.\n\nThere is, of course, more to be said on this topic of explanatory\nadequacy, including whether the earnest consequentializer can give a\nplausible explanation for the idea that it’s sometimes wrong to\nviolate an agent-centered constraint even to minimize one’s own\nviolations of that constraint—see, e.g., Brook 1991; Kamm 1996;\nLopez et al. 2009; Otsuka 2011; and Portmore forthcoming. Still, the\nabove should give the reader a sense of why non-consequentialists\nmight find act-consequentialist counterpart theories to be\nexplanatorily inadequate and how the earnest consequentializer might\nreply to such worries.\n",
    "section_title": "4.4 Act-Consequentialist Counterpart Theories Are Explanatorily Inadequate",
    "entry_title": "Consequentializing",
    "hierarchy_title": "Consequentializing || Objections to Consequentializing || Act-Consequentialist Counterpart Theories Are Explanatorily Inadequate",
    "tokenized_text": [
        "objection",
        "consequentializing",
        "actconsequentialist",
        "counterpart",
        "theory",
        "explanatorily",
        "inadequate",
        "actconsequentialist",
        "counterpart",
        "theory",
        "explanatorily",
        "inadequate",
        "even",
        "actconsequentialist",
        "counterpart",
        "theory",
        "earnest",
        "consequentializers",
        "produce",
        "gimmicky",
        "could",
        "objectionable",
        "reason",
        "indeed",
        "argue",
        "explanatorily",
        "inadequate",
        "whereas",
        "many",
        "earnest",
        "consequentializers",
        "adopt",
        "reason",
        "preferring",
        "ground",
        "deontic",
        "status",
        "hold",
        "deontic",
        "status",
        "action",
        "grounded",
        "reason",
        "agent",
        "preferring",
        "dispreferring",
        "outcome",
        "performed",
        "others",
        "believe",
        "way",
        "around",
        "see",
        "actconsequentialist",
        "counterpart",
        "theory",
        "invert",
        "true",
        "explanatory",
        "direction",
        "whereas",
        "earnest",
        "consequentializer",
        "hold",
        "impermissibility",
        "abe",
        "breaking",
        "promise",
        "grounded",
        "fact",
        "ought",
        "prefer",
        "outcome",
        "keep",
        "believe",
        "instead",
        "abe",
        "reason",
        "preferring",
        "outcome",
        "keep",
        "grounded",
        "fact",
        "impermissible",
        "break",
        "precursor",
        "objection",
        "go",
        "far",
        "back",
        "e",
        "f",
        "carritt",
        "w",
        "d",
        "ross",
        "argued",
        "even",
        "think",
        "promisebreakings",
        "bad",
        "think",
        "wrong",
        "break",
        "promise",
        "wrongness",
        "promisebreakings",
        "explains",
        "badness",
        "way",
        "around",
        "actconsequentialist",
        "might",
        "suppose",
        "earnest",
        "consequentializers",
        "retort",
        "actually",
        "nonconsequentialists",
        "invert",
        "true",
        "order",
        "explanation",
        "argue",
        "deontic",
        "status",
        "action",
        "grounded",
        "reason",
        "performing",
        "plausible",
        "think",
        "reason",
        "action",
        "grounded",
        "reason",
        "preferring",
        "outcome",
        "vice",
        "versa",
        "see",
        "eg",
        "portmore",
        "chap",
        "especially",
        "recently",
        "however",
        "stephen",
        "emet",
        "christopher",
        "howard",
        "argued",
        "actconsequentialist",
        "counterpart",
        "theory",
        "explanatorily",
        "inadequate",
        "different",
        "reason",
        "argue",
        "taking",
        "compelling",
        "idea",
        "something",
        "reason",
        "preferring",
        "ground",
        "deontic",
        "status",
        "earnest",
        "consequentializer",
        "forced",
        "give",
        "plausible",
        "rationale",
        "certain",
        "deontic",
        "verdict",
        "take",
        "instance",
        "deontic",
        "verdict",
        "would",
        "wrong",
        "kill",
        "even",
        "situation",
        "mafia",
        "credibly",
        "threatened",
        "kill",
        "five",
        "innocent",
        "stranger",
        "unless",
        "kill",
        "sixth",
        "c",
        "howard",
        "howard",
        "claim",
        "providing",
        "rationale",
        "verdict",
        "earnest",
        "consequentializer",
        "must",
        "eschew",
        "plausible",
        "view",
        "lie",
        "fact",
        "potential",
        "victim",
        "kind",
        "value",
        "call",
        "treating",
        "mere",
        "mean",
        "must",
        "instead",
        "embrace",
        "implausible",
        "view",
        "lie",
        "fact",
        "agent",
        "ought",
        "selfcentered",
        "selfindulgent",
        "preference",
        "keeping",
        "hand",
        "clean",
        "argues",
        "since",
        "reason",
        "refraining",
        "treating",
        "potential",
        "victim",
        "mere",
        "mean",
        "source",
        "value",
        "potential",
        "victim",
        "they",
        "reasons",
        "derive",
        "from",
        "reason",
        "preferring",
        "outcome",
        "others",
        "reasoning",
        "fallacious",
        "fact",
        "ultimately",
        "derives",
        "thus",
        "source",
        "c",
        "follow",
        "derive",
        "b",
        "could",
        "derives",
        "b",
        "turn",
        "derives",
        "c",
        "actconsequentialists",
        "committed",
        "evaluative",
        "ranking",
        "outcome",
        "explanatorily",
        "prior",
        "deontic",
        "status",
        "action",
        "produce",
        "committed",
        "evaluative",
        "ranking",
        "outcome",
        "explanatory",
        "prior",
        "deontic",
        "status",
        "attitude",
        "attitude",
        "respect",
        "towards",
        "endsinthemselves",
        "given",
        "earnest",
        "consequentializers",
        "argue",
        "nothing",
        "precludes",
        "holding",
        "either",
        "person",
        "endsinthemselves",
        "owed",
        "respect",
        "fact",
        "explanatorily",
        "prior",
        "evaluative",
        "ranking",
        "outcome",
        "earnest",
        "consequentializers",
        "argue",
        "duty",
        "respect",
        "person",
        "duty",
        "give",
        "rise",
        "duty",
        "prefer",
        "treat",
        "mere",
        "meanseven",
        "mere",
        "mean",
        "preventing",
        "mafia",
        "killing",
        "five",
        "others",
        "given",
        "duty",
        "prefer",
        "outcome",
        "refrain",
        "killing",
        "one",
        "outcome",
        "kill",
        "one",
        "mere",
        "mean",
        "preventing",
        "mafia",
        "killing",
        "five",
        "former",
        "outranks",
        "latter",
        "evaluative",
        "position",
        "given",
        "actconsequentialism",
        "explains",
        "impermissibility",
        "killing",
        "one",
        "prevent",
        "five",
        "killed",
        "mafia",
        "thus",
        "earnest",
        "consequentializer",
        "hope",
        "consequentialize",
        "deontic",
        "verdict",
        "wrong",
        "kill",
        "one",
        "even",
        "prevent",
        "mafia",
        "killing",
        "five",
        "without",
        "giving",
        "plausible",
        "thought",
        "rationale",
        "ultimately",
        "lie",
        "wouldbe",
        "victim",
        "value",
        "endinthemself",
        "see",
        "portmore",
        "forthcoming",
        "portmore",
        "one",
        "may",
        "object",
        "someone",
        "concedes",
        "rationale",
        "impermissibility",
        "killing",
        "one",
        "prevent",
        "five",
        "killed",
        "mafia",
        "ultimately",
        "lie",
        "wouldbe",
        "victim",
        "value",
        "endinthemself",
        "thereby",
        "commit",
        "themself",
        "kantianism",
        "opposed",
        "actconsequentialism",
        "earnest",
        "consequentializers",
        "argue",
        "mistake",
        "believe",
        "difference",
        "kantianism",
        "actconsequentialism",
        "whereas",
        "former",
        "hold",
        "ultimate",
        "rightmaking",
        "feature",
        "act",
        "show",
        "proper",
        "respect",
        "humanity",
        "latter",
        "hold",
        "ultimate",
        "rightmaking",
        "feature",
        "act",
        "instead",
        "outcome",
        "outranked",
        "available",
        "alternative",
        "thus",
        "actconsequentialist",
        "hold",
        "determines",
        "whether",
        "one",
        "outcome",
        "outranked",
        "another",
        "anything",
        "deontic",
        "status",
        "act",
        "produce",
        "even",
        "hold",
        "determines",
        "whether",
        "one",
        "outranks",
        "whether",
        "agent",
        "treat",
        "someone",
        "endinthemself",
        "mere",
        "mean",
        "one",
        "earnest",
        "consequentializer",
        "see",
        "thing",
        "moral",
        "theory",
        "differentiated",
        "take",
        "ultimate",
        "right",
        "wrongmaking",
        "feature",
        "action",
        "take",
        "ultimate",
        "rationale",
        "act",
        "right",
        "wrong",
        "illustrate",
        "consider",
        "utilitarian",
        "theological",
        "voluntarism",
        "hold",
        "ultimate",
        "rightmaking",
        "feature",
        "act",
        "accord",
        "god",
        "god",
        "perfectly",
        "good",
        "will",
        "u",
        "maximize",
        "good",
        "take",
        "hedonic",
        "utility",
        "view",
        "ultimate",
        "rationale",
        "act",
        "obligatory",
        "produce",
        "best",
        "outcome",
        "hold",
        "act",
        "outcome",
        "best",
        "explains",
        "god",
        "perfectly",
        "good",
        "will",
        "agent",
        "perform",
        "god",
        "willing",
        "agent",
        "perform",
        "turn",
        "explains",
        "obligatory",
        "earnest",
        "consequentializers",
        "see",
        "thing",
        "make",
        "view",
        "actconsequentialist",
        "indeed",
        "see",
        "rival",
        "actconsequentialism",
        "given",
        "hold",
        "ultimate",
        "rightmaking",
        "feature",
        "act",
        "accord",
        "god",
        "outcome",
        "outranked",
        "available",
        "alternative",
        "seem",
        "significant",
        "difference",
        "theological",
        "voluntarist",
        "convinced",
        "fact",
        "god",
        "perfectly",
        "good",
        "even",
        "will",
        "u",
        "torture",
        "child",
        "fun",
        "would",
        "forced",
        "concede",
        "would",
        "right",
        "contrast",
        "actconsequentialist",
        "view",
        "right",
        "independent",
        "view",
        "god",
        "will",
        "given",
        "earnest",
        "consequentializers",
        "think",
        "conclude",
        "theory",
        "hold",
        "ultimate",
        "rightmaking",
        "feature",
        "act",
        "outcome",
        "outranked",
        "available",
        "alternative",
        "actconsequentialist",
        "even",
        "hold",
        "rationale",
        "wrongness",
        "killing",
        "one",
        "prevent",
        "mafia",
        "killing",
        "five",
        "ultimately",
        "lie",
        "wouldbe",
        "victim",
        "value",
        "endinthemself",
        "course",
        "said",
        "topic",
        "explanatory",
        "adequacy",
        "including",
        "whether",
        "earnest",
        "consequentializer",
        "give",
        "plausible",
        "explanation",
        "idea",
        "sometimes",
        "wrong",
        "violate",
        "agentcentered",
        "constraint",
        "even",
        "minimize",
        "one",
        "violation",
        "constraintsee",
        "eg",
        "brook",
        "kamm",
        "lopez",
        "et",
        "al",
        "otsuka",
        "portmore",
        "forthcoming",
        "still",
        "give",
        "reader",
        "sense",
        "nonconsequentialists",
        "might",
        "find",
        "actconsequentialist",
        "counterpart",
        "theory",
        "explanatorily",
        "inadequate",
        "earnest",
        "consequentializer",
        "might",
        "reply",
        "worry"
    ]
}