{
    "main_text": "Constitutional Interpretation\n7. Constitutional Interpretation\n\nAs we have just seen, there is often more to a constitution than\nconstitutional law. As we have also seen, constitutional norms need\nnot always be written rules. Despite these important observations, two\nfacts must be acknowledged: (1) the vast majority of constitutional\ncases hinge on questions of constitutional law; and (2) modern\nconstitutions consist primarily of written\n documents.[12]\n Consequently, constitutional cases often raise theoretical issues\nconcerning the proper approach to the interpretation of written\ninstruments—colored, of course, by the special role\nconstitutions play – or ought to play – in defining and\nlimiting the authority and powers of government. Differences of view\non these matters come to light most forcefully when a case turns on\nthe interpretation of a constitutional provision that deals with\nabstract civil rights (e.g., the right to due process of law, or to\n equality).[13]\n How such provisions are to be interpreted has been subject to intense\ncontroversy among legal practitioners and theorists, and it is upon\nsuch provisions that this entry will focus. As we shall see, stark\ndifferences of opinion on this issue are usually rooted in different\nviews on the aspirations of constitutions or on the appropriate role\nof judges within constitutional democracies.\n\nAlthough theories of constitutional interpretation are many and\nvaried, they all seem, in one way or another, to ascribe importance to\na number of key factors: textual or semantic meaning; political,\nsocial and legal history; intention; original understanding; and\nmoral/political theory. The roles played by each of these factors in a\ntheory of constitutional interpretation depend crucially on how the\ntheorist conceives of a constitution and its role in limiting\ngovernment power. For example, if a theorist conceives of a\nconstitution as foundational law whose existence, meaning and\nauthority derive from the determinate, historical acts of its authors\nand/or those they represented(ed), and whose principal point is to\nfix a long-standing, stable framework or set of ground rules\nwithin which legislative, executive and judicial powers are to be\nexercised by the various branches of government, she may be inclined\ntowards an interpretive theory which accords pride of place to\nfactors like authors’ intentions or the meanings they (and\nperhaps the general public at the time) would have ascribed to the\nterms chosen for inclusion in the constitution. On what we will call\nthe fixed view of constitutions, it is natural to think that\nfactors like these should govern whenever they are clear and\nconsistent. And the reason is quite straight forward. On the fixed\nview, a constitution not only aspires to establish a stable framework\nwithin which government powers are to be exercised, it aspires to\nestablish one which is above, or removed from, the deep disagreements\nand partisan controversies encountered in ordinary, day to day law and\npolitics. It aspires, in short, to be both stable and morally\nand politically neutral on controversial issues such as\nwhether there should be laws affirming a woman’s right to an\nabortion, or the right of workers to a minimum wage. To be clear,\nsaying that a constitution aspires, on a fixed view, to be morally and\npolitically neutral, is not meant to deny that those who take this\nstance believe that it expresses a particular political vision or a\nset of fundamental commitments to certain values and principles of\npolitical morality. Quite the contrary. All constitutional theorists\nwill agree that constitutions typically enshrine, indeed entrench, a\nrange of moral and political commitments to values like democracy,\nequality, free expression, and the rule of law. But two points need to\nbe stressed.\n\nFirst, fixed views attempt to transform questions about the moral and\npolitical soundness of these commitments into historical questions,\nprincipally concerning beliefs about their soundness. The\ntask is not to ask: What do we now think about values like\nequality and freedom of expression? Rather, it is to ask: What did\nthey—the authors of the constitution or those on whose\nauthority they created the constitution—in fact think about\nthose values? What was their original understanding of them,\nor the understanding among most members of the general population that\nexisted at the time of the constitution’s creation (or\namendment, if the provision in question was introduced at a later\ntime)? So stability and neutrality are, on fixed views, served to the\nextent that a constitution is capable of transforming questions of\npolitical morality into historical ones.\n\nSecond, no proponent of the fixed view will deny that the abstract\nmoral commitments expressed in a constitution tend to be widely, if\nnot universally shared among members of the relevant political\ncommunity. In that sense, then, the constitution, despite the moral\ncommitments it embodies, is neutral as between citizens and their many\nmore partisan differences of opinion on more particular moral\nquestions. Not everyone in a modern, constitutional democracy like the\nUS or Germany agrees on the extent to which the right to free\nexpression demands the liberty to express opinions that display and\npromote hatred toward an identifiable religious or racial group. But\nvirtually no one would deny the vital importance of expressive freedom\nin a truly free and democratic society. On fixed views, then,\nconstitutions can be seen as analogous to the ground rules of a\ndebating society. Each sets the mutually agreed, stable framework\nwithin which controversial debate (and action) is to take place. And\njust as a debating society could not function if its ground rules\ncould be revised by a debater in order to win the debate, a\nconstitution could not serve its role if its terms were constantly\nopen to debate and revision by participants within the political and\nlegal processes it aspires to govern in order to achieve a desired\nresult. We avoid this possibility, according to those who espouse the\nfixed view, to the extent that we are able to replace controversial\nmoral and political questions with historical questions about the\nintentions of constitutional authors in creating what they did, or\nabout how the terms they chose to express constitutional requirements\nwere publicly understood at the time they were chosen.\n\nTo sum up: the desire for stability and neutrality leads modern\nproponents of the fixed view to view constitutional interpretation as\nan exercise which, when undertaken properly, focuses on authors’\nintentions or on original understandings of the meaning and import of\nthe words chosen to express agreed limits on government power and\nauthority. Those who endorse this fixed view generally espouse what\nhas come to be known as originalism. Only if interpreters\nrestrict themselves to original intentions and/or understandings, and\ndo not attempt to insert their own contentious views under the guise\nof ‘interpretation’, can the role of a constitution be\nsecured. Only then, originalists maintain, can it serve as the\npolitically neutral, stable framework its nature demands.\n\nBut not all constitutional theorists believe that the foundational\nrole of a constitution demands that its meaning and interpretation be\nsomehow fixed, or that its interpretation be absolutely immune from\nconsiderations of moral and political theory and debate. On the\ncontrary, many constitutional scholars and judges embrace living\nconstitutionalism, an approach that sees a constitution as an\nevolving, living entity which, by its very nature, is capable of\nresponding to changing social circumstances and new (and it is hoped\nbetter) moral and political beliefs. Along with this very different\nview of constitutions come very different theories regarding the\nnature and limits of legitimate constitutional interpretation. One\nstrand within living constitutionalism, upon which we will be focus\nbelow, stresses the extent to which constitutional interpretation\nresembles the kind of reasoning that takes place in other areas of the\nlaw pertaining to common law legal systems, such as the law of\ncontracts and torts. Just as the law of contributory negligence\nemerged and (continuously) evolves in common law countries in a\ncase-by-case, incremental manner, over many decades and as the product\nof many judicial decisions, the law of equal protection, free\nexpression, due process and the like (continuously) evolves in modern\nwestern democracies as constitutional cases are heard and decided.\n\nDisputes between fixed-view originalists and living constitutionalists\nare among the liveliest and most contentious to have arisen in\nconstitutional scholarship over the past several decades. Debates have\ntended to focus on abstract civil rights provisions of constitutions,\nsuch as the due process clause of the American Constitution, or\nSection 7 of the Canadian Charter of Rights and Freedoms, which\n’guarantees the right to life, liberty and security of the\nperson and the right not to be deprived thereof except in accordance\nwith the principles of fundamental\n justice.[14]\n Given the fixed view to which they are committed, contemporary\noriginalists view anything more than an attempt to discover, so as to\npreserve and apply, original understandings of, or the intentions\nbehind, such provisions as constitutional revision or\n‘construction,’ often masquerading as the interpretation\nof an unchanged\n original.[15]\n On the other side, we find the living constitutionalists who tend to\nview originalism as a reactionary, overly conservative theory serving\nonly to tie a democratic community to the ‘dead hand of the\npast.’ Originalists, their opponents claim, render us incapable\nof responding rationally and responsibly to changing social\ncircumstances and improved moral views concerning the requirements of\nthe abstract values and principles articulated and endorsed in modern\nconstitutions. Living constitutionalists, the originalist counters,\nrecommend constitutional practices that threaten a number of cherished\nvalues, among them the rule of law and the separation of powers. They\nare, in effect, happy to place the constitution in the hands of\ncontemporary judges who are permitted, under the guise of\ninterpreting it, to change the constitution to suit their own\npolitical inclinations and moral preferences. And this, originalists\nclaim, only serves to thwart cherished values secured by having a\nstable, politically neutral constitution, and may render all talk of\ngenuine constitutional constraint meaningless.\n",
    "section_title": "7. Constitutional Interpretation",
    "entry_title": "Constitutionalism",
    "hierarchy_title": "Constitutionalism || Constitutional Interpretation",
    "tokenized_text": [
        "constitutional",
        "interpretation",
        "constitutional",
        "interpretation",
        "seen",
        "often",
        "constitution",
        "constitutional",
        "law",
        "also",
        "seen",
        "constitutional",
        "norm",
        "need",
        "always",
        "written",
        "rule",
        "despite",
        "important",
        "observation",
        "two",
        "fact",
        "must",
        "acknowledged",
        "vast",
        "majority",
        "constitutional",
        "case",
        "hinge",
        "question",
        "constitutional",
        "law",
        "modern",
        "constitution",
        "consist",
        "primarily",
        "written",
        "document",
        "consequently",
        "constitutional",
        "case",
        "often",
        "raise",
        "theoretical",
        "issue",
        "concerning",
        "proper",
        "approach",
        "interpretation",
        "written",
        "instrumentscolored",
        "course",
        "special",
        "role",
        "constitution",
        "play",
        "ought",
        "play",
        "defining",
        "limiting",
        "authority",
        "power",
        "government",
        "difference",
        "view",
        "matter",
        "come",
        "light",
        "forcefully",
        "case",
        "turn",
        "interpretation",
        "constitutional",
        "provision",
        "deal",
        "abstract",
        "civil",
        "right",
        "eg",
        "right",
        "due",
        "process",
        "law",
        "equality",
        "provision",
        "interpreted",
        "subject",
        "intense",
        "controversy",
        "among",
        "legal",
        "practitioner",
        "theorist",
        "upon",
        "provision",
        "entry",
        "focus",
        "shall",
        "see",
        "stark",
        "difference",
        "opinion",
        "issue",
        "usually",
        "rooted",
        "different",
        "view",
        "aspiration",
        "constitution",
        "appropriate",
        "role",
        "judge",
        "within",
        "constitutional",
        "democracy",
        "although",
        "theory",
        "constitutional",
        "interpretation",
        "many",
        "varied",
        "seem",
        "one",
        "way",
        "another",
        "ascribe",
        "importance",
        "number",
        "key",
        "factor",
        "textual",
        "semantic",
        "meaning",
        "political",
        "social",
        "legal",
        "history",
        "intention",
        "original",
        "understanding",
        "moralpolitical",
        "theory",
        "role",
        "played",
        "factor",
        "theory",
        "constitutional",
        "interpretation",
        "depend",
        "crucially",
        "theorist",
        "conceives",
        "constitution",
        "role",
        "limiting",
        "government",
        "power",
        "example",
        "theorist",
        "conceives",
        "constitution",
        "foundational",
        "law",
        "whose",
        "existence",
        "meaning",
        "authority",
        "derive",
        "determinate",
        "historical",
        "act",
        "author",
        "andor",
        "represented",
        "ed",
        "whose",
        "principal",
        "point",
        "fix",
        "longstanding",
        "stable",
        "framework",
        "set",
        "ground",
        "rule",
        "within",
        "legislative",
        "executive",
        "judicial",
        "power",
        "exercised",
        "various",
        "branch",
        "government",
        "may",
        "inclined",
        "towards",
        "interpretive",
        "theory",
        "accord",
        "pride",
        "place",
        "factor",
        "like",
        "author",
        "intention",
        "meaning",
        "perhaps",
        "general",
        "public",
        "time",
        "would",
        "ascribed",
        "term",
        "chosen",
        "inclusion",
        "constitution",
        "call",
        "fixed",
        "view",
        "constitution",
        "natural",
        "think",
        "factor",
        "like",
        "govern",
        "whenever",
        "clear",
        "consistent",
        "reason",
        "quite",
        "straight",
        "forward",
        "fixed",
        "view",
        "constitution",
        "aspires",
        "establish",
        "stable",
        "framework",
        "within",
        "government",
        "power",
        "exercised",
        "aspires",
        "establish",
        "one",
        "removed",
        "deep",
        "disagreement",
        "partisan",
        "controversy",
        "encountered",
        "ordinary",
        "day",
        "day",
        "law",
        "politics",
        "aspires",
        "short",
        "stable",
        "morally",
        "politically",
        "neutral",
        "controversial",
        "issue",
        "whether",
        "law",
        "affirming",
        "woman",
        "right",
        "abortion",
        "right",
        "worker",
        "minimum",
        "wage",
        "clear",
        "saying",
        "constitution",
        "aspires",
        "fixed",
        "view",
        "morally",
        "politically",
        "neutral",
        "meant",
        "deny",
        "take",
        "stance",
        "believe",
        "express",
        "particular",
        "political",
        "vision",
        "set",
        "fundamental",
        "commitment",
        "certain",
        "value",
        "principle",
        "political",
        "morality",
        "quite",
        "contrary",
        "constitutional",
        "theorist",
        "agree",
        "constitution",
        "typically",
        "enshrine",
        "indeed",
        "entrench",
        "range",
        "moral",
        "political",
        "commitment",
        "value",
        "like",
        "democracy",
        "equality",
        "free",
        "expression",
        "rule",
        "law",
        "two",
        "point",
        "need",
        "stressed",
        "first",
        "fixed",
        "view",
        "attempt",
        "transform",
        "question",
        "moral",
        "political",
        "soundness",
        "commitment",
        "historical",
        "question",
        "principally",
        "concerning",
        "belief",
        "soundness",
        "task",
        "ask",
        "think",
        "value",
        "like",
        "equality",
        "freedom",
        "expression",
        "rather",
        "ask",
        "theythe",
        "author",
        "constitution",
        "whose",
        "authority",
        "created",
        "constitutionin",
        "fact",
        "think",
        "value",
        "original",
        "understanding",
        "understanding",
        "among",
        "member",
        "general",
        "population",
        "existed",
        "time",
        "constitution",
        "creation",
        "amendment",
        "provision",
        "question",
        "introduced",
        "later",
        "time",
        "stability",
        "neutrality",
        "fixed",
        "view",
        "served",
        "extent",
        "constitution",
        "capable",
        "transforming",
        "question",
        "political",
        "morality",
        "historical",
        "one",
        "second",
        "proponent",
        "fixed",
        "view",
        "deny",
        "abstract",
        "moral",
        "commitment",
        "expressed",
        "constitution",
        "tend",
        "widely",
        "universally",
        "shared",
        "among",
        "member",
        "relevant",
        "political",
        "community",
        "sense",
        "constitution",
        "despite",
        "moral",
        "commitment",
        "embodies",
        "neutral",
        "citizen",
        "many",
        "partisan",
        "difference",
        "opinion",
        "particular",
        "moral",
        "question",
        "everyone",
        "modern",
        "constitutional",
        "democracy",
        "like",
        "u",
        "germany",
        "agrees",
        "extent",
        "right",
        "free",
        "expression",
        "demand",
        "liberty",
        "express",
        "opinion",
        "display",
        "promote",
        "hatred",
        "toward",
        "identifiable",
        "religious",
        "racial",
        "group",
        "virtually",
        "one",
        "would",
        "deny",
        "vital",
        "importance",
        "expressive",
        "freedom",
        "truly",
        "free",
        "democratic",
        "society",
        "fixed",
        "view",
        "constitution",
        "seen",
        "analogous",
        "ground",
        "rule",
        "debating",
        "society",
        "set",
        "mutually",
        "agreed",
        "stable",
        "framework",
        "within",
        "controversial",
        "debate",
        "action",
        "take",
        "place",
        "debating",
        "society",
        "could",
        "function",
        "ground",
        "rule",
        "could",
        "revised",
        "debater",
        "order",
        "win",
        "debate",
        "constitution",
        "could",
        "serve",
        "role",
        "term",
        "constantly",
        "open",
        "debate",
        "revision",
        "participant",
        "within",
        "political",
        "legal",
        "process",
        "aspires",
        "govern",
        "order",
        "achieve",
        "desired",
        "result",
        "avoid",
        "possibility",
        "according",
        "espouse",
        "fixed",
        "view",
        "extent",
        "able",
        "replace",
        "controversial",
        "moral",
        "political",
        "question",
        "historical",
        "question",
        "intention",
        "constitutional",
        "author",
        "creating",
        "term",
        "chose",
        "express",
        "constitutional",
        "requirement",
        "publicly",
        "understood",
        "time",
        "chosen",
        "sum",
        "desire",
        "stability",
        "neutrality",
        "lead",
        "modern",
        "proponent",
        "fixed",
        "view",
        "view",
        "constitutional",
        "interpretation",
        "exercise",
        "undertaken",
        "properly",
        "focus",
        "author",
        "intention",
        "original",
        "understanding",
        "meaning",
        "import",
        "word",
        "chosen",
        "express",
        "agreed",
        "limit",
        "government",
        "power",
        "authority",
        "endorse",
        "fixed",
        "view",
        "generally",
        "espouse",
        "come",
        "known",
        "originalism",
        "interpreter",
        "restrict",
        "original",
        "intention",
        "andor",
        "understanding",
        "attempt",
        "insert",
        "contentious",
        "view",
        "guise",
        "interpretation",
        "role",
        "constitution",
        "secured",
        "originalists",
        "maintain",
        "serve",
        "politically",
        "neutral",
        "stable",
        "framework",
        "nature",
        "demand",
        "constitutional",
        "theorist",
        "believe",
        "foundational",
        "role",
        "constitution",
        "demand",
        "meaning",
        "interpretation",
        "somehow",
        "fixed",
        "interpretation",
        "absolutely",
        "immune",
        "consideration",
        "moral",
        "political",
        "theory",
        "debate",
        "contrary",
        "many",
        "constitutional",
        "scholar",
        "judge",
        "embrace",
        "living",
        "constitutionalism",
        "approach",
        "see",
        "constitution",
        "evolving",
        "living",
        "entity",
        "nature",
        "capable",
        "responding",
        "changing",
        "social",
        "circumstance",
        "new",
        "hoped",
        "better",
        "moral",
        "political",
        "belief",
        "along",
        "different",
        "view",
        "constitution",
        "come",
        "different",
        "theory",
        "regarding",
        "nature",
        "limit",
        "legitimate",
        "constitutional",
        "interpretation",
        "one",
        "strand",
        "within",
        "living",
        "constitutionalism",
        "upon",
        "focus",
        "stress",
        "extent",
        "constitutional",
        "interpretation",
        "resembles",
        "kind",
        "reasoning",
        "take",
        "place",
        "area",
        "law",
        "pertaining",
        "common",
        "law",
        "legal",
        "system",
        "law",
        "contract",
        "tort",
        "law",
        "contributory",
        "negligence",
        "emerged",
        "continuously",
        "evolves",
        "common",
        "law",
        "country",
        "casebycase",
        "incremental",
        "manner",
        "many",
        "decade",
        "product",
        "many",
        "judicial",
        "decision",
        "law",
        "equal",
        "protection",
        "free",
        "expression",
        "due",
        "process",
        "like",
        "continuously",
        "evolves",
        "modern",
        "western",
        "democracy",
        "constitutional",
        "case",
        "heard",
        "decided",
        "dispute",
        "fixedview",
        "originalists",
        "living",
        "constitutionalist",
        "among",
        "liveliest",
        "contentious",
        "arisen",
        "constitutional",
        "scholarship",
        "past",
        "several",
        "decade",
        "debate",
        "tended",
        "focus",
        "abstract",
        "civil",
        "right",
        "provision",
        "constitution",
        "due",
        "process",
        "clause",
        "american",
        "constitution",
        "section",
        "canadian",
        "charter",
        "right",
        "freedom",
        "guarantee",
        "right",
        "life",
        "liberty",
        "security",
        "person",
        "right",
        "deprived",
        "thereof",
        "except",
        "accordance",
        "principle",
        "fundamental",
        "justice",
        "given",
        "fixed",
        "view",
        "committed",
        "contemporary",
        "originalists",
        "view",
        "anything",
        "attempt",
        "discover",
        "preserve",
        "apply",
        "original",
        "understanding",
        "intention",
        "behind",
        "provision",
        "constitutional",
        "revision",
        "construction",
        "often",
        "masquerading",
        "interpretation",
        "unchanged",
        "original",
        "side",
        "find",
        "living",
        "constitutionalist",
        "tend",
        "view",
        "originalism",
        "reactionary",
        "overly",
        "conservative",
        "theory",
        "serving",
        "tie",
        "democratic",
        "community",
        "dead",
        "hand",
        "past",
        "originalists",
        "opponent",
        "claim",
        "render",
        "u",
        "incapable",
        "responding",
        "rationally",
        "responsibly",
        "changing",
        "social",
        "circumstance",
        "improved",
        "moral",
        "view",
        "concerning",
        "requirement",
        "abstract",
        "value",
        "principle",
        "articulated",
        "endorsed",
        "modern",
        "constitution",
        "living",
        "constitutionalist",
        "originalist",
        "counter",
        "recommend",
        "constitutional",
        "practice",
        "threaten",
        "number",
        "cherished",
        "value",
        "among",
        "rule",
        "law",
        "separation",
        "power",
        "effect",
        "happy",
        "place",
        "constitution",
        "hand",
        "contemporary",
        "judge",
        "permitted",
        "guise",
        "interpreting",
        "change",
        "constitution",
        "suit",
        "political",
        "inclination",
        "moral",
        "preference",
        "originalists",
        "claim",
        "serf",
        "thwart",
        "cherished",
        "value",
        "secured",
        "stable",
        "politically",
        "neutral",
        "constitution",
        "may",
        "render",
        "talk",
        "genuine",
        "constitutional",
        "constraint",
        "meaningless"
    ]
}