{
    "main_text": "What is Biodiversity? || Biodiversity as Multidimensional\n1.1 Biodiversity as Multidimensional\n\nOne attempt to provide a principled and practical way to characterize\nbiodiversity comes from Maclaurin & Sterelny (2008). James\nMaclaurin and Kim Sterelny start with the suggestion that we find the\nrelevant “natural” units and then provide means for\nmeasuring variation with regard to those units. By\n‘natural’ units, they mean ones that identify properties\nthat are recognizable and are causally salient (Maclaurin &\nSterelny 2008: 10). As discussions of phenetic taxonomy have shown,\nmeasures of “overall similarity” are fraught with\nsubjectivity. This subjectivity depends on a choice of distance metric\nand on how one articulates character traits (Ereshefsky 2000:\n60–66). Contemporary taxonomists group taxa according to\npatterns of evolutionary descent, which is a method called\n“cladistics”, precisely to avoid such subjectivity given\nthat the evolutionary history of life is natural in the above sense\n(Baum & Smith 2013).\n\nMaclaurin and Sterelny contend that the fundamental unit of\nbiodiversity is species and specifically species richness.\nNotoriously, biologists and philosophers have debated the nature of\nspecies. However, Maclaurin and Sterelny defend an evolutionary\nconcept of species which states that “Evolutionary species are\nlineages of organisms with their ‘own evolutionary tendencies\nand historical fate’” (Maclaurin & Sterelny 2008: 33;\nsee Wiley 1978). They suggest that this is the more natural approach\nto species because,\n\n\nThe living world is organized into phenomenological species:\nrecognizable, reidentifiable clusters of organisms. This fact makes\nthe production of bird and butterfly field guides, identification keys\nfor invertebrates, regional floras, and the like, all\npossible…. There are many routes through which one population\ncan become demographically isolated from, and hence evolutionarily\nindependent of, populations that were once sources and sinks of its\nown genes. But the fact of isolation and evolutionary independence is\nof immense importance to the fate of local adaptation in such\npopulations. So the phenomenological species richness of a region is,\nin an importance sense, a catalogue both of phenotypic variety and of\nthe potential evolutionary resources available in that region.\n(Maclaurin & Sterelny 2008: 40)\n\n\nThat is, though a variety of evolutionary processes lead to the\nformation and cohesion of organisms into species, there nevertheless\nis a uniformity of pattern in the natural world.\n\nSpecies richness with regard to a given community, a group of\ninteracting species in a given place, is the number of species\npresent. We might also add species evenness to species richness\n(Magurran 1988, 2004). With respect to a given community, there will\nbe some number of species. However, suppose we have two species in\nwhich the first has 300 members but the second has 700. Suppose again\nwe have two species where the first has 500 members and the second 500\nas well. The second community of species is far more\n“even” than the first. One formal representation of\nevenness is as follows (Magurran 1988). We start with the\nShannon-Weiner diversity index. \n\n\\[\nH' = -\\sum_{i=1}^{S} p_i \\ln p_i\n\\]\n\n\nHere \\(p_i\\) is the proportion of organisms belonging to the \\(i\\)th\nspecies and \\(S\\) is the total number of species. If we define the\nfollowing, \n\n\\[\nH_\\text{max}' = - \\sum_{i=1}^{S}\\frac{1}{S} \\ln \\frac{1}{S} = \\ln S\n\\]\n\n\nWe now have a measure of species evenness, \n\n\\[\nJ' = \\frac{H'}{H_\\text{max}'}\n\\]\n\n\n\\(J'\\) takes a value between 0 and 1 and the closer to the value of 1,\nthe less variation between the number of individuals in a species.\n\nThe second way in which we might augment species richness is through\ndisparity, morphological diversity, or more simply, phenotypic\nvariation (Maclaurin & Sterelny 2008: Ch. 3, 4; see Gould 1989 for\na discussion of disparity in the history of life). Disparity,\nmorphological diversity, or phenotypic vacation in general, concern\nthe variation in phenotypic traits exhibited in and between species.\nSuppose we have one suite of species that are very similar\nphenotypically; however, we might have another suite of species that\nvary a great deal phenotypically. A measure of such variation would\nweight species richness with some parameter(s) representing the\nvariation in phenotypic traits. Unfortunately, if we include such\nphenotypic variation per se we find ourselves exactly with\nthe problems that dogged phenetic taxonomy and the attempt to capture\nsome notion of overall similarity. Additionally, if we focus on\ndisparity per se as opposed to mere phenotypic variation, we\nmust try to capture some notion of basic “body plan”\n(Arthur 2000).\n\nMaclaurin and Sternly suggest that one way to operationalize such\nvariation is through the notion of a morphospace (Maclaurin\n& Sterelny 2008: Section 4.4). Suppose we have a \\(n\\)-dimensional\nhyperspace where each dimension \\(i\\) is a variable concerning the\n\\(i\\)th phenotype. Thus, a point in the space represents a specific\norganism and their phenotype trait. Associated with any given species\nwould be a hypervolume representing the phenotypic variation of that\nspecies. Though there are not many worked out hyperspaces of this\nsort, a famous one is paleontologist David Raup’s analysis of\nthe coiling patterns in mollusks that includes variables for whorl\nexpansion rate, uncoiling rate, translation of the generating curve,\nand shape of the growing edge (Raup 1966).\n\n\n\nFigure 1: Raup’s coiling patterns\nin mollusks morphospace (Raup 1966)\n\n\nThe morphospace describes actual coiling patterns and merely possible\nones, and raises explananda for evolutionary biologists. Why\ndid certain coiling patterns evolve and not others? Maclaurin and\nSterelny claim morphospaces will be of low dimensionality and\nspecifically limited to lineages or clades (Maclaurin & Sterelny\n2008: 75–9). Thus, biologists must be assured that the variables\nincluded are representative of the phenotypic traits of the organisms\nand hence species under study. They hypothesize that the variables\nwill correspond to developmental modules or mosaics, which are a\nrelatively independent developmental system that contributes to\nfitness (G. P. Wagner 2014; P. J. Wagner 1995). This approach of\ncourse assumes that there exist independent developmental systems, and\nideally it would help articulate how a lineage would fare over time as\na function of its plasticity.\n\nAnother component of biodiversity according to Maclaurin and Sterelny\nconcerns the ecological interactions between species (Morin 2011).\nThis additional structure is given by interspecific competition,\npredator-prey relations, and mutualism along with possible\nhigher-order ones like trophic cascades. In the absence of such\ninteractions, a group of species is nothing more than the “sum\nof the parts” (Clements 1916; Eliot 2011; Gleason 1926;\nOdenbaugh 2007; R.H. Whittaker 1967). In the presence of such\ninteractions, they hypothesize the existence of emergent properties\nthat are not a “simple reflection” of the species\nthemselves (Maclaurin & Sterelny 2008: 120). Additionally, even if\nthere were no such emergent properties, we would like to know what\ntheir causal contribution is: how to do they drive community patterns?\nInfamously, some ecologists have hypothesized that as the diversity of\na community increases, so does the stability of the community (Egerton\n1973; Elton 2000; MacArthur 1955; May 1973/2001; Tilman, Wedin, &\nKnops 1996). ‘Diversity’ can be understood as the number\nof species present, the number of interactions, or intensity of those\ninteractions. ‘Stability’ can be understood in a variety\nof ways from notions of Lyapunov stability, return time after a\nperturbation, biomass stability, etc. (Justus 2008; Pimm 1984).\nEcologists have theorized, experimented, and collected a great deal of\ndata regarding this hypothesis, but its truth remains elusive.\nMaclaurin and Sterelny suggest we can articulate an ecospace including\nat least the boundedness, degree of emergent properties, and internal\nregulation as variables to describe ecological communities (Maclaurin\n& Sterelny 2008: Ch. 6). One serious worry is whether any of these\nfeatures can be measured in an informative way. But, insofar as there\nare no community boundaries, no emergent properties, and no internal\nregulation, there are no communities. The robustness of communities\nwould require each of these take non-zero values. Additionally, these\nvariables are not independent and hence the ecospace would have to\ntake account of the interactions between each variable. For example,\ninternal regulation might be a function of the emergent properties\npossessed by the community, and the boundaries of a given community\ndetermined by those very properties (Sterelny 2006).\n\nFinally, we can consider how to include phylogenetic information in\nour measure of biodiversity. One method comes from Daniel Faith (1992,\n1994, 2002). In cladistics, we use character traits to divide\norganisms into groups. We begin with the traits shared by all of the\norganisms and then articulate smaller groups by traits unique to them\nwhere each then is a clade. A cladogram then displays the distinct\ncharacter traits of each group. Cladograms differ from phylogenetic\ntrees insofar as the latter includes ancestor-descendant relations\napart from merely relations of nested similarity. For any phylogenetic\ntree, there are many cladograms consistent with it. Faith writes,\n\n\nThe phylogenetic diversity (’PD’) of \\(s\\) is equal to the\nsum of the lengths of all those branches that are members of the\ncorresponding minimum spanning path. (Faith 1992: 4)\n\n\nConsider the following cladogram.\n\n\n\nFigure 2: The phylogenetic diversity\nrepresented in a cladogram (Faith 1992: 3)\n\n\nIn Figure 2, we have taxa 2, 6, 8, 10. The minimum spanning path\nconnecting each requires 28 character changes and thus its PD is 28.\nAs Maclaurin and Sterelny note, this assumes that we have an adequate\nsample of character traits and given that many are molecular they do\nnot tell us much about phenotypes (Maclaurin & Sterelny 2008:\n141). Thus, they suggest we stick with local morphospaces.\n\nMaclaurin and Sterelny’s approach is very suggestive but as we\nhave seen its execution by biologists requires making good on using\nspecies richness augmented with information regarding phenotypic\nvariation, ecology, development, and phylogeny into an empirical\ntractable hyperspace. The extent to which this can be done is unclear\n(Justus 2010; Morgan 2009). Their approach also presupposes a\nparticular account of species as well.\n",
    "section_title": "1.1 Biodiversity as Multidimensional",
    "entry_title": "Conservation Biology",
    "hierarchy_title": "Conservation Biology || What is Biodiversity? || Biodiversity as Multidimensional",
    "tokenized_text": [
        "biodiversity",
        "biodiversity",
        "multidimensional",
        "biodiversity",
        "multidimensional",
        "one",
        "attempt",
        "provide",
        "principled",
        "practical",
        "way",
        "characterize",
        "biodiversity",
        "come",
        "maclaurin",
        "sterelny",
        "james",
        "maclaurin",
        "kim",
        "sterelny",
        "start",
        "suggestion",
        "find",
        "relevant",
        "natural",
        "unit",
        "provide",
        "mean",
        "measuring",
        "variation",
        "regard",
        "unit",
        "natural",
        "unit",
        "mean",
        "one",
        "identify",
        "property",
        "recognizable",
        "causally",
        "salient",
        "maclaurin",
        "sterelny",
        "discussion",
        "phenetic",
        "taxonomy",
        "shown",
        "measure",
        "overall",
        "similarity",
        "fraught",
        "subjectivity",
        "subjectivity",
        "depends",
        "choice",
        "distance",
        "metric",
        "one",
        "articulates",
        "character",
        "trait",
        "ereshefsky",
        "contemporary",
        "taxonomist",
        "group",
        "taxon",
        "according",
        "pattern",
        "evolutionary",
        "descent",
        "method",
        "called",
        "cladistics",
        "precisely",
        "avoid",
        "subjectivity",
        "given",
        "evolutionary",
        "history",
        "life",
        "natural",
        "sense",
        "baum",
        "smith",
        "maclaurin",
        "sterelny",
        "contend",
        "fundamental",
        "unit",
        "biodiversity",
        "specie",
        "specifically",
        "specie",
        "richness",
        "notoriously",
        "biologist",
        "philosopher",
        "debated",
        "nature",
        "specie",
        "however",
        "maclaurin",
        "sterelny",
        "defend",
        "evolutionary",
        "concept",
        "specie",
        "state",
        "evolutionary",
        "specie",
        "lineage",
        "organism",
        "evolutionary",
        "tendency",
        "historical",
        "fate",
        "maclaurin",
        "sterelny",
        "see",
        "wiley",
        "suggest",
        "natural",
        "approach",
        "specie",
        "living",
        "world",
        "organized",
        "phenomenological",
        "specie",
        "recognizable",
        "reidentifiable",
        "cluster",
        "organism",
        "fact",
        "make",
        "production",
        "bird",
        "butterfly",
        "field",
        "guide",
        "identification",
        "key",
        "invertebrate",
        "regional",
        "flora",
        "like",
        "possible",
        "many",
        "route",
        "one",
        "population",
        "become",
        "demographically",
        "isolated",
        "hence",
        "evolutionarily",
        "independent",
        "population",
        "source",
        "sink",
        "gene",
        "fact",
        "isolation",
        "evolutionary",
        "independence",
        "immense",
        "importance",
        "fate",
        "local",
        "adaptation",
        "population",
        "phenomenological",
        "specie",
        "richness",
        "region",
        "importance",
        "sense",
        "catalogue",
        "phenotypic",
        "variety",
        "potential",
        "evolutionary",
        "resource",
        "available",
        "region",
        "maclaurin",
        "sterelny",
        "though",
        "variety",
        "evolutionary",
        "process",
        "lead",
        "formation",
        "cohesion",
        "organism",
        "specie",
        "nevertheless",
        "uniformity",
        "pattern",
        "natural",
        "world",
        "specie",
        "richness",
        "regard",
        "given",
        "community",
        "group",
        "interacting",
        "specie",
        "given",
        "place",
        "number",
        "specie",
        "present",
        "might",
        "also",
        "add",
        "specie",
        "evenness",
        "specie",
        "richness",
        "magurran",
        "respect",
        "given",
        "community",
        "number",
        "specie",
        "however",
        "suppose",
        "two",
        "specie",
        "first",
        "member",
        "second",
        "suppose",
        "two",
        "specie",
        "first",
        "member",
        "second",
        "well",
        "second",
        "community",
        "specie",
        "far",
        "even",
        "first",
        "one",
        "formal",
        "representation",
        "evenness",
        "follows",
        "magurran",
        "start",
        "shannonweiner",
        "diversity",
        "index",
        "h",
        "sum_",
        "i",
        "p_i",
        "ln",
        "p_i",
        "p_i",
        "proportion",
        "organism",
        "belonging",
        "i",
        "th",
        "specie",
        "s",
        "total",
        "number",
        "specie",
        "define",
        "following",
        "h_text",
        "max",
        "sum_",
        "i",
        "frac",
        "ln",
        "frac",
        "ln",
        "measure",
        "specie",
        "evenness",
        "j",
        "frac",
        "h",
        "h_text",
        "max",
        "j",
        "take",
        "value",
        "closer",
        "value",
        "le",
        "variation",
        "number",
        "individual",
        "specie",
        "second",
        "way",
        "might",
        "augment",
        "specie",
        "richness",
        "disparity",
        "morphological",
        "diversity",
        "simply",
        "phenotypic",
        "variation",
        "maclaurin",
        "sterelny",
        "ch",
        "see",
        "gould",
        "discussion",
        "disparity",
        "history",
        "life",
        "disparity",
        "morphological",
        "diversity",
        "phenotypic",
        "vacation",
        "general",
        "concern",
        "variation",
        "phenotypic",
        "trait",
        "exhibited",
        "specie",
        "suppose",
        "one",
        "suite",
        "specie",
        "similar",
        "phenotypically",
        "however",
        "might",
        "another",
        "suite",
        "specie",
        "vary",
        "great",
        "deal",
        "phenotypically",
        "measure",
        "variation",
        "would",
        "weight",
        "specie",
        "richness",
        "parameter",
        "representing",
        "variation",
        "phenotypic",
        "trait",
        "unfortunately",
        "include",
        "phenotypic",
        "variation",
        "per",
        "se",
        "find",
        "exactly",
        "problem",
        "dogged",
        "phenetic",
        "taxonomy",
        "attempt",
        "capture",
        "notion",
        "overall",
        "similarity",
        "additionally",
        "focus",
        "disparity",
        "per",
        "se",
        "opposed",
        "mere",
        "phenotypic",
        "variation",
        "must",
        "try",
        "capture",
        "notion",
        "basic",
        "body",
        "plan",
        "arthur",
        "maclaurin",
        "sternly",
        "suggest",
        "one",
        "way",
        "operationalize",
        "variation",
        "notion",
        "morphospace",
        "maclaurin",
        "sterelny",
        "section",
        "suppose",
        "n",
        "dimensional",
        "hyperspace",
        "dimension",
        "i",
        "variable",
        "concerning",
        "i",
        "th",
        "phenotype",
        "thus",
        "point",
        "space",
        "represents",
        "specific",
        "organism",
        "phenotype",
        "trait",
        "associated",
        "given",
        "specie",
        "would",
        "hypervolume",
        "representing",
        "phenotypic",
        "variation",
        "specie",
        "though",
        "many",
        "worked",
        "hyperspaces",
        "sort",
        "famous",
        "one",
        "paleontologist",
        "david",
        "raup",
        "analysis",
        "coiling",
        "pattern",
        "mollusk",
        "includes",
        "variable",
        "whorl",
        "expansion",
        "rate",
        "uncoiling",
        "rate",
        "translation",
        "generating",
        "curve",
        "shape",
        "growing",
        "edge",
        "raup",
        "figure",
        "raup",
        "coiling",
        "pattern",
        "mollusk",
        "morphospace",
        "raup",
        "morphospace",
        "describes",
        "actual",
        "coiling",
        "pattern",
        "merely",
        "possible",
        "one",
        "raise",
        "explananda",
        "evolutionary",
        "biologist",
        "certain",
        "coiling",
        "pattern",
        "evolve",
        "others",
        "maclaurin",
        "sterelny",
        "claim",
        "morphospaces",
        "low",
        "dimensionality",
        "specifically",
        "limited",
        "lineage",
        "clade",
        "maclaurin",
        "sterelny",
        "thus",
        "biologist",
        "must",
        "assured",
        "variable",
        "included",
        "representative",
        "phenotypic",
        "trait",
        "organism",
        "hence",
        "specie",
        "study",
        "hypothesize",
        "variable",
        "correspond",
        "developmental",
        "module",
        "mosaic",
        "relatively",
        "independent",
        "developmental",
        "system",
        "contributes",
        "fitness",
        "g",
        "p",
        "wagner",
        "p",
        "j",
        "wagner",
        "approach",
        "course",
        "assumes",
        "exist",
        "independent",
        "developmental",
        "system",
        "ideally",
        "would",
        "help",
        "articulate",
        "lineage",
        "would",
        "fare",
        "time",
        "function",
        "plasticity",
        "another",
        "component",
        "biodiversity",
        "according",
        "maclaurin",
        "sterelny",
        "concern",
        "ecological",
        "interaction",
        "specie",
        "morin",
        "additional",
        "structure",
        "given",
        "interspecific",
        "competition",
        "predatorprey",
        "relation",
        "mutualism",
        "along",
        "possible",
        "higherorder",
        "one",
        "like",
        "trophic",
        "cascade",
        "absence",
        "interaction",
        "group",
        "specie",
        "nothing",
        "sum",
        "part",
        "clements",
        "eliot",
        "gleason",
        "odenbaugh",
        "rh",
        "whittaker",
        "presence",
        "interaction",
        "hypothesize",
        "existence",
        "emergent",
        "property",
        "simple",
        "reflection",
        "specie",
        "maclaurin",
        "sterelny",
        "additionally",
        "even",
        "emergent",
        "property",
        "would",
        "like",
        "know",
        "causal",
        "contribution",
        "drive",
        "community",
        "pattern",
        "infamously",
        "ecologist",
        "hypothesized",
        "diversity",
        "community",
        "increase",
        "stability",
        "community",
        "egerton",
        "elton",
        "macarthur",
        "may",
        "tilman",
        "wedin",
        "knops",
        "diversity",
        "understood",
        "number",
        "specie",
        "present",
        "number",
        "interaction",
        "intensity",
        "interaction",
        "stability",
        "understood",
        "variety",
        "way",
        "notion",
        "lyapunov",
        "stability",
        "return",
        "time",
        "perturbation",
        "biomass",
        "stability",
        "etc",
        "justus",
        "pimm",
        "ecologist",
        "theorized",
        "experimented",
        "collected",
        "great",
        "deal",
        "data",
        "regarding",
        "hypothesis",
        "truth",
        "remains",
        "elusive",
        "maclaurin",
        "sterelny",
        "suggest",
        "articulate",
        "ecospace",
        "including",
        "least",
        "boundedness",
        "degree",
        "emergent",
        "property",
        "internal",
        "regulation",
        "variable",
        "describe",
        "ecological",
        "community",
        "maclaurin",
        "sterelny",
        "ch",
        "one",
        "serious",
        "worry",
        "whether",
        "feature",
        "measured",
        "informative",
        "way",
        "insofar",
        "community",
        "boundary",
        "emergent",
        "property",
        "internal",
        "regulation",
        "community",
        "robustness",
        "community",
        "would",
        "require",
        "take",
        "nonzero",
        "value",
        "additionally",
        "variable",
        "independent",
        "hence",
        "ecospace",
        "would",
        "take",
        "account",
        "interaction",
        "variable",
        "example",
        "internal",
        "regulation",
        "might",
        "function",
        "emergent",
        "property",
        "possessed",
        "community",
        "boundary",
        "given",
        "community",
        "determined",
        "property",
        "sterelny",
        "finally",
        "consider",
        "include",
        "phylogenetic",
        "information",
        "measure",
        "biodiversity",
        "one",
        "method",
        "come",
        "daniel",
        "faith",
        "cladistics",
        "use",
        "character",
        "trait",
        "divide",
        "organism",
        "group",
        "begin",
        "trait",
        "shared",
        "organism",
        "articulate",
        "smaller",
        "group",
        "trait",
        "unique",
        "clade",
        "cladogram",
        "display",
        "distinct",
        "character",
        "trait",
        "group",
        "cladogram",
        "differ",
        "phylogenetic",
        "tree",
        "insofar",
        "latter",
        "includes",
        "ancestordescendant",
        "relation",
        "apart",
        "merely",
        "relation",
        "nested",
        "similarity",
        "phylogenetic",
        "tree",
        "many",
        "cladogram",
        "consistent",
        "faith",
        "writes",
        "phylogenetic",
        "diversity",
        "pd",
        "s",
        "equal",
        "sum",
        "length",
        "branch",
        "member",
        "corresponding",
        "minimum",
        "spanning",
        "path",
        "faith",
        "consider",
        "following",
        "cladogram",
        "figure",
        "phylogenetic",
        "diversity",
        "represented",
        "cladogram",
        "faith",
        "figure",
        "taxon",
        "minimum",
        "spanning",
        "path",
        "connecting",
        "requires",
        "character",
        "change",
        "thus",
        "pd",
        "maclaurin",
        "sterelny",
        "note",
        "assumes",
        "adequate",
        "sample",
        "character",
        "trait",
        "given",
        "many",
        "molecular",
        "tell",
        "u",
        "much",
        "phenotype",
        "maclaurin",
        "sterelny",
        "thus",
        "suggest",
        "stick",
        "local",
        "morphospaces",
        "maclaurin",
        "sterelny",
        "approach",
        "suggestive",
        "seen",
        "execution",
        "biologist",
        "requires",
        "making",
        "good",
        "using",
        "specie",
        "richness",
        "augmented",
        "information",
        "regarding",
        "phenotypic",
        "variation",
        "ecology",
        "development",
        "phylogeny",
        "empirical",
        "tractable",
        "hyperspace",
        "extent",
        "done",
        "unclear",
        "justus",
        "morgan",
        "approach",
        "also",
        "presupposes",
        "particular",
        "account",
        "specie",
        "well"
    ]
}