{
    "main_text": "What Are the Aims of Conservation Biology? || “New Conservationism”\n3.2 “New Conservationism”\n\nRecently, Soulé’s vision has been called into question by\nthe “new conservationists”. Peter Kareiva and Michelle\nMarvier have argued for a different foundation for conservation\nbiology or what they call “conservation science” (Kareiva\n& Marvier 2012). They argue that the science needs a new normative\ndirection for a variety of reasons. First, conservation biology has\ntraditionally focused on conserving natural systems for the intrinsic\nvalue of these systems. However, they contend ecological systems can\nonly be successfully managed by embracing the instrumental values\nprovided to humans by these systems. Traditional conservation biology\nthey allege has been at the expense of third world stakeholders and\ncontrary to the interests of women. Second, we live on a planet that\nhas been deeply influenced by humans; so much so that many suggest we\nlive in a new geological epoch, the Anthropocene. Human population\nstands at approximately 7 billion and our energy consumption has only\nincreased over time. Humans have deforested, urbanized, polluted,\nextirpated, and overharvested to such a degree that there is no\n“pristine” nature available. “Fortress\nconservation” is an out-of-date model of what we should and can\ndo. Moreover, environmental attitudes have changed over time—we\nvalue environmental goods and services less and less in the United\nStates. Thus, we must focus on what people care about and focus on\nmotivating them through these valuations. Third, ecological systems\nare not as fragile as traditional ecology suggests. Rather, they are\nremarkably resilient. Marine systems overcome oil spills, deforested\nareas rebound, bird species dwindle but are rarely eliminated whole\ncloth, and coral reefs can even come back from a hydrogen bomb.\nFourth, we can avoid the tragedy of the commons, which has been a\nmajor theoretical structure for interpreting environmental\ndecision-making. Following the work of Elinor Ostrom, local buy-in can\neliminate the self-interested behavior that leads to such zero-sum\nbehavior (Ostrom 1990). To move forward, they recommend that we\nrecognize conservation can only occur within human-affected\nlandscapes; that we work with corporations and not merely oppose them;\nand that we avoid threatening the human rights of the\ndisenfranchised.\n\nAs one would expect, the new conservationists have been forcefully\nchallenged. For example, David Doak, Victoria Bakker, Bruce Goldstein,\nand Ben Hale have challenged their claims across the board (Doak et\nal. 2014). First, they contend that Kareiva and Marvier focus on human\nwell-being in the most narrow economic terms. Moreover, conservation\nhas never been solely for the “more-than-human world” but\nhas a rich tradition of managing for human interests as well. Second,\nthere are many relatively undisturbed ecological systems that exist,\nand others have suffered irreversible effects by humans (e.g.,\nanthropogenic global climate change). Third, they suggest that a\nnarrowly anthropocentric approach to conservation has little by way of\nevidence of success. And, traditional approaches have much that\ntestifies in their favor. Additionally, though some conservation\nprojects have displaced indigenous peoples, conservation organizations\nhave been working hard over the last few decades to try to avoid these\nenvironmental injustices. Fourth, they contest the social science that\nclaims environmental attitudes have fundamentally changed and notes\nthat actors are rarely self-motivated and apathetic in the ways the\nnew conservationists suggest. Finally, if one were solely committed to\nhuman well-being with little regard to the moral standing of\necological systems, then we should be investing not in the Nature\nConservancy but Save the Children, Oxfam, and Water for the\nPeople.\n\nConsider a concrete debate between traditional conservation biologists\nand the “new conservationists.” Recently, some\nconservation biologists have argued that we should make half of the\nEarth’s surface into interconnected protected areas, which they\nclaim would conserve about 85% of our remaining biodiversity (Noss\net. al. 2012; Wuerthener et. al. 2015; Wilson 2016). Currently, only\nabout 15% of the Earth’s terrestrial areas and about 3% of its\noceans are protected. If we consider a variety of studies as to what\npercentage of terrestrial regions should be protected to conserve\nbiodiversity, the median percentage is slightly below 50% (Noss et\nal. 2012, 2). The “Half-Earth” plan offers three claims:\n(a) habitat loss and degradation are crucially important causes of\nbiodiversity loss, (b) current protected areas are insufficient for\npreventing further loss of biodiversity, and (c) it is morally wrong\nfor our species to cause species’ extinction (Wilson\n2016). Critics argue that “Half-Earth” has several flaws\nBüscher et. al. 2017). First, it ignores the most\nserious problems threatening biodiversity – resource extraction and\nconsumption. Second, if authorities created strict protected areas\n(IUCN Category I or II), then it would have considerable negative\neffects on indigenous people and communities. Third, it is likely that\ncontrol over these reserves will not be given to the indigenous people\nand communities effected, which will only exacerbate their poverty and\nvulnerability. Fourth, when local people are stakeholders in\nconservation programs, both biological conservation and socioeconomic\noutcomes are benefited. Fifth, “Half-Earth” offers no plan\nfor biodiversity conservation for the other half. They suggest that we\nfocus on the main drivers of biodiversity, which requires rethinking\nfree markets and economic valuation and moving towards regulation,\nredistribution, and viewing natural resources and ecosystems as global\npublic goods. Additionally, they suggest our conservation plans should\nexplicitly address economic inequality (Mikkelson et. al. 2007;\nHolland et al. 2009; Hicks et al., 2016). It is both harmful for\nhumans and leads to biodiversity loss itself. In favor of Half-Earth,\nits defenders have argued in return that though Half-Earth is\nnecessary but insufficient for conserving all of\nEarth’s biodiversity. They also agree that we should reject\nneoliberal economics. However, we should not prioritize equality for\nhumans over non-human species’ equality; “This will\nrequire setting aside sufficient habitat for other species while\nliving justly and prudently on the remainder” (Cafaro\net. al. 2017, 400). The Half-Earth proposal is very controversial, but\nit is also emblematic of the debates within conservation biology.\n\n\nRegardless, of how we view these contemporary debates, it is clear\nthat there are constitutive and contextual values present in\nconservation biology and any successor discipline moving forward.\nThese include the relatively uncontroversial ones regarding inductive\nrisk and SCB’s Code of Ethics, to those regarding the intrinsic\nvalue of organisms, species, and ecosystems. Furthermore, there are\nvery important questions regarding how these values, non-controversial\nand controversial, should be advocated in the public sphere. If the\nvalues are broadly shared by scientist and non-scientist alike, then\nit appears that advocacy is simply on the public’s behalf.\nHowever, as the values become specific to the scientists themselves,\ntheir advocacy can appear to be in tension with regard to their\nobjectivity as scientists (M.J. Brown 2013; Intemann 2005; Longino\n1990). They appear as “tree huggers” and\n“environmentalists” and less than impartial. Moreover, if\ntheir advocacy detracts from their role as scientists, they one might\nworry that this all things considered renders them impotent in\npolicymaking. They seem to be just another “talking head”\n(Odenbaugh 2003). Thus, conservation biologists must discern how to\nbalance the values at work in their discipline and the greater good to\nwhich they are committed.\n\nSome policy analysts argue that if scientific work is to impact\npolicy, it must be objective (Pielke 2007). However, advocating\npersonal contextual values is alleged to undercut that objectivity\n(Burke & Lauenroth (2009), but see Strong (2008)). If one claims\nthat biodiversity is intrinsically valuable, this value isn’t\nwidely shared, and it cannot be reasonably defended by its proponents,\nthen conservation biologists risk their work being ignored or\ndismissed. On the other hand, if one advocates the conservation of\nbiodiversity on the basis of ecosystem services including carbon\nsequestration, waste decomposition, purification of air and water,\npollination, etc., and loss of these services would negatively impact\nhumans, then this advocacy would be far less controversial (Brussard\n& Tull 2007). In addition, one might reconsider how we think about\nscience itself. We recognize that the enterprise is not\n“value-neutral”. Should we regard it as less than\nobjective because of its advocacy (Kincaid, Dupré, & Wylie\n2007)? How might we educate the public to think more carefully and\nclearly about the role of values in science?\n",
    "section_title": "3.2 “New Conservationism”",
    "entry_title": "Conservation Biology",
    "hierarchy_title": "Conservation Biology || What Are the Aims of Conservation Biology? || “New Conservationism”",
    "tokenized_text": [
        "aim",
        "conservation",
        "biology",
        "new",
        "conservationism",
        "new",
        "conservationism",
        "recently",
        "soulé",
        "vision",
        "called",
        "question",
        "new",
        "conservationist",
        "peter",
        "kareiva",
        "michelle",
        "marvier",
        "argued",
        "different",
        "foundation",
        "conservation",
        "biology",
        "call",
        "conservation",
        "science",
        "kareiva",
        "marvier",
        "argue",
        "science",
        "need",
        "new",
        "normative",
        "direction",
        "variety",
        "reason",
        "first",
        "conservation",
        "biology",
        "traditionally",
        "focused",
        "conserving",
        "natural",
        "system",
        "intrinsic",
        "value",
        "system",
        "however",
        "contend",
        "ecological",
        "system",
        "successfully",
        "managed",
        "embracing",
        "instrumental",
        "value",
        "provided",
        "human",
        "system",
        "traditional",
        "conservation",
        "biology",
        "allege",
        "expense",
        "third",
        "world",
        "stakeholder",
        "contrary",
        "interest",
        "woman",
        "second",
        "live",
        "planet",
        "deeply",
        "influenced",
        "human",
        "much",
        "many",
        "suggest",
        "live",
        "new",
        "geological",
        "epoch",
        "anthropocene",
        "human",
        "population",
        "stand",
        "approximately",
        "billion",
        "energy",
        "consumption",
        "increased",
        "time",
        "human",
        "deforested",
        "urbanized",
        "polluted",
        "extirpated",
        "overharvested",
        "degree",
        "pristine",
        "nature",
        "available",
        "fortress",
        "conservation",
        "outofdate",
        "model",
        "moreover",
        "environmental",
        "attitude",
        "changed",
        "timewe",
        "value",
        "environmental",
        "good",
        "service",
        "le",
        "le",
        "united",
        "state",
        "thus",
        "must",
        "focus",
        "people",
        "care",
        "focus",
        "motivating",
        "valuation",
        "third",
        "ecological",
        "system",
        "fragile",
        "traditional",
        "ecology",
        "suggests",
        "rather",
        "remarkably",
        "resilient",
        "marine",
        "system",
        "overcome",
        "oil",
        "spill",
        "deforested",
        "area",
        "rebound",
        "bird",
        "specie",
        "dwindle",
        "rarely",
        "eliminated",
        "whole",
        "cloth",
        "coral",
        "reef",
        "even",
        "come",
        "back",
        "hydrogen",
        "bomb",
        "fourth",
        "avoid",
        "tragedy",
        "common",
        "major",
        "theoretical",
        "structure",
        "interpreting",
        "environmental",
        "decisionmaking",
        "following",
        "work",
        "elinor",
        "ostrom",
        "local",
        "buyin",
        "eliminate",
        "selfinterested",
        "behavior",
        "lead",
        "zerosum",
        "behavior",
        "ostrom",
        "move",
        "forward",
        "recommend",
        "recognize",
        "conservation",
        "occur",
        "within",
        "humanaffected",
        "landscape",
        "work",
        "corporation",
        "merely",
        "oppose",
        "avoid",
        "threatening",
        "human",
        "right",
        "disenfranchised",
        "one",
        "would",
        "expect",
        "new",
        "conservationist",
        "forcefully",
        "challenged",
        "example",
        "david",
        "doak",
        "victoria",
        "bakker",
        "bruce",
        "goldstein",
        "ben",
        "hale",
        "challenged",
        "claim",
        "across",
        "board",
        "doak",
        "et",
        "al",
        "first",
        "contend",
        "kareiva",
        "marvier",
        "focus",
        "human",
        "wellbeing",
        "narrow",
        "economic",
        "term",
        "moreover",
        "conservation",
        "never",
        "solely",
        "morethanhuman",
        "world",
        "rich",
        "tradition",
        "managing",
        "human",
        "interest",
        "well",
        "second",
        "many",
        "relatively",
        "undisturbed",
        "ecological",
        "system",
        "exist",
        "others",
        "suffered",
        "irreversible",
        "effect",
        "human",
        "eg",
        "anthropogenic",
        "global",
        "climate",
        "change",
        "third",
        "suggest",
        "narrowly",
        "anthropocentric",
        "approach",
        "conservation",
        "little",
        "way",
        "evidence",
        "success",
        "traditional",
        "approach",
        "much",
        "testifies",
        "favor",
        "additionally",
        "though",
        "conservation",
        "project",
        "displaced",
        "indigenous",
        "people",
        "conservation",
        "organization",
        "working",
        "hard",
        "last",
        "decade",
        "try",
        "avoid",
        "environmental",
        "injustice",
        "fourth",
        "contest",
        "social",
        "science",
        "claim",
        "environmental",
        "attitude",
        "fundamentally",
        "changed",
        "note",
        "actor",
        "rarely",
        "selfmotivated",
        "apathetic",
        "way",
        "new",
        "conservationist",
        "suggest",
        "finally",
        "one",
        "solely",
        "committed",
        "human",
        "wellbeing",
        "little",
        "regard",
        "moral",
        "standing",
        "ecological",
        "system",
        "investing",
        "nature",
        "conservancy",
        "save",
        "child",
        "oxfam",
        "water",
        "people",
        "consider",
        "concrete",
        "debate",
        "traditional",
        "conservation",
        "biologist",
        "new",
        "conservationists",
        "recently",
        "conservation",
        "biologist",
        "argued",
        "make",
        "half",
        "earth",
        "surface",
        "interconnected",
        "protected",
        "area",
        "claim",
        "would",
        "conserve",
        "remaining",
        "biodiversity",
        "no",
        "et",
        "al",
        "wuerthener",
        "et",
        "al",
        "wilson",
        "currently",
        "earth",
        "terrestrial",
        "area",
        "ocean",
        "protected",
        "consider",
        "variety",
        "study",
        "percentage",
        "terrestrial",
        "region",
        "protected",
        "conserve",
        "biodiversity",
        "median",
        "percentage",
        "slightly",
        "no",
        "et",
        "al",
        "halfearth",
        "plan",
        "offer",
        "three",
        "claim",
        "habitat",
        "loss",
        "degradation",
        "crucially",
        "important",
        "cause",
        "biodiversity",
        "loss",
        "b",
        "current",
        "protected",
        "area",
        "insufficient",
        "preventing",
        "loss",
        "biodiversity",
        "c",
        "morally",
        "wrong",
        "specie",
        "cause",
        "specie",
        "extinction",
        "wilson",
        "critic",
        "argue",
        "halfearth",
        "several",
        "flaw",
        "büscher",
        "et",
        "al",
        "first",
        "ignores",
        "serious",
        "problem",
        "threatening",
        "biodiversity",
        "resource",
        "extraction",
        "consumption",
        "second",
        "authority",
        "created",
        "strict",
        "protected",
        "area",
        "iucn",
        "category",
        "ii",
        "would",
        "considerable",
        "negative",
        "effect",
        "indigenous",
        "people",
        "community",
        "third",
        "likely",
        "control",
        "reserve",
        "given",
        "indigenous",
        "people",
        "community",
        "effected",
        "exacerbate",
        "poverty",
        "vulnerability",
        "fourth",
        "local",
        "people",
        "stakeholder",
        "conservation",
        "program",
        "biological",
        "conservation",
        "socioeconomic",
        "outcome",
        "benefited",
        "fifth",
        "halfearth",
        "offer",
        "plan",
        "biodiversity",
        "conservation",
        "half",
        "suggest",
        "focus",
        "main",
        "driver",
        "biodiversity",
        "requires",
        "rethinking",
        "free",
        "market",
        "economic",
        "valuation",
        "moving",
        "towards",
        "regulation",
        "redistribution",
        "viewing",
        "natural",
        "resource",
        "ecosystem",
        "global",
        "public",
        "good",
        "additionally",
        "suggest",
        "conservation",
        "plan",
        "explicitly",
        "address",
        "economic",
        "inequality",
        "mikkelson",
        "et",
        "al",
        "holland",
        "et",
        "al",
        "hick",
        "et",
        "al",
        "harmful",
        "human",
        "lead",
        "biodiversity",
        "loss",
        "favor",
        "halfearth",
        "defender",
        "argued",
        "return",
        "though",
        "halfearth",
        "necessary",
        "insufficient",
        "conserving",
        "earth",
        "biodiversity",
        "also",
        "agree",
        "reject",
        "neoliberal",
        "economics",
        "however",
        "prioritize",
        "equality",
        "human",
        "nonhuman",
        "specie",
        "equality",
        "require",
        "setting",
        "aside",
        "sufficient",
        "habitat",
        "specie",
        "living",
        "justly",
        "prudently",
        "remainder",
        "cafaro",
        "et",
        "al",
        "halfearth",
        "proposal",
        "controversial",
        "also",
        "emblematic",
        "debate",
        "within",
        "conservation",
        "biology",
        "regardless",
        "view",
        "contemporary",
        "debate",
        "clear",
        "constitutive",
        "contextual",
        "value",
        "present",
        "conservation",
        "biology",
        "successor",
        "discipline",
        "moving",
        "forward",
        "include",
        "relatively",
        "uncontroversial",
        "one",
        "regarding",
        "inductive",
        "risk",
        "scb",
        "code",
        "ethic",
        "regarding",
        "intrinsic",
        "value",
        "organism",
        "specie",
        "ecosystem",
        "furthermore",
        "important",
        "question",
        "regarding",
        "value",
        "noncontroversial",
        "controversial",
        "advocated",
        "public",
        "sphere",
        "value",
        "broadly",
        "shared",
        "scientist",
        "nonscientist",
        "alike",
        "appears",
        "advocacy",
        "simply",
        "public",
        "behalf",
        "however",
        "value",
        "become",
        "specific",
        "scientist",
        "advocacy",
        "appear",
        "tension",
        "regard",
        "objectivity",
        "scientist",
        "mj",
        "brown",
        "intemann",
        "longino",
        "appear",
        "tree",
        "hugger",
        "environmentalist",
        "le",
        "impartial",
        "moreover",
        "advocacy",
        "detracts",
        "role",
        "scientist",
        "one",
        "might",
        "worry",
        "thing",
        "considered",
        "render",
        "impotent",
        "policymaking",
        "seem",
        "another",
        "talking",
        "head",
        "odenbaugh",
        "thus",
        "conservation",
        "biologist",
        "must",
        "discern",
        "balance",
        "value",
        "work",
        "discipline",
        "greater",
        "good",
        "committed",
        "policy",
        "analyst",
        "argue",
        "scientific",
        "work",
        "impact",
        "policy",
        "must",
        "objective",
        "pielke",
        "however",
        "advocating",
        "personal",
        "contextual",
        "value",
        "alleged",
        "undercut",
        "objectivity",
        "burke",
        "lauenroth",
        "see",
        "strong",
        "one",
        "claim",
        "biodiversity",
        "intrinsically",
        "valuable",
        "value",
        "widely",
        "shared",
        "reasonably",
        "defended",
        "proponent",
        "conservation",
        "biologist",
        "risk",
        "work",
        "ignored",
        "dismissed",
        "hand",
        "one",
        "advocate",
        "conservation",
        "biodiversity",
        "basis",
        "ecosystem",
        "service",
        "including",
        "carbon",
        "sequestration",
        "waste",
        "decomposition",
        "purification",
        "air",
        "water",
        "pollination",
        "etc",
        "loss",
        "service",
        "would",
        "negatively",
        "impact",
        "human",
        "advocacy",
        "would",
        "far",
        "le",
        "controversial",
        "brussard",
        "tull",
        "addition",
        "one",
        "might",
        "reconsider",
        "think",
        "science",
        "recognize",
        "enterprise",
        "valueneutral",
        "regard",
        "le",
        "objective",
        "advocacy",
        "kincaid",
        "dupré",
        "wylie",
        "might",
        "educate",
        "public",
        "think",
        "carefully",
        "clearly",
        "role",
        "value",
        "science"
    ]
}