{
    "main_text": "Living Constitutionalism\n9. Living Constitutionalism\n\nWhatever else might be said of law, this much is undeniably true:\nwhere law exists, our conduct is subject to various forms of\nrestriction. But in many instances, the relevant restrictions can be\nremoved or changed with minimal effort, as when a problematic\ncommon-law precedent is overturned because of changing social\ncircumstances, or a statute is repealed or amended because it no\nlonger serves useful purposes. Not so with constitutions. As noted\nabove, they tend to be heavily entrenched. Constitutions are also\nmeant to be long lasting, so as to serve the values of continuity and\nstability in the basic framework within which the contentious affairs\nof law and politics are conducted. The entrenched nature of\nconstitutions is largely unproblematic when we consider provisions\ndealing with such matters as the length of term of a senator or which\nbranch of government is responsible for regulating public education.\nBut things get much more complicated and contentious when we turn to\nthe highly abstract, moral provisions of most modern constitutions\nwhich have the effect of limiting the powers of government bodies in\nsignificant ways. These special features of constitutions combine to\ngive rise to a fundamental question, one that causes the originalist\nso much difficulty and to which living constitutionalism purports to\nprovide a better answer: How can one group of people, the people-then,\njustifiably place entrenched constitutional impediments of a decidedly\nmoral nature in the way of a second group of people, the people-now,\nwho might live in radically different circumstances and perhaps with\nradically different moral views? How, in short, can one generation\nlegitimately bind the moral choices of another? A satisfactory answer\nto this intergenerational problem, living constitutionalists\ncontend, requires that we recognize that constitutions can grow and\nadapt to ever-changing circumstances without losing their identity or\ntheir legitimacy.\n\nAccording to living constitutionalists, the meaning or content of an\nentrenched provision like section 3(1) of the German Basic Law, which\nproclaims that ‘All persons shall be equal before the\nlaw,’ consists in the rights or principles of political morality\nthey express, not what those rights or principles were generally\nunderstood to require at the time of enactment or were believed or\nintended to require by those who chose to include them in the\nconstitution. The choice to employ abstract moral terms (e.g.,\n‘cruel and unusual punishment’) instead of more concrete,\nnon-moral terms (e.g., ‘public hanging’ or ‘drawing\nand quartering’), is presumably made in recognition of at least\nfour crucial facts: (1) it’s important that governments not\nviolate certain important rights of political morality; (2)\nconstitutional authors do not always agree fully on what concretely is\nrequired in the many scenarios and cases in which those rights are, or\nwill later be seen to be, relevant; (3) constitutional authors can\nanticipate neither the future nor the many scenarios and cases in\nwhich these important rights will be in some way relevant; and (4)\neven when they do agree on what those rights concretely require at the\nmoment of adoption, and are comfortable binding themselves\nand their contemporaries to these concrete understandings, they are\nnot particularly comfortable doing so in respect of future generations\nwho will live in very different times and may think very differently.\nAnd so the decision is made to express constitutional commitments in\nvery abstract terms—‘cruel and unusual punishment’\nversus ‘drawing and quartering’—leaving it to later\ngenerations to substitute their possibly different concrete\nunderstandings for those of the authors or those who lived at the time\nof authorship. The result is that as concrete understandings of the\nentrenched constitutional-rights provisions evolve, the results\nwarranted by these provisions can legitimately change right along with\nthem. And importantly for the living constitutionalist who does not\nwish to surrender to the charge that she counsels infidelity to the\nconstitution, these changes can occur without the constitution having\nchanged, as would be true were a process of formal amendment\nsuccessfully invoked and an abstract, rights provision removed from\nthe constitution.\n\nOne version of living constitutionalism is common law\nconstitutionalism, a view developed and defended by David Strauss\nand Wil Waluchow. (Strauss 2010; Waluchow 2007a) This view seeks to\nconstrain and regulate the evolution of constitutional rights so that\nthey can be both responsive to changing circumstances and yet stable\nenough to accommodate rule of law values such as stability and\ncontinuity. Common law constitutionalists assert that the evolution of\na constitution is governed largely by a body of precedents. As\nprecedents are set in constitutional rights cases, principles and\ndoctrines emerge that are subject to revision as later cases arise.\nAccording to common law constitutionalism, these precedents, and the\nprinciples and doctrines they support, ultimately count as much as the\nwritten text. The former are as much a part of the constitution as the\nwritten document created by constitutional authors. David Strauss goes\nso far as to suggest, in reference to the US Constitution, that “when\na case involves the [written] Constitution, the text routinely gets no\nattention. On a day-to-day basis, American constitutional law is about\nprecedents...” (Strauss 2010, 34)\n\nDespite its undoubted appeal, (at least to many) living\nconstitutionalism is subject to a number of significant objections.\nPerhaps the most prominent ones are these: (a) the theory renders all\ntalk of constitutional interpretation, properly understood as the\nretrieval of existing meaning, utterly senseless: constitutional\ninterpretation becomes nothing more than unconstrained, constitutional\ncreation or construction masquerading as interpretation; (b) living\nconstitutionalism robs the constitution of its ability to serve its\nguidance function—how can individuals be guided by a\nconstitution whose application to their conduct and choices will be\ndetermined by the unconstrained views of later so-called\ninterpreters?; and (c) living constitutionalism violates the\nseparation of powers doctrine—if the constitution and its limits\nbecome whatever contemporary interpreters take them to mean, and if\nthose interpreters tend to be found almost exclusively in courts\npopulated by individuals who were appointed not elected, then\ndemocratically unaccountable judges end up deciding what the proper\nlimits of government power shall be, a task for which they are\neminently unqualified and which ought to be reserved for individuals\n(e.g., the authors of the constitution) with the democratic authority\nto serve that function.\n\nLiving constitutionalists have a number of responses to these\nobjections. For instance, it might be argued that the theory in no way\nresults in the unconstrained, arbitrary exercise of judicial power its\nopponents often portray it to be. Living constitutionalists like\nStrauss (2010) and Waluchow (2007a) suggest that the ongoing\ninterpretation of a constitution’s abstract rights provisions is\na process much like the process by which judges develop equally\nabstract, common-law notions like ‘negligence’ and\n‘the reasonable use of force.’ According to Strauss, the\nU.S. constitutional system\n\nhas become a common law system, one in which precedent and past\npractices are, in their own way as important as the written U.S.\nConstitution itself…[I]t is not one that judges (or anyone\nelse) can simply manipulate to fit their own ideas. (Strauss 2010, 3)\n\n\nOn this view, constitutional interpretation must accommodate itself to\nprevious attempts to interpret and apply the abstract rights\nprovisions expressed in the constitution’s text. These prior\ninterpretive decisions serve as constitutional precedents. And just as\nthe traditional rules of precedent combine respect for the (albeit\nlimited) wisdom and authority of previous decision makers (legislative\nand judicial) with an awareness of the need to allow adaptation in the\nface of changing views, and new or unforeseen circumstances, so too\nmust constitutional interpreters respect the wisdom and authority of\nprevious interpreters, while allowing the constitution to adapt so as\nto respond to changing views, and new or unforeseen circumstances.\nLiving constitutional interpretation, though flexible and adaptive, is\nno less constrained and disciplined than reasoning under common\nlaw.\n\nAnother response open to living constitutionalists is to deny that\ntheir theory of interpretation ignores the special role played by a\nconstitution’s text and its authors. The text plays a key role\ninsofar as any constitutional interpretation, innovative as it may be,\nmust be consistent with that text, until such time as it is formally\nchanged via some acknowledged process of constitutional amendment.\nThere is no reason to deny that original understandings of a\nconstitution’s abstract provisions can also be highly relevant\nto later interpretations. This is especially so for interpretations\nthat occur shortly after the constitution’s adoption, when\nworries about binding future generations is not in play. Original\nunderstandings simply cannot be dispositive, at least not in\nperpetuity. In the end, the relative importance of factors like\ntextual meaning, original understandings, later interpretations, and\nintended purposes, may be, as Joseph Raz suggests (1996,\n176–91), fundamentally a question of political morality which\ncannot be answered in the abstract and without considering what it is\nthat justifies, at that particular moment of interpretation, having an\nentrenched constitution at all, let alone one with such and such\nparticular content. Sometimes, retrieval of an existing concrete\nunderstanding will be required, especially when the constitution is in\nits infancy and was partly meant to settle a range of concrete moral\nquestions as to the proper limits of government power, at least\nfor a while. But if an interpreter has good reason to believe\nthat this settlement function has been overtaken by other more\npressing concerns, perhaps the need to adapt in light of dramatically\nchanged circumstances or much better moral understanding, then a more\ninnovative interpretation may be called for. And once again, to say\nthat constitutional interpreters must sometimes be innovative is not\nto say that a constitution can be interpreted to mean whatever the\ninterpreter wants it to mean.\n\nYet another response open to living constitutionalists is to note the\nspecial institutional structures that many jurisdictions have adopted\nto lessen democratic worries arising from the key role judges play in\ndeveloping constitutional rights. These concerns are particularly\nacute in jurisdictions, such as the US, where the Supreme Court\neffectively has the final say on the meaning and import of\nconstitutional rights provisions. But not all jurisdictions assign the\nfinal say to judges. The United Kingdom, for instance practices a\nversion of what Mark Tushnet calls “weak-form-review.” (Tushnet 2003)\nIt is the responsibility of the UK Supreme Court to rule on whether a\nprovision of Parliament is compatible with (properly interpreted)\nprovisions of the Human Rights Act. But neither the Court’s\ndecision, nor its interpretation of the relevant right, is binding on\nParliament. Despite the declared incompatibility, Parliament has the\npower to leave its legislation as is. The people-now, through their\nelected members of Parliament, retain the final say on the\ninterpretation and application of the constitutional rights recognized\nin the Human Rights Act.\n",
    "section_title": "9. Living Constitutionalism",
    "entry_title": "Constitutionalism",
    "hierarchy_title": "Constitutionalism || Living Constitutionalism",
    "tokenized_text": [
        "living",
        "constitutionalism",
        "living",
        "constitutionalism",
        "whatever",
        "else",
        "might",
        "said",
        "law",
        "much",
        "undeniably",
        "true",
        "law",
        "exists",
        "conduct",
        "subject",
        "various",
        "form",
        "restriction",
        "many",
        "instance",
        "relevant",
        "restriction",
        "removed",
        "changed",
        "minimal",
        "effort",
        "problematic",
        "commonlaw",
        "precedent",
        "overturned",
        "changing",
        "social",
        "circumstance",
        "statute",
        "repealed",
        "amended",
        "longer",
        "serf",
        "useful",
        "purpose",
        "constitution",
        "noted",
        "tend",
        "heavily",
        "entrenched",
        "constitution",
        "also",
        "meant",
        "long",
        "lasting",
        "serve",
        "value",
        "continuity",
        "stability",
        "basic",
        "framework",
        "within",
        "contentious",
        "affair",
        "law",
        "politics",
        "conducted",
        "entrenched",
        "nature",
        "constitution",
        "largely",
        "unproblematic",
        "consider",
        "provision",
        "dealing",
        "matter",
        "length",
        "term",
        "senator",
        "branch",
        "government",
        "responsible",
        "regulating",
        "public",
        "education",
        "thing",
        "get",
        "much",
        "complicated",
        "contentious",
        "turn",
        "highly",
        "abstract",
        "moral",
        "provision",
        "modern",
        "constitution",
        "effect",
        "limiting",
        "power",
        "government",
        "body",
        "significant",
        "way",
        "special",
        "feature",
        "constitution",
        "combine",
        "give",
        "rise",
        "fundamental",
        "question",
        "one",
        "cause",
        "originalist",
        "much",
        "difficulty",
        "living",
        "constitutionalism",
        "purport",
        "provide",
        "better",
        "answer",
        "one",
        "group",
        "people",
        "peoplethen",
        "justifiably",
        "place",
        "entrenched",
        "constitutional",
        "impediment",
        "decidedly",
        "moral",
        "nature",
        "way",
        "second",
        "group",
        "people",
        "peoplenow",
        "might",
        "live",
        "radically",
        "different",
        "circumstance",
        "perhaps",
        "radically",
        "different",
        "moral",
        "view",
        "short",
        "one",
        "generation",
        "legitimately",
        "bind",
        "moral",
        "choice",
        "another",
        "satisfactory",
        "answer",
        "intergenerational",
        "problem",
        "living",
        "constitutionalist",
        "contend",
        "requires",
        "recognize",
        "constitution",
        "grow",
        "adapt",
        "everchanging",
        "circumstance",
        "without",
        "losing",
        "identity",
        "legitimacy",
        "according",
        "living",
        "constitutionalist",
        "meaning",
        "content",
        "entrenched",
        "provision",
        "like",
        "section",
        "german",
        "basic",
        "law",
        "proclaims",
        "person",
        "shall",
        "equal",
        "law",
        "consists",
        "right",
        "principle",
        "political",
        "morality",
        "express",
        "right",
        "principle",
        "generally",
        "understood",
        "require",
        "time",
        "enactment",
        "believed",
        "intended",
        "require",
        "chose",
        "include",
        "constitution",
        "choice",
        "employ",
        "abstract",
        "moral",
        "term",
        "eg",
        "cruel",
        "unusual",
        "punishment",
        "instead",
        "concrete",
        "nonmoral",
        "term",
        "eg",
        "public",
        "hanging",
        "drawing",
        "quartering",
        "presumably",
        "made",
        "recognition",
        "least",
        "four",
        "crucial",
        "fact",
        "important",
        "government",
        "violate",
        "certain",
        "important",
        "right",
        "political",
        "morality",
        "constitutional",
        "author",
        "always",
        "agree",
        "fully",
        "concretely",
        "required",
        "many",
        "scenario",
        "case",
        "right",
        "later",
        "seen",
        "relevant",
        "constitutional",
        "author",
        "anticipate",
        "neither",
        "future",
        "many",
        "scenario",
        "case",
        "important",
        "right",
        "way",
        "relevant",
        "even",
        "agree",
        "right",
        "concretely",
        "require",
        "moment",
        "adoption",
        "comfortable",
        "binding",
        "contemporary",
        "concrete",
        "understanding",
        "particularly",
        "comfortable",
        "respect",
        "future",
        "generation",
        "live",
        "different",
        "time",
        "may",
        "think",
        "differently",
        "decision",
        "made",
        "express",
        "constitutional",
        "commitment",
        "abstract",
        "terms",
        "cruel",
        "unusual",
        "punishment",
        "versus",
        "drawing",
        "quartering",
        "leaving",
        "later",
        "generation",
        "substitute",
        "possibly",
        "different",
        "concrete",
        "understanding",
        "author",
        "lived",
        "time",
        "authorship",
        "result",
        "concrete",
        "understanding",
        "entrenched",
        "constitutionalrights",
        "provision",
        "evolve",
        "result",
        "warranted",
        "provision",
        "legitimately",
        "change",
        "right",
        "along",
        "importantly",
        "living",
        "constitutionalist",
        "wish",
        "surrender",
        "charge",
        "counsel",
        "infidelity",
        "constitution",
        "change",
        "occur",
        "without",
        "constitution",
        "changed",
        "would",
        "true",
        "process",
        "formal",
        "amendment",
        "successfully",
        "invoked",
        "abstract",
        "right",
        "provision",
        "removed",
        "constitution",
        "one",
        "version",
        "living",
        "constitutionalism",
        "common",
        "law",
        "constitutionalism",
        "view",
        "developed",
        "defended",
        "david",
        "strauss",
        "wil",
        "waluchow",
        "strauss",
        "waluchow",
        "a",
        "view",
        "seek",
        "constrain",
        "regulate",
        "evolution",
        "constitutional",
        "right",
        "responsive",
        "changing",
        "circumstance",
        "yet",
        "stable",
        "enough",
        "accommodate",
        "rule",
        "law",
        "value",
        "stability",
        "continuity",
        "common",
        "law",
        "constitutionalist",
        "assert",
        "evolution",
        "constitution",
        "governed",
        "largely",
        "body",
        "precedent",
        "precedent",
        "set",
        "constitutional",
        "right",
        "case",
        "principle",
        "doctrine",
        "emerge",
        "subject",
        "revision",
        "later",
        "case",
        "arise",
        "according",
        "common",
        "law",
        "constitutionalism",
        "precedent",
        "principle",
        "doctrine",
        "support",
        "ultimately",
        "count",
        "much",
        "written",
        "text",
        "former",
        "much",
        "part",
        "constitution",
        "written",
        "document",
        "created",
        "constitutional",
        "author",
        "david",
        "strauss",
        "go",
        "far",
        "suggest",
        "reference",
        "u",
        "constitution",
        "case",
        "involves",
        "written",
        "constitution",
        "text",
        "routinely",
        "get",
        "attention",
        "daytoday",
        "basis",
        "american",
        "constitutional",
        "law",
        "precedent",
        "strauss",
        "despite",
        "undoubted",
        "appeal",
        "least",
        "many",
        "living",
        "constitutionalism",
        "subject",
        "number",
        "significant",
        "objection",
        "perhaps",
        "prominent",
        "one",
        "theory",
        "render",
        "talk",
        "constitutional",
        "interpretation",
        "properly",
        "understood",
        "retrieval",
        "existing",
        "meaning",
        "utterly",
        "senseless",
        "constitutional",
        "interpretation",
        "becomes",
        "nothing",
        "unconstrained",
        "constitutional",
        "creation",
        "construction",
        "masquerading",
        "interpretation",
        "b",
        "living",
        "constitutionalism",
        "robs",
        "constitution",
        "ability",
        "serve",
        "guidance",
        "functionhow",
        "individual",
        "guided",
        "constitution",
        "whose",
        "application",
        "conduct",
        "choice",
        "determined",
        "unconstrained",
        "view",
        "later",
        "socalled",
        "interpreter",
        "c",
        "living",
        "constitutionalism",
        "violates",
        "separation",
        "power",
        "doctrineif",
        "constitution",
        "limit",
        "become",
        "whatever",
        "contemporary",
        "interpreter",
        "take",
        "mean",
        "interpreter",
        "tend",
        "found",
        "almost",
        "exclusively",
        "court",
        "populated",
        "individual",
        "appointed",
        "elected",
        "democratically",
        "unaccountable",
        "judge",
        "end",
        "deciding",
        "proper",
        "limit",
        "government",
        "power",
        "shall",
        "task",
        "eminently",
        "unqualified",
        "ought",
        "reserved",
        "individual",
        "eg",
        "author",
        "constitution",
        "democratic",
        "authority",
        "serve",
        "function",
        "living",
        "constitutionalist",
        "number",
        "response",
        "objection",
        "instance",
        "might",
        "argued",
        "theory",
        "way",
        "result",
        "unconstrained",
        "arbitrary",
        "exercise",
        "judicial",
        "power",
        "opponent",
        "often",
        "portray",
        "living",
        "constitutionalist",
        "like",
        "strauss",
        "waluchow",
        "a",
        "suggest",
        "ongoing",
        "interpretation",
        "constitution",
        "abstract",
        "right",
        "provision",
        "process",
        "much",
        "like",
        "process",
        "judge",
        "develop",
        "equally",
        "abstract",
        "commonlaw",
        "notion",
        "like",
        "negligence",
        "reasonable",
        "use",
        "force",
        "according",
        "strauss",
        "us",
        "constitutional",
        "system",
        "become",
        "common",
        "law",
        "system",
        "one",
        "precedent",
        "past",
        "practice",
        "way",
        "important",
        "written",
        "us",
        "constitution",
        "itself",
        "one",
        "judge",
        "anyone",
        "else",
        "simply",
        "manipulate",
        "fit",
        "idea",
        "strauss",
        "view",
        "constitutional",
        "interpretation",
        "must",
        "accommodate",
        "previous",
        "attempt",
        "interpret",
        "apply",
        "abstract",
        "right",
        "provision",
        "expressed",
        "constitution",
        "text",
        "prior",
        "interpretive",
        "decision",
        "serve",
        "constitutional",
        "precedent",
        "traditional",
        "rule",
        "precedent",
        "combine",
        "respect",
        "albeit",
        "limited",
        "wisdom",
        "authority",
        "previous",
        "decision",
        "maker",
        "legislative",
        "judicial",
        "awareness",
        "need",
        "allow",
        "adaptation",
        "face",
        "changing",
        "view",
        "new",
        "unforeseen",
        "circumstance",
        "must",
        "constitutional",
        "interpreter",
        "respect",
        "wisdom",
        "authority",
        "previous",
        "interpreter",
        "allowing",
        "constitution",
        "adapt",
        "respond",
        "changing",
        "view",
        "new",
        "unforeseen",
        "circumstance",
        "living",
        "constitutional",
        "interpretation",
        "though",
        "flexible",
        "adaptive",
        "le",
        "constrained",
        "disciplined",
        "reasoning",
        "common",
        "law",
        "another",
        "response",
        "open",
        "living",
        "constitutionalist",
        "deny",
        "theory",
        "interpretation",
        "ignores",
        "special",
        "role",
        "played",
        "constitution",
        "text",
        "author",
        "text",
        "play",
        "key",
        "role",
        "insofar",
        "constitutional",
        "interpretation",
        "innovative",
        "may",
        "must",
        "consistent",
        "text",
        "time",
        "formally",
        "changed",
        "via",
        "acknowledged",
        "process",
        "constitutional",
        "amendment",
        "reason",
        "deny",
        "original",
        "understanding",
        "constitution",
        "abstract",
        "provision",
        "also",
        "highly",
        "relevant",
        "later",
        "interpretation",
        "especially",
        "interpretation",
        "occur",
        "shortly",
        "constitution",
        "adoption",
        "worry",
        "binding",
        "future",
        "generation",
        "play",
        "original",
        "understanding",
        "simply",
        "dispositive",
        "least",
        "perpetuity",
        "end",
        "relative",
        "importance",
        "factor",
        "like",
        "textual",
        "meaning",
        "original",
        "understanding",
        "later",
        "interpretation",
        "intended",
        "purpose",
        "may",
        "joseph",
        "raz",
        "suggests",
        "fundamentally",
        "question",
        "political",
        "morality",
        "answered",
        "abstract",
        "without",
        "considering",
        "justifies",
        "particular",
        "moment",
        "interpretation",
        "entrenched",
        "constitution",
        "let",
        "alone",
        "one",
        "particular",
        "content",
        "sometimes",
        "retrieval",
        "existing",
        "concrete",
        "understanding",
        "required",
        "especially",
        "constitution",
        "infancy",
        "partly",
        "meant",
        "settle",
        "range",
        "concrete",
        "moral",
        "question",
        "proper",
        "limit",
        "government",
        "power",
        "least",
        "interpreter",
        "good",
        "reason",
        "believe",
        "settlement",
        "function",
        "overtaken",
        "pressing",
        "concern",
        "perhaps",
        "need",
        "adapt",
        "light",
        "dramatically",
        "changed",
        "circumstance",
        "much",
        "better",
        "moral",
        "understanding",
        "innovative",
        "interpretation",
        "may",
        "called",
        "say",
        "constitutional",
        "interpreter",
        "must",
        "sometimes",
        "innovative",
        "say",
        "constitution",
        "interpreted",
        "mean",
        "whatever",
        "interpreter",
        "want",
        "mean",
        "yet",
        "another",
        "response",
        "open",
        "living",
        "constitutionalist",
        "note",
        "special",
        "institutional",
        "structure",
        "many",
        "jurisdiction",
        "adopted",
        "lessen",
        "democratic",
        "worry",
        "arising",
        "key",
        "role",
        "judge",
        "play",
        "developing",
        "constitutional",
        "right",
        "concern",
        "particularly",
        "acute",
        "jurisdiction",
        "u",
        "supreme",
        "court",
        "effectively",
        "final",
        "say",
        "meaning",
        "import",
        "constitutional",
        "right",
        "provision",
        "jurisdiction",
        "assign",
        "final",
        "say",
        "judge",
        "united",
        "kingdom",
        "instance",
        "practice",
        "version",
        "mark",
        "tushnet",
        "call",
        "weakformreview",
        "tushnet",
        "responsibility",
        "uk",
        "supreme",
        "court",
        "rule",
        "whether",
        "provision",
        "parliament",
        "compatible",
        "properly",
        "interpreted",
        "provision",
        "human",
        "right",
        "act",
        "neither",
        "court",
        "decision",
        "interpretation",
        "relevant",
        "right",
        "binding",
        "parliament",
        "despite",
        "declared",
        "incompatibility",
        "parliament",
        "power",
        "leave",
        "legislation",
        "peoplenow",
        "elected",
        "member",
        "parliament",
        "retain",
        "final",
        "say",
        "interpretation",
        "application",
        "constitutional",
        "right",
        "recognized",
        "human",
        "right",
        "act"
    ]
}