{
    "main_text": "14th Century Theories of Consequence || Buridan and the Parisian tradition\n3.3 Buridan and the Parisian tradition\n\nJohn Buridan’s treatise on consequence (TC, edited by H. Hubien in\n1976, English translation in (Buridan 2015)) quite likely represents\nthe pinnacle of sophistication for (Latin) medieval discussions of the\nconcept of consequence. Its modern editor dates it to the 1330s, thus\nbelonging to the early stages of Buridan’s career. We currently know\nmuch less about Buridan’s immediate predecessors than about Burley’s\nor Ockham’s, so it is not clear who Buridan takes inspiration from or\nis criticizing. The treatise is composed of four books: Book I\npresents general considerations on the very notion of consequence;\nBook II treats of consequences involving modal sentences; Book III\ntreats of syllogisms involving assertoric (i.e. non-modal) sentences;\nBook IV deals with syllogisms involving modal sentences. Each of them\nis remarkable in its own way (Book III for example represents a\nradical subversion of Aristotelian orthodoxy, with the suggestion that\nthird-figure syllogisms are more foundational than first-figure\nsyllogisms), but here we shall focus on the first two books (Book I in\nparticular), given the methodological decision of leaving syllogistic\naside in the present analysis.\n\nIn Book I, Buridan presents the general definition of a consequence in\nthe familiar terms of necessary truth-preservation:\n\nHence, many say that of two propositions one is antecedent to the\nother if it is impossible for the one to be true without the other\nbeing true, and one is consequent to the other if it is impossible for\nthe one not to be true when the other is true, so that every\nproposition is antecedent to every other proposition for which it is\nimpossible for it to be true without the other being true. (Buridan,\nTC, 21; transl. 67)\n\n\nHe then goes on to reformulate the definition for reasons related to\nhis view that only actually produced sentences (sentence-tokens) can\nhave a truth-value (Klima 2004; Dutilh Novaes 2005). ‘No\nsentence is negative, therefore no donkey is running’ comes out\nas a valid consequence according to the criterion thus formulated,\nbecause ‘No sentence is negative’ can never be true: its\nmere existence falsifies itself whenever it is produced. According to\nBuridan, this example should not count as a valid consequence, and one\nreason he gives for this is that its contrapositive ‘Some donkey\nis running, therefore some sentence is negative’ is not a valid\nconsequence. He formulates a definition of consequences in terms of\n‘howsoever the antecedent/consequent signifies things to\nbe’ in order to accommodate such counterexamples, but adds that\nin most cases, the simpler definition is sufficiently accurate.\n\nCommitment to sentence-tokens aside, Buridan’s notion of consequence\nclearly has necessary truth-preservation (TP) as its fundamental component.\nSo for him, enthymematic consequences such as ‘a man runs,\ntherefore an animal runs’ are just as valid as syllogistic\nconsequences or other consequences satisfying the criterion of\npreservation of validity under term substitution (ST). However,\nBuridan does recognize that there is an important distinction between\nconsequences which do and those which do not satisfy the\nsubstitutional criterion; giving continuation to a tradition which\nincludes Alexander of Aphrodisias and Simon of Faversham, he\nconceptualizes this distinction in hylomorphic terms, more\nspecifically in terms of the distinction between formal and material\nconsequence:\n\nA consequence is called formal if it is valid in all terms retaining a\nsimilar form. Or if you want to put it explicitly, a formal\nconsequence is one where every proposition similar in form that might\nbe formed would be a good consequence, e.g., ‘That which is A is\nB, so that which is B is A’. (Buridan, TC, 22–23, transl.\n68; my emphasis)\n\n\nMaterial consequences are those which do satisfy the necessary\ntruth-preservation criterion (TP) but do not satisfy the\nsubstitutional criterion (ST) (Crimi 2018). At first sight, Buridan’s distinction\nbetween formal and material consequence seems very similar to, for\nexample, Abelard’s distinction between perfect and imperfect\ninferences. There is, however, a fundamental difference; nowhere does\nBuridan suggest that formal consequences are valid in virtue of\ntheir form, as Abelard had claimed for the\n‘complexio’ of perfect inferences (Dutilh Novaes and Bosman 2017). He does say\nthat the validity of a material consequence is made evident\nonly by means of a reduction to a formal consequence (TC, 1.4), but\nthis observation pertains to the epistemic level of how the validity\nof a consequence is made apparent to us, not to the quasi-metaphysical\nlevel of what grounds\n it.[11]\n\nBuridan also comments explicitly on what is to be understood as the\nform and the matter of a consequence:\n\nI say that when we speak of matter and form, by the matter of a\nproposition or consequence we mean the purely categorematic terms,\nnamely, the subject and predicate, setting aside the syncategoremes\nattached to them by which they are conjoined or denied or distributed\nor given a certain kind of supposition; we say all the rest pertains\nto the form (Buridan, TC, 30, transl. 74)\n\n\nThe view that the form of a consequence/argument pertains to its\nsyncategorematic terms while its matter pertains to its categorematic\nterms is presupposed in both earlier and subsequent texts, but here\nwith Buridan it receives a rare explicit formulation. A modern version\nof this idea still survives, in the form of the doctrine of the\nlogical form of arguments and the modern preoccupation with logical\nconstants (Read 1994; Dutilh Novaes 2012a; entry on logical constants\nof this encyclopedia). However, it is worth emphasizing once again\nthat drawing the line between the form and the matter of an\nargument/consequence in this manner still does not entail the thesis\nthat the form is that in virtue of which a valid argument is valid;\nnor does it entail the thesis that only the\narguments/consequences satisfying the substitutional criterion are\nindeed valid. Buridan, in particular, does not hold either one of\nthese theses.\n\nIn the final section of Book I, Buridan formulates a series of general\nprinciples which follow from his proposed definition of consequence,\nsuch as that from the impossible anything follows (first conclusion;\nsee (D’Ors 1993 and Normore 2015) on Buridan and the ex\nimpossibili principle)), the principle of contraposition (third\nconclusion), and also many principles pertaining to the semantic\nproperties of the categorematic terms in a consequence (see entry on\nmedieval theories of properties of terms). Thus, here again we see\nthat medieval theories of consequence never completely abandon the\nterm perspective to adopt an exclusively sentential/propositional\nperspective.\n\nBook II of Buridan’s treatise presents a sophisticated analysis of the\nlogical behavior of modal sentences. Modal sentences can be either\ncomposite or divided, depending on where the modal term occurs: if it\nis either the subject or the predicate of the sentence, while the\nother term is an embedded sentence in nominalized form (in\n‘dictum’ form, in the medieval terminology), then the\nsentence is a composite modal sentence. If however the modal term\noccurs as an adverb modifying the copula, then it is a divided modal\nsentence. Buridan then proves a series of conclusions and equivalences\nfor each kind of modal sentences, such as that ‘B is\nnecessarily A’ is equivalent to ‘B is\nnot possibly not A’ (Johnston 2014).\n\nThe other treatises on consequence in the Parisian/continental tradition do not seem to depart significantly from Buridan’s overall analysis, with one possible exception: the commentary on the\nPrior Analytics formerly attributed to Scotus (edited in\nYrjönsuuri 2001), and whose authorship remains controversial. The\ndating is equally problematic; crucially, it is not clear whether it\nwas written before or after Buridan’s treatise, but some scholars\n(Lagerlund 2000, chapter 6) have argued that at any rate Pseudo-Scotus\ndisplays no knowledge of Buridan’s treatise (likewise, there is no\nobvious evidence that Buridan was familiar with Pseudo-Scotus’\ntext).\n\nThe treatise proceeds very much in the spirit of chapter 3 of Book I\nof Buridan’s treatise: a putative definition of consequence is\nproposed, but then quickly a counterexample is found, namely something\nthat should not count as a consequence and yet satisfies the\ncriterion, or the other way round (Boh 1982,\n 307–310).[12]\n But while Buridan rests his case after the third proposed definition,\nPseudo-Scotus goes on, and formulates a counterexample to the\ndefinition that Buridan settles on: ‘God exists, hence this\nargument is invalid’. If this consequence is valid, then it has\na necessary antecedent and a false consequent (since the consequent\nsays that it is invalid). But then it is invalid. In sum, if it is\nvalid, it is invalid; thus, by the consequentia mirabilis\n((A → ~A) → ~A), it is invalid.\nBut if it is invalid, it is necessarily so, since the premise is a\nnecessary sentence; therefore, we have a consequence with a necessary\nconsequent, thus satisfying the necessary truth-preservation\ncriterion, but which is plainly invalid. This has been described as a\n“proto-version” of Curry’s\n paradox.[13]\n\nMoreover, the Pseudo-Scotus treatise also offers an interesting formulation of\nthe simple vs. as-of-now distinction: in contrast with e.g. Burley,\naccording to Pseudo-Scotus this distinction applies only to material\nconsequences (recall that for him, a formal consequence is the one\nthat satisfies the substitutional criterion), and amounts to the modal\nvalue of the missing premise that can be added in order to turn the\n(enthymematic) consequence into a formal one. That is, if the missing\npremise is a necessary sentence, then the consequence is an\nabsolute/simple one. But if the missing premise is a contingent truth\n(it has to be true with respect to the time indicated by the verbs of\nthe consequence, otherwise the original material consequence does not\nhold), then the original material consequence holds only in some\nsituations, namely the situations in which the contingent sentence\nhappens to be true, and is thus an as-of-now consequence. The same\nformulation of the simple vs. as-of-now distinction can be found in\nBuridan’s treatise, Book I chapter 4, which again illustrates the\nconceptual connection between the two texts.\n",
    "section_title": "3.3 Buridan and the Parisian tradition",
    "entry_title": "Medieval Theories of Consequence",
    "hierarchy_title": "Medieval Theories of Consequence || 14th Century Theories of Consequence || Buridan and the Parisian tradition",
    "tokenized_text": [
        "th",
        "century",
        "theory",
        "consequence",
        "buridan",
        "parisian",
        "tradition",
        "buridan",
        "parisian",
        "tradition",
        "john",
        "buridan",
        "treatise",
        "consequence",
        "tc",
        "edited",
        "h",
        "hubien",
        "english",
        "translation",
        "buridan",
        "quite",
        "likely",
        "represents",
        "pinnacle",
        "sophistication",
        "latin",
        "medieval",
        "discussion",
        "concept",
        "consequence",
        "modern",
        "editor",
        "date",
        "s",
        "thus",
        "belonging",
        "early",
        "stage",
        "buridan",
        "career",
        "currently",
        "know",
        "much",
        "le",
        "buridan",
        "immediate",
        "predecessor",
        "burley",
        "ockham",
        "clear",
        "buridan",
        "take",
        "inspiration",
        "criticizing",
        "treatise",
        "composed",
        "four",
        "book",
        "book",
        "present",
        "general",
        "consideration",
        "notion",
        "consequence",
        "book",
        "ii",
        "treat",
        "consequence",
        "involving",
        "modal",
        "sentence",
        "book",
        "iii",
        "treat",
        "syllogism",
        "involving",
        "assertoric",
        "ie",
        "nonmodal",
        "sentence",
        "book",
        "iv",
        "deal",
        "syllogism",
        "involving",
        "modal",
        "sentence",
        "remarkable",
        "way",
        "book",
        "iii",
        "example",
        "represents",
        "radical",
        "subversion",
        "aristotelian",
        "orthodoxy",
        "suggestion",
        "thirdfigure",
        "syllogism",
        "foundational",
        "firstfigure",
        "syllogism",
        "shall",
        "focus",
        "first",
        "two",
        "book",
        "book",
        "particular",
        "given",
        "methodological",
        "decision",
        "leaving",
        "syllogistic",
        "aside",
        "present",
        "analysis",
        "book",
        "buridan",
        "present",
        "general",
        "definition",
        "consequence",
        "familiar",
        "term",
        "necessary",
        "truthpreservation",
        "hence",
        "many",
        "say",
        "two",
        "proposition",
        "one",
        "antecedent",
        "impossible",
        "one",
        "true",
        "without",
        "true",
        "one",
        "consequent",
        "impossible",
        "one",
        "true",
        "true",
        "every",
        "proposition",
        "antecedent",
        "every",
        "proposition",
        "impossible",
        "true",
        "without",
        "true",
        "buridan",
        "tc",
        "transl",
        "go",
        "reformulate",
        "definition",
        "reason",
        "related",
        "view",
        "actually",
        "produced",
        "sentence",
        "sentencetokens",
        "truthvalue",
        "klima",
        "dutilh",
        "novaes",
        "sentence",
        "negative",
        "therefore",
        "donkey",
        "running",
        "come",
        "valid",
        "consequence",
        "according",
        "criterion",
        "thus",
        "formulated",
        "sentence",
        "negative",
        "never",
        "true",
        "mere",
        "existence",
        "falsifies",
        "whenever",
        "produced",
        "according",
        "buridan",
        "example",
        "count",
        "valid",
        "consequence",
        "one",
        "reason",
        "give",
        "contrapositive",
        "donkey",
        "running",
        "therefore",
        "sentence",
        "negative",
        "valid",
        "consequence",
        "formulates",
        "definition",
        "consequence",
        "term",
        "howsoever",
        "antecedentconsequent",
        "signifies",
        "thing",
        "order",
        "accommodate",
        "counterexample",
        "add",
        "case",
        "simpler",
        "definition",
        "sufficiently",
        "accurate",
        "commitment",
        "sentencetokens",
        "aside",
        "buridan",
        "notion",
        "consequence",
        "clearly",
        "necessary",
        "truthpreservation",
        "tp",
        "fundamental",
        "component",
        "enthymematic",
        "consequence",
        "man",
        "run",
        "therefore",
        "animal",
        "run",
        "valid",
        "syllogistic",
        "consequence",
        "consequence",
        "satisfying",
        "criterion",
        "preservation",
        "validity",
        "term",
        "substitution",
        "st",
        "however",
        "buridan",
        "recognize",
        "important",
        "distinction",
        "consequence",
        "satisfy",
        "substitutional",
        "criterion",
        "giving",
        "continuation",
        "tradition",
        "includes",
        "alexander",
        "aphrodisia",
        "simon",
        "faversham",
        "conceptualizes",
        "distinction",
        "hylomorphic",
        "term",
        "specifically",
        "term",
        "distinction",
        "formal",
        "material",
        "consequence",
        "consequence",
        "called",
        "formal",
        "valid",
        "term",
        "retaining",
        "similar",
        "form",
        "want",
        "put",
        "explicitly",
        "formal",
        "consequence",
        "one",
        "every",
        "proposition",
        "similar",
        "form",
        "might",
        "formed",
        "would",
        "good",
        "consequence",
        "eg",
        "b",
        "b",
        "buridan",
        "tc",
        "transl",
        "emphasis",
        "material",
        "consequence",
        "satisfy",
        "necessary",
        "truthpreservation",
        "criterion",
        "tp",
        "satisfy",
        "substitutional",
        "criterion",
        "st",
        "crimi",
        "first",
        "sight",
        "buridan",
        "distinction",
        "formal",
        "material",
        "consequence",
        "seems",
        "similar",
        "example",
        "abelard",
        "distinction",
        "perfect",
        "imperfect",
        "inference",
        "however",
        "fundamental",
        "difference",
        "nowhere",
        "buridan",
        "suggest",
        "formal",
        "consequence",
        "valid",
        "virtue",
        "form",
        "abelard",
        "claimed",
        "complexio",
        "perfect",
        "inference",
        "dutilh",
        "novaes",
        "bosman",
        "say",
        "validity",
        "material",
        "consequence",
        "made",
        "evident",
        "mean",
        "reduction",
        "formal",
        "consequence",
        "tc",
        "observation",
        "pertains",
        "epistemic",
        "level",
        "validity",
        "consequence",
        "made",
        "apparent",
        "u",
        "quasimetaphysical",
        "level",
        "ground",
        "buridan",
        "also",
        "comment",
        "explicitly",
        "understood",
        "form",
        "matter",
        "consequence",
        "say",
        "speak",
        "matter",
        "form",
        "matter",
        "proposition",
        "consequence",
        "mean",
        "purely",
        "categorematic",
        "term",
        "namely",
        "subject",
        "predicate",
        "setting",
        "aside",
        "syncategoreme",
        "attached",
        "conjoined",
        "denied",
        "distributed",
        "given",
        "certain",
        "kind",
        "supposition",
        "say",
        "rest",
        "pertains",
        "form",
        "buridan",
        "tc",
        "transl",
        "view",
        "form",
        "consequenceargument",
        "pertains",
        "syncategorematic",
        "term",
        "matter",
        "pertains",
        "categorematic",
        "term",
        "presupposed",
        "earlier",
        "subsequent",
        "text",
        "buridan",
        "receives",
        "rare",
        "explicit",
        "formulation",
        "modern",
        "version",
        "idea",
        "still",
        "survives",
        "form",
        "doctrine",
        "logical",
        "form",
        "argument",
        "modern",
        "preoccupation",
        "logical",
        "constant",
        "read",
        "dutilh",
        "novaes",
        "a",
        "entry",
        "logical",
        "constant",
        "encyclopedia",
        "however",
        "worth",
        "emphasizing",
        "drawing",
        "line",
        "form",
        "matter",
        "argumentconsequence",
        "manner",
        "still",
        "entail",
        "thesis",
        "form",
        "virtue",
        "valid",
        "argument",
        "valid",
        "entail",
        "thesis",
        "argumentsconsequences",
        "satisfying",
        "substitutional",
        "criterion",
        "indeed",
        "valid",
        "buridan",
        "particular",
        "hold",
        "either",
        "one",
        "thesis",
        "final",
        "section",
        "book",
        "buridan",
        "formulates",
        "series",
        "general",
        "principle",
        "follow",
        "proposed",
        "definition",
        "consequence",
        "impossible",
        "anything",
        "follows",
        "first",
        "conclusion",
        "see",
        "or",
        "normore",
        "buridan",
        "ex",
        "impossibili",
        "principle",
        "principle",
        "contraposition",
        "third",
        "conclusion",
        "also",
        "many",
        "principle",
        "pertaining",
        "semantic",
        "property",
        "categorematic",
        "term",
        "consequence",
        "see",
        "entry",
        "medieval",
        "theory",
        "property",
        "term",
        "thus",
        "see",
        "medieval",
        "theory",
        "consequence",
        "never",
        "completely",
        "abandon",
        "term",
        "perspective",
        "adopt",
        "exclusively",
        "sententialpropositional",
        "perspective",
        "book",
        "ii",
        "buridan",
        "treatise",
        "present",
        "sophisticated",
        "analysis",
        "logical",
        "behavior",
        "modal",
        "sentence",
        "modal",
        "sentence",
        "either",
        "composite",
        "divided",
        "depending",
        "modal",
        "term",
        "occurs",
        "either",
        "subject",
        "predicate",
        "sentence",
        "term",
        "embedded",
        "sentence",
        "nominalized",
        "form",
        "dictum",
        "form",
        "medieval",
        "terminology",
        "sentence",
        "composite",
        "modal",
        "sentence",
        "however",
        "modal",
        "term",
        "occurs",
        "adverb",
        "modifying",
        "copula",
        "divided",
        "modal",
        "sentence",
        "buridan",
        "prof",
        "series",
        "conclusion",
        "equivalence",
        "kind",
        "modal",
        "sentence",
        "b",
        "necessarily",
        "equivalent",
        "b",
        "possibly",
        "johnston",
        "treatise",
        "consequence",
        "parisiancontinental",
        "tradition",
        "seem",
        "depart",
        "significantly",
        "buridan",
        "overall",
        "analysis",
        "one",
        "possible",
        "exception",
        "commentary",
        "prior",
        "analytics",
        "formerly",
        "attributed",
        "scotus",
        "edited",
        "yrjönsuuri",
        "whose",
        "authorship",
        "remains",
        "controversial",
        "dating",
        "equally",
        "problematic",
        "crucially",
        "clear",
        "whether",
        "written",
        "buridan",
        "treatise",
        "scholar",
        "lagerlund",
        "chapter",
        "argued",
        "rate",
        "pseudoscotus",
        "display",
        "knowledge",
        "buridan",
        "treatise",
        "likewise",
        "obvious",
        "evidence",
        "buridan",
        "familiar",
        "pseudoscotus",
        "text",
        "treatise",
        "proceeds",
        "much",
        "spirit",
        "chapter",
        "book",
        "buridan",
        "treatise",
        "putative",
        "definition",
        "consequence",
        "proposed",
        "quickly",
        "counterexample",
        "found",
        "namely",
        "something",
        "count",
        "consequence",
        "yet",
        "satisfies",
        "criterion",
        "way",
        "round",
        "boh",
        "buridan",
        "rest",
        "case",
        "third",
        "proposed",
        "definition",
        "pseudoscotus",
        "go",
        "formulates",
        "counterexample",
        "definition",
        "buridan",
        "settle",
        "god",
        "exists",
        "hence",
        "argument",
        "invalid",
        "consequence",
        "valid",
        "necessary",
        "antecedent",
        "false",
        "consequent",
        "since",
        "consequent",
        "say",
        "invalid",
        "invalid",
        "sum",
        "valid",
        "invalid",
        "thus",
        "consequentia",
        "mirabilis",
        "a",
        "a",
        "invalid",
        "invalid",
        "necessarily",
        "since",
        "premise",
        "necessary",
        "sentence",
        "therefore",
        "consequence",
        "necessary",
        "consequent",
        "thus",
        "satisfying",
        "necessary",
        "truthpreservation",
        "criterion",
        "plainly",
        "invalid",
        "described",
        "protoversion",
        "curry",
        "paradox",
        "moreover",
        "pseudoscotus",
        "treatise",
        "also",
        "offer",
        "interesting",
        "formulation",
        "simple",
        "vs",
        "asofnow",
        "distinction",
        "contrast",
        "eg",
        "burley",
        "according",
        "pseudoscotus",
        "distinction",
        "applies",
        "material",
        "consequence",
        "recall",
        "formal",
        "consequence",
        "one",
        "satisfies",
        "substitutional",
        "criterion",
        "amount",
        "modal",
        "value",
        "missing",
        "premise",
        "added",
        "order",
        "turn",
        "enthymematic",
        "consequence",
        "formal",
        "one",
        "missing",
        "premise",
        "necessary",
        "sentence",
        "consequence",
        "absolutesimple",
        "one",
        "missing",
        "premise",
        "contingent",
        "truth",
        "true",
        "respect",
        "time",
        "indicated",
        "verb",
        "consequence",
        "otherwise",
        "original",
        "material",
        "consequence",
        "hold",
        "original",
        "material",
        "consequence",
        "hold",
        "situation",
        "namely",
        "situation",
        "contingent",
        "sentence",
        "happens",
        "true",
        "thus",
        "asofnow",
        "consequence",
        "formulation",
        "simple",
        "vs",
        "asofnow",
        "distinction",
        "found",
        "buridan",
        "treatise",
        "book",
        "chapter",
        "illustrates",
        "conceptual",
        "connection",
        "two",
        "text"
    ]
}