{
    "main_text": "Other Goods To Be Promoted\n3. Other Goods To Be Promoted\n\nThe nonutilitarian members of the consequentialist family are theories\nthat assess acts and/or character traits, practices, and institutions\nsolely in terms of resulting good, where good is not restricted to\nwelfare. “Nonutilitarian” here means “not\npurely utilitarian”, rather than “completely\nunutilitarian”. When writers describe themselves as\nconsequentialists rather than as utilitarians, they are normally\nsignalling that their fundamental evaluations will be in terms of not\nonly welfare but also some other goods.\n\nWhat are these other goods? The most common answers have been justice,\nfairness, and equality.\n\nJustice, according to Plato, is “rendering to each his\ndue” (Republic, Bk. 1). We might suppose that what\npeople are due is a matter of what people are owed, either because\nthey deserve it or because they have a moral right to it. Suppose we\nplug these ideas into consequentialism. Then we get the theory that\nthings should be assessed in terms of not only how much welfare\nresults but also the extent to which people get what they deserve and\nthe extent to which moral rights are respected.\n\nFor consequentialism to take this line, however, is for it to restrict\nits explanatory ambitions. What a theory simply presupposes, it does\nnot explain. A consequentialist theory that presupposes both that\njustice is constituted by such-and-such and that justice is one of the\nthings to be promoted does not explain why the components of justice\nare important. It does not explain what desert is. It does not explain\nthe importance of moral rights, much less try to determine what the\ncontents of these moral rights are. These are matters too important\nand contentious for a consequentialist theory to leave unexplained or\nopen. If consequentialism is going to refer to justice, desert, and\nmoral rights, it needs to analyze these concepts and justify the role\nit gives them.\n\nSimilar things can be said about fairness. If a consequentialist\ntheory presupposes an account of fairness, and simply stipulates that\nfairness is to be promoted, then this consequentialist theory is not\nexplaining fairness. But fairness (like justice, desert, and moral\nrights) is a concept too important for consequentialism not to try to\nexplain.\n\nOne way for consequentialists to deal with justice and fairness is to\ncontend that justice and fairness are constituted by conformity with a\ncertain set of justified social practices, and that what justifies\nthese practices is that they generally promote overall welfare and\nequality. Indeed, the contention might be that what people are due,\nwhat people have a moral right to, what justice and fairness require,\nis conformity to whatever practices promote overall welfare and\nequality.\n\nWhether equality needs to be included in the formula, however, is very\ncontroversial. Many think that a purely utilitarian formula has\nsufficiently egalitarian implications. They think that, even if the\ngoal is promotion of welfare, not the promotion of\nwelfare-plus-equality, there are some contingent but pervasive facts\nabout human beings that push in the direction of equal distribution of\nmaterial resources. According to the “law of diminishing\nmarginal utility of material resources”, the amount of benefit a\nperson gets out of a certain unit of material resources is less the\nmore units of that material good the person already has. Suppose I go\nfrom having no way of getting around except by foot to having a\nbicycle, or, though I live in a place where one can get very cold, I\ngo from having no warm coat to having one. I will benefit more from\ngetting that first bicycle or coat than I would if I go from having\nnine bicycles or coats to having ten.\n\nThere are exceptions to the law of diminishing marginal utility. In\nmost of these exceptions, an additional unit of material resource\npushes someone over some important threshold. For example, consider\nthe meal or pill or gulp of air that saves someone’s life, or\nthe car whose acquisition pushes the competitive collector into first\nplace. In such cases, the unit that puts the person over the threshold\nmight well be as beneficial to that person as any prior unit was.\nStill, as a general rule, material resources do have diminishing\nmarginal utility.\n\nTo the assumption that material resources have diminishing marginal\nutility, let us add the assumption that different people generally get\nroughly the same benefits from the same material resources.\nAgain, there are exceptions. If you live in a freezing climate and I\nlive in a hot climate, then you would benefit much more from a warm\ncoat than I would.\n\nBut suppose we live in the same place, which has freezing winters,\ngood paths for riding bicycles, and no public transportation. And\nsuppose you have ten bicycles and ten coats (though you are not vying\nfor some bicycle- or coat-collector prize). Meanwhile, I am so poor\nthat I have none. Then, redistributing one of your bicycles and one of\nyour coats to me will probably harm you less than it will benefit me.\nThis sort of phenomenon pervades societies where resources are\nunequally distributed. Wherever the phenomenon occurs, a fundamentally\nimpartial morality is under pressure to redistribute resources from\nthe richer to the poorer.\n\nHowever, there are also contingent but pervasive facts about human\nbeings that pull in favor of practices that have the foreseen\nconsequence of material inequality. First of all, higher levels of\noverall welfare can require higher levels of productivity (think of\nthe welfare gains resulting from improvements in agricultural\nproductivity). In many areas of the economy, the provision of material\nrewards for greater productivity seems the most efficient acceptable\nway of eliciting higher productivity. Some individuals and groups will\nbe more productive than others (especially if there are incentive\nschemes). So the practice of providing material rewards for greater\nproductivity will result in material inequality.\n\nThus, on the one hand, the diminishing marginal utility of material\nresources exerts pressure in favor of more equal distributions of\nresources. On the other hand, the need to promote productivity exerts\npressure in favor of incentive schemes that have the foreseen\nconsequence of material inequality. Utilitarians and most other\nconsequentialists find themselves balancing these opposed\npressures.\n\nNote that those pressures concern the distribution of resources. There\nis a further question about how equally welfare itself should be\ndistributed. Many recent writers have taken utilitarianism to be\nindifferent about the distribution of welfare. Imagine a choice\nbetween an outcome where overall welfare is large but distributed\nunequally and an outcome where overall welfare is smaller but\ndistributed equally. Utilitarians are taken to favor outcomes with\ngreater overall welfare even if it is also less equally\ndistributed.\n\nTo illustrate this, let us take an artificially simple population,\ndivided into just two groups.\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 1\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n10\n1,000,000\n  \n\n \n \n \nImpartially calculated: 1,010,000  \n\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 2\nPer person\nPer group\n  \n\n10,000 people in group A\n8\n80,000\n  \n\n100,000 people in group B\n9\n900,000\n  \n\n \n \n \nImpartially calculated: 980,000  \n\n\n\nMany people would think Alternative 2 above better than Alternative 1,\nand might think that the comparison between these alternatives shows\nthat there is always pressure in favor of greater equality of\nwelfare.\n\nAs Derek Parfit (1997) in particular has argued, however, we must not\nbe too hasty. Consider the following choice:\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 1\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n10\n1,000,000\n  \n\n \n \n \nImpartially calculated: 1,010,000  \n\n\n\n\n\n\n \nUnits of welfare\nTotal welfare for both groups \n\nAlternative 3\nPer person\nPer group\n  \n\n10,000 people in group A\n1\n10,000\n  \n\n100,000 people in group B\n1\n100,000\n  \n\n \n \n \nImpartially calculated: 110,000  \n\n\n\nIs equality of welfare so important that Alternative 3 is superior to\nAlternative 1? To take an example of Parfit’s, suppose the only\nway to make everyone equal with respect to sight is to make everyone\ntotally blind. Is such “levelling down” required by\nmorality? Indeed, is it in any way at all morally desirable?\n\nIf we think the answer is No, then we might think that equality of\nwelfare as such is not really an ideal (cf. Temkin 1993). Losses to\nthe better off are justified only where this benefits the worse off.\nWhat we had thought of as pressure in favor of equality of welfare was\ninstead pressure in favor of levelling up. We might say that additions\nto welfare matter more the worse off the person is whose welfare is\naffected. This view has come to be called prioritarianism\n(Parfit 1997; Arneson 1999b). It has tremendous intuitive appeal.\n\nFor a simplistic example of how prioritarianism might work, suppose\nthe welfare of the worst off counts five times as much as the welfare\nof the better off. Then Alternative 1 from the tables above comes out\nat:\n\n \\((1 \\times 5 \\times 10,000) + (10 \\times 100,000)\\),\n\n\nwhich comes to 1,050,000 total units of welfare. Again with the\nwelfare of the worst off counting five times as much, Alternative 2\ncomes out at:\n \n\\((8 \\times 5 \\times 10,000) + (9 \\times 100,000)\\),\n\n\nwhich comes to 1,300,000 total units of welfare. This accords with the\ncommon reaction that Alternative 2 is morally superior to Alternative\n1.\n\nOf course in real examples there is never only one division in\nsociety. Rather there is a scale from the worst off, to the not quite\nso badly off, and so on up to the best off. Prioritarianism is\ncommitted to variable levels of importance of benefitting people at\ndifferent places on this scale: the worse off a person is, the greater\nthe importance attached to that person’s gain.\n\nThis raises two serious worries about prioritarianism. The first\nconcerns prioritarianism’s difficulty in nonarbitrarily\ndetermining how much more importance to give to the welfare of the\nworse off. For example, should a unit of benefit to the worst off\ncount 10 times more than the same size benefit to the best off and 5\ntimes more than the same size benefit to the averagely well off? Or\nshould the multipliers be 20 and 10, or 4 and 2, or other amounts? The\nsecond worry about prioritarianism is whether attaching greater\nimportance to increases in welfare for some than to the same size\nincreases in welfare for others contradicts fundamental impartiality\n(Hooker 2000: 60–2).\n\nThis is not the place to go further into debates between\nprioritarianism and its critics. So the rest of this article sets\naside those debates.\n",
    "section_title": "3. Other Goods To Be Promoted",
    "entry_title": "Rule Consequentialism",
    "hierarchy_title": "Rule Consequentialism || Other Goods To Be Promoted",
    "tokenized_text": [
        "good",
        "promoted",
        "good",
        "promoted",
        "nonutilitarian",
        "member",
        "consequentialist",
        "family",
        "theory",
        "ass",
        "act",
        "andor",
        "character",
        "trait",
        "practice",
        "institution",
        "solely",
        "term",
        "resulting",
        "good",
        "good",
        "restricted",
        "welfare",
        "nonutilitarian",
        "mean",
        "purely",
        "utilitarian",
        "rather",
        "completely",
        "unutilitarian",
        "writer",
        "describe",
        "consequentialists",
        "rather",
        "utilitarian",
        "normally",
        "signalling",
        "fundamental",
        "evaluation",
        "term",
        "welfare",
        "also",
        "good",
        "good",
        "common",
        "answer",
        "justice",
        "fairness",
        "equality",
        "justice",
        "according",
        "plato",
        "rendering",
        "due",
        "republic",
        "bk",
        "might",
        "suppose",
        "people",
        "due",
        "matter",
        "people",
        "owed",
        "either",
        "deserve",
        "moral",
        "right",
        "suppose",
        "plug",
        "idea",
        "consequentialism",
        "get",
        "theory",
        "thing",
        "assessed",
        "term",
        "much",
        "welfare",
        "result",
        "also",
        "extent",
        "people",
        "get",
        "deserve",
        "extent",
        "moral",
        "right",
        "respected",
        "consequentialism",
        "take",
        "line",
        "however",
        "restrict",
        "explanatory",
        "ambition",
        "theory",
        "simply",
        "presupposes",
        "explain",
        "consequentialist",
        "theory",
        "presupposes",
        "justice",
        "constituted",
        "suchandsuch",
        "justice",
        "one",
        "thing",
        "promoted",
        "explain",
        "component",
        "justice",
        "important",
        "explain",
        "desert",
        "explain",
        "importance",
        "moral",
        "right",
        "much",
        "le",
        "try",
        "determine",
        "content",
        "moral",
        "right",
        "matter",
        "important",
        "contentious",
        "consequentialist",
        "theory",
        "leave",
        "unexplained",
        "open",
        "consequentialism",
        "going",
        "refer",
        "justice",
        "desert",
        "moral",
        "right",
        "need",
        "analyze",
        "concept",
        "justify",
        "role",
        "give",
        "similar",
        "thing",
        "said",
        "fairness",
        "consequentialist",
        "theory",
        "presupposes",
        "account",
        "fairness",
        "simply",
        "stipulates",
        "fairness",
        "promoted",
        "consequentialist",
        "theory",
        "explaining",
        "fairness",
        "fairness",
        "like",
        "justice",
        "desert",
        "moral",
        "right",
        "concept",
        "important",
        "consequentialism",
        "try",
        "explain",
        "one",
        "way",
        "consequentialists",
        "deal",
        "justice",
        "fairness",
        "contend",
        "justice",
        "fairness",
        "constituted",
        "conformity",
        "certain",
        "set",
        "justified",
        "social",
        "practice",
        "justifies",
        "practice",
        "generally",
        "promote",
        "overall",
        "welfare",
        "equality",
        "indeed",
        "contention",
        "might",
        "people",
        "due",
        "people",
        "moral",
        "right",
        "justice",
        "fairness",
        "require",
        "conformity",
        "whatever",
        "practice",
        "promote",
        "overall",
        "welfare",
        "equality",
        "whether",
        "equality",
        "need",
        "included",
        "formula",
        "however",
        "controversial",
        "many",
        "think",
        "purely",
        "utilitarian",
        "formula",
        "sufficiently",
        "egalitarian",
        "implication",
        "think",
        "even",
        "goal",
        "promotion",
        "welfare",
        "promotion",
        "welfareplusequality",
        "contingent",
        "pervasive",
        "fact",
        "human",
        "being",
        "push",
        "direction",
        "equal",
        "distribution",
        "material",
        "resource",
        "according",
        "law",
        "diminishing",
        "marginal",
        "utility",
        "material",
        "resource",
        "amount",
        "benefit",
        "person",
        "get",
        "certain",
        "unit",
        "material",
        "resource",
        "le",
        "unit",
        "material",
        "good",
        "person",
        "already",
        "suppose",
        "go",
        "way",
        "getting",
        "around",
        "except",
        "foot",
        "bicycle",
        "though",
        "live",
        "place",
        "one",
        "get",
        "cold",
        "go",
        "warm",
        "coat",
        "one",
        "benefit",
        "getting",
        "first",
        "bicycle",
        "coat",
        "would",
        "go",
        "nine",
        "bicycle",
        "coat",
        "ten",
        "exception",
        "law",
        "diminishing",
        "marginal",
        "utility",
        "exception",
        "additional",
        "unit",
        "material",
        "resource",
        "push",
        "someone",
        "important",
        "threshold",
        "example",
        "consider",
        "meal",
        "pill",
        "gulp",
        "air",
        "save",
        "someone",
        "life",
        "car",
        "whose",
        "acquisition",
        "push",
        "competitive",
        "collector",
        "first",
        "place",
        "case",
        "unit",
        "put",
        "person",
        "threshold",
        "might",
        "well",
        "beneficial",
        "person",
        "prior",
        "unit",
        "still",
        "general",
        "rule",
        "material",
        "resource",
        "diminishing",
        "marginal",
        "utility",
        "assumption",
        "material",
        "resource",
        "diminishing",
        "marginal",
        "utility",
        "let",
        "u",
        "add",
        "assumption",
        "different",
        "people",
        "generally",
        "get",
        "roughly",
        "benefit",
        "material",
        "resource",
        "exception",
        "live",
        "freezing",
        "climate",
        "live",
        "hot",
        "climate",
        "would",
        "benefit",
        "much",
        "warm",
        "coat",
        "would",
        "suppose",
        "live",
        "place",
        "freezing",
        "winter",
        "good",
        "path",
        "riding",
        "bicycle",
        "public",
        "transportation",
        "suppose",
        "ten",
        "bicycle",
        "ten",
        "coat",
        "though",
        "vying",
        "bicycle",
        "coatcollector",
        "prize",
        "meanwhile",
        "poor",
        "none",
        "redistributing",
        "one",
        "bicycle",
        "one",
        "coat",
        "probably",
        "harm",
        "le",
        "benefit",
        "sort",
        "phenomenon",
        "pervades",
        "society",
        "resource",
        "unequally",
        "distributed",
        "wherever",
        "phenomenon",
        "occurs",
        "fundamentally",
        "impartial",
        "morality",
        "pressure",
        "redistribute",
        "resource",
        "richer",
        "poorer",
        "however",
        "also",
        "contingent",
        "pervasive",
        "fact",
        "human",
        "being",
        "pull",
        "favor",
        "practice",
        "foreseen",
        "consequence",
        "material",
        "inequality",
        "first",
        "higher",
        "level",
        "overall",
        "welfare",
        "require",
        "higher",
        "level",
        "productivity",
        "think",
        "welfare",
        "gain",
        "resulting",
        "improvement",
        "agricultural",
        "productivity",
        "many",
        "area",
        "economy",
        "provision",
        "material",
        "reward",
        "greater",
        "productivity",
        "seems",
        "efficient",
        "acceptable",
        "way",
        "eliciting",
        "higher",
        "productivity",
        "individual",
        "group",
        "productive",
        "others",
        "especially",
        "incentive",
        "scheme",
        "practice",
        "providing",
        "material",
        "reward",
        "greater",
        "productivity",
        "result",
        "material",
        "inequality",
        "thus",
        "one",
        "hand",
        "diminishing",
        "marginal",
        "utility",
        "material",
        "resource",
        "exerts",
        "pressure",
        "favor",
        "equal",
        "distribution",
        "resource",
        "hand",
        "need",
        "promote",
        "productivity",
        "exerts",
        "pressure",
        "favor",
        "incentive",
        "scheme",
        "foreseen",
        "consequence",
        "material",
        "inequality",
        "utilitarian",
        "consequentialists",
        "find",
        "balancing",
        "opposed",
        "pressure",
        "note",
        "pressure",
        "concern",
        "distribution",
        "resource",
        "question",
        "equally",
        "welfare",
        "distributed",
        "many",
        "recent",
        "writer",
        "taken",
        "utilitarianism",
        "indifferent",
        "distribution",
        "welfare",
        "imagine",
        "choice",
        "outcome",
        "overall",
        "welfare",
        "large",
        "distributed",
        "unequally",
        "outcome",
        "overall",
        "welfare",
        "smaller",
        "distributed",
        "equally",
        "utilitarian",
        "taken",
        "favor",
        "outcome",
        "greater",
        "overall",
        "welfare",
        "even",
        "also",
        "le",
        "equally",
        "distributed",
        "illustrate",
        "let",
        "u",
        "take",
        "artificially",
        "simple",
        "population",
        "divided",
        "two",
        "group",
        "unit",
        "welfare",
        "total",
        "welfare",
        "group",
        "alternative",
        "per",
        "person",
        "per",
        "group",
        "people",
        "group",
        "people",
        "group",
        "b",
        "impartially",
        "calculated",
        "unit",
        "welfare",
        "total",
        "welfare",
        "group",
        "alternative",
        "per",
        "person",
        "per",
        "group",
        "people",
        "group",
        "people",
        "group",
        "b",
        "impartially",
        "calculated",
        "many",
        "people",
        "would",
        "think",
        "alternative",
        "better",
        "alternative",
        "might",
        "think",
        "comparison",
        "alternative",
        "show",
        "always",
        "pressure",
        "favor",
        "greater",
        "equality",
        "welfare",
        "derek",
        "parfit",
        "particular",
        "argued",
        "however",
        "must",
        "hasty",
        "consider",
        "following",
        "choice",
        "unit",
        "welfare",
        "total",
        "welfare",
        "group",
        "alternative",
        "per",
        "person",
        "per",
        "group",
        "people",
        "group",
        "people",
        "group",
        "b",
        "impartially",
        "calculated",
        "unit",
        "welfare",
        "total",
        "welfare",
        "group",
        "alternative",
        "per",
        "person",
        "per",
        "group",
        "people",
        "group",
        "people",
        "group",
        "b",
        "impartially",
        "calculated",
        "equality",
        "welfare",
        "important",
        "alternative",
        "superior",
        "alternative",
        "take",
        "example",
        "parfit",
        "suppose",
        "way",
        "make",
        "everyone",
        "equal",
        "respect",
        "sight",
        "make",
        "everyone",
        "totally",
        "blind",
        "levelling",
        "required",
        "morality",
        "indeed",
        "way",
        "morally",
        "desirable",
        "think",
        "answer",
        "might",
        "think",
        "equality",
        "welfare",
        "really",
        "ideal",
        "cf",
        "temkin",
        "loss",
        "better",
        "justified",
        "benefit",
        "worse",
        "thought",
        "pressure",
        "favor",
        "equality",
        "welfare",
        "instead",
        "pressure",
        "favor",
        "levelling",
        "might",
        "say",
        "addition",
        "welfare",
        "matter",
        "worse",
        "person",
        "whose",
        "welfare",
        "affected",
        "view",
        "come",
        "called",
        "prioritarianism",
        "parfit",
        "arneson",
        "b",
        "tremendous",
        "intuitive",
        "appeal",
        "simplistic",
        "example",
        "prioritarianism",
        "might",
        "work",
        "suppose",
        "welfare",
        "worst",
        "count",
        "five",
        "time",
        "much",
        "welfare",
        "better",
        "alternative",
        "table",
        "come",
        "times",
        "times",
        "times",
        "come",
        "total",
        "unit",
        "welfare",
        "welfare",
        "worst",
        "counting",
        "five",
        "time",
        "much",
        "alternative",
        "come",
        "times",
        "times",
        "times",
        "come",
        "total",
        "unit",
        "welfare",
        "accord",
        "common",
        "reaction",
        "alternative",
        "morally",
        "superior",
        "alternative",
        "course",
        "real",
        "example",
        "never",
        "one",
        "division",
        "society",
        "rather",
        "scale",
        "worst",
        "quite",
        "badly",
        "best",
        "prioritarianism",
        "committed",
        "variable",
        "level",
        "importance",
        "benefitting",
        "people",
        "different",
        "place",
        "scale",
        "worse",
        "person",
        "greater",
        "importance",
        "attached",
        "person",
        "gain",
        "raise",
        "two",
        "serious",
        "worry",
        "prioritarianism",
        "first",
        "concern",
        "prioritarianism",
        "difficulty",
        "nonarbitrarily",
        "determining",
        "much",
        "importance",
        "give",
        "welfare",
        "worse",
        "example",
        "unit",
        "benefit",
        "worst",
        "count",
        "time",
        "size",
        "benefit",
        "best",
        "time",
        "size",
        "benefit",
        "averagely",
        "well",
        "multiplier",
        "amount",
        "second",
        "worry",
        "prioritarianism",
        "whether",
        "attaching",
        "greater",
        "importance",
        "increase",
        "welfare",
        "size",
        "increase",
        "welfare",
        "others",
        "contradicts",
        "fundamental",
        "impartiality",
        "hooker",
        "place",
        "go",
        "debate",
        "prioritarianism",
        "critic",
        "rest",
        "article",
        "set",
        "aside",
        "debate"
    ]
}