{
    "main_text": "Consequentializing Commonsense Deontic Verdicts\n2. Consequentializing Commonsense Deontic Verdicts\n\nAs we’ve seen, one of the main motivations for\nconsequentializing certain commonsense deontic verdicts is to\nreconcile utilitarianism’s putatively compelling\nact-consequentialism with common moral opinion. This section considers\nthe various kinds of deontic verdicts that consequentializers have\nsought to accommodate and the sorts of moves they have historically\nmade to do so.\n\nInterestingly, consequentializing seems to go nearly as far back as\nact-consequentialism itself (see Hurley 2020: 27). Indeed, it goes at\nleast as far back as John Stuart Mill’s development of\nqualitative hedonism in response to the objection that (Benthamite)\nutilitarianism is, given its commitment to quantitative hedonism,\n“a doctrine worthy only of swine”. Mill argued that there\nare certain kinds of pleasures (e.g., intellectual pleasures) that\nhuman beings, but not swine, are capable of and that these\n“higher” pleasures are qualitatively different than the\n“lower”, bodily pleasures of which both swine and human\nbeings are capable—so much so that no quantity of these lower\npleasures could ever be as good as a sufficient quantity of higher\npleasures (1861 [1991: 14–17]).\n\nG. E. Moore (1903) went even further, arguing\n\nthat pleasure isn’t the only intrinsic good,\nthat not all goods are good for someone, and\nthat the goodness of a whole needn’t equal the sum of the\ngoodness of its parts taken individually.\n\n\nAnd this wholesale rejection of hedonism was, as W. D. Ross pointed\nout, a significant development, allowing the act-consequentialist to\naccount for the fact\n\n\nthat pleasure is not the only thing in life that we think good in\nitself, that for instance we think the possession of a good character,\nor an intelligent understanding of the world, as good or better. (1930\n[2002: 17])\n\n\nThis move to reject hedonism can take the consequentializer even\nfurther when it’s combined with the rejection of\nutilitarians’ narrow conception of an act’s outcome.\nUtilitarians tend to think of an act’s outcome as consisting\nsolely in what’s causally downstream from the act. For they hold\nthat hedonic utility is all that matters and that things that are not\ncausally downstream from the act—things such as whether the act\nis an instance of keeping a promise, whether the agent’s motive\nin performing it was virtuous, and whether there’s a victim of\nsome past injustice who would be compensated by it—don’t\nthemselves affect how much hedonic utility it produces. But\nthere’s no reason why the act-consequentialist can’t be\nconcerned with more than just the causal consequences of an act. And,\nso, it’s now standard to construe the outcome of an act broadly\nto include everything that would be the case if it were performed. (Of\ncourse, if it’s indeterminate what would be the case if it were\nperformed, we would need to switch from talking about the act’s\noutcome to talking about its prospect, which is a\nprobability distribution consisting of all its possible outcomes and\ntheir associated probabilities. But I’ll ignore this\ncomplication in what remains.)\n\nOnce the act-consequentialist both rejects hedonism and construes an\nact’s outcome broadly, they can hold that certain types of\nactions are intrinsically bad—that, for instance,\n“breaking a promise is intrinsically bad” (Ewing 1948:\n187). The consequentializer can, then, insist that whatever features\nof actions that the target non-consequentialist theory takes to be\nintrinsically wrong-making are instead features of outcomes that make\nthem rank poorly—the idea being that what’s most salient\nis not whether an act has the property of being a promise-breaking but\nwhether its outcome has the property of being one in which this\npromise-breaking occurs. The consequentializer can thereby accommodate\nour intuition that breaking a promise is wrong even if breaking it\nwould produce just as much hedonic utility as keeping it. It’s\nwrong because outcomes in which promises are broken are, other things\nbeing equal, worse than those in which they are kept.\n\nBut although these moves are significant, they are insufficient to\nallow the consequentializer to accommodate other commonsense\nintuitions. For commonsense holds that breaking a promise is wrong\neven if breaking it would produce just as much good as keeping it\n(Ross 1930 [2002: 18]), and the overall goodness of breaking a promise\nmust take into account whatever intrinsic badness there is in the act\nitself. For instance, commonsense holds that it would be wrong, other\nthings being equal, for Abe to break his promise even to prevent Bert\nand Carl from breaking their promises. Yet, clearly, it must, other\nthings being equal, be better for Abe to break his promise than for\nBert and Carl to break theirs. For even if promise-breakings are\nintrinsically bad, two promise-breakings would have to be worse than\njust one, other things being equal.\n\nTo accommodate such commonsense intuitions, consequentializers have\ntypically appealed to an evaluator-relative ranking of outcomes, one\nwhere the agent’s ranking differs from that of, say, some\nbystander (see, e.g., Sen 1983—but see Dougherty 2013 and Setiya\n2018 for an approach that doesn’t appeal to evaluator\nrelativism). Whereas the bystander has no good reason to prefer\nAbe’s breaking his promise to two others’ breaking theirs,\nAbe has a good reason to prefer two others’ breaking their\npromises to his breaking his promise in that Abe has a special\nresponsibility for his own promises, a responsibility that he\ndoesn’t have for ensuring that the others keep theirs. Thus,\ngiven an agent’s special responsibility for their own agency,\nAbe should rank the outcome in which he keeps his promise and two\nothers break theirs above the outcome in which he breaks his promise\nand two others keep theirs. And, so, the act-consequentialist can\naccommodate the intuition that breaking a promise is wrong even if\nbreaking it would produce just as much good as (or even more good\nthan) keeping it.\n\nNow, commonsense morality differs from utilitarianism not only in\ntaking there to be restrictions on performing certain types of\naction—such as promise-breakings—even for the sake of\nbringing about the overall best outcome (i.e., agent-centered\nrestrictions), but also in taking there to be options either to\nbring about the overall best outcome or to refrain from doing so\n(i.e., agent-centered options). To accommodate the latter,\nconsequentializers have typically appealed to a dual ranking of\noutcomes (see Sider 1993 and Portmore 2011). To illustrate, recall\nself/other utilitarianism and imagine that you must choose between (a)\ngiving your last aspirin to some stranger, alleviating their\nmild headache, or (b) taking it yourself, alleviating your\nsevere headache. Assuming that everything else is equal,\nutilitarianism requires you to take the aspirin yourself, as this will\nbring about the overall best outcome: the one with less overall pain.\nBut, intuitively, you are also permitted to give it to the stranger.\nSelf/other utilitarianism accommodates this intuition by holding that\nthe permissibility of actions depends on two different rankings of\ntheir outcomes: one that ranks them in terms of how good they are\noverall and another that ranks them in terms of how good they are for\neveryone but the agent. More specifically, self/other utilitarianism\nholds that an act is permissible if and only if there is no available\nalternative whose outcome outranks its outcome on both of these two\nrankings. And since taking the aspirin yourself outranks giving it to\nthe stranger in terms of what’s best overall but giving it to\nthe stranger outranks taking it yourself in terms of what’s best\nfor others, both are permissible.\n\nUnfortunately, however, self/other utilitarianism accommodates only\none of two types of agent-centered options: namely,\nagent-sacrificing options. Agent-sacrificing options are\noptions to either maximize the overall good or sacrifice your own\ngreater interests (and the overall good) for the sake of doing more to\npromote the lesser interests of others. But just as important are\nagent-favoring options. Agent-favoring options are options to\neither maximize the overall good or favor promoting your own interests\nover promoting the overall good. To illustrate, suppose that you\nlegally and justifiably possess two tablets of an opioid drug. Now,\ngiven your built-up tolerance to this drug, you would need to take\nboth tablets to alleviate your moderate pain. But there are two\nstrangers who are also in moderate pain, and they would each need only\none tablet to alleviate their pain, for they have no built-up\ntolerance to this drug. Thus, you can either take both tablets\nyourself or give the two strangers one tablet each. And the latter\nwould be better overall, as it would alleviate twice as much pain.\nNevertheless, it seems that you are permitted to do either, which is\nan intuitive verdict that self/other utilitarianism cannot\naccommodate.\n\nBut, as consequentializers have shown, other act-consequentialist\ntheories can. One is Schefflerian utilitarianism (see\nPortmore 2011: 93–7). It holds that an act is permissible if and\nonly if there is no available alternative whose outcome outranks its\noutcome both in terms of utility for others (other than the agent,\nthat is) and in terms of egoistically-adjusted utility, where\negoistically-adjusted utility includes everyone’s utility but\nadjusts the overall total by giving the agent’s utility ten\ntimes the weight of each other’s. Schefflerian utilitarianism\nimplies that you are permitted to either take the two tablets yourself\n(as this would produce the most egoistically-adjusted utility) or give\nthe two strangers one tablet each (as this would produce the most\nutility for others). What’s more, Schefflerian utilitarianism\nallows that in the previous case you can either take the aspirin to\nalleviate your own severe headache (as this would produce the most\negoistically-adjusted utility) or give it to the stranger to alleviate\ntheir mild headache (as this would produce the most utility for\nothers). Thus, Schefflerian utilitarianism is an act-consequentialist\ntheory that accommodates both agent-favoring options and\nagent-sacrificing options. Still, it is a rather simplistic theory,\nand one that seems both arbitrary in setting the egoistic multiplier\nat ten and ad hoc in its appeal to a dual ranking of outcomes\nsolely as a means to avoiding counterintuitive implications. But\nconsequentializers have tried to come up with ever more sophisticated\nconsequentialist theories that seek to address these issues—see,\ne.g., Portmore 2011: chaps. 5–6.\n\nThere are, of course, other commonsense deontic verdicts that\nconsequentializers may wish to accommodate as well as other moves they\nmay need to take to do so. But the above should serve as a brief\nhistory of some of the significant moves that consequentializers have\nmade.\n",
    "section_title": "2. Consequentializing Commonsense Deontic Verdicts",
    "entry_title": "Consequentializing",
    "hierarchy_title": "Consequentializing || Consequentializing Commonsense Deontic Verdicts",
    "tokenized_text": [
        "consequentializing",
        "commonsense",
        "deontic",
        "verdict",
        "consequentializing",
        "commonsense",
        "deontic",
        "verdict",
        "seen",
        "one",
        "main",
        "motivation",
        "consequentializing",
        "certain",
        "commonsense",
        "deontic",
        "verdict",
        "reconcile",
        "utilitarianism",
        "putatively",
        "compelling",
        "actconsequentialism",
        "common",
        "moral",
        "opinion",
        "section",
        "considers",
        "various",
        "kind",
        "deontic",
        "verdict",
        "consequentializers",
        "sought",
        "accommodate",
        "sort",
        "move",
        "historically",
        "made",
        "interestingly",
        "consequentializing",
        "seems",
        "go",
        "nearly",
        "far",
        "back",
        "actconsequentialism",
        "see",
        "hurley",
        "indeed",
        "go",
        "least",
        "far",
        "back",
        "john",
        "stuart",
        "mill",
        "development",
        "qualitative",
        "hedonism",
        "response",
        "objection",
        "benthamite",
        "utilitarianism",
        "given",
        "commitment",
        "quantitative",
        "hedonism",
        "doctrine",
        "worthy",
        "swine",
        "mill",
        "argued",
        "certain",
        "kind",
        "pleasure",
        "eg",
        "intellectual",
        "pleasure",
        "human",
        "being",
        "swine",
        "capable",
        "higher",
        "pleasure",
        "qualitatively",
        "different",
        "lower",
        "bodily",
        "pleasure",
        "swine",
        "human",
        "being",
        "capableso",
        "much",
        "quantity",
        "lower",
        "pleasure",
        "could",
        "ever",
        "good",
        "sufficient",
        "quantity",
        "higher",
        "pleasure",
        "g",
        "e",
        "moore",
        "went",
        "even",
        "arguing",
        "pleasure",
        "intrinsic",
        "good",
        "good",
        "good",
        "someone",
        "goodness",
        "whole",
        "equal",
        "sum",
        "goodness",
        "part",
        "taken",
        "individually",
        "wholesale",
        "rejection",
        "hedonism",
        "w",
        "d",
        "ross",
        "pointed",
        "significant",
        "development",
        "allowing",
        "actconsequentialist",
        "account",
        "fact",
        "pleasure",
        "thing",
        "life",
        "think",
        "good",
        "instance",
        "think",
        "possession",
        "good",
        "character",
        "intelligent",
        "understanding",
        "world",
        "good",
        "better",
        "move",
        "reject",
        "hedonism",
        "take",
        "consequentializer",
        "even",
        "combined",
        "rejection",
        "utilitarian",
        "narrow",
        "conception",
        "act",
        "outcome",
        "utilitarian",
        "tend",
        "think",
        "act",
        "outcome",
        "consisting",
        "solely",
        "causally",
        "downstream",
        "act",
        "hold",
        "hedonic",
        "utility",
        "matter",
        "thing",
        "causally",
        "downstream",
        "actthings",
        "whether",
        "act",
        "instance",
        "keeping",
        "promise",
        "whether",
        "agent",
        "motive",
        "performing",
        "virtuous",
        "whether",
        "victim",
        "past",
        "injustice",
        "would",
        "compensated",
        "itdon",
        "affect",
        "much",
        "hedonic",
        "utility",
        "produce",
        "reason",
        "actconsequentialist",
        "concerned",
        "causal",
        "consequence",
        "act",
        "standard",
        "construe",
        "outcome",
        "act",
        "broadly",
        "include",
        "everything",
        "would",
        "case",
        "performed",
        "course",
        "indeterminate",
        "would",
        "case",
        "performed",
        "would",
        "need",
        "switch",
        "talking",
        "act",
        "outcome",
        "talking",
        "prospect",
        "probability",
        "distribution",
        "consisting",
        "possible",
        "outcome",
        "associated",
        "probability",
        "ignore",
        "complication",
        "remains",
        "actconsequentialist",
        "reject",
        "hedonism",
        "construes",
        "act",
        "outcome",
        "broadly",
        "hold",
        "certain",
        "type",
        "action",
        "intrinsically",
        "badthat",
        "instance",
        "breaking",
        "promise",
        "intrinsically",
        "bad",
        "ewing",
        "consequentializer",
        "insist",
        "whatever",
        "feature",
        "action",
        "target",
        "nonconsequentialist",
        "theory",
        "take",
        "intrinsically",
        "wrongmaking",
        "instead",
        "feature",
        "outcome",
        "make",
        "rank",
        "poorlythe",
        "idea",
        "salient",
        "whether",
        "act",
        "property",
        "promisebreaking",
        "whether",
        "outcome",
        "property",
        "one",
        "promisebreaking",
        "occurs",
        "consequentializer",
        "thereby",
        "accommodate",
        "intuition",
        "breaking",
        "promise",
        "wrong",
        "even",
        "breaking",
        "would",
        "produce",
        "much",
        "hedonic",
        "utility",
        "keeping",
        "wrong",
        "outcome",
        "promise",
        "broken",
        "thing",
        "equal",
        "worse",
        "kept",
        "although",
        "move",
        "significant",
        "insufficient",
        "allow",
        "consequentializer",
        "accommodate",
        "commonsense",
        "intuition",
        "commonsense",
        "hold",
        "breaking",
        "promise",
        "wrong",
        "even",
        "breaking",
        "would",
        "produce",
        "much",
        "good",
        "keeping",
        "ross",
        "overall",
        "goodness",
        "breaking",
        "promise",
        "must",
        "take",
        "account",
        "whatever",
        "intrinsic",
        "badness",
        "act",
        "instance",
        "commonsense",
        "hold",
        "would",
        "wrong",
        "thing",
        "equal",
        "abe",
        "break",
        "promise",
        "even",
        "prevent",
        "bert",
        "carl",
        "breaking",
        "promise",
        "yet",
        "clearly",
        "must",
        "thing",
        "equal",
        "better",
        "abe",
        "break",
        "promise",
        "bert",
        "carl",
        "break",
        "even",
        "promisebreakings",
        "intrinsically",
        "bad",
        "two",
        "promisebreakings",
        "would",
        "worse",
        "one",
        "thing",
        "equal",
        "accommodate",
        "commonsense",
        "intuition",
        "consequentializers",
        "typically",
        "appealed",
        "evaluatorrelative",
        "ranking",
        "outcome",
        "one",
        "agent",
        "ranking",
        "differs",
        "say",
        "bystander",
        "see",
        "eg",
        "sen",
        "but",
        "see",
        "dougherty",
        "setiya",
        "approach",
        "appeal",
        "evaluator",
        "relativism",
        "whereas",
        "bystander",
        "good",
        "reason",
        "prefer",
        "abe",
        "breaking",
        "promise",
        "two",
        "others",
        "breaking",
        "abe",
        "good",
        "reason",
        "prefer",
        "two",
        "others",
        "breaking",
        "promise",
        "breaking",
        "promise",
        "abe",
        "special",
        "responsibility",
        "promise",
        "responsibility",
        "ensuring",
        "others",
        "keep",
        "thus",
        "given",
        "agent",
        "special",
        "responsibility",
        "agency",
        "abe",
        "rank",
        "outcome",
        "keep",
        "promise",
        "two",
        "others",
        "break",
        "outcome",
        "break",
        "promise",
        "two",
        "others",
        "keep",
        "actconsequentialist",
        "accommodate",
        "intuition",
        "breaking",
        "promise",
        "wrong",
        "even",
        "breaking",
        "would",
        "produce",
        "much",
        "good",
        "even",
        "good",
        "keeping",
        "commonsense",
        "morality",
        "differs",
        "utilitarianism",
        "taking",
        "restriction",
        "performing",
        "certain",
        "type",
        "actionsuch",
        "promisebreakingseven",
        "sake",
        "bringing",
        "overall",
        "best",
        "outcome",
        "ie",
        "agentcentered",
        "restriction",
        "also",
        "taking",
        "option",
        "either",
        "bring",
        "overall",
        "best",
        "outcome",
        "refrain",
        "ie",
        "agentcentered",
        "option",
        "accommodate",
        "latter",
        "consequentializers",
        "typically",
        "appealed",
        "dual",
        "ranking",
        "outcome",
        "see",
        "sider",
        "portmore",
        "illustrate",
        "recall",
        "selfother",
        "utilitarianism",
        "imagine",
        "must",
        "choose",
        "giving",
        "last",
        "aspirin",
        "stranger",
        "alleviating",
        "mild",
        "headache",
        "b",
        "taking",
        "alleviating",
        "severe",
        "headache",
        "assuming",
        "everything",
        "else",
        "equal",
        "utilitarianism",
        "requires",
        "take",
        "aspirin",
        "bring",
        "overall",
        "best",
        "outcome",
        "one",
        "le",
        "overall",
        "pain",
        "intuitively",
        "also",
        "permitted",
        "give",
        "stranger",
        "selfother",
        "utilitarianism",
        "accommodates",
        "intuition",
        "holding",
        "permissibility",
        "action",
        "depends",
        "two",
        "different",
        "ranking",
        "outcome",
        "one",
        "rank",
        "term",
        "good",
        "overall",
        "another",
        "rank",
        "term",
        "good",
        "everyone",
        "agent",
        "specifically",
        "selfother",
        "utilitarianism",
        "hold",
        "act",
        "permissible",
        "available",
        "alternative",
        "whose",
        "outcome",
        "outranks",
        "outcome",
        "two",
        "ranking",
        "since",
        "taking",
        "aspirin",
        "outranks",
        "giving",
        "stranger",
        "term",
        "best",
        "overall",
        "giving",
        "stranger",
        "outranks",
        "taking",
        "term",
        "best",
        "others",
        "permissible",
        "unfortunately",
        "however",
        "selfother",
        "utilitarianism",
        "accommodates",
        "one",
        "two",
        "type",
        "agentcentered",
        "option",
        "namely",
        "agentsacrificing",
        "option",
        "agentsacrificing",
        "option",
        "option",
        "either",
        "maximize",
        "overall",
        "good",
        "sacrifice",
        "greater",
        "interest",
        "overall",
        "good",
        "sake",
        "promote",
        "lesser",
        "interest",
        "others",
        "important",
        "agentfavoring",
        "option",
        "agentfavoring",
        "option",
        "option",
        "either",
        "maximize",
        "overall",
        "good",
        "favor",
        "promoting",
        "interest",
        "promoting",
        "overall",
        "good",
        "illustrate",
        "suppose",
        "legally",
        "justifiably",
        "posse",
        "two",
        "tablet",
        "opioid",
        "drug",
        "given",
        "builtup",
        "tolerance",
        "drug",
        "would",
        "need",
        "take",
        "tablet",
        "alleviate",
        "moderate",
        "pain",
        "two",
        "stranger",
        "also",
        "moderate",
        "pain",
        "would",
        "need",
        "one",
        "tablet",
        "alleviate",
        "pain",
        "builtup",
        "tolerance",
        "drug",
        "thus",
        "either",
        "take",
        "tablet",
        "give",
        "two",
        "stranger",
        "one",
        "tablet",
        "latter",
        "would",
        "better",
        "overall",
        "would",
        "alleviate",
        "twice",
        "much",
        "pain",
        "nevertheless",
        "seems",
        "permitted",
        "either",
        "intuitive",
        "verdict",
        "selfother",
        "utilitarianism",
        "accommodate",
        "consequentializers",
        "shown",
        "actconsequentialist",
        "theory",
        "one",
        "schefflerian",
        "utilitarianism",
        "see",
        "portmore",
        "hold",
        "act",
        "permissible",
        "available",
        "alternative",
        "whose",
        "outcome",
        "outranks",
        "outcome",
        "term",
        "utility",
        "others",
        "agent",
        "term",
        "egoisticallyadjusted",
        "utility",
        "egoisticallyadjusted",
        "utility",
        "includes",
        "everyone",
        "utility",
        "adjusts",
        "overall",
        "total",
        "giving",
        "agent",
        "utility",
        "ten",
        "time",
        "weight",
        "schefflerian",
        "utilitarianism",
        "implies",
        "permitted",
        "either",
        "take",
        "two",
        "tablet",
        "would",
        "produce",
        "egoisticallyadjusted",
        "utility",
        "give",
        "two",
        "stranger",
        "one",
        "tablet",
        "would",
        "produce",
        "utility",
        "others",
        "schefflerian",
        "utilitarianism",
        "allows",
        "previous",
        "case",
        "either",
        "take",
        "aspirin",
        "alleviate",
        "severe",
        "headache",
        "would",
        "produce",
        "egoisticallyadjusted",
        "utility",
        "give",
        "stranger",
        "alleviate",
        "mild",
        "headache",
        "would",
        "produce",
        "utility",
        "others",
        "thus",
        "schefflerian",
        "utilitarianism",
        "actconsequentialist",
        "theory",
        "accommodates",
        "agentfavoring",
        "option",
        "agentsacrificing",
        "option",
        "still",
        "rather",
        "simplistic",
        "theory",
        "one",
        "seems",
        "arbitrary",
        "setting",
        "egoistic",
        "multiplier",
        "ten",
        "ad",
        "hoc",
        "appeal",
        "dual",
        "ranking",
        "outcome",
        "solely",
        "mean",
        "avoiding",
        "counterintuitive",
        "implication",
        "consequentializers",
        "tried",
        "come",
        "ever",
        "sophisticated",
        "consequentialist",
        "theory",
        "seek",
        "address",
        "issuessee",
        "eg",
        "portmore",
        "chap",
        "course",
        "commonsense",
        "deontic",
        "verdict",
        "consequentializers",
        "may",
        "wish",
        "accommodate",
        "well",
        "move",
        "may",
        "need",
        "take",
        "serve",
        "brief",
        "history",
        "significant",
        "move",
        "consequentializers",
        "made"
    ]
}