{
    "main_text": "Historical Background\n3. Historical Background\n Questions about animal consciousness in the Western tradition have\ntheir roots in ancient discussions about the nature of human beings,\nas filtered through the “modern” philosophy of\nDescartes. It would be anachronistic to read ideas about\nconsciousness from today back into the ancient literature. Nevertheless, because\nconsciousness is sometimes thought to be a uniquely human mental\nphenomenon, it is important to understand the origins of the idea that\nhumans are qualitatively (and “qualia-tatively”) different\nfrom animals.\n\n\nAristotle asserted that only humans had rational souls, while the\nlocomotive souls shared by all animals, human and nonhuman, endowed\nanimals with instincts suited to their successful reproduction and\nsurvival. Sorabji (1993) argues that the denial of reason to animals\ncreated a crisis for Greek thought, requiring a “wholesale\nreanalysis” (p. 7) of the nature of mental capacities, and a\nrevision in thinking about “man and his place in nature above\nthe animals” (ibid.). The argument about what is reasoning, and\nwhether animals display it, remains with us 25 centuries later, as\nevidenced by the volume Rational Animals? (Hurley & Nudds\n2006). The Great Chain of Being derived from early Christian\ninterpretation of Aristotle’s scale of nature (Lovejoy 1936) provides\nanother Aristotelian influence on the debate about animal minds.\n Two millennia after Aristotle, Descartes’ mechanistic philosophy\nintroduced the idea of a reflex to explain the behavior of nonhuman\nanimals.  Although his conception of animals treated them as\nreflex-driven machines, with no intellectual capacities, it is\nimportant to recognize that he took mechanistic explanation to be\nperfectly adequate for explaining sensation and perception —\naspects of animal behavior that are nowadays often associated with\nconsciousness. He drew the line only at rational thought and\nunderstanding. Given the Aristotelian division between instinct and\nreason and the Cartesian distinction between mechanical reflex and\nrational thought, it’s tempting to map the one distinction onto the\nother. Nevertheless, it may be\na mistake to assimilate the two. First, a number of authors before and\nafter Darwin have believed that conscious experience can accompany\ninstinctive and reflexive actions. Second, the dependence of\nphenomenal consciousness on rational, self-reflective thought is a\nparticularly strong and contentious claim (although it has current\ndefenders, discussed below).\n Although the roots of careful observation and experimentation of\nthe natural world go back to ancient times, study of animal behavior\nremained largely anecdotal until long after the scientific\nrevolution. Animals were, of course, widely used in pursuit of answers\nto anatomical, physiological, and embryological questions. Vivisection\nwas carried out by such ancient luminaries as Galen and there was a\nresurgence of the practice in early modern times (Bertoloni Meli\n2012). Descartes himself practiced and advocated vivisection\n(Descartes, Letter to Plempius, Feb 15 1638), and wrote in\ncorrespondence that the mechanical understanding of animals absolved\npeople of any guilt for killing and eating animals. Mechanists who\nfollowed him (e.g. Malebranche) used Descartes’ denial of reason and a\nsoul to animals as a rationale for their belief that animals were\nincapable of suffering or emotion, and did not deserve moral\nconsideration — justifying vivisection and other brutal\ntreatment (see Olson 1990, p. 39–40, for support of this claim). The\nidea that animal behavior is purely reflexive may also have served to\ndiminish interest in treating behavior as a target of careful study in\nits own right.\n A few glimmers of experimental approaches to animal behavior can\nbe seen in the late 18th century (e.g., Barrington 1773; White 1789),\nand soon thereafter Frédéric Cuvier worked from 1804\nuntil his death in 1838 on the development of sexual and social\nbehavior in captive mammals. By the mid 19th century Alfred Russel\nWallace (1867) was arguing explicitly for an experimental approach to\nanimal behavior, and Douglas Spalding’s (1872) experiments on\ninstinctual feeding behaviors in chicks were seminal. Still, the\nemergence of experimental approaches had very little to say about\nconsciousness per se, though Spalding’s work can be seen as a\ncontribution to the discussion about instinct and reason.\n\n\nIn the same vein of instinct vs. reason, Darwin in the Origin of\nSpecies wrote, “It is a significant fact, that the more the\nhabits of any particular animal are studied by a naturalist, the more\nhe attributes to reason, and the less to unlearnt instinct”\n(1871, Book I, p.46). He devoted considerable attention in both the\nOrigin and in the Descent of Man to animal behavior,\nwith the obvious goal of demonstrating mental continuity among the\nspecies. To make his case, Darwin relied heavily on anecdotes provided\nby his correspondents — a project infamously pursued after\nDarwin’s death by his protégé George Romanes\n(1882). Darwin also carried out experiments and was a keen observer,\nhowever. In his final work he describes experiments on the flexibility\nof earthworm behavior in manipulating leaves, which he took to show\nconsiderable intelligence (Darwin 1881; see also Crist 2002).\n The idea of behavioral flexibility is central to discussions of\nanimal mind and consciousness. Descartes’ conception of animals as\nautomata seems to make phenomenal consciousness superfluous at best\n— a connection whose philosophical development was traced by\nT.H. Huxley (1874).  Huxley reported a series of experiments on a\nfrog, showing very similar reflexive behavior even when its spinal\ncord had been severed, or large portions of its brain removed. He\nargued that without a brain, the frog could not be conscious, but\nsince it could still do the same sort of things that it could do\nbefore, there is no need to assume consciousness even in the presence\nof the entire brain, going on to argue that consciousness is\nsuperfluous. (The argument is somewhat curious since it seems to show\ntoo much by making the brain itself superfluous to the frog’s\nbehavior!)\n\n\nStill, for those (including Huxley) who became quickly convinced of\nthe correctness of Darwin’s theory of evolution, understanding and\ndefending mental continuity between humans and animals loomed\nlarge. In his Principles of Psychology (1890), William James\npromoted the idea of differing intensities of conscious experience\nacross the animal kingdom, an idea that was echoed by the leading\nBritish psychologist of his day, Conwy Lloyd Morgan in his 1894\ntextbook An Introduction to Comparative Psychology. Morgan\nhad been very skeptical and critical of the anecdotal approach favored\nby Darwin and Romanes, but he came around to the Darwinian point of\nview about mental continuity if not about methodology.  To address the\nmethodological deficit he introduced his “double\ninductive” method for understanding the mental states of animals\n(Morgan 1894). The double induction consisted of inductive inferences\nbased on observation of animal behavior combined with introspective\nknowledge of our own minds. At the same time, to counteract the\nanthropomorphic bias in the double inductive method, Lloyd Morgan\nintroduced a principle now known as Morgan’s canon: “in no case\nmay we interpret an action as the outcome of the exercise of a higher\npsychical faculty, if it can be interpreted as the outcome of the\nexercise of one which stands lower in the psychological scale”\n(Lloyd Morgan 1894, p.53).\n\n\nLloyd Morgan’s Double Induction Method from his 1894 textbook\n\n Even though the double inductive method is now mainly of\nhistorical interest, Morgan’s canon lives on.  Questions about quite\nwhat the canon means and how to justify it are active topics of\nhistorical and philosophical investigation (e.g., Burghardt 1985;\nSober 1998, 2005, 2012; Radick 2000; Thomas 2001 (Other Internet\nResources), Fitzpatrick 2008). The questions include what Lloyd Morgan\nmeans by ‘higher’ and ‘lower’, to what extent\nthe principle can or should be justified by evolutionary\nconsiderations, and whether the canon collapses to a principle of\nparsimony, a version of Ockham’s razor, or some general principles of\nempirical justification. Despite current uncertainty about what it\nreally means, Morgan’s canon, interpreted (or, perhaps,\nmisinterpreted; Thomas 2001, Other Internet Resources) as a strong\nparsimony principle, served a central rhetorical role for\nbehavioristic psychologists, who sought to eliminate any hint of\nCartesian dualism from comparative psychology.\n Behaviorism dominated American psychology in the early part of the\n20th century, beginning with Thorndike’s (1911) experiments on animals\nlearning by trial and error to escape from the “puzzle\nboxes” that he had constructed. But even Thorndike’s famous\n“law of effect” refers to the animal’s “satisfaction\nor discomfort” (1911, p.244). It was with the radical\nanti-mentalism of John B. Watson (1928) and B.F. Skinner (1953), both\nof whom strongly rejected any attempts to explain animal behavior in\nterms of unobservable mental states, that American psychology became\nthe science of behavior rather than, as the dictionary would have it,\nthe science of mind and behavior. \n At the same time, things were progressing rather differently in\nEurope, where ethological approaches to animal behavior were more\ndominant.  Ethology is part natural history with an emphasis on\nfieldwork and part experimental science conducted on captive animals,\nreflecting the different styles of its two seminal figures, Konrad\nLorenz and Niko Tinbergen (see Burkhardt 2005). Initially,\n“innate” behaviors were the central focus of Lorenz’s\nwork. According to Lorenz, it is the investigation of innate behaviors\nin related species that puts the study of animal behavior on a par\nwith other branches of evolutionary biology, and he demonstrated that\nit was possible to derive the phylogenetic relations among species by\ncomparing their instinctive behavioral repertoires (Lorenz 1971a). In\npursuing this direction, Lorenz and Tinbergen explicitly sought to\ndistance ethology from the purposive, mentalistic, animal psychology\nof Bierens de Haan and the lack of biological concern they detected in\nAmerican comparative psychology (see Brigandt 2005).  Like Lloyd\nMorgan, the ethologists rejected Romanes anecdotal approach, but they\nalso criticized Lloyd Morgan’s subjectivist approach.\n\n\nIn the 1970s, Donald Griffin, who made his reputation taking careful\nphysical measurements to prove that bats use echolocation, made a\nconsiderable splash with his plea for a return to questions about\nanimal minds, especially animal consciousness. Griffin (1978) coined\nthe term “cognitive ethology” to describe this research\nprogram, which is based in naturalistic observations of animal\nbehavior and the attempt to understand animal minds in the context of\nevolution.\n\nFierce criticism of Griffin emerged both from psychologists\nand classically trained ethologists. Griffin\nemphasized behavioral flexibility and versatility as the chief source\nof evidence for consciousness, which he defined as “the\nsubjective state of feeling or thinking about objects and\nevents” (Griffin & Speck 2004, p. 6). In seeing\nsubjectivity, at least in simple forms, as a widespread phenomenon in\nthe animal kingdom, Griffin’s position also bears considerable\nresemblance to Lloyd Morgan’s. Burghardt reports that\n“considerable discomfort with subjectivism” (Burghardt\n1985, p. 907) arose during the Dahlem conference that Griffin convened\nin an early discipline-building exercise (Griffin 1981). Griffin’s\nsubjectivist position, and the suggestion that even insects such as\nhoneybees are conscious, seemed to many scientists to represent a\nlamentable return to the anthropomorphic over-interpretation of\nanecdotes seen in Darwin and Romanes. This criticism may be partly\nunfair in that Griffin does not repeat the\n“friend-of-a-farmer” kinds of story collected by Romanes,\nbut bases his interpretations on results from the more sophisticated\nscientific literature that had accumulated more than a century after\nDarwin (e.g., Giurfa et al. 2001). However, the charge of\nover-interpretation of those results may be harder to avoid.  It is\nalso important to note the role played by neurological evidence in his\nargument, when he concludes that the intensive search for neural\ncorrelates of consciousness has not revealed “any structure or\nprocess necessary for consciousness that is found only in human\nbrains” (Griffin & Speck 2004). This view is widely although\nnot universally shared by neuroscientists.\n\n\nGriffin’s behavior-based methodology for studying animal consciousness\nhas also been dismissed as anthropomorphic (see Bekoff & Allen\n1997 for a survey). But such criticisms may have overestimated the\ndangers of anthropomorphism (Fisher 1990) and many of the critics\nthemselves rely on claims for which there are scant scientific data\n(e.g., Kennedy 1992, who claims that the “sin” of\nanthropomorphism may be programmed into humans genetically).  At the\nsame time, other scientists, whether or not they have explicitly\nendorsed Griffin’s program, have sought to expand evolutionary\ninvestigation of animal consciousness to include the neurosciences and\na broad range of functional considerations (e.g., Ârhem et\nal. 2002, and see section 6). Whatever the shortfalls of his\nspecific proposals, Griffin played a crucial role in reintroducing\nexplicit discussions of consciousness to the science of animal\nbehavior and cognition, hence paving the way for modern investigations\nof the distribution and evolutionary origins of consciousness.  \n",
    "section_title": "3. Historical Background",
    "entry_title": "Animal Consciousness",
    "hierarchy_title": "Animal Consciousness || Historical Background",
    "tokenized_text": [
        "historical",
        "background",
        "historical",
        "background",
        "question",
        "animal",
        "consciousness",
        "western",
        "tradition",
        "root",
        "ancient",
        "discussion",
        "nature",
        "human",
        "being",
        "filtered",
        "modern",
        "philosophy",
        "descartes",
        "would",
        "anachronistic",
        "read",
        "idea",
        "consciousness",
        "today",
        "back",
        "ancient",
        "literature",
        "nevertheless",
        "consciousness",
        "sometimes",
        "thought",
        "uniquely",
        "human",
        "mental",
        "phenomenon",
        "important",
        "understand",
        "origin",
        "idea",
        "human",
        "qualitatively",
        "qualiatatively",
        "different",
        "animal",
        "aristotle",
        "asserted",
        "human",
        "rational",
        "soul",
        "locomotive",
        "soul",
        "shared",
        "animal",
        "human",
        "nonhuman",
        "endowed",
        "animal",
        "instinct",
        "suited",
        "successful",
        "reproduction",
        "survival",
        "sorabji",
        "argues",
        "denial",
        "reason",
        "animal",
        "created",
        "crisis",
        "greek",
        "thought",
        "requiring",
        "wholesale",
        "reanalysis",
        "p",
        "nature",
        "mental",
        "capacity",
        "revision",
        "thinking",
        "man",
        "place",
        "nature",
        "animal",
        "ibid",
        "argument",
        "reasoning",
        "whether",
        "animal",
        "display",
        "remains",
        "u",
        "century",
        "later",
        "evidenced",
        "volume",
        "rational",
        "animal",
        "hurley",
        "nudds",
        "great",
        "chain",
        "derived",
        "early",
        "christian",
        "interpretation",
        "aristotle",
        "scale",
        "nature",
        "lovejoy",
        "provides",
        "another",
        "aristotelian",
        "influence",
        "debate",
        "animal",
        "mind",
        "two",
        "millennium",
        "aristotle",
        "descartes",
        "mechanistic",
        "philosophy",
        "introduced",
        "idea",
        "reflex",
        "explain",
        "behavior",
        "nonhuman",
        "animal",
        "although",
        "conception",
        "animal",
        "treated",
        "reflexdriven",
        "machine",
        "intellectual",
        "capacity",
        "important",
        "recognize",
        "took",
        "mechanistic",
        "explanation",
        "perfectly",
        "adequate",
        "explaining",
        "sensation",
        "perception",
        "aspect",
        "animal",
        "behavior",
        "nowadays",
        "often",
        "associated",
        "consciousness",
        "drew",
        "line",
        "rational",
        "thought",
        "understanding",
        "given",
        "aristotelian",
        "division",
        "instinct",
        "reason",
        "cartesian",
        "distinction",
        "mechanical",
        "reflex",
        "rational",
        "thought",
        "tempting",
        "map",
        "one",
        "distinction",
        "onto",
        "nevertheless",
        "may",
        "mistake",
        "assimilate",
        "two",
        "first",
        "number",
        "author",
        "darwin",
        "believed",
        "conscious",
        "experience",
        "accompany",
        "instinctive",
        "reflexive",
        "action",
        "second",
        "dependence",
        "phenomenal",
        "consciousness",
        "rational",
        "selfreflective",
        "thought",
        "particularly",
        "strong",
        "contentious",
        "claim",
        "although",
        "current",
        "defender",
        "discussed",
        "although",
        "root",
        "careful",
        "observation",
        "experimentation",
        "natural",
        "world",
        "go",
        "back",
        "ancient",
        "time",
        "study",
        "animal",
        "behavior",
        "remained",
        "largely",
        "anecdotal",
        "long",
        "scientific",
        "revolution",
        "animal",
        "course",
        "widely",
        "used",
        "pursuit",
        "answer",
        "anatomical",
        "physiological",
        "embryological",
        "question",
        "vivisection",
        "carried",
        "ancient",
        "luminary",
        "galen",
        "resurgence",
        "practice",
        "early",
        "modern",
        "time",
        "bertoloni",
        "meli",
        "descartes",
        "practiced",
        "advocated",
        "vivisection",
        "descartes",
        "letter",
        "plempius",
        "feb",
        "wrote",
        "correspondence",
        "mechanical",
        "understanding",
        "animal",
        "absolved",
        "people",
        "guilt",
        "killing",
        "eating",
        "animal",
        "mechanist",
        "followed",
        "eg",
        "malebranche",
        "used",
        "descartes",
        "denial",
        "reason",
        "soul",
        "animal",
        "rationale",
        "belief",
        "animal",
        "incapable",
        "suffering",
        "emotion",
        "deserve",
        "moral",
        "consideration",
        "justifying",
        "vivisection",
        "brutal",
        "treatment",
        "see",
        "olson",
        "p",
        "support",
        "claim",
        "idea",
        "animal",
        "behavior",
        "purely",
        "reflexive",
        "may",
        "also",
        "served",
        "diminish",
        "interest",
        "treating",
        "behavior",
        "target",
        "careful",
        "study",
        "right",
        "glimmer",
        "experimental",
        "approach",
        "animal",
        "behavior",
        "seen",
        "late",
        "th",
        "century",
        "eg",
        "barrington",
        "white",
        "soon",
        "thereafter",
        "frédéric",
        "cuvier",
        "worked",
        "death",
        "development",
        "sexual",
        "social",
        "behavior",
        "captive",
        "mammal",
        "mid",
        "th",
        "century",
        "alfred",
        "russel",
        "wallace",
        "arguing",
        "explicitly",
        "experimental",
        "approach",
        "animal",
        "behavior",
        "douglas",
        "spalding",
        "experiment",
        "instinctual",
        "feeding",
        "behavior",
        "chick",
        "seminal",
        "still",
        "emergence",
        "experimental",
        "approach",
        "little",
        "say",
        "consciousness",
        "per",
        "se",
        "though",
        "spalding",
        "work",
        "seen",
        "contribution",
        "discussion",
        "instinct",
        "reason",
        "vein",
        "instinct",
        "vs",
        "reason",
        "darwin",
        "origin",
        "specie",
        "wrote",
        "significant",
        "fact",
        "habit",
        "particular",
        "animal",
        "studied",
        "naturalist",
        "attribute",
        "reason",
        "le",
        "unlearnt",
        "instinct",
        "book",
        "p",
        "devoted",
        "considerable",
        "attention",
        "origin",
        "descent",
        "man",
        "animal",
        "behavior",
        "obvious",
        "goal",
        "demonstrating",
        "mental",
        "continuity",
        "among",
        "specie",
        "make",
        "case",
        "darwin",
        "relied",
        "heavily",
        "anecdote",
        "provided",
        "correspondent",
        "project",
        "infamously",
        "pursued",
        "darwin",
        "death",
        "protégé",
        "george",
        "romanes",
        "darwin",
        "also",
        "carried",
        "experiment",
        "keen",
        "observer",
        "however",
        "final",
        "work",
        "describes",
        "experiment",
        "flexibility",
        "earthworm",
        "behavior",
        "manipulating",
        "leaf",
        "took",
        "show",
        "considerable",
        "intelligence",
        "darwin",
        "see",
        "also",
        "crist",
        "idea",
        "behavioral",
        "flexibility",
        "central",
        "discussion",
        "animal",
        "mind",
        "consciousness",
        "descartes",
        "conception",
        "animal",
        "automaton",
        "seems",
        "make",
        "phenomenal",
        "consciousness",
        "superfluous",
        "best",
        "connection",
        "whose",
        "philosophical",
        "development",
        "traced",
        "th",
        "huxley",
        "huxley",
        "reported",
        "series",
        "experiment",
        "frog",
        "showing",
        "similar",
        "reflexive",
        "behavior",
        "even",
        "spinal",
        "cord",
        "severed",
        "large",
        "portion",
        "brain",
        "removed",
        "argued",
        "without",
        "brain",
        "frog",
        "could",
        "conscious",
        "since",
        "could",
        "still",
        "sort",
        "thing",
        "could",
        "need",
        "assume",
        "consciousness",
        "even",
        "presence",
        "entire",
        "brain",
        "going",
        "argue",
        "consciousness",
        "superfluous",
        "argument",
        "somewhat",
        "curious",
        "since",
        "seems",
        "show",
        "much",
        "making",
        "brain",
        "superfluous",
        "frog",
        "behavior",
        "still",
        "including",
        "huxley",
        "became",
        "quickly",
        "convinced",
        "correctness",
        "darwin",
        "theory",
        "evolution",
        "understanding",
        "defending",
        "mental",
        "continuity",
        "human",
        "animal",
        "loomed",
        "large",
        "principle",
        "psychology",
        "william",
        "james",
        "promoted",
        "idea",
        "differing",
        "intensity",
        "conscious",
        "experience",
        "across",
        "animal",
        "kingdom",
        "idea",
        "echoed",
        "leading",
        "british",
        "psychologist",
        "day",
        "conwy",
        "lloyd",
        "morgan",
        "textbook",
        "introduction",
        "comparative",
        "psychology",
        "morgan",
        "skeptical",
        "critical",
        "anecdotal",
        "approach",
        "favored",
        "darwin",
        "romanes",
        "came",
        "around",
        "darwinian",
        "point",
        "view",
        "mental",
        "continuity",
        "methodology",
        "address",
        "methodological",
        "deficit",
        "introduced",
        "double",
        "inductive",
        "method",
        "understanding",
        "mental",
        "state",
        "animal",
        "morgan",
        "double",
        "induction",
        "consisted",
        "inductive",
        "inference",
        "based",
        "observation",
        "animal",
        "behavior",
        "combined",
        "introspective",
        "knowledge",
        "mind",
        "time",
        "counteract",
        "anthropomorphic",
        "bias",
        "double",
        "inductive",
        "method",
        "lloyd",
        "morgan",
        "introduced",
        "principle",
        "known",
        "morgan",
        "canon",
        "case",
        "may",
        "interpret",
        "action",
        "outcome",
        "exercise",
        "higher",
        "psychical",
        "faculty",
        "interpreted",
        "outcome",
        "exercise",
        "one",
        "stand",
        "lower",
        "psychological",
        "scale",
        "lloyd",
        "morgan",
        "p",
        "lloyd",
        "morgan",
        "double",
        "induction",
        "method",
        "textbook",
        "even",
        "though",
        "double",
        "inductive",
        "method",
        "mainly",
        "historical",
        "interest",
        "morgan",
        "canon",
        "life",
        "question",
        "quite",
        "canon",
        "mean",
        "justify",
        "active",
        "topic",
        "historical",
        "philosophical",
        "investigation",
        "eg",
        "burghardt",
        "sober",
        "radick",
        "thomas",
        "internet",
        "resource",
        "fitzpatrick",
        "question",
        "include",
        "lloyd",
        "morgan",
        "mean",
        "higher",
        "lower",
        "extent",
        "principle",
        "justified",
        "evolutionary",
        "consideration",
        "whether",
        "canon",
        "collapse",
        "principle",
        "parsimony",
        "version",
        "ockham",
        "razor",
        "general",
        "principle",
        "empirical",
        "justification",
        "despite",
        "current",
        "uncertainty",
        "really",
        "mean",
        "morgan",
        "canon",
        "interpreted",
        "perhaps",
        "misinterpreted",
        "thomas",
        "internet",
        "resource",
        "strong",
        "parsimony",
        "principle",
        "served",
        "central",
        "rhetorical",
        "role",
        "behavioristic",
        "psychologist",
        "sought",
        "eliminate",
        "hint",
        "cartesian",
        "dualism",
        "comparative",
        "psychology",
        "behaviorism",
        "dominated",
        "american",
        "psychology",
        "early",
        "part",
        "th",
        "century",
        "beginning",
        "thorndike",
        "experiment",
        "animal",
        "learning",
        "trial",
        "error",
        "escape",
        "puzzle",
        "box",
        "constructed",
        "even",
        "thorndike",
        "famous",
        "law",
        "effect",
        "refers",
        "animal",
        "satisfaction",
        "discomfort",
        "p",
        "radical",
        "antimentalism",
        "john",
        "b",
        "watson",
        "bf",
        "skinner",
        "strongly",
        "rejected",
        "attempt",
        "explain",
        "animal",
        "behavior",
        "term",
        "unobservable",
        "mental",
        "state",
        "american",
        "psychology",
        "became",
        "science",
        "behavior",
        "rather",
        "dictionary",
        "would",
        "science",
        "mind",
        "behavior",
        "time",
        "thing",
        "progressing",
        "rather",
        "differently",
        "europe",
        "ethological",
        "approach",
        "animal",
        "behavior",
        "dominant",
        "ethology",
        "part",
        "natural",
        "history",
        "emphasis",
        "fieldwork",
        "part",
        "experimental",
        "science",
        "conducted",
        "captive",
        "animal",
        "reflecting",
        "different",
        "style",
        "two",
        "seminal",
        "figure",
        "konrad",
        "lorenz",
        "niko",
        "tinbergen",
        "see",
        "burkhardt",
        "initially",
        "innate",
        "behavior",
        "central",
        "focus",
        "lorenz",
        "work",
        "according",
        "lorenz",
        "investigation",
        "innate",
        "behavior",
        "related",
        "specie",
        "put",
        "study",
        "animal",
        "behavior",
        "par",
        "branch",
        "evolutionary",
        "biology",
        "demonstrated",
        "possible",
        "derive",
        "phylogenetic",
        "relation",
        "among",
        "specie",
        "comparing",
        "instinctive",
        "behavioral",
        "repertoire",
        "lorenz",
        "a",
        "pursuing",
        "direction",
        "lorenz",
        "tinbergen",
        "explicitly",
        "sought",
        "distance",
        "ethology",
        "purposive",
        "mentalistic",
        "animal",
        "psychology",
        "bierens",
        "de",
        "haan",
        "lack",
        "biological",
        "concern",
        "detected",
        "american",
        "comparative",
        "psychology",
        "see",
        "brigandt",
        "like",
        "lloyd",
        "morgan",
        "ethologist",
        "rejected",
        "romanes",
        "anecdotal",
        "approach",
        "also",
        "criticized",
        "lloyd",
        "morgan",
        "subjectivist",
        "approach",
        "s",
        "donald",
        "griffin",
        "made",
        "reputation",
        "taking",
        "careful",
        "physical",
        "measurement",
        "prove",
        "bat",
        "use",
        "echolocation",
        "made",
        "considerable",
        "splash",
        "plea",
        "return",
        "question",
        "animal",
        "mind",
        "especially",
        "animal",
        "consciousness",
        "griffin",
        "coined",
        "term",
        "cognitive",
        "ethology",
        "describe",
        "research",
        "program",
        "based",
        "naturalistic",
        "observation",
        "animal",
        "behavior",
        "attempt",
        "understand",
        "animal",
        "mind",
        "context",
        "evolution",
        "fierce",
        "criticism",
        "griffin",
        "emerged",
        "psychologist",
        "classically",
        "trained",
        "ethologist",
        "griffin",
        "emphasized",
        "behavioral",
        "flexibility",
        "versatility",
        "chief",
        "source",
        "evidence",
        "consciousness",
        "defined",
        "subjective",
        "state",
        "feeling",
        "thinking",
        "object",
        "event",
        "griffin",
        "speck",
        "p",
        "seeing",
        "subjectivity",
        "least",
        "simple",
        "form",
        "widespread",
        "phenomenon",
        "animal",
        "kingdom",
        "griffin",
        "position",
        "also",
        "bear",
        "considerable",
        "resemblance",
        "lloyd",
        "morgan",
        "burghardt",
        "report",
        "considerable",
        "discomfort",
        "subjectivism",
        "burghardt",
        "p",
        "arose",
        "dahlem",
        "conference",
        "griffin",
        "convened",
        "early",
        "disciplinebuilding",
        "exercise",
        "griffin",
        "griffin",
        "subjectivist",
        "position",
        "suggestion",
        "even",
        "insect",
        "honeybee",
        "conscious",
        "seemed",
        "many",
        "scientist",
        "represent",
        "lamentable",
        "return",
        "anthropomorphic",
        "overinterpretation",
        "anecdote",
        "seen",
        "darwin",
        "romanes",
        "criticism",
        "may",
        "partly",
        "unfair",
        "griffin",
        "repeat",
        "friendofafarmer",
        "kind",
        "story",
        "collected",
        "romanes",
        "base",
        "interpretation",
        "result",
        "sophisticated",
        "scientific",
        "literature",
        "accumulated",
        "century",
        "darwin",
        "eg",
        "giurfa",
        "et",
        "al",
        "however",
        "charge",
        "overinterpretation",
        "result",
        "may",
        "harder",
        "avoid",
        "also",
        "important",
        "note",
        "role",
        "played",
        "neurological",
        "evidence",
        "argument",
        "concludes",
        "intensive",
        "search",
        "neural",
        "correlate",
        "consciousness",
        "revealed",
        "structure",
        "process",
        "necessary",
        "consciousness",
        "found",
        "human",
        "brain",
        "griffin",
        "speck",
        "view",
        "widely",
        "although",
        "universally",
        "shared",
        "neuroscientist",
        "griffin",
        "behaviorbased",
        "methodology",
        "studying",
        "animal",
        "consciousness",
        "also",
        "dismissed",
        "anthropomorphic",
        "see",
        "bekoff",
        "allen",
        "survey",
        "criticism",
        "may",
        "overestimated",
        "danger",
        "anthropomorphism",
        "fisher",
        "many",
        "critic",
        "rely",
        "claim",
        "scant",
        "scientific",
        "data",
        "eg",
        "kennedy",
        "claim",
        "sin",
        "anthropomorphism",
        "may",
        "programmed",
        "human",
        "genetically",
        "time",
        "scientist",
        "whether",
        "explicitly",
        "endorsed",
        "griffin",
        "program",
        "sought",
        "expand",
        "evolutionary",
        "investigation",
        "animal",
        "consciousness",
        "include",
        "neuroscience",
        "broad",
        "range",
        "functional",
        "consideration",
        "eg",
        "ârhem",
        "et",
        "al",
        "see",
        "section",
        "whatever",
        "shortfall",
        "specific",
        "proposal",
        "griffin",
        "played",
        "crucial",
        "role",
        "reintroducing",
        "explicit",
        "discussion",
        "consciousness",
        "science",
        "animal",
        "behavior",
        "cognition",
        "hence",
        "paving",
        "way",
        "modern",
        "investigation",
        "distribution",
        "evolutionary",
        "origin",
        "consciousness"
    ]
}