{
    "main_text": "Formulating Full Rule-consequentialism || Compliance and Acceptance\n6.2 Compliance and Acceptance\n\nThere are other important issues of formulation that\nrule-consequentialists face. One is the issue of whether\nrule-consequentialism should be formulated in terms of compliance with\nrules, in terms of acceptance of rules, or in terms of the teaching of\nrules. Admittedly, the most important consequence of teaching and\naccepting rules is compliance with them. And early formulations of\nrule-consequentialism did indeed explicitly mention compliance. For\nexample, they said an act is morally wrong if and only if it is\nforbidden by rules the compliance with which will maximize\nthe good (or the expected good). (See Austin 1832; Brandt 1959; M.\nSinger 1955, 1961.)\n\nHowever, acceptance of a rule can have consequences other than\ncompliance with the rule. As Kagan (2000: 139) writes, “once\nembedded, rules can have an impact on results that is independent of\ntheir impact on acts: it might be, say, that merely thinking about a\nset of rules reassures people, and so contributes to happiness.”\n(For more on what we might call these ‘beyond-compliance\nconsequences’ of rules, see Sidgwick 1907: 405–6, 413;\nLyons 1965: 140; Williams 1973: 119–20, 122, 129–30; Adams\n1976: 470; Scanlon 1998: 203–4; Kagan 1998: 227–34.)\n\nThese consequences of acceptance of rules should most definitely be\npart of a cost-benefit analysis of rules. Formulating\nrule-consequentialism in terms of the consequences of acceptance\nallows them to be part of this analysis. Important consequences of\ncommunal acceptance of a set of rules include assurance, incentive,\nand deterrent effects. And consideration of assurance and incentive\neffects has played a large role in the development of\nrule-consequentialism (Harsanyi 1977, 1982: 56–61; 1993:\n116–18; Brandt 1979: 271–77; 1988: 346ff [1992: 142ff.];\n1996: 126, 144; Johnson 1991, especially chs. 3, 4, 9). Hence, we\nshould not be surprised that rule-consequentialism has gone from being\nformulated in terms of compliance with rules to being formulated in\nterms of acceptance of rules.\n\nHowever, just as we need to move from thinking about the consequences\nof compliance to thinking about the wider consequences of acceptance,\nwe need to go further. Focusing purely on the consequences of\nacceptance of rules ignores the “transition” costs for the\nteachers of teaching those rules, and the costs to the\nteaching’s recipients of internalizing these rules. And yet\nthese costs can certainly be significant (Brandt 1963: section 4; 1967\n[1992: 126]; 1983: 98; 1988: 346–47, 349–50 [1992:\n140–143, 144–47]; 1996: 126–28, 145, 148, 152,\n223).\n\nSuppose, for example, that, once a fairly simple and relatively\nundemanding code of rules Code A has been accepted, the\nexpected value of Code A would be n. Suppose a more\ncomplicated and demanding alternative Code B would have an\nexpected value of \\(n + 5\\) once Code B has been accepted. So\nif we just consider the expected values of acceptance of the two\nalternative codes, Code B wins.\n\nBut now let us factor into our cost/benefit analysis of rival codes\nthe relative costs of teaching the two codes and of getting them\ninternalized by new generations. Since Code A is fairly\nsimple and relatively undemanding, the cost of getting it internalized\nis −1. Since Code B is more complicated and demanding,\nthe cost of getting it internalized is −7. So if our comparison\nof the two codes considers the respective costs of getting them\ninternalized, Code A’s expected value is \\(n-1\\), and\nCode B’s is \\(n+5-7\\). Once we include the respective\ncosts of getting the codes internalized, Code A wins.\n\nAs indicated, the costs of teaching a code successfully, so that the\ncode is very widely internalized, are “transition costs”.\nBut of course such transitions are always to one arrangement from\nanother. The arrangement we are imagining the transition being\nto is the acceptance of a certain proposed code. The\narrangement we are imagining the transition being from is\n… well, what?\n\nOne answer is that the arrangement from which the transition is\nsupposed to be starting is whatever moral code the society happens to\naccept already. That might seem like the natural answer. However,\nthere is a strong objection to this answer, namely that\nrule-consequentialism should not let the cost/benefit analysis of a\nproposed code be influenced by the costs of getting people to give up\nwhatever rules they may have already internalised. This is for two\nreasons.\n\nMost importantly, rule-consequentialist assessment of codes needs to\navoid giving weight directly or indirectly to moral ideas that have\ntheir source in other moral theories but not in rule-consequentialism\nitself. Suppose people in a given society were brought up to believe\nthat women should be subservient to men. Should rule-consequentialist\nevaluation of a proposed non-sexist code have to count the costs of\ngetting people to give up the sexist rules they have already\ninternalised so as to accept the new, non-sexist ones? Since the\nsexist rules are unjustifiable, that they were accepted should not be\nallowed to infect rule-consequentialist assessment.\n\nAnother reason for rejecting the answer we are considering is that it\nthreatens to underwrite an unattractive relativism. Different\nsocieties may differ considerably in their extant moral beliefs. Thus,\na way of assessing proposed codes that considers the costs of getting\npeople already committed to some other code will end up having to\ncountenance different transition costs to get to the same code. For\nexample, the transition costs to a non-racist code are much higher\nfrom an already accepted racist code than from an already accepted\nnon-racist one. Formulating rule-consequentialism so that it endorses\nthe same code for 1960s Michigan as for 1960s Mississippi is\ndesirable. (For opposing arguments that rule-consequentialism should\nbe formulated so as to coutenance social relativism, see Kahn 2012; D.\nMiller 2014, 2021; T. Miller 2021.)\n\nA way to avoid ending up with the social relativism just identified is\nto formulate rule-consequentialism in terms of acceptance by new\ngenerations of humans. The proposal might be that we compare the\nrespective “teaching costs” of alternative codes, on the\nassumption that these codes will be taught to new generations of\nchildren, i.e., children who have not already been educated to accept\na moral code. We are to imagine the children start off with natural\n(non-moral) inclinations to be very partial towards themselves and a\nfew others. We should also assume that there is a cognitive cost\nassociated with the learning of each rule.\n\nThese are realistic assumptions, with big implications. One is that a\ncost/benefit analysis of alternative codes of rules would have reason\nto favor simpler codes over more complex ones. Of course there can\nalso be benefits from having more, or more complicated, rules. Yet\nthere is probably a limit on how complicated or complex a code can be\nand still have greater expected value than simpler codes, once\nteaching costs are included.\n\nAnother implication concerns prospective rules about making sacrifices\nto help others. Since children start off focused on their own\ngratifications, getting them to internalize a kind of impartiality\nthat requires them to make large sacrifices repeatedly for the sake of\nothers would have extremely high costs. There would also, of course,\nbe enormous benefits from the internalization of such a rule —\npredominately, benefits to others. Would the benefits be greater than\nthe costs? At least since Sidgwick (1907: 434), many utilitarians have\ntaken for granted that human nature is such that the real\npossibilities are (1) that human beings care passionately about some\nand less about each of the rest of humanity or (2) that human beings\ncare weakly but impartially about everyone. In other words, what is\nnot a realistic possibility, according to this view of human nature,\nis human beings’ caring strongly and impartially about everyone\nin the world. If this view of human nature is correct, then one\nenormous cost of successfully making people completely impartial is\nthat doing so would leave them with only weak concerns.\n\nEven if that picture of human nature is not correct, that is, even if\nmaking people completely impartial could be achieved without draining\nthem of enthusiasm and passion, the cost of successfully making people\ncare as much about every other individual as they do about themselves\nwould be prohibitive. At some point on the spectrum running from\ncomplete partiality to complete impartiality, the costs of pushing and\ninducing everyone further along the spectrum outweigh the\nbenefits.\n\nA complication worth mentioning comes from the obvious point that\nmoral education is developmental. How many rules are to be taught to\nchildren, how complicated these rules are, how demanding the rules\nare, and how to resolve conflicts among the rules depend on the\ndevelopmental stage of the children. Hence, there can be conflict\nbetween the simpler and less demanding rules taught to the very young\nand the more elaborate, nuanced, and demanding rules taught at higher\ndevelopmental stages. Of course, rule-consequentialism is best\nformulated in terms of the rules featured in the end of the\ndevelopment rather than the ones figuring in earlier stages.\n",
    "section_title": "6.2 Compliance and Acceptance",
    "entry_title": "Rule Consequentialism",
    "hierarchy_title": "Rule Consequentialism || Formulating Full Rule-consequentialism || Compliance and Acceptance",
    "tokenized_text": [
        "formulating",
        "full",
        "ruleconsequentialism",
        "compliance",
        "acceptance",
        "compliance",
        "acceptance",
        "important",
        "issue",
        "formulation",
        "ruleconsequentialists",
        "face",
        "one",
        "issue",
        "whether",
        "ruleconsequentialism",
        "formulated",
        "term",
        "compliance",
        "rule",
        "term",
        "acceptance",
        "rule",
        "term",
        "teaching",
        "rule",
        "admittedly",
        "important",
        "consequence",
        "teaching",
        "accepting",
        "rule",
        "compliance",
        "early",
        "formulation",
        "ruleconsequentialism",
        "indeed",
        "explicitly",
        "mention",
        "compliance",
        "example",
        "said",
        "act",
        "morally",
        "wrong",
        "forbidden",
        "rule",
        "compliance",
        "maximize",
        "good",
        "expected",
        "good",
        "see",
        "austin",
        "brandt",
        "m",
        "singer",
        "however",
        "acceptance",
        "rule",
        "consequence",
        "compliance",
        "rule",
        "kagan",
        "writes",
        "embedded",
        "rule",
        "impact",
        "result",
        "independent",
        "impact",
        "act",
        "might",
        "say",
        "merely",
        "thinking",
        "set",
        "rule",
        "reassures",
        "people",
        "contributes",
        "happiness",
        "might",
        "call",
        "beyondcompliance",
        "consequence",
        "rule",
        "see",
        "sidgwick",
        "lyon",
        "williams",
        "adam",
        "scanlon",
        "kagan",
        "consequence",
        "acceptance",
        "rule",
        "definitely",
        "part",
        "costbenefit",
        "analysis",
        "rule",
        "formulating",
        "ruleconsequentialism",
        "term",
        "consequence",
        "acceptance",
        "allows",
        "part",
        "analysis",
        "important",
        "consequence",
        "communal",
        "acceptance",
        "set",
        "rule",
        "include",
        "assurance",
        "incentive",
        "deterrent",
        "effect",
        "consideration",
        "assurance",
        "incentive",
        "effect",
        "played",
        "large",
        "role",
        "development",
        "ruleconsequentialism",
        "harsanyi",
        "brandt",
        "ff",
        "ff",
        "johnson",
        "especially",
        "chs",
        "hence",
        "surprised",
        "ruleconsequentialism",
        "gone",
        "formulated",
        "term",
        "compliance",
        "rule",
        "formulated",
        "term",
        "acceptance",
        "rule",
        "however",
        "need",
        "move",
        "thinking",
        "consequence",
        "compliance",
        "thinking",
        "wider",
        "consequence",
        "acceptance",
        "need",
        "go",
        "focusing",
        "purely",
        "consequence",
        "acceptance",
        "rule",
        "ignores",
        "transition",
        "cost",
        "teacher",
        "teaching",
        "rule",
        "cost",
        "teaching",
        "recipient",
        "internalizing",
        "rule",
        "yet",
        "cost",
        "certainly",
        "significant",
        "brandt",
        "section",
        "suppose",
        "example",
        "fairly",
        "simple",
        "relatively",
        "undemanding",
        "code",
        "rule",
        "code",
        "accepted",
        "expected",
        "value",
        "code",
        "would",
        "n",
        "suppose",
        "complicated",
        "demanding",
        "alternative",
        "code",
        "b",
        "would",
        "expected",
        "value",
        "n",
        "code",
        "b",
        "accepted",
        "consider",
        "expected",
        "value",
        "acceptance",
        "two",
        "alternative",
        "code",
        "code",
        "b",
        "win",
        "let",
        "u",
        "factor",
        "costbenefit",
        "analysis",
        "rival",
        "code",
        "relative",
        "cost",
        "teaching",
        "two",
        "code",
        "getting",
        "internalized",
        "new",
        "generation",
        "since",
        "code",
        "fairly",
        "simple",
        "relatively",
        "undemanding",
        "cost",
        "getting",
        "internalized",
        "since",
        "code",
        "b",
        "complicated",
        "demanding",
        "cost",
        "getting",
        "internalized",
        "comparison",
        "two",
        "code",
        "considers",
        "respective",
        "cost",
        "getting",
        "internalized",
        "code",
        "expected",
        "value",
        "n",
        "code",
        "b",
        "n",
        "include",
        "respective",
        "cost",
        "getting",
        "code",
        "internalized",
        "code",
        "win",
        "indicated",
        "cost",
        "teaching",
        "code",
        "successfully",
        "code",
        "widely",
        "internalized",
        "transition",
        "cost",
        "course",
        "transition",
        "always",
        "one",
        "arrangement",
        "another",
        "arrangement",
        "imagining",
        "transition",
        "acceptance",
        "certain",
        "proposed",
        "code",
        "arrangement",
        "imagining",
        "transition",
        "well",
        "one",
        "answer",
        "arrangement",
        "transition",
        "supposed",
        "starting",
        "whatever",
        "moral",
        "code",
        "society",
        "happens",
        "accept",
        "already",
        "might",
        "seem",
        "like",
        "natural",
        "answer",
        "however",
        "strong",
        "objection",
        "answer",
        "namely",
        "ruleconsequentialism",
        "let",
        "costbenefit",
        "analysis",
        "proposed",
        "code",
        "influenced",
        "cost",
        "getting",
        "people",
        "give",
        "whatever",
        "rule",
        "may",
        "already",
        "internalised",
        "two",
        "reason",
        "importantly",
        "ruleconsequentialist",
        "assessment",
        "code",
        "need",
        "avoid",
        "giving",
        "weight",
        "directly",
        "indirectly",
        "moral",
        "idea",
        "source",
        "moral",
        "theory",
        "ruleconsequentialism",
        "suppose",
        "people",
        "given",
        "society",
        "brought",
        "believe",
        "woman",
        "subservient",
        "men",
        "ruleconsequentialist",
        "evaluation",
        "proposed",
        "nonsexist",
        "code",
        "count",
        "cost",
        "getting",
        "people",
        "give",
        "sexist",
        "rule",
        "already",
        "internalised",
        "accept",
        "new",
        "nonsexist",
        "one",
        "since",
        "sexist",
        "rule",
        "unjustifiable",
        "accepted",
        "allowed",
        "infect",
        "ruleconsequentialist",
        "assessment",
        "another",
        "reason",
        "rejecting",
        "answer",
        "considering",
        "threatens",
        "underwrite",
        "unattractive",
        "relativism",
        "different",
        "society",
        "may",
        "differ",
        "considerably",
        "extant",
        "moral",
        "belief",
        "thus",
        "way",
        "assessing",
        "proposed",
        "code",
        "considers",
        "cost",
        "getting",
        "people",
        "already",
        "committed",
        "code",
        "end",
        "countenance",
        "different",
        "transition",
        "cost",
        "get",
        "code",
        "example",
        "transition",
        "cost",
        "nonracist",
        "code",
        "much",
        "higher",
        "already",
        "accepted",
        "racist",
        "code",
        "already",
        "accepted",
        "nonracist",
        "one",
        "formulating",
        "ruleconsequentialism",
        "endorses",
        "code",
        "s",
        "michigan",
        "s",
        "mississippi",
        "desirable",
        "opposing",
        "argument",
        "ruleconsequentialism",
        "formulated",
        "coutenance",
        "social",
        "relativism",
        "see",
        "kahn",
        "d",
        "miller",
        "t",
        "miller",
        "way",
        "avoid",
        "ending",
        "social",
        "relativism",
        "identified",
        "formulate",
        "ruleconsequentialism",
        "term",
        "acceptance",
        "new",
        "generation",
        "human",
        "proposal",
        "might",
        "compare",
        "respective",
        "teaching",
        "cost",
        "alternative",
        "code",
        "assumption",
        "code",
        "taught",
        "new",
        "generation",
        "child",
        "ie",
        "child",
        "already",
        "educated",
        "accept",
        "moral",
        "code",
        "imagine",
        "child",
        "start",
        "natural",
        "nonmoral",
        "inclination",
        "partial",
        "towards",
        "others",
        "also",
        "assume",
        "cognitive",
        "cost",
        "associated",
        "learning",
        "rule",
        "realistic",
        "assumption",
        "big",
        "implication",
        "one",
        "costbenefit",
        "analysis",
        "alternative",
        "code",
        "rule",
        "would",
        "reason",
        "favor",
        "simpler",
        "code",
        "complex",
        "one",
        "course",
        "also",
        "benefit",
        "complicated",
        "rule",
        "yet",
        "probably",
        "limit",
        "complicated",
        "complex",
        "code",
        "still",
        "greater",
        "expected",
        "value",
        "simpler",
        "code",
        "teaching",
        "cost",
        "included",
        "another",
        "implication",
        "concern",
        "prospective",
        "rule",
        "making",
        "sacrifice",
        "help",
        "others",
        "since",
        "child",
        "start",
        "focused",
        "gratification",
        "getting",
        "internalize",
        "kind",
        "impartiality",
        "requires",
        "make",
        "large",
        "sacrifice",
        "repeatedly",
        "sake",
        "others",
        "would",
        "extremely",
        "high",
        "cost",
        "would",
        "also",
        "course",
        "enormous",
        "benefit",
        "internalization",
        "rule",
        "predominately",
        "benefit",
        "others",
        "would",
        "benefit",
        "greater",
        "cost",
        "least",
        "since",
        "sidgwick",
        "many",
        "utilitarian",
        "taken",
        "granted",
        "human",
        "nature",
        "real",
        "possibility",
        "human",
        "being",
        "care",
        "passionately",
        "le",
        "rest",
        "humanity",
        "human",
        "being",
        "care",
        "weakly",
        "impartially",
        "everyone",
        "word",
        "realistic",
        "possibility",
        "according",
        "view",
        "human",
        "nature",
        "human",
        "being",
        "caring",
        "strongly",
        "impartially",
        "everyone",
        "world",
        "view",
        "human",
        "nature",
        "correct",
        "one",
        "enormous",
        "cost",
        "successfully",
        "making",
        "people",
        "completely",
        "impartial",
        "would",
        "leave",
        "weak",
        "concern",
        "even",
        "picture",
        "human",
        "nature",
        "correct",
        "even",
        "making",
        "people",
        "completely",
        "impartial",
        "could",
        "achieved",
        "without",
        "draining",
        "enthusiasm",
        "passion",
        "cost",
        "successfully",
        "making",
        "people",
        "care",
        "much",
        "every",
        "individual",
        "would",
        "prohibitive",
        "point",
        "spectrum",
        "running",
        "complete",
        "partiality",
        "complete",
        "impartiality",
        "cost",
        "pushing",
        "inducing",
        "everyone",
        "along",
        "spectrum",
        "outweigh",
        "benefit",
        "complication",
        "worth",
        "mentioning",
        "come",
        "obvious",
        "point",
        "moral",
        "education",
        "developmental",
        "many",
        "rule",
        "taught",
        "child",
        "complicated",
        "rule",
        "demanding",
        "rule",
        "resolve",
        "conflict",
        "among",
        "rule",
        "depend",
        "developmental",
        "stage",
        "child",
        "hence",
        "conflict",
        "simpler",
        "le",
        "demanding",
        "rule",
        "taught",
        "young",
        "elaborate",
        "nuanced",
        "demanding",
        "rule",
        "taught",
        "higher",
        "developmental",
        "stage",
        "course",
        "ruleconsequentialism",
        "best",
        "formulated",
        "term",
        "rule",
        "featured",
        "end",
        "development",
        "rather",
        "one",
        "figuring",
        "earlier",
        "stage"
    ]
}