{
    "main_text": "Developments in England || Locke\n5. Leibniz\n\nReturning to the Continent, we find that Leibniz may be the first\nphilosopher we’ll encounter that can properly be said to have a\ntheory of consciousness. Leibniz is one of the first\nphilosophers to make it very explicit that he is trying to work out an\nanalysis for this new psychological account of consciousness. He even\ninvents a new word for the concept: apperception, a\nnominalization of the French verb s’apercevoir de, to\nperceive. And along with this new term, he develops a theory of\nconsciousness that he intends to be fully naturalized, which, in part,\nmeans that there are no unexplained gaps in the analysis that require\nrecourse to brute explanation or miracle.\n\nFurther, Leibniz is one of the first to provide a theoretical\ngrounding for non-conscious mental states, in contrast to the\nCartesians we discussed above who defined thought in terms of\nconsciousness. As Leibniz says, \n\n\n[I]t is good to distinguish between perception, which is the\ninternal state of the monad [i.e., simple substance] representing\nexternal things, and apperception, which is\nconsciousness, or the reflective knowledge of this internal\nstate, something not given to all souls, nor at all times to a given\nsoul. Moreover, it is because they lack this distinction that the\nCartesians have failed, disregarding the perceptions that we do not\napperceive, in the same way that people disregard imperceptible\nbodies. This is also what leads the same Cartesians to believe that\nonly minds are monads, that there are no souls in beasts, still less\nother principles of life. (“Principles of Nature and\nGrace” §4, AG 208)\n\n\nThus, Leibniz thinks he has diagnosed a significant error in the\nCartesian philosophical system, and he has the solution in his account\nof consciousness. A couple of things stand out immediately from this\npassage, which connect to our discussion above:\n\nLeibniz’s theory of mind is a representational\ntheory of mind. Perception is not understood in terms of awareness,\nbut rather in terms of the substance’s “representing\nexternal things.”\nSome, but not all, “souls” are conscious.\nAnd those souls that are conscious can transition between\nconscious and non-conscious states. Indeed, as he argues elsewhere,\nthere must be infinitely many petites perceptions in each\nmind of which they are unaware, even while they are conscious of some\nthings. (See the preface to the New Essays.)\nMinds or mind-like substances are found throughout nature (in\nhumans, animals, and other “principles of life”). But\ntheir fundamental properties are the same: they are by nature\nrepresentational.\n\n\nSo, like Spinoza, Leibniz will have to provide a theory of\nconsciousness in terms of representations, and, perhaps\nunlike Spinoza, he will have to demonstrate how this theory allows for\ntransitions from conscious to non-conscious states. If he can do this,\nthen, he thinks, his theory of mind will avoid many of the problems\nplaguing the Cartesian theory of mind. Further, he thinks it will be a\nfully natural theory, one that will open up a new science of the mind,\nwhich he calls pneumatology (cf. RB 56; the name\npneumatology obviously didn’t catch on, but the science\nLeibniz envisioned would probably overlap significantly with\ntoday’s cognitive\n sciences).[15]\n\n\nSo, then, what was the account of consciousness Leibniz had to offer?\nSome have picked up on what Leibniz says in the quotation above\n(“…apperception, which is\nconsciousness, or the reflective knowledge of this internal\nstate”) and argue that consciousness, for Leibniz, is a matter\nof reflection. And, as we have seen, this is a popular option during\nthe seventeenth century, but it is also an option for which it is not\nalways clear what the underlying structure would be. Does reflection\nrequire a distinct second-order perception that takes the first-order\nperception as its object? Or is it rather like Arnauld’s\nsuggestion of a virtual reflection (in contrast to an\nexplicit reflection)? Many scholars believe that Leibniz is\narguing for higher-order theory of consciousness, where consciousness\nis constituted by a first-order perception and a distinct higher-order\nperception. (For this sort of an interpretation of Leibniz’s\ntheory of consciousness, see Kulstad 1990, Gennaro 1999, and Simmons\n2001.)\n\nIn fact, Leibniz’s purported analysis of consciousness in terms\nof reflection isn’t entirely clear. If Leibniz is\narguing that a perception becomes a conscious perception when\nit is accompanied by a second-order perception, then Leibniz has a\nphilosophical problem. Margaret Wilson’s argument against\nCurley’s similar analysis of Spinoza’s theory of\nconsciousness above applies even better to Leibniz. Leibniz’s\ntheory of mind entails that every mind represents the universe (the\n“universal expression” thesis), which would always\nnecessarily include a self-expression. All minds would have\nhigher-order perceptions of themselves and their mental states,\nundermining Leibniz’s ability to distinguish among\nconscious/non-conscious substances or conscious/non-conscious\nperceptions within a single substance. All substances would\nbe conscious, and all mental states would be conscious mental states.\n(For a development of these criticisms as well as an argument that a\nhigher-order theory of consciousness would violate one of\nLeibniz’s basic metaphysical theses, see Jorgensen 2009. For a\npossible response (but not decisive) to some of these objections, see\nJorgensen 2011a.)\n\nOf course, it may be that Leibniz simply didn’t see this\nimplication and so he held an incoherent theory of consciousness. But\nthere is another candidate theory in the near neighborhood. Consider\nwhat Leibniz says about simple substances (or, as he calls them,\n“monads”) in the following passage:\n\n\n[S]ince the nature of the monad is representative, nothing can limit\nit to represent only a part of things. However, it is true that this\nrepresentation is only confused as to the detail of the whole\nuniverse, and can only be distinct for a small portion of things, that\nis, either for those that are closest, or for those that are greatest\nwith respect to each monad, otherwise each monad would be a divinity.\nMonads are limited, not as to their objects, but with respect to the\nmodifications of their knowledge of them. Monads all go confusedly to\ninfinity, to the whole; but they are limited and differentiated by the\ndegrees of their distinct perceptions. (“Monadology,”\n§60, AG 220–221)\n\n\nLeibniz here starts by articulating the universal expression\nthesis—all simple substances represent “the whole.”\nWhat distinguishes them from one another is the relative\n“degrees of their distinct perceptions,” which track the\nthings that “are closest, or…greatest with respect to\neach monad.” Combining what Leibniz says here with other similar\ntexts, we see Leibniz articulating a broadly functional account of\nconsciousness. Consciousness is a function of perceptual distinctness,\nwhich itself is a function of how things are represented in the\nindividual monad.\n\nTo see how perceptual distinctness arises from a variety of\nrepresentations, Leibniz provides his famous example of the sound of\nthe ocean:\n\n\nTo give a clearer idea of these minute perceptions which we are unable\nto pick out from the crowd, I like to use the example of the roaring\nnoise of the sea which impresses itself on us when we are standing on\nthe shore. To hear this noise as we do, we must hear the parts which\nmake up this whole, that is the noise of each wave, although each of\nthese little noises makes itself known only when combined confusedly\nwith all the others, and would not be noticed if the wave which made\nit were by itself. (RB 54)\n\n\nEach tiny wave sound impresses itself on our sensory organs and are\nthen combined into a more noticeable sound, one that will stand out\nfrom the rest of the background representations of the world.\n“Noticeable perceptions,” Leibniz says, “arise by\ndegrees from ones which are too minute to be noticed” (RB\n57).\n\nThe way in which distinct perceptions arise depends on the\nfunctional organization of the body. In the “Principles of\nNature and Grace,” Leibniz says that when a simple substance has\na body with “organs that are adjusted in such a way that,\nthrough them, there is contrast and distinction among the impressions\nthey receive, and consequently contrast and distinction in the\nperceptions that represent them…then this may amount to\nsensation…” (AG 208). The contrast in noticeable\nperceptions arises because of the function of the body\n“confusing” (that is, fusing together) the representations\nof the external world in such a way that they become more distinctive.\nSo, although they are confused, these perceptions stand out against\nthe perceptual background—they are confused and\ndistinct. When and how this occurs will depend on a variety of\nfactors, including the ability and sophistication of the sense organs,\nthe disposition of the individual, etc. Additionally, this will be a\nmatter of degree—certain representations will stand out more\nthan others. And so, for Leibniz, consciousness itself will be a\nmatter of\n degree.[16]\n\n\nHowever, in order for Leibniz to account for transitions in\nconsciousness (whether it’s a mind becoming conscious or whether\nit is a transition in a mind becoming conscious of a particular\nobject) it cannot be the case that just any degree of\nperceptual distinctness results in consciousness. Rather,\nLeibniz’s theory of consciousness appears to entail that there\nis a certain minimal threshold at which consciousness arises. And this\nthreshold might itself be sensitive to context and the status of the\nmind—things that I’ll notice when I’m wide awake\nwill go unnoticed when I’m in a sound sleep. Here is one example\nthat Leibniz provides, along with his explanation:\n\n\n[T]here are hundreds of indications leading us to conclude that at\nevery moment there is in us an infinity of perceptions, unaccompanied\nby awareness [apperception] or reflection; that is, of\nalterations in the soul itself, of which we are unaware because these\nimpressions are either too minute and too numerous, or else too\nunvarying, so that they are not sufficiently distinctive on their own.\nBut when they are combined with others they do nevertheless have their\neffect and make themselves felt, at least confusedly, within the\nwhole. This is how we become so accustomed to the motion of a mill or\na waterfall, after living beside it for awhile, that we pay not heed\nto it. Not that this motion ceases to strike on our sense-organs, or\nthat something corresponding to it does not still occur in the soul\nbecause of the harmony between the soul and the body; but these\nimpressions in the soul and the body, lacking the appeal of novelty,\nare not forceful enough to attract our attention and\nour memory, which are applied only to more compelling objects. (RB\n53–54)\n\n\nNote that Leibniz here reaffirms that we are aware only of the\nperceptions that are “sufficiently distinctive” or are\n“forceful enough.” This suggests a certain level of\nperceptual distinctness or force that will “make themselves\nfelt.” As in the case of the mill—you move in next door to\nthe mill and can’t sleep because of the noise. But, over time,\nyou become accustomed to the sound of the mill and no longer notice\nit. It is this sort of phenomenological fact, which we can all\nrecognize, that Leibniz thinks he can explain in terms of the\nvariations in perceptual distinctness. It’s not, as he says,\nthat the noise no longer affects our sensory organs—the noise\ncontinues to be registered internally, but there is something about\nthe lack of novelty that results in a transition in consciousness. We\nno longer notice the noise (or, at the very least, we don’t\nnotice it nearly as much). What explains this? Leibniz thinks he can\ngive a natural explanation of this in terms of the forcefulness of the\nimpression. Somehow it becomes less forceful over time. (How does it\ndo this? Leibniz doesn’t give us a full account here. This is where he thinks we will see the promise of his theory and\nthen investigate the\n causes.)[17]\n\n\nThus, Leibniz may be seen as providing a fully naturalized\nphilosophy of mind in which he advocates for a threshold theory of\nconsciousness. This is a same-order theory of\nconsciousness—for Leibniz, a conscious perception is a distinct\nperception. That is, at some level of distinctness, the perception\nstands out sufficiently to be noticed. All perceiving substances have\nperceptions that have some degree of distinctness, but not all\nperceiving substances have distinct perceptions. Rather, it requires\nsome threshold degree of distinctness (relative to context) for a\nperception to be distinct. (For a full account of this position, see\nch. 7 of Jorgensen 2019.)\n\nLeibniz never uses the term “threshold” when discussing\nconsciousness, but his examples all appeal to thresholds in one way or\nanother. He says later in the New Essays:\n\n\nI…prefer to distinguish between perception and\nbeing aware [apperception]. For instance, a\nperception of light or color of which we are aware is made up of many\nminute perceptions of which we are unaware; and a noise which we\nperceive but do not attend to is brought within reach of our awareness\nby a tiny increase or addition. (134)\n\n\nThus, at some level the noise will be noticed. Leibniz is silent on\nprecisely how this threshold is determined. Although he frequently\nclaims that differences in kind (although continuous with other kinds)\narise at the infinite or the infinitesimal, this is in tension with\nmany of the phenomena of consciousness which apparently arise at some\nmid-level degree of perceptual distinctness (as with the description\nof the difference between a conscious perception of light and an\nunconscious perception of light above). Here is another area where\nLeibniz is offering a theory and is optimistic that the\nrelevant natural factors determining the threshold will be discovered\nin the science of pneumatology (and, indeed, cognitive\nscience has made some progress in this direction). \n\nBut the overall transition has been made. The initial transition from\na morally-laden concept to a fully psychological concept was made with\nDescartes and the Cambridge Platonists. And here, through the\nCartesians and in Leibniz, we see an attempt to clarify the concept\nand to provide a coherent analysis of the concept. Leibniz’s\naccount (and Spinoza’s account, insofar as he has one) treats\nconsciousness as a natural phenomenon to be explained in natural ways,\nand so he endeavors to explain consciousness in terms of the\nunderlying mental representations. This has obvious connections to\nrepresentational and functional accounts of consciousness that\ncontinue to this day.\n\n(For more on the topic of consciousness in Leibniz, see Barth 2011;\nBolton 2011; de Gaudemar 2004; Furth 1967; Jorgensen 2009, 2011a, and\n2011b; Kulstad 1990; Thiel 2011 (section 3 of chapter 9); and Simmons\n2001 and 2011.)\n",
    "section_title": "5. Leibniz",
    "entry_title": "Seventeenth-Century Theories of Consciousness",
    "hierarchy_title": "Seventeenth-Century Theories of Consciousness || Developments in England || Locke",
    "tokenized_text": [
        "development",
        "england",
        "locke",
        "leibniz",
        "returning",
        "continent",
        "find",
        "leibniz",
        "may",
        "first",
        "philosopher",
        "encounter",
        "properly",
        "said",
        "theory",
        "consciousness",
        "leibniz",
        "one",
        "first",
        "philosopher",
        "make",
        "explicit",
        "trying",
        "work",
        "analysis",
        "new",
        "psychological",
        "account",
        "consciousness",
        "even",
        "invents",
        "new",
        "word",
        "concept",
        "apperception",
        "nominalization",
        "french",
        "verb",
        "apercevoir",
        "de",
        "perceive",
        "along",
        "new",
        "term",
        "develops",
        "theory",
        "consciousness",
        "intends",
        "fully",
        "naturalized",
        "part",
        "mean",
        "unexplained",
        "gap",
        "analysis",
        "require",
        "recourse",
        "brute",
        "explanation",
        "miracle",
        "leibniz",
        "one",
        "first",
        "provide",
        "theoretical",
        "grounding",
        "nonconscious",
        "mental",
        "state",
        "contrast",
        "cartesian",
        "discussed",
        "defined",
        "thought",
        "term",
        "consciousness",
        "leibniz",
        "say",
        "good",
        "distinguish",
        "perception",
        "internal",
        "state",
        "monad",
        "ie",
        "simple",
        "substance",
        "representing",
        "external",
        "thing",
        "apperception",
        "consciousness",
        "reflective",
        "knowledge",
        "internal",
        "state",
        "something",
        "given",
        "soul",
        "time",
        "given",
        "soul",
        "moreover",
        "lack",
        "distinction",
        "cartesian",
        "failed",
        "disregarding",
        "perception",
        "apperceive",
        "way",
        "people",
        "disregard",
        "imperceptible",
        "body",
        "also",
        "lead",
        "cartesian",
        "believe",
        "mind",
        "monad",
        "soul",
        "beast",
        "still",
        "le",
        "principle",
        "life",
        "principle",
        "nature",
        "grace",
        "ag",
        "thus",
        "leibniz",
        "think",
        "diagnosed",
        "significant",
        "error",
        "cartesian",
        "philosophical",
        "system",
        "solution",
        "account",
        "consciousness",
        "couple",
        "thing",
        "stand",
        "immediately",
        "passage",
        "connect",
        "discussion",
        "leibniz",
        "theory",
        "mind",
        "representational",
        "theory",
        "mind",
        "perception",
        "understood",
        "term",
        "awareness",
        "rather",
        "term",
        "substance",
        "representing",
        "external",
        "things",
        "soul",
        "conscious",
        "soul",
        "conscious",
        "transition",
        "conscious",
        "nonconscious",
        "state",
        "indeed",
        "argues",
        "elsewhere",
        "must",
        "infinitely",
        "many",
        "petite",
        "perception",
        "mind",
        "unaware",
        "even",
        "conscious",
        "thing",
        "see",
        "preface",
        "new",
        "essay",
        "mind",
        "mindlike",
        "substance",
        "found",
        "throughout",
        "nature",
        "human",
        "animal",
        "principle",
        "life",
        "fundamental",
        "property",
        "nature",
        "representational",
        "like",
        "spinoza",
        "leibniz",
        "provide",
        "theory",
        "consciousness",
        "term",
        "representation",
        "perhaps",
        "unlike",
        "spinoza",
        "demonstrate",
        "theory",
        "allows",
        "transition",
        "conscious",
        "nonconscious",
        "state",
        "think",
        "theory",
        "mind",
        "avoid",
        "many",
        "problem",
        "plaguing",
        "cartesian",
        "theory",
        "mind",
        "think",
        "fully",
        "natural",
        "theory",
        "one",
        "open",
        "new",
        "science",
        "mind",
        "call",
        "pneumatology",
        "cf",
        "rb",
        "name",
        "pneumatology",
        "obviously",
        "catch",
        "science",
        "leibniz",
        "envisioned",
        "would",
        "probably",
        "overlap",
        "significantly",
        "today",
        "cognitive",
        "science",
        "account",
        "consciousness",
        "leibniz",
        "offer",
        "picked",
        "leibniz",
        "say",
        "quotation",
        "apperception",
        "consciousness",
        "reflective",
        "knowledge",
        "internal",
        "state",
        "argue",
        "consciousness",
        "leibniz",
        "matter",
        "reflection",
        "seen",
        "popular",
        "option",
        "seventeenth",
        "century",
        "also",
        "option",
        "always",
        "clear",
        "underlying",
        "structure",
        "would",
        "reflection",
        "require",
        "distinct",
        "secondorder",
        "perception",
        "take",
        "firstorder",
        "perception",
        "object",
        "rather",
        "like",
        "arnauld",
        "suggestion",
        "virtual",
        "reflection",
        "contrast",
        "explicit",
        "reflection",
        "many",
        "scholar",
        "believe",
        "leibniz",
        "arguing",
        "higherorder",
        "theory",
        "consciousness",
        "consciousness",
        "constituted",
        "firstorder",
        "perception",
        "distinct",
        "higherorder",
        "perception",
        "sort",
        "interpretation",
        "leibniz",
        "theory",
        "consciousness",
        "see",
        "kulstad",
        "gennaro",
        "simmons",
        "fact",
        "leibniz",
        "purported",
        "analysis",
        "consciousness",
        "term",
        "reflection",
        "entirely",
        "clear",
        "leibniz",
        "arguing",
        "perception",
        "becomes",
        "conscious",
        "perception",
        "accompanied",
        "secondorder",
        "perception",
        "leibniz",
        "philosophical",
        "problem",
        "margaret",
        "wilson",
        "argument",
        "curley",
        "similar",
        "analysis",
        "spinoza",
        "theory",
        "consciousness",
        "applies",
        "even",
        "better",
        "leibniz",
        "leibniz",
        "theory",
        "mind",
        "entail",
        "every",
        "mind",
        "represents",
        "universe",
        "universal",
        "expression",
        "thesis",
        "would",
        "always",
        "necessarily",
        "include",
        "selfexpression",
        "mind",
        "would",
        "higherorder",
        "perception",
        "mental",
        "state",
        "undermining",
        "leibniz",
        "ability",
        "distinguish",
        "among",
        "consciousnonconscious",
        "substance",
        "consciousnonconscious",
        "perception",
        "within",
        "single",
        "substance",
        "substance",
        "would",
        "conscious",
        "mental",
        "state",
        "would",
        "conscious",
        "mental",
        "state",
        "development",
        "criticism",
        "well",
        "argument",
        "higherorder",
        "theory",
        "consciousness",
        "would",
        "violate",
        "one",
        "leibniz",
        "basic",
        "metaphysical",
        "thesis",
        "see",
        "jorgensen",
        "possible",
        "response",
        "decisive",
        "objection",
        "see",
        "jorgensen",
        "a",
        "course",
        "may",
        "leibniz",
        "simply",
        "see",
        "implication",
        "held",
        "incoherent",
        "theory",
        "consciousness",
        "another",
        "candidate",
        "theory",
        "near",
        "neighborhood",
        "consider",
        "leibniz",
        "say",
        "simple",
        "substance",
        "call",
        "monad",
        "following",
        "passage",
        "ince",
        "nature",
        "monad",
        "representative",
        "nothing",
        "limit",
        "represent",
        "part",
        "thing",
        "however",
        "true",
        "representation",
        "confused",
        "detail",
        "whole",
        "universe",
        "distinct",
        "small",
        "portion",
        "thing",
        "either",
        "closest",
        "greatest",
        "respect",
        "monad",
        "otherwise",
        "monad",
        "would",
        "divinity",
        "monad",
        "limited",
        "object",
        "respect",
        "modification",
        "knowledge",
        "monad",
        "go",
        "confusedly",
        "infinity",
        "whole",
        "limited",
        "differentiated",
        "degree",
        "distinct",
        "perception",
        "monadology",
        "ag",
        "leibniz",
        "start",
        "articulating",
        "universal",
        "expression",
        "thesisall",
        "simple",
        "substance",
        "represent",
        "whole",
        "distinguishes",
        "one",
        "another",
        "relative",
        "degree",
        "distinct",
        "perception",
        "track",
        "thing",
        "closest",
        "orgreatest",
        "respect",
        "monad",
        "combining",
        "leibniz",
        "say",
        "similar",
        "text",
        "see",
        "leibniz",
        "articulating",
        "broadly",
        "functional",
        "account",
        "consciousness",
        "consciousness",
        "function",
        "perceptual",
        "distinctness",
        "function",
        "thing",
        "represented",
        "individual",
        "monad",
        "see",
        "perceptual",
        "distinctness",
        "arises",
        "variety",
        "representation",
        "leibniz",
        "provides",
        "famous",
        "example",
        "sound",
        "ocean",
        "give",
        "clearer",
        "idea",
        "minute",
        "perception",
        "unable",
        "pick",
        "crowd",
        "like",
        "use",
        "example",
        "roaring",
        "noise",
        "sea",
        "impress",
        "u",
        "standing",
        "shore",
        "hear",
        "noise",
        "must",
        "hear",
        "part",
        "make",
        "whole",
        "noise",
        "wave",
        "although",
        "little",
        "noise",
        "make",
        "known",
        "combined",
        "confusedly",
        "others",
        "would",
        "noticed",
        "wave",
        "made",
        "rb",
        "tiny",
        "wave",
        "sound",
        "impress",
        "sensory",
        "organ",
        "combined",
        "noticeable",
        "sound",
        "one",
        "stand",
        "rest",
        "background",
        "representation",
        "world",
        "noticeable",
        "perception",
        "leibniz",
        "say",
        "arise",
        "degree",
        "one",
        "minute",
        "noticed",
        "rb",
        "way",
        "distinct",
        "perception",
        "arise",
        "depends",
        "functional",
        "organization",
        "body",
        "principle",
        "nature",
        "grace",
        "leibniz",
        "say",
        "simple",
        "substance",
        "body",
        "organ",
        "adjusted",
        "way",
        "contrast",
        "distinction",
        "among",
        "impression",
        "receive",
        "consequently",
        "contrast",
        "distinction",
        "perception",
        "represent",
        "themthen",
        "may",
        "amount",
        "sensation",
        "ag",
        "contrast",
        "noticeable",
        "perception",
        "arises",
        "function",
        "body",
        "confusing",
        "fusing",
        "together",
        "representation",
        "external",
        "world",
        "way",
        "become",
        "distinctive",
        "although",
        "confused",
        "perception",
        "stand",
        "perceptual",
        "backgroundthey",
        "confused",
        "distinct",
        "occurs",
        "depend",
        "variety",
        "factor",
        "including",
        "ability",
        "sophistication",
        "sense",
        "organ",
        "disposition",
        "individual",
        "etc",
        "additionally",
        "matter",
        "degreecertain",
        "representation",
        "stand",
        "others",
        "leibniz",
        "consciousness",
        "matter",
        "degree",
        "however",
        "order",
        "leibniz",
        "account",
        "transition",
        "consciousness",
        "whether",
        "mind",
        "becoming",
        "conscious",
        "whether",
        "transition",
        "mind",
        "becoming",
        "conscious",
        "particular",
        "object",
        "case",
        "degree",
        "perceptual",
        "distinctness",
        "result",
        "consciousness",
        "rather",
        "leibniz",
        "theory",
        "consciousness",
        "appears",
        "entail",
        "certain",
        "minimal",
        "threshold",
        "consciousness",
        "arises",
        "threshold",
        "might",
        "sensitive",
        "context",
        "status",
        "mindthings",
        "notice",
        "wide",
        "awake",
        "go",
        "unnoticed",
        "sound",
        "sleep",
        "one",
        "example",
        "leibniz",
        "provides",
        "along",
        "explanation",
        "hundred",
        "indication",
        "leading",
        "u",
        "conclude",
        "every",
        "moment",
        "u",
        "infinity",
        "perception",
        "unaccompanied",
        "awareness",
        "apperception",
        "reflection",
        "alteration",
        "soul",
        "unaware",
        "impression",
        "either",
        "minute",
        "numerous",
        "else",
        "unvarying",
        "sufficiently",
        "distinctive",
        "combined",
        "others",
        "nevertheless",
        "effect",
        "make",
        "felt",
        "least",
        "confusedly",
        "within",
        "whole",
        "become",
        "accustomed",
        "motion",
        "mill",
        "waterfall",
        "living",
        "beside",
        "awhile",
        "pay",
        "heed",
        "motion",
        "cease",
        "strike",
        "senseorgans",
        "something",
        "corresponding",
        "still",
        "occur",
        "soul",
        "harmony",
        "soul",
        "body",
        "impression",
        "soul",
        "body",
        "lacking",
        "appeal",
        "novelty",
        "forceful",
        "enough",
        "attract",
        "attention",
        "memory",
        "applied",
        "compelling",
        "object",
        "rb",
        "note",
        "leibniz",
        "reaffirms",
        "aware",
        "perception",
        "sufficiently",
        "distinctive",
        "forceful",
        "enough",
        "suggests",
        "certain",
        "level",
        "perceptual",
        "distinctness",
        "force",
        "make",
        "felt",
        "case",
        "millyou",
        "move",
        "next",
        "door",
        "mill",
        "sleep",
        "noise",
        "time",
        "become",
        "accustomed",
        "sound",
        "mill",
        "longer",
        "notice",
        "sort",
        "phenomenological",
        "fact",
        "recognize",
        "leibniz",
        "think",
        "explain",
        "term",
        "variation",
        "perceptual",
        "distinctness",
        "say",
        "noise",
        "longer",
        "affect",
        "sensory",
        "organsthe",
        "noise",
        "continues",
        "registered",
        "internally",
        "something",
        "lack",
        "novelty",
        "result",
        "transition",
        "consciousness",
        "longer",
        "notice",
        "noise",
        "least",
        "notice",
        "nearly",
        "much",
        "explains",
        "leibniz",
        "think",
        "give",
        "natural",
        "explanation",
        "term",
        "forcefulness",
        "impression",
        "somehow",
        "becomes",
        "le",
        "forceful",
        "time",
        "leibniz",
        "give",
        "u",
        "full",
        "account",
        "think",
        "see",
        "promise",
        "theory",
        "investigate",
        "cause",
        "thus",
        "leibniz",
        "may",
        "seen",
        "providing",
        "fully",
        "naturalized",
        "philosophy",
        "mind",
        "advocate",
        "threshold",
        "theory",
        "consciousness",
        "sameorder",
        "theory",
        "consciousnessfor",
        "leibniz",
        "conscious",
        "perception",
        "distinct",
        "perception",
        "level",
        "distinctness",
        "perception",
        "stand",
        "sufficiently",
        "noticed",
        "perceiving",
        "substance",
        "perception",
        "degree",
        "distinctness",
        "perceiving",
        "substance",
        "distinct",
        "perception",
        "rather",
        "requires",
        "threshold",
        "degree",
        "distinctness",
        "relative",
        "context",
        "perception",
        "distinct",
        "full",
        "account",
        "position",
        "see",
        "ch",
        "jorgensen",
        "leibniz",
        "never",
        "us",
        "term",
        "threshold",
        "discussing",
        "consciousness",
        "example",
        "appeal",
        "threshold",
        "one",
        "way",
        "another",
        "say",
        "later",
        "new",
        "essay",
        "iprefer",
        "distinguish",
        "perception",
        "aware",
        "apperception",
        "instance",
        "perception",
        "light",
        "color",
        "aware",
        "made",
        "many",
        "minute",
        "perception",
        "unaware",
        "noise",
        "perceive",
        "attend",
        "brought",
        "within",
        "reach",
        "awareness",
        "tiny",
        "increase",
        "addition",
        "thus",
        "level",
        "noise",
        "noticed",
        "leibniz",
        "silent",
        "precisely",
        "threshold",
        "determined",
        "although",
        "frequently",
        "claim",
        "difference",
        "kind",
        "although",
        "continuous",
        "kind",
        "arise",
        "infinite",
        "infinitesimal",
        "tension",
        "many",
        "phenomenon",
        "consciousness",
        "apparently",
        "arise",
        "midlevel",
        "degree",
        "perceptual",
        "distinctness",
        "description",
        "difference",
        "conscious",
        "perception",
        "light",
        "unconscious",
        "perception",
        "light",
        "another",
        "area",
        "leibniz",
        "offering",
        "theory",
        "optimistic",
        "relevant",
        "natural",
        "factor",
        "determining",
        "threshold",
        "discovered",
        "science",
        "pneumatology",
        "indeed",
        "cognitive",
        "science",
        "made",
        "progress",
        "direction",
        "overall",
        "transition",
        "made",
        "initial",
        "transition",
        "morallyladen",
        "concept",
        "fully",
        "psychological",
        "concept",
        "made",
        "descartes",
        "cambridge",
        "platonist",
        "cartesian",
        "leibniz",
        "see",
        "attempt",
        "clarify",
        "concept",
        "provide",
        "coherent",
        "analysis",
        "concept",
        "leibniz",
        "account",
        "spinoza",
        "account",
        "insofar",
        "one",
        "treat",
        "consciousness",
        "natural",
        "phenomenon",
        "explained",
        "natural",
        "way",
        "endeavor",
        "explain",
        "consciousness",
        "term",
        "underlying",
        "mental",
        "representation",
        "obvious",
        "connection",
        "representational",
        "functional",
        "account",
        "consciousness",
        "continue",
        "day",
        "topic",
        "consciousness",
        "leibniz",
        "see",
        "barth",
        "bolton",
        "de",
        "gaudemar",
        "furth",
        "jorgensen",
        "a",
        "b",
        "kulstad",
        "thiel",
        "section",
        "chapter",
        "simmons"
    ]
}