{
    "main_text": "Originalism\n8. Originalism\n\nOriginalism comes in a wide variety of forms (Bork 1990;\nScalia 1997; Whittington 1999b; Barnett 2004; Solum 2008). An\noriginalist might claim that her view follows necessarily from a more\ngeneral theory of interpretation: to interpret is necessarily to\nretrieve something that existed at the time of\nauthorship—an original object. Another might be happy to\nacknowledge that interpretation could, theoretically, take the form of\nan innovative or creative interpretation that\nevaluates or in some way changes an original, as might be the case\nwith a revolutionary interpretation of a play or work of art. But such\na theorist might go on to add that, for reasons of political morality\nhaving to do with, e.g., the principles of democracy, the rule of law,\nand values underlying the separation of powers, such innovative\ninterpretations ought never be pursued by constitutional interpreters.\nThe object of constitutional interpretation should, to the greatest\nextent possible, remain fixed by factors like original public\nunderstandings or authorial intentions. Yet another originalist might\nbe content to leave a little leeway here, suggesting something like\nthe following: though there is a presumption, perhaps a very heavy\none, in favor of interpretation as retrieval of an original, it is one\nwhich can, on very rare occasions and for truly exceptional reasons,\nbe overcome. For example, this originalist might say that the\npresumption in favor of retrieval can be defeated when there is a\ndiscernible and profound sea change in popular views on some important\nissue of political morality implicated by an abstract constitutional\nprovision. This was arguably the case in the United States with\nrespect to slavery and equal protection. Presumably ‘equal\nprotection’ was originally understood, both by the authors of\nthe 14th Amendment and by the people on whose behalf they\nacted, as fully consistent with segregation. This concrete\nunderstanding of equal protection is now, of course, widely condemned.\nIts wholesale rejection served as the main inspiration behind\nBrown v. Board of Education, whose innovative interpretation\nof the equal protection clause arguably changed or replaced the\noriginal understanding of the\n notion.[16]\n Yet another concession, in this\ncase one that seems embraced by all originalists, concerns the force\nand effect of authoritative court interpretations of the constitution.\nMany originalists believe that Roe v.\n Wade[17]\n rested on a mistaken\ninterpretation of the United States Constitution, one that flew in the\nface of original understandings and intentions; but virtually no\noriginalist would have gone so far as to deny, before Roe was\noverturned by the US Supreme Court in \nDobbs,[18]\nthat any contemporary interpretation of the First, Fourth, Fifth,\nNinth and Fourteenth Amendments could be justified only if it can be\nreconciled with that decision. In other words, virtually all\noriginalists agree that established precedent can sometimes override\noriginal understanding. Whether this apparent concession is in the end\nconsistent with the spirit of originalism is, perhaps, questionable.\nSuch ‘faint-hearted originalism’ (Scalia 1989) may reduce,\nin the end, to a form of living\n constitutionalism.[19]\n Indeed, as we shall see in the next section, the role of judicial\ninterpretations of abstract constitutional provisions is central to\nthat prominent form of living constitutionalism which views\nconstitutional interpretation as resting on a form of common-law\nreasoning.\n\nAnother way in which originalists have split is over the identity of\nthe original object of interpretation. Walter Benn Michaels is among\nthose who defend Original Intent Originalism, the\nview that “you can’t do textual interpretation without some\nappeal to authorial intention and, perhaps more controversially, you\ncan’t (coherently and non-arbitrarily) think of yourself as still\ndoing textual interpretation as soon as you appeal to something\nbeyond authorial intention...” (Michaels, 2009, 21) Keith Whittington,\nRandy Barnett, and Larry Solum, on the other hand, defend Original\nPublic Meaning Originalism, commonly referred to as New\nOriginalism, which “emphasizes the meaning that the Constitution\n(or its amendments) would have had to the relevant audience at the\ntime of its adoption.” (Solum 2021) Whatever its precise contours, an\noriginalist theory is likely to rest on the fixed view of a\nconstitution. The constitution’s rules and principles are fixed\nby original public meaning or its authors’ intentions and,\n(barring formal constitutional amendment) these must not be revisited\nand revised lest the authority and stability of the constitution be\nthreatened. Original intentions or public meanings must always govern\nthe interpretation of a constitution, not the new value judgements and\ndecisions of contemporary judges (or other interpreters) asking the\nvery same questions the author’s actions and decisions were\nsupposed to have settled. \n\nOriginalism in all its many forms has undergone extensive critique.\nFor example, original intentions and public meaning are often unclear,\nif not largely indeterminate, leaving the interpreter with the need to\nappeal to other factors. In addition, original intentions and\nunderstandings can vary from one person to the next. Sometimes the\nonly things upon which joint authors or members of the relevant\noriginal audience can agree are the particular words to be included in\nthe constitution. The intentions behind that choice can, however, vary\nsignificantly, as can original understandings of what those words\nmean. These can range from the very general to the highly specific. At\none end of the spectrum are the various, and sometimes conflicting,\ngoals and values the authors of a constitutional\nprovision intended their creation to achieve and which an original\ninterpreter might understand the provision to be all about. At the\nother end are the very specific applications the authors\nmight have had in mind when they chose the particular words upon which\nthey settled, and which would generally have been understood by the\nrelevant audience to cover. Did the intended or understood\napplications of an equality provision encompass equal access to\nthe legal system by all groups within society? Or only something\nmore specific like equal access to fairness at trial. Did\nthey perhaps include equal economic and social opportunities\nfor all groups? Different authors might have intended all, none, or\nsome of these applications when they agreed upon the equality\nprovision, and similar things can be said about the corresponding\nunderstandings of members of the original audience. As with the\ngeneral goals and values underlying a provision, there is room for\ninconsistence and conflict. In light of this fact, it can often be\nunhelpful, when interpreting a constitution, to rely exclusively on\noriginal intentions or public meanings.\n\nLet’s suppose, however, that this is not the case: that there is\na way for contemporary interpreters actually to determine,\nindependently of their own moral and political views, either the\noriginal intentions of constitutional authors or what the earlier\ngeneration would have understood the relevant constitutional\nprovision(s) to mean. Would a constitution, understood in one of these\ntwo ways, and serving the role ascribed to it by the fixed view, be a\ngood thing for a democratic society to have? Not according to many\nconstitutional scholars. As noted above, constitutions are intended to\nlast a long time and to span many generations. This is one of the main\nreasons they tend to be entrenched. Suppose that an entrenched\nconstitution has in fact been in existence for a very long time. In\nsuch a scenario, we should distinguish between two groups of people:\nthe people-now and the people-then. According to\noriginalism, it is the understandings and intentions of the\npeople-then that will control the proper application by the people-now\nof constitutional provisions in contemporary settings. In other words,\nthe people-now will in effect be shackled in their attempts to\nexercise political choice by the prior decisions of someone else —\nthe people-then. It’s at the very least questionable whether\nthis scenario is consistent with our understanding of democracy as a\nsystem of ongoing self-government. To be self-governing in an ongoing\nmanner, one must be able to change one’s mind.\n\nHow might an originalist get round this apparent difficulty? One way\nis to note that the so-called dead hand of the past can always be\nremoved through constitutional amendment, difficult as this process\nmight be to engage successfully. A second way is the one generally\npursued by new originalists, who draw a distinction between\ninterpretation, on the one hand, and construction,\non the other. The former is the process of discovering the\ncommunicative meaning or content of words in the text of the\nconstitution, while the latter consists of putting that meaning or\ncontent into effect by applying it in particular cases. (Barnett 1999\n& 2011; Whittington 1999) According to these new public meaning\noriginalists, the dead hand of the past extends only to the\ncommunicative meaning or content of the relevant text and to the\nprocess of interpreting it. And importantly, though the communicative\nmeaning or content of, e.g., ‘free expression’, ‘due\nprocess’ or ‘cruel and unusual punishment’ is the\nsame now as it was when provisions incorporating these notion were\nfirst introduced in, e.g., the US Constitution, that unchanged\ncommunicative meaning is not the primary focus in most controversial\nconstitutional cases where questions of construction take the leading\nrole. Here contemporary interpreters must exercise fresh judgment in\napplying unchanged, but largely uncontentious, original meaning of a\nconstitution’s terms to the complex, new and contentious\nsituations constitutional rights cases being to the fore. They must\nconstruct an understanding of, e.g., the right to free expression that\nallows them to decide controversial cases involving such things as\nonline bullying or attempts to unduly influence voters through the use\nof internet bots. Given the highly abstract nature of this\nconstitutional right, it seems likely that judicial construction will\nplay the leading role in the vast majority of cases involving its\napplication. And if this is so, then whatever reach the dead hand of\nthe past might have, it will end up being quite minimal.\n",
    "section_title": "8. Originalism",
    "entry_title": "Constitutionalism",
    "hierarchy_title": "Constitutionalism || Originalism",
    "tokenized_text": [
        "originalism",
        "originalism",
        "originalism",
        "come",
        "wide",
        "variety",
        "form",
        "bork",
        "scalia",
        "whittington",
        "b",
        "barnett",
        "solum",
        "originalist",
        "might",
        "claim",
        "view",
        "follows",
        "necessarily",
        "general",
        "theory",
        "interpretation",
        "interpret",
        "necessarily",
        "retrieve",
        "something",
        "existed",
        "time",
        "authorshipan",
        "original",
        "object",
        "another",
        "might",
        "happy",
        "acknowledge",
        "interpretation",
        "could",
        "theoretically",
        "take",
        "form",
        "innovative",
        "creative",
        "interpretation",
        "evaluates",
        "way",
        "change",
        "original",
        "might",
        "case",
        "revolutionary",
        "interpretation",
        "play",
        "work",
        "art",
        "theorist",
        "might",
        "go",
        "add",
        "reason",
        "political",
        "morality",
        "eg",
        "principle",
        "democracy",
        "rule",
        "law",
        "value",
        "underlying",
        "separation",
        "power",
        "innovative",
        "interpretation",
        "ought",
        "never",
        "pursued",
        "constitutional",
        "interpreter",
        "object",
        "constitutional",
        "interpretation",
        "greatest",
        "extent",
        "possible",
        "remain",
        "fixed",
        "factor",
        "like",
        "original",
        "public",
        "understanding",
        "authorial",
        "intention",
        "yet",
        "another",
        "originalist",
        "might",
        "content",
        "leave",
        "little",
        "leeway",
        "suggesting",
        "something",
        "like",
        "following",
        "though",
        "presumption",
        "perhaps",
        "heavy",
        "one",
        "favor",
        "interpretation",
        "retrieval",
        "original",
        "one",
        "rare",
        "occasion",
        "truly",
        "exceptional",
        "reason",
        "overcome",
        "example",
        "originalist",
        "might",
        "say",
        "presumption",
        "favor",
        "retrieval",
        "defeated",
        "discernible",
        "profound",
        "sea",
        "change",
        "popular",
        "view",
        "important",
        "issue",
        "political",
        "morality",
        "implicated",
        "abstract",
        "constitutional",
        "provision",
        "arguably",
        "case",
        "united",
        "state",
        "respect",
        "slavery",
        "equal",
        "protection",
        "presumably",
        "equal",
        "protection",
        "originally",
        "understood",
        "author",
        "th",
        "amendment",
        "people",
        "whose",
        "behalf",
        "acted",
        "fully",
        "consistent",
        "segregation",
        "concrete",
        "understanding",
        "equal",
        "protection",
        "course",
        "widely",
        "condemned",
        "wholesale",
        "rejection",
        "served",
        "main",
        "inspiration",
        "behind",
        "brown",
        "v",
        "board",
        "education",
        "whose",
        "innovative",
        "interpretation",
        "equal",
        "protection",
        "clause",
        "arguably",
        "changed",
        "replaced",
        "original",
        "understanding",
        "notion",
        "yet",
        "another",
        "concession",
        "case",
        "one",
        "seems",
        "embraced",
        "originalists",
        "concern",
        "force",
        "effect",
        "authoritative",
        "court",
        "interpretation",
        "constitution",
        "many",
        "originalists",
        "believe",
        "roe",
        "v",
        "wade",
        "rested",
        "mistaken",
        "interpretation",
        "united",
        "state",
        "constitution",
        "one",
        "flew",
        "face",
        "original",
        "understanding",
        "intention",
        "virtually",
        "originalist",
        "would",
        "gone",
        "far",
        "deny",
        "roe",
        "overturned",
        "u",
        "supreme",
        "court",
        "dobbs",
        "contemporary",
        "interpretation",
        "first",
        "fourth",
        "fifth",
        "ninth",
        "fourteenth",
        "amendment",
        "could",
        "justified",
        "reconciled",
        "decision",
        "word",
        "virtually",
        "originalists",
        "agree",
        "established",
        "precedent",
        "sometimes",
        "override",
        "original",
        "understanding",
        "whether",
        "apparent",
        "concession",
        "end",
        "consistent",
        "spirit",
        "originalism",
        "perhaps",
        "questionable",
        "fainthearted",
        "originalism",
        "scalia",
        "may",
        "reduce",
        "end",
        "form",
        "living",
        "constitutionalism",
        "indeed",
        "shall",
        "see",
        "next",
        "section",
        "role",
        "judicial",
        "interpretation",
        "abstract",
        "constitutional",
        "provision",
        "central",
        "prominent",
        "form",
        "living",
        "constitutionalism",
        "view",
        "constitutional",
        "interpretation",
        "resting",
        "form",
        "commonlaw",
        "reasoning",
        "another",
        "way",
        "originalists",
        "split",
        "identity",
        "original",
        "object",
        "interpretation",
        "walter",
        "benn",
        "michael",
        "among",
        "defend",
        "original",
        "intent",
        "originalism",
        "view",
        "textual",
        "interpretation",
        "without",
        "appeal",
        "authorial",
        "intention",
        "perhaps",
        "controversially",
        "coherently",
        "nonarbitrarily",
        "think",
        "still",
        "textual",
        "interpretation",
        "soon",
        "appeal",
        "something",
        "beyond",
        "authorial",
        "intention",
        "michael",
        "keith",
        "whittington",
        "randy",
        "barnett",
        "larry",
        "solum",
        "hand",
        "defend",
        "original",
        "public",
        "meaning",
        "originalism",
        "commonly",
        "referred",
        "new",
        "originalism",
        "emphasizes",
        "meaning",
        "constitution",
        "amendment",
        "would",
        "relevant",
        "audience",
        "time",
        "adoption",
        "solum",
        "whatever",
        "precise",
        "contour",
        "originalist",
        "theory",
        "likely",
        "rest",
        "fixed",
        "view",
        "constitution",
        "constitution",
        "rule",
        "principle",
        "fixed",
        "original",
        "public",
        "meaning",
        "author",
        "intention",
        "barring",
        "formal",
        "constitutional",
        "amendment",
        "must",
        "revisited",
        "revised",
        "lest",
        "authority",
        "stability",
        "constitution",
        "threatened",
        "original",
        "intention",
        "public",
        "meaning",
        "must",
        "always",
        "govern",
        "interpretation",
        "constitution",
        "new",
        "value",
        "judgement",
        "decision",
        "contemporary",
        "judge",
        "interpreter",
        "asking",
        "question",
        "author",
        "action",
        "decision",
        "supposed",
        "settled",
        "originalism",
        "many",
        "form",
        "undergone",
        "extensive",
        "critique",
        "example",
        "original",
        "intention",
        "public",
        "meaning",
        "often",
        "unclear",
        "largely",
        "indeterminate",
        "leaving",
        "interpreter",
        "need",
        "appeal",
        "factor",
        "addition",
        "original",
        "intention",
        "understanding",
        "vary",
        "one",
        "person",
        "next",
        "sometimes",
        "thing",
        "upon",
        "joint",
        "author",
        "member",
        "relevant",
        "original",
        "audience",
        "agree",
        "particular",
        "word",
        "included",
        "constitution",
        "intention",
        "behind",
        "choice",
        "however",
        "vary",
        "significantly",
        "original",
        "understanding",
        "word",
        "mean",
        "range",
        "general",
        "highly",
        "specific",
        "one",
        "end",
        "spectrum",
        "various",
        "sometimes",
        "conflicting",
        "goal",
        "value",
        "author",
        "constitutional",
        "provision",
        "intended",
        "creation",
        "achieve",
        "original",
        "interpreter",
        "might",
        "understand",
        "provision",
        "end",
        "specific",
        "application",
        "author",
        "might",
        "mind",
        "chose",
        "particular",
        "word",
        "upon",
        "settled",
        "would",
        "generally",
        "understood",
        "relevant",
        "audience",
        "cover",
        "intended",
        "understood",
        "application",
        "equality",
        "provision",
        "encompass",
        "equal",
        "access",
        "legal",
        "system",
        "group",
        "within",
        "society",
        "something",
        "specific",
        "like",
        "equal",
        "access",
        "fairness",
        "trial",
        "perhaps",
        "include",
        "equal",
        "economic",
        "social",
        "opportunity",
        "group",
        "different",
        "author",
        "might",
        "intended",
        "none",
        "application",
        "agreed",
        "upon",
        "equality",
        "provision",
        "similar",
        "thing",
        "said",
        "corresponding",
        "understanding",
        "member",
        "original",
        "audience",
        "general",
        "goal",
        "value",
        "underlying",
        "provision",
        "room",
        "inconsistence",
        "conflict",
        "light",
        "fact",
        "often",
        "unhelpful",
        "interpreting",
        "constitution",
        "rely",
        "exclusively",
        "original",
        "intention",
        "public",
        "meaning",
        "let",
        "suppose",
        "however",
        "case",
        "way",
        "contemporary",
        "interpreter",
        "actually",
        "determine",
        "independently",
        "moral",
        "political",
        "view",
        "either",
        "original",
        "intention",
        "constitutional",
        "author",
        "earlier",
        "generation",
        "would",
        "understood",
        "relevant",
        "constitutional",
        "provision",
        "mean",
        "would",
        "constitution",
        "understood",
        "one",
        "two",
        "way",
        "serving",
        "role",
        "ascribed",
        "fixed",
        "view",
        "good",
        "thing",
        "democratic",
        "society",
        "according",
        "many",
        "constitutional",
        "scholar",
        "noted",
        "constitution",
        "intended",
        "last",
        "long",
        "time",
        "span",
        "many",
        "generation",
        "one",
        "main",
        "reason",
        "tend",
        "entrenched",
        "suppose",
        "entrenched",
        "constitution",
        "fact",
        "existence",
        "long",
        "time",
        "scenario",
        "distinguish",
        "two",
        "group",
        "people",
        "peoplenow",
        "peoplethen",
        "according",
        "originalism",
        "understanding",
        "intention",
        "peoplethen",
        "control",
        "proper",
        "application",
        "peoplenow",
        "constitutional",
        "provision",
        "contemporary",
        "setting",
        "word",
        "peoplenow",
        "effect",
        "shackled",
        "attempt",
        "exercise",
        "political",
        "choice",
        "prior",
        "decision",
        "someone",
        "else",
        "peoplethen",
        "least",
        "questionable",
        "whether",
        "scenario",
        "consistent",
        "understanding",
        "democracy",
        "system",
        "ongoing",
        "selfgovernment",
        "selfgoverning",
        "ongoing",
        "manner",
        "one",
        "must",
        "able",
        "change",
        "one",
        "mind",
        "might",
        "originalist",
        "get",
        "round",
        "apparent",
        "difficulty",
        "one",
        "way",
        "note",
        "socalled",
        "dead",
        "hand",
        "past",
        "always",
        "removed",
        "constitutional",
        "amendment",
        "difficult",
        "process",
        "might",
        "engage",
        "successfully",
        "second",
        "way",
        "one",
        "generally",
        "pursued",
        "new",
        "originalists",
        "draw",
        "distinction",
        "interpretation",
        "one",
        "hand",
        "construction",
        "former",
        "process",
        "discovering",
        "communicative",
        "meaning",
        "content",
        "word",
        "text",
        "constitution",
        "latter",
        "consists",
        "putting",
        "meaning",
        "content",
        "effect",
        "applying",
        "particular",
        "case",
        "barnett",
        "whittington",
        "according",
        "new",
        "public",
        "meaning",
        "originalists",
        "dead",
        "hand",
        "past",
        "extends",
        "communicative",
        "meaning",
        "content",
        "relevant",
        "text",
        "process",
        "interpreting",
        "importantly",
        "though",
        "communicative",
        "meaning",
        "content",
        "eg",
        "free",
        "expression",
        "due",
        "process",
        "cruel",
        "unusual",
        "punishment",
        "provision",
        "incorporating",
        "notion",
        "first",
        "introduced",
        "eg",
        "u",
        "constitution",
        "unchanged",
        "communicative",
        "meaning",
        "primary",
        "focus",
        "controversial",
        "constitutional",
        "case",
        "question",
        "construction",
        "take",
        "leading",
        "role",
        "contemporary",
        "interpreter",
        "must",
        "exercise",
        "fresh",
        "judgment",
        "applying",
        "unchanged",
        "largely",
        "uncontentious",
        "original",
        "meaning",
        "constitution",
        "term",
        "complex",
        "new",
        "contentious",
        "situation",
        "constitutional",
        "right",
        "case",
        "fore",
        "must",
        "construct",
        "understanding",
        "eg",
        "right",
        "free",
        "expression",
        "allows",
        "decide",
        "controversial",
        "case",
        "involving",
        "thing",
        "online",
        "bullying",
        "attempt",
        "unduly",
        "influence",
        "voter",
        "use",
        "internet",
        "bot",
        "given",
        "highly",
        "abstract",
        "nature",
        "constitutional",
        "right",
        "seems",
        "likely",
        "judicial",
        "construction",
        "play",
        "leading",
        "role",
        "vast",
        "majority",
        "case",
        "involving",
        "application",
        "whatever",
        "reach",
        "dead",
        "hand",
        "past",
        "might",
        "end",
        "quite",
        "minimal"
    ]
}