{
    "main_text": "The Nature of Conservatism || Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism\n1.4 Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism\n\nConservatism has been equated with pragmatism or political realism;\nGamble (2012) argues that conservative political “thought”\nis all practice—self-interested practice. But conservatism is\ngenerally regarded as a philosophy, if not a systematic one. Two\ncontrasting interpretations of conservatism distinguish it from mere\npragmatism. Both reject a priori reasoning, revolution and\nsocial experiments; both trust experience, look for gradual\nimprovement of tried and tested arrangements, and sympathise with the\npragmatist’s motto “if it ain’t broke, don’t\nfix it”; both are sceptical of reason, and are\nparticularist:\n\n(1) relativistic conservatism suggests that if socialism, feudalism or\nfascism works well in some country, one should try to make it run\nbetter through minor improvements based on experience and accumulated\nwisdom. The judgement of whether something is broken or runs\nreasonably well appeals to values accepted in the relevant society.\nThus conservatives in reasonably functioning socialist, feudal and\nfascist countries advocate different modes of social organisation and\ngradual improvement, according to prevailing values. On this view,\nconservative particularism is relativistic.\n\n(2) non-relativistic conservatism rejects views such as socialism,\nlibertarianism and fascism that aim to structure society around a\nsingle rationally-articulated organising principle. On this\ninterpretation of conservatism, particularism does not imply\nrelativism. Revolutionary systems, and autocratic systems with no\npossibility of incremental change—societies that do not exhibit\nliving traditions—are not amenable to a conservative outlook. On\nthis view, conservatism is situational, but some situations do not\npermit conservative responses.\n\nThe sarcastic dismissal of Burke by a liberal defender of the\nRevolution, J.S. Mill’s father James, is effective only against\nposition (1), relativistic conservatism:\n\n\nIn the case of public institutions, Mr. Burke had…worked\nhimself into an artificial admiration of the bare fact of existence;\nespecially ancient existence. Everything was to be protected, not\nbecause it was good, but, because it existed. Evil, to render itself\nan object of reverence in his eye, required only to be realised.\n(James Mill 1858: Vol. V, 200–1)\n\n\nYet only position (2), non-relativistic conservatism, can express the\nconservative criterion of a well-functioning society, in terms of\norganic tradition; there is no such thing, in these terms, as a\n“reasonably functioning totalitarian society”. This\nnon-relativist position is minimally rational and universal, while\nremaining particularist. (This terminology is elucidated further at\n 2.3).\n (Lock (2006) regards (1) and (2) as an unBurkean choice between\nconstructed opposites, arguing that Burke is not strongly relativist,\nbut recognises temporal and geographical differences that amount to a\nkind of relativism.)\n\nConservatives seek to “preserve the political\narrangements…shown to be conducive to good lives”, writes\nKekes (1997: 351–2). Perhaps he overlooks the contestability of\nconceptions of the good life, and of arrangements that preserve it;\nliberals, for instance, stress the value of individual freedom,\nindependent of what they may see as burdensome constraints of\ntradition. According to (2), there is a conservative conception of the\ngood life, and of the arrangements that preserve it—one that\nrejects the over-valuation of Enlightenment rationalism and\nrevolution. But as we will see, conservatives must steer a course\nbetween an unconservative pragmatism, and an unconservative\nsubstantive policy. (The issue recurs throughout this entry,\nespecially in sections\n 2.3\n and\n 3.1.)\n\nFor Graham, conservative scepticism is\n\n\nnot so much a scepticism about the moral perfection of mankind, as a\nscepticism about the knowledge necessary in politics. (1986: 176)\n\n\nBut these are hard to separate. Liberals and socialists stress the\nmalleability of human nature under the influence of changeable\nhistorical conditions. The anti-conservative Rousseau had an\noptimistic conception of human nature, blaming government and society\nfor failings that—according to conservatives—belong to\nindividuals. Conservatives, in contrast, regard human nature as weak\nand fallible, unalterably selfish rather than altruistic (Kekes 1997:\n368). Scruton is typically conservative in regarding human beings as\nfrail creatures of limited sympathy, which they do not easily extend\nto those remote in space or time (Scruton 2012). (Rawls’s\n“limited altruism” in the “circumstances of\njustice” seems derived from Hume, and so might be characterised\nas a conservative feature of Rawls’ thought.) Conservatism is\nimperfectionist, anti-utopian and pragmatic, “unable to appeal\nto any future that is not already present and past” (Scruton\n1980: 27). \n\nConservatism is popularly conflated with neo-conservatism and with\nlibertarianism. But right libertarians and neo-conservatives, unlike\nBurkean conservatives, reject state planning for doctrinaire reasons.\nMaking anti-planning into a principle, or economic liberalism into an\nideology, offends the conservative’s pragmatic, sceptical\ntemper, which could admit a role for state planning and economic\nintervention were such things shown to be effective. Conservatives\nreject ideologies, of which neo-liberalism is one. As Oakeshott\nargues\n\n\nA plan to resist all planning may be better than its opposite, but it\nbelongs to the same style of politics. And only in a society already\ndeeply infected with Rationalism will the conversion of the\ntraditional resources of resistance to the tyranny of Rationalism into\na self-conscious ideology be considered a strengthening of those\nresources. It seems that now, in order to participate in politics [one\nmust have] a doctrine…. (Oakeshott 1991 [1962]: 212)\n\n\nThe conservative’s rejection of rationalism therefore cuts two\nways; it undermines both socialism, and the doctrinaire, free-market\nrejection of socialism. Conservatives oppose rational planning, but do\nnot dogmatically oppose planning that works. Scruton, for instance,\nbelieves that a market economy is most conducive to prosperity, but\nlike Adam Smith, insists that markets should work within, and not\nerode, customs and moral and legal traditions. Burke’s and\nScruton’s conservatism is not an economic view, but one that\nregards society as formed over a long period in relation with place\nand land; it treats rights and duties on the model of the common law,\ndepending on tradition and practice, rather than on abstract notions\nof human rights (see entry on\n rights).\n\nConservatism differs from neo-conservatism and libertarianism in\nmotivation or formal features, therefore. In both the modern U.S.\nRepublican Party (GOP) and British Conservative Party, Burkean\nconservatism has been submerged. The GOP’s anti-governmentalism\nis closer to libertarian traditions; its patriotic and deeply\nreligious standpoints—and what critics regard as its militarism\nand opposition to immigration—coincide only partially with\nBurkean conservatism. (It has been argued (Harvey 2005; Ha Joon Chang\n2003) that neo-conservatives do not reduce state intervention, but\nsimply shift its priorities, while maintaining its massive scale.)\n\nDespite some claims to the contrary, therefore, Nozick’s\nAnarchy State and Utopia is not a conservative rival to\nRawls’ liberal theory (Nozick 1977). Nozick and conservatism\nseem to share a commitment to the invisible hand of the free market,\nand rejection of an extensive state. But Nozick is more plausibly\nregarded as a right libertarian, an extreme classical or neo-liberal.\nIt is wrong to say that he is “rare among conservatives”\nin presenting it with a “general principle or rationale”,\nviz. “from each as they choose, to each as they are\nchosen”, in contrast to the socialist or communist “from\neach according to his ability, to each according to their need”\n(Honderich 2005: 60; see Nozick 1977: 160). Conservatives avoid such\nprinciples. Rejecting Nozick as a model, Scruton stresses that\n“political understanding, as a form of practical judgement, does\nnot readily translate itself into universal principles” (Scruton\n1980: 36).\n\nLibertarianism influences neo-conservatism, but—as an extreme\nform of liberalism—is at best neutral towards\nconservatism’s emphasis on tradition. Perhaps neo-liberalism is\nlibertarianism plus related economic doctrines, while neo-conservatism\nis libertarianism plus elements of traditional conservatism.\nNeo-liberals like Milton Friedman question drug-prohibition and\nconscription, which conservatives and neo-conservatives would not.\n\nConservatism’s popular association with laissez-faire\ncapitalism is also debatable, since it has been associated with feudal\nromanticism. Feudalism is a (contested) label for the economic system\nprevalent in Europe from after the decline of the Roman Empire until\nthe 16th century, and which rested on the holding of land\nin return for labour; in France, it persisted as the ancien\nregime up till the French Revolution. A sympathiser with the\nancien regime such as Burke could therefore be regarded as a\nfeudal romantic. (On feudalism, see Dyer 2002, and Pocock 1987.) Like\nsocialists such as William Morris and Ruskin, many 19th\ncentury conservatives reacted against industrialism and\nlaissez-faire capitalism with a feudal nostalgia. Marx\ncontrasted the warmth and security of feudalism with the inhumanity of\ncapitalism, but rejected “feudal idyllics”, dismissing\nDisraeli and “feudal socialists” for failing to comprehend\n“the march of modern history” (Duncan 1973:\n19–22).\n\nConservatism may seem to share the laissez-faire doctrine,\nimputed to Adam Smith, of the invisible hand—according to which,\nin a free market, unintended consequences of actions tend to promote\nthe general good. The capitalist free market is held to be\nself-regulating; producers and consumers, acting selfishly, benefit\neach other, and rational economic planning disrupts the innate, benign\n“intelligence” of markets. The evolutionary nature and\nanti-statism of laissez-faire theory appeal to conservatives,\nbut to reiterate, they would not offer doctrinaire reasons for\nrejecting planning. In fact, the “invisible hand” was\nunimportant and indeed alien to Smith (Rothschild 2001: 116–56).\nThe allegedly neo-conservative Hayek, with his esteem for “the\nunconscious, the blind, the untheoretical, the imperfectly\nunderstood”, is more Burkean here (Rothschild 2001: 149; see\nalso Scruton 2007); according to Gray, he synthesises “the\ndeepest insights of conservatism with the best elements of classical\nliberalism” (2010: 124). Hayek valued local, transient,\nuntheoretical knowledge, and advocated unfettered markets on the\nconservative sceptical grounds that they best realise organic social\ninstitutions. \n\nSubstantive definitions of conservatism such as Aughey’s should\nbe questioned, therefore. For him it is\n\n\nthe intellectual justification of inequality and privilege, and the\npolitical justification of the authoritative relationships such\ninequalities and privileges demand. (Aughey 1992: 23; also Honderich\n2005: 45)\n\n\nIt is true that no revolution has proclaimed inequality, while for\nBurke, the social order is rooted in it; and conservatives may defend\nan established ruling class, regarding ruling as a skill likely to be\nmost highly developed there. But in Quinton’s influential\naccount, conservatism is more neutral:\n\n\npolitical wisdom…is not to be found in the theoretical\nspeculations of isolated thinkers but in the historically accumulated\nsocial experience of the [whole] community…[in] traditional\ncustoms and institutions [and people with] extensive practical\nexperience of politics. (1978: 16–17)\n\n\nTo reiterate, conservatism is not essentially associated with\naristocracy and hereditary forms of government, or opposed to\ndemocracy. For conservatives, as for Millian liberals, the viability\nof democracy depends on the period and conditions. For Burke, writing\nmuch earlier than Mill, a majority should be drawn only from a body\nqualified by tradition, station, education, property and moral nature;\nhe questioned the “principle that a majority of men told\n[i.e., counted] by the head are to be considered as the\npeople, and that as such their will is to be a law” (Burke 1791,\n‘Thoughts on French Affairs’ [1991]: 344).\n\nWhile conservatism should not be assimilated with neo-conservatism or\nneo-liberalism, many conservatives have converted to the latter:\n\n\nA political outlook that in Burke, Disraeli and Salisbury was\nsceptical of the project of the Enlightenment and suspicious of the\npromise of progress has mortgaged its future on a wager on indefinite\neconomic growth and unfettered market forces. [This] scarcely exhibits\nthe political prudence…once revered as a conservative virtue.\n(Gray 1997: 88)\n\n\nScruton also laments this development, while John Harris comments on\nthe enduring tensions that Margaret Thatcher exposed in\nConservatism:\n\n\nIf you profess to believe in both the unrestrained market and such old\nTory touchstones as family, nation and community, you\nwill…discover that the former eats away at the foundations of\nthe latter (Harris, 2013; Harvey (2005) offers a trenchant critique of\nneo-liberalism and neo-conservatism.) \n\n",
    "section_title": "1.4 Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism",
    "entry_title": "Conservatism",
    "hierarchy_title": "Conservatism || The Nature of Conservatism || Formal procedural vs. substantive senses of “conservatism”; contrast with neo-conservatism and libertarianism",
    "tokenized_text": [
        "nature",
        "conservatism",
        "formal",
        "procedural",
        "vs",
        "substantive",
        "sens",
        "conservatism",
        "contrast",
        "neoconservatism",
        "libertarianism",
        "formal",
        "procedural",
        "vs",
        "substantive",
        "sens",
        "conservatism",
        "contrast",
        "neoconservatism",
        "libertarianism",
        "conservatism",
        "equated",
        "pragmatism",
        "political",
        "realism",
        "gamble",
        "argues",
        "conservative",
        "political",
        "thought",
        "practiceselfinterested",
        "practice",
        "conservatism",
        "generally",
        "regarded",
        "philosophy",
        "systematic",
        "one",
        "two",
        "contrasting",
        "interpretation",
        "conservatism",
        "distinguish",
        "mere",
        "pragmatism",
        "reject",
        "priori",
        "reasoning",
        "revolution",
        "social",
        "experiment",
        "trust",
        "experience",
        "look",
        "gradual",
        "improvement",
        "tried",
        "tested",
        "arrangement",
        "sympathise",
        "pragmatist",
        "motto",
        "broke",
        "fix",
        "sceptical",
        "reason",
        "particularist",
        "relativistic",
        "conservatism",
        "suggests",
        "socialism",
        "feudalism",
        "fascism",
        "work",
        "well",
        "country",
        "one",
        "try",
        "make",
        "run",
        "better",
        "minor",
        "improvement",
        "based",
        "experience",
        "accumulated",
        "wisdom",
        "judgement",
        "whether",
        "something",
        "broken",
        "run",
        "reasonably",
        "well",
        "appeal",
        "value",
        "accepted",
        "relevant",
        "society",
        "thus",
        "conservative",
        "reasonably",
        "functioning",
        "socialist",
        "feudal",
        "fascist",
        "country",
        "advocate",
        "different",
        "mode",
        "social",
        "organisation",
        "gradual",
        "improvement",
        "according",
        "prevailing",
        "value",
        "view",
        "conservative",
        "particularism",
        "relativistic",
        "nonrelativistic",
        "conservatism",
        "reject",
        "view",
        "socialism",
        "libertarianism",
        "fascism",
        "aim",
        "structure",
        "society",
        "around",
        "single",
        "rationallyarticulated",
        "organising",
        "principle",
        "interpretation",
        "conservatism",
        "particularism",
        "imply",
        "relativism",
        "revolutionary",
        "system",
        "autocratic",
        "system",
        "possibility",
        "incremental",
        "changesocieties",
        "exhibit",
        "living",
        "traditionsare",
        "amenable",
        "conservative",
        "outlook",
        "view",
        "conservatism",
        "situational",
        "situation",
        "permit",
        "conservative",
        "response",
        "sarcastic",
        "dismissal",
        "burke",
        "liberal",
        "defender",
        "revolution",
        "js",
        "mill",
        "father",
        "james",
        "effective",
        "position",
        "relativistic",
        "conservatism",
        "case",
        "public",
        "institution",
        "mr",
        "burke",
        "hadworked",
        "artificial",
        "admiration",
        "bare",
        "fact",
        "existence",
        "especially",
        "ancient",
        "existence",
        "everything",
        "protected",
        "good",
        "existed",
        "evil",
        "render",
        "object",
        "reverence",
        "eye",
        "required",
        "realised",
        "james",
        "mill",
        "vol",
        "v",
        "yet",
        "position",
        "nonrelativistic",
        "conservatism",
        "express",
        "conservative",
        "criterion",
        "wellfunctioning",
        "society",
        "term",
        "organic",
        "tradition",
        "thing",
        "term",
        "reasonably",
        "functioning",
        "totalitarian",
        "society",
        "nonrelativist",
        "position",
        "minimally",
        "rational",
        "universal",
        "remaining",
        "particularist",
        "terminology",
        "elucidated",
        "lock",
        "regard",
        "unburkean",
        "choice",
        "constructed",
        "opposite",
        "arguing",
        "burke",
        "strongly",
        "relativist",
        "recognises",
        "temporal",
        "geographical",
        "difference",
        "amount",
        "kind",
        "relativism",
        "conservative",
        "seek",
        "preserve",
        "political",
        "arrangementsshown",
        "conducive",
        "good",
        "life",
        "writes",
        "kekes",
        "perhaps",
        "overlook",
        "contestability",
        "conception",
        "good",
        "life",
        "arrangement",
        "preserve",
        "liberal",
        "instance",
        "stress",
        "value",
        "individual",
        "freedom",
        "independent",
        "may",
        "see",
        "burdensome",
        "constraint",
        "tradition",
        "according",
        "conservative",
        "conception",
        "good",
        "life",
        "arrangement",
        "preserve",
        "itone",
        "reject",
        "overvaluation",
        "enlightenment",
        "rationalism",
        "revolution",
        "see",
        "conservative",
        "must",
        "steer",
        "course",
        "unconservative",
        "pragmatism",
        "unconservative",
        "substantive",
        "policy",
        "issue",
        "recurs",
        "throughout",
        "entry",
        "especially",
        "section",
        "graham",
        "conservative",
        "scepticism",
        "much",
        "scepticism",
        "moral",
        "perfection",
        "mankind",
        "scepticism",
        "knowledge",
        "necessary",
        "politics",
        "hard",
        "separate",
        "liberal",
        "socialist",
        "stress",
        "malleability",
        "human",
        "nature",
        "influence",
        "changeable",
        "historical",
        "condition",
        "anticonservative",
        "rousseau",
        "optimistic",
        "conception",
        "human",
        "nature",
        "blaming",
        "government",
        "society",
        "failing",
        "thataccording",
        "conservativesbelong",
        "individual",
        "conservative",
        "contrast",
        "regard",
        "human",
        "nature",
        "weak",
        "fallible",
        "unalterably",
        "selfish",
        "rather",
        "altruistic",
        "kekes",
        "scruton",
        "typically",
        "conservative",
        "regarding",
        "human",
        "being",
        "frail",
        "creature",
        "limited",
        "sympathy",
        "easily",
        "extend",
        "remote",
        "space",
        "time",
        "scruton",
        "rawls",
        "limited",
        "altruism",
        "circumstance",
        "justice",
        "seems",
        "derived",
        "hume",
        "might",
        "characterised",
        "conservative",
        "feature",
        "rawls",
        "thought",
        "conservatism",
        "imperfectionist",
        "antiutopian",
        "pragmatic",
        "unable",
        "appeal",
        "future",
        "already",
        "present",
        "past",
        "scruton",
        "conservatism",
        "popularly",
        "conflated",
        "neoconservatism",
        "libertarianism",
        "right",
        "libertarian",
        "neoconservatives",
        "unlike",
        "burkean",
        "conservative",
        "reject",
        "state",
        "planning",
        "doctrinaire",
        "reason",
        "making",
        "antiplanning",
        "principle",
        "economic",
        "liberalism",
        "ideology",
        "offends",
        "conservative",
        "pragmatic",
        "sceptical",
        "temper",
        "could",
        "admit",
        "role",
        "state",
        "planning",
        "economic",
        "intervention",
        "thing",
        "shown",
        "effective",
        "conservative",
        "reject",
        "ideology",
        "neoliberalism",
        "one",
        "oakeshott",
        "argues",
        "plan",
        "resist",
        "planning",
        "may",
        "better",
        "opposite",
        "belongs",
        "style",
        "politics",
        "society",
        "already",
        "deeply",
        "infected",
        "rationalism",
        "conversion",
        "traditional",
        "resource",
        "resistance",
        "tyranny",
        "rationalism",
        "selfconscious",
        "ideology",
        "considered",
        "strengthening",
        "resource",
        "seems",
        "order",
        "participate",
        "politics",
        "one",
        "must",
        "doctrine",
        "oakeshott",
        "conservative",
        "rejection",
        "rationalism",
        "therefore",
        "cut",
        "two",
        "way",
        "undermines",
        "socialism",
        "doctrinaire",
        "freemarket",
        "rejection",
        "socialism",
        "conservative",
        "oppose",
        "rational",
        "planning",
        "dogmatically",
        "oppose",
        "planning",
        "work",
        "scruton",
        "instance",
        "belief",
        "market",
        "economy",
        "conducive",
        "prosperity",
        "like",
        "adam",
        "smith",
        "insists",
        "market",
        "work",
        "within",
        "erode",
        "custom",
        "moral",
        "legal",
        "tradition",
        "burke",
        "scruton",
        "conservatism",
        "economic",
        "view",
        "one",
        "regard",
        "society",
        "formed",
        "long",
        "period",
        "relation",
        "place",
        "land",
        "treat",
        "right",
        "duty",
        "model",
        "common",
        "law",
        "depending",
        "tradition",
        "practice",
        "rather",
        "abstract",
        "notion",
        "human",
        "right",
        "see",
        "entry",
        "right",
        "conservatism",
        "differs",
        "neoconservatism",
        "libertarianism",
        "motivation",
        "formal",
        "feature",
        "therefore",
        "modern",
        "us",
        "republican",
        "party",
        "gop",
        "british",
        "conservative",
        "party",
        "burkean",
        "conservatism",
        "submerged",
        "gop",
        "antigovernmentalism",
        "closer",
        "libertarian",
        "tradition",
        "patriotic",
        "deeply",
        "religious",
        "standpointsand",
        "critic",
        "regard",
        "militarism",
        "opposition",
        "immigrationcoincide",
        "partially",
        "burkean",
        "conservatism",
        "argued",
        "harvey",
        "ha",
        "joon",
        "chang",
        "neoconservatives",
        "reduce",
        "state",
        "intervention",
        "simply",
        "shift",
        "priority",
        "maintaining",
        "massive",
        "scale",
        "despite",
        "claim",
        "contrary",
        "therefore",
        "nozick",
        "anarchy",
        "state",
        "utopia",
        "conservative",
        "rival",
        "rawls",
        "liberal",
        "theory",
        "nozick",
        "nozick",
        "conservatism",
        "seem",
        "share",
        "commitment",
        "invisible",
        "hand",
        "free",
        "market",
        "rejection",
        "extensive",
        "state",
        "nozick",
        "plausibly",
        "regarded",
        "right",
        "libertarian",
        "extreme",
        "classical",
        "neoliberal",
        "wrong",
        "say",
        "rare",
        "among",
        "conservative",
        "presenting",
        "general",
        "principle",
        "rationale",
        "viz",
        "choose",
        "chosen",
        "contrast",
        "socialist",
        "communist",
        "according",
        "ability",
        "according",
        "need",
        "honderich",
        "see",
        "nozick",
        "conservative",
        "avoid",
        "principle",
        "rejecting",
        "nozick",
        "model",
        "scruton",
        "stress",
        "political",
        "understanding",
        "form",
        "practical",
        "judgement",
        "readily",
        "translate",
        "universal",
        "principle",
        "scruton",
        "libertarianism",
        "influence",
        "neoconservatism",
        "butas",
        "extreme",
        "form",
        "liberalismis",
        "best",
        "neutral",
        "towards",
        "conservatism",
        "emphasis",
        "tradition",
        "perhaps",
        "neoliberalism",
        "libertarianism",
        "plus",
        "related",
        "economic",
        "doctrine",
        "neoconservatism",
        "libertarianism",
        "plus",
        "element",
        "traditional",
        "conservatism",
        "neoliberals",
        "like",
        "milton",
        "friedman",
        "question",
        "drugprohibition",
        "conscription",
        "conservative",
        "neoconservatives",
        "would",
        "conservatism",
        "popular",
        "association",
        "laissezfaire",
        "capitalism",
        "also",
        "debatable",
        "since",
        "associated",
        "feudal",
        "romanticism",
        "feudalism",
        "contested",
        "label",
        "economic",
        "system",
        "prevalent",
        "europe",
        "decline",
        "roman",
        "empire",
        "th",
        "century",
        "rested",
        "holding",
        "land",
        "return",
        "labour",
        "france",
        "persisted",
        "ancien",
        "regime",
        "till",
        "french",
        "revolution",
        "sympathiser",
        "ancien",
        "regime",
        "burke",
        "could",
        "therefore",
        "regarded",
        "feudal",
        "romantic",
        "feudalism",
        "see",
        "dyer",
        "pocock",
        "like",
        "socialist",
        "william",
        "morris",
        "ruskin",
        "many",
        "th",
        "century",
        "conservative",
        "reacted",
        "industrialism",
        "laissezfaire",
        "capitalism",
        "feudal",
        "nostalgia",
        "marx",
        "contrasted",
        "warmth",
        "security",
        "feudalism",
        "inhumanity",
        "capitalism",
        "rejected",
        "feudal",
        "idyllics",
        "dismissing",
        "disraeli",
        "feudal",
        "socialist",
        "failing",
        "comprehend",
        "march",
        "modern",
        "history",
        "duncan",
        "conservatism",
        "may",
        "seem",
        "share",
        "laissezfaire",
        "doctrine",
        "imputed",
        "adam",
        "smith",
        "invisible",
        "handaccording",
        "free",
        "market",
        "unintended",
        "consequence",
        "action",
        "tend",
        "promote",
        "general",
        "good",
        "capitalist",
        "free",
        "market",
        "held",
        "selfregulating",
        "producer",
        "consumer",
        "acting",
        "selfishly",
        "benefit",
        "rational",
        "economic",
        "planning",
        "disrupts",
        "innate",
        "benign",
        "intelligence",
        "market",
        "evolutionary",
        "nature",
        "antistatism",
        "laissezfaire",
        "theory",
        "appeal",
        "conservative",
        "reiterate",
        "would",
        "offer",
        "doctrinaire",
        "reason",
        "rejecting",
        "planning",
        "fact",
        "invisible",
        "hand",
        "unimportant",
        "indeed",
        "alien",
        "smith",
        "rothschild",
        "allegedly",
        "neoconservative",
        "hayek",
        "esteem",
        "unconscious",
        "blind",
        "untheoretical",
        "imperfectly",
        "understood",
        "burkean",
        "rothschild",
        "see",
        "also",
        "scruton",
        "according",
        "gray",
        "synthesis",
        "deepest",
        "insight",
        "conservatism",
        "best",
        "element",
        "classical",
        "liberalism",
        "hayek",
        "valued",
        "local",
        "transient",
        "untheoretical",
        "knowledge",
        "advocated",
        "unfettered",
        "market",
        "conservative",
        "sceptical",
        "ground",
        "best",
        "realise",
        "organic",
        "social",
        "institution",
        "substantive",
        "definition",
        "conservatism",
        "aughey",
        "questioned",
        "therefore",
        "intellectual",
        "justification",
        "inequality",
        "privilege",
        "political",
        "justification",
        "authoritative",
        "relationship",
        "inequality",
        "privilege",
        "demand",
        "aughey",
        "also",
        "honderich",
        "true",
        "revolution",
        "proclaimed",
        "inequality",
        "burke",
        "social",
        "order",
        "rooted",
        "conservative",
        "may",
        "defend",
        "established",
        "ruling",
        "class",
        "regarding",
        "ruling",
        "skill",
        "likely",
        "highly",
        "developed",
        "quinton",
        "influential",
        "account",
        "conservatism",
        "neutral",
        "political",
        "wisdomis",
        "found",
        "theoretical",
        "speculation",
        "isolated",
        "thinker",
        "historically",
        "accumulated",
        "social",
        "experience",
        "whole",
        "community",
        "traditional",
        "custom",
        "institution",
        "people",
        "extensive",
        "practical",
        "experience",
        "politics",
        "reiterate",
        "conservatism",
        "essentially",
        "associated",
        "aristocracy",
        "hereditary",
        "form",
        "government",
        "opposed",
        "democracy",
        "conservative",
        "millian",
        "liberal",
        "viability",
        "democracy",
        "depends",
        "period",
        "condition",
        "burke",
        "writing",
        "much",
        "earlier",
        "mill",
        "majority",
        "drawn",
        "body",
        "qualified",
        "tradition",
        "station",
        "education",
        "property",
        "moral",
        "nature",
        "questioned",
        "principle",
        "majority",
        "men",
        "told",
        "ie",
        "counted",
        "head",
        "considered",
        "people",
        "law",
        "burke",
        "thought",
        "french",
        "affair",
        "conservatism",
        "assimilated",
        "neoconservatism",
        "neoliberalism",
        "many",
        "conservative",
        "converted",
        "latter",
        "political",
        "outlook",
        "burke",
        "disraeli",
        "salisbury",
        "sceptical",
        "project",
        "enlightenment",
        "suspicious",
        "promise",
        "progress",
        "mortgaged",
        "future",
        "wager",
        "indefinite",
        "economic",
        "growth",
        "unfettered",
        "market",
        "force",
        "scarcely",
        "exhibit",
        "political",
        "prudenceonce",
        "revered",
        "conservative",
        "virtue",
        "gray",
        "scruton",
        "also",
        "lament",
        "development",
        "john",
        "harris",
        "comment",
        "enduring",
        "tension",
        "margaret",
        "thatcher",
        "exposed",
        "conservatism",
        "profess",
        "believe",
        "unrestrained",
        "market",
        "old",
        "tory",
        "touchstone",
        "family",
        "nation",
        "community",
        "willdiscover",
        "former",
        "eats",
        "away",
        "foundation",
        "latter",
        "harris",
        "harvey",
        "offer",
        "trenchant",
        "critique",
        "neoliberalism",
        "neoconservatism"
    ]
}