{
    "main_text": "Support for EC: Apparently Inconsistent Knowledge Claims, Skeptical and Everyday || Some Specific Forms of EC\n3.3 Some Specific Forms of EC\nWhile the general form of the preceding response to skeptical arguments is widely accepted among contextualists, different proponents of EC have proposed different specific versions of the view, and so explanations of what is going on in such arguments that differ in their details.\nThus, Robert Nozick (1981) is well-known for proposing that knowledge requires sensitive belief, where one’s belief that p (formed via a particular method, M) is sensitive just in case, if p were false, one would not believe (via M) that p. While he does not endorse sensitivity as a general condition on knowing, and is not concerned with giving an account of knowledge itself, Keith DeRose suggests that an utterance of ‘S knows that p’ will tend to express a truth only if S believes that p, p, and S’s epistemic position is such that his belief that p is sensitive (DeRose 1995, 36). And, in the case of SA, the mere uttering of P1 induces very high standards for knowledge, as the belief that I’m not a BIV is manifestly insensitive; and at those very high standards, P1 is true. As for P2, DeRose claims that it is true “regardless of what epistemic standard it is evaluated at” (ibid., 39). As it happens, though, in SA P2 is evaluated at the very high standards put into play by P1. But, then, the only reading on which SA’s conclusion is true is at the unusually inflated standards induced by P1. The truth of C thus allows that we correctly say we “know” that we have hands when lower standards are in play, as they usually are.\nDeRose’s brand of EC is externalist, in the sense that it deploys a notion, sensitivity, that has figured in certain externalist theories of knowledge. Likewise externalist is Mark Heller’s brand of EC, which is both reliabilist in spirit and an instance of the RA approach. On Heller’s view (1995), just how reliable a belief-forming process must be for an attribution of “knowledge” to express a truth depends upon context, in the attributor sense introduced above; and the relevant alternatives are those such that, if the process in question is reliable to the contextually required degree, the subject will be able to discriminate between those alternatives and what is in fact the case.\nBy contrast, Stewart Cohen’s version of EC is internalist.[8] According to Cohen (1986, 1987, 1988, 1999, 2005, 2014) ‘know’ inherits its indexical nature (1988, 97) from that of ‘justified’. Justification comes in degrees; and what counts as justification simpliciter—i.e., justification to the level required for an attribution of “knowledge” to express a truth—is governed by a “rule of salience”(1998, 292, n. 11), whereby one’s evidence/reasons must be good enough to preclude salient possibilities of error. What the skeptic does is make salient certain extraordinary not-p possibilities, with the result that the standard of how good one’s evidence/reasons must be goes way up.\nSimilar to Cohen’s account is David Lewis’ (1996). According to Lewis:\nSubject S knows proposition P iff P holds in every possibility left uneliminated by P’s evidence; equivalently, iff S’s evidence eliminates every possibility in which not-P. (1996, 551)\nWhy doesn’t this just amount to infallibilism, and so a dramatic shrinking of what we can be said truly to know? Because, according to Lewis, the extension of ‘every’ is restricted to a particular conversational domain (ibid., 553–554). Thus, Lewis thinks, certain not-p possibilities will be “properly ignored” in any given situation. As to what determines whether a given possibility is properly ignored, Lewis suggests a number of rules, including the Rule of Attention: “a possibility that is not ignored is ipso facto not properly ignored” (ibid., 559). And this is why the skeptic’s argument is so irresistible, Lewis thinks. For skepticism—indeed, epistemology generally—just is the making salient of certain possibilities of error. For example, to consider whether we know that we are not BIVs, as assessing the first premise of SA requires, is ipso facto not to ignore that possibility. One’s evidence definitely does not eliminate the possibility if it consists in one’s experiences. So we do in fact have lots of knowledge, according to Lewis, but it is “elusive”: “Examine it, and straightway it vanishes” (ibid., 560).\nMichael Blome-Tillman (2009, 2014) has proposed a modification to Lewis’ view. Specifically, Blome-Tillman recommends that Lewis’s Rule of Attention be replaced by the following Rule of Presupposition:\nIf w is compatible with the speakers’ pragmatic presuppositions in C, then w cannot be properly ignored in C. (2009, 256; 2014, 20)\nHere, ‘pragmatic presupposition’ is to be understood along the lines suggested by Stalnaker (1974, 2002). As stated by Blome-Tillman,\nx pragmatically presupposes p in C [iff] x is disposed to behave, in her use of language, as if she believed p to be common ground in C. (Ibid.)\nBlome-Tillman regards the resultant Presuppositional Epistemic Contextualism as superior to Lewis’s, not least because it allows that the mere mentioning or thinking of a skeptical possibility needn’t make a difference to the contents and truth-values of a given “knowledge” claim—whether it does so depends on whether it effects or reflects a shift in the pragmatic presuppositions of the parties involved.\nStill other versions of EC takes the shifting standards to directly govern ascriptions of evidence. For Robert Hambourger, it is “the amount of evidence needed to know a proposition” which “varies with standards of caution” (1987, 260, emphasis added). For Ram Neta, it is not the quantity of evidence required for a truthful utterance of ‘S knows that p’ that is governed by context-sensitive standards, but rather whether certain mental states of the subject’s count as evidence at all. The relevant rule once again bears similarities to those proposed by Cohen and Lewis:\n(R) When one raises an hypothesis H that is an uneliminated counterpossibility with respect to S’s knowing that p at t, one restricts what counts in one’s context of appraisal… as S’s body of evidence at t to just those mental states that S has, and would have, at t whether or not H is true. (2002, 674; 2003a, 23–4)\nBy exploiting this rule, the skeptic is able to disqualify certain mental states—e.g., those involved in my current experience (as) of seeing my hands—as constituting evidence. Although, once again, when the relevant skeptical possibilities are not raised, those experiences qualify as evidence sufficient for truthful ascriptions of “knowledge” that I have hands.\nFinally, some theorists have suggested that the context-sensitivity of sentences involving ‘know’ is owing to a more general context-sensitivity in certain explanatory relations and claims. For example, Steven Rieber (1998) has proposed that, in general, S knows that P iff “the fact that P explains why S believes that P” (1998, 194). According to Rieber, however, explanations are always at least implicitly contrastive, and whether one thing explains another will depends upon which contrasts are salient.[9] As just presented, Rieber’s theory concerns the knowledge relation itself; so, in the terminology of Section 1, it would qualify as a substantive contextualist view. But Rieber’s is clearly better construed as a semantic theory, like the other views just sketched. For, as applied to SA, it would have the consequence that what the conclusion of that argument in effect says is something like:\n(C′) It is not the case that my having hands rather than my being a handless BIV explains why I believe that I have hands rather than that I’m a handless BIV.[10]\nWhereas, that I am a handless BIV is not ordinarily a salient counter-possibility to my having hands. So the truth of C′ is compatible with my ordinary claim to “know”, since the latter might strictly express the proposition that My having hands rather than my having had my hands amputated and replaced with prostheses is what explains why I believe that I have hands rather than that I’ve had my hands amputated and replaced with prostheses.\nAnother version of EC that features explanatory relations and claims is John Greco’s (2003, 2008, 2009). At the heart of Greco’s view is a certain picture of knowledge—that it is creditable true belief; when one knows, one believes the truth as a result of one’s own efforts and abilities. But when is the attainment of a true belief genuinely creditable to the agent? It is here that contextual matters enter in. For, in general, there can be different—though, importantly, non-competing—accounts of “the cause” of a given thing, event or phenomenon. And now we have an argument for EC: attributing “knowledge” involves giving credit; credit attributions involve a kind of causal explanation; but causal explanations require a contextualist semantics; so “knowledge” attributions require a contextualist semantics too (2009, 107).\nAs the discussion of this section reveals, there is plenty of room for variety among forms of EC—both about, in Jonathan Schaffer’s (2005, 115) phrase, “which epistemic gear the wheels of context turn,” and about the exact mechanism or rule governing such shifts. Once again, however, there is general consensus among the relevant theorists that context is to be understood in terms of such things as the interests, purposes, expectations, salient possibilities, and so forth, of the attributor. Further, there is consensus that, understood along such lines, context affects the truth-conditional content of ‘knowledge’ sentences—and, in fact, that this phenomenon is what underlies and explains the power of skeptical arguments, even though it also reveals why those arguments do not threaten our ordinary claims to “know”.\nOf course, as some proponents of EC point out, contextualists are not forced to any view as to whether and/or under what circumstances, exactly, the skeptic does succeed in raising the standards (Cohen 2001, 92–93; 2014, 71–72; DeRose 2006, Section 6; 2004a; 2009, Chapter 4). Still, that EC promises to provide a plausible response to skeptical puzzles has been among its primary selling points. So the contextualist stands to lose something if it turns out that the skeptic is only very rarely or never able to raise the standards for a “knowledge”-ascribing sentence to express a truth. For then some other account would be required to explain the apparent power of arguments like SA.\n",
    "section_title": "3.3 Some Specific Forms of EC",
    "entry_title": "Epistemic Contextualism",
    "hierarchy_title": "Epistemic Contextualism || Support for EC: Apparently Inconsistent Knowledge Claims, Skeptical and Everyday || Some Specific Forms of EC",
    "tokenized_text": [
        "support",
        "ec",
        "apparently",
        "inconsistent",
        "knowledge",
        "claim",
        "skeptical",
        "everyday",
        "specific",
        "form",
        "ec",
        "specific",
        "form",
        "ec",
        "general",
        "form",
        "preceding",
        "response",
        "skeptical",
        "argument",
        "widely",
        "accepted",
        "among",
        "contextualists",
        "different",
        "proponent",
        "ec",
        "proposed",
        "different",
        "specific",
        "version",
        "view",
        "explanation",
        "going",
        "argument",
        "differ",
        "detail",
        "thus",
        "robert",
        "nozick",
        "wellknown",
        "proposing",
        "knowledge",
        "requires",
        "sensitive",
        "belief",
        "one",
        "belief",
        "p",
        "formed",
        "via",
        "particular",
        "method",
        "sensitive",
        "case",
        "p",
        "false",
        "one",
        "would",
        "believe",
        "via",
        "p",
        "endorse",
        "sensitivity",
        "general",
        "condition",
        "knowing",
        "concerned",
        "giving",
        "account",
        "knowledge",
        "keith",
        "derose",
        "suggests",
        "utterance",
        "know",
        "p",
        "tend",
        "express",
        "truth",
        "belief",
        "p",
        "p",
        "epistemic",
        "position",
        "belief",
        "p",
        "sensitive",
        "derose",
        "case",
        "sa",
        "mere",
        "uttering",
        "p",
        "induces",
        "high",
        "standard",
        "knowledge",
        "belief",
        "biv",
        "manifestly",
        "insensitive",
        "high",
        "standard",
        "p",
        "true",
        "p",
        "derose",
        "claim",
        "true",
        "regardless",
        "epistemic",
        "standard",
        "evaluated",
        "ibid",
        "happens",
        "though",
        "sa",
        "p",
        "evaluated",
        "high",
        "standard",
        "put",
        "play",
        "p",
        "reading",
        "sa",
        "conclusion",
        "true",
        "unusually",
        "inflated",
        "standard",
        "induced",
        "p",
        "truth",
        "c",
        "thus",
        "allows",
        "correctly",
        "say",
        "know",
        "hand",
        "lower",
        "standard",
        "play",
        "usually",
        "derose",
        "brand",
        "ec",
        "externalist",
        "sense",
        "deploys",
        "notion",
        "sensitivity",
        "figured",
        "certain",
        "externalist",
        "theory",
        "knowledge",
        "likewise",
        "externalist",
        "mark",
        "heller",
        "brand",
        "ec",
        "reliabilist",
        "spirit",
        "instance",
        "ra",
        "approach",
        "heller",
        "view",
        "reliable",
        "beliefforming",
        "process",
        "must",
        "attribution",
        "knowledge",
        "express",
        "truth",
        "depends",
        "upon",
        "context",
        "attributor",
        "sense",
        "introduced",
        "relevant",
        "alternative",
        "process",
        "question",
        "reliable",
        "contextually",
        "required",
        "degree",
        "subject",
        "able",
        "discriminate",
        "alternative",
        "fact",
        "case",
        "contrast",
        "stewart",
        "cohen",
        "version",
        "ec",
        "internalist",
        "according",
        "cohen",
        "know",
        "inherits",
        "indexical",
        "nature",
        "justified",
        "justification",
        "come",
        "degree",
        "count",
        "justification",
        "simpliciterie",
        "justification",
        "level",
        "required",
        "attribution",
        "knowledge",
        "express",
        "truthis",
        "governed",
        "rule",
        "salience",
        "n",
        "whereby",
        "one",
        "evidencereasons",
        "must",
        "good",
        "enough",
        "preclude",
        "salient",
        "possibility",
        "error",
        "skeptic",
        "make",
        "salient",
        "certain",
        "extraordinary",
        "notp",
        "possibility",
        "result",
        "standard",
        "good",
        "one",
        "evidencereasons",
        "must",
        "go",
        "way",
        "similar",
        "cohen",
        "account",
        "david",
        "lewis",
        "according",
        "lewis",
        "subject",
        "know",
        "proposition",
        "p",
        "iff",
        "p",
        "hold",
        "every",
        "possibility",
        "left",
        "uneliminated",
        "p",
        "evidence",
        "equivalently",
        "iff",
        "evidence",
        "eliminates",
        "every",
        "possibility",
        "notp",
        "amount",
        "infallibilism",
        "dramatic",
        "shrinking",
        "said",
        "truly",
        "know",
        "according",
        "lewis",
        "extension",
        "every",
        "restricted",
        "particular",
        "conversational",
        "domain",
        "ibid",
        "thus",
        "lewis",
        "think",
        "certain",
        "notp",
        "possibility",
        "properly",
        "ignored",
        "given",
        "situation",
        "determines",
        "whether",
        "given",
        "possibility",
        "properly",
        "ignored",
        "lewis",
        "suggests",
        "number",
        "rule",
        "including",
        "rule",
        "attention",
        "possibility",
        "ignored",
        "ipso",
        "facto",
        "properly",
        "ignored",
        "ibid",
        "skeptic",
        "argument",
        "irresistible",
        "lewis",
        "think",
        "skepticismindeed",
        "epistemology",
        "generallyjust",
        "making",
        "salient",
        "certain",
        "possibility",
        "error",
        "example",
        "consider",
        "whether",
        "know",
        "bivs",
        "assessing",
        "first",
        "premise",
        "sa",
        "requires",
        "ipso",
        "facto",
        "ignore",
        "possibility",
        "one",
        "evidence",
        "definitely",
        "eliminate",
        "possibility",
        "consists",
        "one",
        "experience",
        "fact",
        "lot",
        "knowledge",
        "according",
        "lewis",
        "elusive",
        "examine",
        "straightway",
        "vanishes",
        "ibid",
        "michael",
        "blometillman",
        "proposed",
        "modification",
        "lewis",
        "view",
        "specifically",
        "blometillman",
        "recommends",
        "lewis",
        "rule",
        "attention",
        "replaced",
        "following",
        "rule",
        "presupposition",
        "w",
        "compatible",
        "speaker",
        "pragmatic",
        "presupposition",
        "c",
        "w",
        "properly",
        "ignored",
        "c",
        "pragmatic",
        "presupposition",
        "understood",
        "along",
        "line",
        "suggested",
        "stalnaker",
        "stated",
        "blometillman",
        "x",
        "pragmatically",
        "presupposes",
        "p",
        "c",
        "iff",
        "x",
        "disposed",
        "behave",
        "use",
        "language",
        "believed",
        "p",
        "common",
        "ground",
        "c",
        "ibid",
        "blometillman",
        "regard",
        "resultant",
        "presuppositional",
        "epistemic",
        "contextualism",
        "superior",
        "lewis",
        "least",
        "allows",
        "mere",
        "mentioning",
        "thinking",
        "skeptical",
        "possibility",
        "make",
        "difference",
        "content",
        "truthvalues",
        "given",
        "knowledge",
        "claimwhether",
        "depends",
        "whether",
        "effect",
        "reflects",
        "shift",
        "pragmatic",
        "presupposition",
        "party",
        "involved",
        "still",
        "version",
        "ec",
        "take",
        "shifting",
        "standard",
        "directly",
        "govern",
        "ascription",
        "evidence",
        "robert",
        "hambourger",
        "amount",
        "evidence",
        "needed",
        "know",
        "proposition",
        "varies",
        "standard",
        "caution",
        "emphasis",
        "added",
        "ram",
        "neta",
        "quantity",
        "evidence",
        "required",
        "truthful",
        "utterance",
        "know",
        "p",
        "governed",
        "contextsensitive",
        "standard",
        "rather",
        "whether",
        "certain",
        "mental",
        "state",
        "subject",
        "count",
        "evidence",
        "relevant",
        "rule",
        "bear",
        "similarity",
        "proposed",
        "cohen",
        "lewis",
        "r",
        "one",
        "raise",
        "hypothesis",
        "h",
        "uneliminated",
        "counterpossibility",
        "respect",
        "knowing",
        "p",
        "one",
        "restricts",
        "count",
        "one",
        "context",
        "appraisal",
        "body",
        "evidence",
        "mental",
        "state",
        "would",
        "whether",
        "h",
        "true",
        "a",
        "exploiting",
        "rule",
        "skeptic",
        "able",
        "disqualify",
        "certain",
        "mental",
        "stateseg",
        "involved",
        "current",
        "experience",
        "seeing",
        "handsas",
        "constituting",
        "evidence",
        "although",
        "relevant",
        "skeptical",
        "possibility",
        "raised",
        "experience",
        "qualify",
        "evidence",
        "sufficient",
        "truthful",
        "ascription",
        "knowledge",
        "hand",
        "finally",
        "theorist",
        "suggested",
        "contextsensitivity",
        "sentence",
        "involving",
        "know",
        "owing",
        "general",
        "contextsensitivity",
        "certain",
        "explanatory",
        "relation",
        "claim",
        "example",
        "steven",
        "rieber",
        "proposed",
        "general",
        "know",
        "p",
        "iff",
        "fact",
        "p",
        "explains",
        "belief",
        "p",
        "according",
        "rieber",
        "however",
        "explanation",
        "always",
        "least",
        "implicitly",
        "contrastive",
        "whether",
        "one",
        "thing",
        "explains",
        "another",
        "depends",
        "upon",
        "contrast",
        "salient",
        "presented",
        "rieber",
        "theory",
        "concern",
        "knowledge",
        "relation",
        "terminology",
        "section",
        "would",
        "qualify",
        "substantive",
        "contextualist",
        "view",
        "rieber",
        "clearly",
        "better",
        "construed",
        "semantic",
        "theory",
        "like",
        "view",
        "sketched",
        "applied",
        "sa",
        "would",
        "consequence",
        "conclusion",
        "argument",
        "effect",
        "say",
        "something",
        "like",
        "c",
        "case",
        "hand",
        "rather",
        "handle",
        "biv",
        "explains",
        "believe",
        "hand",
        "rather",
        "handle",
        "biv",
        "whereas",
        "handle",
        "biv",
        "ordinarily",
        "salient",
        "counterpossibility",
        "hand",
        "truth",
        "c",
        "compatible",
        "ordinary",
        "claim",
        "know",
        "since",
        "latter",
        "might",
        "strictly",
        "express",
        "proposition",
        "hand",
        "rather",
        "hand",
        "amputated",
        "replaced",
        "prosthesis",
        "explains",
        "believe",
        "hand",
        "rather",
        "hand",
        "amputated",
        "replaced",
        "prosthesis",
        "another",
        "version",
        "ec",
        "feature",
        "explanatory",
        "relation",
        "claim",
        "john",
        "greco",
        "heart",
        "greco",
        "view",
        "certain",
        "picture",
        "knowledgethat",
        "creditable",
        "true",
        "belief",
        "one",
        "know",
        "one",
        "belief",
        "truth",
        "result",
        "one",
        "effort",
        "ability",
        "attainment",
        "true",
        "belief",
        "genuinely",
        "creditable",
        "agent",
        "contextual",
        "matter",
        "enter",
        "general",
        "differentthough",
        "importantly",
        "noncompetingaccounts",
        "cause",
        "given",
        "thing",
        "event",
        "phenomenon",
        "argument",
        "ec",
        "attributing",
        "knowledge",
        "involves",
        "giving",
        "credit",
        "credit",
        "attribution",
        "involve",
        "kind",
        "causal",
        "explanation",
        "causal",
        "explanation",
        "require",
        "contextualist",
        "semantics",
        "knowledge",
        "attribution",
        "require",
        "contextualist",
        "semantics",
        "discussion",
        "section",
        "reveals",
        "plenty",
        "room",
        "variety",
        "among",
        "form",
        "ecboth",
        "jonathan",
        "schaffer",
        "phrase",
        "epistemic",
        "gear",
        "wheel",
        "context",
        "turn",
        "exact",
        "mechanism",
        "rule",
        "governing",
        "shift",
        "however",
        "general",
        "consensus",
        "among",
        "relevant",
        "theorist",
        "context",
        "understood",
        "term",
        "thing",
        "interest",
        "purpose",
        "expectation",
        "salient",
        "possibility",
        "forth",
        "attributor",
        "consensus",
        "understood",
        "along",
        "line",
        "context",
        "affect",
        "truthconditional",
        "content",
        "knowledge",
        "sentencesand",
        "fact",
        "phenomenon",
        "underlies",
        "explains",
        "power",
        "skeptical",
        "argument",
        "even",
        "though",
        "also",
        "reveals",
        "argument",
        "threaten",
        "ordinary",
        "claim",
        "know",
        "course",
        "proponent",
        "ec",
        "point",
        "contextualists",
        "forced",
        "view",
        "whether",
        "andor",
        "circumstance",
        "exactly",
        "skeptic",
        "succeed",
        "raising",
        "standard",
        "cohen",
        "derose",
        "section",
        "a",
        "chapter",
        "still",
        "ec",
        "promise",
        "provide",
        "plausible",
        "response",
        "skeptical",
        "puzzle",
        "among",
        "primary",
        "selling",
        "point",
        "contextualist",
        "stand",
        "lose",
        "something",
        "turn",
        "skeptic",
        "rarely",
        "never",
        "able",
        "raise",
        "standard",
        "knowledge",
        "ascribing",
        "sentence",
        "express",
        "truth",
        "account",
        "would",
        "required",
        "explain",
        "apparent",
        "power",
        "argument",
        "like",
        "sa"
    ]
}