{
    "main_text": "Gaps and Gluts: LNC and Its Discontents\n4. Gaps and Gluts: LNC and Its Discontents\n\n\nIn addition to the future contingent statements discussed in §2,\nvacuous subjects like those in (7a,b) have sometimes been taken to\nyield a violation of LEM through the emergence of a truth-value\ngap.\n\n(7a) {The present king of France/King Louis} is bald.\n(7b) {The present king of France/King Louis} isn't bald.\n\n\n\nWhile Aristotle would see a republican France as rendering (7a) false\nand (7b) automatically true, Frege (1892) and Strawson (1950) reject\nthe notion that either of these sentences can be used to make a true\nor false assertion. Instead, both statements presuppose the existence\nof a referent for the singular term; if the presupposition fails, so\ndoes the possibility of classical truth assignment. Note, however,\nthat such analyses present a challenge to LEM only if (7b) is taken as\nthe true contradictory of (7a), an assumption not universally\nshared. Russell, for example, allows for one reading of (7b) on which\nit is, like (7a), false in the absence of a referent or denotatum for\nthe subject term; on that reading, on which the description has\nprimary occurrence, the two sentences are not contradictories. In this\nway, Russell (1905: 485) seeks to guide the French monarch out of the\napparent trap without recourse to wigs or truth value gaps: \n\nBy the law of the excluded middle, either ‘A is B’ or\n‘A is not B’ must be true. Hence either ‘the present\nking of France is bald’ or ‘the present king of France is\nnot bald’ must be true. Yet if we enumerated the things that are\nbald and the things that are not bald, we should not find the king of\nFrance on either list. Hegelians, who love a synthesis, will probably\nconclude that he wears a wig.\n\n\nIn those systems that do embrace truth value gaps (Strawson, arguably\nFrege) or non-classically-valued systems (Łukasiewicz, Bochvar,\nKleene), some sentences or statements are not assigned a (classical)\ntruth value; in Strawson's famous dictum, the question of the truth\nvalue of “The king of France is wise”, in a world in which\nFrance is a republic, simply fails to arise. The negative form of such\nvacuous statements, e.g. “The king of France is not wise”,\nis similarly neither true nor false.  This amounts to a rejection of\nLEM, as noted by Russell 1905. In addition to vacuous singular\nexpressions, gap-based analyses have been proposed for future\ncontingents (following one reading of Aristotle's exposition of the\nsea-battle; cf.  §2 above) and category mistakes (e.g. “The\nnumber 7 likes/doesn't like to dance”).\n\n\nWhile LNC has traditionally remained more sacrosanct, reflecting its\nposition as the primus inter pares of the indemonstrables,\ntransgressing this final taboo has become increasingly alluring in\nrecent years. The move here involves embracing not gaps but truth\nvalue gluts, cases in which a given sentence and its negation\nare taken to be both true, or alternatively cases in which a sentence\nmay be assigned more than one (classical) truth value, i.e.  both True\nand False. Parsons (1990) observes that the two non-classical theories\nare provably logically equivalent, as gluts arise within one class of\ntheories precisely where gaps do in the other; others, however, have\nargued that gaps (as in Intuitionist non-bivalent logics) are easier\nto swallow than gluts (see papers in the Priest et al. 2004 collection\nfor further debate). Dialetheists reject the charge of incoherence by\nnoting that to accept some contradictions is not to accept them all;\nin particular, they seek to defuse the threat of logical armageddon or\n“explosion” posed by Ex Contradictione Quodlibet, the\ninference in (8):\n\n\n(8) p, ¬p\n    _____\n    ∴q\n\n\n\nFar from reduced to the silence of a vegetable, as Aristotle ordained,\nthe proponents of true contradictions, including self-avowed\ndialetheists following the lead of Sylvan (né Routley) and\nPriest have been eloquent.\n\n\nIs the status of Aristotle's “first principle” as obvious\nas he believed? Adherents of the dialetheist view that there are true\ncontradictories (Priest 1987, 1998, 2002; see also the entries  on\n dialetheism and\n paraconsistent logic) would\n answer firmly in the \n negative.[6]\n In the Western tradition, the countenancing\nof true contradictions is typically—although not\nexclusively—motivated on the basis of such classic logical\nparadoxes as “This sentence is not true” and its\nanalogues; such a statement is evidently true if and only if it is\nnot true. The Liar, or really the family of Liar’s paradoxes\n(see Liar Paradox), and Russell’s\nparadox, its set-theoretic analogue (a set that is not a member of\nitself both is and is not a member of\nitself—see the entry on \n Russell’s Paradox), would\nno longer constitute immediate threats to logical coherence in the\nabsence of LNC (see papers in Priest et al. for extended discussion).\nIf we are indeed prepared to jettison LNC, we can regard “This\nsentence is not true” (or “This statement is false”)\nas simultaneously true and not true without deriving the resultant\nabsurdity taken by Aristotle and his heirs to result from such a\ncontradiction. As Smiley (1993: 19) has remarked, “Dialetheism\nstands to the classical idea of negation like special relativity to\nNewtonian mechanics: they agree in the familiar areas but diverge at\nthe margins (notably the paradoxes).”\n\n\nRelated to the classic paradoxes of logic and set theory is the\nParadox of the Stone. One begins by granting the basic dilemma, as an\nevident instance of LEM: either God is omnipotent or God is not\nomnipotent. With omnipotence, He can do anything, and in particular He\ncan create a stone, call it s, that is so heavy even He\ncannot lift it. But then there is something He cannot do, viz. (ex\nhypothesi) lift s. But this is a violation of LNC: God can\nlift s and God cannot lift s.  This paradox, and the\npotential challenge it offers to either LNC or the possibility of\nomnipotence, has been recognized since Aquinas, who opted for\nretaining the Aristotelian law by understanding omnipotence as the\ncapacity to do only what is not logically impossible.  (Others,\nincluding Augustine and Maimonides, have noted that in any case God is\n“unable” to do what is inconsistent with His nature,\ne.g. commit sin.) For Descartes, on the other hand, an omnipotent God\nis by definition capable of any task, even those yielding\ncontradictions. Mavrodes (1963), Kenny, and others have sided with\nSt. Thomas in taking omnipotence to extend only to those powers it is\npossible to possess; Frankfurt (1964), on the other hand, essentially\nadopts the Cartesian line: Yes, of course God can indeed construct a\nstone such that He cannot lift it—and what's more, He can lift\nit! (See also Savage 1967 for a related solution.)\n\nAs we have seen, the target of Aristotle's psychological (doxastic)\nversion of LNC was Heraclitus: “It is impossible for anyone to\nbelieve that the same thing is and is not, as some consider Heraclitus\nsaid—for it is not necessary that the things one says one also\nbelieves” (Met. 1005b23–26). But as Aristotle acknowledges here\n(even if he is less politic elsewhere), there is considerable uncertainty\nover exactly what Heraclitus said and what he believed. Heraclitus\ncould not have literally rejected LNC, as he is often accused of (or\npraised for) doing, as his writings preceded the statement of that\nprinciple in Metaphysics Γ by well over a century. But\nthe question remains: do his words, as represented in the extant\nfragments, anticipate the Dialetheists and other rejectionists? Yes\nand no. To be sure, Heraclitus was proud to wear the mantle of\n“paradoxographer” (Barnes 1982: 80) and enjoyed nothing\nmore than to épater les bourgeois of his day. But the\nkey fragments supporting his proclamation of the Unity of Opposites\ncan be taken in more than one way.  He points out that sea water is\nsalutary (if you're a fish) and unhealthy (if you're a human), just as\ngarbage is preferable to gold (for a donkey) but then again it isn't\n(for a person). And given the inevitability of flux (as Heraclitus\nmemorably illustrated by his river into which one cannot step twice),\nwhat is true (today) is also false (tomorrow).  But these astute\nobservations do not so much refute the LNC as much as demonstrate\n(through what Barnes calls the Fallacy of the Dropped Qualification)\nthe need for Aristotle's crucial codicil: sea water, for example,\ncannot be both healthful and unhealthful for the same experiencer at\nthe same time and in the same respect. (In a similar way, “It is\nraining” may of course be deemed true at this moment in Seattle\nand false in Palo Alto; we need admit no contradiction here, whether\nwe deal with the issue by endorsing unarticulated constituents or in\nsome other manner; cf. Recanati 2002 inter alia.)  Ultimately, whether\none follows Kirk (Heraclitus [1954]) in charging Aristotle with\nmisrepresenting Heraclitus as an LNC-denier or sides with Barnes\n(1982) and Wedin (2004b) in sustaining Aristotle's accusation, it is\nhard to see in what respect the evidence presented by Heraclitus,\nhowever subtle a guide he may be for our travels on that path on which\nup and down is one and the same, threatens the viability of LNC. (See\nalso Heraclitus.)\n\n\nWithin the modern philosophical canon, Hegel has often been seen as\nthe echt LNC-skeptic, well before his reputed deathbed lament,\n“Only one man ever understood me, and he didn't understand\nme.” Hegel saw himself as picking up where Heraclitus left\noff—“There is no proposition of Heraclitus which I have\nnot adopted in my logic” (Barnes 1982: 57)—and indeed the\nHeraclitean view of a world shaped by the unity of opposites through\nstrife and resolution does seem to foreshadow Hegelian dialectic. In\nfact, however, an unresolved contradiction was a sign of error for\nHegel. The contradiction between thesis and antithesis results in the\ndialectical resolution or superseding of the contradiction between\nopposites as a higher-level synthesis through the process\nof Aufhebung (from aufheben, a verb simultaneously\ninterpretable as 'preserve, cancel, lift up'). Rather than repudiating\nLNC, Hegel's dialectic rests upon it. In Marxist theory, too,\ncontradictories do not simply cancel out but are dynamically resolved\n(aufgehoben) at a higher level in a way that both preserves\nand supersedes the contradiction, motivating the historical\ndialectic. (See Horn 1989: §1.3.2.)\n\n\nFor Freud, there is a realm in which LNC is not so much superseded but\ndissolved. On the primary, infantile level, reflected in dreams and\nneuroses, there is no not: “‘No’ seems not\nto exist as far as dreams are concerned. Anything in a dream can mean\nits contrary” (Freud 1910: 155). When the analysand insists of a\ndream character “It's not my mother”, the analyst\nknowingly translates, “So it is his mother!”\nFreud sought to ground this pre-logical, LNC-free (and negation-free)\nrealm not just in the primal realm of the dreamer's unconscious but\nalso in the phenomenon of Gegensinn, words\n(especially Urworte, primal words) with two opposed meanings\npurported attested widely in ancient and modern languages. The\nempirical basis for this latter claim, however, has been widely\ndiscredited; see Benveniste 1956.\n\n\nGiven Aristotle's observation (Metaphysics 1006a2) that\n“even some physicists” deny LNC and affirm that it is\nindeed possible for the same thing to be and not to be at the same\ntime and in the same respect, he might not have been surprised to\nlearn that quantum mechanics has brought such challenges once more\ninto play. Thus, we have Schrödinger's celebrated imaginary cat,\nplaced (within the context of a thought experiment) inside a sealed\nbox along with radioactive material and a vial of poison gas that will\nbe released if and only if that material decays. Given quantum\nuncertainty, an atom potentially inhabits both states—decayed\nand non-—simultaneously, seeming to render the cat (in the\nabsence of an observer outside the system) both alive and dead. But\nmost physicists would argue that while quantum mechanics may challenge\nsome aspects of classical logic it does not threaten LNC. If we could\nin fact observe a cat, or a particle, as A and not-A at the same time,\nthen there would be a violation of the Law of Non-Contradiction; the\nmere potential for an entity to be in either of two mutually\ninconsistent states does not in itself violate the LNC.  \n\n\nAs we have seen, Aristotle himself anticipated many of the challenges\nthat have since been raised against LNC. One more such challenge is\nposed by the ubiquity of doxastic inconsistency. Take the desires of\nOedipus, for example. In seeking Jocasta as his mate, did he wish to\nmarry his mother? Certainly he did on the de re reading: Oedipus's\nmother (Jocasta) is such that he wanted to marry her, although he\nwould not have assented to the claim that he wanted to marry his\nmother. In a sense, then, “Oedipus wanted to marry his\nmother” is true (de re) and false (de dicto), but no violation\nof LNC is incurred, since these represent different propositions, the\nsemantic distinction neutralized within the sentential form. But what\nof the de dicto reading itself: it is really false? After\nall, as a young boy Oedipus can be assumed (by some) to have exhibited\nthe eponymous complex, according to which the falsity of the (de\ndicto) proposition that he wanted to marry his mother on\na conscious level belies the truth of this proposition on\nan unconscious level. But this does not entail that he both\nwished and did not wish to “marry” his mother at the same\ntime and in the same respect. Whether it concerns the\nunacknowledged incestuous conflict of the Theban king, the indecision\nof Zerlina's “Vorrei e non vorrei” response to Don\nGiovanni's invitation, or the unspecified ambivalence of the\nrespondent in Strawson's exchange (1952: 7)\n\n—Were you pleased?\n\n—Well, I was and I wasn't.\n\n\nwe have ample opportunity to reflect\non the foresight of Aristotle's rider: “a is\nF” and “a is not F”\ncannot both hold in the same sense, at the same time, and in the\nsame respect. \n",
    "section_title": "4. Gaps and Gluts: LNC and Its Discontents",
    "entry_title": "Contradiction",
    "hierarchy_title": "Contradiction || Gaps and Gluts: LNC and Its Discontents",
    "tokenized_text": [
        "gap",
        "glut",
        "lnc",
        "discontent",
        "gap",
        "glut",
        "lnc",
        "discontent",
        "addition",
        "future",
        "contingent",
        "statement",
        "discussed",
        "vacuous",
        "subject",
        "like",
        "a",
        "b",
        "sometimes",
        "taken",
        "yield",
        "violation",
        "lem",
        "emergence",
        "truthvalue",
        "gap",
        "a",
        "present",
        "king",
        "franceking",
        "louis",
        "bald",
        "b",
        "present",
        "king",
        "franceking",
        "louis",
        "nt",
        "bald",
        "aristotle",
        "would",
        "see",
        "republican",
        "france",
        "rendering",
        "a",
        "false",
        "b",
        "automatically",
        "true",
        "frege",
        "strawson",
        "reject",
        "notion",
        "either",
        "sentence",
        "used",
        "make",
        "true",
        "false",
        "assertion",
        "instead",
        "statement",
        "presuppose",
        "existence",
        "referent",
        "singular",
        "term",
        "presupposition",
        "fails",
        "possibility",
        "classical",
        "truth",
        "assignment",
        "note",
        "however",
        "analysis",
        "present",
        "challenge",
        "lem",
        "b",
        "taken",
        "true",
        "contradictory",
        "a",
        "assumption",
        "universally",
        "shared",
        "russell",
        "example",
        "allows",
        "one",
        "reading",
        "b",
        "like",
        "a",
        "false",
        "absence",
        "referent",
        "denotatum",
        "subject",
        "term",
        "reading",
        "description",
        "primary",
        "occurrence",
        "two",
        "sentence",
        "contradictory",
        "way",
        "russell",
        "seek",
        "guide",
        "french",
        "monarch",
        "apparent",
        "trap",
        "without",
        "recourse",
        "wig",
        "truth",
        "value",
        "gap",
        "law",
        "excluded",
        "middle",
        "either",
        "b",
        "b",
        "must",
        "true",
        "hence",
        "either",
        "present",
        "king",
        "france",
        "bald",
        "present",
        "king",
        "france",
        "bald",
        "must",
        "true",
        "yet",
        "enumerated",
        "thing",
        "bald",
        "thing",
        "bald",
        "find",
        "king",
        "france",
        "either",
        "list",
        "hegelian",
        "love",
        "synthesis",
        "probably",
        "conclude",
        "wear",
        "wig",
        "system",
        "embrace",
        "truth",
        "value",
        "gap",
        "strawson",
        "arguably",
        "frege",
        "nonclassicallyvalued",
        "system",
        "łukasiewicz",
        "bochvar",
        "kleene",
        "sentence",
        "statement",
        "assigned",
        "classical",
        "truth",
        "value",
        "strawson",
        "s",
        "famous",
        "dictum",
        "question",
        "truth",
        "value",
        "king",
        "france",
        "wise",
        "world",
        "france",
        "republic",
        "simply",
        "fails",
        "arise",
        "negative",
        "form",
        "vacuous",
        "statement",
        "eg",
        "king",
        "france",
        "wise",
        "similarly",
        "neither",
        "true",
        "false",
        "amount",
        "rejection",
        "lem",
        "noted",
        "russell",
        "addition",
        "vacuous",
        "singular",
        "expression",
        "gapbased",
        "analysis",
        "proposed",
        "future",
        "contingent",
        "following",
        "one",
        "reading",
        "aristotle",
        "s",
        "exposition",
        "seabattle",
        "cf",
        "category",
        "mistake",
        "eg",
        "number",
        "likesdoes",
        "nt",
        "like",
        "dance",
        "lnc",
        "traditionally",
        "remained",
        "sacrosanct",
        "reflecting",
        "position",
        "primus",
        "inter",
        "pares",
        "indemonstrables",
        "transgressing",
        "final",
        "taboo",
        "become",
        "increasingly",
        "alluring",
        "recent",
        "year",
        "move",
        "involves",
        "embracing",
        "gap",
        "truth",
        "value",
        "glut",
        "case",
        "given",
        "sentence",
        "negation",
        "taken",
        "true",
        "alternatively",
        "case",
        "sentence",
        "may",
        "assigned",
        "one",
        "classical",
        "truth",
        "value",
        "ie",
        "true",
        "false",
        "parson",
        "observes",
        "two",
        "nonclassical",
        "theory",
        "provably",
        "logically",
        "equivalent",
        "glut",
        "arise",
        "within",
        "one",
        "class",
        "theory",
        "precisely",
        "gap",
        "others",
        "however",
        "argued",
        "gap",
        "intuitionist",
        "nonbivalent",
        "logic",
        "easier",
        "swallow",
        "glut",
        "see",
        "paper",
        "priest",
        "et",
        "al",
        "collection",
        "debate",
        "dialetheists",
        "reject",
        "charge",
        "incoherence",
        "noting",
        "accept",
        "contradiction",
        "accept",
        "particular",
        "seek",
        "defuse",
        "threat",
        "logical",
        "armageddon",
        "explosion",
        "posed",
        "ex",
        "contradictione",
        "quodlibet",
        "inference",
        "p",
        "p",
        "_____",
        "q",
        "far",
        "reduced",
        "silence",
        "vegetable",
        "aristotle",
        "ordained",
        "proponent",
        "true",
        "contradiction",
        "including",
        "selfavowed",
        "dialetheists",
        "following",
        "lead",
        "sylvan",
        "né",
        "routley",
        "priest",
        "eloquent",
        "status",
        "aristotle",
        "s",
        "first",
        "principle",
        "obvious",
        "believed",
        "adherent",
        "dialetheist",
        "view",
        "true",
        "contradictory",
        "priest",
        "see",
        "also",
        "entry",
        "dialetheism",
        "paraconsistent",
        "logic",
        "would",
        "answer",
        "firmly",
        "negative",
        "western",
        "tradition",
        "countenancing",
        "true",
        "contradiction",
        "typicallyalthough",
        "exclusivelymotivated",
        "basis",
        "classic",
        "logical",
        "paradox",
        "sentence",
        "true",
        "analogue",
        "statement",
        "evidently",
        "true",
        "true",
        "liar",
        "really",
        "family",
        "liar",
        "paradox",
        "see",
        "liar",
        "paradox",
        "russell",
        "paradox",
        "settheoretic",
        "analogue",
        "set",
        "member",
        "member",
        "itselfsee",
        "entry",
        "russell",
        "paradox",
        "would",
        "longer",
        "constitute",
        "immediate",
        "threat",
        "logical",
        "coherence",
        "absence",
        "lnc",
        "see",
        "paper",
        "priest",
        "et",
        "al",
        "extended",
        "discussion",
        "indeed",
        "prepared",
        "jettison",
        "lnc",
        "regard",
        "sentence",
        "true",
        "statement",
        "false",
        "simultaneously",
        "true",
        "true",
        "without",
        "deriving",
        "resultant",
        "absurdity",
        "taken",
        "aristotle",
        "heir",
        "result",
        "contradiction",
        "smiley",
        "remarked",
        "dialetheism",
        "stand",
        "classical",
        "idea",
        "negation",
        "like",
        "special",
        "relativity",
        "newtonian",
        "mechanic",
        "agree",
        "familiar",
        "area",
        "diverge",
        "margin",
        "notably",
        "paradox",
        "related",
        "classic",
        "paradox",
        "logic",
        "set",
        "theory",
        "paradox",
        "stone",
        "one",
        "begin",
        "granting",
        "basic",
        "dilemma",
        "evident",
        "instance",
        "lem",
        "either",
        "god",
        "omnipotent",
        "god",
        "omnipotent",
        "omnipotence",
        "anything",
        "particular",
        "create",
        "stone",
        "call",
        "heavy",
        "even",
        "lift",
        "something",
        "viz",
        "ex",
        "hypothesi",
        "lift",
        "s",
        "violation",
        "lnc",
        "god",
        "lift",
        "god",
        "lift",
        "s",
        "paradox",
        "potential",
        "challenge",
        "offer",
        "either",
        "lnc",
        "possibility",
        "omnipotence",
        "recognized",
        "since",
        "aquinas",
        "opted",
        "retaining",
        "aristotelian",
        "law",
        "understanding",
        "omnipotence",
        "capacity",
        "logically",
        "impossible",
        "others",
        "including",
        "augustine",
        "maimonides",
        "noted",
        "case",
        "god",
        "unable",
        "inconsistent",
        "nature",
        "eg",
        "commit",
        "sin",
        "descartes",
        "hand",
        "omnipotent",
        "god",
        "definition",
        "capable",
        "task",
        "even",
        "yielding",
        "contradiction",
        "mavrodes",
        "kenny",
        "others",
        "sided",
        "st",
        "thomas",
        "taking",
        "omnipotence",
        "extend",
        "power",
        "possible",
        "posse",
        "frankfurt",
        "hand",
        "essentially",
        "adopts",
        "cartesian",
        "line",
        "yes",
        "course",
        "god",
        "indeed",
        "construct",
        "stone",
        "lift",
        "itand",
        "s",
        "lift",
        "see",
        "also",
        "savage",
        "related",
        "solution",
        "seen",
        "target",
        "aristotle",
        "s",
        "psychological",
        "doxastic",
        "version",
        "lnc",
        "heraclitus",
        "impossible",
        "anyone",
        "believe",
        "thing",
        "consider",
        "heraclitus",
        "saidfor",
        "necessary",
        "thing",
        "one",
        "say",
        "one",
        "also",
        "belief",
        "met",
        "b",
        "aristotle",
        "acknowledges",
        "even",
        "le",
        "politic",
        "elsewhere",
        "considerable",
        "uncertainty",
        "exactly",
        "heraclitus",
        "said",
        "believed",
        "heraclitus",
        "could",
        "literally",
        "rejected",
        "lnc",
        "often",
        "accused",
        "praised",
        "writing",
        "preceded",
        "statement",
        "principle",
        "metaphysics",
        "γ",
        "well",
        "century",
        "question",
        "remains",
        "word",
        "represented",
        "extant",
        "fragment",
        "anticipate",
        "dialetheists",
        "rejectionists",
        "yes",
        "sure",
        "heraclitus",
        "proud",
        "wear",
        "mantle",
        "paradoxographer",
        "barnes",
        "enjoyed",
        "nothing",
        "épater",
        "le",
        "bourgeois",
        "day",
        "key",
        "fragment",
        "supporting",
        "proclamation",
        "unity",
        "opposite",
        "taken",
        "one",
        "way",
        "point",
        "sea",
        "water",
        "salutary",
        "re",
        "fish",
        "unhealthy",
        "re",
        "human",
        "garbage",
        "preferable",
        "gold",
        "donkey",
        "nt",
        "person",
        "given",
        "inevitability",
        "flux",
        "heraclitus",
        "memorably",
        "illustrated",
        "river",
        "one",
        "step",
        "twice",
        "true",
        "today",
        "also",
        "false",
        "tomorrow",
        "astute",
        "observation",
        "much",
        "refute",
        "lnc",
        "much",
        "demonstrate",
        "barnes",
        "call",
        "fallacy",
        "dropped",
        "qualification",
        "need",
        "aristotle",
        "s",
        "crucial",
        "codicil",
        "sea",
        "water",
        "example",
        "healthful",
        "unhealthful",
        "experiencer",
        "time",
        "respect",
        "similar",
        "way",
        "raining",
        "may",
        "course",
        "deemed",
        "true",
        "moment",
        "seattle",
        "false",
        "palo",
        "alto",
        "need",
        "admit",
        "contradiction",
        "whether",
        "deal",
        "issue",
        "endorsing",
        "unarticulated",
        "constituent",
        "manner",
        "cf",
        "recanati",
        "inter",
        "alia",
        "ultimately",
        "whether",
        "one",
        "follows",
        "kirk",
        "heraclitus",
        "charging",
        "aristotle",
        "misrepresenting",
        "heraclitus",
        "lncdenier",
        "side",
        "barnes",
        "wedin",
        "b",
        "sustaining",
        "aristotle",
        "s",
        "accusation",
        "hard",
        "see",
        "respect",
        "evidence",
        "presented",
        "heraclitus",
        "however",
        "subtle",
        "guide",
        "may",
        "travel",
        "path",
        "one",
        "threatens",
        "viability",
        "lnc",
        "see",
        "also",
        "heraclitus",
        "within",
        "modern",
        "philosophical",
        "canon",
        "hegel",
        "often",
        "seen",
        "echt",
        "lncskeptic",
        "well",
        "reputed",
        "deathbed",
        "lament",
        "one",
        "man",
        "ever",
        "understood",
        "nt",
        "understand",
        "me",
        "hegel",
        "saw",
        "picking",
        "heraclitus",
        "left",
        "off",
        "proposition",
        "heraclitus",
        "adopted",
        "logic",
        "barnes",
        "and",
        "indeed",
        "heraclitean",
        "view",
        "world",
        "shaped",
        "unity",
        "opposite",
        "strife",
        "resolution",
        "seem",
        "foreshadow",
        "hegelian",
        "dialectic",
        "fact",
        "however",
        "unresolved",
        "contradiction",
        "sign",
        "error",
        "hegel",
        "contradiction",
        "thesis",
        "antithesis",
        "result",
        "dialectical",
        "resolution",
        "superseding",
        "contradiction",
        "opposite",
        "higherlevel",
        "synthesis",
        "process",
        "aufhebung",
        "aufheben",
        "verb",
        "simultaneously",
        "interpretable",
        "preserve",
        "cancel",
        "lift",
        "rather",
        "repudiating",
        "lnc",
        "hegel",
        "s",
        "dialectic",
        "rest",
        "upon",
        "marxist",
        "theory",
        "contradictory",
        "simply",
        "cancel",
        "dynamically",
        "resolved",
        "aufgehoben",
        "higher",
        "level",
        "way",
        "preserve",
        "supersedes",
        "contradiction",
        "motivating",
        "historical",
        "dialectic",
        "see",
        "horn",
        "freud",
        "realm",
        "lnc",
        "much",
        "superseded",
        "dissolved",
        "primary",
        "infantile",
        "level",
        "reflected",
        "dream",
        "neurosis",
        "seems",
        "exist",
        "far",
        "dream",
        "concerned",
        "anything",
        "dream",
        "mean",
        "contrary",
        "freud",
        "analysand",
        "insists",
        "dream",
        "character",
        "s",
        "mother",
        "analyst",
        "knowingly",
        "translates",
        "mother",
        "freud",
        "sought",
        "ground",
        "prelogical",
        "lncfree",
        "negationfree",
        "realm",
        "primal",
        "realm",
        "dreamer",
        "s",
        "unconscious",
        "also",
        "phenomenon",
        "gegensinn",
        "word",
        "especially",
        "urworte",
        "primal",
        "word",
        "two",
        "opposed",
        "meaning",
        "purported",
        "attested",
        "widely",
        "ancient",
        "modern",
        "language",
        "empirical",
        "basis",
        "latter",
        "claim",
        "however",
        "widely",
        "discredited",
        "see",
        "benveniste",
        "given",
        "aristotle",
        "s",
        "observation",
        "metaphysics",
        "a",
        "even",
        "physicist",
        "deny",
        "lnc",
        "affirm",
        "indeed",
        "possible",
        "thing",
        "time",
        "respect",
        "might",
        "surprised",
        "learn",
        "quantum",
        "mechanic",
        "brought",
        "challenge",
        "play",
        "thus",
        "schrödinger",
        "s",
        "celebrated",
        "imaginary",
        "cat",
        "placed",
        "within",
        "context",
        "thought",
        "experiment",
        "inside",
        "sealed",
        "box",
        "along",
        "radioactive",
        "material",
        "vial",
        "poison",
        "gas",
        "released",
        "material",
        "decay",
        "given",
        "quantum",
        "uncertainty",
        "atom",
        "potentially",
        "inhabits",
        "statesdecayed",
        "nonsimultaneously",
        "seeming",
        "render",
        "cat",
        "absence",
        "observer",
        "outside",
        "system",
        "alive",
        "dead",
        "physicist",
        "would",
        "argue",
        "quantum",
        "mechanic",
        "may",
        "challenge",
        "aspect",
        "classical",
        "logic",
        "threaten",
        "lnc",
        "could",
        "fact",
        "observe",
        "cat",
        "particle",
        "nota",
        "time",
        "would",
        "violation",
        "law",
        "noncontradiction",
        "mere",
        "potential",
        "entity",
        "either",
        "two",
        "mutually",
        "inconsistent",
        "state",
        "violate",
        "lnc",
        "seen",
        "aristotle",
        "anticipated",
        "many",
        "challenge",
        "since",
        "raised",
        "lnc",
        "one",
        "challenge",
        "posed",
        "ubiquity",
        "doxastic",
        "inconsistency",
        "take",
        "desire",
        "oedipus",
        "example",
        "seeking",
        "jocasta",
        "mate",
        "wish",
        "marry",
        "mother",
        "certainly",
        "de",
        "reading",
        "oedipus",
        "s",
        "mother",
        "jocasta",
        "wanted",
        "marry",
        "although",
        "would",
        "assented",
        "claim",
        "wanted",
        "marry",
        "mother",
        "sense",
        "oedipus",
        "wanted",
        "marry",
        "mother",
        "true",
        "de",
        "false",
        "de",
        "dicto",
        "violation",
        "lnc",
        "incurred",
        "since",
        "represent",
        "different",
        "proposition",
        "semantic",
        "distinction",
        "neutralized",
        "within",
        "sentential",
        "form",
        "de",
        "dicto",
        "reading",
        "really",
        "false",
        "young",
        "boy",
        "oedipus",
        "assumed",
        "exhibited",
        "eponymous",
        "complex",
        "according",
        "falsity",
        "de",
        "dicto",
        "proposition",
        "wanted",
        "marry",
        "mother",
        "conscious",
        "level",
        "belies",
        "truth",
        "proposition",
        "unconscious",
        "level",
        "entail",
        "wished",
        "wish",
        "marry",
        "mother",
        "time",
        "respect",
        "whether",
        "concern",
        "unacknowledged",
        "incestuous",
        "conflict",
        "theban",
        "king",
        "indecision",
        "zerlina",
        "s",
        "vorrei",
        "e",
        "non",
        "vorrei",
        "response",
        "giovanni",
        "s",
        "invitation",
        "unspecified",
        "ambivalence",
        "respondent",
        "strawson",
        "s",
        "exchange",
        "were",
        "pleased",
        "well",
        "nt",
        "ample",
        "opportunity",
        "reflect",
        "foresight",
        "aristotle",
        "s",
        "rider",
        "f",
        "f",
        "hold",
        "sense",
        "time",
        "respect"
    ]
}