{
    "main_text": "Teleological Functions\n2. Teleological Functions\n\nWhile teleological theories of mental content are quite diverse, they\nall share the idea that psycho-semantic norms depend, in part at\nleast, on functional norms. Later sections explain various ideas about\nthe nature of this dependence. This section describes the notion of\nfunction employed. It is generally thought to be in some sense both\nteleological and normative, but both “teleological” and\n“normative” need qualifying, and the use of these terms\ncan lead to unnecessary misunderstandings. Let’s take the first\nof these terms first.\n\nTalk of biological functions does often seem to have at least a\nteleological flavor. For example, to say that it is the function of\nthe heart to pump blood can seem equivalent to saying that hearts are\nfor pumping blood, or that hearts are there in order\nto pump blood (see esp. Wright 1973). There is also the closely\nrelated concept of an artifact’s function that appears to be\npurposive: for example, when we say that moving the cursor is the\nfunction of the computer’s trackpad, we might mean that this is\nwhat the trackpad was designed to do or was intended to do by the\ncomputer’s designer or user. Of course, if a teleological theory\nof mental content is to be a non-circular theory of original\nintentionality, the functions to which it appeals, as grounding\noriginal intentionality, cannot in turn depend on other intentional\nphenomena. (Some, but not all, prefer to use the term\n“teleonomic” in that case.)\n\nThe claim that the relevant notion of function is in some sense\n“normative” should also be read with care. What is meant\nby it is generally just that, when using this notion, we (and\nbiologists) may speak of systems functioning normally or properly, as\nwell as of abnormal functioning, malfunction, dysfunction, functional\nimpairment, and so on. The relevant notion of function is one that\npermits the possibility of malfunction. That is, it allows for the\npossibility that a token trait has a function to do Z (in a\nsituation S) while not doing Z (in S), or\neven while lacking the general disposition to do Z (in\n S).[2]\n For example, Joe’s\npineal gland could have the function to secrete melatonin even if it\ncannot secrete melatonin because of some internal damage. Whether it\nis appropriate to describe the notion as genuinely\n“normative” is unclear, since it is unclear what genuine\nnormativity requires. But all that is usually meant by saying that the\nrelevant notion of function is normative, at least by proponents of\nteleological theories of mental content, is that the relevant notion\npermits the possibility of malfunction, and underwrites the central\nfunction/dysfunction distinction employed in biology.\n\nRecall that, as mentioned earlier, the relevant functional norms are\nunderstood by proponents of teleological theories of mental content to\nbe descriptive rather than prescriptive. Some prefer to reserve the\nterm “normative” for prescriptive contexts. On that way of\nspeaking, a statement would count as normative only if it entailed an\nought-claim without the addition of further premises. Proponents of\nteleological theories of mental content may all agree that no\nought-claim follows from a function ascription without the addition of\nfurther premises (for discussion, see Jacob 2001), and thus that the\nrelevant function ascriptions are not prescriptive and hence are not\ngenuinely “normative” if that is what normativity\nrequires. Different terminological practices dominate different\ndiscourses, but it is worth remembering that talk of purely\ndescriptive “norms” is well established in some contexts\n(e.g., in talk of statistical norms). If either psycho-semantic or\nfunctional norms were prescriptive, the attempt to naturalize them\nwould seem to ignore Hume’s warning to beware trying to derive\nought-statements from is-statements, but those who\noffer teleological theories of mental content claim that the norms of\nboth functions and content fall on the is side of any\nis/ought divide.\n\nThose who favor teleological theories of content usually favor an\netiological theory of functions, according to which an item’s\nfunction is determined by its history of selection or by past\nselection of things of that type. Roughly, on an etiological theory of\nfunctions, an items function is what it was selected for, or what\nthings of the type were selected for (see, e.g., Millikan 1989a and\nNeander 1991; important precursors are Ayala 1970 and Wright 1973,\n1976). This idea can be spelled out in different ways. One influential\nproposal stems from Karen Neander, who gives the following definition\nfor functions in physiology:\n\nIt is a/the proper function of an item (X) of an organism\n(O) to do that which items of X’s type did to\ncontribute to the inclusive fitness of O’s ancestors,\nand which caused the genotype, of which X is the phenotypic\nexpression, to be selected by natural selection. (Neander 1991, 74)\n\n\nEtiological theories of biological function need to allow for the fact\nthat ancestral traits might have been selected for something other\nthan the present function of descendent traits. For example, a\npenguin’s flippers and an emu’s vestigial wings no longer\nhave the function of flight, even though ancestral forelimbs were\nselected for flight. Griffiths (1993) and Godfrey-Smith (1994) offer\n“modern history” versions of the etiological theory,\naccording to which functions are determined by recent selection. Note\nthat selection does not cease when traits “go to fixation”\nif on-going maintenance selection is still weeding out fresh harmful\nmutations as they arise. However, selection does require some\nvariation and Schwartz (1999) suggests that a continuing usefulness\nsupplement is needed, which kicks in if variation is absent for a\ntime. In the absence of any variation, the trait retains its function\nif it is still \n adaptive.[3]\n\n\nIt is important to note that standard etiological theories do not\nentail that all functions are directly grounded in processes of\nnatural selection operating over an evolutionary span of time.\nMillikan (1984) offers a theory on which functions can also result\nfrom meme selection. Papineau (1984) speaks of learning and Dretske\n(1986) invokes functions that depend on recruitment by conditioning.\nGarson (2011, 2019a) argues that the notion of selection should be\nloosened so that differential retention without differential\nreplication could count as selection, in which case neural selection\nwould qualify as a form of selection that could underwrite\ncontent-determining functions. Finally, Millikan (1984) further\nsuggests that functions of novel items can be derived from the\nfunctions of the mechanisms that produce them. While the contents of\nsensory-perceptual representations might be determined by functions\nthat are directly grounded in processes of natural selection, it is\nplausible to suppose that the content-determining functions for (most)\nconcepts are grounded in one of the other ways.\n\nWhile etiological theories dominate the discussion of normative\nfunctions in philosophy of biology, the etiological theory is not\nuncontroversial. Some question whether teleology can be naturalized\n(e.g., Bedau 1991). Others support other theories for other reasons.\nPerhaps the systemic theory is the most popular alternative (see esp.\nCummins 1975). Systemic theories of function emphasize the role of\nfunction ascriptions in functional analyses of systems. Functional\nanalyses of systems conceptually decompose complex activities of whole\nsystems into the activities of their contributing parts. The function\nof a part is its contribution to the complex activity of the system\nthat is under analysis. Proponents of the etiological theory have no\nobjection to the idea that biologists give functional analyses of\nsystems but contend that the systemic analysis, on its own, fails to\nnaturalize the normativity of functions or to do so successfully (i.e.\nit fails to provide an adequate account of \n malfunctioning).[4] \n Some who support a systemic\ntheory argue that biology has no need for a naturalistic notion of\nmalfunction (e.g., Davies 2001), while others argue that abnormal\nfunctioning is statistically atypical (Boorse 2002, Craver 2001,\n Lewens 2004).[5]\n\n\nIt is usual to note that etiological (teleological) functions are\ndistinct from the causal-role functions involved in what is standardly\ncalled “functionalism” in philosophy of mind. Causal-role\nfunctions are often defined as a select subset of a trait’s\nactual causal dispositions, and functionalism is often defined as the\nview that mental states are individuated or classified into types on\nthe basis of such dispositions (see, e.g., Block 1986). If causal-role\nfunctions are a subset of dispositions actually possessed by token\ntraits then they do not permit the possibility of an important kind of\nmalfunctioning because a trait cannot have the causal-role function to\nZ and at the same time lack the disposition to\nZ.\n\nThat said, the distinction between functionalism and what might be\ntermed “teleo-functionalism” is less stark than might be\nthought (cf. Neander 2017, 90). One reason is that formulations of\nclassical functionalism often spoke of the characteristic or\nnormal causal roles of mental states. Sometimes this was\nexplicitly to allow for pathology (see, e.g., Lewis 1980). Another\nreason is that, although teleological functions are often said to be\nselected effects or effects for which traits were selected, such\nfunctions can also be described as selected dispositions or\ndispositions for which traits were selected (Neander 2017, 127–130;\nHundertmark 2021). Both forms of functionalism also permit multiple\nphysical realizability of traits that perform the same functions.\n",
    "section_title": "2. Teleological Functions",
    "entry_title": "Teleological Theories of Mental Content",
    "hierarchy_title": "Teleological Theories of Mental Content || Teleological Functions",
    "tokenized_text": [
        "teleological",
        "function",
        "teleological",
        "function",
        "teleological",
        "theory",
        "mental",
        "content",
        "quite",
        "diverse",
        "share",
        "idea",
        "psychosemantic",
        "norm",
        "depend",
        "part",
        "least",
        "functional",
        "norm",
        "later",
        "section",
        "explain",
        "various",
        "idea",
        "nature",
        "dependence",
        "section",
        "describes",
        "notion",
        "function",
        "employed",
        "generally",
        "thought",
        "sense",
        "teleological",
        "normative",
        "teleological",
        "normative",
        "need",
        "qualifying",
        "use",
        "term",
        "lead",
        "unnecessary",
        "misunderstanding",
        "let",
        "take",
        "first",
        "term",
        "first",
        "talk",
        "biological",
        "function",
        "often",
        "seem",
        "least",
        "teleological",
        "flavor",
        "example",
        "say",
        "function",
        "heart",
        "pump",
        "blood",
        "seem",
        "equivalent",
        "saying",
        "heart",
        "pumping",
        "blood",
        "heart",
        "order",
        "pump",
        "blood",
        "see",
        "esp",
        "wright",
        "also",
        "closely",
        "related",
        "concept",
        "artifact",
        "function",
        "appears",
        "purposive",
        "example",
        "say",
        "moving",
        "cursor",
        "function",
        "computer",
        "trackpad",
        "might",
        "mean",
        "trackpad",
        "designed",
        "intended",
        "computer",
        "designer",
        "user",
        "course",
        "teleological",
        "theory",
        "mental",
        "content",
        "noncircular",
        "theory",
        "original",
        "intentionality",
        "function",
        "appeal",
        "grounding",
        "original",
        "intentionality",
        "turn",
        "depend",
        "intentional",
        "phenomenon",
        "prefer",
        "use",
        "term",
        "teleonomic",
        "case",
        "claim",
        "relevant",
        "notion",
        "function",
        "sense",
        "normative",
        "also",
        "read",
        "care",
        "meant",
        "generally",
        "using",
        "notion",
        "biologist",
        "may",
        "speak",
        "system",
        "functioning",
        "normally",
        "properly",
        "well",
        "abnormal",
        "functioning",
        "malfunction",
        "dysfunction",
        "functional",
        "impairment",
        "relevant",
        "notion",
        "function",
        "one",
        "permit",
        "possibility",
        "malfunction",
        "allows",
        "possibility",
        "token",
        "trait",
        "function",
        "z",
        "situation",
        "z",
        "even",
        "lacking",
        "general",
        "disposition",
        "z",
        "example",
        "joe",
        "pineal",
        "gland",
        "could",
        "function",
        "secrete",
        "melatonin",
        "even",
        "secrete",
        "melatonin",
        "internal",
        "damage",
        "whether",
        "appropriate",
        "describe",
        "notion",
        "genuinely",
        "normative",
        "unclear",
        "since",
        "unclear",
        "genuine",
        "normativity",
        "requires",
        "usually",
        "meant",
        "saying",
        "relevant",
        "notion",
        "function",
        "normative",
        "least",
        "proponent",
        "teleological",
        "theory",
        "mental",
        "content",
        "relevant",
        "notion",
        "permit",
        "possibility",
        "malfunction",
        "underwrites",
        "central",
        "functiondysfunction",
        "distinction",
        "employed",
        "biology",
        "recall",
        "mentioned",
        "earlier",
        "relevant",
        "functional",
        "norm",
        "understood",
        "proponent",
        "teleological",
        "theory",
        "mental",
        "content",
        "descriptive",
        "rather",
        "prescriptive",
        "prefer",
        "reserve",
        "term",
        "normative",
        "prescriptive",
        "context",
        "way",
        "speaking",
        "statement",
        "would",
        "count",
        "normative",
        "entailed",
        "oughtclaim",
        "without",
        "addition",
        "premise",
        "proponent",
        "teleological",
        "theory",
        "mental",
        "content",
        "may",
        "agree",
        "oughtclaim",
        "follows",
        "function",
        "ascription",
        "without",
        "addition",
        "premise",
        "discussion",
        "see",
        "jacob",
        "thus",
        "relevant",
        "function",
        "ascription",
        "prescriptive",
        "hence",
        "genuinely",
        "normative",
        "normativity",
        "requires",
        "different",
        "terminological",
        "practice",
        "dominate",
        "different",
        "discourse",
        "worth",
        "remembering",
        "talk",
        "purely",
        "descriptive",
        "norm",
        "well",
        "established",
        "context",
        "eg",
        "talk",
        "statistical",
        "norm",
        "either",
        "psychosemantic",
        "functional",
        "norm",
        "prescriptive",
        "attempt",
        "naturalize",
        "would",
        "seem",
        "ignore",
        "hume",
        "warning",
        "beware",
        "trying",
        "derive",
        "oughtstatements",
        "isstatements",
        "offer",
        "teleological",
        "theory",
        "mental",
        "content",
        "claim",
        "norm",
        "function",
        "content",
        "fall",
        "side",
        "isought",
        "divide",
        "favor",
        "teleological",
        "theory",
        "content",
        "usually",
        "favor",
        "etiological",
        "theory",
        "function",
        "according",
        "item",
        "function",
        "determined",
        "history",
        "selection",
        "past",
        "selection",
        "thing",
        "type",
        "roughly",
        "etiological",
        "theory",
        "function",
        "item",
        "function",
        "selected",
        "thing",
        "type",
        "selected",
        "see",
        "eg",
        "millikan",
        "a",
        "neander",
        "important",
        "precursor",
        "ayala",
        "wright",
        "idea",
        "spelled",
        "different",
        "way",
        "one",
        "influential",
        "proposal",
        "stem",
        "karen",
        "neander",
        "give",
        "following",
        "definition",
        "function",
        "physiology",
        "athe",
        "proper",
        "function",
        "item",
        "x",
        "organism",
        "item",
        "x",
        "type",
        "contribute",
        "inclusive",
        "fitness",
        "ancestor",
        "caused",
        "genotype",
        "x",
        "phenotypic",
        "expression",
        "selected",
        "natural",
        "selection",
        "neander",
        "etiological",
        "theory",
        "biological",
        "function",
        "need",
        "allow",
        "fact",
        "ancestral",
        "trait",
        "might",
        "selected",
        "something",
        "present",
        "function",
        "descendent",
        "trait",
        "example",
        "penguin",
        "flipper",
        "emu",
        "vestigial",
        "wing",
        "longer",
        "function",
        "flight",
        "even",
        "though",
        "ancestral",
        "forelimb",
        "selected",
        "flight",
        "griffith",
        "godfreysmith",
        "offer",
        "modern",
        "history",
        "version",
        "etiological",
        "theory",
        "according",
        "function",
        "determined",
        "recent",
        "selection",
        "note",
        "selection",
        "cease",
        "trait",
        "go",
        "fixation",
        "ongoing",
        "maintenance",
        "selection",
        "still",
        "weeding",
        "fresh",
        "harmful",
        "mutation",
        "arise",
        "however",
        "selection",
        "require",
        "variation",
        "schwartz",
        "suggests",
        "continuing",
        "usefulness",
        "supplement",
        "needed",
        "kick",
        "variation",
        "absent",
        "time",
        "absence",
        "variation",
        "trait",
        "retains",
        "function",
        "still",
        "adaptive",
        "important",
        "note",
        "standard",
        "etiological",
        "theory",
        "entail",
        "function",
        "directly",
        "grounded",
        "process",
        "natural",
        "selection",
        "operating",
        "evolutionary",
        "span",
        "time",
        "millikan",
        "offer",
        "theory",
        "function",
        "also",
        "result",
        "meme",
        "selection",
        "papineau",
        "speaks",
        "learning",
        "dretske",
        "invokes",
        "function",
        "depend",
        "recruitment",
        "conditioning",
        "garson",
        "a",
        "argues",
        "notion",
        "selection",
        "loosened",
        "differential",
        "retention",
        "without",
        "differential",
        "replication",
        "could",
        "count",
        "selection",
        "case",
        "neural",
        "selection",
        "would",
        "qualify",
        "form",
        "selection",
        "could",
        "underwrite",
        "contentdetermining",
        "function",
        "finally",
        "millikan",
        "suggests",
        "function",
        "novel",
        "item",
        "derived",
        "function",
        "mechanism",
        "produce",
        "content",
        "sensoryperceptual",
        "representation",
        "might",
        "determined",
        "function",
        "directly",
        "grounded",
        "process",
        "natural",
        "selection",
        "plausible",
        "suppose",
        "contentdetermining",
        "function",
        "concept",
        "grounded",
        "one",
        "way",
        "etiological",
        "theory",
        "dominate",
        "discussion",
        "normative",
        "function",
        "philosophy",
        "biology",
        "etiological",
        "theory",
        "uncontroversial",
        "question",
        "whether",
        "teleology",
        "naturalized",
        "eg",
        "bedau",
        "others",
        "support",
        "theory",
        "reason",
        "perhaps",
        "systemic",
        "theory",
        "popular",
        "alternative",
        "see",
        "esp",
        "cummins",
        "systemic",
        "theory",
        "function",
        "emphasize",
        "role",
        "function",
        "ascription",
        "functional",
        "analysis",
        "system",
        "functional",
        "analysis",
        "system",
        "conceptually",
        "decompose",
        "complex",
        "activity",
        "whole",
        "system",
        "activity",
        "contributing",
        "part",
        "function",
        "part",
        "contribution",
        "complex",
        "activity",
        "system",
        "analysis",
        "proponent",
        "etiological",
        "theory",
        "objection",
        "idea",
        "biologist",
        "give",
        "functional",
        "analysis",
        "system",
        "contend",
        "systemic",
        "analysis",
        "fails",
        "naturalize",
        "normativity",
        "function",
        "successfully",
        "ie",
        "fails",
        "provide",
        "adequate",
        "account",
        "malfunctioning",
        "support",
        "systemic",
        "theory",
        "argue",
        "biology",
        "need",
        "naturalistic",
        "notion",
        "malfunction",
        "eg",
        "davy",
        "others",
        "argue",
        "abnormal",
        "functioning",
        "statistically",
        "atypical",
        "boorse",
        "craver",
        "lewens",
        "usual",
        "note",
        "etiological",
        "teleological",
        "function",
        "distinct",
        "causalrole",
        "function",
        "involved",
        "standardly",
        "called",
        "functionalism",
        "philosophy",
        "mind",
        "causalrole",
        "function",
        "often",
        "defined",
        "select",
        "subset",
        "trait",
        "actual",
        "causal",
        "disposition",
        "functionalism",
        "often",
        "defined",
        "view",
        "mental",
        "state",
        "individuated",
        "classified",
        "type",
        "basis",
        "disposition",
        "see",
        "eg",
        "block",
        "causalrole",
        "function",
        "subset",
        "disposition",
        "actually",
        "possessed",
        "token",
        "trait",
        "permit",
        "possibility",
        "important",
        "kind",
        "malfunctioning",
        "trait",
        "causalrole",
        "function",
        "z",
        "time",
        "lack",
        "disposition",
        "z",
        "said",
        "distinction",
        "functionalism",
        "might",
        "termed",
        "teleofunctionalism",
        "le",
        "stark",
        "might",
        "thought",
        "cf",
        "neander",
        "one",
        "reason",
        "formulation",
        "classical",
        "functionalism",
        "often",
        "spoke",
        "characteristic",
        "normal",
        "causal",
        "role",
        "mental",
        "state",
        "sometimes",
        "explicitly",
        "allow",
        "pathology",
        "see",
        "eg",
        "lewis",
        "another",
        "reason",
        "although",
        "teleological",
        "function",
        "often",
        "said",
        "selected",
        "effect",
        "effect",
        "trait",
        "selected",
        "function",
        "also",
        "described",
        "selected",
        "disposition",
        "disposition",
        "trait",
        "selected",
        "neander",
        "hundertmark",
        "form",
        "functionalism",
        "also",
        "permit",
        "multiple",
        "physical",
        "realizability",
        "trait",
        "perform",
        "function"
    ]
}