{
    "main_text": "Problems for Teleosemantics || Swampman\n4.2 Swampman\n\nAnother objection that has been influential is the Swampman objection.\nSwampman-style examples have been around for some time (Boorse 1976;\nMillikan 1984, 93). Swampman in particular was introduced by Davidson\n(1987) as a potential objection to his own historical (but not\nteleological) theory of content. When Swampman comes into existence he\nis a perfect physical replica of Davidson at a certain point in time\n(t).\n\nSwampman’s history differs radically from Davidson’s\nbecause he comes into existence as a result of a purely accidental\ncollision of elementary particles. Crucially, he does not partake in\nour evolutionary history or have any other evolutionary history or any\ndevelopmental history of his own. Nor is he created by God or copied\nfrom Davidson by a machine. The resemblance between Davidson and\nSwampman is nothing but a stupendous coincidence. Swampman’s\nappearance of design is deceptive because he in no way derives from\nany design process, natural or intentional. Swampman’s component\nparts have no functions according to an etiological theory of function\nand so his “brain” states have no contents according to\nstandard teleological theories of mental content.\n\nMany people find these results highly counter-intuitive, especially\nthe result that Swampman lacks all intentional states. Assuming\nphysicalism, we could substitute Swampman for Davidson and no one,\nincluding his most intimate friends and family, would detect a\ndifference. Swampman would make noises that his friends and family\nwould interpret as witty, interesting and meaningful but, according to\nstandard teleological theories (and Davidson’s own theory of\ncontent) Swampman has no ideas about philosophy, no perceptions of his\nsurroundings and no beliefs or desires about anything at all.\n\nWe have already seen that some proponents of teleosemantics avoid this\nproblem entirely by adopting a non-historical conception of function\n (section 3.5). \n For those theorists who do not want to take this route,\nthere are two broad strategies in responding to the Swampman\nobjection. One is to try to loosen the grip of the intuition that\nSwampman has intentional states and the other is to argue that any\nintuitions that remain do not show that teleological theories are\nwrong. In either case, it is important to isolate the relevant\nintuition because, by all accounts, Swampman would have much that\nDavidson had at t. All of the chemical activity in\nDavidson’s brain when he understood words, for example, would\noccur in Swampman’s brain-analog and certain descriptions of\nthis activity will apply to both equally: e.g., physical, chemical and\nformal descriptions of it. Further, it is trivial that Swampman has\nnarrow content if “narrow content” is defined as whatever\nmost closely approximates content that nonetheless supervenes on just\nthe narrow physical states of an individual at a time and “from\nthe skin in.” By definition, whatever narrow content\nDavidson’s mental states had at t, Swampman’s\ninner states had too, since Swampman is at t physically\nindistinguishable “from the skin in” from Davidson at\nt. What teleological theories entail is that Swampman, no\nmatter what narrow content he has, lacks regular normative content.\nThe intuition that conflicts with teleological theories, therefore, is\nthat Swampman’s inner states, which are narrowly identical to\nDavidson’s, are true, false, accurate or inaccurate in the usual\nsense.\n\nThose who try to dislodge this intuition argue that an appearance of\ndesign can be misleading. (Recall that “design” here\nincludes the mechanical design-work of natural selection.) Consider,\nfor example,Swampman’s eyes, or eye-analogs. It might be\nintuitive to attribute functions to them. But in nature nothing so\nintricately organized as if for the performance of a function fails to\nbe the result of a design process. It is argued that habits of\nthought, which usually take us from an appearance of design to a\nfunction ascription, lead to false ascriptions in purely hypothetical\nunrealistic cases (Neander 1991). The same habits of thought, the\nargument continues, also lead us to falsely ascribe intentionality to\nSwampman’s internal states. \n\nWe might grant the point about functions and yet resist the move from\nfunctions to intentionality. The problem for theories of content, as\nopposed to theories of function, is exacerbated by the relation\nbetween intentionality and consciousness. Many philosophers find it\nplausible that an individual’s phenomenal consciousness at a\ntime supervenes on just the inner physical properties of that\nindividual at that time. If this narrow supervenience thesis is true,\nthen Swampman will have phenomenal consciousness when he comes into\nexistence, assuming Davidson did at t. However, it is hard to\nsee how we can attribute phenomenal consciousness to Swampman without\nalso attributing some intentional states to him. Suppose, for example,\nthat Swampman has a red-sensation. Then presumably it will seem to him\nthat there is something red. But it seeming to him that there is\nsomething red is presumably an intentional state. (See the\nentry on \n the contents of perception.)\n\nHere we connect with another important issue that lies outside of the\nscope of this entry. However, it should be briefly noted that\nproponents of teleosemantics have several options for dealing with\nthis problem. They can either deny the narrow supervenience thesis for\nphenomenal consciousness (see, e.g., Dretske 1995) or they can argue\nthat there is no necessary connection between phenomenal consciousness\nand intentionality, i.e. that a being can be phenomenally conscious\nwithout having genuine intentional states (see, e.g., Neander 1996 and\nPapineau 2021).\n\nThe second broad strategy is to argue that Swampman intuitions cannot\nshow that teleological theories are false because they are irrelevant.\nThey are, it can be argued, not to the point if a teleological theory\nis offered as an a posteriori, real-nature theory. This strategy comes\nin two versions, which should be clearly distinguished.\n\nProponents of the first version of this strategy, e.g. Millikan (1996)\nand Neander (1996), insist that common Swampman intuitions are\nirrelevant because they are incorrect. They argue that it may\nbe natural to think that a possible being like Swampman would have\nintentional states, but that this intuitive verdict is in fact false.\nThe analogy with an a posteriori analysis of the nature of water is\nthought to be helpful here. Following Kripke and Putnam, many have\nbeen persuaded that the term “water” and the concept WATER\nhave referred to H2O exclusively, even before it was known\nthat water is H2O, because there was deference to an\nunknown nature that explained the superficial properties by means of\nwhich we usually recognize instances of the liquid. On this view, it\nwas (in 1700) natural to think that there could be water without\nH2O, although this was not, in fact, metaphysically\npossible, given that water is H2O. Along similar lines, it\ncan be argued that a Swampman that has intentional states is only an\napparent, but not a genuine metaphysical possibility, and that common\nSwampman intuitions thus do not undermine standard teleosemantic\ntheories of content. (Note that the claim here is not that Swampman is\nmetaphysically impossible, but only that a Swampman with\nintentional states is.) \n\nOf course, in the case of intentionality, unlike the case of water,\nthe hidden nature or essence cannot be an inner structure, if a\nteleological theory is correct. On such a theory, intentionality is\nalleged to be an historical kind, so the previously hidden nature is\nalleged to be a matter of history. As proponents of teleological\ntheories point out, there is an apparent need for other historical\nkinds in biology (e.g., offspring, homologs and \n species).[21]\n\n\nAccording to the second version of the ‘real nature’\nstrategy, defended by Papineau (2001; 2016), the common intuitive\nverdict that Swampman would have intentional states may well be true,\nbut its truth would be irrelevant, because it does not conflict with\nthe core claims of teleosemantics (correctly understood). The idea\nhere is that Swampman’s existence is a mere possibility, while\nteleosemantics is a claim about the actual world – very roughly,\nthe claim that in the actual world, intentional states are\nselectional states of a certain kind (Papineau 2001, 283–284). Hence,\nthe mere possibility of a Swampman whose intentional states are not\nselectional states is perfectly compatible with the truth of\nteleosemantics.\n\nThere has been much discussion of this second strategy in recent\nyears. Some critics argue that it is undermined by actual\nSwampman-like cases (Peters 2014, Porter 2020), or by the epistemic\npossibility of such cases (Sebastián 2017). Braddon-Mitchell\nand Jackson (2002) have tried to show that such a version of\nteleosemantics collapses into a form of analytical functionalism.\nFurthermore, Schulte (2020, 2286–2288) contends that acknowledging\neven the mere possibility of a Swampman with intentional states is\nincompatible with the reductive aspirations of teleosemantics. Such\nconsiderations may lead us to reject the teleosemantic approach (at\nleast in its standard, etiological form), but they can also be taken\nas reasons to adopt the first version of the ‘real nature’\nstrategy instead of the second.\n",
    "section_title": "4.2 Swampman",
    "entry_title": "Teleological Theories of Mental Content",
    "hierarchy_title": "Teleological Theories of Mental Content || Problems for Teleosemantics || Swampman",
    "tokenized_text": [
        "problem",
        "teleosemantics",
        "swampman",
        "swampman",
        "another",
        "objection",
        "influential",
        "swampman",
        "objection",
        "swampmanstyle",
        "example",
        "around",
        "time",
        "boorse",
        "millikan",
        "swampman",
        "particular",
        "introduced",
        "davidson",
        "potential",
        "objection",
        "historical",
        "teleological",
        "theory",
        "content",
        "swampman",
        "come",
        "existence",
        "perfect",
        "physical",
        "replica",
        "davidson",
        "certain",
        "point",
        "time",
        "swampman",
        "history",
        "differs",
        "radically",
        "davidson",
        "come",
        "existence",
        "result",
        "purely",
        "accidental",
        "collision",
        "elementary",
        "particle",
        "crucially",
        "partake",
        "evolutionary",
        "history",
        "evolutionary",
        "history",
        "developmental",
        "history",
        "created",
        "god",
        "copied",
        "davidson",
        "machine",
        "resemblance",
        "davidson",
        "swampman",
        "nothing",
        "stupendous",
        "coincidence",
        "swampman",
        "appearance",
        "design",
        "deceptive",
        "way",
        "derives",
        "design",
        "process",
        "natural",
        "intentional",
        "swampman",
        "component",
        "part",
        "function",
        "according",
        "etiological",
        "theory",
        "function",
        "brain",
        "state",
        "content",
        "according",
        "standard",
        "teleological",
        "theory",
        "mental",
        "content",
        "many",
        "people",
        "find",
        "result",
        "highly",
        "counterintuitive",
        "especially",
        "result",
        "swampman",
        "lack",
        "intentional",
        "state",
        "assuming",
        "physicalism",
        "could",
        "substitute",
        "swampman",
        "davidson",
        "one",
        "including",
        "intimate",
        "friend",
        "family",
        "would",
        "detect",
        "difference",
        "swampman",
        "would",
        "make",
        "noise",
        "friend",
        "family",
        "would",
        "interpret",
        "witty",
        "interesting",
        "meaningful",
        "according",
        "standard",
        "teleological",
        "theory",
        "davidson",
        "theory",
        "content",
        "swampman",
        "idea",
        "philosophy",
        "perception",
        "surroundings",
        "belief",
        "desire",
        "anything",
        "already",
        "seen",
        "proponent",
        "teleosemantics",
        "avoid",
        "problem",
        "entirely",
        "adopting",
        "nonhistorical",
        "conception",
        "function",
        "section",
        "theorist",
        "want",
        "take",
        "route",
        "two",
        "broad",
        "strategy",
        "responding",
        "swampman",
        "objection",
        "one",
        "try",
        "loosen",
        "grip",
        "intuition",
        "swampman",
        "intentional",
        "state",
        "argue",
        "intuition",
        "remain",
        "show",
        "teleological",
        "theory",
        "wrong",
        "either",
        "case",
        "important",
        "isolate",
        "relevant",
        "intuition",
        "account",
        "swampman",
        "would",
        "much",
        "davidson",
        "t",
        "chemical",
        "activity",
        "davidson",
        "brain",
        "understood",
        "word",
        "example",
        "would",
        "occur",
        "swampman",
        "brainanalog",
        "certain",
        "description",
        "activity",
        "apply",
        "equally",
        "eg",
        "physical",
        "chemical",
        "formal",
        "description",
        "trivial",
        "swampman",
        "narrow",
        "content",
        "narrow",
        "content",
        "defined",
        "whatever",
        "closely",
        "approximates",
        "content",
        "nonetheless",
        "supervenes",
        "narrow",
        "physical",
        "state",
        "individual",
        "time",
        "skin",
        "in",
        "definition",
        "whatever",
        "narrow",
        "content",
        "davidson",
        "mental",
        "state",
        "swampman",
        "inner",
        "state",
        "since",
        "swampman",
        "physically",
        "indistinguishable",
        "skin",
        "davidson",
        "t",
        "teleological",
        "theory",
        "entail",
        "swampman",
        "matter",
        "narrow",
        "content",
        "lack",
        "regular",
        "normative",
        "content",
        "intuition",
        "conflict",
        "teleological",
        "theory",
        "therefore",
        "swampman",
        "inner",
        "state",
        "narrowly",
        "identical",
        "davidson",
        "true",
        "false",
        "accurate",
        "inaccurate",
        "usual",
        "sense",
        "try",
        "dislodge",
        "intuition",
        "argue",
        "appearance",
        "design",
        "misleading",
        "recall",
        "design",
        "includes",
        "mechanical",
        "designwork",
        "natural",
        "selection",
        "consider",
        "example",
        "swampman",
        "eye",
        "eyeanalogs",
        "might",
        "intuitive",
        "attribute",
        "function",
        "nature",
        "nothing",
        "intricately",
        "organized",
        "performance",
        "function",
        "fails",
        "result",
        "design",
        "process",
        "argued",
        "habit",
        "thought",
        "usually",
        "take",
        "u",
        "appearance",
        "design",
        "function",
        "ascription",
        "lead",
        "false",
        "ascription",
        "purely",
        "hypothetical",
        "unrealistic",
        "case",
        "neander",
        "habit",
        "thought",
        "argument",
        "continues",
        "also",
        "lead",
        "u",
        "falsely",
        "ascribe",
        "intentionality",
        "swampman",
        "internal",
        "state",
        "might",
        "grant",
        "point",
        "function",
        "yet",
        "resist",
        "move",
        "function",
        "intentionality",
        "problem",
        "theory",
        "content",
        "opposed",
        "theory",
        "function",
        "exacerbated",
        "relation",
        "intentionality",
        "consciousness",
        "many",
        "philosopher",
        "find",
        "plausible",
        "individual",
        "phenomenal",
        "consciousness",
        "time",
        "supervenes",
        "inner",
        "physical",
        "property",
        "individual",
        "time",
        "narrow",
        "supervenience",
        "thesis",
        "true",
        "swampman",
        "phenomenal",
        "consciousness",
        "come",
        "existence",
        "assuming",
        "davidson",
        "t",
        "however",
        "hard",
        "see",
        "attribute",
        "phenomenal",
        "consciousness",
        "swampman",
        "without",
        "also",
        "attributing",
        "intentional",
        "state",
        "suppose",
        "example",
        "swampman",
        "redsensation",
        "presumably",
        "seem",
        "something",
        "red",
        "seeming",
        "something",
        "red",
        "presumably",
        "intentional",
        "state",
        "see",
        "entry",
        "content",
        "perception",
        "connect",
        "another",
        "important",
        "issue",
        "lie",
        "outside",
        "scope",
        "entry",
        "however",
        "briefly",
        "noted",
        "proponent",
        "teleosemantics",
        "several",
        "option",
        "dealing",
        "problem",
        "either",
        "deny",
        "narrow",
        "supervenience",
        "thesis",
        "phenomenal",
        "consciousness",
        "see",
        "eg",
        "dretske",
        "argue",
        "necessary",
        "connection",
        "phenomenal",
        "consciousness",
        "intentionality",
        "ie",
        "phenomenally",
        "conscious",
        "without",
        "genuine",
        "intentional",
        "state",
        "see",
        "eg",
        "neander",
        "papineau",
        "second",
        "broad",
        "strategy",
        "argue",
        "swampman",
        "intuition",
        "show",
        "teleological",
        "theory",
        "false",
        "irrelevant",
        "argued",
        "point",
        "teleological",
        "theory",
        "offered",
        "posteriori",
        "realnature",
        "theory",
        "strategy",
        "come",
        "two",
        "version",
        "clearly",
        "distinguished",
        "proponent",
        "first",
        "version",
        "strategy",
        "eg",
        "millikan",
        "neander",
        "insist",
        "common",
        "swampman",
        "intuition",
        "irrelevant",
        "incorrect",
        "argue",
        "may",
        "natural",
        "think",
        "possible",
        "like",
        "swampman",
        "would",
        "intentional",
        "state",
        "intuitive",
        "verdict",
        "fact",
        "false",
        "analogy",
        "posteriori",
        "analysis",
        "nature",
        "water",
        "thought",
        "helpful",
        "following",
        "kripke",
        "putnam",
        "many",
        "persuaded",
        "term",
        "water",
        "concept",
        "water",
        "referred",
        "ho",
        "exclusively",
        "even",
        "known",
        "water",
        "ho",
        "deference",
        "unknown",
        "nature",
        "explained",
        "superficial",
        "property",
        "mean",
        "usually",
        "recognize",
        "instance",
        "liquid",
        "view",
        "natural",
        "think",
        "could",
        "water",
        "without",
        "ho",
        "although",
        "fact",
        "metaphysically",
        "possible",
        "given",
        "water",
        "ho",
        "along",
        "similar",
        "line",
        "argued",
        "swampman",
        "intentional",
        "state",
        "apparent",
        "genuine",
        "metaphysical",
        "possibility",
        "common",
        "swampman",
        "intuition",
        "thus",
        "undermine",
        "standard",
        "teleosemantic",
        "theory",
        "content",
        "note",
        "claim",
        "swampman",
        "metaphysically",
        "impossible",
        "swampman",
        "intentional",
        "state",
        "course",
        "case",
        "intentionality",
        "unlike",
        "case",
        "water",
        "hidden",
        "nature",
        "essence",
        "inner",
        "structure",
        "teleological",
        "theory",
        "correct",
        "theory",
        "intentionality",
        "alleged",
        "historical",
        "kind",
        "previously",
        "hidden",
        "nature",
        "alleged",
        "matter",
        "history",
        "proponent",
        "teleological",
        "theory",
        "point",
        "apparent",
        "need",
        "historical",
        "kind",
        "biology",
        "eg",
        "offspring",
        "homologs",
        "specie",
        "according",
        "second",
        "version",
        "real",
        "nature",
        "strategy",
        "defended",
        "papineau",
        "common",
        "intuitive",
        "verdict",
        "swampman",
        "would",
        "intentional",
        "state",
        "may",
        "well",
        "true",
        "truth",
        "would",
        "irrelevant",
        "conflict",
        "core",
        "claim",
        "teleosemantics",
        "correctly",
        "understood",
        "idea",
        "swampman",
        "existence",
        "mere",
        "possibility",
        "teleosemantics",
        "claim",
        "actual",
        "world",
        "roughly",
        "claim",
        "actual",
        "world",
        "intentional",
        "state",
        "selectional",
        "state",
        "certain",
        "kind",
        "papineau",
        "hence",
        "mere",
        "possibility",
        "swampman",
        "whose",
        "intentional",
        "state",
        "selectional",
        "state",
        "perfectly",
        "compatible",
        "truth",
        "teleosemantics",
        "much",
        "discussion",
        "second",
        "strategy",
        "recent",
        "year",
        "critic",
        "argue",
        "undermined",
        "actual",
        "swampmanlike",
        "case",
        "peter",
        "porter",
        "epistemic",
        "possibility",
        "case",
        "sebastián",
        "braddonmitchell",
        "jackson",
        "tried",
        "show",
        "version",
        "teleosemantics",
        "collapse",
        "form",
        "analytical",
        "functionalism",
        "furthermore",
        "schulte",
        "contends",
        "acknowledging",
        "even",
        "mere",
        "possibility",
        "swampman",
        "intentional",
        "state",
        "incompatible",
        "reductive",
        "aspiration",
        "teleosemantics",
        "consideration",
        "may",
        "lead",
        "u",
        "reject",
        "teleosemantic",
        "approach",
        "least",
        "standard",
        "etiological",
        "form",
        "also",
        "taken",
        "reason",
        "adopt",
        "first",
        "version",
        "real",
        "nature",
        "strategy",
        "instead",
        "second"
    ]
}