{
    "main_text": "Contradictory Negation in Term and Propositional Logic\n3. Contradictory Negation in Term and Propositional Logic\n\n\nNot every natural language negation is a contradictory operator, or\neven a logical operator. A statement may be rejected as false, as\nunwarranted, or as inappropriate—misleading, badly pronounced,\nwrongly focused, likely to induce unwanted implicatures or\npresuppositions, overly or insufficiently formal in register. Only in\nthe first of these cases, as a toggle between truth and falsity, is it\nclear that contradictory negation is involved (Horn 1989, Smiley\n1993). Sainsbury (2004) takes truth-functional contradictory negation\nto be a special case of a generalized option negation as a\ndeselection operator: If there are two mutually exhaustive and\nexclusive options A and B, to select A is to deselect B. But the\nrelevant options may involve not truth, but some other aspect of\nutterance form or meaning as in the standard examples\nof metalinguistic negation (Horn 1989; see the entry on\n negation). In such cases, a speaker\nuses negation metalinguistically or echoically to object to a previous\nutterance on any grounds whatsoever, including its phonetic or\ngrammatical form, register, or associated presuppositions or\nimplicatures: “That's not a car, it's a Volkswagen”,\n“Cancer selection is not a but the major force in the emergence\nof complex animal life”, “He's not your old man, he's your\nfather”, “We didn't call the POlice, we called the\npoLICE”. In such cases, the relevant target for deselection is\nwhat the right thing is to say in a particular context, where\n“truth is not sufficient for being right, and may not even be\nnecessary” (Sainsbury 2004: 87). Thus the apparent LNC violation\n(if it's a Volkswagen, it both is and isn't a car) is not a real\none.  \n\n\nGiven that not every apparent sentential negation is contradictory, is\nevery contradictory negation sentential? Within propositional logic,\ncontradictory negation is a self-annihilating operator:\n¬(¬Φ) is equivalent to Φ. This is explicitly\nrecognized in the proto-Fregean Stoic logic of Alexander of\nAphrodisias: “‘Not: not: it is day’ differs from\n‘it is day’ only in manner of speech” (Mates 1953:\n126). The Stoics' apophatikon directly prefigures the\niterating and self-cancelling propositional negation of Frege and\nRussell. As Frege puts it (1919: 130), “Wrapping up a thought in\ndouble negation does not alter its truth value.” The\ncorresponding linguistic principle is expressed in the grammarians'\nbromide, “Duplex negatio affirmat.”\n\n\nNot all systems of propositional logic accept a biconditional law of\ndouble negation (LDN), ¬(¬Φ) ≡ Φ. In particular,\nLDN, along with LEM, is not valid for the Intuitionists, who reject\n¬(¬Φ) → Φ while accepting its converse, Φ\n→ ¬(¬Φ). But the very possibility of applying\nnegation to a negated statement presupposes the analysis of\ncontradictory negation as an iterative operator (one capable of\napplying to its own output), or as a function whose range is\nidentical to (or a subset of) its domain. Within the categorical term-based logic of\nAristotle and his Peripatetic successors, every\nstatement—whether singular or general—is of\nsubject-predicate form. Contradictory negation is not a one-place\noperator taking propositions into propositions, but rather a mode\nof predication, a way of combining subjects with predicates: a\ngiven predicate can be either affirmed or denied of a given\nsubject. Unlike the apophatikon or propositional negation\nconnective introduced by the Stoics and formalized in Fregean and\nRussellian logic, Aristotelian predicate denial, while toggling truth\nand falsity and yielding the semantics of contradictory opposition,\ndoes not apply to its own output and hence does not syntactically\niterate. In this respect, predicate denial both anticipates the form\nof negation in Montague Grammar (see the entry on\n Montague semantics) and provides a more plausible\nrepresentation of contradictory negation in natural language, whether\nAncient Greek or English, where reflexes of the iterating one-place\nconnective of the Stoics and Fregeans (“Not: not: the sun is\nshining”) are hard to find outside of artificial constructs like\nthe “it is not the case” construction (Horn 1989,\n§7.2). In a given natural language, contradictory negation may be\nexpressed as a particle associated with a copula or a verb, as an\ninflected auxiliary verb, as a verb of negation, or as a negative\nsuffix or prefix. \n\n\nIn addition, there is a widespread pragmatically motivated tendency\nfor a formal contradictory negation to be strengthened to a semantic\nor virtual contrary through such processes as litotes (“I don't\nlike prunes” conveying that I dislike prunes) and so-called\nneg(ative) raising (“I don't think that Φ” conveying\n“I think that ¬Φ”). Similarly, the prefixal\nnegation in such adjectives as “unhappy” or\n“unfair” is understood as a contrary rather than\ncontradictory (not-Adj) of its base. These phenomena have been much\ndiscussed by rhetoricians, logicians, and linguists (see the\nentry on negation and Horn 1989: Chap. 5).\n\n\nIn addition to predicate denial, in which a predicate F is\ndenied of a subject a, Aristotelian logic allows for\nnarrow-scope predicate term negation, in which a negative\npredicate not-F is affirmed of a. The relations of\npredicate denial and predicate term negation to a simple affirmative\nproposition (and to each other) can be schematized on a generalized\nsquare of opposition for singular (non-quantified) expressions (De\nInterpretatione 19b19–30, Prior Analytics Chapter\n46):\n(6) Negation Square\n\n\n\nIf Socrates doesn't exist, “Socrates is wise” (A)\nand its contrary “Socrates is not-wise” (E) are\nboth automatically false (since nothing—positive or\nnegative—can be truly affirmed of a non-existent subject), while\ntheir respective contradictories “Socrates is not wise”\n(O) and “Socrates is not not-wise” (I)\nare both true. Similarly, for any object x, either x\nis red or x is not red—but x may be neither\nred nor not-red; if, for instance, x is a unicorn or a prime\nnumber.\n\n\nWhile Russell (1905) echoed (without acknowledgment) Aristotle's\nambiguist analysis of negation as either contradictory\n(“external”) or contrary (“internal”), by\nvirtue of the two logical forms assigned to “The king of France\nis not bald” (see descriptions),\nsuch propositionalized accounts are bought at a cost of naturalness,\nas singular sentences of subject-predicate grammatical form are\nassigned the logical form of an existentially quantified conjunction\nand as names are transmuted into predicates. \n\n\nThe difference between denying P of S and\naffirming not-P of S is realized in Ancient Greek as\na scopal distinction reflected in word order: S P [not is]\n(Socrates healthy not-is) vs. S [not P] is (Socrates\nnot-healthy is). As indicated in (6), for Aristotle only\nsentences can be in contradictory opposition. P\nand not-P both yield falsity when predicated of a\nnon-existent subject but one or the other of the two terms is\ntruthfully predicable of any existent subject in the relevant\ndomain. P and not-P are “logical\ncontraries” that exclude a true middle, an existent entity which\nis neither P nor not-P. But naturally occurring\ncases of prefixal adjectives, those marked by a(n)- in\nGreek, may involve an unexcluded middle, as do polar contraries or\nantonym pairs.  Modern grammatical discourse departs from Aristotle in\nallowing for contradictory terms: middle-allowing contrary adjectives\n(white/black,\nhappy/unhappy) are distinguished from middle-excluding contradictory adjectives\n(transitive/intransitive, alive/dead). \n\n\nJespersen (1917: 144) describes the logical status of negatively\nprefixed adjectives in English:\n\n\nThe modification in sense brought about by the addition of the\nprefix [un-] is generally that of a simple negative:\nunworthy = ‘not worthy’, etc. The two terms\n[P, unP] are thus contradictory terms. But very often the prefix\nproduces a “contrary” term…: unjust (and\ninjustice) generally imply the opposite of just (justice);\nunwise means more than not wise and approaches\nfoolish, unhappy is not far from miserable, etc.\n\n\n\nLike Aristotle, Jespersen predicts that the negation of true\ncontraries like unhappy, unjust, or unwise will be\nsemantically distinct from their positive bases. Thus, not\nunhappy fails to reduce to happy by virtue of allowing an\nunexcluded middle: one can be neither happy nor unhappy but just blaah,\nin the same way that something can be neither black nor white but one\nof the fifty-plus shades of gray. At the same time, even those\nadjectives that are semantic contradictories, e.g. impossible,\nmay be coerced under negation into virtual contraries. While\ntechnically any action or event must be either possible or impossible,\nto assess something as not impossible is often to portray its\noccurrence as a more remote possibility than to assess it as\npossible simpliciter, as reflected in attestations of\n“It’s possible, or at least not impossible”. Similar\ninstances of virtual contrariety are readily attested with negated verb\nphrases (“I don’t NOT love the dog” ≠ I love the\ndog) or predicate nominals (“We’re not NOT friends”\n≠ We’re friends); see Horn 2017.\n\n\nDrawing on an epistemic theory of vagueness, Krifka (2007) argues\nthat prefixal negation always yields semantic contradictories. On this view,\nunhappy is literally just ‘not happy’, with the\ncharacteristic stronger understanding derived pragmatically. The\nincomplete cancellation of the two negators in not unhappy is\ntaken to be a purely pragmatic phenomenon, conflating this case with\nthat of not impossible. But the classical theory has its\nadvantages. On that approach, un-Adj antonyms (like their\nmorphologically simplex classmates, sad or bad) are\nlexical items that can constitute contraries vis-à-vis the\ncorresponding positive. By virtue of their lexical status, they are\ncandidates to undergo further semantic drift, unlike not Adj\nsequences (or non-Adj forms), as evidenced in the semantic\nand phonological opacity of infamous or\nimpious. Note too that many un- and in-\nadjectives (unkempt, inchoate, incorrigible) lack\ncorresponding simple bases. Furthermore, the prefix non-\nyields staunch contradictories (typically with objective and/or\ntechnical senses) often contrasting minimally with un-Adj or\niN-Adj contraries favoring gradable and evaluative\ncontexts:\n\nnon-American vs. un-American; non-professional vs.\n unprofessional\nnon-Christian vs. un-Christian; \nnon-rational vs. irrational\nnon-moral vs. immoral; \nnon-realistic vs. unrealistic\nnon-natural vs. unnatural; \nnon-scientific vs. unscientific\n\n\n\nEven more problematically for a unified treatment, the treatment of\nall negatively prefixed adjectives as semantic contradictories would\nseem naturally to extend from unhappy or unwise to\nsimplex antonymic pairs like happy/sad or\nwise/foolish, where the evidence for semantic\ncontrariety appears to be incontrovertible. While Krifka (2007: 174)\nsupports the analysis of e.g. happy and unhappy as\n“literally contradictories that receive their interpretations as\ncontraries only via pragmatic strengthening”, Horn (2017) argues\nthat a traditional (neo-Aristotelian) approach invoking parallel but distinct semantic\nand pragmatic strengthening processes is on sounder empirical\nfooting.\n",
    "section_title": "3. Contradictory Negation in Term and Propositional Logic",
    "entry_title": "Contradiction",
    "hierarchy_title": "Contradiction || Contradictory Negation in Term and Propositional Logic",
    "tokenized_text": [
        "contradictory",
        "negation",
        "term",
        "propositional",
        "logic",
        "contradictory",
        "negation",
        "term",
        "propositional",
        "logic",
        "every",
        "natural",
        "language",
        "negation",
        "contradictory",
        "operator",
        "even",
        "logical",
        "operator",
        "statement",
        "may",
        "rejected",
        "false",
        "unwarranted",
        "inappropriatemisleading",
        "badly",
        "pronounced",
        "wrongly",
        "focused",
        "likely",
        "induce",
        "unwanted",
        "implicatures",
        "presupposition",
        "overly",
        "insufficiently",
        "formal",
        "register",
        "first",
        "case",
        "toggle",
        "truth",
        "falsity",
        "clear",
        "contradictory",
        "negation",
        "involved",
        "horn",
        "smiley",
        "sainsbury",
        "take",
        "truthfunctional",
        "contradictory",
        "negation",
        "special",
        "case",
        "generalized",
        "option",
        "negation",
        "deselection",
        "operator",
        "two",
        "mutually",
        "exhaustive",
        "exclusive",
        "option",
        "b",
        "select",
        "deselect",
        "b",
        "relevant",
        "option",
        "may",
        "involve",
        "truth",
        "aspect",
        "utterance",
        "form",
        "meaning",
        "standard",
        "example",
        "metalinguistic",
        "negation",
        "horn",
        "see",
        "entry",
        "negation",
        "case",
        "speaker",
        "us",
        "negation",
        "metalinguistically",
        "echoically",
        "object",
        "previous",
        "utterance",
        "ground",
        "whatsoever",
        "including",
        "phonetic",
        "grammatical",
        "form",
        "register",
        "associated",
        "presupposition",
        "implicatures",
        "s",
        "car",
        "s",
        "volkswagen",
        "cancer",
        "selection",
        "major",
        "force",
        "emergence",
        "complex",
        "animal",
        "life",
        "s",
        "old",
        "man",
        "s",
        "father",
        "nt",
        "call",
        "police",
        "called",
        "police",
        "case",
        "relevant",
        "target",
        "deselection",
        "right",
        "thing",
        "say",
        "particular",
        "context",
        "truth",
        "sufficient",
        "right",
        "may",
        "even",
        "necessary",
        "sainsbury",
        "thus",
        "apparent",
        "lnc",
        "violation",
        "s",
        "volkswagen",
        "nt",
        "car",
        "real",
        "one",
        "given",
        "every",
        "apparent",
        "sentential",
        "negation",
        "contradictory",
        "every",
        "contradictory",
        "negation",
        "sentential",
        "within",
        "propositional",
        "logic",
        "contradictory",
        "negation",
        "selfannihilating",
        "operator",
        "φ",
        "equivalent",
        "φ",
        "explicitly",
        "recognized",
        "protofregean",
        "stoic",
        "logic",
        "alexander",
        "aphrodisia",
        "day",
        "differs",
        "day",
        "manner",
        "speech",
        "mate",
        "stoic",
        "apophatikon",
        "directly",
        "prefigures",
        "iterating",
        "selfcancelling",
        "propositional",
        "negation",
        "frege",
        "russell",
        "frege",
        "put",
        "wrapping",
        "thought",
        "double",
        "negation",
        "alter",
        "truth",
        "value",
        "corresponding",
        "linguistic",
        "principle",
        "expressed",
        "grammarian",
        "bromide",
        "duplex",
        "negatio",
        "affirmat",
        "system",
        "propositional",
        "logic",
        "accept",
        "biconditional",
        "law",
        "double",
        "negation",
        "ldn",
        "φ",
        "φ",
        "particular",
        "ldn",
        "along",
        "lem",
        "valid",
        "intuitionists",
        "reject",
        "φ",
        "φ",
        "accepting",
        "converse",
        "φ",
        "φ",
        "possibility",
        "applying",
        "negation",
        "negated",
        "statement",
        "presupposes",
        "analysis",
        "contradictory",
        "negation",
        "iterative",
        "operator",
        "one",
        "capable",
        "applying",
        "output",
        "function",
        "whose",
        "range",
        "identical",
        "subset",
        "domain",
        "within",
        "categorical",
        "termbased",
        "logic",
        "aristotle",
        "peripatetic",
        "successor",
        "every",
        "statementwhether",
        "singular",
        "generalis",
        "subjectpredicate",
        "form",
        "contradictory",
        "negation",
        "oneplace",
        "operator",
        "taking",
        "proposition",
        "proposition",
        "rather",
        "mode",
        "predication",
        "way",
        "combining",
        "subject",
        "predicate",
        "given",
        "predicate",
        "either",
        "affirmed",
        "denied",
        "given",
        "subject",
        "unlike",
        "apophatikon",
        "propositional",
        "negation",
        "connective",
        "introduced",
        "stoic",
        "formalized",
        "fregean",
        "russellian",
        "logic",
        "aristotelian",
        "predicate",
        "denial",
        "toggling",
        "truth",
        "falsity",
        "yielding",
        "semantics",
        "contradictory",
        "opposition",
        "apply",
        "output",
        "hence",
        "syntactically",
        "iterate",
        "respect",
        "predicate",
        "denial",
        "anticipates",
        "form",
        "negation",
        "montague",
        "grammar",
        "see",
        "entry",
        "montague",
        "semantics",
        "provides",
        "plausible",
        "representation",
        "contradictory",
        "negation",
        "natural",
        "language",
        "whether",
        "ancient",
        "greek",
        "english",
        "reflex",
        "iterating",
        "oneplace",
        "connective",
        "stoic",
        "fregeans",
        "sun",
        "shining",
        "hard",
        "find",
        "outside",
        "artificial",
        "construct",
        "like",
        "case",
        "construction",
        "horn",
        "given",
        "natural",
        "language",
        "contradictory",
        "negation",
        "may",
        "expressed",
        "particle",
        "associated",
        "copula",
        "verb",
        "inflected",
        "auxiliary",
        "verb",
        "verb",
        "negation",
        "negative",
        "suffix",
        "prefix",
        "addition",
        "widespread",
        "pragmatically",
        "motivated",
        "tendency",
        "formal",
        "contradictory",
        "negation",
        "strengthened",
        "semantic",
        "virtual",
        "contrary",
        "process",
        "litotes",
        "nt",
        "like",
        "prune",
        "conveying",
        "dislike",
        "prune",
        "socalled",
        "neg",
        "ative",
        "raising",
        "nt",
        "think",
        "φ",
        "conveying",
        "think",
        "φ",
        "similarly",
        "prefixal",
        "negation",
        "adjective",
        "unhappy",
        "unfair",
        "understood",
        "contrary",
        "rather",
        "contradictory",
        "notadj",
        "base",
        "phenomenon",
        "much",
        "discussed",
        "rhetorician",
        "logician",
        "linguist",
        "see",
        "entry",
        "negation",
        "horn",
        "chap",
        "addition",
        "predicate",
        "denial",
        "predicate",
        "f",
        "denied",
        "subject",
        "aristotelian",
        "logic",
        "allows",
        "narrowscope",
        "predicate",
        "term",
        "negation",
        "negative",
        "predicate",
        "notf",
        "affirmed",
        "a",
        "relation",
        "predicate",
        "denial",
        "predicate",
        "term",
        "negation",
        "simple",
        "affirmative",
        "proposition",
        "schematized",
        "generalized",
        "square",
        "opposition",
        "singular",
        "nonquantified",
        "expression",
        "de",
        "interpretatione",
        "b",
        "prior",
        "analytics",
        "chapter",
        "negation",
        "square",
        "socrates",
        "nt",
        "exist",
        "socrates",
        "wise",
        "contrary",
        "socrates",
        "notwise",
        "e",
        "automatically",
        "false",
        "since",
        "nothingpositive",
        "negativecan",
        "truly",
        "affirmed",
        "nonexistent",
        "subject",
        "respective",
        "contradictory",
        "socrates",
        "wise",
        "socrates",
        "notwise",
        "true",
        "similarly",
        "object",
        "x",
        "either",
        "x",
        "red",
        "x",
        "redbut",
        "x",
        "may",
        "neither",
        "red",
        "notred",
        "instance",
        "x",
        "unicorn",
        "prime",
        "number",
        "russell",
        "echoed",
        "without",
        "acknowledgment",
        "aristotle",
        "s",
        "ambiguist",
        "analysis",
        "negation",
        "either",
        "contradictory",
        "external",
        "contrary",
        "internal",
        "virtue",
        "two",
        "logical",
        "form",
        "assigned",
        "king",
        "france",
        "bald",
        "see",
        "description",
        "propositionalized",
        "account",
        "bought",
        "cost",
        "naturalness",
        "singular",
        "sentence",
        "subjectpredicate",
        "grammatical",
        "form",
        "assigned",
        "logical",
        "form",
        "existentially",
        "quantified",
        "conjunction",
        "name",
        "transmuted",
        "predicate",
        "difference",
        "denying",
        "p",
        "affirming",
        "notp",
        "realized",
        "ancient",
        "greek",
        "scopal",
        "distinction",
        "reflected",
        "word",
        "order",
        "p",
        "socrates",
        "healthy",
        "notis",
        "vs",
        "p",
        "socrates",
        "nothealthy",
        "indicated",
        "aristotle",
        "sentence",
        "contradictory",
        "opposition",
        "p",
        "notp",
        "yield",
        "falsity",
        "predicated",
        "nonexistent",
        "subject",
        "one",
        "two",
        "term",
        "truthfully",
        "predicable",
        "existent",
        "subject",
        "relevant",
        "domain",
        "p",
        "notp",
        "logical",
        "contrary",
        "exclude",
        "true",
        "middle",
        "existent",
        "entity",
        "neither",
        "p",
        "notp",
        "naturally",
        "occurring",
        "case",
        "prefixal",
        "adjective",
        "marked",
        "n",
        "greek",
        "may",
        "involve",
        "unexcluded",
        "middle",
        "polar",
        "contrary",
        "antonym",
        "pair",
        "modern",
        "grammatical",
        "discourse",
        "departs",
        "aristotle",
        "allowing",
        "contradictory",
        "term",
        "middleallowing",
        "contrary",
        "adjective",
        "whiteblack",
        "happyunhappy",
        "distinguished",
        "middleexcluding",
        "contradictory",
        "adjective",
        "transitiveintransitive",
        "alivedead",
        "jespersen",
        "describes",
        "logical",
        "status",
        "negatively",
        "prefixed",
        "adjective",
        "english",
        "modification",
        "sense",
        "brought",
        "addition",
        "prefix",
        "un",
        "generally",
        "simple",
        "negative",
        "unworthy",
        "worthy",
        "etc",
        "two",
        "term",
        "p",
        "unp",
        "thus",
        "contradictory",
        "term",
        "often",
        "prefix",
        "produce",
        "contrary",
        "term",
        "unjust",
        "injustice",
        "generally",
        "imply",
        "opposite",
        "justice",
        "unwise",
        "mean",
        "wise",
        "approach",
        "foolish",
        "unhappy",
        "far",
        "miserable",
        "etc",
        "like",
        "aristotle",
        "jespersen",
        "predicts",
        "negation",
        "true",
        "contrary",
        "like",
        "unhappy",
        "unjust",
        "unwise",
        "semantically",
        "distinct",
        "positive",
        "base",
        "thus",
        "unhappy",
        "fails",
        "reduce",
        "happy",
        "virtue",
        "allowing",
        "unexcluded",
        "middle",
        "one",
        "neither",
        "happy",
        "unhappy",
        "blaah",
        "way",
        "something",
        "neither",
        "black",
        "white",
        "one",
        "fiftyplus",
        "shade",
        "gray",
        "time",
        "even",
        "adjective",
        "semantic",
        "contradictory",
        "eg",
        "impossible",
        "may",
        "coerced",
        "negation",
        "virtual",
        "contrary",
        "technically",
        "action",
        "event",
        "must",
        "either",
        "possible",
        "impossible",
        "ass",
        "something",
        "impossible",
        "often",
        "portray",
        "occurrence",
        "remote",
        "possibility",
        "ass",
        "possible",
        "simpliciter",
        "reflected",
        "attestation",
        "possible",
        "least",
        "impossible",
        "similar",
        "instance",
        "virtual",
        "contrariety",
        "readily",
        "attested",
        "negated",
        "verb",
        "phrase",
        "love",
        "dog",
        "love",
        "dog",
        "predicate",
        "nominal",
        "friend",
        "friend",
        "see",
        "horn",
        "drawing",
        "epistemic",
        "theory",
        "vagueness",
        "krifka",
        "argues",
        "prefixal",
        "negation",
        "always",
        "yield",
        "semantic",
        "contradictory",
        "view",
        "unhappy",
        "literally",
        "happy",
        "characteristic",
        "stronger",
        "understanding",
        "derived",
        "pragmatically",
        "incomplete",
        "cancellation",
        "two",
        "negators",
        "unhappy",
        "taken",
        "purely",
        "pragmatic",
        "phenomenon",
        "conflating",
        "case",
        "impossible",
        "classical",
        "theory",
        "advantage",
        "approach",
        "unadj",
        "antonym",
        "like",
        "morphologically",
        "simplex",
        "classmate",
        "sad",
        "bad",
        "lexical",
        "item",
        "constitute",
        "contrary",
        "visàvis",
        "corresponding",
        "positive",
        "virtue",
        "lexical",
        "status",
        "candidate",
        "undergo",
        "semantic",
        "drift",
        "unlike",
        "adj",
        "sequence",
        "nonadj",
        "form",
        "evidenced",
        "semantic",
        "phonological",
        "opacity",
        "infamous",
        "impious",
        "note",
        "many",
        "un",
        "in",
        "adjective",
        "unkempt",
        "inchoate",
        "incorrigible",
        "lack",
        "corresponding",
        "simple",
        "base",
        "furthermore",
        "prefix",
        "non",
        "yield",
        "staunch",
        "contradictory",
        "typically",
        "objective",
        "andor",
        "technical",
        "sens",
        "often",
        "contrasting",
        "minimally",
        "unadj",
        "inadj",
        "contrary",
        "favoring",
        "gradable",
        "evaluative",
        "context",
        "nonamerican",
        "vs",
        "unamerican",
        "nonprofessional",
        "vs",
        "unprofessional",
        "nonchristian",
        "vs",
        "unchristian",
        "nonrational",
        "vs",
        "irrational",
        "nonmoral",
        "vs",
        "immoral",
        "nonrealistic",
        "vs",
        "unrealistic",
        "nonnatural",
        "vs",
        "unnatural",
        "nonscientific",
        "vs",
        "unscientific",
        "even",
        "problematically",
        "unified",
        "treatment",
        "treatment",
        "negatively",
        "prefixed",
        "adjective",
        "semantic",
        "contradictory",
        "would",
        "seem",
        "naturally",
        "extend",
        "unhappy",
        "unwise",
        "simplex",
        "antonymic",
        "pair",
        "like",
        "happysad",
        "wisefoolish",
        "evidence",
        "semantic",
        "contrariety",
        "appears",
        "incontrovertible",
        "krifka",
        "support",
        "analysis",
        "eg",
        "happy",
        "unhappy",
        "literally",
        "contradictory",
        "receive",
        "interpretation",
        "contrary",
        "via",
        "pragmatic",
        "strengthening",
        "horn",
        "argues",
        "traditional",
        "neoaristotelian",
        "approach",
        "invoking",
        "parallel",
        "distinct",
        "semantic",
        "pragmatic",
        "strengthening",
        "process",
        "sounder",
        "empirical",
        "footing"
    ]
}