{
    "main_text": "Critical Reactions, Contextualist Responses || EC’s Error Theory\n4.3 EC’s Error Theory\nOne of the major attractions of EC is said to be that it enables the resolution of certain apparent conflicts among sets of individually plausible claims without forcing us to deny any of them.[15] As Crispin Wright puts it, a good part of the appeal of EC is that it seems to enable a “‘no-fault’ view of certain (potentially) intransigent disputes where we have to hand no ready conception of a further fact which would make one party right at the expense of the other” (2005, 240).\nHowever, as we saw above, contextualists are committed to a certain error theory. After all, that EC is correct is supposed to be a quite recent discovery. Further, in those cases in which speakers’ claims about who does/doesn’t “know” are said by the contextualist not to conflict, there persists the sense that they are cannot both be speaking truly. For instance, our ordinary claims to “know” various things seem to be what the skeptic is denying—that is why skepticism has seemed to pose a problem to which EC is said to constitute a novel solution. The contextualist seeks to explain why we might think this—more generally, why we might think that what is said in a given ‘high stakes’ case is incompatible with what is said in its ‘low stakes’ counterpart—by suggesting that we fail to fully appreciate the contextualist semantics and/or to faithfully track shifts in context (see, e.g.: Cohen 1999, 77; 2001, 89; 2014, 73; cf. DeRose 1999, 194; 1995, 40–41; 2004b, 37).\nAccording to another often-voiced objection to EC (in, e.g., Schiffer 1996, Hofweber 1999, Rysiew 2001, Hawthorne 2004, Conee 2014, Williamson 2005a, Egan et al. 2005), its error theory is problematic. As formulated by Stephen Schiffer, the objection is simply that it is implausible that we would get “bamboozled by our own words” (ibid., 329) in the way the contextualist alleges, since “speakers would know what they were saying if knowledge sentences were indexical in the way the Contextualist requires” (ibid.: 328).\nIs this a good objection? On the face of it, it might seem not. With respect to SA above, for example, the two premises are individually quite plausible, the argument appears valid, yet the conclusion seems very implausible. So, “something plausible has to go” (DeRose 1995, 2; emphasis added). Thus, that EC is not an entirely no fault view might mean, as Timothy Williamson has argued (2005b, Section II), that considerations of charity per se do not favor it. But why think that the contextualist’s error theory is problematic? This is one of the ways in which Cohen has responded to concerns about EC’s error theory (2014, 82–83).[16] DeRose (2006; 2009, Chapter 5; see too Montminy 2009) replies along similar lines: if you present a group of subjects with SA, for instance, and ask them whether the conclusion contradicts an ordinary claim to “know” such a thing, some will say “yes”, and some will say “no”. If EC turns out to be true, then many are blind to that, and so on. So, whichever view turns out to be right, EC or Invariantism, a substantial portion of ordinary speakers are afflicted by “semantic blindness” (Hawthorne 2004, 107).\nIn assessing this type of response to the objection under consideration, it is important to separate out two questions: First, whether, considered on its own, the contextualist’s error theory is plausible. Second, whether that theory raises any problems internal to the contextualist view.\nAs to the first question, there are precedents for the type of error that the contextualist says is going on with respect to at least some of our “knowledge” attributions. For example, by implicitly raising the standards—drawing attention to previously disregarded bumps, etc.—you can get a competent speaker to take seriously “flatness skepticism”, the view that nothing’s really flat (Cohen 1999, 78–79; 2004, 193; 2014, 73, 82–83). But this can take place only because,\n…although ascriptions of flatness are context-sensitive, competent speakers can fail to realize this. And because they can fail to realize this, they can mistakenly think that their reluctance to ascribe flatness, in a context where the standards are at the extreme, conflicts with their ascriptions of flatness in everyday contexts. (Cohen 2001, 91; 1999, 79)\nHowever, when an apparent incompatibility between certain uttered sentences is actually due to their expressing different propositions in different contexts, once we see that this is so, any appearance that the sentences are incompatible tends to go away. Thus, we might ‘disagree’ over whether Kansas is flat, but once it is made clear that you mean relatively unmountainous and I mean devoid of any hills at all, we quickly agree that we were both right all along. But for many, this does not happen when they are presented with the proposed contextualist resolution to the problem cases which motivate it (Conee 2014, 68, 78; Feldman 2001, 73, 77–78; Rysiew 2001, 484–485).\nAcknowledging this difference, Cohen notes that we already know that there are “varying degrees to which competent speakers are blind to the context-sensitivity in the language” (2014, 74). The context-sensitivity of indexicals like ‘I’ and ‘now’ are easy to spot, that of ‘flat’ somewhat harder. And for ‘know’, “it may be very difficult even after some amount of reflection for competent speakers to accept context-sensitivity. It may take subtle philosophical considerations concerning the best way to resolve a paradox in order to ‘see’ the context-sensitivity of ‘knows’” (ibid.).\nBolstering the latter suggestion are cases involving what Thomas Hofweber (1999, 98ff.) calls “hidden relativity”. For example, according to Hofweber, our claim, “August is a summer month,” presumes that we are in the Northern hemisphere.[17] A speaker may not be aware of this, however; and even those who are aware of it do not feel compelled to make that parameter explicit whenever they utter the relevant sort of sentence. So, when Schiffer says, “no ordinary person would dream of telling you that what he meant and was implicitly stating was that he knew that p relative to such-and-such standard” (1996, 326ff.), that in itself does not show that no such relativization is in play.\nIt is not clear, however, whether Hofweber’s hidden relativities provide a model for our supposed ignorance of the context-sensitivity of ‘knowledge’ sentences. For, while many competent speakers of English are unaware of the (alleged) relativity of ‘summer month’, once they are made aware of it, they do not actively resist its being made explicit. Whereas, when the alleged relativizations within knowledge sentences are made explicit—“Smith doesn’t knowS that the flight stops in Chicago,” etc. (Bach 2005, Section I)—they are often met with resistance and regarded as highlighting the controversial character of EC.[18]\nFurther, as Hofweber says (1999, 101–2), with regard to ‘summer month’, say, there is a plausible explanation of why the relativization in question can be hidden for many speakers and, even among those who are aware of it, rarely be made explicit—namely, that most of the people with whom we discuss such things are geographically close to us. Because of this, the relativity to a hemisphere very rarely makes a difference to uses of ‘summer’. Whereas, the evidence for contextualism requires that there be some interesting variation among the standards which determine a ‘knowledge’ sentence’s truth-conditions within this or that linguistic community, and it requires that we be guided in our everyday “knowledge”-attributing behavior by an awareness of just this fact.\nThis last point brings out the second question concerning the contextualist’s error theory mentioned above—namely, whether that theory raises any problems internal to the contextualist view. For, to the extent that the context-sensitivity of the relevant expressions can remain deeply hidden, even after careful reflection, it becomes less clear that in the cases of concern (SA, the airport example, etc.) what is driving our judgments as to whether what speakers say is ‘true and proper’ is, as the contextualist says, our awareness of that context-sensitivity (Rysiew 2007, 653; 2012a, 137). The contextualist must thus strike “a delicate balance” (Conee 2014, 67–68) between crediting us with a grasp of the context-sensitivity of ‘knowledge’ sentences, while at the same time attributing to us a failure to fully grasp it.\nFinally, as Ram Neta observes, in Hofweber’s cases it is some worldly fact about the phenomenon in question of which people are ignorant. Whereas,\n…the contextualist does not want to say that our semantic ignorance about our knowledge attributions results from our ignorance of the real nature of knowledge. Rather, it is supposed to result from our ignorance about the way in which the content of those attributions depends upon contextual factors. (2003a, 404)\nAnd, as we have seen, far from referring to various worldly phenomena, ‘context’ is generally said by contextualists to refer to such things as the purposes, intentions, expectations, presuppositions, etc., of the speakers who utter those sentences. (The same sorts of things, plausibly, which are responsible for determining what is expressed by attributions of flatness, say.)\nAccording to some (e.g., Rysiew 2001, 485, 507), this last point of dissimilarity between Hofweber’s hidden relativities and that which contextualists allege intensifies concerns about the latter’s error theory. For it seems to imply a quite specific deficit in “our powers of semantic self-knowledge” (Neta 2003a, 408): to say that we conflate contexts (Cohen 2014, 82) is to say that we are mixed up about what our intentions, purposes, etc., are when we utter ‘knowledge’ sentences. That sort of thing does sometimes happen. (Neta—ibid., 407–408—describes one such case.) Still, and whether or not it constitutes a deficit in “semantic self-knowledge,” exactly, it would be good if we had some explanation as to why many have such a hard time coming to terms with the truth of EC when the context-sensitivity of other terms is fairly easily accepted. Cohen has tentatively suggested that considerations of value might explain this:\n\nWe value justification and knowledge. But contextualist theories are deflationary. Contextualism about knowledge says that most of our everyday utterances of the form ‘S knows P’ are true, even though the strength of epistemic position in those instances does not meet our highest standards. In the same way, contextualism about flatness says that most of our everyday utterances of sentences of the form ‘X is flat’ are true, even though X’s surface may fall short of perfect flatness.\nIn other words, contextualism is a ‘good news, bad news’ theory. The good news is that we have lots of knowledge and many surfaces are flat; the bad news is that knowledge and flatness are not all they were cracked up to be. We find this much easier to accept in the case of flatness than knowledge, because ascriptions of flatness do not have the normative force that ascriptions of knowledge/justification do. (2005a, 61–2; cf. 2004, 193)\n\nIt is not clear whether this suggested explanation represents a step forward. At most, it seems, it would explain why we might be disappointed by what ‘knowledge’ typically designates; it would not explain why we have difficulty recognizing the alleged context-sensitivity in question. In any case, it should by now be clear that we have moved beyond considerations of the contextualist’s imputation of error to ordinary speakers per se. While we are not faultless in out tacit semantic understanding, the specific ignorance asserted in defense of EC is disputable.\n",
    "section_title": "4.3 EC’s Error Theory",
    "entry_title": "Epistemic Contextualism",
    "hierarchy_title": "Epistemic Contextualism || Critical Reactions, Contextualist Responses || EC’s Error Theory",
    "tokenized_text": [
        "critical",
        "reaction",
        "contextualist",
        "response",
        "ec",
        "error",
        "theory",
        "ec",
        "error",
        "theory",
        "one",
        "major",
        "attraction",
        "ec",
        "said",
        "enables",
        "resolution",
        "certain",
        "apparent",
        "conflict",
        "among",
        "set",
        "individually",
        "plausible",
        "claim",
        "without",
        "forcing",
        "u",
        "deny",
        "crispin",
        "wright",
        "put",
        "good",
        "part",
        "appeal",
        "ec",
        "seems",
        "enable",
        "nofault",
        "view",
        "certain",
        "potentially",
        "intransigent",
        "dispute",
        "hand",
        "ready",
        "conception",
        "fact",
        "would",
        "make",
        "one",
        "party",
        "right",
        "expense",
        "however",
        "saw",
        "contextualists",
        "committed",
        "certain",
        "error",
        "theory",
        "ec",
        "correct",
        "supposed",
        "quite",
        "recent",
        "discovery",
        "case",
        "speaker",
        "claim",
        "doesdoesn",
        "know",
        "said",
        "contextualist",
        "conflict",
        "persists",
        "sense",
        "speaking",
        "truly",
        "instance",
        "ordinary",
        "claim",
        "know",
        "various",
        "thing",
        "seem",
        "skeptic",
        "denyingthat",
        "skepticism",
        "seemed",
        "pose",
        "problem",
        "ec",
        "said",
        "constitute",
        "novel",
        "solution",
        "contextualist",
        "seek",
        "explain",
        "might",
        "think",
        "thismore",
        "generally",
        "might",
        "think",
        "said",
        "given",
        "high",
        "stake",
        "case",
        "incompatible",
        "said",
        "low",
        "stake",
        "counterpartby",
        "suggesting",
        "fail",
        "fully",
        "appreciate",
        "contextualist",
        "semantics",
        "andor",
        "faithfully",
        "track",
        "shift",
        "context",
        "see",
        "eg",
        "cohen",
        "cf",
        "derose",
        "b",
        "according",
        "another",
        "oftenvoiced",
        "objection",
        "ec",
        "eg",
        "schiffer",
        "hofweber",
        "rysiew",
        "hawthorne",
        "conee",
        "williamson",
        "a",
        "egan",
        "et",
        "al",
        "error",
        "theory",
        "problematic",
        "formulated",
        "stephen",
        "schiffer",
        "objection",
        "simply",
        "implausible",
        "would",
        "get",
        "bamboozled",
        "word",
        "ibid",
        "way",
        "contextualist",
        "alleges",
        "since",
        "speaker",
        "would",
        "know",
        "saying",
        "knowledge",
        "sentence",
        "indexical",
        "way",
        "contextualist",
        "requires",
        "ibid",
        "good",
        "objection",
        "face",
        "might",
        "seem",
        "respect",
        "sa",
        "example",
        "two",
        "premise",
        "individually",
        "quite",
        "plausible",
        "argument",
        "appears",
        "valid",
        "yet",
        "conclusion",
        "seems",
        "implausible",
        "something",
        "plausible",
        "go",
        "derose",
        "emphasis",
        "added",
        "thus",
        "ec",
        "entirely",
        "fault",
        "view",
        "might",
        "mean",
        "timothy",
        "williamson",
        "argued",
        "b",
        "section",
        "ii",
        "consideration",
        "charity",
        "per",
        "se",
        "favor",
        "think",
        "contextualist",
        "error",
        "theory",
        "problematic",
        "one",
        "way",
        "cohen",
        "responded",
        "concern",
        "ec",
        "error",
        "theory",
        "derose",
        "chapter",
        "see",
        "montminy",
        "reply",
        "along",
        "similar",
        "line",
        "present",
        "group",
        "subject",
        "sa",
        "instance",
        "ask",
        "whether",
        "conclusion",
        "contradicts",
        "ordinary",
        "claim",
        "know",
        "thing",
        "say",
        "yes",
        "say",
        "ec",
        "turn",
        "true",
        "many",
        "blind",
        "whichever",
        "view",
        "turn",
        "right",
        "ec",
        "invariantism",
        "substantial",
        "portion",
        "ordinary",
        "speaker",
        "afflicted",
        "semantic",
        "blindness",
        "hawthorne",
        "assessing",
        "type",
        "response",
        "objection",
        "consideration",
        "important",
        "separate",
        "two",
        "question",
        "first",
        "whether",
        "considered",
        "contextualist",
        "error",
        "theory",
        "plausible",
        "second",
        "whether",
        "theory",
        "raise",
        "problem",
        "internal",
        "contextualist",
        "view",
        "first",
        "question",
        "precedent",
        "type",
        "error",
        "contextualist",
        "say",
        "going",
        "respect",
        "least",
        "knowledge",
        "attribution",
        "example",
        "implicitly",
        "raising",
        "standardsdrawing",
        "attention",
        "previously",
        "disregarded",
        "bump",
        "etcyou",
        "get",
        "competent",
        "speaker",
        "take",
        "seriously",
        "flatness",
        "skepticism",
        "view",
        "nothing",
        "really",
        "flat",
        "cohen",
        "take",
        "place",
        "although",
        "ascription",
        "flatness",
        "contextsensitive",
        "competent",
        "speaker",
        "fail",
        "realize",
        "fail",
        "realize",
        "mistakenly",
        "think",
        "reluctance",
        "ascribe",
        "flatness",
        "context",
        "standard",
        "extreme",
        "conflict",
        "ascription",
        "flatness",
        "everyday",
        "context",
        "cohen",
        "however",
        "apparent",
        "incompatibility",
        "certain",
        "uttered",
        "sentence",
        "actually",
        "due",
        "expressing",
        "different",
        "proposition",
        "different",
        "context",
        "see",
        "appearance",
        "sentence",
        "incompatible",
        "tends",
        "go",
        "away",
        "thus",
        "might",
        "disagree",
        "whether",
        "kansa",
        "flat",
        "made",
        "clear",
        "mean",
        "relatively",
        "unmountainous",
        "mean",
        "devoid",
        "hill",
        "quickly",
        "agree",
        "right",
        "along",
        "many",
        "happen",
        "presented",
        "proposed",
        "contextualist",
        "resolution",
        "problem",
        "case",
        "motivate",
        "conee",
        "feldman",
        "rysiew",
        "acknowledging",
        "difference",
        "cohen",
        "note",
        "already",
        "know",
        "varying",
        "degree",
        "competent",
        "speaker",
        "blind",
        "contextsensitivity",
        "language",
        "contextsensitivity",
        "indexicals",
        "like",
        "easy",
        "spot",
        "flat",
        "somewhat",
        "harder",
        "know",
        "may",
        "difficult",
        "even",
        "amount",
        "reflection",
        "competent",
        "speaker",
        "accept",
        "contextsensitivity",
        "may",
        "take",
        "subtle",
        "philosophical",
        "consideration",
        "concerning",
        "best",
        "way",
        "resolve",
        "paradox",
        "order",
        "see",
        "contextsensitivity",
        "know",
        "ibid",
        "bolstering",
        "latter",
        "suggestion",
        "case",
        "involving",
        "thomas",
        "hofweber",
        "ff",
        "call",
        "hidden",
        "relativity",
        "example",
        "according",
        "hofweber",
        "claim",
        "august",
        "summer",
        "month",
        "presumes",
        "northern",
        "hemisphere",
        "speaker",
        "may",
        "aware",
        "however",
        "even",
        "aware",
        "feel",
        "compelled",
        "make",
        "parameter",
        "explicit",
        "whenever",
        "utter",
        "relevant",
        "sort",
        "sentence",
        "schiffer",
        "say",
        "ordinary",
        "person",
        "would",
        "dream",
        "telling",
        "meant",
        "implicitly",
        "stating",
        "knew",
        "p",
        "relative",
        "suchandsuch",
        "standard",
        "ff",
        "show",
        "relativization",
        "play",
        "clear",
        "however",
        "whether",
        "hofweber",
        "hidden",
        "relativity",
        "provide",
        "model",
        "supposed",
        "ignorance",
        "contextsensitivity",
        "knowledge",
        "sentence",
        "many",
        "competent",
        "speaker",
        "english",
        "unaware",
        "alleged",
        "relativity",
        "summer",
        "month",
        "made",
        "aware",
        "actively",
        "resist",
        "made",
        "explicit",
        "whereas",
        "alleged",
        "relativizations",
        "within",
        "knowledge",
        "sentence",
        "made",
        "explicit",
        "smith",
        "know",
        "flight",
        "stop",
        "chicago",
        "etc",
        "bach",
        "section",
        "they",
        "often",
        "met",
        "resistance",
        "regarded",
        "highlighting",
        "controversial",
        "character",
        "ec",
        "hofweber",
        "say",
        "regard",
        "summer",
        "month",
        "say",
        "plausible",
        "explanation",
        "relativization",
        "question",
        "hidden",
        "many",
        "speaker",
        "even",
        "among",
        "aware",
        "rarely",
        "made",
        "explicitnamely",
        "people",
        "discus",
        "thing",
        "geographically",
        "close",
        "u",
        "relativity",
        "hemisphere",
        "rarely",
        "make",
        "difference",
        "us",
        "summer",
        "whereas",
        "evidence",
        "contextualism",
        "requires",
        "interesting",
        "variation",
        "among",
        "standard",
        "determine",
        "knowledge",
        "sentence",
        "truthconditions",
        "within",
        "linguistic",
        "community",
        "requires",
        "guided",
        "everyday",
        "knowledge",
        "attributing",
        "behavior",
        "awareness",
        "fact",
        "last",
        "point",
        "brings",
        "second",
        "question",
        "concerning",
        "contextualist",
        "error",
        "theory",
        "mentioned",
        "abovenamely",
        "whether",
        "theory",
        "raise",
        "problem",
        "internal",
        "contextualist",
        "view",
        "extent",
        "contextsensitivity",
        "relevant",
        "expression",
        "remain",
        "deeply",
        "hidden",
        "even",
        "careful",
        "reflection",
        "becomes",
        "le",
        "clear",
        "case",
        "concern",
        "sa",
        "airport",
        "example",
        "etc",
        "driving",
        "judgment",
        "whether",
        "speaker",
        "say",
        "true",
        "proper",
        "contextualist",
        "say",
        "awareness",
        "contextsensitivity",
        "rysiew",
        "a",
        "contextualist",
        "must",
        "thus",
        "strike",
        "delicate",
        "balance",
        "conee",
        "crediting",
        "u",
        "grasp",
        "contextsensitivity",
        "knowledge",
        "sentence",
        "time",
        "attributing",
        "u",
        "failure",
        "fully",
        "grasp",
        "finally",
        "ram",
        "neta",
        "observes",
        "hofweber",
        "case",
        "worldly",
        "fact",
        "phenomenon",
        "question",
        "people",
        "ignorant",
        "whereas",
        "the",
        "contextualist",
        "want",
        "say",
        "semantic",
        "ignorance",
        "knowledge",
        "attribution",
        "result",
        "ignorance",
        "real",
        "nature",
        "knowledge",
        "rather",
        "supposed",
        "result",
        "ignorance",
        "way",
        "content",
        "attribution",
        "depends",
        "upon",
        "contextual",
        "factor",
        "a",
        "seen",
        "far",
        "referring",
        "various",
        "worldly",
        "phenomenon",
        "context",
        "generally",
        "said",
        "contextualists",
        "refer",
        "thing",
        "purpose",
        "intention",
        "expectation",
        "presupposition",
        "etc",
        "speaker",
        "utter",
        "sentence",
        "sort",
        "thing",
        "plausibly",
        "responsible",
        "determining",
        "expressed",
        "attribution",
        "flatness",
        "say",
        "according",
        "eg",
        "rysiew",
        "last",
        "point",
        "dissimilarity",
        "hofweber",
        "hidden",
        "relativity",
        "contextualists",
        "allege",
        "intensifies",
        "concern",
        "latter",
        "error",
        "theory",
        "seems",
        "imply",
        "quite",
        "specific",
        "deficit",
        "power",
        "semantic",
        "selfknowledge",
        "neta",
        "a",
        "say",
        "conflate",
        "context",
        "cohen",
        "say",
        "mixed",
        "intention",
        "purpose",
        "etc",
        "utter",
        "knowledge",
        "sentence",
        "sort",
        "thing",
        "sometimes",
        "happen",
        "netaibid",
        "describes",
        "one",
        "case",
        "still",
        "whether",
        "constitutes",
        "deficit",
        "semantic",
        "selfknowledge",
        "exactly",
        "would",
        "good",
        "explanation",
        "many",
        "hard",
        "time",
        "coming",
        "term",
        "truth",
        "ec",
        "contextsensitivity",
        "term",
        "fairly",
        "easily",
        "accepted",
        "cohen",
        "tentatively",
        "suggested",
        "consideration",
        "value",
        "might",
        "explain",
        "value",
        "justification",
        "knowledge",
        "contextualist",
        "theory",
        "deflationary",
        "contextualism",
        "knowledge",
        "say",
        "everyday",
        "utterance",
        "form",
        "know",
        "p",
        "true",
        "even",
        "though",
        "strength",
        "epistemic",
        "position",
        "instance",
        "meet",
        "highest",
        "standard",
        "way",
        "contextualism",
        "flatness",
        "say",
        "everyday",
        "utterance",
        "sentence",
        "form",
        "x",
        "flat",
        "true",
        "even",
        "though",
        "x",
        "surface",
        "may",
        "fall",
        "short",
        "perfect",
        "flatness",
        "word",
        "contextualism",
        "good",
        "news",
        "bad",
        "news",
        "theory",
        "good",
        "news",
        "lot",
        "knowledge",
        "many",
        "surface",
        "flat",
        "bad",
        "news",
        "knowledge",
        "flatness",
        "cracked",
        "find",
        "much",
        "easier",
        "accept",
        "case",
        "flatness",
        "knowledge",
        "ascription",
        "flatness",
        "normative",
        "force",
        "ascription",
        "knowledgejustification",
        "a",
        "cf",
        "clear",
        "whether",
        "suggested",
        "explanation",
        "represents",
        "step",
        "forward",
        "seems",
        "would",
        "explain",
        "might",
        "disappointed",
        "knowledge",
        "typically",
        "designates",
        "would",
        "explain",
        "difficulty",
        "recognizing",
        "alleged",
        "contextsensitivity",
        "question",
        "case",
        "clear",
        "moved",
        "beyond",
        "consideration",
        "contextualist",
        "imputation",
        "error",
        "ordinary",
        "speaker",
        "per",
        "se",
        "faultless",
        "tacit",
        "semantic",
        "understanding",
        "specific",
        "ignorance",
        "asserted",
        "defense",
        "ec",
        "disputable"
    ]
}