{
    "main_text": "Leibniz and Conway\n5. Leibniz and Conway\n\n\nAs we have seen, rationalist epistemology is grounded in a\nmetaphysical commitment to substance. The concept of substance allowed\nthe rationalists to reduce all complexity and plurality to an\nunderlying simplicity and unity, versus the empiricists, who, in their\nskepticism about substance, were committed to regarding reality as\nfundamentally plural and complex. Spinoza’s metaphysics marked\nthe culmination of this rationalist momentum. In Leibniz, the last\ngreat continental rationalist, we see its final movement. Leibniz,\nlike other rationalists before him, regarded quotidian things as\nphenomena that ultimately reduce to perfectly simple\nsubstances. However, for Leibniz, there is an infinite number of these\nsimple substances, each of them causally and perceptually isolated\nfrom all of the others. Leibniz reasoned that this is the best of all\npossible worlds because it balances the maximal possible complexity\nwith the maximal possible order. In thus privileging neither unity nor\nplurality, neither simplicity nor complexity, and in striking the\nbalance that he did on purely rational principles, Leibniz exemplified\na more complex, more comprehensive and, ultimately, more mature\nrationalism than that of his predecessors.\n\n\nFor Leibniz, at the most fundamental level, reality is characterized\nby simple substances, or “monads”, a term that Leibniz\npicked up from Francis Mercury van Helmont and Anne Conway in 1696\n(Merchant 1979). Since there are composites, Leibniz argued, there\nmust be simple substances that, together, constitute these\ncomposites. Being simple, monads have neither parts, nor extension,\nnor form, nor divisibility. Leibniz saw them as the “true Atoms\nof nature”. While Leibniz thus retained a strong commitment to\nsubstance, he resisted rationalism’s synechistic momentum, which\nprivileged the metaphysical and methodological stance of the\ncontinuity of the universe, by rehabilitating substance’s\nAristotelian role as an individuator. However, while, for Aristotle,\nBucephalus is a proper substance, Leibniz regarded Bucephalus not as a\nsubstance but as himself comprising a collection of simple\nsubstances. Leibniz agreed with Aristotle’s characterization of\nsubstance as the grammatical subject of predication and not itself\npredicable of anything else. However, he complained that this account\ndoes not go far enough. For Leibniz, the essence of substance lies not\nin the fact that it is the subject of predication, but in the fact\nthat every possible predicate may be asserted or denied of it. In this\nway, every individual substance has a complete concept, a conception\nso complete (that is, so fully determinate) that every fact about the\nsubstance, and about its situation in the universe—past, present\nor future —follows from it analytically.\n\n\nLeibniz’s insistence that every individual substance has a\ncomplete concept entailed that, unlike Spinoza, he regarded Cartesian\nthinking substance and not Cartesian extended substance as\nparadigmatic of substance. Descartes’s extended substance (like\nSpinozistic substance) is, on Leibniz’s account, not a substance\nat all since it does not afford a principle of individuation. Leibniz\nargued that, whereas a real substance has a complete concept, the\nCartesian notion of extended substance is an abstraction arrived at\nthrough an incomplete concept. Matter on its own is insufficient to\nform or to constitute a substance. For Leibniz, a body could never be\na candidate for substance since bodies are susceptible to alteration\nand are infinitely divisible. We can thus never arrive at a body of\nwhich it can be said, “Here really is an entity.”\nMoreover, whereas Cartesian extended substance is totally inert,\nLeibniz insisted that activity is the hallmark of substance. Anything\nthat acts is a substance; every substance constantly and\nuninterruptedly acts. For Leibniz, this position follows from\nGod’s perfection. God’s planning of the universe was so\nperfect that it only required to be set in motion by him. True\nsubstances (that is, entia per se) are active and\nself-causing. On Leibniz’s account, God would lack all dignity\nwere he the sole cause in the universe—that is, if occasionalism\nor interventionism were necessary. God’s perfect planning\navoids the necessity for (continual or continuous) extraordinary\nconcourse. Thus, God’s perfection entails that all substances\nare active; passive extension is only matter, not substance.\n\n\nThe activity, or appetition, that Leibniz regards as\ncharacterizing the monads is intimately bound up with his Principle of\nSufficient Reason. For Leibniz, a monad contains its whole history\nbecause each monadic state (except for those states—creation is\nparadigmatic of these—that are the result of divine causation)\nhas its sufficient cause in the preceding state. In turn, the present\nstate is the sufficient cause of all succeeding states. Despite this\nemphasis on the inherent activity of substance, Leibniz, like Spinoza,\nrejected the possibility of transeunt causation among substances.\nMonads are “windowless” and neither admit nor emit causal\ninfluence. Moreover, being thus windowless, monads can no more receive\nperceptions from the world than they can any other external causation.\nRather, a monad’s perceptions are built-in at creation. By\npreestablished harmony, these perceptions perfectly align with the\nuniverse’s infinite monadic states. This entails that while\nthere is no genuine transeunt causation at the monadic level, a kind\nof pseudocausation results from monads’ harmonized perceptions\nof each other as their respective appetitions convey them through\nsuccessive changes. For Leibniz, causal relations thus reduce to\nlogical relations in that every change in a substance follows from its\nconcept.\n\n\nWhile Leibniz’s view that every substance has a complete concept\nreinforces the centrality of reason in his epistemology, in doing so,\nit seems to undercut human and even divine volition, and thereby to\nslide toward Spinozism. If every fact about Julius Caesar, and indeed,\nevery other fact about the universe is rationally deducible from the\nRoman Dictator’s complete concept, then it would seem that only\none course for the universe is possible. However, this is not a step\nthat Leibniz was willing to take. Were there no distinction between\ncontingent and necessary truths, argued Leibniz, fatalism would be\ntrue, and human liberty of the will would be impossible. Leibniz\nsought to avert this result by distinguishing between hypothetical and\nabsolute necessity. Absolute necessity, he argued, is governed by the\nprinciple of contradiction. Something is absolutely necessary if its\nnegation is logically impossible. Hypothetical necessity, on the other\nhand, describes a state of affairs that is necessary ex\nhypothesi—that is, just in case a particular antecedent\nholds—but not logically necessary. On Leibniz’s account,\nthe fact that Caesar crossed the Rubicon is only hypothetically\nnecessary; it follows necessarily from the existence of the individual\nsubstance that is Caesar, but its denial is not logically\nimpossible. According to Leibniz, God at creation conceived of an\ninfinite array of possible worlds. The myriad contingent facts of each\nof these worlds are only hypothetically necessary. That is, they would\nonly be necessary if God were to instantiate that world. Since the\npresent world is the one that God chose to instantiate, all of the\ncontingent facts of this world are certain. However, they are\nnonetheless contingent since their negation implies no absurdity. That\nis, there was no logical impossibility preventing Caesar from deciding\nnot to cross the Rubicon. In this sense, his will—and, indeed,\nhuman will generally—is free.  Leibniz’s argument for\nhypothetical necessity has an obvious antecedent in Descartes’s\ndoctrine of created truth. However, unlike Descartes, Leibniz limited\nthe doctrine’s scope to contingent truths. He nonetheless hoped\nto avoid Spinozist necessitarianism. Whether or not he succeeded in\ndoing so is a matter of debate in the literature.\n\n\nInasmuch as it characterizes the universe as composed of a plurality\nof individual existences, none of which has any genuine causal\nefficacy over any other, Leibniz’s position shows considerable\naffinities with Hume’s empiricism. However, while Hume inferred\nfrom this the importance of experience, Leibniz instead took this\nontology to preclude adventitious knowledge. He thus remained\ncommitted on metaphysical grounds to the doctrine of innate ideas. In\nhis rejection of transeunt causation among substances, Leibniz\nrejected the notion that we can learn new things about the world in\nthe sense of gaining new ideas that do not already exist in our\nsouls. On Leibniz’s account, the temporal coincidence of a\ncertain phenomenon with one’s “learning” of the\nphenomenon was preestablished at creation in the same way that all\nmonadic states were. Leibniz admitted that it is idiomatically\nacceptable to speak about acquiring knowledge via the senses. However,\nhe regarded all sensory reports as reducible to, and explicable as,\ndescriptions of logical relations. Leibniz’s theory of knowledge\nthus relegates the Aristotelian idea of human beings as blank slates\nwho learn through induction to a mere façon de\nparler. By contrast, he strongly endorsed Plato’s doctrine\nof recollection to the extent that it locates all knowledge in ideas\nalready residing in the soul. Socrates’s exchange with\nMeno’s slave boy, argued Leibniz, shows that the soul already\npossesses the ideas upon which truths about the universe depend, and\nneeds only to be reminded of them.\n\n\nOn Leibniz’s account, substances have built into them\nperceptions of the whole universe. Every substance, he argued, is a\nmirror of the whole universe to the extent that everything that has\never happened or existed or will ever happen or exist are included in\nits complete concept. The perceptions of all substances, he\nmaintained, thus resemble God’s infinite perception in their\nunlimited scope. It is with respect to clarity and distinctness that\nthe perceptions of created substance fall short of God’s. For\nLeibniz, the best of all possible worlds is that world that balances\nthe maximal possible complexity with the maximal possible order. The\nexisting world satisfies this through the infinite variety of\nperspectives taken by the monads. By the principle of order, each\nmonad reflects the very same world as do the other monads. However, by\nthe principle of complexity, the monads reflect the world from an\ninfinite number of unique perspectives. This infinite variety in\nperspectives entails that each monad reflects all of the others with\nvarying degrees of clarity and distinctness. In this way, the universe\nis replete with an infinite number of different representations of\nGod’s works. Among these, only God’s perceptions are\nuniversally clear and distinct. While the complexity requirement for\nthe best of all possible worlds would seem to preclude in principle\nthe possibility of human beings achieving knowledge of the\nuniverse sub specie aeternitatis, Leibniz made a special\nexception for human souls. On Leibniz’s account, all monads have\nlow-level perceptions, of the kind that we experience when we are in a\nstupor. However, the souls of living things have, over and above this,\nfeelings and memories. Human souls have, besides this, through divine\nelection, the power of reason. It is reason that allows us to\nunderstand the universe as a system, through the use of models and\nidealizations, and thereby to grasp the eternal truths. In this way,\nargued Leibniz, human minds are not only mirrors of the universe of\ncreated things, but indeed mirror God himself.\n\n\nLeibniz is committed to the view that, given God’s perfection,\nanything God creates must also be perfect—this is why the\ncreated world is the best possible world. This means that a large part\nof his writings are theodicean in spirit. Leibniz shares this spirit\nwith his close contemporary, Anne Conway. Conway’s system is\nmotivated by her desire to reject Cartesian dualism, Spinozism, and\nHobbesian materialism. On her view, any commitment to the existence of\nmaterial substance is a commitment to the existence of “dead\nmass”. Any such view is gravely mistaken. For, she holds that\nnature is shot through with the “vital principle of\nmotion”, which has life and perception, qualities befitting any\ncreation of God (Chapter IX, section 2). Conway thus rejects\nDescartes’s dualism, while nevertheless noting that because he\naccepts the immateriality of God, he is at least better than Hobbes,\nwho holds that God is material. Finally, she registers that her\ndisagreement with Spinoza has to do with his monism, which effaces any\ndistinction between God and creatures (Chapter IX, section 3).\n\n\nTo avoid the problem that she identifies with Descartes and Hobbes,\nConway asserts a monism: all creatures are composed of one kind of\nsubstance—spiritual. To avoid the problem she associates with\nSpinoza, Conway asserts that while only one (spiritual) substance\nexists, the universe is divided into three “species” that\ndiffer in their essences: creatures, Christ, and God. This tripartite\nseparation is grounded on the basis of the changeability of the\nmember(s) of the species: the essential feature of creatures is that\nthey can change for the better and for the worse, the essential\nfeature of Christ is that he can only change for the better, and\nGod’s essence is that He is unchanging (Chapter VI, section\n4). In postulating these three “species” of the one\nsubstance, Conway is able to assert God’s separation from\ncreation, as well as a metaphysically and morally mediating role for\nChrist. This mediating role for Christ is of central importance to\nConway’s theodicy. On her view, accepting this tripartite\ndivision of species “will contribute greatly to the propagation\nof the true faith and Christian religion among Jews and Turks and\nother infidel nations” (Chapter VI, section 5). This is because\nonce we appreciate the reasoning in favor of a mediator between\ncreatures and God, and we accept this reasoning, we believe in Christ\nwhether we call the mediator by that name or not. In this way, Conway\ncan answer a particularly difficult challenge to any Christian\nthinker: how can Christianity be the universal religion, in which\nsalvation depends on knowing Christ, when so much of the Earth’s\npopulation is ignorant of Christ? On her system, she can assert that\nmany people may know Christ as mediator, without knowing him by name\nor even by role in the Christian religion.\n\n\nWhile the rise of British empiricism and of Kant’s critical\nphilosophy marked the end of continental rationalism as a movement,\nthe elegant visions of Leibniz and Conway are a fitting paean to the\nmovement and, indeed, to the power of human reason.\n",
    "section_title": "5. Leibniz and Conway",
    "entry_title": "Continental Rationalism",
    "hierarchy_title": "Continental Rationalism || Leibniz and Conway",
    "tokenized_text": [
        "leibniz",
        "conway",
        "leibniz",
        "conway",
        "seen",
        "rationalist",
        "epistemology",
        "grounded",
        "metaphysical",
        "commitment",
        "substance",
        "concept",
        "substance",
        "allowed",
        "rationalist",
        "reduce",
        "complexity",
        "plurality",
        "underlying",
        "simplicity",
        "unity",
        "versus",
        "empiricist",
        "skepticism",
        "substance",
        "committed",
        "regarding",
        "reality",
        "fundamentally",
        "plural",
        "complex",
        "spinoza",
        "metaphysics",
        "marked",
        "culmination",
        "rationalist",
        "momentum",
        "leibniz",
        "last",
        "great",
        "continental",
        "rationalist",
        "see",
        "final",
        "movement",
        "leibniz",
        "like",
        "rationalist",
        "regarded",
        "quotidian",
        "thing",
        "phenomenon",
        "ultimately",
        "reduce",
        "perfectly",
        "simple",
        "substance",
        "however",
        "leibniz",
        "infinite",
        "number",
        "simple",
        "substance",
        "causally",
        "perceptually",
        "isolated",
        "others",
        "leibniz",
        "reasoned",
        "best",
        "possible",
        "world",
        "balance",
        "maximal",
        "possible",
        "complexity",
        "maximal",
        "possible",
        "order",
        "thus",
        "privileging",
        "neither",
        "unity",
        "plurality",
        "neither",
        "simplicity",
        "complexity",
        "striking",
        "balance",
        "purely",
        "rational",
        "principle",
        "leibniz",
        "exemplified",
        "complex",
        "comprehensive",
        "ultimately",
        "mature",
        "rationalism",
        "predecessor",
        "leibniz",
        "fundamental",
        "level",
        "reality",
        "characterized",
        "simple",
        "substance",
        "monad",
        "term",
        "leibniz",
        "picked",
        "francis",
        "mercury",
        "van",
        "helmont",
        "anne",
        "conway",
        "merchant",
        "since",
        "composite",
        "leibniz",
        "argued",
        "must",
        "simple",
        "substance",
        "together",
        "constitute",
        "composite",
        "simple",
        "monad",
        "neither",
        "part",
        "extension",
        "form",
        "divisibility",
        "leibniz",
        "saw",
        "true",
        "atom",
        "nature",
        "leibniz",
        "thus",
        "retained",
        "strong",
        "commitment",
        "substance",
        "resisted",
        "rationalism",
        "synechistic",
        "momentum",
        "privileged",
        "metaphysical",
        "methodological",
        "stance",
        "continuity",
        "universe",
        "rehabilitating",
        "substance",
        "aristotelian",
        "role",
        "individuator",
        "however",
        "aristotle",
        "bucephalus",
        "proper",
        "substance",
        "leibniz",
        "regarded",
        "bucephalus",
        "substance",
        "comprising",
        "collection",
        "simple",
        "substance",
        "leibniz",
        "agreed",
        "aristotle",
        "characterization",
        "substance",
        "grammatical",
        "subject",
        "predication",
        "predicable",
        "anything",
        "else",
        "however",
        "complained",
        "account",
        "go",
        "far",
        "enough",
        "leibniz",
        "essence",
        "substance",
        "lie",
        "fact",
        "subject",
        "predication",
        "fact",
        "every",
        "possible",
        "predicate",
        "may",
        "asserted",
        "denied",
        "way",
        "every",
        "individual",
        "substance",
        "complete",
        "concept",
        "conception",
        "complete",
        "fully",
        "determinate",
        "every",
        "fact",
        "substance",
        "situation",
        "universepast",
        "present",
        "future",
        "follows",
        "analytically",
        "leibniz",
        "insistence",
        "every",
        "individual",
        "substance",
        "complete",
        "concept",
        "entailed",
        "unlike",
        "spinoza",
        "regarded",
        "cartesian",
        "thinking",
        "substance",
        "cartesian",
        "extended",
        "substance",
        "paradigmatic",
        "substance",
        "descartes",
        "extended",
        "substance",
        "like",
        "spinozistic",
        "substance",
        "leibniz",
        "account",
        "substance",
        "since",
        "afford",
        "principle",
        "individuation",
        "leibniz",
        "argued",
        "whereas",
        "real",
        "substance",
        "complete",
        "concept",
        "cartesian",
        "notion",
        "extended",
        "substance",
        "abstraction",
        "arrived",
        "incomplete",
        "concept",
        "matter",
        "insufficient",
        "form",
        "constitute",
        "substance",
        "leibniz",
        "body",
        "could",
        "never",
        "candidate",
        "substance",
        "since",
        "body",
        "susceptible",
        "alteration",
        "infinitely",
        "divisible",
        "thus",
        "never",
        "arrive",
        "body",
        "said",
        "really",
        "entity",
        "moreover",
        "whereas",
        "cartesian",
        "extended",
        "substance",
        "totally",
        "inert",
        "leibniz",
        "insisted",
        "activity",
        "hallmark",
        "substance",
        "anything",
        "act",
        "substance",
        "every",
        "substance",
        "constantly",
        "uninterruptedly",
        "act",
        "leibniz",
        "position",
        "follows",
        "god",
        "perfection",
        "god",
        "planning",
        "universe",
        "perfect",
        "required",
        "set",
        "motion",
        "true",
        "substance",
        "entia",
        "per",
        "se",
        "active",
        "selfcausing",
        "leibniz",
        "account",
        "god",
        "would",
        "lack",
        "dignity",
        "sole",
        "cause",
        "universethat",
        "occasionalism",
        "interventionism",
        "necessary",
        "god",
        "perfect",
        "planning",
        "avoids",
        "necessity",
        "continual",
        "continuous",
        "extraordinary",
        "concourse",
        "thus",
        "god",
        "perfection",
        "entail",
        "substance",
        "active",
        "passive",
        "extension",
        "matter",
        "substance",
        "activity",
        "appetition",
        "leibniz",
        "regard",
        "characterizing",
        "monad",
        "intimately",
        "bound",
        "principle",
        "sufficient",
        "reason",
        "leibniz",
        "monad",
        "contains",
        "whole",
        "history",
        "monadic",
        "state",
        "except",
        "statescreation",
        "paradigmatic",
        "thesethat",
        "result",
        "divine",
        "causation",
        "sufficient",
        "cause",
        "preceding",
        "state",
        "turn",
        "present",
        "state",
        "sufficient",
        "cause",
        "succeeding",
        "state",
        "despite",
        "emphasis",
        "inherent",
        "activity",
        "substance",
        "leibniz",
        "like",
        "spinoza",
        "rejected",
        "possibility",
        "transeunt",
        "causation",
        "among",
        "substance",
        "monad",
        "windowless",
        "neither",
        "admit",
        "emit",
        "causal",
        "influence",
        "moreover",
        "thus",
        "windowless",
        "monad",
        "receive",
        "perception",
        "world",
        "external",
        "causation",
        "rather",
        "monad",
        "perception",
        "builtin",
        "creation",
        "preestablished",
        "harmony",
        "perception",
        "perfectly",
        "align",
        "universe",
        "infinite",
        "monadic",
        "state",
        "entail",
        "genuine",
        "transeunt",
        "causation",
        "monadic",
        "level",
        "kind",
        "pseudocausation",
        "result",
        "monad",
        "harmonized",
        "perception",
        "respective",
        "appetitions",
        "convey",
        "successive",
        "change",
        "leibniz",
        "causal",
        "relation",
        "thus",
        "reduce",
        "logical",
        "relation",
        "every",
        "change",
        "substance",
        "follows",
        "concept",
        "leibniz",
        "view",
        "every",
        "substance",
        "complete",
        "concept",
        "reinforces",
        "centrality",
        "reason",
        "epistemology",
        "seems",
        "undercut",
        "human",
        "even",
        "divine",
        "volition",
        "thereby",
        "slide",
        "toward",
        "spinozism",
        "every",
        "fact",
        "julius",
        "caesar",
        "indeed",
        "every",
        "fact",
        "universe",
        "rationally",
        "deducible",
        "roman",
        "dictator",
        "complete",
        "concept",
        "would",
        "seem",
        "one",
        "course",
        "universe",
        "possible",
        "however",
        "step",
        "leibniz",
        "willing",
        "take",
        "distinction",
        "contingent",
        "necessary",
        "truth",
        "argued",
        "leibniz",
        "fatalism",
        "would",
        "true",
        "human",
        "liberty",
        "would",
        "impossible",
        "leibniz",
        "sought",
        "avert",
        "result",
        "distinguishing",
        "hypothetical",
        "absolute",
        "necessity",
        "absolute",
        "necessity",
        "argued",
        "governed",
        "principle",
        "contradiction",
        "something",
        "absolutely",
        "necessary",
        "negation",
        "logically",
        "impossible",
        "hypothetical",
        "necessity",
        "hand",
        "describes",
        "state",
        "affair",
        "necessary",
        "ex",
        "hypothesithat",
        "case",
        "particular",
        "antecedent",
        "holdsbut",
        "logically",
        "necessary",
        "leibniz",
        "account",
        "fact",
        "caesar",
        "crossed",
        "rubicon",
        "hypothetically",
        "necessary",
        "follows",
        "necessarily",
        "existence",
        "individual",
        "substance",
        "caesar",
        "denial",
        "logically",
        "impossible",
        "according",
        "leibniz",
        "god",
        "creation",
        "conceived",
        "infinite",
        "array",
        "possible",
        "world",
        "myriad",
        "contingent",
        "fact",
        "world",
        "hypothetically",
        "necessary",
        "would",
        "necessary",
        "god",
        "instantiate",
        "world",
        "since",
        "present",
        "world",
        "one",
        "god",
        "chose",
        "instantiate",
        "contingent",
        "fact",
        "world",
        "certain",
        "however",
        "nonetheless",
        "contingent",
        "since",
        "negation",
        "implies",
        "absurdity",
        "logical",
        "impossibility",
        "preventing",
        "caesar",
        "deciding",
        "cross",
        "rubicon",
        "sense",
        "willand",
        "indeed",
        "human",
        "generallyis",
        "free",
        "leibniz",
        "argument",
        "hypothetical",
        "necessity",
        "obvious",
        "antecedent",
        "descartes",
        "doctrine",
        "created",
        "truth",
        "however",
        "unlike",
        "descartes",
        "leibniz",
        "limited",
        "doctrine",
        "scope",
        "contingent",
        "truth",
        "nonetheless",
        "hoped",
        "avoid",
        "spinozist",
        "necessitarianism",
        "whether",
        "succeeded",
        "matter",
        "debate",
        "literature",
        "inasmuch",
        "characterizes",
        "universe",
        "composed",
        "plurality",
        "individual",
        "existence",
        "none",
        "genuine",
        "causal",
        "efficacy",
        "leibniz",
        "position",
        "show",
        "considerable",
        "affinity",
        "hume",
        "empiricism",
        "however",
        "hume",
        "inferred",
        "importance",
        "experience",
        "leibniz",
        "instead",
        "took",
        "ontology",
        "preclude",
        "adventitious",
        "knowledge",
        "thus",
        "remained",
        "committed",
        "metaphysical",
        "ground",
        "doctrine",
        "innate",
        "idea",
        "rejection",
        "transeunt",
        "causation",
        "among",
        "substance",
        "leibniz",
        "rejected",
        "notion",
        "learn",
        "new",
        "thing",
        "world",
        "sense",
        "gaining",
        "new",
        "idea",
        "already",
        "exist",
        "soul",
        "leibniz",
        "account",
        "temporal",
        "coincidence",
        "certain",
        "phenomenon",
        "one",
        "learning",
        "phenomenon",
        "preestablished",
        "creation",
        "way",
        "monadic",
        "state",
        "leibniz",
        "admitted",
        "idiomatically",
        "acceptable",
        "speak",
        "acquiring",
        "knowledge",
        "via",
        "sens",
        "however",
        "regarded",
        "sensory",
        "report",
        "reducible",
        "explicable",
        "description",
        "logical",
        "relation",
        "leibniz",
        "theory",
        "knowledge",
        "thus",
        "relegates",
        "aristotelian",
        "idea",
        "human",
        "being",
        "blank",
        "slate",
        "learn",
        "induction",
        "mere",
        "façon",
        "de",
        "parler",
        "contrast",
        "strongly",
        "endorsed",
        "plato",
        "doctrine",
        "recollection",
        "extent",
        "locates",
        "knowledge",
        "idea",
        "already",
        "residing",
        "soul",
        "socrates",
        "exchange",
        "meno",
        "slave",
        "boy",
        "argued",
        "leibniz",
        "show",
        "soul",
        "already",
        "posse",
        "idea",
        "upon",
        "truth",
        "universe",
        "depend",
        "need",
        "reminded",
        "leibniz",
        "account",
        "substance",
        "built",
        "perception",
        "whole",
        "universe",
        "every",
        "substance",
        "argued",
        "mirror",
        "whole",
        "universe",
        "extent",
        "everything",
        "ever",
        "happened",
        "existed",
        "ever",
        "happen",
        "exist",
        "included",
        "complete",
        "concept",
        "perception",
        "substance",
        "maintained",
        "thus",
        "resemble",
        "god",
        "infinite",
        "perception",
        "unlimited",
        "scope",
        "respect",
        "clarity",
        "distinctness",
        "perception",
        "created",
        "substance",
        "fall",
        "short",
        "god",
        "leibniz",
        "best",
        "possible",
        "world",
        "world",
        "balance",
        "maximal",
        "possible",
        "complexity",
        "maximal",
        "possible",
        "order",
        "existing",
        "world",
        "satisfies",
        "infinite",
        "variety",
        "perspective",
        "taken",
        "monad",
        "principle",
        "order",
        "monad",
        "reflects",
        "world",
        "monad",
        "however",
        "principle",
        "complexity",
        "monad",
        "reflect",
        "world",
        "infinite",
        "number",
        "unique",
        "perspective",
        "infinite",
        "variety",
        "perspective",
        "entail",
        "monad",
        "reflects",
        "others",
        "varying",
        "degree",
        "clarity",
        "distinctness",
        "way",
        "universe",
        "replete",
        "infinite",
        "number",
        "different",
        "representation",
        "god",
        "work",
        "among",
        "god",
        "perception",
        "universally",
        "clear",
        "distinct",
        "complexity",
        "requirement",
        "best",
        "possible",
        "world",
        "would",
        "seem",
        "preclude",
        "principle",
        "possibility",
        "human",
        "being",
        "achieving",
        "knowledge",
        "universe",
        "sub",
        "specie",
        "aeternitatis",
        "leibniz",
        "made",
        "special",
        "exception",
        "human",
        "soul",
        "leibniz",
        "account",
        "monad",
        "lowlevel",
        "perception",
        "kind",
        "experience",
        "stupor",
        "however",
        "soul",
        "living",
        "thing",
        "feeling",
        "memory",
        "human",
        "soul",
        "besides",
        "divine",
        "election",
        "power",
        "reason",
        "reason",
        "allows",
        "u",
        "understand",
        "universe",
        "system",
        "use",
        "model",
        "idealization",
        "thereby",
        "grasp",
        "eternal",
        "truth",
        "way",
        "argued",
        "leibniz",
        "human",
        "mind",
        "mirror",
        "universe",
        "created",
        "thing",
        "indeed",
        "mirror",
        "god",
        "leibniz",
        "committed",
        "view",
        "given",
        "god",
        "perfection",
        "anything",
        "god",
        "creates",
        "must",
        "also",
        "perfectthis",
        "created",
        "world",
        "best",
        "possible",
        "world",
        "mean",
        "large",
        "part",
        "writing",
        "theodicean",
        "spirit",
        "leibniz",
        "share",
        "spirit",
        "close",
        "contemporary",
        "anne",
        "conway",
        "conway",
        "system",
        "motivated",
        "desire",
        "reject",
        "cartesian",
        "dualism",
        "spinozism",
        "hobbesian",
        "materialism",
        "view",
        "commitment",
        "existence",
        "material",
        "substance",
        "commitment",
        "existence",
        "dead",
        "mass",
        "view",
        "gravely",
        "mistaken",
        "hold",
        "nature",
        "shot",
        "vital",
        "principle",
        "motion",
        "life",
        "perception",
        "quality",
        "befitting",
        "creation",
        "god",
        "chapter",
        "ix",
        "section",
        "conway",
        "thus",
        "reject",
        "descartes",
        "dualism",
        "nevertheless",
        "noting",
        "accepts",
        "immateriality",
        "god",
        "least",
        "better",
        "hobbes",
        "hold",
        "god",
        "material",
        "finally",
        "register",
        "disagreement",
        "spinoza",
        "monism",
        "effaces",
        "distinction",
        "god",
        "creature",
        "chapter",
        "ix",
        "section",
        "avoid",
        "problem",
        "identifies",
        "descartes",
        "hobbes",
        "conway",
        "asserts",
        "monism",
        "creature",
        "composed",
        "one",
        "kind",
        "substancespiritual",
        "avoid",
        "problem",
        "associate",
        "spinoza",
        "conway",
        "asserts",
        "one",
        "spiritual",
        "substance",
        "exists",
        "universe",
        "divided",
        "three",
        "specie",
        "differ",
        "essence",
        "creature",
        "christ",
        "god",
        "tripartite",
        "separation",
        "grounded",
        "basis",
        "changeability",
        "member",
        "specie",
        "essential",
        "feature",
        "creature",
        "change",
        "better",
        "worse",
        "essential",
        "feature",
        "christ",
        "change",
        "better",
        "god",
        "essence",
        "unchanging",
        "chapter",
        "vi",
        "section",
        "postulating",
        "three",
        "specie",
        "one",
        "substance",
        "conway",
        "able",
        "assert",
        "god",
        "separation",
        "creation",
        "well",
        "metaphysically",
        "morally",
        "mediating",
        "role",
        "christ",
        "mediating",
        "role",
        "christ",
        "central",
        "importance",
        "conway",
        "theodicy",
        "view",
        "accepting",
        "tripartite",
        "division",
        "specie",
        "contribute",
        "greatly",
        "propagation",
        "true",
        "faith",
        "christian",
        "religion",
        "among",
        "jew",
        "turk",
        "infidel",
        "nation",
        "chapter",
        "vi",
        "section",
        "appreciate",
        "reasoning",
        "favor",
        "mediator",
        "creature",
        "god",
        "accept",
        "reasoning",
        "believe",
        "christ",
        "whether",
        "call",
        "mediator",
        "name",
        "way",
        "conway",
        "answer",
        "particularly",
        "difficult",
        "challenge",
        "christian",
        "thinker",
        "christianity",
        "universal",
        "religion",
        "salvation",
        "depends",
        "knowing",
        "christ",
        "much",
        "earth",
        "population",
        "ignorant",
        "christ",
        "system",
        "assert",
        "many",
        "people",
        "may",
        "know",
        "christ",
        "mediator",
        "without",
        "knowing",
        "name",
        "even",
        "role",
        "christian",
        "religion",
        "rise",
        "british",
        "empiricism",
        "kant",
        "critical",
        "philosophy",
        "marked",
        "end",
        "continental",
        "rationalism",
        "movement",
        "elegant",
        "vision",
        "leibniz",
        "conway",
        "fitting",
        "paean",
        "movement",
        "indeed",
        "power",
        "human",
        "reason"
    ]
}