{
    "main_text": "Fundamental Elements of Contractarianism\n1. Fundamental Elements of Contractarianism\n\nThe social contract has two fundamental elements: a characterization\nof the initial situation, called variously the “state of\nnature” by the modern political philosophers, the\n“original position” by Rawls (1971, 17–22,\n118–193), or the “initial bargaining position” by\nGauthier (1986, 14–16, 131–134, passim), and a\ncharacterization of the parties to the contract, particularly in terms\nof their rationality and motivation to come to agreement. The initial\nsituation posits what in bargaining theory is called the “no\nagreement position,” the situation to which the individuals\nreturn in case of failure to make an agreement or contract. This\nsituation may be more or less hostile, and more or less social,\ndepending on how the theorist characterizes human life in the absence\nof rules of morality or justice. But crucial to all contractarian\ntheories, there is some scarcity or motivation for competition in the\ninitial situation and there is some potential for gains from social\ninteraction and cooperation. \n\nIn contemporary normative contractarian theories, that is, theories\nthat attempt to ground the legitimacy of government or theories that\nclaim to derive a moral ought, the initial position represents the\nstarting point for a fair, impartial agreement. While contractualists\njustify the requirement of a fair, impartial agreement by reasons\nexternal to the contract, contractarians hold that the success of the\ncontract in securing cooperative interaction itself requires that the\nstarting point and procedures be fair and impartial.\n\nSome of the more recent literature focuses on how contractarian\ntheories can ensure the fairness and impartiality of the initial\nbargaining situation without appealing to any external, independent\nmoral norms as the contractualist does. For the contractarian, all\nmoral norms are supposed to be the result of agreement by rational\nagents, but if the contractarian has to appeal to prior moral norms in\norder to secure agreement then it’s not clear what sort of work the\nagreement is actually doing in establishing the content of the moral\nnorms. At the same time, if there are no constraints at all over the\ninitial situation then the outcome agreed to may fail to be a moral\noutcome, and may instead be an outcome according to the principle, as\nRawls puts it, “to each according to his threat\nadvantage” (1971, 141). Two potential strategies are to argue that\nassumptions designed to ensure the fairness and impartiality of the\ninitial situation, such as the assumption that the contractors are\nsymmetrically situated, either follow as a condition of rationality or\nare justified on strategic grounds. The idea that certain assumptions\nlike symmetry follow as implications from the exercise of rationality\nhas attracted recent criticism on grounds that such assumptions\nrepresent substantive constraints theoretically inaccessible to\ncontractarians (Thrasher 2014). Others have attempted to defend the\npresence of such assumptions in contractarian theory (Thoma\n2015).\n\nSome points of controversy among contractarians concern the role of\nthe initial situation in the theory: is it to be considered an actual\nhistorical situation, a possible historical moment, or is the contract\nsituation completely hypothetical? David Hume (1987/1777, 470–1)\nwas the first to raise the decisive objection to any normative moral\nor political theory based on a historical contract: the consent of\none’s ancestors do not bind oneself. Contemporary political\nphilosophers have raised similar concerns about a hypothetical\ncontract: insofar as the agreement is hypothetical then it\ncannot be said to represent agreement at all (Dworkin 1975). In\nresponse to these sorts of objections, some contractarians defend the\nhypothetical contract on heuristic grounds by insisting that the point\nof the contract device is not to directly bind the contractors but\nrather to provide a kind of thought experiment by which to discover\nthe requirements of practical rationality (Gauthier 1986, ch. VII).\nThat is, they argue that if one is rational, and among rational others\nin circumstances in which agreement is both possible and beneficial,\nthen rationality requires that one abide by the terms of the contract.\nWhile mainstream contractarian theories are hypothetical contract\ntheories, an interesting and powerfully subversive use of\ncontractarianism (Mills 1997; Pateman 1989; Pateman & Mills\n2007—see section on Subversion of Contractarianism below) reads\nthe contract situation as historical agreements to erect and maintain\nwhite supremacy and patriarchy or male dominance. These latter\ncontractarian theories are not justifications of the status quo, of\ncourse, but rather explanations and condemnations, and therefore do\nnot face Hume’s objection. Other questions that divide contemporary\ncontractarians include: What are the ideal conditions and who are the\nideal contractors that will make obligatory the outcomes of the\ncontract for actual persons? What is the content of the hypothetical\nagreement?\n\nThe second element of a contractarian theory characterizes the\npotential contractors. There are two subparts to this: first,\ncontractors have minimal other-directed desires or preferences, and\nsecond, contractors have a capacity for rational interaction with\nothers. Contractarian (as opposed to contractualist) theories embrace\na high standard for motivating making (and keeping) agreements. They\navoid assuming that persons have preferences for moral behavior as\nsuch in order to ground rules of morality or justice in rational\nself-interest. Since persons’ interests do not necessarily include the\nwell-being of others, the main challenge for contractarianism is to\nshow that even without such other-directed preferences, it would be\nrational to be moral. Such self-directed preferences are called\n“non-tuistic” (Gauthier 1986, 87). However, there are\nreasons to think that narrowing the preferences of contractors to\ninclude only non-tuistic preferences is neither necessary nor helpful\nin grounding morality. One reason is because such a restriction of\npreferences means that actual persons will not be willing to comply\nwith the bargain that is made, under the assumption that they do not\nhave such narrowly construed preferences (Hubin 1991). On the other\nhand, allowing positive tuistic preferences to play a role in\nbargaining on morality and justice may create the possibility for\nindividuals to be exploited for their fellow feelings (Dimock 1999).\nThis is especially a problem for women, as Dimock points out, since in\nmost cultures women are trained from childhood by sexist norms and\ngender roles to prefer the well-being of others to their own. Negative\ntuistic preferences pose a different challenge as a type of moral\nskepticism for either theorists who would exclude them or those who\nwould include them in a contractarian theory (Superson 2009). The\nformer group include Rawls and Gauthier, who have argued that negative\ntuistic preferences (envy, jealousy, spite, vengeance) make\ncooperation for mutual advantage impossible and therefore are\nirrational (Rawls 1971, 142–150, 530–534; Gauthier 1986,\n311, 329). But this response significantly narrows the scope of\napplication of the theory, since such emotions are common. The latter\ngroup faces the challenge of showing how mutual advantage overcomes\nthese negative, other-directed emotions.\n\nSecond, persons are presumed to be instrumentally rational and so\ncapable of understanding how the satisfaction of their desires can be\nhelped by cooperative social interaction. Contractarians characterize\npractical rationality instrumentally, subjectively, and\npreferentially. Acting rationally entails maximizing satisfaction of\none’s own subjective preferences. Contractarians rely on the crucial\nfact about humans that we are able to cooperate to produce more than\neach working alone, thus making it rational to cooperate under at\nleast some terms. Self-interest and rationality imply a desire to\ncooperate provided that cooperators can do so without sacrificing\ntheir self-interest. The desire to benefit from cooperation in turn\nmakes persons rationally concerned about their reputations for\nadhering to the moral norms that make cooperation possible and\nrational. (See\n feminist perspectives on the self\n (Section 1, Critique) for a critique of this conception of the\nrational person.)\n\nContractarians seek to show that without rules of justice for\ncooperation, persons are worse off by their own lights. Hence it is\nrational to adopt some rules for morality and justice. These two\naspects of the contractarian individual—self-interest and the\nability to benefit from interaction with others—along with the\nconditions of moderate scarcity imply what Rawls following Hume called\nthe “circumstances of justice”: the conditions under which\nrules for justice could be both possible and necessary (1971,\n109–112). Justice, and a social contract, is only possible where\nthere is some possibility of benefit to each individual from\ncooperation.\n\nContractarian social contract theories take individuals to be the best\njudges of their interests and the means to satisfy their desires. For\nthis reason, there is a close connection between liberalism and\ncontractarianism. However, that is not to say that all contractarian\nthought is liberal. Hobbes, for example, argued in favor of what Jean\nHampton has called the “alienation contract” (1986, 3,\n103, 256–265), that is, a contract on the part of a people to\nalienate their rights to adjudicate their own disputes and\nself-defense to a sovereign, on the grounds that that was the only way\nto keep the peace given the nature of the alternative, which he\nfamously characterized as life that would be “solitary, poore,\nnasty, brutish, and short.” Thus, given a bad enough initial\nsituation, contractarianism may lead to the legitimation of\ntotalitarianism. Another point of criticism that arises from the\ncharacterization of the parties to the contract is that they must be\nable to contribute to the social product of interaction, or at least\nto threaten to destabilize it. This is because each individual has to\nbe able to benefit from the inclusion of all those included. But this\nthreatens to leave many, such as the severely disabled, the global\npoor, and animals outside the realm of justice, an implication that\nsome find completely unacceptable (Kittay 1999; Nussbaum 2006).\n\nSocial contract theories also require some rules to guide the\nformation of agreement. Since they are prior to the contract, there\nmust be some source of prior moral norms, whether natural, rational,\nor conventional. The first rule that is normally prescribed is that\nthere must be no force or fraud in the making of the agreement. No one\nis to be “coerced” into agreement by the threat of\nphysical violence. The reasoning for this is quite straightforwardly\nprudential: if one is allowed to use violence, then there is no real\ndifference between the “contract” arrived at and the state\nof nature for the threatened party, and hence no security in the\nagreement. However, there is a fine line between being coerced by the\nthreat of violence into giving up one’s rights and being convinced by\nthe threat of penury to make an unfavorable agreement. For this reason\ncontractarians like Gauthier are able to argue for a fair and\nimpartial starting point for bargaining that will lead to secure and\nstable agreements. The second rule of contract is that each individual\nwho is a legitimate party to the contract must agree to the rules of\njustice, which are the outcomes of the contract.\n",
    "section_title": "1. Fundamental Elements of Contractarianism",
    "entry_title": "Contractarianism",
    "hierarchy_title": "Contractarianism || Fundamental Elements of Contractarianism",
    "tokenized_text": [
        "fundamental",
        "element",
        "contractarianism",
        "fundamental",
        "element",
        "contractarianism",
        "social",
        "contract",
        "two",
        "fundamental",
        "element",
        "characterization",
        "initial",
        "situation",
        "called",
        "variously",
        "state",
        "nature",
        "modern",
        "political",
        "philosopher",
        "original",
        "position",
        "rawls",
        "initial",
        "bargaining",
        "position",
        "gauthier",
        "passim",
        "characterization",
        "party",
        "contract",
        "particularly",
        "term",
        "rationality",
        "motivation",
        "come",
        "agreement",
        "initial",
        "situation",
        "posit",
        "bargaining",
        "theory",
        "called",
        "agreement",
        "position",
        "situation",
        "individual",
        "return",
        "case",
        "failure",
        "make",
        "agreement",
        "contract",
        "situation",
        "may",
        "le",
        "hostile",
        "le",
        "social",
        "depending",
        "theorist",
        "characterizes",
        "human",
        "life",
        "absence",
        "rule",
        "morality",
        "justice",
        "crucial",
        "contractarian",
        "theory",
        "scarcity",
        "motivation",
        "competition",
        "initial",
        "situation",
        "potential",
        "gain",
        "social",
        "interaction",
        "cooperation",
        "contemporary",
        "normative",
        "contractarian",
        "theory",
        "theory",
        "attempt",
        "ground",
        "legitimacy",
        "government",
        "theory",
        "claim",
        "derive",
        "moral",
        "ought",
        "initial",
        "position",
        "represents",
        "starting",
        "point",
        "fair",
        "impartial",
        "agreement",
        "contractualists",
        "justify",
        "requirement",
        "fair",
        "impartial",
        "agreement",
        "reason",
        "external",
        "contract",
        "contractarians",
        "hold",
        "success",
        "contract",
        "securing",
        "cooperative",
        "interaction",
        "requires",
        "starting",
        "point",
        "procedure",
        "fair",
        "impartial",
        "recent",
        "literature",
        "focus",
        "contractarian",
        "theory",
        "ensure",
        "fairness",
        "impartiality",
        "initial",
        "bargaining",
        "situation",
        "without",
        "appealing",
        "external",
        "independent",
        "moral",
        "norm",
        "contractualist",
        "contractarian",
        "moral",
        "norm",
        "supposed",
        "result",
        "agreement",
        "rational",
        "agent",
        "contractarian",
        "appeal",
        "prior",
        "moral",
        "norm",
        "order",
        "secure",
        "agreement",
        "clear",
        "sort",
        "work",
        "agreement",
        "actually",
        "establishing",
        "content",
        "moral",
        "norm",
        "time",
        "constraint",
        "initial",
        "situation",
        "outcome",
        "agreed",
        "may",
        "fail",
        "moral",
        "outcome",
        "may",
        "instead",
        "outcome",
        "according",
        "principle",
        "rawls",
        "put",
        "according",
        "threat",
        "advantage",
        "two",
        "potential",
        "strategy",
        "argue",
        "assumption",
        "designed",
        "ensure",
        "fairness",
        "impartiality",
        "initial",
        "situation",
        "assumption",
        "contractor",
        "symmetrically",
        "situated",
        "either",
        "follow",
        "condition",
        "rationality",
        "justified",
        "strategic",
        "ground",
        "idea",
        "certain",
        "assumption",
        "like",
        "symmetry",
        "follow",
        "implication",
        "exercise",
        "rationality",
        "attracted",
        "recent",
        "criticism",
        "ground",
        "assumption",
        "represent",
        "substantive",
        "constraint",
        "theoretically",
        "inaccessible",
        "contractarians",
        "thrasher",
        "others",
        "attempted",
        "defend",
        "presence",
        "assumption",
        "contractarian",
        "theory",
        "thoma",
        "point",
        "controversy",
        "among",
        "contractarians",
        "concern",
        "role",
        "initial",
        "situation",
        "theory",
        "considered",
        "actual",
        "historical",
        "situation",
        "possible",
        "historical",
        "moment",
        "contract",
        "situation",
        "completely",
        "hypothetical",
        "david",
        "hume",
        "first",
        "raise",
        "decisive",
        "objection",
        "normative",
        "moral",
        "political",
        "theory",
        "based",
        "historical",
        "contract",
        "consent",
        "one",
        "ancestor",
        "bind",
        "oneself",
        "contemporary",
        "political",
        "philosopher",
        "raised",
        "similar",
        "concern",
        "hypothetical",
        "contract",
        "insofar",
        "agreement",
        "hypothetical",
        "said",
        "represent",
        "agreement",
        "dworkin",
        "response",
        "sort",
        "objection",
        "contractarians",
        "defend",
        "hypothetical",
        "contract",
        "heuristic",
        "ground",
        "insisting",
        "point",
        "contract",
        "device",
        "directly",
        "bind",
        "contractor",
        "rather",
        "provide",
        "kind",
        "thought",
        "experiment",
        "discover",
        "requirement",
        "practical",
        "rationality",
        "gauthier",
        "ch",
        "vii",
        "argue",
        "one",
        "rational",
        "among",
        "rational",
        "others",
        "circumstance",
        "agreement",
        "possible",
        "beneficial",
        "rationality",
        "requires",
        "one",
        "abide",
        "term",
        "contract",
        "mainstream",
        "contractarian",
        "theory",
        "hypothetical",
        "contract",
        "theory",
        "interesting",
        "powerfully",
        "subversive",
        "use",
        "contractarianism",
        "mill",
        "pateman",
        "pateman",
        "mill",
        "see",
        "section",
        "subversion",
        "contractarianism",
        "read",
        "contract",
        "situation",
        "historical",
        "agreement",
        "erect",
        "maintain",
        "white",
        "supremacy",
        "patriarchy",
        "male",
        "dominance",
        "latter",
        "contractarian",
        "theory",
        "justification",
        "status",
        "quo",
        "course",
        "rather",
        "explanation",
        "condemnation",
        "therefore",
        "face",
        "hume",
        "objection",
        "question",
        "divide",
        "contemporary",
        "contractarians",
        "include",
        "ideal",
        "condition",
        "ideal",
        "contractor",
        "make",
        "obligatory",
        "outcome",
        "contract",
        "actual",
        "person",
        "content",
        "hypothetical",
        "agreement",
        "second",
        "element",
        "contractarian",
        "theory",
        "characterizes",
        "potential",
        "contractor",
        "two",
        "subpart",
        "first",
        "contractor",
        "minimal",
        "otherdirected",
        "desire",
        "preference",
        "second",
        "contractor",
        "capacity",
        "rational",
        "interaction",
        "others",
        "contractarian",
        "opposed",
        "contractualist",
        "theory",
        "embrace",
        "high",
        "standard",
        "motivating",
        "making",
        "keeping",
        "agreement",
        "avoid",
        "assuming",
        "person",
        "preference",
        "moral",
        "behavior",
        "order",
        "ground",
        "rule",
        "morality",
        "justice",
        "rational",
        "selfinterest",
        "since",
        "person",
        "interest",
        "necessarily",
        "include",
        "wellbeing",
        "others",
        "main",
        "challenge",
        "contractarianism",
        "show",
        "even",
        "without",
        "otherdirected",
        "preference",
        "would",
        "rational",
        "moral",
        "selfdirected",
        "preference",
        "called",
        "nontuistic",
        "gauthier",
        "however",
        "reason",
        "think",
        "narrowing",
        "preference",
        "contractor",
        "include",
        "nontuistic",
        "preference",
        "neither",
        "necessary",
        "helpful",
        "grounding",
        "morality",
        "one",
        "reason",
        "restriction",
        "preference",
        "mean",
        "actual",
        "person",
        "willing",
        "comply",
        "bargain",
        "made",
        "assumption",
        "narrowly",
        "construed",
        "preference",
        "hubin",
        "hand",
        "allowing",
        "positive",
        "tuistic",
        "preference",
        "play",
        "role",
        "bargaining",
        "morality",
        "justice",
        "may",
        "create",
        "possibility",
        "individual",
        "exploited",
        "fellow",
        "feeling",
        "dimock",
        "especially",
        "problem",
        "woman",
        "dimock",
        "point",
        "since",
        "culture",
        "woman",
        "trained",
        "childhood",
        "sexist",
        "norm",
        "gender",
        "role",
        "prefer",
        "wellbeing",
        "others",
        "negative",
        "tuistic",
        "preference",
        "pose",
        "different",
        "challenge",
        "type",
        "moral",
        "skepticism",
        "either",
        "theorist",
        "would",
        "exclude",
        "would",
        "include",
        "contractarian",
        "theory",
        "superson",
        "former",
        "group",
        "include",
        "rawls",
        "gauthier",
        "argued",
        "negative",
        "tuistic",
        "preference",
        "envy",
        "jealousy",
        "spite",
        "vengeance",
        "make",
        "cooperation",
        "mutual",
        "advantage",
        "impossible",
        "therefore",
        "irrational",
        "rawls",
        "gauthier",
        "response",
        "significantly",
        "narrow",
        "scope",
        "application",
        "theory",
        "since",
        "emotion",
        "common",
        "latter",
        "group",
        "face",
        "challenge",
        "showing",
        "mutual",
        "advantage",
        "overcomes",
        "negative",
        "otherdirected",
        "emotion",
        "second",
        "person",
        "presumed",
        "instrumentally",
        "rational",
        "capable",
        "understanding",
        "satisfaction",
        "desire",
        "helped",
        "cooperative",
        "social",
        "interaction",
        "contractarians",
        "characterize",
        "practical",
        "rationality",
        "instrumentally",
        "subjectively",
        "preferentially",
        "acting",
        "rationally",
        "entail",
        "maximizing",
        "satisfaction",
        "one",
        "subjective",
        "preference",
        "contractarians",
        "rely",
        "crucial",
        "fact",
        "human",
        "able",
        "cooperate",
        "produce",
        "working",
        "alone",
        "thus",
        "making",
        "rational",
        "cooperate",
        "least",
        "term",
        "selfinterest",
        "rationality",
        "imply",
        "desire",
        "cooperate",
        "provided",
        "cooperator",
        "without",
        "sacrificing",
        "selfinterest",
        "desire",
        "benefit",
        "cooperation",
        "turn",
        "make",
        "person",
        "rationally",
        "concerned",
        "reputation",
        "adhering",
        "moral",
        "norm",
        "make",
        "cooperation",
        "possible",
        "rational",
        "see",
        "feminist",
        "perspective",
        "self",
        "section",
        "critique",
        "critique",
        "conception",
        "rational",
        "person",
        "contractarians",
        "seek",
        "show",
        "without",
        "rule",
        "justice",
        "cooperation",
        "person",
        "worse",
        "light",
        "hence",
        "rational",
        "adopt",
        "rule",
        "morality",
        "justice",
        "two",
        "aspect",
        "contractarian",
        "individualselfinterest",
        "ability",
        "benefit",
        "interaction",
        "othersalong",
        "condition",
        "moderate",
        "scarcity",
        "imply",
        "rawls",
        "following",
        "hume",
        "called",
        "circumstance",
        "justice",
        "condition",
        "rule",
        "justice",
        "could",
        "possible",
        "necessary",
        "justice",
        "social",
        "contract",
        "possible",
        "possibility",
        "benefit",
        "individual",
        "cooperation",
        "contractarian",
        "social",
        "contract",
        "theory",
        "take",
        "individual",
        "best",
        "judge",
        "interest",
        "mean",
        "satisfy",
        "desire",
        "reason",
        "close",
        "connection",
        "liberalism",
        "contractarianism",
        "however",
        "say",
        "contractarian",
        "thought",
        "liberal",
        "hobbes",
        "example",
        "argued",
        "favor",
        "jean",
        "hampton",
        "called",
        "alienation",
        "contract",
        "contract",
        "part",
        "people",
        "alienate",
        "right",
        "adjudicate",
        "dispute",
        "selfdefense",
        "sovereign",
        "ground",
        "way",
        "keep",
        "peace",
        "given",
        "nature",
        "alternative",
        "famously",
        "characterized",
        "life",
        "would",
        "solitary",
        "poore",
        "nasty",
        "brutish",
        "short",
        "thus",
        "given",
        "bad",
        "enough",
        "initial",
        "situation",
        "contractarianism",
        "may",
        "lead",
        "legitimation",
        "totalitarianism",
        "another",
        "point",
        "criticism",
        "arises",
        "characterization",
        "party",
        "contract",
        "must",
        "able",
        "contribute",
        "social",
        "product",
        "interaction",
        "least",
        "threaten",
        "destabilize",
        "individual",
        "able",
        "benefit",
        "inclusion",
        "included",
        "threatens",
        "leave",
        "many",
        "severely",
        "disabled",
        "global",
        "poor",
        "animal",
        "outside",
        "realm",
        "justice",
        "implication",
        "find",
        "completely",
        "unacceptable",
        "kittay",
        "nussbaum",
        "social",
        "contract",
        "theory",
        "also",
        "require",
        "rule",
        "guide",
        "formation",
        "agreement",
        "since",
        "prior",
        "contract",
        "must",
        "source",
        "prior",
        "moral",
        "norm",
        "whether",
        "natural",
        "rational",
        "conventional",
        "first",
        "rule",
        "normally",
        "prescribed",
        "must",
        "force",
        "fraud",
        "making",
        "agreement",
        "one",
        "coerced",
        "agreement",
        "threat",
        "physical",
        "violence",
        "reasoning",
        "quite",
        "straightforwardly",
        "prudential",
        "one",
        "allowed",
        "use",
        "violence",
        "real",
        "difference",
        "contract",
        "arrived",
        "state",
        "nature",
        "threatened",
        "party",
        "hence",
        "security",
        "agreement",
        "however",
        "fine",
        "line",
        "coerced",
        "threat",
        "violence",
        "giving",
        "one",
        "right",
        "convinced",
        "threat",
        "penury",
        "make",
        "unfavorable",
        "agreement",
        "reason",
        "contractarians",
        "like",
        "gauthier",
        "able",
        "argue",
        "fair",
        "impartial",
        "starting",
        "point",
        "bargaining",
        "lead",
        "secure",
        "stable",
        "agreement",
        "second",
        "rule",
        "contract",
        "individual",
        "legitimate",
        "party",
        "contract",
        "must",
        "agree",
        "rule",
        "justice",
        "outcome",
        "contract"
    ]
}