{
    "main_text": "Conventions of language || Conventional theories of meaning\n7.2 Objections to conventional theories\n\n\nConventional theories of linguistic meaning attract several different\ntypes of criticism. We may distinguish four especially important\ncriticisms: denial that the putative conventions prevail in actual\npractice; denial that convention can determine linguistic meaning;\ndenial that convention is necessary for linguistic meaning; and denial\nthat convention-based accounts employ the proper order of\nexplanation.\n7.2.1 Do the putative conventions prevail?\n\n\nThis criticism surfaces repeatedly throughout the literature. For\ninstance, Grice’s analysis of speaker-meaning generated a\nmini-industry of counter-example and revised analysis. The gist of the\ncounter-examples is that there are many perfectly normal linguistic\ninteractions in which speakers lack the communicative intentions and\nexpectations cited by Grice. Thus, it is difficult to see how our\npractice could instantiate a convention that crucially involves those\nintentions and expectations. One might respond to this argument in\nvarious ways, such as classifying certain linguistic interactions as\n“paradigmatic” and others as “derivative.” But\nat least one prominent Gricean, Stephen Schiffer (1987), eventually\nconcluded, partly from such counter-examples, that the program of\nexplicating linguistic meaning through Lewisian convention and Gricean\nspeaker-meaning was hopeless.\n\n\nRegarding Lewis’s account, critics such as Wayne Davis (2003),\nMax Kölbel (1998), Stephen Laurence (1996), and Bernard Williams\n(2002) question whether there is a convention of truthfulness and\ntrust. As Davis and Williams urge, it is hardly obvious that speakers\ngenerally speak the truth or generally trust one another, despite\nfrequent claims by diverse philosophers to the contrary. Even if we\ngrant that people generally speak the truth and generally trust one\nanother, does this give me reason to speak truthfully? It does, if\nI want other people to believe the truth. But if I want them to\nbelieve falsehoods, then I have reason to lie rather than speak the\ntruth. Thus, one might object, a regularity of truthfulness and trust\nis not self-perpetuating in the way that Lewisian convention requires.\nExpectation of conformity does not provide reason for conformity. In\ncontrast, consider the convention of driving on the right. That\nconvention likewise provides reason for conformity only given an\nappropriate desire: namely, desire to avoid a collision. The difference\nis that virtually everyone seeks to avoid a collision, while deception\nis a normal feature of ordinary linguistic interaction.\n\n\nInevitably, such objections focus on details of particular theories.\nThus, they cannot show that conventionalist theories in\ngeneral are mistaken.\n7.2.2 Can convention determine linguistic meaning?\n\n\nThe most serious version of this objection, advanced by Stephen\nSchiffer (1993, 2006), John Hawthorne (1990, 1993), and many other\nphilosophers, focuses on the productivity of language. We can\nunderstand a potential infinity of meaningful sentences. Yet we can\nhardly master infinitely many linguistic conventions, one for each\nmeaningful sentence. How, then, can convention fix the meanings of\nthese infinitely many sentences?\n\n\nThis general worry arises in a particularly acute way for Lewis’s\ntheory. Consider some sentence \\(S\\) that we would never normally\nuse, perhaps because it is too long or too grammatically\ncomplex. Suppose that some speaker nevertheless utters \\(S\\). As\nLewis acknowledges, we would not normally believe that the speaker was\nthereby attempting to speak truthfully. Instead, we would suspect that\nthe speaker was acting for some deviant reason, such as trying to\nannoy, or settling a bet, and so on. We would not normally trust the\nspeaker. But then Lewis cannot use his convention of truthfulness and\ntrust to underwrite a unique truth-condition for \\(S\\).\n\n\nThe most natural diagnosis here is that the sentence’s meaning is\ndetermined by the meanings of its parts. We understand it because we\nunderstand its component words and because we understand the\ncompositional mechanisms through which words combine to form meaningful\nsentences. Of course, word meanings may themselves be fixed by\nconvention. But then what the conventionalist should explicate is the\nconventional link between words and their meanings, not just the\nconventional link between sentences and their truth-conditions. Lewis\nexplicates the latter, not the former. Although Lewis (1992) attempts\nto circumvent these worries, Hawthorne (1993) and Schiffer (2006) argue\nthat his response is inadequate.\n\n\nLewis’s account is not alone in encountering difficulties with\nproductivity. Most contemporary conventionalist theories encounter\nsimilar difficulties, because most such theories, heeding Frege’s\ncontext principle (only the context of a sentence do words have\nmeaning), focus attention upon the link between sentences and\npropositions rather than the link between words and their meanings.\nOne might hope to supplement convention-based accounts with the\nChomsky-inspired thesis, advocated by James Higginbotham (1986) and\nRichard Larson and Gabriel Segal (1995), that speakers have tacit\nknowledge of a compositional semantic theory. However, as Martin\nDavies observes (2003), no one seems to have worked out this\nsupplementary strategy in any detail, and it is not obvious how\nimportant a role the resulting account would assign to convention, let\nalone the Gricean communicative mechanism.\n\n\nUltimately, the force of these worries remains unclear. For instance,\nWayne Davis (2003) develops a conventionalist account that harkens back\nto the pre-Fregean tradition. In simplified form, Davis’s Lockean\nproposal is that a word is meaningful because we conventionally use it\nto express a certain “idea”. The meaning of a sentence is then determined by the meanings of its component words, along with the (conventionally determined) semantic import of the syntactic structure in which those words are arranged. Evidently, these issues\nconnect with vexed questions about compositionality, linguistic\nunderstanding, the unity of the proposition, and the role played by\nformal semantic theories in the study of natural language.\n7.2.3 Is convention necessary for linguistic meaning?\n\n\nNoam Chomsky (1980) and Donald Davidson (1984) acknowledge that there\nare linguistic conventions while denying that they are fundamental to\nthe nature of language.\n\n\nChomsky regards language as a system of grammatical rules\n“tacitly known” by a speaker. Linguistics, which Chomsky\ntreats as a branch of cognitive psychology, studies the grammatical\ncompetence of individual speakers. It should not posit a mysterious and\nunscientific “communal language” shared by speakers, but\nshould instead focus upon “idiolects.” Thus, language has\nno special ties to social interaction or communication. Specifically,\nit has no special ties to convention. Stephen Laurence (1996) and\nStephen Schiffer (2006) develop theories of the “actual\nlanguage” relation informed by a broadly Chomskian perspective.\nThe basic idea behind both accounts is that a linguistic item as used\nby some speaker is associated with certain semantic properties just in\ncase the association between the linguistic item and the semantic\nproperty figures in the psychological processes through which the\nspeaker assigns meanings (or truth-conditions) to sentences.\n\n\nDavidson elaborates a model of communication that takes as its paradigm\n“radical interpretation.” During radical interpretation,\none tries to assign truth-conditions to utterances in a completely\nunfamiliar tongue. To do so, one detects patterns concerning which\nsentences the speaker “holds true,” and one tries to make\nrational sense of those patterns, guided by general maxims such as the \nprinciple of charity (roughly, maximize true beliefs on the\npart of the speaker). Davidson admits that, in everyday life, we tend\nas a default to interpret one another “homophonically.” But\nthere is no principled reason why we must embrace this homophonic\ndefault, and we readily deviate from it whenever seems appropriate, as\nillustrated by cases of idiosyncratic usage, malapropism, and so on. In\na sense, then, all linguistic understanding rests upon radical\ninterpretation. So shared linguistic conventions are inessential to\nlinguistic communication:\n\n\nKnowledge of the conventions of language is thus a practical crutch to\ninterpretation, a crutch we cannot in practice afford to do\nwithout—but a crutch which, under optimum conditions for\ncommunication, we can in the end throw away, and could in theory have\ndone without from the start. (1984, p. 279)\n\n\nDavidson concludes that theories of meaning and understanding should\nnot assign convention a foundational role.\n7.2.4 Do convention-based accounts employ the proper order of\nexplanation?\n\n\n A\nfinal objection to convention-based theories targets the broader\nLockean strategy of explaining language in terms of thought. According\nto this objection, which is espoused by philosophers such as Robert\nBrandom (1994), Donald Davidson (1984), and Michael Dummett (1993),\nlanguage does not inherit content from thought. Rather, thought and\nlanguage are on a par, acquiring content through their mutual\ninterrelations. (One might also claim that language is the primary\nlocus of intentionality and that thought inherits content from\nlanguage. However, few if any contemporary philosophers espouse this\nviewpoint.) Thus, we should not analyze linguistic meaning as the\nproduct of convention, so long as conventions are understood as\nLewisian systems of intentions, preferences, and expectations. Those\npropositional attitudes are themselves intelligible only through their\nrelations to language. As Davidson puts it, “philosophers who\nmake convention a necessary element in language have the matter\nbackwards. The truth is rather that language is a condition for having\nconventions” (1984, p. 280).\n\n\nTwo main difficulties face this approach. First, although philosophers\nhave offered various arguments for the thesis that thought is not\nexplanatorily prior to language, none of the arguments commands\nwidespread assent. Christopher Peacocke (1998) forcefully criticizes\nmany of the most well-known arguments. As things stand, the objection\nconstitutes not so much a problem for conventional theories\nas a prospectus for a rival research program. The second and more\nserious difficulty is that, so far, the rival research program has not\nyielded results nearly as precise or systematic as existing\nconventional theories. Perhaps the two most commanding theories within\nthe rival research program are Davidson’s (1984) and Brandom’s\n(1994). Many contemporary philosophers feel that both theories\nenshrine an overly “anti-realist” conception of mental\ncontent. Moreover, neither theory yields detailed necessary and\nsufficient conditions for linguistic meaning analogous to those\nprovided by Lewis.\n",
    "section_title": "7.2 Objections to conventional theories",
    "entry_title": "Convention",
    "hierarchy_title": "Convention || Conventions of language || Conventional theories of meaning",
    "tokenized_text": [
        "convention",
        "language",
        "conventional",
        "theory",
        "meaning",
        "objection",
        "conventional",
        "theory",
        "conventional",
        "theory",
        "linguistic",
        "meaning",
        "attract",
        "several",
        "different",
        "type",
        "criticism",
        "may",
        "distinguish",
        "four",
        "especially",
        "important",
        "criticism",
        "denial",
        "putative",
        "convention",
        "prevail",
        "actual",
        "practice",
        "denial",
        "convention",
        "determine",
        "linguistic",
        "meaning",
        "denial",
        "convention",
        "necessary",
        "linguistic",
        "meaning",
        "denial",
        "conventionbased",
        "account",
        "employ",
        "proper",
        "order",
        "explanation",
        "putative",
        "convention",
        "prevail",
        "criticism",
        "surface",
        "repeatedly",
        "throughout",
        "literature",
        "instance",
        "grice",
        "analysis",
        "speakermeaning",
        "generated",
        "miniindustry",
        "counterexample",
        "revised",
        "analysis",
        "gist",
        "counterexamples",
        "many",
        "perfectly",
        "normal",
        "linguistic",
        "interaction",
        "speaker",
        "lack",
        "communicative",
        "intention",
        "expectation",
        "cited",
        "grice",
        "thus",
        "difficult",
        "see",
        "practice",
        "could",
        "instantiate",
        "convention",
        "crucially",
        "involves",
        "intention",
        "expectation",
        "one",
        "might",
        "respond",
        "argument",
        "various",
        "way",
        "classifying",
        "certain",
        "linguistic",
        "interaction",
        "paradigmatic",
        "others",
        "derivative",
        "least",
        "one",
        "prominent",
        "gricean",
        "stephen",
        "schiffer",
        "eventually",
        "concluded",
        "partly",
        "counterexamples",
        "program",
        "explicating",
        "linguistic",
        "meaning",
        "lewisian",
        "convention",
        "gricean",
        "speakermeaning",
        "hopeless",
        "regarding",
        "lewis",
        "account",
        "critic",
        "wayne",
        "davis",
        "max",
        "kölbel",
        "stephen",
        "laurence",
        "bernard",
        "williams",
        "question",
        "whether",
        "convention",
        "truthfulness",
        "trust",
        "davis",
        "williams",
        "urge",
        "hardly",
        "obvious",
        "speaker",
        "generally",
        "speak",
        "truth",
        "generally",
        "trust",
        "one",
        "another",
        "despite",
        "frequent",
        "claim",
        "diverse",
        "philosopher",
        "contrary",
        "even",
        "grant",
        "people",
        "generally",
        "speak",
        "truth",
        "generally",
        "trust",
        "one",
        "another",
        "give",
        "reason",
        "speak",
        "truthfully",
        "want",
        "people",
        "believe",
        "truth",
        "want",
        "believe",
        "falsehood",
        "reason",
        "lie",
        "rather",
        "speak",
        "truth",
        "thus",
        "one",
        "might",
        "object",
        "regularity",
        "truthfulness",
        "trust",
        "selfperpetuating",
        "way",
        "lewisian",
        "convention",
        "requires",
        "expectation",
        "conformity",
        "provide",
        "reason",
        "conformity",
        "contrast",
        "consider",
        "convention",
        "driving",
        "right",
        "convention",
        "likewise",
        "provides",
        "reason",
        "conformity",
        "given",
        "appropriate",
        "desire",
        "namely",
        "desire",
        "avoid",
        "collision",
        "difference",
        "virtually",
        "everyone",
        "seek",
        "avoid",
        "collision",
        "deception",
        "normal",
        "feature",
        "ordinary",
        "linguistic",
        "interaction",
        "inevitably",
        "objection",
        "focus",
        "detail",
        "particular",
        "theory",
        "thus",
        "show",
        "conventionalist",
        "theory",
        "general",
        "mistaken",
        "convention",
        "determine",
        "linguistic",
        "meaning",
        "serious",
        "version",
        "objection",
        "advanced",
        "stephen",
        "schiffer",
        "john",
        "hawthorne",
        "many",
        "philosopher",
        "focus",
        "productivity",
        "language",
        "understand",
        "potential",
        "infinity",
        "meaningful",
        "sentence",
        "yet",
        "hardly",
        "master",
        "infinitely",
        "many",
        "linguistic",
        "convention",
        "one",
        "meaningful",
        "sentence",
        "convention",
        "fix",
        "meaning",
        "infinitely",
        "many",
        "sentence",
        "general",
        "worry",
        "arises",
        "particularly",
        "acute",
        "way",
        "lewis",
        "theory",
        "consider",
        "sentence",
        "s",
        "would",
        "never",
        "normally",
        "use",
        "perhaps",
        "long",
        "grammatically",
        "complex",
        "suppose",
        "speaker",
        "nevertheless",
        "utters",
        "s",
        "lewis",
        "acknowledges",
        "would",
        "normally",
        "believe",
        "speaker",
        "thereby",
        "attempting",
        "speak",
        "truthfully",
        "instead",
        "would",
        "suspect",
        "speaker",
        "acting",
        "deviant",
        "reason",
        "trying",
        "annoy",
        "settling",
        "bet",
        "would",
        "normally",
        "trust",
        "speaker",
        "lewis",
        "use",
        "convention",
        "truthfulness",
        "trust",
        "underwrite",
        "unique",
        "truthcondition",
        "s",
        "natural",
        "diagnosis",
        "sentence",
        "meaning",
        "determined",
        "meaning",
        "part",
        "understand",
        "understand",
        "component",
        "word",
        "understand",
        "compositional",
        "mechanism",
        "word",
        "combine",
        "form",
        "meaningful",
        "sentence",
        "course",
        "word",
        "meaning",
        "may",
        "fixed",
        "convention",
        "conventionalist",
        "explicate",
        "conventional",
        "link",
        "word",
        "meaning",
        "conventional",
        "link",
        "sentence",
        "truthconditions",
        "lewis",
        "explicates",
        "latter",
        "former",
        "although",
        "lewis",
        "attempt",
        "circumvent",
        "worry",
        "hawthorne",
        "schiffer",
        "argue",
        "response",
        "inadequate",
        "lewis",
        "account",
        "alone",
        "encountering",
        "difficulty",
        "productivity",
        "contemporary",
        "conventionalist",
        "theory",
        "encounter",
        "similar",
        "difficulty",
        "theory",
        "heeding",
        "frege",
        "context",
        "principle",
        "context",
        "sentence",
        "word",
        "meaning",
        "focus",
        "attention",
        "upon",
        "link",
        "sentence",
        "proposition",
        "rather",
        "link",
        "word",
        "meaning",
        "one",
        "might",
        "hope",
        "supplement",
        "conventionbased",
        "account",
        "chomskyinspired",
        "thesis",
        "advocated",
        "james",
        "higginbotham",
        "richard",
        "larson",
        "gabriel",
        "segal",
        "speaker",
        "tacit",
        "knowledge",
        "compositional",
        "semantic",
        "theory",
        "however",
        "martin",
        "davy",
        "observes",
        "one",
        "seems",
        "worked",
        "supplementary",
        "strategy",
        "detail",
        "obvious",
        "important",
        "role",
        "resulting",
        "account",
        "would",
        "assign",
        "convention",
        "let",
        "alone",
        "gricean",
        "communicative",
        "mechanism",
        "ultimately",
        "force",
        "worry",
        "remains",
        "unclear",
        "instance",
        "wayne",
        "davis",
        "develops",
        "conventionalist",
        "account",
        "harkens",
        "back",
        "prefregean",
        "tradition",
        "simplified",
        "form",
        "davis",
        "lockean",
        "proposal",
        "word",
        "meaningful",
        "conventionally",
        "use",
        "express",
        "certain",
        "idea",
        "meaning",
        "sentence",
        "determined",
        "meaning",
        "component",
        "word",
        "along",
        "conventionally",
        "determined",
        "semantic",
        "import",
        "syntactic",
        "structure",
        "word",
        "arranged",
        "evidently",
        "issue",
        "connect",
        "vexed",
        "question",
        "compositionality",
        "linguistic",
        "understanding",
        "unity",
        "proposition",
        "role",
        "played",
        "formal",
        "semantic",
        "theory",
        "study",
        "natural",
        "language",
        "convention",
        "necessary",
        "linguistic",
        "meaning",
        "noam",
        "chomsky",
        "donald",
        "davidson",
        "acknowledge",
        "linguistic",
        "convention",
        "denying",
        "fundamental",
        "nature",
        "language",
        "chomsky",
        "regard",
        "language",
        "system",
        "grammatical",
        "rule",
        "tacitly",
        "known",
        "speaker",
        "linguistics",
        "chomsky",
        "treat",
        "branch",
        "cognitive",
        "psychology",
        "study",
        "grammatical",
        "competence",
        "individual",
        "speaker",
        "posit",
        "mysterious",
        "unscientific",
        "communal",
        "language",
        "shared",
        "speaker",
        "instead",
        "focus",
        "upon",
        "idiolects",
        "thus",
        "language",
        "special",
        "tie",
        "social",
        "interaction",
        "communication",
        "specifically",
        "special",
        "tie",
        "convention",
        "stephen",
        "laurence",
        "stephen",
        "schiffer",
        "develop",
        "theory",
        "actual",
        "language",
        "relation",
        "informed",
        "broadly",
        "chomskian",
        "perspective",
        "basic",
        "idea",
        "behind",
        "account",
        "linguistic",
        "item",
        "used",
        "speaker",
        "associated",
        "certain",
        "semantic",
        "property",
        "case",
        "association",
        "linguistic",
        "item",
        "semantic",
        "property",
        "figure",
        "psychological",
        "process",
        "speaker",
        "assigns",
        "meaning",
        "truthconditions",
        "sentence",
        "davidson",
        "elaborates",
        "model",
        "communication",
        "take",
        "paradigm",
        "radical",
        "interpretation",
        "radical",
        "interpretation",
        "one",
        "try",
        "assign",
        "truthconditions",
        "utterance",
        "completely",
        "unfamiliar",
        "tongue",
        "one",
        "detects",
        "pattern",
        "concerning",
        "sentence",
        "speaker",
        "hold",
        "true",
        "one",
        "try",
        "make",
        "rational",
        "sense",
        "pattern",
        "guided",
        "general",
        "maxim",
        "principle",
        "charity",
        "roughly",
        "maximize",
        "true",
        "belief",
        "part",
        "speaker",
        "davidson",
        "admits",
        "everyday",
        "life",
        "tend",
        "default",
        "interpret",
        "one",
        "another",
        "homophonically",
        "principled",
        "reason",
        "must",
        "embrace",
        "homophonic",
        "default",
        "readily",
        "deviate",
        "whenever",
        "seems",
        "appropriate",
        "illustrated",
        "case",
        "idiosyncratic",
        "usage",
        "malapropism",
        "sense",
        "linguistic",
        "understanding",
        "rest",
        "upon",
        "radical",
        "interpretation",
        "shared",
        "linguistic",
        "convention",
        "inessential",
        "linguistic",
        "communication",
        "knowledge",
        "convention",
        "language",
        "thus",
        "practical",
        "crutch",
        "interpretation",
        "crutch",
        "practice",
        "afford",
        "withoutbut",
        "crutch",
        "optimum",
        "condition",
        "communication",
        "end",
        "throw",
        "away",
        "could",
        "theory",
        "done",
        "without",
        "start",
        "p",
        "davidson",
        "concludes",
        "theory",
        "meaning",
        "understanding",
        "assign",
        "convention",
        "foundational",
        "role",
        "conventionbased",
        "account",
        "employ",
        "proper",
        "order",
        "explanation",
        "final",
        "objection",
        "conventionbased",
        "theory",
        "target",
        "broader",
        "lockean",
        "strategy",
        "explaining",
        "language",
        "term",
        "thought",
        "according",
        "objection",
        "espoused",
        "philosopher",
        "robert",
        "brandom",
        "donald",
        "davidson",
        "michael",
        "dummett",
        "language",
        "inherit",
        "content",
        "thought",
        "rather",
        "thought",
        "language",
        "par",
        "acquiring",
        "content",
        "mutual",
        "interrelation",
        "one",
        "might",
        "also",
        "claim",
        "language",
        "primary",
        "locus",
        "intentionality",
        "thought",
        "inherits",
        "content",
        "language",
        "however",
        "contemporary",
        "philosopher",
        "espouse",
        "viewpoint",
        "thus",
        "analyze",
        "linguistic",
        "meaning",
        "product",
        "convention",
        "long",
        "convention",
        "understood",
        "lewisian",
        "system",
        "intention",
        "preference",
        "expectation",
        "propositional",
        "attitude",
        "intelligible",
        "relation",
        "language",
        "davidson",
        "put",
        "philosopher",
        "make",
        "convention",
        "necessary",
        "element",
        "language",
        "matter",
        "backwards",
        "truth",
        "rather",
        "language",
        "condition",
        "convention",
        "p",
        "two",
        "main",
        "difficulty",
        "face",
        "approach",
        "first",
        "although",
        "philosopher",
        "offered",
        "various",
        "argument",
        "thesis",
        "thought",
        "explanatorily",
        "prior",
        "language",
        "none",
        "argument",
        "command",
        "widespread",
        "assent",
        "christopher",
        "peacocke",
        "forcefully",
        "criticizes",
        "many",
        "wellknown",
        "argument",
        "thing",
        "stand",
        "objection",
        "constitutes",
        "much",
        "problem",
        "conventional",
        "theory",
        "prospectus",
        "rival",
        "research",
        "program",
        "second",
        "serious",
        "difficulty",
        "far",
        "rival",
        "research",
        "program",
        "yielded",
        "result",
        "nearly",
        "precise",
        "systematic",
        "existing",
        "conventional",
        "theory",
        "perhaps",
        "two",
        "commanding",
        "theory",
        "within",
        "rival",
        "research",
        "program",
        "davidson",
        "brandom",
        "many",
        "contemporary",
        "philosopher",
        "feel",
        "theory",
        "enshrine",
        "overly",
        "antirealist",
        "conception",
        "mental",
        "content",
        "moreover",
        "neither",
        "theory",
        "yield",
        "detailed",
        "necessary",
        "sufficient",
        "condition",
        "linguistic",
        "meaning",
        "analogous",
        "provided",
        "lewis"
    ]
}