{
    "main_text": "Objections to Cosmopolitanism || Economic cosmopolitanism\n3.3 Moral cosmopolitanism\n\n\nAnother version of the criticism that cosmopolitanism is impossible\ntargets the psychological assumptions of moral cosmopolitanism. Here\nit is said that human beings must have stronger attachments toward\nmembers of their own state or nation, and that attempts to disperse\nattachments to fellow-citizens in order to honor a moral community\nwith human beings as such will undermine our psychological\nfunctioning. If this is a viability claim and not simply\na desirability claim, then it must be supposed that moral\ncosmopolitanism would literally leave large numbers of people unable\nto function. So it is claimed that people need a particular sense of\nnational identity in order to be agents, and that a particular sense\nof national identity requires attachment to particular others\nperceived to have a similar identity. But this does not seem to be\ntrue as an empirical generalization. The cosmopolitan does not need to\ndeny that some people do happen to have the need for national\nallegiance, so long as it is true that not all people do; and insofar\nas some people do, the strict cosmopolitan will say that perhaps it\ndoes not need to be that way and that cosmopolitan education might\nlead to a different result. The historical record gives even the\nstrict cosmopolitan some cause for cheer, as human psychology and the\nforms of political organization have proven to be quite plastic. \n\n\nIn fact, some cosmopolitans have adopted a developmental psychology\naccording to which patriotism is a step on the way to cosmopolitanism:\nas human individuals mature they develop ever wider loyalties and\nallegiances, starting with attachments to their caregivers and ending\nwith allegiance to humanity at large. These different attachments are\nnot necessarily in competition with each other. Just as loyalty to\none’s family need not be an obstacle for state citizens, so loyalty to\none’s state need not be a problem for cosmopolitans. Thus,\ncosmopolitanism is regarded as an extension of a developmental process\nthat also includes the development of patriotism. This claim is just\nas much in need of empirical support, however, as the opposite claim\ndiscussed in the previous paragraph.\n\n\nOften, though, the critic’s arguments about psychological\npossibility are actually run together with desirability\nclaims. The critic says that the elimination of a special motivating\nattachment to fellow-citizens is not possible, but the critic means\nthat the elimination of special motivating attachments to\nfellow-citizens will make a certain desirable form of political life\nimpossible. To respond to this sort of argument, the cosmopolitan has\ntwo routes open. First, she can deny the claim itself. Perhaps the\nviability of politics as usual depends not upon certain beliefs that\nfellow-citizens deserve more of one’s service, but upon commitments to\nthe polity itself. If strictly cosmopolitan patriotism is a\npossibility, it lives in a commitment to a universal set of principles\nembodied in a particular political constitution and a particular set of\npolitical institutions. If such commitment is enough for desirable\npolitics, then the anti-cosmopolitan is disarmed. But second, the\ncosmopolitan can of course also deny the value of the form of political\nlife that is posited as desirable. At this point, moral commitments run\nover into a discussion of political theory.\n\n\nOccasionally it is said that cosmopolitans are treasonous or at least\nunreliable citizens. But many recognizably cosmopolitan theses (that\nis, the moderate ones) are consistent with loyalty to fellow-citizens,\nand even the strictest cosmopolitan can justify some forms of service\nto fellow-citizens when they are an optimal way to promote justice or\nto do good for human beings (who might happen to be\nfellow-citizens).\n\n\nThis last criticism can be developed further, however, and tailored\nspecifically to target the strict cosmopolitan. If the strict\ncosmopolitan can justify only some forms of service to fellow-citizens,\nunder some conditions, it might be said that she is blind to other\nmorally required forms or conditions of service to fellow-citizens. At\nthis point, the critic offers reasons why a person has special\nobligations to compatriots, which are missed by the strict\ncosmopolitan. Many critics who introduce these reasons are themselves\nmoderate cosmopolitans, wishing to demonstrate that there are special\nobligations to fellow-citizens in addition to general duties to the\ncommunity of all human beings. But if these reasons are demanding\nenough, then there may be no room left for any community with all human\nbeings, and so these objections to strict cosmopolitanism can also\nprovide some impetus toward an anti-cosmopolitan stance. Because there\nare several such reasons that are frequently proposed, there are, in\neffect, several objections to the strictly cosmopolitan position, and\nthey should be considered one-by-one.\n\n\nThe first narrow objection to strict cosmopolitanism is that it\nneglects the obligations of reciprocity. According to this argument, we\nhave obligations to give benefits in return for benefits received, and\nwe receive benefits from our fellow-citizens. The best strictly\ncosmopolitan response to this argument will insist on a distinction\nbetween the state and fellow-citizens and will question exactly who\nprovides which benefits and what is owed in return. On grounds of\nreciprocity the state may be owed certain things – cooperative\nobedience – and these things may in fact generally benefit\nfellow-citizens. But the state is not owed these things\nbecause one owes the fellow-citizens benefits. One does not\nappropriately signal gratitude for benefits received from the state by,\nsay, giving more to local charities than to charities abroad because\ncharity like this does not address the full agent responsible for the\nbenefits one has received, and does not even seem to be the sort of\nthing that is commensurate with the benefits received. In assessing\nthis exchange of arguments, there are some significantly difficult\nquestions to answer concerning exactly how the receipt of benefits\nobliges one to make a return.\n\n\nA second objection to strict moral cosmopolitanism gives contractarian\ngrounds for our obligations to fellow-citizens. Because actual\nagreements to prioritize fellow-citizens as beneficiaries are\ndifficult to find, the contractarians generally rely upon an implicit\nagreement that expresses the interests or values of the\nfellow-citizens themselves. So the contractarian argument turns on\nidentifying interests or values that obligate fellow-citizens to\nbenefit each other. Perhaps, then, it will be argued that citizens\nhave deep interests in what a successful civil society and state can\noffer them, and that these interests commit the citizens to an\nimplicit agreement to benefit fellow-citizens. The strict cosmopolitan\nwill reply to such an argument with skepticism about what is required\nfor the civil society. Why is more than cooperative obedience required\nby our interests in what a successful state and civil society can\nprovide?  Surely some citizens have to dedicate themselves to working\non behalf of this particular society, but why can they not do so on\nthe grounds that this is the best way to benefit human beings as such?\nPerhaps an intermediate position here is the (Kantian) view that it is\nmorally necessary to establish just democratic states and that just\ndemocratic states need some special commitment on the part of their\ncitizens in order to function as democracies, a special commitment\nthat goes beyond mere cooperative obedience but that can still be\ndefended in universalist cosmopolitan terms. For given that\ndemocracies require this special commitment as a condition of their\npossibility, it would be incoherent to promote justice in general by\npromoting just democracies while rejecting, as a matter of principle,\nthat which is required for just democracies to function.\n\n\nThe final argument for recognizing obligations to benefit\nfellow-citizens appeals to what David Miller has called\n‘relational facts.’ Here the general thought is that\ncertain relationships are constituted by reciprocal obligations: one\ncannot be a friend or a brother without having certain\nfriendship-obligations or sibling-obligations, respectively. If\nfellow-citizenship is like these other relations, then we would seem to\nhave special obligations to fellow-citizens. But this argument, which\ncan be found in Cicero’s De Officiis, depends upon our\nintuitions that fellow-citizenship is like friendship or brotherhood\nand that friendship and brotherhood do come with special obligations,\nand both intuitions require more argument. Frequently, these arguments\nappeal to alleged facts about human nature or about human psychology,\nbut these appeals generally raise still further questions.\n\n\nIn sum, a range of interesting and difficult philosophical issues is\nraised by the disputes between cosmopolitans of various stripes and\ntheir critics. As the world becomes a smaller place through increased\nsocial, political, and economic contacts, these disputes and the issues\nthey raise will only become more pressing.\n",
    "section_title": "3.3 Moral cosmopolitanism",
    "entry_title": "Cosmopolitanism",
    "hierarchy_title": "Cosmopolitanism || Objections to Cosmopolitanism || Economic cosmopolitanism",
    "tokenized_text": [
        "objection",
        "cosmopolitanism",
        "economic",
        "cosmopolitanism",
        "moral",
        "cosmopolitanism",
        "another",
        "version",
        "criticism",
        "cosmopolitanism",
        "impossible",
        "target",
        "psychological",
        "assumption",
        "moral",
        "cosmopolitanism",
        "said",
        "human",
        "being",
        "must",
        "stronger",
        "attachment",
        "toward",
        "member",
        "state",
        "nation",
        "attempt",
        "disperse",
        "attachment",
        "fellowcitizens",
        "order",
        "honor",
        "moral",
        "community",
        "human",
        "being",
        "undermine",
        "psychological",
        "functioning",
        "viability",
        "claim",
        "simply",
        "desirability",
        "claim",
        "must",
        "supposed",
        "moral",
        "cosmopolitanism",
        "would",
        "literally",
        "leave",
        "large",
        "number",
        "people",
        "unable",
        "function",
        "claimed",
        "people",
        "need",
        "particular",
        "sense",
        "national",
        "identity",
        "order",
        "agent",
        "particular",
        "sense",
        "national",
        "identity",
        "requires",
        "attachment",
        "particular",
        "others",
        "perceived",
        "similar",
        "identity",
        "seem",
        "true",
        "empirical",
        "generalization",
        "cosmopolitan",
        "need",
        "deny",
        "people",
        "happen",
        "need",
        "national",
        "allegiance",
        "long",
        "true",
        "people",
        "insofar",
        "people",
        "strict",
        "cosmopolitan",
        "say",
        "perhaps",
        "need",
        "way",
        "cosmopolitan",
        "education",
        "might",
        "lead",
        "different",
        "result",
        "historical",
        "record",
        "give",
        "even",
        "strict",
        "cosmopolitan",
        "cause",
        "cheer",
        "human",
        "psychology",
        "form",
        "political",
        "organization",
        "proven",
        "quite",
        "plastic",
        "fact",
        "cosmopolitan",
        "adopted",
        "developmental",
        "psychology",
        "according",
        "patriotism",
        "step",
        "way",
        "cosmopolitanism",
        "human",
        "individual",
        "mature",
        "develop",
        "ever",
        "wider",
        "loyalty",
        "allegiance",
        "starting",
        "attachment",
        "caregiver",
        "ending",
        "allegiance",
        "humanity",
        "large",
        "different",
        "attachment",
        "necessarily",
        "competition",
        "loyalty",
        "one",
        "family",
        "need",
        "obstacle",
        "state",
        "citizen",
        "loyalty",
        "one",
        "state",
        "need",
        "problem",
        "cosmopolitan",
        "thus",
        "cosmopolitanism",
        "regarded",
        "extension",
        "developmental",
        "process",
        "also",
        "includes",
        "development",
        "patriotism",
        "claim",
        "much",
        "need",
        "empirical",
        "support",
        "however",
        "opposite",
        "claim",
        "discussed",
        "previous",
        "paragraph",
        "often",
        "though",
        "critic",
        "argument",
        "psychological",
        "possibility",
        "actually",
        "run",
        "together",
        "desirability",
        "claim",
        "critic",
        "say",
        "elimination",
        "special",
        "motivating",
        "attachment",
        "fellowcitizens",
        "possible",
        "critic",
        "mean",
        "elimination",
        "special",
        "motivating",
        "attachment",
        "fellowcitizens",
        "make",
        "certain",
        "desirable",
        "form",
        "political",
        "life",
        "impossible",
        "respond",
        "sort",
        "argument",
        "cosmopolitan",
        "two",
        "route",
        "open",
        "first",
        "deny",
        "claim",
        "perhaps",
        "viability",
        "politics",
        "usual",
        "depends",
        "upon",
        "certain",
        "belief",
        "fellowcitizens",
        "deserve",
        "one",
        "service",
        "upon",
        "commitment",
        "polity",
        "strictly",
        "cosmopolitan",
        "patriotism",
        "possibility",
        "life",
        "commitment",
        "universal",
        "set",
        "principle",
        "embodied",
        "particular",
        "political",
        "constitution",
        "particular",
        "set",
        "political",
        "institution",
        "commitment",
        "enough",
        "desirable",
        "politics",
        "anticosmopolitan",
        "disarmed",
        "second",
        "cosmopolitan",
        "course",
        "also",
        "deny",
        "value",
        "form",
        "political",
        "life",
        "posited",
        "desirable",
        "point",
        "moral",
        "commitment",
        "run",
        "discussion",
        "political",
        "theory",
        "occasionally",
        "said",
        "cosmopolitan",
        "treasonous",
        "least",
        "unreliable",
        "citizen",
        "many",
        "recognizably",
        "cosmopolitan",
        "thesis",
        "moderate",
        "one",
        "consistent",
        "loyalty",
        "fellowcitizens",
        "even",
        "strictest",
        "cosmopolitan",
        "justify",
        "form",
        "service",
        "fellowcitizens",
        "optimal",
        "way",
        "promote",
        "justice",
        "good",
        "human",
        "being",
        "might",
        "happen",
        "fellowcitizens",
        "last",
        "criticism",
        "developed",
        "however",
        "tailored",
        "specifically",
        "target",
        "strict",
        "cosmopolitan",
        "strict",
        "cosmopolitan",
        "justify",
        "form",
        "service",
        "fellowcitizens",
        "condition",
        "might",
        "said",
        "blind",
        "morally",
        "required",
        "form",
        "condition",
        "service",
        "fellowcitizens",
        "point",
        "critic",
        "offer",
        "reason",
        "person",
        "special",
        "obligation",
        "compatriot",
        "missed",
        "strict",
        "cosmopolitan",
        "many",
        "critic",
        "introduce",
        "reason",
        "moderate",
        "cosmopolitan",
        "wishing",
        "demonstrate",
        "special",
        "obligation",
        "fellowcitizens",
        "addition",
        "general",
        "duty",
        "community",
        "human",
        "being",
        "reason",
        "demanding",
        "enough",
        "may",
        "room",
        "left",
        "community",
        "human",
        "being",
        "objection",
        "strict",
        "cosmopolitanism",
        "also",
        "provide",
        "impetus",
        "toward",
        "anticosmopolitan",
        "stance",
        "several",
        "reason",
        "frequently",
        "proposed",
        "effect",
        "several",
        "objection",
        "strictly",
        "cosmopolitan",
        "position",
        "considered",
        "onebyone",
        "first",
        "narrow",
        "objection",
        "strict",
        "cosmopolitanism",
        "neglect",
        "obligation",
        "reciprocity",
        "according",
        "argument",
        "obligation",
        "give",
        "benefit",
        "return",
        "benefit",
        "received",
        "receive",
        "benefit",
        "fellowcitizens",
        "best",
        "strictly",
        "cosmopolitan",
        "response",
        "argument",
        "insist",
        "distinction",
        "state",
        "fellowcitizens",
        "question",
        "exactly",
        "provides",
        "benefit",
        "owed",
        "return",
        "ground",
        "reciprocity",
        "state",
        "may",
        "owed",
        "certain",
        "thing",
        "cooperative",
        "obedience",
        "thing",
        "may",
        "fact",
        "generally",
        "benefit",
        "fellowcitizens",
        "state",
        "owed",
        "thing",
        "one",
        "owes",
        "fellowcitizens",
        "benefit",
        "one",
        "appropriately",
        "signal",
        "gratitude",
        "benefit",
        "received",
        "state",
        "say",
        "giving",
        "local",
        "charity",
        "charity",
        "abroad",
        "charity",
        "like",
        "address",
        "full",
        "agent",
        "responsible",
        "benefit",
        "one",
        "received",
        "even",
        "seem",
        "sort",
        "thing",
        "commensurate",
        "benefit",
        "received",
        "assessing",
        "exchange",
        "argument",
        "significantly",
        "difficult",
        "question",
        "answer",
        "concerning",
        "exactly",
        "receipt",
        "benefit",
        "obliges",
        "one",
        "make",
        "return",
        "second",
        "objection",
        "strict",
        "moral",
        "cosmopolitanism",
        "give",
        "contractarian",
        "ground",
        "obligation",
        "fellowcitizens",
        "actual",
        "agreement",
        "prioritize",
        "fellowcitizens",
        "beneficiary",
        "difficult",
        "find",
        "contractarians",
        "generally",
        "rely",
        "upon",
        "implicit",
        "agreement",
        "express",
        "interest",
        "value",
        "fellowcitizens",
        "contractarian",
        "argument",
        "turn",
        "identifying",
        "interest",
        "value",
        "obligate",
        "fellowcitizens",
        "benefit",
        "perhaps",
        "argued",
        "citizen",
        "deep",
        "interest",
        "successful",
        "civil",
        "society",
        "state",
        "offer",
        "interest",
        "commit",
        "citizen",
        "implicit",
        "agreement",
        "benefit",
        "fellowcitizens",
        "strict",
        "cosmopolitan",
        "reply",
        "argument",
        "skepticism",
        "required",
        "civil",
        "society",
        "cooperative",
        "obedience",
        "required",
        "interest",
        "successful",
        "state",
        "civil",
        "society",
        "provide",
        "surely",
        "citizen",
        "dedicate",
        "working",
        "behalf",
        "particular",
        "society",
        "ground",
        "best",
        "way",
        "benefit",
        "human",
        "being",
        "perhaps",
        "intermediate",
        "position",
        "kantian",
        "view",
        "morally",
        "necessary",
        "establish",
        "democratic",
        "state",
        "democratic",
        "state",
        "need",
        "special",
        "commitment",
        "part",
        "citizen",
        "order",
        "function",
        "democracy",
        "special",
        "commitment",
        "go",
        "beyond",
        "mere",
        "cooperative",
        "obedience",
        "still",
        "defended",
        "universalist",
        "cosmopolitan",
        "term",
        "given",
        "democracy",
        "require",
        "special",
        "commitment",
        "condition",
        "possibility",
        "would",
        "incoherent",
        "promote",
        "justice",
        "general",
        "promoting",
        "democracy",
        "rejecting",
        "matter",
        "principle",
        "required",
        "democracy",
        "function",
        "final",
        "argument",
        "recognizing",
        "obligation",
        "benefit",
        "fellowcitizens",
        "appeal",
        "david",
        "miller",
        "called",
        "relational",
        "facts",
        "general",
        "thought",
        "certain",
        "relationship",
        "constituted",
        "reciprocal",
        "obligation",
        "one",
        "friend",
        "brother",
        "without",
        "certain",
        "friendshipobligations",
        "siblingobligations",
        "respectively",
        "fellowcitizenship",
        "like",
        "relation",
        "would",
        "seem",
        "special",
        "obligation",
        "fellowcitizens",
        "argument",
        "found",
        "cicero",
        "de",
        "officiis",
        "depends",
        "upon",
        "intuition",
        "fellowcitizenship",
        "like",
        "friendship",
        "brotherhood",
        "friendship",
        "brotherhood",
        "come",
        "special",
        "obligation",
        "intuition",
        "require",
        "argument",
        "frequently",
        "argument",
        "appeal",
        "alleged",
        "fact",
        "human",
        "nature",
        "human",
        "psychology",
        "appeal",
        "generally",
        "raise",
        "still",
        "question",
        "sum",
        "range",
        "interesting",
        "difficult",
        "philosophical",
        "issue",
        "raised",
        "dispute",
        "cosmopolitan",
        "various",
        "stripe",
        "critic",
        "world",
        "becomes",
        "smaller",
        "place",
        "increased",
        "social",
        "political",
        "economic",
        "contact",
        "dispute",
        "issue",
        "raise",
        "become",
        "pressing"
    ]
}