{
    "main_text": "Is Complexity Irreducible?\n8. Is Complexity Irreducible?\n\nIrreducible complexity is supposedly something which could not have\ncome through unbroken law (meaning law that has no special divine\nguidance), and especially not through the agency of natural selection.\nCritics claim that Behe shows a misunderstanding of the very nature\nand workings of natural selection. No one is denying that in natural\nprocesses there may well be parts which, if removed, would lead at\nonce to the non-functioning of the systems in which they occur. The\npoint however is not whether the parts now in place could not be\nremoved without collapse, but whether they could have been put in\nplace by natural selection. Consider an arched bridge, made from cut\nstone, without cement, held in place only by the force of the stones\nagainst each other. If you tried to build the bridge from scratch,\nupwards and then inwards, you would fail – the stones would keep\nfalling to the ground, as indeed the whole bridge now would collapse\nwere you to remove the center keystone or any surrounding it. Rather,\nwhat you must do is first build a supporting structure (possibly an\nearthen embankment), on which you will lay the stones of the bridge,\nuntil they are all in place. At which point you can remove the\nstructure for it is no longer needed, and in fact is in the way.\nLikewise, one can imagine a biochemical sequential process with\nseveral stages, on the parts of which other processes piggyback as it\nwere. Then the hitherto non-sequential parasitic processes link up and\nstart functioning independently, the original sequence finally being\nremoved by natural selection as redundant or inconveniently draining\nof resources.\n\nOf course, this is all pretend. But Darwinian evolutionists have\nhardly ignored the matter of complex processes. Indeed, it is\ndiscussed in detail by Darwin in the Origin, where he refers\nto that most puzzling of all adaptations, the eye. At the biochemical\nlevel, today’s Darwinians have many examples of the most complex of\nprocesses that have been put in place by selection. Take that staple\nof the body’s biochemistry, the process where energy from food is\nconverted into a form which can be used by the cells. Rightly does a\nstandard textbook refer to this vital organic system, the so-called\n‘Krebs cycle,’ as something which ‘undergoes a very\ncomplicated series of reactions’ (Hollum 1987, 408). This\nprocess, which occurs in the cell parts known as mitochondria,\ninvolves the production of ATP (adenosine triphosphate): a complex\nmolecule which is energy rich and which is degraded by the body as\nneeded (say in muscle action) into another less rich molecule ADP\n(adenosine diphosphate). The Krebs cycle remakes ATP from other energy\nsources – an adult human male needs to make nearly 200 Kg a day\n— and by any measure, the cycle is enormously involved and\nintricate. For a start, nearly a dozen enzymes (substances which\nfacilitate chemical processes) are required, as one sub-process leads\non to another. \n\nYet the cycle did not come out of nowhere. It was cobbled together out\nof other cellular processes which do other things. It was a\n‘bricolage’, that is to say it was something put together\nin a haphazard fashion. Each one of the bits and pieces of the cycle\nexists for other purposes and has been coopted for the new end. The\nscientists who have made this connection could not have made a\nstronger case against Behe’s irreducible complexity than if they had\nhad him in mind from the first. In fact, they set up the problem\nvirtually in Behe’s terms: ‘The Krebs cycle has been frequently\nquoted as a key problem in the evolution of living cells, hard to\nexplain by Darwin’s natural selection: How could natural selection\nexplain the building of a complicated structure in toto, when the\nintermediate stages have no obvious fitness functionality?’\n(Meléndez-Hervia et al 1996, 302). (Readers who want to dig\nmore deeply into some of the technical issues should start with the \nentry on\n  fitness.)\n\nWhat these workers do not offer is a Behe-type answer. First, they\nbrush away a false lead. Could it be that we have something like the\nevolution of the mammalian eye, where primitive existent eyes in other\norganisms suggest that selection can and does work on proto models (as\nit were), refining features which have the same function if not as\nefficient as more sophisticated models? Probably not, for there is no\nevidence of anything like this. But then we are put on a more\npromising track. \n\nIn the Krebs cycle problem the intermediary stages were also useful,\nbut for different purposes, and, therefore, its complete design was a\nvery clear case of opportunism. The building of the eye was really a\ncreative process in order to make a new thing specifically, but the\nKrebs cycle was built through the process that Jacob (1977) called\n‘evolution by molecular tinkering,’ stating that evolution\ndoes not produce novelties from scratch: It works on what already\nexists. The most novel result of our analysis is seeing how, with\nminimal new material, evolution created the most important pathway of\nmetabolism, achieving the best chemically possible design. In this\ncase, a chemical engineer who was looking for the best design of the\nprocess could not have found a better design than the cycle which\nworks in living cells. (p. 302)\n\n\nRounding off the response to Behe, let us note that, if his arguments\nare well-taken, then in respects we are into a bigger set of problems\nthan otherwise! His position seems simply not viable given what we\nknow of the nature of mutation and the stability of biological systems\nover time. When exactly is the intelligent designer supposed to strike\nand to do its work? In his major work, Darwin’s Black Box,\nBehe suggests that everything might have been done long ago and then\nleft to its own devices. ‘The irreducibly complex biochemical\nsystems that I have discussed… did not have to be produced\nrecently. It is entirely possible, based simply on an examination of\nthe systems themselves, that they were designed billions of years ago\nand that they have been passed down to the present by the normal\nprocesses of cellular reproduction’ (Behe 1996, 227–8). \n\nThis is not a satisfactory response. We cannot ignore the history of\nthe genes from the point between their origin (when they would not\nhave been needed) and today when they are in full use. In the words of\nBrown biochemist Kenneth Miller: ‘As any student of biology will\ntell you, because those genes are not expressed, natural selection\nwould not be able to weed out genetic mistakes. Mutations would\naccumulate in these genes at breathtaking rates, rendering them\nhopelessly changed and inoperative hundreds of millions of years\nbefore Behe says that they will be needed.’ There is much\nexperimental evidence showing that this is the case. Behe’s idea of\ndesigner doing everything back then and then leaving matters to their\nnatural fate is ‘pure and simple fantasy’ (Miller 1999,\n162–3).\n\nWhat is the alternative strategy that Behe must take? Presumably that\nthe designer is at work all of the time, producing mechanisms as and\nwhen needed. So, if we are lucky, we might expect to see some produced\nin our lifetime. Indeed, there must be a sense of disappointment among\nbiologists that no such creative acts have so far been reported. More\nthan this, as we turn from science towards theology, there even\ngreater disappointments. Most obviously, what about bad mutations (in\nthe sense of mutations that lead to consequences very non-helpful to\ntheir possessors)? If the designer is needed and available for complex\nengineering problems, why could not the designer take some time on the\nsimple matters, specifically those simple matters which if unfixed\nlead to absolutely horrendous problems. Some of the worst genetic\ndiseases are caused by one little alteration in one little part of the\nDNA. If the designer is able and willing to do the very complex\nbecause it is very good, why does it not do the very simple because\nthe alternative is very bad? Behe speaks of this as being part of the\nproblem of evil, which is true, but not very helpful. Given that the\nopportunity and ability to do good was so obvious and yet not taken,\nwe need to know the reason why. (A comprehensive collection, edited by\nan Intelligent Design Theorist and an avid Darwinian evolutionist,\ncontains arguments from both sides, by biologists and philosophers;\nsee Dembski and Ruse (eds.) 2004.)\n",
    "section_title": "8. Is Complexity Irreducible?",
    "entry_title": "Creationism",
    "hierarchy_title": "Creationism || Is Complexity Irreducible?",
    "tokenized_text": [
        "complexity",
        "irreducible",
        "complexity",
        "irreducible",
        "irreducible",
        "complexity",
        "supposedly",
        "something",
        "could",
        "come",
        "unbroken",
        "law",
        "meaning",
        "law",
        "special",
        "divine",
        "guidance",
        "especially",
        "agency",
        "natural",
        "selection",
        "critic",
        "claim",
        "behe",
        "show",
        "misunderstanding",
        "nature",
        "working",
        "natural",
        "selection",
        "one",
        "denying",
        "natural",
        "process",
        "may",
        "well",
        "part",
        "removed",
        "would",
        "lead",
        "nonfunctioning",
        "system",
        "occur",
        "point",
        "however",
        "whether",
        "part",
        "place",
        "could",
        "removed",
        "without",
        "collapse",
        "whether",
        "could",
        "put",
        "place",
        "natural",
        "selection",
        "consider",
        "arched",
        "bridge",
        "made",
        "cut",
        "stone",
        "without",
        "cement",
        "held",
        "place",
        "force",
        "stone",
        "tried",
        "build",
        "bridge",
        "scratch",
        "upwards",
        "inwards",
        "would",
        "fail",
        "stone",
        "would",
        "keep",
        "falling",
        "ground",
        "indeed",
        "whole",
        "bridge",
        "would",
        "collapse",
        "remove",
        "center",
        "keystone",
        "surrounding",
        "rather",
        "must",
        "first",
        "build",
        "supporting",
        "structure",
        "possibly",
        "earthen",
        "embankment",
        "lay",
        "stone",
        "bridge",
        "place",
        "point",
        "remove",
        "structure",
        "longer",
        "needed",
        "fact",
        "way",
        "likewise",
        "one",
        "imagine",
        "biochemical",
        "sequential",
        "process",
        "several",
        "stage",
        "part",
        "process",
        "piggyback",
        "hitherto",
        "nonsequential",
        "parasitic",
        "process",
        "link",
        "start",
        "functioning",
        "independently",
        "original",
        "sequence",
        "finally",
        "removed",
        "natural",
        "selection",
        "redundant",
        "inconveniently",
        "draining",
        "resource",
        "course",
        "pretend",
        "darwinian",
        "evolutionist",
        "hardly",
        "ignored",
        "matter",
        "complex",
        "process",
        "indeed",
        "discussed",
        "detail",
        "darwin",
        "origin",
        "refers",
        "puzzling",
        "adaptation",
        "eye",
        "biochemical",
        "level",
        "today",
        "darwinian",
        "many",
        "example",
        "complex",
        "process",
        "put",
        "place",
        "selection",
        "take",
        "staple",
        "body",
        "biochemistry",
        "process",
        "energy",
        "food",
        "converted",
        "form",
        "used",
        "cell",
        "rightly",
        "standard",
        "textbook",
        "refer",
        "vital",
        "organic",
        "system",
        "socalled",
        "krebs",
        "cycle",
        "something",
        "undergoes",
        "complicated",
        "series",
        "reaction",
        "hollum",
        "process",
        "occurs",
        "cell",
        "part",
        "known",
        "mitochondrion",
        "involves",
        "production",
        "atp",
        "adenosine",
        "triphosphate",
        "complex",
        "molecule",
        "energy",
        "rich",
        "degraded",
        "body",
        "needed",
        "say",
        "muscle",
        "action",
        "another",
        "le",
        "rich",
        "molecule",
        "adp",
        "adenosine",
        "diphosphate",
        "krebs",
        "cycle",
        "remake",
        "atp",
        "energy",
        "source",
        "adult",
        "human",
        "male",
        "need",
        "make",
        "nearly",
        "kg",
        "day",
        "measure",
        "cycle",
        "enormously",
        "involved",
        "intricate",
        "start",
        "nearly",
        "dozen",
        "enzyme",
        "substance",
        "facilitate",
        "chemical",
        "process",
        "required",
        "one",
        "subprocess",
        "lead",
        "another",
        "yet",
        "cycle",
        "come",
        "nowhere",
        "cobbled",
        "together",
        "cellular",
        "process",
        "thing",
        "bricolage",
        "say",
        "something",
        "put",
        "together",
        "haphazard",
        "fashion",
        "one",
        "bit",
        "piece",
        "cycle",
        "exists",
        "purpose",
        "coopted",
        "new",
        "end",
        "scientist",
        "made",
        "connection",
        "could",
        "made",
        "stronger",
        "case",
        "behe",
        "irreducible",
        "complexity",
        "mind",
        "first",
        "fact",
        "set",
        "problem",
        "virtually",
        "behe",
        "term",
        "krebs",
        "cycle",
        "frequently",
        "quoted",
        "key",
        "problem",
        "evolution",
        "living",
        "cell",
        "hard",
        "explain",
        "darwin",
        "natural",
        "selection",
        "could",
        "natural",
        "selection",
        "explain",
        "building",
        "complicated",
        "structure",
        "toto",
        "intermediate",
        "stage",
        "obvious",
        "fitness",
        "functionality",
        "meléndezhervia",
        "et",
        "al",
        "reader",
        "want",
        "dig",
        "deeply",
        "technical",
        "issue",
        "start",
        "entry",
        "fitness",
        "worker",
        "offer",
        "behetype",
        "answer",
        "first",
        "brush",
        "away",
        "false",
        "lead",
        "could",
        "something",
        "like",
        "evolution",
        "mammalian",
        "eye",
        "primitive",
        "existent",
        "eye",
        "organism",
        "suggest",
        "selection",
        "work",
        "proto",
        "model",
        "refining",
        "feature",
        "function",
        "efficient",
        "sophisticated",
        "model",
        "probably",
        "evidence",
        "anything",
        "like",
        "put",
        "promising",
        "track",
        "krebs",
        "cycle",
        "problem",
        "intermediary",
        "stage",
        "also",
        "useful",
        "different",
        "purpose",
        "therefore",
        "complete",
        "design",
        "clear",
        "case",
        "opportunism",
        "building",
        "eye",
        "really",
        "creative",
        "process",
        "order",
        "make",
        "new",
        "thing",
        "specifically",
        "krebs",
        "cycle",
        "built",
        "process",
        "jacob",
        "called",
        "evolution",
        "molecular",
        "tinkering",
        "stating",
        "evolution",
        "produce",
        "novelty",
        "scratch",
        "work",
        "already",
        "exists",
        "novel",
        "result",
        "analysis",
        "seeing",
        "minimal",
        "new",
        "material",
        "evolution",
        "created",
        "important",
        "pathway",
        "metabolism",
        "achieving",
        "best",
        "chemically",
        "possible",
        "design",
        "case",
        "chemical",
        "engineer",
        "looking",
        "best",
        "design",
        "process",
        "could",
        "found",
        "better",
        "design",
        "cycle",
        "work",
        "living",
        "cell",
        "p",
        "rounding",
        "response",
        "behe",
        "let",
        "u",
        "note",
        "argument",
        "welltaken",
        "respect",
        "bigger",
        "set",
        "problem",
        "otherwise",
        "position",
        "seems",
        "simply",
        "viable",
        "given",
        "know",
        "nature",
        "mutation",
        "stability",
        "biological",
        "system",
        "time",
        "exactly",
        "intelligent",
        "designer",
        "supposed",
        "strike",
        "work",
        "major",
        "work",
        "darwin",
        "black",
        "box",
        "behe",
        "suggests",
        "everything",
        "might",
        "done",
        "long",
        "ago",
        "left",
        "device",
        "irreducibly",
        "complex",
        "biochemical",
        "system",
        "discussed",
        "produced",
        "recently",
        "entirely",
        "possible",
        "based",
        "simply",
        "examination",
        "system",
        "designed",
        "billion",
        "year",
        "ago",
        "passed",
        "present",
        "normal",
        "process",
        "cellular",
        "reproduction",
        "behe",
        "satisfactory",
        "response",
        "ignore",
        "history",
        "gene",
        "point",
        "origin",
        "would",
        "needed",
        "today",
        "full",
        "use",
        "word",
        "brown",
        "biochemist",
        "kenneth",
        "miller",
        "student",
        "biology",
        "tell",
        "gene",
        "expressed",
        "natural",
        "selection",
        "would",
        "able",
        "weed",
        "genetic",
        "mistake",
        "mutation",
        "would",
        "accumulate",
        "gene",
        "breathtaking",
        "rate",
        "rendering",
        "hopelessly",
        "changed",
        "inoperative",
        "hundred",
        "million",
        "year",
        "behe",
        "say",
        "needed",
        "much",
        "experimental",
        "evidence",
        "showing",
        "case",
        "behe",
        "idea",
        "designer",
        "everything",
        "back",
        "leaving",
        "matter",
        "natural",
        "fate",
        "pure",
        "simple",
        "fantasy",
        "miller",
        "alternative",
        "strategy",
        "behe",
        "must",
        "take",
        "presumably",
        "designer",
        "work",
        "time",
        "producing",
        "mechanism",
        "needed",
        "lucky",
        "might",
        "expect",
        "see",
        "produced",
        "lifetime",
        "indeed",
        "must",
        "sense",
        "disappointment",
        "among",
        "biologist",
        "creative",
        "act",
        "far",
        "reported",
        "turn",
        "science",
        "towards",
        "theology",
        "even",
        "greater",
        "disappointment",
        "obviously",
        "bad",
        "mutation",
        "sense",
        "mutation",
        "lead",
        "consequence",
        "nonhelpful",
        "possessor",
        "designer",
        "needed",
        "available",
        "complex",
        "engineering",
        "problem",
        "could",
        "designer",
        "take",
        "time",
        "simple",
        "matter",
        "specifically",
        "simple",
        "matter",
        "unfixed",
        "lead",
        "absolutely",
        "horrendous",
        "problem",
        "worst",
        "genetic",
        "disease",
        "caused",
        "one",
        "little",
        "alteration",
        "one",
        "little",
        "part",
        "dna",
        "designer",
        "able",
        "willing",
        "complex",
        "good",
        "simple",
        "alternative",
        "bad",
        "behe",
        "speaks",
        "part",
        "problem",
        "evil",
        "true",
        "helpful",
        "given",
        "opportunity",
        "ability",
        "good",
        "obvious",
        "yet",
        "taken",
        "need",
        "know",
        "reason",
        "comprehensive",
        "collection",
        "edited",
        "intelligent",
        "design",
        "theorist",
        "avid",
        "darwinian",
        "evolutionist",
        "contains",
        "argument",
        "side",
        "biologist",
        "philosopher",
        "see",
        "dembski",
        "ruse",
        "ed"
    ]
}