{
    "main_text": "Creation Science\n2. Creation Science\n\nAfter the Scopes Trial, general agreement is that the Creationism\nmovement had peaked and declined quite dramatically and quickly. Yet,\nit (and related anti-evolution activity) did have its lasting effects.\nText-book manufacturers increasingly took evolution – Darwinism\nespecially – out of their books, so that schoolchildren got less\nand less exposure to the ideas anyway. Whatever battles the\nevolutionists may have thought they had won in the court of popular\nopinion, in the trenches of the classroom they were losing the war\nbadly. Things started to move again in the late 1950s. It was then\nthat, thanks to Sputnik, the Russians so effectively demonstrated\ntheir superiority in rocketry (with its implications for the arms race\nof the Cold War), and America realized with a shudder how ineffective\nwas its science training of its young. Characteristically, the country\ndid something immediate and effective about this, namely pouring money\ninto the production of new science texts. In this way, with class\nadoption, the Federal Government could have a strong impact and yet\nget around the problem that education tends to be under the tight\ncontrol of individual states. The new biology texts gave full scope to\nevolution – to Darwinism – and with this the Creationism\ncontroversy again flared right up. Children were learning these\ndreadful doctrines in schools, and something had to be done (Ruse (ed.)\n1988; Gilkey 1985).\n\nFortunately for the literalist, help was at hand. A biblical scholar,\nJohn C. Whitcomb, and a hydraulic engineer, Henry M. Morris, combined\nto write what was to be the new Bible of the movement, Genesis\nFlood: The Biblical Record and its Scientific Implications\n(1961). Following in the tradition of earlier writers,\nespecially those from Seventh-day Adventism, they argued that every\nbit of the Biblical story of creation given in the early chapters of\nGenesis is supported fully by the best of modern science. Six days of\ntwenty-four hours, organisms arriving miraculously, humans last, and\nsometime thereafter a massive world-wide flood that wiped most\norganisms off the face of the earth – or rather, dumped their\ncarcasses in the mud as the waters receded. At the same time, Whitcomb\nand Morris argued that the case for evolution fails dismally. They\nintroduced (or revived) a number of arguments that have become\nstandard parts of the Creationist repertoire against evolution. Let us\nlook at a number of these arguments, together with the\ncounter-arguments that evolutionists make in response.\n\nFirst, the Creationists argue that at best evolution is only a theory\nand not a fact, and that theories should never be taken as gospel (if\none might be permitted a metaphor). They claim that the very language\nof evolutionists themselves show that their ideas are on shaky\ngrounds. To which charge evolutionists respond that this is to confuse\ntwo senses of the word ‘theory.’ Sometimes we use it to\nmean a body of scientific laws, as in ‘Einstein’s theory of\nrelativity.’ Sometimes we use it to mean an ‘iffy\nhypothesis,’ as in ‘I have a theory about Kennedy’s\nassassination.’ These are two very different senses. There is\nnothing iffy about the Copernican heliocentric theory. It is true. It\nis a fact. Evolutionists argue that the same is the case with\nevolution. When talking about the theory of evolution, one is talking\nabout a body of laws. In particular, if one is following the ideas of\nCharles Darwin, one is arguing that population pressures lead to a\nstruggle for existence, this then entails a natural selection of\nfavored forms, and evolution through shared descent is the end result.\nThis is a body of general statements about life, since the 1930s given\nin a formal version using mathematics with deductive inferences\nbetween steps. In other words, we have a body of laws, and hence a\ntheory in the first sense just given. There is no implication here\nthat the theory is iffy, that is in the second sense just given. We\nare not necessarily talking about something inherently unreliable. Of\ncourse, there are going to be additions and revisions, for instance\nthe possibility of much greater hybridization than someone like Darwin\nrealized, but that is another matter (Quammen 2018).\n\nSecond, Creationists like Whitcomb and Morris claim that the central\nmechanism of modern evolutionary thought, Darwin’s natural selection,\nis bogus. They argue that it is not a genuine claim about the real\nworld but merely a truism, what philosophers call a tautology –\nsomething true by the meaning of the words like ‘bachelors are\nunmarried.’ In the case of natural selection, the Creationists\npoint out that an alternative name for the mechanism is ‘the\nsurvival of the fittest.’ But, they ask, who are the fittest?\nThey reply: Those that survive! Hence, natural selection reduces to\nthe tautology that those that survive are those that survive. Not a\nreal claim of science at all. To which evolutionists respond that this\nis a sleight of hand, showing ignorance of what is genuinely at stake.\nNatural selection is truly real, for it talks about some organisms\nactually surviving and reproducing in life’s struggles and others\nfailing to do so. Some of our would-be ancestors lived and had babies\nand others did not. There was a differential reproduction. This is\ncertainly not a mere truism. It could be that everyone had the same\nnumber of children. It could also be that there is no difference\noverall between the successful and the unsuccessful. This too is\ndenied by natural selection. To say that something is the fitter or\nfittest is to say that it has certain characteristics (what biologists\ncall adaptations) that other organisms do not have, and that on\naverage one expects the fitter to succeed. But there is no guarantee\nthat this must be so or that it will always happen. An earthquake\ncould wipe out everyone, fit and unfit.\n\nBefore discussing the third argument Creationists level against\nevolution, it is worth pausing over this second one. Most if not all\nprofessional evolutionists argue that sometimes natural selection is\nnot a significant causal factor.  In this sense, it is false that\nselection is something that by definition is and always is the reason\nfor lasting change.  The fittest do not always win.  It cannot be a\ntautology. In the 1930s, the American population geneticist Sewall\nWright devised his hypothesis of “genetic drift,” arguing\nthat sometimes mere chance can lead to effects overriding the forces\nof selection (Wright 1931, 1932). Although, at first, this was\nembraced enthusiastically (Dobzhansky 1937), it soon became clear that\nat the gross physical (phenotypic) level it is at most minor (Coyne,\nBarton, and Turelli 1997). However at the level of the gene\n(genotype), it is still thought very important. Indeed, it is a\npowerful tool in discovering the exact dates of key evolutionary\nevents, especially those involving speciation (Ayala 2009). Moreover,\nas we shall see in a moment, somewhat paradoxically, as Creationism\nhas evolved (!), increasingly the virtues of selection working at the\nmicroevolutionary level have become apparent. Thus can one explain the\ndiversity of life on earth – it evolved since leaving the Ark,\nwhich contained only generic kinds. For all its supposed faults, there\nis a better discussion of natural selection at the Creationist museum\nin Kentucky than in the Field Museum in Chicago, 300 miles north. The\nbar on macroevolution remains absolute.\n\nThird, Creationists point out that modern evolutionary theory asserts\nthat the raw building blocks of evolution, the genetic mutations, are\nrandom. But this means that there are minimal chances of evolution\nproducing something that works as well and efficiently as an organism,\nwith all of the functioning parts in place. A monkey typing letters\ndoes so randomly. It could never in a million years (in a billion,\nbillion, billion… years) type the works of Shakespeare. The\nCreationists say that same is true of evolution and organisms, given\nthe randomness of mutation. To which evolutionists reply that this may\nall be well and true of the monkey, but in the case of evolution\nthings are rather different. If a mutation works, then it is kept and\nthen built upon, until the next good mutation comes along. This\nshrinks considerably the odds of evolution producing organisms, even\nthough the appearance of mutation is random. Suppose you take just one\nphrase from Shakespeare. ‘Friends, Romans, countrymen, lend me\nyour ears.’ If you had to get every letter right straight off,\nyou would be into a huge time-span. Twenty-six (the number of letters,\nmore if you include capitals and gaps and punctuation) to the power of\nthe number of spaces. But if you are allowed to keep the\n‘F’ as soon as you get it, and then go on to try for a\n‘r’, you are no longer going back to square one each time\nand suddenly the task becomes much more manageable. (Dawkins 1986 has\na good discussion of these issues.) Incidentally, add evolutionists,\none must take care in speaking of mutation as ‘random.’\nThere is no implication that mutation is uncaused or something else\nrather peculiar. Rather is meant that mutations do not occur according\nto need. Suppose a new disease appears. Evolutionary theory does not\nguarantee that a new, life-protecting mutation will occur to\norder.\n\nFourth in the litany of Creationist complaints, there is a perennial\nfavourite based on paleontology. Creationists agree that the fossil\nrecord is sequential, fish to primates moving upwards, but argue that\nthis is the result of the sorting effect of the Flood. Primates are\nabove dinosaurs, for example, because primates are more agile and\nmoved further up the mountain before being caught and drowning. They\nalso argue, however, that the fossil record ought to be continuous if\nevolution occurred, but in real life there are many gaps between\ndifferent form – jumps from one kind of organism to another.\nApes to humans would be a case in point. This spells Creation not\nevolution. To which the response comes that on the one hand one\nexpects such gaps. Fossilization is an uncommon occurrence –\nmost dead bodies get eaten straight away or just rot – and the\nwonder is that we have what we do have. On the other hand argue\nevolutionists, the record is not that gappy. There are lots of good\nsequences – lines of fossils with little difference between\nadjacent forms, from the amphibians to the mammals for example, or (in\nmore detail) the evolution of the horse from Eohippus on five toes to\nthe modern horse on one toe. Moreover, in refutation of Creationism,\nwe do not find fossils out of order as you might expect after a flood.\nFor all that Creationists sometimes claim otherwise, humans are never\nfound down with the dinosaurs. Those brutes of old expired long before\nwe appeared on the scene and the fossil record confirms this.\n\nFifth, Creationists argue that physics disproves evolution. The second\nlaw of thermodynamics claims that things always run down –\nentropy increases, to use the technical language. Energy gets used and\nconverted eventually into heat, and cannot be of further service. But\norganisms clearly keep going and seem to defy the law. This would be\nimpossible simply given evolution. The second law rules out the blind\nevolution (meaning change without direct divine guidance) of organisms\nfrom the initial simple blobs up to the complex higher organisms like\nhumans. There must therefore have been a non-natural, miraculous\nintervention to produce functioning life. To which argument the\nresponse of evolutionists is that the second law does indeed say that\nthings are running down, but it does not deny that isolated pockets of\nthe universe might reverse the trend for a short while by using energy\nfrom elsewhere. And this is what happens on planet Earth. We use the\nenergy from the sun to keep evolving for a while. Eventually the sun\nwill go out and life will become extinct. The second law will win\neventually, but not just yet.\n\nSixth, and let us make this the final Creationist objection, it is\nsaid that humans simply cannot be explained by blind law (that is,\nunguided law), especially not by blind evolutionary laws. They must\nhave been created. To which the response is that it is mere arbitrary\nsupposition to believe that humans are that exceptional. In fact,\ntoday the fossil record for humans is strong – we evolved over\nthe past four million years from small creatures of half our height,\nwho had small brains and who walked upright but not as well as we.\nThere is lots of fossil proof of these beings (known as\nAustralopithecus afarensis). Recently, there are other\npertinent discoveries, showing that (as one would expect) there is not\nonly evolution towards modern humans, but branching and sidelines, for\ninstance of the so-called “hobbit,” Homo\nfloresiensis (Falk 2012). Perhaps it is true that we humans are\nspecial, in that (as Christians claim) we uniquely have immortal\nsouls, but this is a religious claim. It is not a claim of science,\nand hence evolution should not be faulted for not explaining souls.\nThere is of course a lot more to be found out about human evolution,\nbut this is the nature of science. No branch of science has all of the\nanswers. The real question is whether the branch of science keeps the\nanswers coming in, and evolutionists claim that this is certainly true\nof their branch of science.\n",
    "section_title": "2. Creation Science",
    "entry_title": "Creationism",
    "hierarchy_title": "Creationism || Creation Science",
    "tokenized_text": [
        "creation",
        "science",
        "creation",
        "science",
        "scope",
        "trial",
        "general",
        "agreement",
        "creationism",
        "movement",
        "peaked",
        "declined",
        "quite",
        "dramatically",
        "quickly",
        "yet",
        "related",
        "antievolution",
        "activity",
        "lasting",
        "effect",
        "textbook",
        "manufacturer",
        "increasingly",
        "took",
        "evolution",
        "darwinism",
        "especially",
        "book",
        "schoolchildren",
        "got",
        "le",
        "le",
        "exposure",
        "idea",
        "anyway",
        "whatever",
        "battle",
        "evolutionist",
        "may",
        "thought",
        "court",
        "popular",
        "opinion",
        "trench",
        "classroom",
        "losing",
        "war",
        "badly",
        "thing",
        "started",
        "move",
        "late",
        "s",
        "thanks",
        "sputnik",
        "russian",
        "effectively",
        "demonstrated",
        "superiority",
        "rocketry",
        "implication",
        "arm",
        "race",
        "cold",
        "war",
        "america",
        "realized",
        "shudder",
        "ineffective",
        "science",
        "training",
        "young",
        "characteristically",
        "country",
        "something",
        "immediate",
        "effective",
        "namely",
        "pouring",
        "money",
        "production",
        "new",
        "science",
        "text",
        "way",
        "class",
        "adoption",
        "federal",
        "government",
        "could",
        "strong",
        "impact",
        "yet",
        "get",
        "around",
        "problem",
        "education",
        "tends",
        "tight",
        "control",
        "individual",
        "state",
        "new",
        "biology",
        "text",
        "gave",
        "full",
        "scope",
        "evolution",
        "darwinism",
        "creationism",
        "controversy",
        "flared",
        "right",
        "child",
        "learning",
        "dreadful",
        "doctrine",
        "school",
        "something",
        "done",
        "ruse",
        "ed",
        "gilkey",
        "fortunately",
        "literalist",
        "help",
        "hand",
        "biblical",
        "scholar",
        "john",
        "c",
        "whitcomb",
        "hydraulic",
        "engineer",
        "henry",
        "m",
        "morris",
        "combined",
        "write",
        "new",
        "bible",
        "movement",
        "genesis",
        "flood",
        "biblical",
        "record",
        "scientific",
        "implication",
        "following",
        "tradition",
        "earlier",
        "writer",
        "especially",
        "seventhday",
        "adventism",
        "argued",
        "every",
        "bit",
        "biblical",
        "story",
        "creation",
        "given",
        "early",
        "chapter",
        "genesis",
        "supported",
        "fully",
        "best",
        "modern",
        "science",
        "six",
        "day",
        "twentyfour",
        "hour",
        "organism",
        "arriving",
        "miraculously",
        "human",
        "last",
        "sometime",
        "thereafter",
        "massive",
        "worldwide",
        "flood",
        "wiped",
        "organism",
        "face",
        "earth",
        "rather",
        "dumped",
        "carcass",
        "mud",
        "water",
        "receded",
        "time",
        "whitcomb",
        "morris",
        "argued",
        "case",
        "evolution",
        "fails",
        "dismally",
        "introduced",
        "revived",
        "number",
        "argument",
        "become",
        "standard",
        "part",
        "creationist",
        "repertoire",
        "evolution",
        "let",
        "u",
        "look",
        "number",
        "argument",
        "together",
        "counterarguments",
        "evolutionist",
        "make",
        "response",
        "first",
        "creationists",
        "argue",
        "best",
        "evolution",
        "theory",
        "fact",
        "theory",
        "never",
        "taken",
        "gospel",
        "one",
        "might",
        "permitted",
        "metaphor",
        "claim",
        "language",
        "evolutionist",
        "show",
        "idea",
        "shaky",
        "ground",
        "charge",
        "evolutionist",
        "respond",
        "confuse",
        "two",
        "sens",
        "word",
        "theory",
        "sometimes",
        "use",
        "mean",
        "body",
        "scientific",
        "law",
        "einstein",
        "theory",
        "relativity",
        "sometimes",
        "use",
        "mean",
        "iffy",
        "hypothesis",
        "theory",
        "kennedy",
        "assassination",
        "two",
        "different",
        "sens",
        "nothing",
        "iffy",
        "copernican",
        "heliocentric",
        "theory",
        "true",
        "fact",
        "evolutionist",
        "argue",
        "case",
        "evolution",
        "talking",
        "theory",
        "evolution",
        "one",
        "talking",
        "body",
        "law",
        "particular",
        "one",
        "following",
        "idea",
        "charles",
        "darwin",
        "one",
        "arguing",
        "population",
        "pressure",
        "lead",
        "struggle",
        "existence",
        "entail",
        "natural",
        "selection",
        "favored",
        "form",
        "evolution",
        "shared",
        "descent",
        "end",
        "result",
        "body",
        "general",
        "statement",
        "life",
        "since",
        "s",
        "given",
        "formal",
        "version",
        "using",
        "mathematics",
        "deductive",
        "inference",
        "step",
        "word",
        "body",
        "law",
        "hence",
        "theory",
        "first",
        "sense",
        "given",
        "implication",
        "theory",
        "iffy",
        "second",
        "sense",
        "given",
        "necessarily",
        "talking",
        "something",
        "inherently",
        "unreliable",
        "course",
        "going",
        "addition",
        "revision",
        "instance",
        "possibility",
        "much",
        "greater",
        "hybridization",
        "someone",
        "like",
        "darwin",
        "realized",
        "another",
        "matter",
        "quammen",
        "second",
        "creationists",
        "like",
        "whitcomb",
        "morris",
        "claim",
        "central",
        "mechanism",
        "modern",
        "evolutionary",
        "thought",
        "darwin",
        "natural",
        "selection",
        "bogus",
        "argue",
        "genuine",
        "claim",
        "real",
        "world",
        "merely",
        "truism",
        "philosopher",
        "call",
        "tautology",
        "something",
        "true",
        "meaning",
        "word",
        "like",
        "bachelor",
        "unmarried",
        "case",
        "natural",
        "selection",
        "creationists",
        "point",
        "alternative",
        "name",
        "mechanism",
        "survival",
        "fittest",
        "ask",
        "fittest",
        "reply",
        "survive",
        "hence",
        "natural",
        "selection",
        "reduces",
        "tautology",
        "survive",
        "survive",
        "real",
        "claim",
        "science",
        "evolutionist",
        "respond",
        "sleight",
        "hand",
        "showing",
        "ignorance",
        "genuinely",
        "stake",
        "natural",
        "selection",
        "truly",
        "real",
        "talk",
        "organism",
        "actually",
        "surviving",
        "reproducing",
        "life",
        "struggle",
        "others",
        "failing",
        "wouldbe",
        "ancestor",
        "lived",
        "baby",
        "others",
        "differential",
        "reproduction",
        "certainly",
        "mere",
        "truism",
        "could",
        "everyone",
        "number",
        "child",
        "could",
        "also",
        "difference",
        "overall",
        "successful",
        "unsuccessful",
        "denied",
        "natural",
        "selection",
        "say",
        "something",
        "fitter",
        "fittest",
        "say",
        "certain",
        "characteristic",
        "biologist",
        "call",
        "adaptation",
        "organism",
        "average",
        "one",
        "expects",
        "fitter",
        "succeed",
        "guarantee",
        "must",
        "always",
        "happen",
        "earthquake",
        "could",
        "wipe",
        "everyone",
        "fit",
        "unfit",
        "discussing",
        "third",
        "argument",
        "creationists",
        "level",
        "evolution",
        "worth",
        "pausing",
        "second",
        "one",
        "professional",
        "evolutionist",
        "argue",
        "sometimes",
        "natural",
        "selection",
        "significant",
        "causal",
        "factor",
        "sense",
        "false",
        "selection",
        "something",
        "definition",
        "always",
        "reason",
        "lasting",
        "change",
        "fittest",
        "always",
        "win",
        "tautology",
        "s",
        "american",
        "population",
        "geneticist",
        "sewall",
        "wright",
        "devised",
        "hypothesis",
        "genetic",
        "drift",
        "arguing",
        "sometimes",
        "mere",
        "chance",
        "lead",
        "effect",
        "overriding",
        "force",
        "selection",
        "wright",
        "although",
        "first",
        "embraced",
        "enthusiastically",
        "dobzhansky",
        "soon",
        "became",
        "clear",
        "gross",
        "physical",
        "phenotypic",
        "level",
        "minor",
        "coyne",
        "barton",
        "turelli",
        "however",
        "level",
        "gene",
        "genotype",
        "still",
        "thought",
        "important",
        "indeed",
        "powerful",
        "tool",
        "discovering",
        "exact",
        "date",
        "key",
        "evolutionary",
        "event",
        "especially",
        "involving",
        "speciation",
        "ayala",
        "moreover",
        "shall",
        "see",
        "moment",
        "somewhat",
        "paradoxically",
        "creationism",
        "evolved",
        "increasingly",
        "virtue",
        "selection",
        "working",
        "microevolutionary",
        "level",
        "become",
        "apparent",
        "thus",
        "one",
        "explain",
        "diversity",
        "life",
        "earth",
        "evolved",
        "since",
        "leaving",
        "ark",
        "contained",
        "generic",
        "kind",
        "supposed",
        "fault",
        "better",
        "discussion",
        "natural",
        "selection",
        "creationist",
        "museum",
        "kentucky",
        "field",
        "museum",
        "chicago",
        "mile",
        "north",
        "bar",
        "macroevolution",
        "remains",
        "absolute",
        "third",
        "creationists",
        "point",
        "modern",
        "evolutionary",
        "theory",
        "asserts",
        "raw",
        "building",
        "block",
        "evolution",
        "genetic",
        "mutation",
        "random",
        "mean",
        "minimal",
        "chance",
        "evolution",
        "producing",
        "something",
        "work",
        "well",
        "efficiently",
        "organism",
        "functioning",
        "part",
        "place",
        "monkey",
        "typing",
        "letter",
        "randomly",
        "could",
        "never",
        "million",
        "year",
        "billion",
        "billion",
        "billion",
        "year",
        "type",
        "work",
        "shakespeare",
        "creationists",
        "say",
        "true",
        "evolution",
        "organism",
        "given",
        "randomness",
        "mutation",
        "evolutionist",
        "reply",
        "may",
        "well",
        "true",
        "monkey",
        "case",
        "evolution",
        "thing",
        "rather",
        "different",
        "mutation",
        "work",
        "kept",
        "built",
        "upon",
        "next",
        "good",
        "mutation",
        "come",
        "along",
        "shrink",
        "considerably",
        "odds",
        "evolution",
        "producing",
        "organism",
        "even",
        "though",
        "appearance",
        "mutation",
        "random",
        "suppose",
        "take",
        "one",
        "phrase",
        "shakespeare",
        "friend",
        "roman",
        "countryman",
        "lend",
        "ears",
        "get",
        "every",
        "letter",
        "right",
        "straight",
        "would",
        "huge",
        "timespan",
        "twentysix",
        "number",
        "letter",
        "include",
        "capital",
        "gap",
        "punctuation",
        "power",
        "number",
        "space",
        "allowed",
        "keep",
        "f",
        "soon",
        "get",
        "go",
        "try",
        "r",
        "longer",
        "going",
        "back",
        "square",
        "one",
        "time",
        "suddenly",
        "task",
        "becomes",
        "much",
        "manageable",
        "dawkins",
        "good",
        "discussion",
        "issue",
        "incidentally",
        "add",
        "evolutionist",
        "one",
        "must",
        "take",
        "care",
        "speaking",
        "mutation",
        "random",
        "implication",
        "mutation",
        "uncaused",
        "something",
        "else",
        "rather",
        "peculiar",
        "rather",
        "meant",
        "mutation",
        "occur",
        "according",
        "need",
        "suppose",
        "new",
        "disease",
        "appears",
        "evolutionary",
        "theory",
        "guarantee",
        "new",
        "lifeprotecting",
        "mutation",
        "occur",
        "order",
        "fourth",
        "litany",
        "creationist",
        "complaint",
        "perennial",
        "favourite",
        "based",
        "paleontology",
        "creationists",
        "agree",
        "fossil",
        "record",
        "sequential",
        "fish",
        "primate",
        "moving",
        "upwards",
        "argue",
        "result",
        "sorting",
        "effect",
        "flood",
        "primate",
        "dinosaur",
        "example",
        "primate",
        "agile",
        "moved",
        "mountain",
        "caught",
        "drowning",
        "also",
        "argue",
        "however",
        "fossil",
        "record",
        "ought",
        "continuous",
        "evolution",
        "occurred",
        "real",
        "life",
        "many",
        "gap",
        "different",
        "form",
        "jump",
        "one",
        "kind",
        "organism",
        "another",
        "ape",
        "human",
        "would",
        "case",
        "point",
        "spell",
        "creation",
        "evolution",
        "response",
        "come",
        "one",
        "hand",
        "one",
        "expects",
        "gap",
        "fossilization",
        "uncommon",
        "occurrence",
        "dead",
        "body",
        "get",
        "eaten",
        "straight",
        "away",
        "rot",
        "wonder",
        "hand",
        "argue",
        "evolutionist",
        "record",
        "gappy",
        "lot",
        "good",
        "sequence",
        "line",
        "fossil",
        "little",
        "difference",
        "adjacent",
        "form",
        "amphibian",
        "mammal",
        "example",
        "detail",
        "evolution",
        "horse",
        "eohippus",
        "five",
        "toe",
        "modern",
        "horse",
        "one",
        "toe",
        "moreover",
        "refutation",
        "creationism",
        "find",
        "fossil",
        "order",
        "might",
        "expect",
        "flood",
        "creationists",
        "sometimes",
        "claim",
        "otherwise",
        "human",
        "never",
        "found",
        "dinosaur",
        "brute",
        "old",
        "expired",
        "long",
        "appeared",
        "scene",
        "fossil",
        "record",
        "confirms",
        "fifth",
        "creationists",
        "argue",
        "physic",
        "disproves",
        "evolution",
        "second",
        "law",
        "thermodynamics",
        "claim",
        "thing",
        "always",
        "run",
        "entropy",
        "increase",
        "use",
        "technical",
        "language",
        "energy",
        "get",
        "used",
        "converted",
        "eventually",
        "heat",
        "service",
        "organism",
        "clearly",
        "keep",
        "going",
        "seem",
        "defy",
        "law",
        "would",
        "impossible",
        "simply",
        "given",
        "evolution",
        "second",
        "law",
        "rule",
        "blind",
        "evolution",
        "meaning",
        "change",
        "without",
        "direct",
        "divine",
        "guidance",
        "organism",
        "initial",
        "simple",
        "blob",
        "complex",
        "higher",
        "organism",
        "like",
        "human",
        "must",
        "therefore",
        "nonnatural",
        "miraculous",
        "intervention",
        "produce",
        "functioning",
        "life",
        "argument",
        "response",
        "evolutionist",
        "second",
        "law",
        "indeed",
        "say",
        "thing",
        "running",
        "deny",
        "isolated",
        "pocket",
        "universe",
        "might",
        "reverse",
        "trend",
        "short",
        "using",
        "energy",
        "elsewhere",
        "happens",
        "planet",
        "earth",
        "use",
        "energy",
        "sun",
        "keep",
        "evolving",
        "eventually",
        "sun",
        "go",
        "life",
        "become",
        "extinct",
        "second",
        "law",
        "win",
        "eventually",
        "yet",
        "sixth",
        "let",
        "u",
        "make",
        "final",
        "creationist",
        "objection",
        "said",
        "human",
        "simply",
        "explained",
        "blind",
        "law",
        "unguided",
        "law",
        "especially",
        "blind",
        "evolutionary",
        "law",
        "must",
        "created",
        "response",
        "mere",
        "arbitrary",
        "supposition",
        "believe",
        "human",
        "exceptional",
        "fact",
        "today",
        "fossil",
        "record",
        "human",
        "strong",
        "evolved",
        "past",
        "four",
        "million",
        "year",
        "small",
        "creature",
        "half",
        "height",
        "small",
        "brain",
        "walked",
        "upright",
        "well",
        "lot",
        "fossil",
        "proof",
        "being",
        "known",
        "australopithecus",
        "afarensis",
        "recently",
        "pertinent",
        "discovery",
        "showing",
        "one",
        "would",
        "expect",
        "evolution",
        "towards",
        "modern",
        "human",
        "branching",
        "sideline",
        "instance",
        "socalled",
        "hobbit",
        "homo",
        "floresiensis",
        "falk",
        "perhaps",
        "true",
        "human",
        "special",
        "christian",
        "claim",
        "uniquely",
        "immortal",
        "soul",
        "religious",
        "claim",
        "claim",
        "science",
        "hence",
        "evolution",
        "faulted",
        "explaining",
        "soul",
        "course",
        "lot",
        "found",
        "human",
        "evolution",
        "nature",
        "science",
        "branch",
        "science",
        "answer",
        "real",
        "question",
        "whether",
        "branch",
        "science",
        "keep",
        "answer",
        "coming",
        "evolutionist",
        "claim",
        "certainly",
        "true",
        "branch",
        "science"
    ]
}