{
    "main_text": "The question of choice and free will\n5. The question of choice and free will\n\n\nCrescas devotes the sixth part of the second essay to the question of\nfree will.[24]\nCrescas begins this sixth part by explaining why the lack of choice\ncan be so problematic for pious Jews: The Torah is based on the\ncommandments of God to man, yet these commandments do not seem to make\nany sense if humans do not have control over their actions. After all,\nwhy should God tell humans what to do if He knows that they have to\nbreak the law? It would seem that a robust freedom of choice is\nessential to maintaining the significance of God’s commandments.\nNevertheless, the pious Crescas does not accept this reasoning. To\nrefute the above supposition while maintaining the relevance of the\ncommandments, Crescas uses the first four chapters of Part Six to\ndevelop an uncompromising determinism that lives in harmony with human\nchoice and a system of reward and punishment that are restricted to\nthe realm of personal feelings and self-judgment. Ironically, in\ndeveloping his theory of choice, Crescas quotes frequently from\nAbner’s book Ofrenda de Zelos (without citing him by\nname).\n\n\nIt is worth examining how Crescas develops his position in more\ndetail. After introducing the issue of free choice vis a vis the Torah,\nCrescas in the first two chapters describes the different arguments\n(both rational and theological) for and against freedom of choice.\nCrescas then reaches the conclusion that the decision making process is\nfundamentally deterministic, though people voluntarily choose the\nattitudes and feelings behind their own actions. For example, if we\nisolate a person hesitating between two options from the causes that\ninfluence him, such as his education and the influence of society, then\nwe might think that this person truly chooses to do either of the two\noptions. But upon closer analysis, if we take in to account all of the\ncauses that influence his will, we reach the conclusion that these\ncauses determine his will to choose only one of the two options. In\nCrescas’s opinion, humans are like bronze. A piece of bronze can\nbe made into a lot of different things: a ball, a sword, etc. However,\nsomeone (i.e. an external cause) fashions the bronze into one of these\noptions and so determines the present form of the bronze. The same is\ntrue of people: they themselves can choose between different possible\noptions, but their relation to external causes determines their\nchoices. We can see how Crescas views strong determinism through the\nway he likens human functioning to an inanimate object like bronze. It\nis important to note too that Crescas defines the will of man as an\naccord between the attractive force and the imagination — two\nforces that are common to humans and beasts.\n\n\nContinuing into the middle chapters of Part Six, Crescas similarly\nexplains the notion of possibility and accident. Things are only\npossible in their relation to themselves.\n\n\nThis deterministic description of the world (based on rational\narguments) resolves the theological problem of the contradiction\nbetween the free will of man and the foreknowledge of God. In\nCrescas’s opinion, free will, in the sense of an originative cause\nthat is itself uncaused, to decide and act does not really exist. God\nis the first cause and knows all the laws of the world. Therefore, He\nknows the entirety of that which He has determined.\n\n\nBut this deterministic description leads to two theological\nproblems:\n\nwhy God sent commandments to people that do not really have the\nchoice to observe or violate them\nhow people can receive reward and punishment for actions that they\ncannot control\n\nCrescas solves the second problem by saying that the forbidden\nthings are naturally bad. The punishment of the sinner is not a\nspecial act of divine providence to punish him, but rather the natural\nconsequence of the sinner’s bad actions. At this point we can\nsolve the first problem: according to Crescas, the goal of the Torah\nis to influence people to do right. The only way to influence someone\nto do something is to give him enough causes to do it. The Torah is\nonly another cause that tries to influence humans to do good. It is\nalso the reason why God punishes only the actions that are under\nthe control of one’s choice and the will of humans. The aim of the\nretribution is to guide people towards doing what is right. According\nto this, aiming to punish other actions that are not under the\ncontrol of humans will be inappropriate.\n\n\nRegarding the two latter chapters of Part Six, my opinion differs\nfrom that of most scholars. In these chapters Crescas tries to answer\nthe question of whether there is a difference between people that sin\nhappily and those who are forced to sin and feel sad about doing their\nevil actions. Crescas also addresses the question of the obligation of\nvarious beliefs. These chapters are not based on the determinist book\nof Abner, and Ravitzky thinks that they are anterior to the other\nchapters and exist almost verbatim in the Passover\n sermon.[25]\n\n\nSome scholars understand these chapters as a departure from the deterministic\nopinion of Crescas.[26]\nAccording to their interpretation, Crescas describes the true\nconscience of man, wherein the inner self can observe the actions of\nthe deterministic external person and either be happy or unhappy with\nhis or her actions. If the external person does something bad and the\ninner self is unhappy, it is not truly a sin because the true person\ndoes not want to sin. Instead, a deterministic process has coerced the\nexternal person into performing the act of sin against his conscience\nand his true will. According to this interpretation, the inner will of\nhumans is under their control, but the regular will that decides their\nactions is the conclusion of a deterministic psychological\nprocess. Such is the usual interpretation, and in and of itself this\ninterpretation is accurate.  However other scholars understand these\nchapters as Crescas is that Crescas is not concerned here with finding\na morsel of free choice in a highly deterministic world, but is rather\naddressing a very different problem: He only wants to answer the\nquestion of external obligation and the parallel issue of\nculpability. Back in the fifth chapter, Crescas had described\npunishment as a natural consequence of sin. After this rational\nassertion, it would seem that there is no logical difference between a\nvoluntary and involuntary sin in terms of\npunishment.[27]\nHowever, such a lack of moral distinction is unacceptable to\nCrescas. Therefore, in these chapters he wants to tell us, indeed\nreassure us, that an externally forced man doesn’t have any punishment\nfor his sin (it is for certain that he is speaking to and about the\nJews that were forcibly converted in 1391). According to these\nscholars in these chapters Crescas is not speaking about how man is\nultimately distinct and free of determinist processes of the soul, but\nrather about how man through this determinist process wants to do\ngood, yet due to some cause, external to the determinist psychologist\nprocesses, is forced to sin, and hence is not culpable — if\nindeed there was such a negative external cause that led to his\nsinning. Crescas thinks that the retribution of humans is a function\nof the interior psychological process of choice. If this process\nexists the man can be reattributed for his act. However if this\nprocess does not exist there is no retribution. The fact that choice\nand will are entirely deterministic in the view of Crescas has nothing\nto do with retribution. According to this opinion Crescas thinks that\nthe use of will and choice are the criteria for retribution but are\nnot free at all.\n\n\nIt is probable that the major sources of Crescas‘s determinism\nare the writings of Muslim thinkers whom he interpreted according to\nthe understanding of the apostate Abner of Burgos. This deterministic\nunderstanding of the world no doubt ultimately influenced Spinoza’s\nopinion.\n\n\nRegarding the question of\n astrology,[28]\nCrescas holds a very moderate opinion: On one\nhand, the stars have a general influence on humanity, but on the other\nhand, it is quite easy to free ourselves from their influences. Human\nchoice and divine providence are both superior to the influence of the\nstars.\n",
    "section_title": "5. The question of choice and free will",
    "entry_title": "Hasdai Crescas",
    "hierarchy_title": "Hasdai Crescas || The question of choice and free will",
    "tokenized_text": [
        "question",
        "choice",
        "free",
        "question",
        "choice",
        "free",
        "crescas",
        "devotes",
        "sixth",
        "part",
        "second",
        "essay",
        "question",
        "free",
        "crescas",
        "begin",
        "sixth",
        "part",
        "explaining",
        "lack",
        "choice",
        "problematic",
        "pious",
        "jew",
        "torah",
        "based",
        "commandment",
        "god",
        "man",
        "yet",
        "commandment",
        "seem",
        "make",
        "sense",
        "human",
        "control",
        "action",
        "god",
        "tell",
        "human",
        "know",
        "break",
        "law",
        "would",
        "seem",
        "robust",
        "freedom",
        "choice",
        "essential",
        "maintaining",
        "significance",
        "god",
        "commandment",
        "nevertheless",
        "pious",
        "crescas",
        "accept",
        "reasoning",
        "refute",
        "supposition",
        "maintaining",
        "relevance",
        "commandment",
        "crescas",
        "us",
        "first",
        "four",
        "chapter",
        "part",
        "six",
        "develop",
        "uncompromising",
        "determinism",
        "life",
        "harmony",
        "human",
        "choice",
        "system",
        "reward",
        "punishment",
        "restricted",
        "realm",
        "personal",
        "feeling",
        "selfjudgment",
        "ironically",
        "developing",
        "theory",
        "choice",
        "crescas",
        "quote",
        "frequently",
        "abner",
        "book",
        "ofrenda",
        "de",
        "zelos",
        "without",
        "citing",
        "name",
        "worth",
        "examining",
        "crescas",
        "develops",
        "position",
        "detail",
        "introducing",
        "issue",
        "free",
        "choice",
        "vi",
        "vi",
        "torah",
        "crescas",
        "first",
        "two",
        "chapter",
        "describes",
        "different",
        "argument",
        "rational",
        "theological",
        "freedom",
        "choice",
        "crescas",
        "reach",
        "conclusion",
        "decision",
        "making",
        "process",
        "fundamentally",
        "deterministic",
        "though",
        "people",
        "voluntarily",
        "choose",
        "attitude",
        "feeling",
        "behind",
        "action",
        "example",
        "isolate",
        "person",
        "hesitating",
        "two",
        "option",
        "cause",
        "influence",
        "education",
        "influence",
        "society",
        "might",
        "think",
        "person",
        "truly",
        "chooses",
        "either",
        "two",
        "option",
        "upon",
        "closer",
        "analysis",
        "take",
        "account",
        "cause",
        "influence",
        "reach",
        "conclusion",
        "cause",
        "determine",
        "choose",
        "one",
        "two",
        "option",
        "crescas",
        "opinion",
        "human",
        "like",
        "bronze",
        "piece",
        "bronze",
        "made",
        "lot",
        "different",
        "thing",
        "ball",
        "sword",
        "etc",
        "however",
        "someone",
        "ie",
        "external",
        "cause",
        "fashion",
        "bronze",
        "one",
        "option",
        "determines",
        "present",
        "form",
        "bronze",
        "true",
        "people",
        "choose",
        "different",
        "possible",
        "option",
        "relation",
        "external",
        "cause",
        "determines",
        "choice",
        "see",
        "crescas",
        "view",
        "strong",
        "determinism",
        "way",
        "likens",
        "human",
        "functioning",
        "inanimate",
        "object",
        "like",
        "bronze",
        "important",
        "note",
        "crescas",
        "defines",
        "man",
        "accord",
        "attractive",
        "force",
        "imagination",
        "two",
        "force",
        "common",
        "human",
        "beast",
        "continuing",
        "middle",
        "chapter",
        "part",
        "six",
        "crescas",
        "similarly",
        "explains",
        "notion",
        "possibility",
        "accident",
        "thing",
        "possible",
        "relation",
        "deterministic",
        "description",
        "world",
        "based",
        "rational",
        "argument",
        "resolve",
        "theological",
        "problem",
        "contradiction",
        "free",
        "man",
        "foreknowledge",
        "god",
        "crescas",
        "opinion",
        "free",
        "sense",
        "originative",
        "cause",
        "uncaused",
        "decide",
        "act",
        "really",
        "exist",
        "god",
        "first",
        "cause",
        "know",
        "law",
        "world",
        "therefore",
        "know",
        "entirety",
        "determined",
        "deterministic",
        "description",
        "lead",
        "two",
        "theological",
        "problem",
        "god",
        "sent",
        "commandment",
        "people",
        "really",
        "choice",
        "observe",
        "violate",
        "people",
        "receive",
        "reward",
        "punishment",
        "action",
        "control",
        "crescas",
        "solves",
        "second",
        "problem",
        "saying",
        "forbidden",
        "thing",
        "naturally",
        "bad",
        "punishment",
        "sinner",
        "special",
        "act",
        "divine",
        "providence",
        "punish",
        "rather",
        "natural",
        "consequence",
        "sinner",
        "bad",
        "action",
        "point",
        "solve",
        "first",
        "problem",
        "according",
        "crescas",
        "goal",
        "torah",
        "influence",
        "people",
        "right",
        "way",
        "influence",
        "someone",
        "something",
        "give",
        "enough",
        "cause",
        "torah",
        "another",
        "cause",
        "try",
        "influence",
        "human",
        "good",
        "also",
        "reason",
        "god",
        "punishes",
        "action",
        "control",
        "one",
        "choice",
        "human",
        "aim",
        "retribution",
        "guide",
        "people",
        "towards",
        "right",
        "according",
        "aiming",
        "punish",
        "action",
        "control",
        "human",
        "inappropriate",
        "regarding",
        "two",
        "latter",
        "chapter",
        "part",
        "six",
        "opinion",
        "differs",
        "scholar",
        "chapter",
        "crescas",
        "try",
        "answer",
        "question",
        "whether",
        "difference",
        "people",
        "sin",
        "happily",
        "forced",
        "sin",
        "feel",
        "sad",
        "evil",
        "action",
        "crescas",
        "also",
        "address",
        "question",
        "obligation",
        "various",
        "belief",
        "chapter",
        "based",
        "determinist",
        "book",
        "abner",
        "ravitzky",
        "think",
        "anterior",
        "chapter",
        "exist",
        "almost",
        "verbatim",
        "passover",
        "sermon",
        "scholar",
        "understand",
        "chapter",
        "departure",
        "deterministic",
        "opinion",
        "crescas",
        "according",
        "interpretation",
        "crescas",
        "describes",
        "true",
        "conscience",
        "man",
        "wherein",
        "inner",
        "self",
        "observe",
        "action",
        "deterministic",
        "external",
        "person",
        "either",
        "happy",
        "unhappy",
        "action",
        "external",
        "person",
        "something",
        "bad",
        "inner",
        "self",
        "unhappy",
        "truly",
        "sin",
        "true",
        "person",
        "want",
        "sin",
        "instead",
        "deterministic",
        "process",
        "coerced",
        "external",
        "person",
        "performing",
        "act",
        "sin",
        "conscience",
        "true",
        "according",
        "interpretation",
        "inner",
        "human",
        "control",
        "regular",
        "decides",
        "action",
        "conclusion",
        "deterministic",
        "psychological",
        "process",
        "usual",
        "interpretation",
        "interpretation",
        "accurate",
        "however",
        "scholar",
        "understand",
        "chapter",
        "crescas",
        "crescas",
        "concerned",
        "finding",
        "morsel",
        "free",
        "choice",
        "highly",
        "deterministic",
        "world",
        "rather",
        "addressing",
        "different",
        "problem",
        "want",
        "answer",
        "question",
        "external",
        "obligation",
        "parallel",
        "issue",
        "culpability",
        "back",
        "fifth",
        "chapter",
        "crescas",
        "described",
        "punishment",
        "natural",
        "consequence",
        "sin",
        "rational",
        "assertion",
        "would",
        "seem",
        "logical",
        "difference",
        "voluntary",
        "involuntary",
        "sin",
        "term",
        "punishment",
        "however",
        "lack",
        "moral",
        "distinction",
        "unacceptable",
        "crescas",
        "therefore",
        "chapter",
        "want",
        "tell",
        "u",
        "indeed",
        "reassure",
        "u",
        "externally",
        "forced",
        "man",
        "punishment",
        "sin",
        "certain",
        "speaking",
        "jew",
        "forcibly",
        "converted",
        "according",
        "scholar",
        "chapter",
        "crescas",
        "speaking",
        "man",
        "ultimately",
        "distinct",
        "free",
        "determinist",
        "process",
        "soul",
        "rather",
        "man",
        "determinist",
        "process",
        "want",
        "good",
        "yet",
        "due",
        "cause",
        "external",
        "determinist",
        "psychologist",
        "process",
        "forced",
        "sin",
        "hence",
        "culpable",
        "indeed",
        "negative",
        "external",
        "cause",
        "led",
        "sinning",
        "crescas",
        "think",
        "retribution",
        "human",
        "function",
        "interior",
        "psychological",
        "process",
        "choice",
        "process",
        "exists",
        "man",
        "reattributed",
        "act",
        "however",
        "process",
        "exist",
        "retribution",
        "fact",
        "choice",
        "entirely",
        "deterministic",
        "view",
        "crescas",
        "nothing",
        "retribution",
        "according",
        "opinion",
        "crescas",
        "think",
        "use",
        "choice",
        "criterion",
        "retribution",
        "free",
        "probable",
        "major",
        "source",
        "crescas",
        "determinism",
        "writing",
        "muslim",
        "thinker",
        "interpreted",
        "according",
        "understanding",
        "apostate",
        "abner",
        "burgos",
        "deterministic",
        "understanding",
        "world",
        "doubt",
        "ultimately",
        "influenced",
        "spinoza",
        "opinion",
        "regarding",
        "question",
        "astrology",
        "crescas",
        "hold",
        "moderate",
        "opinion",
        "one",
        "hand",
        "star",
        "general",
        "influence",
        "humanity",
        "hand",
        "quite",
        "easy",
        "free",
        "influence",
        "human",
        "choice",
        "divine",
        "providence",
        "superior",
        "influence",
        "star"
    ]
}