{
    "main_text": "Critical Thinking Abilities\n9. Critical Thinking Abilities\n\nSome theorists postulate skills, i.e., acquired abilities, as\noperative in critical thinking. It is not obvious, however, that a\ngood mental act is the exercise of a generic acquired skill. Inferring\nan expected time of arrival, as in\n Transit,\n has some generic components but also uses non-generic subject-matter\nknowledge. Bailin et al. (1999a) argue against viewing critical\nthinking skills as generic and discrete, on the ground that skilled\nperformance at a critical thinking task cannot be separated from\nknowledge of concepts and from domain-specific principles of good\nthinking. Talk of skills, they concede, is unproblematic if it means\nmerely that a person with critical thinking skills is capable of\nintelligent performance.\n\nDespite such scepticism, theorists of critical thinking have listed as\ngeneral contributors to critical thinking what they variously call\nabilities (Glaser 1941; Ennis 1962, 1991), skills (Facione 1990a;\nHalpern 1998) or competencies (Fisher & Scriven 1997).\nAmalgamating these lists would produce a confusing and chaotic\ncornucopia of more than 50 possible educational objectives, with only\npartial overlap among them. It makes sense instead to try to\nunderstand the reasons for the multiplicity and diversity, and to make\na selection according to one’s own reasons for singling out\nabilities to be developed in a critical thinking curriculum. Two\nreasons for diversity among lists of critical thinking abilities are\nthe underlying conception of critical thinking and the envisaged\neducational level. Appraisal-only conceptions, for example, involve a\ndifferent suite of abilities than constructive-only conceptions. Some\nlists, such as those in (Glaser 1941), are put forward as educational\nobjectives for secondary school students, whereas others are proposed\nas objectives for college students (e.g., Facione 1990a).\n\nThe abilities described in the remaining paragraphs of this section\nemerge from reflection on the general abilities needed to do well the\nthinking activities identified in\n section 6\n as components of the critical thinking process described in\n section 5.\n The derivation of each collection of abilities is accompanied by\ncitation of sources that list such abilities and of standardized tests\nthat claim to test them.\n\nObservational abilities: Careful and accurate observation\nsometimes requires specialist expertise and practice, as in the case\nof observing birds and observing accident scenes. However, there are\ngeneral abilities of noticing what one’s senses are picking up\nfrom one’s environment and of being able to articulate clearly\nand accurately to oneself and others what one has observed. It helps\nin exercising them to be able to recognize and take into account\nfactors that make one’s observation less trustworthy, such as\nprior framing of the situation, inadequate time, deficient senses,\npoor observation conditions, and the like. It helps as well to be\nskilled at taking steps to make one’s observation more\ntrustworthy, such as moving closer to get a better look, measuring\nsomething three times and taking the average, and checking what one\nthinks one is observing with someone else who is in a good position to\nobserve it. It also helps to be skilled at recognizing respects in\nwhich one’s report of one’s observation involves inference\nrather than direct observation, so that one can then consider whether\nthe inference is justified. These abilities come into play as well\nwhen one thinks about whether and with what degree of confidence to\naccept an observation report, for example in the study of history or\nin a criminal investigation or in assessing news reports.\nObservational abilities show up in some lists of critical thinking\nabilities (Ennis 1962: 90; Facione 1990a: 16; Ennis 1991: 9). There\nare items testing a person’s ability to judge the credibility of\nobservation reports in the Cornell Critical Thinking Tests, Levels X\nand Z (Ennis & Millman 1971; Ennis, Millman, & Tomko 1985,\n2005). Norris and King (1983, 1985, 1990a, 1990b) is a test of ability\nto appraise observation reports.\n\nEmotional abilities: The emotions that drive a critical\nthinking process are perplexity or puzzlement, a wish to resolve it,\nand satisfaction at achieving the desired resolution. Children\nexperience these emotions at an early age, without being trained to do\nso. Education that takes critical thinking as a goal needs only to\nchannel these emotions and to make sure not to stifle them.\nCollaborative critical thinking benefits from ability to recognize\none’s own and others’ emotional commitments and\nreactions.\n\nQuestioning abilities: A critical thinking process needs\ntransformation of an inchoate sense of perplexity into a clear\nquestion. Formulating a question well requires not building in\nquestionable assumptions, not prejudging the issue, and using language\nthat in context is unambiguous and precise enough (Ennis 1962: 97;\n1991: 9).\n\nImaginative abilities: Thinking directed at finding the\ncorrect causal explanation of a general phenomenon or particular event\nrequires an ability to imagine possible explanations. Thinking about\nwhat policy or plan of action to adopt requires generation of options\nand consideration of possible consequences of each option. Domain\nknowledge is required for such creative activity, but a general\nability to imagine alternatives is helpful and can be nurtured so as\nto become easier, quicker, more extensive, and deeper (Dewey 1910:\n34–39; 1933: 40–47). Facione (1990a) and Halpern (1998)\ninclude the ability to imagine alternatives as a critical thinking\nability.\n\nInferential abilities: The ability to draw conclusions from\ngiven information, and to recognize with what degree of certainty\none’s own or others’ conclusions follow, is universally\nrecognized as a general critical thinking ability. All 11 examples in\n section 2\n of this article include inferences, some from hypotheses or options\n(as in\n Transit,\n Ferryboat and\n Disorder),\n others from something observed (as in\n Weather\n and\n Rash).\n None of these inferences is formally valid. Rather, they are licensed\nby general, sometimes qualified substantive rules of inference\n(Toulmin 1958) that rest on domain knowledge—that a bus trip\ntakes about the same time in each direction, that the terminal of a\nwireless telegraph would be located on the highest possible place,\nthat sudden cooling is often followed by rain, that an allergic\nreaction to a sulfa drug generally shows up soon after one starts\ntaking it. It is a matter of controversy to what extent the\nspecialized ability to deduce conclusions from premisses using formal\nrules of inference is needed for critical thinking. Dewey (1933)\nlocates logical forms in setting out the products of reflection rather\nthan in the process of reflection. Ennis (1981a), on the other hand,\nmaintains that a liberally-educated person should have the following\nabilities: to translate natural-language statements into statements\nusing the standard logical operators, to use appropriately the\nlanguage of necessary and sufficient conditions, to deal with argument\nforms and arguments containing symbols, to determine whether in virtue\nof an argument’s form its conclusion follows necessarily from\nits premisses, to reason with logically complex propositions, and to\napply the rules and procedures of deductive logic. Inferential\nabilities are recognized as critical thinking abilities by Glaser\n(1941: 6), Facione (1990a: 9), Ennis (1991: 9), Fisher & Scriven\n(1997: 99, 111), and Halpern (1998: 452). Items testing inferential\nabilities constitute two of the five subtests of the Watson Glaser\nCritical Thinking Appraisal (Watson & Glaser 1980a, 1980b, 1994),\ntwo of the four sections in the Cornell Critical Thinking Test Level X\n(Ennis & Millman 1971; Ennis, Millman, & Tomko 1985, 2005),\nthree of the seven sections in the Cornell Critical Thinking Test\nLevel Z (Ennis & Millman 1971; Ennis, Millman, & Tomko 1985,\n2005), 11 of the 34 items on Forms A and B of the California Critical\nThinking Skills Test (Facione 1990b, 1992), and a high but variable\nproportion of the 25 selected-response questions in the Collegiate\nLearning Assessment (Council for Aid to Education 2017).\n\nExperimenting abilities: Knowing how to design and execute an\nexperiment is important not just in scientific research but also in\neveryday life, as in\n Rash.\n Dewey devoted a whole chapter of his How We Think (1910:\n145–156; 1933: 190–202) to the superiority of\nexperimentation over observation in advancing knowledge. Experimenting\nabilities come into play at one remove in appraising reports of\nscientific studies. Skill in designing and executing experiments\nincludes the acknowledged abilities to appraise evidence (Glaser 1941:\n6), to carry out experiments and to apply appropriate statistical\ninference techniques (Facione 1990a: 9), to judge inductions to an\nexplanatory hypothesis (Ennis 1991: 9), and to recognize the need for\nan adequately large sample size (Halpern 1998). The Cornell Critical\nThinking Test Level Z (Ennis & Millman 1971; Ennis, Millman, &\nTomko 1985, 2005) includes four items (out of 52) on experimental\ndesign. The Collegiate Learning Assessment (Council for Aid to\nEducation 2017) makes room for appraisal of study design in both its\nperformance task and its selected-response questions.\n\nConsulting abilities: Skill at consulting sources of\ninformation comes into play when one seeks information to help resolve\na problem, as in\n Candidate.\n Ability to find and appraise information includes ability to gather\nand marshal pertinent information (Glaser 1941: 6), to judge whether a\nstatement made by an alleged authority is acceptable (Ennis 1962: 84),\nto plan a search for desired information (Facione 1990a: 9), and to\njudge the credibility of a source (Ennis 1991: 9). Ability to judge\nthe credibility of statements is tested by 24 items (out of 76) in the\nCornell Critical Thinking Test Level X (Ennis & Millman 1971;\nEnnis, Millman, & Tomko 1985, 2005) and by four items (out of 52)\nin the Cornell Critical Thinking Test Level Z (Ennis & Millman\n1971; Ennis, Millman, & Tomko 1985, 2005). The College Learning\nAssessment’s performance task requires evaluation of whether\ninformation in documents is credible or unreliable (Council for Aid to\nEducation 2017).\n\nArgument analysis abilities: The ability to identify and\nanalyze arguments contributes to the process of surveying arguments on\nan issue in order to form one’s own reasoned judgment, as in\n Candidate.\n The ability to detect and analyze arguments is recognized as a\ncritical thinking skill by Facione (1990a: 7–8), Ennis (1991: 9)\nand Halpern (1998). Five items (out of 34) on the California Critical\nThinking Skills Test (Facione 1990b, 1992) test skill at argument\nanalysis. The College Learning Assessment (Council for Aid to\nEducation 2017) incorporates argument analysis in its\nselected-response tests of critical reading and evaluation and of\ncritiquing an argument.\n\nJudging skills and deciding skills: Skill at judging and\ndeciding is skill at recognizing what judgment or decision the\navailable evidence and argument supports, and with what degree of\nconfidence. It is thus a component of the inferential skills already\ndiscussed.\n\nLists and tests of critical thinking abilities often include two more\nabilities: identifying assumptions and constructing and evaluating\ndefinitions.\n",
    "section_title": "9. Critical Thinking Abilities",
    "entry_title": "Critical Thinking",
    "hierarchy_title": "Critical Thinking || Critical Thinking Abilities",
    "tokenized_text": [
        "critical",
        "thinking",
        "ability",
        "critical",
        "thinking",
        "ability",
        "theorist",
        "postulate",
        "skill",
        "ie",
        "acquired",
        "ability",
        "operative",
        "critical",
        "thinking",
        "obvious",
        "however",
        "good",
        "mental",
        "act",
        "exercise",
        "generic",
        "acquired",
        "skill",
        "inferring",
        "expected",
        "time",
        "arrival",
        "transit",
        "generic",
        "component",
        "also",
        "us",
        "nongeneric",
        "subjectmatter",
        "knowledge",
        "bailin",
        "et",
        "al",
        "a",
        "argue",
        "viewing",
        "critical",
        "thinking",
        "skill",
        "generic",
        "discrete",
        "ground",
        "skilled",
        "performance",
        "critical",
        "thinking",
        "task",
        "separated",
        "knowledge",
        "concept",
        "domainspecific",
        "principle",
        "good",
        "thinking",
        "talk",
        "skill",
        "concede",
        "unproblematic",
        "mean",
        "merely",
        "person",
        "critical",
        "thinking",
        "skill",
        "capable",
        "intelligent",
        "performance",
        "despite",
        "scepticism",
        "theorist",
        "critical",
        "thinking",
        "listed",
        "general",
        "contributor",
        "critical",
        "thinking",
        "variously",
        "call",
        "ability",
        "glaser",
        "ennis",
        "skill",
        "facione",
        "a",
        "halpern",
        "competency",
        "fisher",
        "scriven",
        "amalgamating",
        "list",
        "would",
        "produce",
        "confusing",
        "chaotic",
        "cornucopia",
        "possible",
        "educational",
        "objective",
        "partial",
        "overlap",
        "among",
        "make",
        "sense",
        "instead",
        "try",
        "understand",
        "reason",
        "multiplicity",
        "diversity",
        "make",
        "selection",
        "according",
        "one",
        "reason",
        "singling",
        "ability",
        "developed",
        "critical",
        "thinking",
        "curriculum",
        "two",
        "reason",
        "diversity",
        "among",
        "list",
        "critical",
        "thinking",
        "ability",
        "underlying",
        "conception",
        "critical",
        "thinking",
        "envisaged",
        "educational",
        "level",
        "appraisalonly",
        "conception",
        "example",
        "involve",
        "different",
        "suite",
        "ability",
        "constructiveonly",
        "conception",
        "list",
        "glaser",
        "put",
        "forward",
        "educational",
        "objective",
        "secondary",
        "school",
        "student",
        "whereas",
        "others",
        "proposed",
        "objective",
        "college",
        "student",
        "eg",
        "facione",
        "a",
        "ability",
        "described",
        "remaining",
        "paragraph",
        "section",
        "emerge",
        "reflection",
        "general",
        "ability",
        "needed",
        "well",
        "thinking",
        "activity",
        "identified",
        "section",
        "component",
        "critical",
        "thinking",
        "process",
        "described",
        "section",
        "derivation",
        "collection",
        "ability",
        "accompanied",
        "citation",
        "source",
        "list",
        "ability",
        "standardized",
        "test",
        "claim",
        "test",
        "observational",
        "ability",
        "careful",
        "accurate",
        "observation",
        "sometimes",
        "requires",
        "specialist",
        "expertise",
        "practice",
        "case",
        "observing",
        "bird",
        "observing",
        "accident",
        "scene",
        "however",
        "general",
        "ability",
        "noticing",
        "one",
        "sens",
        "picking",
        "one",
        "environment",
        "able",
        "articulate",
        "clearly",
        "accurately",
        "oneself",
        "others",
        "one",
        "observed",
        "help",
        "exercising",
        "able",
        "recognize",
        "take",
        "account",
        "factor",
        "make",
        "one",
        "observation",
        "le",
        "trustworthy",
        "prior",
        "framing",
        "situation",
        "inadequate",
        "time",
        "deficient",
        "sens",
        "poor",
        "observation",
        "condition",
        "like",
        "help",
        "well",
        "skilled",
        "taking",
        "step",
        "make",
        "one",
        "observation",
        "trustworthy",
        "moving",
        "closer",
        "get",
        "better",
        "look",
        "measuring",
        "something",
        "three",
        "time",
        "taking",
        "average",
        "checking",
        "one",
        "think",
        "one",
        "observing",
        "someone",
        "else",
        "good",
        "position",
        "observe",
        "also",
        "help",
        "skilled",
        "recognizing",
        "respect",
        "one",
        "report",
        "one",
        "observation",
        "involves",
        "inference",
        "rather",
        "direct",
        "observation",
        "one",
        "consider",
        "whether",
        "inference",
        "justified",
        "ability",
        "come",
        "play",
        "well",
        "one",
        "think",
        "whether",
        "degree",
        "confidence",
        "accept",
        "observation",
        "report",
        "example",
        "study",
        "history",
        "criminal",
        "investigation",
        "assessing",
        "news",
        "report",
        "observational",
        "ability",
        "show",
        "list",
        "critical",
        "thinking",
        "ability",
        "ennis",
        "facione",
        "a",
        "ennis",
        "item",
        "testing",
        "person",
        "ability",
        "judge",
        "credibility",
        "observation",
        "report",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "x",
        "z",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "norris",
        "king",
        "a",
        "b",
        "test",
        "ability",
        "appraise",
        "observation",
        "report",
        "emotional",
        "ability",
        "emotion",
        "drive",
        "critical",
        "thinking",
        "process",
        "perplexity",
        "puzzlement",
        "wish",
        "resolve",
        "satisfaction",
        "achieving",
        "desired",
        "resolution",
        "child",
        "experience",
        "emotion",
        "early",
        "age",
        "without",
        "trained",
        "education",
        "take",
        "critical",
        "thinking",
        "goal",
        "need",
        "channel",
        "emotion",
        "make",
        "sure",
        "stifle",
        "collaborative",
        "critical",
        "thinking",
        "benefit",
        "ability",
        "recognize",
        "one",
        "others",
        "emotional",
        "commitment",
        "reaction",
        "questioning",
        "ability",
        "critical",
        "thinking",
        "process",
        "need",
        "transformation",
        "inchoate",
        "sense",
        "perplexity",
        "clear",
        "question",
        "formulating",
        "question",
        "well",
        "requires",
        "building",
        "questionable",
        "assumption",
        "prejudging",
        "issue",
        "using",
        "language",
        "context",
        "unambiguous",
        "precise",
        "enough",
        "ennis",
        "imaginative",
        "ability",
        "thinking",
        "directed",
        "finding",
        "correct",
        "causal",
        "explanation",
        "general",
        "phenomenon",
        "particular",
        "event",
        "requires",
        "ability",
        "imagine",
        "possible",
        "explanation",
        "thinking",
        "policy",
        "plan",
        "action",
        "adopt",
        "requires",
        "generation",
        "option",
        "consideration",
        "possible",
        "consequence",
        "option",
        "domain",
        "knowledge",
        "required",
        "creative",
        "activity",
        "general",
        "ability",
        "imagine",
        "alternative",
        "helpful",
        "nurtured",
        "become",
        "easier",
        "quicker",
        "extensive",
        "deeper",
        "dewey",
        "facione",
        "a",
        "halpern",
        "include",
        "ability",
        "imagine",
        "alternative",
        "critical",
        "thinking",
        "ability",
        "inferential",
        "ability",
        "ability",
        "draw",
        "conclusion",
        "given",
        "information",
        "recognize",
        "degree",
        "certainty",
        "one",
        "others",
        "conclusion",
        "follow",
        "universally",
        "recognized",
        "general",
        "critical",
        "thinking",
        "ability",
        "example",
        "section",
        "article",
        "include",
        "inference",
        "hypothesis",
        "option",
        "transit",
        "ferryboat",
        "disorder",
        "others",
        "something",
        "observed",
        "weather",
        "rash",
        "none",
        "inference",
        "formally",
        "valid",
        "rather",
        "licensed",
        "general",
        "sometimes",
        "qualified",
        "substantive",
        "rule",
        "inference",
        "toulmin",
        "rest",
        "domain",
        "knowledgethat",
        "bus",
        "trip",
        "take",
        "time",
        "direction",
        "terminal",
        "wireless",
        "telegraph",
        "would",
        "located",
        "highest",
        "possible",
        "place",
        "sudden",
        "cooling",
        "often",
        "followed",
        "rain",
        "allergic",
        "reaction",
        "sulfa",
        "drug",
        "generally",
        "show",
        "soon",
        "one",
        "start",
        "taking",
        "matter",
        "controversy",
        "extent",
        "specialized",
        "ability",
        "deduce",
        "conclusion",
        "premiss",
        "using",
        "formal",
        "rule",
        "inference",
        "needed",
        "critical",
        "thinking",
        "dewey",
        "locates",
        "logical",
        "form",
        "setting",
        "product",
        "reflection",
        "rather",
        "process",
        "reflection",
        "ennis",
        "a",
        "hand",
        "maintains",
        "liberallyeducated",
        "person",
        "following",
        "ability",
        "translate",
        "naturallanguage",
        "statement",
        "statement",
        "using",
        "standard",
        "logical",
        "operator",
        "use",
        "appropriately",
        "language",
        "necessary",
        "sufficient",
        "condition",
        "deal",
        "argument",
        "form",
        "argument",
        "containing",
        "symbol",
        "determine",
        "whether",
        "virtue",
        "argument",
        "form",
        "conclusion",
        "follows",
        "necessarily",
        "premiss",
        "reason",
        "logically",
        "complex",
        "proposition",
        "apply",
        "rule",
        "procedure",
        "deductive",
        "logic",
        "inferential",
        "ability",
        "recognized",
        "critical",
        "thinking",
        "ability",
        "glaser",
        "facione",
        "a",
        "ennis",
        "fisher",
        "scriven",
        "halpern",
        "item",
        "testing",
        "inferential",
        "ability",
        "constitute",
        "two",
        "five",
        "subtests",
        "watson",
        "glaser",
        "critical",
        "thinking",
        "appraisal",
        "watson",
        "glaser",
        "a",
        "b",
        "two",
        "four",
        "section",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "x",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "three",
        "seven",
        "section",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "z",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "item",
        "form",
        "b",
        "california",
        "critical",
        "thinking",
        "skill",
        "test",
        "facione",
        "b",
        "high",
        "variable",
        "proportion",
        "selectedresponse",
        "question",
        "collegiate",
        "learning",
        "assessment",
        "council",
        "aid",
        "education",
        "experimenting",
        "ability",
        "knowing",
        "design",
        "execute",
        "experiment",
        "important",
        "scientific",
        "research",
        "also",
        "everyday",
        "life",
        "rash",
        "dewey",
        "devoted",
        "whole",
        "chapter",
        "think",
        "superiority",
        "experimentation",
        "observation",
        "advancing",
        "knowledge",
        "experimenting",
        "ability",
        "come",
        "play",
        "one",
        "remove",
        "appraising",
        "report",
        "scientific",
        "study",
        "skill",
        "designing",
        "executing",
        "experiment",
        "includes",
        "acknowledged",
        "ability",
        "appraise",
        "evidence",
        "glaser",
        "carry",
        "experiment",
        "apply",
        "appropriate",
        "statistical",
        "inference",
        "technique",
        "facione",
        "a",
        "judge",
        "induction",
        "explanatory",
        "hypothesis",
        "ennis",
        "recognize",
        "need",
        "adequately",
        "large",
        "sample",
        "size",
        "halpern",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "z",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "includes",
        "four",
        "item",
        "experimental",
        "design",
        "collegiate",
        "learning",
        "assessment",
        "council",
        "aid",
        "education",
        "make",
        "room",
        "appraisal",
        "study",
        "design",
        "performance",
        "task",
        "selectedresponse",
        "question",
        "consulting",
        "ability",
        "skill",
        "consulting",
        "source",
        "information",
        "come",
        "play",
        "one",
        "seek",
        "information",
        "help",
        "resolve",
        "problem",
        "candidate",
        "ability",
        "find",
        "appraise",
        "information",
        "includes",
        "ability",
        "gather",
        "marshal",
        "pertinent",
        "information",
        "glaser",
        "judge",
        "whether",
        "statement",
        "made",
        "alleged",
        "authority",
        "acceptable",
        "ennis",
        "plan",
        "search",
        "desired",
        "information",
        "facione",
        "a",
        "judge",
        "credibility",
        "source",
        "ennis",
        "ability",
        "judge",
        "credibility",
        "statement",
        "tested",
        "item",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "x",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "four",
        "item",
        "cornell",
        "critical",
        "thinking",
        "test",
        "level",
        "z",
        "ennis",
        "millman",
        "ennis",
        "millman",
        "tomko",
        "college",
        "learning",
        "assessment",
        "performance",
        "task",
        "requires",
        "evaluation",
        "whether",
        "information",
        "document",
        "credible",
        "unreliable",
        "council",
        "aid",
        "education",
        "argument",
        "analysis",
        "ability",
        "ability",
        "identify",
        "analyze",
        "argument",
        "contributes",
        "process",
        "surveying",
        "argument",
        "issue",
        "order",
        "form",
        "one",
        "reasoned",
        "judgment",
        "candidate",
        "ability",
        "detect",
        "analyze",
        "argument",
        "recognized",
        "critical",
        "thinking",
        "skill",
        "facione",
        "a",
        "ennis",
        "halpern",
        "five",
        "item",
        "california",
        "critical",
        "thinking",
        "skill",
        "test",
        "facione",
        "b",
        "test",
        "skill",
        "argument",
        "analysis",
        "college",
        "learning",
        "assessment",
        "council",
        "aid",
        "education",
        "incorporates",
        "argument",
        "analysis",
        "selectedresponse",
        "test",
        "critical",
        "reading",
        "evaluation",
        "critiquing",
        "argument",
        "judging",
        "skill",
        "deciding",
        "skill",
        "skill",
        "judging",
        "deciding",
        "skill",
        "recognizing",
        "judgment",
        "decision",
        "available",
        "evidence",
        "argument",
        "support",
        "degree",
        "confidence",
        "thus",
        "component",
        "inferential",
        "skill",
        "already",
        "discussed",
        "list",
        "test",
        "critical",
        "thinking",
        "ability",
        "often",
        "include",
        "two",
        "ability",
        "identifying",
        "assumption",
        "constructing",
        "evaluating",
        "definition"
    ]
}