{
    "main_text": "The Frankfurt School: Origins, Influences, and Development || Influences\n1.2 Influences\n\nThe first generation of the Frankfurt School took inspiration from an\nearlier generation of critical theorists: “Left Hegelians”\nin Germany who, after Georg Wilhelm Friedrich Hegel’s death in\n1831, applied his philosophy critically to social and political\nphenomena like religion and the state, maintaining that the\nprogressive realization of freedom in history that was central to\nHegel’s thought was not yet complete and required a fundamental\ntransformation of the status quo. Karl Marx became the most\ninfluential of this group. In a materialist transformation of\nHegel’s thought, Marx analyzed the concrete conditions for\nrealizing autonomy for all and viewed philosophy itself as conditioned\nby socioeconomic developments. By developing a critique of political\neconomy in order to analyze the nature of capitalism and the\npossibilities for revolutionary social transformation, Marx set the\nstandard for future generations of critical theory by combining\nradical philosophy with a critique of the best available social\nscience of the day in the pursuit of emancipation.\n\nMarx’s early writings, in the 1840s, were written when\ncapitalist modernization was only just beginning in Germany, but he\nalready saw contradictory social relations as the objective condition\nof capitalist society and exploited workers as a nascent revolutionary\nforce. By the time the Frankfurt School began working out a critical\ntheory of society in the 1930s much had changed as Germany had emerged\nas a leading economic power in an industrialized, capitalist Europe.\nFrankfurt School theorists were committed to social transformation,\nbut the vehicle for change Marx identified – workers in advanced\ncapitalist states like Germany – not only lacked revolutionary\nconsciousness, but would soon embrace fascist politics when faced with\neconomic crisis and mass unemployment. Radical social theorists would\nneed revised analytical tools.\n\nTo study the psychology of individuals and groups along with social\nand cultural influences on that psychology, they could not rely on the\nthen-dominant dogmatic versions of scientific Marxism (Pensky 2019).\nTo understand how social conflicts get denied or repressed, and why\nindividuals and groups turn to authoritarian politics that seem not to\nalign with their class interests, they turned to Freudian\npsychoanalysis. In contrast to orthodox Marxism, they analyzed\nindividual and group psychology, changes in the modern family, and the\ncultural “superstructure” of society, not just the\nmaterial “base,” in order to understand how the rise of\n“mass culture” and the decline of authority figures in the\nfamily led to the decline of critical capacities both in the\nindividual psyche and in society generally. This effort to combine\nMarx and Freud is one of the distinctive features of the Frankfurt\nSchool; exactly how to integrate psychoanalytic theory into critical\ntheory has been a long-standing debate (Marcuse 1955, Whitebook 1995,\nHonneth 2010, Part IV; Allen and O’Connor 2019, Allen 2021).\n\nIn addition to incorporating insights from Freud’s\npsychoanalytic theory, early critical theorists drew on Max\nWeber’s social theory to analyze contemporary society. Crucial\nhere was Weber’s theory of rationalization, which stressed the\ngrowing dominance of instrumental rationality, or means-end reasoning,\nthrough the expanding bureaucratization of society. Weber posited a\nloss of freedom, due to the “iron cage” of modern\nbureaucracy, and a loss of meaning generated by the\n“disenchantment of the world” associated with\nsecularization. Weber’s work was crucial for Horkheimer and\nAdorno’s critique of instrumental reason (1947) as well as for\nHabermas’s later theory of communicative action (1981).\n\nIn synthesizing Marx and Weber, the first generation of critical\ntheory was heavily influenced by Georg Lukács’s attempt\nto do the same in his ground-breaking 1923 essay “Reification\nand the Consciousness of the Proletariat” (see Brunkhorst 1983).\nRadically extending Marx’s analysis of commodities by analyzing\nhow they transform the character of society as a whole, and drawing on\nWeber to describe a process of rationalization that extends to all\naspects of life, Lukács used the term “reification”\n(see 3.2 below) to describe how the commodity form transforms the\nconsciousness of those living in capitalist societies, who then see\nall social relations, even their relation to themselves, as taking on\na “thing-like” character.\n\nThe classic philosophical influences on the Frankfurt School range\nwidely, from Immanuel Kant and German Idealism to Nietzsche. In some\nform, Kant’s appeal to Mündigkeit (autonomy,\nmaturity, responsibility) in his famous essay “What is\nEnlightenment?” – with its call for freely and publicly\nmaking use of reason – animates the ideal of emancipation\nthroughout the work of the Frankfurt School, along with the Kantian\nconception of the critique of reason: the use of reason to reflect on\nthe limits of reason. But its adherents follow Hegel and Marx in\nfocusing on the social, cultural, and material conditions for\nachieving autonomy and insisting that reason is always socially and\nhistorically embedded. For first generation critical theorists, this\nentailed a critique of Kant’s own individualist and repressive\nunderstanding of autonomy as it arises within capitalist social\nconditions (Horkheimer 1933) and formalizes the domination of our own\ninner nature (Horkheimer and Adorno 1947, Excursus II, Adorno 1963a,\nChs. 10–11). Some later critical theorists have engaged more\npositively with Kant, as in Habermas’s attempt to\n“detranscendentalize” core aspects of Kant’s\ntranscendental philosophy (Habermas 2005, Ch. 2) and Rainer\nForst’s Kantian constructivism in moral and political theory\n(Forst 2007, 2021a).\n\nHegel’s work has been a continual reference point for Frankfurt\nSchool philosophers, with key figures in the tradition – from\nMarcuse (1941) and Adorno (1963b) to Benhabib (1986, Part I) and\nHonneth (1992, 2001, 2011) – contributing both substantive\nstudies and relying on Hegel’s methodology either for its\nholistic approach or as a paradigm of immanent critique while\neschewing his metaphysical, teleological, and reconciliatory\ntendencies. Honneth first built on Hegel’s account of the\nstruggle for recognition and the intersubjective conditions for living\nan autonomous life (Honneth 1992) before developing his own account of\nthe practices and institutions of modern ethical life that realize\nfreedom in a way that goes beyond its liberal and Kantian\ninterpretations (Honneth 2011). Rahel Jaeggi builds on Hegel’s\nmethod of immanent critique in her account of progressive social\nchange as learning processes in response to problems, contradictions,\nand crises that arise from within ethically thick forms of life\n(Jaeggi 2014).\n\nIn aiming to explain irrationality, the first generation extended the\ncritique of reason, going beyond rationalist philosophers like Kant\nand Hegel to figures like Freud and Nietzsche. They turned to\nNietzsche in particular as a critic of modern bourgeois culture and\nthe violent formation of individual subjectivity. Engagement with\nNietzsche’s thought extends from early essays by Horkheimer\n(1933, 1936a) through Horkheimer and Adorno’s shift toward doing\ncritical theory in a more Nietzschean spirit with the genealogy of\nreason in Dialectic of Enlightenment (1947), and\nHabermas’s more critical take on Nietzsche’s supposed\nirrationalism (1985, Ch. 3–4), to contemporary authors such as\nMenke, who returns to Nietzsche as a positive reference point in the\ncritique of the repressive dimensions of the modern ideal of equality\n(2000) and for a genealogical analysis of the modern subject who\ndemands rights (2015).\n\nOne way of categorizing work by later generations of the Frankfurt\nSchool is to note how, even when drawing on a range of theoretical\nresources, they give pride of place to the legacy of a particular\nfigure like Kant, Hegel, Marx, or Nietzsche (often via Foucault), or\nhow they combine approaches. For instance, Honneth and Jaeggi are more\nHegelian while Forst is more Kantian, and Benhabib is, like Habermas,\na Hegelianized Kantian, and Fraser draws heavily on Marx in recent\nwork while Amy Allen and Martin Saar are influenced by Foucauldian\ngenealogy. The latter is part of a broader engagement between the\nFrankfurt School and post-structuralism, ranging from the more\ncritical (Habermas 1985) through the more sympathetic (Honneth 1985,\nMenke 1988, 2000) to attempts to combine deconstructive and\nreconstructive approaches to critical theory (McCarthy 1991; see also\nFraser 1989).\n\nIt is not easy to capture key features of an intellectual tradition\nshaped by such a variety of influences, including multiple figures\nwhose own thinking changed over time, and a body of work addressing a\nvast range of topics spanning from the 1930s to the present. The rest\nof this section outlines some of the main arguments and focal points\nof key texts by key figures. It is not meant to be exhaustive, but to\nidentify influential methodological approaches, arguments, and themes\nthat are indicative of the work of the Frankfurt School and still\nprovide important reference points for contemporary debates.\n",
    "section_title": "1.2 Influences",
    "entry_title": "Critical Theory (Frankfurt School)",
    "hierarchy_title": "Critical Theory (Frankfurt School) || The Frankfurt School: Origins, Influences, and Development || Influences",
    "tokenized_text": [
        "frankfurt",
        "school",
        "origin",
        "influence",
        "development",
        "influence",
        "influence",
        "first",
        "generation",
        "frankfurt",
        "school",
        "took",
        "inspiration",
        "earlier",
        "generation",
        "critical",
        "theorist",
        "left",
        "hegelian",
        "germany",
        "georg",
        "wilhelm",
        "friedrich",
        "hegel",
        "death",
        "applied",
        "philosophy",
        "critically",
        "social",
        "political",
        "phenomenon",
        "like",
        "religion",
        "state",
        "maintaining",
        "progressive",
        "realization",
        "freedom",
        "history",
        "central",
        "hegel",
        "thought",
        "yet",
        "complete",
        "required",
        "fundamental",
        "transformation",
        "status",
        "quo",
        "karl",
        "marx",
        "became",
        "influential",
        "group",
        "materialist",
        "transformation",
        "hegel",
        "thought",
        "marx",
        "analyzed",
        "concrete",
        "condition",
        "realizing",
        "autonomy",
        "viewed",
        "philosophy",
        "conditioned",
        "socioeconomic",
        "development",
        "developing",
        "critique",
        "political",
        "economy",
        "order",
        "analyze",
        "nature",
        "capitalism",
        "possibility",
        "revolutionary",
        "social",
        "transformation",
        "marx",
        "set",
        "standard",
        "future",
        "generation",
        "critical",
        "theory",
        "combining",
        "radical",
        "philosophy",
        "critique",
        "best",
        "available",
        "social",
        "science",
        "day",
        "pursuit",
        "emancipation",
        "marx",
        "early",
        "writing",
        "s",
        "written",
        "capitalist",
        "modernization",
        "beginning",
        "germany",
        "already",
        "saw",
        "contradictory",
        "social",
        "relation",
        "objective",
        "condition",
        "capitalist",
        "society",
        "exploited",
        "worker",
        "nascent",
        "revolutionary",
        "force",
        "time",
        "frankfurt",
        "school",
        "began",
        "working",
        "critical",
        "theory",
        "society",
        "s",
        "much",
        "changed",
        "germany",
        "emerged",
        "leading",
        "economic",
        "power",
        "industrialized",
        "capitalist",
        "europe",
        "frankfurt",
        "school",
        "theorist",
        "committed",
        "social",
        "transformation",
        "vehicle",
        "change",
        "marx",
        "identified",
        "worker",
        "advanced",
        "capitalist",
        "state",
        "like",
        "germany",
        "lacked",
        "revolutionary",
        "consciousness",
        "would",
        "soon",
        "embrace",
        "fascist",
        "politics",
        "faced",
        "economic",
        "crisis",
        "mass",
        "unemployment",
        "radical",
        "social",
        "theorist",
        "would",
        "need",
        "revised",
        "analytical",
        "tool",
        "study",
        "psychology",
        "individual",
        "group",
        "along",
        "social",
        "cultural",
        "influence",
        "psychology",
        "could",
        "rely",
        "thendominant",
        "dogmatic",
        "version",
        "scientific",
        "marxism",
        "pensky",
        "understand",
        "social",
        "conflict",
        "get",
        "denied",
        "repressed",
        "individual",
        "group",
        "turn",
        "authoritarian",
        "politics",
        "seem",
        "align",
        "class",
        "interest",
        "turned",
        "freudian",
        "psychoanalysis",
        "contrast",
        "orthodox",
        "marxism",
        "analyzed",
        "individual",
        "group",
        "psychology",
        "change",
        "modern",
        "family",
        "cultural",
        "superstructure",
        "society",
        "material",
        "base",
        "order",
        "understand",
        "rise",
        "mass",
        "culture",
        "decline",
        "authority",
        "figure",
        "family",
        "led",
        "decline",
        "critical",
        "capacity",
        "individual",
        "psyche",
        "society",
        "generally",
        "effort",
        "combine",
        "marx",
        "freud",
        "one",
        "distinctive",
        "feature",
        "frankfurt",
        "school",
        "exactly",
        "integrate",
        "psychoanalytic",
        "theory",
        "critical",
        "theory",
        "longstanding",
        "debate",
        "marcuse",
        "whitebook",
        "honneth",
        "part",
        "iv",
        "allen",
        "connor",
        "allen",
        "addition",
        "incorporating",
        "insight",
        "freud",
        "psychoanalytic",
        "theory",
        "early",
        "critical",
        "theorist",
        "drew",
        "max",
        "weber",
        "social",
        "theory",
        "analyze",
        "contemporary",
        "society",
        "crucial",
        "weber",
        "theory",
        "rationalization",
        "stressed",
        "growing",
        "dominance",
        "instrumental",
        "rationality",
        "meansend",
        "reasoning",
        "expanding",
        "bureaucratization",
        "society",
        "weber",
        "posited",
        "loss",
        "freedom",
        "due",
        "iron",
        "cage",
        "modern",
        "bureaucracy",
        "loss",
        "meaning",
        "generated",
        "disenchantment",
        "world",
        "associated",
        "secularization",
        "weber",
        "work",
        "crucial",
        "horkheimer",
        "adorno",
        "critique",
        "instrumental",
        "reason",
        "well",
        "habermas",
        "later",
        "theory",
        "communicative",
        "action",
        "synthesizing",
        "marx",
        "weber",
        "first",
        "generation",
        "critical",
        "theory",
        "heavily",
        "influenced",
        "georg",
        "lukács",
        "attempt",
        "groundbreaking",
        "essay",
        "reification",
        "consciousness",
        "proletariat",
        "see",
        "brunkhorst",
        "radically",
        "extending",
        "marx",
        "analysis",
        "commodity",
        "analyzing",
        "transform",
        "character",
        "society",
        "whole",
        "drawing",
        "weber",
        "describe",
        "process",
        "rationalization",
        "extends",
        "aspect",
        "life",
        "lukács",
        "used",
        "term",
        "reification",
        "see",
        "describe",
        "commodity",
        "form",
        "transforms",
        "consciousness",
        "living",
        "capitalist",
        "society",
        "see",
        "social",
        "relation",
        "even",
        "relation",
        "taking",
        "thinglike",
        "character",
        "classic",
        "philosophical",
        "influence",
        "frankfurt",
        "school",
        "range",
        "widely",
        "immanuel",
        "kant",
        "german",
        "idealism",
        "nietzsche",
        "form",
        "kant",
        "appeal",
        "mündigkeit",
        "autonomy",
        "maturity",
        "responsibility",
        "famous",
        "essay",
        "enlightenment",
        "call",
        "freely",
        "publicly",
        "making",
        "use",
        "reason",
        "animates",
        "ideal",
        "emancipation",
        "throughout",
        "work",
        "frankfurt",
        "school",
        "along",
        "kantian",
        "conception",
        "critique",
        "reason",
        "use",
        "reason",
        "reflect",
        "limit",
        "reason",
        "adherent",
        "follow",
        "hegel",
        "marx",
        "focusing",
        "social",
        "cultural",
        "material",
        "condition",
        "achieving",
        "autonomy",
        "insisting",
        "reason",
        "always",
        "socially",
        "historically",
        "embedded",
        "first",
        "generation",
        "critical",
        "theorist",
        "entailed",
        "critique",
        "kant",
        "individualist",
        "repressive",
        "understanding",
        "autonomy",
        "arises",
        "within",
        "capitalist",
        "social",
        "condition",
        "horkheimer",
        "formalizes",
        "domination",
        "inner",
        "nature",
        "horkheimer",
        "adorno",
        "excursus",
        "ii",
        "adorno",
        "a",
        "chs",
        "later",
        "critical",
        "theorist",
        "engaged",
        "positively",
        "kant",
        "habermas",
        "attempt",
        "detranscendentalize",
        "core",
        "aspect",
        "kant",
        "transcendental",
        "philosophy",
        "habermas",
        "ch",
        "rainer",
        "forst",
        "kantian",
        "constructivism",
        "moral",
        "political",
        "theory",
        "forst",
        "a",
        "hegel",
        "work",
        "continual",
        "reference",
        "point",
        "frankfurt",
        "school",
        "philosopher",
        "key",
        "figure",
        "tradition",
        "marcuse",
        "adorno",
        "b",
        "benhabib",
        "part",
        "honneth",
        "contributing",
        "substantive",
        "study",
        "relying",
        "hegel",
        "methodology",
        "either",
        "holistic",
        "approach",
        "paradigm",
        "immanent",
        "critique",
        "eschewing",
        "metaphysical",
        "teleological",
        "reconciliatory",
        "tendency",
        "honneth",
        "first",
        "built",
        "hegel",
        "account",
        "struggle",
        "recognition",
        "intersubjective",
        "condition",
        "living",
        "autonomous",
        "life",
        "honneth",
        "developing",
        "account",
        "practice",
        "institution",
        "modern",
        "ethical",
        "life",
        "realize",
        "freedom",
        "way",
        "go",
        "beyond",
        "liberal",
        "kantian",
        "interpretation",
        "honneth",
        "rahel",
        "jaeggi",
        "build",
        "hegel",
        "method",
        "immanent",
        "critique",
        "account",
        "progressive",
        "social",
        "change",
        "learning",
        "process",
        "response",
        "problem",
        "contradiction",
        "crisis",
        "arise",
        "within",
        "ethically",
        "thick",
        "form",
        "life",
        "jaeggi",
        "aiming",
        "explain",
        "irrationality",
        "first",
        "generation",
        "extended",
        "critique",
        "reason",
        "going",
        "beyond",
        "rationalist",
        "philosopher",
        "like",
        "kant",
        "hegel",
        "figure",
        "like",
        "freud",
        "nietzsche",
        "turned",
        "nietzsche",
        "particular",
        "critic",
        "modern",
        "bourgeois",
        "culture",
        "violent",
        "formation",
        "individual",
        "subjectivity",
        "engagement",
        "nietzsche",
        "thought",
        "extends",
        "early",
        "essay",
        "horkheimer",
        "a",
        "horkheimer",
        "adorno",
        "shift",
        "toward",
        "critical",
        "theory",
        "nietzschean",
        "spirit",
        "genealogy",
        "reason",
        "dialectic",
        "enlightenment",
        "habermas",
        "critical",
        "take",
        "nietzsche",
        "supposed",
        "irrationalism",
        "ch",
        "contemporary",
        "author",
        "menke",
        "return",
        "nietzsche",
        "positive",
        "reference",
        "point",
        "critique",
        "repressive",
        "dimension",
        "modern",
        "ideal",
        "equality",
        "genealogical",
        "analysis",
        "modern",
        "subject",
        "demand",
        "right",
        "one",
        "way",
        "categorizing",
        "work",
        "later",
        "generation",
        "frankfurt",
        "school",
        "note",
        "even",
        "drawing",
        "range",
        "theoretical",
        "resource",
        "give",
        "pride",
        "place",
        "legacy",
        "particular",
        "figure",
        "like",
        "kant",
        "hegel",
        "marx",
        "nietzsche",
        "often",
        "via",
        "foucault",
        "combine",
        "approach",
        "instance",
        "honneth",
        "jaeggi",
        "hegelian",
        "forst",
        "kantian",
        "benhabib",
        "like",
        "habermas",
        "hegelianized",
        "kantian",
        "fraser",
        "draw",
        "heavily",
        "marx",
        "recent",
        "work",
        "amy",
        "allen",
        "martin",
        "saar",
        "influenced",
        "foucauldian",
        "genealogy",
        "latter",
        "part",
        "broader",
        "engagement",
        "frankfurt",
        "school",
        "poststructuralism",
        "ranging",
        "critical",
        "habermas",
        "sympathetic",
        "honneth",
        "menke",
        "attempt",
        "combine",
        "deconstructive",
        "reconstructive",
        "approach",
        "critical",
        "theory",
        "mccarthy",
        "see",
        "also",
        "fraser",
        "easy",
        "capture",
        "key",
        "feature",
        "intellectual",
        "tradition",
        "shaped",
        "variety",
        "influence",
        "including",
        "multiple",
        "figure",
        "whose",
        "thinking",
        "changed",
        "time",
        "body",
        "work",
        "addressing",
        "vast",
        "range",
        "topic",
        "spanning",
        "s",
        "present",
        "rest",
        "section",
        "outline",
        "main",
        "argument",
        "focal",
        "point",
        "key",
        "text",
        "key",
        "figure",
        "meant",
        "exhaustive",
        "identify",
        "influential",
        "methodological",
        "approach",
        "argument",
        "theme",
        "indicative",
        "work",
        "frankfurt",
        "school",
        "still",
        "provide",
        "important",
        "reference",
        "point",
        "contemporary",
        "debate"
    ]
}