{
    "main_text": "Minority Cultural Rights Claims || Cultural preservation rights\n2.5 Cultural preservation rights\n\nCultural preservation rights are those that groups claim as key to\nsustaining a cultural group as a cultural group. This right\nis sometimes described as a right to the “survival of a\nculturally-specific people” (Gutmann 2003: 75). In\nsome cases, the justification is based on the claim that\ncertain forms of exposure to and engagement with the wider community\nwill result in the erosion of a culture that is valued by its members.\nIn others, the justification is historical, as in where orthodox\nreligious groups, fleeing religious persecution in Europe, agreed to\nsettle new land in Canada and the United States in exchange for\nreligious freedom. In others, the central justification is\nthat cultural diversity is valuable and worth preserving, in and\nof itself (Parekh 2000). (In some cases, cultural preservation\nrights are claimed as recompense for past wrong; this claim is\nconsidered separately, below.) Demands for cultural preservation\nare most controversial where they are made by illiberal groups, as\nwill be detailed shortly.\n\nIt is worth dwelling here for a moment to notice that there are two\nways to interpret cultural preservation: it could mean the\npreservation of a group as a distinct cultural entity or it could mean\nthe preservation of certain practices and values that are believed, at\na moment in time, to be central to the culture. Rights to cultural\npreservation come in multiple formats, including demands for\nexemption, parental autonomy, respect for internal conflict resolution\nmechanisms (in family law, mainly), and control over membership. These\nrights are justified with respect to preserving culture,\nand typically rely on an understanding of culture-as-encompassing\ngroups or culture-as-social-formation, just as does the more general\nright to self-determination with which they often travel.\n\nMany minority illiberal groups ask only for rights of forbearance\nagainst the state in which they live (Spinner-Halev 2000). In\nresponse, a state may permit an illiberal cultural group to be\n“left alone”, on the idea that so long as it can persist\nwithout state support of any kind, it may do so. A state may be asked\nto do more, however, to preserve the culture.\n\nFor example, a state may be asked to exempt community\nmembers from certain requirements that are typically demanded of all\ncitizens, including mandatory schooling and child labour laws.\nConsider this example: many orthodox Amish communities live a life\nthat is largely segregated from the wider community. They live a\nreligiously structured way of life which dictates whom members marry,\nhow they raise children, how they produce an economy that permits\ntheir way of life to continue. In most cases, they demand neither\nrecognition nor additional financial support in order to protect their\ncommunities’ way of life. They had previously demanded only\nnon-interference, for the most part. But, in the 1970s, some American\nAmish communities demanded, and were granted, the right to withdraw\ntheir children from mandatory education at the age of 14, arguing that\nwhere their children were required to remain in school until the age\nof 16, they were more likely to exit the community. This high rate of\nexit would, they argued, result in the failure of the Amish way of\nlife to persist over time (Burtt 1994). The right of exemption the\nAmish claimed was, in this case, derivative of the larger demand for\ncultural self-preservation; without the exemption, they said, the\nculture itself might fade away.\n\nA state may also be asked to respect certain domains of legal\nauthority, perhaps most frequently in the domain of family law.\nMinority communities often regulate the conditions of marriage, and\ncustody of children, as well as divorce, and request the legal\nauthority to do so. Respecting the legal authority of minority\ncommunities to exercise jurisdiction in family law is the kind of\nrequest that often troubles critics of cultural minority rights, since\nit may entrench disadvantages to women, for example in divorce\nsettlements or custody agreements (Shachar 2001; Bakht 2007). In\ngeneral, then, states that acknowledge the legal authority of minority\ncommunities in the space of family law also demand that those\nwho are participating in these adjudication proceedings do so\nwillingly; majority states therefore often retain permission for\nthemselves to interefere in these proceedings, in support of\nthose who may be inadequately protected. The state must attempt a\nbalance here, between offering its support to the most vulnerable\nmembers of a minority group (for example to ensure that their\nconstitutional rights are protected) and interference of a kind that\nis inattentive to the rightful claims of minority groups to persist\nover time, in part by exercising its authority in key spaces.\n\nAnother common form of cultural preservation rights are\nexclusion rights, that is, the right of a cultural group to\nrefuse to admit others to territory or membership, because of a worry\nthat more generous terms of admission threatens to undermine it by, in\neffect, diluting it. Just as states have the putative right to control\ntheir borders (discussed below in section 3), and who can claim\nmembership rights even after admission, so do some sub-state\njurisdictions claim this double right of exclusion, citing the\nimportance of cultural preservation. Indigenous communities have\nsometimes claimed the right to exclude non-Indigenous individuals from\nsettling on their territories or the right to exclude others (for\nexample non-Indigenous spouses of Indigenous persons) from certain\nmembership benefits, including the right to vote (or otherwise have a\nsay) for those who will govern. State courts have been asked to\nadjudicate the rightful authority of Indigenous communities to\nmake these determinations (see Song 2005).\n\nThe cultural preservation rights described above pose a difficult\nchallenge, connected to the critiques of treating culture as an\nencompassing group: any claim for cultural preservation, say some\ncritics, translates in effect into problematic claims of control over\nmembers, which, moreover, are typically most restrictive for women and\nLGBTQ+ members of a cultural group. This is a challenge posed most\nforcefully where rights of cultural preservation are demanded by\nso-called illiberal groups like the Amish, and where they are (in the\neyes of critics) imposed on children against their will. Illiberal\ngroups are those which deny certain key liberal values, like autonomy\nand equality; in many cases, these communities are supported by\neducational systems that discourage autonomous choice-making, by\navoiding the teaching of skills and capacities that typically enable\nit, and by enforcing hierarchical rules that elevate some members over\nothers in ways that egalitarians find uncomfortable. The worry is that\nthe community wants not only to preserve itself as a distinct cultural\ngroup, but also that it wants to protect a kind of cultural\nhomogeneity that leaves no room for contestation or dissent over its\ncentral values and practices. These latter hierarchical rules often\nrender women vulnerable to more powerful men, who may demand various\nforms of sexual subservience to them, who relegate them to the home to\ncare for children, and who impose rigid codes of behaviour on them,\nfor which harsh penalties are meted out in cases of violation. These\nkinds of so-called “cultural practices” are, for some\ncritics, such that they render any form of state support in protecting\nminority cultural groups largely indefensible (Okin 1999). \n\nA worry that runs through objections to these many cultural\npreservation rights is that women may not be willing\nparticipants in these cultures, and therefore that respecting cultural\npreservation rights consigns women to lives they would not\nchoose, do not want, and cannot escape. But for many it is a\nmistake to assume that women members are such only under duress, since\nmany will deeply value the community itself and respect the norms and\nvalues that it seeks to protect, even if they reject certain among\nthem. In these cases, and where political theorists consider them,\nthere is an attempt to move from treating culture in encompassing\nterms towards treating it in dialogic and narrative terms. Cultures,\neven oppressive (to liberals) minority cultures, are subject to\nchange, and perhaps the best source of change is deeply committed\nmembers who willingly endorse key values but reject others, including\nthose that do not respect the equal rights of women. Monique\nDeveaux’s account of female adult participants in customary\nmarriages in South Africa, who accept some elements of their culture,\nbut who aim to gain a voice at the table to shift others, treats\nculture in dialogic terms (Deveaux 2007). Here, the key motivating\nthought is that cultures can and do shift over time, in response to\nhow its members engage in it, and what matters is not the change\nitself, but who or what is its source. On this view, the objective of\ncultural preservation rights is not to preserve culture per\nse, a challenge that would prove impossible in any case, but\nrather the right to protect the ability of group members to shape\ntheir culture and to protect it against unwelcome sources of\nchange.\n\nOthers argue that so long as women, and any others subject to rigid\ncultural demands, possess a right (or the capacity) to exit the\ncommunity, their choice to remain should be treated as such (Kukathas\n1992). For those who hold this view, efforts to render the right\nto exit genuinely exercisable are tremendously\nimportant (Kukathas 2012; Holzleithner 2012). In so doing, a\nstate must make a choice about the resources it provides to those\nmembers who may desire to exit, but who do not have the means to\nestablish themselves in the larger society. In some orthodox religious\ncommunities, property is owned in common and individual members do not\nhave any personal property or resources; as a result, exiters have\nnothing on which to rely while they establish their new lives. In\nothers, members are poorly educated, and unfamiliar with life outside\nof their own communities, and so exit without the capacity to sustain\nthemselves in the larger society.  So, receiving states can offer\nsupport to exiters in various ways, for example by providing\nshelters to exiting women (and men), in which education is provided so\nthat they may eventually attain self-sufficiency as a member of\nmainstream society. The choice to support exiters may seem to\nundermine a culture’s capacity for self-preservation. But\nsupporting exiters is not well-understood as denying cultural\npreservation rights; rather, the choice to do so stems from a\nstate’s commitment to protecting the rights of all of its\nmembers, including the most vulnerable, as best as it can do.\n",
    "section_title": "2.5 Cultural preservation rights",
    "entry_title": "Culture",
    "hierarchy_title": "Culture || Minority Cultural Rights Claims || Cultural preservation rights",
    "tokenized_text": [
        "minority",
        "cultural",
        "right",
        "claim",
        "cultural",
        "preservation",
        "right",
        "cultural",
        "preservation",
        "right",
        "cultural",
        "preservation",
        "right",
        "group",
        "claim",
        "key",
        "sustaining",
        "cultural",
        "group",
        "cultural",
        "group",
        "right",
        "sometimes",
        "described",
        "right",
        "survival",
        "culturallyspecific",
        "people",
        "gutmann",
        "case",
        "justification",
        "based",
        "claim",
        "certain",
        "form",
        "exposure",
        "engagement",
        "wider",
        "community",
        "result",
        "erosion",
        "culture",
        "valued",
        "member",
        "others",
        "justification",
        "historical",
        "orthodox",
        "religious",
        "group",
        "fleeing",
        "religious",
        "persecution",
        "europe",
        "agreed",
        "settle",
        "new",
        "land",
        "canada",
        "united",
        "state",
        "exchange",
        "religious",
        "freedom",
        "others",
        "central",
        "justification",
        "cultural",
        "diversity",
        "valuable",
        "worth",
        "preserving",
        "parekh",
        "case",
        "cultural",
        "preservation",
        "right",
        "claimed",
        "recompense",
        "past",
        "wrong",
        "claim",
        "considered",
        "separately",
        "demand",
        "cultural",
        "preservation",
        "controversial",
        "made",
        "illiberal",
        "group",
        "detailed",
        "shortly",
        "worth",
        "dwelling",
        "moment",
        "notice",
        "two",
        "way",
        "interpret",
        "cultural",
        "preservation",
        "could",
        "mean",
        "preservation",
        "group",
        "distinct",
        "cultural",
        "entity",
        "could",
        "mean",
        "preservation",
        "certain",
        "practice",
        "value",
        "believed",
        "moment",
        "time",
        "central",
        "culture",
        "right",
        "cultural",
        "preservation",
        "come",
        "multiple",
        "format",
        "including",
        "demand",
        "exemption",
        "parental",
        "autonomy",
        "respect",
        "internal",
        "conflict",
        "resolution",
        "mechanism",
        "family",
        "law",
        "mainly",
        "control",
        "membership",
        "right",
        "justified",
        "respect",
        "preserving",
        "culture",
        "typically",
        "rely",
        "understanding",
        "cultureasencompassing",
        "group",
        "cultureassocialformation",
        "general",
        "right",
        "selfdetermination",
        "often",
        "travel",
        "many",
        "minority",
        "illiberal",
        "group",
        "ask",
        "right",
        "forbearance",
        "state",
        "live",
        "spinnerhalev",
        "response",
        "state",
        "may",
        "permit",
        "illiberal",
        "cultural",
        "group",
        "left",
        "alone",
        "idea",
        "long",
        "persist",
        "without",
        "state",
        "support",
        "kind",
        "may",
        "state",
        "may",
        "asked",
        "however",
        "preserve",
        "culture",
        "example",
        "state",
        "may",
        "asked",
        "exempt",
        "community",
        "member",
        "certain",
        "requirement",
        "typically",
        "demanded",
        "citizen",
        "including",
        "mandatory",
        "schooling",
        "child",
        "labour",
        "law",
        "consider",
        "example",
        "many",
        "orthodox",
        "amish",
        "community",
        "live",
        "life",
        "largely",
        "segregated",
        "wider",
        "community",
        "live",
        "religiously",
        "structured",
        "way",
        "life",
        "dictate",
        "member",
        "marry",
        "raise",
        "child",
        "produce",
        "economy",
        "permit",
        "way",
        "life",
        "continue",
        "case",
        "demand",
        "neither",
        "recognition",
        "additional",
        "financial",
        "support",
        "order",
        "protect",
        "community",
        "way",
        "life",
        "previously",
        "demanded",
        "noninterference",
        "part",
        "s",
        "american",
        "amish",
        "community",
        "demanded",
        "granted",
        "right",
        "withdraw",
        "child",
        "mandatory",
        "education",
        "age",
        "arguing",
        "child",
        "required",
        "remain",
        "school",
        "age",
        "likely",
        "exit",
        "community",
        "high",
        "rate",
        "exit",
        "would",
        "argued",
        "result",
        "failure",
        "amish",
        "way",
        "life",
        "persist",
        "time",
        "burtt",
        "right",
        "exemption",
        "amish",
        "claimed",
        "case",
        "derivative",
        "larger",
        "demand",
        "cultural",
        "selfpreservation",
        "without",
        "exemption",
        "said",
        "culture",
        "might",
        "fade",
        "away",
        "state",
        "may",
        "also",
        "asked",
        "respect",
        "certain",
        "domain",
        "legal",
        "authority",
        "perhaps",
        "frequently",
        "domain",
        "family",
        "law",
        "minority",
        "community",
        "often",
        "regulate",
        "condition",
        "marriage",
        "custody",
        "child",
        "well",
        "divorce",
        "request",
        "legal",
        "authority",
        "respecting",
        "legal",
        "authority",
        "minority",
        "community",
        "exercise",
        "jurisdiction",
        "family",
        "law",
        "kind",
        "request",
        "often",
        "trouble",
        "critic",
        "cultural",
        "minority",
        "right",
        "since",
        "may",
        "entrench",
        "disadvantage",
        "woman",
        "example",
        "divorce",
        "settlement",
        "custody",
        "agreement",
        "shachar",
        "bakht",
        "general",
        "state",
        "acknowledge",
        "legal",
        "authority",
        "minority",
        "community",
        "space",
        "family",
        "law",
        "also",
        "demand",
        "participating",
        "adjudication",
        "proceeding",
        "willingly",
        "majority",
        "state",
        "therefore",
        "often",
        "retain",
        "permission",
        "interefere",
        "proceeding",
        "support",
        "may",
        "inadequately",
        "protected",
        "state",
        "must",
        "attempt",
        "balance",
        "offering",
        "support",
        "vulnerable",
        "member",
        "minority",
        "group",
        "example",
        "ensure",
        "constitutional",
        "right",
        "protected",
        "interference",
        "kind",
        "inattentive",
        "rightful",
        "claim",
        "minority",
        "group",
        "persist",
        "time",
        "part",
        "exercising",
        "authority",
        "key",
        "space",
        "another",
        "common",
        "form",
        "cultural",
        "preservation",
        "right",
        "exclusion",
        "right",
        "right",
        "cultural",
        "group",
        "refuse",
        "admit",
        "others",
        "territory",
        "membership",
        "worry",
        "generous",
        "term",
        "admission",
        "threatens",
        "undermine",
        "effect",
        "diluting",
        "state",
        "putative",
        "right",
        "control",
        "border",
        "discussed",
        "section",
        "claim",
        "membership",
        "right",
        "even",
        "admission",
        "substate",
        "jurisdiction",
        "claim",
        "double",
        "right",
        "exclusion",
        "citing",
        "importance",
        "cultural",
        "preservation",
        "indigenous",
        "community",
        "sometimes",
        "claimed",
        "right",
        "exclude",
        "nonindigenous",
        "individual",
        "settling",
        "territory",
        "right",
        "exclude",
        "others",
        "example",
        "nonindigenous",
        "spouse",
        "indigenous",
        "person",
        "certain",
        "membership",
        "benefit",
        "including",
        "right",
        "vote",
        "otherwise",
        "say",
        "govern",
        "state",
        "court",
        "asked",
        "adjudicate",
        "rightful",
        "authority",
        "indigenous",
        "community",
        "make",
        "determination",
        "see",
        "song",
        "cultural",
        "preservation",
        "right",
        "described",
        "pose",
        "difficult",
        "challenge",
        "connected",
        "critique",
        "treating",
        "culture",
        "encompassing",
        "group",
        "claim",
        "cultural",
        "preservation",
        "say",
        "critic",
        "translates",
        "effect",
        "problematic",
        "claim",
        "control",
        "member",
        "moreover",
        "typically",
        "restrictive",
        "woman",
        "lgbtq",
        "member",
        "cultural",
        "group",
        "challenge",
        "posed",
        "forcefully",
        "right",
        "cultural",
        "preservation",
        "demanded",
        "socalled",
        "illiberal",
        "group",
        "like",
        "amish",
        "eye",
        "critic",
        "imposed",
        "child",
        "illiberal",
        "group",
        "deny",
        "certain",
        "key",
        "liberal",
        "value",
        "like",
        "autonomy",
        "equality",
        "many",
        "case",
        "community",
        "supported",
        "educational",
        "system",
        "discourage",
        "autonomous",
        "choicemaking",
        "avoiding",
        "teaching",
        "skill",
        "capacity",
        "typically",
        "enable",
        "enforcing",
        "hierarchical",
        "rule",
        "elevate",
        "member",
        "others",
        "way",
        "egalitarian",
        "find",
        "uncomfortable",
        "worry",
        "community",
        "want",
        "preserve",
        "distinct",
        "cultural",
        "group",
        "also",
        "want",
        "protect",
        "kind",
        "cultural",
        "homogeneity",
        "leaf",
        "room",
        "contestation",
        "dissent",
        "central",
        "value",
        "practice",
        "latter",
        "hierarchical",
        "rule",
        "often",
        "render",
        "woman",
        "vulnerable",
        "powerful",
        "men",
        "may",
        "demand",
        "various",
        "form",
        "sexual",
        "subservience",
        "relegate",
        "home",
        "care",
        "child",
        "impose",
        "rigid",
        "code",
        "behaviour",
        "harsh",
        "penalty",
        "meted",
        "case",
        "violation",
        "kind",
        "socalled",
        "cultural",
        "practice",
        "critic",
        "render",
        "form",
        "state",
        "support",
        "protecting",
        "minority",
        "cultural",
        "group",
        "largely",
        "indefensible",
        "okin",
        "worry",
        "run",
        "objection",
        "many",
        "cultural",
        "preservation",
        "right",
        "woman",
        "may",
        "willing",
        "participant",
        "culture",
        "therefore",
        "respecting",
        "cultural",
        "preservation",
        "right",
        "consigns",
        "woman",
        "life",
        "would",
        "choose",
        "want",
        "escape",
        "many",
        "mistake",
        "assume",
        "woman",
        "member",
        "duress",
        "since",
        "many",
        "deeply",
        "value",
        "community",
        "respect",
        "norm",
        "value",
        "seek",
        "protect",
        "even",
        "reject",
        "certain",
        "among",
        "case",
        "political",
        "theorist",
        "consider",
        "attempt",
        "move",
        "treating",
        "culture",
        "encompassing",
        "term",
        "towards",
        "treating",
        "dialogic",
        "narrative",
        "term",
        "culture",
        "even",
        "oppressive",
        "liberal",
        "minority",
        "culture",
        "subject",
        "change",
        "perhaps",
        "best",
        "source",
        "change",
        "deeply",
        "committed",
        "member",
        "willingly",
        "endorse",
        "key",
        "value",
        "reject",
        "others",
        "including",
        "respect",
        "equal",
        "right",
        "woman",
        "monique",
        "deveaux",
        "account",
        "female",
        "adult",
        "participant",
        "customary",
        "marriage",
        "south",
        "africa",
        "accept",
        "element",
        "culture",
        "aim",
        "gain",
        "voice",
        "table",
        "shift",
        "others",
        "treat",
        "culture",
        "dialogic",
        "term",
        "deveaux",
        "key",
        "motivating",
        "thought",
        "culture",
        "shift",
        "time",
        "response",
        "member",
        "engage",
        "matter",
        "change",
        "source",
        "view",
        "objective",
        "cultural",
        "preservation",
        "right",
        "preserve",
        "culture",
        "per",
        "se",
        "challenge",
        "would",
        "prove",
        "impossible",
        "case",
        "rather",
        "right",
        "protect",
        "ability",
        "group",
        "member",
        "shape",
        "culture",
        "protect",
        "unwelcome",
        "source",
        "change",
        "others",
        "argue",
        "long",
        "woman",
        "others",
        "subject",
        "rigid",
        "cultural",
        "demand",
        "posse",
        "right",
        "capacity",
        "exit",
        "community",
        "choice",
        "remain",
        "treated",
        "kukathas",
        "hold",
        "view",
        "effort",
        "render",
        "right",
        "exit",
        "genuinely",
        "exercisable",
        "tremendously",
        "important",
        "kukathas",
        "holzleithner",
        "state",
        "must",
        "make",
        "choice",
        "resource",
        "provides",
        "member",
        "may",
        "desire",
        "exit",
        "mean",
        "establish",
        "larger",
        "society",
        "orthodox",
        "religious",
        "community",
        "property",
        "owned",
        "common",
        "individual",
        "member",
        "personal",
        "property",
        "resource",
        "result",
        "exiters",
        "nothing",
        "rely",
        "establish",
        "new",
        "life",
        "others",
        "member",
        "poorly",
        "educated",
        "unfamiliar",
        "life",
        "outside",
        "community",
        "exit",
        "without",
        "capacity",
        "sustain",
        "larger",
        "society",
        "receiving",
        "state",
        "offer",
        "support",
        "exiters",
        "various",
        "way",
        "example",
        "providing",
        "shelter",
        "exiting",
        "woman",
        "men",
        "education",
        "provided",
        "may",
        "eventually",
        "attain",
        "selfsufficiency",
        "member",
        "mainstream",
        "society",
        "choice",
        "support",
        "exiters",
        "may",
        "seem",
        "undermine",
        "culture",
        "capacity",
        "selfpreservation",
        "supporting",
        "exiters",
        "wellunderstood",
        "denying",
        "cultural",
        "preservation",
        "right",
        "rather",
        "choice",
        "stem",
        "state",
        "commitment",
        "protecting",
        "right",
        "member",
        "including",
        "vulnerable",
        "best"
    ]
}