{
    "main_text": "The De vulgari eloquentia\n5. The De vulgari eloquentia\n\nDuring the same period in which Dante was writing the\nConvivio he was also composing the De vulgari\neloquentia. Written in Latin, this treatise was, like the\nConvivio, abandoned sometime around 1307. In it, however,\nmany of the lengthy discussions of ethics and politics from book 4 of\nConvivio are put in the service of a discussion of the\ncapacity of poets possessing both scientia et\ningenium—that is, those who possess both knowledge and\ngenius [DVE 2.1.8]—to use an illustrious vernacular\nlanguage to “melt the hearts of human beings, so as to make the\nunwilling willing and the willing unwilling” [1.17.4].\nUnderwriting this purpose, Dante offers a wholly unique treatment of\nthe origins and development of language in book 1 before proceeding in\nbook 2 to set down specific rules that ought to govern the proper\npoetic deployment of this illustrious vernacular.\n\nThere are nineteen chapter divisions to part one. Chapters 1–3\nlay the groundwork by discussing the basic purposes of human language.\nHere, Dante quite rightly recognizes that, even were we to regard\nintellectual content as immaterial, human beings are nevertheless\nconstituted in such a way as to derive intellectual content initially\nfrom sensation directly (as in the case of induction arriving at a\nfirst principle) or through the sensory communication of intellectual\ncontent from one human being to another (as in the case of dialectical\nor rhetorical engagement). Languages thus convey thinking but do so in\na material medium (e.g., sound produced by one person’s vocal\ncords and vibrating another person’s receiving organ of the\near). Indeed, for Dante, this use of language is at the very core of\nwhat it means to be human since, unlike other animals and also unlike\nangels and demons, “in order to communicate their mental\nconceptions (conceptiones) to one another, men had to have\nsome kind of rational and sensory sign…rational because it\nwould both arise from and lead to reason…[and sensory] since\nnothing can be transferred from one reasoning mind to another except\nby sensory means.” [1.3.2].\n\nChapters 4–10 then proceed to offer an investigation of the\norigins of the diversity of vernaculars in the world. The view Dante\noffers in these chapters focuses on both the creation of Adam and\nAdam’s first speech as well as on the story of the tower of\nBabel. (Aspects of the account offered here are later revised in the\nPilgrim’s discussion of this subject with Adam in\nParadiso 26—see Aleksander [2016], 240–41). In\nchapters 11–15, Dante describes his supposed hunt among the\nexisting Italian vernaculars of his day for an illustrious version of\nItalian. But rather than locating an illustrious vernacular among any\nof the existing modes of Italian, he mainly heaps scorn on most of the\nregional vernaculars, including his own native Tuscan vernacular. For\ninstance, Dante writes that “the Tuscans, who, rendered\nsenseless by some aberration of their own” [1.13.1] merely\npersist in drunken raving [in hac ebrietate baccantur,\n1.13.2] about the excellence of their “foul jargon”\n[turpiloquio, 1.13.3].\n\nThere is one important exception to Dante’s scorn for the\nfourteen or so vernaculars that he reviews, and it is the vernacular\nof the Bolognese. Dante claims that the Bolognese seem to “speak\na more beautiful language than most” [1.15.2] because their\nvernacular, unlike that of other regions of Italy, borrows from other\nvernaculars in such a way that it is “tempered by the\ncombination of opposites” [1.15.5]. Unfortunately for them,\nhowever, Dante explains that his praise for their language is not\nabsolute but is only relative to his disdain for the sad state of the\nother existing vernaculars. After all, he says, had the dialect of the\nBolognese been absolutely the best of the existing Italian\nvernaculars, why would praiseworthy poets such as Guido Guinizelli,\nGuido Ghislieri, Fabruzzo, and Onesto have abandoned it?\n\nIn 1.16, Dante turns from his hunt for an illustrious vernacular among\nexisting modes of Italian to his own definition of the mode of\nvernacular against which all other Italian vernaculars ought to be\njudged. Here Dante draws an implicit analogy between what is he is\nseeking in the case of the Italian vernaculars and the ways in which\nwe are able to identify through intellectual insight a law or\nprinciple that provides a determination of what is good or bad with\nrespect to some distinct capacity for action. Dante reasons that just\nas we are able to arrive at conceptions of “virtue” that\nought to govern our conduct, so too we ought be able to arrive at an\nunderstanding of the mode of language that is best suited to our\npractical needs as language users. As he will eventually make clear in\n2.1–2, this mode of language would be appropriate only for the\nbest of uses by the best individuals. That is, this mode would only be\nappropriate for use by those who are equipped by their own perfection\nto generate virtues in others. Moreover, this mode would only express\nand produce the virtues that correspond to the tripartite aspects of a\nhuman soul: prowess in arms, which pertains to the vegetal part of the\nsoul’s determination to seek that which is useful; love, which\npertains to a rectitude of the appetitive or animal part of the soul;\nand rectitude of will, which pertains to the rational part of the soul\n[2.2].\n\nFor Dante there are four main features of any mode of expression\nappropriate for these tasks. Dante identifies these four features as a\nvernacular’s illustriousness, cardinality, courtliness, and\ncuriality. That such a language can generate virtues in human\nbeings is precisely what Dante means in 1.17 when he calls such a\nlanguage “illustrious” since such a language is\n“sublime in both learning and power” [1.17.2]. And, in\n1.18, Dante explains that such a language is “cardinal,”\nor “pivotal,” (cardinalis) because it\n“plants” (plantat) what is best and peculiar to\nspecific local vernaculars and “removes”\n(exstirpat) what is disreputable [1.18.1]. It is\n“courtly” or “aulic” (aulicus)\nbecause “it is common to all and the property of none”\n[1.18.2]. And it is “curial” (curialis) because\nit has been weighed by the scales of justice in a court unified either\nunder the rule of a singular monarch or—as is the case for\nDante’s Italian contemporaries, who lack a unified court in this\nsense—according to a court unified by “the gracious light\nof reason” [1.18.5]. This last criterion thus suggests that such\na vernacular also depends upon and expresses the principles of just\nrule since, according to Dante, “the essence of being curial is\nno more than providing a balanced assessment of whatever has to be\ndealt with” [1.18.4].\n\nDante’s style of argumentation in the De vulgari\neloquentia is notably assertorial and seems to beg the question\nof the grounds for his own authority to offer the principles\nsummarized above. To illustrate the significance of this style of\nargumentation, it is worth backing up for a moment to see that prior\nto defining the four main features of any illustrious vernacular,\nDante had already hunted for an illustrious vernacular among roughly\nfourteen existing regional species of the Italian mode of the\nvernacular. During the course of this hunt, however, Dante offered\njudgments regarding the deficiencies of various aesthetic features of\nthese existing modes of the Italian vernacular as if he had already\nestablished the very principles that he articulated only after having\nabandoned that hunt. For instance, after heaping scorn on the\nvernacular habits of his fellow Tuscans, Dante proceeds to the\nfollowing evaluation of the Genoese:\n\nIf there is anyone who thinks that what I have just said about the\nTuscans could not be applied to the Genoese, let him consider only\nthat if, through forgetfulness, the people of Genoa lost the use of\nthe letter z, they would either have to fall silent for ever\nor invent a new language for themselves. For z forms the\ngreater part of their vernacular, and it is, of course a letter that\ncannot be pronounced without considerable harshness.\n\n\nThe claim that an illustrious vernacular would not include frequent\nuses of the phoneme z is puzzling on the surface and seems to\ncall for a justification much more robust than the judgment that\nz is a harsh sound. Indeed, Dante seems somewhat aware of\nthis problem, for in 1.6.2–3 he had already staked out his own\nauthority in undertaking his investigation by explaining that:\n\nwhoever is so misguided as to think that the place of his birth is the\nmost delightful spot under the sun may also believe that his own\nlanguage—his mother tongue, that is—is pre-eminent among\nall others; and, as a result he may believe that his language was also\nAdam’s. To me, however, the whole world is a homeland, like the\nsea to fish—though I drank from the Arno before cutting my\nteeth, and love Florence so much that, because I loved her suffer\nexile unjustly—and I will weight the balance of my judgment more\nwith reason than with [sensation].\n\n\nTaken to an extreme, this comment suggests that the basis of his\nauthority to evaluate the quality of diverse vernaculars is his\n“exile.” Read in this way, Dante’s unjust exile from\nthe imperfect community of Florence perhaps suggests a reversal of\nAdam’s exile from Eden (or of the hubris that resulted in\nNimrod’s linguistic isolation illustrated in Inferno\n31)—an interpretation that is also justified by the very fact\nthat in this same section Dante proceeds from this comment on his own\nsuitability to judge Italian vernaculars immediately to a discussion\nof the forma locutionis of Adamic language.\n\nHowever, these claims also permit a more modest interpretation of\nDante’s self-justification. In the first place, Dante’s\nclaim to authority by virtue of his exile from Florence suggests that\nthe legitimacy of an illustrious vernacular is not simply rooted in a\ngame of numbers—that is, the illustriousness of a vernacular is\nnot simply a product of how many people use it in a given region of\nthe world. Quite to the contrary, since the proper use of such a\nvernacular requires that a poet possesses both scientia et\ningenium, those who are legitimate users of an illustrious\nvernacular are likely to be few in number, and the ways in which they\nought to employ such a language are similarly constrained. Moreover,\nboth Dante’s warnings about the problems of bias in our\nattitudes toward our own linguistic conventions as well as his point\nthat the legitimacy of his own evaluation is rooted in his attention\nto reason rather than merely to the senses provides a hint that Dante\nregards the legitimacy of poetic employments of an illustrious\nvernacular as grounded in philosophy’s authoritativeness with\nrespect to ethical and political matters.\n\nTo see how this hint bears out it will help to recall the points that\nDante offered in the Convivio about the relationship between\nphilosophical, theological, and secular political authority. As noted\nabove, in Convivio 4 Dante argues that even an\nemperor’s authority must be circumscribed insofar as\nthe art of ruling and the laws it creates cannot overrule rational\njudgment based on philosophical understanding of the laws of nature.\nBut, in fact, Dante pursues this line of thinking even further in\nConvivio 4.6.16–18 by explaining the practical\nnecessity of the unification of imperial and philosophical\nauthority.\n\nthe authority of the supreme philosopher referred to here [Aristotle]\nis utterly valid [or, more literally “is invested with complete\npower”]. Philosophical authority is not opposed to imperial\nauthority; but the latter without the former is dangerous, and the\nformer without the latter is weak, as it were, not in itself but\nbecause of the disorder that results among the people; so that one\ncombined with the other is highly useful and most valid. And so it is\nwritten in the Book of Wisdom: “Love the light of wisdom, all\nyou who are before the people”; in other words, unite\nphilosophical authority and imperial authority, for the sake of good\nand perfect rule.\n\n\nLater in the text, Dante is even more explicit about the priority of\nphilosophy’s authority to that of the emperor with respect to\njudgments concerning the political necessities dictated by human\nnature. In Convivio 4.9.14–16, for instance, Dante\noffers the following claim:\n\nwhat we have discussed with regard to the various arts can be observed\nin the imperial art; for there are conventions in that art, too, which\nare pure arts, as for example laws on marriage, domestic servants,\nmilitary service, or successors in public office: in these we are\ncompletely subject to the emperor, without doubt or hesitation. There\nare other laws which follow on nature, so to speak, as in establishing\nwhen a man is old enough to manage his own affairs, and where these\nare concerned we are not wholly subject. There are many others which\nappear to have some relation to the imperial art—and whoever\nbelieves that the emperor’s opinion in this area is\nauthoritative is and was deluded—as in defining what constitutes\nearly adulthood and nobility, over which no imperial judgment must be\naccepted merely because it is the emperor’s: thus, may that\nwhich is Caesar’s be rendered unto Caesar, and may that which is\nGod’s be rendered unto God. Consequently, there is no obligation\nto believe or assent to the emperor Nero, who said that early\nadulthood was bodily beauty and strength, but [instead] to him, a\nphilosopher [Aristotle], who said that early adulthood is the peak of\nnatural life.\n\n\nIn other words, Dante’s argument in De vulgari\neloquentia ultimately depends upon and reinforces the claims of\nthe Convivio that just rule requires the unification of\nphilosophical authority with that of the authority to establish and\nenforce laws. Philosophy qua philosophy is impotent in the task of\nguiding all but those who have already achieved both ethical and\nintellectual virtues. The emperor, on the other hand, can indeed\neither benefit or corrupt his subjects, but the emperor’s\nlegitimacy depends on his recognition of the priority of\nphilosophy’s claims to the knowledge of the principles of\njustice and the other human virtues since such matters are dictated\nmore by human nature than by local conventions. What the De\nvulgari eloquentia adds to Dante’s emerging political\nphilosophy in the Convivio, however, is explicit attention to\nthe significance of poetic/rhetorical discourse as a tool to be used\non behalf of the project of unifying people under the joint rule of\nphilosophy and empire—a perspective that it is easy to imagine\nplayed a significant role in his choice to turn back to poetry as his\nprimary vehicle for addressing his fellow Italians in their own\nvernacular in the Divine Comedy.\n",
    "section_title": "5. The De vulgari eloquentia",
    "entry_title": "Dante Alighieri",
    "hierarchy_title": "Dante Alighieri || The De vulgari eloquentia",
    "tokenized_text": [
        "de",
        "vulgari",
        "eloquentia",
        "de",
        "vulgari",
        "eloquentia",
        "period",
        "dante",
        "writing",
        "convivio",
        "also",
        "composing",
        "de",
        "vulgari",
        "eloquentia",
        "written",
        "latin",
        "treatise",
        "like",
        "convivio",
        "abandoned",
        "sometime",
        "around",
        "however",
        "many",
        "lengthy",
        "discussion",
        "ethic",
        "politics",
        "book",
        "convivio",
        "put",
        "service",
        "discussion",
        "capacity",
        "poet",
        "possessing",
        "scientia",
        "et",
        "ingeniumthat",
        "posse",
        "knowledge",
        "genius",
        "dve",
        "to",
        "use",
        "illustrious",
        "vernacular",
        "language",
        "melt",
        "heart",
        "human",
        "being",
        "make",
        "unwilling",
        "willing",
        "willing",
        "unwilling",
        "underwriting",
        "purpose",
        "dante",
        "offer",
        "wholly",
        "unique",
        "treatment",
        "origin",
        "development",
        "language",
        "book",
        "proceeding",
        "book",
        "set",
        "specific",
        "rule",
        "ought",
        "govern",
        "proper",
        "poetic",
        "deployment",
        "illustrious",
        "vernacular",
        "nineteen",
        "chapter",
        "division",
        "part",
        "one",
        "chapter",
        "lay",
        "groundwork",
        "discussing",
        "basic",
        "purpose",
        "human",
        "language",
        "dante",
        "quite",
        "rightly",
        "recognizes",
        "even",
        "regard",
        "intellectual",
        "content",
        "immaterial",
        "human",
        "being",
        "nevertheless",
        "constituted",
        "way",
        "derive",
        "intellectual",
        "content",
        "initially",
        "sensation",
        "directly",
        "case",
        "induction",
        "arriving",
        "first",
        "principle",
        "sensory",
        "communication",
        "intellectual",
        "content",
        "one",
        "human",
        "another",
        "case",
        "dialectical",
        "rhetorical",
        "engagement",
        "language",
        "thus",
        "convey",
        "thinking",
        "material",
        "medium",
        "eg",
        "sound",
        "produced",
        "one",
        "person",
        "vocal",
        "cord",
        "vibrating",
        "another",
        "person",
        "receiving",
        "organ",
        "ear",
        "indeed",
        "dante",
        "use",
        "language",
        "core",
        "mean",
        "human",
        "since",
        "unlike",
        "animal",
        "also",
        "unlike",
        "angel",
        "demon",
        "order",
        "communicate",
        "mental",
        "conception",
        "conceptiones",
        "one",
        "another",
        "men",
        "kind",
        "rational",
        "sensory",
        "signrational",
        "would",
        "arise",
        "lead",
        "reason",
        "sensory",
        "since",
        "nothing",
        "transferred",
        "one",
        "reasoning",
        "mind",
        "another",
        "except",
        "sensory",
        "means",
        "chapter",
        "proceed",
        "offer",
        "investigation",
        "origin",
        "diversity",
        "vernacular",
        "world",
        "view",
        "dante",
        "offer",
        "chapter",
        "focus",
        "creation",
        "adam",
        "adam",
        "first",
        "speech",
        "well",
        "story",
        "tower",
        "babel",
        "aspect",
        "account",
        "offered",
        "later",
        "revised",
        "pilgrim",
        "discussion",
        "subject",
        "adam",
        "paradiso",
        "see",
        "aleksander",
        "chapter",
        "dante",
        "describes",
        "supposed",
        "hunt",
        "among",
        "existing",
        "italian",
        "vernacular",
        "day",
        "illustrious",
        "version",
        "italian",
        "rather",
        "locating",
        "illustrious",
        "vernacular",
        "among",
        "existing",
        "mode",
        "italian",
        "mainly",
        "heap",
        "scorn",
        "regional",
        "vernacular",
        "including",
        "native",
        "tuscan",
        "vernacular",
        "instance",
        "dante",
        "writes",
        "tuscan",
        "rendered",
        "senseless",
        "aberration",
        "merely",
        "persist",
        "drunken",
        "raving",
        "hac",
        "ebrietate",
        "baccantur",
        "excellence",
        "foul",
        "jargon",
        "turpiloquio",
        "one",
        "important",
        "exception",
        "dante",
        "scorn",
        "fourteen",
        "vernacular",
        "review",
        "vernacular",
        "bolognese",
        "dante",
        "claim",
        "bolognese",
        "seem",
        "speak",
        "beautiful",
        "language",
        "vernacular",
        "unlike",
        "region",
        "italy",
        "borrows",
        "vernacular",
        "way",
        "tempered",
        "combination",
        "opposite",
        "unfortunately",
        "however",
        "dante",
        "explains",
        "praise",
        "language",
        "absolute",
        "relative",
        "disdain",
        "sad",
        "state",
        "existing",
        "vernacular",
        "say",
        "dialect",
        "bolognese",
        "absolutely",
        "best",
        "existing",
        "italian",
        "vernacular",
        "would",
        "praiseworthy",
        "poet",
        "guido",
        "guinizelli",
        "guido",
        "ghislieri",
        "fabruzzo",
        "onesto",
        "abandoned",
        "dante",
        "turn",
        "hunt",
        "illustrious",
        "vernacular",
        "among",
        "existing",
        "mode",
        "italian",
        "definition",
        "mode",
        "vernacular",
        "italian",
        "vernacular",
        "ought",
        "judged",
        "dante",
        "draw",
        "implicit",
        "analogy",
        "seeking",
        "case",
        "italian",
        "vernacular",
        "way",
        "able",
        "identify",
        "intellectual",
        "insight",
        "law",
        "principle",
        "provides",
        "determination",
        "good",
        "bad",
        "respect",
        "distinct",
        "capacity",
        "action",
        "dante",
        "reason",
        "able",
        "arrive",
        "conception",
        "virtue",
        "ought",
        "govern",
        "conduct",
        "ought",
        "able",
        "arrive",
        "understanding",
        "mode",
        "language",
        "best",
        "suited",
        "practical",
        "need",
        "language",
        "user",
        "eventually",
        "make",
        "clear",
        "mode",
        "language",
        "would",
        "appropriate",
        "best",
        "us",
        "best",
        "individual",
        "mode",
        "would",
        "appropriate",
        "use",
        "equipped",
        "perfection",
        "generate",
        "virtue",
        "others",
        "moreover",
        "mode",
        "would",
        "express",
        "produce",
        "virtue",
        "correspond",
        "tripartite",
        "aspect",
        "human",
        "soul",
        "prowess",
        "arm",
        "pertains",
        "vegetal",
        "part",
        "soul",
        "determination",
        "seek",
        "useful",
        "love",
        "pertains",
        "rectitude",
        "appetitive",
        "animal",
        "part",
        "soul",
        "rectitude",
        "pertains",
        "rational",
        "part",
        "soul",
        "dante",
        "four",
        "main",
        "feature",
        "mode",
        "expression",
        "appropriate",
        "task",
        "dante",
        "identifies",
        "four",
        "feature",
        "vernacular",
        "illustriousness",
        "cardinality",
        "courtliness",
        "curiality",
        "language",
        "generate",
        "virtue",
        "human",
        "being",
        "precisely",
        "dante",
        "mean",
        "call",
        "language",
        "illustrious",
        "since",
        "language",
        "sublime",
        "learning",
        "power",
        "dante",
        "explains",
        "language",
        "cardinal",
        "pivotal",
        "cardinalis",
        "plant",
        "plantat",
        "best",
        "peculiar",
        "specific",
        "local",
        "vernacular",
        "remove",
        "exstirpat",
        "disreputable",
        "courtly",
        "aulic",
        "aulicus",
        "common",
        "property",
        "none",
        "curial",
        "curialis",
        "weighed",
        "scale",
        "justice",
        "court",
        "unified",
        "either",
        "rule",
        "singular",
        "monarch",
        "oras",
        "case",
        "dante",
        "italian",
        "contemporary",
        "lack",
        "unified",
        "court",
        "senseaccording",
        "court",
        "unified",
        "gracious",
        "light",
        "reason",
        "last",
        "criterion",
        "thus",
        "suggests",
        "vernacular",
        "also",
        "depends",
        "upon",
        "express",
        "principle",
        "rule",
        "since",
        "according",
        "dante",
        "essence",
        "curial",
        "providing",
        "balanced",
        "assessment",
        "whatever",
        "dealt",
        "dante",
        "style",
        "argumentation",
        "de",
        "vulgari",
        "eloquentia",
        "notably",
        "assertorial",
        "seems",
        "beg",
        "question",
        "ground",
        "authority",
        "offer",
        "principle",
        "summarized",
        "illustrate",
        "significance",
        "style",
        "argumentation",
        "worth",
        "backing",
        "moment",
        "see",
        "prior",
        "defining",
        "four",
        "main",
        "feature",
        "illustrious",
        "vernacular",
        "dante",
        "already",
        "hunted",
        "illustrious",
        "vernacular",
        "among",
        "roughly",
        "fourteen",
        "existing",
        "regional",
        "specie",
        "italian",
        "mode",
        "vernacular",
        "course",
        "hunt",
        "however",
        "dante",
        "offered",
        "judgment",
        "regarding",
        "deficiency",
        "various",
        "aesthetic",
        "feature",
        "existing",
        "mode",
        "italian",
        "vernacular",
        "already",
        "established",
        "principle",
        "articulated",
        "abandoned",
        "hunt",
        "instance",
        "heaping",
        "scorn",
        "vernacular",
        "habit",
        "fellow",
        "tuscan",
        "dante",
        "proceeds",
        "following",
        "evaluation",
        "genoese",
        "anyone",
        "think",
        "said",
        "tuscan",
        "could",
        "applied",
        "genoese",
        "let",
        "consider",
        "forgetfulness",
        "people",
        "genoa",
        "lost",
        "use",
        "letter",
        "z",
        "would",
        "either",
        "fall",
        "silent",
        "ever",
        "invent",
        "new",
        "language",
        "z",
        "form",
        "greater",
        "part",
        "vernacular",
        "course",
        "letter",
        "pronounced",
        "without",
        "considerable",
        "harshness",
        "claim",
        "illustrious",
        "vernacular",
        "would",
        "include",
        "frequent",
        "us",
        "phoneme",
        "z",
        "puzzling",
        "surface",
        "seems",
        "call",
        "justification",
        "much",
        "robust",
        "judgment",
        "z",
        "harsh",
        "sound",
        "indeed",
        "dante",
        "seems",
        "somewhat",
        "aware",
        "problem",
        "already",
        "staked",
        "authority",
        "undertaking",
        "investigation",
        "explaining",
        "whoever",
        "misguided",
        "think",
        "place",
        "birth",
        "delightful",
        "spot",
        "sun",
        "may",
        "also",
        "believe",
        "languagehis",
        "mother",
        "tongue",
        "isis",
        "preeminent",
        "among",
        "others",
        "result",
        "may",
        "believe",
        "language",
        "also",
        "adam",
        "however",
        "whole",
        "world",
        "homeland",
        "like",
        "sea",
        "fishthough",
        "drank",
        "arno",
        "cutting",
        "teeth",
        "love",
        "florence",
        "much",
        "loved",
        "suffer",
        "exile",
        "unjustlyand",
        "weight",
        "balance",
        "judgment",
        "reason",
        "sensation",
        "taken",
        "extreme",
        "comment",
        "suggests",
        "basis",
        "authority",
        "evaluate",
        "quality",
        "diverse",
        "vernacular",
        "exile",
        "read",
        "way",
        "dante",
        "unjust",
        "exile",
        "imperfect",
        "community",
        "florence",
        "perhaps",
        "suggests",
        "reversal",
        "adam",
        "exile",
        "eden",
        "hubris",
        "resulted",
        "nimrod",
        "linguistic",
        "isolation",
        "illustrated",
        "inferno",
        "an",
        "interpretation",
        "also",
        "justified",
        "fact",
        "section",
        "dante",
        "proceeds",
        "comment",
        "suitability",
        "judge",
        "italian",
        "vernacular",
        "immediately",
        "discussion",
        "forma",
        "locutionis",
        "adamic",
        "language",
        "however",
        "claim",
        "also",
        "permit",
        "modest",
        "interpretation",
        "dante",
        "selfjustification",
        "first",
        "place",
        "dante",
        "claim",
        "authority",
        "virtue",
        "exile",
        "florence",
        "suggests",
        "legitimacy",
        "illustrious",
        "vernacular",
        "simply",
        "rooted",
        "game",
        "numbersthat",
        "illustriousness",
        "vernacular",
        "simply",
        "product",
        "many",
        "people",
        "use",
        "given",
        "region",
        "world",
        "quite",
        "contrary",
        "since",
        "proper",
        "use",
        "vernacular",
        "requires",
        "poet",
        "posse",
        "scientia",
        "et",
        "ingenium",
        "legitimate",
        "user",
        "illustrious",
        "vernacular",
        "likely",
        "number",
        "way",
        "ought",
        "employ",
        "language",
        "similarly",
        "constrained",
        "moreover",
        "dante",
        "warning",
        "problem",
        "bias",
        "attitude",
        "toward",
        "linguistic",
        "convention",
        "well",
        "point",
        "legitimacy",
        "evaluation",
        "rooted",
        "attention",
        "reason",
        "rather",
        "merely",
        "sens",
        "provides",
        "hint",
        "dante",
        "regard",
        "legitimacy",
        "poetic",
        "employment",
        "illustrious",
        "vernacular",
        "grounded",
        "philosophy",
        "authoritativeness",
        "respect",
        "ethical",
        "political",
        "matter",
        "see",
        "hint",
        "bear",
        "help",
        "recall",
        "point",
        "dante",
        "offered",
        "convivio",
        "relationship",
        "philosophical",
        "theological",
        "secular",
        "political",
        "authority",
        "noted",
        "convivio",
        "dante",
        "argues",
        "even",
        "emperor",
        "authority",
        "must",
        "circumscribed",
        "insofar",
        "art",
        "ruling",
        "law",
        "creates",
        "overrule",
        "rational",
        "judgment",
        "based",
        "philosophical",
        "understanding",
        "law",
        "nature",
        "fact",
        "dante",
        "pursues",
        "line",
        "thinking",
        "even",
        "convivio",
        "explaining",
        "practical",
        "necessity",
        "unification",
        "imperial",
        "philosophical",
        "authority",
        "authority",
        "supreme",
        "philosopher",
        "referred",
        "aristotle",
        "utterly",
        "valid",
        "literally",
        "invested",
        "complete",
        "power",
        "philosophical",
        "authority",
        "opposed",
        "imperial",
        "authority",
        "latter",
        "without",
        "former",
        "dangerous",
        "former",
        "without",
        "latter",
        "weak",
        "disorder",
        "result",
        "among",
        "people",
        "one",
        "combined",
        "highly",
        "useful",
        "valid",
        "written",
        "book",
        "wisdom",
        "love",
        "light",
        "wisdom",
        "people",
        "word",
        "unite",
        "philosophical",
        "authority",
        "imperial",
        "authority",
        "sake",
        "good",
        "perfect",
        "rule",
        "later",
        "text",
        "dante",
        "even",
        "explicit",
        "priority",
        "philosophy",
        "authority",
        "emperor",
        "respect",
        "judgment",
        "concerning",
        "political",
        "necessity",
        "dictated",
        "human",
        "nature",
        "convivio",
        "instance",
        "dante",
        "offer",
        "following",
        "claim",
        "discussed",
        "regard",
        "various",
        "art",
        "observed",
        "imperial",
        "art",
        "convention",
        "art",
        "pure",
        "art",
        "example",
        "law",
        "marriage",
        "domestic",
        "servant",
        "military",
        "service",
        "successor",
        "public",
        "office",
        "completely",
        "subject",
        "emperor",
        "without",
        "doubt",
        "hesitation",
        "law",
        "follow",
        "nature",
        "speak",
        "establishing",
        "man",
        "old",
        "enough",
        "manage",
        "affair",
        "concerned",
        "wholly",
        "subject",
        "many",
        "others",
        "appear",
        "relation",
        "imperial",
        "artand",
        "whoever",
        "belief",
        "emperor",
        "opinion",
        "area",
        "authoritative",
        "deludedas",
        "defining",
        "constitutes",
        "early",
        "adulthood",
        "nobility",
        "imperial",
        "judgment",
        "must",
        "accepted",
        "merely",
        "emperor",
        "thus",
        "may",
        "caesar",
        "rendered",
        "unto",
        "caesar",
        "may",
        "god",
        "rendered",
        "unto",
        "god",
        "consequently",
        "obligation",
        "believe",
        "assent",
        "emperor",
        "nero",
        "said",
        "early",
        "adulthood",
        "bodily",
        "beauty",
        "strength",
        "instead",
        "philosopher",
        "aristotle",
        "said",
        "early",
        "adulthood",
        "peak",
        "natural",
        "life",
        "word",
        "dante",
        "argument",
        "de",
        "vulgari",
        "eloquentia",
        "ultimately",
        "depends",
        "upon",
        "reinforces",
        "claim",
        "convivio",
        "rule",
        "requires",
        "unification",
        "philosophical",
        "authority",
        "authority",
        "establish",
        "enforce",
        "law",
        "philosophy",
        "qua",
        "philosophy",
        "impotent",
        "task",
        "guiding",
        "already",
        "achieved",
        "ethical",
        "intellectual",
        "virtue",
        "emperor",
        "hand",
        "indeed",
        "either",
        "benefit",
        "corrupt",
        "subject",
        "emperor",
        "legitimacy",
        "depends",
        "recognition",
        "priority",
        "philosophy",
        "claim",
        "knowledge",
        "principle",
        "justice",
        "human",
        "virtue",
        "since",
        "matter",
        "dictated",
        "human",
        "nature",
        "local",
        "convention",
        "de",
        "vulgari",
        "eloquentia",
        "add",
        "dante",
        "emerging",
        "political",
        "philosophy",
        "convivio",
        "however",
        "explicit",
        "attention",
        "significance",
        "poeticrhetorical",
        "discourse",
        "tool",
        "used",
        "behalf",
        "project",
        "unifying",
        "people",
        "joint",
        "rule",
        "philosophy",
        "empirea",
        "perspective",
        "easy",
        "imagine",
        "played",
        "significant",
        "role",
        "choice",
        "turn",
        "back",
        "poetry",
        "primary",
        "vehicle",
        "addressing",
        "fellow",
        "italian",
        "vernacular",
        "divine",
        "comedy"
    ]
}