{
    "main_text": "Epicurus and the Harm Thesis || The Epicurean Case\n3.1 The Epicurean Case\n\nEpicurus (341–270) adopted a version of hedonism according to\nwhich pleasure (or pleasant experiences) is the only thing that is\nintrinsically good for us (that is, the only thing that is good for us\nin itself), while pain (or painful experiences) is the only thing that\nis intrinsically bad for us, bad in itself. Call this view intrinsic\nhedonism. (For a discussion of intrinsic value, see the entry on\nIntrinsic vs. Extrinsic Value.) Epicurus’s commitment to\nintrinsic hedonism prompted him to say, in his Letter to\nMenoeceus, that “everything good and bad lies in\nsensation.” He also claimed, in that same letter, that\n“when we are, death is not, and when death is present, then we\nare not.” The death of a person, and that person’s\nexistence, do not overlap in time. On the basis of this assumption\nabout death and existence, he concluded that a person’s death\ndoes not cause her to have any experiences (sensations)—indeed,\n“death is to be deprived of sensation.” In the following\npassage, he uses these thoughts against the harm thesis:\n\nMake yourself familiar with the belief that death is nothing to us,\nsince everything good and bad lies in sensation, and death is to be\ndeprived of sensation. … So that most fearful of all bad\nthings, death, is nothing to us, since when we are, death is not, and\nwhen death is present, then we are not.\n\n\nMuch about Epicurus’s argument is unclear, so let us work\nthrough it more carefully and see if we can fill in some details that\nhe did not supply. Some speculation will be necessary, but we can\ndevelop a reconstruction that aligns with the things he wrote.\n\nEarlier we mentioned one of the views Epicurus accepted, which we can\nstate as follows:\n\nIntrinsic hedonism is true: a person’s experiences\n(sensations) of pleasure (or her pleasant experiences) are the only\nthings that are intrinsically good for her, the only things that are\ngood for her in themselves, while her experiences of pain (or painful\nexperiences) are the only things that are intrinsically bad for her,\nbad in themselves.\n\n\nFrom this view it follows that\n\nsomething is intrinsically good or bad for a person only if it is\nan experience.\n\n\nNow, regardless of whether a person experiences her death, that death\nis not itself an experience. (Compare: I may experience jogging down\nthe street, and I may experience the cup that is in front of me, but\nneither jogging nor the cup is itself an experience. My experiences\nare, so to speak, in my mind. Cups are not.) Let us add this\nobservation to the argument:\n\nA person’s death is not an experience.\n\n\nAnd if a person’s death is not an experience at all, clearly it\nis not an experience that is intrinsically good or bad for her. So,\nfrom 1–3, it follows that\n\na person’s death is not intrinsically good or bad for\nher.\n\n\nHowever, something that is not intrinsically bad for a person might\nnevertheless make other things happen that are detrimental to her, in\nwhich case it may be extrinsically bad for her. Seeing\nsomebody fall and break her arm is not intrinsically bad for a person,\nbut it might well cause her painful sadness, which makes the accident\nshe saw extrinsically bad for her. Similarly, something that is not\nintrinsically good for a person might be extrinsically good for\nher.\n\nEpicurus recognized the possibility of extrinsic goodness. It is not\nentirely clear how he understood it, but he seemed to accept a view we\ncan call extrinsic instrumentalism: something is\nextrinsically good or bad for a person only if it makes her have\nthings (other than itself) that are intrinsically good or bad for her.\nLet us add this to the argument:\n\nextrinsic instrumentalism is true: something is extrinsically good\nor bad for a person only if it makes her have things that are\nintrinsically good or bad for her.\n\n\nArmed with this assumption, Epicurus can reject the possibility that a\nperson’s death is extrinsically bad for her, arguing as follows.\nBecause Epicurus thought that the death of a person and that\nperson’s existence do not overlap in time, he thought that\n\na person’s death does not make her have any\nexperiences.\n\n\nFrom premises 2, 5 and 6 it follows that\n\na person’s death is not extrinsically good or bad for\nher.\n\n\nTo complete the argument against the harm thesis, Epicurus would need\nan additional assumption, such as this:\n\nsomething is good or bad for a person only if it is either\nintrinsically or extrinsically good or bad for her.\n\n\nPremises 4, 7 and 8 entail that the harm thesis is false:\n\na person’s death is not good or bad for her.\n\n\nIs this Epicurean argument convincing? Let us see if we can find weak\nspots. We can begin with a reservation concerning the term\n‘death.’\n\nEarlier we noted that ‘death’ might be used for dying, the\nevent or process of losing life, or being dead, the property of having\nlost life. The first reservation about the argument is that it is\nstrongest if its uses of ‘death’ refer to being dead, and\nnot to (the event or process of) dying. Here is why.\n\nBeing dead is not an experience, and it does not make a person have\nany experiences. So (on Epicurus’s assumptions) it is neither\nintrinsically nor extrinsically bad for a person to be dead.\nHowever, a person may experience dying, and the experience of\ndying (the experiences dying causes her to have) might well be\nintrinsically bad for her, even if only painful experiences are\nintrinsically bad for her (as premise 1 says). So even if\nbeing dead is not extrinsically bad for a person, the\nquestion arises as to whether, for some people, it is extrinsically\nbad to die. If something makes a person have painful\nexperiences, isn’t it extrinsically bad for her, other things\nbeing equal? At least this much is true: the Epicurean argument does\nnot show that dying painfully is not extrinsically bad for a\nperson.\n\nApparently, then, the argument does not demonstrate that\nneither being dead nor dying is ever bad for those\nwho die. Nevertheless, unless we find further weaknesses in it, it\nstill seems to support powerful conclusions: being dead is neither\ngood nor bad for those who die, and dying is extrinsically good or bad\nfor them only if and insofar as it causes them to have painful\n(pleasant) experiences. Dying is wholly a matter of indifference for\nthose who do not experience it, say because they sleep through it.\n\nBut there are further reservations to consider. Intrinsic hedonism is\nquestionable. So is extrinsic instrumentalism.\n\nConsider the first of these. Which things are intrinsically good or\nbad for us is a controversial matter , but many theorists deny that\nthe list is limited to pleasure and pain. (For further discussion, see\nthe entry on Intrinsic Goodness, the entry on Preferences, and\n“What Makes Someone's Life Go Best,” Parfit 1984, pp.\n493–502.) Adding more things to the list can undermine the Epicurean\nargument.\n\nFor example, we might adopt some version of preferentialism, or the\ndesire fulfillment account, which is the view that it is intrinsically\ngood for us to fulfill one of our desires (assuming that the desire\nmeets various conditions; exactly what these are is\ncontroversial—let us put the matter aside), and it is\nintrinsically bad for us to have a desire that comes to be thwarted.\nNow, many of my desires may be fulfilled, and many may be thwarted,\nwithout my noticing—desire fulfillment need have not\nexperiential upshot. If I want my child to be happy, and she is, my\ndesire is fulfilled, even if she has travelled away so far from me\nthat I cannot interact with her, now or ever again. So preferentialism\nblocks the Epicurean’s move from premise 1 to 2.\n\nPreferentialism also blocks the move to 7. Epicureans cannot use\nextrinsic instrumentalism to deny that a person’s death is\nextrinsically good or bad for her if the things that are intrinsically\ngood or bad for her are not limited to experiences. Preferentialism\nimplies that things may be extrinsically bad for us by virtue of\nthwarting our desires, regardless of whether this has any experiential\nupshot. Suppose, for example, that I desire that my child have a happy\nupbringing, and, for various reasons, it turns out that I am the only\none who can make this happen, but I die suddenly, and as a consequence\nshe has a miserable childhood. Arguably, my untimely death would be\nbad for me, in that it would thwart my desire, even if I die in my\nsleep, and am never aware of her fate. (The role a person’s\nexperience plays in her being harmed is discussed by several\ntheorists, including Rosenbaum 1986, Nussbaum 2013, Silverstein 2013,\nand Fischer 2014.)\n\nNow consider some worries about extrinsic instrumentalism, which says\nthat something is extrinsically good or bad for us only if it causes\nus to have things that are intrinsically good or bad for us.\nThis view overlooks something that Thomas Nagel (1970) noted in his\nseminal essay “Death,” namely the fact that things may be\nextrinsically good or bad for us, other things being equal, by virtue\nof causing us not to have—by virtue of precluding our\nhaving—things that are intrinsically good or bad for us.\nConsider that being rendered unconscious prior to surgery is\nextrinsically good for a patient who otherwise would endure great\nsuffering when the physicians apply the knife, in that it keeps him\nfrom suffering, and not because it causes him to accrue pleasure or\nsome other good. Of course, after waking, the patient might also\naccrue pleasure or some other good as an indirect result of having\nbeen sedated, but in view of the suffering that it averts, being\nsedated is extrinsically good for him whether he receives that\nindirect bonus or not. As well, being made unconscious might be\nextrinsically bad for a person, say when it precedes, not surgery, but\nrather some joyous occasion he will miss because he is not conscious\nwhile it occurs. It is extrinsically bad for him, in this case,\nbecause it prevents him from taking joy in the occasion he misses.\nThis remains true whether or not he also accrues some pain or other\nintrinsic evil as an indirect result of being sedated.\n\nIf it is indeed the case that things may be extrinsically good (bad)\nfor us, other things being equal, by virtue of precluding our having\nevils (goods), we will want to allow for this fact in settling on an\nadequate understanding of what makes things good or bad for us. Next\nlet us consider how this might be done, and the implications for the\nharm thesis.\n",
    "section_title": "3.1 The Epicurean Case",
    "entry_title": "Death",
    "hierarchy_title": "Death || Epicurus and the Harm Thesis || The Epicurean Case",
    "tokenized_text": [
        "epicurus",
        "harm",
        "thesis",
        "epicurean",
        "case",
        "epicurean",
        "case",
        "epicurus",
        "adopted",
        "version",
        "hedonism",
        "according",
        "pleasure",
        "pleasant",
        "experience",
        "thing",
        "intrinsically",
        "good",
        "u",
        "thing",
        "good",
        "u",
        "pain",
        "painful",
        "experience",
        "thing",
        "intrinsically",
        "bad",
        "u",
        "bad",
        "call",
        "view",
        "intrinsic",
        "hedonism",
        "discussion",
        "intrinsic",
        "value",
        "see",
        "entry",
        "intrinsic",
        "vs",
        "extrinsic",
        "value",
        "epicurus",
        "commitment",
        "intrinsic",
        "hedonism",
        "prompted",
        "say",
        "letter",
        "menoeceus",
        "everything",
        "good",
        "bad",
        "lie",
        "sensation",
        "also",
        "claimed",
        "letter",
        "death",
        "death",
        "present",
        "not",
        "death",
        "person",
        "person",
        "existence",
        "overlap",
        "time",
        "basis",
        "assumption",
        "death",
        "existence",
        "concluded",
        "person",
        "death",
        "cause",
        "experience",
        "sensation",
        "indeed",
        "death",
        "deprived",
        "sensation",
        "following",
        "passage",
        "us",
        "thought",
        "harm",
        "thesis",
        "make",
        "familiar",
        "belief",
        "death",
        "nothing",
        "u",
        "since",
        "everything",
        "good",
        "bad",
        "lie",
        "sensation",
        "death",
        "deprived",
        "sensation",
        "fearful",
        "bad",
        "thing",
        "death",
        "nothing",
        "u",
        "since",
        "death",
        "death",
        "present",
        "much",
        "epicurus",
        "argument",
        "unclear",
        "let",
        "u",
        "work",
        "carefully",
        "see",
        "fill",
        "detail",
        "supply",
        "speculation",
        "necessary",
        "develop",
        "reconstruction",
        "aligns",
        "thing",
        "wrote",
        "earlier",
        "mentioned",
        "one",
        "view",
        "epicurus",
        "accepted",
        "state",
        "follows",
        "intrinsic",
        "hedonism",
        "true",
        "person",
        "experience",
        "sensation",
        "pleasure",
        "pleasant",
        "experience",
        "thing",
        "intrinsically",
        "good",
        "thing",
        "good",
        "experience",
        "pain",
        "painful",
        "experience",
        "thing",
        "intrinsically",
        "bad",
        "bad",
        "view",
        "follows",
        "something",
        "intrinsically",
        "good",
        "bad",
        "person",
        "experience",
        "regardless",
        "whether",
        "person",
        "experience",
        "death",
        "death",
        "experience",
        "compare",
        "may",
        "experience",
        "jogging",
        "street",
        "may",
        "experience",
        "cup",
        "front",
        "neither",
        "jogging",
        "cup",
        "experience",
        "experience",
        "speak",
        "mind",
        "cup",
        "let",
        "u",
        "add",
        "observation",
        "argument",
        "person",
        "death",
        "experience",
        "person",
        "death",
        "experience",
        "clearly",
        "experience",
        "intrinsically",
        "good",
        "bad",
        "follows",
        "person",
        "death",
        "intrinsically",
        "good",
        "bad",
        "however",
        "something",
        "intrinsically",
        "bad",
        "person",
        "might",
        "nevertheless",
        "make",
        "thing",
        "happen",
        "detrimental",
        "case",
        "may",
        "extrinsically",
        "bad",
        "seeing",
        "somebody",
        "fall",
        "break",
        "arm",
        "intrinsically",
        "bad",
        "person",
        "might",
        "well",
        "cause",
        "painful",
        "sadness",
        "make",
        "accident",
        "saw",
        "extrinsically",
        "bad",
        "similarly",
        "something",
        "intrinsically",
        "good",
        "person",
        "might",
        "extrinsically",
        "good",
        "epicurus",
        "recognized",
        "possibility",
        "extrinsic",
        "goodness",
        "entirely",
        "clear",
        "understood",
        "seemed",
        "accept",
        "view",
        "call",
        "extrinsic",
        "instrumentalism",
        "something",
        "extrinsically",
        "good",
        "bad",
        "person",
        "make",
        "thing",
        "intrinsically",
        "good",
        "bad",
        "let",
        "u",
        "add",
        "argument",
        "extrinsic",
        "instrumentalism",
        "true",
        "something",
        "extrinsically",
        "good",
        "bad",
        "person",
        "make",
        "thing",
        "intrinsically",
        "good",
        "bad",
        "armed",
        "assumption",
        "epicurus",
        "reject",
        "possibility",
        "person",
        "death",
        "extrinsically",
        "bad",
        "arguing",
        "follows",
        "epicurus",
        "thought",
        "death",
        "person",
        "person",
        "existence",
        "overlap",
        "time",
        "thought",
        "person",
        "death",
        "make",
        "experience",
        "premise",
        "follows",
        "person",
        "death",
        "extrinsically",
        "good",
        "bad",
        "complete",
        "argument",
        "harm",
        "thesis",
        "epicurus",
        "would",
        "need",
        "additional",
        "assumption",
        "something",
        "good",
        "bad",
        "person",
        "either",
        "intrinsically",
        "extrinsically",
        "good",
        "bad",
        "premise",
        "entail",
        "harm",
        "thesis",
        "false",
        "person",
        "death",
        "good",
        "bad",
        "epicurean",
        "argument",
        "convincing",
        "let",
        "u",
        "see",
        "find",
        "weak",
        "spot",
        "begin",
        "reservation",
        "concerning",
        "term",
        "death",
        "earlier",
        "noted",
        "death",
        "might",
        "used",
        "dying",
        "event",
        "process",
        "losing",
        "life",
        "dead",
        "property",
        "lost",
        "life",
        "first",
        "reservation",
        "argument",
        "strongest",
        "us",
        "death",
        "refer",
        "dead",
        "event",
        "process",
        "dying",
        "dead",
        "experience",
        "make",
        "person",
        "experience",
        "epicurus",
        "assumption",
        "neither",
        "intrinsically",
        "extrinsically",
        "bad",
        "person",
        "dead",
        "however",
        "person",
        "may",
        "experience",
        "dying",
        "experience",
        "dying",
        "experience",
        "dying",
        "cause",
        "might",
        "well",
        "intrinsically",
        "bad",
        "even",
        "painful",
        "experience",
        "intrinsically",
        "bad",
        "premise",
        "say",
        "even",
        "dead",
        "extrinsically",
        "bad",
        "person",
        "question",
        "arises",
        "whether",
        "people",
        "extrinsically",
        "bad",
        "die",
        "something",
        "make",
        "person",
        "painful",
        "experience",
        "extrinsically",
        "bad",
        "thing",
        "equal",
        "least",
        "much",
        "true",
        "epicurean",
        "argument",
        "show",
        "dying",
        "painfully",
        "extrinsically",
        "bad",
        "person",
        "apparently",
        "argument",
        "demonstrate",
        "neither",
        "dead",
        "dying",
        "ever",
        "bad",
        "die",
        "nevertheless",
        "unless",
        "find",
        "weakness",
        "still",
        "seems",
        "support",
        "powerful",
        "conclusion",
        "dead",
        "neither",
        "good",
        "bad",
        "die",
        "dying",
        "extrinsically",
        "good",
        "bad",
        "insofar",
        "cause",
        "painful",
        "pleasant",
        "experience",
        "dying",
        "wholly",
        "matter",
        "indifference",
        "experience",
        "say",
        "sleep",
        "reservation",
        "consider",
        "intrinsic",
        "hedonism",
        "questionable",
        "extrinsic",
        "instrumentalism",
        "consider",
        "first",
        "thing",
        "intrinsically",
        "good",
        "bad",
        "u",
        "controversial",
        "matter",
        "many",
        "theorist",
        "deny",
        "list",
        "limited",
        "pleasure",
        "pain",
        "discussion",
        "see",
        "entry",
        "intrinsic",
        "goodness",
        "entry",
        "preference",
        "make",
        "someone",
        "s",
        "life",
        "go",
        "best",
        "parfit",
        "pp",
        "adding",
        "thing",
        "list",
        "undermine",
        "epicurean",
        "argument",
        "example",
        "might",
        "adopt",
        "version",
        "preferentialism",
        "desire",
        "fulfillment",
        "account",
        "view",
        "intrinsically",
        "good",
        "u",
        "fulfill",
        "one",
        "desire",
        "assuming",
        "desire",
        "meet",
        "various",
        "condition",
        "exactly",
        "controversiallet",
        "u",
        "put",
        "matter",
        "aside",
        "intrinsically",
        "bad",
        "u",
        "desire",
        "come",
        "thwarted",
        "many",
        "desire",
        "may",
        "fulfilled",
        "many",
        "may",
        "thwarted",
        "without",
        "noticingdesire",
        "fulfillment",
        "need",
        "experiential",
        "upshot",
        "want",
        "child",
        "happy",
        "desire",
        "fulfilled",
        "even",
        "travelled",
        "away",
        "far",
        "interact",
        "ever",
        "preferentialism",
        "block",
        "epicurean",
        "move",
        "premise",
        "preferentialism",
        "also",
        "block",
        "move",
        "epicurean",
        "use",
        "extrinsic",
        "instrumentalism",
        "deny",
        "person",
        "death",
        "extrinsically",
        "good",
        "bad",
        "thing",
        "intrinsically",
        "good",
        "bad",
        "limited",
        "experience",
        "preferentialism",
        "implies",
        "thing",
        "may",
        "extrinsically",
        "bad",
        "u",
        "virtue",
        "thwarting",
        "desire",
        "regardless",
        "whether",
        "experiential",
        "upshot",
        "suppose",
        "example",
        "desire",
        "child",
        "happy",
        "upbringing",
        "various",
        "reason",
        "turn",
        "one",
        "make",
        "happen",
        "die",
        "suddenly",
        "consequence",
        "miserable",
        "childhood",
        "arguably",
        "untimely",
        "death",
        "would",
        "bad",
        "would",
        "thwart",
        "desire",
        "even",
        "die",
        "sleep",
        "never",
        "aware",
        "fate",
        "role",
        "person",
        "experience",
        "play",
        "harmed",
        "discussed",
        "several",
        "theorist",
        "including",
        "rosenbaum",
        "nussbaum",
        "silverstein",
        "fischer",
        "consider",
        "worry",
        "extrinsic",
        "instrumentalism",
        "say",
        "something",
        "extrinsically",
        "good",
        "bad",
        "u",
        "cause",
        "u",
        "thing",
        "intrinsically",
        "good",
        "bad",
        "u",
        "view",
        "overlook",
        "something",
        "thomas",
        "nagel",
        "noted",
        "seminal",
        "essay",
        "death",
        "namely",
        "fact",
        "thing",
        "may",
        "extrinsically",
        "good",
        "bad",
        "u",
        "thing",
        "equal",
        "virtue",
        "causing",
        "u",
        "haveby",
        "virtue",
        "precluding",
        "havingthings",
        "intrinsically",
        "good",
        "bad",
        "u",
        "consider",
        "rendered",
        "unconscious",
        "prior",
        "surgery",
        "extrinsically",
        "good",
        "patient",
        "otherwise",
        "would",
        "endure",
        "great",
        "suffering",
        "physician",
        "apply",
        "knife",
        "keep",
        "suffering",
        "cause",
        "accrue",
        "pleasure",
        "good",
        "course",
        "waking",
        "patient",
        "might",
        "also",
        "accrue",
        "pleasure",
        "good",
        "indirect",
        "result",
        "sedated",
        "view",
        "suffering",
        "averts",
        "sedated",
        "extrinsically",
        "good",
        "whether",
        "receives",
        "indirect",
        "bonus",
        "well",
        "made",
        "unconscious",
        "might",
        "extrinsically",
        "bad",
        "person",
        "say",
        "precedes",
        "surgery",
        "rather",
        "joyous",
        "occasion",
        "miss",
        "conscious",
        "occurs",
        "extrinsically",
        "bad",
        "case",
        "prevents",
        "taking",
        "joy",
        "occasion",
        "miss",
        "remains",
        "true",
        "whether",
        "also",
        "accrues",
        "pain",
        "intrinsic",
        "evil",
        "indirect",
        "result",
        "sedated",
        "indeed",
        "case",
        "thing",
        "may",
        "extrinsically",
        "good",
        "bad",
        "u",
        "thing",
        "equal",
        "virtue",
        "precluding",
        "evil",
        "good",
        "want",
        "allow",
        "fact",
        "settling",
        "adequate",
        "understanding",
        "make",
        "thing",
        "good",
        "bad",
        "u",
        "next",
        "let",
        "u",
        "consider",
        "might",
        "done",
        "implication",
        "harm",
        "thesis"
    ]
}