{
    "main_text": "Broader significance of Expected Utility (EU) theory || On rational desire\n4.2 On rational desire\n\nEU theory takes a stance on the structure of rational desire too. In\nthis regard, the theory has been criticised on opposing fronts. We\nconsider first the criticism that EU theory is too permissive with\nrespect to what may influence an agent’s desires. We then turn\nto the opposing criticism: that when it comes to desire, EU theory is\nnot permissive enough.\n\nThe worry that EU theory is too permissive with respect to desire is\nrelated to the worry that the theory is unfalsifiable. The\nworry is that apparently irrational preferences by the lights of EU\ntheory can always be construed as rational, under a suitable\ndescription of the options under consideration. As discussed in\n Section 1\n above, preferences that seem to violate Transitivity can be construed\nas consistent with this axiom so long as the options being compared\nvary in their description depending on, amongst other things, the\nother options under consideration. The same goes for preferences that\nseem to violate Separability or Independence (of the contribution of\neach outcome to the overall value of an option), discussed further in\n Section 5.1\n below. One might argue that this is the right way to describe such\nagents’ preferences. After all, an apt model of preference is\nsupposedly one that captures, in the description of final outcomes and\noptions, everything that matters to an agent. In that case, however,\nEU theory is effectively vacuous or impotent as a standard of\nrationality to which agents can aspire. Moreover, it stretches the\nnotion of what are genuine properties of outcomes that can reasonably\nconfer value or be desirable for an agent.\n\nThere are two ways one can react to the idea that an agent’s\npreferences are necessarily consistent with EU theory, with the\nabove-mentioned implications for what the agent may desire:\n\n\n\nOne can resist the claim, asserting that there are additional\nconstraints on the content of an agent’s preferences.\nOn the one hand there may be empirical constraints whereby the content\nof preferences is determined by some tradeoff between fit and\nsimplicity in representing the agent’s greater “web”\nof preference attitudes. On the other hand there may be normative\nconstraints with respect to what sorts of outcomes an agent may\nreasonably discriminate (for relevant discussion, see Tversky 1975;\nBroome 1991a & 1993; Pettit 1993; Dreier 1996; Guala 2006;\nVredenburgh 2020).\n\n\nOne can alternatively embrace the claim, interpreting EU theory not as\na standard against which an agent may pass or fail, but rather as an\norganising principle that enables the characterisation of an\nagent’s desires as well as her beliefs (see esp. Guala\n2008).\n\n\nEither way, it may yet be argued that EU theory does not go far enough\nin structuring an agent’s preference attitudes so that we may\nunderstand the reasons for these preference attitudes.\nDietrich and List (2013 & 2016a) have proposed a more general\nframework that fills this lacuna. In their framework, preferences\nsatisfying some minimal constraints are representable as dependent on\nthe bundle of properties in terms of which each option is perceived by\nthe agent in a given context. Properties can, in turn, be categorised\nas either option properties (which are intrinsic to the\noutcome), relational properties (which concern the outcome in\na particular context), or context properties (which concern\nthe context of choice itself). Such a representation permits more\ndetailed analysis of the reasons for an agent’s preferences and\ncaptures different kinds of context-dependence in an agent’s\nchoices. Furthermore, it permits explicit restrictions on what counts\nas a legitimate reason for preference, or in other words, what\nproperties legitimately feature in an outcome description; such\nrestrictions may help to clarify the normative commitments of EU\ntheory.\n\nThere are also less general models that offer templates for\nunderstanding the reasons underlying preferences. For instance, the\nmultiple criteria decision framework (see, for instance,\nKeeney and Raiffa 1993) takes an agent’s overall preference\nordering over options to be an aggregate of the set of preference\norderings corresponding to all the pertinent dimensions of value.\nUnder certain assumptions, the overall or aggregate preference\nordering is compatible with EU theory. One might otherwise seek to\nunderstand the role of time, or the temporal position of goods, on\npreferences. To this end, outcomes are described in terms of\ntemporally-indexed bundles of goods, or consumption streams\n(for an early model of this kind see Ramsey 1928; a later influential\ntreatment is Koopmans 1960). There may be systematic structure to an\nagent's preferences over these consumption streams, over and above the\nstructure imposed by the EU axioms of preference. For instance, the\naforementioned authors considered and characterised preferences that\nexhibit exponential time discounting.\n\nLet’s turn now to the opposing kind of criticism: that the\nlimited constraints that EU theory imposes on rational preference and\ndesire are nonetheless overly restrictive. Here the focus will be on\nthe compatibility of EU theory with prominent ethical positions\nregarding the choice-worthiness of acts, as well as meta-ethical\npositions regarding the nature of value and its relationship to\nbelief.\n\nOne may well wonder whether EU theory, indeed decision theory more\ngenerally, is neutral with respect to normative ethics, or whether it\nis compatible only with ethical consequentialism, given that\nthe ranking of an act is fully determined by the utility of its\npossible outcomes. Such a model seems at odds with\nnonconsequentialist ethical theories for which the\nchoice-worthiness of acts purportedly depends on more than the moral\nvalue of their consequences. The model does not seem able to\naccommodate basic deontological notions like agent relativity,\nabsolute prohibitions or permissible and yet suboptimal acts.\n\nAn initial response, however, is that one should not read too much\ninto the formal concepts of decision theory. The utility measure over\nacts and outcomes is simply a convenient way to represent an ordering,\nand leaves much scope for different ways of identifying and evaluating\noutcomes. Just as an agent’s utility function need not be\ninsensitive to ethical considerations in general (a common\nmisconception due to the prevalence of selfish preferences in economic\nmodels; see, for instance, Sen 1977), nor need it be insensitive to\nspecifically nonconsequentialist or deontological ethical\nconsiderations. It all depends on how acts and their outcomes are\ndistinguished and evaluated. For starters, the character of an act may\nfeature as a property of all its possible outcomes. Moreover, whether\nsome event befalls or is perpetrated by the deciding agent or rather\nsomeone else may be relevant. That an act involves lying, say, can be\nreferenced in all possible outcomes of the act, and furthermore this\nlying on the part of the deciding agent can be distinguished from the\nlying of others. In general, acts and their outcomes can be\ndistinguished according to whatever matters morally, be it a complex\nrelational property to do with how and when the act is chosen, by\nwhom, and/or in what way some state of affairs results from the act.\nFor early discussions on how a wide range of ethical properties can be\naccommodated in the description of acts and outcomes, see, for\ninstance, Sen (1982), Vallentyne (1988), Broome (1991b) and Dreier\n(1993). This idea has since been embraced by others associated with\nthe so-called “consequentializing” program, including\nLouise (2004) and Portmore (2007). The idea is that the normative\nadvice of putatively nonconsequentialist ethical theories can be\nrepresented in terms of a ranking of acts/outcomes corresponding to\nsome value function, as per consequentialist ethical theories (see too\nColyvan et al. 2010).\n\nA sticking point for reconciling decision theory with all forms of\nnonconsequentialism is the difficulty in accommodating absolute\nprohibitions or side constraints (see Oddie and Milne\n1999; Jackson and Smith 2006). For instance, suppose there is a moral\nprohibition against killing an innocent person, whatever else is at\nstake. Perhaps such a constraint is best modelled in terms of a\nlexical ranking and corresponding value function, whereby the\nkilling-innocents status of an act/outcome takes priority in\ndetermining its relative rank/value. But this has counterintuitive\nimplications in the face of risk since very many acts will have some\nchance, however small, of killing an innocent. The lesson here may\nsimply be that the theories in question require development; any\nmature ethical theory owes us an account of how to act under risk or\nuncertainty. What is arguably a more compelling challenge for the\nreconciliation of decision theory and nonconsequentialism is the\naccommodation of “agent-centred options” and associated\n“supererogation”. Portmore (e.g., 2007) and Lazar (e.g.,\n2017) offer proposals to this effect, which appeal (in different ways)\nto the moral ranking of acts/outcomes as distinct from the personal\ncosts to the agent of pursuing these acts/outcomes.\n\nTo the extent that decision theory can be reconciled with the full\nrange of ethical theories, should we say that there are no meaningful\ndistinctions between these theories? Brown (2011) and Dietrich and\nList (2017) demonstrate that in fact the choice-theoretic\nrepresentation of ethical theories better facilitates distinctions\nbetween them; terms like “(non)consequentialism” can be\nprecisely defined, albeit in debatable ways. More generally, we can\ncatalogue theories in terms of the kinds of properties (whether\nintrinsic or in some sense relational) that distinguish acts/outcomes\nand also in terms of the nature of the ranking of acts/outcomes that\nthey yield (whether transitive, complete, continuous and so on). This\nalso serves to reveal departures from EU theory.\n\nIndeed, some of the most compelling counterexamples to EU axioms of\npreference rest on ethical considerations. Recall our earlier\ndiscussion of the basic Ordering axioms in\n Section 1.\n The Transitivity axiom has been challenged by appeal to\nethically-motivated examples of preference cycles (see Temkin 2012).\nThe notion of a non-continuous lexical ordering was mentioned above in\nrelation to ethical side constraints. The dispensability of the\nCompleteness axiom, too, is often motivated by appeal to examples\ninvolving competing ethical values that are difficult to tradeoff\nagainst each other, like average versus total welfare. Other\nsuggestive examples against Completeness involve competing notions of\npersonal welfare (see, e.g., Levi 1986; Chang 2002). Must a rational\nagent have a defined preference between, say, two career options that\npull in different directions as regards opportunities for creative\nself-expression versus community service (perhaps a career as a dancer\nversus a career as a doctor in remote regions)? Note that some of\nthese challenges to EU theory are discussed in more depth in\n Section 5\n below.\n\nFinally, we turn to the potential meta-ethical commitments of EU\ntheory. David Lewis (1988, 1996) famously employed EU theory to argue\nagainst anti-Humeanism, the position that we are sometimes\nmoved entirely by our beliefs about what would be good, rather than by\nour desires as the Humean claims. He formulated the anti-Humean theory\nas postulating a necessary connection between, on the one hand, an\nagent’s desire for any proposition \\(A\\), and, on the other\nhand, her belief in a proposition about \\(A\\)’s goodness; and\nclaimed to prove that when such a connection is formulated in terms of\nEU theory, the agent in question will be dynamically incoherent.\nSeveral people have criticised Lewis’s argument. For instance,\nBroome (1991c), Byrne and Hájek (1997) and Hájek and\nPettit (2004) suggest formulations of anti-Humeanism that are immune\nto Lewis’ criticism, while Stefánsson (2014) and Bradley\nand Stefánsson (2016) argue that Lewis’ proof relies on a\nfalse assumption. Nevertheless, Lewis’ argument no doubt\nprovoked an interesting debate about the sorts of connections between\nbelief and desire that EU theory permits. There are, moreover, further\nquestions of meta-ethical relevance that one might investigate\nregarding the role and structure of desire in EU theory. For instance,\nJeffrey (1974) and Sen (1977) offer some preliminary investigations as\nto whether the theory can accommodate higher-order\ndesires/preferences, and if so, how these relate to first-order\ndesires/preferences.\n",
    "section_title": "4.2 On rational desire",
    "entry_title": "Decision Theory",
    "hierarchy_title": "Decision Theory || Broader significance of Expected Utility (EU) theory || On rational desire",
    "tokenized_text": [
        "broader",
        "significance",
        "expected",
        "utility",
        "eu",
        "theory",
        "rational",
        "desire",
        "rational",
        "desire",
        "eu",
        "theory",
        "take",
        "stance",
        "structure",
        "rational",
        "desire",
        "regard",
        "theory",
        "criticised",
        "opposing",
        "front",
        "consider",
        "first",
        "criticism",
        "eu",
        "theory",
        "permissive",
        "respect",
        "may",
        "influence",
        "agent",
        "desire",
        "turn",
        "opposing",
        "criticism",
        "come",
        "desire",
        "eu",
        "theory",
        "permissive",
        "enough",
        "worry",
        "eu",
        "theory",
        "permissive",
        "respect",
        "desire",
        "related",
        "worry",
        "theory",
        "unfalsifiable",
        "worry",
        "apparently",
        "irrational",
        "preference",
        "light",
        "eu",
        "theory",
        "always",
        "construed",
        "rational",
        "suitable",
        "description",
        "option",
        "consideration",
        "discussed",
        "section",
        "preference",
        "seem",
        "violate",
        "transitivity",
        "construed",
        "consistent",
        "axiom",
        "long",
        "option",
        "compared",
        "vary",
        "description",
        "depending",
        "amongst",
        "thing",
        "option",
        "consideration",
        "go",
        "preference",
        "seem",
        "violate",
        "separability",
        "independence",
        "contribution",
        "outcome",
        "overall",
        "value",
        "option",
        "discussed",
        "section",
        "one",
        "might",
        "argue",
        "right",
        "way",
        "describe",
        "agent",
        "preference",
        "apt",
        "model",
        "preference",
        "supposedly",
        "one",
        "capture",
        "description",
        "final",
        "outcome",
        "option",
        "everything",
        "matter",
        "agent",
        "case",
        "however",
        "eu",
        "theory",
        "effectively",
        "vacuous",
        "impotent",
        "standard",
        "rationality",
        "agent",
        "aspire",
        "moreover",
        "stretch",
        "notion",
        "genuine",
        "property",
        "outcome",
        "reasonably",
        "confer",
        "value",
        "desirable",
        "agent",
        "two",
        "way",
        "one",
        "react",
        "idea",
        "agent",
        "preference",
        "necessarily",
        "consistent",
        "eu",
        "theory",
        "abovementioned",
        "implication",
        "agent",
        "may",
        "desire",
        "one",
        "resist",
        "claim",
        "asserting",
        "additional",
        "constraint",
        "content",
        "agent",
        "preference",
        "one",
        "hand",
        "may",
        "empirical",
        "constraint",
        "whereby",
        "content",
        "preference",
        "determined",
        "tradeoff",
        "fit",
        "simplicity",
        "representing",
        "agent",
        "greater",
        "web",
        "preference",
        "attitude",
        "hand",
        "may",
        "normative",
        "constraint",
        "respect",
        "sort",
        "outcome",
        "agent",
        "may",
        "reasonably",
        "discriminate",
        "relevant",
        "discussion",
        "see",
        "tversky",
        "broome",
        "a",
        "pettit",
        "dreier",
        "guala",
        "vredenburgh",
        "one",
        "alternatively",
        "embrace",
        "claim",
        "interpreting",
        "eu",
        "theory",
        "standard",
        "agent",
        "may",
        "pas",
        "fail",
        "rather",
        "organising",
        "principle",
        "enables",
        "characterisation",
        "agent",
        "desire",
        "well",
        "belief",
        "see",
        "esp",
        "guala",
        "either",
        "way",
        "may",
        "yet",
        "argued",
        "eu",
        "theory",
        "go",
        "far",
        "enough",
        "structuring",
        "agent",
        "preference",
        "attitude",
        "may",
        "understand",
        "reason",
        "preference",
        "attitude",
        "dietrich",
        "list",
        "a",
        "proposed",
        "general",
        "framework",
        "fill",
        "lacuna",
        "framework",
        "preference",
        "satisfying",
        "minimal",
        "constraint",
        "representable",
        "dependent",
        "bundle",
        "property",
        "term",
        "option",
        "perceived",
        "agent",
        "given",
        "context",
        "property",
        "turn",
        "categorised",
        "either",
        "option",
        "property",
        "intrinsic",
        "outcome",
        "relational",
        "property",
        "concern",
        "outcome",
        "particular",
        "context",
        "context",
        "property",
        "concern",
        "context",
        "choice",
        "representation",
        "permit",
        "detailed",
        "analysis",
        "reason",
        "agent",
        "preference",
        "capture",
        "different",
        "kind",
        "contextdependence",
        "agent",
        "choice",
        "furthermore",
        "permit",
        "explicit",
        "restriction",
        "count",
        "legitimate",
        "reason",
        "preference",
        "word",
        "property",
        "legitimately",
        "feature",
        "outcome",
        "description",
        "restriction",
        "may",
        "help",
        "clarify",
        "normative",
        "commitment",
        "eu",
        "theory",
        "also",
        "le",
        "general",
        "model",
        "offer",
        "template",
        "understanding",
        "reason",
        "underlying",
        "preference",
        "instance",
        "multiple",
        "criterion",
        "decision",
        "framework",
        "see",
        "instance",
        "keeney",
        "raiffa",
        "take",
        "agent",
        "overall",
        "preference",
        "ordering",
        "option",
        "aggregate",
        "set",
        "preference",
        "ordering",
        "corresponding",
        "pertinent",
        "dimension",
        "value",
        "certain",
        "assumption",
        "overall",
        "aggregate",
        "preference",
        "ordering",
        "compatible",
        "eu",
        "theory",
        "one",
        "might",
        "otherwise",
        "seek",
        "understand",
        "role",
        "time",
        "temporal",
        "position",
        "good",
        "preference",
        "end",
        "outcome",
        "described",
        "term",
        "temporallyindexed",
        "bundle",
        "good",
        "consumption",
        "stream",
        "early",
        "model",
        "kind",
        "see",
        "ramsey",
        "later",
        "influential",
        "treatment",
        "koopmans",
        "may",
        "systematic",
        "structure",
        "agent",
        "s",
        "preference",
        "consumption",
        "stream",
        "structure",
        "imposed",
        "eu",
        "axiom",
        "preference",
        "instance",
        "aforementioned",
        "author",
        "considered",
        "characterised",
        "preference",
        "exhibit",
        "exponential",
        "time",
        "discounting",
        "let",
        "turn",
        "opposing",
        "kind",
        "criticism",
        "limited",
        "constraint",
        "eu",
        "theory",
        "imposes",
        "rational",
        "preference",
        "desire",
        "nonetheless",
        "overly",
        "restrictive",
        "focus",
        "compatibility",
        "eu",
        "theory",
        "prominent",
        "ethical",
        "position",
        "regarding",
        "choiceworthiness",
        "act",
        "well",
        "metaethical",
        "position",
        "regarding",
        "nature",
        "value",
        "relationship",
        "belief",
        "one",
        "may",
        "well",
        "wonder",
        "whether",
        "eu",
        "theory",
        "indeed",
        "decision",
        "theory",
        "generally",
        "neutral",
        "respect",
        "normative",
        "ethic",
        "whether",
        "compatible",
        "ethical",
        "consequentialism",
        "given",
        "ranking",
        "act",
        "fully",
        "determined",
        "utility",
        "possible",
        "outcome",
        "model",
        "seems",
        "odds",
        "nonconsequentialist",
        "ethical",
        "theory",
        "choiceworthiness",
        "act",
        "purportedly",
        "depends",
        "moral",
        "value",
        "consequence",
        "model",
        "seem",
        "able",
        "accommodate",
        "basic",
        "deontological",
        "notion",
        "like",
        "agent",
        "relativity",
        "absolute",
        "prohibition",
        "permissible",
        "yet",
        "suboptimal",
        "act",
        "initial",
        "response",
        "however",
        "one",
        "read",
        "much",
        "formal",
        "concept",
        "decision",
        "theory",
        "utility",
        "measure",
        "act",
        "outcome",
        "simply",
        "convenient",
        "way",
        "represent",
        "ordering",
        "leaf",
        "much",
        "scope",
        "different",
        "way",
        "identifying",
        "evaluating",
        "outcome",
        "agent",
        "utility",
        "function",
        "need",
        "insensitive",
        "ethical",
        "consideration",
        "general",
        "common",
        "misconception",
        "due",
        "prevalence",
        "selfish",
        "preference",
        "economic",
        "model",
        "see",
        "instance",
        "sen",
        "need",
        "insensitive",
        "specifically",
        "nonconsequentialist",
        "deontological",
        "ethical",
        "consideration",
        "depends",
        "act",
        "outcome",
        "distinguished",
        "evaluated",
        "starter",
        "character",
        "act",
        "may",
        "feature",
        "property",
        "possible",
        "outcome",
        "moreover",
        "whether",
        "event",
        "befalls",
        "perpetrated",
        "deciding",
        "agent",
        "rather",
        "someone",
        "else",
        "may",
        "relevant",
        "act",
        "involves",
        "lying",
        "say",
        "referenced",
        "possible",
        "outcome",
        "act",
        "furthermore",
        "lying",
        "part",
        "deciding",
        "agent",
        "distinguished",
        "lying",
        "others",
        "general",
        "act",
        "outcome",
        "distinguished",
        "according",
        "whatever",
        "matter",
        "morally",
        "complex",
        "relational",
        "property",
        "act",
        "chosen",
        "andor",
        "way",
        "state",
        "affair",
        "result",
        "act",
        "early",
        "discussion",
        "wide",
        "range",
        "ethical",
        "property",
        "accommodated",
        "description",
        "act",
        "outcome",
        "see",
        "instance",
        "sen",
        "vallentyne",
        "broome",
        "b",
        "dreier",
        "idea",
        "since",
        "embraced",
        "others",
        "associated",
        "socalled",
        "consequentializing",
        "program",
        "including",
        "louise",
        "portmore",
        "idea",
        "normative",
        "advice",
        "putatively",
        "nonconsequentialist",
        "ethical",
        "theory",
        "represented",
        "term",
        "ranking",
        "actsoutcomes",
        "corresponding",
        "value",
        "function",
        "per",
        "consequentialist",
        "ethical",
        "theory",
        "see",
        "colyvan",
        "et",
        "al",
        "sticking",
        "point",
        "reconciling",
        "decision",
        "theory",
        "form",
        "nonconsequentialism",
        "difficulty",
        "accommodating",
        "absolute",
        "prohibition",
        "side",
        "constraint",
        "see",
        "oddie",
        "milne",
        "jackson",
        "smith",
        "instance",
        "suppose",
        "moral",
        "prohibition",
        "killing",
        "innocent",
        "person",
        "whatever",
        "else",
        "stake",
        "perhaps",
        "constraint",
        "best",
        "modelled",
        "term",
        "lexical",
        "ranking",
        "corresponding",
        "value",
        "function",
        "whereby",
        "killinginnocents",
        "status",
        "actoutcome",
        "take",
        "priority",
        "determining",
        "relative",
        "rankvalue",
        "counterintuitive",
        "implication",
        "face",
        "risk",
        "since",
        "many",
        "act",
        "chance",
        "however",
        "small",
        "killing",
        "innocent",
        "lesson",
        "may",
        "simply",
        "theory",
        "question",
        "require",
        "development",
        "mature",
        "ethical",
        "theory",
        "owes",
        "u",
        "account",
        "act",
        "risk",
        "uncertainty",
        "arguably",
        "compelling",
        "challenge",
        "reconciliation",
        "decision",
        "theory",
        "nonconsequentialism",
        "accommodation",
        "agentcentred",
        "option",
        "associated",
        "supererogation",
        "portmore",
        "eg",
        "lazar",
        "eg",
        "offer",
        "proposal",
        "effect",
        "appeal",
        "different",
        "way",
        "moral",
        "ranking",
        "actsoutcomes",
        "distinct",
        "personal",
        "cost",
        "agent",
        "pursuing",
        "actsoutcomes",
        "extent",
        "decision",
        "theory",
        "reconciled",
        "full",
        "range",
        "ethical",
        "theory",
        "say",
        "meaningful",
        "distinction",
        "theory",
        "brown",
        "dietrich",
        "list",
        "demonstrate",
        "fact",
        "choicetheoretic",
        "representation",
        "ethical",
        "theory",
        "better",
        "facilitates",
        "distinction",
        "term",
        "like",
        "non",
        "consequentialism",
        "precisely",
        "defined",
        "albeit",
        "debatable",
        "way",
        "generally",
        "catalogue",
        "theory",
        "term",
        "kind",
        "property",
        "whether",
        "intrinsic",
        "sense",
        "relational",
        "distinguish",
        "actsoutcomes",
        "also",
        "term",
        "nature",
        "ranking",
        "actsoutcomes",
        "yield",
        "whether",
        "transitive",
        "complete",
        "continuous",
        "also",
        "serf",
        "reveal",
        "departure",
        "eu",
        "theory",
        "indeed",
        "compelling",
        "counterexample",
        "eu",
        "axiom",
        "preference",
        "rest",
        "ethical",
        "consideration",
        "recall",
        "earlier",
        "discussion",
        "basic",
        "ordering",
        "axiom",
        "section",
        "transitivity",
        "axiom",
        "challenged",
        "appeal",
        "ethicallymotivated",
        "example",
        "preference",
        "cycle",
        "see",
        "temkin",
        "notion",
        "noncontinuous",
        "lexical",
        "ordering",
        "mentioned",
        "relation",
        "ethical",
        "side",
        "constraint",
        "dispensability",
        "completeness",
        "axiom",
        "often",
        "motivated",
        "appeal",
        "example",
        "involving",
        "competing",
        "ethical",
        "value",
        "difficult",
        "tradeoff",
        "like",
        "average",
        "versus",
        "total",
        "welfare",
        "suggestive",
        "example",
        "completeness",
        "involve",
        "competing",
        "notion",
        "personal",
        "welfare",
        "see",
        "eg",
        "levi",
        "chang",
        "must",
        "rational",
        "agent",
        "defined",
        "preference",
        "say",
        "two",
        "career",
        "option",
        "pull",
        "different",
        "direction",
        "regard",
        "opportunity",
        "creative",
        "selfexpression",
        "versus",
        "community",
        "service",
        "perhaps",
        "career",
        "dancer",
        "versus",
        "career",
        "doctor",
        "remote",
        "region",
        "note",
        "challenge",
        "eu",
        "theory",
        "discussed",
        "depth",
        "section",
        "finally",
        "turn",
        "potential",
        "metaethical",
        "commitment",
        "eu",
        "theory",
        "david",
        "lewis",
        "famously",
        "employed",
        "eu",
        "theory",
        "argue",
        "antihumeanism",
        "position",
        "sometimes",
        "moved",
        "entirely",
        "belief",
        "would",
        "good",
        "rather",
        "desire",
        "humean",
        "claim",
        "formulated",
        "antihumean",
        "theory",
        "postulating",
        "necessary",
        "connection",
        "one",
        "hand",
        "agent",
        "desire",
        "proposition",
        "a",
        "hand",
        "belief",
        "proposition",
        "a",
        "goodness",
        "claimed",
        "prove",
        "connection",
        "formulated",
        "term",
        "eu",
        "theory",
        "agent",
        "question",
        "dynamically",
        "incoherent",
        "several",
        "people",
        "criticised",
        "lewis",
        "argument",
        "instance",
        "broome",
        "c",
        "byrne",
        "hájek",
        "hájek",
        "pettit",
        "suggest",
        "formulation",
        "antihumeanism",
        "immune",
        "lewis",
        "criticism",
        "stefánsson",
        "bradley",
        "stefánsson",
        "argue",
        "lewis",
        "proof",
        "relies",
        "false",
        "assumption",
        "nevertheless",
        "lewis",
        "argument",
        "doubt",
        "provoked",
        "interesting",
        "debate",
        "sort",
        "connection",
        "belief",
        "desire",
        "eu",
        "theory",
        "permit",
        "moreover",
        "question",
        "metaethical",
        "relevance",
        "one",
        "might",
        "investigate",
        "regarding",
        "role",
        "structure",
        "desire",
        "eu",
        "theory",
        "instance",
        "jeffrey",
        "sen",
        "offer",
        "preliminary",
        "investigation",
        "whether",
        "theory",
        "accommodate",
        "higherorder",
        "desirespreferences",
        "relate",
        "firstorder",
        "desirespreferences"
    ]
}