{
    "main_text": "Overtly Foundational Contributions || The Rise of Modern Set Theory\n2.3 The Rise of Modern Set Theory\n\nSet-theoretic assumptions and procedures already inform Dedekind’s\nStetigkeit und irrationale Zahlen, as we saw. In particular,\nthe system of rational numbers is assumed to be an infinite set; the\ncollection of arbitrary cuts of rational numbers is treated as another\ninfinite set; and when supplied with an order relation and arithmetic\noperations on its elements, the latter gives rise to a new complete\nordered field. Parallel moves can be found in the sketches, from\nDedekind’s Nachlass, on how to introduce the integers and the\nrational numbers. Once more we start with an infinite system, here\nthat of all the natural numbers, and new number systems are\nconstructed out of it set-theoretically (although the full power set\nis not needed in those cases). Finally, Dedekind uses set-theoretic\ntechniques in his other mathematical work as well (e.g. in his\ntreatment of modular arithmetic and his construction of ideals as\ninfinite sets, to be discussed further below). It should be emphasized\nthat the application of such techniques was novel and bold at the\ntime. While a few mathematicians, such as Cantor, used them as well,\nmany others, like Kronecker, rejected them. In fact, by working\nseriously with actual infinities Dedekind took a stance incompatible\nwith that of his teacher Gauss, who had allowed for the infinite only\nas a “manner of speaking” (cf. Ferreirós 1999, ch.\n7, also Edwards 1983).\n\nWhat happens in Was sind und was sollen die Zahlen?, in the\ncontext of Dedekind’s logicist reconstruction of the natural numbers,\nis that the adoption of set-theoretic techniques is raised to a new\nlevel of clarity and generality. Dedekind not only presents\nset-theoretic definitions of various mathematical notions, he also\nadds a systematic reflection on the means used thereby and he expands\nthat use in certain respects. For those reasons, the essay constitutes\nan important step in the emergence of modern set theory. In addition,\nwe already saw that Dedekind presents the notion of set, together with\nthose of object and function, as basic. Here an object is anything for\nwhich it is determinate how to reason about it, including having\nappropriate criteria of identity (Tait 1996). Sets are\nobjects about which we reason by considering their elements, and this\nis all that matters about them. In other words, sets are to be\nidentified extensionally, as Dedekind is one of the first to\nemphasize. (Even as important a contributor to set theory as Bertrand\nRussell struggles with this point well into the twentieth century.)\nDedekind is also among the first to consider, not just sets of\nnumbers, but sets of other kinds of objects as well.\n\nFunctions are to be conceived of extensionally too, as ways of\ncorrelating the elements of sets. But unlike in later axiomatic set\ntheory, Dedekind does not reduce functions to sets of tuples. (Not\nunreasonably, he takes the ability to map one thing onto another, or\nto represent one by the other, to be fundamental for human thought;\nDedekind 1888a, preface, cf. Klev 2017). Another important aspect of\nDedekind’s views about functions is that, with respect to their\nintended range, he allows for arbitrary functional correlations\nbetween sets of numbers, indeed between sets of objects more\ngenerally. (For the gradual development of his views in this\nconnection, see Sieg & Schlimm 2005.) He thus rejects previous,\noften implicit restrictions of the notion of function to, e.g.,\nfunctions presented by familiar formulas, functions representable in\nintuition via their graphs, or functions decidable by a formal\nprocedure. In other words, he works with a generalized notion of\nfunction. In this respect he adopts, and expands on, the position of\nanother of his teachers: Dirichlet (Stein 1988, Ferreirós 1999,\nch. 7). Dedekind’s notion of set is general in the same sense.\n\nSuch generalized notions of set and function, together with the acceptance\nof the actual infinite, were soon attacked by\nfinitistically and constructively oriented mathematicians like\nKronecker. Dedekind defended his approach by pointing to its\nfruitfulness (Dedekind 1888a, first footnote, cf. Edwards 1983,\nFerreirós 1999, ch. 7). But eventually he came to see one\nfeature of it as problematic: his implicit acceptance of a general\ncomprehension principle (another sense in which his notion of set is\nunrestricted). We already touched on a specific way in which this\ncomes up in Dedekind’s work. Namely, in Was sind und was sollen\ndie Zahlen? he introduces “the totality of all things that\ncan be objects of my thought” (his “universal set”),\ntogether with arbitrary subsets of that totality (a general\nAussonderungsaxiom is used). But then, any collection of\nobjects counts as a set.\n\nAs just noted, Dedekind goes beyond considering only sets of numbers\nin his 1888 essay. This is a significant extension of the notion of\nset, or of its application, an extension about which one might be\nconcerned. An even more worrisome aspect consists of the particular\nway in which Dedekind’s all-encompassing totality is introduced,\nnamely by reference to “human thought”, since this leads\nto the question of whether crude psychologistic features are involved\n(more on that topic in Section 3). But the most problematic\nfeature—and the one Dedekind came to take seriously\nhimself—is a third one: his set theory is subject to the\nset-theoretic antinomies, including Russell’s antinomy. (If any\ncollection of objects counts as a set, then also Russell’s collection\nof all sets that do not contain themselves, and this leads quickly to\na contradiction.) Dedekind seems to have found out about such problems\nfrom Cantor in the late 1890s (who informed him that the collection of\nall ordinal numbers is an “inconsistent totality”, as is\nthe collection of all “objects of thought”). This news\nshocked him initially, so much that he delayed republication of\nWas sind und was sollen die Zahlen?; he even expressed doubts\nabout “whether human thinking is fully rational” (Dedekind\n1930–32, Vol. 3, p. 449, Dedekind 1996a, p. 836). Later he\nregained belief in the “inner harmony” of his approach,\nbut without providing a solution to these problems himself (Dedekind\n1930–32, Vol. 3, p. 343, Preface to the third edition, published in\n1911).\n\nRussell’s antinomy and related ones establish that Dedekind’s original\nconception of set is untenable. Yet they do not invalidate his other\ncontributions to set theory. His analysis of continuity, the use of\nDedekind cuts in the introduction of the real numbers, the definition\nof being Dedekind-infinite, the formulation of the Dedekind-Peano\naxioms, the proof of their categoricity, the analysis of the natural\nnumbers as finite ordinal numbers, the justification of mathematical\ninduction and recursion, and most basically, the insistence on\nextensional, general notions of set and function, as well as the\nacceptance of the actual infinite—all of these contributions can\nbe isolated from the set-theoretic antinomies. As such, they have been\nbuilt into the very core of axiomatic set theory, model theory,\nrecursion theory, and other parts of current logic.\n\nAnd there are further contributions to set theory we owe to Dedekind.\nSome of these do not appear in his published writings, but in his\ncorrespondence. Especially significant is his exchange of letters,\nstarting in 1872, with Cantor (Noether & Cavaillès 1937,\nMeschkowski & Nilson 1991). These letters contain a discussion of\nCantor’s and Dedekind’s respective treatments of the real numbers.\nBeyond that, they amount to a joint exploration of the notions of set\nand infinity. Among Dedekind’s specific contributions in this context\nare the following: He impresses Cantor with a proof that not only the\nset of rational numbers but also the set of all algebraic numbers is\ncountable (Ferreirós 1999, ch. 6). This result led, at least in\npart, to Cantor’s further study of infinite cardinalities and to his\ndiscovery, soon thereafter, that the set of all real numbers is not\ncountable. Dedekind also provides a proof of\nthe Cantor-Bernstein Theorem (that between any two sets which can be\nembedded one-to-one into each other there exists a bijection, so that\nthey have the same cardinality). This is another basic result in the\ntheory of transfinite cardinals (Ferreirós 1999, ch. 7).\n\nFinally, in the development of set theory during the twentieth century\nit became clear that several of Dedekind’s results and procedures can\nbe generalized in important ways. Perhaps most significantly, Zermelo\nand von Neumann succeeded in extending his analysis of mathematical\ninduction and recursion to the higher infinite, thus expanding on, and\nestablishing more firmly, Cantor’s theory of transfinite ordinals and\ncardinals. Looking back on all of these contributions, it is no wonder\nthat Zermelo—who knew the relevant history well—considered\nthe modern theory of sets as having been “created by Cantor and\nDedekind” (quoted in Ferreirós 2016b).\n",
    "section_title": "2.3 The Rise of Modern Set Theory",
    "entry_title": "Dedekind’s Contributions to the Foundations of Mathematics",
    "hierarchy_title": "Dedekind’s Contributions to the Foundations of Mathematics || Overtly Foundational Contributions || The Rise of Modern Set Theory",
    "tokenized_text": [
        "overtly",
        "foundational",
        "contribution",
        "rise",
        "modern",
        "set",
        "theory",
        "rise",
        "modern",
        "set",
        "theory",
        "settheoretic",
        "assumption",
        "procedure",
        "already",
        "inform",
        "dedekind",
        "stetigkeit",
        "und",
        "irrationale",
        "zahlen",
        "saw",
        "particular",
        "system",
        "rational",
        "number",
        "assumed",
        "infinite",
        "set",
        "collection",
        "arbitrary",
        "cut",
        "rational",
        "number",
        "treated",
        "another",
        "infinite",
        "set",
        "supplied",
        "order",
        "relation",
        "arithmetic",
        "operation",
        "element",
        "latter",
        "give",
        "rise",
        "new",
        "complete",
        "ordered",
        "field",
        "parallel",
        "move",
        "found",
        "sketch",
        "dedekind",
        "nachlass",
        "introduce",
        "integer",
        "rational",
        "number",
        "start",
        "infinite",
        "system",
        "natural",
        "number",
        "new",
        "number",
        "system",
        "constructed",
        "settheoretically",
        "although",
        "full",
        "power",
        "set",
        "needed",
        "case",
        "finally",
        "dedekind",
        "us",
        "settheoretic",
        "technique",
        "mathematical",
        "work",
        "well",
        "eg",
        "treatment",
        "modular",
        "arithmetic",
        "construction",
        "ideal",
        "infinite",
        "set",
        "discussed",
        "emphasized",
        "application",
        "technique",
        "novel",
        "bold",
        "time",
        "mathematician",
        "cantor",
        "used",
        "well",
        "many",
        "others",
        "like",
        "kronecker",
        "rejected",
        "fact",
        "working",
        "seriously",
        "actual",
        "infinity",
        "dedekind",
        "took",
        "stance",
        "incompatible",
        "teacher",
        "gauss",
        "allowed",
        "infinite",
        "manner",
        "speaking",
        "cf",
        "ferreirós",
        "ch",
        "also",
        "edward",
        "happens",
        "sind",
        "und",
        "sollen",
        "die",
        "zahlen",
        "context",
        "dedekind",
        "logicist",
        "reconstruction",
        "natural",
        "number",
        "adoption",
        "settheoretic",
        "technique",
        "raised",
        "new",
        "level",
        "clarity",
        "generality",
        "dedekind",
        "present",
        "settheoretic",
        "definition",
        "various",
        "mathematical",
        "notion",
        "also",
        "add",
        "systematic",
        "reflection",
        "mean",
        "used",
        "thereby",
        "expands",
        "use",
        "certain",
        "respect",
        "reason",
        "essay",
        "constitutes",
        "important",
        "step",
        "emergence",
        "modern",
        "set",
        "theory",
        "addition",
        "already",
        "saw",
        "dedekind",
        "present",
        "notion",
        "set",
        "together",
        "object",
        "function",
        "basic",
        "object",
        "anything",
        "determinate",
        "reason",
        "including",
        "appropriate",
        "criterion",
        "identity",
        "tait",
        "set",
        "object",
        "reason",
        "considering",
        "element",
        "matter",
        "word",
        "set",
        "identified",
        "extensionally",
        "dedekind",
        "one",
        "first",
        "emphasize",
        "even",
        "important",
        "contributor",
        "set",
        "theory",
        "bertrand",
        "russell",
        "struggle",
        "point",
        "well",
        "twentieth",
        "century",
        "dedekind",
        "also",
        "among",
        "first",
        "consider",
        "set",
        "number",
        "set",
        "kind",
        "object",
        "well",
        "function",
        "conceived",
        "extensionally",
        "way",
        "correlating",
        "element",
        "set",
        "unlike",
        "later",
        "axiomatic",
        "set",
        "theory",
        "dedekind",
        "reduce",
        "function",
        "set",
        "tuples",
        "unreasonably",
        "take",
        "ability",
        "map",
        "one",
        "thing",
        "onto",
        "another",
        "represent",
        "one",
        "fundamental",
        "human",
        "thought",
        "dedekind",
        "a",
        "preface",
        "cf",
        "klev",
        "another",
        "important",
        "aspect",
        "dedekind",
        "view",
        "function",
        "respect",
        "intended",
        "range",
        "allows",
        "arbitrary",
        "functional",
        "correlation",
        "set",
        "number",
        "indeed",
        "set",
        "object",
        "generally",
        "gradual",
        "development",
        "view",
        "connection",
        "see",
        "sieg",
        "schlimm",
        "thus",
        "reject",
        "previous",
        "often",
        "implicit",
        "restriction",
        "notion",
        "function",
        "eg",
        "function",
        "presented",
        "familiar",
        "formula",
        "function",
        "representable",
        "intuition",
        "via",
        "graph",
        "function",
        "decidable",
        "formal",
        "procedure",
        "word",
        "work",
        "generalized",
        "notion",
        "function",
        "respect",
        "adopts",
        "expands",
        "position",
        "another",
        "teacher",
        "dirichlet",
        "stein",
        "ferreirós",
        "ch",
        "dedekind",
        "notion",
        "set",
        "general",
        "sense",
        "generalized",
        "notion",
        "set",
        "function",
        "together",
        "acceptance",
        "actual",
        "infinite",
        "soon",
        "attacked",
        "finitistically",
        "constructively",
        "oriented",
        "mathematician",
        "like",
        "kronecker",
        "dedekind",
        "defended",
        "approach",
        "pointing",
        "fruitfulness",
        "dedekind",
        "a",
        "first",
        "footnote",
        "cf",
        "edward",
        "ferreirós",
        "ch",
        "eventually",
        "came",
        "see",
        "one",
        "feature",
        "problematic",
        "implicit",
        "acceptance",
        "general",
        "comprehension",
        "principle",
        "another",
        "sense",
        "notion",
        "set",
        "unrestricted",
        "already",
        "touched",
        "specific",
        "way",
        "come",
        "dedekind",
        "work",
        "namely",
        "sind",
        "und",
        "sollen",
        "die",
        "zahlen",
        "introduces",
        "totality",
        "thing",
        "object",
        "thought",
        "universal",
        "set",
        "together",
        "arbitrary",
        "subset",
        "totality",
        "general",
        "aussonderungsaxiom",
        "used",
        "collection",
        "object",
        "count",
        "set",
        "noted",
        "dedekind",
        "go",
        "beyond",
        "considering",
        "set",
        "number",
        "essay",
        "significant",
        "extension",
        "notion",
        "set",
        "application",
        "extension",
        "one",
        "might",
        "concerned",
        "even",
        "worrisome",
        "aspect",
        "consists",
        "particular",
        "way",
        "dedekind",
        "allencompassing",
        "totality",
        "introduced",
        "namely",
        "reference",
        "human",
        "thought",
        "since",
        "lead",
        "question",
        "whether",
        "crude",
        "psychologistic",
        "feature",
        "involved",
        "topic",
        "section",
        "problematic",
        "featureand",
        "one",
        "dedekind",
        "came",
        "take",
        "seriously",
        "himselfis",
        "third",
        "one",
        "set",
        "theory",
        "subject",
        "settheoretic",
        "antinomy",
        "including",
        "russell",
        "antinomy",
        "collection",
        "object",
        "count",
        "set",
        "also",
        "russell",
        "collection",
        "set",
        "contain",
        "lead",
        "quickly",
        "contradiction",
        "dedekind",
        "seems",
        "found",
        "problem",
        "cantor",
        "late",
        "s",
        "informed",
        "collection",
        "ordinal",
        "number",
        "inconsistent",
        "totality",
        "collection",
        "object",
        "thought",
        "news",
        "shocked",
        "initially",
        "much",
        "delayed",
        "republication",
        "sind",
        "und",
        "sollen",
        "die",
        "zahlen",
        "even",
        "expressed",
        "doubt",
        "whether",
        "human",
        "thinking",
        "fully",
        "rational",
        "dedekind",
        "vol",
        "p",
        "dedekind",
        "a",
        "p",
        "later",
        "regained",
        "belief",
        "inner",
        "harmony",
        "approach",
        "without",
        "providing",
        "solution",
        "problem",
        "dedekind",
        "vol",
        "p",
        "preface",
        "third",
        "edition",
        "published",
        "russell",
        "antinomy",
        "related",
        "one",
        "establish",
        "dedekind",
        "original",
        "conception",
        "set",
        "untenable",
        "yet",
        "invalidate",
        "contribution",
        "set",
        "theory",
        "analysis",
        "continuity",
        "use",
        "dedekind",
        "cut",
        "introduction",
        "real",
        "number",
        "definition",
        "dedekindinfinite",
        "formulation",
        "dedekindpeano",
        "axiom",
        "proof",
        "categoricity",
        "analysis",
        "natural",
        "number",
        "finite",
        "ordinal",
        "number",
        "justification",
        "mathematical",
        "induction",
        "recursion",
        "basically",
        "insistence",
        "extensional",
        "general",
        "notion",
        "set",
        "function",
        "well",
        "acceptance",
        "actual",
        "infiniteall",
        "contribution",
        "isolated",
        "settheoretic",
        "antinomy",
        "built",
        "core",
        "axiomatic",
        "set",
        "theory",
        "model",
        "theory",
        "recursion",
        "theory",
        "part",
        "current",
        "logic",
        "contribution",
        "set",
        "theory",
        "owe",
        "dedekind",
        "appear",
        "published",
        "writing",
        "correspondence",
        "especially",
        "significant",
        "exchange",
        "letter",
        "starting",
        "cantor",
        "noether",
        "cavaillès",
        "meschkowski",
        "nilson",
        "letter",
        "contain",
        "discussion",
        "cantor",
        "dedekind",
        "respective",
        "treatment",
        "real",
        "number",
        "beyond",
        "amount",
        "joint",
        "exploration",
        "notion",
        "set",
        "infinity",
        "among",
        "dedekind",
        "specific",
        "contribution",
        "context",
        "following",
        "impress",
        "cantor",
        "proof",
        "set",
        "rational",
        "number",
        "also",
        "set",
        "algebraic",
        "number",
        "countable",
        "ferreirós",
        "ch",
        "result",
        "led",
        "least",
        "part",
        "cantor",
        "study",
        "infinite",
        "cardinality",
        "discovery",
        "soon",
        "thereafter",
        "set",
        "real",
        "number",
        "countable",
        "dedekind",
        "also",
        "provides",
        "proof",
        "cantorbernstein",
        "theorem",
        "two",
        "set",
        "embedded",
        "onetoone",
        "exists",
        "bijection",
        "cardinality",
        "another",
        "basic",
        "result",
        "theory",
        "transfinite",
        "cardinal",
        "ferreirós",
        "ch",
        "finally",
        "development",
        "set",
        "theory",
        "twentieth",
        "century",
        "became",
        "clear",
        "several",
        "dedekind",
        "result",
        "procedure",
        "generalized",
        "important",
        "way",
        "perhaps",
        "significantly",
        "zermelo",
        "von",
        "neumann",
        "succeeded",
        "extending",
        "analysis",
        "mathematical",
        "induction",
        "recursion",
        "higher",
        "infinite",
        "thus",
        "expanding",
        "establishing",
        "firmly",
        "cantor",
        "theory",
        "transfinite",
        "ordinal",
        "cardinal",
        "looking",
        "back",
        "contribution",
        "wonder",
        "zermelowho",
        "knew",
        "relevant",
        "history",
        "wellconsidered",
        "modern",
        "theory",
        "set",
        "created",
        "cantor",
        "dedekind",
        "quoted",
        "ferreirós",
        "b"
    ]
}