{
    "main_text": "The logic of definitions || Implicit definitions\n2.6 Implicit definitions\n\nThe above viewpoint allows the traditional account to bring within its\nfold ideas that might at first sight seem contrary to it. It is\nsometimes suggested that a term \\(X\\) can be introduced axiomatically,\nthat is, by laying down as axioms certain sentences of the expanded\nlanguage \\(L^{+}\\). The axioms are then said to implicitly\ndefine \\(X\\). This idea is easily accommodated within the traditional\naccount. Let a theory be a set of sentences of the expanded\nlanguage \\(L^{+}\\). Then, to say that a theory \\(T^*\\) is an\nimplicit (stipulative) definition of X is\nto say that \\(X\\) is governed by the definition \n\\[ \\phi \\eqdf \\text{The True}, \\]\n\n\nwhere \\(\\phi\\) is the conjunction of the members of \\(T^*\\). (If\n\\(T^*\\) is infinite then a stipulation of the above form will be\nneeded for each sentence \\(\\psi\\) in\n \\(T^*\\).)[11]\n The definition is legitimate, according to the traditional account,\nso long as it meets the Conservativeness and Eliminability criteria.\nIf it does meet these criteria, let us call \\(T^*\\)\nadmissible (for a definition of X). So, the\ntraditional account accommodates the idea that theories can\nstipulatively introduce new terms, but it imposes a strong demand: the\ntheories must be\n admissible.[12]\n\nConsider, for concreteness, the special case of classical first-order\nlanguages. Let the ground language \\(L\\) be one such, and let its\ninterpretations be models of some sentences \\(T\\). Let us say that\n\n\\(T^*\\) is an implicit semantic definition of X iff, for each\ninterpretation \\(M\\) of \\(L\\), there is a unique model \\(M^{+}\\) of\n\\(T^*\\) such that \\(M^{+}\\) is an expansion of \\(M\\).\n\nThen, from the normal form theorem, the following claim is\nimmediate:\n\nIf \\(T^*\\) is admissible then \\(T^*\\) is an implicit semantic\ndefinition of \\(X\\).\n\nThat is, an admissible theory fixes the semantic value of the defined\nterm in each interpretation of the ground language. This observation\nprovides one natural method of showing that a theory is not\nadmissible:\n\nPadoa’s method. To show that \\(T^*\\) is not\nadmissible, it suffices to construct two models of \\(T^*\\) that are\nexpansions of one and the same interpretation of the ground language\n\\(L\\). (Padoa 1900)\n\nHere is a simple and philosophically useful application of\nPadoa’s method. Suppose the proof system of \\(L\\) is Peano\nArithmetic and that \\(L\\) is expanded by the addition of a unary\npredicate \\(Tr\\) (for “Gödel number of a true sentence of\n\\(L\\)”). Let \\(\\mathbf{H}\\) be the theory consisting of all the\nsentences (the “Tarski biconditionals”) of the following\nform: \n\\[ Tr(s) \\leftrightarrow \\psi, \\]\n\n\nwhere \\(\\psi\\) is a sentence of \\(L\\) and \\(s\\) is the canonical name\nfor the Gödel number of \\(\\psi\\). Padoa’s method implies\nthat \\(\\mathbf{H}\\) is not admissible for defining \\(Tr\\). For\n\\(\\mathbf{H}\\) does not fix the interpretation of \\(Tr\\) in all\ninterpretations of \\(L\\). In particular, it does not do so in the\nstandard model, for \\(\\mathbf{H}\\) places no constraints on the\nbehavior of \\(Tr\\) on those numbers that are not Gödel numbers of\nsentences. (If the coding renders each natural number a Gödel\nnumber of a sentence, then a non-standard model of Peano Arithmetic\nprovides the requisite counterexample: it has infinitely many\nexpansions that are models of \\(\\mathbf{H}\\).) A variant of this\nargument shows that Tarski’s theory of truth, as formulated in\n\\(L^{+}\\), is not admissible for defining \\(Tr\\).\n\nWhat about the converse of Padoa’s method? Suppose we can show\nthat in each interpretation of the ground language, a theory \\(T^*\\)\nfixes a unique semantic value for the defined term. Can we conclude\nthat \\(T^*\\) is admissible? This question receives a negative answer\nfor some semantical systems, and a positive answer for others. (In\ncontrast, Padoa’s method works so long as the semantic system is\nnot highly contrived.) The converse fails for, e.g., classical\nsecond-order languages, but it holds for first-order ones:\n\nBeth’s Definability Theorem. If \\(T^*\\) is an\nimplicit semantic definition of \\(X\\) in a classical first-order\nlanguage then \\(T^*\\) is admissible.\n\nNote that the theorem holds even if \\(T^*\\) is an infinite set. For a\nproof of the theorem, see Boolos, Burgess, and Jeffrey 2002; see also\nBeth 1953.\n\nThe idea of implicit definition is not in conflict, then, with the\ntraditional account. Where conflict arises is in the philosophical\napplications of the idea. The failure of strict reductionist programs\nof the late-nineteenth and early-twentieth century prompted\nphilosophers to explore looser kinds of reductionism. For instance,\nFrege’s definition of number proved to be inconsistent, and thus\nincapable of sustaining the logicist thesis that the principles of\narithmetic are analytic. It turns out, however, that the principles of\narithmetic can be derived without Frege’s definition. All that\nis needed is one consequence of it, namely, Hume’s\nPrinciple:\n\nHume’s Principle. The number of \\(F\\)s = the\nnumber of \\(G\\)s iff there is a one-to-one correspondence between the\n\\(F\\)s and \\(G\\)s.\n\nIf we add Hume’s Principle to axiomatic second-order logic, then\nwe obtain a consistent theory from which we can analytically derive\nsecond-order Peano Arithmetic. (The essentials of the argument are\nfound already in Frege 1884.) It is a central thesis of\nNeo-Fregeanism that Hume’s Principle is an implicit\ndefinition of the functional expression ‘the number of’\n(see Hale and Wright 2001). If this thesis can be defended, then\nlogicism about arithmetic can be sustained. However, the neo-Fregean\nthesis is in conflict with the traditional account of definitions, for\nHume’s Principle violates both Conservativeness and\nEliminability. The principle allows one to prove, for arbitrary \\(n\\),\nthat there are at least \\(n\\) objects.\n\nAnother example: The reductionist program for theoretical concepts\n(e.g., those of physics) aimed to solve epistemological problems that\nthese concepts pose. The program aimed to reduce theoretical sentences\nto (classes of) observational sentences. However, the reductions\nproved difficult, if not impossible, to sustain. Thus arose the\nsuggestion that perhaps the non-observational component of a theory\ncan, without any claim of reduction, be regarded as an implicit\ndefinition of theoretical terms. The precise characterization of the\nnon-observational component can vary with the specific epistemological\nproblem at hand. But there is bound to be a violation of one or both\nof the two criteria, Conservativeness and\n Eliminability.[13]\n\nA final example: We know by a theorem of Tarski that no theory can be\nan admissible definition of the truth predicate, \\(Tr\\), for the\nlanguage of Peano Arithmetic considered above. Nonetheless, perhaps we\ncan still regard theory \\(\\mathbf{H}\\) as an implicit definition of\n\\(Tr\\). (Paul Horwich has made a closely related proposal for the\nordinary notion of truth.) Here, again, pressure is put on the bounds\nimposed by the traditional account. \\(\\mathbf{H}\\) meets the\nConservativeness criterion, but not that of Eliminability.\n\nIn order to assess the challenge these philosophical applications pose\nfor the traditional account, we need to resolve issues that are under\ncurrent philosophical debate. Some of the issues are the following.\n(i) It is plain that some violations of Conservativeness are\nillegitimate: one cannot make it true by a stipulation that,\ne.g., Mercury is larger than Venus. Now, if a philosophical\napplication requires some violations of Conservativeness to be\nlegitimate, we need an account of the distinction between the two\nsorts of cases: the legitimate violations of Conservativeness and the\nnon-legitimate ones. And we need to understand what it is that renders\nthe one legitimate, but not the other. (ii) A similar issue arises for\nEliminability. It would appear that not any old theory can be an\nimplicit definition of a term \\(X\\). (The theory might contain only\ntautologies.) If so, then again we need a demarcation of theories that\ncan serve to implicitly define a term from those that cannot. And we\nneed a rationale for the distinction. (iii) The philosophical\napplications rest crucially on the idea that an implicit definition\nfixes the meaning of the defined term. We need therefore an account of\nwhat this meaning is, and how the implicit definition fixes it. Under\nthe traditional account, formulas containing the defined term can be\nseen as acquiring their meaning from the formulas of the ground\nlanguage. (In view of the primacy of the sentential, this fixes the\nmeaning of the defined term.) But this move is not available under a\nliberalized conception of implicit definition. How, then, should we\nthink of the meaning of a formula under the envisioned departure from\nthe traditional account? (iv) Even if the previous three issues are\naddressed satisfactorily, an important concern remains. Suppose we\nallow that a theory \\(T\\), say, of physics can stipulatively define\nits theoretical terms, and that it endows the terms with particular\nmeanings. The question remains whether the meanings thus endowed are\nidentical to (or similar enough to) the meanings the theoretical terms\nhave in their actual uses in physics. This question must be answered\npositively if implicit definitions are to serve their philosophical\nfunction. The aim of invoking implicit definitions is to account for\nthe rationality, or the apriority, or the analyticity of our ordinary\njudgments, not of some extraordinary judgments that are somehow\nassigned to ordinary signs.\n\nThe literature on neo-Fregeanism presents an interesting case study in\nrespect of these issues. Much of the debate concerning the neo-Fregean\nthesis can fruitfully be viewed as a debate over the extent and\nprecise formulation of the criteria of Conservativeness and Use. For\nexample, the so-called Julius Caesar objection (due to Frege\n1884) urges that Hume’s Principle cannot be a legitimate\ndefinition of ‘the number of’ because it does not\ndetermine the use of this expression in mixed identity contexts, such\nas ‘\\(\\text{the number of }F\\text{s} = \\text{Julius\nCaesar}\\)’. Other classic objections (Field 1984, Boolos 1997)\nfocus on the non-conservativeness of Hume’s Principle. Boolos\n1990 raises a particularly sharp point, known as the Bad Company\nproblem. Definitions of the same kind as Hume’s Principle\nare known as abstraction principles. Boolos exhibits an\nabstraction principle that is consistent by itself, but inconsistent\nin conjunction with Hume’s Principle. This pathological\nsituation never arises with conservative definitions. So, the Bad\nCompany problem illustrates what can go wrong when the\nConservativeness requirement is violated.\n\nFriends of neo-Fregeanism have responded to these objections in\nvarious ways. Wright 1997 argues that abstraction principles need only\nsatisfy a restricted version of Conservativeness, and needn’t\nsatisfy Eliminability at all. (However, Wright’s proposal\nsuffered the revenge of the Bad Company problem: see Weir 2003.) By\ncontrast, Linnebo 2018 argues for much more stringent requirements on\nabstraction principles. He countenances only predicative\nabstraction principles, which satisfy both Conservativeness and\nEliminability in suitable contexts. Mackereth and Avigad (forthcoming)\ndefend an intermediate position. They hold that abstraction principles\nmust satisfy Conservativeness in an unrestricted sense, but\nneedn’t satisfy Eliminability. Furthermore, Mackereth and Avigad\nshow that in the absence of Eliminability, the precise formulation of\nConservativeness (syntactic vs. semantic, etc.) makes a big\ndifference. In particular, it is possible to get impredicative\nversions of Hume’s Principle that are semantically\nconservative, but the same does not appear to be true for\nsyntactic conservativeness.\n\nFor further discussion of these issues, see Horwich 1998, especially\nchapter 6; Hale and Wright 2001, especially chapter 5; and the works\ncited there.\n",
    "section_title": "2.6 Implicit definitions",
    "entry_title": "Definitions",
    "hierarchy_title": "Definitions || The logic of definitions || Implicit definitions",
    "tokenized_text": [
        "logic",
        "definition",
        "implicit",
        "definition",
        "implicit",
        "definition",
        "viewpoint",
        "allows",
        "traditional",
        "account",
        "bring",
        "within",
        "fold",
        "idea",
        "might",
        "first",
        "sight",
        "seem",
        "contrary",
        "sometimes",
        "suggested",
        "term",
        "x",
        "introduced",
        "axiomatically",
        "laying",
        "axiom",
        "certain",
        "sentence",
        "expanded",
        "language",
        "l",
        "axiom",
        "said",
        "implicitly",
        "define",
        "x",
        "idea",
        "easily",
        "accommodated",
        "within",
        "traditional",
        "account",
        "let",
        "theory",
        "set",
        "sentence",
        "expanded",
        "language",
        "l",
        "say",
        "theory",
        "t",
        "implicit",
        "stipulative",
        "definition",
        "x",
        "say",
        "x",
        "governed",
        "definition",
        "phi",
        "eqdf",
        "text",
        "true",
        "phi",
        "conjunction",
        "member",
        "t",
        "t",
        "infinite",
        "stipulation",
        "form",
        "needed",
        "sentence",
        "psi",
        "t",
        "definition",
        "legitimate",
        "according",
        "traditional",
        "account",
        "long",
        "meet",
        "conservativeness",
        "eliminability",
        "criterion",
        "meet",
        "criterion",
        "let",
        "u",
        "call",
        "t",
        "admissible",
        "definition",
        "x",
        "traditional",
        "account",
        "accommodates",
        "idea",
        "theory",
        "stipulatively",
        "introduce",
        "new",
        "term",
        "imposes",
        "strong",
        "demand",
        "theory",
        "must",
        "admissible",
        "consider",
        "concreteness",
        "special",
        "case",
        "classical",
        "firstorder",
        "language",
        "let",
        "ground",
        "language",
        "l",
        "one",
        "let",
        "interpretation",
        "model",
        "sentence",
        "t",
        "let",
        "u",
        "say",
        "t",
        "implicit",
        "semantic",
        "definition",
        "x",
        "iff",
        "interpretation",
        "m",
        "l",
        "unique",
        "model",
        "m",
        "t",
        "m",
        "expansion",
        "m",
        "normal",
        "form",
        "theorem",
        "following",
        "claim",
        "immediate",
        "t",
        "admissible",
        "t",
        "implicit",
        "semantic",
        "definition",
        "x",
        "admissible",
        "theory",
        "fix",
        "semantic",
        "value",
        "defined",
        "term",
        "interpretation",
        "ground",
        "language",
        "observation",
        "provides",
        "one",
        "natural",
        "method",
        "showing",
        "theory",
        "admissible",
        "padoa",
        "method",
        "show",
        "t",
        "admissible",
        "suffices",
        "construct",
        "two",
        "model",
        "t",
        "expansion",
        "one",
        "interpretation",
        "ground",
        "language",
        "l",
        "padoa",
        "simple",
        "philosophically",
        "useful",
        "application",
        "padoa",
        "method",
        "suppose",
        "proof",
        "system",
        "l",
        "peano",
        "arithmetic",
        "l",
        "expanded",
        "addition",
        "unary",
        "predicate",
        "tr",
        "gödel",
        "number",
        "true",
        "sentence",
        "l",
        "let",
        "mathbf",
        "h",
        "theory",
        "consisting",
        "sentence",
        "tarski",
        "biconditionals",
        "following",
        "form",
        "tr",
        "leftrightarrow",
        "psi",
        "psi",
        "sentence",
        "l",
        "s",
        "canonical",
        "name",
        "gödel",
        "number",
        "psi",
        "padoa",
        "method",
        "implies",
        "mathbf",
        "h",
        "admissible",
        "defining",
        "tr",
        "mathbf",
        "h",
        "fix",
        "interpretation",
        "tr",
        "interpretation",
        "l",
        "particular",
        "standard",
        "model",
        "mathbf",
        "h",
        "place",
        "constraint",
        "behavior",
        "tr",
        "number",
        "gödel",
        "number",
        "sentence",
        "coding",
        "render",
        "natural",
        "number",
        "gödel",
        "number",
        "sentence",
        "nonstandard",
        "model",
        "peano",
        "arithmetic",
        "provides",
        "requisite",
        "counterexample",
        "infinitely",
        "many",
        "expansion",
        "model",
        "mathbf",
        "h",
        "variant",
        "argument",
        "show",
        "tarski",
        "theory",
        "truth",
        "formulated",
        "l",
        "admissible",
        "defining",
        "tr",
        "converse",
        "padoa",
        "method",
        "suppose",
        "show",
        "interpretation",
        "ground",
        "language",
        "theory",
        "t",
        "fix",
        "unique",
        "semantic",
        "value",
        "defined",
        "term",
        "conclude",
        "t",
        "admissible",
        "question",
        "receives",
        "negative",
        "answer",
        "semantical",
        "system",
        "positive",
        "answer",
        "others",
        "contrast",
        "padoa",
        "method",
        "work",
        "long",
        "semantic",
        "system",
        "highly",
        "contrived",
        "converse",
        "fails",
        "eg",
        "classical",
        "secondorder",
        "language",
        "hold",
        "firstorder",
        "one",
        "beth",
        "definability",
        "theorem",
        "t",
        "implicit",
        "semantic",
        "definition",
        "x",
        "classical",
        "firstorder",
        "language",
        "t",
        "admissible",
        "note",
        "theorem",
        "hold",
        "even",
        "t",
        "infinite",
        "set",
        "proof",
        "theorem",
        "see",
        "boolos",
        "burgess",
        "jeffrey",
        "see",
        "also",
        "beth",
        "idea",
        "implicit",
        "definition",
        "conflict",
        "traditional",
        "account",
        "conflict",
        "arises",
        "philosophical",
        "application",
        "idea",
        "failure",
        "strict",
        "reductionist",
        "program",
        "latenineteenth",
        "earlytwentieth",
        "century",
        "prompted",
        "philosopher",
        "explore",
        "looser",
        "kind",
        "reductionism",
        "instance",
        "frege",
        "definition",
        "number",
        "proved",
        "inconsistent",
        "thus",
        "incapable",
        "sustaining",
        "logicist",
        "thesis",
        "principle",
        "arithmetic",
        "analytic",
        "turn",
        "however",
        "principle",
        "arithmetic",
        "derived",
        "without",
        "frege",
        "definition",
        "needed",
        "one",
        "consequence",
        "namely",
        "hume",
        "principle",
        "hume",
        "principle",
        "number",
        "f",
        "number",
        "g",
        "iff",
        "onetoone",
        "correspondence",
        "f",
        "g",
        "s",
        "add",
        "hume",
        "principle",
        "axiomatic",
        "secondorder",
        "logic",
        "obtain",
        "consistent",
        "theory",
        "analytically",
        "derive",
        "secondorder",
        "peano",
        "arithmetic",
        "essential",
        "argument",
        "found",
        "already",
        "frege",
        "central",
        "thesis",
        "neofregeanism",
        "hume",
        "principle",
        "implicit",
        "definition",
        "functional",
        "expression",
        "number",
        "see",
        "hale",
        "wright",
        "thesis",
        "defended",
        "logicism",
        "arithmetic",
        "sustained",
        "however",
        "neofregean",
        "thesis",
        "conflict",
        "traditional",
        "account",
        "definition",
        "hume",
        "principle",
        "violates",
        "conservativeness",
        "eliminability",
        "principle",
        "allows",
        "one",
        "prove",
        "arbitrary",
        "n",
        "least",
        "n",
        "object",
        "another",
        "example",
        "reductionist",
        "program",
        "theoretical",
        "concept",
        "eg",
        "physic",
        "aimed",
        "solve",
        "epistemological",
        "problem",
        "concept",
        "pose",
        "program",
        "aimed",
        "reduce",
        "theoretical",
        "sentence",
        "class",
        "observational",
        "sentence",
        "however",
        "reduction",
        "proved",
        "difficult",
        "impossible",
        "sustain",
        "thus",
        "arose",
        "suggestion",
        "perhaps",
        "nonobservational",
        "component",
        "theory",
        "without",
        "claim",
        "reduction",
        "regarded",
        "implicit",
        "definition",
        "theoretical",
        "term",
        "precise",
        "characterization",
        "nonobservational",
        "component",
        "vary",
        "specific",
        "epistemological",
        "problem",
        "hand",
        "bound",
        "violation",
        "one",
        "two",
        "criterion",
        "conservativeness",
        "eliminability",
        "final",
        "example",
        "know",
        "theorem",
        "tarski",
        "theory",
        "admissible",
        "definition",
        "truth",
        "predicate",
        "tr",
        "language",
        "peano",
        "arithmetic",
        "considered",
        "nonetheless",
        "perhaps",
        "still",
        "regard",
        "theory",
        "mathbf",
        "h",
        "implicit",
        "definition",
        "tr",
        "paul",
        "horwich",
        "made",
        "closely",
        "related",
        "proposal",
        "ordinary",
        "notion",
        "truth",
        "pressure",
        "put",
        "bound",
        "imposed",
        "traditional",
        "account",
        "mathbf",
        "h",
        "meet",
        "conservativeness",
        "criterion",
        "eliminability",
        "order",
        "ass",
        "challenge",
        "philosophical",
        "application",
        "pose",
        "traditional",
        "account",
        "need",
        "resolve",
        "issue",
        "current",
        "philosophical",
        "debate",
        "issue",
        "following",
        "plain",
        "violation",
        "conservativeness",
        "illegitimate",
        "one",
        "make",
        "true",
        "stipulation",
        "eg",
        "mercury",
        "larger",
        "venus",
        "philosophical",
        "application",
        "requires",
        "violation",
        "conservativeness",
        "legitimate",
        "need",
        "account",
        "distinction",
        "two",
        "sort",
        "case",
        "legitimate",
        "violation",
        "conservativeness",
        "nonlegitimate",
        "one",
        "need",
        "understand",
        "render",
        "one",
        "legitimate",
        "ii",
        "similar",
        "issue",
        "arises",
        "eliminability",
        "would",
        "appear",
        "old",
        "theory",
        "implicit",
        "definition",
        "term",
        "x",
        "theory",
        "might",
        "contain",
        "tautology",
        "need",
        "demarcation",
        "theory",
        "serve",
        "implicitly",
        "define",
        "term",
        "need",
        "rationale",
        "distinction",
        "iii",
        "philosophical",
        "application",
        "rest",
        "crucially",
        "idea",
        "implicit",
        "definition",
        "fix",
        "meaning",
        "defined",
        "term",
        "need",
        "therefore",
        "account",
        "meaning",
        "implicit",
        "definition",
        "fix",
        "traditional",
        "account",
        "formula",
        "containing",
        "defined",
        "term",
        "seen",
        "acquiring",
        "meaning",
        "formula",
        "ground",
        "language",
        "view",
        "primacy",
        "sentential",
        "fix",
        "meaning",
        "defined",
        "term",
        "move",
        "available",
        "liberalized",
        "conception",
        "implicit",
        "definition",
        "think",
        "meaning",
        "formula",
        "envisioned",
        "departure",
        "traditional",
        "account",
        "iv",
        "even",
        "previous",
        "three",
        "issue",
        "addressed",
        "satisfactorily",
        "important",
        "concern",
        "remains",
        "suppose",
        "allow",
        "theory",
        "t",
        "say",
        "physic",
        "stipulatively",
        "define",
        "theoretical",
        "term",
        "endows",
        "term",
        "particular",
        "meaning",
        "question",
        "remains",
        "whether",
        "meaning",
        "thus",
        "endowed",
        "identical",
        "similar",
        "enough",
        "meaning",
        "theoretical",
        "term",
        "actual",
        "us",
        "physic",
        "question",
        "must",
        "answered",
        "positively",
        "implicit",
        "definition",
        "serve",
        "philosophical",
        "function",
        "aim",
        "invoking",
        "implicit",
        "definition",
        "account",
        "rationality",
        "apriority",
        "analyticity",
        "ordinary",
        "judgment",
        "extraordinary",
        "judgment",
        "somehow",
        "assigned",
        "ordinary",
        "sign",
        "literature",
        "neofregeanism",
        "present",
        "interesting",
        "case",
        "study",
        "respect",
        "issue",
        "much",
        "debate",
        "concerning",
        "neofregean",
        "thesis",
        "fruitfully",
        "viewed",
        "debate",
        "extent",
        "precise",
        "formulation",
        "criterion",
        "conservativeness",
        "use",
        "example",
        "socalled",
        "julius",
        "caesar",
        "objection",
        "due",
        "frege",
        "urge",
        "hume",
        "principle",
        "legitimate",
        "definition",
        "number",
        "determine",
        "use",
        "expression",
        "mixed",
        "identity",
        "context",
        "text",
        "number",
        "ftext",
        "text",
        "julius",
        "caesar",
        "classic",
        "objection",
        "field",
        "boolos",
        "focus",
        "nonconservativeness",
        "hume",
        "principle",
        "boolos",
        "raise",
        "particularly",
        "sharp",
        "point",
        "known",
        "bad",
        "company",
        "problem",
        "definition",
        "kind",
        "hume",
        "principle",
        "known",
        "abstraction",
        "principle",
        "boolos",
        "exhibit",
        "abstraction",
        "principle",
        "consistent",
        "inconsistent",
        "conjunction",
        "hume",
        "principle",
        "pathological",
        "situation",
        "never",
        "arises",
        "conservative",
        "definition",
        "bad",
        "company",
        "problem",
        "illustrates",
        "go",
        "wrong",
        "conservativeness",
        "requirement",
        "violated",
        "friend",
        "neofregeanism",
        "responded",
        "objection",
        "various",
        "way",
        "wright",
        "argues",
        "abstraction",
        "principle",
        "need",
        "satisfy",
        "restricted",
        "version",
        "conservativeness",
        "satisfy",
        "eliminability",
        "however",
        "wright",
        "proposal",
        "suffered",
        "revenge",
        "bad",
        "company",
        "problem",
        "see",
        "weir",
        "contrast",
        "linnebo",
        "argues",
        "much",
        "stringent",
        "requirement",
        "abstraction",
        "principle",
        "countenance",
        "predicative",
        "abstraction",
        "principle",
        "satisfy",
        "conservativeness",
        "eliminability",
        "suitable",
        "context",
        "mackereth",
        "avigad",
        "forthcoming",
        "defend",
        "intermediate",
        "position",
        "hold",
        "abstraction",
        "principle",
        "must",
        "satisfy",
        "conservativeness",
        "unrestricted",
        "sense",
        "satisfy",
        "eliminability",
        "furthermore",
        "mackereth",
        "avigad",
        "show",
        "absence",
        "eliminability",
        "precise",
        "formulation",
        "conservativeness",
        "syntactic",
        "vs",
        "semantic",
        "etc",
        "make",
        "big",
        "difference",
        "particular",
        "possible",
        "get",
        "impredicative",
        "version",
        "hume",
        "principle",
        "semantically",
        "conservative",
        "appear",
        "true",
        "syntactic",
        "conservativeness",
        "discussion",
        "issue",
        "see",
        "horwich",
        "especially",
        "chapter",
        "hale",
        "wright",
        "especially",
        "chapter",
        "work",
        "cited"
    ]
}