{
    "main_text": "The Philosophy of Difference || Logic of Sense\n3.2 Logic of Sense\n\nWhile Difference and Repetition ranges over a wide field of\nphilosophical topics, Logic of Sense focuses on two aspects\nof a single issue, the structure and genesis of sense. The genius of\nFrege and Russell was to have discovered that the condition of truth\n(denotation) lies in the domain of sense. In order for a proposition\nto be true (or false) it must have a sense; a nonsensical proposition\ncan be neither true nor false. Yet they betrayed this insight, Deleuze\nargues, because they—like Kant before them—remained\ncontent with establishing the condition of truth rather than its\ngenesis. In Logic of Sense, Deleuze attacks this problem,\nfirst developing the paradoxes that result from the structure of sense\nand then sketching a theory of its genesis. He does this using\nresources from analytic philosophy and the Stoics in the course of a\nreading of Lewis Carroll—a typically innovative, if not quirky,\nset of Deleuzean references.\n\nIn the first part of the book, Deleuze analyzes the structure of\nsense. He begins by identifying three types of relation within\npropositions:\n\nDesignation or denotation, which is the relation of a proposition\nto an external state of affairs (theory of reference, with its\ncriterion of truth or falsity).\nManifestation, which marks the relation of the proposition to the\nbeliefs and desires of the person who is speaking (with its values of\nveracity or illusion).\nSignification or demonstration, which is the relation of the\nproposition to other propositions (the domain of logic, with its\nrelations of implication and assertion).\n\n\nPropositions, in other words, can be related either to the objects to\nwhich they refer, or to the subjects who utter them, or to other\npropositions. But each of these relations, in turn, can be taken to be\nprimary. (1) In the domain of speech, it is the “I” that\nbegins: manifestation not only makes denotation possible (Hume), but\nis also prior to signification (Descartes’ cogito). (2)\nIn the domain of language, however, it is signification that is\nprimary, since one is always born into a preexisting language, and\nsignified concepts are always primary in relation to the self as a\nmanifested person or to things as designated objects. (3) Yet in the\ndomain of logic we see the primacy of designation: as shown by the\nhypothetical mode of implications, the logical value of demonstration\nis not the truth, but rather the conditions of truth (the conditions\nof possibility under which the proposition would be true); the\npremises must thus be posited as effectively true, which forces one to\nleave the pure order of implication in order to relate the premises to\na denoted state of affairs. Logical designation, in other words,\ncannot fulfill its putative role as foundation, since it presupposes\nan irreducible denotation.\n\nThe theory of the proposition is thus caught in a circle, with each\ncondition in turn being conditioned by what it supposedly conditions.\n“For the condition of truth to avoid this defect,” Deleuze\nargues, “it would have to have something unconditioned capable\nof assuring a real genesis of designation and the other dimensions of\nthe proposition: the condition of truth would then be defined, no\nlonger as the form of conceptual possibility, but as an ideal matter\nor ‘medium’ [matière ou ‘couche’\nidéelle], that is, no longer as signification, but as\nsense” (LS 19). Sense, then, would be a fourth dimension of\npropositions, for which Deleuze reserves the term expression. For\nDeleuze as for Frege, sense is what is expressed in a proposition; the\ntwo senses of “morning star” and “evening\nstar” are two ways in which the same denotatum may be\nexpressed in propositions.\n\nDeleuze’s contribution to the philosophy of sense really begins\nto take off when he shows that the attempt to make this fourth\ndimension evident is akin to Lewis Carroll’s Hunt for the Snark,\nor to unraveling a Möbius strip, since sense has neither a\nphysical nor a mental existence. Deleuze suggests that it was the\nStoics who first discovered the dimension of sense when they\ndistinguished between corporeal mixtures and incorporeal events. I can\nattribute the proper name “Battle of Waterloo” to a\nparticular state of affairs, but the battle itself is an incorporeal\nevent (or sense) with no other reality than that of the expression of\nmy proposition; what we find in the state of affairs are bodies mixing\nwith one another—spears stabbing flesh, bullets flying through\nthe air, cannons firing, bodies being ripped apart—and the\nbattle itself is the effect or the result of this\nintermingling of bodies. Sense thus has a complex status. On the one\nhand, it does not exist outside the proposition that expresses it, but\nit cannot be confused with the proposition, since it has a distinct\n“objectity” of its own (it does not exist, but rather\n“subsists” or “insists”). On the other hand,\nit is attributed to states of affairs or things, but it cannot be\nconfused or identified with states of affairs, nor with a quality or\nrelation of these states. “Sense is both the expressible or the\nexpressed of the proposition, and the attribute of the state of\naffairs. It turns one side toward things, and another side toward\npropositions. But it cannot be confused with the proposition which\nexpressed it any more than with the state of affairs or the quality\nwhich the proposition denotes. It is exactly the boundary between\npropositions and things” (LS 22).\n\nThe structure of sense generates a number of paradoxes, which Deleuze\ndistinguishes from the paradoxes of signification discovered by\nRussell in set theory (the set of all sets, and the “barber of\nthe regiment”). The first is the paradox of regress, or\nindefinite proliferation: I can never state the sense of what I am\nsaying, but I can take the sense of what I am saying as the object of\nanother proposition, whose sense in turn I cannot state, ad infinitum.\nThis first paradox points both to the impotence of the speaker (my\ninability to state the sense of what I am saying) and to the highest\npower of language (its infinite capability to speak about words). The\nsecond paradox is that of sterile reiteration or doubling: one can\navoid the infinite regress by extracting sense as the mere double of a\nproposition, but at the price of catapulting us into a third paradox\nof neutrality or sterility—sense is necessarily neutral with\nregard to the various modes of the proposition: quality (affirmation,\nnegation), quantity (all, some, none), relation, and modality\n(possibility, reality, necessity).\n\nThus extracted from the proposition, Deleuze argues that sense has the\nstatus of a pure ideational event, irreducible to\npropositions and their three dimensions: (1) the states of affairs the\npropositions denote; (2) the experiences or mental activities\n(beliefs, desires, images, representations) of persons who express\nthemselves in the proposition; and (3) universals or general concepts.\nBut how can sense be said to engender the other dimensions of the\nproposition? This is the second task of a logic of sense: “to\ncombine the sterility of sense in relation to the proposition from\nwhich it was extracted with its power of genesis in relation to the\ndimensions of the proposition” (LS 32).\n\nIn the second half of Logic of Sense, Deleuze analyzes what\nhe calls the dynamic genesis of language, drawing in part from texts\nin developmental psychology and psychoanalysis. “What renders\nlanguage possible,” he writes, “is that which separates\nsounds from bodies and organizes them into propositions, freeing them\nfor the expressive function” (LS 181). Deleuze distinguishes\nthree stages in the dynamic genesis, which at the same time constitute\nthree dimensions of language: (1) the primary order is the noise\nproduced in the depths of the body; (2) the secondary organization\nconstitutes the surface of sense (and non-sense); and (3) the tertiary\narrangement [ordonnance] is found in fully-formed\npropositions, with their functions of denotation, manifestation, and\nsignification.\n\nThe first stage of the dynamic genesis of sense, the primary order of\nlanguage, is found in the newborn infant. Deleuze draws from a\ntradition of developmental psychology whose insights are expressed in\nthe vivid image of Daniel N. Stern: the infant’s experience is a\nkind of human “weatherscape,” made up entirely of\nsequences of risings and fallings of intensity—the jolting of a\nbright light or a sharp noise, the calming of a voice, or the\nexplosive breakout of a storm of hunger (The Interpersonal World\nof the Infant, 1985). Deleuze will draw upon the writings of the\nFrench writer Antonin Artaud and call this life of\nintensities-in-motion the “body without organs.” This\nprimary order of language (pure Noise as a dimension of the body)\nconstitutes a first type of nonsense. But in the midst of this world\nof intensities, there also appears a particular noise: the sound of\nthe child’s parents, or other adults. Long before the infant can\nunderstand words and sentences, it grasps language as something that\npre-exists itself, as something always-already there, like a Voice on\nhigh. But for the child the Voice has the dimensions of language\nwithout having its condition. (Adults have the same experience when\nthey hear a foreign language being spoken.) For the infant to accede\nto the tertiary arrangement of language (denotation, manifestation,\nsignification), it must pass through its secondary organization, which\nis the production of the surface dimension of sense. How does this\nconstruction take place? From the flow of the Voice, the child will\nextract differential elements of various orders (phonemes, morphemes,\nsemantemes) and begin to synthesize them into diverse series.\n\nAt this point, Deleuze isolates three series or syntheses: connective,\nconjunctive, and disjunctive. In the first, the child connects\nphonemes in a concatenation of successive entities\n(“mama,” “dada”); in the second, there is the\nconstruction of esoteric words out of these phonemes through their\nintegration and conjunction (“your royal highness” is\ncontracted into “y’reince”); in the third, the child\nstarts making these esoteric words ramify and enter into relation with\nother divergent and independent series. We can clearly see that the\nconstructions of this secondary organization of sense are not yet the\nfully formed units of the tertiary arrangement of language on high,\nbut they are no longer merely the bodily noises of the primary order.\nBefore the child has any understanding of linguistic units, it\nundertakes a vast apprenticeship in their formative elements. This is\nwhy the domain of sense is the condition or ground of propositions,\nnot as their form of possibility, but as their “ideal matter or\n‘medium’”: we are positioned immediately within\nsense whenever we denote, manifest, or signify. Moreover, since sense\nlies at the frontier of words and things—it is expressed in\npropositions and attributed to states of affairs, but it cannot be\nconfused with either propositions or states of affairs—it\nengenders both the determinate dimensions of the proposition\n(denotation, manifestation, signification) as well as its objective\ncorrelates (the denoted, the manifested, and the signified).\n\nThe domain of sense is necessarily subject to a fundamental fragility,\ncapable of toppling over into nonsense: the ground gives way to a\ngroundlessness, a sans-fond. The reason for this is clear.\nSense is never a principle or an origin; rather, it is an effect, it\nis produced, and it is produced out of elements that do not, in\nthemselves, have a sense. Sense, in other words, has a determinate\nrelation with nonsense. Deleuze, however, distinguishes between two\nvery different types of nonsense. The first is that of Lewis Carroll,\nwho remains at the surface of sense and, like children, makes use of\nthe non-signifying elements of language in order to construct the\nportmanteau words (snark = shark + snake; frumious = furious + fuming)\nand nonsensical phrases (“’Twas brillig, and the slithy\ntoves did gyre and gimble in the wabe”) that populate his\nwriting. If Logic of Sense is in part a reading of\nCarroll’s work, it is because no one knew better than Carroll\nabout the conditions for the production of sense, which Deleuze\nelucidates in detail: the extraction of differential elements or pure\nevent, their organization in multiple series, and most importantly,\nthe aleatory point or paradoxical element that links the series (the\nideal “quasi-cause” that produces the effect of sense out\nof nonsense).\n\nBut there is a second type of nonsense, which is more profound than\nthe surface nonsense found in Lewis Carroll. This is the terrifying\nnonsense of the primary order, which found expression in the writings\nof Antonin Artaud. Sense is what prevents the sonorous language from\nbeing confused with the physical body (noise). But in the primary\norder of schizophrenia experienced by Artaud, there is no longer\nanything to prevent propositions from falling back onto bodies, which\nmingle their sonorous elements with the olfactory, gustatory, and\ndigestive effects of the body (Artaud’s cris-souffles:\n“ratara ratara ratara Atara tatara rana Otara otara\nkatara”).\n\nDeleuze will develop his theory of the body-without-organs in his\ncollaboration with Félix Guattari, to which we now turn. As we\nshall see, the concept of the body-without-organs is put to work in a\ncomplex naturalistic philosophy of “desiring-production”\nthat moves far beyond the question of sense into the realms of nature,\nhistory, and politics. In other words, if Logic of Sense\nrepresents Deleuze’s confrontation with the “linguistic\nturn” that was so important for twentieth-century philosophy, it\nis a confrontation that he quickly put behind him as he came to\nembrace fully his materialist and naturalistic leanings.\n",
    "section_title": "3.2 Logic of Sense",
    "entry_title": "Gilles Deleuze",
    "hierarchy_title": "Gilles Deleuze || The Philosophy of Difference || Logic of Sense",
    "tokenized_text": [
        "philosophy",
        "difference",
        "logic",
        "sense",
        "logic",
        "sense",
        "difference",
        "repetition",
        "range",
        "wide",
        "field",
        "philosophical",
        "topic",
        "logic",
        "sense",
        "focus",
        "two",
        "aspect",
        "single",
        "issue",
        "structure",
        "genesis",
        "sense",
        "genius",
        "frege",
        "russell",
        "discovered",
        "condition",
        "truth",
        "denotation",
        "lie",
        "domain",
        "sense",
        "order",
        "proposition",
        "true",
        "false",
        "must",
        "sense",
        "nonsensical",
        "proposition",
        "neither",
        "true",
        "false",
        "yet",
        "betrayed",
        "insight",
        "deleuze",
        "argues",
        "theylike",
        "kant",
        "themremained",
        "content",
        "establishing",
        "condition",
        "truth",
        "rather",
        "genesis",
        "logic",
        "sense",
        "deleuze",
        "attack",
        "problem",
        "first",
        "developing",
        "paradox",
        "result",
        "structure",
        "sense",
        "sketching",
        "theory",
        "genesis",
        "using",
        "resource",
        "analytic",
        "philosophy",
        "stoic",
        "course",
        "reading",
        "lewis",
        "carrolla",
        "typically",
        "innovative",
        "quirky",
        "set",
        "deleuzean",
        "reference",
        "first",
        "part",
        "book",
        "deleuze",
        "analyzes",
        "structure",
        "sense",
        "begin",
        "identifying",
        "three",
        "type",
        "relation",
        "within",
        "proposition",
        "designation",
        "denotation",
        "relation",
        "proposition",
        "external",
        "state",
        "affair",
        "theory",
        "reference",
        "criterion",
        "truth",
        "falsity",
        "manifestation",
        "mark",
        "relation",
        "proposition",
        "belief",
        "desire",
        "person",
        "speaking",
        "value",
        "veracity",
        "illusion",
        "signification",
        "demonstration",
        "relation",
        "proposition",
        "proposition",
        "domain",
        "logic",
        "relation",
        "implication",
        "assertion",
        "proposition",
        "word",
        "related",
        "either",
        "object",
        "refer",
        "subject",
        "utter",
        "proposition",
        "relation",
        "turn",
        "taken",
        "primary",
        "domain",
        "speech",
        "begin",
        "manifestation",
        "make",
        "denotation",
        "possible",
        "hume",
        "also",
        "prior",
        "signification",
        "descartes",
        "cogito",
        "domain",
        "language",
        "however",
        "signification",
        "primary",
        "since",
        "one",
        "always",
        "born",
        "preexisting",
        "language",
        "signified",
        "concept",
        "always",
        "primary",
        "relation",
        "self",
        "manifested",
        "person",
        "thing",
        "designated",
        "object",
        "yet",
        "domain",
        "logic",
        "see",
        "primacy",
        "designation",
        "shown",
        "hypothetical",
        "mode",
        "implication",
        "logical",
        "value",
        "demonstration",
        "truth",
        "rather",
        "condition",
        "truth",
        "condition",
        "possibility",
        "proposition",
        "would",
        "true",
        "premise",
        "must",
        "thus",
        "posited",
        "effectively",
        "true",
        "force",
        "one",
        "leave",
        "pure",
        "order",
        "implication",
        "order",
        "relate",
        "premise",
        "denoted",
        "state",
        "affair",
        "logical",
        "designation",
        "word",
        "fulfill",
        "putative",
        "role",
        "foundation",
        "since",
        "presupposes",
        "irreducible",
        "denotation",
        "theory",
        "proposition",
        "thus",
        "caught",
        "circle",
        "condition",
        "turn",
        "conditioned",
        "supposedly",
        "condition",
        "condition",
        "truth",
        "avoid",
        "defect",
        "deleuze",
        "argues",
        "would",
        "something",
        "unconditioned",
        "capable",
        "assuring",
        "real",
        "genesis",
        "designation",
        "dimension",
        "proposition",
        "condition",
        "truth",
        "would",
        "defined",
        "longer",
        "form",
        "conceptual",
        "possibility",
        "ideal",
        "matter",
        "medium",
        "matière",
        "ou",
        "couche",
        "idéelle",
        "longer",
        "signification",
        "sense",
        "l",
        "sense",
        "would",
        "fourth",
        "dimension",
        "proposition",
        "deleuze",
        "reserve",
        "term",
        "expression",
        "deleuze",
        "frege",
        "sense",
        "expressed",
        "proposition",
        "two",
        "sens",
        "morning",
        "star",
        "evening",
        "star",
        "two",
        "way",
        "denotatum",
        "may",
        "expressed",
        "proposition",
        "deleuze",
        "contribution",
        "philosophy",
        "sense",
        "really",
        "begin",
        "take",
        "show",
        "attempt",
        "make",
        "fourth",
        "dimension",
        "evident",
        "akin",
        "lewis",
        "carroll",
        "hunt",
        "snark",
        "unraveling",
        "möbius",
        "strip",
        "since",
        "sense",
        "neither",
        "physical",
        "mental",
        "existence",
        "deleuze",
        "suggests",
        "stoic",
        "first",
        "discovered",
        "dimension",
        "sense",
        "distinguished",
        "corporeal",
        "mixture",
        "incorporeal",
        "event",
        "attribute",
        "proper",
        "name",
        "battle",
        "waterloo",
        "particular",
        "state",
        "affair",
        "battle",
        "incorporeal",
        "event",
        "sense",
        "reality",
        "expression",
        "proposition",
        "find",
        "state",
        "affair",
        "body",
        "mixing",
        "one",
        "anotherspears",
        "stabbing",
        "flesh",
        "bullet",
        "flying",
        "air",
        "cannon",
        "firing",
        "body",
        "ripped",
        "apartand",
        "battle",
        "effect",
        "result",
        "intermingling",
        "body",
        "sense",
        "thus",
        "complex",
        "status",
        "one",
        "hand",
        "exist",
        "outside",
        "proposition",
        "express",
        "confused",
        "proposition",
        "since",
        "distinct",
        "objectity",
        "exist",
        "rather",
        "subsists",
        "insists",
        "hand",
        "attributed",
        "state",
        "affair",
        "thing",
        "confused",
        "identified",
        "state",
        "affair",
        "quality",
        "relation",
        "state",
        "sense",
        "expressible",
        "expressed",
        "proposition",
        "attribute",
        "state",
        "affair",
        "turn",
        "one",
        "side",
        "toward",
        "thing",
        "another",
        "side",
        "toward",
        "proposition",
        "confused",
        "proposition",
        "expressed",
        "state",
        "affair",
        "quality",
        "proposition",
        "denotes",
        "exactly",
        "boundary",
        "proposition",
        "thing",
        "l",
        "structure",
        "sense",
        "generates",
        "number",
        "paradox",
        "deleuze",
        "distinguishes",
        "paradox",
        "signification",
        "discovered",
        "russell",
        "set",
        "theory",
        "set",
        "set",
        "barber",
        "regiment",
        "first",
        "paradox",
        "regress",
        "indefinite",
        "proliferation",
        "never",
        "state",
        "sense",
        "saying",
        "take",
        "sense",
        "saying",
        "object",
        "another",
        "proposition",
        "whose",
        "sense",
        "turn",
        "state",
        "ad",
        "infinitum",
        "first",
        "paradox",
        "point",
        "impotence",
        "speaker",
        "inability",
        "state",
        "sense",
        "saying",
        "highest",
        "power",
        "language",
        "infinite",
        "capability",
        "speak",
        "word",
        "second",
        "paradox",
        "sterile",
        "reiteration",
        "doubling",
        "one",
        "avoid",
        "infinite",
        "regress",
        "extracting",
        "sense",
        "mere",
        "double",
        "proposition",
        "price",
        "catapulting",
        "u",
        "third",
        "paradox",
        "neutrality",
        "sterilitysense",
        "necessarily",
        "neutral",
        "regard",
        "various",
        "mode",
        "proposition",
        "quality",
        "affirmation",
        "negation",
        "quantity",
        "none",
        "relation",
        "modality",
        "possibility",
        "reality",
        "necessity",
        "thus",
        "extracted",
        "proposition",
        "deleuze",
        "argues",
        "sense",
        "status",
        "pure",
        "ideational",
        "event",
        "irreducible",
        "proposition",
        "three",
        "dimension",
        "state",
        "affair",
        "proposition",
        "denote",
        "experience",
        "mental",
        "activity",
        "belief",
        "desire",
        "image",
        "representation",
        "person",
        "express",
        "proposition",
        "universal",
        "general",
        "concept",
        "sense",
        "said",
        "engender",
        "dimension",
        "proposition",
        "second",
        "task",
        "logic",
        "sense",
        "combine",
        "sterility",
        "sense",
        "relation",
        "proposition",
        "extracted",
        "power",
        "genesis",
        "relation",
        "dimension",
        "proposition",
        "l",
        "second",
        "half",
        "logic",
        "sense",
        "deleuze",
        "analyzes",
        "call",
        "dynamic",
        "genesis",
        "language",
        "drawing",
        "part",
        "text",
        "developmental",
        "psychology",
        "psychoanalysis",
        "render",
        "language",
        "possible",
        "writes",
        "separate",
        "sound",
        "body",
        "organizes",
        "proposition",
        "freeing",
        "expressive",
        "function",
        "l",
        "deleuze",
        "distinguishes",
        "three",
        "stage",
        "dynamic",
        "genesis",
        "time",
        "constitute",
        "three",
        "dimension",
        "language",
        "primary",
        "order",
        "noise",
        "produced",
        "depth",
        "body",
        "secondary",
        "organization",
        "constitutes",
        "surface",
        "sense",
        "nonsense",
        "tertiary",
        "arrangement",
        "ordonnance",
        "found",
        "fullyformed",
        "proposition",
        "function",
        "denotation",
        "manifestation",
        "signification",
        "first",
        "stage",
        "dynamic",
        "genesis",
        "sense",
        "primary",
        "order",
        "language",
        "found",
        "newborn",
        "infant",
        "deleuze",
        "draw",
        "tradition",
        "developmental",
        "psychology",
        "whose",
        "insight",
        "expressed",
        "vivid",
        "image",
        "daniel",
        "n",
        "stern",
        "infant",
        "experience",
        "kind",
        "human",
        "weatherscape",
        "made",
        "entirely",
        "sequence",
        "rising",
        "fallings",
        "intensitythe",
        "jolting",
        "bright",
        "light",
        "sharp",
        "noise",
        "calming",
        "voice",
        "explosive",
        "breakout",
        "storm",
        "hunger",
        "interpersonal",
        "world",
        "infant",
        "deleuze",
        "draw",
        "upon",
        "writing",
        "french",
        "writer",
        "antonin",
        "artaud",
        "call",
        "life",
        "intensitiesinmotion",
        "body",
        "without",
        "organs",
        "primary",
        "order",
        "language",
        "pure",
        "noise",
        "dimension",
        "body",
        "constitutes",
        "first",
        "type",
        "nonsense",
        "midst",
        "world",
        "intensity",
        "also",
        "appears",
        "particular",
        "noise",
        "sound",
        "child",
        "parent",
        "adult",
        "long",
        "infant",
        "understand",
        "word",
        "sentence",
        "grasp",
        "language",
        "something",
        "preexists",
        "something",
        "alwaysalready",
        "like",
        "voice",
        "high",
        "child",
        "voice",
        "dimension",
        "language",
        "without",
        "condition",
        "adult",
        "experience",
        "hear",
        "foreign",
        "language",
        "spoken",
        "infant",
        "accede",
        "tertiary",
        "arrangement",
        "language",
        "denotation",
        "manifestation",
        "signification",
        "must",
        "pas",
        "secondary",
        "organization",
        "production",
        "surface",
        "dimension",
        "sense",
        "construction",
        "take",
        "place",
        "flow",
        "voice",
        "child",
        "extract",
        "differential",
        "element",
        "various",
        "order",
        "phoneme",
        "morpheme",
        "semantemes",
        "begin",
        "synthesize",
        "diverse",
        "series",
        "point",
        "deleuze",
        "isolates",
        "three",
        "series",
        "synthesis",
        "connective",
        "conjunctive",
        "disjunctive",
        "first",
        "child",
        "connects",
        "phoneme",
        "concatenation",
        "successive",
        "entity",
        "mama",
        "dada",
        "second",
        "construction",
        "esoteric",
        "word",
        "phoneme",
        "integration",
        "conjunction",
        "royal",
        "highness",
        "contracted",
        "reince",
        "third",
        "child",
        "start",
        "making",
        "esoteric",
        "word",
        "ramify",
        "enter",
        "relation",
        "divergent",
        "independent",
        "series",
        "clearly",
        "see",
        "construction",
        "secondary",
        "organization",
        "sense",
        "yet",
        "fully",
        "formed",
        "unit",
        "tertiary",
        "arrangement",
        "language",
        "high",
        "longer",
        "merely",
        "bodily",
        "noise",
        "primary",
        "order",
        "child",
        "understanding",
        "linguistic",
        "unit",
        "undertakes",
        "vast",
        "apprenticeship",
        "formative",
        "element",
        "domain",
        "sense",
        "condition",
        "ground",
        "proposition",
        "form",
        "possibility",
        "ideal",
        "matter",
        "medium",
        "positioned",
        "immediately",
        "within",
        "sense",
        "whenever",
        "denote",
        "manifest",
        "signify",
        "moreover",
        "since",
        "sense",
        "lie",
        "frontier",
        "word",
        "thingsit",
        "expressed",
        "proposition",
        "attributed",
        "state",
        "affair",
        "confused",
        "either",
        "proposition",
        "state",
        "affairsit",
        "engenders",
        "determinate",
        "dimension",
        "proposition",
        "denotation",
        "manifestation",
        "signification",
        "well",
        "objective",
        "correlate",
        "denoted",
        "manifested",
        "signified",
        "domain",
        "sense",
        "necessarily",
        "subject",
        "fundamental",
        "fragility",
        "capable",
        "toppling",
        "nonsense",
        "ground",
        "give",
        "way",
        "groundlessness",
        "sansfond",
        "reason",
        "clear",
        "sense",
        "never",
        "principle",
        "origin",
        "rather",
        "effect",
        "produced",
        "produced",
        "element",
        "sense",
        "sense",
        "word",
        "determinate",
        "relation",
        "nonsense",
        "deleuze",
        "however",
        "distinguishes",
        "two",
        "different",
        "type",
        "nonsense",
        "first",
        "lewis",
        "carroll",
        "remains",
        "surface",
        "sense",
        "like",
        "child",
        "make",
        "use",
        "nonsignifying",
        "element",
        "language",
        "order",
        "construct",
        "portmanteau",
        "word",
        "snark",
        "shark",
        "snake",
        "frumious",
        "furious",
        "fuming",
        "nonsensical",
        "phrase",
        "twas",
        "brillig",
        "slithy",
        "toves",
        "gyre",
        "gimble",
        "wabe",
        "populate",
        "writing",
        "logic",
        "sense",
        "part",
        "reading",
        "carroll",
        "work",
        "one",
        "knew",
        "better",
        "carroll",
        "condition",
        "production",
        "sense",
        "deleuze",
        "elucidates",
        "detail",
        "extraction",
        "differential",
        "element",
        "pure",
        "event",
        "organization",
        "multiple",
        "series",
        "importantly",
        "aleatory",
        "point",
        "paradoxical",
        "element",
        "link",
        "series",
        "ideal",
        "quasicause",
        "produce",
        "effect",
        "sense",
        "nonsense",
        "second",
        "type",
        "nonsense",
        "profound",
        "surface",
        "nonsense",
        "found",
        "lewis",
        "carroll",
        "terrifying",
        "nonsense",
        "primary",
        "order",
        "found",
        "expression",
        "writing",
        "antonin",
        "artaud",
        "sense",
        "prevents",
        "sonorous",
        "language",
        "confused",
        "physical",
        "body",
        "noise",
        "primary",
        "order",
        "schizophrenia",
        "experienced",
        "artaud",
        "longer",
        "anything",
        "prevent",
        "proposition",
        "falling",
        "back",
        "onto",
        "body",
        "mingle",
        "sonorous",
        "element",
        "olfactory",
        "gustatory",
        "digestive",
        "effect",
        "body",
        "artaud",
        "crissouffles",
        "ratara",
        "ratara",
        "ratara",
        "atara",
        "tatara",
        "rana",
        "otara",
        "otara",
        "katara",
        "deleuze",
        "develop",
        "theory",
        "bodywithoutorgans",
        "collaboration",
        "félix",
        "guattari",
        "turn",
        "shall",
        "see",
        "concept",
        "bodywithoutorgans",
        "put",
        "work",
        "complex",
        "naturalistic",
        "philosophy",
        "desiringproduction",
        "move",
        "far",
        "beyond",
        "question",
        "sense",
        "realm",
        "nature",
        "history",
        "politics",
        "word",
        "logic",
        "sense",
        "represents",
        "deleuze",
        "confrontation",
        "linguistic",
        "turn",
        "important",
        "twentiethcentury",
        "philosophy",
        "confrontation",
        "quickly",
        "put",
        "behind",
        "came",
        "embrace",
        "fully",
        "materialist",
        "naturalistic",
        "leaning"
    ]
}