{
    "main_text": "Works on Physiognomonics\n4. Works on Physiognomonics\n\nPhysiognomonics, a proto- or pseudo-science on the rise in the\nsixteenth century, sought to identify the visible affinities between\nall physical things. As is for instance amply evidenced in his\nPhytognomonica Porta detected such affinities everywhere, from plants\nand animals to the bodies and faces of humans, and even further up the\nontological scale to the appearance of the planets\n(Müller-Jahncke 1990). Porta’s physiognomonics provides\ncartographies of the outward appearance of physical bodies aimed at\npredicting the soul’s hidden inclinations or dispositions (past,\npresent or future). Porta’s massive effort to map the exterior\nappearances of all animated bodies runs in tandem with the\ncontemporary medical approach towards cartographies of human bodies\n(as well as landscapes), exemplified most notably by Andreas Vesalius\n(1514–64) in his revolutionary anatomical studies. Incorporating\na huge array of classical and contemporary sources, Porta’s\nphysiognomic texts are an outright summa of this branch of knowledge\nand practice.\n\nWithin its own historical context, physiognomonics was viewed as a\nscientia universalis, rational science as good as, or perhaps even\nbetter than, the new anatomy, since it could be used for universal\ndescription and as a means to identify character traits (Paolella\n2015). In his circular reasoning, Porta’s cosmos becomes more\nand more anthropomorphic, as universal signatures are imprinted not\nonly into human beings, but also share these physical traits with the\nstars, animals, herbs and even stones (as explained in Porta’s\nPhytognomonica) (Kahn & Perifano 2018).\n\nPorta’s physiognomonic assessments are based on resemblances in\nexternal appearance: for instance, men with a dark, Saturnine\ncomplexion evocative of dangerous animals are rendered very likely to\ngo to prison (De ea naturalis physiognomoniae parte quae ad manuum\nlineas spectat ch. 12). This example highlights the aesthetics\nstructuring Porta’s physiognomonics: beautiful bodies are also\nmorally good. There is a direct association between beauty, virtue,\nsuccess and health, as these traits all originate from a good\ntemperament, that is, from a harmonious mixture of the elements. A\nmonstrous body, on the other hand, indicates ill health, bad luck, and\ndubious moral inclinations. (Kodera 2015)\n\nA truly universal science, physiognomonics provides its master not\nonly with a key for decoding the ciphers written into human faces (by\nrelating them to the shapes of animals) or a manual for reading the\nlines engraved into the palms of our hands, but also (as Porta\nsuggests) with diagnostic methods for understanding all of creation,\nfrom plants to stars. As is amply advertised already in the prefaces\nto all of his texts on physiognomonics, the art establishes a\nmetonymic relationship between inorganic bodies and psychological\nqualities (Caputo 1990, Paolella 2004, Muratori 2017).\n\nOne important aspect of Porta’s physiognomonics is that it is\nnot merely descriptive: bodies may be mapped and their future\npredicted, but they are nevertheless in a constant state of flux,\ntransition, or mutability. Their essences are not exclusively\ndetermined by an invisible substantial form (soul) derived from\nunchangeable forms—and, in the case of human beings,\nimmortal—as in previous traditions, but (more than ever) result\nfrom external circumstances. These environmental influences are\ndecisive for the fate of individuals whose expressions and appearances\nare unstably shaped. A characteristic quotation illustrates\nPorta’s understanding of physiognomonics:\n\nThrough this art, we have helped many friends avoid dangers and ascend\nto honours. Shortly before I wrote these things, I counselled a friend\nof mine to avoid the company of a certain ugly and unlucky man, an\nadvice he did not want to hear, as his acquaintance had promised him\nriches; at the end of the day, they were caught by the governor\nproducing counterfeit money in a hide-out and shortly afterwards both\nended on the gallows. (Coelestis physiognomonia, bk. 1, ch. 2)\n\n\nIt has often been noted that Porta opens perspectives on the sinister\ntradition of eugenics (Paolella 2015), not uncommon currency in\nEuropean intellectual culture since its articulation in Plato’s\nTimaeus (90), where a handsome body is stipulated as the abode of a\nbeautiful soul. Apart from the elemental influences altering body and\nmind, which can be reduced to qualities perceived through touch (such\nas hot/cold, dry/moist), Porta mentions nutrition, climate, and age as\ndeterminants of an individual’s mental and physical shape, not\nonly of human beings but also of animals and even of plants. Disease\nmay also alter an individual’s mental disposition: as an\nexample, Porta mentions fevers—since they dry up the brain, they\nmay cause the patient to become more intelligent. Disease may even\ninstill a capacity for divination. Alterations in outward appearance\nbear thus significant consequences for the individual’s\nbehaviour and habits (De humana pysiognomonia bk. 6, ch.1).\n\nFrom the perspective of religious orthodoxy, the crucial question\nPorta addresses only with (well-advised) trepidation is whether a\nchange in exterior form can also cause alterations to the\nsoul—i.e., in the substantial and indelible form of humans (De\nhumana pysiognomonia bk. 1, ch. 20). Here, Porta takes the position,\nmore common to medical physiologists, that it is a physician’s\nintervention rather than moral philosophy that cures our bodies and\nminds. On this view, the body becomes a potential stage for medical\nintervention into the mental realm (Kodera 2010: ch. 8, Kodera\n2015).\n\nThe concept of the temperaments or humoural mixtures in the human body\nwas originally developed to describe physiological body states: “The\nfour humours were real body fluids, to which largely hypothetical\norigins, sites, and functions were ascribed” (Siraisi 1990: 105). In\nlate Antiquity and in the Middle Ages, the temperaments were\nunderstood to fall under the reign of the stars, which influence the\ngeneration and corruption of bodies in the sublunar sphere. In an\nimportant conceptual step, Porta turns the tables, contending that\nrather than being controlled by the stars, the medical humours are\nactually universal descriptors structuring the entire cosmos. With\nthis move in a naturalistic direction, Porta strove to eclipse the\nastrological elements of his theory. Even though in the Coelestis\nphysiognomonia he had declared astrology a vain discipline, Porta\nadded an important qualification to this dismissal: astrology is an\nerroneous art, but only as long as divination from the stars is not\nbased on the perceptible features of heavenly bodies. Hence, a fine\nphysiognomonist will swiftly derive the relevant temperamental\nfeatures from the visible appearance of the planets. In this way, all\nnatural bodies remain substantiae signatae, cosmically predisposed\nsubstances bearing inscriptions of universal signs. The astrological\nsystem of categorization was restricted to the medical temperaments,\nthus associating celestial bodies with a system of signs that\npertained to medicine and hence to a lower level in the hierarchy of\nbeing. Instead of governing the lower bodies, the stars become subject\nto the same laws as earthly bodies (Coelestis physiognomonia,\nproemium, Paolella 2004). According to classical medicine, diseases\nare caused by an imbalance between body fluids—the temperaments.\nThis was a notable shift in terminology and concept: for in the first\nversion of the Magia naturalis, Porta had maintained that form had\nbeen the decisive factor for the occult property of a thing: now he\naligned these properties to elemental qualities (Verardi 2018).\n\nInitially, Porta’s naturalized version of astrology was probably\na mere maneuver for detouring around the ecclesiastical censorship of\nthe divinatory arts; in the first edition of the Magia (1558) Porta\nhad fully embraced astrological causation, as well as the decisive\nrole of an auspicious astrological moment for magical operations,\nespecially the confection of talismans as described by Ficino in the\nDe vita (Magia 1558: bk. 1, chs. 15–17; Trabucco 2002,\n2005).\n\nHowever, close alignment of astrology with medical humours and\nphysiognomonics is well in accordance with Porta’s larger aim of\nnaturalizing the entire cosmos. These interactions also have bearings\non Della Porta’s theater, which is not very suprising indeed, as\nthe traditon of physiognomonics was developed in the ambit of the\nclassical stage, notably in Theoprastus Characteres, a text that\ndescribes the typical features of comical personae (Kodera 2015,\nRefini 2017). As many students of Porta’s theater noted,\nsometimes outrightly grotesque displays of pysiognomics figure\nprominently in his numerous comedies. (Clubb 1964, Gherardini, 1971,\nKodera 2015)\n",
    "section_title": "4. Works on Physiognomonics",
    "entry_title": "Giambattista della Porta",
    "hierarchy_title": "Giambattista della Porta || Works on Physiognomonics",
    "tokenized_text": [
        "work",
        "physiognomonics",
        "work",
        "physiognomonics",
        "physiognomonics",
        "proto",
        "pseudoscience",
        "rise",
        "sixteenth",
        "century",
        "sought",
        "identify",
        "visible",
        "affinity",
        "physical",
        "thing",
        "instance",
        "amply",
        "evidenced",
        "phytognomonica",
        "porta",
        "detected",
        "affinity",
        "everywhere",
        "plant",
        "animal",
        "body",
        "face",
        "human",
        "even",
        "ontological",
        "scale",
        "appearance",
        "planet",
        "müllerjahncke",
        "porta",
        "physiognomonics",
        "provides",
        "cartography",
        "outward",
        "appearance",
        "physical",
        "body",
        "aimed",
        "predicting",
        "soul",
        "hidden",
        "inclination",
        "disposition",
        "past",
        "present",
        "future",
        "porta",
        "massive",
        "effort",
        "map",
        "exterior",
        "appearance",
        "animated",
        "body",
        "run",
        "tandem",
        "contemporary",
        "medical",
        "approach",
        "towards",
        "cartography",
        "human",
        "body",
        "well",
        "landscape",
        "exemplified",
        "notably",
        "andreas",
        "vesalius",
        "revolutionary",
        "anatomical",
        "study",
        "incorporating",
        "huge",
        "array",
        "classical",
        "contemporary",
        "source",
        "porta",
        "physiognomic",
        "text",
        "outright",
        "summa",
        "branch",
        "knowledge",
        "practice",
        "within",
        "historical",
        "context",
        "physiognomonics",
        "viewed",
        "scientia",
        "universalis",
        "rational",
        "science",
        "good",
        "perhaps",
        "even",
        "better",
        "new",
        "anatomy",
        "since",
        "could",
        "used",
        "universal",
        "description",
        "mean",
        "identify",
        "character",
        "trait",
        "paolella",
        "circular",
        "reasoning",
        "porta",
        "cosmos",
        "becomes",
        "anthropomorphic",
        "universal",
        "signature",
        "imprinted",
        "human",
        "being",
        "also",
        "share",
        "physical",
        "trait",
        "star",
        "animal",
        "herb",
        "even",
        "stone",
        "explained",
        "porta",
        "phytognomonica",
        "kahn",
        "perifano",
        "porta",
        "physiognomonic",
        "assessment",
        "based",
        "resemblance",
        "external",
        "appearance",
        "instance",
        "men",
        "dark",
        "saturnine",
        "complexion",
        "evocative",
        "dangerous",
        "animal",
        "rendered",
        "likely",
        "go",
        "prison",
        "de",
        "ea",
        "naturalis",
        "physiognomoniae",
        "parte",
        "quae",
        "ad",
        "manuum",
        "lineas",
        "spectat",
        "ch",
        "example",
        "highlight",
        "aesthetic",
        "structuring",
        "porta",
        "physiognomonics",
        "beautiful",
        "body",
        "also",
        "morally",
        "good",
        "direct",
        "association",
        "beauty",
        "virtue",
        "success",
        "health",
        "trait",
        "originate",
        "good",
        "temperament",
        "harmonious",
        "mixture",
        "element",
        "monstrous",
        "body",
        "hand",
        "indicates",
        "ill",
        "health",
        "bad",
        "luck",
        "dubious",
        "moral",
        "inclination",
        "kodera",
        "truly",
        "universal",
        "science",
        "physiognomonics",
        "provides",
        "master",
        "key",
        "decoding",
        "cipher",
        "written",
        "human",
        "face",
        "relating",
        "shape",
        "animal",
        "manual",
        "reading",
        "line",
        "engraved",
        "palm",
        "hand",
        "also",
        "porta",
        "suggests",
        "diagnostic",
        "method",
        "understanding",
        "creation",
        "plant",
        "star",
        "amply",
        "advertised",
        "already",
        "preface",
        "text",
        "physiognomonics",
        "art",
        "establishes",
        "metonymic",
        "relationship",
        "inorganic",
        "body",
        "psychological",
        "quality",
        "caputo",
        "paolella",
        "muratori",
        "one",
        "important",
        "aspect",
        "porta",
        "physiognomonics",
        "merely",
        "descriptive",
        "body",
        "may",
        "mapped",
        "future",
        "predicted",
        "nevertheless",
        "constant",
        "state",
        "flux",
        "transition",
        "mutability",
        "essence",
        "exclusively",
        "determined",
        "invisible",
        "substantial",
        "form",
        "soul",
        "derived",
        "unchangeable",
        "formsand",
        "case",
        "human",
        "being",
        "immortalas",
        "previous",
        "tradition",
        "ever",
        "result",
        "external",
        "circumstance",
        "environmental",
        "influence",
        "decisive",
        "fate",
        "individual",
        "whose",
        "expression",
        "appearance",
        "unstably",
        "shaped",
        "characteristic",
        "quotation",
        "illustrates",
        "porta",
        "understanding",
        "physiognomonics",
        "art",
        "helped",
        "many",
        "friend",
        "avoid",
        "danger",
        "ascend",
        "honour",
        "shortly",
        "wrote",
        "thing",
        "counselled",
        "friend",
        "mine",
        "avoid",
        "company",
        "certain",
        "ugly",
        "unlucky",
        "man",
        "advice",
        "want",
        "hear",
        "acquaintance",
        "promised",
        "rich",
        "end",
        "day",
        "caught",
        "governor",
        "producing",
        "counterfeit",
        "money",
        "hideout",
        "shortly",
        "afterwards",
        "ended",
        "gallows",
        "coelestis",
        "physiognomonia",
        "bk",
        "ch",
        "often",
        "noted",
        "porta",
        "open",
        "perspective",
        "sinister",
        "tradition",
        "eugenics",
        "paolella",
        "uncommon",
        "currency",
        "european",
        "intellectual",
        "culture",
        "since",
        "articulation",
        "plato",
        "timaeus",
        "handsome",
        "body",
        "stipulated",
        "abode",
        "beautiful",
        "soul",
        "apart",
        "elemental",
        "influence",
        "altering",
        "body",
        "mind",
        "reduced",
        "quality",
        "perceived",
        "touch",
        "hotcold",
        "drymoist",
        "porta",
        "mention",
        "nutrition",
        "climate",
        "age",
        "determinant",
        "individual",
        "mental",
        "physical",
        "shape",
        "human",
        "being",
        "also",
        "animal",
        "even",
        "plant",
        "disease",
        "may",
        "also",
        "alter",
        "individual",
        "mental",
        "disposition",
        "example",
        "porta",
        "mention",
        "feverssince",
        "dry",
        "brain",
        "may",
        "cause",
        "patient",
        "become",
        "intelligent",
        "disease",
        "may",
        "even",
        "instill",
        "capacity",
        "divination",
        "alteration",
        "outward",
        "appearance",
        "bear",
        "thus",
        "significant",
        "consequence",
        "individual",
        "behaviour",
        "habit",
        "de",
        "humana",
        "pysiognomonia",
        "bk",
        "ch",
        "perspective",
        "religious",
        "orthodoxy",
        "crucial",
        "question",
        "porta",
        "address",
        "welladvised",
        "trepidation",
        "whether",
        "change",
        "exterior",
        "form",
        "also",
        "cause",
        "alteration",
        "soulie",
        "substantial",
        "indelible",
        "form",
        "human",
        "de",
        "humana",
        "pysiognomonia",
        "bk",
        "ch",
        "porta",
        "take",
        "position",
        "common",
        "medical",
        "physiologist",
        "physician",
        "intervention",
        "rather",
        "moral",
        "philosophy",
        "cure",
        "body",
        "mind",
        "view",
        "body",
        "becomes",
        "potential",
        "stage",
        "medical",
        "intervention",
        "mental",
        "realm",
        "kodera",
        "ch",
        "kodera",
        "concept",
        "temperament",
        "humoural",
        "mixture",
        "human",
        "body",
        "originally",
        "developed",
        "describe",
        "physiological",
        "body",
        "state",
        "four",
        "humour",
        "real",
        "body",
        "fluid",
        "largely",
        "hypothetical",
        "origin",
        "site",
        "function",
        "ascribed",
        "siraisi",
        "late",
        "antiquity",
        "middle",
        "age",
        "temperament",
        "understood",
        "fall",
        "reign",
        "star",
        "influence",
        "generation",
        "corruption",
        "body",
        "sublunar",
        "sphere",
        "important",
        "conceptual",
        "step",
        "porta",
        "turn",
        "table",
        "contending",
        "rather",
        "controlled",
        "star",
        "medical",
        "humour",
        "actually",
        "universal",
        "descriptor",
        "structuring",
        "entire",
        "cosmos",
        "move",
        "naturalistic",
        "direction",
        "porta",
        "strove",
        "eclipse",
        "astrological",
        "element",
        "theory",
        "even",
        "though",
        "coelestis",
        "physiognomonia",
        "declared",
        "astrology",
        "vain",
        "discipline",
        "porta",
        "added",
        "important",
        "qualification",
        "dismissal",
        "astrology",
        "erroneous",
        "art",
        "long",
        "divination",
        "star",
        "based",
        "perceptible",
        "feature",
        "heavenly",
        "body",
        "hence",
        "fine",
        "physiognomonist",
        "swiftly",
        "derive",
        "relevant",
        "temperamental",
        "feature",
        "visible",
        "appearance",
        "planet",
        "way",
        "natural",
        "body",
        "remain",
        "substantiae",
        "signatae",
        "cosmically",
        "predisposed",
        "substance",
        "bearing",
        "inscription",
        "universal",
        "sign",
        "astrological",
        "system",
        "categorization",
        "restricted",
        "medical",
        "temperament",
        "thus",
        "associating",
        "celestial",
        "body",
        "system",
        "sign",
        "pertained",
        "medicine",
        "hence",
        "lower",
        "level",
        "hierarchy",
        "instead",
        "governing",
        "lower",
        "body",
        "star",
        "become",
        "subject",
        "law",
        "earthly",
        "body",
        "coelestis",
        "physiognomonia",
        "proemium",
        "paolella",
        "according",
        "classical",
        "medicine",
        "disease",
        "caused",
        "imbalance",
        "body",
        "fluidsthe",
        "temperament",
        "notable",
        "shift",
        "terminology",
        "concept",
        "first",
        "version",
        "magia",
        "naturalis",
        "porta",
        "maintained",
        "form",
        "decisive",
        "factor",
        "occult",
        "property",
        "thing",
        "aligned",
        "property",
        "elemental",
        "quality",
        "verardi",
        "initially",
        "porta",
        "naturalized",
        "version",
        "astrology",
        "probably",
        "mere",
        "maneuver",
        "detouring",
        "around",
        "ecclesiastical",
        "censorship",
        "divinatory",
        "art",
        "first",
        "edition",
        "magia",
        "porta",
        "fully",
        "embraced",
        "astrological",
        "causation",
        "well",
        "decisive",
        "role",
        "auspicious",
        "astrological",
        "moment",
        "magical",
        "operation",
        "especially",
        "confection",
        "talisman",
        "described",
        "ficino",
        "de",
        "vita",
        "magia",
        "bk",
        "chs",
        "trabucco",
        "however",
        "close",
        "alignment",
        "astrology",
        "medical",
        "humour",
        "physiognomonics",
        "well",
        "accordance",
        "porta",
        "larger",
        "aim",
        "naturalizing",
        "entire",
        "cosmos",
        "interaction",
        "also",
        "bearing",
        "della",
        "porta",
        "theater",
        "suprising",
        "indeed",
        "traditon",
        "physiognomonics",
        "developed",
        "ambit",
        "classical",
        "stage",
        "notably",
        "theoprastus",
        "characteres",
        "text",
        "describes",
        "typical",
        "feature",
        "comical",
        "persona",
        "kodera",
        "refini",
        "many",
        "student",
        "porta",
        "theater",
        "noted",
        "sometimes",
        "outrightly",
        "grotesque",
        "display",
        "pysiognomics",
        "figure",
        "prominently",
        "numerous",
        "comedy",
        "clubb",
        "gherardini",
        "kodera"
    ]
}