{
    "main_text": "Delusions and the Continuity Thesis || Are delusions beliefs?\n4.3 Do delusions overlap with self-deception or beliefs in conspiracy theories?\n\nThere is no consensus on whether delusions overlap with instances of\nbelief that are frequent in the nonclinical population, such as self\ndeception or beliefs in conspiracy theories. Philosophers who ask\nsuch questions may be interested in supporting or challenging the\ncontinuity theory; mapping reasons why delusions should (or should\nnot) be regarded as pathological; or wanting to clarify the\ndistinctiveness of the phenomenon of clinical delusions.\n\nSelf deception has been traditionally characterized as driven by\nmotivational factors whereas delusions are now primarily accounted in\nneuropsychological terms. Although theories of delusion formation\ninvolve reference to perceptual and cognitive impairments, as we saw,\nmotivational factors play an important role in the explanation of some\ndelusions, e.g. by partially determining the specific content of the\nreported delusional state. Thus, one plausible view is that\nself-deception and delusion are distinct phenomena that may overlap in\nsome circumstances (for further analysis, see Bayne and\nFernàndez 2008). There are three arguments for the view that\ndelusions and self-deception overlap.\n\nThe first view about the relationship between delusions and\nself-deception is that, when they overlap, they do so because they\nboth involve a motivationally biased treatment of evidence. If a\nmotivationally biased treatment of evidence is the key feature of\nself-deception (as for deflationists such as Mele 2001 and 2008), then\nwhen we have delusions we can be said to be self-deceived if we treat\nthe evidence at our disposal or search for evidence in a\nmotivationally biased way. This does not seem to be generally the case\nwith delusions, but can apply to some cases of delusions. Some\ndelusions of misidentification (at least according to\nneuropsychological accounts) do not seem to be akin to self-deception,\ngiven that there is no fundamental role for motivational biases in the\nexplanation of how we come to hold or retain the delusion. A different\nanalysis might be appropriate for delusions of jealousy or\npersecution.\n\nThe second view is that (some) delusions are extreme cases of\nself-deception and that they have a protective and adaptive function\n(see Hirstein 2005). An example is offered by Ramachandran, who\ndiscusses anosognosia, the denial of illness, and somatoparaphrenia,\nthe delusion that a part of one’s body belongs to someone else.\nRamachandran 1996 reports the case of a woman (FD) who suffered from a\nright hemisphere stroke which left her with left hemiplegia. FD could\nnot move without a wheelchair and could not move her left arm. But\nwhen she was asked whether she could walk and she could engage in\nactivities which require both hands (such as clapping), she claimed\nthat she could. Ramachandran advances the hypothesis that behaviors\ngiving rise to confabulations and delusions are an exaggeration of\nnormal defense mechanisms that have an adaptive function, as they\nallow us to create a coherent system of beliefs and to behave in a\nstable manner. In the neurotypical case, the left hemisphere produces\nconfabulatory explanations aimed at preserving the status quo\n(‘I’m not ill’; ‘My arm can move’), but\nthe right hemisphere detects an anomaly between the hypotheses\ngenerated by the left hemisphere and reality. So, it forces a revision\nof the belief system. In patients such as FD, the discrepancy detector\nno longer works. It is very plausible that delusions in anosognosia\ninvolve motivational aspects. But whether these delusions are an\nexaggerated form of self-deception depends on the preferred\ntheoretical characterization of self-deception.\n\nThe third view about the potential overlap of delusions and\nself-deception is that the very existence of delusions (which shows\nthat doxastic conflict is possible) can help us vindicate the\ntraditional account of self-deception. According to this view, we have\ntwo contradictory beliefs, but we are aware of only one of them,\nbecause we are motivated to remain unaware of the other (McKay et\nal. 2005a, p. 314). This account derives from Donald\nDavidson’s theory of self-deception (e.g. Davidson 1982 and\n1985b). When I deceive myself, I believe a true proposition but act in\nsuch a way as to causing myself to believe the negation of that\nproposition. Neil Levy argues that the conditions for self-deception\nset by the traditional approach are not necessary for self-deception,\nbut that the case of FD described by Ramachandran (1996) is living\nproof that a person can, at the same time, believe that her arm is\nparalyzed, and believe that she can move her arm. Moreover, it is the\nbelief that her arm is paralyzed that causes her to acquire the belief\nthat her arm is not. This is Levy’s analysis of the typical\nperson with anosognosia Levy 2008 (p. 234):\n\nFD believes that her limb is healthy.\nNevertheless she also has the simultaneous belief (or strong\nsuspicion) that her limb is significantly impaired and she is\nprofoundly disturbed by this belief (suspicion).\nCondition (1) is satisfied because condition (2) is satisfied;\nthat is, FD is motivated to form the belief that her limb is healthy\nbecause she has the concurrent belief (suspicion) that it is\nsignificantly impaired and she is disturbed by this belief\n(suspicion).\n\n\nIf this analysis is correct, at least one case of delusion (e.g.,\nanosognosia) involves doxastic conflict. The most controversial aspect\nof this analysis concerns condition (2). Is the belief that her limb\nis impaired truly available to FD? One could argue that, given that FD\nprobably has a deficit in the discrepancy detector of the right\nhemisphere of the brain, she has no awareness of the impairment she\ndenies (see also Hirstein 2005). But Levy’s reply is that\navailability comes in degrees. He suggests that, given that people\nwith paralysis and anosognosia often avoid tasks that would require\nmobility when costs for failure are high, and given that they can\nacknowledge some difficulties in movement (and say ‘I have\narthritis’ or ‘My left arm has always been weaker’),\nit is plausible that they have some awareness of their\nimpairment – although they may lack a fully formed and conscious\nbelief about it.\n\nThe debate about the differences between delusion and self-deception\nhas centred on whether delusions (just like ordinary instances of\nself-deception) are explicable from a folk-psychological point of view\n(Bortolotti and Mameli 2012; Murphy 2012, 2013). Murphy argues that\ndelusions are diagnosed when folk psychology runs out of resources for\nunderstanding what we seem to report as a genuine belief. By contrast,\nself-deception does not challenge our folk-psychological\ngeneralisations, because our beliefs are expected to be influenced by\nour desires at least on some occasions (e.g., when stakes are high).\nBortolotti and Mameli maintain that the gap between self-deception and\nmotivated delusions (such as anosognosia) is narrower than the gap\nbetween self-deception and apparently nonmotivated delusions, but\neven in the latter case folk psychology can account for the delusional\nbelief as an explanation (imperfect as it may be) of the delusional\nexperience.\n\nIn recent commentaries on the spread of conspiracy theories during a\ncrisis, comparisons between beliefs in conspiracy theories and\ndelusions have been ubiquitous (Bortolotti et al. 2021). For instance,\npeople have argued that what makes beliefs in flat Earth and climate\ndenial problematic is not their failing to represent reality\naccurately, but their rigidity and incorrigibility, which they see as\na typical feature of delusional beliefs. The comparison has been made\non the basis of three criteria: (a) how the beliefs manifest (e.g.,\nimplausibility and unshakeability); (b) how the beliefs are formed\n(e.g., faulty monitoring of ideas); and (c) how the beliefs affect\nwellbeing and good functioning.\n\nLet’s consider the criteria in turn. With respect to surface\nfeatures, both clinical delusions and beliefs in conspiracy theories\nappear implausible to those who do not endorse them, and in some\ncircumstances quite unusual and bizarre as well. It is their alleged\nepistemic irrationality, though, that seems to play the central role\nin the comparison. It is commonly assumed that clinical delusions and\nbeliefs in conspiracy theories are neither well supported by evidence\nnor responsive to counterevidence. As we saw, there is a variation in\nthese features when they are applied to delusions, and similarly when\nthey are applied to beliefs in conspiracy theories. In the case of\ndelusions, the unusual experience we have may be considered prima\nfacie evidence for the delusional hypothesis; and in the case of\nconspiracy theories, if we belong to a group that has been\nmarginalised and excluded, then our previous experience with the\nauthorities may legitimise our mistrusting them as sources of\ninformation (Levy 2019).\n\nWith respect to how the beliefs are formed, there is no consensus.\nSome argue that the same models used to describe delusion formation\ncan be invoked in the description of how beliefs in conspiracy\ntheories emerge. For instance, for two-factor theorists, there is a\nfirst factor which is unusual experience in the case of delusion and\nepistemic mistrust in the case of beliefs in conspiracy theories.\nThen, there is a common second factor which comprises some reasoning\nbiases and motivational factors (e.g., Pierre 2020). The first factor\nwould explain the theme of the delusion or conspiracy. The second\nfactor would explain why the belief is endorsed and maintained despite\nits prima facie implausibility. For researchers working\nwithin a predictive coding account, paranoia predicts difficulty in\nupdating beliefs across the clinical-nonclinical divide, which\nsuggests that some of the same mechanisms may be responsible for how\npeople respond to uncertainties (Reed et al. 2020). Other researchers\nthough deny that there is overlap in etiology, and point to the fact\nthat no cognitive dysfunction needs to be postulated to explain the\nformation of beliefs in conspiracy theories (e.g., Oliver and Wood\n2014). \n\nFinally, with respect to the downstream effects of endorsing\ndelusional beliefs and beliefs in conspiracy theories, differences are marked. Whereas delusions are often\ncharacterised by disruption in psychological functioning and social\nwithdrawal and isolation, beliefs in conspiracy theories can be seen\nas cementing some relationships in well-defined social groups and as\nbeing protective against anxiety and stress. A closer examination may\nshed some doubt on the differences though. Some delusions can be\nadaptive in the short-term and some beliefs in conspiracy theories can\nbe harmful in the long term.\n\nIn sum, the views summarized here show that it can be very difficult\nto justify clear-cut distinctions between delusion and self-deception,\nand between delusions and beliefs in conspiracy theories. It is\ndiagnostically and scientifically useful to maintain a distinction\nbetween symptoms of clinical conditions and manifestations of everyday\nirrationality, but the elements of genuine overlap should also be\nacknowledged.\n",
    "section_title": "4.3 Do delusions overlap with self-deception or beliefs in conspiracy theories?",
    "entry_title": "Delusion",
    "hierarchy_title": "Delusion || Delusions and the Continuity Thesis || Are delusions beliefs?",
    "tokenized_text": [
        "delusion",
        "continuity",
        "thesis",
        "delusion",
        "belief",
        "delusion",
        "overlap",
        "selfdeception",
        "belief",
        "conspiracy",
        "theory",
        "consensus",
        "whether",
        "delusion",
        "overlap",
        "instance",
        "belief",
        "frequent",
        "nonclinical",
        "population",
        "self",
        "deception",
        "belief",
        "conspiracy",
        "theory",
        "philosopher",
        "ask",
        "question",
        "may",
        "interested",
        "supporting",
        "challenging",
        "continuity",
        "theory",
        "mapping",
        "reason",
        "delusion",
        "regarded",
        "pathological",
        "wanting",
        "clarify",
        "distinctiveness",
        "phenomenon",
        "clinical",
        "delusion",
        "self",
        "deception",
        "traditionally",
        "characterized",
        "driven",
        "motivational",
        "factor",
        "whereas",
        "delusion",
        "primarily",
        "accounted",
        "neuropsychological",
        "term",
        "although",
        "theory",
        "delusion",
        "formation",
        "involve",
        "reference",
        "perceptual",
        "cognitive",
        "impairment",
        "saw",
        "motivational",
        "factor",
        "play",
        "important",
        "role",
        "explanation",
        "delusion",
        "eg",
        "partially",
        "determining",
        "specific",
        "content",
        "reported",
        "delusional",
        "state",
        "thus",
        "one",
        "plausible",
        "view",
        "selfdeception",
        "delusion",
        "distinct",
        "phenomenon",
        "may",
        "overlap",
        "circumstance",
        "analysis",
        "see",
        "bayne",
        "fernàndez",
        "three",
        "argument",
        "view",
        "delusion",
        "selfdeception",
        "overlap",
        "first",
        "view",
        "relationship",
        "delusion",
        "selfdeception",
        "overlap",
        "involve",
        "motivationally",
        "biased",
        "treatment",
        "evidence",
        "motivationally",
        "biased",
        "treatment",
        "evidence",
        "key",
        "feature",
        "selfdeception",
        "deflationists",
        "mele",
        "delusion",
        "said",
        "selfdeceived",
        "treat",
        "evidence",
        "disposal",
        "search",
        "evidence",
        "motivationally",
        "biased",
        "way",
        "seem",
        "generally",
        "case",
        "delusion",
        "apply",
        "case",
        "delusion",
        "delusion",
        "misidentification",
        "least",
        "according",
        "neuropsychological",
        "account",
        "seem",
        "akin",
        "selfdeception",
        "given",
        "fundamental",
        "role",
        "motivational",
        "bias",
        "explanation",
        "come",
        "hold",
        "retain",
        "delusion",
        "different",
        "analysis",
        "might",
        "appropriate",
        "delusion",
        "jealousy",
        "persecution",
        "second",
        "view",
        "delusion",
        "extreme",
        "case",
        "selfdeception",
        "protective",
        "adaptive",
        "function",
        "see",
        "hirstein",
        "example",
        "offered",
        "ramachandran",
        "discus",
        "anosognosia",
        "denial",
        "illness",
        "somatoparaphrenia",
        "delusion",
        "part",
        "one",
        "body",
        "belongs",
        "someone",
        "else",
        "ramachandran",
        "report",
        "case",
        "woman",
        "fd",
        "suffered",
        "right",
        "hemisphere",
        "stroke",
        "left",
        "left",
        "hemiplegia",
        "fd",
        "could",
        "move",
        "without",
        "wheelchair",
        "could",
        "move",
        "left",
        "arm",
        "asked",
        "whether",
        "could",
        "walk",
        "could",
        "engage",
        "activity",
        "require",
        "hand",
        "clapping",
        "claimed",
        "could",
        "ramachandran",
        "advance",
        "hypothesis",
        "behavior",
        "giving",
        "rise",
        "confabulation",
        "delusion",
        "exaggeration",
        "normal",
        "defense",
        "mechanism",
        "adaptive",
        "function",
        "allow",
        "u",
        "create",
        "coherent",
        "system",
        "belief",
        "behave",
        "stable",
        "manner",
        "neurotypical",
        "case",
        "left",
        "hemisphere",
        "produce",
        "confabulatory",
        "explanation",
        "aimed",
        "preserving",
        "status",
        "quo",
        "ill",
        "arm",
        "move",
        "right",
        "hemisphere",
        "detects",
        "anomaly",
        "hypothesis",
        "generated",
        "left",
        "hemisphere",
        "reality",
        "force",
        "revision",
        "belief",
        "system",
        "patient",
        "fd",
        "discrepancy",
        "detector",
        "longer",
        "work",
        "plausible",
        "delusion",
        "anosognosia",
        "involve",
        "motivational",
        "aspect",
        "whether",
        "delusion",
        "exaggerated",
        "form",
        "selfdeception",
        "depends",
        "preferred",
        "theoretical",
        "characterization",
        "selfdeception",
        "third",
        "view",
        "potential",
        "overlap",
        "delusion",
        "selfdeception",
        "existence",
        "delusion",
        "show",
        "doxastic",
        "conflict",
        "possible",
        "help",
        "u",
        "vindicate",
        "traditional",
        "account",
        "selfdeception",
        "according",
        "view",
        "two",
        "contradictory",
        "belief",
        "aware",
        "one",
        "motivated",
        "remain",
        "unaware",
        "mckay",
        "et",
        "al",
        "a",
        "p",
        "account",
        "derives",
        "donald",
        "davidson",
        "theory",
        "selfdeception",
        "eg",
        "davidson",
        "b",
        "deceive",
        "believe",
        "true",
        "proposition",
        "act",
        "way",
        "causing",
        "believe",
        "negation",
        "proposition",
        "neil",
        "levy",
        "argues",
        "condition",
        "selfdeception",
        "set",
        "traditional",
        "approach",
        "necessary",
        "selfdeception",
        "case",
        "fd",
        "described",
        "ramachandran",
        "living",
        "proof",
        "person",
        "time",
        "believe",
        "arm",
        "paralyzed",
        "believe",
        "move",
        "arm",
        "moreover",
        "belief",
        "arm",
        "paralyzed",
        "cause",
        "acquire",
        "belief",
        "arm",
        "levy",
        "analysis",
        "typical",
        "person",
        "anosognosia",
        "levy",
        "p",
        "fd",
        "belief",
        "limb",
        "healthy",
        "nevertheless",
        "also",
        "simultaneous",
        "belief",
        "strong",
        "suspicion",
        "limb",
        "significantly",
        "impaired",
        "profoundly",
        "disturbed",
        "belief",
        "suspicion",
        "condition",
        "satisfied",
        "condition",
        "satisfied",
        "fd",
        "motivated",
        "form",
        "belief",
        "limb",
        "healthy",
        "concurrent",
        "belief",
        "suspicion",
        "significantly",
        "impaired",
        "disturbed",
        "belief",
        "suspicion",
        "analysis",
        "correct",
        "least",
        "one",
        "case",
        "delusion",
        "eg",
        "anosognosia",
        "involves",
        "doxastic",
        "conflict",
        "controversial",
        "aspect",
        "analysis",
        "concern",
        "condition",
        "belief",
        "limb",
        "impaired",
        "truly",
        "available",
        "fd",
        "one",
        "could",
        "argue",
        "given",
        "fd",
        "probably",
        "deficit",
        "discrepancy",
        "detector",
        "right",
        "hemisphere",
        "brain",
        "awareness",
        "impairment",
        "denies",
        "see",
        "also",
        "hirstein",
        "levy",
        "reply",
        "availability",
        "come",
        "degree",
        "suggests",
        "given",
        "people",
        "paralysis",
        "anosognosia",
        "often",
        "avoid",
        "task",
        "would",
        "require",
        "mobility",
        "cost",
        "failure",
        "high",
        "given",
        "acknowledge",
        "difficulty",
        "movement",
        "say",
        "arthritis",
        "left",
        "arm",
        "always",
        "weaker",
        "plausible",
        "awareness",
        "impairment",
        "although",
        "may",
        "lack",
        "fully",
        "formed",
        "conscious",
        "belief",
        "debate",
        "difference",
        "delusion",
        "selfdeception",
        "centred",
        "whether",
        "delusion",
        "like",
        "ordinary",
        "instance",
        "selfdeception",
        "explicable",
        "folkpsychological",
        "point",
        "view",
        "bortolotti",
        "mameli",
        "murphy",
        "murphy",
        "argues",
        "delusion",
        "diagnosed",
        "folk",
        "psychology",
        "run",
        "resource",
        "understanding",
        "seem",
        "report",
        "genuine",
        "belief",
        "contrast",
        "selfdeception",
        "challenge",
        "folkpsychological",
        "generalisation",
        "belief",
        "expected",
        "influenced",
        "desire",
        "least",
        "occasion",
        "eg",
        "stake",
        "high",
        "bortolotti",
        "mameli",
        "maintain",
        "gap",
        "selfdeception",
        "motivated",
        "delusion",
        "anosognosia",
        "narrower",
        "gap",
        "selfdeception",
        "apparently",
        "nonmotivated",
        "delusion",
        "even",
        "latter",
        "case",
        "folk",
        "psychology",
        "account",
        "delusional",
        "belief",
        "explanation",
        "imperfect",
        "may",
        "delusional",
        "experience",
        "recent",
        "commentary",
        "spread",
        "conspiracy",
        "theory",
        "crisis",
        "comparison",
        "belief",
        "conspiracy",
        "theory",
        "delusion",
        "ubiquitous",
        "bortolotti",
        "et",
        "al",
        "instance",
        "people",
        "argued",
        "make",
        "belief",
        "flat",
        "earth",
        "climate",
        "denial",
        "problematic",
        "failing",
        "represent",
        "reality",
        "accurately",
        "rigidity",
        "incorrigibility",
        "see",
        "typical",
        "feature",
        "delusional",
        "belief",
        "comparison",
        "made",
        "basis",
        "three",
        "criterion",
        "belief",
        "manifest",
        "eg",
        "implausibility",
        "unshakeability",
        "b",
        "belief",
        "formed",
        "eg",
        "faulty",
        "monitoring",
        "idea",
        "c",
        "belief",
        "affect",
        "wellbeing",
        "good",
        "functioning",
        "let",
        "consider",
        "criterion",
        "turn",
        "respect",
        "surface",
        "feature",
        "clinical",
        "delusion",
        "belief",
        "conspiracy",
        "theory",
        "appear",
        "implausible",
        "endorse",
        "circumstance",
        "quite",
        "unusual",
        "bizarre",
        "well",
        "alleged",
        "epistemic",
        "irrationality",
        "though",
        "seems",
        "play",
        "central",
        "role",
        "comparison",
        "commonly",
        "assumed",
        "clinical",
        "delusion",
        "belief",
        "conspiracy",
        "theory",
        "neither",
        "well",
        "supported",
        "evidence",
        "responsive",
        "counterevidence",
        "saw",
        "variation",
        "feature",
        "applied",
        "delusion",
        "similarly",
        "applied",
        "belief",
        "conspiracy",
        "theory",
        "case",
        "delusion",
        "unusual",
        "experience",
        "may",
        "considered",
        "prima",
        "facie",
        "evidence",
        "delusional",
        "hypothesis",
        "case",
        "conspiracy",
        "theory",
        "belong",
        "group",
        "marginalised",
        "excluded",
        "previous",
        "experience",
        "authority",
        "may",
        "legitimise",
        "mistrusting",
        "source",
        "information",
        "levy",
        "respect",
        "belief",
        "formed",
        "consensus",
        "argue",
        "model",
        "used",
        "describe",
        "delusion",
        "formation",
        "invoked",
        "description",
        "belief",
        "conspiracy",
        "theory",
        "emerge",
        "instance",
        "twofactor",
        "theorist",
        "first",
        "factor",
        "unusual",
        "experience",
        "case",
        "delusion",
        "epistemic",
        "mistrust",
        "case",
        "belief",
        "conspiracy",
        "theory",
        "common",
        "second",
        "factor",
        "comprises",
        "reasoning",
        "bias",
        "motivational",
        "factor",
        "eg",
        "pierre",
        "first",
        "factor",
        "would",
        "explain",
        "theme",
        "delusion",
        "conspiracy",
        "second",
        "factor",
        "would",
        "explain",
        "belief",
        "endorsed",
        "maintained",
        "despite",
        "prima",
        "facie",
        "implausibility",
        "researcher",
        "working",
        "within",
        "predictive",
        "coding",
        "account",
        "paranoia",
        "predicts",
        "difficulty",
        "updating",
        "belief",
        "across",
        "clinicalnonclinical",
        "divide",
        "suggests",
        "mechanism",
        "may",
        "responsible",
        "people",
        "respond",
        "uncertainty",
        "reed",
        "et",
        "al",
        "researcher",
        "though",
        "deny",
        "overlap",
        "etiology",
        "point",
        "fact",
        "cognitive",
        "dysfunction",
        "need",
        "postulated",
        "explain",
        "formation",
        "belief",
        "conspiracy",
        "theory",
        "eg",
        "oliver",
        "wood",
        "finally",
        "respect",
        "downstream",
        "effect",
        "endorsing",
        "delusional",
        "belief",
        "belief",
        "conspiracy",
        "theory",
        "difference",
        "marked",
        "whereas",
        "delusion",
        "often",
        "characterised",
        "disruption",
        "psychological",
        "functioning",
        "social",
        "withdrawal",
        "isolation",
        "belief",
        "conspiracy",
        "theory",
        "seen",
        "cementing",
        "relationship",
        "welldefined",
        "social",
        "group",
        "protective",
        "anxiety",
        "stress",
        "closer",
        "examination",
        "may",
        "shed",
        "doubt",
        "difference",
        "though",
        "delusion",
        "adaptive",
        "shortterm",
        "belief",
        "conspiracy",
        "theory",
        "harmful",
        "long",
        "term",
        "sum",
        "view",
        "summarized",
        "show",
        "difficult",
        "justify",
        "clearcut",
        "distinction",
        "delusion",
        "selfdeception",
        "delusion",
        "belief",
        "conspiracy",
        "theory",
        "diagnostically",
        "scientifically",
        "useful",
        "maintain",
        "distinction",
        "symptom",
        "clinical",
        "condition",
        "manifestation",
        "everyday",
        "irrationality",
        "element",
        "genuine",
        "overlap",
        "also",
        "acknowledged"
    ]
}