{
    "main_text": "Robert Grosseteste\n3. Robert Grosseteste\n\n\nThe Posterior Analytics was little known in the twelfth\ncentury, despite James of Venice's translation, then. Though earlier\ndiscussions are to be noted, such as that of Richard Rufus (see Rega\nWood (1996)), the work first enters into the Western tradition in a\nserious way in the commentary of Robert Grosseteste (1175-1253),\nwritten around 1230. Grosseteste applies the theory in the\nPosterior Analytics to itself, presenting it as a\ndemonstrative science of demonstration. Thus he suggests that Aristotle\nfirst gives a definition of demonstration, a syllogism producing\nscientific knowledge, and a definition of scientific knowledge, and\nthen, in a series of syllogisms, deduces the properties that a\ndemonstration must have, first considered in itself as a free-standing\nsyllogism, then considered in relation to other demonstrations, and\nfinally considered as it is part of a science. The second book of the\nwork, he claims, discusses the art of definition as the way to discover\ndemonstrations, and how it is that definition occurs as the middle term\nand the cause of the truth of the conclusion, in a demonstration. He\nfinds thirty-two scientific conclusions in each of the two books, and\nhis list of conclusions forms the standard summary of the work for many\nlater writers. This analysis is most plausible in the beginning of Book\nI, and the initially structured presentation degenerates to a mere list\nof points made, often with little evident deductive structure, in the\ndiscussion of the latter part of Book I and in Book II. Many portions\nof the book are treated, plausibly enough, as ancillary to the\ndeductive science, concerned, for instance, with disproving common\nerrors.\n\n\nBefore Grosseteste, Aristotle's text was considered very difficult,\nboth in doctrine and in language, and it seems to have caused some\nconcern because of its apparent disagreement with the dominant\nAugustinian theory of knowledge. Grosseteste not only explained the\nbook clearly, but also reconciled it with Augustine by treating\ndemonstration as the means by which a fallen humanity must come to\nknowledge of the world. Augustine's Neoplatonic account of knowledge is\nreserved for our restored or supernaturally assisted nature in its\ncontemplation of God, or of the natural world in God. No doubt,\nGrosseteste's position as a well-known and conservative Bishop helped\nto legitimize the science of demonstration for his more conservative\nreaders.\n\n\nGrosseteste suggests that if the mind were healthy, and unaffected\nby the Fall, it would be able to see in God the exemplary forms of all\nthe things he had created. But as it is, such knowledge of exemplary\nforms is impossible, though the light of God illumines the forms of\nparticular things that we encounter in the world so that we can come to\nknow them. Such forms are in themselves universal and unchanging\n(indeed, in themselves they are the same as, though not numerically\nidentical with, exemplary forms), and so they can ground necessary\ntruths. But the knowledge of a real definition of a substance, of a\nsimple form, does not impart knowledge of its causal powers. (Ockham,\nit will be noted, shares this view.) For instance, the knowledge of the\ncausal power of scammony to purge red bile arises only after we observe\na number of cases where it does this, and so come to form an\naestimatio that it does in this or that particular case. (An\naestimatio is produced in the senses, and can be formed by\nirrational animals. It is a kind of perception of a particular causal\nconneciton, and is not necessarily correct. The idea seems to have come\nfrom Augustine, De Libero Arbitrio II.) Then, spurred on by\nthis aestimatio, reason proposes an experiment, and introduces\nscammony when every other cause for the purging of red bile is absent,\nand if it often draws out red bile under these conditions, reason\nconcludes that it is a causal power of scammony to do this. The\nintellect's ability to frame a universal concept after it becomes\nfamiliar with particular individuals through the senses is paralleled\nby its ability to form universal causal judgments after sensory\naestimatio informs it of particular causal events.\n(Grosseteste (1981) I 14, lines 252-271.)\n\n\nThis knowledge of causal laws is knowledge of what a given agent is\nsuited to do, but it is knowledge of what it will actually do only\nfor the most part. This is not knowledge of what it will do\nmost of the time, or even frequently, but of what it will do of itself\nas long as nothing is present to prevent it from doing it. It occurs\nthrough knowledge of “material definitions” which depend on\nprior, “formal definitions.” The formal definition of a\nthing specifies its function, and involves a final cause, while its\nmaterial definition specifies how it must be constructed so as to\nperform that function, that is, to be an efficient cause of certain\neffects. The formal definition tells us what the exemplary form is,\nwhile the material definition specifies how that form and its causal\nactivity are actually realized in matter. (The distinction between\nformal and material definition relies on an interpolation from\nAlexander/Philoponus's commentary in the text of James's translation of\nPosterior Analytics II 19. From Aquinas on people were aware\nof this error in the translation.) Knowledge of mathematical truth\noccurs without any efficient or final cause in the picture, and we can\nsee triangles, for instance, as they really are in themselves with a\ndirect mental view, rather than attempting to reconstruct them, as we\ndo in the case of thunder, for instance, where we know that some\nphysical arrangement is producing a noise (has that as its function, as\nit were), but cannot view that physical arrangement directly. Thus\nmathematical demonstrations are higher (potior) than natural\ndemonstrations, since what they show is always the case, and\nthey are more easily known. (Grosseteste (1981) I 18, lines\n119-126.)\n\n\nKnowledge of what is “for the most part” includes\nknowledge concerning eclipses, and eclipses, of course, only rarely\noccur. How can there be knowledge of, and necessary truths about, what,\nmost of the time, does not even exist? For one thing, eclipses are\nalways present in their “causal reasons,” that is, in the\nmotions of the sun and moon, which guarantee that eclipses occur now\nand again, and, moreover, we can say that it is always true that\nif a certain situation occurs, in which no impediments are\npresent, an eclipse will occur necessarily due to the nature of the\nMoon. (Grosseteste (1981) I 18, lines 189-214.)\n\n\nOne science can be subalternate to another, according to\nGrosseteste, in several ways. In one, a science, say Music, the science\nof audible proportion, falls under another, in this case the science of\nproportion, but it is not a part of that science, since audibility is\nan accident of proportion, not a difference which establishes some\nspecies of it. Arithmetical and geometrical proportion, for instance,\nare species of proportion, and so the science of arithmetical or\ngeometrical proportion would be a part of the science of proportion,\nnot subalternate to it. He says in this case that the one science falls\nunder the other univocally, since both are said to deal with\nproportion. Now audible proportion may be no more than an accidental\nunity, but it is still the case, Grosseteste holds, that proportion is\na necessary formal part of the real nature of harmony, just as its\naudibility is. So the subject of music, harmony, is, as it were,\nproportion realized in a certain matter, just as the actual material\nconstitution of a natural object is the realization of some higher\nform, say that of an animal, the nature of whose functioning can be\nunderstood quite independently of the realization of it in that\nparticular matter. Grosseteste sees subalternation as a phenomenon\nrevealing a deep metaphysical truth, the truth that a natural material\nobject is always the realization in matter of some higher form that is\nwhat it is quite independently of that realization. So he does\nnot consider the case of the circular wound as subalternation,\nfor circularity in no way constitutes or realizes the function of a\nwound. Medicine is not even in part subalternate to mathematics.\n(Grosseteste (1981) I 12, lines 153-198.) In a second case of true\nsubalternation, Grosseteste holds, the science of the parts of a thing,\nwhich realize its functioning, must be brought into play to understand\nthe thing. So the science of harmony is subalternate to the science of\nnumbers, Arithmetic, for numbers are the parts of proportions, and must\nbe known if proportions are to be known, even if proportions are not\nnumbers in the way that audible proportions are proportions. So the one\nscience falls under the other “almost univocally.”\nSimilarly, medicine is subalternate to the science of the elements,\neven though the elements are not strictly parts of the body (not\nfunctional parts), since they still enter into its constitution and so\nmust be understood if the body is to be understood.\n\n\nThis account of subordination was intimately connected with\nGrosseteste's metaphysics. He thought that the material world arose\nfrom light, which propagates itself in a straight line through space,\nso that matter can only be understood as arising from light in accord\nwith mathematical laws. Thus natural science will be subalternate to\nmathematics, for even though mathematics is not the science of the\nhigher form, of light, considered in itself, it does govern the way in\nwhich light realizes itself in space. The fact that the science of\nnature depends on mathematics is a clue that the natural world\noriginates from a higher form in accord with mathematics. Similarly, a\nliving being comes about when a higher form lends functions of\ndigestion, reproduction, sensation and the like to matter, these\nfunctions being accomplished by the causal operations of matter, so\nthat the biological sciences are subalternate to natural science.\n\n\nGrosseteste identifies two types of demonstration of the highest\nsort, natural and mathematical. His analysis of natural demonstrations\ndepends on a distinction between formal and material definition, which\nwas interpolated into the text of Posterior Analytics II 9 and\nseems to come from the James translation of the commentary of Alexander\n(= Philoponus?). The interpolated text suggests that a formal\ndefinition might serve as the middle term in a demonstration, proving\nthe material definition of the subject. For example, one might\ndemonstrate that anger is the boiling of blood around the heart (its\nmaterial definition), by using as the middle term the formal definition\nof anger, the desire to do harm to another. Of course, one would have\nto know a first principle asserting that whatever fits the formal\ndefinition must realize the functioning it expresses in that material\nform, and one would have to know what anger really is, in its own\nproper form. Again, drawing on Aristotle's example in Posterior\nAnalytics II 8, thunder is a noise made in a cloud (formal\ndefinition), and such a noise, in a cloud, is made (only) when fire is\nextinguished in it, and so thunder is the extinction of fire in a\ncloud.\n\n\nA demonstration of the highest sort in mathematics does not, of\ncourse, work out the mechanism by which some function must be\naccomplished, so in this case the middle term will be the formal\ndefinition of the subject, stated in terms of its parts (so a\ndefinition of a triangle will be in terms of the lines making it up,\nthe definition of a number in terms of the units making it up, and so\non). The attribute, rather than a material definition, will simply be\nthe property proved of the subject.\n\n\nIn both these sorts of demonstration, Grosseteste holds, the major\npremise and conclusion are per se in the second way, that is,\nthe subject is somehow presupposed in their predicates. The minor\npremise, since it predicates a formal definition of its subject, is\nper se in the first way (the subject contains the predicate).\nSo in the case of a natural demonstration, the subject is the causal\noutcome of the predicate (the noise, or thunder, results from the\nextinction of fire in a cloud), and is presupposed in it inasmuch as\nthe point of the material events is to produce that outcome. It is as\nif one were to say that the construction of an adding machine\npresupposes the notion that it adds, because it is in order to do this\nthat it has a structure which causes addition. Final and efficient\ncausation does not figure in mathematical demonstrations, but in any\nproper demonstration, Grosseteste thinks, the conclusion will not\nmerely assign a predicate that belongs universally to its subject, but\none that is commensurately universal with it. That is, one\nwon't have identified the real underlying cause why a figure has a\nproperty if it belongs to some larger class of figures that have the\nproperty, unless one demonstrates that this larger class has it, and\nthen appends, as it were, a note to the effect that the figure falls\nwithin the larger class. That means that a demonstration of the highest\nsort will always show a property to belong to something which not only\nhas it necessarily, but which is also necessary to produce that\nproperty. So the conclusion and the major premise will have to be\nper se in the second way, for the subject will be the\nnecessarily underlying cause of the property. Nothing else can\nproduce it.\n",
    "section_title": "3. Robert Grosseteste",
    "entry_title": "Medieval Theories of Demonstration",
    "hierarchy_title": "Medieval Theories of Demonstration || Robert Grosseteste",
    "tokenized_text": [
        "robert",
        "grosseteste",
        "robert",
        "grosseteste",
        "posterior",
        "analytics",
        "little",
        "known",
        "twelfth",
        "century",
        "despite",
        "james",
        "venice",
        "s",
        "translation",
        "though",
        "earlier",
        "discussion",
        "noted",
        "richard",
        "rufus",
        "see",
        "rega",
        "wood",
        "work",
        "first",
        "enters",
        "western",
        "tradition",
        "serious",
        "way",
        "commentary",
        "robert",
        "grosseteste",
        "written",
        "around",
        "grosseteste",
        "applies",
        "theory",
        "posterior",
        "analytics",
        "presenting",
        "demonstrative",
        "science",
        "demonstration",
        "thus",
        "suggests",
        "aristotle",
        "first",
        "give",
        "definition",
        "demonstration",
        "syllogism",
        "producing",
        "scientific",
        "knowledge",
        "definition",
        "scientific",
        "knowledge",
        "series",
        "syllogism",
        "deduces",
        "property",
        "demonstration",
        "must",
        "first",
        "considered",
        "freestanding",
        "syllogism",
        "considered",
        "relation",
        "demonstration",
        "finally",
        "considered",
        "part",
        "science",
        "second",
        "book",
        "work",
        "claim",
        "discus",
        "art",
        "definition",
        "way",
        "discover",
        "demonstration",
        "definition",
        "occurs",
        "middle",
        "term",
        "cause",
        "truth",
        "conclusion",
        "demonstration",
        "find",
        "thirtytwo",
        "scientific",
        "conclusion",
        "two",
        "book",
        "list",
        "conclusion",
        "form",
        "standard",
        "summary",
        "work",
        "many",
        "later",
        "writer",
        "analysis",
        "plausible",
        "beginning",
        "book",
        "initially",
        "structured",
        "presentation",
        "degenerate",
        "mere",
        "list",
        "point",
        "made",
        "often",
        "little",
        "evident",
        "deductive",
        "structure",
        "discussion",
        "latter",
        "part",
        "book",
        "book",
        "ii",
        "many",
        "portion",
        "book",
        "treated",
        "plausibly",
        "enough",
        "ancillary",
        "deductive",
        "science",
        "concerned",
        "instance",
        "disproving",
        "common",
        "error",
        "grosseteste",
        "aristotle",
        "s",
        "text",
        "considered",
        "difficult",
        "doctrine",
        "language",
        "seems",
        "caused",
        "concern",
        "apparent",
        "disagreement",
        "dominant",
        "augustinian",
        "theory",
        "knowledge",
        "grosseteste",
        "explained",
        "book",
        "clearly",
        "also",
        "reconciled",
        "augustine",
        "treating",
        "demonstration",
        "mean",
        "fallen",
        "humanity",
        "must",
        "come",
        "knowledge",
        "world",
        "augustine",
        "s",
        "neoplatonic",
        "account",
        "knowledge",
        "reserved",
        "restored",
        "supernaturally",
        "assisted",
        "nature",
        "contemplation",
        "god",
        "natural",
        "world",
        "god",
        "doubt",
        "grosseteste",
        "s",
        "position",
        "wellknown",
        "conservative",
        "bishop",
        "helped",
        "legitimize",
        "science",
        "demonstration",
        "conservative",
        "reader",
        "grosseteste",
        "suggests",
        "mind",
        "healthy",
        "unaffected",
        "fall",
        "would",
        "able",
        "see",
        "god",
        "exemplary",
        "form",
        "thing",
        "created",
        "knowledge",
        "exemplary",
        "form",
        "impossible",
        "though",
        "light",
        "god",
        "illumines",
        "form",
        "particular",
        "thing",
        "encounter",
        "world",
        "come",
        "know",
        "form",
        "universal",
        "unchanging",
        "indeed",
        "though",
        "numerically",
        "identical",
        "exemplary",
        "form",
        "ground",
        "necessary",
        "truth",
        "knowledge",
        "real",
        "definition",
        "substance",
        "simple",
        "form",
        "impart",
        "knowledge",
        "causal",
        "power",
        "ockham",
        "noted",
        "share",
        "view",
        "instance",
        "knowledge",
        "causal",
        "power",
        "scammony",
        "purge",
        "red",
        "bile",
        "arises",
        "observe",
        "number",
        "case",
        "come",
        "form",
        "aestimatio",
        "particular",
        "case",
        "aestimatio",
        "produced",
        "sens",
        "formed",
        "irrational",
        "animal",
        "kind",
        "perception",
        "particular",
        "causal",
        "conneciton",
        "necessarily",
        "correct",
        "idea",
        "seems",
        "come",
        "augustine",
        "de",
        "libero",
        "arbitrio",
        "ii",
        "spurred",
        "aestimatio",
        "reason",
        "proposes",
        "experiment",
        "introduces",
        "scammony",
        "every",
        "cause",
        "purging",
        "red",
        "bile",
        "absent",
        "often",
        "draw",
        "red",
        "bile",
        "condition",
        "reason",
        "concludes",
        "causal",
        "power",
        "scammony",
        "intellect",
        "s",
        "ability",
        "frame",
        "universal",
        "concept",
        "becomes",
        "familiar",
        "particular",
        "individual",
        "sens",
        "paralleled",
        "ability",
        "form",
        "universal",
        "causal",
        "judgment",
        "sensory",
        "aestimatio",
        "informs",
        "particular",
        "causal",
        "event",
        "grosseteste",
        "line",
        "knowledge",
        "causal",
        "law",
        "knowledge",
        "given",
        "agent",
        "suited",
        "knowledge",
        "actually",
        "part",
        "knowledge",
        "time",
        "even",
        "frequently",
        "long",
        "nothing",
        "present",
        "prevent",
        "occurs",
        "knowledge",
        "material",
        "definition",
        "depend",
        "prior",
        "formal",
        "definitions",
        "formal",
        "definition",
        "thing",
        "specifies",
        "function",
        "involves",
        "final",
        "cause",
        "material",
        "definition",
        "specifies",
        "must",
        "constructed",
        "perform",
        "function",
        "efficient",
        "cause",
        "certain",
        "effect",
        "formal",
        "definition",
        "tell",
        "u",
        "exemplary",
        "form",
        "material",
        "definition",
        "specifies",
        "form",
        "causal",
        "activity",
        "actually",
        "realized",
        "matter",
        "distinction",
        "formal",
        "material",
        "definition",
        "relies",
        "interpolation",
        "alexanderphiloponus",
        "s",
        "commentary",
        "text",
        "james",
        "s",
        "translation",
        "posterior",
        "analytics",
        "ii",
        "aquinas",
        "people",
        "aware",
        "error",
        "translation",
        "knowledge",
        "mathematical",
        "truth",
        "occurs",
        "without",
        "efficient",
        "final",
        "cause",
        "picture",
        "see",
        "triangle",
        "instance",
        "really",
        "direct",
        "mental",
        "view",
        "rather",
        "attempting",
        "reconstruct",
        "case",
        "thunder",
        "instance",
        "know",
        "physical",
        "arrangement",
        "producing",
        "noise",
        "function",
        "view",
        "physical",
        "arrangement",
        "directly",
        "thus",
        "mathematical",
        "demonstration",
        "higher",
        "potior",
        "natural",
        "demonstration",
        "since",
        "show",
        "always",
        "case",
        "easily",
        "known",
        "grosseteste",
        "line",
        "knowledge",
        "part",
        "includes",
        "knowledge",
        "concerning",
        "eclipse",
        "eclipse",
        "course",
        "rarely",
        "occur",
        "knowledge",
        "necessary",
        "truth",
        "time",
        "even",
        "exist",
        "one",
        "thing",
        "eclipse",
        "always",
        "present",
        "causal",
        "reason",
        "motion",
        "sun",
        "moon",
        "guarantee",
        "eclipse",
        "occur",
        "moreover",
        "say",
        "always",
        "true",
        "certain",
        "situation",
        "occurs",
        "impediment",
        "present",
        "eclipse",
        "occur",
        "necessarily",
        "due",
        "nature",
        "moon",
        "grosseteste",
        "line",
        "one",
        "science",
        "subalternate",
        "another",
        "according",
        "grosseteste",
        "several",
        "way",
        "one",
        "science",
        "say",
        "music",
        "science",
        "audible",
        "proportion",
        "fall",
        "another",
        "case",
        "science",
        "proportion",
        "part",
        "science",
        "since",
        "audibility",
        "accident",
        "proportion",
        "difference",
        "establishes",
        "specie",
        "arithmetical",
        "geometrical",
        "proportion",
        "instance",
        "specie",
        "proportion",
        "science",
        "arithmetical",
        "geometrical",
        "proportion",
        "would",
        "part",
        "science",
        "proportion",
        "subalternate",
        "say",
        "case",
        "one",
        "science",
        "fall",
        "univocally",
        "since",
        "said",
        "deal",
        "proportion",
        "audible",
        "proportion",
        "may",
        "accidental",
        "unity",
        "still",
        "case",
        "grosseteste",
        "hold",
        "proportion",
        "necessary",
        "formal",
        "part",
        "real",
        "nature",
        "harmony",
        "audibility",
        "subject",
        "music",
        "harmony",
        "proportion",
        "realized",
        "certain",
        "matter",
        "actual",
        "material",
        "constitution",
        "natural",
        "object",
        "realization",
        "higher",
        "form",
        "say",
        "animal",
        "nature",
        "whose",
        "functioning",
        "understood",
        "quite",
        "independently",
        "realization",
        "particular",
        "matter",
        "grosseteste",
        "see",
        "subalternation",
        "phenomenon",
        "revealing",
        "deep",
        "metaphysical",
        "truth",
        "truth",
        "natural",
        "material",
        "object",
        "always",
        "realization",
        "matter",
        "higher",
        "form",
        "quite",
        "independently",
        "realization",
        "consider",
        "case",
        "circular",
        "wound",
        "subalternation",
        "circularity",
        "way",
        "constitutes",
        "realizes",
        "function",
        "wound",
        "medicine",
        "even",
        "part",
        "subalternate",
        "mathematics",
        "grosseteste",
        "line",
        "second",
        "case",
        "true",
        "subalternation",
        "grosseteste",
        "hold",
        "science",
        "part",
        "thing",
        "realize",
        "functioning",
        "must",
        "brought",
        "play",
        "understand",
        "thing",
        "science",
        "harmony",
        "subalternate",
        "science",
        "number",
        "arithmetic",
        "number",
        "part",
        "proportion",
        "must",
        "known",
        "proportion",
        "known",
        "even",
        "proportion",
        "number",
        "way",
        "audible",
        "proportion",
        "proportion",
        "one",
        "science",
        "fall",
        "almost",
        "univocally",
        "similarly",
        "medicine",
        "subalternate",
        "science",
        "element",
        "even",
        "though",
        "element",
        "strictly",
        "part",
        "body",
        "functional",
        "part",
        "since",
        "still",
        "enter",
        "constitution",
        "must",
        "understood",
        "body",
        "understood",
        "account",
        "subordination",
        "intimately",
        "connected",
        "grosseteste",
        "s",
        "metaphysics",
        "thought",
        "material",
        "world",
        "arose",
        "light",
        "propagates",
        "straight",
        "line",
        "space",
        "matter",
        "understood",
        "arising",
        "light",
        "accord",
        "mathematical",
        "law",
        "thus",
        "natural",
        "science",
        "subalternate",
        "mathematics",
        "even",
        "though",
        "mathematics",
        "science",
        "higher",
        "form",
        "light",
        "considered",
        "govern",
        "way",
        "light",
        "realizes",
        "space",
        "fact",
        "science",
        "nature",
        "depends",
        "mathematics",
        "clue",
        "natural",
        "world",
        "originates",
        "higher",
        "form",
        "accord",
        "mathematics",
        "similarly",
        "living",
        "come",
        "higher",
        "form",
        "lends",
        "function",
        "digestion",
        "reproduction",
        "sensation",
        "like",
        "matter",
        "function",
        "accomplished",
        "causal",
        "operation",
        "matter",
        "biological",
        "science",
        "subalternate",
        "natural",
        "science",
        "grosseteste",
        "identifies",
        "two",
        "type",
        "demonstration",
        "highest",
        "sort",
        "natural",
        "mathematical",
        "analysis",
        "natural",
        "demonstration",
        "depends",
        "distinction",
        "formal",
        "material",
        "definition",
        "interpolated",
        "text",
        "posterior",
        "analytics",
        "ii",
        "seems",
        "come",
        "james",
        "translation",
        "commentary",
        "alexander",
        "philoponus",
        "interpolated",
        "text",
        "suggests",
        "formal",
        "definition",
        "might",
        "serve",
        "middle",
        "term",
        "demonstration",
        "proving",
        "material",
        "definition",
        "subject",
        "example",
        "one",
        "might",
        "demonstrate",
        "anger",
        "boiling",
        "blood",
        "around",
        "heart",
        "material",
        "definition",
        "using",
        "middle",
        "term",
        "formal",
        "definition",
        "anger",
        "desire",
        "harm",
        "another",
        "course",
        "one",
        "would",
        "know",
        "first",
        "principle",
        "asserting",
        "whatever",
        "fit",
        "formal",
        "definition",
        "must",
        "realize",
        "functioning",
        "express",
        "material",
        "form",
        "one",
        "would",
        "know",
        "anger",
        "really",
        "proper",
        "form",
        "drawing",
        "aristotle",
        "s",
        "example",
        "posterior",
        "analytics",
        "ii",
        "thunder",
        "noise",
        "made",
        "cloud",
        "formal",
        "definition",
        "noise",
        "cloud",
        "made",
        "fire",
        "extinguished",
        "thunder",
        "extinction",
        "fire",
        "cloud",
        "demonstration",
        "highest",
        "sort",
        "mathematics",
        "course",
        "work",
        "mechanism",
        "function",
        "must",
        "accomplished",
        "case",
        "middle",
        "term",
        "formal",
        "definition",
        "subject",
        "stated",
        "term",
        "part",
        "definition",
        "triangle",
        "term",
        "line",
        "making",
        "definition",
        "number",
        "term",
        "unit",
        "making",
        "attribute",
        "rather",
        "material",
        "definition",
        "simply",
        "property",
        "proved",
        "subject",
        "sort",
        "demonstration",
        "grosseteste",
        "hold",
        "major",
        "premise",
        "conclusion",
        "per",
        "se",
        "second",
        "way",
        "subject",
        "somehow",
        "presupposed",
        "predicate",
        "minor",
        "premise",
        "since",
        "predicate",
        "formal",
        "definition",
        "subject",
        "per",
        "se",
        "first",
        "way",
        "subject",
        "contains",
        "predicate",
        "case",
        "natural",
        "demonstration",
        "subject",
        "causal",
        "outcome",
        "predicate",
        "noise",
        "thunder",
        "result",
        "extinction",
        "fire",
        "cloud",
        "presupposed",
        "inasmuch",
        "point",
        "material",
        "event",
        "produce",
        "outcome",
        "one",
        "say",
        "construction",
        "adding",
        "machine",
        "presupposes",
        "notion",
        "add",
        "order",
        "structure",
        "cause",
        "addition",
        "final",
        "efficient",
        "causation",
        "figure",
        "mathematical",
        "demonstration",
        "proper",
        "demonstration",
        "grosseteste",
        "think",
        "conclusion",
        "merely",
        "assign",
        "predicate",
        "belongs",
        "universally",
        "subject",
        "one",
        "commensurately",
        "universal",
        "one",
        "wo",
        "nt",
        "identified",
        "real",
        "underlying",
        "cause",
        "figure",
        "property",
        "belongs",
        "larger",
        "class",
        "figure",
        "property",
        "unless",
        "one",
        "demonstrates",
        "larger",
        "class",
        "appends",
        "note",
        "effect",
        "figure",
        "fall",
        "within",
        "larger",
        "class",
        "mean",
        "demonstration",
        "highest",
        "sort",
        "always",
        "show",
        "property",
        "belong",
        "something",
        "necessarily",
        "also",
        "necessary",
        "produce",
        "property",
        "conclusion",
        "major",
        "premise",
        "per",
        "se",
        "second",
        "way",
        "subject",
        "necessarily",
        "underlying",
        "cause",
        "property",
        "nothing",
        "else",
        "produce"
    ]
}