{
    "main_text": "Atomist Doctrine\n2. Atomist Doctrine\n\nAncient sources describe atomism as one of a number of attempts by\nearly Greek natural philosophers to respond to the challenge offered\nby Parmenides. Despite occasional challenges (Osborne 2004), this is\nhow its motivation is generally interpreted by scholars today.\nAlthough the exact interpretation of Parmenides is disputed, he was\ntaken to have argued that change is merely illusory because of some\nabsurdities inherent in the idea of ‘what is not’. In\nresponse, Leucippus and Democritus, along with other Presocratic\npluralists such as Empedocles and Anaxagoras, developed systems that\nclarified how change does not require that something should come to be\nfrom nothing.  These responses to Parmenides suppose that there are\nmultiple unchanging material principles, which persist and merely\nrearrange themselves to form the changing world of appearances. In the\natomist version, these unchanging material principles are indivisible\nparticles, the atoms. The idea that there is a lower limit to\ndivisibility is sometimes taken as an answer to Zeno’s paradoxes about\nthe impossibility of traversing infinitely divisible magnitudes\n(Hasper 2006). Reconstructions offered by Wardy (1988) and Sedley\n(2008) argue, instead, that atomism was developed as a response to\nParmenidean arguments.\n\nThe atomists held that there are two fundamentally different kinds of\nrealities composing the natural world, atoms and void. Atoms, from the\nGreek adjective atomos or atomon,\n‘indivisible,’ are infinite in number and various in size\nand shape, and perfectly solid, with no internal gaps. They move about\nin an infinite void, repelling one another when they collide or\ncombining into clusters by means of tiny hooks and barbs on their\nsurfaces, which become entangled. Other than changing place, they are\nunchangeable, ungenerated and indestructible. All changes in the\nvisible objects of the world of appearance are brought about by\nrelocations of these atoms: in Aristotelian terms, the atomists reduce\nall change to change of place. Macroscopic objects in the world that\nwe experience are really clusters of these atoms; changes in the\nobjects we see—qualitative changes or growth, say—are\ncaused by rearrangements or additions to the atoms composing them.\nWhile the atoms are eternal, the objects compounded out of them are\nnot. Clusters of atoms moving in the infinite void come to form\nkosmoi or worlds as a result of a circular motion that\ngathers atoms up into a whirl, creating clusters within it (DK\n68B167); these kosmoi are impermanent. Our world and the\nspecies within it have arisen from the collision of atoms moving about\nin such a whirl, and will likewise disintegrate in time.\n\nIn supposing that void exists, the atomists deliberately embraced an\napparent contradiction, claiming that ‘what is not’\nexists. Apparently addressing an argument by Melissus, a follower of\nParmenides, the atomists paired the term for ‘nothing’\nwith what it negates, ‘thing,’ and claimed that—in a\nphrase typical of the atomists—the one ‘no more’\nexists than the other (DK 67A6). Schofield (2002) argues that this\nparticular phrase originated with Democritus and not his teacher\nLeucippus. By putting the full (or solid) and the void ontologically\non a par, the atomists were apparently denying the impossibility of\nvoid. Void they considered to be a necessary condition for local\nmotion: if there were no unoccupied places, where could bodies move\ninto? Melissus had argued from the impossibility of void to the\nimpossibility of motion; the atomists apparently reasoned in reverse,\narguing from the fact that motion exists to the necessity for void\nspace to exist (DK 67A7). It has been suggested that Democritus’\nconception of void is that of the (temporarily) unfilled regions\nbetween atoms rather than a concept of absolute space (Sedley 1982).\nVoid does not impede the motion of atoms because its essential quality\nis that of ‘yielding,’ in contrast to the mutual\nresistance of atoms. Later atomist accounts attest that this\n‘yielding’ explains the tendency of bodies to drift into\nemptier spaces, driven out by collision from more densely packed\nregions (Lucretius DRN 6.906–1089).\n\nSome controversy surrounds the properties of the atoms. They vary in\nsize: one report—which some scholars question—suggests\nthat atoms could, in principle, be as large as a cosmos, although at\nleast in this cosmos they all seem to be too small to perceive (DK\n68A47). They can take on an infinite variety of shapes: there are\nreports of an argument that there is ‘no more’ reason for\nthe atoms to be one shape than another. Many kinds of atoms can\ninterlock with one another because of their irregular shapes and hooks\nat their surface, accounting for the cohesiveness of some compounds.\nIt is not clear whether the early atomists regarded atoms as\nconceptually indivisible or merely physically indivisible (Furley\n1967). The idea that there is a smallest possible magnitude seems to\nsuggest that this is the lower limit of size for atoms, although\nnotions like being in contact or having shape seem to entail that even\nthe smallest atoms have parts in some sense, if only mathematically or\nconceptually.\n\nThere are conflicting reports on whether atoms move in a particular\ndirection as a result of their weight: a number of scholars have tried\nto reconcile these by supposing that weight is not intrinsic to the\natoms, but is a result of the centripetal tendencies set up in the\ncosmic whirl (cf. O’Brien 1981; Furley 1989, pp. 91–102). Atoms\nmay have an inherent tendency to a kind of vibratory motion, although\nthe evidence for this is uncertain (McDiarmid 1958). However, their\nprimary movement seems to result from collision with other atoms,\nwherein their mutual resistance or antitupia causes them to\nmove away from one another when struck. Democritus is criticized by\nAristotle for supposing that the sequence of colliding atoms has no\nbeginning, and thus for not offering an explanation of the existence\nof atomic motion per se, even though the prior collision with\nanother atom can account for the direction of each individual atomic\nmotion (see O’Keefe 1996). Although the ancient atomists are often\ncompared to modern ‘mechanistic’ theories, Balme warned of\nthe danger of assuming that the atomists share modern ideas about the\nnature of atomic motion, particularly the idea that motion is inertial\n(Balme 1941).\n\nAccording to different reports, Democritus ascribed the causes of\nthings to necessity, and also to chance. Probably the latter term\nshould be understood as ‘absence of purpose’ rather than a\ndenial of necessity (Barnes 1982, pp. 423–6). Democritus\napparently recognized a need to account for the fact that the\ndisorderly motion of individual distinct atoms could produce an\norderly cosmos in which atoms are not just randomly scattered, but\ncluster to form masses of distinct types. He is reported to have\nrelied on a tendency of ‘like to like’ which exists in\nnature: just as animals of a kind cluster together, so atoms of\nsimilar kinds cluster by size and shape. He compares this to the\nwinnowing of grains in a sieve, or the sorting of pebbles riffled by\nthe tide: it is as if there were a kind of attraction of like\nto like (DK 68B164). Although this claim has been interpreted\ndifferently (e.g. Taylor 1999b p. 188), it seems to be an attempt to\nshow how an apparently ordered arrangement can arise automatically, as\na byproduct of the random collisions of bodies in motion (Furley 1989,\np. 79). No attractive forces or purposes need be introduced to explain\nthe sorting by the tide or in the sieve: it is probable that this is\nan attempt to show how apparently orderly effects can be produced\nwithout goal-directioned forces or purpose.\n\nDemocritus regards the properties of atoms in combination as\nsufficient to account for the multitude of differences among the\nobjects in the world that appears to us. Aristotle cites an analogy to\nthe letters of the alphabet, which can produce a multitude of\ndifferent words from a few elements in combinations; the differences\nall stem from the shape (schêma) of the letters, as A\ndiffers from N; by their arrangement (taxis), as AN differs\nfrom NA; and by their positional orientation (thesis), as N\ndiffers from Z (DK 67A6). These terms are Aristotle’s interpretation\nof Democritus’ own terminology, which has a more dynamic sense\n(Mourelatos 2004). This passage omits differences of size, perhaps\nbecause it is focused on the analogy to letters of the alphabet: it is\nquite clear from other texts that Democritus thinks that atoms also\ndiffer in size.\n\nHe famously denies that perceptible qualities other than shape and\nsize (and, perhaps, weight) really exist in the atoms themselves: one\ndirect quotation surviving from Democritus claims that ‘by\nconvention sweet and by convention bitter, by convention hot, by\nconvention cold, by convention color; but in reality atoms and\nvoid’ (DK 68B9, trans. Taylor 1999a).  There are different\naccounts of this distinction.  Furley argues that the translation\n‘convention’ should not be taken to suggest that there is\nanything arbitrary about the perception of certain colors,\nsay: the same configuration of atoms may be regularly associated with\na given color (Furley 1993; cf. Barnes 1982, pp. 370–7). What\nDemocritus rejects with the label ‘merely conventional’\nis, perhaps, the imputation of the qualities in question to the atoms,\nor perhaps even to macroscopic bodies.  Mourelatos (2005) draws\nthe contrast as that between intrinsic and relational properties.\n\nWhile several reports of Democritus’ view, apparently direct\nquotations, mention exclusively sensible qualities as being unreal, a\nreport of Plutarch includes in the list of things that exist only by\nconvention the notion of ‘combination’ or\nsunkrisis. If this report is genuinely Democritean, it would\nbroaden the scope of the claim considerably: the idea that any\ncombination—by which he presumably means any cluster of\natoms—is ‘unreal’ or merely\n‘conventional’ suggests that Democritus is drawing a more\nradical distinction than that between sensible and nonsensible\nqualities. The implication would be that anything perceived, because\nit is a perception of combinations of atoms and not atoms themselves,\nwould be suspect, not merely the qualia experienced by means\nof individual sense organs. One report indeed attributes to Democritus\na denial that two things could become one, or vice versa (DK 68A42),\nthus suggesting that combinations are regarded as conventional.\n\nCommentators differ as to the authenticity of Plutarch’s report. As\nthe word sunkrisis does not occur in other reports, Furley\n(following Sandbach) suggests that it is most likely an error for\npikron, ‘bitter’ which occurs instead in another\nreport. However, Furley concedes that Plutarch at least\nunderstands the earliest atomists to be committed to the view that all\ncombinations of atoms, as much as sensible qualities, should be\nunderstood as conventional rather than real (Furley 1993 pp.\n76–7n7). This would suggest that everything at the macroscopic\nlevel—or, strictly, everything available to perception—is\nregarded as unreal. The ontological status of arrangement or\ncombination of atoms for Democritus is a vexed question, that affects\nour understanding of his metaphysics, his historical relationship to\nMelissus, and the similarity of his views to the modern\nprimary-secondary quality distinction (Wardy 1988; Curd 1998; Lee\n2005; Mourelatos 2005; Pasnau 2007). If we take the\n‘conventionality’ thesis to be restricted to sensible\nqualities, there is still an open question about Democritus’ reason\nfor denying their ‘reality’ (Wardy 1988; O’Keefe 1997;\nGanson 1999).\n",
    "section_title": "2. Atomist Doctrine",
    "entry_title": "Democritus",
    "hierarchy_title": "Democritus || Atomist Doctrine",
    "tokenized_text": [
        "atomist",
        "doctrine",
        "atomist",
        "doctrine",
        "ancient",
        "source",
        "describe",
        "atomism",
        "one",
        "number",
        "attempt",
        "early",
        "greek",
        "natural",
        "philosopher",
        "respond",
        "challenge",
        "offered",
        "parmenides",
        "despite",
        "occasional",
        "challenge",
        "osborne",
        "motivation",
        "generally",
        "interpreted",
        "scholar",
        "today",
        "although",
        "exact",
        "interpretation",
        "parmenides",
        "disputed",
        "taken",
        "argued",
        "change",
        "merely",
        "illusory",
        "absurdity",
        "inherent",
        "idea",
        "response",
        "leucippus",
        "democritus",
        "along",
        "presocratic",
        "pluralist",
        "empedocles",
        "anaxagoras",
        "developed",
        "system",
        "clarified",
        "change",
        "require",
        "something",
        "come",
        "nothing",
        "response",
        "parmenides",
        "suppose",
        "multiple",
        "unchanging",
        "material",
        "principle",
        "persist",
        "merely",
        "rearrange",
        "form",
        "changing",
        "world",
        "appearance",
        "atomist",
        "version",
        "unchanging",
        "material",
        "principle",
        "indivisible",
        "particle",
        "atom",
        "idea",
        "lower",
        "limit",
        "divisibility",
        "sometimes",
        "taken",
        "answer",
        "zeno",
        "paradox",
        "impossibility",
        "traversing",
        "infinitely",
        "divisible",
        "magnitude",
        "hasper",
        "reconstruction",
        "offered",
        "wardy",
        "sedley",
        "argue",
        "instead",
        "atomism",
        "developed",
        "response",
        "parmenidean",
        "argument",
        "atomists",
        "held",
        "two",
        "fundamentally",
        "different",
        "kind",
        "reality",
        "composing",
        "natural",
        "world",
        "atom",
        "void",
        "atom",
        "greek",
        "adjective",
        "atomos",
        "atomon",
        "indivisible",
        "infinite",
        "number",
        "various",
        "size",
        "shape",
        "perfectly",
        "solid",
        "internal",
        "gap",
        "move",
        "infinite",
        "void",
        "repelling",
        "one",
        "another",
        "collide",
        "combining",
        "cluster",
        "mean",
        "tiny",
        "hook",
        "barb",
        "surface",
        "become",
        "entangled",
        "changing",
        "place",
        "unchangeable",
        "ungenerated",
        "indestructible",
        "change",
        "visible",
        "object",
        "world",
        "appearance",
        "brought",
        "relocation",
        "atom",
        "aristotelian",
        "term",
        "atomists",
        "reduce",
        "change",
        "change",
        "place",
        "macroscopic",
        "object",
        "world",
        "experience",
        "really",
        "cluster",
        "atom",
        "change",
        "object",
        "seequalitative",
        "change",
        "growth",
        "sayare",
        "caused",
        "rearrangement",
        "addition",
        "atom",
        "composing",
        "atom",
        "eternal",
        "object",
        "compounded",
        "cluster",
        "atom",
        "moving",
        "infinite",
        "void",
        "come",
        "form",
        "kosmoi",
        "world",
        "result",
        "circular",
        "motion",
        "gather",
        "atom",
        "whirl",
        "creating",
        "cluster",
        "within",
        "dk",
        "b",
        "kosmoi",
        "impermanent",
        "world",
        "specie",
        "within",
        "arisen",
        "collision",
        "atom",
        "moving",
        "whirl",
        "likewise",
        "disintegrate",
        "time",
        "supposing",
        "void",
        "exists",
        "atomists",
        "deliberately",
        "embraced",
        "apparent",
        "contradiction",
        "claiming",
        "exists",
        "apparently",
        "addressing",
        "argument",
        "melissus",
        "follower",
        "parmenides",
        "atomists",
        "paired",
        "term",
        "nothing",
        "negates",
        "thing",
        "claimed",
        "thatin",
        "phrase",
        "typical",
        "atomiststhe",
        "one",
        "exists",
        "dk",
        "a",
        "schofield",
        "argues",
        "particular",
        "phrase",
        "originated",
        "democritus",
        "teacher",
        "leucippus",
        "putting",
        "full",
        "solid",
        "void",
        "ontologically",
        "par",
        "atomists",
        "apparently",
        "denying",
        "impossibility",
        "void",
        "void",
        "considered",
        "necessary",
        "condition",
        "local",
        "motion",
        "unoccupied",
        "place",
        "could",
        "body",
        "move",
        "melissus",
        "argued",
        "impossibility",
        "void",
        "impossibility",
        "motion",
        "atomists",
        "apparently",
        "reasoned",
        "reverse",
        "arguing",
        "fact",
        "motion",
        "exists",
        "necessity",
        "void",
        "space",
        "exist",
        "dk",
        "a",
        "suggested",
        "democritus",
        "conception",
        "void",
        "temporarily",
        "unfilled",
        "region",
        "atom",
        "rather",
        "concept",
        "absolute",
        "space",
        "sedley",
        "void",
        "impede",
        "motion",
        "atom",
        "essential",
        "quality",
        "yielding",
        "contrast",
        "mutual",
        "resistance",
        "atom",
        "later",
        "atomist",
        "account",
        "attest",
        "yielding",
        "explains",
        "tendency",
        "body",
        "drift",
        "emptier",
        "space",
        "driven",
        "collision",
        "densely",
        "packed",
        "region",
        "lucretius",
        "drn",
        "controversy",
        "surround",
        "property",
        "atom",
        "vary",
        "size",
        "one",
        "reportwhich",
        "scholar",
        "questionsuggests",
        "atom",
        "could",
        "principle",
        "large",
        "cosmos",
        "although",
        "least",
        "cosmos",
        "seem",
        "small",
        "perceive",
        "dk",
        "a",
        "take",
        "infinite",
        "variety",
        "shape",
        "report",
        "argument",
        "reason",
        "atom",
        "one",
        "shape",
        "another",
        "many",
        "kind",
        "atom",
        "interlock",
        "one",
        "another",
        "irregular",
        "shape",
        "hook",
        "surface",
        "accounting",
        "cohesiveness",
        "compound",
        "clear",
        "whether",
        "early",
        "atomists",
        "regarded",
        "atom",
        "conceptually",
        "indivisible",
        "merely",
        "physically",
        "indivisible",
        "furley",
        "idea",
        "smallest",
        "possible",
        "magnitude",
        "seems",
        "suggest",
        "lower",
        "limit",
        "size",
        "atom",
        "although",
        "notion",
        "like",
        "contact",
        "shape",
        "seem",
        "entail",
        "even",
        "smallest",
        "atom",
        "part",
        "sense",
        "mathematically",
        "conceptually",
        "conflicting",
        "report",
        "whether",
        "atom",
        "move",
        "particular",
        "direction",
        "result",
        "weight",
        "number",
        "scholar",
        "tried",
        "reconcile",
        "supposing",
        "weight",
        "intrinsic",
        "atom",
        "result",
        "centripetal",
        "tendency",
        "set",
        "cosmic",
        "whirl",
        "cf",
        "brien",
        "furley",
        "pp",
        "atom",
        "may",
        "inherent",
        "tendency",
        "kind",
        "vibratory",
        "motion",
        "although",
        "evidence",
        "uncertain",
        "mcdiarmid",
        "however",
        "primary",
        "movement",
        "seems",
        "result",
        "collision",
        "atom",
        "wherein",
        "mutual",
        "resistance",
        "antitupia",
        "cause",
        "move",
        "away",
        "one",
        "another",
        "struck",
        "democritus",
        "criticized",
        "aristotle",
        "supposing",
        "sequence",
        "colliding",
        "atom",
        "beginning",
        "thus",
        "offering",
        "explanation",
        "existence",
        "atomic",
        "motion",
        "per",
        "se",
        "even",
        "though",
        "prior",
        "collision",
        "another",
        "atom",
        "account",
        "direction",
        "individual",
        "atomic",
        "motion",
        "see",
        "keefe",
        "although",
        "ancient",
        "atomists",
        "often",
        "compared",
        "modern",
        "mechanistic",
        "theory",
        "balme",
        "warned",
        "danger",
        "assuming",
        "atomists",
        "share",
        "modern",
        "idea",
        "nature",
        "atomic",
        "motion",
        "particularly",
        "idea",
        "motion",
        "inertial",
        "balme",
        "according",
        "different",
        "report",
        "democritus",
        "ascribed",
        "cause",
        "thing",
        "necessity",
        "also",
        "chance",
        "probably",
        "latter",
        "term",
        "understood",
        "absence",
        "purpose",
        "rather",
        "denial",
        "necessity",
        "barnes",
        "pp",
        "democritus",
        "apparently",
        "recognized",
        "need",
        "account",
        "fact",
        "disorderly",
        "motion",
        "individual",
        "distinct",
        "atom",
        "could",
        "produce",
        "orderly",
        "cosmos",
        "atom",
        "randomly",
        "scattered",
        "cluster",
        "form",
        "mass",
        "distinct",
        "type",
        "reported",
        "relied",
        "tendency",
        "like",
        "like",
        "exists",
        "nature",
        "animal",
        "kind",
        "cluster",
        "together",
        "atom",
        "similar",
        "kind",
        "cluster",
        "size",
        "shape",
        "compare",
        "winnowing",
        "grain",
        "sieve",
        "sorting",
        "pebble",
        "riffled",
        "tide",
        "kind",
        "attraction",
        "like",
        "like",
        "dk",
        "b",
        "although",
        "claim",
        "interpreted",
        "differently",
        "eg",
        "taylor",
        "b",
        "p",
        "seems",
        "attempt",
        "show",
        "apparently",
        "ordered",
        "arrangement",
        "arise",
        "automatically",
        "byproduct",
        "random",
        "collision",
        "body",
        "motion",
        "furley",
        "p",
        "attractive",
        "force",
        "purpose",
        "need",
        "introduced",
        "explain",
        "sorting",
        "tide",
        "sieve",
        "probable",
        "attempt",
        "show",
        "apparently",
        "orderly",
        "effect",
        "produced",
        "without",
        "goaldirectioned",
        "force",
        "purpose",
        "democritus",
        "regard",
        "property",
        "atom",
        "combination",
        "sufficient",
        "account",
        "multitude",
        "difference",
        "among",
        "object",
        "world",
        "appears",
        "u",
        "aristotle",
        "cite",
        "analogy",
        "letter",
        "alphabet",
        "produce",
        "multitude",
        "different",
        "word",
        "element",
        "combination",
        "difference",
        "stem",
        "shape",
        "schêma",
        "letter",
        "differs",
        "n",
        "arrangement",
        "taxi",
        "differs",
        "na",
        "positional",
        "orientation",
        "thesis",
        "n",
        "differs",
        "z",
        "dk",
        "a",
        "term",
        "aristotle",
        "interpretation",
        "democritus",
        "terminology",
        "dynamic",
        "sense",
        "mourelatos",
        "passage",
        "omits",
        "difference",
        "size",
        "perhaps",
        "focused",
        "analogy",
        "letter",
        "alphabet",
        "quite",
        "clear",
        "text",
        "democritus",
        "think",
        "atom",
        "also",
        "differ",
        "size",
        "famously",
        "denies",
        "perceptible",
        "quality",
        "shape",
        "size",
        "perhaps",
        "weight",
        "really",
        "exist",
        "atom",
        "one",
        "direct",
        "quotation",
        "surviving",
        "democritus",
        "claim",
        "convention",
        "sweet",
        "convention",
        "bitter",
        "convention",
        "hot",
        "convention",
        "cold",
        "convention",
        "color",
        "reality",
        "atom",
        "void",
        "dk",
        "b",
        "trans",
        "taylor",
        "a",
        "different",
        "account",
        "distinction",
        "furley",
        "argues",
        "translation",
        "convention",
        "taken",
        "suggest",
        "anything",
        "arbitrary",
        "perception",
        "certain",
        "color",
        "say",
        "configuration",
        "atom",
        "may",
        "regularly",
        "associated",
        "given",
        "color",
        "furley",
        "cf",
        "barnes",
        "pp",
        "democritus",
        "reject",
        "label",
        "merely",
        "conventional",
        "perhaps",
        "imputation",
        "quality",
        "question",
        "atom",
        "perhaps",
        "even",
        "macroscopic",
        "body",
        "mourelatos",
        "draw",
        "contrast",
        "intrinsic",
        "relational",
        "property",
        "several",
        "report",
        "democritus",
        "view",
        "apparently",
        "direct",
        "quotation",
        "mention",
        "exclusively",
        "sensible",
        "quality",
        "unreal",
        "report",
        "plutarch",
        "includes",
        "list",
        "thing",
        "exist",
        "convention",
        "notion",
        "combination",
        "sunkrisis",
        "report",
        "genuinely",
        "democritean",
        "would",
        "broaden",
        "scope",
        "claim",
        "considerably",
        "idea",
        "combinationby",
        "presumably",
        "mean",
        "cluster",
        "atomsis",
        "unreal",
        "merely",
        "conventional",
        "suggests",
        "democritus",
        "drawing",
        "radical",
        "distinction",
        "sensible",
        "nonsensible",
        "quality",
        "implication",
        "would",
        "anything",
        "perceived",
        "perception",
        "combination",
        "atom",
        "atom",
        "would",
        "suspect",
        "merely",
        "qualia",
        "experienced",
        "mean",
        "individual",
        "sense",
        "organ",
        "one",
        "report",
        "indeed",
        "attribute",
        "democritus",
        "denial",
        "two",
        "thing",
        "could",
        "become",
        "one",
        "vice",
        "versa",
        "dk",
        "a",
        "thus",
        "suggesting",
        "combination",
        "regarded",
        "conventional",
        "commentator",
        "differ",
        "authenticity",
        "plutarch",
        "report",
        "word",
        "sunkrisis",
        "occur",
        "report",
        "furley",
        "following",
        "sandbach",
        "suggests",
        "likely",
        "error",
        "pikron",
        "bitter",
        "occurs",
        "instead",
        "another",
        "report",
        "however",
        "furley",
        "concedes",
        "plutarch",
        "least",
        "understands",
        "earliest",
        "atomists",
        "committed",
        "view",
        "combination",
        "atom",
        "much",
        "sensible",
        "quality",
        "understood",
        "conventional",
        "rather",
        "real",
        "furley",
        "pp",
        "n",
        "would",
        "suggest",
        "everything",
        "macroscopic",
        "levelor",
        "strictly",
        "everything",
        "available",
        "perceptionis",
        "regarded",
        "unreal",
        "ontological",
        "status",
        "arrangement",
        "combination",
        "atom",
        "democritus",
        "vexed",
        "question",
        "affect",
        "understanding",
        "metaphysics",
        "historical",
        "relationship",
        "melissus",
        "similarity",
        "view",
        "modern",
        "primarysecondary",
        "quality",
        "distinction",
        "wardy",
        "curd",
        "lee",
        "mourelatos",
        "pasnau",
        "take",
        "conventionality",
        "thesis",
        "restricted",
        "sensible",
        "quality",
        "still",
        "open",
        "question",
        "democritus",
        "reason",
        "denying",
        "reality",
        "wardy",
        "keefe",
        "ganson"
    ]
}