{
    "main_text": "Essential Dependence and Identity-Dependence || Identity-Dependence\n4.2 Identity-Dependence\n\nA point of entry to the idea that there are notions of dependence not\nanalyzable in terms of the modal-existential account—and hence a\nmotivation to pursue a non-modal analysis of dependence\naltogether—are cases that do not seem to involve a requirement\nfor existence at all. Indeed, as we already saw in the case\nof\n (3),\n “Socrates does not ontologically depend on singleton\nSocrates”, it seems that something beyond mere existential\nindependence is being expressed. Instead, one might say that singleton\nSocrates does not have anything to do with the identity or\nessence of Socrates, and it is this lack of\nidentity-dependence between Socrates and {Socrates} that we\nwish to express with (3). In other words, being a member of singleton\nSocrates is not an essential property of Socrates. Recall\nthat a similar issue seemed to arise with regard to the possibility of\ncomposite objects having essential proper parts. We will now\nconsider a more systematic method for dealing with cases of dependence\ninvolving the essences or essential properties of objects.\n\nIt is not quite straight-forward to define essential dependence,\nalthough a formal definition will be given below. Before that, we\nought to get a better picture of what it means to say that an object\ndepends upon something for its identity, that is, we should\nclarify the relation of identity-dependence. Note that the\nnotion of “identity” at play here is not the one\nsymbolized with the “equals” sign, i.e., “=”.\nRather, we mean “identity” in the sense of what a\nthing is, or which thing of a certain kind a thing is\n(compare this with Aristotle’s to ti esti, “the\nwhat it is”, see §7 of the separate entry on\n Aristotle’s metaphysics).\n Informally speaking, to say that the identity of x depends on\nthe identity of y—or, more briefly, that x depends\nfor its identity upon y—is to say that which\nthing of its kind y is fixes (or at least helps to fix)\nwhich thing of its kind x is. By “fixes”\nin this context is meant metaphysically determines. For\ninstance, then, the identity of a set is fixed by the\nidentities of its members, as was hinted already in\n §1.\n Likewise, the identity of an assassination is (at least\npartially) fixed by the identity of the person assassinated. These\nrelationships of identity-dependence are direct consequences of the\nidentity-criteria governing the kinds of which the items thus related\nare instances. (For further discussion on identity-criteria and\nidentity-dependence, see Lowe 1989, 2009: Ch. 2, and 2012.)\n\nOne way to attempt to precisify the notion of essence is to note that\nwe are here concerned with identity in the sense of\nindividuality rather than the relation of identity.\nIn other words, identity-dependence expresses the determination of the\nindividuality of objects in terms of the individuality of other\nobjects. Thus, the identity-dependence of a set upon its members could\nbe regarded as a consequence of the fact that the Axiom of\nExtensionality functions as the criterion of identity for sets. The\nset’s members determine the individuality of the set—they\nindividuate the set. Notice, here, that we allow that\nx may be said to depend for its identity upon y even in\ncases in which the identity of y alone does not\nsuffice to fix the identity of x. So, for example, a set with\ntwo or more members depends for its identity upon each of\nthem, although its identity is only completely fixed by the\nidentities of all of them.\n\nAnother way to specify the notion of essence being used is to resort\nto Fine’s (1994b, 1995) distinction between\nconstitutive and consequential essence:\n\n\nA property belongs to the constitutive essence of an object\nif it is not had in virtue of being a logical consequence of some more\nbasic essential properties; and a property might be said to belong to\nthe consequential essence of an object if it is a logical\nconsequence of properties that belong to the constitutive essence.\n(Fine 1994b: 276)\n\n\nAs Fine then goes on to note, the property of singleton Socrates,\nnamely, containing Socrates as a sole member, will presumably be part\nof the constitutive essence of {Socrates}. In contrast, the property\nof containing some member or another is only part of its consequential\nessence. It is evident that in cases of essential and\nidentity-dependence, we are typically interested in the constitutive\nnotion of essence, because it is presumably also a part of the\nconsequentialist essence of Socrates that 2 = 2. So, using the\nconsequentialist notion of essence to define essential and\nidentity-dependence would quickly lead to problems not unlike the ones\nfaced by the modal-existential account. Accordingly, in what follows,\nthe various definitions should in the first instance be understood to\nconcern the constitutive essence. But the problem that remains is that\nthe distinction between constitutive and consequential essence itself\nis not always easy to make and it is inevitable that there will be\nsome controversial cases (for discussion, see Fine 1994b). The\nexamples used to illustrate the various forms of essential dependence\nshould thus be taken with a grain of salt, as it is often not entirely\nclear what should be included in the constitutive essence of an\nentity. In any case, provided that this distinction can be made, the\nfriend of the essentialist analysis of dependence has a clear\nadvantage, given that they are able to express a broader range of\ndependence claims with the help of this distinction.\n\nNow, although we have not yet presented a formal definition of\nidentity-dependence, it might well seem that a consequence of any such\ndefinition should be the following principle:\n\n(ID-NEC)\n If x depends for its identity upon y, then there is\na function f such that x is necessarily identical with\nf(y).\n\n\n(Note: “f(y)” here may be pronounced\n“the f of y”.) For example: if we say that\nthe identity of a marriage depends on the identities of the two people\nbeing married, if x is a marriage and y and z are\nthe two people in question, (ID-NEC) is satisfied in respect of\nx and y in virtue of the fact that x is\nnecessarily identical with the marriage of y with\nz—so that in this case the required function is the\nmarriage with z function from persons to events. (We\nhere ignore the complications created by the fact that, under some\nlegal systems, the same two persons may be married to one another more\nthan once.) However, (ID-NEC) turns out to be unsatisfactory as a\ndefinition, because it can be regarded as trivially true, given\nstandard set theory, that any x and y that may be\nconnected with a function will satisfy the consequent of (ID-NEC). So\nwe better find a more satisfactory definition of\nidentity-dependence.\n\nEvidently, it would not do simply to replace the conditional\nconnective in (ID-NEC) with a biconditional connective and\nthence attempt to turn it into a definition of\nidentity-dependence, unless at the same time one could impose some\nsuitable restriction on the kind of function involved. One possibility\nwould be to exclude any function f which is not such that it is\npart of the essence of x that it is the f of\ny. But since it would appear strange to say that essences quite\ngenerally involve anything about functions, we might be\nbetter off with a definition using an appropriate yet to be specified\nplace-holder relation that would do the same job instead, arriving at\nthe following definition of identity-dependence:\n\n(ID)\n x depends for its identity upon y =df\nThere is a relation “R” such that it is part of the\nessence of x that x is related by R to\ny.\n\n\nWe can exemplify (ID) by letting x be {z} and y\nbe z, in which case we have, as is intuitively correct, that\n{z} depends for its identity upon z, because there is a\nrelation—namely, “being a member of the singleton\nset” (also known as the unit set function)—such\nthat it is part of the essence of {z} that it is the singleton\nset of z. Accordingly, we may interpret the relation R\nmore precisely on a case by case basis.\n\nBuilding on this example, we can see that x is necessarily\nidentical with the sole member of {x} and hence we can arrive\nat a principle not unlike (ID-NEC). However, even though x is\nnecessarily identical with the sole member of {x}, it is, once\nagain, plausibly not part of the essence of x that\nx is the sole member of {x} (cf. Fine 1994a: 4–5;\nsee also Fine 1994b for a related discussion of the notion of essence\nand essential dependence).\n\nBut, of course, for the foregoing strategy to work and thus for (ID)\nto be fully vindicated, a perspicuous account of the notion of\n“essence” would be required—and that is a large task\nwhich cannot be undertaken here. However, various attempts to\nconstruct such an account have been made, for instance by Fine (1994a)\nand Lowe (2008). In this sense, a thing’s essence may be said to\nconstitute its identity, when one uses the word\n“identity” in this distinctive manner to speak of a\nthing’s identity, rather than using it to speak of the\nidentity relation. Seen in this light, identity-dependence as\ndefined by (ID) is simply a species of essential dependence,\nthat is, a way in which the essence of a certain thing is determined\nby a relation in which it stands to another thing.\n\nAlthough the above account of identity-dependence is not entirely\nuncontroversial, there are some interesting applications of it in the\nliterature. One of these applications concerns a version of Ontic\nStructural Realism (OSR, see Ladyman 1998), which claims that objects\ndepend for their identities on the structures to which they belong\n(ID-OSR) (see French 2010 for one version, and see Lowe 2012 and\nO’Conaill 2014 for further discussion of OSR and\ndependence).\n\nAt this point, two principles concerning identity-dependence, as\ndefined by\n (ID),\n may be proposed. First:\n\n(ID-EX)\n If x depends for its identity upon y, then,\nnecessarily, x exists only if y exists.\n\n\nAnd second:\n\n(ID-NEX)\n If x is not identical with y and x\ndepends for its identity upon y, then y does\nnot depend for its identity upon x.\n\n\nAn immediate implication of (ID-EX) in conjunction with\n (EDR)\n is that if x depends for its identity upon y, then\nx is rigidly existentially dependent upon y\n(although not necessarily vice versa, of course). These two\nprinciples are, it seems, quite plausible. As for (ID-EX): surely,\nx cannot exist unless everything upon which x’s\nidentity depends also exists. Thus an assassination cannot exist\nunless the person assassinated exists, and a set cannot exist unless\nits members exist. Indeed, it would seem that we can derive (ID-EX)\nwith the aid of\n (ID).\n For suppose that x depends for its identity upon y.\nThen, by (ID), there is a relation R such that x is\nrelated by R to y. Given, however, that the relevant\nR cannot exist unless y exists—because a relation\ncan obtain only between entities all of which exist—it\nfollows that x likewise cannot exist unless y exists. As\nfor (ID-NEX), this seems to follow from the requirement of\nnon-circularity which is a condition on the adequacy of any\ncriterion of identity. For example, given that unit sets are not to be\nidentified with their members, we cannot say both that the\nidentity of a unit set depends upon the identity of its member\nand that the identity of that member depends upon the\nidentity of that unit set, for this would engender a vicious circle\nwhich would seem to deprive both unit sets and their\nmembers of well-defined identity-conditions.\n\nNote that it may be urged, with some plausibility, that every object\nx trivially depends for its identity upon itself. And,\ncertainly,\n (ID)\n would appear to have this implication, because for any object\nx, there is a relation—namely,\nidentity—such that it is part of the essence of\nx that x is the object identical with x. But we\nmust be very careful to distinguish between the claim that an object\ndepends for its identity upon itself and the claim that an object\ndepends for its identity solely upon itself. For even if the\nformer claim is trivially true of all entities, the latter claim is\ncertainly not. However, this result may be contested when we bear in\nmind the distinction between constitutive and consequential essence,\nbecause one might very well hold that it is no part of the\nconstitutive essence of an entity, at least typically, that it should\nbe identical with itself (we will omit a more detailed discussion\nhere, but see Fine 1994b).\n",
    "section_title": "4.2 Identity-Dependence",
    "entry_title": "Ontological Dependence",
    "hierarchy_title": "Ontological Dependence || Essential Dependence and Identity-Dependence || Identity-Dependence",
    "tokenized_text": [
        "essential",
        "dependence",
        "identitydependence",
        "identitydependence",
        "identitydependence",
        "point",
        "entry",
        "idea",
        "notion",
        "dependence",
        "analyzable",
        "term",
        "modalexistential",
        "accountand",
        "hence",
        "motivation",
        "pursue",
        "nonmodal",
        "analysis",
        "dependence",
        "altogetherare",
        "case",
        "seem",
        "involve",
        "requirement",
        "existence",
        "indeed",
        "already",
        "saw",
        "case",
        "socrates",
        "ontologically",
        "depend",
        "singleton",
        "socrates",
        "seems",
        "something",
        "beyond",
        "mere",
        "existential",
        "independence",
        "expressed",
        "instead",
        "one",
        "might",
        "say",
        "singleton",
        "socrates",
        "anything",
        "identity",
        "essence",
        "socrates",
        "lack",
        "identitydependence",
        "socrates",
        "socrates",
        "wish",
        "express",
        "word",
        "member",
        "singleton",
        "socrates",
        "essential",
        "property",
        "socrates",
        "recall",
        "similar",
        "issue",
        "seemed",
        "arise",
        "regard",
        "possibility",
        "composite",
        "object",
        "essential",
        "proper",
        "part",
        "consider",
        "systematic",
        "method",
        "dealing",
        "case",
        "dependence",
        "involving",
        "essence",
        "essential",
        "property",
        "object",
        "quite",
        "straightforward",
        "define",
        "essential",
        "dependence",
        "although",
        "formal",
        "definition",
        "given",
        "ought",
        "get",
        "better",
        "picture",
        "mean",
        "say",
        "object",
        "depends",
        "upon",
        "something",
        "identity",
        "clarify",
        "relation",
        "identitydependence",
        "note",
        "notion",
        "identity",
        "play",
        "one",
        "symbolized",
        "equal",
        "sign",
        "ie",
        "rather",
        "mean",
        "identity",
        "sense",
        "thing",
        "thing",
        "certain",
        "kind",
        "thing",
        "compare",
        "aristotle",
        "ti",
        "esti",
        "see",
        "separate",
        "entry",
        "aristotle",
        "metaphysics",
        "informally",
        "speaking",
        "say",
        "identity",
        "x",
        "depends",
        "identity",
        "yor",
        "briefly",
        "x",
        "depends",
        "identity",
        "upon",
        "yis",
        "say",
        "thing",
        "kind",
        "fix",
        "least",
        "help",
        "fix",
        "thing",
        "kind",
        "x",
        "fix",
        "context",
        "meant",
        "metaphysically",
        "determines",
        "instance",
        "identity",
        "set",
        "fixed",
        "identity",
        "member",
        "hinted",
        "already",
        "likewise",
        "identity",
        "assassination",
        "least",
        "partially",
        "fixed",
        "identity",
        "person",
        "assassinated",
        "relationship",
        "identitydependence",
        "direct",
        "consequence",
        "identitycriteria",
        "governing",
        "kind",
        "item",
        "thus",
        "related",
        "instance",
        "discussion",
        "identitycriteria",
        "identitydependence",
        "see",
        "lowe",
        "ch",
        "one",
        "way",
        "attempt",
        "precisify",
        "notion",
        "essence",
        "note",
        "concerned",
        "identity",
        "sense",
        "individuality",
        "rather",
        "relation",
        "identity",
        "word",
        "identitydependence",
        "express",
        "determination",
        "individuality",
        "object",
        "term",
        "individuality",
        "object",
        "thus",
        "identitydependence",
        "set",
        "upon",
        "member",
        "could",
        "regarded",
        "consequence",
        "fact",
        "axiom",
        "extensionality",
        "function",
        "criterion",
        "identity",
        "set",
        "set",
        "member",
        "determine",
        "individuality",
        "setthey",
        "individuate",
        "set",
        "notice",
        "allow",
        "x",
        "may",
        "said",
        "depend",
        "identity",
        "upon",
        "even",
        "case",
        "identity",
        "alone",
        "suffice",
        "fix",
        "identity",
        "x",
        "example",
        "set",
        "two",
        "member",
        "depends",
        "identity",
        "upon",
        "although",
        "identity",
        "completely",
        "fixed",
        "identity",
        "another",
        "way",
        "specify",
        "notion",
        "essence",
        "used",
        "resort",
        "fine",
        "b",
        "distinction",
        "constitutive",
        "consequential",
        "essence",
        "property",
        "belongs",
        "constitutive",
        "essence",
        "object",
        "virtue",
        "logical",
        "consequence",
        "basic",
        "essential",
        "property",
        "property",
        "might",
        "said",
        "belong",
        "consequential",
        "essence",
        "object",
        "logical",
        "consequence",
        "property",
        "belong",
        "constitutive",
        "essence",
        "fine",
        "b",
        "fine",
        "go",
        "note",
        "property",
        "singleton",
        "socrates",
        "namely",
        "containing",
        "socrates",
        "sole",
        "member",
        "presumably",
        "part",
        "constitutive",
        "essence",
        "socrates",
        "contrast",
        "property",
        "containing",
        "member",
        "another",
        "part",
        "consequential",
        "essence",
        "evident",
        "case",
        "essential",
        "identitydependence",
        "typically",
        "interested",
        "constitutive",
        "notion",
        "essence",
        "presumably",
        "also",
        "part",
        "consequentialist",
        "essence",
        "socrates",
        "using",
        "consequentialist",
        "notion",
        "essence",
        "define",
        "essential",
        "identitydependence",
        "would",
        "quickly",
        "lead",
        "problem",
        "unlike",
        "one",
        "faced",
        "modalexistential",
        "account",
        "accordingly",
        "follows",
        "various",
        "definition",
        "first",
        "instance",
        "understood",
        "concern",
        "constitutive",
        "essence",
        "problem",
        "remains",
        "distinction",
        "constitutive",
        "consequential",
        "essence",
        "always",
        "easy",
        "make",
        "inevitable",
        "controversial",
        "case",
        "discussion",
        "see",
        "fine",
        "b",
        "example",
        "used",
        "illustrate",
        "various",
        "form",
        "essential",
        "dependence",
        "thus",
        "taken",
        "grain",
        "salt",
        "often",
        "entirely",
        "clear",
        "included",
        "constitutive",
        "essence",
        "entity",
        "case",
        "provided",
        "distinction",
        "made",
        "friend",
        "essentialist",
        "analysis",
        "dependence",
        "clear",
        "advantage",
        "given",
        "able",
        "express",
        "broader",
        "range",
        "dependence",
        "claim",
        "help",
        "distinction",
        "although",
        "yet",
        "presented",
        "formal",
        "definition",
        "identitydependence",
        "might",
        "well",
        "seem",
        "consequence",
        "definition",
        "following",
        "principle",
        "idnec",
        "x",
        "depends",
        "identity",
        "upon",
        "function",
        "f",
        "x",
        "necessarily",
        "identical",
        "f",
        "note",
        "f",
        "may",
        "pronounced",
        "f",
        "example",
        "say",
        "identity",
        "marriage",
        "depends",
        "identity",
        "two",
        "people",
        "married",
        "x",
        "marriage",
        "z",
        "two",
        "people",
        "question",
        "idnec",
        "satisfied",
        "respect",
        "x",
        "virtue",
        "fact",
        "x",
        "necessarily",
        "identical",
        "marriage",
        "zso",
        "case",
        "required",
        "function",
        "marriage",
        "z",
        "function",
        "person",
        "event",
        "ignore",
        "complication",
        "created",
        "fact",
        "legal",
        "system",
        "two",
        "person",
        "may",
        "married",
        "one",
        "another",
        "however",
        "idnec",
        "turn",
        "unsatisfactory",
        "definition",
        "regarded",
        "trivially",
        "true",
        "given",
        "standard",
        "set",
        "theory",
        "x",
        "may",
        "connected",
        "function",
        "satisfy",
        "consequent",
        "idnec",
        "better",
        "find",
        "satisfactory",
        "definition",
        "identitydependence",
        "evidently",
        "would",
        "simply",
        "replace",
        "conditional",
        "connective",
        "idnec",
        "biconditional",
        "connective",
        "thence",
        "attempt",
        "turn",
        "definition",
        "identitydependence",
        "unless",
        "time",
        "one",
        "could",
        "impose",
        "suitable",
        "restriction",
        "kind",
        "function",
        "involved",
        "one",
        "possibility",
        "would",
        "exclude",
        "function",
        "f",
        "part",
        "essence",
        "x",
        "f",
        "y",
        "since",
        "would",
        "appear",
        "strange",
        "say",
        "essence",
        "quite",
        "generally",
        "involve",
        "anything",
        "function",
        "might",
        "better",
        "definition",
        "using",
        "appropriate",
        "yet",
        "specified",
        "placeholder",
        "relation",
        "would",
        "job",
        "instead",
        "arriving",
        "following",
        "definition",
        "identitydependence",
        "id",
        "x",
        "depends",
        "identity",
        "upon",
        "df",
        "relation",
        "r",
        "part",
        "essence",
        "x",
        "x",
        "related",
        "r",
        "y",
        "exemplify",
        "id",
        "letting",
        "x",
        "z",
        "z",
        "case",
        "intuitively",
        "correct",
        "z",
        "depends",
        "identity",
        "upon",
        "z",
        "relationnamely",
        "member",
        "singleton",
        "set",
        "also",
        "known",
        "unit",
        "set",
        "function",
        "such",
        "part",
        "essence",
        "z",
        "singleton",
        "set",
        "z",
        "accordingly",
        "may",
        "interpret",
        "relation",
        "r",
        "precisely",
        "case",
        "case",
        "basis",
        "building",
        "example",
        "see",
        "x",
        "necessarily",
        "identical",
        "sole",
        "member",
        "x",
        "hence",
        "arrive",
        "principle",
        "unlike",
        "idnec",
        "however",
        "even",
        "though",
        "x",
        "necessarily",
        "identical",
        "sole",
        "member",
        "x",
        "plausibly",
        "part",
        "essence",
        "x",
        "x",
        "sole",
        "member",
        "x",
        "cf",
        "fine",
        "a",
        "see",
        "also",
        "fine",
        "b",
        "related",
        "discussion",
        "notion",
        "essence",
        "essential",
        "dependence",
        "course",
        "foregoing",
        "strategy",
        "work",
        "thus",
        "id",
        "fully",
        "vindicated",
        "perspicuous",
        "account",
        "notion",
        "essence",
        "would",
        "requiredand",
        "large",
        "task",
        "undertaken",
        "however",
        "various",
        "attempt",
        "construct",
        "account",
        "made",
        "instance",
        "fine",
        "a",
        "lowe",
        "sense",
        "thing",
        "essence",
        "may",
        "said",
        "constitute",
        "identity",
        "one",
        "us",
        "word",
        "identity",
        "distinctive",
        "manner",
        "speak",
        "thing",
        "identity",
        "rather",
        "using",
        "speak",
        "identity",
        "relation",
        "seen",
        "light",
        "identitydependence",
        "defined",
        "id",
        "simply",
        "specie",
        "essential",
        "dependence",
        "way",
        "essence",
        "certain",
        "thing",
        "determined",
        "relation",
        "stand",
        "another",
        "thing",
        "although",
        "account",
        "identitydependence",
        "entirely",
        "uncontroversial",
        "interesting",
        "application",
        "literature",
        "one",
        "application",
        "concern",
        "version",
        "ontic",
        "structural",
        "realism",
        "osr",
        "see",
        "ladyman",
        "claim",
        "object",
        "depend",
        "identity",
        "structure",
        "belong",
        "idosr",
        "see",
        "french",
        "one",
        "version",
        "see",
        "lowe",
        "conaill",
        "discussion",
        "osr",
        "dependence",
        "point",
        "two",
        "principle",
        "concerning",
        "identitydependence",
        "defined",
        "id",
        "may",
        "proposed",
        "first",
        "idex",
        "x",
        "depends",
        "identity",
        "upon",
        "necessarily",
        "x",
        "exists",
        "exists",
        "second",
        "idnex",
        "x",
        "identical",
        "x",
        "depends",
        "identity",
        "upon",
        "depend",
        "identity",
        "upon",
        "x",
        "immediate",
        "implication",
        "idex",
        "conjunction",
        "edr",
        "x",
        "depends",
        "identity",
        "upon",
        "x",
        "rigidly",
        "existentially",
        "dependent",
        "upon",
        "although",
        "necessarily",
        "vice",
        "versa",
        "course",
        "two",
        "principle",
        "seems",
        "quite",
        "plausible",
        "idex",
        "surely",
        "x",
        "exist",
        "unless",
        "everything",
        "upon",
        "x",
        "identity",
        "depends",
        "also",
        "exists",
        "thus",
        "assassination",
        "exist",
        "unless",
        "person",
        "assassinated",
        "exists",
        "set",
        "exist",
        "unless",
        "member",
        "exist",
        "indeed",
        "would",
        "seem",
        "derive",
        "idex",
        "aid",
        "id",
        "suppose",
        "x",
        "depends",
        "identity",
        "upon",
        "y",
        "id",
        "relation",
        "r",
        "x",
        "related",
        "r",
        "y",
        "given",
        "however",
        "relevant",
        "r",
        "exist",
        "unless",
        "existsbecause",
        "relation",
        "obtain",
        "entity",
        "existit",
        "follows",
        "x",
        "likewise",
        "exist",
        "unless",
        "exists",
        "idnex",
        "seems",
        "follow",
        "requirement",
        "noncircularity",
        "condition",
        "adequacy",
        "criterion",
        "identity",
        "example",
        "given",
        "unit",
        "set",
        "identified",
        "member",
        "say",
        "identity",
        "unit",
        "set",
        "depends",
        "upon",
        "identity",
        "member",
        "identity",
        "member",
        "depends",
        "upon",
        "identity",
        "unit",
        "set",
        "would",
        "engender",
        "vicious",
        "circle",
        "would",
        "seem",
        "deprive",
        "unit",
        "set",
        "member",
        "welldefined",
        "identityconditions",
        "note",
        "may",
        "urged",
        "plausibility",
        "every",
        "object",
        "x",
        "trivially",
        "depends",
        "identity",
        "upon",
        "certainly",
        "id",
        "would",
        "appear",
        "implication",
        "object",
        "x",
        "relationnamely",
        "identitysuch",
        "part",
        "essence",
        "x",
        "x",
        "object",
        "identical",
        "x",
        "must",
        "careful",
        "distinguish",
        "claim",
        "object",
        "depends",
        "identity",
        "upon",
        "claim",
        "object",
        "depends",
        "identity",
        "solely",
        "upon",
        "even",
        "former",
        "claim",
        "trivially",
        "true",
        "entity",
        "latter",
        "claim",
        "certainly",
        "however",
        "result",
        "may",
        "contested",
        "bear",
        "mind",
        "distinction",
        "constitutive",
        "consequential",
        "essence",
        "one",
        "might",
        "well",
        "hold",
        "part",
        "constitutive",
        "essence",
        "entity",
        "least",
        "typically",
        "identical",
        "omit",
        "detailed",
        "discussion",
        "see",
        "fine",
        "b"
    ]
}