{
    "main_text": "Resemblance Theories of Depiction || Recent Resemblance Theories\n1.2 Recent Resemblance Theories\n\nThe principal objections to resemblance theories of depiction may be\nunconvincing, but the challenge for such a theory is to specify the\nrespect or respects in which pictures resemble their objects, and this\nis not a simple task. Merely referring to ‘form and\ncolour’ is unsatisfactory. For as Descartes pointed out, it is\nunclear how the 2-D shape of a mark on the surface of a painting or\ndrawing can resemble the 3-D shape of an object it depicts; and the\nuse of foreshortening shows that rhombuses can represent squares\nbetter than squares, ovals can represent circles better than circles,\nand so on ([1637] 1985: I 165). Furthermore, some pictures (for\ninstance, cubist paintings) do not bear much obvious resemblance to\nthe objects they depict in either form or colour. Hence, the basic\nidea that depiction depends on resemblances in form and colour will\nneed to be specified in such a way as to meet what Dominic Lopes calls\nthe diversity constraint (Lopes 1996: 32), in other words, it\nwill need to accommodate the wide variety of styles of picture-making.\nDifferent resemblance theorists have responded to these challenges in\ndifferent ways.\n\nJohn Hyman and Catherine Abell have proposed different theories of\ndepiction in which the idea of resemblance plays a significant role.\nHyman rejects the theory that pictures are iconic signs (2012: 127),\nbut he claims that there is a strict and invariable relationship\nbetween the shapes and colours on a picture’s surface and the\nshapes and colours of the objects it represents. Hyman’s theory\ndepends on Gottlob Frege’s distinction between sense and\nreference (see §3.2 of the  entry on\n Frege).\n Taking one of Frege’s own examples, the phrases “the\nmorning star” and “the evening star” have the same\nreference, but different senses, or modes of presentation. Both\nphrases refer to one and the same object, the planet Venus, but they\ndescribe or present it as a star that is visible at different times of\nday. Similarly, two portraits of the same individual may present him\nas dark-haired and seated, wearing a black smock\n (Kramskoy’s 1873 portrait of Tolstoy),\n or as grey-haired and standing, wearing a white smock\n (Repin’s 1901 portrait).\n They portray (refer to) the same individual, but they present him\ndifferently (they differ in sense). The distinction matters, Hyman\nargues, because resemblances do not explain a picture’s\nreference, they explain its sense. (The claim that A depicts\nB if and only if A appreciably resembles B, which\nGoodman criticizes, is about depiction qua portrayal, i.e.,\npictorial reference, not sense.)\n\nAccording to Hyman, the sense or mode of presentation of a picture,\nexpressed in the most general terms, is an aspect or view of an object\nor arrangement of objects, relative to an implicit point (or a variety\nof points) of view. (An “object” in this sense is not\nnecessarily a “material object”, it might be a shadow, a\nrainbow, or part of the sky.) Different parts of a picture can present\ndifferent aspects of an object or its parts, corresponding to\ndifferent points of view, but nothing can be depicted independently of\na point of view. Otherwise, Hyman points out,\n\n\n[we could] discover different aspects of an object represented in a\npicture by moving around it and studying it from different angles, as\nwe can in the case of a free-standing sculpture. (2012: 142)\n\n\nHyman’s principal claim is that the sense or mode of\npresentation of a picture is defined by the colours and shapes of the\nmarks on its surface in accordance with definite optical principles\nconcerning colour and shape (2006: ch. 5; see also Hopkins 1998a: 27).\nWe shall concentrate on shape.\n\nHyman’s shape-principle employs the concept of an object’s\nocclusion shape, i.e., the 2-D cross-section of the cone of\nlight it subtends to a viewer’s eye. (The concept is similar to\nHopkins’s outline shape; see below,\n §3.2.)\n For example, the occlusion shape of a circular coin viewed obliquely\nis an ellipse. This shape, Hyman argues, is a visible property of the\ncoin. It is especially salient when an object is backlit, and appears\nin silhouette. It is relative to a point of view, and changes as the\npoint of view changes. But Hyman insists that relative does not mean\nsubjective. An object’s occlusion shape “is not merely a\nfeature of the viewer’s experience. It belongs to optics, not\npsychology” (2012: 143; cf. Peacocke 1987). Hyman’s\nshape-principle is that the shape of a region on a picture’s\nsurface (or, in the case of anamorphic pictures, its occlusion shape\nrelative to the intended point of view of a spectator) is identical to\nthe occlusion shape of the object it represents, relative to the\nimplicit point of view. In other words, there is an exact resemblance\nbetween these shapes (2006: 81).\n\nAccording to Hyman, this principle captures an exact relationship\nbetween the marks on a picture’s surface and the picture’s\nsense, which does not depend on the artist’s intention, or on\nthe picture’s psychological effect on a spectator, and which\napplies to pictures regardless of their style or the artistic\ntradition to which they belong. Together with a principle concerning\ncolour, it is supposed to explain how the colours and shapes on the\nsurface of a picture fix the colours and shapes of the objects it\ndepicts. But Hyman’s optical principles do not imply that a\nportrait of Tolstoy resembles Tolstoy, since they are only concerned\nwith a picture’s sense, as opposed to its reference. Nor do they\nimply that a painting of a bearded man resembles a bearded man, since\nthey are only concerned with the shapes and colours of the objects in\na picture. Hyman therefore claims that his theory dovetails neatly\nwith the idea that a picture’s reference is normally determined\nby the artist’s intention, and with the idea that the depiction\nof objects of specific kinds, such as men and horses, depends on a\npicture’s propensity to trigger a spectator’s ability to\nrecognize these kinds of objects by their shapes and colours, and the\nshapes and colours of their parts (see below,\n §3.2).\n He explains how these two elements of a theory of depiction can be\ncombined with the example of a silhouette:\n\n\nthe black shapes the silhouettist has cut out fix the occlusion shapes\nof the objects represented and their parts, relative to an implicit\nline of sight. And the spectator’s ability to recognize, say, a\ngirl or a cat, enables him to see a girl or a cat depicted in a\nsilhouette by seeing its occlusion shape and the occlusion shapes of\nits parts. (2012: 113)\n\n\nHyman’s theory has been criticised on various grounds. First,\nand most generally, Michael Podro argues that it expresses a bias in\nfavour of realistic or literal representation (Podro 2010: 457).\nHowever, Hyman replies that the optical principles he defines\n“do not dictate or limit the forms artists create, the models\nthey follow, or the values they embody in their work”, any more\nthan English grammar limits the imagination of English poets (Hyman\n2012: 145). Second, it has been alleged that Hyman’s theory\ncannot explain “the depiction of nonexistent objects”\n(Abell 2009: 195). However, this objection depends on the questionable\nassumption that resemblance is invariably a relation between existing\nparticulars (see above\n §1.1).\n Third, it has been argued that indeterminacies in the occlusion\nshapes of objects represented in a picture may not match the\nindeterminacies in the shapes of the parts of the picture that depict\nthem (Kulvicki 2014: 61–62). Finally, it has been argued more\ngenerally that the exact correspondences in shape and colour between\nthe surface of a picture and its content, which Hyman’s theory\npredicts, sometimes break down; and that the correspondences which do\nexist depend on contingent features of the human visual system (Newall\n2006; Hyman 2007; Newall 2011).\n\nThe last objection reflects the most widely accepted reason for\nrejecting resemblance theories such as Hyman’s, in which the\nbasic mechanism of depiction is defined without reference either to\nthe visual experience of a spectator, or to the changing cultural\ncontext in which pictures are made. Catharine Abell has defended a\nresemblance theory of depiction which differs from Hyman’s in\nboth of these respects, and is designed to avoid the objections\nmentioned above. It is also a more ambitious theory, both because\nAbell does not distinguish between the sense and reference of a\npicture, but aims to explain both at once, and because she explains\nthe depiction of specific kinds of objects, such as men and horses, in\nterms of resemblance, instead of confining the scope of the theory to\nthe shapes and colours of the objects in a picture. Unlike Hyman,\nAbell does not specify which particular respects of resemblance are\nnecessary for depiction, beyond the requirement that they should be\nvisible (2009: 199), arguing instead that “different respects of\nresemblance govern different instances of depiction” (2009:\n196), including resemblance in respect of optical properties, such as\nocclusion shape, and response-dependent properties, such as when\npainters mimic the effect of simultaneous contrast.\n\nDrawing on Paul Grice’s seminal article “Meaning”\n(Grice 1957), Abell argues that the respects of resemblance governing\na particular picture depend on the artist’s communicative\nintentions:\n\n\nA picture’s resemblance to some object O in a given\nrespect(s) is relevant to determining what the picture depicts if its\nmaker intended the picture to resemble O in the relevant\nrespect(s) and thus to bring O to viewers’ minds; and\nintended that these resemblances have this effect in part because\nviewers recognize that intention. (2009: 201; cf. Blumson 2009 and\n2014)\n\n\nAccording to Abell, a picture depicts some object O only if it\nresembles O in a range of relevant respects, and if it thereby\ncaptures O’s “overall appearance”, enabling a\nspectator to distinguish it from objects for which it would not\nordinarily be mistaken (2009: 210). As noted above, Abell regards\npictures of objects that do not actually exist as problematic for\nresemblance theories of depiction. Her solution to the problem\ncombines two ideas: first, a picture of an object that does not\nactually exist, but could exist, such as a gold mountain,\nwould resemble the object, if it did exist; second, we can\nmake-believe that a fictional character such as Sherlock Holmes\nexists, and make-believe that a picture resembles him (2009:216).\n\nAbell argues that because she does not specify which particular\nrespects of resemblance are necessary for depiction, her theory is\nconsistent with the diversity constraint, in other words, it\naccommodates the wide variety of stylistic conventions that have\ndeveloped in different artistic traditions. However, it can be\nobjected that it fails to accommodate another alleged constraint on an\nadequate resemblance theory of depiction identified by Lopes, which he\ncalls the independence constraint. According to Lopes, a\nspectator must be able to perceive the resemblances postulated by a\nresemblance theory of depiction “without first knowing”\nwhat a picture represents (Lopes 2005a: 16–17). In fact, this\nobjection only applies to a theory which implies that a spectator\nperceives a certain kind of object in a picture by perceiving a\nresemblance between the marks on its surface and an object of\nthis kind, and a resemblance theory need not have this implication.\nHowever, Abell accepts that the objection applies to her own theory,\nespecially since she holds that the “respects of\nresemblance” that “govern” a picture depend on the\nartist’s communicative intentions, and that a spectator’s\nknowledge of these intentions is gained, at least in part, from the\npicture itself. However, she addresses the objection by highlighting\nalternative, context-specific sources of information about them (Abell\n2005, 2009; cf. Blumson 2014).\n",
    "section_title": "1.2 Recent Resemblance Theories",
    "entry_title": "Depiction",
    "hierarchy_title": "Depiction || Resemblance Theories of Depiction || Recent Resemblance Theories",
    "tokenized_text": [
        "resemblance",
        "theory",
        "depiction",
        "recent",
        "resemblance",
        "theory",
        "recent",
        "resemblance",
        "theory",
        "principal",
        "objection",
        "resemblance",
        "theory",
        "depiction",
        "may",
        "unconvincing",
        "challenge",
        "theory",
        "specify",
        "respect",
        "respect",
        "picture",
        "resemble",
        "object",
        "simple",
        "task",
        "merely",
        "referring",
        "form",
        "colour",
        "unsatisfactory",
        "descartes",
        "pointed",
        "unclear",
        "d",
        "shape",
        "mark",
        "surface",
        "painting",
        "drawing",
        "resemble",
        "d",
        "shape",
        "object",
        "depicts",
        "use",
        "foreshortening",
        "show",
        "rhombus",
        "represent",
        "square",
        "better",
        "square",
        "oval",
        "represent",
        "circle",
        "better",
        "circle",
        "furthermore",
        "picture",
        "instance",
        "cubist",
        "painting",
        "bear",
        "much",
        "obvious",
        "resemblance",
        "object",
        "depict",
        "either",
        "form",
        "colour",
        "hence",
        "basic",
        "idea",
        "depiction",
        "depends",
        "resemblance",
        "form",
        "colour",
        "need",
        "specified",
        "way",
        "meet",
        "dominic",
        "lope",
        "call",
        "diversity",
        "constraint",
        "lope",
        "word",
        "need",
        "accommodate",
        "wide",
        "variety",
        "style",
        "picturemaking",
        "different",
        "resemblance",
        "theorist",
        "responded",
        "challenge",
        "different",
        "way",
        "john",
        "hyman",
        "catherine",
        "abell",
        "proposed",
        "different",
        "theory",
        "depiction",
        "idea",
        "resemblance",
        "play",
        "significant",
        "role",
        "hyman",
        "reject",
        "theory",
        "picture",
        "iconic",
        "sign",
        "claim",
        "strict",
        "invariable",
        "relationship",
        "shape",
        "colour",
        "picture",
        "surface",
        "shape",
        "colour",
        "object",
        "represents",
        "hyman",
        "theory",
        "depends",
        "gottlob",
        "frege",
        "distinction",
        "sense",
        "reference",
        "see",
        "entry",
        "frege",
        "taking",
        "one",
        "frege",
        "example",
        "phrase",
        "morning",
        "star",
        "evening",
        "star",
        "reference",
        "different",
        "sens",
        "mode",
        "presentation",
        "phrase",
        "refer",
        "one",
        "object",
        "planet",
        "venus",
        "describe",
        "present",
        "star",
        "visible",
        "different",
        "time",
        "day",
        "similarly",
        "two",
        "portrait",
        "individual",
        "may",
        "present",
        "darkhaired",
        "seated",
        "wearing",
        "black",
        "smock",
        "kramskoy",
        "portrait",
        "tolstoy",
        "greyhaired",
        "standing",
        "wearing",
        "white",
        "smock",
        "repin",
        "portrait",
        "portray",
        "refer",
        "individual",
        "present",
        "differently",
        "differ",
        "sense",
        "distinction",
        "matter",
        "hyman",
        "argues",
        "resemblance",
        "explain",
        "picture",
        "reference",
        "explain",
        "sense",
        "claim",
        "depicts",
        "b",
        "appreciably",
        "resembles",
        "b",
        "goodman",
        "criticizes",
        "depiction",
        "qua",
        "portrayal",
        "ie",
        "pictorial",
        "reference",
        "sense",
        "according",
        "hyman",
        "sense",
        "mode",
        "presentation",
        "picture",
        "expressed",
        "general",
        "term",
        "aspect",
        "view",
        "object",
        "arrangement",
        "object",
        "relative",
        "implicit",
        "point",
        "variety",
        "point",
        "view",
        "object",
        "sense",
        "necessarily",
        "material",
        "object",
        "might",
        "shadow",
        "rainbow",
        "part",
        "sky",
        "different",
        "part",
        "picture",
        "present",
        "different",
        "aspect",
        "object",
        "part",
        "corresponding",
        "different",
        "point",
        "view",
        "nothing",
        "depicted",
        "independently",
        "point",
        "view",
        "otherwise",
        "hyman",
        "point",
        "could",
        "discover",
        "different",
        "aspect",
        "object",
        "represented",
        "picture",
        "moving",
        "around",
        "studying",
        "different",
        "angle",
        "case",
        "freestanding",
        "sculpture",
        "hyman",
        "principal",
        "claim",
        "sense",
        "mode",
        "presentation",
        "picture",
        "defined",
        "colour",
        "shape",
        "mark",
        "surface",
        "accordance",
        "definite",
        "optical",
        "principle",
        "concerning",
        "colour",
        "shape",
        "ch",
        "see",
        "also",
        "hopkins",
        "a",
        "shall",
        "concentrate",
        "shape",
        "hyman",
        "shapeprinciple",
        "employ",
        "concept",
        "object",
        "occlusion",
        "shape",
        "ie",
        "d",
        "crosssection",
        "cone",
        "light",
        "subtends",
        "viewer",
        "eye",
        "concept",
        "similar",
        "hopkins",
        "outline",
        "shape",
        "see",
        "example",
        "occlusion",
        "shape",
        "circular",
        "coin",
        "viewed",
        "obliquely",
        "ellipse",
        "shape",
        "hyman",
        "argues",
        "visible",
        "property",
        "coin",
        "especially",
        "salient",
        "object",
        "backlit",
        "appears",
        "silhouette",
        "relative",
        "point",
        "view",
        "change",
        "point",
        "view",
        "change",
        "hyman",
        "insists",
        "relative",
        "mean",
        "subjective",
        "object",
        "occlusion",
        "shape",
        "merely",
        "feature",
        "viewer",
        "experience",
        "belongs",
        "optic",
        "psychology",
        "cf",
        "peacocke",
        "hyman",
        "shapeprinciple",
        "shape",
        "region",
        "picture",
        "surface",
        "case",
        "anamorphic",
        "picture",
        "occlusion",
        "shape",
        "relative",
        "intended",
        "point",
        "view",
        "spectator",
        "identical",
        "occlusion",
        "shape",
        "object",
        "represents",
        "relative",
        "implicit",
        "point",
        "view",
        "word",
        "exact",
        "resemblance",
        "shape",
        "according",
        "hyman",
        "principle",
        "capture",
        "exact",
        "relationship",
        "mark",
        "picture",
        "surface",
        "picture",
        "sense",
        "depend",
        "artist",
        "intention",
        "picture",
        "psychological",
        "effect",
        "spectator",
        "applies",
        "picture",
        "regardless",
        "style",
        "artistic",
        "tradition",
        "belong",
        "together",
        "principle",
        "concerning",
        "colour",
        "supposed",
        "explain",
        "colour",
        "shape",
        "surface",
        "picture",
        "fix",
        "colour",
        "shape",
        "object",
        "depicts",
        "hyman",
        "optical",
        "principle",
        "imply",
        "portrait",
        "tolstoy",
        "resembles",
        "tolstoy",
        "since",
        "concerned",
        "picture",
        "sense",
        "opposed",
        "reference",
        "imply",
        "painting",
        "bearded",
        "man",
        "resembles",
        "bearded",
        "man",
        "since",
        "concerned",
        "shape",
        "colour",
        "object",
        "picture",
        "hyman",
        "therefore",
        "claim",
        "theory",
        "dovetail",
        "neatly",
        "idea",
        "picture",
        "reference",
        "normally",
        "determined",
        "artist",
        "intention",
        "idea",
        "depiction",
        "object",
        "specific",
        "kind",
        "men",
        "horse",
        "depends",
        "picture",
        "propensity",
        "trigger",
        "spectator",
        "ability",
        "recognize",
        "kind",
        "object",
        "shape",
        "colour",
        "shape",
        "colour",
        "part",
        "see",
        "explains",
        "two",
        "element",
        "theory",
        "depiction",
        "combined",
        "example",
        "silhouette",
        "black",
        "shape",
        "silhouettist",
        "cut",
        "fix",
        "occlusion",
        "shape",
        "object",
        "represented",
        "part",
        "relative",
        "implicit",
        "line",
        "sight",
        "spectator",
        "ability",
        "recognize",
        "say",
        "girl",
        "cat",
        "enables",
        "see",
        "girl",
        "cat",
        "depicted",
        "silhouette",
        "seeing",
        "occlusion",
        "shape",
        "occlusion",
        "shape",
        "part",
        "hyman",
        "theory",
        "criticised",
        "various",
        "ground",
        "first",
        "generally",
        "michael",
        "podro",
        "argues",
        "express",
        "bias",
        "favour",
        "realistic",
        "literal",
        "representation",
        "podro",
        "however",
        "hyman",
        "reply",
        "optical",
        "principle",
        "defines",
        "dictate",
        "limit",
        "form",
        "artist",
        "create",
        "model",
        "follow",
        "value",
        "embody",
        "work",
        "english",
        "grammar",
        "limit",
        "imagination",
        "english",
        "poet",
        "hyman",
        "second",
        "alleged",
        "hyman",
        "theory",
        "explain",
        "depiction",
        "nonexistent",
        "object",
        "abell",
        "however",
        "objection",
        "depends",
        "questionable",
        "assumption",
        "resemblance",
        "invariably",
        "relation",
        "existing",
        "particular",
        "see",
        "third",
        "argued",
        "indeterminacy",
        "occlusion",
        "shape",
        "object",
        "represented",
        "picture",
        "may",
        "match",
        "indeterminacy",
        "shape",
        "part",
        "picture",
        "depict",
        "kulvicki",
        "finally",
        "argued",
        "generally",
        "exact",
        "correspondence",
        "shape",
        "colour",
        "surface",
        "picture",
        "content",
        "hyman",
        "theory",
        "predicts",
        "sometimes",
        "break",
        "correspondence",
        "exist",
        "depend",
        "contingent",
        "feature",
        "human",
        "visual",
        "system",
        "newall",
        "hyman",
        "newall",
        "last",
        "objection",
        "reflects",
        "widely",
        "accepted",
        "reason",
        "rejecting",
        "resemblance",
        "theory",
        "hyman",
        "basic",
        "mechanism",
        "depiction",
        "defined",
        "without",
        "reference",
        "either",
        "visual",
        "experience",
        "spectator",
        "changing",
        "cultural",
        "context",
        "picture",
        "made",
        "catharine",
        "abell",
        "defended",
        "resemblance",
        "theory",
        "depiction",
        "differs",
        "hyman",
        "respect",
        "designed",
        "avoid",
        "objection",
        "mentioned",
        "also",
        "ambitious",
        "theory",
        "abell",
        "distinguish",
        "sense",
        "reference",
        "picture",
        "aim",
        "explain",
        "explains",
        "depiction",
        "specific",
        "kind",
        "object",
        "men",
        "horse",
        "term",
        "resemblance",
        "instead",
        "confining",
        "scope",
        "theory",
        "shape",
        "colour",
        "object",
        "picture",
        "unlike",
        "hyman",
        "abell",
        "specify",
        "particular",
        "respect",
        "resemblance",
        "necessary",
        "depiction",
        "beyond",
        "requirement",
        "visible",
        "arguing",
        "instead",
        "different",
        "respect",
        "resemblance",
        "govern",
        "different",
        "instance",
        "depiction",
        "including",
        "resemblance",
        "respect",
        "optical",
        "property",
        "occlusion",
        "shape",
        "responsedependent",
        "property",
        "painter",
        "mimic",
        "effect",
        "simultaneous",
        "contrast",
        "drawing",
        "paul",
        "grice",
        "seminal",
        "article",
        "meaning",
        "grice",
        "abell",
        "argues",
        "respect",
        "resemblance",
        "governing",
        "particular",
        "picture",
        "depend",
        "artist",
        "communicative",
        "intention",
        "picture",
        "resemblance",
        "object",
        "given",
        "respect",
        "relevant",
        "determining",
        "picture",
        "depicts",
        "maker",
        "intended",
        "picture",
        "resemble",
        "relevant",
        "respect",
        "thus",
        "bring",
        "viewer",
        "mind",
        "intended",
        "resemblance",
        "effect",
        "part",
        "viewer",
        "recognize",
        "intention",
        "cf",
        "blumson",
        "according",
        "abell",
        "picture",
        "depicts",
        "object",
        "resembles",
        "range",
        "relevant",
        "respect",
        "thereby",
        "capture",
        "overall",
        "appearance",
        "enabling",
        "spectator",
        "distinguish",
        "object",
        "would",
        "ordinarily",
        "mistaken",
        "noted",
        "abell",
        "regard",
        "picture",
        "object",
        "actually",
        "exist",
        "problematic",
        "resemblance",
        "theory",
        "depiction",
        "solution",
        "problem",
        "combine",
        "two",
        "idea",
        "first",
        "picture",
        "object",
        "actually",
        "exist",
        "could",
        "exist",
        "gold",
        "mountain",
        "would",
        "resemble",
        "object",
        "exist",
        "second",
        "makebelieve",
        "fictional",
        "character",
        "sherlock",
        "holmes",
        "exists",
        "makebelieve",
        "picture",
        "resembles",
        "abell",
        "argues",
        "specify",
        "particular",
        "respect",
        "resemblance",
        "necessary",
        "depiction",
        "theory",
        "consistent",
        "diversity",
        "constraint",
        "word",
        "accommodates",
        "wide",
        "variety",
        "stylistic",
        "convention",
        "developed",
        "different",
        "artistic",
        "tradition",
        "however",
        "objected",
        "fails",
        "accommodate",
        "another",
        "alleged",
        "constraint",
        "adequate",
        "resemblance",
        "theory",
        "depiction",
        "identified",
        "lope",
        "call",
        "independence",
        "constraint",
        "according",
        "lope",
        "spectator",
        "must",
        "able",
        "perceive",
        "resemblance",
        "postulated",
        "resemblance",
        "theory",
        "depiction",
        "without",
        "first",
        "knowing",
        "picture",
        "represents",
        "lope",
        "a",
        "fact",
        "objection",
        "applies",
        "theory",
        "implies",
        "spectator",
        "perceives",
        "certain",
        "kind",
        "object",
        "picture",
        "perceiving",
        "resemblance",
        "mark",
        "surface",
        "object",
        "kind",
        "resemblance",
        "theory",
        "need",
        "implication",
        "however",
        "abell",
        "accepts",
        "objection",
        "applies",
        "theory",
        "especially",
        "since",
        "hold",
        "respect",
        "resemblance",
        "govern",
        "picture",
        "depend",
        "artist",
        "communicative",
        "intention",
        "spectator",
        "knowledge",
        "intention",
        "gained",
        "least",
        "part",
        "picture",
        "however",
        "address",
        "objection",
        "highlighting",
        "alternative",
        "contextspecific",
        "source",
        "information",
        "abell",
        "cf",
        "blumson"
    ]
}