{
    "main_text": "Elaboration of the Basic Argumentation: The Worst and Hospitality\n5. Deconstruction\n\nAs we said at the beginning, “deconstruction” is the most\nfamous of Derrida’s terms. He seems to have appropriated the\nterm from Heidegger’s use of “destruction” in\nBeing and Time. But we can get a general sense of what\nDerrida means with deconstruction by recalling Descartes’s First\nMeditation. There Descartes says that for a long time he has been\nmaking mistakes. The criticism of his former beliefs both mistaken and\nvalid aims towards uncovering a “firm and permanent\nfoundation.” The image of a foundation implies that the\ncollection of his former beliefs resembles a building. In the First\nMeditation then, Descartes is in effect taking down this old building,\n“de-constructing” it. We have also seen how much Derrida\nis indebted to traditional transcendental philosophy which really\nstarts here with Descartes’ search for a “firm and\npermanent foundation.” But with Derrida, we know now, the\nfoundation is not a unified self but a divisible limit between myself\nand myself as an other (auto-affection as hetero-affection:\n“origin-heterogeneous”).\n\nDerrida has provided many definitions of deconstruction. But three\ndefinitions are classical. The first is early, being found in\nthe 1971 interview “Positions” and in the 1972 Preface to\nDissemination: deconstruction consists in “two\nphases” (Positions, pp. 41–42,\nDissemination, pp.4–6). At this stage of his career\nDerrida speaks of “metaphysics” as if the Western\nphilosophical tradition was monolithic and homogeneous. At times he\nalso speaks of “Platonism,” as Nietzsche did. Simply,\ndeconstruction is a criticism of Platonism, which is defined by the\nbelief that existence is structured in terms of oppositions (separate\nsubstances or forms) and that the oppositions are hierarchical, with\none side of the opposition being more valuable than the other. The\nfirst phase of deconstruction attacks this belief by\nreversing the Platonistic hierarchies: the hierarchies\nbetween the invisible or intelligible and the visible or sensible;\nbetween essence and appearance; between the soul and body; between\nliving memory and rote memory; between mnēmē and\nhypomnēsis; between voice and writing; between finally\ngood and evil. In order to clarify deconstruction’s “two\nphases,” let us restrict ourselves to one specific opposition,\nthe opposition between appearance and essence. Prior to Derrida,\nNietzsche had also criticized this opposition, and it is criticized in\na lot of Twentieth Century philosophy. So, in Platonism, essence is\nmore valuable than appearance. In deconstruction however, we reverse\nthis, making appearance more valuable than essence. How? Here we could\nresort to empiricist arguments (in Hume for example) that show that\nall knowledge of what we call essence depends on the experience of\nwhat appears. But then, this argumentation would imply that essence\nand appearance are not related to one another as separate oppositional\npoles. The argumentation in other words would show us that essence can\nbe reduced down to a variation of appearances (involving the roles of\nmemory and anticipation). The reduction is a reduction to what we can\ncall “immanence,” which carries the sense of\n“within” or “in.” So, we would say that what\nwe used to call essence is found in appearance, essence is\nmixed into appearance. Now, we can back track a bit in the\nhistory of Western metaphysics. On the basis of the reversal of the\nessence-appearance hierarchy and on the basis of the reduction to\nimmanence, we can see that something like a decision (a perhaps\nimpossible decision) must have been made at the beginning of the\nmetaphysical tradition, a decision that instituted the hierarchy of\nessence-appearance and separated essence from appearance. This\ndecision is what really defines Platonism or\n“metaphysics.” After this retrospection, we can turn now\nto a second step in the reversal-reduction of Platonism, which is the\nsecond “phase” of deconstruction. The previously inferior\nterm must be re-inscribed as the “origin” or\n“resource” of the opposition and hierarchy itself. How\nwould this re-inscription or redefinition of appearance work? Here we\nwould have to return to the idea that every appearance or every\nexperience is temporal. In the experience of the present, there is\nalways a small difference between the moment of now-ness and the past\nand the future. (It is perhaps possible that Hume had already\ndiscovered this small difference when, in the Treatise, he\nspeaks of the idea of relation.) In any case, this infinitesimal\ndifference is not only a difference that is non-dualistic, but also it\nis a difference that is, as Derrida would say,\n“undecidable.” Although the minuscule difference is\nvirtually unnoticeable in everyday common experience, when we in fact\nnotice it, we cannot decide if we are experiencing a memory\nor a present perception, if we are experiencing a present perception\nor an anticipation. (Bergson makes a similar claim in his\n“Memory of the Present and False Recognition”\n[Mind-Energy, pp. 109–151] and Deleuze extends\nBergson’s insight in his “The Actual and the\nVirtual” [Dialogues, pp. 148–152].) When we\nnotice the difference, we are indeed experiencing the present, but the\npresent is recognized as “contaminated” by the past and\nfuture. Insofar as the difference is undecidable (perception –\nwhat we see right now – contaminated with memory or the present\ncontaminated with the past: the experienced difference is an\nexperience of what Derrida would call the “trace”), the\ndifference destabilizes the original decision that instituted the\nhierarchy. After the redefinition of the previously inferior term,\nDerrida usually changes the term’s orthography, for example,\nwriting “différence” with an “a” as\n“différance” in order to indicate the\nchange in its status. Différance (which is found in appearances\nwhen we recognize their temporal nature) then refers to the\nundecidable resource into which “metaphysics”\n“cut” in order to makes its decision. In\n“Positions,” Derrida calls names like\n“différance” “old names” or\n“paleonyms,” and there he also provides a list of these\n“old terms”: “pharmakon”;\n“supplement”; “trace”; “hymen”;\n“gram”; “spacing”; and “incision”\n(Positions, p. 43). These names are old because, like the\nword “appearance” or the word “difference,”\nthey have been used for centuries in the history of Western philosophy\nto refer to the inferior position in hierarchies. But now, they are\nbeing used to refer to the resource that has never had a name in\n“metaphysics”; they are being used to refer to the\nresource that is indeed “older” than the metaphysical\ndecision.\n\nThis first definition of deconstruction as two phases gives way to the\nrefinement we find in the “Force of Law” (which dates from\n1989–1990). This second definition is less metaphysical\nand more political. In “Force of Law,” Derrida says that\ndeconstruction is practiced in two styles (Deconstruction and the\nPossibility of Justice, p. 21). These “two styles” do\nnot correspond to the “two phases” in the earlier\ndefinition of deconstruction. On the one hand, there is the\ngenealogical style of deconstruction, which recalls the history of a\nconcept or theme. Earlier in his career, in Of Grammatology,\nDerrida had laid out, for example, the history of the concept of\nwriting. But now what is at issue is the history of justice. On the\nother hand, there is the more formalistic or structural style of\ndeconstruction, which examines a-historical paradoxes or aporias. In\n“Force of Law,” Derrida lays out three aporias, although\nthey all seem to be variants of one, an aporia concerning the unstable\nrelation between law (the French term is “droit,” which\nalso means “right”) and justice.\n\nDerrida calls the first aporia, “the epoche of\nthe rule” (Deconstruction and the Possibility of\nJustice, pp. 22–23). Our most common axiom in ethical or\npolitical thought is that to be just or unjust and to exercise\njustice, one must be free and responsible for one’s actions and\ndecisions. Here Derrida in effect is asking: what is freedom. On the\none hand, freedom consists in following a rule; but in the case of\njustice, we would say that a judgment that simply followed the law was\nonly right, not just. For a decision to be just, not only must a judge\nfollow a rule but also he or she must “re-institute” it,\nin a new judgment. Thus a decision aiming at justice (a free decision)\nis both regulated and unregulated. The law must be conserved and also\ndestroyed or suspended, suspension being the meaning of the\nword “epoche.” Each case is other, each decision is\ndifferent and requires an absolutely unique interpretation which no\nexisting coded rule can or ought to guarantee. If a judge\nprogrammatically follows a code, he or she is a “calculating\nmachine.” Strict calculation or arbitrariness, one or the other\nis unjust, but they are both involved; thus, in the present, we cannot\nsay that a judgment, a decision is just, purely just. For Derrida, the\n“re-institution” of the law in a unique decision is a kind\nof violence since it does not conform perfectly to the instituted\ncodes; the law is always, according to Derrida, founded in violence.\nThe violent re-institution of the law means that justice is\nimpossible. Derrida calls the second aporia “the ghost\nof the undecidable” (Deconstruction and the Possibility of\nJustice, pp. 24–26). A decision begins with the initiative\nto read, to interpret, and even to calculate. But to make such a\ndecision, one must first of all experience what Derrida calls\n“undecidability.” One must experience that the case, being\nunique and singular, does not fit the established codes and therefore\na decision about it seems to be impossible. The undecidable, for\nDerrida, is not mere oscillation between two significations. It is the\nexperience of what, though foreign to the calculable and the rule, is\nstill obligated. We are obligated – this is a kind of\nduty—to give oneself up to the impossible decision, while taking\naccount of rules and law. As Derrida says, “A decision that did\nnot go through the ordeal of the undecidable would not be a free\ndecision, it would only be the programmable application or unfolding\nof a calculable process” (Deconstruction and the Possibility\nof Justice, p. 24). And once the ordeal is past (“if this\never happens,” as Derrida says), then the decision has again\nfollowed or given itself a rule and is no longer presently just.\nJustice therefore is always to come in the future, it is never\npresent. There is apparently no moment during which a decision could\nbe called presently and fully just. Either it has not followed a rule,\nhence it is unjust; or it has followed a rule, which has no\nfoundation, which makes it again unjust; or if it did follow\na rule, it was calculated and again unjust since it did not\nrespect the singularity of the case. This relentless injustice is why\nthe ordeal of the undecidable is never past. It keeps coming back like\na “phantom,” which “deconstructs from the inside\nevery assurance of presence, and thus every criteriology that would\nassure us of the justice of the decision” (Deconstruction\nand the Possibility of Justice, pp. 24–25). Even though\njustice is impossible and therefore always to come in or from the\nfuture, justice is not, for Derrida, a Kantian ideal, which brings us\nto the third aporia. The third is called “the urgency\nthat obstructs the horizon of knowledge” (Deconstruction and\nthe Possibility of Justice, pp. 26–28). Derrida stresses\nthe Greek etymology of the word “horizon”: “As its\nGreek name suggests, a horizon is both the opening and limit that\ndefines an infinite progress or a period of waiting.” Justice,\nhowever, even though it is un-presentable, does not wait. A just\ndecision is always required immediately. It cannot furnish itself with\nunlimited knowledge. The moment of decision itself remains a finite\nmoment of urgency and precipitation. The instant of decision is then\nthe moment of madness, acting in the night of non-knowledge and\nnon-rule. Once again we have a moment of irruptive violence. This\nurgency is why justice has no horizon of expectation (either\nregulative or messianic). Justice remains an event yet to come.\nPerhaps one must always say “can-be” (the French word for\n“perhaps” is “peut-être,” which\nliterally means “can be”) for justice. This ability for\njustice aims however towards what is impossible.\n\nEven later in Derrida’s career he will formalize, beyond these\naporias, the nature of deconstruction. The third definition of\ndeconstruction can be found in an essay from 2000 called “Et\nCetera.” Here Derrida in fact presents the principle that\ndefines deconstruction:\n\nEach time that I say ‘deconstruction and X (regardless of the\nconcept or the theme),’ this is the prelude to a very singular\ndivision that turns this X into, or rather makes appear in this X,\nan impossibility that becomes its proper and sole\npossibility, with the result that between the X as possible and the\n‘same’ X as impossible, there is nothing but a relation of\nhomonymy, a relation for which we have to provide an account….\nFor example, here referring myself to demonstrations I have already\nattempted …, gift, hospitality, death itself (and therefore so\nmany other things) can be possible only as impossible, as the\nim-possible, that is, unconditionally (Deconstructions: a\nUser’s Guide, p. 300, my emphasis).\n\n\nEven though the word “deconstruction” has been bandied\nabout, we can see now the kind of thinking in which deconstruction\nengages. It is a kind of thinking that never finds itself at the end.\nJustice – this is undeniable – is impossible (perhaps\njustice is the “impossible”) and therefore it is necessary\nto make justice possible in countless ways.\n\nFinally, with the publication of the death penalty lectures, we have\nanother definition of deconstruct, one also dating from 2000 (lecture\ndated March 1/8, 2000). Here is what Derrida says:\n\nTo deconstruct death, then, that is the subject, while recalling that\nwe do not know what it is, if and when it happens, and to whom. ...\nThe dream of deconstruction, a convulsive movement to have done with\ndeath itself. Not to put into question again the question, what is\ndeath? when and where does it take place? etc. What comes afterward?\nand so forth. But to deconstruct death. Final period. And with the\nsame blow, to come to blows with death and put it out of action. No\nless than that. Death to death (The Death Penalty (Volume 1),\npp. 240–241).\n\n\n“No less than that. Death to death”: This shows us that\nperhaps even more than justice deconstruction values (if we can speak\nof a moral value) life more than anything else. But, this life is not\nunscathed; it is life in its irreducible connection to death. Thus\nwhat deconstruction values is survival.\n",
    "section_title": "5. Deconstruction",
    "entry_title": "Jacques Derrida",
    "hierarchy_title": "Jacques Derrida || Elaboration of the Basic Argumentation: The Worst and Hospitality",
    "tokenized_text": [
        "elaboration",
        "basic",
        "argumentation",
        "worst",
        "hospitality",
        "deconstruction",
        "said",
        "beginning",
        "deconstruction",
        "famous",
        "derrida",
        "term",
        "seems",
        "appropriated",
        "term",
        "heidegger",
        "use",
        "destruction",
        "time",
        "get",
        "general",
        "sense",
        "derrida",
        "mean",
        "deconstruction",
        "recalling",
        "descartes",
        "first",
        "meditation",
        "descartes",
        "say",
        "long",
        "time",
        "making",
        "mistake",
        "criticism",
        "former",
        "belief",
        "mistaken",
        "valid",
        "aim",
        "towards",
        "uncovering",
        "firm",
        "permanent",
        "foundation",
        "image",
        "foundation",
        "implies",
        "collection",
        "former",
        "belief",
        "resembles",
        "building",
        "first",
        "meditation",
        "descartes",
        "effect",
        "taking",
        "old",
        "building",
        "deconstructing",
        "also",
        "seen",
        "much",
        "derrida",
        "indebted",
        "traditional",
        "transcendental",
        "philosophy",
        "really",
        "start",
        "descartes",
        "search",
        "firm",
        "permanent",
        "foundation",
        "derrida",
        "know",
        "foundation",
        "unified",
        "self",
        "divisible",
        "limit",
        "autoaffection",
        "heteroaffection",
        "originheterogeneous",
        "derrida",
        "provided",
        "many",
        "definition",
        "deconstruction",
        "three",
        "definition",
        "classical",
        "first",
        "early",
        "found",
        "interview",
        "position",
        "preface",
        "dissemination",
        "deconstruction",
        "consists",
        "two",
        "phase",
        "position",
        "pp",
        "dissemination",
        "pp",
        "stage",
        "career",
        "derrida",
        "speaks",
        "metaphysics",
        "western",
        "philosophical",
        "tradition",
        "monolithic",
        "homogeneous",
        "time",
        "also",
        "speaks",
        "platonism",
        "nietzsche",
        "simply",
        "deconstruction",
        "criticism",
        "platonism",
        "defined",
        "belief",
        "existence",
        "structured",
        "term",
        "opposition",
        "separate",
        "substance",
        "form",
        "opposition",
        "hierarchical",
        "one",
        "side",
        "opposition",
        "valuable",
        "first",
        "phase",
        "deconstruction",
        "attack",
        "belief",
        "reversing",
        "platonistic",
        "hierarchy",
        "hierarchy",
        "invisible",
        "intelligible",
        "visible",
        "sensible",
        "essence",
        "appearance",
        "soul",
        "body",
        "living",
        "memory",
        "rote",
        "memory",
        "mnēmē",
        "hypomnēsis",
        "voice",
        "writing",
        "finally",
        "good",
        "evil",
        "order",
        "clarify",
        "deconstruction",
        "two",
        "phase",
        "let",
        "u",
        "restrict",
        "one",
        "specific",
        "opposition",
        "opposition",
        "appearance",
        "essence",
        "prior",
        "derrida",
        "nietzsche",
        "also",
        "criticized",
        "opposition",
        "criticized",
        "lot",
        "twentieth",
        "century",
        "philosophy",
        "platonism",
        "essence",
        "valuable",
        "appearance",
        "deconstruction",
        "however",
        "reverse",
        "making",
        "appearance",
        "valuable",
        "essence",
        "could",
        "resort",
        "empiricist",
        "argument",
        "hume",
        "example",
        "show",
        "knowledge",
        "call",
        "essence",
        "depends",
        "experience",
        "appears",
        "argumentation",
        "would",
        "imply",
        "essence",
        "appearance",
        "related",
        "one",
        "another",
        "separate",
        "oppositional",
        "pole",
        "argumentation",
        "word",
        "would",
        "show",
        "u",
        "essence",
        "reduced",
        "variation",
        "appearance",
        "involving",
        "role",
        "memory",
        "anticipation",
        "reduction",
        "reduction",
        "call",
        "immanence",
        "carry",
        "sense",
        "within",
        "in",
        "would",
        "say",
        "used",
        "call",
        "essence",
        "found",
        "appearance",
        "essence",
        "mixed",
        "appearance",
        "back",
        "track",
        "bit",
        "history",
        "western",
        "metaphysics",
        "basis",
        "reversal",
        "essenceappearance",
        "hierarchy",
        "basis",
        "reduction",
        "immanence",
        "see",
        "something",
        "like",
        "decision",
        "perhaps",
        "impossible",
        "decision",
        "must",
        "made",
        "beginning",
        "metaphysical",
        "tradition",
        "decision",
        "instituted",
        "hierarchy",
        "essenceappearance",
        "separated",
        "essence",
        "appearance",
        "decision",
        "really",
        "defines",
        "platonism",
        "metaphysics",
        "retrospection",
        "turn",
        "second",
        "step",
        "reversalreduction",
        "platonism",
        "second",
        "phase",
        "deconstruction",
        "previously",
        "inferior",
        "term",
        "must",
        "reinscribed",
        "origin",
        "resource",
        "opposition",
        "hierarchy",
        "would",
        "reinscription",
        "redefinition",
        "appearance",
        "work",
        "would",
        "return",
        "idea",
        "every",
        "appearance",
        "every",
        "experience",
        "temporal",
        "experience",
        "present",
        "always",
        "small",
        "difference",
        "moment",
        "nowness",
        "past",
        "future",
        "perhaps",
        "possible",
        "hume",
        "already",
        "discovered",
        "small",
        "difference",
        "treatise",
        "speaks",
        "idea",
        "relation",
        "case",
        "infinitesimal",
        "difference",
        "difference",
        "nondualistic",
        "also",
        "difference",
        "derrida",
        "would",
        "say",
        "undecidable",
        "although",
        "minuscule",
        "difference",
        "virtually",
        "unnoticeable",
        "everyday",
        "common",
        "experience",
        "fact",
        "notice",
        "decide",
        "experiencing",
        "memory",
        "present",
        "perception",
        "experiencing",
        "present",
        "perception",
        "anticipation",
        "bergson",
        "make",
        "similar",
        "claim",
        "memory",
        "present",
        "false",
        "recognition",
        "mindenergy",
        "pp",
        "deleuze",
        "extends",
        "bergson",
        "insight",
        "actual",
        "virtual",
        "dialogue",
        "pp",
        "notice",
        "difference",
        "indeed",
        "experiencing",
        "present",
        "present",
        "recognized",
        "contaminated",
        "past",
        "future",
        "insofar",
        "difference",
        "undecidable",
        "perception",
        "see",
        "right",
        "contaminated",
        "memory",
        "present",
        "contaminated",
        "past",
        "experienced",
        "difference",
        "experience",
        "derrida",
        "would",
        "call",
        "trace",
        "difference",
        "destabilizes",
        "original",
        "decision",
        "instituted",
        "hierarchy",
        "redefinition",
        "previously",
        "inferior",
        "term",
        "derrida",
        "usually",
        "change",
        "term",
        "orthography",
        "example",
        "writing",
        "différence",
        "différance",
        "order",
        "indicate",
        "change",
        "status",
        "différance",
        "found",
        "appearance",
        "recognize",
        "temporal",
        "nature",
        "refers",
        "undecidable",
        "resource",
        "metaphysics",
        "cut",
        "order",
        "make",
        "decision",
        "position",
        "derrida",
        "call",
        "name",
        "like",
        "différance",
        "old",
        "name",
        "paleonyms",
        "also",
        "provides",
        "list",
        "old",
        "term",
        "pharmakon",
        "supplement",
        "trace",
        "hymen",
        "gram",
        "spacing",
        "incision",
        "position",
        "p",
        "name",
        "old",
        "like",
        "word",
        "appearance",
        "word",
        "difference",
        "used",
        "century",
        "history",
        "western",
        "philosophy",
        "refer",
        "inferior",
        "position",
        "hierarchy",
        "used",
        "refer",
        "resource",
        "never",
        "name",
        "metaphysics",
        "used",
        "refer",
        "resource",
        "indeed",
        "older",
        "metaphysical",
        "decision",
        "first",
        "definition",
        "deconstruction",
        "two",
        "phase",
        "give",
        "way",
        "refinement",
        "find",
        "force",
        "law",
        "date",
        "second",
        "definition",
        "le",
        "metaphysical",
        "political",
        "force",
        "law",
        "derrida",
        "say",
        "deconstruction",
        "practiced",
        "two",
        "style",
        "deconstruction",
        "possibility",
        "justice",
        "p",
        "two",
        "style",
        "correspond",
        "two",
        "phase",
        "earlier",
        "definition",
        "deconstruction",
        "one",
        "hand",
        "genealogical",
        "style",
        "deconstruction",
        "recall",
        "history",
        "concept",
        "theme",
        "earlier",
        "career",
        "grammatology",
        "derrida",
        "laid",
        "example",
        "history",
        "concept",
        "writing",
        "issue",
        "history",
        "justice",
        "hand",
        "formalistic",
        "structural",
        "style",
        "deconstruction",
        "examines",
        "ahistorical",
        "paradox",
        "aporias",
        "force",
        "law",
        "derrida",
        "lay",
        "three",
        "aporias",
        "although",
        "seem",
        "variant",
        "one",
        "aporia",
        "concerning",
        "unstable",
        "relation",
        "law",
        "french",
        "term",
        "droit",
        "also",
        "mean",
        "right",
        "justice",
        "derrida",
        "call",
        "first",
        "aporia",
        "epoche",
        "rule",
        "deconstruction",
        "possibility",
        "justice",
        "pp",
        "common",
        "axiom",
        "ethical",
        "political",
        "thought",
        "unjust",
        "exercise",
        "justice",
        "one",
        "must",
        "free",
        "responsible",
        "one",
        "action",
        "decision",
        "derrida",
        "effect",
        "asking",
        "freedom",
        "one",
        "hand",
        "freedom",
        "consists",
        "following",
        "rule",
        "case",
        "justice",
        "would",
        "say",
        "judgment",
        "simply",
        "followed",
        "law",
        "right",
        "decision",
        "must",
        "judge",
        "follow",
        "rule",
        "also",
        "must",
        "reinstitute",
        "new",
        "judgment",
        "thus",
        "decision",
        "aiming",
        "justice",
        "free",
        "decision",
        "regulated",
        "unregulated",
        "law",
        "must",
        "conserved",
        "also",
        "destroyed",
        "suspended",
        "suspension",
        "meaning",
        "word",
        "epoche",
        "case",
        "decision",
        "different",
        "requires",
        "absolutely",
        "unique",
        "interpretation",
        "existing",
        "coded",
        "rule",
        "ought",
        "guarantee",
        "judge",
        "programmatically",
        "follows",
        "code",
        "calculating",
        "machine",
        "strict",
        "calculation",
        "arbitrariness",
        "one",
        "unjust",
        "involved",
        "thus",
        "present",
        "say",
        "judgment",
        "decision",
        "purely",
        "derrida",
        "reinstitution",
        "law",
        "unique",
        "decision",
        "kind",
        "violence",
        "since",
        "conform",
        "perfectly",
        "instituted",
        "code",
        "law",
        "always",
        "according",
        "derrida",
        "founded",
        "violence",
        "violent",
        "reinstitution",
        "law",
        "mean",
        "justice",
        "impossible",
        "derrida",
        "call",
        "second",
        "aporia",
        "ghost",
        "undecidable",
        "deconstruction",
        "possibility",
        "justice",
        "pp",
        "decision",
        "begin",
        "initiative",
        "read",
        "interpret",
        "even",
        "calculate",
        "make",
        "decision",
        "one",
        "must",
        "first",
        "experience",
        "derrida",
        "call",
        "undecidability",
        "one",
        "must",
        "experience",
        "case",
        "unique",
        "singular",
        "fit",
        "established",
        "code",
        "therefore",
        "decision",
        "seems",
        "impossible",
        "undecidable",
        "derrida",
        "mere",
        "oscillation",
        "two",
        "signification",
        "experience",
        "though",
        "foreign",
        "calculable",
        "rule",
        "still",
        "obligated",
        "obligated",
        "kind",
        "dutyto",
        "give",
        "oneself",
        "impossible",
        "decision",
        "taking",
        "account",
        "rule",
        "law",
        "derrida",
        "say",
        "decision",
        "go",
        "ordeal",
        "undecidable",
        "would",
        "free",
        "decision",
        "would",
        "programmable",
        "application",
        "unfolding",
        "calculable",
        "process",
        "deconstruction",
        "possibility",
        "justice",
        "p",
        "ordeal",
        "past",
        "ever",
        "happens",
        "derrida",
        "say",
        "decision",
        "followed",
        "given",
        "rule",
        "longer",
        "presently",
        "justice",
        "therefore",
        "always",
        "come",
        "future",
        "never",
        "present",
        "apparently",
        "moment",
        "decision",
        "could",
        "called",
        "presently",
        "fully",
        "either",
        "followed",
        "rule",
        "hence",
        "unjust",
        "followed",
        "rule",
        "foundation",
        "make",
        "unjust",
        "follow",
        "rule",
        "calculated",
        "unjust",
        "since",
        "respect",
        "singularity",
        "case",
        "relentless",
        "injustice",
        "ordeal",
        "undecidable",
        "never",
        "past",
        "keep",
        "coming",
        "back",
        "like",
        "phantom",
        "deconstructs",
        "inside",
        "every",
        "assurance",
        "presence",
        "thus",
        "every",
        "criteriology",
        "would",
        "assure",
        "u",
        "justice",
        "decision",
        "deconstruction",
        "possibility",
        "justice",
        "pp",
        "even",
        "though",
        "justice",
        "impossible",
        "therefore",
        "always",
        "come",
        "future",
        "justice",
        "derrida",
        "kantian",
        "ideal",
        "brings",
        "u",
        "third",
        "aporia",
        "third",
        "called",
        "urgency",
        "obstructs",
        "horizon",
        "knowledge",
        "deconstruction",
        "possibility",
        "justice",
        "pp",
        "derrida",
        "stress",
        "greek",
        "etymology",
        "word",
        "horizon",
        "greek",
        "name",
        "suggests",
        "horizon",
        "opening",
        "limit",
        "defines",
        "infinite",
        "progress",
        "period",
        "waiting",
        "justice",
        "however",
        "even",
        "though",
        "unpresentable",
        "wait",
        "decision",
        "always",
        "required",
        "immediately",
        "furnish",
        "unlimited",
        "knowledge",
        "moment",
        "decision",
        "remains",
        "finite",
        "moment",
        "urgency",
        "precipitation",
        "instant",
        "decision",
        "moment",
        "madness",
        "acting",
        "night",
        "nonknowledge",
        "nonrule",
        "moment",
        "irruptive",
        "violence",
        "urgency",
        "justice",
        "horizon",
        "expectation",
        "either",
        "regulative",
        "messianic",
        "justice",
        "remains",
        "event",
        "yet",
        "come",
        "perhaps",
        "one",
        "must",
        "always",
        "say",
        "canbe",
        "french",
        "word",
        "perhaps",
        "peutêtre",
        "literally",
        "mean",
        "justice",
        "ability",
        "justice",
        "aim",
        "however",
        "towards",
        "impossible",
        "even",
        "later",
        "derrida",
        "career",
        "formalize",
        "beyond",
        "aporias",
        "nature",
        "deconstruction",
        "third",
        "definition",
        "deconstruction",
        "found",
        "essay",
        "called",
        "et",
        "cetera",
        "derrida",
        "fact",
        "present",
        "principle",
        "defines",
        "deconstruction",
        "time",
        "say",
        "deconstruction",
        "x",
        "regardless",
        "concept",
        "theme",
        "prelude",
        "singular",
        "division",
        "turn",
        "x",
        "rather",
        "make",
        "appear",
        "x",
        "impossibility",
        "becomes",
        "proper",
        "sole",
        "possibility",
        "result",
        "x",
        "possible",
        "x",
        "impossible",
        "nothing",
        "relation",
        "homonymy",
        "relation",
        "provide",
        "account",
        "example",
        "referring",
        "demonstration",
        "already",
        "attempted",
        "gift",
        "hospitality",
        "death",
        "therefore",
        "many",
        "thing",
        "possible",
        "impossible",
        "impossible",
        "unconditionally",
        "deconstruction",
        "user",
        "guide",
        "p",
        "emphasis",
        "even",
        "though",
        "word",
        "deconstruction",
        "bandied",
        "see",
        "kind",
        "thinking",
        "deconstruction",
        "engages",
        "kind",
        "thinking",
        "never",
        "find",
        "end",
        "justice",
        "undeniable",
        "impossible",
        "perhaps",
        "justice",
        "impossible",
        "therefore",
        "necessary",
        "make",
        "justice",
        "possible",
        "countless",
        "way",
        "finally",
        "publication",
        "death",
        "penalty",
        "lecture",
        "another",
        "definition",
        "deconstruct",
        "one",
        "also",
        "dating",
        "lecture",
        "dated",
        "march",
        "derrida",
        "say",
        "deconstruct",
        "death",
        "subject",
        "recalling",
        "know",
        "happens",
        "dream",
        "deconstruction",
        "convulsive",
        "movement",
        "done",
        "death",
        "put",
        "question",
        "question",
        "death",
        "take",
        "place",
        "etc",
        "come",
        "afterward",
        "forth",
        "deconstruct",
        "death",
        "final",
        "period",
        "blow",
        "come",
        "blow",
        "death",
        "put",
        "action",
        "le",
        "death",
        "death",
        "death",
        "penalty",
        "volume",
        "pp",
        "le",
        "death",
        "death",
        "show",
        "u",
        "perhaps",
        "even",
        "justice",
        "deconstruction",
        "value",
        "speak",
        "moral",
        "value",
        "life",
        "anything",
        "else",
        "life",
        "unscathed",
        "life",
        "irreducible",
        "connection",
        "death",
        "thus",
        "deconstruction",
        "value",
        "survival"
    ]
}