{
    "main_text": "Elaboration of the Basic Argumentation: The Worst and Hospitality\n4. Elaboration of the Basic Argumentation: The Worst and Hospitality\n\nThroughout his career, Derrida elaborates on the basic argumentation\nin many ways. But Derrida always uses the argumentation against one\nidea, which Derrida calls “the worst” (le pire).\nWe can extract a definition of the worst from “Faith and\nKnowledge” (Religion, p. 65). It revolves around an\nambiguous phrase “plus d’un,” which could be\ntranslated in English as “more than one,” “more of\none,” or “no more one.” On the one hand, this phrase\nmeans that in auto-affection, even while it is “auto,” the\nsame, there is more than one; immediately with one, there is two, the\nself and other, and others. On the other hand, it means that there is\na lot more of one, only one, the most one. The worst derives from this\nsecond sense of “plus d’un.” The worst is a\nsuperlative; it is the worst violence. Derrida, it seems,\ndistinguishes the worst violence from what Kant had called\n“radical evil.” Radical evil is literally radical, evil at\nthe root. It consists in the small, “infinitesimal\ndifference” (see Of Grammatology, p. 234) between me\nand an other, even between me and an other in me. Derrida would\ndescribe this infinitesimal hiatus as the address, the\n“à” or the “to”; it is not only\ndifference, across the distance of the address, it is also repetition.\nAnd, it is not only a repetition; this self-divergence is also\nviolence, a rending of oneself, an incision. Derrida’s\nappropriation of Kant’s idea of radical evil has led certain\ncommentators to stress a kind of fundamental atheism in Derrida\ndespite the fact that he seems very interested in religion and faith\n(see Hägglund, 2008, pp. 112–113; for an opposing\nviewpoint, see Caputo, 1999, p. 312). Despite this controversy around\nDerrida’s alleged theism or atheism, it looks as though, for\nhim, radical evil is not absolute evil (see Philosophy in a Time\nof Terror, p. 99). The worst violence occurs when the\nother to which one is related is completely appropriated to\nor completely in one’s self, when an address reaches\nits proper destination, when it reaches only its\nproper destination. Reaching only its proper destination, the\naddress will exclude more, many more, and that “many\nmore,” at the limit, amounts to all. It is this\ncomplete exclusion or this extermination of the most\n– there is no limit to this violence—that makes this\nviolence the worst violence. The worst is a relation that makes of\nmore than one simply one, that makes, out of a division, an\nindivisible sovereignty. We can see again that the worst resembles the\n“pure actuality” of Aristotle’s Prime Mover, the One\nGod: the sphere, or better, the globe of thought thinking\nitself (Rogues, p. 15).\n\nWhat we have just laid out is the structure of the worst in\nDerrida’s thinking. But the structure, for Derrida, can always\nhappen as an event. Derrida thinks that today, “in a time of\nterror,” after the end of the Cold War, when globalization is\ntaking place, the fragility of the nation-state is being tested more\nand more. Agencies such as the International Criminal Court, the\ndemand for universal human rights encroach on nation-state\nsovereignty. But the result of this universalization or\n“worlding” (“mondialisation” is the French\nword for globalization) is that the concept of war, and thus of world\nwar, of enemy, and even of terrorism, along with the distinctions\nbetween civilian and military or between army, police, and militia,\nall of these concepts and distinctions are losing their pertinence. As\nDerrida says here in Rogues “what is called September\n11 will not have created or revealed this situation, although it will\nhave surely media-theatricalized it” (Rogues, pp.\n154–55). Now, with globalization, there is no identifiable enemy\nin the form of a “state” territory with whom one (in\nRogues Derrida uses this phrase: “the United States and\nits allies”) would wage what could still be called a\n“war,” even if we think of this as a war on international\nterrorism. The balance of terror of the Cold War that insured that no\nescalation of nuclear weapons would lead to a suicidal operation,\nDerrida says, “all that is over.” Instead, “a new\nviolence is being prepared and in truth has been unleashed for some\ntime now, in a way that is more visibly suicidal or auto-immune than\never. This violence no longer has to do with world war or\neven with war, even less with some right to wage war. And\nthis is hardly re-assuring – indeed, quite the contrary”\n(Rogues, p. 156).\n\nWhat does it mean to be “more suicidal”? To be more\nsuicidal is to kill oneself more. The “more”\nmeans that, since there is only a fragile distinction between states\n(there is no identification of the enemy), one’s state or self\nincludes more and more of the others. But, if one’s self\nincludes others that threaten (so-called “terrorist\ncells,” for example), then, if one wants to immune oneself, then\none must murder more and more of those others that are inside. Since\nthe others are inside one’s state or one’s self,\none is required to kill more and more of oneself. This context is very\ndifferent from the rigid and external opposition, symbolized by the\nso-called “Iron Curtain,” that defined the Cold War. There\nand then, “we” had an identifiable enemy, with a\nname, which allowed the number of the enemies to be limited.\nBut here and now, today, the number of “enemies” is\npotentially unlimited. Every other is wholly other\n(“tout autre est tout autre” [cf. The\nPolitics of Friendship, p. 232]) and thus every single other\nneeds to be rejected by the immune system. This innumerable rejection\nresembles a genocide or what is worse an absolute threat. The absolute\nthreat can no longer be contained when it comes neither from an\nalready constituted state nor even from a potential state that might\nbe treated as a rogue state (Rogues, p. 105). What Derrida is\nsaying here is that the worst is possible, here and now, more\npossible than ever.\n\nAs I said, Derrida always uses the basic argumentation that we have\nlaid out against the idea of the worst; today the tendency towards the\nworst is greater than ever. The purpose in the application –\nthis purpose defines deconstruction—is to move us towards, not\nthe worst violence, not the most violence, but the least violence\n(Writing and Difference, p. 130). How does the application of\nthe argumentation against the worst work? Along with globalization,\nthe post-Cold War period sees, as Derrida says in “Faith and\nKnowledge,” a “return of the religious”\n(Religion, pp. 42–43; see also Caputo 1997, pp.\n152–159). So, in “Faith and Knowledge,” Derrida lays\nout the etymology of the Latin word “religion” (he\nacknowledges that the etymology is problematic). The etymology implies\nthat there are “two sources” of religion:\n“religio,” which implies a holding back or a being\nunscathed, safe and sound; and “re-legere,” which implies\na linking up with another through faith (Religion, p. 16). We\ncan see in this etymology the inseparable dualities we examined above:\nsingular event and machine-like repeatability; auto-affection as\nhetero-affection. Most importantly, Derrida is trying to understand\nthe “link” that defines religion prior to the link between\nman as such and the divinity of God. What we can see in this attempt\nto conceive the link as it is prior to its determination in terms of\nman and God is an attempt to make the link be as open as possible.\nDerrida is attempting to “un-close,” as much as possible,\nthe sphericity or englobing of thought thinking itself – in\norder to open the link as wide as possible, open it to every single\nother, to any other whatsoever. Throughout his career, Derrida is\nalways interested in the status of animality since it determines the\nlimit between man and others. As his final book demonstrates,\nL’animal que donc je suis, Derrida is attempting to\nopen the link even to animals. Animals are other and, because\n“every other is wholly other” (tout autre est tout\nautre), the link must be open to them too. Here despite the\nimmense influence they have had on his thought, Derrida breaks with\nboth Heidegger and Levinas both of whom did not open the link this\nwide (see Points, p. 279). Here, with the “door”\nor “border” open as wide as possible, we encounter\nDerrida’s idea of “unconditional hospitality,” which\nmeans letting others in no matter what, without asking them for\npapers, without judging them, even when they are uninvited. All are to\nbe treated not as enemies who must be expelled or exterminated, but as\nfriends. Nevertheless, as Derrida constantly stresses, we cannot\nreally identify the friend as such. Unconditional hospitality is\ndangerous.\n\nThis danger explains why unconditional openness of the borders is not\nthe best (as opposed to what we were calling the worst above); it is\nonly the less bad or less evil, the less violence. Indeed, it looks as\nthough the unconditional opening is not possible. There always seems\nto be factual conditions. Among all the others we must decide, we must\nassign them papers, which means that there is always, still,\nnecessarily violence at the borders. At once, in hospitality, there is\nthe force that moves towards to the other to welcome and the force to\nremain unscathed and pulled back from the other, trying to keep the\ndoor closed. Here too, in hospitality, we see Derrida’s idea of\na “messianicity without messiah.” Because letting all the\nothers in is impossible (but we must note that Derrida’s concept\nof possibility or virtuality, of the “perhaps,” is\ncomplicated; see in particular Politics of Friendship, p.\n29), this de-closing is always to come in the future like the messiah\ncoming or coming back (Derrida plays on the French word for the\nfuture, “l’avenir,” which literally means “to\ncome,” “à venir”). We must make one more\npoint. The impossibility of unconditional hospitality means that any\nattempt to open the globe completely is insufficient. Being\ninsufficient, every attempt therefore requires criticism; it must be\n“deconstructed,” as Derrida would say. But this\ndeconstruction would be a deconstruction that recognizes its own\ninsufficiency. Deconstruction, to which we now turn, never therefore\nresults in good conscience, in the good conscience that comes with\nthinking we have done enough to render justice.\n",
    "section_title": "4. Elaboration of the Basic Argumentation: The Worst and Hospitality",
    "entry_title": "Jacques Derrida",
    "hierarchy_title": "Jacques Derrida || Elaboration of the Basic Argumentation: The Worst and Hospitality",
    "tokenized_text": [
        "elaboration",
        "basic",
        "argumentation",
        "worst",
        "hospitality",
        "elaboration",
        "basic",
        "argumentation",
        "worst",
        "hospitality",
        "throughout",
        "career",
        "derrida",
        "elaborates",
        "basic",
        "argumentation",
        "many",
        "way",
        "derrida",
        "always",
        "us",
        "argumentation",
        "one",
        "idea",
        "derrida",
        "call",
        "worst",
        "le",
        "pire",
        "extract",
        "definition",
        "worst",
        "faith",
        "knowledge",
        "religion",
        "p",
        "revolves",
        "around",
        "ambiguous",
        "phrase",
        "plus",
        "un",
        "could",
        "translated",
        "english",
        "one",
        "one",
        "one",
        "one",
        "hand",
        "phrase",
        "mean",
        "autoaffection",
        "even",
        "auto",
        "one",
        "immediately",
        "one",
        "two",
        "self",
        "others",
        "hand",
        "mean",
        "lot",
        "one",
        "one",
        "one",
        "worst",
        "derives",
        "second",
        "sense",
        "plus",
        "un",
        "worst",
        "superlative",
        "worst",
        "violence",
        "derrida",
        "seems",
        "distinguishes",
        "worst",
        "violence",
        "kant",
        "called",
        "radical",
        "evil",
        "radical",
        "evil",
        "literally",
        "radical",
        "evil",
        "root",
        "consists",
        "small",
        "infinitesimal",
        "difference",
        "see",
        "grammatology",
        "p",
        "even",
        "derrida",
        "would",
        "describe",
        "infinitesimal",
        "hiatus",
        "address",
        "à",
        "difference",
        "across",
        "distance",
        "address",
        "also",
        "repetition",
        "repetition",
        "selfdivergence",
        "also",
        "violence",
        "rending",
        "oneself",
        "incision",
        "derrida",
        "appropriation",
        "kant",
        "idea",
        "radical",
        "evil",
        "led",
        "certain",
        "commentator",
        "stress",
        "kind",
        "fundamental",
        "atheism",
        "derrida",
        "despite",
        "fact",
        "seems",
        "interested",
        "religion",
        "faith",
        "see",
        "hägglund",
        "pp",
        "opposing",
        "viewpoint",
        "see",
        "caputo",
        "p",
        "despite",
        "controversy",
        "around",
        "derrida",
        "alleged",
        "theism",
        "atheism",
        "look",
        "though",
        "radical",
        "evil",
        "absolute",
        "evil",
        "see",
        "philosophy",
        "time",
        "terror",
        "p",
        "worst",
        "violence",
        "occurs",
        "one",
        "related",
        "completely",
        "appropriated",
        "completely",
        "one",
        "self",
        "address",
        "reach",
        "proper",
        "destination",
        "reach",
        "proper",
        "destination",
        "reaching",
        "proper",
        "destination",
        "address",
        "exclude",
        "many",
        "many",
        "limit",
        "amount",
        "complete",
        "exclusion",
        "extermination",
        "limit",
        "violencethat",
        "make",
        "violence",
        "worst",
        "violence",
        "worst",
        "relation",
        "make",
        "one",
        "simply",
        "one",
        "make",
        "division",
        "indivisible",
        "sovereignty",
        "see",
        "worst",
        "resembles",
        "pure",
        "actuality",
        "aristotle",
        "prime",
        "mover",
        "one",
        "god",
        "sphere",
        "better",
        "globe",
        "thought",
        "thinking",
        "rogue",
        "p",
        "laid",
        "structure",
        "worst",
        "derrida",
        "thinking",
        "structure",
        "derrida",
        "always",
        "happen",
        "event",
        "derrida",
        "think",
        "today",
        "time",
        "terror",
        "end",
        "cold",
        "war",
        "globalization",
        "taking",
        "place",
        "fragility",
        "nationstate",
        "tested",
        "agency",
        "international",
        "criminal",
        "court",
        "demand",
        "universal",
        "human",
        "right",
        "encroach",
        "nationstate",
        "sovereignty",
        "result",
        "universalization",
        "worlding",
        "mondialisation",
        "french",
        "word",
        "globalization",
        "concept",
        "war",
        "thus",
        "world",
        "war",
        "enemy",
        "even",
        "terrorism",
        "along",
        "distinction",
        "civilian",
        "military",
        "army",
        "police",
        "militia",
        "concept",
        "distinction",
        "losing",
        "pertinence",
        "derrida",
        "say",
        "rogue",
        "called",
        "september",
        "created",
        "revealed",
        "situation",
        "although",
        "surely",
        "mediatheatricalized",
        "rogue",
        "pp",
        "globalization",
        "identifiable",
        "enemy",
        "form",
        "state",
        "territory",
        "one",
        "rogue",
        "derrida",
        "us",
        "phrase",
        "united",
        "state",
        "ally",
        "would",
        "wage",
        "could",
        "still",
        "called",
        "war",
        "even",
        "think",
        "war",
        "international",
        "terrorism",
        "balance",
        "terror",
        "cold",
        "war",
        "insured",
        "escalation",
        "nuclear",
        "weapon",
        "would",
        "lead",
        "suicidal",
        "operation",
        "derrida",
        "say",
        "over",
        "instead",
        "new",
        "violence",
        "prepared",
        "truth",
        "unleashed",
        "time",
        "way",
        "visibly",
        "suicidal",
        "autoimmune",
        "ever",
        "violence",
        "longer",
        "world",
        "war",
        "even",
        "war",
        "even",
        "le",
        "right",
        "wage",
        "war",
        "hardly",
        "reassuring",
        "indeed",
        "quite",
        "contrary",
        "rogue",
        "p",
        "mean",
        "suicidal",
        "suicidal",
        "kill",
        "oneself",
        "mean",
        "since",
        "fragile",
        "distinction",
        "state",
        "identification",
        "enemy",
        "one",
        "state",
        "self",
        "includes",
        "others",
        "one",
        "self",
        "includes",
        "others",
        "threaten",
        "socalled",
        "terrorist",
        "cell",
        "example",
        "one",
        "want",
        "immune",
        "oneself",
        "one",
        "must",
        "murder",
        "others",
        "inside",
        "since",
        "others",
        "inside",
        "one",
        "state",
        "one",
        "self",
        "one",
        "required",
        "kill",
        "oneself",
        "context",
        "different",
        "rigid",
        "external",
        "opposition",
        "symbolized",
        "socalled",
        "iron",
        "curtain",
        "defined",
        "cold",
        "war",
        "identifiable",
        "enemy",
        "name",
        "allowed",
        "number",
        "enemy",
        "limited",
        "today",
        "number",
        "enemy",
        "potentially",
        "unlimited",
        "every",
        "wholly",
        "tout",
        "autre",
        "est",
        "tout",
        "autre",
        "cf",
        "politics",
        "friendship",
        "p",
        "thus",
        "every",
        "single",
        "need",
        "rejected",
        "immune",
        "system",
        "innumerable",
        "rejection",
        "resembles",
        "genocide",
        "worse",
        "absolute",
        "threat",
        "absolute",
        "threat",
        "longer",
        "contained",
        "come",
        "neither",
        "already",
        "constituted",
        "state",
        "even",
        "potential",
        "state",
        "might",
        "treated",
        "rogue",
        "state",
        "rogue",
        "p",
        "derrida",
        "saying",
        "worst",
        "possible",
        "possible",
        "ever",
        "said",
        "derrida",
        "always",
        "us",
        "basic",
        "argumentation",
        "laid",
        "idea",
        "worst",
        "today",
        "tendency",
        "towards",
        "worst",
        "greater",
        "ever",
        "purpose",
        "application",
        "purpose",
        "defines",
        "deconstructionis",
        "move",
        "u",
        "towards",
        "worst",
        "violence",
        "violence",
        "least",
        "violence",
        "writing",
        "difference",
        "p",
        "application",
        "argumentation",
        "worst",
        "work",
        "along",
        "globalization",
        "postcold",
        "war",
        "period",
        "see",
        "derrida",
        "say",
        "faith",
        "knowledge",
        "return",
        "religious",
        "religion",
        "pp",
        "see",
        "also",
        "caputo",
        "pp",
        "faith",
        "knowledge",
        "derrida",
        "lay",
        "etymology",
        "latin",
        "word",
        "religion",
        "acknowledges",
        "etymology",
        "problematic",
        "etymology",
        "implies",
        "two",
        "source",
        "religion",
        "religio",
        "implies",
        "holding",
        "back",
        "unscathed",
        "safe",
        "sound",
        "relegere",
        "implies",
        "linking",
        "another",
        "faith",
        "religion",
        "p",
        "see",
        "etymology",
        "inseparable",
        "duality",
        "examined",
        "singular",
        "event",
        "machinelike",
        "repeatability",
        "autoaffection",
        "heteroaffection",
        "importantly",
        "derrida",
        "trying",
        "understand",
        "link",
        "defines",
        "religion",
        "prior",
        "link",
        "man",
        "divinity",
        "god",
        "see",
        "attempt",
        "conceive",
        "link",
        "prior",
        "determination",
        "term",
        "man",
        "god",
        "attempt",
        "make",
        "link",
        "open",
        "possible",
        "derrida",
        "attempting",
        "unclose",
        "much",
        "possible",
        "sphericity",
        "englobing",
        "thought",
        "thinking",
        "order",
        "open",
        "link",
        "wide",
        "possible",
        "open",
        "every",
        "single",
        "whatsoever",
        "throughout",
        "career",
        "derrida",
        "always",
        "interested",
        "status",
        "animality",
        "since",
        "determines",
        "limit",
        "man",
        "others",
        "final",
        "book",
        "demonstrates",
        "l",
        "animal",
        "que",
        "donc",
        "je",
        "suis",
        "derrida",
        "attempting",
        "open",
        "link",
        "even",
        "animal",
        "animal",
        "every",
        "wholly",
        "tout",
        "autre",
        "est",
        "tout",
        "autre",
        "link",
        "must",
        "open",
        "despite",
        "immense",
        "influence",
        "thought",
        "derrida",
        "break",
        "heidegger",
        "levinas",
        "open",
        "link",
        "wide",
        "see",
        "point",
        "p",
        "door",
        "border",
        "open",
        "wide",
        "possible",
        "encounter",
        "derrida",
        "idea",
        "unconditional",
        "hospitality",
        "mean",
        "letting",
        "others",
        "matter",
        "without",
        "asking",
        "paper",
        "without",
        "judging",
        "even",
        "uninvited",
        "treated",
        "enemy",
        "must",
        "expelled",
        "exterminated",
        "friend",
        "nevertheless",
        "derrida",
        "constantly",
        "stress",
        "really",
        "identify",
        "friend",
        "unconditional",
        "hospitality",
        "dangerous",
        "danger",
        "explains",
        "unconditional",
        "openness",
        "border",
        "best",
        "opposed",
        "calling",
        "worst",
        "le",
        "bad",
        "le",
        "evil",
        "le",
        "violence",
        "indeed",
        "look",
        "though",
        "unconditional",
        "opening",
        "possible",
        "always",
        "seems",
        "factual",
        "condition",
        "among",
        "others",
        "must",
        "decide",
        "must",
        "assign",
        "paper",
        "mean",
        "always",
        "still",
        "necessarily",
        "violence",
        "border",
        "hospitality",
        "force",
        "move",
        "towards",
        "welcome",
        "force",
        "remain",
        "unscathed",
        "pulled",
        "back",
        "trying",
        "keep",
        "door",
        "closed",
        "hospitality",
        "see",
        "derrida",
        "idea",
        "messianicity",
        "without",
        "messiah",
        "letting",
        "others",
        "impossible",
        "must",
        "note",
        "derrida",
        "concept",
        "possibility",
        "virtuality",
        "perhaps",
        "complicated",
        "see",
        "particular",
        "politics",
        "friendship",
        "p",
        "declosing",
        "always",
        "come",
        "future",
        "like",
        "messiah",
        "coming",
        "coming",
        "back",
        "derrida",
        "play",
        "french",
        "word",
        "future",
        "l",
        "avenir",
        "literally",
        "mean",
        "come",
        "à",
        "venir",
        "must",
        "make",
        "one",
        "point",
        "impossibility",
        "unconditional",
        "hospitality",
        "mean",
        "attempt",
        "open",
        "globe",
        "completely",
        "insufficient",
        "insufficient",
        "every",
        "attempt",
        "therefore",
        "requires",
        "criticism",
        "must",
        "deconstructed",
        "derrida",
        "would",
        "say",
        "deconstruction",
        "would",
        "deconstruction",
        "recognizes",
        "insufficiency",
        "deconstruction",
        "turn",
        "never",
        "therefore",
        "result",
        "good",
        "conscience",
        "good",
        "conscience",
        "come",
        "thinking",
        "done",
        "enough",
        "render",
        "justice"
    ]
}