{
    "main_text": "Descartes’ Early Mathematical Researches (ca. 1616–1629) || Problems and Proposals\n2.2 Problems and Proposals\n\nThe most famous letter written to Beeckman in 1619 dates from 26 March\nof that year. In this letter Descartes announces his plan to expound\nan “entirely new science [scientia penitus nova], by\nwhich all problems that can be posed, concerning any kind of quantity,\ncontinuous or discrete, can be generally solved” (AT X, 156). As\nhe elaborates on how this new science will proceed, Descartes\nclarifies that his solutions to the problems of discrete and\ncontinuous quantities—that is, of arithmetic and geometry,\nrespectively—will vary depending on the nature of the problem at\nhand. As he puts it,\n\n\n[In this new science] each problem will be solved according to its own\nnature as for example, in arithmetic some questions are resolved by\nrational numbers, others only by surd [irrational] numbers, and others\nfinally can be imagined but not solved. So also I hope to show for\ncontinuous quantities that some problems can be solved by straight\nlines and circles alone; others only by other curved lines, which,\nhowever, result from a single motion and can therefore be drawn with\nnew types of compasses, which are no less exact and geometrical, I\nthink, than the common ones used to draw circles; and finally others\nthat can be solved by curved lines generated by diverse motions not\nsubordinated to one another, which curves are certainly only imaginary\nsuch as the rather well-known quadratrix. I cannot imagine anything\nthat could not be solved by such lines at least, though I hope to show\nwhich questions can be solved in this or that way and not any other,\nso that almost nothing will remain to be found in geometry. It is, of\ncourse, an infinite task, not for one man only. Incredibly ambitious;\nbut I have seen some light through the dark chaos of the science, by\nthe help of which I think all the thickest darkness can be dispelled\n(AT X, 156–158; CSMK 2–3; translation from Sasaki 2003,\n102).\n\n\nWe notice in Descartes’ remarks concerning geometry in\nparticular that the “entirely new science” he proposes\nwill provide an exhaustive classification for problem-solving, where\neach of his three classes is determined by the curves needed for\nsolution. This suggests an important overlap between Descartes’\nthree classes of geometrical problems and Pappus’s three\nclasses, which, recall, were separated based on the types of curves\nrequired for solution: Planar problems are solvable by straightedge\nand compass, solid problems by conics, and line-like problems by more\ncomplicated curves that have an “inconstant and changeable\norigin.” However, there is also a significant difference between\ntheir classifications insofar as Descartes strongly suggests that\nthose problems that require “imaginary” curves for their\nsolution do not have a legitimately geometrical solution. Namely, just\nas some problems of arithmetic “can be imagined but not be\nsolved,” so too in geometry, there is a class of problems that\nrequire curves that are “certainly only imaginary,” i.e.,\ncurves generated by “diverse motions,” and thus that are\nnot geometrical in a proper sense. In this respect, Descartes is\nmoving from Pappus’s descriptive classification to a normative\none that separates geometrical curves from non-geometrical curves, and\nthereby distinguishes problems that have a legitimate geometrical\nsolution from those that do not. Just as importantly, we see in\nDescartes’ letter his attempt to expand the scope of legitimate\ngeometrical constructions beyond straightedge and compass by appealing\nto the motions needed to construct a curve. Specifically, as\nwe see in the passage above, Descartes relies on the “single\nmotions” of his “new types of compasses, which [he says]\nare no less exact and geometrical…than the common ones used to\ndraw circles” in order to mark out a new class of problems that\nhave legitimate geometrical solutions.\n\nIn his 26 March 1619 letter to Beeckman, Descartes does not elaborate\non the “new types of compasses” to which he refers; he\nsimply reports to Beeckman in the early portions of the letter that he\nhas, in a short time, “discovered four conspicuous and entirely\nnew demonstrations with the help of my compasses” (AT X, 154).\nFortunately, more details about these compasses and Descartes’\ndemonstrations are included in Cogitationes privatae, or\nPrivate Reflections (ca. 1619–1620), a text in which\nDescartes applies three different “new compasses” (often\nreferred to by commentators as “proportional compasses”)\nto the problems of (1) dividing a given angle into any number of equal\nparts, (2) constructing the roots of three types of cubic equations,\nand (3) describing a conic section. In the first two cases, as\nDescartes treats the angular section and mean proportional problems,\nthe compasses on which he relies are used to generate a curve that\nwill solve the problem at hand.\n\n\nFigure 1.\n\n\n\nFigure 2.\n\n\nFor instance, to solve the angular section problem, Descartes begins\nby presenting an instrument that includes four rulers (OA, OB, OC,\nOD), which are hinged at point O\n (figure 1).\n We then take four rods (HJ, FJ, GI, EI), which are of equal length\n\\(a\\), and attach them to the arms of the instrument such that\nthey are a distance \\(a\\) from O and are pair-wise hinged at\npoints J and I. Leaving OA stationary, we now move OD so as to vary\nthe measure of angle DOA, and following the path of point J, we\ngenerate the curve KLM\n (figure 2).\n As Descartes has it, we can construct the curve KLM on any\ngiven angle by means of the instrument described above, because the\nangle we are trisecting plays no role in the construction of KLM. And\nonce the curve KLM is constructed, the given angle can be trisected by\nmeans of some basic constructions with straight lines and circles. In\nthis respect, the curve KLM is, for Descartes, the means for solving\nthe angle trisection problem, and moreover, his treatment suggests\nthat the construction can be generalized further so that, by means of\nhis “new compass,” an angle can also be divided into 4, 5,\nor more equal parts. (I borrow my treatment of this construction from\nDomski 2009, 121, which is itself indebted to the presentation in Bos\n2001, 237–239.)\n\n\nFigure 3. Mesolabe\n\n\nA similar approach is taken by Descartes when he treats the problem of\nconstructing mean proportionals, where in this case, he appeals to his\nfamous mesolabe compass, an instrument that is used in Book Three of\nthe La Géométrie to solve the same problem. As\nin 1637, this compass is used to construct curves (the dotted lines in\n figure 3)\n that allow us to identify the mean proportionals between any number\nof given line segments. And as Viète before him, in the\nPrivate Reflections Descartes uses this construction of mean\nproportionals to identify the roots of standard-form cubic equations\n(see Bos 2001, 240–45).\n\nNotice that these constructions illustrate the sort of “single\nmotion” constructions to which Descartes refers in his 26 March\n1619 letter to Beeckman: His new compasses generate curves by the\nsingle motion of a designated arm of the compass, and thus, the curves\ngenerated in this manner meet the standard of geometrical\nintelligibility—the standard by which to distinguish geometrical\nfrom imaginary curves—that is alluded to in the brief outline of\nthe “entirely new science” that Descartes envisions. That\nsuch motions are completed by instruments does not threaten the\nconstructed curve’s geometrical status. (As we saw above,\nViète had leveled this charge against the instrumental,\npointwise constructions provided by Clavius.) And moreover, we already\nnotice in the mathematical research of 1619 Descartes’ focus on\nthe intelligibility of motions as a standard for identifying\nlegitimately geometrical curves. This theme will reemerge in Book Two\nof La Géométrie.\n\nIn addition, we find in Descartes’ early work an interest in the\nrelationship between algebra and geometry that will be crucial to the\nprogram of geometrical analysis presented in Book One of La\nGéométrie, where at this early stage of his\nresearch, Descartes, like his contemporaries, is exploring the\napplication of geometry to algebraic problems. For instance, as\npointed out above, Descartes uses the construction of mean\nproportionals to solve algebraic equations in the Private\nReflections, and in the same text he also shows an interest in\nthe geometrical representation of numbers and of arithmetical\noperations. The same interest appears again in the later\nProgymnasmata de solidorum elementis excerpta ex manuscripto\nCartesii (Preliminary exercises on the elements of solids\nextracted from a manuscript of Descartes, ca. 1623), a text in which\nDescartes offers a geometrical representation of numbers and of four\nof the five basic arithmetical operations (the four operations he\ntreats are addition, subtraction, multiplication, and division).\n\nThough there is some dispute among commentators about Descartes’\nlevel of expertise in algebra during this early 1619–1623 period\n(compare Bos 2001, 245 with Sasaki 2003, 126), texts from\n1628–1629 show Descartes making great advances in algebra in a\nrelatively small amount of time. Two textual sources are of particular\ninterest: (1) The specimen of algebra given to and transcribed by\nBeeckman in 1628 upon Descartes’ return to Holland, and (2) a\ntext on the construction of roots for cubic and quartic equations\ngiven to Beeckman in early\n 1629.[4]\n In the Specimen, Descartes presents a rather basic\nproblem-solving program (or schematism) for algebra that relies on\ntwo-dimensional figures (lines and surfaces). The texts given to\nBeeckman several months later, which Descartes composed while in\nHolland, show a great advance over what’s found in the\nSpecimen, since in these texts he appeals to conic sections\n(or solids) in his problem-solving regime. For instance, Descartes\nconstructs two mean proportionals by the intersection of circle and\nparabola (a method he had discovered around 1625 according to Bos\n2001, 255). More impressively, in a different text from this same\nperiod, Descartes offers a method for constructing all solid problems,\ni.e., for solving all third- and fourth-degree equations.\n\nWhile some of the results from this period are connected with the\nproblem-solving program presented in the 1637 La\nGéométrie, Rabouin (2010) points out that it is\nstill not clear whether Descartes discovered his methods for solution\nusing the techniques that are applied in 1637 (Rabouin 2010, 456). As\nsuch, Rabouin urges us to resist the somewhat standard reading of\nDescartes’ early mathematical works according to which there is\na linear and teleological progression from the 1619 pronouncement of\nan “entirely new science” to the groundbreaking program of\nLa Géométrie (a reading found, for instance, in\nSasaki 2003, especially 156–176). According to Rabouin, it is\nnot until the early 1630s, when Descartes engages with the Pappus\nproblem—what Bos also considers “the crucial\ncatalyst” of Descartes’ mature mathematical researches\n(Bos 2001, 283)—that he returns to his 1619 project to craft a\nnew science of geometry that is grounded on a new classification of\ncurves and problems. Following Rabouin, it is at this point of his\nmathematical career that Descartes more clearly sees just how crucial\nthe interplay of algebraic equations and geometry could be for a\ngeneral program of geometrical problem-solving.\n",
    "section_title": "2.2 Problems and Proposals",
    "entry_title": "Descartes’ Mathematics",
    "hierarchy_title": "Descartes’ Mathematics || Descartes’ Early Mathematical Researches (ca. 1616–1629) || Problems and Proposals",
    "tokenized_text": [
        "descartes",
        "early",
        "mathematical",
        "research",
        "ca",
        "problem",
        "proposal",
        "problem",
        "proposal",
        "famous",
        "letter",
        "written",
        "beeckman",
        "date",
        "march",
        "year",
        "letter",
        "descartes",
        "announces",
        "plan",
        "expound",
        "entirely",
        "new",
        "science",
        "scientia",
        "penitus",
        "nova",
        "problem",
        "posed",
        "concerning",
        "kind",
        "quantity",
        "continuous",
        "discrete",
        "generally",
        "solved",
        "x",
        "elaborates",
        "new",
        "science",
        "proceed",
        "descartes",
        "clarifies",
        "solution",
        "problem",
        "discrete",
        "continuous",
        "quantitiesthat",
        "arithmetic",
        "geometry",
        "respectivelywill",
        "vary",
        "depending",
        "nature",
        "problem",
        "hand",
        "put",
        "new",
        "science",
        "problem",
        "solved",
        "according",
        "nature",
        "example",
        "arithmetic",
        "question",
        "resolved",
        "rational",
        "number",
        "others",
        "surd",
        "irrational",
        "number",
        "others",
        "finally",
        "imagined",
        "solved",
        "also",
        "hope",
        "show",
        "continuous",
        "quantity",
        "problem",
        "solved",
        "straight",
        "line",
        "circle",
        "alone",
        "others",
        "curved",
        "line",
        "however",
        "result",
        "single",
        "motion",
        "therefore",
        "drawn",
        "new",
        "type",
        "compass",
        "le",
        "exact",
        "geometrical",
        "think",
        "common",
        "one",
        "used",
        "draw",
        "circle",
        "finally",
        "others",
        "solved",
        "curved",
        "line",
        "generated",
        "diverse",
        "motion",
        "subordinated",
        "one",
        "another",
        "curve",
        "certainly",
        "imaginary",
        "rather",
        "wellknown",
        "quadratrix",
        "imagine",
        "anything",
        "could",
        "solved",
        "line",
        "least",
        "though",
        "hope",
        "show",
        "question",
        "solved",
        "way",
        "almost",
        "nothing",
        "remain",
        "found",
        "geometry",
        "course",
        "infinite",
        "task",
        "one",
        "man",
        "incredibly",
        "ambitious",
        "seen",
        "light",
        "dark",
        "chaos",
        "science",
        "help",
        "think",
        "thickest",
        "darkness",
        "dispelled",
        "x",
        "csmk",
        "translation",
        "sasaki",
        "notice",
        "descartes",
        "remark",
        "concerning",
        "geometry",
        "particular",
        "entirely",
        "new",
        "science",
        "proposes",
        "provide",
        "exhaustive",
        "classification",
        "problemsolving",
        "three",
        "class",
        "determined",
        "curve",
        "needed",
        "solution",
        "suggests",
        "important",
        "overlap",
        "descartes",
        "three",
        "class",
        "geometrical",
        "problem",
        "pappus",
        "three",
        "class",
        "recall",
        "separated",
        "based",
        "type",
        "curve",
        "required",
        "solution",
        "planar",
        "problem",
        "solvable",
        "straightedge",
        "compass",
        "solid",
        "problem",
        "conic",
        "linelike",
        "problem",
        "complicated",
        "curve",
        "inconstant",
        "changeable",
        "origin",
        "however",
        "also",
        "significant",
        "difference",
        "classification",
        "insofar",
        "descartes",
        "strongly",
        "suggests",
        "problem",
        "require",
        "imaginary",
        "curve",
        "solution",
        "legitimately",
        "geometrical",
        "solution",
        "namely",
        "problem",
        "arithmetic",
        "imagined",
        "solved",
        "geometry",
        "class",
        "problem",
        "require",
        "curve",
        "certainly",
        "imaginary",
        "ie",
        "curve",
        "generated",
        "diverse",
        "motion",
        "thus",
        "geometrical",
        "proper",
        "sense",
        "respect",
        "descartes",
        "moving",
        "pappus",
        "descriptive",
        "classification",
        "normative",
        "one",
        "separate",
        "geometrical",
        "curve",
        "nongeometrical",
        "curve",
        "thereby",
        "distinguishes",
        "problem",
        "legitimate",
        "geometrical",
        "solution",
        "importantly",
        "see",
        "descartes",
        "letter",
        "attempt",
        "expand",
        "scope",
        "legitimate",
        "geometrical",
        "construction",
        "beyond",
        "straightedge",
        "compass",
        "appealing",
        "motion",
        "needed",
        "construct",
        "curve",
        "specifically",
        "see",
        "passage",
        "descartes",
        "relies",
        "single",
        "motion",
        "new",
        "type",
        "compass",
        "say",
        "le",
        "exact",
        "geometricalthan",
        "common",
        "one",
        "used",
        "draw",
        "circle",
        "order",
        "mark",
        "new",
        "class",
        "problem",
        "legitimate",
        "geometrical",
        "solution",
        "march",
        "letter",
        "beeckman",
        "descartes",
        "elaborate",
        "new",
        "type",
        "compass",
        "refers",
        "simply",
        "report",
        "beeckman",
        "early",
        "portion",
        "letter",
        "short",
        "time",
        "discovered",
        "four",
        "conspicuous",
        "entirely",
        "new",
        "demonstration",
        "help",
        "compass",
        "x",
        "fortunately",
        "detail",
        "compass",
        "descartes",
        "demonstration",
        "included",
        "cogitationes",
        "privatae",
        "private",
        "reflection",
        "ca",
        "text",
        "descartes",
        "applies",
        "three",
        "different",
        "new",
        "compass",
        "often",
        "referred",
        "commentator",
        "proportional",
        "compass",
        "problem",
        "dividing",
        "given",
        "angle",
        "number",
        "equal",
        "part",
        "constructing",
        "root",
        "three",
        "type",
        "cubic",
        "equation",
        "describing",
        "conic",
        "section",
        "first",
        "two",
        "case",
        "descartes",
        "treat",
        "angular",
        "section",
        "mean",
        "proportional",
        "problem",
        "compass",
        "relies",
        "used",
        "generate",
        "curve",
        "solve",
        "problem",
        "hand",
        "figure",
        "figure",
        "instance",
        "solve",
        "angular",
        "section",
        "problem",
        "descartes",
        "begin",
        "presenting",
        "instrument",
        "includes",
        "four",
        "ruler",
        "oa",
        "ob",
        "oc",
        "od",
        "hinged",
        "point",
        "figure",
        "take",
        "four",
        "rod",
        "hj",
        "fj",
        "gi",
        "ei",
        "equal",
        "length",
        "a",
        "attach",
        "arm",
        "instrument",
        "distance",
        "a",
        "pairwise",
        "hinged",
        "point",
        "j",
        "i",
        "leaving",
        "oa",
        "stationary",
        "move",
        "od",
        "vary",
        "measure",
        "angle",
        "doa",
        "following",
        "path",
        "point",
        "j",
        "generate",
        "curve",
        "klm",
        "figure",
        "descartes",
        "construct",
        "curve",
        "klm",
        "given",
        "angle",
        "mean",
        "instrument",
        "described",
        "angle",
        "trisecting",
        "play",
        "role",
        "construction",
        "klm",
        "curve",
        "klm",
        "constructed",
        "given",
        "angle",
        "trisected",
        "mean",
        "basic",
        "construction",
        "straight",
        "line",
        "circle",
        "respect",
        "curve",
        "klm",
        "descartes",
        "mean",
        "solving",
        "angle",
        "trisection",
        "problem",
        "moreover",
        "treatment",
        "suggests",
        "construction",
        "generalized",
        "mean",
        "new",
        "compass",
        "angle",
        "also",
        "divided",
        "equal",
        "part",
        "borrow",
        "treatment",
        "construction",
        "domski",
        "indebted",
        "presentation",
        "bos",
        "figure",
        "mesolabe",
        "similar",
        "approach",
        "taken",
        "descartes",
        "treat",
        "problem",
        "constructing",
        "mean",
        "proportional",
        "case",
        "appeal",
        "famous",
        "mesolabe",
        "compass",
        "instrument",
        "used",
        "book",
        "three",
        "la",
        "géométrie",
        "solve",
        "problem",
        "compass",
        "used",
        "construct",
        "curve",
        "dotted",
        "line",
        "figure",
        "allow",
        "u",
        "identify",
        "mean",
        "proportional",
        "number",
        "given",
        "line",
        "segment",
        "viète",
        "private",
        "reflection",
        "descartes",
        "us",
        "construction",
        "mean",
        "proportional",
        "identify",
        "root",
        "standardform",
        "cubic",
        "equation",
        "see",
        "bos",
        "notice",
        "construction",
        "illustrate",
        "sort",
        "single",
        "motion",
        "construction",
        "descartes",
        "refers",
        "march",
        "letter",
        "beeckman",
        "new",
        "compass",
        "generate",
        "curve",
        "single",
        "motion",
        "designated",
        "arm",
        "compass",
        "thus",
        "curve",
        "generated",
        "manner",
        "meet",
        "standard",
        "geometrical",
        "intelligibilitythe",
        "standard",
        "distinguish",
        "geometrical",
        "imaginary",
        "curvesthat",
        "alluded",
        "brief",
        "outline",
        "entirely",
        "new",
        "science",
        "descartes",
        "envisions",
        "motion",
        "completed",
        "instrument",
        "threaten",
        "constructed",
        "curve",
        "geometrical",
        "status",
        "saw",
        "viète",
        "leveled",
        "charge",
        "instrumental",
        "pointwise",
        "construction",
        "provided",
        "clavius",
        "moreover",
        "already",
        "notice",
        "mathematical",
        "research",
        "descartes",
        "focus",
        "intelligibility",
        "motion",
        "standard",
        "identifying",
        "legitimately",
        "geometrical",
        "curve",
        "theme",
        "reemerge",
        "book",
        "two",
        "la",
        "géométrie",
        "addition",
        "find",
        "descartes",
        "early",
        "work",
        "interest",
        "relationship",
        "algebra",
        "geometry",
        "crucial",
        "program",
        "geometrical",
        "analysis",
        "presented",
        "book",
        "one",
        "la",
        "géométrie",
        "early",
        "stage",
        "research",
        "descartes",
        "like",
        "contemporary",
        "exploring",
        "application",
        "geometry",
        "algebraic",
        "problem",
        "instance",
        "pointed",
        "descartes",
        "us",
        "construction",
        "mean",
        "proportional",
        "solve",
        "algebraic",
        "equation",
        "private",
        "reflection",
        "text",
        "also",
        "show",
        "interest",
        "geometrical",
        "representation",
        "number",
        "arithmetical",
        "operation",
        "interest",
        "appears",
        "later",
        "progymnasmata",
        "de",
        "solidorum",
        "elementis",
        "excerpta",
        "ex",
        "manuscripto",
        "cartesii",
        "preliminary",
        "exercise",
        "element",
        "solid",
        "extracted",
        "manuscript",
        "descartes",
        "ca",
        "text",
        "descartes",
        "offer",
        "geometrical",
        "representation",
        "number",
        "four",
        "five",
        "basic",
        "arithmetical",
        "operation",
        "four",
        "operation",
        "treat",
        "addition",
        "subtraction",
        "multiplication",
        "division",
        "though",
        "dispute",
        "among",
        "commentator",
        "descartes",
        "level",
        "expertise",
        "algebra",
        "early",
        "period",
        "compare",
        "bos",
        "sasaki",
        "text",
        "show",
        "descartes",
        "making",
        "great",
        "advance",
        "algebra",
        "relatively",
        "small",
        "amount",
        "time",
        "two",
        "textual",
        "source",
        "particular",
        "interest",
        "specimen",
        "algebra",
        "given",
        "transcribed",
        "beeckman",
        "upon",
        "descartes",
        "return",
        "holland",
        "text",
        "construction",
        "root",
        "cubic",
        "quartic",
        "equation",
        "given",
        "beeckman",
        "early",
        "specimen",
        "descartes",
        "present",
        "rather",
        "basic",
        "problemsolving",
        "program",
        "schematism",
        "algebra",
        "relies",
        "twodimensional",
        "figure",
        "line",
        "surface",
        "text",
        "given",
        "beeckman",
        "several",
        "month",
        "later",
        "descartes",
        "composed",
        "holland",
        "show",
        "great",
        "advance",
        "found",
        "specimen",
        "since",
        "text",
        "appeal",
        "conic",
        "section",
        "solid",
        "problemsolving",
        "regime",
        "instance",
        "descartes",
        "construct",
        "two",
        "mean",
        "proportional",
        "intersection",
        "circle",
        "parabola",
        "method",
        "discovered",
        "around",
        "according",
        "bos",
        "impressively",
        "different",
        "text",
        "period",
        "descartes",
        "offer",
        "method",
        "constructing",
        "solid",
        "problem",
        "ie",
        "solving",
        "third",
        "fourthdegree",
        "equation",
        "result",
        "period",
        "connected",
        "problemsolving",
        "program",
        "presented",
        "la",
        "géométrie",
        "rabouin",
        "point",
        "still",
        "clear",
        "whether",
        "descartes",
        "discovered",
        "method",
        "solution",
        "using",
        "technique",
        "applied",
        "rabouin",
        "rabouin",
        "urge",
        "u",
        "resist",
        "somewhat",
        "standard",
        "reading",
        "descartes",
        "early",
        "mathematical",
        "work",
        "according",
        "linear",
        "teleological",
        "progression",
        "pronouncement",
        "entirely",
        "new",
        "science",
        "groundbreaking",
        "program",
        "la",
        "géométrie",
        "reading",
        "found",
        "instance",
        "sasaki",
        "especially",
        "according",
        "rabouin",
        "early",
        "s",
        "descartes",
        "engages",
        "pappus",
        "problemwhat",
        "bos",
        "also",
        "considers",
        "crucial",
        "catalyst",
        "descartes",
        "mature",
        "mathematical",
        "research",
        "bos",
        "that",
        "return",
        "project",
        "craft",
        "new",
        "science",
        "geometry",
        "grounded",
        "new",
        "classification",
        "curve",
        "problem",
        "following",
        "rabouin",
        "point",
        "mathematical",
        "career",
        "descartes",
        "clearly",
        "see",
        "crucial",
        "interplay",
        "algebraic",
        "equation",
        "geometry",
        "could",
        "general",
        "program",
        "geometrical",
        "problemsolving"
    ]
}