{
    "main_text": "Passions and Emotions\n7. Reception and Legacy\n\nThe things that readers find valuable in Descartes’ work have\nchanged across the centuries. His natural philosophy had an immediate\nimpact that lasted into the eighteenth century. His theory of vision\nwas part of that heritage, as were his results in mathematics. His\nmechanistic account of the psychology of the sensitive soul and his\nview that animals are like machines were revived in the nineteenth\ncentury.\n\nDescartes was strongly invoked in some works on the equality of the\nsexes and the education of women. The seventeenth-century French\nCartesian François Poulain de la Barre used substance dualism\nin arguing to the conclusion that “the mind has no sex”\n(trans. Clarke, 157), although he was not above suggesting that female\nphysiology yields cognitive advantages (Schmitter 2018, 5). The early\neighteenth-century English philosopher Mary Astell used Cartesian\nphilosophy in her advocacy of education for women (Atherton 2001). In\ncontrast, Nicolas Malebranche was less favorable toward attributing\ncognitive equality to women, showing that there was no single position\nshared among the Cartesians concerning equality (Hamerton 2008). (For\nentry into recent work on feminism and Descartes, including historical\nstudies, see Bordo 1999 and Schmitter 2018.)\n\nThe fortune of Descartes’ metaphysics and epistemology is\ncomplex. In his own time, he inspired a raft of followers, who sought\nto develop his metaphysics, epistemology, and natural philosophy, and\nto add a worked-out ethics. These authors included Géraud de\nCordemoy, Arnold Geulincx, Poulin de la Barre, Antoine Le Grand,\nMalebranche, Regis, and Rohault. The British philosopher Henry More\nhad a long history of engaging with Descartes’ mechanical\nphilosophy and metaphysics, toward which he at first expressed\nqualified admiration, which later turned to deep hostility (More 1662,\n1671; see Leech 2013). Pierre-Daniel Huet (1689) offered a scathing\ncritique of Descartes’ philosophy. Other major philosophers,\nincluding Benedict de Spinoza and G. W. Leibniz, were influenced by\nDescartes’ thought but developed their own, distinct\nsystems.\n\nDescartes’ project to examine the knower as a means to determine\nthe scope and possibilities of human knowledge had a profound effect\non early modern epistemology and metaphysics. Among his immediate\nfollowers, Malebranche most fully developed this aspect of\nDescartes’ philosophy. Subsequent philosophers who were not\nfollowers of Descartes also adopted the strategy of investigating the\nknower. The epistemological works of Locke, George Berkeley, David\nHume, Thomas Reid, and Immanuel Kant pursued this investigation. These\nauthors came to different conclusions than had Descartes concerning\nthe ability of the human mind to know things as they are in\nthemselves. Hume and Kant especially—and each in his own\nway—rejected the very notion of a metaphysics that reveals\nreality as it is in itself. They did not merely deny Descartes’\nparticular metaphysical theories; they rejected his sort of\nmetaphysical project altogether. But they did so through the type of\ninvestigation that Descartes himself had made prominent: the\ninvestigation of the cognitive capacities of the knower.\n\nDuring the twentieth century and into the twenty-first, various\naspects of Descartes’ philosophy were widely invoked and perhaps\njust as widely misinterpreted. The first is Descartes’\nskepticism. In the early twentieth century, one response to the threat\nof skepticism about our knowledge of the external world was to retreat\nto the position that we can only know our own sense data, where\n“sense data” are equated with the supposed contents of\nimmediate sensory experience: for vision, color patches having a shape\n(e.g., Russell 1914). Some authors then treated Descartes’\nproject in the Meditations as that of reducing human\nknowledge to immediate sense data, from which knowledge of the\nexternal world was to be constructed. (A version of this reading is\nWilliams 1986.)\n\nAs a reading of Descartes, this position has little to offer. As we\nhave seen, in the Second and Third Meditations Descartes argues from\nthe indubitability of the cogito reasoning to the\ntrustworthiness of intellectual perception to the existence of a\nperfect being (God). This argument does indeed seek to infer the\nreality of a being external to the mind. But the inference does not\ninvoke sensory experience. It proceeds from a non-sensory and innate\nidea of God to the existence of that God. Whatever one may think of\nthe quality of this argument, it has nothing to do with sense data.\nDescartes used skeptical arguments as a tool to temporarily disengage\nthe reader from the sensory world in order to undertake metaphysical\ninvestigations that rely on the pure intellect. But again, sense data\nare not in the mix. The use of skepticism to “withdraw the mind\nfrom the senses” (Med. pref., 7:9) may be read as an\ninstance of Descartes re-purposing, for his own philosophical ends, a\ntype of writing from his time: the spiritual exercise, now\nreconfigured as cognitive exercises. Accordingly, Descartes’\nmeditator is guided by the text of Meditations in purging our\neveryday reliance on the senses in order to uncover the pure intellect\n(see Sec. 3.1). Recall that the metaphysical doubt is to be used once\nin one’s life in order to find the true metaphysics. The search\nfor absolute certainty supports this project and does not extend to\nordinary life (Med. I, VI, 7:22, 89–90). (On Descartes\nand meditative writing, see Underkuffler 2019.)\n\nAnother line of twentieth- and twenty-first century interpretation\nalso focused on the isolation of the subject in the Second Meditation.\nIn the course of that Meditation, Descartes accepts that he knows the\ncontents of his mind, including putative sensory experiences, even\nthough he doubts the existence of his body. Some philosophers have\nconcluded from this that Descartes believed that human beings actually\ncan, in their natural state, have sensory experiences while lacking a\nbody. But Descartes rejected that possibility. In his metaphysics,\nsense perception and imagination depend for their existence on\nmind–body union. Purely intellectual perceptions do not depend\non the brain. But acts of imagination and sense perception require the\nbrain (Pass. I.19–20, 43). Descartes did allow that God\nconceivably could produce sense experiences in us independent of the\nbrain; but because God’s perfection is inconsistent with deceit,\nhe would never do this. In any event, in the natural case, human\nsensations require a brain.\n\nA third conception is little more than the use (or abuse) of Descartes\nas a straw-man representative of a kind of over-arching “Western\nrationality” that over-rationalized the human being and denied\nthe body and emotions. One recent version of this caricature suggests\nthat Descartes affirmed a “sense-represent-plan-move”\ncycle in all explanations of human behavior (Wheeler 2005, Chap. 3).\nAs mentioned above, Descartes explained many human behaviors through\nthe machine of the body, without mental involvement. As he said in the\nFourth Replies, “When people take a fall, and stick out their\nhands so as to protect their head, it is not reason that instructs\nthem to do this” (7:230); rather, the machine of the body\n(material processes in the sense organs, brain, and muscles) produces\nthis behavior. Descartes envisioned similar purely mechanistic\nexplanations for many of the behaviors that arise with the passions or\nemotions, in which the body acts first and the felt experience of the\npassion serves to get the mind to want to do what the body is already\ndoing (Pass. I.37–40). Descartes by no means held that\nall human behavior does or should arise from rational deliberation.\nWhich is not to say that he devalued rational deliberation when there\nis time and need to undertake it. But he was under no illusion that\nall effective human behavior stems from reason.\n\nHow could interpreters get Descartes so wrong? One recent explanation\nsuggests that many post-modern theorists have absorbed their Descartes\nat second hand, and the same explanation might be extended to others\nwho invoke Descartes after only cursory engagement with his writings.\nAs the literary historian Michael Moriarty explains, leading French\ntheorists such as Jacques Lacan and Michel Foucault would have, in the\ncourse of their French educations, “received a solid grounding\nin philosophy, and in Descartes’ works in particular”\n(Moriarty 2003, 52). They then use Descartes as a stalking horse.\nMoriarty suggests that many readers of Lacan and Foucault have not\nreceived the same education in philosophy or in Descartes. Such\nindividuals, “who read Lacan or Foucault without, or before,\nreading Descartes, thus imbibe a certain perception of Descartes, more\nnegative, perhaps, than the authors themselves, writing against the\ngrain of their own culture, may have intended to convey” (2003,\n53). The implication is that Lacan and Foucault engaged Descartes from\na knowledge of his writings, whereas others who lack such knowledge\nmisunderstand the value of such genuine engagement and take away\nmisunderstood implications.\n\nWhat is Descartes’ legacy now? His influence on the seventeenth\ncentury is historically permanent, including his specific\ncontributions in mathematics and optics, his vision for a mechanistic\nphysiology, and the model he offered to Newton of a unified celestial\nand terrestrial physics that assigns a few basic properties to a\nubiquitous matter the motions of which are governed by a few simple\nlaws. In this regard, Descartes’ work offers an example of\nculturally engaged philosophy. Descartes had a sense for the\nfundamental philosophical issues of his time, many of which concerned\nthe theory of nature and the attempt to found a new natural science.\nHe not only offered a systematic reformulation of the extant natural\nphilosophy, but he did so in a way that could be heard and\nunderstood.\n\nBeyond past historical influences, Descartes’ philosophy\ncontinues to speak to us now and to offer new insights to new\ngenerations of philosophers who are in position to hear what he said.\nThis can be seen in the revival of body-first theories of the\nemotions. (Ironically, some of Descartes’ most vocal detractors\namong scientists who study the emotions, including Damasio 1994,\nespouse theories similar in many respects to Descartes’ own, on\nwhich, see Hatfield 2007.) Further, his theories of sensory qualities\nhave inspired new reflections (Simmons 2003), as has his account of\ndistance perception (see Wolf-Devine 1993 and the entries on optics\nand perception in Nolan 2014). More generally, his\nMeditations is one of the most finely crafted examples of\nphilosophical prose ever written. That in itself ensures its ongoing\nvalue.\n\nIn the end, Descartes’ legacy partly consists of problems he\nraised, or brought into prominence, but did not solve. The\nmind–body problem is a case in point. Descartes himself argued\nfrom his ability clearly and distinctly to conceive mind and body as\ndistinct beings to the conclusion that they really are separate\nsubstances. Most philosophers today accept neither the methodological\nbasis for his claim nor the claim itself. All the same, the\nmind–body problem persists. In distinguishing the domain of the\nmental from that of the physical, Descartes struck a chord. Many\nphilosophers accept the conceptual distinction, but remain uncertain\nof the underlying metaphysics: whether mind is identical with brain;\nor the mental emerges from complex processes in the brain; or\nconstitutes a property that is different from any purely physical\nproperty, even while being instantiated by the brain. In this case, a\nproblem that Descartes made prominent has lived far beyond his\nproposed solution.\n",
    "section_title": "7. Reception and Legacy",
    "entry_title": "René Descartes",
    "hierarchy_title": "René Descartes || Passions and Emotions",
    "tokenized_text": [
        "passion",
        "emotion",
        "reception",
        "legacy",
        "thing",
        "reader",
        "find",
        "valuable",
        "descartes",
        "work",
        "changed",
        "across",
        "century",
        "natural",
        "philosophy",
        "immediate",
        "impact",
        "lasted",
        "eighteenth",
        "century",
        "theory",
        "vision",
        "part",
        "heritage",
        "result",
        "mathematics",
        "mechanistic",
        "account",
        "psychology",
        "sensitive",
        "soul",
        "view",
        "animal",
        "like",
        "machine",
        "revived",
        "nineteenth",
        "century",
        "descartes",
        "strongly",
        "invoked",
        "work",
        "equality",
        "sex",
        "education",
        "woman",
        "seventeenthcentury",
        "french",
        "cartesian",
        "françois",
        "poulain",
        "de",
        "la",
        "barre",
        "used",
        "substance",
        "dualism",
        "arguing",
        "conclusion",
        "mind",
        "sex",
        "trans",
        "clarke",
        "although",
        "suggesting",
        "female",
        "physiology",
        "yield",
        "cognitive",
        "advantage",
        "schmitter",
        "early",
        "eighteenthcentury",
        "english",
        "philosopher",
        "mary",
        "astell",
        "used",
        "cartesian",
        "philosophy",
        "advocacy",
        "education",
        "woman",
        "atherton",
        "contrast",
        "nicolas",
        "malebranche",
        "le",
        "favorable",
        "toward",
        "attributing",
        "cognitive",
        "equality",
        "woman",
        "showing",
        "single",
        "position",
        "shared",
        "among",
        "cartesian",
        "concerning",
        "equality",
        "hamerton",
        "entry",
        "recent",
        "work",
        "feminism",
        "descartes",
        "including",
        "historical",
        "study",
        "see",
        "bordo",
        "schmitter",
        "fortune",
        "descartes",
        "metaphysics",
        "epistemology",
        "complex",
        "time",
        "inspired",
        "raft",
        "follower",
        "sought",
        "develop",
        "metaphysics",
        "epistemology",
        "natural",
        "philosophy",
        "add",
        "workedout",
        "ethic",
        "author",
        "included",
        "géraud",
        "de",
        "cordemoy",
        "arnold",
        "geulincx",
        "poulin",
        "de",
        "la",
        "barre",
        "antoine",
        "le",
        "grand",
        "malebranche",
        "regis",
        "rohault",
        "british",
        "philosopher",
        "henry",
        "long",
        "history",
        "engaging",
        "descartes",
        "mechanical",
        "philosophy",
        "metaphysics",
        "toward",
        "first",
        "expressed",
        "qualified",
        "admiration",
        "later",
        "turned",
        "deep",
        "hostility",
        "see",
        "leech",
        "pierredaniel",
        "huet",
        "offered",
        "scathing",
        "critique",
        "descartes",
        "philosophy",
        "major",
        "philosopher",
        "including",
        "benedict",
        "de",
        "spinoza",
        "g",
        "w",
        "leibniz",
        "influenced",
        "descartes",
        "thought",
        "developed",
        "distinct",
        "system",
        "descartes",
        "project",
        "examine",
        "knower",
        "mean",
        "determine",
        "scope",
        "possibility",
        "human",
        "knowledge",
        "profound",
        "effect",
        "early",
        "modern",
        "epistemology",
        "metaphysics",
        "among",
        "immediate",
        "follower",
        "malebranche",
        "fully",
        "developed",
        "aspect",
        "descartes",
        "philosophy",
        "subsequent",
        "philosopher",
        "follower",
        "descartes",
        "also",
        "adopted",
        "strategy",
        "investigating",
        "knower",
        "epistemological",
        "work",
        "locke",
        "george",
        "berkeley",
        "david",
        "hume",
        "thomas",
        "reid",
        "immanuel",
        "kant",
        "pursued",
        "investigation",
        "author",
        "came",
        "different",
        "conclusion",
        "descartes",
        "concerning",
        "ability",
        "human",
        "mind",
        "know",
        "thing",
        "hume",
        "kant",
        "especiallyand",
        "wayrejected",
        "notion",
        "metaphysics",
        "reveals",
        "reality",
        "merely",
        "deny",
        "descartes",
        "particular",
        "metaphysical",
        "theory",
        "rejected",
        "sort",
        "metaphysical",
        "project",
        "altogether",
        "type",
        "investigation",
        "descartes",
        "made",
        "prominent",
        "investigation",
        "cognitive",
        "capacity",
        "knower",
        "twentieth",
        "century",
        "twentyfirst",
        "various",
        "aspect",
        "descartes",
        "philosophy",
        "widely",
        "invoked",
        "perhaps",
        "widely",
        "misinterpreted",
        "first",
        "descartes",
        "skepticism",
        "early",
        "twentieth",
        "century",
        "one",
        "response",
        "threat",
        "skepticism",
        "knowledge",
        "external",
        "world",
        "retreat",
        "position",
        "know",
        "sense",
        "data",
        "sense",
        "data",
        "equated",
        "supposed",
        "content",
        "immediate",
        "sensory",
        "experience",
        "vision",
        "color",
        "patch",
        "shape",
        "eg",
        "russell",
        "author",
        "treated",
        "descartes",
        "project",
        "meditation",
        "reducing",
        "human",
        "knowledge",
        "immediate",
        "sense",
        "data",
        "knowledge",
        "external",
        "world",
        "constructed",
        "version",
        "reading",
        "williams",
        "reading",
        "descartes",
        "position",
        "little",
        "offer",
        "seen",
        "second",
        "third",
        "meditation",
        "descartes",
        "argues",
        "indubitability",
        "cogito",
        "reasoning",
        "trustworthiness",
        "intellectual",
        "perception",
        "existence",
        "perfect",
        "god",
        "argument",
        "indeed",
        "seek",
        "infer",
        "reality",
        "external",
        "mind",
        "inference",
        "invoke",
        "sensory",
        "experience",
        "proceeds",
        "nonsensory",
        "innate",
        "idea",
        "god",
        "existence",
        "god",
        "whatever",
        "one",
        "may",
        "think",
        "quality",
        "argument",
        "nothing",
        "sense",
        "data",
        "descartes",
        "used",
        "skeptical",
        "argument",
        "tool",
        "temporarily",
        "disengage",
        "reader",
        "sensory",
        "world",
        "order",
        "undertake",
        "metaphysical",
        "investigation",
        "rely",
        "pure",
        "intellect",
        "sense",
        "data",
        "mix",
        "use",
        "skepticism",
        "withdraw",
        "mind",
        "sens",
        "med",
        "pref",
        "may",
        "read",
        "instance",
        "descartes",
        "repurposing",
        "philosophical",
        "end",
        "type",
        "writing",
        "time",
        "spiritual",
        "exercise",
        "reconfigured",
        "cognitive",
        "exercise",
        "accordingly",
        "descartes",
        "meditator",
        "guided",
        "text",
        "meditation",
        "purging",
        "everyday",
        "reliance",
        "sens",
        "order",
        "uncover",
        "pure",
        "intellect",
        "see",
        "sec",
        "recall",
        "metaphysical",
        "doubt",
        "used",
        "one",
        "life",
        "order",
        "find",
        "true",
        "metaphysics",
        "search",
        "absolute",
        "certainty",
        "support",
        "project",
        "extend",
        "ordinary",
        "life",
        "med",
        "vi",
        "descartes",
        "meditative",
        "writing",
        "see",
        "underkuffler",
        "another",
        "line",
        "twentieth",
        "twentyfirst",
        "century",
        "interpretation",
        "also",
        "focused",
        "isolation",
        "subject",
        "second",
        "meditation",
        "course",
        "meditation",
        "descartes",
        "accepts",
        "know",
        "content",
        "mind",
        "including",
        "putative",
        "sensory",
        "experience",
        "even",
        "though",
        "doubt",
        "existence",
        "body",
        "philosopher",
        "concluded",
        "descartes",
        "believed",
        "human",
        "being",
        "actually",
        "natural",
        "state",
        "sensory",
        "experience",
        "lacking",
        "body",
        "descartes",
        "rejected",
        "possibility",
        "metaphysics",
        "sense",
        "perception",
        "imagination",
        "depend",
        "existence",
        "mindbody",
        "union",
        "purely",
        "intellectual",
        "perception",
        "depend",
        "brain",
        "act",
        "imagination",
        "sense",
        "perception",
        "require",
        "brain",
        "pas",
        "i",
        "descartes",
        "allow",
        "god",
        "conceivably",
        "could",
        "produce",
        "sense",
        "experience",
        "u",
        "independent",
        "brain",
        "god",
        "perfection",
        "inconsistent",
        "deceit",
        "would",
        "never",
        "event",
        "natural",
        "case",
        "human",
        "sensation",
        "require",
        "brain",
        "third",
        "conception",
        "little",
        "use",
        "abuse",
        "descartes",
        "strawman",
        "representative",
        "kind",
        "overarching",
        "western",
        "rationality",
        "overrationalized",
        "human",
        "denied",
        "body",
        "emotion",
        "one",
        "recent",
        "version",
        "caricature",
        "suggests",
        "descartes",
        "affirmed",
        "senserepresentplanmove",
        "cycle",
        "explanation",
        "human",
        "behavior",
        "wheeler",
        "chap",
        "mentioned",
        "descartes",
        "explained",
        "many",
        "human",
        "behavior",
        "machine",
        "body",
        "without",
        "mental",
        "involvement",
        "said",
        "fourth",
        "reply",
        "people",
        "take",
        "fall",
        "stick",
        "hand",
        "protect",
        "head",
        "reason",
        "instructs",
        "rather",
        "machine",
        "body",
        "material",
        "process",
        "sense",
        "organ",
        "brain",
        "muscle",
        "produce",
        "behavior",
        "descartes",
        "envisioned",
        "similar",
        "purely",
        "mechanistic",
        "explanation",
        "many",
        "behavior",
        "arise",
        "passion",
        "emotion",
        "body",
        "act",
        "first",
        "felt",
        "experience",
        "passion",
        "serf",
        "get",
        "mind",
        "want",
        "body",
        "already",
        "pas",
        "i",
        "descartes",
        "mean",
        "held",
        "human",
        "behavior",
        "arise",
        "rational",
        "deliberation",
        "say",
        "devalued",
        "rational",
        "deliberation",
        "time",
        "need",
        "undertake",
        "illusion",
        "effective",
        "human",
        "behavior",
        "stem",
        "reason",
        "could",
        "interpreter",
        "get",
        "descartes",
        "wrong",
        "one",
        "recent",
        "explanation",
        "suggests",
        "many",
        "postmodern",
        "theorist",
        "absorbed",
        "descartes",
        "second",
        "hand",
        "explanation",
        "might",
        "extended",
        "others",
        "invoke",
        "descartes",
        "cursory",
        "engagement",
        "writing",
        "literary",
        "historian",
        "michael",
        "moriarty",
        "explains",
        "leading",
        "french",
        "theorist",
        "jacques",
        "lacan",
        "michel",
        "foucault",
        "would",
        "course",
        "french",
        "education",
        "received",
        "solid",
        "grounding",
        "philosophy",
        "descartes",
        "work",
        "particular",
        "moriarty",
        "use",
        "descartes",
        "stalking",
        "horse",
        "moriarty",
        "suggests",
        "many",
        "reader",
        "lacan",
        "foucault",
        "received",
        "education",
        "philosophy",
        "descartes",
        "individual",
        "read",
        "lacan",
        "foucault",
        "without",
        "reading",
        "descartes",
        "thus",
        "imbibe",
        "certain",
        "perception",
        "descartes",
        "negative",
        "perhaps",
        "author",
        "writing",
        "grain",
        "culture",
        "may",
        "intended",
        "convey",
        "implication",
        "lacan",
        "foucault",
        "engaged",
        "descartes",
        "knowledge",
        "writing",
        "whereas",
        "others",
        "lack",
        "knowledge",
        "misunderstand",
        "value",
        "genuine",
        "engagement",
        "take",
        "away",
        "misunderstood",
        "implication",
        "descartes",
        "legacy",
        "influence",
        "seventeenth",
        "century",
        "historically",
        "permanent",
        "including",
        "specific",
        "contribution",
        "mathematics",
        "optic",
        "vision",
        "mechanistic",
        "physiology",
        "model",
        "offered",
        "newton",
        "unified",
        "celestial",
        "terrestrial",
        "physic",
        "assigns",
        "basic",
        "property",
        "ubiquitous",
        "matter",
        "motion",
        "governed",
        "simple",
        "law",
        "regard",
        "descartes",
        "work",
        "offer",
        "example",
        "culturally",
        "engaged",
        "philosophy",
        "descartes",
        "sense",
        "fundamental",
        "philosophical",
        "issue",
        "time",
        "many",
        "concerned",
        "theory",
        "nature",
        "attempt",
        "found",
        "new",
        "natural",
        "science",
        "offered",
        "systematic",
        "reformulation",
        "extant",
        "natural",
        "philosophy",
        "way",
        "could",
        "heard",
        "understood",
        "beyond",
        "past",
        "historical",
        "influence",
        "descartes",
        "philosophy",
        "continues",
        "speak",
        "u",
        "offer",
        "new",
        "insight",
        "new",
        "generation",
        "philosopher",
        "position",
        "hear",
        "said",
        "seen",
        "revival",
        "bodyfirst",
        "theory",
        "emotion",
        "ironically",
        "descartes",
        "vocal",
        "detractor",
        "among",
        "scientist",
        "study",
        "emotion",
        "including",
        "damasio",
        "espouse",
        "theory",
        "similar",
        "many",
        "respect",
        "descartes",
        "see",
        "hatfield",
        "theory",
        "sensory",
        "quality",
        "inspired",
        "new",
        "reflection",
        "simmons",
        "account",
        "distance",
        "perception",
        "see",
        "wolfdevine",
        "entry",
        "optic",
        "perception",
        "nolan",
        "generally",
        "meditation",
        "one",
        "finely",
        "crafted",
        "example",
        "philosophical",
        "prose",
        "ever",
        "written",
        "ensures",
        "ongoing",
        "value",
        "end",
        "descartes",
        "legacy",
        "partly",
        "consists",
        "problem",
        "raised",
        "brought",
        "prominence",
        "solve",
        "mindbody",
        "problem",
        "case",
        "point",
        "descartes",
        "argued",
        "ability",
        "clearly",
        "distinctly",
        "conceive",
        "mind",
        "body",
        "distinct",
        "being",
        "conclusion",
        "really",
        "separate",
        "substance",
        "philosopher",
        "today",
        "accept",
        "neither",
        "methodological",
        "basis",
        "claim",
        "claim",
        "mindbody",
        "problem",
        "persists",
        "distinguishing",
        "domain",
        "mental",
        "physical",
        "descartes",
        "struck",
        "chord",
        "many",
        "philosopher",
        "accept",
        "conceptual",
        "distinction",
        "remain",
        "uncertain",
        "underlying",
        "metaphysics",
        "whether",
        "mind",
        "identical",
        "brain",
        "mental",
        "emerges",
        "complex",
        "process",
        "brain",
        "constitutes",
        "property",
        "different",
        "purely",
        "physical",
        "property",
        "even",
        "instantiated",
        "brain",
        "case",
        "problem",
        "descartes",
        "made",
        "prominent",
        "lived",
        "far",
        "beyond",
        "proposed",
        "solution"
    ]
}