{
    "main_text": "Perfect Knowledge, Circularity, and Truth || Is Truth a Condition of Perfect Knowledge?\n6.4 Is Truth a Condition of Perfect Knowledge?\n\nWe noted in\n Section 1.1\n that Descartes’ clearest statements appear to indicate a\njustified belief analysis of perfect knowledge. Consider\nagain the relevant Second Replies passage:\n\nHence you see that once we have become aware that\nGod exists it is necessary for us to imagine that he is a deceiver if\nwe wish to cast doubt on what we clearly and distinctly perceive. And\nsince it is impossible to imagine that he is a deceiver, whatever we\nclearly and distinctly perceive must be completely accepted as true\nand certain.\nBut since I see that you are still stuck fast in\nthe doubts which I put forward in the First Meditation, and which I\nthought I had very carefully removed in the succeeding Meditations, I\nshall now expound for a second time the basis on which it seems to me\nthat all human certainty can be founded.\nFirst of all, as soon as we think that we\ncorrectly perceive something, we are spontaneously convinced that it\nis true. Now if this conviction is so firm that it is impossible for\nus ever to have any reason for doubting what we are convinced of, then\nthere are no further questions for us to ask: we have everything that\nwe could reasonably want. What is it to us that someone may make out\nthat the perception whose truth we are so firmly convinced of may\nappear false to God or an angel, so that it is, absolutely speaking,\nfalse? Why should this alleged “absolute falsity” bother\nus, since we neither believe in it nor have even the smallest\nsuspicion of it? For the supposition which we are making here is of a\nconviction so firm that it is quite incapable of being destroyed; and\nsuch a conviction is clearly the same as the most perfect certainty.\n(AT 7:144f, CSM 2:103)\n\n\nThe last part of the passage emphasizes two conditions: a belief\ncondition, expressed in terms of conviction, and a\njustification condition, expressed in terms of indubitability\nor unshakability – “conviction based on a reason so strong\nthat it can never be shaken by any stronger reason.”\nConspicuously missing is any further condition stipulating that\nthe conviction must be true. The passage does clarify,\nof anything that would count as perfect knowledge, that it is\n“completely accepted as true”; that we are\n“convinced that it is true,” indeed, that we are\n“firmly convinced.” But these remarks speak to the\nbelief condition, not to an expressed truth condition. \nIndeed, the passage is plausibly read even more strongly: i.e.,\nnot merely as omitting mention of a truth condition, but as\nallowing for some broad possibility that what we regard\nas indubitable truths are, “absolutely speaking, \nfalse.”\n\nWhy, then, is Descartes dismissive of the stated objection, indicating\nthat it shouldn’t “bother” us? On one plausible \nreading of the passage, Descartes is assuming that the \npossibility in question is simply a further iteration of\nEvil Genius Doubt – “I see that you are still stuck fast\nin the doubts which I put forward in the First Meditation.” \nWhether a deceiving God is really possible, it’s \nsomething Descartes has argued to be unimaginable for perfect\nknowers, i.e., for successful graduates of the Meditations \n– “it is impossible to imagine that he [God] is a \ndeceiver.” On a plausible reading, therefore, Descartes is \ndismissive of the objection not on metaphysical grounds of absolute \nimpossibility, but on epistemic grounds of indubitability:\nthe “alleged ‘absolute falsity’,” noted in\nthe objection, should in no way “bother us” because our \nconviction is “so firm that it is quite incapable of being \ndestroyed.”\n\nWhy does Descartes not add a truth condition, thereby ensuring that\nbeliefs counting as perfect knowledge are true? In an \ninfluential 1970 book, Harry Frankfurt offers a provocative answer.\nHe argues that Descartes’ goal, truth-wise, is to establish\nthe consistency of our beliefs, but not their correspondence with\nan external reality. Writes Frankfurt:\n\nThe point of Descartes’s validation of reason is that if reason\nis properly employed – that is, if we give assent only to what\nwe clearly and distinctly perceive – we are not led to doubt\nthat reason is reliable. … The crux of Descartes’s\nvalidation of reason is not so much the discovery that a benign deity\nexists, but that reason leads to the conclusion that such a deity\nexists. (1970, 176)\n\n\nFrankfurt thinks that Descartes’ novel plan involves arguing\nthat our best rational efforts show that our best rational efforts are\nlogically consistent: it is “an attempt to show that there are\nno good reasons for believing that reason is unreliable – that\nthe mistrust of reason is not supported by reason and that it is\naccordingly irrational” (1970, 175). Frankfurt adds that\n“the conception of truth involved in [Descartes’] question\nabout the truth of what is clearly and distinctly perceived is, in\nother words, a conception of coherence rather than of\ncorrespondence” (1970, 170).\n\nFrankfurt’s coherentist interpretation is at odds with a number\nof textual and doctrinal considerations. Descartes writes to Mersenne\nthat “the word ‘truth’, in the strict sense, denotes\nthe conformity of thought with its object” (16 Oct 1639, AT\n2:597, CSMK 139). The suggestion here is of some version of a\ncorrespondence theory. Also, on the most straightforward reading of\nthe epistemic moves in the Meditations, Descartes is\npresupposing that at least some truths involve extramental\nmetaphysical relations. Consider that Evil Genius Doubt is,\nfundamentally, a worry not about whether our various clear and\ndistinct judgments cohere, but about whether they accurately\nrepresent an extramental reality – i.e., a doubt about\n“whether things do in reality correspond to our perception of\nthem” (Replies 4, AT 7:226, CSM 2:159). Interestingly, Frankfurt\nhimself came to renounce the interpretation:\n\nI now think, however, that it was a mistake on my part to suggest that\nDescartes entertained a coherence conception of truth. The fact is\nthat there is no textual evidence to support that suggestion; on the\ncontrary, whenever Descartes gives an explicit account of truth he\nexplains it unequivocally as correspondence with reality. (1978, 36f)\n\n\nHow then should we interpret the Second Replies passage, and how\nshould we understand the absence of a truth condition? I suggest that\nthe lack of a truth condition need not reflect an indifference about\ntruth, as opposed to a view about how a concern for truth is properly\nexpressed in an account of knowledge. We can understand Descartes as\nwanting a fully internalist account whereby all\nconditions of knowledge are accessible to the would-be knower. Putting\nthe point another way, if the question of whether the\nconditions of knowledge had been met were answerable only by\n“God or an angel,” it would impose an unacceptably\nexternalist element on the theory. On a justified\nbelief rendering, his account of perfect knowledge is\nfully internalist; yet, with the addition of a truth condition, it is\nnot – at least, not given a correspondence theory of\ntruth, in the context of metaphysical realism. Importantly, then, in\nattributing to Descartes a justified belief account, we need not\nthereby attribute to him an indifference concerning truth.\nRather, we can attribute to him the view that the way properly to\nexpress one’s concern for truth is by enforcing high\njustificatory standards. Again, from that same passage:\n\nNow if this conviction is so firm that it is impossible for us ever to\nhave any reason for doubting what we are convinced of, then there are\nno further questions for us to ask: we have everything that we could\nreasonably want.\n\n\nOne possible objection to a justified belief account is expressed by\nLennon, who worries that on such accounts the desired cognitive state\n(indubitability) “could as well be achieved by a pill”;\nadding that “Descartes would not be satisfied with such a pill\nbecause his aim is not just to arrive at certainty, but truth, which\nhe cannot help but think he has achieved” (2008, 167). (Cf.\nHatfield 2006, 135, who expresses a related objection.)\n\nGranted, if the pill simply prevented me from apprehending any reasons\nfor doubting my beliefs, we’d be loath to regard such beliefs as\nknowledge. Descartes himself makes a related point in connection with\nan atheist geometer who happens never to doubt his beliefs, simply\nbecause the Evil Genius Doubt never occurs to him:\n\n[A]lthough this doubt may not occur to him, it can still crop up if\nsomeone else raises the point or if he looks into the matter himself.\nSo he will never be free of this doubt until he acknowledges that God\nexists. (Replies 2, AT 7:141, CSM 2:101)\n\n\nPresumably, Descartes’ point holds whether the doubt simply\nnever occurs to him, or is instead prevented from occurring by a\npill. Note further that the spirit of the objection presupposes that \nthe achieved indubitability is merely psychological, in that \nthe person simply runs up against an inexplicable inability\nto doubt. Yet we have seen clear texts which have Descartes \ncharacterizing the desired states of clarity and distinctness not \nmerely psychologically, but, further, in epistemic terms implying a \nsort of cognitive luminance, or rational insight.\nHe uses light metaphors including the association of clarity and \ndistinctness with the natural light.  The meditator’s \nability to ward off the evil demon – during occurrent clarity\nand distinctness – is described in terms of perceiving \n“utterly clearly with [the] mind’s eye”; and of\nbeing “convinced” of all matters the denial of which\nleads one to “see a manifest contradiction” (Med. 3,\nAT 7:36, CSM 2:25). In Descartes’ view, our inability to doubt \nthe matters we clearly and distinctly perceive is not simply a causal \nresult, but also a rational result of what such perception enables\nus to understand. Were there a pill that would induce both the\ncausal and the rational outcomes that Descartes associates with\nperfect knowledge, then, arguably, he would endorse taking the pill.  \nFor we would then “have everything that we could reasonably \nwant.”\n\nAnother possible objection is that Descartes’ high justificatory\nstandards generate a de facto truth condition: because having\nCartesian certainty entails that one’s beliefs are\ntrue, truth is a necessary condition of knowledge. But this objection\nmisses a key point. As suggested in the Second Replies passage,\nCartesian certainty – understood in terms of\nindubitability – does not, strictly speaking, rule out\nthe broad possibility that we are in error. The notions of\nindubitability and truth are different: that\n“p is indubitable” entails not that\n“p is true,” but that “there can be no\nreasons for doubting p.” Descartes’ final\nsolution to the Evil Genius Doubt entails not that an evil genius\ncannot be, but that it cannot be coherently\nconceived. And that it cannot be coherently conceived, thinks\nDescartes, gives us “everything that we could reasonably\nwant” – not because such coherence is the goal, but\nbecause of what it establishes, truth-wise.\n\n(For further discussion of the role of truth in perfect knowledge, see\nFrankfurt 1970 and 1978, Hatfield 2006, Lennon 2008, Loeb\n1992, and Newman & Nelson 1999.)\n",
    "section_title": "6.4 Is Truth a Condition of Perfect Knowledge?",
    "entry_title": "Descartes’ Epistemology",
    "hierarchy_title": "Descartes’ Epistemology || Perfect Knowledge, Circularity, and Truth || Is Truth a Condition of Perfect Knowledge?",
    "tokenized_text": [
        "perfect",
        "knowledge",
        "circularity",
        "truth",
        "truth",
        "condition",
        "perfect",
        "knowledge",
        "truth",
        "condition",
        "perfect",
        "knowledge",
        "noted",
        "section",
        "descartes",
        "clearest",
        "statement",
        "appear",
        "indicate",
        "justified",
        "belief",
        "analysis",
        "perfect",
        "knowledge",
        "consider",
        "relevant",
        "second",
        "reply",
        "passage",
        "hence",
        "see",
        "become",
        "aware",
        "god",
        "exists",
        "necessary",
        "u",
        "imagine",
        "deceiver",
        "wish",
        "cast",
        "doubt",
        "clearly",
        "distinctly",
        "perceive",
        "since",
        "impossible",
        "imagine",
        "deceiver",
        "whatever",
        "clearly",
        "distinctly",
        "perceive",
        "must",
        "completely",
        "accepted",
        "true",
        "certain",
        "since",
        "see",
        "still",
        "stuck",
        "fast",
        "doubt",
        "put",
        "forward",
        "first",
        "meditation",
        "thought",
        "carefully",
        "removed",
        "succeeding",
        "meditation",
        "shall",
        "expound",
        "second",
        "time",
        "basis",
        "seems",
        "human",
        "certainty",
        "founded",
        "first",
        "soon",
        "think",
        "correctly",
        "perceive",
        "something",
        "spontaneously",
        "convinced",
        "true",
        "conviction",
        "firm",
        "impossible",
        "u",
        "ever",
        "reason",
        "doubting",
        "convinced",
        "question",
        "u",
        "ask",
        "everything",
        "could",
        "reasonably",
        "want",
        "u",
        "someone",
        "may",
        "make",
        "perception",
        "whose",
        "truth",
        "firmly",
        "convinced",
        "may",
        "appear",
        "false",
        "god",
        "angel",
        "absolutely",
        "speaking",
        "false",
        "alleged",
        "absolute",
        "falsity",
        "bother",
        "u",
        "since",
        "neither",
        "believe",
        "even",
        "smallest",
        "suspicion",
        "supposition",
        "making",
        "conviction",
        "firm",
        "quite",
        "incapable",
        "destroyed",
        "conviction",
        "clearly",
        "perfect",
        "certainty",
        "f",
        "csm",
        "last",
        "part",
        "passage",
        "emphasizes",
        "two",
        "condition",
        "belief",
        "condition",
        "expressed",
        "term",
        "conviction",
        "justification",
        "condition",
        "expressed",
        "term",
        "indubitability",
        "unshakability",
        "conviction",
        "based",
        "reason",
        "strong",
        "never",
        "shaken",
        "stronger",
        "reason",
        "conspicuously",
        "missing",
        "condition",
        "stipulating",
        "conviction",
        "must",
        "true",
        "passage",
        "clarify",
        "anything",
        "would",
        "count",
        "perfect",
        "knowledge",
        "completely",
        "accepted",
        "true",
        "convinced",
        "true",
        "indeed",
        "firmly",
        "convinced",
        "remark",
        "speak",
        "belief",
        "condition",
        "expressed",
        "truth",
        "condition",
        "indeed",
        "passage",
        "plausibly",
        "read",
        "even",
        "strongly",
        "ie",
        "merely",
        "omitting",
        "mention",
        "truth",
        "condition",
        "allowing",
        "broad",
        "possibility",
        "regard",
        "indubitable",
        "truth",
        "absolutely",
        "speaking",
        "false",
        "descartes",
        "dismissive",
        "stated",
        "objection",
        "indicating",
        "bother",
        "u",
        "one",
        "plausible",
        "reading",
        "passage",
        "descartes",
        "assuming",
        "possibility",
        "question",
        "simply",
        "iteration",
        "evil",
        "genius",
        "doubt",
        "see",
        "still",
        "stuck",
        "fast",
        "doubt",
        "put",
        "forward",
        "first",
        "meditation",
        "whether",
        "deceiving",
        "god",
        "really",
        "possible",
        "something",
        "descartes",
        "argued",
        "unimaginable",
        "perfect",
        "knower",
        "ie",
        "successful",
        "graduate",
        "meditation",
        "impossible",
        "imagine",
        "god",
        "deceiver",
        "plausible",
        "reading",
        "therefore",
        "descartes",
        "dismissive",
        "objection",
        "metaphysical",
        "ground",
        "absolute",
        "impossibility",
        "epistemic",
        "ground",
        "indubitability",
        "alleged",
        "absolute",
        "falsity",
        "noted",
        "objection",
        "way",
        "bother",
        "u",
        "conviction",
        "firm",
        "quite",
        "incapable",
        "destroyed",
        "descartes",
        "add",
        "truth",
        "condition",
        "thereby",
        "ensuring",
        "belief",
        "counting",
        "perfect",
        "knowledge",
        "true",
        "influential",
        "book",
        "harry",
        "frankfurt",
        "offer",
        "provocative",
        "answer",
        "argues",
        "descartes",
        "goal",
        "truthwise",
        "establish",
        "consistency",
        "belief",
        "correspondence",
        "external",
        "reality",
        "writes",
        "frankfurt",
        "point",
        "descartes",
        "validation",
        "reason",
        "reason",
        "properly",
        "employed",
        "give",
        "assent",
        "clearly",
        "distinctly",
        "perceive",
        "led",
        "doubt",
        "reason",
        "reliable",
        "crux",
        "descartes",
        "validation",
        "reason",
        "much",
        "discovery",
        "benign",
        "deity",
        "exists",
        "reason",
        "lead",
        "conclusion",
        "deity",
        "exists",
        "frankfurt",
        "think",
        "descartes",
        "novel",
        "plan",
        "involves",
        "arguing",
        "best",
        "rational",
        "effort",
        "show",
        "best",
        "rational",
        "effort",
        "logically",
        "consistent",
        "attempt",
        "show",
        "good",
        "reason",
        "believing",
        "reason",
        "unreliable",
        "mistrust",
        "reason",
        "supported",
        "reason",
        "accordingly",
        "irrational",
        "frankfurt",
        "add",
        "conception",
        "truth",
        "involved",
        "descartes",
        "question",
        "truth",
        "clearly",
        "distinctly",
        "perceived",
        "word",
        "conception",
        "coherence",
        "rather",
        "correspondence",
        "frankfurt",
        "coherentist",
        "interpretation",
        "odds",
        "number",
        "textual",
        "doctrinal",
        "consideration",
        "descartes",
        "writes",
        "mersenne",
        "word",
        "truth",
        "strict",
        "sense",
        "denotes",
        "conformity",
        "thought",
        "object",
        "oct",
        "csmk",
        "suggestion",
        "version",
        "correspondence",
        "theory",
        "also",
        "straightforward",
        "reading",
        "epistemic",
        "move",
        "meditation",
        "descartes",
        "presupposing",
        "least",
        "truth",
        "involve",
        "extramental",
        "metaphysical",
        "relation",
        "consider",
        "evil",
        "genius",
        "doubt",
        "fundamentally",
        "worry",
        "whether",
        "various",
        "clear",
        "distinct",
        "judgment",
        "cohere",
        "whether",
        "accurately",
        "represent",
        "extramental",
        "reality",
        "ie",
        "doubt",
        "whether",
        "thing",
        "reality",
        "correspond",
        "perception",
        "reply",
        "csm",
        "interestingly",
        "frankfurt",
        "came",
        "renounce",
        "interpretation",
        "think",
        "however",
        "mistake",
        "part",
        "suggest",
        "descartes",
        "entertained",
        "coherence",
        "conception",
        "truth",
        "fact",
        "textual",
        "evidence",
        "support",
        "suggestion",
        "contrary",
        "whenever",
        "descartes",
        "give",
        "explicit",
        "account",
        "truth",
        "explains",
        "unequivocally",
        "correspondence",
        "reality",
        "f",
        "interpret",
        "second",
        "reply",
        "passage",
        "understand",
        "absence",
        "truth",
        "condition",
        "suggest",
        "lack",
        "truth",
        "condition",
        "need",
        "reflect",
        "indifference",
        "truth",
        "opposed",
        "view",
        "concern",
        "truth",
        "properly",
        "expressed",
        "account",
        "knowledge",
        "understand",
        "descartes",
        "wanting",
        "fully",
        "internalist",
        "account",
        "whereby",
        "condition",
        "knowledge",
        "accessible",
        "wouldbe",
        "knower",
        "putting",
        "point",
        "another",
        "way",
        "question",
        "whether",
        "condition",
        "knowledge",
        "met",
        "answerable",
        "god",
        "angel",
        "would",
        "impose",
        "unacceptably",
        "externalist",
        "element",
        "theory",
        "justified",
        "belief",
        "rendering",
        "account",
        "perfect",
        "knowledge",
        "fully",
        "internalist",
        "yet",
        "addition",
        "truth",
        "condition",
        "least",
        "given",
        "correspondence",
        "theory",
        "truth",
        "context",
        "metaphysical",
        "realism",
        "importantly",
        "attributing",
        "descartes",
        "justified",
        "belief",
        "account",
        "need",
        "thereby",
        "attribute",
        "indifference",
        "concerning",
        "truth",
        "rather",
        "attribute",
        "view",
        "way",
        "properly",
        "express",
        "one",
        "concern",
        "truth",
        "enforcing",
        "high",
        "justificatory",
        "standard",
        "passage",
        "conviction",
        "firm",
        "impossible",
        "u",
        "ever",
        "reason",
        "doubting",
        "convinced",
        "question",
        "u",
        "ask",
        "everything",
        "could",
        "reasonably",
        "want",
        "one",
        "possible",
        "objection",
        "justified",
        "belief",
        "account",
        "expressed",
        "lennon",
        "worry",
        "account",
        "desired",
        "cognitive",
        "state",
        "indubitability",
        "could",
        "well",
        "achieved",
        "pill",
        "adding",
        "descartes",
        "would",
        "satisfied",
        "pill",
        "aim",
        "arrive",
        "certainty",
        "truth",
        "help",
        "think",
        "achieved",
        "cf",
        "hatfield",
        "express",
        "related",
        "objection",
        "granted",
        "pill",
        "simply",
        "prevented",
        "apprehending",
        "reason",
        "doubting",
        "belief",
        "loath",
        "regard",
        "belief",
        "knowledge",
        "descartes",
        "make",
        "related",
        "point",
        "connection",
        "atheist",
        "geometer",
        "happens",
        "never",
        "doubt",
        "belief",
        "simply",
        "evil",
        "genius",
        "doubt",
        "never",
        "occurs",
        "lthough",
        "doubt",
        "may",
        "occur",
        "still",
        "crop",
        "someone",
        "else",
        "raise",
        "point",
        "look",
        "matter",
        "never",
        "free",
        "doubt",
        "acknowledges",
        "god",
        "exists",
        "reply",
        "csm",
        "presumably",
        "descartes",
        "point",
        "hold",
        "whether",
        "doubt",
        "simply",
        "never",
        "occurs",
        "instead",
        "prevented",
        "occurring",
        "pill",
        "note",
        "spirit",
        "objection",
        "presupposes",
        "achieved",
        "indubitability",
        "merely",
        "psychological",
        "person",
        "simply",
        "run",
        "inexplicable",
        "inability",
        "doubt",
        "yet",
        "seen",
        "clear",
        "text",
        "descartes",
        "characterizing",
        "desired",
        "state",
        "clarity",
        "distinctness",
        "merely",
        "psychologically",
        "epistemic",
        "term",
        "implying",
        "sort",
        "cognitive",
        "luminance",
        "rational",
        "insight",
        "us",
        "light",
        "metaphor",
        "including",
        "association",
        "clarity",
        "distinctness",
        "natural",
        "light",
        "meditator",
        "ability",
        "ward",
        "evil",
        "demon",
        "occurrent",
        "clarity",
        "distinctness",
        "described",
        "term",
        "perceiving",
        "utterly",
        "clearly",
        "mind",
        "eye",
        "convinced",
        "matter",
        "denial",
        "lead",
        "one",
        "see",
        "manifest",
        "contradiction",
        "med",
        "csm",
        "descartes",
        "view",
        "inability",
        "doubt",
        "matter",
        "clearly",
        "distinctly",
        "perceive",
        "simply",
        "causal",
        "result",
        "also",
        "rational",
        "result",
        "perception",
        "enables",
        "u",
        "understand",
        "pill",
        "would",
        "induce",
        "causal",
        "rational",
        "outcome",
        "descartes",
        "associate",
        "perfect",
        "knowledge",
        "arguably",
        "would",
        "endorse",
        "taking",
        "pill",
        "would",
        "everything",
        "could",
        "reasonably",
        "want",
        "another",
        "possible",
        "objection",
        "descartes",
        "high",
        "justificatory",
        "standard",
        "generate",
        "de",
        "facto",
        "truth",
        "condition",
        "cartesian",
        "certainty",
        "entail",
        "one",
        "belief",
        "true",
        "truth",
        "necessary",
        "condition",
        "knowledge",
        "objection",
        "miss",
        "key",
        "point",
        "suggested",
        "second",
        "reply",
        "passage",
        "cartesian",
        "certainty",
        "understood",
        "term",
        "indubitability",
        "strictly",
        "speaking",
        "rule",
        "broad",
        "possibility",
        "error",
        "notion",
        "indubitability",
        "truth",
        "different",
        "p",
        "indubitable",
        "entail",
        "p",
        "true",
        "reason",
        "doubting",
        "p",
        "descartes",
        "final",
        "solution",
        "evil",
        "genius",
        "doubt",
        "entail",
        "evil",
        "genius",
        "coherently",
        "conceived",
        "coherently",
        "conceived",
        "think",
        "descartes",
        "give",
        "u",
        "everything",
        "could",
        "reasonably",
        "want",
        "coherence",
        "goal",
        "establishes",
        "truthwise",
        "discussion",
        "role",
        "truth",
        "perfect",
        "knowledge",
        "see",
        "frankfurt",
        "hatfield",
        "lennon",
        "loeb",
        "newman",
        "nelson"
    ]
}