{
    "main_text": "Virtue and Happiness: The Correspondence with Princess Elisabeth\n5. Generosity and The Passions of the Soul\n\nDescartes’ correspondence with Princess Elisabeth led directly\nto the composition of his final book, The Passions of the\nSoul, a large part of which was written during the winter of\n1645–6. In a prefatory letter to the book, Descartes maintains\nthat in it he has set out to explain the passions “only as a\nnatural philosopher [physicien], and not as a rhetorician or\neven as a moral philosopher” (AT XI 326/CSM I 327). On the face\nof it, this seems to be contradicted by the contents of the book,\nsince much of it is devoted to understanding the passions from an\nethical point of view—that is, understanding how they can be\naccommodated to the goal of happiness. The significance of\nDescartes’ remark lies in the particular account he gives of the\npassions. In general, they are defined as “those perceptions,\nsensations or emotions of the soul which we refer particularly to it,\nand which are caused, maintained and strengthened by some movement of\nthe [animal] spirits” (art. 27; CSM I 338–9).\nDescartes’ central thesis is that the passions originate in\nbodily changes, which are communicated by the animal spirits to the\npineal gland, and thereby give rise to affective states in the\nsoul—affections which are referred to the soul itself and not to\nthe body. Because the passions originate in the body, a large part of\nthe book is devoted to differentiating the passions and accounting for\ntheir effects in physiological terms; hence Descartes’ claim to\nexplain them as a natural philosopher. (For extended treatments of\nDescartes’ theory of the passions, see Brown 2006; James 1997;\nKambouchner 1995a, b.)\n\nDescartes distinguishes six primitive passions: wonder, love, hatred,\ndesire, joy and sadness. All the rest are either composed from these\nor species of them (art. 69). The passions operate in a common manner:\n“the principal effect of all the human passions is that they\nmove and dispose the soul to want the things for which they prepare\nthe body.” Thus, the passsions are in the first place\nmotivational states that dispose the soul to will specific actions:\n“the feeling of fear moves the soul to want to flee, that of\ncourage to want to fight, and similarly with the others” (art.\n40; CSM I 343). Different passions result from the effects of\ndifferent motions on the pineal gland; and these, Descartes assumes,\nhave been ordained by God for the sake of preserving the human body:\n“The function of all the passions consists solely in this, that\nthey dispose our soul to want the things which nature deems useful for\nus, and to persist in this volition; and the same agitation of the\nspirits which normally causes the passions also disposes the body to\nmake movements which help to attain these things” (art. 52; CSM\nI 349). (Exactly how to characterize the passions as mental states\nremains controversial. In addition to the works already cited, see\nBrassfield 2012; Greenberg 2009; Hoffman 1991; Kisner 2018; Schmitter\n2008.)\n\nGiven their natural function of preserving the body, the passions are\nall by nature good (art. 211). They spur us to act in ways that are in\ngeneral conducive to our well-being. However, the effects of the\npassions are not uniformly beneficial. Because they exaggerate the\ngoodness or badness of their objects, they can lead us to pursue\napparent goods or flee apparent harms too quickly. The passions are\nalso ordered for the sake of the preservation of the body, and not the\ncontentment of the soul; and because they originate in the body, any\nmalfunction of the latter can disrupt the normal operation of the\npassions. For these reasons, it is necessary that the passions be\nregulated by reason, whose “proper weapons” against their\nmisuse and excess are “firm and determinate judgements bearing\nupon the knowledge of good and evil, which the soul has resolved to\nfollow in guiding its conduct” (art. 48; CSM I 347). Summarizing\nhis position at the end of the Passions, Descartes says that\n“the chief use of wisdom lies in its teaching us to be masters\nof our passions and to control them with such skill that the evils\nwhich they cause are quite bearable, and even become a source of\njoy” (art. 212; CSM I 404).\n\nOver and above the role they play in the preservation of the body, the\npassions also make a direct contribution to human happiness. In the\nconcluding article of the Passions, Descartes goes so far as\nto say that “it is on the passions alone that all the good and\nevil of this life depends” (art. 212; CSM I 404). In the body of\nthe article, he qualifies this claim, allowing that “the soul\ncan have pleasures of its own. But the pleasures common to it and the\nbody depend entirely on the passions.” His considered view on\nthis question seems to be that the passions (particularly love and\njoy) form a valuable part of a human life, that the enjoyment of them\nis consistent with the happiness that is the natural product of\nvirtue, but that happiness of the latter sort can be had even in the\npresence of harmful passions such as sadness or grief.\n\nHappiness, as Descartes defines it for Elisabeth, is a “perfect\ncontentment of mind and inner satisfaction” (AT IV 264/CSMK\n257), or the “satisfaction and pleasure” that accompanies\nthe practice of virtue (AT IV 284/CSMK 263). In the Passions,\nhe distinguishes these affects from the passions that originate in the\nbody. The former are described as “internal emotions of the\nsoul,” which are “produced in the soul only by the soul\nitself. In this they differ from its passions, which always depend on\nsome movement of the [animal] spirits” (art. 147; CSM I 381).\n“Internal emotions” are thus independent of the body and\nthe basis of a happiness that can withstand “the most violent\nassaults of the passions”:\n\ninternal emotions affect us more intimately, and consequently have\nmuch more power over us than the passions which occur with them but\nare distinct from them. To this extent it is certain that, provided\nour soul always has the means of happiness within itself, all the\ntroubles coming from elsewhere are powerless to harm it. Such troubles\nwill serve rather to increase its joy; for on seeing that it cannot be\nharmed by them, it becomes aware of its perfection. And in order that\nour soul should have the means of happiness, it needs only to follow\nvirtue strictly [de suivre exactement la vertu]. For if\nanyone lives in such a way that his conscience cannot reproach him for\never failing to do something he judges to be the best (which is what I\nhere call ‘following virtue’), he will receive from this a\nsatisfaction which has such power to make him happy that the most\nviolent assaults of the passions will never have sufficient power to\ndisturb the tranquillity of his soul. (art. 148; AT XI 441–2/CSM\nI 381–2)\n\n\nDescartes is committed to the view that virtue is sufficient for\nhappiness, that is, a “perfect contentment of mind and inner\nsatisfaction.” At the same time, he denies that virtue has value\nonly as a means to happiness. On the contrary, virtue is grounded in\nthe one aspect of human nature that is of unconditional value: the\nexercise of our free will, the perfection of the soul that\n“renders us in a certain way like God by making us masters of\nourselves” (art. 152; CSM I 384).\n\nThe full flowering of virtue is found in the moral ideal Descartes\ncalls “generosity”\n(générosité), which he describes as\n“the key to all the other virtues” (art. 161; CSM I 388).\nGenerosity begins as a passion, prompted by thoughts of the nature of\nfree will and the many advantages that follow from its correct use and\nthe many cares that follow from its misuse. Repetition of these\nthoughts and of the consequent passion produces the virtue of\ngenerosity, which is a “habit” of the soul (art. 161; CSM\nI 387). This habit, “true generosity,” has two components,\none intellectual, the other volitional: “The first consists in\n[a person’s] knowing that nothing truly belongs to him but this\nfreedom to dispose his volitions, and that he ought to be praised or\nblamed for no other reason than his using this freedom well or badly.\nThe second consists in his feeling within himself a firm and constant\nresolution to use it well—that is, never to lack the will to\nundertake and carry out whatever he judges to be best. To do that is\nto follow virtue perfectly” (art. 153; AT XI 445—6/ CSM I\n384). (For further discussion, see Normore 2019; Parvizian 2016;\nRodis-Lewis 1987; Shapiro 1999, 2005.)\n\nGenerosity is an ideal of individual ethical perfection, but Descartes\nalso draws from it an important conclusion concerning our relations to\nothers (Brown 2006; Frierson 2002). Upon recognizing an element of\nunconditional value within himself, the generous person is naturally\nled to extend this recognition to others: “Those who possess\nthis knowledge and this feeling about themselves readily come to\nbelieve that any other person can have the same knowledge and feeling\nabout himself, because this involves nothing which depends on someone\nelse.” Those who are endowed with generosity are thus disposed\nto overlook conventional distinctions of class and social status, and\nto focus on the true, intrinsic worth of each individual:\n\nJust as they do not consider themselves much inferior to those who\nhave greater wealth or honour, or even to those who have more\nintelligence, knowledge or beauty, or generally to those who surpass\nthem in some other perfections, equally they do not have much more\nesteem for themselves than for those whom they surpass. For all these\nthings seem to them to be unimportant, by contrast with the virtuous\nwill for which alone they esteem themselves, and which they suppose\nalso to be present, or at least capable of being present, in every\nother person. (art. 154; CSM I 384).\n\n\nThus, despite its nod to law and custom, which fill the space opened\nby the limits of our moral knowledge, Descartes’ ethics is\ncrowned by a principle of moral universalism. In virtue of their free\nwill, all human beings have the same moral status and deserve equal\nmoral respect. In this we find an important anticipation of\nKant’s ethics, which emerges from a similar consideration of the\nunconditional value of a rational and free will.\n",
    "section_title": "5. Generosity and The Passions of the Soul",
    "entry_title": "Descartes’ Ethics",
    "hierarchy_title": "Descartes’ Ethics || Virtue and Happiness: The Correspondence with Princess Elisabeth",
    "tokenized_text": [
        "virtue",
        "happiness",
        "correspondence",
        "princess",
        "elisabeth",
        "generosity",
        "passion",
        "soul",
        "descartes",
        "correspondence",
        "princess",
        "elisabeth",
        "led",
        "directly",
        "composition",
        "final",
        "book",
        "passion",
        "soul",
        "large",
        "part",
        "written",
        "winter",
        "prefatory",
        "letter",
        "book",
        "descartes",
        "maintains",
        "set",
        "explain",
        "passion",
        "natural",
        "philosopher",
        "physicien",
        "rhetorician",
        "even",
        "moral",
        "philosopher",
        "xi",
        "csm",
        "face",
        "seems",
        "contradicted",
        "content",
        "book",
        "since",
        "much",
        "devoted",
        "understanding",
        "passion",
        "ethical",
        "point",
        "viewthat",
        "understanding",
        "accommodated",
        "goal",
        "happiness",
        "significance",
        "descartes",
        "remark",
        "lie",
        "particular",
        "account",
        "give",
        "passion",
        "general",
        "defined",
        "perception",
        "sensation",
        "emotion",
        "soul",
        "refer",
        "particularly",
        "caused",
        "maintained",
        "strengthened",
        "movement",
        "animal",
        "spirit",
        "art",
        "csm",
        "descartes",
        "central",
        "thesis",
        "passion",
        "originate",
        "bodily",
        "change",
        "communicated",
        "animal",
        "spirit",
        "pineal",
        "gland",
        "thereby",
        "give",
        "rise",
        "affective",
        "state",
        "soulaffections",
        "referred",
        "soul",
        "body",
        "passion",
        "originate",
        "body",
        "large",
        "part",
        "book",
        "devoted",
        "differentiating",
        "passion",
        "accounting",
        "effect",
        "physiological",
        "term",
        "hence",
        "descartes",
        "claim",
        "explain",
        "natural",
        "philosopher",
        "extended",
        "treatment",
        "descartes",
        "theory",
        "passion",
        "see",
        "brown",
        "james",
        "kambouchner",
        "a",
        "b",
        "descartes",
        "distinguishes",
        "six",
        "primitive",
        "passion",
        "wonder",
        "love",
        "hatred",
        "desire",
        "joy",
        "sadness",
        "rest",
        "either",
        "composed",
        "specie",
        "art",
        "passion",
        "operate",
        "common",
        "manner",
        "principal",
        "effect",
        "human",
        "passion",
        "move",
        "dispose",
        "soul",
        "want",
        "thing",
        "prepare",
        "body",
        "thus",
        "passsions",
        "first",
        "place",
        "motivational",
        "state",
        "dispose",
        "soul",
        "specific",
        "action",
        "feeling",
        "fear",
        "move",
        "soul",
        "want",
        "flee",
        "courage",
        "want",
        "fight",
        "similarly",
        "others",
        "art",
        "csm",
        "different",
        "passion",
        "result",
        "effect",
        "different",
        "motion",
        "pineal",
        "gland",
        "descartes",
        "assumes",
        "ordained",
        "god",
        "sake",
        "preserving",
        "human",
        "body",
        "function",
        "passion",
        "consists",
        "solely",
        "dispose",
        "soul",
        "want",
        "thing",
        "nature",
        "deems",
        "useful",
        "u",
        "persist",
        "volition",
        "agitation",
        "spirit",
        "normally",
        "cause",
        "passion",
        "also",
        "disposes",
        "body",
        "make",
        "movement",
        "help",
        "attain",
        "thing",
        "art",
        "csm",
        "exactly",
        "characterize",
        "passion",
        "mental",
        "state",
        "remains",
        "controversial",
        "addition",
        "work",
        "already",
        "cited",
        "see",
        "brassfield",
        "greenberg",
        "hoffman",
        "kisner",
        "schmitter",
        "given",
        "natural",
        "function",
        "preserving",
        "body",
        "passion",
        "nature",
        "good",
        "art",
        "spur",
        "u",
        "act",
        "way",
        "general",
        "conducive",
        "wellbeing",
        "however",
        "effect",
        "passion",
        "uniformly",
        "beneficial",
        "exaggerate",
        "goodness",
        "badness",
        "object",
        "lead",
        "u",
        "pursue",
        "apparent",
        "good",
        "flee",
        "apparent",
        "harm",
        "quickly",
        "passion",
        "also",
        "ordered",
        "sake",
        "preservation",
        "body",
        "contentment",
        "soul",
        "originate",
        "body",
        "malfunction",
        "latter",
        "disrupt",
        "normal",
        "operation",
        "passion",
        "reason",
        "necessary",
        "passion",
        "regulated",
        "reason",
        "whose",
        "proper",
        "weapon",
        "misuse",
        "excess",
        "firm",
        "determinate",
        "judgement",
        "bearing",
        "upon",
        "knowledge",
        "good",
        "evil",
        "soul",
        "resolved",
        "follow",
        "guiding",
        "conduct",
        "art",
        "csm",
        "summarizing",
        "position",
        "end",
        "passion",
        "descartes",
        "say",
        "chief",
        "use",
        "wisdom",
        "lie",
        "teaching",
        "u",
        "master",
        "passion",
        "control",
        "skill",
        "evil",
        "cause",
        "quite",
        "bearable",
        "even",
        "become",
        "source",
        "joy",
        "art",
        "csm",
        "role",
        "play",
        "preservation",
        "body",
        "passion",
        "also",
        "make",
        "direct",
        "contribution",
        "human",
        "happiness",
        "concluding",
        "article",
        "passion",
        "descartes",
        "go",
        "far",
        "say",
        "passion",
        "alone",
        "good",
        "evil",
        "life",
        "depends",
        "art",
        "csm",
        "body",
        "article",
        "qualifies",
        "claim",
        "allowing",
        "soul",
        "pleasure",
        "pleasure",
        "common",
        "body",
        "depend",
        "entirely",
        "passions",
        "considered",
        "view",
        "question",
        "seems",
        "passion",
        "particularly",
        "love",
        "joy",
        "form",
        "valuable",
        "part",
        "human",
        "life",
        "enjoyment",
        "consistent",
        "happiness",
        "natural",
        "product",
        "virtue",
        "happiness",
        "latter",
        "sort",
        "even",
        "presence",
        "harmful",
        "passion",
        "sadness",
        "grief",
        "happiness",
        "descartes",
        "defines",
        "elisabeth",
        "perfect",
        "contentment",
        "mind",
        "inner",
        "satisfaction",
        "iv",
        "csmk",
        "satisfaction",
        "pleasure",
        "accompanies",
        "practice",
        "virtue",
        "iv",
        "csmk",
        "passion",
        "distinguishes",
        "affect",
        "passion",
        "originate",
        "body",
        "former",
        "described",
        "internal",
        "emotion",
        "soul",
        "produced",
        "soul",
        "soul",
        "differ",
        "passion",
        "always",
        "depend",
        "movement",
        "animal",
        "spirit",
        "art",
        "csm",
        "internal",
        "emotion",
        "thus",
        "independent",
        "body",
        "basis",
        "happiness",
        "withstand",
        "violent",
        "assault",
        "passion",
        "internal",
        "emotion",
        "affect",
        "u",
        "intimately",
        "consequently",
        "much",
        "power",
        "u",
        "passion",
        "occur",
        "distinct",
        "extent",
        "certain",
        "provided",
        "soul",
        "always",
        "mean",
        "happiness",
        "within",
        "trouble",
        "coming",
        "elsewhere",
        "powerless",
        "harm",
        "trouble",
        "serve",
        "rather",
        "increase",
        "joy",
        "seeing",
        "harmed",
        "becomes",
        "aware",
        "perfection",
        "order",
        "soul",
        "mean",
        "happiness",
        "need",
        "follow",
        "virtue",
        "strictly",
        "de",
        "suivre",
        "exactement",
        "la",
        "vertu",
        "anyone",
        "life",
        "way",
        "conscience",
        "reproach",
        "ever",
        "failing",
        "something",
        "judge",
        "best",
        "call",
        "following",
        "virtue",
        "receive",
        "satisfaction",
        "power",
        "make",
        "happy",
        "violent",
        "assault",
        "passion",
        "never",
        "sufficient",
        "power",
        "disturb",
        "tranquillity",
        "soul",
        "art",
        "xi",
        "csm",
        "descartes",
        "committed",
        "view",
        "virtue",
        "sufficient",
        "happiness",
        "perfect",
        "contentment",
        "mind",
        "inner",
        "satisfaction",
        "time",
        "denies",
        "virtue",
        "value",
        "mean",
        "happiness",
        "contrary",
        "virtue",
        "grounded",
        "one",
        "aspect",
        "human",
        "nature",
        "unconditional",
        "value",
        "exercise",
        "free",
        "perfection",
        "soul",
        "render",
        "u",
        "certain",
        "way",
        "like",
        "god",
        "making",
        "u",
        "master",
        "art",
        "csm",
        "full",
        "flowering",
        "virtue",
        "found",
        "moral",
        "ideal",
        "descartes",
        "call",
        "generosity",
        "générosité",
        "describes",
        "key",
        "virtue",
        "art",
        "csm",
        "generosity",
        "begin",
        "passion",
        "prompted",
        "thought",
        "nature",
        "free",
        "many",
        "advantage",
        "follow",
        "correct",
        "use",
        "many",
        "care",
        "follow",
        "misuse",
        "repetition",
        "thought",
        "consequent",
        "passion",
        "produce",
        "virtue",
        "generosity",
        "habit",
        "soul",
        "art",
        "csm",
        "habit",
        "true",
        "generosity",
        "two",
        "component",
        "one",
        "intellectual",
        "volitional",
        "first",
        "consists",
        "person",
        "knowing",
        "nothing",
        "truly",
        "belongs",
        "freedom",
        "dispose",
        "volition",
        "ought",
        "praised",
        "blamed",
        "reason",
        "using",
        "freedom",
        "well",
        "badly",
        "second",
        "consists",
        "feeling",
        "within",
        "firm",
        "constant",
        "resolution",
        "use",
        "wellthat",
        "never",
        "lack",
        "undertake",
        "carry",
        "whatever",
        "judge",
        "best",
        "follow",
        "virtue",
        "perfectly",
        "art",
        "xi",
        "csm",
        "discussion",
        "see",
        "normore",
        "parvizian",
        "rodislewis",
        "shapiro",
        "generosity",
        "ideal",
        "individual",
        "ethical",
        "perfection",
        "descartes",
        "also",
        "draw",
        "important",
        "conclusion",
        "concerning",
        "relation",
        "others",
        "brown",
        "frierson",
        "upon",
        "recognizing",
        "element",
        "unconditional",
        "value",
        "within",
        "generous",
        "person",
        "naturally",
        "led",
        "extend",
        "recognition",
        "others",
        "posse",
        "knowledge",
        "feeling",
        "readily",
        "come",
        "believe",
        "person",
        "knowledge",
        "feeling",
        "involves",
        "nothing",
        "depends",
        "someone",
        "else",
        "endowed",
        "generosity",
        "thus",
        "disposed",
        "overlook",
        "conventional",
        "distinction",
        "class",
        "social",
        "status",
        "focus",
        "true",
        "intrinsic",
        "worth",
        "individual",
        "consider",
        "much",
        "inferior",
        "greater",
        "wealth",
        "honour",
        "even",
        "intelligence",
        "knowledge",
        "beauty",
        "generally",
        "surpass",
        "perfection",
        "equally",
        "much",
        "esteem",
        "surpass",
        "thing",
        "seem",
        "unimportant",
        "contrast",
        "virtuous",
        "alone",
        "esteem",
        "suppose",
        "also",
        "present",
        "least",
        "capable",
        "present",
        "every",
        "person",
        "art",
        "csm",
        "thus",
        "despite",
        "nod",
        "law",
        "custom",
        "fill",
        "space",
        "opened",
        "limit",
        "moral",
        "knowledge",
        "descartes",
        "ethic",
        "crowned",
        "principle",
        "moral",
        "universalism",
        "virtue",
        "free",
        "human",
        "being",
        "moral",
        "status",
        "deserve",
        "equal",
        "moral",
        "respect",
        "find",
        "important",
        "anticipation",
        "kant",
        "ethic",
        "emerges",
        "similar",
        "consideration",
        "unconditional",
        "value",
        "rational",
        "free"
    ]
}