{
    "main_text": "Perfect Knowledge, Circularity, and Truth || The Cartesian Circle\n6.1 The Cartesian Circle\n\nStudents of philosophy can expect to be taught a longstanding\ninterpretation according to which Descartes’ broader argument\nis viciously circular. He first argues from clearly and distinctly\nperceived premises to the conclusion that an all-perfect God exists;\nhe then argues from the premise that an all-perfect God exists to the\nconclusion that whatever is clearly and distinctly perceived is true.\nThe worry is that he presupposes the C&D Rule in the effort to\nprove the C&D Rule. Despite its prima facie plausibility,\nDescartes scholarship generally resists the vicious circularity\ninterpretation, based on numerous textual considerations. But even\nputting those texts to the side, it should be surprising that the\nproject would be viciously circular. As Thomas Lennon notes:\n\n[I]t would be nothing less than astonishing if the central argument\nof the central text of the central figure of the central period in\nthe history of philosophy were obviously circular. How could the\nfather of modern philosophy, the source of the epistemological turn, \nhave produced such an obviously loopy argument? (2008, 158)\n\n\nConsider first what every plausible interpretation must concede:\nthat the two main steps of the broader argument unfold in a manner\nsuggestive of a circle – let us indeed refer to them as\n‘arcs’. The Third Meditation arguments for God define one\narc:\n\nArc 1: The conclusion that an all-perfect God exists\nis derived from premises that are clearly and distinctly perceived.\n\n\nThe Fourth Meditation argument defines a second arc:\n\nArc 2: The general veracity of propositions that are\nclearly and distinctly perceived (i.e., the C&D Rule) is derived\nfrom the conclusion that an all-perfect God exists.\n\n\nThat the broader argument unfolds in accord with these two steps is\nuncontroversial. The question of interest concerns whether, strictly\nspeaking, these arcs form an epistemic circle. The statement\nof Arc 1 admits of some ambiguity. How one resolves this ambiguity \ndetermines whether the arcs strictly form a circle. Let’s begin \nby clarifying what Arc 1 would have to mean to generate vicious \ncircularity. We’ll then consider the main alternative \ninterpretations of that arc by which commentators seek to avoid \ncircularity.\n\n\nVicious Circularity interpretation:\n\nArc 1: The conclusion that an all-perfect God exists\nis derived from premises that are clearly and distinctly perceived\n– i.e., premises that are accepted only because of having\nfirst accepted the general veracity of propositions that are clearly\nand distinctly perceived.\n\nArc 2: The general veracity of propositions that are\nclearly and distinctly perceived is derived from the conclusion that\nan all-perfect God exists.\n\n\nThus rendered, Descartes’ broader argument is viciously\ncircular. The italicized segment of Arc 1 marks an addition to the\noriginal statement of it, thereby clarifying the circularity reading.\nInterpreted in this way, Descartes begins his Third Meditation proofs\nof God by presupposing the general veracity of clear and distinct\nperception. That is, he starts by assuming the C&D Rule and then\nuses the rule in the course of demonstrating it. Evidently, this way\nof reading Descartes’ argument has pedagogical appeal, for it is\nwidely taught (outside of Descartes scholarship) despite the absence\nof serious textual merit. If there is one point of general agreement\nin the scholarly literature, it is that the texts do not sustain this\ninterpretation.\n\nHow then should Arc 1 be understood? There are multiple\ninterpretations that avoid vicious circularity, along with\nnumerous schemes for cataloguing them. For present purposes, \nwe’ll catalogue the various accounts according to two\nmain kinds of non-circular strategies that commentators attribute\nto Descartes. (The secondary literature offers multiple variations\non each of these main kinds of interpretations, though the\nvariations won’t here be explored. For further alternative \nschemes for cataloguing interpretations, see Hatfield 2006 and\nNewman & Nelson 1999. For an anthology devoted largely to the \nCartesian Circle, see Doney 1987.)\n\n\nBounded Doubt interpretations:\n\nArc 1: The conclusion that an all-perfect God exists\nis derived from premises that are clearly and distinctly perceived\n– indeed, premises belonging to a special class of truths\nthat are fully immune to doubt prior to establishing the general\nveracity of propositions that are clearly and distinctly\nperceived.\n\nArc 2: The general veracity of propositions that are\nclearly and distinctly perceived is derived from the conclusion that\nan all-perfect God exists.\n\n\nAgain, the italicized segment marks an addition to the original\nstatement of Arc 1. Call this a ‘Bounded Doubt’\ninterpretation, because this kind of interpretation construes\nhyperbolic doubt as bounded. More precisely, the Evil Genius\nDoubt is (on this reading) bounded in the sense that its sceptical\npotency does not extend to all judgments: a special class of truths is\noutside the bounds of doubt. Exemplary of this special class are the\ncogito and, importantly, the premises of the Third Meditation\nproofs of God. Propositions in this special class can be perfectly\nknown, even by atheists.\n\nOn this interpretation, there is no vicious circularity in the broader\nargument, because the truths serving as premises in the arguments for\nthe C&D Rule are perfectly knowable independently of that rule.\nThat is, throughout the arguments of Arcs 1 and 2, the premises\nemployed count as perfectly knowledge prior to the knowledge\nof the C&D Rule they help establish.\n\nProponents of this interpretation are apt to cite the Third Meditation\npassage distinguishing what’s revealed by the natural\nlight, and what’s taught by nature (see\n Section 4.3).\nIn order to extend perfect knowledge beyond the privileged class of\ntruths (revealed by the natural light), it is necessary to establish\nthe general veracity of the C&D Rule. Thus, the need (on this\ninterpretation) for Arc 2 in the broader project.\n\nThe other main kind of interpretation avoids circularity in a\ndifferent manner. Let’s consider that alternative.\n\n\nUnbounded Doubt interpretations:\n\nArc 1: The conclusion that an all-perfect God exists\nis derived from premises that are clearly and distinctly perceived\n– i.e., premises that are accepted despite being vulnerable\nto Evil Genius Doubt, because our cognitive nature compels us to\nassent to clearly and distinctly perceived propositions.\n\nArc 2: The general veracity of propositions that are\nclearly and distinctly perceived is derived from the conclusion that\nan all-perfect God exists.\n\n\nAgain, the italicized segment marks an addition to the original\nstatement of Arc 1. Let’s call this an ‘Unbounded\nDoubt’ interpretation, because this kind of interpretation\nconstrues hyperbolic doubt as unbounded. More precisely,\nthe Evil Genius Doubt is (on this reading) unbounded in the sense\nthat it undermines all manner of judgments – even\nthe cogito, even the premises of the Third Meditation\nproofs of God – when the mind is no longer attending to them \nclearly and distinctly. Insofar as the meditator assents to the\nsteps of these proofs, he does so not because of having an \nunderstanding of clear and distinct perceptions as being guaranteed \ntrue, but because the mind cannot but assent to them \nwhile attending clearly and distinctly.\n\nImportantly, if doubt is thus unbounded there is no circularity. For,\non this reading of Arc 1, the arguments therein do not presuppose the\ngeneral veracity of the C&D Rule. The premises contributing to\nthe conclusion of an all-perfect God remain vulnerable to hyperbolic\ndoubt. Throughout this stage of the inquiry, none of the\nmeditator’s judgments based in clear and distinct perception\nconstitutes perfect knowledge. It is the unboundedness of hyperbolic\ndoubt that underwrites the No Atheistic Perfect Knowledge Thesis.\n\nA central feature of this interpretation is worth repeating. It\nis natural for critics to ask why the arguments of Arc 1 are\naccepted by the meditator if, indeed, Evil Genius Doubt\nremains in play. The answer lies in the indirect manner\nin which the doubt undermines clear and distinct perception\n (Section 4.3).\nWhile clearly and distinctly attending to a proposition,\nthe mind cannot but assent: “my nature is such that\nso long as I perceive something very clearly and distinctly I\ncannot but believe it to be true.” Therefore, while\nthe meditator attends to the steps of the Third Meditation arguments \nfor God, he cannot but accept them. However, the meditator does not \n(yet) have perfect knowledge of those premises, nor of their \nconclusions. How, then, do those matters finally rise to the status\nof perfect knowledge? We return to this issue, below. At present,\nthe focus is on the issue of circularity.\n\nThough bounded and unbounded doubt interpretations can both avoid \nvicious circularity, each confronts further difficulties –\nboth textual and philosophical. Avoiding the charge of vicious \ncircularity marks the beginning of the interpreter’s work,\nnot the end. Bounded doubt interpreters must explain why, in the \nfirst place, the Evil Genius Doubt’s potency does\nnot extend to propositions in the special class. Unbounded doubt \ninterpreters must explain why, in the final analysis,\nthe Evil Genius Doubt eventually loses it undermining potency. \nLet’s consider each of these further problems.\n\nGranting a bounded doubt interpretation, why – in the first\nplace – does the Evil Genius Doubt’s potency not extend\nto propositions in the special class? How is it that the doubt\ndoes undermine the proposition “that two and three\nadded together make five,” but not the proposition\n“that there must be at least as much [reality] in the efficient\nand total cause as in the effect of that cause”? The first\nproposition is included in the list of examples that are\nundermined by the Evil Genius Doubt (see the fourth paragraph of the\nThird Meditation). The second proposition is a premise in a Third\nMeditation argument for God – a proposition immune to doubt,\naccording to bounded doubt interpretations. What is supposed to be\nthe relevant difference between these propositions? Given the indirect\nmanner in which Evil Genius Doubt operates, there seems no clear\nexplanation of why the doubt succeeds in undermining the first\nproposition but is somehow resisted by the second. Further awkward for\nthis interpretation is that the cogito is included in the\nlist of examples that that same fourth paragraph passage implies is\nvulnerable to doubt.\n\nGranting an unbounded doubt interpretation, why – in the final\nanalysis – does the Evil Genius Doubt eventually lose its\nundermining potency? Putting the point ironically: Why doesn’t\nthe Evil Genius Doubt undermine the very arguments intended to refute\nthe Evil Genius Doubt, as soon as the mind is no longer attending to\nthose premises? Consider Descartes’ own explanation of how\nhyperbolic doubt undermines the conclusions of arguments once their\npremises are no longer in the mind’s view:\n\nThere are other truths which are perceived very clearly by our\nintellect so long as we attend to the arguments on which our knowledge\nof them depends; and we are therefore incapable of doubting them\nduring this time. But we may forget the arguments in question and\nlater remember simply the conclusions which were deduced from them.\nThe question will now arise as to whether we possess the same firm and\nimmutable conviction concerning these conclusions, when we simply\nrecollect that they were previously deduced from quite evident\nprinciples (our ability to call them ‘conclusions’\npresupposes such a recollection). (Replies 2, AT 7:146, CSM 2:104)\n\n\nSo, when we’re no longer clearly and distinctly perceiving the\nsteps of an argument, we do not “possess the same firm and\nimmutable conviction” of its conclusion. But precisely such\nmoments are when hyperbolic doubt does its undermining work. This\nmeans that upon diverting attention from the premises of Arcs 1 and\n2, it would then be possible to run the Evil Genius Doubt on their conclusions. It would thus seem that unbounded doubt interpretations \nleave us in a Sisyphus-like predicament. According to the myth, each \ntime Sisyphus pushes his boulder near to the top of the hill, the \nboulder slips away, rolling to the very bottom, and the whole process \nmust start all over. By carefully constructing the arguments of Arcs\n1 and 2, the meditator gains anti-sceptical momentum, pushing his \nproject near to the goal of perfect knowledge. But each time, once\nhis attention is diverted from the steps of the arguments, he finds\nhimself back at the bottom of the hill, wondering about the\ncredibility of those proofs that had seemed so evident: that is\n(as Descartes states the comparable problem, above), the question\nnow arises “as to whether we possess the same firm and\nimmutable conviction concerning these conclusions, when we simply\nrecollect that they were previously deduced from quite evident\nprinciples.” As Michael Ayers writes:\n\nDescartes’s enterprise might well look worthless. For even\nif it were granted that his argument is both valid and simple enough\nto be grasped intuitively, as soon as it is no longer so grasped it \nwould seem to fall open to the very same doubt as it refutes. What\nis the value of such a momentary triumph over scepticism? (1998,\n1013)\n\n\nLet’s turn to an account that purports to solve this problem\narising with unbounded doubt interpretations.\n\n(For examples of bounded doubt interpretations, see Broughton 2002, \nDoney 1955, Della Rocca 2005, Kenny 1968, Morris 1973,\nRickless 2005, and Wilson 1978. For examples of unbounded doubt \ninterpretations, see Carriero 2009, Curley 1978 and 1993, DeRose \n1992, Loeb 1992, Newman 2012, Newman & Nelson 1999, Sosa \n1997a and 1997b, and Van Cleve 1979.)\n",
    "section_title": "6.1 The Cartesian Circle",
    "entry_title": "Descartes’ Epistemology",
    "hierarchy_title": "Descartes’ Epistemology || Perfect Knowledge, Circularity, and Truth || The Cartesian Circle",
    "tokenized_text": [
        "perfect",
        "knowledge",
        "circularity",
        "truth",
        "cartesian",
        "circle",
        "cartesian",
        "circle",
        "student",
        "philosophy",
        "expect",
        "taught",
        "longstanding",
        "interpretation",
        "according",
        "descartes",
        "broader",
        "argument",
        "viciously",
        "circular",
        "first",
        "argues",
        "clearly",
        "distinctly",
        "perceived",
        "premise",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "argues",
        "premise",
        "allperfect",
        "god",
        "exists",
        "conclusion",
        "whatever",
        "clearly",
        "distinctly",
        "perceived",
        "true",
        "worry",
        "presupposes",
        "c",
        "rule",
        "effort",
        "prove",
        "c",
        "rule",
        "despite",
        "prima",
        "facie",
        "plausibility",
        "descartes",
        "scholarship",
        "generally",
        "resists",
        "vicious",
        "circularity",
        "interpretation",
        "based",
        "numerous",
        "textual",
        "consideration",
        "even",
        "putting",
        "text",
        "side",
        "surprising",
        "project",
        "would",
        "viciously",
        "circular",
        "thomas",
        "lennon",
        "note",
        "would",
        "nothing",
        "le",
        "astonishing",
        "central",
        "argument",
        "central",
        "text",
        "central",
        "figure",
        "central",
        "period",
        "history",
        "philosophy",
        "obviously",
        "circular",
        "could",
        "father",
        "modern",
        "philosophy",
        "source",
        "epistemological",
        "turn",
        "produced",
        "obviously",
        "loopy",
        "argument",
        "consider",
        "first",
        "every",
        "plausible",
        "interpretation",
        "must",
        "concede",
        "two",
        "main",
        "step",
        "broader",
        "argument",
        "unfold",
        "manner",
        "suggestive",
        "circle",
        "let",
        "u",
        "indeed",
        "refer",
        "arc",
        "third",
        "meditation",
        "argument",
        "god",
        "define",
        "one",
        "arc",
        "arc",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "derived",
        "premise",
        "clearly",
        "distinctly",
        "perceived",
        "fourth",
        "meditation",
        "argument",
        "defines",
        "second",
        "arc",
        "arc",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "ie",
        "c",
        "rule",
        "derived",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "broader",
        "argument",
        "unfolds",
        "accord",
        "two",
        "step",
        "uncontroversial",
        "question",
        "interest",
        "concern",
        "whether",
        "strictly",
        "speaking",
        "arc",
        "form",
        "epistemic",
        "circle",
        "statement",
        "arc",
        "admits",
        "ambiguity",
        "one",
        "resolve",
        "ambiguity",
        "determines",
        "whether",
        "arc",
        "strictly",
        "form",
        "circle",
        "let",
        "begin",
        "clarifying",
        "arc",
        "would",
        "mean",
        "generate",
        "vicious",
        "circularity",
        "consider",
        "main",
        "alternative",
        "interpretation",
        "arc",
        "commentator",
        "seek",
        "avoid",
        "circularity",
        "vicious",
        "circularity",
        "interpretation",
        "arc",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "derived",
        "premise",
        "clearly",
        "distinctly",
        "perceived",
        "ie",
        "premise",
        "accepted",
        "first",
        "accepted",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "arc",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "derived",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "thus",
        "rendered",
        "descartes",
        "broader",
        "argument",
        "viciously",
        "circular",
        "italicized",
        "segment",
        "arc",
        "mark",
        "addition",
        "original",
        "statement",
        "thereby",
        "clarifying",
        "circularity",
        "reading",
        "interpreted",
        "way",
        "descartes",
        "begin",
        "third",
        "meditation",
        "proof",
        "god",
        "presupposing",
        "general",
        "veracity",
        "clear",
        "distinct",
        "perception",
        "start",
        "assuming",
        "c",
        "rule",
        "us",
        "rule",
        "course",
        "demonstrating",
        "evidently",
        "way",
        "reading",
        "descartes",
        "argument",
        "pedagogical",
        "appeal",
        "widely",
        "taught",
        "outside",
        "descartes",
        "scholarship",
        "despite",
        "absence",
        "serious",
        "textual",
        "merit",
        "one",
        "point",
        "general",
        "agreement",
        "scholarly",
        "literature",
        "text",
        "sustain",
        "interpretation",
        "arc",
        "understood",
        "multiple",
        "interpretation",
        "avoid",
        "vicious",
        "circularity",
        "along",
        "numerous",
        "scheme",
        "cataloguing",
        "present",
        "purpose",
        "catalogue",
        "various",
        "account",
        "according",
        "two",
        "main",
        "kind",
        "noncircular",
        "strategy",
        "commentator",
        "attribute",
        "descartes",
        "secondary",
        "literature",
        "offer",
        "multiple",
        "variation",
        "main",
        "kind",
        "interpretation",
        "though",
        "variation",
        "explored",
        "alternative",
        "scheme",
        "cataloguing",
        "interpretation",
        "see",
        "hatfield",
        "newman",
        "nelson",
        "anthology",
        "devoted",
        "largely",
        "cartesian",
        "circle",
        "see",
        "doney",
        "bounded",
        "doubt",
        "interpretation",
        "arc",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "derived",
        "premise",
        "clearly",
        "distinctly",
        "perceived",
        "indeed",
        "premise",
        "belonging",
        "special",
        "class",
        "truth",
        "fully",
        "immune",
        "doubt",
        "prior",
        "establishing",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "arc",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "derived",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "italicized",
        "segment",
        "mark",
        "addition",
        "original",
        "statement",
        "arc",
        "call",
        "bounded",
        "doubt",
        "interpretation",
        "kind",
        "interpretation",
        "construes",
        "hyperbolic",
        "doubt",
        "bounded",
        "precisely",
        "evil",
        "genius",
        "doubt",
        "reading",
        "bounded",
        "sense",
        "sceptical",
        "potency",
        "extend",
        "judgment",
        "special",
        "class",
        "truth",
        "outside",
        "bound",
        "doubt",
        "exemplary",
        "special",
        "class",
        "cogito",
        "importantly",
        "premise",
        "third",
        "meditation",
        "proof",
        "god",
        "proposition",
        "special",
        "class",
        "perfectly",
        "known",
        "even",
        "atheist",
        "interpretation",
        "vicious",
        "circularity",
        "broader",
        "argument",
        "truth",
        "serving",
        "premise",
        "argument",
        "c",
        "rule",
        "perfectly",
        "knowable",
        "independently",
        "rule",
        "throughout",
        "argument",
        "arc",
        "premise",
        "employed",
        "count",
        "perfectly",
        "knowledge",
        "prior",
        "knowledge",
        "c",
        "rule",
        "help",
        "establish",
        "proponent",
        "interpretation",
        "apt",
        "cite",
        "third",
        "meditation",
        "passage",
        "distinguishing",
        "revealed",
        "natural",
        "light",
        "taught",
        "nature",
        "see",
        "section",
        "order",
        "extend",
        "perfect",
        "knowledge",
        "beyond",
        "privileged",
        "class",
        "truth",
        "revealed",
        "natural",
        "light",
        "necessary",
        "establish",
        "general",
        "veracity",
        "c",
        "rule",
        "thus",
        "need",
        "interpretation",
        "arc",
        "broader",
        "project",
        "main",
        "kind",
        "interpretation",
        "avoids",
        "circularity",
        "different",
        "manner",
        "let",
        "consider",
        "alternative",
        "unbounded",
        "doubt",
        "interpretation",
        "arc",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "derived",
        "premise",
        "clearly",
        "distinctly",
        "perceived",
        "ie",
        "premise",
        "accepted",
        "despite",
        "vulnerable",
        "evil",
        "genius",
        "doubt",
        "cognitive",
        "nature",
        "compels",
        "u",
        "assent",
        "clearly",
        "distinctly",
        "perceived",
        "proposition",
        "arc",
        "general",
        "veracity",
        "proposition",
        "clearly",
        "distinctly",
        "perceived",
        "derived",
        "conclusion",
        "allperfect",
        "god",
        "exists",
        "italicized",
        "segment",
        "mark",
        "addition",
        "original",
        "statement",
        "arc",
        "let",
        "call",
        "unbounded",
        "doubt",
        "interpretation",
        "kind",
        "interpretation",
        "construes",
        "hyperbolic",
        "doubt",
        "unbounded",
        "precisely",
        "evil",
        "genius",
        "doubt",
        "reading",
        "unbounded",
        "sense",
        "undermines",
        "manner",
        "judgment",
        "even",
        "cogito",
        "even",
        "premise",
        "third",
        "meditation",
        "proof",
        "god",
        "mind",
        "longer",
        "attending",
        "clearly",
        "distinctly",
        "insofar",
        "meditator",
        "assent",
        "step",
        "proof",
        "understanding",
        "clear",
        "distinct",
        "perception",
        "guaranteed",
        "true",
        "mind",
        "assent",
        "attending",
        "clearly",
        "distinctly",
        "importantly",
        "doubt",
        "thus",
        "unbounded",
        "circularity",
        "reading",
        "arc",
        "argument",
        "therein",
        "presuppose",
        "general",
        "veracity",
        "c",
        "rule",
        "premise",
        "contributing",
        "conclusion",
        "allperfect",
        "god",
        "remain",
        "vulnerable",
        "hyperbolic",
        "doubt",
        "throughout",
        "stage",
        "inquiry",
        "none",
        "meditator",
        "judgment",
        "based",
        "clear",
        "distinct",
        "perception",
        "constitutes",
        "perfect",
        "knowledge",
        "unboundedness",
        "hyperbolic",
        "doubt",
        "underwrites",
        "atheistic",
        "perfect",
        "knowledge",
        "thesis",
        "central",
        "feature",
        "interpretation",
        "worth",
        "repeating",
        "natural",
        "critic",
        "ask",
        "argument",
        "arc",
        "accepted",
        "meditator",
        "indeed",
        "evil",
        "genius",
        "doubt",
        "remains",
        "play",
        "answer",
        "lie",
        "indirect",
        "manner",
        "doubt",
        "undermines",
        "clear",
        "distinct",
        "perception",
        "section",
        "clearly",
        "distinctly",
        "attending",
        "proposition",
        "mind",
        "assent",
        "nature",
        "long",
        "perceive",
        "something",
        "clearly",
        "distinctly",
        "believe",
        "true",
        "therefore",
        "meditator",
        "attends",
        "step",
        "third",
        "meditation",
        "argument",
        "god",
        "accept",
        "however",
        "meditator",
        "yet",
        "perfect",
        "knowledge",
        "premise",
        "conclusion",
        "matter",
        "finally",
        "rise",
        "status",
        "perfect",
        "knowledge",
        "return",
        "issue",
        "present",
        "focus",
        "issue",
        "circularity",
        "though",
        "bounded",
        "unbounded",
        "doubt",
        "interpretation",
        "avoid",
        "vicious",
        "circularity",
        "confronts",
        "difficulty",
        "textual",
        "philosophical",
        "avoiding",
        "charge",
        "vicious",
        "circularity",
        "mark",
        "beginning",
        "interpreter",
        "work",
        "end",
        "bounded",
        "doubt",
        "interpreter",
        "must",
        "explain",
        "first",
        "place",
        "evil",
        "genius",
        "doubt",
        "potency",
        "extend",
        "proposition",
        "special",
        "class",
        "unbounded",
        "doubt",
        "interpreter",
        "must",
        "explain",
        "final",
        "analysis",
        "evil",
        "genius",
        "doubt",
        "eventually",
        "loses",
        "undermining",
        "potency",
        "let",
        "consider",
        "problem",
        "granting",
        "bounded",
        "doubt",
        "interpretation",
        "first",
        "place",
        "evil",
        "genius",
        "doubt",
        "potency",
        "extend",
        "proposition",
        "special",
        "class",
        "doubt",
        "undermine",
        "proposition",
        "two",
        "three",
        "added",
        "together",
        "make",
        "five",
        "proposition",
        "must",
        "least",
        "much",
        "reality",
        "efficient",
        "total",
        "cause",
        "effect",
        "cause",
        "first",
        "proposition",
        "included",
        "list",
        "example",
        "undermined",
        "evil",
        "genius",
        "doubt",
        "see",
        "fourth",
        "paragraph",
        "third",
        "meditation",
        "second",
        "proposition",
        "premise",
        "third",
        "meditation",
        "argument",
        "god",
        "proposition",
        "immune",
        "doubt",
        "according",
        "bounded",
        "doubt",
        "interpretation",
        "supposed",
        "relevant",
        "difference",
        "proposition",
        "given",
        "indirect",
        "manner",
        "evil",
        "genius",
        "doubt",
        "operates",
        "seems",
        "clear",
        "explanation",
        "doubt",
        "succeeds",
        "undermining",
        "first",
        "proposition",
        "somehow",
        "resisted",
        "second",
        "awkward",
        "interpretation",
        "cogito",
        "included",
        "list",
        "example",
        "fourth",
        "paragraph",
        "passage",
        "implies",
        "vulnerable",
        "doubt",
        "granting",
        "unbounded",
        "doubt",
        "interpretation",
        "final",
        "analysis",
        "evil",
        "genius",
        "doubt",
        "eventually",
        "lose",
        "undermining",
        "potency",
        "putting",
        "point",
        "ironically",
        "evil",
        "genius",
        "doubt",
        "undermine",
        "argument",
        "intended",
        "refute",
        "evil",
        "genius",
        "doubt",
        "soon",
        "mind",
        "longer",
        "attending",
        "premise",
        "consider",
        "descartes",
        "explanation",
        "hyperbolic",
        "doubt",
        "undermines",
        "conclusion",
        "argument",
        "premise",
        "longer",
        "mind",
        "view",
        "truth",
        "perceived",
        "clearly",
        "intellect",
        "long",
        "attend",
        "argument",
        "knowledge",
        "depends",
        "therefore",
        "incapable",
        "doubting",
        "time",
        "may",
        "forget",
        "argument",
        "question",
        "later",
        "remember",
        "simply",
        "conclusion",
        "deduced",
        "question",
        "arise",
        "whether",
        "posse",
        "firm",
        "immutable",
        "conviction",
        "concerning",
        "conclusion",
        "simply",
        "recollect",
        "previously",
        "deduced",
        "quite",
        "evident",
        "principle",
        "ability",
        "call",
        "conclusion",
        "presupposes",
        "recollection",
        "reply",
        "csm",
        "longer",
        "clearly",
        "distinctly",
        "perceiving",
        "step",
        "argument",
        "posse",
        "firm",
        "immutable",
        "conviction",
        "conclusion",
        "precisely",
        "moment",
        "hyperbolic",
        "doubt",
        "undermining",
        "work",
        "mean",
        "upon",
        "diverting",
        "attention",
        "premise",
        "arc",
        "would",
        "possible",
        "run",
        "evil",
        "genius",
        "doubt",
        "conclusion",
        "would",
        "thus",
        "seem",
        "unbounded",
        "doubt",
        "interpretation",
        "leave",
        "u",
        "sisyphuslike",
        "predicament",
        "according",
        "myth",
        "time",
        "sisyphus",
        "push",
        "boulder",
        "near",
        "top",
        "hill",
        "boulder",
        "slip",
        "away",
        "rolling",
        "bottom",
        "whole",
        "process",
        "must",
        "start",
        "carefully",
        "constructing",
        "argument",
        "arc",
        "meditator",
        "gain",
        "antisceptical",
        "momentum",
        "pushing",
        "project",
        "near",
        "goal",
        "perfect",
        "knowledge",
        "time",
        "attention",
        "diverted",
        "step",
        "argument",
        "find",
        "back",
        "bottom",
        "hill",
        "wondering",
        "credibility",
        "proof",
        "seemed",
        "evident",
        "descartes",
        "state",
        "comparable",
        "problem",
        "question",
        "arises",
        "whether",
        "posse",
        "firm",
        "immutable",
        "conviction",
        "concerning",
        "conclusion",
        "simply",
        "recollect",
        "previously",
        "deduced",
        "quite",
        "evident",
        "principles",
        "michael",
        "ayers",
        "writes",
        "descartes",
        "enterprise",
        "might",
        "well",
        "look",
        "worthless",
        "even",
        "granted",
        "argument",
        "valid",
        "simple",
        "enough",
        "grasped",
        "intuitively",
        "soon",
        "longer",
        "grasped",
        "would",
        "seem",
        "fall",
        "open",
        "doubt",
        "refutes",
        "value",
        "momentary",
        "triumph",
        "scepticism",
        "let",
        "turn",
        "account",
        "purport",
        "solve",
        "problem",
        "arising",
        "unbounded",
        "doubt",
        "interpretation",
        "example",
        "bounded",
        "doubt",
        "interpretation",
        "see",
        "broughton",
        "doney",
        "della",
        "rocca",
        "kenny",
        "morris",
        "rickless",
        "wilson",
        "example",
        "unbounded",
        "doubt",
        "interpretation",
        "see",
        "carriero",
        "curley",
        "derose",
        "loeb",
        "newman",
        "newman",
        "nelson",
        "sosa",
        "a",
        "b",
        "van",
        "cleve"
    ]
}