{
    "main_text": "Intellectual Biography || Metaphysical turn, comprehensive physics, Discourse\n1.3 Metaphysical turn, comprehensive physics, Discourse\n\nDescartes spent his first year in the Netherlands in Franeker, where\nhe registered at the University in April, 1629. Initially, he worked\non two topics: mathematical science and metaphysics. In Summer, 1629,\nan impressive set of parhelia, or false suns, were observed near Rome.\nWhen Descartes heard of them, he set out to find an explanation. (He\nultimately hypothesized that a large, solid ice-ring in the sky acts\nas a lens to form multiple images of the sun [Met.\n6:355].)\n\nThis work interrupted his investigations on another topic, which had\nengaged him for his first nine months in the Netherlands\n(1:44)—the topic of metaphysics. The metaphysical objects of his\ninvestigation included the existence and nature of God and the soul\n(1:144, 182). However, these metaphysical investigations were not\nentirely divorced from problems such as the parhelia, for he claimed\nthat through his investigations into God and the human self, he had\nbeen able “to discover the foundation of physics” (1:144).\nHis post-Rules emphasis on intellectual apprehension of God,\nthe soul, and the foundations of physics constitute Descartes’\n“metaphysical turn,” even if his metaphysics was not yet\nfully disclosed. Subsequently, Descartes mentioned a little\nmetaphysical treatise in Latin—presumably an early version of\nthe Meditations—that he wrote upon first coming to the\nNetherlands (1:184, 350). And he later affirmed to Mersenne that the\nmetaphysics of the Meditations, in which God and soul are\nprominent, contained “all the principles of my physics”\n(3:233).\n\nWhile working on the parhelia, Descartes conceived the idea for a very\nambitious treatise, about which he wrote Mersenne on 16 November 1629\nfrom his new residence in Amsterdam. He now intended to explain not\n“just one phenomenon” (the parhelia), but “all the\nphenomena of nature, that is to say, the whole of physics”\n(1:70). This work eventually became The World, which was to\nhave three parts: on light (a general treatise on visible, or\nmaterial, nature), on man (a treatise on physiology), and on the soul.\nOnly the first two survive (and perhaps only they were ever written),\nas the Treatise on Light and Treatise on Man. In\nthese works, which Descartes decided to suppress upon learning of the\ncondemnation of Galileo (1:270, 305), he offered a comprehensive\nvision of the universe as constituted from bare matter possessing the\nproperties length, breadth, and depth (three-dimensional volume) and\ncarved up into particles with size and shape, which may be in motion\nor at rest, and which interact through quantitative laws of motion\nthat are formulated and sustained by God (Light,\n11:33–4). These works described the visible universe as a single\nphysical system in which all operations, from the formation of planets\nand the transmission of light from the sun to the physiological\nprocesses of human and nonhuman animal bodies, can be explained\nthrough the mechanism of matter arranged into shapes and structures\nand moving according to three laws of motion. In fact, his\nexplanations in the World and the subsequent\nPrinciples made little use of the three laws of motion in\nother than a qualitative manner. The laws sustained the notion that\nmatter moves regularly (in a straight line) and that upon impact bits\nof matter alter their motions in regular ways—something that\nhappens constantly in the full universe (the “plenum”)\nconceived by Descartes. (At this time, Descartes received an offer of\nappointment to the medical faculty in Bologna—even though he had\nnot yet made public any of his results—which he declined; see\nManning 2014.)\n\nAfter suppressing his World, Descartes decided to put\nforward, anonymously, a limited sample of his new philosophy, in the\nDiscourse with its attached essays. The Discourse\nrecounted Descartes’ own life journey, explaining how he had\ncome to the position of doubting his previous knowledge and seeking to\nbegin afresh. It offered some initial results of his metaphysical\ninvestigations, including mind–body dualism. It did not,\nhowever, engage in the deep skepticism of the later\nMeditations, nor did it claim to establish, metaphysically,\nthat the essence of matter is extension. This last conclusion was\npresented merely as a hypothesis whose fruitfulness could be tested\nand “proven,” or perhaps merely confirmed (see McMullin\n2008), by the results contained in the attached essays on\nDioptrics and Meteorology (the latter covering\n“atmospheric” phenomena).\n\nIn his Meteorology, Descartes described his general\nhypothesis (or supposition) about the nature of matter, before\noffering accounts of vapors, salt, winds, clouds, snow, rain, hail,\nlightning, the rainbow, coronas, and parhelia. His hypothesis was as\nfollows:\n\n\nthat the water, earth, air, and all other such bodies that surround us\nare composed of many small parts of various shapes and sizes, which\nare never so properly disposed nor so exactly joined together that\nthere do not remain many intervals around them; and that these\nintervals are not empty but are filled with that extremely subtle\nmatter through the mediation of which, I have said above, the action\nof light is communicated. (6:233)\n\n\nHe presented a corpuscularian basis for his physics that denied the\natoms-and-void theory of ancient atomism and affirmed that all bodies\nare composed from one type of matter, which is infinitely divisible\ninto particles or corpuscles (6:239). He here also proclaimed that his\nnatural philosophy had no need for the “substantial forms”\nand “real qualities” that other philosophers (i.e.,\nAristotelians) “imagine to be in bodies” (6:239). He had\ntaken the same position in the Treatise on Light, where he\nsaid that in conceiving his new “world” (i.e., his\nconception of the universe), “I do not use the qualities called\nheat, cold, moistness, and dryness, as the Philosophers do”\n(11:25).\n\nIn effect, he was denying the then-dominant scholastic Aristotelian\nontology, which explained all natural bodies as comprised of a\n“prime matter” informed by a “substantial\nform,” and which explained qualities such as hot and cold as\nreally inhering in bodies in a way that is “similar” to\nthe qualities of hot and cold as we experience them tactually.\nAccording to the Aristotelian explanation, the qualities that are\nproper to each sense—color, sound, odor, tastes, and tactual\nqualities—are really inherent in things, and our experienced\nsensations resemble these qualities in things. As regards prime\nmatter, many scholastic Aristotelians held that it cannot exist on its\nown; to form a substance, or something that can exist by itself, prime\nmatter must be “informed” by a substantial form (a form or\nactive principle that gives a substance its essential properties). The\nfour Aristotelian elements, earth, air, fire, and water, had\nsubstantial forms that combined the basic qualities of hot, cold, wet,\nand dry: earth is cold and dry; air is hot and wet; fire is hot and\ndry; and water is cold and wet. These elements can themselves then\nserve as “matter” to higher substantial forms, such as the\nform of a mineral, or a magnet, or a living thing. Whether in the case\nof earth or of a living thing, such as a rabbit, the\n“form” of a thing directs its characteristic activity. For\nearth, that activity is to approach the center of the universe; water\nhas the same tendency, but not as strongly. Accordingly, Aristotelians\nexplained, the planet earth exists at the center, with water on its\nsurface. A new rabbit is formed when a male rabbit contributes,\nthrough its seed-matter, the “form” of rabbithood to the\nseed-matter of the female rabbit. This form then organizes that matter\ninto the shape of a rabbit, including its various organs and\nphysiological processes. The newborn rabbit’s behavior is guided\nby its “sensitive soul,” a rabbit-specific instance of the\ntype of substantial form possessed by all animals. Other properties of\nthe rabbit, such as the whiteness of its fur, are explained by the\n“real quality” of white inhering in each strand of\nhair.\n\nAlthough in the World and Meteorology Descartes\navoided outright denial of substantial forms and real qualities, it is\nclear that he intended to deny them (Corr. 1:324; 2:200;\n3:420, 500, 648). Indeed, he claimed that he could explain these\nqualities themselves through matter in motion (Light 11:26,\nMet. 6:235–6). As an example, he explained color in\nthings as a property of surfaces that puts a spin on particles of\nlight, which in turn affect the nerves in the retina, which then\naffect the brain, causing a sensation in the mind (via matter’s\neffect on the immaterial mind). The sensation of a color (such as red)\ndoes not resemble the surface property that causes the effect on the\nnerve that produces the sensation. The experienced red is an\napparently arbitrary sign or signal for a surface property in objects\n(Light I; see also Dioptrics VI, 6:130, and\nPrinc. I.68–70).\n\nTwo considerations help explain Descartes’ tentative language\nwith respect to substantial forms and real qualities. First, when he\nwrote these works in the 1630s, he was not yet prepared to release his\nmetaphysics, which would support his hypothesis about matter and so\nrule out substantial forms (1:563). Second, he was sensitive to the\nprudential value of not directly attacking the scholastic Aristotelian\nposition (3:298), since it was the accepted position in university\neducation (3:577) and was strongly supported by orthodox theologians,\nboth Catholic and Protestant (1:85–6; 3:349).\n\nAfter the Discourse appeared in 1637, Descartes received\nletters with queries and challenges to various of the doctrines,\nincluding: his avoidance of substantial forms and real qualities; his\nargument for a distinction between mind and body; and his view that\nnatural philosophical hypotheses could be “proven” (or\nconfirmed) through the empirically observed effects they explain\n(Disc. VI, 6:76). This correspondence merits close study, for\nhis further discussions of hypothesis-confirmation in science\n(Corr. 1:422–4, 563–4, 2:142–3,\n199–201), his replies to objections concerning his metaphysics\n(1:350, 353), and his explanation that he had left the most radical\nskeptical arguments out of this work, since it was written in French\nfor a wide audience, including women (1:350, 561).\n\nIn 1635, Descartes fathered a daughter named Francine. Her mother was\nDescartes’ housekeeper, Helena Jans. They lived with Descartes\npart of the time in the latter 1630s. He was arranging for the\ndaughter to live with a female relative of his for the sake of her\neducation when he learned of her death in September 1640, which\nsaddened him greatly (Rodis-Lewis 1998, 140). Subsequently, in 1644,\nhe contributed a dowry for Helena’s marriage (Watson 2007,\n188).\n",
    "section_title": "1.3 Metaphysical turn, comprehensive physics, Discourse",
    "entry_title": "René Descartes",
    "hierarchy_title": "René Descartes || Intellectual Biography || Metaphysical turn, comprehensive physics, Discourse",
    "tokenized_text": [
        "intellectual",
        "biography",
        "metaphysical",
        "turn",
        "comprehensive",
        "physic",
        "discourse",
        "metaphysical",
        "turn",
        "comprehensive",
        "physic",
        "discourse",
        "descartes",
        "spent",
        "first",
        "year",
        "netherlands",
        "franeker",
        "registered",
        "university",
        "april",
        "initially",
        "worked",
        "two",
        "topic",
        "mathematical",
        "science",
        "metaphysics",
        "summer",
        "impressive",
        "set",
        "parhelion",
        "false",
        "sun",
        "observed",
        "near",
        "rome",
        "descartes",
        "heard",
        "set",
        "find",
        "explanation",
        "ultimately",
        "hypothesized",
        "large",
        "solid",
        "icering",
        "sky",
        "act",
        "lens",
        "form",
        "multiple",
        "image",
        "sun",
        "met",
        "work",
        "interrupted",
        "investigation",
        "another",
        "topic",
        "engaged",
        "first",
        "nine",
        "month",
        "netherlands",
        "the",
        "topic",
        "metaphysics",
        "metaphysical",
        "object",
        "investigation",
        "included",
        "existence",
        "nature",
        "god",
        "soul",
        "however",
        "metaphysical",
        "investigation",
        "entirely",
        "divorced",
        "problem",
        "parhelion",
        "claimed",
        "investigation",
        "god",
        "human",
        "self",
        "able",
        "discover",
        "foundation",
        "physic",
        "postrules",
        "emphasis",
        "intellectual",
        "apprehension",
        "god",
        "soul",
        "foundation",
        "physic",
        "constitute",
        "descartes",
        "metaphysical",
        "turn",
        "even",
        "metaphysics",
        "yet",
        "fully",
        "disclosed",
        "subsequently",
        "descartes",
        "mentioned",
        "little",
        "metaphysical",
        "treatise",
        "latinpresumably",
        "early",
        "version",
        "meditationsthat",
        "wrote",
        "upon",
        "first",
        "coming",
        "netherlands",
        "later",
        "affirmed",
        "mersenne",
        "metaphysics",
        "meditation",
        "god",
        "soul",
        "prominent",
        "contained",
        "principle",
        "physic",
        "working",
        "parhelion",
        "descartes",
        "conceived",
        "idea",
        "ambitious",
        "treatise",
        "wrote",
        "mersenne",
        "november",
        "new",
        "residence",
        "amsterdam",
        "intended",
        "explain",
        "one",
        "phenomenon",
        "parhelion",
        "phenomenon",
        "nature",
        "say",
        "whole",
        "physic",
        "work",
        "eventually",
        "became",
        "world",
        "three",
        "part",
        "light",
        "general",
        "treatise",
        "visible",
        "material",
        "nature",
        "man",
        "treatise",
        "physiology",
        "soul",
        "first",
        "two",
        "survive",
        "perhaps",
        "ever",
        "written",
        "treatise",
        "light",
        "treatise",
        "man",
        "work",
        "descartes",
        "decided",
        "suppress",
        "upon",
        "learning",
        "condemnation",
        "galileo",
        "offered",
        "comprehensive",
        "vision",
        "universe",
        "constituted",
        "bare",
        "matter",
        "possessing",
        "property",
        "length",
        "breadth",
        "depth",
        "threedimensional",
        "volume",
        "carved",
        "particle",
        "size",
        "shape",
        "may",
        "motion",
        "rest",
        "interact",
        "quantitative",
        "law",
        "motion",
        "formulated",
        "sustained",
        "god",
        "light",
        "work",
        "described",
        "visible",
        "universe",
        "single",
        "physical",
        "system",
        "operation",
        "formation",
        "planet",
        "transmission",
        "light",
        "sun",
        "physiological",
        "process",
        "human",
        "nonhuman",
        "animal",
        "body",
        "explained",
        "mechanism",
        "matter",
        "arranged",
        "shape",
        "structure",
        "moving",
        "according",
        "three",
        "law",
        "motion",
        "fact",
        "explanation",
        "world",
        "subsequent",
        "principle",
        "made",
        "little",
        "use",
        "three",
        "law",
        "motion",
        "qualitative",
        "manner",
        "law",
        "sustained",
        "notion",
        "matter",
        "move",
        "regularly",
        "straight",
        "line",
        "upon",
        "impact",
        "bit",
        "matter",
        "alter",
        "motion",
        "regular",
        "wayssomething",
        "happens",
        "constantly",
        "full",
        "universe",
        "plenum",
        "conceived",
        "descartes",
        "time",
        "descartes",
        "received",
        "offer",
        "appointment",
        "medical",
        "faculty",
        "bolognaeven",
        "though",
        "yet",
        "made",
        "public",
        "resultswhich",
        "declined",
        "see",
        "manning",
        "suppressing",
        "world",
        "descartes",
        "decided",
        "put",
        "forward",
        "anonymously",
        "limited",
        "sample",
        "new",
        "philosophy",
        "discourse",
        "attached",
        "essay",
        "discourse",
        "recounted",
        "descartes",
        "life",
        "journey",
        "explaining",
        "come",
        "position",
        "doubting",
        "previous",
        "knowledge",
        "seeking",
        "begin",
        "afresh",
        "offered",
        "initial",
        "result",
        "metaphysical",
        "investigation",
        "including",
        "mindbody",
        "dualism",
        "however",
        "engage",
        "deep",
        "skepticism",
        "later",
        "meditation",
        "claim",
        "establish",
        "metaphysically",
        "essence",
        "matter",
        "extension",
        "last",
        "conclusion",
        "presented",
        "merely",
        "hypothesis",
        "whose",
        "fruitfulness",
        "could",
        "tested",
        "proven",
        "perhaps",
        "merely",
        "confirmed",
        "see",
        "mcmullin",
        "result",
        "contained",
        "attached",
        "essay",
        "dioptrics",
        "meteorology",
        "latter",
        "covering",
        "atmospheric",
        "phenomenon",
        "meteorology",
        "descartes",
        "described",
        "general",
        "hypothesis",
        "supposition",
        "nature",
        "matter",
        "offering",
        "account",
        "vapor",
        "salt",
        "wind",
        "cloud",
        "snow",
        "rain",
        "hail",
        "lightning",
        "rainbow",
        "corona",
        "parhelion",
        "hypothesis",
        "follows",
        "water",
        "earth",
        "air",
        "body",
        "surround",
        "u",
        "composed",
        "many",
        "small",
        "part",
        "various",
        "shape",
        "size",
        "never",
        "properly",
        "disposed",
        "exactly",
        "joined",
        "together",
        "remain",
        "many",
        "interval",
        "around",
        "interval",
        "empty",
        "filled",
        "extremely",
        "subtle",
        "matter",
        "mediation",
        "said",
        "action",
        "light",
        "communicated",
        "presented",
        "corpuscularian",
        "basis",
        "physic",
        "denied",
        "atomsandvoid",
        "theory",
        "ancient",
        "atomism",
        "affirmed",
        "body",
        "composed",
        "one",
        "type",
        "matter",
        "infinitely",
        "divisible",
        "particle",
        "corpuscle",
        "also",
        "proclaimed",
        "natural",
        "philosophy",
        "need",
        "substantial",
        "form",
        "real",
        "quality",
        "philosopher",
        "ie",
        "aristotelian",
        "imagine",
        "body",
        "taken",
        "position",
        "treatise",
        "light",
        "said",
        "conceiving",
        "new",
        "world",
        "ie",
        "conception",
        "universe",
        "use",
        "quality",
        "called",
        "heat",
        "cold",
        "moistness",
        "dryness",
        "philosopher",
        "effect",
        "denying",
        "thendominant",
        "scholastic",
        "aristotelian",
        "ontology",
        "explained",
        "natural",
        "body",
        "comprised",
        "prime",
        "matter",
        "informed",
        "substantial",
        "form",
        "explained",
        "quality",
        "hot",
        "cold",
        "really",
        "inhering",
        "body",
        "way",
        "similar",
        "quality",
        "hot",
        "cold",
        "experience",
        "tactually",
        "according",
        "aristotelian",
        "explanation",
        "quality",
        "proper",
        "sensecolor",
        "sound",
        "odor",
        "taste",
        "tactual",
        "qualitiesare",
        "really",
        "inherent",
        "thing",
        "experienced",
        "sensation",
        "resemble",
        "quality",
        "thing",
        "regard",
        "prime",
        "matter",
        "many",
        "scholastic",
        "aristotelian",
        "held",
        "exist",
        "form",
        "substance",
        "something",
        "exist",
        "prime",
        "matter",
        "must",
        "informed",
        "substantial",
        "form",
        "form",
        "active",
        "principle",
        "give",
        "substance",
        "essential",
        "property",
        "four",
        "aristotelian",
        "element",
        "earth",
        "air",
        "fire",
        "water",
        "substantial",
        "form",
        "combined",
        "basic",
        "quality",
        "hot",
        "cold",
        "wet",
        "dry",
        "earth",
        "cold",
        "dry",
        "air",
        "hot",
        "wet",
        "fire",
        "hot",
        "dry",
        "water",
        "cold",
        "wet",
        "element",
        "serve",
        "matter",
        "higher",
        "substantial",
        "form",
        "form",
        "mineral",
        "magnet",
        "living",
        "thing",
        "whether",
        "case",
        "earth",
        "living",
        "thing",
        "rabbit",
        "form",
        "thing",
        "directs",
        "characteristic",
        "activity",
        "earth",
        "activity",
        "approach",
        "center",
        "universe",
        "water",
        "tendency",
        "strongly",
        "accordingly",
        "aristotelian",
        "explained",
        "planet",
        "earth",
        "exists",
        "center",
        "water",
        "surface",
        "new",
        "rabbit",
        "formed",
        "male",
        "rabbit",
        "contributes",
        "seedmatter",
        "form",
        "rabbithood",
        "seedmatter",
        "female",
        "rabbit",
        "form",
        "organizes",
        "matter",
        "shape",
        "rabbit",
        "including",
        "various",
        "organ",
        "physiological",
        "process",
        "newborn",
        "rabbit",
        "behavior",
        "guided",
        "sensitive",
        "soul",
        "rabbitspecific",
        "instance",
        "type",
        "substantial",
        "form",
        "possessed",
        "animal",
        "property",
        "rabbit",
        "whiteness",
        "fur",
        "explained",
        "real",
        "quality",
        "white",
        "inhering",
        "strand",
        "hair",
        "although",
        "world",
        "meteorology",
        "descartes",
        "avoided",
        "outright",
        "denial",
        "substantial",
        "form",
        "real",
        "quality",
        "clear",
        "intended",
        "deny",
        "corr",
        "indeed",
        "claimed",
        "could",
        "explain",
        "quality",
        "matter",
        "motion",
        "light",
        "met",
        "example",
        "explained",
        "color",
        "thing",
        "property",
        "surface",
        "put",
        "spin",
        "particle",
        "light",
        "turn",
        "affect",
        "nerve",
        "retina",
        "affect",
        "brain",
        "causing",
        "sensation",
        "mind",
        "via",
        "matter",
        "effect",
        "immaterial",
        "mind",
        "sensation",
        "color",
        "red",
        "resemble",
        "surface",
        "property",
        "cause",
        "effect",
        "nerve",
        "produce",
        "sensation",
        "experienced",
        "red",
        "apparently",
        "arbitrary",
        "sign",
        "signal",
        "surface",
        "property",
        "object",
        "light",
        "see",
        "also",
        "dioptrics",
        "vi",
        "princ",
        "i",
        "two",
        "consideration",
        "help",
        "explain",
        "descartes",
        "tentative",
        "language",
        "respect",
        "substantial",
        "form",
        "real",
        "quality",
        "first",
        "wrote",
        "work",
        "s",
        "yet",
        "prepared",
        "release",
        "metaphysics",
        "would",
        "support",
        "hypothesis",
        "matter",
        "rule",
        "substantial",
        "form",
        "second",
        "sensitive",
        "prudential",
        "value",
        "directly",
        "attacking",
        "scholastic",
        "aristotelian",
        "position",
        "since",
        "accepted",
        "position",
        "university",
        "education",
        "strongly",
        "supported",
        "orthodox",
        "theologian",
        "catholic",
        "protestant",
        "discourse",
        "appeared",
        "descartes",
        "received",
        "letter",
        "query",
        "challenge",
        "various",
        "doctrine",
        "including",
        "avoidance",
        "substantial",
        "form",
        "real",
        "quality",
        "argument",
        "distinction",
        "mind",
        "body",
        "view",
        "natural",
        "philosophical",
        "hypothesis",
        "could",
        "proven",
        "confirmed",
        "empirically",
        "observed",
        "effect",
        "explain",
        "disc",
        "vi",
        "correspondence",
        "merit",
        "close",
        "study",
        "discussion",
        "hypothesisconfirmation",
        "science",
        "corr",
        "reply",
        "objection",
        "concerning",
        "metaphysics",
        "explanation",
        "left",
        "radical",
        "skeptical",
        "argument",
        "work",
        "since",
        "written",
        "french",
        "wide",
        "audience",
        "including",
        "woman",
        "descartes",
        "fathered",
        "daughter",
        "named",
        "francine",
        "mother",
        "descartes",
        "housekeeper",
        "helena",
        "jan",
        "lived",
        "descartes",
        "part",
        "time",
        "latter",
        "s",
        "arranging",
        "daughter",
        "live",
        "female",
        "relative",
        "sake",
        "education",
        "learned",
        "death",
        "september",
        "saddened",
        "greatly",
        "rodislewis",
        "subsequently",
        "contributed",
        "dowry",
        "helena",
        "marriage",
        "watson"
    ]
}