{
    "main_text": "The New Science\n4. The New Science\n\nDuring Descartes’ school days, there were signs that the\nscientific conception of the universe was changing. Recall that\nGalileo’s discovery of the four moons of Jupiter was celebrated\nat La Flèche in 1610 (see Galileo 1610). More generally,\nCopernicus had, in the previous century, argued forcefully that the\nsun, not the earth, is at (or near) the center of the solar system\n(Copernicus 1543). Early in the seventeenth century, Johannes Kepler\n(1604) announced new results in optics, concerning the formation of\nimages, the theory of lenses, and the fact that the retinal image\nplays a central role in vision. By the early 1630s, Descartes was\naware of William Harvey’s claim that the blood circulates in the\nbody (Corr. 1:263).\n\nDescartes contributed new results to the mathematical description of\nnature, as developer of an accurate model of the rainbow\n(Met. VIII) and as a discoverer of the sine law of\nrefraction. (Descartes was the first to publish the sine law, in\nDiop. II. Previously, the law had been discovered by the\nIslamic investigator Ibn Saul [10th c.], the English astronomer Thomas\nHarriot [ca. 1600], and the Dutch mathematician and astronomer\nWillebrord Snell [ca. 1620]. See Sabra 1967, 99–103, and Rashed\n1990.) As significant as these results are, his primary contribution\nto the “new science,” or the “new mechanical\nphilosophy,” lay in his general vision of a mechanistic approach\nto nature, together with many details of that vision for specific\nnatural phenomena (such as magnetism, the formation of the solar\nsystem, and sensory physiology), so as to provide a comprehensive\nalternative to the dominant Aristotelian physics. The process of\nforming a new science continued after Descartes, reaching a high point\nin Newton’s mechanics, including a consolidation of the\nCopernican hypothesis.\n\nIn the textbooks of Aristotelian physics of Descartes’ day, it\nwas common to divide physics into “general” and\n“special.” General physics pertained to the basic\nAristotelian principles for analyzing natural substances: form,\nmatter, privation, cause, place, time, motion. Special physics\nconcerned actually existing natural entities, divided into inanimate\nand animate. Inanimate physics further divided into terrestrial and\ncelestial, in accordance with the Aristotelian belief that the earth\nis at the center of the universe and differs in nature from the\nheavens (including the moon, and everything beyond it). Inanimate\nterrestrial physics first covered the four elements (earth, air, fire,\nand water), then the “mixed” bodies composed from them,\nincluding the various mineral kinds. Animate terrestrial physics\nconcerned the various powers that Aristotelians ascribed to ensouled\nbeings, where the soul is considered as a principle of life\n(possessing vital as well as mental or cognitive powers). In the\nsimplest textbooks, the powers of the soul were divided into three\ngroups: vegetative (including nutrition, growth, and reproduction),\nwhich pertained to both plants and animals; sensitive (including\nexternal senses, internal senses such as memory and imagination,\nappetite, and motion), which pertains only to animals, both nonhuman\nand human; and rational powers, pertaining to human beings alone. All\nthe bodies in both inanimate and animate terrestrial physics were\ngoverned by a “form” or active principle, as described in\nSection 1.3.\n\nDescartes’ ambition was to provide replacements for all the main\nparts of Aristotelian physics. In his physics, there is only one\nmatter and it has no active forms. He dissolved the boundary that made\ncelestial and terrestrial differ in kind. His one matter possesses the\nproperties of size, shape, position, and motion; it is infinitely\ndivisible and constitutes space (see Sec. 3.3). This matter is\ngoverned by three laws of motion, including a precursor to\nNewton’s law of inertia (but without the notion of vector\nforces) and a law of impact. Descartes’ matter possessed no\n“force” or active agency; the laws of motion as decreed by\nGod were sustained by his activity. Earth, air, fire, and water were\nsimply four among many natural kinds, all distinguished simply by the\ncharacteristic sizes, shapes, positions, and motions of their\nparts.\n\nAlthough Descartes nominally subscribed to the biblical story of\ncreation, in his natural philosophy he presented the hypothesis that\nthe universe began as a chaotic soup of particles in motion and that\neverything else was subsequently formed as a result of patterns that\ndeveloped within this moving matter (Princ. III.45; also\nDisc. V, 6:45). Thus, he conceived that many suns formed,\naround which planets coalesced. On these planets, mountains and seas\nformed, as did metals, magnets, and atmospheric phenomena such as\nclouds and rain. The planets themselves are carried around the sun in\ntheir orbits by a fluid medium that rotates like a whirlpool or\nvortex. Objects fall to earth not because of any intrinsic\n“form” that directs them to the center of the universe,\nand also not because of a force of attraction or other\ndownward-tending force. Rather, they are driven down by the whirling\nparticles of the surrounding ether. All cases of apparent action at a\ndistance, including magnetism, must be explained through the contact\nof particle on particle. Magnetism is explained by corkscrew-shaped\nparticles that spew forth from the poles of the earth and flow from\nnorth to south or vice versa, causing magnetized needles to align with\ntheir flow (Princ. IV.133–83). To explain magnetic\npolarity, Descartes posited that the particles exiting from the south\npole are threaded in one direction and those from the north are\nthreaded oppositely (like the oppositely threaded spindles on bicycle\npedals). (On Descartes’ physics, looking back from a\npost-Newtonian conception of that discipline, see Slowik 2021.)\n\nDescartes also wanted to provide an account of the formation of plants\nand animals by mechanical causes (Disc. V, 6:44–45),\nbut he did not succeed in framing an account that he was willing to\npublish (so that only portions of his physiology were revealed in the\nDiscourse, Dioptrics, Meditations,\nPrinciples, and Passions). In writings that were\npublished only posthumously (in 1664), including the Treatise on\nMan, he developed an extensive physiological description of\nanimal bodies, in which he explained the functions of life in a purely\nmechanical manner, without appeal to a soul or vital principle. (The\nTreatise on Man was circulated in manuscript form during\nDescartes’ lifetime [5:112].) The Description of the Human\nBody (1664) included his speculations on embryogenesis.\n\nIn mechanizing the concept of living thing, Descartes did not deny the\ndistinction between living and nonliving, but he redrew the line\nbetween ensouled and unensouled beings. In his view, among earthly\nbeings, only humans have souls. He thus equated soul with mind: souls\naccount for intellection and volition, including conscious sensory\nexperiences, conscious experience of images, and consciously\nexperienced memories. He regarded nonhuman animals as machines, devoid\nof mind and consciousness, and hence lacking in sentience. (Although\nDescartes’ followers understood him to have denied all feeling\nto animals, some recent scholars question this interpretation; on this\ncontroversy, see Cottingham 1998 and Hatfield 2008.) Consequently,\nDescartes was required to explain all of the powers that Aristotelians\nhad ascribed to the vegetative and sensitive soul by means of purely\nmaterial and mechanistic processes (Man 11:202). These\nmechanistic explanations extended not merely to nutrition, growth, and\nreproduction, but also to the functions of the external and internal\nsenses, including the ability of nonhuman animals to respond via their\nsense organs in a situationally appropriate manner: to approach things\nthat are beneficial to their body (including food) and to avoid danger\n(as the sheep avoids the wolf).\n\nIn the Treatise on Man and Passions, Descartes\ndescribed purely mechanical processes in the sense organs, brain, and\nmuscles, that were to account for the functions of the sensitive soul.\nThese processes involved “animal spirits,” or fine fluid\nmatter as distilled from the blood at the base of the brain and\ndistributed down the nerves to cause muscle motions in accordance with\ncurrent sensory stimulation. The brain structures that mediate\nbehavior may be innate or acquired. Descartes ascribed some things\nthat animals do to instinct; he explained other aspects of their\nbehavior through a kind of mechanistic associative memory. He regarded\nhuman physiology as similar to nonhuman animal physiology, anent both\nvegetative and (some) sensitive functions—those sensitive\nfunctions that do not involve consciousness or intelligence:\n\nNow a very large number of the motions occurring inside us do not\ndepend in any way on the mind. These include heartbeat, digestion,\nnutrition, respiration when we are asleep, and also such waking\nactions as walking, singing, and the like, when these occur without\nthe mind attending to them. When people take a fall, and stick out\ntheir hands so as to protect their head, it is not reason that\ninstructs them to do this; it is simply that the sight of the\nimpending fall reaches the brain and sends the animal spirits into the\nnerves in the manner necessary to produce this movement even without\nany mental volition, just as it would be produced in a machine.\n(Fourth Replies to Objections, Med. 7:229–30)\n\n\nMuch human behavior occurs without intervention from the mind.\n\nThe fact that Descartes offered mechanistic explanations for many\nfeatures of nature does not mean that his explanations were\nsuccessful. His followers and detractors debated the success of his\nproposals for nearly a century after his death. His accounts of\nmagnetism and gravity were challenged. Leibniz questioned the\ncoherence of Descartes’ laws of motion and impact. Newton\noffered his own laws of motion and an inverse square law of\ngravitational attraction. His force-based account of orbital planetary\nmotions replaced Descartes’ vortexes. Others struggled to make\nDescartes’ physiology work. There were also deeper challenges.\nSome wondered whether Descartes could explain how his infinitely\ndivisible matter coalesces into solid bodies. Why shouldn’t\ncollections of particles act like puffs of smoke, that separate upon\ncontact with larger particles? Indeed, how do particles themselves\ncohere?\n\nSuch problems were real, and Descartes’ physics was abandoned\nover the course of the eighteenth century. Nonetheless, it provided a\nconception for a comprehensive replacement of Aristotelian physics\nthat persisted in the Newtonian vision of a unified physics of the\ncelestial and terrestrial realms, and that continued in the\nmechanistic vision of life as revived in the nineteenth century. (On\nthe rise of the new science, or what is sometimes called the\n“scientific revolution,” see Henry 2008 and Shapin 1996;\nfor a survey of Descartes’ natural philosophy, see Gaukroger\n2002.)\n",
    "section_title": "4. The New Science",
    "entry_title": "René Descartes",
    "hierarchy_title": "René Descartes || The New Science",
    "tokenized_text": [
        "new",
        "science",
        "new",
        "science",
        "descartes",
        "school",
        "day",
        "sign",
        "scientific",
        "conception",
        "universe",
        "changing",
        "recall",
        "galileo",
        "discovery",
        "four",
        "moon",
        "jupiter",
        "celebrated",
        "la",
        "flèche",
        "see",
        "galileo",
        "generally",
        "copernicus",
        "previous",
        "century",
        "argued",
        "forcefully",
        "sun",
        "earth",
        "near",
        "center",
        "solar",
        "system",
        "copernicus",
        "early",
        "seventeenth",
        "century",
        "johannes",
        "kepler",
        "announced",
        "new",
        "result",
        "optic",
        "concerning",
        "formation",
        "image",
        "theory",
        "lens",
        "fact",
        "retinal",
        "image",
        "play",
        "central",
        "role",
        "vision",
        "early",
        "s",
        "descartes",
        "aware",
        "william",
        "harvey",
        "claim",
        "blood",
        "circulates",
        "body",
        "corr",
        "descartes",
        "contributed",
        "new",
        "result",
        "mathematical",
        "description",
        "nature",
        "developer",
        "accurate",
        "model",
        "rainbow",
        "met",
        "viii",
        "discoverer",
        "sine",
        "law",
        "refraction",
        "descartes",
        "first",
        "publish",
        "sine",
        "law",
        "diop",
        "ii",
        "previously",
        "law",
        "discovered",
        "islamic",
        "investigator",
        "ibn",
        "saul",
        "th",
        "c",
        "english",
        "astronomer",
        "thomas",
        "harriot",
        "ca",
        "dutch",
        "mathematician",
        "astronomer",
        "willebrord",
        "snell",
        "ca",
        "see",
        "sabra",
        "rashed",
        "significant",
        "result",
        "primary",
        "contribution",
        "new",
        "science",
        "new",
        "mechanical",
        "philosophy",
        "lay",
        "general",
        "vision",
        "mechanistic",
        "approach",
        "nature",
        "together",
        "many",
        "detail",
        "vision",
        "specific",
        "natural",
        "phenomenon",
        "magnetism",
        "formation",
        "solar",
        "system",
        "sensory",
        "physiology",
        "provide",
        "comprehensive",
        "alternative",
        "dominant",
        "aristotelian",
        "physic",
        "process",
        "forming",
        "new",
        "science",
        "continued",
        "descartes",
        "reaching",
        "high",
        "point",
        "newton",
        "mechanic",
        "including",
        "consolidation",
        "copernican",
        "hypothesis",
        "textbook",
        "aristotelian",
        "physic",
        "descartes",
        "day",
        "common",
        "divide",
        "physic",
        "general",
        "special",
        "general",
        "physic",
        "pertained",
        "basic",
        "aristotelian",
        "principle",
        "analyzing",
        "natural",
        "substance",
        "form",
        "matter",
        "privation",
        "cause",
        "place",
        "time",
        "motion",
        "special",
        "physic",
        "concerned",
        "actually",
        "existing",
        "natural",
        "entity",
        "divided",
        "inanimate",
        "animate",
        "inanimate",
        "physic",
        "divided",
        "terrestrial",
        "celestial",
        "accordance",
        "aristotelian",
        "belief",
        "earth",
        "center",
        "universe",
        "differs",
        "nature",
        "heaven",
        "including",
        "moon",
        "everything",
        "beyond",
        "inanimate",
        "terrestrial",
        "physic",
        "first",
        "covered",
        "four",
        "element",
        "earth",
        "air",
        "fire",
        "water",
        "mixed",
        "body",
        "composed",
        "including",
        "various",
        "mineral",
        "kind",
        "animate",
        "terrestrial",
        "physic",
        "concerned",
        "various",
        "power",
        "aristotelian",
        "ascribed",
        "ensouled",
        "being",
        "soul",
        "considered",
        "principle",
        "life",
        "possessing",
        "vital",
        "well",
        "mental",
        "cognitive",
        "power",
        "simplest",
        "textbook",
        "power",
        "soul",
        "divided",
        "three",
        "group",
        "vegetative",
        "including",
        "nutrition",
        "growth",
        "reproduction",
        "pertained",
        "plant",
        "animal",
        "sensitive",
        "including",
        "external",
        "sens",
        "internal",
        "sens",
        "memory",
        "imagination",
        "appetite",
        "motion",
        "pertains",
        "animal",
        "nonhuman",
        "human",
        "rational",
        "power",
        "pertaining",
        "human",
        "being",
        "alone",
        "body",
        "inanimate",
        "animate",
        "terrestrial",
        "physic",
        "governed",
        "form",
        "active",
        "principle",
        "described",
        "section",
        "descartes",
        "ambition",
        "provide",
        "replacement",
        "main",
        "part",
        "aristotelian",
        "physic",
        "physic",
        "one",
        "matter",
        "active",
        "form",
        "dissolved",
        "boundary",
        "made",
        "celestial",
        "terrestrial",
        "differ",
        "kind",
        "one",
        "matter",
        "posse",
        "property",
        "size",
        "shape",
        "position",
        "motion",
        "infinitely",
        "divisible",
        "constitutes",
        "space",
        "see",
        "sec",
        "matter",
        "governed",
        "three",
        "law",
        "motion",
        "including",
        "precursor",
        "newton",
        "law",
        "inertia",
        "without",
        "notion",
        "vector",
        "force",
        "law",
        "impact",
        "descartes",
        "matter",
        "possessed",
        "force",
        "active",
        "agency",
        "law",
        "motion",
        "decreed",
        "god",
        "sustained",
        "activity",
        "earth",
        "air",
        "fire",
        "water",
        "simply",
        "four",
        "among",
        "many",
        "natural",
        "kind",
        "distinguished",
        "simply",
        "characteristic",
        "size",
        "shape",
        "position",
        "motion",
        "part",
        "although",
        "descartes",
        "nominally",
        "subscribed",
        "biblical",
        "story",
        "creation",
        "natural",
        "philosophy",
        "presented",
        "hypothesis",
        "universe",
        "began",
        "chaotic",
        "soup",
        "particle",
        "motion",
        "everything",
        "else",
        "subsequently",
        "formed",
        "result",
        "pattern",
        "developed",
        "within",
        "moving",
        "matter",
        "princ",
        "iii",
        "also",
        "disc",
        "v",
        "thus",
        "conceived",
        "many",
        "sun",
        "formed",
        "around",
        "planet",
        "coalesced",
        "planet",
        "mountain",
        "sea",
        "formed",
        "metal",
        "magnet",
        "atmospheric",
        "phenomenon",
        "cloud",
        "rain",
        "planet",
        "carried",
        "around",
        "sun",
        "orbit",
        "fluid",
        "medium",
        "rotates",
        "like",
        "whirlpool",
        "vortex",
        "object",
        "fall",
        "earth",
        "intrinsic",
        "form",
        "directs",
        "center",
        "universe",
        "also",
        "force",
        "attraction",
        "downwardtending",
        "force",
        "rather",
        "driven",
        "whirling",
        "particle",
        "surrounding",
        "ether",
        "case",
        "apparent",
        "action",
        "distance",
        "including",
        "magnetism",
        "must",
        "explained",
        "contact",
        "particle",
        "particle",
        "magnetism",
        "explained",
        "corkscrewshaped",
        "particle",
        "spew",
        "forth",
        "pole",
        "earth",
        "flow",
        "north",
        "south",
        "vice",
        "versa",
        "causing",
        "magnetized",
        "needle",
        "align",
        "flow",
        "princ",
        "iv",
        "explain",
        "magnetic",
        "polarity",
        "descartes",
        "posited",
        "particle",
        "exiting",
        "south",
        "pole",
        "threaded",
        "one",
        "direction",
        "north",
        "threaded",
        "oppositely",
        "like",
        "oppositely",
        "threaded",
        "spindle",
        "bicycle",
        "pedal",
        "descartes",
        "physic",
        "looking",
        "back",
        "postnewtonian",
        "conception",
        "discipline",
        "see",
        "slowik",
        "descartes",
        "also",
        "wanted",
        "provide",
        "account",
        "formation",
        "plant",
        "animal",
        "mechanical",
        "cause",
        "disc",
        "v",
        "succeed",
        "framing",
        "account",
        "willing",
        "publish",
        "portion",
        "physiology",
        "revealed",
        "discourse",
        "dioptrics",
        "meditation",
        "principle",
        "passion",
        "writing",
        "published",
        "posthumously",
        "including",
        "treatise",
        "man",
        "developed",
        "extensive",
        "physiological",
        "description",
        "animal",
        "body",
        "explained",
        "function",
        "life",
        "purely",
        "mechanical",
        "manner",
        "without",
        "appeal",
        "soul",
        "vital",
        "principle",
        "treatise",
        "man",
        "circulated",
        "manuscript",
        "form",
        "descartes",
        "lifetime",
        "description",
        "human",
        "body",
        "included",
        "speculation",
        "embryogenesis",
        "mechanizing",
        "concept",
        "living",
        "thing",
        "descartes",
        "deny",
        "distinction",
        "living",
        "nonliving",
        "redrew",
        "line",
        "ensouled",
        "unensouled",
        "being",
        "view",
        "among",
        "earthly",
        "being",
        "human",
        "soul",
        "thus",
        "equated",
        "soul",
        "mind",
        "soul",
        "account",
        "intellection",
        "volition",
        "including",
        "conscious",
        "sensory",
        "experience",
        "conscious",
        "experience",
        "image",
        "consciously",
        "experienced",
        "memory",
        "regarded",
        "nonhuman",
        "animal",
        "machine",
        "devoid",
        "mind",
        "consciousness",
        "hence",
        "lacking",
        "sentience",
        "although",
        "descartes",
        "follower",
        "understood",
        "denied",
        "feeling",
        "animal",
        "recent",
        "scholar",
        "question",
        "interpretation",
        "controversy",
        "see",
        "cottingham",
        "hatfield",
        "consequently",
        "descartes",
        "required",
        "explain",
        "power",
        "aristotelian",
        "ascribed",
        "vegetative",
        "sensitive",
        "soul",
        "mean",
        "purely",
        "material",
        "mechanistic",
        "process",
        "man",
        "mechanistic",
        "explanation",
        "extended",
        "merely",
        "nutrition",
        "growth",
        "reproduction",
        "also",
        "function",
        "external",
        "internal",
        "sens",
        "including",
        "ability",
        "nonhuman",
        "animal",
        "respond",
        "via",
        "sense",
        "organ",
        "situationally",
        "appropriate",
        "manner",
        "approach",
        "thing",
        "beneficial",
        "body",
        "including",
        "food",
        "avoid",
        "danger",
        "sheep",
        "avoids",
        "wolf",
        "treatise",
        "man",
        "passion",
        "descartes",
        "described",
        "purely",
        "mechanical",
        "process",
        "sense",
        "organ",
        "brain",
        "muscle",
        "account",
        "function",
        "sensitive",
        "soul",
        "process",
        "involved",
        "animal",
        "spirit",
        "fine",
        "fluid",
        "matter",
        "distilled",
        "blood",
        "base",
        "brain",
        "distributed",
        "nerve",
        "cause",
        "muscle",
        "motion",
        "accordance",
        "current",
        "sensory",
        "stimulation",
        "brain",
        "structure",
        "mediate",
        "behavior",
        "may",
        "innate",
        "acquired",
        "descartes",
        "ascribed",
        "thing",
        "animal",
        "instinct",
        "explained",
        "aspect",
        "behavior",
        "kind",
        "mechanistic",
        "associative",
        "memory",
        "regarded",
        "human",
        "physiology",
        "similar",
        "nonhuman",
        "animal",
        "physiology",
        "anent",
        "vegetative",
        "sensitive",
        "functionsthose",
        "sensitive",
        "function",
        "involve",
        "consciousness",
        "intelligence",
        "large",
        "number",
        "motion",
        "occurring",
        "inside",
        "u",
        "depend",
        "way",
        "mind",
        "include",
        "heartbeat",
        "digestion",
        "nutrition",
        "respiration",
        "asleep",
        "also",
        "waking",
        "action",
        "walking",
        "singing",
        "like",
        "occur",
        "without",
        "mind",
        "attending",
        "people",
        "take",
        "fall",
        "stick",
        "hand",
        "protect",
        "head",
        "reason",
        "instructs",
        "simply",
        "sight",
        "impending",
        "fall",
        "reach",
        "brain",
        "sends",
        "animal",
        "spirit",
        "nerve",
        "manner",
        "necessary",
        "produce",
        "movement",
        "even",
        "without",
        "mental",
        "volition",
        "would",
        "produced",
        "machine",
        "fourth",
        "reply",
        "objection",
        "med",
        "much",
        "human",
        "behavior",
        "occurs",
        "without",
        "intervention",
        "mind",
        "fact",
        "descartes",
        "offered",
        "mechanistic",
        "explanation",
        "many",
        "feature",
        "nature",
        "mean",
        "explanation",
        "successful",
        "follower",
        "detractor",
        "debated",
        "success",
        "proposal",
        "nearly",
        "century",
        "death",
        "account",
        "magnetism",
        "gravity",
        "challenged",
        "leibniz",
        "questioned",
        "coherence",
        "descartes",
        "law",
        "motion",
        "impact",
        "newton",
        "offered",
        "law",
        "motion",
        "inverse",
        "square",
        "law",
        "gravitational",
        "attraction",
        "forcebased",
        "account",
        "orbital",
        "planetary",
        "motion",
        "replaced",
        "descartes",
        "vortex",
        "others",
        "struggled",
        "make",
        "descartes",
        "physiology",
        "work",
        "also",
        "deeper",
        "challenge",
        "wondered",
        "whether",
        "descartes",
        "could",
        "explain",
        "infinitely",
        "divisible",
        "matter",
        "coalesces",
        "solid",
        "body",
        "collection",
        "particle",
        "act",
        "like",
        "puff",
        "smoke",
        "separate",
        "upon",
        "contact",
        "larger",
        "particle",
        "indeed",
        "particle",
        "cohere",
        "problem",
        "real",
        "descartes",
        "physic",
        "abandoned",
        "course",
        "eighteenth",
        "century",
        "nonetheless",
        "provided",
        "conception",
        "comprehensive",
        "replacement",
        "aristotelian",
        "physic",
        "persisted",
        "newtonian",
        "vision",
        "unified",
        "physic",
        "celestial",
        "terrestrial",
        "realm",
        "continued",
        "mechanistic",
        "vision",
        "life",
        "revived",
        "nineteenth",
        "century",
        "rise",
        "new",
        "science",
        "sometimes",
        "called",
        "scientific",
        "revolution",
        "see",
        "henry",
        "shapin",
        "survey",
        "descartes",
        "natural",
        "philosophy",
        "see",
        "gaukroger"
    ]
}