{
    "main_text": "The Cogito and Doubt || Cogito Ergo Sum\n4.1 Cogito Ergo Sum\n\nFamously, Descartes puts forward a very simple candidate as\n(what CSM translate as being) the “first item of knowledge\n[cognition]” (Med. 3, AT 7:35, CSM 2:24). The\ncandidate is suggested by methodical doubt – by the very\neffort at thinking all my thoughts might be mistaken.\nEarly in the Second Meditation, the meditator observes:\n\nI have convinced myself that there is absolutely nothing in the world,\nno sky, no earth, no minds, no bodies. Does it now follow that I too\ndo not exist? No: if I convinced myself of something then I certainly\nexisted. But there is a deceiver of supreme power and cunning who is\ndeliberately and constantly deceiving me. In that case I too\nundoubtedly exist, if he is deceiving me; and let him deceive me as\nmuch as he can, he will never bring it about that I am nothing so long\nas I think that I am something. So after considering everything very\nthoroughly, I must finally conclude that this proposition, I\nam, I exist, is necessarily true whenever it is put\nforward by me or conceived in my mind. (AT 7:25, CSM 2:16f)\n\n\nAs the canonical formulation has it, I think therefore I\nam (Latin: cogito ergo sum; French: je pense, \ndonc je suis) – a formulation that does not\nexpressly appear in the Meditations. Descartes regards\nthe ‘cogito’ (as it is often referred to) as\nthe “first and most certain of all to occur to anyone who\nphilosophizes in an orderly way” (Prin. 1:7, AT8a:7,\nCSM 1:195).\n\nIs the great certainty of the cogito supposed to attach\nto the “I think,” the “I am,” or the\n“therefore” (i.e., their logical relation)? Presumably,\nit must attach to all of these, if the cogito is to play the\nfoundational role Descartes assigns to it. But this answer can seem to\ndepend on whether the cogito is understood as an inference or\nan intuition – an issue we address below.\n\nTesting the cogito by means of methodical doubt is supposed\nto reveal its unshakable certainty. Hyperbolic doubt helps me\nappreciate that the existence of my body is subject to doubt, whereas\nthe existence of my thinking is not. The very attempt at thinking\naway my thinking is indeed self-stultifying.\n\nThe cogito raises numerous philosophical questions and has\ngenerated an enormous literature. The most significant ongoing debate\nconcerns whether Descartes intends the cogito to be an\nintuition (i.e., roughly, self-evident), or instead an\ninference.\n\nIn an influential 1962 paper, Jaakko Hintikka’s argues that it\n\nshould be understood non-inferentially, as a performative utterance.\nOn his analysis, I exist doesn’t follow logically from\nI think, nor does Descartes suppose otherwise. Rather, the\ntransition from I think to I exist is non-logical\n– indeed, the statement that “I do not exist” is not\nlogically incoherent. The key point, according to Hintikka, is that\nthe very act of thinking that statement – the cognitive\nperformance – is existentially incoherent: I cannot\nboth think the statement and believe it to be true. Hintikka\ntakes the emphasis on “cogito” as intended “to\nexpress the performatory character of Descartes’s insight; it\nrefers to the ‘performance’ (to the act of thinking)\nthrough which the sentence ‘I exist’ may be said to verify\nitself” (1962, 17).\n\nThe following Second Replies text can seem supportive of a\nnon-inferential reading:\n\nWhen someone says “I am thinking, therefore I am, or I\nexist,” he does not deduce existence from thought by means of a\nsyllogism, but recognizes it as something self-evident by a simple\nintuition of the mind. (Replies 2, AT 7:140, CSM 2:100)\n\n\nHowever, as Margaret Wilson correctly observes, “the claim that\nthe cogito is an inference … is not equivalent to\nthe claim that it is a syllogism” (1978, 56). The passage only\nexpressly rejects the effort to understand the cogito in\nterms of syllogism, but not necessarily in terms of inference.\n\nFurther, it should be noted that inferential interpretations need not\nreject that the cogito counts also as an intuition.\nThere’s no inconsistency in claiming a self-evident grasp of a\nproposition that has inferential structure. It is indeed widely held\namong philosophers that modus ponens is self-evident, yet it\ncontains an inference. In short, that a statement contains an\ninference does not entail that one’s acceptance of it is\ngrounded in inference – a fact applicable to the\ncogito. Edwin Curley helpfully notes that Descartes\n“consistently blurs the distinction between inferences and\npropositions by referring to the whole formula ‘I think,\ntherefore I am’ as a truth, a first principle, a proposition,\nand a conclusion” (1978, 79). Anthony Kenny adds that, for \nDescartes, “what is from one point of view intuited is from \nanother point of view deduced” (1968, 55), citing\nRules 3 as support.\n\nA related point concerns the absence of an express\n‘ergo’ (‘therefore’) in the Second\nMeditation account – as if thereby indicating the absence of \ninference in that passage. However, the Second Meditation passage\nis arguably the one place (of his various published treatments)\nwhere Descartes explicitly details a line of inferential \nreflection leading up to the conclusion that I am, I \nexist. His other treatments merely say the \n‘therefore’; the Second Meditation unpacks it.\n\nWhatever the cogito’s inferential status, it is\nworth noting a twofold observation of Barry Stroud: “a\nthinker obviously could never be wrong in thinking ‘I\nthink’,” moreover, “no one who thinks could\nthink falsely that he exists” (2008, 518).\n\nFurther issues about the cogito are worth clarifying\n– let’s cover a few points in summary fashion. First,\na first-person formulation is essential to the certainty of the\ncogito. Third-person claims, such as “Icarus\nthinks,” or “Descartes thinks,” are not unshakably\ncertain – not for me, at any rate; only the occurrence\nof my thought has a chance of resisting hyperbolic doubt.\nThere are a number of passages in which Descartes refers to a\nthird-person version of the cogito. But none of these occurs\nin the context of establishing the actual existence of a particular\nthinker (in contrast with affirming the conditional, general result \nthat whatever thinks exists).\n\nSecond, a present tense formulation is essential to the certainty of\nthe cogito. It’s no good to reason that “I\nexisted last Tuesday, since I recall that I was thinking on that\nday.” For all I know, I’m now merely dreaming about that\noccasion. Nor does it work to reason that “I’ll continue\nto exist, since I’m now thinking.” As the meditator\nremarks, “it could be that were I totally to cease from\nthinking, I should totally cease to exist” (Med. 2, AT 7:27, CSM\n2:18). The privileged certainty of the cogito is grounded in\nthe “manifest contradiction” (AT 7:36, CSM 2:25) of trying\nto think away my present thinking.\n\nThird, the certainty of the cogito depends on being\nformulated in terms of cogitatio – i.e., my thinking,\nor awareness/consciousness more generally. Any mode of thinking is\nsufficient, including doubting, affirming, denying, willing,\nunderstanding, imagining, and so on (cf. Med. 2, AT 7:28). My\nbodily activities, however, are insufficient. For instance,\nit’s no good to reason that “I exist, since I am\nwalking,” because methodical doubt calls into question the\nexistence of my legs. Maybe I’m just dreaming that I have legs.\nA simple revision, such as “I exist, since it seems\nI’m walking,” restores the anti-sceptical potency (cf.\nReplies 5, AT 7:352; Prin. 1:9).\n\nFourth, a caveat is in order. That Descartes rejects formulations\npresupposing the existence of a body commits him to no more than an\nepistemic distinction between the ideas of mind and body, but not\n(yet) an ontological distinction (as in mind-body dualism). Indeed, in\nthe passage following the cogito, Descartes has his meditator\nsay: \n\nAnd yet may it not perhaps be the case that these very things which I\nam supposing to be nothing [e.g., “that structure of limbs which\nis called a human body”], because they are unknown to me, are in\nreality identical with the “I” of which I am aware? I do\nnot know, and for the moment I shall not argue the point, since I can\nmake judgements only about things which are known to me. (Med. 2, AT\n7:27, CSM 2:18)\n\n\nIn short, the intended epistemic success of the cogito does\nnot presuppose any particular mind-body ontology.\n\nFinally, Descartes’ reference to an “I”, in the\n“I think,” is not intended to presuppose the existence of\na substantial self. In the very next sentence following the\ninitial statement of the cogito, the meditator says:\n“But I do not yet have a sufficient understanding of what this\n‘I’ is, that now necessarily exists” (AT 7:25, CSM\n2:17). As Stephen Menn writes:\n\nAlthough the Meditator now knows that he is, he does not seem\nto know what he is: his old conception of his nature has been\ncalled into doubt, and he does not seem to have anything new to\nreplace it. (1998, 249)\n\n\nThe cogito purports to yield certainty that I exist\ninsofar as I am a thinking thing, whatever that turns out\nto be. The ensuing discussion is intended to help arrive at an\nunderstanding of the ontological nature of the thinking subject.\n\nMore generally, we should distinguish issues of epistemic and\nontological dependence. In the final analysis, Descartes thinks he\nshows that the occurrence of thought depends (ontologically) on the\nexistence of a substantial self – to wit, on the existence of an\ninfinite substance, namely God (cf. Med. 3, AT 7:48ff). But he denies\nthat an acceptance of these ontological matters is epistemically prior\nto the cogito: its certainty is not supposed to depend\n(epistemically) on the abstruse metaphysics that Descartes thinks he\neventually establishes. (See Vinci 1998 for an alternative\nreading.)\n\nIf the cogito does not presuppose a substantial self, what\nthen is the epistemic basis for injecting the ‘I’ into the\n“I think”? Some critics have complained that, in referring\nto the “I”, Descartes begs the question by presupposing\nwhat he means to establish in the “I exist.” Among the\ncritics, Bertrand Russell objects that “the word ‘I’\nis really illegitimate.” Echoing the 18th century thinker, Georg\nLichtenberg, Russell writes that Descartes should have, instead,\nstated “his ultimate premiss in the form ‘there are\nthoughts’.” Russell adds that “the word\n‘I’ is grammatically convenient, but does not describe a\ndatum” (1945, 567). Accordingly, “there is pain” and\n“I am in pain” have different contents, and Descartes is\nentitled only to the former.\n\nOne effort at reply has it that introspection reveals more than what\nRussell allows – it reveals the subjective character of\nexperience. On this view, there is more to the experiential story of\nbeing in pain than is expressed by saying that there is\npain: the experience includes the feeling of pain plus a\npoint-of-view – an experiential addition that’s\ndifficult to characterize except by adding that “I” am in\npain, that the pain is mine. Importantly, my awareness of\nthis subjective feature of experience does not depend on an awareness\nof the metaphysical nature of a thinking subject. If we take Descartes\nto be using ‘I’ to signify this subjective character, then\nhe is not smuggling in something that’s not already there: the\n“I”-ness of consciousness turns out to be (contra Russell)\na primary datum of experience. And though, as Hume persuasively\nargues, introspection reveals no sense impressions suited\nto the role of a thinking subject, Descartes, unlike Hume, has no\nneed to derive all our ideas from sense impressions. Descartes’ \nidea of the self does ultimately draw on innate conceptual \nresources.\n\nSetting aside the philosophical concerns associated with the\ncogito, let’s turn to a further interpretive\nconcern: namely, the issue of whether, at its initial introduction\n(in the Second Meditation), Descartes intends that the\ncogito counts as perfect knowledge.\n",
    "section_title": "4.1 Cogito Ergo Sum",
    "entry_title": "Descartes’ Epistemology",
    "hierarchy_title": "Descartes’ Epistemology || The Cogito and Doubt || Cogito Ergo Sum",
    "tokenized_text": [
        "cogito",
        "doubt",
        "cogito",
        "ergo",
        "sum",
        "cogito",
        "ergo",
        "sum",
        "famously",
        "descartes",
        "put",
        "forward",
        "simple",
        "candidate",
        "csm",
        "translate",
        "first",
        "item",
        "knowledge",
        "cognition",
        "med",
        "csm",
        "candidate",
        "suggested",
        "methodical",
        "doubt",
        "effort",
        "thinking",
        "thought",
        "might",
        "mistaken",
        "early",
        "second",
        "meditation",
        "meditator",
        "observes",
        "convinced",
        "absolutely",
        "nothing",
        "world",
        "sky",
        "earth",
        "mind",
        "body",
        "follow",
        "exist",
        "convinced",
        "something",
        "certainly",
        "existed",
        "deceiver",
        "supreme",
        "power",
        "cunning",
        "deliberately",
        "constantly",
        "deceiving",
        "case",
        "undoubtedly",
        "exist",
        "deceiving",
        "let",
        "deceive",
        "much",
        "never",
        "bring",
        "nothing",
        "long",
        "think",
        "something",
        "considering",
        "everything",
        "thoroughly",
        "must",
        "finally",
        "conclude",
        "proposition",
        "exist",
        "necessarily",
        "true",
        "whenever",
        "put",
        "forward",
        "conceived",
        "mind",
        "csm",
        "f",
        "canonical",
        "formulation",
        "think",
        "therefore",
        "latin",
        "cogito",
        "ergo",
        "sum",
        "french",
        "je",
        "pense",
        "donc",
        "je",
        "suis",
        "formulation",
        "expressly",
        "appear",
        "meditation",
        "descartes",
        "regard",
        "cogito",
        "often",
        "referred",
        "first",
        "certain",
        "occur",
        "anyone",
        "philosophizes",
        "orderly",
        "way",
        "prin",
        "ata",
        "csm",
        "great",
        "certainty",
        "cogito",
        "supposed",
        "attach",
        "think",
        "therefore",
        "ie",
        "logical",
        "relation",
        "presumably",
        "must",
        "attach",
        "cogito",
        "play",
        "foundational",
        "role",
        "descartes",
        "assigns",
        "answer",
        "seem",
        "depend",
        "whether",
        "cogito",
        "understood",
        "inference",
        "intuition",
        "issue",
        "address",
        "testing",
        "cogito",
        "mean",
        "methodical",
        "doubt",
        "supposed",
        "reveal",
        "unshakable",
        "certainty",
        "hyperbolic",
        "doubt",
        "help",
        "appreciate",
        "existence",
        "body",
        "subject",
        "doubt",
        "whereas",
        "existence",
        "thinking",
        "attempt",
        "thinking",
        "away",
        "thinking",
        "indeed",
        "selfstultifying",
        "cogito",
        "raise",
        "numerous",
        "philosophical",
        "question",
        "generated",
        "enormous",
        "literature",
        "significant",
        "ongoing",
        "debate",
        "concern",
        "whether",
        "descartes",
        "intends",
        "cogito",
        "intuition",
        "ie",
        "roughly",
        "selfevident",
        "instead",
        "inference",
        "influential",
        "paper",
        "jaakko",
        "hintikka",
        "argues",
        "understood",
        "noninferentially",
        "performative",
        "utterance",
        "analysis",
        "exist",
        "follow",
        "logically",
        "think",
        "descartes",
        "suppose",
        "otherwise",
        "rather",
        "transition",
        "think",
        "exist",
        "nonlogical",
        "indeed",
        "statement",
        "exist",
        "logically",
        "incoherent",
        "key",
        "point",
        "according",
        "hintikka",
        "act",
        "thinking",
        "statement",
        "cognitive",
        "performance",
        "existentially",
        "incoherent",
        "think",
        "statement",
        "believe",
        "true",
        "hintikka",
        "take",
        "emphasis",
        "cogito",
        "intended",
        "express",
        "performatory",
        "character",
        "descartes",
        "insight",
        "refers",
        "performance",
        "act",
        "thinking",
        "sentence",
        "exist",
        "may",
        "said",
        "verify",
        "following",
        "second",
        "reply",
        "text",
        "seem",
        "supportive",
        "noninferential",
        "reading",
        "someone",
        "say",
        "thinking",
        "therefore",
        "exist",
        "deduce",
        "existence",
        "thought",
        "mean",
        "syllogism",
        "recognizes",
        "something",
        "selfevident",
        "simple",
        "intuition",
        "mind",
        "reply",
        "csm",
        "however",
        "margaret",
        "wilson",
        "correctly",
        "observes",
        "claim",
        "cogito",
        "inference",
        "equivalent",
        "claim",
        "syllogism",
        "passage",
        "expressly",
        "reject",
        "effort",
        "understand",
        "cogito",
        "term",
        "syllogism",
        "necessarily",
        "term",
        "inference",
        "noted",
        "inferential",
        "interpretation",
        "need",
        "reject",
        "cogito",
        "count",
        "also",
        "intuition",
        "inconsistency",
        "claiming",
        "selfevident",
        "grasp",
        "proposition",
        "inferential",
        "structure",
        "indeed",
        "widely",
        "held",
        "among",
        "philosopher",
        "modus",
        "ponens",
        "selfevident",
        "yet",
        "contains",
        "inference",
        "short",
        "statement",
        "contains",
        "inference",
        "entail",
        "one",
        "acceptance",
        "grounded",
        "inference",
        "fact",
        "applicable",
        "cogito",
        "edwin",
        "curley",
        "helpfully",
        "note",
        "descartes",
        "consistently",
        "blur",
        "distinction",
        "inference",
        "proposition",
        "referring",
        "whole",
        "formula",
        "think",
        "therefore",
        "truth",
        "first",
        "principle",
        "proposition",
        "conclusion",
        "anthony",
        "kenny",
        "add",
        "descartes",
        "one",
        "point",
        "view",
        "intuited",
        "another",
        "point",
        "view",
        "deduced",
        "citing",
        "rule",
        "support",
        "related",
        "point",
        "concern",
        "absence",
        "express",
        "ergo",
        "therefore",
        "second",
        "meditation",
        "account",
        "thereby",
        "indicating",
        "absence",
        "inference",
        "passage",
        "however",
        "second",
        "meditation",
        "passage",
        "arguably",
        "one",
        "place",
        "various",
        "published",
        "treatment",
        "descartes",
        "explicitly",
        "detail",
        "line",
        "inferential",
        "reflection",
        "leading",
        "conclusion",
        "exist",
        "treatment",
        "merely",
        "say",
        "therefore",
        "second",
        "meditation",
        "unpacks",
        "whatever",
        "cogito",
        "inferential",
        "status",
        "worth",
        "noting",
        "twofold",
        "observation",
        "barry",
        "stroud",
        "thinker",
        "obviously",
        "could",
        "never",
        "wrong",
        "thinking",
        "think",
        "moreover",
        "one",
        "think",
        "could",
        "think",
        "falsely",
        "exists",
        "issue",
        "cogito",
        "worth",
        "clarifying",
        "let",
        "cover",
        "point",
        "summary",
        "fashion",
        "first",
        "firstperson",
        "formulation",
        "essential",
        "certainty",
        "cogito",
        "thirdperson",
        "claim",
        "icarus",
        "think",
        "descartes",
        "think",
        "unshakably",
        "certain",
        "rate",
        "occurrence",
        "thought",
        "chance",
        "resisting",
        "hyperbolic",
        "doubt",
        "number",
        "passage",
        "descartes",
        "refers",
        "thirdperson",
        "version",
        "cogito",
        "none",
        "occurs",
        "context",
        "establishing",
        "actual",
        "existence",
        "particular",
        "thinker",
        "contrast",
        "affirming",
        "conditional",
        "general",
        "result",
        "whatever",
        "think",
        "exists",
        "second",
        "present",
        "tense",
        "formulation",
        "essential",
        "certainty",
        "cogito",
        "good",
        "reason",
        "existed",
        "last",
        "tuesday",
        "since",
        "recall",
        "thinking",
        "day",
        "know",
        "merely",
        "dreaming",
        "occasion",
        "work",
        "reason",
        "continue",
        "exist",
        "since",
        "thinking",
        "meditator",
        "remark",
        "could",
        "totally",
        "cease",
        "thinking",
        "totally",
        "cease",
        "exist",
        "med",
        "csm",
        "privileged",
        "certainty",
        "cogito",
        "grounded",
        "manifest",
        "contradiction",
        "csm",
        "trying",
        "think",
        "away",
        "present",
        "thinking",
        "third",
        "certainty",
        "cogito",
        "depends",
        "formulated",
        "term",
        "cogitatio",
        "ie",
        "thinking",
        "awarenessconsciousness",
        "generally",
        "mode",
        "thinking",
        "sufficient",
        "including",
        "doubting",
        "affirming",
        "denying",
        "willing",
        "understanding",
        "imagining",
        "cf",
        "med",
        "bodily",
        "activity",
        "however",
        "insufficient",
        "instance",
        "good",
        "reason",
        "exist",
        "since",
        "walking",
        "methodical",
        "doubt",
        "call",
        "question",
        "existence",
        "leg",
        "maybe",
        "dreaming",
        "leg",
        "simple",
        "revision",
        "exist",
        "since",
        "seems",
        "walking",
        "restores",
        "antisceptical",
        "potency",
        "cf",
        "reply",
        "prin",
        "fourth",
        "caveat",
        "order",
        "descartes",
        "reject",
        "formulation",
        "presupposing",
        "existence",
        "body",
        "commits",
        "epistemic",
        "distinction",
        "idea",
        "mind",
        "body",
        "yet",
        "ontological",
        "distinction",
        "mindbody",
        "dualism",
        "indeed",
        "passage",
        "following",
        "cogito",
        "descartes",
        "meditator",
        "say",
        "yet",
        "may",
        "perhaps",
        "case",
        "thing",
        "supposing",
        "nothing",
        "eg",
        "structure",
        "limb",
        "called",
        "human",
        "body",
        "unknown",
        "reality",
        "identical",
        "aware",
        "know",
        "moment",
        "shall",
        "argue",
        "point",
        "since",
        "make",
        "judgement",
        "thing",
        "known",
        "med",
        "csm",
        "short",
        "intended",
        "epistemic",
        "success",
        "cogito",
        "presuppose",
        "particular",
        "mindbody",
        "ontology",
        "finally",
        "descartes",
        "reference",
        "think",
        "intended",
        "presuppose",
        "existence",
        "substantial",
        "self",
        "next",
        "sentence",
        "following",
        "initial",
        "statement",
        "cogito",
        "meditator",
        "say",
        "yet",
        "sufficient",
        "understanding",
        "necessarily",
        "exists",
        "csm",
        "stephen",
        "menn",
        "writes",
        "although",
        "meditator",
        "know",
        "seem",
        "know",
        "old",
        "conception",
        "nature",
        "called",
        "doubt",
        "seem",
        "anything",
        "new",
        "replace",
        "cogito",
        "purport",
        "yield",
        "certainty",
        "exist",
        "insofar",
        "thinking",
        "thing",
        "whatever",
        "turn",
        "ensuing",
        "discussion",
        "intended",
        "help",
        "arrive",
        "understanding",
        "ontological",
        "nature",
        "thinking",
        "subject",
        "generally",
        "distinguish",
        "issue",
        "epistemic",
        "ontological",
        "dependence",
        "final",
        "analysis",
        "descartes",
        "think",
        "show",
        "occurrence",
        "thought",
        "depends",
        "ontologically",
        "existence",
        "substantial",
        "self",
        "wit",
        "existence",
        "infinite",
        "substance",
        "namely",
        "god",
        "cf",
        "med",
        "ff",
        "denies",
        "acceptance",
        "ontological",
        "matter",
        "epistemically",
        "prior",
        "cogito",
        "certainty",
        "supposed",
        "depend",
        "epistemically",
        "abstruse",
        "metaphysics",
        "descartes",
        "think",
        "eventually",
        "establishes",
        "see",
        "vinci",
        "alternative",
        "reading",
        "cogito",
        "presuppose",
        "substantial",
        "self",
        "epistemic",
        "basis",
        "injecting",
        "think",
        "critic",
        "complained",
        "referring",
        "descartes",
        "begs",
        "question",
        "presupposing",
        "mean",
        "establish",
        "exist",
        "among",
        "critic",
        "bertrand",
        "russell",
        "object",
        "word",
        "really",
        "illegitimate",
        "echoing",
        "th",
        "century",
        "thinker",
        "georg",
        "lichtenberg",
        "russell",
        "writes",
        "descartes",
        "instead",
        "stated",
        "ultimate",
        "premiss",
        "form",
        "thought",
        "russell",
        "add",
        "word",
        "grammatically",
        "convenient",
        "describe",
        "datum",
        "accordingly",
        "pain",
        "pain",
        "different",
        "content",
        "descartes",
        "entitled",
        "former",
        "one",
        "effort",
        "reply",
        "introspection",
        "reveals",
        "russell",
        "allows",
        "reveals",
        "subjective",
        "character",
        "experience",
        "view",
        "experiential",
        "story",
        "pain",
        "expressed",
        "saying",
        "pain",
        "experience",
        "includes",
        "feeling",
        "pain",
        "plus",
        "pointofview",
        "experiential",
        "addition",
        "difficult",
        "characterize",
        "except",
        "adding",
        "pain",
        "pain",
        "mine",
        "importantly",
        "awareness",
        "subjective",
        "feature",
        "experience",
        "depend",
        "awareness",
        "metaphysical",
        "nature",
        "thinking",
        "subject",
        "take",
        "descartes",
        "using",
        "signify",
        "subjective",
        "character",
        "smuggling",
        "something",
        "already",
        "ness",
        "consciousness",
        "turn",
        "contra",
        "russell",
        "primary",
        "datum",
        "experience",
        "though",
        "hume",
        "persuasively",
        "argues",
        "introspection",
        "reveals",
        "sense",
        "impression",
        "suited",
        "role",
        "thinking",
        "subject",
        "descartes",
        "unlike",
        "hume",
        "need",
        "derive",
        "idea",
        "sense",
        "impression",
        "descartes",
        "idea",
        "self",
        "ultimately",
        "draw",
        "innate",
        "conceptual",
        "resource",
        "setting",
        "aside",
        "philosophical",
        "concern",
        "associated",
        "cogito",
        "let",
        "turn",
        "interpretive",
        "concern",
        "namely",
        "issue",
        "whether",
        "initial",
        "introduction",
        "second",
        "meditation",
        "descartes",
        "intends",
        "cogito",
        "count",
        "perfect",
        "knowledge"
    ]
}