{
    "main_text": "The Methods: Foundationalism and Doubt || Method of Doubt\n2.2 Method of Doubt\n\nDescartes opens the First Meditation asserting the need “to\ndemolish everything completely and start again right from the\nfoundations” (AT 7:17, CSM 2:12). The passage adds:\n\nReason now leads me to think that I should hold back my assent from\nopinions which are not completely certain and indubitable just as\ncarefully as I do from those which are patently false. So, for the\npurpose of rejecting all my opinions, it will be enough if I find in\neach of them at least some reason for doubt. (AT 7:18, CSM 2:12)\n\n\nIn the architectural analogy, we can think of bulldozers as the\nground-clearing tools of demolition. For knowledge building,\nDescartes construes sceptical doubts as the ground-clearing tools of\nepistemic demolition. Bulldozers undermine literal ground;\ndoubt undermines epistemic ground. Using sceptical doubts, the\nmeditator shows how to find “some reason for doubt” in all\nhis preexisting claims to knowledge.\n\nThe ultimate aim of the method is constructive. Unlike “the\nsceptics, who doubt only for the sake of doubting,” Descartes\naims “to reach certainty – to cast aside the loose earth\nand sand so as to come upon rock or clay” (Discourse 3,\nAT 6:29, CSM 1:125). Bulldozers are typically used for destructive\nends, as are sceptical doubts. Descartes’ methodical innovation\nis to employ demolition for constructive ends. Where a\nbulldozer’s force overpowers the ground, its effects are\ndestructive. Where the ground’s firmness resists the\nbulldozer’s force, the bulldozer might be used constructively\n– using it to reveal the ground as firm. Descartes thus\nuses sceptical doubts to test the firmness of candidates put forward\nfor the foundations of knowledge.\n\nAccording to at least one prominent critic, this employment of\nsceptical doubt is unnecessary and excessive. Writes Gassendi:\n\nThere is just one point I am not clear about, namely why you did not\nmake a simple and brief statement to the effect that you were\nregarding your previous knowledge as uncertain so that you could later\nsingle out what you found to be true. Why instead did you consider\neverything as false, which seems more like adopting a new\nprejudice than relinquishing an old one? This strategy made it\nnecessary for you to convince yourself by imagining a deceiving\nGod or some evil demon who tricks us, whereas it would surely\nhave been sufficient to cite the darkness of the human mind or the\nweakness of our nature. (Objs. 5, AT 7:257f, CSM 2:180; italics added)\n\n\nHere, Gassendi singles out two features of methodical doubt –\nits universal and hyperbolic character. In reply,\nDescartes remarks:\n\nYou say that you approve of my project for freeing my mind from\npreconceived opinions; and indeed no one can pretend that such a\nproject should not be approved of. But you would have preferred\nme to have carried it out by making a “simple and brief\nstatement” – that is, only in a perfunctory fashion. Is\nit really so easy to free ourselves from all the errors which we have\nsoaked up since our infancy? Can we really be too careful in carrying\nout a project which everyone agrees should be performed? (Replies 5,\nAT 7:348, CSM 2:241f)\n\n\nEvidently, Descartes holds that the universal and\nhyperbolic character of methodical doubt is helpful to its\nsuccess. Further appeal to the architectural analogy helps elucidate\nwhy.\n\nConsider first the universal character of doubt – the\nneed “to demolish everything completely and start again right\nfrom the foundations.” The point is not merely to apply doubt to\nall candidates for perfect knowledge, but to apply doubt\ncollectively. Descartes offers the following analogy:\n\nSuppose [a person] had a basket full of apples and, being worried that\nsome of the apples were rotten, wanted to take out the rotten ones to\nprevent the rot spreading. How would he proceed? Would he not begin by\ntipping the whole lot out of the basket? And would not the next step\nbe to cast his eye over each apple in turn, and pick up and put back\nin the basket only those he saw to be sound, leaving the others? In\njust the same way, those who have never philosophized correctly have\nvarious opinions in their minds which they have begun to store up\nsince childhood, and which they therefore have reason to believe may\nin many cases be false. They then attempt to separate the false\nbeliefs from the others, so as to prevent their contaminating the rest\nand making the whole lot uncertain. Now the best way they can\naccomplish this is to reject all their beliefs together in one go, as\nif they were all uncertain and false. They can then go over each\nbelief in turn and re-adopt only those which they recognize to be true\nand indubitable. (Replies 7, AT 7:481, CSM 2:324)\n\n\nThat even one falsehood would be mistakenly treated as a genuine\nfirst principle – say, the belief that the senses are\nreliable, or that ancient authorities should be trusted\n– threatens to spread falsehood to other beliefs in the system.\nA collective doubt helps avoid such mistakes. It ensures that the\nmethod only approves candidate first principles that are unshakable in\ntheir own right: it rules out that the appearance of unshakability is\nowed to logical relations with other principles, themselves not\nsubjected to doubt.\n\nHow is the hyperbolic character of methodical doubt supposed\nto contribute to the method’s success? The architectural analogy\nis again helpful. Suppose that an architect is vigilant in employing a\nuniversal/collective doubt. Suppose, further, that she attempts to use\nepistemic bulldozers for constructive purposes. A problem nonetheless \narises. How big a bulldozer is she to use? A light-duty bulldozer\nmight be unable to distinguish a medium-sized boulder from immovable \nbedrock. In both cases, the ground would appear immovable. \nDescartes takes the solution to lie in using not light-duty, but\nheavy-duty tools of demolition – the bigger the\nbulldozer, the better. The lesson is clear for the epistemic builder:\nthe more hyperbolic the doubt, the better.\n\nA potential problem remains. Does not the problem of the\n“light-duty bulldozer” repeat itself? No matter how\nfirm one’s ground, might it not be dislodged in the face of\na yet bigger bulldozer? This raises the worry that there might not\nbe unshakable ground, as opposed to ground which\nis yet unshaken. Descartes’ goal of utterly\nindubitable epistemic ground may simply be elusive.\n\nAt this juncture, perhaps the architectural analogy breaks down\nin a manner that serves Descartes well. For though there is no \nmost-powerful literal bulldozer, perhaps epistemic\nbulldozing is not subject to this limitation. Descartes seems\nto think that there is a most-powerful doubt\n– a doubt than which none more hyperbolic can be conceived.\nThe Evil Genius Doubt (and equivalent doubts) is supposed to\nfit the bill. If the method reveals epistemic ground that stands\nfast in the face of a doubt this hyperbolic, then, as \nDescartes seems to hold, this counts as epistemic bedrock if\nanything does.\n\nHence the importance of the universal and hyperbolic\ncharacter of the method of doubt. Gassendi’s suggestion that we\nforego methodical doubt in favor of a “simple and brief\nstatement to the effect that [we’re] regarding [our] previous\nknowledge as uncertain” misses an important, intended point\nof the method.\n\nDescartes’ method of doubt has been subject to numerous\nobjections – some fair, others less so. Rendered in the terms\nDescartes himself employs, the method is arguably less flawed than its\nreputation. Let us consider some of the common objections. Two such\nobjections are suggested in a passage from the pragmatist Peirce:\n\nWe cannot begin with complete doubt. We must begin with all the\nprejudices which we actually have when we enter upon the study of\nphilosophy. These prejudices are not to be dispelled by a maxim [viz.,\nthe maxim that the philosopher “must begin with universal\ndoubt”], for they are things which it does not occur to us\ncan be questioned. Hence this initial skepticism will be a\nmere self-deception, and not real doubt … A person may, it is\ntrue, in the course of his studies, find reason to doubt what he began\nby believing; but in that case he doubts because he has a positive\nreason for it, and not on account of the Cartesian maxim. Let us not\npretend to doubt in philosophy what we do not doubt in our hearts.\n(1955, 228f)\n\n\nNote, however, that the procedure of the Meditations is not\nthat universal doubt is supposed to flow simply from adherence to a\nmaxim; to the contrary, the doubt is supposed to flow from careful\nattention to positive reasons for doubt – recall the express\nresolution to find “at least some reason for doubt” in\none’s prior opinions. Descartes introduces sceptical arguments\nprecisely in acknowledgement that we need such reasons:\n\nI did say that there was some difficulty in expelling from our belief\neverything we have previously accepted. One reason for this is that\nbefore we can decide to doubt, we need some reason for doubting; and\nthat is why in my First Meditation I put forward the principal reasons\nfor doubt. (Replies 5, appendix, AT 9a:204, CSM 2:270)\n\n\nA second objection arises from Peirce’s contention\nthat we should “not pretend to doubt in philosophy\nwhat we do not doubt in our hearts”. Descartes\npresumably agrees that hyperbolic doubt is not (what Peirce\ncalls) a “doubt in our hearts” – recall\nhis concession that “no sane person has ever seriously\ndoubted” such claims as “that there really is a\nworld, and that human beings have bodies” \n(AT 7:16, CSM 2:11).  Further, Descartes makes clear that\nwe should not extend hyperbolic doubt to practical\nmatters:\n\nI made a very careful distinction between the conduct of life\nand the contemplation of the truth. As far as the conduct of\nlife is concerned, I am very far from thinking that we should\nassent only to what is clearly perceived. … from time\nto time we will have to choose one of many alternatives about\nwhich we have no knowledge …  (Replies 2, AT 7:149,\nCSM 2:106)\n\n\nElsewhere, Descartes illustrates the danger in applying \nhyperbolic doubt to practical contexts, with an example of \nsomeone who “decided to abstain from all food to the\npoint of starvation, because he was not certain that it was\nnot poisoned” – a scenario wherein the person \n“would be rightly regarded as insane” (AT 3:422,\nCSMK 189).  Such dangers, however, do not arise in\nconnection with theoretical matters, including those\npursued in the Meditations. An essential\ncomponent of Descartes’ constructive epistemology\nis the distinction between matters to which we have\nalways given assent, in spite of their being\ndoubtful, and matters to which we cannot but\nassent while perceiving them clearly and distinctly. \nHyperbolic doubt is supposed to show that our previous\nopinions are likely of a piece with the former; yet,\nperfect knowledge is built from the latter.  The emphasis\non doubt is intended to help counter-balance our “habit\nof confidently assenting to” what we regard as \n“highly probable opinions,” on the grounds that\nsuch matters seem “much more reasonable to believe\nthan to deny” (Med. 1, AT 7:15, CSM 2:22). The\nmeditator thus adopts the attitude of methodical doubt\nwhereby all candidates for belief are treated as if\nfalse: “it will be a good plan to turn my will in\ncompletely the opposite direction and deceive myself, by\npretending for a time that these former opinions are utterly\nfalse and imaginary” (ibid.) – a plan\nthat is carried out precisely by subjecting all matters to\nhyperbolic doubt.\n\nA related objection takes the method to require not merely doubt,\nbut disbelief or dissent. One of Gassendi’s objections reads\nin this manner. He seems to take Descartes to be urging us, quite\nliterally, to “consider everything as false,” a strategy\nwhich, as he says to Descartes, “made it necessary for you to\nconvince yourself” of the sceptical hypotheses(Objs. 5, AT \n7:257f, CSM 2:180). Based on Descartes’ most careful statements, \nhowever, his method does not require a dissent from the statements it \nundermines. Rather, the method urges us to “hold back [our] \nassent from opinions which are not completely certain and indubitable \njust as carefully as [we] do from those which are patently false” \n(Med. 1, AT 7:18, CSM 2:12, cf. AT 7:461).\n\nFinally, a common objection has it that the universality of doubt\nundermines the method of doubt itself, since, for example,\nthe sceptical hypotheses themselves are dubious. Descartes\nthinks this mistakes the intended scope of the method: namely, to \nextend doubt universally to candidates for knowledge, but\nnot also to the very tools for founding knowledge. As he concedes: \n“there may be reasons which are strong enough to compel us to \ndoubt, even though these reasons are themselves doubtful, and hence\nare not to be retained later on” (Replies 7, AT 7:473f, CSM \n2:319).\n\n(For further discussion of Descartes’s method of doubt, see\nFrankfurt 1970, Garber 1986, Larmore 2014, Newman 2006, Williams 1983,\nand Wilson 1978.)\n",
    "section_title": "2.2 Method of Doubt",
    "entry_title": "Descartes’ Epistemology",
    "hierarchy_title": "Descartes’ Epistemology || The Methods: Foundationalism and Doubt || Method of Doubt",
    "tokenized_text": [
        "method",
        "foundationalism",
        "doubt",
        "method",
        "doubt",
        "method",
        "doubt",
        "descartes",
        "open",
        "first",
        "meditation",
        "asserting",
        "need",
        "demolish",
        "everything",
        "completely",
        "start",
        "right",
        "foundation",
        "csm",
        "passage",
        "add",
        "reason",
        "lead",
        "think",
        "hold",
        "back",
        "assent",
        "opinion",
        "completely",
        "certain",
        "indubitable",
        "carefully",
        "patently",
        "false",
        "purpose",
        "rejecting",
        "opinion",
        "enough",
        "find",
        "least",
        "reason",
        "doubt",
        "csm",
        "architectural",
        "analogy",
        "think",
        "bulldozer",
        "groundclearing",
        "tool",
        "demolition",
        "knowledge",
        "building",
        "descartes",
        "construes",
        "sceptical",
        "doubt",
        "groundclearing",
        "tool",
        "epistemic",
        "demolition",
        "bulldozer",
        "undermine",
        "literal",
        "ground",
        "doubt",
        "undermines",
        "epistemic",
        "ground",
        "using",
        "sceptical",
        "doubt",
        "meditator",
        "show",
        "find",
        "reason",
        "doubt",
        "preexisting",
        "claim",
        "knowledge",
        "ultimate",
        "aim",
        "method",
        "constructive",
        "unlike",
        "sceptic",
        "doubt",
        "sake",
        "doubting",
        "descartes",
        "aim",
        "reach",
        "certainty",
        "cast",
        "aside",
        "loose",
        "earth",
        "sand",
        "come",
        "upon",
        "rock",
        "clay",
        "discourse",
        "csm",
        "bulldozer",
        "typically",
        "used",
        "destructive",
        "end",
        "sceptical",
        "doubt",
        "descartes",
        "methodical",
        "innovation",
        "employ",
        "demolition",
        "constructive",
        "end",
        "bulldozer",
        "force",
        "overpowers",
        "ground",
        "effect",
        "destructive",
        "ground",
        "firmness",
        "resists",
        "bulldozer",
        "force",
        "bulldozer",
        "might",
        "used",
        "constructively",
        "using",
        "reveal",
        "ground",
        "firm",
        "descartes",
        "thus",
        "us",
        "sceptical",
        "doubt",
        "test",
        "firmness",
        "candidate",
        "put",
        "forward",
        "foundation",
        "knowledge",
        "according",
        "least",
        "one",
        "prominent",
        "critic",
        "employment",
        "sceptical",
        "doubt",
        "unnecessary",
        "excessive",
        "writes",
        "gassendi",
        "one",
        "point",
        "clear",
        "namely",
        "make",
        "simple",
        "brief",
        "statement",
        "effect",
        "regarding",
        "previous",
        "knowledge",
        "uncertain",
        "could",
        "later",
        "single",
        "found",
        "true",
        "instead",
        "consider",
        "everything",
        "false",
        "seems",
        "like",
        "adopting",
        "new",
        "prejudice",
        "relinquishing",
        "old",
        "one",
        "strategy",
        "made",
        "necessary",
        "convince",
        "imagining",
        "deceiving",
        "god",
        "evil",
        "demon",
        "trick",
        "u",
        "whereas",
        "would",
        "surely",
        "sufficient",
        "cite",
        "darkness",
        "human",
        "mind",
        "weakness",
        "nature",
        "objs",
        "f",
        "csm",
        "italic",
        "added",
        "gassendi",
        "single",
        "two",
        "feature",
        "methodical",
        "doubt",
        "universal",
        "hyperbolic",
        "character",
        "reply",
        "descartes",
        "remark",
        "say",
        "approve",
        "project",
        "freeing",
        "mind",
        "preconceived",
        "opinion",
        "indeed",
        "one",
        "pretend",
        "project",
        "approved",
        "would",
        "preferred",
        "carried",
        "making",
        "simple",
        "brief",
        "statement",
        "perfunctory",
        "fashion",
        "really",
        "easy",
        "free",
        "error",
        "soaked",
        "since",
        "infancy",
        "really",
        "careful",
        "carrying",
        "project",
        "everyone",
        "agrees",
        "performed",
        "reply",
        "csm",
        "f",
        "evidently",
        "descartes",
        "hold",
        "universal",
        "hyperbolic",
        "character",
        "methodical",
        "doubt",
        "helpful",
        "success",
        "appeal",
        "architectural",
        "analogy",
        "help",
        "elucidate",
        "consider",
        "first",
        "universal",
        "character",
        "doubt",
        "need",
        "demolish",
        "everything",
        "completely",
        "start",
        "right",
        "foundations",
        "point",
        "merely",
        "apply",
        "doubt",
        "candidate",
        "perfect",
        "knowledge",
        "apply",
        "doubt",
        "collectively",
        "descartes",
        "offer",
        "following",
        "analogy",
        "suppose",
        "person",
        "basket",
        "full",
        "apple",
        "worried",
        "apple",
        "rotten",
        "wanted",
        "take",
        "rotten",
        "one",
        "prevent",
        "rot",
        "spreading",
        "would",
        "proceed",
        "would",
        "begin",
        "tipping",
        "whole",
        "lot",
        "basket",
        "would",
        "next",
        "step",
        "cast",
        "eye",
        "apple",
        "turn",
        "pick",
        "put",
        "back",
        "basket",
        "saw",
        "sound",
        "leaving",
        "others",
        "way",
        "never",
        "philosophized",
        "correctly",
        "various",
        "opinion",
        "mind",
        "begun",
        "store",
        "since",
        "childhood",
        "therefore",
        "reason",
        "believe",
        "may",
        "many",
        "case",
        "false",
        "attempt",
        "separate",
        "false",
        "belief",
        "others",
        "prevent",
        "contaminating",
        "rest",
        "making",
        "whole",
        "lot",
        "uncertain",
        "best",
        "way",
        "accomplish",
        "reject",
        "belief",
        "together",
        "one",
        "go",
        "uncertain",
        "false",
        "go",
        "belief",
        "turn",
        "readopt",
        "recognize",
        "true",
        "indubitable",
        "reply",
        "csm",
        "even",
        "one",
        "falsehood",
        "would",
        "mistakenly",
        "treated",
        "genuine",
        "first",
        "principle",
        "say",
        "belief",
        "sens",
        "reliable",
        "ancient",
        "authority",
        "trusted",
        "threatens",
        "spread",
        "falsehood",
        "belief",
        "system",
        "collective",
        "doubt",
        "help",
        "avoid",
        "mistake",
        "ensures",
        "method",
        "approves",
        "candidate",
        "first",
        "principle",
        "unshakable",
        "right",
        "rule",
        "appearance",
        "unshakability",
        "owed",
        "logical",
        "relation",
        "principle",
        "subjected",
        "doubt",
        "hyperbolic",
        "character",
        "methodical",
        "doubt",
        "supposed",
        "contribute",
        "method",
        "success",
        "architectural",
        "analogy",
        "helpful",
        "suppose",
        "architect",
        "vigilant",
        "employing",
        "universalcollective",
        "doubt",
        "suppose",
        "attempt",
        "use",
        "epistemic",
        "bulldozer",
        "constructive",
        "purpose",
        "problem",
        "nonetheless",
        "arises",
        "big",
        "bulldozer",
        "use",
        "lightduty",
        "bulldozer",
        "might",
        "unable",
        "distinguish",
        "mediumsized",
        "boulder",
        "immovable",
        "bedrock",
        "case",
        "ground",
        "would",
        "appear",
        "immovable",
        "descartes",
        "take",
        "solution",
        "lie",
        "using",
        "lightduty",
        "heavyduty",
        "tool",
        "demolition",
        "bigger",
        "bulldozer",
        "better",
        "lesson",
        "clear",
        "epistemic",
        "builder",
        "hyperbolic",
        "doubt",
        "better",
        "potential",
        "problem",
        "remains",
        "problem",
        "lightduty",
        "bulldozer",
        "repeat",
        "matter",
        "firm",
        "one",
        "ground",
        "might",
        "dislodged",
        "face",
        "yet",
        "bigger",
        "bulldozer",
        "raise",
        "worry",
        "might",
        "unshakable",
        "ground",
        "opposed",
        "ground",
        "yet",
        "unshaken",
        "descartes",
        "goal",
        "utterly",
        "indubitable",
        "epistemic",
        "ground",
        "may",
        "simply",
        "elusive",
        "juncture",
        "perhaps",
        "architectural",
        "analogy",
        "break",
        "manner",
        "serf",
        "descartes",
        "well",
        "though",
        "mostpowerful",
        "literal",
        "bulldozer",
        "perhaps",
        "epistemic",
        "bulldozing",
        "subject",
        "limitation",
        "descartes",
        "seems",
        "think",
        "mostpowerful",
        "doubt",
        "doubt",
        "none",
        "hyperbolic",
        "conceived",
        "evil",
        "genius",
        "doubt",
        "equivalent",
        "doubt",
        "supposed",
        "fit",
        "bill",
        "method",
        "reveals",
        "epistemic",
        "ground",
        "stand",
        "fast",
        "face",
        "doubt",
        "hyperbolic",
        "descartes",
        "seems",
        "hold",
        "count",
        "epistemic",
        "bedrock",
        "anything",
        "hence",
        "importance",
        "universal",
        "hyperbolic",
        "character",
        "method",
        "doubt",
        "gassendi",
        "suggestion",
        "forego",
        "methodical",
        "doubt",
        "favor",
        "simple",
        "brief",
        "statement",
        "effect",
        "regarding",
        "previous",
        "knowledge",
        "uncertain",
        "miss",
        "important",
        "intended",
        "point",
        "method",
        "descartes",
        "method",
        "doubt",
        "subject",
        "numerous",
        "objection",
        "fair",
        "others",
        "le",
        "rendered",
        "term",
        "descartes",
        "employ",
        "method",
        "arguably",
        "le",
        "flawed",
        "reputation",
        "let",
        "u",
        "consider",
        "common",
        "objection",
        "two",
        "objection",
        "suggested",
        "passage",
        "pragmatist",
        "peirce",
        "begin",
        "complete",
        "doubt",
        "must",
        "begin",
        "prejudice",
        "actually",
        "enter",
        "upon",
        "study",
        "philosophy",
        "prejudice",
        "dispelled",
        "maxim",
        "viz",
        "maxim",
        "philosopher",
        "must",
        "begin",
        "universal",
        "doubt",
        "thing",
        "occur",
        "u",
        "questioned",
        "hence",
        "initial",
        "skepticism",
        "mere",
        "selfdeception",
        "real",
        "doubt",
        "person",
        "may",
        "true",
        "course",
        "study",
        "find",
        "reason",
        "doubt",
        "began",
        "believing",
        "case",
        "doubt",
        "positive",
        "reason",
        "account",
        "cartesian",
        "maxim",
        "let",
        "u",
        "pretend",
        "doubt",
        "philosophy",
        "doubt",
        "heart",
        "f",
        "note",
        "however",
        "procedure",
        "meditation",
        "universal",
        "doubt",
        "supposed",
        "flow",
        "simply",
        "adherence",
        "maxim",
        "contrary",
        "doubt",
        "supposed",
        "flow",
        "careful",
        "attention",
        "positive",
        "reason",
        "doubt",
        "recall",
        "express",
        "resolution",
        "find",
        "least",
        "reason",
        "doubt",
        "one",
        "prior",
        "opinion",
        "descartes",
        "introduces",
        "sceptical",
        "argument",
        "precisely",
        "acknowledgement",
        "need",
        "reason",
        "say",
        "difficulty",
        "expelling",
        "belief",
        "everything",
        "previously",
        "accepted",
        "one",
        "reason",
        "decide",
        "doubt",
        "need",
        "reason",
        "doubting",
        "first",
        "meditation",
        "put",
        "forward",
        "principal",
        "reason",
        "doubt",
        "reply",
        "appendix",
        "a",
        "csm",
        "second",
        "objection",
        "arises",
        "peirce",
        "contention",
        "pretend",
        "doubt",
        "philosophy",
        "doubt",
        "heart",
        "descartes",
        "presumably",
        "agrees",
        "hyperbolic",
        "doubt",
        "peirce",
        "call",
        "doubt",
        "heart",
        "recall",
        "concession",
        "sane",
        "person",
        "ever",
        "seriously",
        "doubted",
        "claim",
        "really",
        "world",
        "human",
        "being",
        "body",
        "csm",
        "descartes",
        "make",
        "clear",
        "extend",
        "hyperbolic",
        "doubt",
        "practical",
        "matter",
        "made",
        "careful",
        "distinction",
        "conduct",
        "life",
        "contemplation",
        "truth",
        "far",
        "conduct",
        "life",
        "concerned",
        "far",
        "thinking",
        "assent",
        "clearly",
        "perceived",
        "time",
        "time",
        "choose",
        "one",
        "many",
        "alternative",
        "knowledge",
        "reply",
        "csm",
        "elsewhere",
        "descartes",
        "illustrates",
        "danger",
        "applying",
        "hyperbolic",
        "doubt",
        "practical",
        "context",
        "example",
        "someone",
        "decided",
        "abstain",
        "food",
        "point",
        "starvation",
        "certain",
        "poisoned",
        "scenario",
        "wherein",
        "person",
        "would",
        "rightly",
        "regarded",
        "insane",
        "csmk",
        "danger",
        "however",
        "arise",
        "connection",
        "theoretical",
        "matter",
        "including",
        "pursued",
        "meditation",
        "essential",
        "component",
        "descartes",
        "constructive",
        "epistemology",
        "distinction",
        "matter",
        "always",
        "given",
        "assent",
        "spite",
        "doubtful",
        "matter",
        "assent",
        "perceiving",
        "clearly",
        "distinctly",
        "hyperbolic",
        "doubt",
        "supposed",
        "show",
        "previous",
        "opinion",
        "likely",
        "piece",
        "former",
        "yet",
        "perfect",
        "knowledge",
        "built",
        "latter",
        "emphasis",
        "doubt",
        "intended",
        "help",
        "counterbalance",
        "habit",
        "confidently",
        "assenting",
        "regard",
        "highly",
        "probable",
        "opinion",
        "ground",
        "matter",
        "seem",
        "much",
        "reasonable",
        "believe",
        "deny",
        "med",
        "csm",
        "meditator",
        "thus",
        "adopts",
        "attitude",
        "methodical",
        "doubt",
        "whereby",
        "candidate",
        "belief",
        "treated",
        "false",
        "good",
        "plan",
        "turn",
        "completely",
        "opposite",
        "direction",
        "deceive",
        "pretending",
        "time",
        "former",
        "opinion",
        "utterly",
        "false",
        "imaginary",
        "ibid",
        "plan",
        "carried",
        "precisely",
        "subjecting",
        "matter",
        "hyperbolic",
        "doubt",
        "related",
        "objection",
        "take",
        "method",
        "require",
        "merely",
        "doubt",
        "disbelief",
        "dissent",
        "one",
        "gassendi",
        "objection",
        "read",
        "manner",
        "seems",
        "take",
        "descartes",
        "urging",
        "u",
        "quite",
        "literally",
        "consider",
        "everything",
        "false",
        "strategy",
        "say",
        "descartes",
        "made",
        "necessary",
        "convince",
        "sceptical",
        "hypothesis",
        "objs",
        "f",
        "csm",
        "based",
        "descartes",
        "careful",
        "statement",
        "however",
        "method",
        "require",
        "dissent",
        "statement",
        "undermines",
        "rather",
        "method",
        "urge",
        "u",
        "hold",
        "back",
        "assent",
        "opinion",
        "completely",
        "certain",
        "indubitable",
        "carefully",
        "patently",
        "false",
        "med",
        "csm",
        "cf",
        "finally",
        "common",
        "objection",
        "universality",
        "doubt",
        "undermines",
        "method",
        "doubt",
        "since",
        "example",
        "sceptical",
        "hypothesis",
        "dubious",
        "descartes",
        "think",
        "mistake",
        "intended",
        "scope",
        "method",
        "namely",
        "extend",
        "doubt",
        "universally",
        "candidate",
        "knowledge",
        "also",
        "tool",
        "founding",
        "knowledge",
        "concedes",
        "may",
        "reason",
        "strong",
        "enough",
        "compel",
        "u",
        "doubt",
        "even",
        "though",
        "reason",
        "doubtful",
        "hence",
        "retained",
        "later",
        "reply",
        "f",
        "csm",
        "discussion",
        "descartes",
        "method",
        "doubt",
        "see",
        "frankfurt",
        "garber",
        "larmore",
        "newman",
        "williams",
        "wilson"
    ]
}