{
    "main_text": "Reconstructing Liberalism\n2. Reconstructing Liberalism\n\nOne of the legacies of Green’s idealism and of Dewey’s\nengagement with the New Liberals was the project of recasting\nliberalism in an appropriate form for modern societies. The core or at\nleast viable component of liberalism is a commitment to“liberty\nand the opportunity of all individuals to secure full realization of\ntheir potentialities” (Liberalism and Social Action,\nLW11, 38). Moral theories, as we have seen, can be viewed as\nconstructs to solve practical problems. Like an outmoded piece of\ntechnology, a past value which was once constructed to address a\nproblem in one set of circumstances can outlive its usefulness, and\nbecome a hindrance to the capacity of those in the present to deal\nwith their practical needs and worries. This, Dewey believes, is the\ncase with the theory of classical or laissez-faire\nliberalism. As he puts it, “the slogans of liberalism in\none period can become the bulwarks of reaction” in the next\n(“Logical Method and Law”, MW15, 76). For Dewey\nthis does not provide a reason to reject liberalism, however although\nhe is sensitive to the allure of anti-liberal thought. Rather,\nliberalism it for modern societies, usually in a more socialist\nand radical direction. Throughout his political writings, he develops\nthis thought in discussing the relation of individual and society, the\ncharacter and value of freedom, and the scope of legitimate social and\npolitical action.\n\nDewey’s treatment of the genealogy of classical liberalism is\nnuanced but in summary he sees it as a doctrine committed to the\nuniversal moral primacy of the individual possessed of pre-societal\nrights, including liberties of thought and action, which it is the\nsole business of the state to protect (Liberalism and Social\nAction, LW11, 7). This meant that the main opponent of\nliberty was seen as government because of its tendency to encroach on\nthese innate liberties. The abstraction of the individual from social\ncontext in classical liberalism shapes its normative theory. If the\nindividual is thought of as existing prior to social institutions,\nthen it is easier to envisage securing freedom for the individual in\npurely negative terms as solely consisting in the removal of external\nimpediments on individual action, such as legal restrictions on\nfreedom of speech. For classical liberalism or “old\nindividualism”, freedom is taken to consist in the absence of\nsome intentional constraint on the individual’s ability to\npursue his or her chosen goals and the individual is viewed as\nsurrounded by a protective cordon of rights, which define his or her\nfreedom. While removal of external constraints may sometimes be very\nimportant for supplying the conditions of liberty, liberty in the\nsense in which it is a value for liberals does not consist in the mere\nabsence of external constraint. For Dewey, this negative view of\nfreedom is at the root of the wider social, ethical and political\ndefects of this form of individualism (“Religion and Morality in\na Free Society”, LW15, 181). While the anti-historical\ncharacter of classical liberalism at one point provided it with a\ncertain ideological advantage, since it allowed it to attack appeals\nto tradition, it meant that it failed to see the historically\nconditioned character of its interpretations of liberty and\nindividuality. This failure of historical self-awareness means that\nclassical liberalism neglects or suppresses an understanding of the\ncentral challenges to liberty and in effect becomes an instrument of\nplutocratic interests.\n\nBy contrast, as we have seen, Dewey rejects the philosophical\nabsolutism of a fixed and ahistorical conception of the self and\nargues that a genuine liberalism views the individual as\n“nothing fixed, given ready-made. It is something achieved, and\nachieved not in isolation but with the aid and support of conditions,\ncultural and physical: – including in ‘cultural’,\neconomic, legal and political institutions as well as science and\nart” (“The Future of Liberalism”, LW11:\n291). One argument Dewey makes is for the “historic\nrelativity” of what constitutes a constraint on individual\nliberty. At one time it made sense to say that dynastic despotic rule\nor inherited legal customs were the main obstacles to individual\nfreedom. Today, however, liberty signifies “liberation from\nmaterial insecurity and from the coercions and repressions that\nprevent multitudes from participation in the vast cultural resources\nthat are to hand” (Liberalism and Social Action,\nLW11, 38). It is a historically relative matter what\nconstitutes a constraint on individual freedom, however. By\nattempting to mask this as well as by promoting an outdated conception\nof what these constraints must be, classical liberalism has come to\nsubvert liberalism’s core commitments to liberty and\nindividuality.\n\nDewey goes beyond this historicization, however. In the sense in which\nfreedom is a substantive value for liberals, what is valuable about it\nis not the negative absence of constraints but the positive\n“power to be an individualized self” (The Public and\nIts Problems, LW2, 329). Individuality in what we may\ncall a weak sense is universally possessed and consists in the\nparticular patterns of response to the environment that each person\ndisplays, “a distinctive way of feeling the impacts of the world\nand of showing a preferential bias in response to these impacts”\n(Individualism Old and New, LW5, 121). In the\nstronger sense in which it is a value for liberals, according to\nDewey, individuality consists in the personal capacity for\nchoice, “the most characteristic activity of a\nself” (Ethics, 2nd edition, LW7,\n285). This is not a matter of having the capacity only for arbitrarily\nor whimsically plumping for one option rather than another. Rather,\nchoice that is expressive of your individuality in the strong sense\ninvolves your intelligent criticism and appraisal of options.\nAccordingly, we can understand why Dewey claims that “to foresee\nfuture objective alternatives and to be able by deliberation to choose\none of them and thereby weigh its chances in the struggle for future\nexistence, measures our freedom” (Human Nature and\nConduct, MW14, 210). The alternative to intelligent\nself-direction is action according to whatever notions individuals\nhave picked up from their environment, including not only unreflective\nimpulses but propaganda (the “flood of mass suggestion”\nthat he identifies with the media revolution of the early twentieth\ncentury), class ideologies and “the monotonous round of imagery\nflowing from illiberal interests, broken only by wild forays into the\nillicit” (Ethics, 1st edition, MW5, 392). It\nfollows that possession and exercise of this capacity for individuality\nrequire the right social conditions. Throughout his writings he\nargues that education to produce undocile, unservile, creative\ncitizens is essential. Further, he views this capacity for\ncritical reflection as supported by democratic institutions and\nculture, since, at least in principle, these allow for openness,\nepistemic diversity, experiment, contestation and revision that\nsupports freedom as individuality (The Public and Its\nProblems, LW2, 329; Ethics, 2nd\nedition, LW7, 358).\n\nDewey goes further still, though, in situating the free individual:\nfreedom doesn’t only consist in the development\nof reflective individuality, which requires supportive social and\npolitical conditions. It also includes participation in a community\n(here tweaking an idea he found in Green and the New Liberals). As he\nputs it in The Public and Its Problems, liberty “is\nthat secure release and fulfilment of personal potentialities which\ntake place only in rich and manifold association with others: the\npower to be an individualized self making a distinctive contribution\nand enjoying in its own way the fruits of association” (The\nPublic and Its Problems, LW2, 329). You are free not\nonly in reflectively choosing among a set of options but in having\navailable a rich set of worthwhile options; without these options, you\naren’t free, or as free, as someone who does enjoy a rich and\nmanifold association with others. You are also free only when you are\nmaking your own distinctive contribution to the society. Dewey is\nthe kind of positive liberty theorist for whom individual freedom is\nachieved through participation in the process through which the\nindividual’s society exercises collective control over its own\naffairs. I’ll return to this in the next section, since it\nshapes Dewey’s conception of democracy.\n\nWhat should be underlined here is that this account of freedom is the\nbasis of a critical assessment of capitalist\nsociety: “[t]he direct impact of liberty always has to do\nwith some class or group that is suffering in a special way from some\nform of constraint exercised by the distribution of powers that exists\nin contemporary society” (Liberalism and Social\nAction, LW11, 38). Liberals agree that the state\nhas an important role in maintaining the conditions for individual\nfreedom. For Dewey, the character and value of freedom, as for\nthe Hegelian idealists and New Liberals on whom he drew and for later\nwriters on negative and positive liberty such as Isaiah Berlin, flowed\ninto a debate about the proper scope of social and political action.\nThe scope of legitimate social and political action had to be\ndetermined experimentally and in the light of the needs of his\nconception of freedom as individuality: laissez-faire should\nnot be assumed to be the default position for a liberal. For earlier\nliberalism, the opposition of the individual and government may have\nmade sense, in an era characterised by political despotism. In\ncircumstances of popular government and where there is a need to track\nand regulate the complexities of modern industrial conditions,\nhowever, the nostrums of laissez-faire liberalism only\nserve to provide ideological support for plutocracy. Dewey\ndrew on a wide range of sources to flesh out his conception of social\naction or social control, including the utopian Edward Bellamy and\nBritish guild socialist G. D. H. Cole, and argued for social\nreforms that tended to strengthen workers’ rights, including\nrights to form and join unions, and to take strike action, and the\nextension of democratic control in the workplace, and a welfare\nstate, in the name of freedom as individuality. More\npointedly, Dewey argued, particularly in the 1930s, that a socialized\neconomy was necessary to maintain the liberal value of freedom.\nUnsurprisingly, this drew a hostile reception from advocates of a\nnegative concept of liberty such as F. A. Hayek (1960), who viewed\nDewey as profoundly destructive of liberalism.\n\nSince both positive liberty and the idea of social control have been\nthought to have worrying authoritarian implications, and Dewey is\nsometimes thought of as a technocrat, it is worth emphasising the\nliberal and democratic character of Dewey’s conception of social\naction. Individuality as an ethical ideal requires that individuals\nfind their own way, and not have particular doctrines or social roles\nimposed on them: it is only “when individuals have initiative,\nindependence of judgment, flexibility, fullness of experience can they\nact so as to enrich the lives of others” (Ethics,\n2nd edition, LW7, 285). Dewey doesn’t think\nthat the liberal rights protected in the name of individual liberty\n(such as freedoms of speech, thought, movement, and so on) should be\ndispensed with but rather that they are constitutive in part of the\npositive liberty he advocates. Indeed, he emphasises that\n“direct and violent encroachments on liberty of thought and\nspeech are perpetrated by police and by organized bands of persons\nwhen suggestions for important change in economic lines are put\nforth” (Ethics, 2nd edition, LW7,\n360). Furthermore, viewing liberty through the prism of individuality\nonly opens up the possibility of political action in the name of\nliberty, but it does not itself require it. Finally, and in contrast\nto technocratic critics of laissez-faire such as Walter\nLippmann, as we will see, Dewey argues that an extensive form of\ndemocracy is essential for social action, and he vests little faith in\nexperts.\n",
    "section_title": "2. Reconstructing Liberalism",
    "entry_title": "Dewey’s Political Philosophy",
    "hierarchy_title": "Dewey’s Political Philosophy || Reconstructing Liberalism",
    "tokenized_text": [
        "reconstructing",
        "liberalism",
        "reconstructing",
        "liberalism",
        "one",
        "legacy",
        "green",
        "idealism",
        "dewey",
        "engagement",
        "new",
        "liberal",
        "project",
        "recasting",
        "liberalism",
        "appropriate",
        "form",
        "modern",
        "society",
        "core",
        "least",
        "viable",
        "component",
        "liberalism",
        "commitment",
        "liberty",
        "opportunity",
        "individual",
        "secure",
        "full",
        "realization",
        "potentiality",
        "liberalism",
        "social",
        "action",
        "lw",
        "moral",
        "theory",
        "seen",
        "viewed",
        "construct",
        "solve",
        "practical",
        "problem",
        "like",
        "outmoded",
        "piece",
        "technology",
        "past",
        "value",
        "constructed",
        "address",
        "problem",
        "one",
        "set",
        "circumstance",
        "outlive",
        "usefulness",
        "become",
        "hindrance",
        "capacity",
        "present",
        "deal",
        "practical",
        "need",
        "worry",
        "dewey",
        "belief",
        "case",
        "theory",
        "classical",
        "laissezfaire",
        "liberalism",
        "put",
        "slogan",
        "liberalism",
        "one",
        "period",
        "become",
        "bulwark",
        "reaction",
        "next",
        "logical",
        "method",
        "law",
        "mw",
        "dewey",
        "provide",
        "reason",
        "reject",
        "liberalism",
        "however",
        "although",
        "sensitive",
        "allure",
        "antiliberal",
        "thought",
        "rather",
        "liberalism",
        "modern",
        "society",
        "usually",
        "socialist",
        "radical",
        "direction",
        "throughout",
        "political",
        "writing",
        "develops",
        "thought",
        "discussing",
        "relation",
        "individual",
        "society",
        "character",
        "value",
        "freedom",
        "scope",
        "legitimate",
        "social",
        "political",
        "action",
        "dewey",
        "treatment",
        "genealogy",
        "classical",
        "liberalism",
        "nuanced",
        "summary",
        "see",
        "doctrine",
        "committed",
        "universal",
        "moral",
        "primacy",
        "individual",
        "possessed",
        "presocietal",
        "right",
        "including",
        "liberty",
        "thought",
        "action",
        "sole",
        "business",
        "state",
        "protect",
        "liberalism",
        "social",
        "action",
        "lw",
        "meant",
        "main",
        "opponent",
        "liberty",
        "seen",
        "government",
        "tendency",
        "encroach",
        "innate",
        "liberty",
        "abstraction",
        "individual",
        "social",
        "context",
        "classical",
        "liberalism",
        "shape",
        "normative",
        "theory",
        "individual",
        "thought",
        "existing",
        "prior",
        "social",
        "institution",
        "easier",
        "envisage",
        "securing",
        "freedom",
        "individual",
        "purely",
        "negative",
        "term",
        "solely",
        "consisting",
        "removal",
        "external",
        "impediment",
        "individual",
        "action",
        "legal",
        "restriction",
        "freedom",
        "speech",
        "classical",
        "liberalism",
        "old",
        "individualism",
        "freedom",
        "taken",
        "consist",
        "absence",
        "intentional",
        "constraint",
        "individual",
        "ability",
        "pursue",
        "chosen",
        "goal",
        "individual",
        "viewed",
        "surrounded",
        "protective",
        "cordon",
        "right",
        "define",
        "freedom",
        "removal",
        "external",
        "constraint",
        "may",
        "sometimes",
        "important",
        "supplying",
        "condition",
        "liberty",
        "liberty",
        "sense",
        "value",
        "liberal",
        "consist",
        "mere",
        "absence",
        "external",
        "constraint",
        "dewey",
        "negative",
        "view",
        "freedom",
        "root",
        "wider",
        "social",
        "ethical",
        "political",
        "defect",
        "form",
        "individualism",
        "religion",
        "morality",
        "free",
        "society",
        "lw",
        "antihistorical",
        "character",
        "classical",
        "liberalism",
        "one",
        "point",
        "provided",
        "certain",
        "ideological",
        "advantage",
        "since",
        "allowed",
        "attack",
        "appeal",
        "tradition",
        "meant",
        "failed",
        "see",
        "historically",
        "conditioned",
        "character",
        "interpretation",
        "liberty",
        "individuality",
        "failure",
        "historical",
        "selfawareness",
        "mean",
        "classical",
        "liberalism",
        "neglect",
        "suppresses",
        "understanding",
        "central",
        "challenge",
        "liberty",
        "effect",
        "becomes",
        "instrument",
        "plutocratic",
        "interest",
        "contrast",
        "seen",
        "dewey",
        "reject",
        "philosophical",
        "absolutism",
        "fixed",
        "ahistorical",
        "conception",
        "self",
        "argues",
        "genuine",
        "liberalism",
        "view",
        "individual",
        "nothing",
        "fixed",
        "given",
        "readymade",
        "something",
        "achieved",
        "achieved",
        "isolation",
        "aid",
        "support",
        "condition",
        "cultural",
        "physical",
        "including",
        "cultural",
        "economic",
        "legal",
        "political",
        "institution",
        "well",
        "science",
        "art",
        "future",
        "liberalism",
        "lw",
        "one",
        "argument",
        "dewey",
        "make",
        "historic",
        "relativity",
        "constitutes",
        "constraint",
        "individual",
        "liberty",
        "one",
        "time",
        "made",
        "sense",
        "say",
        "dynastic",
        "despotic",
        "rule",
        "inherited",
        "legal",
        "custom",
        "main",
        "obstacle",
        "individual",
        "freedom",
        "today",
        "however",
        "liberty",
        "signifies",
        "liberation",
        "material",
        "insecurity",
        "coercion",
        "repression",
        "prevent",
        "multitude",
        "participation",
        "vast",
        "cultural",
        "resource",
        "hand",
        "liberalism",
        "social",
        "action",
        "lw",
        "historically",
        "relative",
        "matter",
        "constitutes",
        "constraint",
        "individual",
        "freedom",
        "however",
        "attempting",
        "mask",
        "well",
        "promoting",
        "outdated",
        "conception",
        "constraint",
        "must",
        "classical",
        "liberalism",
        "come",
        "subvert",
        "liberalism",
        "core",
        "commitment",
        "liberty",
        "individuality",
        "dewey",
        "go",
        "beyond",
        "historicization",
        "however",
        "sense",
        "freedom",
        "substantive",
        "value",
        "liberal",
        "valuable",
        "negative",
        "absence",
        "constraint",
        "positive",
        "power",
        "individualized",
        "self",
        "public",
        "problem",
        "lw",
        "individuality",
        "may",
        "call",
        "weak",
        "sense",
        "universally",
        "possessed",
        "consists",
        "particular",
        "pattern",
        "response",
        "environment",
        "person",
        "display",
        "distinctive",
        "way",
        "feeling",
        "impact",
        "world",
        "showing",
        "preferential",
        "bias",
        "response",
        "impact",
        "individualism",
        "old",
        "new",
        "lw",
        "stronger",
        "sense",
        "value",
        "liberal",
        "according",
        "dewey",
        "individuality",
        "consists",
        "personal",
        "capacity",
        "choice",
        "characteristic",
        "activity",
        "self",
        "ethic",
        "nd",
        "edition",
        "lw",
        "matter",
        "capacity",
        "arbitrarily",
        "whimsically",
        "plumping",
        "one",
        "option",
        "rather",
        "another",
        "rather",
        "choice",
        "expressive",
        "individuality",
        "strong",
        "sense",
        "involves",
        "intelligent",
        "criticism",
        "appraisal",
        "option",
        "accordingly",
        "understand",
        "dewey",
        "claim",
        "foresee",
        "future",
        "objective",
        "alternative",
        "able",
        "deliberation",
        "choose",
        "one",
        "thereby",
        "weigh",
        "chance",
        "struggle",
        "future",
        "existence",
        "measure",
        "freedom",
        "human",
        "nature",
        "conduct",
        "mw",
        "alternative",
        "intelligent",
        "selfdirection",
        "action",
        "according",
        "whatever",
        "notion",
        "individual",
        "picked",
        "environment",
        "including",
        "unreflective",
        "impulse",
        "propaganda",
        "flood",
        "mass",
        "suggestion",
        "identifies",
        "medium",
        "revolution",
        "early",
        "twentieth",
        "century",
        "class",
        "ideology",
        "monotonous",
        "round",
        "imagery",
        "flowing",
        "illiberal",
        "interest",
        "broken",
        "wild",
        "foray",
        "illicit",
        "ethic",
        "st",
        "edition",
        "mw",
        "follows",
        "possession",
        "exercise",
        "capacity",
        "individuality",
        "require",
        "right",
        "social",
        "condition",
        "throughout",
        "writing",
        "argues",
        "education",
        "produce",
        "undocile",
        "unservile",
        "creative",
        "citizen",
        "essential",
        "view",
        "capacity",
        "critical",
        "reflection",
        "supported",
        "democratic",
        "institution",
        "culture",
        "since",
        "least",
        "principle",
        "allow",
        "openness",
        "epistemic",
        "diversity",
        "experiment",
        "contestation",
        "revision",
        "support",
        "freedom",
        "individuality",
        "public",
        "problem",
        "lw",
        "ethic",
        "nd",
        "edition",
        "lw",
        "dewey",
        "go",
        "still",
        "though",
        "situating",
        "free",
        "individual",
        "freedom",
        "consist",
        "development",
        "reflective",
        "individuality",
        "requires",
        "supportive",
        "social",
        "political",
        "condition",
        "also",
        "includes",
        "participation",
        "community",
        "tweaking",
        "idea",
        "found",
        "green",
        "new",
        "liberal",
        "put",
        "public",
        "problem",
        "liberty",
        "secure",
        "release",
        "fulfilment",
        "personal",
        "potentiality",
        "take",
        "place",
        "rich",
        "manifold",
        "association",
        "others",
        "power",
        "individualized",
        "self",
        "making",
        "distinctive",
        "contribution",
        "enjoying",
        "way",
        "fruit",
        "association",
        "public",
        "problem",
        "lw",
        "free",
        "reflectively",
        "choosing",
        "among",
        "set",
        "option",
        "available",
        "rich",
        "set",
        "worthwhile",
        "option",
        "without",
        "option",
        "free",
        "free",
        "someone",
        "enjoy",
        "rich",
        "manifold",
        "association",
        "others",
        "also",
        "free",
        "making",
        "distinctive",
        "contribution",
        "society",
        "dewey",
        "kind",
        "positive",
        "liberty",
        "theorist",
        "individual",
        "freedom",
        "achieved",
        "participation",
        "process",
        "individual",
        "society",
        "exercise",
        "collective",
        "control",
        "affair",
        "return",
        "next",
        "section",
        "since",
        "shape",
        "dewey",
        "conception",
        "democracy",
        "underlined",
        "account",
        "freedom",
        "basis",
        "critical",
        "assessment",
        "capitalist",
        "society",
        "direct",
        "impact",
        "liberty",
        "always",
        "class",
        "group",
        "suffering",
        "special",
        "way",
        "form",
        "constraint",
        "exercised",
        "distribution",
        "power",
        "exists",
        "contemporary",
        "society",
        "liberalism",
        "social",
        "action",
        "lw",
        "liberal",
        "agree",
        "state",
        "important",
        "role",
        "maintaining",
        "condition",
        "individual",
        "freedom",
        "dewey",
        "character",
        "value",
        "freedom",
        "hegelian",
        "idealist",
        "new",
        "liberal",
        "drew",
        "later",
        "writer",
        "negative",
        "positive",
        "liberty",
        "isaiah",
        "berlin",
        "flowed",
        "debate",
        "proper",
        "scope",
        "social",
        "political",
        "action",
        "scope",
        "legitimate",
        "social",
        "political",
        "action",
        "determined",
        "experimentally",
        "light",
        "need",
        "conception",
        "freedom",
        "individuality",
        "laissezfaire",
        "assumed",
        "default",
        "position",
        "liberal",
        "earlier",
        "liberalism",
        "opposition",
        "individual",
        "government",
        "may",
        "made",
        "sense",
        "era",
        "characterised",
        "political",
        "despotism",
        "circumstance",
        "popular",
        "government",
        "need",
        "track",
        "regulate",
        "complexity",
        "modern",
        "industrial",
        "condition",
        "however",
        "nostrum",
        "laissezfaire",
        "liberalism",
        "serve",
        "provide",
        "ideological",
        "support",
        "plutocracy",
        "dewey",
        "drew",
        "wide",
        "range",
        "source",
        "flesh",
        "conception",
        "social",
        "action",
        "social",
        "control",
        "including",
        "utopian",
        "edward",
        "bellamy",
        "british",
        "guild",
        "socialist",
        "g",
        "d",
        "h",
        "cole",
        "argued",
        "social",
        "reform",
        "tended",
        "strengthen",
        "worker",
        "right",
        "including",
        "right",
        "form",
        "join",
        "union",
        "take",
        "strike",
        "action",
        "extension",
        "democratic",
        "control",
        "workplace",
        "welfare",
        "state",
        "name",
        "freedom",
        "individuality",
        "pointedly",
        "dewey",
        "argued",
        "particularly",
        "s",
        "socialized",
        "economy",
        "necessary",
        "maintain",
        "liberal",
        "value",
        "freedom",
        "unsurprisingly",
        "drew",
        "hostile",
        "reception",
        "advocate",
        "negative",
        "concept",
        "liberty",
        "f",
        "a",
        "hayek",
        "viewed",
        "dewey",
        "profoundly",
        "destructive",
        "liberalism",
        "since",
        "positive",
        "liberty",
        "idea",
        "social",
        "control",
        "thought",
        "worrying",
        "authoritarian",
        "implication",
        "dewey",
        "sometimes",
        "thought",
        "technocrat",
        "worth",
        "emphasising",
        "liberal",
        "democratic",
        "character",
        "dewey",
        "conception",
        "social",
        "action",
        "individuality",
        "ethical",
        "ideal",
        "requires",
        "individual",
        "find",
        "way",
        "particular",
        "doctrine",
        "social",
        "role",
        "imposed",
        "individual",
        "initiative",
        "independence",
        "judgment",
        "flexibility",
        "fullness",
        "experience",
        "act",
        "enrich",
        "life",
        "others",
        "ethic",
        "nd",
        "edition",
        "lw",
        "dewey",
        "think",
        "liberal",
        "right",
        "protected",
        "name",
        "individual",
        "liberty",
        "freedom",
        "speech",
        "thought",
        "movement",
        "dispensed",
        "rather",
        "constitutive",
        "part",
        "positive",
        "liberty",
        "advocate",
        "indeed",
        "emphasis",
        "direct",
        "violent",
        "encroachment",
        "liberty",
        "thought",
        "speech",
        "perpetrated",
        "police",
        "organized",
        "band",
        "person",
        "suggestion",
        "important",
        "change",
        "economic",
        "line",
        "put",
        "forth",
        "ethic",
        "nd",
        "edition",
        "lw",
        "furthermore",
        "viewing",
        "liberty",
        "prism",
        "individuality",
        "open",
        "possibility",
        "political",
        "action",
        "name",
        "liberty",
        "require",
        "finally",
        "contrast",
        "technocratic",
        "critic",
        "laissezfaire",
        "walter",
        "lippmann",
        "see",
        "dewey",
        "argues",
        "extensive",
        "form",
        "democracy",
        "essential",
        "social",
        "action",
        "vest",
        "little",
        "faith",
        "expert"
    ]
}