{
    "main_text": "Motivations for Dialetheism || Other Motivations for Dialetheism\n3.4 Other Motivations for Dialetheism\n\nDialetheias produced by the paradoxes of self-reference are confined\nto the abstract realm of notions such as set or to semantic\nconcepts such as truth. However, the paradoxes of\nself-reference are not the only examples of dialetheias that have been\nmooted. Other cases involve contradictions affecting concrete objects\nand the empirical world, and include the following.\n\n(1) Transition states: when I exit the room, I am inside the\nroom at one time, and outside of it at another. Given the continuity\nof motion, there must be a precise instant in time, call it \\(t\\), at\nwhich I leave the room. Am I inside the room or outside at time \\(t\\)?\nFour answers are available: (a) I am inside; (b) I am outside; (c) I\nam both; and (d) I am neither. There is a strong intuition that (a)\nand (b) are ruled out by symmetry considerations: choosing either\nwould be completely arbitrary. (This intuition is not at all unique to\ndialetheists: see the article on\n boundaries\n in general.) As for (d): if I am neither inside not outside the room,\nthen I am not inside and not-not inside; therefore, I am either inside\nand not inside (option (c)), or not inside and not-not inside (which\nfollows from option (d)); in both cases, a dialetheic situation. Or so\nit has been argued. For a description of inconsistent boundaries using\nformal mereology, see Weber and Cotnoir 2015.\n\n(2) Some of Zeno’s paradoxes concerning a\nparticular—though, perhaps, the most basic—kind of\ntransition, that is, local motion: a moving arrow is both\nwhere it is, and where it is not. In any given instant, argues Zeno,\nit cannot move to where it is, since it is already there, and it\ncannot move to somewhere else, because there isn’t time for it\nto get there. The orthodox way out of the paradoxical situation, as\nformulated, e.g., by Russell 1903, has it that motion is the mere\noccupation of different places at different times. But one could argue\nthat this is denial of the phenomenon itself, that is, of the\nactuality of motion: Russell’s solution entails that motion is\nnot an intrinsic state of the (allegedly) moving thing, for,\nat each instant, the arrow is not moving at all. Can a going-somewhere\nbe composed by an (even continuum-sized) infinity of going-nowheres?\nAn alternative, dialetheic account of motion, which takes at face\nvalue the aforementioned Hegelian idea that “Something moves,\nnot because at one moment it is here and another there, but because at\none and the same moment it is here and not here, because in this\n‘here’, it at once is and is not”, is exposed in\nPriest 1987, Ch. 12.\n\n(3) Borderline cases of vague predicates. Popular approaches\nto\n vagueness\n and the\n sorites paradox,\n such as the ones based on many-valued logics, or supervaluations,\nrequire some under-determinacy of reference, and/or the rejection of\nBivalence: if an adolescent, \\(m\\), is a borderline case of adultness,\n\\(A\\), then \\(A(m)\\) may turn out to have an intermediate truth value\nbetween truth and falsity, or no truth value at all. But it may be\nconjectured that a borderline object like \\(m\\), instead of satisfying\nneither a vague predicate nor its negation, satisfies them both: an\nadolescent both is and is not an adult. Given the obvious dualities\nbetween the LEM and the Law of Bivalence on the one side, and\n(respectively, syntactic and semantic formulations of) the LNC on the\nother, it is not too difficult to envisage a\n‘sub-valuational’ semantic approach, dual to the\nsupervaluation strategy. Sub-valuational paraconsistent semantics have\nbeen proposed by Hyde (1997), and Varzi (1997). Other\n‘glutty’ approaches to vagueness have been proposed by\nColyvan (2009), Weber (2010), Priest (2010), Ripley (2013), and\nCobreros et al (2010, 2015), motivated on both theoretical and\nempirical grounds. If inconsistencies due to vague predicates and\nborderline objects are taken to be due to merely semantic under- and\nover- determination of ordinary language (de dicto), then\nthis is further evidence for dialetheism about semantics. If the\naforementioned phenomena are taken to be not just about words but\nthings (de re), then actually inconsistent objects are\nadmitted, together with vague objects. And this spreads inconsistency\nall over the empirical world: if borderline cases can be inconsistent,\ninconsistent objects are more or less everywhere, given how pervasive\nthe phenomenon of vagueness notoriously is: adolescents, borderline\nbald men, etc. Inconsistency is observable (Beall and Colyvan\n2001). Beall argues against the approach in Ch. 5 of Beall 2009, and\nBeall 2014a.\n\n(4) Multi-criterial predicates. We may assume that the\nsemantics of a predicate is specified by means of its criteria of\napplication. Now ordinary language hosts predicates with different,\nand occasionally conflicting, criteria of application (e.g.,\n‘left wing’): some criteria for applying a predicate \\(P\\)\n(e.g., caring about social welfare, raising minimum wages) may entail\nthat object \\(m\\) (e.g., a political party) is in the extension of the\npredicate, some others (promoting nationalism, oppressing immigrants),\nthat \\(m\\) is in its anti-extension, or negative extension. Criteria\ncan in some cases be encoded by such things as meaning postulates (or\nother similar, albeit more sophisticated, semantic devices); but\nconflicting meaning postulates may be embedded in our standard\nlinguistic practices, and difficult to detect and identify. If the\nextensions of our ordinary predicates are constrained by our\nintuitions, and such intuitions turn out to be inconsistent, a good\nsemantic account of the situation may well have to reflect this fact\n(accepting, in our example, that a party counts as both left and right\nwing), instead of destroying it by means of some regimentation (e.g.\nvia the usual parameterisation, or distinction of respects). As Priest\n1987, pp 67–9, clarifies, it is also hard to analyse such\nsituations as cases of vagueness (so that a party has to be understood\nas being left wing to some degree, and right wing to some degree).\n\n(5) Certain legal situations, such as inconsistent bodies of\nlaw. Suppose, for instance, that some norm states that a marriage\nperformed by the captain of a ship counts as a legal marriage only if\nthe ship was in open water throughout the ceremony. It turns out,\nthen, that some other law has established that such a marriage is\nvalid also if the ceremony has only begun with the ship in open water,\nbut has ended with the ship in the port. Then someone may turn out to\nbe both a married man and not a married man. (Since it does not appear\nto follow that he is not a man anymore, or both a man and not a man,\nwe have another putative counterexample to ex contradictione\nquodlibet). If one accepts the plausible view that statements\nconcerning legal rights, obligations, and statuses, can be truth-value\napt, we seem to have a dialetheia. Of course, legal systems sometimes\nhave mechanisms that can be used to remove such inconsistencies (e.g.,\nby ordering different kinds of laws in a hierarchy from customary\nlaws, to established jurisprudence, to ordinary legislation, to\nconstitutional norms, etc.; or via the lex posterior\nprinciple, giving priority to the more recent norm in case of\nconflict). But this is not always the case: the inconsistent laws may\nbe of the same rank, enacted at the same time, etc. For a recent\ndiscussion, see Beall 2016.\n\n(6) In post-Kantian metaphysics, a movement sometimes dubbed\n‘new realism’ or ‘speculative realism’ has\ndeveloped, in various work by Quentin Meillassoux, Graham Harman,\nMarkus Gabriel, and others. The idea is that much of philosophy since\nKant, especially in the continential tradition, has been lost in\npostmodernist concern with thought and language, and that a return to\nthe “Great Outdoors” is overdue. The return to realism\nthough is speculative in the sense that it continues to take seriously\nepistemic concerns: in Harman’s case at least, mind-independent\nobjects will be radically resistant to knowledge and almost impossibly\nremoved from us. If such a realism involves specifying objects or\nmaking knowledge claims about them that the theory itself seems to\npreclude, then, much as with the paradoxes at the limit of thought\n(presented in section 2.1 above), this may crucially involve\ncontradiction. Some practitioners in this area have explicitly\nendorsed dialetheism, e.g. Morton 2012. Cogburn has identified in this\napproach what he dubs the ‘object oriented ontology’\nparadox (as fitting Priest’s inclosure schema): “To the\nextent that object-oriented ontologists really are offering\nspeculative systems of metaphysics, they seem to be trying to do what\nthey themselves take to be impossible” (Cogburn 2017, chapter 3;\nsee 3.3 above).\n\n(7) It has long been recognized that theology may involve\nparadoxes. In traditional Western monotheism, various divine\nattributes appear to be logically inconsistent. Famously, the question\nof whether an omnipotent God can create a stone so heavy He Himself\ncannot lift seems to lead to a contradiction—something that is\nboth possible and not possible for God. Cotnoir 2018 explores whether\ndialetheism and the tools of paraconsistent logic provide a plausible\nresponse to these paradoxes, namely, to accept their conclusions.\nBeall 2021 focuses more specifically on Christianity and the apparent\ncontradiction that Jesus Christ was both mortal (and limited) but also\ndivine (and so immortal and unlimited), with the suggestion that this\ncan best be accommodated as a truth glut. Weber 2019 expresses\ndisagreement with theological applications of dialetheism. \n\nEach of the above topics undoubtedly call for further development. See\nPriest 1987 or Ficara 2014. This list is also not exhaustive. For\nexample, some\n connexive logics\n are contra-classical (they validate classically invalid arguments)\nand are even contradictory in their propositional fragment. That is,\nwhereas most motivations for dialetheism come from non-logical\nsources, connexive logic is dialetheic at the most basic logical\nlevel; see Omori and Wansing 2019. Or, for both a motivation and\napplication of dialetheism, Casati 2021 argues for a dialetheic\ninterpretation of the late Heidegger in which Being itself is both an\nentity and not an entity, and that this can be made sense of through\nmereology and metaphysical grounding. \n",
    "section_title": "3.4 Other Motivations for Dialetheism",
    "entry_title": "Dialetheism",
    "hierarchy_title": "Dialetheism || Motivations for Dialetheism || Other Motivations for Dialetheism",
    "tokenized_text": [
        "motivation",
        "dialetheism",
        "motivation",
        "dialetheism",
        "motivation",
        "dialetheism",
        "dialetheias",
        "produced",
        "paradox",
        "selfreference",
        "confined",
        "abstract",
        "realm",
        "notion",
        "set",
        "semantic",
        "concept",
        "truth",
        "however",
        "paradox",
        "selfreference",
        "example",
        "dialetheias",
        "mooted",
        "case",
        "involve",
        "contradiction",
        "affecting",
        "concrete",
        "object",
        "empirical",
        "world",
        "include",
        "following",
        "transition",
        "state",
        "exit",
        "room",
        "inside",
        "room",
        "one",
        "time",
        "outside",
        "another",
        "given",
        "continuity",
        "motion",
        "must",
        "precise",
        "instant",
        "time",
        "call",
        "t",
        "leave",
        "room",
        "inside",
        "room",
        "outside",
        "time",
        "t",
        "four",
        "answer",
        "available",
        "inside",
        "b",
        "outside",
        "c",
        "neither",
        "strong",
        "intuition",
        "b",
        "ruled",
        "symmetry",
        "consideration",
        "choosing",
        "either",
        "would",
        "completely",
        "arbitrary",
        "intuition",
        "unique",
        "dialetheists",
        "see",
        "article",
        "boundary",
        "general",
        "neither",
        "inside",
        "outside",
        "room",
        "inside",
        "notnot",
        "inside",
        "therefore",
        "either",
        "inside",
        "inside",
        "option",
        "c",
        "inside",
        "notnot",
        "inside",
        "follows",
        "option",
        "case",
        "dialetheic",
        "situation",
        "argued",
        "description",
        "inconsistent",
        "boundary",
        "using",
        "formal",
        "mereology",
        "see",
        "weber",
        "cotnoir",
        "zeno",
        "paradox",
        "concerning",
        "particularthough",
        "perhaps",
        "basickind",
        "transition",
        "local",
        "motion",
        "moving",
        "arrow",
        "given",
        "instant",
        "argues",
        "zeno",
        "move",
        "since",
        "already",
        "move",
        "somewhere",
        "else",
        "time",
        "get",
        "orthodox",
        "way",
        "paradoxical",
        "situation",
        "formulated",
        "eg",
        "russell",
        "motion",
        "mere",
        "occupation",
        "different",
        "place",
        "different",
        "time",
        "one",
        "could",
        "argue",
        "denial",
        "phenomenon",
        "actuality",
        "motion",
        "russell",
        "solution",
        "entail",
        "motion",
        "intrinsic",
        "state",
        "allegedly",
        "moving",
        "thing",
        "instant",
        "arrow",
        "moving",
        "goingsomewhere",
        "composed",
        "even",
        "continuumsized",
        "infinity",
        "goingnowheres",
        "alternative",
        "dialetheic",
        "account",
        "motion",
        "take",
        "face",
        "value",
        "aforementioned",
        "hegelian",
        "idea",
        "something",
        "move",
        "one",
        "moment",
        "another",
        "one",
        "moment",
        "exposed",
        "priest",
        "ch",
        "borderline",
        "case",
        "vague",
        "predicate",
        "popular",
        "approach",
        "vagueness",
        "sorites",
        "paradox",
        "one",
        "based",
        "manyvalued",
        "logic",
        "supervaluations",
        "require",
        "underdeterminacy",
        "reference",
        "andor",
        "rejection",
        "bivalence",
        "adolescent",
        "m",
        "borderline",
        "case",
        "adultness",
        "a",
        "may",
        "turn",
        "intermediate",
        "truth",
        "value",
        "truth",
        "falsity",
        "truth",
        "value",
        "may",
        "conjectured",
        "borderline",
        "object",
        "like",
        "m",
        "instead",
        "satisfying",
        "neither",
        "vague",
        "predicate",
        "negation",
        "satisfies",
        "adolescent",
        "adult",
        "given",
        "obvious",
        "duality",
        "lem",
        "law",
        "bivalence",
        "one",
        "side",
        "respectively",
        "syntactic",
        "semantic",
        "formulation",
        "lnc",
        "difficult",
        "envisage",
        "subvaluational",
        "semantic",
        "approach",
        "dual",
        "supervaluation",
        "strategy",
        "subvaluational",
        "paraconsistent",
        "semantics",
        "proposed",
        "hyde",
        "varzi",
        "glutty",
        "approach",
        "vagueness",
        "proposed",
        "colyvan",
        "weber",
        "priest",
        "ripley",
        "cobreros",
        "et",
        "al",
        "motivated",
        "theoretical",
        "empirical",
        "ground",
        "inconsistency",
        "due",
        "vague",
        "predicate",
        "borderline",
        "object",
        "taken",
        "due",
        "merely",
        "semantic",
        "under",
        "over",
        "determination",
        "ordinary",
        "language",
        "de",
        "dicto",
        "evidence",
        "dialetheism",
        "semantics",
        "aforementioned",
        "phenomenon",
        "taken",
        "word",
        "thing",
        "de",
        "actually",
        "inconsistent",
        "object",
        "admitted",
        "together",
        "vague",
        "object",
        "spread",
        "inconsistency",
        "empirical",
        "world",
        "borderline",
        "case",
        "inconsistent",
        "inconsistent",
        "object",
        "le",
        "everywhere",
        "given",
        "pervasive",
        "phenomenon",
        "vagueness",
        "notoriously",
        "adolescent",
        "borderline",
        "bald",
        "men",
        "etc",
        "inconsistency",
        "observable",
        "beall",
        "colyvan",
        "beall",
        "argues",
        "approach",
        "ch",
        "beall",
        "beall",
        "a",
        "multicriterial",
        "predicate",
        "may",
        "assume",
        "semantics",
        "predicate",
        "specified",
        "mean",
        "criterion",
        "application",
        "ordinary",
        "language",
        "host",
        "predicate",
        "different",
        "occasionally",
        "conflicting",
        "criterion",
        "application",
        "eg",
        "left",
        "wing",
        "criterion",
        "applying",
        "predicate",
        "p",
        "eg",
        "caring",
        "social",
        "welfare",
        "raising",
        "minimum",
        "wage",
        "may",
        "entail",
        "object",
        "m",
        "eg",
        "political",
        "party",
        "extension",
        "predicate",
        "others",
        "promoting",
        "nationalism",
        "oppressing",
        "immigrant",
        "m",
        "antiextension",
        "negative",
        "extension",
        "criterion",
        "case",
        "encoded",
        "thing",
        "meaning",
        "postulate",
        "similar",
        "albeit",
        "sophisticated",
        "semantic",
        "device",
        "conflicting",
        "meaning",
        "postulate",
        "may",
        "embedded",
        "standard",
        "linguistic",
        "practice",
        "difficult",
        "detect",
        "identify",
        "extension",
        "ordinary",
        "predicate",
        "constrained",
        "intuition",
        "intuition",
        "turn",
        "inconsistent",
        "good",
        "semantic",
        "account",
        "situation",
        "may",
        "well",
        "reflect",
        "fact",
        "accepting",
        "example",
        "party",
        "count",
        "left",
        "right",
        "wing",
        "instead",
        "destroying",
        "mean",
        "regimentation",
        "eg",
        "via",
        "usual",
        "parameterisation",
        "distinction",
        "respect",
        "priest",
        "pp",
        "clarifies",
        "also",
        "hard",
        "analyse",
        "situation",
        "case",
        "vagueness",
        "party",
        "understood",
        "left",
        "wing",
        "degree",
        "right",
        "wing",
        "degree",
        "certain",
        "legal",
        "situation",
        "inconsistent",
        "body",
        "law",
        "suppose",
        "instance",
        "norm",
        "state",
        "marriage",
        "performed",
        "captain",
        "ship",
        "count",
        "legal",
        "marriage",
        "ship",
        "open",
        "water",
        "throughout",
        "ceremony",
        "turn",
        "law",
        "established",
        "marriage",
        "valid",
        "also",
        "ceremony",
        "begun",
        "ship",
        "open",
        "water",
        "ended",
        "ship",
        "port",
        "someone",
        "may",
        "turn",
        "married",
        "man",
        "married",
        "man",
        "since",
        "appear",
        "follow",
        "man",
        "anymore",
        "man",
        "man",
        "another",
        "putative",
        "counterexample",
        "ex",
        "contradictione",
        "quodlibet",
        "one",
        "accepts",
        "plausible",
        "view",
        "statement",
        "concerning",
        "legal",
        "right",
        "obligation",
        "status",
        "truthvalue",
        "apt",
        "seem",
        "dialetheia",
        "course",
        "legal",
        "system",
        "sometimes",
        "mechanism",
        "used",
        "remove",
        "inconsistency",
        "eg",
        "ordering",
        "different",
        "kind",
        "law",
        "hierarchy",
        "customary",
        "law",
        "established",
        "jurisprudence",
        "ordinary",
        "legislation",
        "constitutional",
        "norm",
        "etc",
        "via",
        "lex",
        "posterior",
        "principle",
        "giving",
        "priority",
        "recent",
        "norm",
        "case",
        "conflict",
        "always",
        "case",
        "inconsistent",
        "law",
        "may",
        "rank",
        "enacted",
        "time",
        "etc",
        "recent",
        "discussion",
        "see",
        "beall",
        "postkantian",
        "metaphysics",
        "movement",
        "sometimes",
        "dubbed",
        "new",
        "realism",
        "speculative",
        "realism",
        "developed",
        "various",
        "work",
        "quentin",
        "meillassoux",
        "graham",
        "harman",
        "markus",
        "gabriel",
        "others",
        "idea",
        "much",
        "philosophy",
        "since",
        "kant",
        "especially",
        "continential",
        "tradition",
        "lost",
        "postmodernist",
        "concern",
        "thought",
        "language",
        "return",
        "great",
        "outdoors",
        "overdue",
        "return",
        "realism",
        "though",
        "speculative",
        "sense",
        "continues",
        "take",
        "seriously",
        "epistemic",
        "concern",
        "harman",
        "case",
        "least",
        "mindindependent",
        "object",
        "radically",
        "resistant",
        "knowledge",
        "almost",
        "impossibly",
        "removed",
        "u",
        "realism",
        "involves",
        "specifying",
        "object",
        "making",
        "knowledge",
        "claim",
        "theory",
        "seems",
        "preclude",
        "much",
        "paradox",
        "limit",
        "thought",
        "presented",
        "section",
        "may",
        "crucially",
        "involve",
        "contradiction",
        "practitioner",
        "area",
        "explicitly",
        "endorsed",
        "dialetheism",
        "eg",
        "morton",
        "cogburn",
        "identified",
        "approach",
        "dub",
        "object",
        "oriented",
        "ontology",
        "paradox",
        "fitting",
        "priest",
        "inclosure",
        "schema",
        "extent",
        "objectoriented",
        "ontologists",
        "really",
        "offering",
        "speculative",
        "system",
        "metaphysics",
        "seem",
        "trying",
        "take",
        "impossible",
        "cogburn",
        "chapter",
        "see",
        "long",
        "recognized",
        "theology",
        "may",
        "involve",
        "paradox",
        "traditional",
        "western",
        "monotheism",
        "various",
        "divine",
        "attribute",
        "appear",
        "logically",
        "inconsistent",
        "famously",
        "question",
        "whether",
        "omnipotent",
        "god",
        "create",
        "stone",
        "heavy",
        "lift",
        "seems",
        "lead",
        "contradictionsomething",
        "possible",
        "possible",
        "god",
        "cotnoir",
        "explores",
        "whether",
        "dialetheism",
        "tool",
        "paraconsistent",
        "logic",
        "provide",
        "plausible",
        "response",
        "paradox",
        "namely",
        "accept",
        "conclusion",
        "beall",
        "focus",
        "specifically",
        "christianity",
        "apparent",
        "contradiction",
        "jesus",
        "christ",
        "mortal",
        "limited",
        "also",
        "divine",
        "immortal",
        "unlimited",
        "suggestion",
        "best",
        "accommodated",
        "truth",
        "glut",
        "weber",
        "express",
        "disagreement",
        "theological",
        "application",
        "dialetheism",
        "topic",
        "undoubtedly",
        "call",
        "development",
        "see",
        "priest",
        "ficara",
        "list",
        "also",
        "exhaustive",
        "example",
        "connexive",
        "logic",
        "contraclassical",
        "validate",
        "classically",
        "invalid",
        "argument",
        "even",
        "contradictory",
        "propositional",
        "fragment",
        "whereas",
        "motivation",
        "dialetheism",
        "come",
        "nonlogical",
        "source",
        "connexive",
        "logic",
        "dialetheic",
        "basic",
        "logical",
        "level",
        "see",
        "omori",
        "wansing",
        "motivation",
        "application",
        "dialetheism",
        "casati",
        "argues",
        "dialetheic",
        "interpretation",
        "late",
        "heidegger",
        "entity",
        "entity",
        "made",
        "sense",
        "mereology",
        "metaphysical",
        "grounding"
    ]
}