{
    "main_text": "Diderot’s Life and Major Writings || The Years of Celebrity (1765–1773)\n1.3 The Years of Celebrity (1765–1773)\n\nIn 1765, after the final appearance of all text volumes of the\nEncyclopédie, Diderot experienced a kind of liberation\nas his life was freed from the work that had occupied most of his time\nand energy over the previous fifteen years. During the 1760s, Diderot\ncontinued to do what was necessary to see the\nEncyclopédie project completed, ultimately authoring\nnearly six thousand articles himself. But he was also gradually able\nto step back, retreating in some respects to the background of the\nphilosophe movement. With this liberation, a highly\nproductive period in his life began as new and original books began to\nflow from his pen.\n\nDiderot’s earliest writings from this period, pursued while the\nEncyclopédie project was still ramping up to full\nspeed, continued the philosophical and literary explorations initiated\nin the 1740s. Taken as a whole they reflect his lifelong preoccupation\nwith questions of life, liberty, purpose, and order within an\nEpicurean cosmos that may not be governed by a providential creator,\nalong with his continuing interest in the epistemological problem of\ndiscerning the nature and principles of such a world, especially as\nthey related to the emerging biological sciences of the eighteenth\ncentury. Key works in this vein include Lettre sur les sourds et\nmuets à l’usage de ceux qui entendent et qui\nparlent, a continuation of sorts to his Lettre sur les\naveugles, and Pensées sur\nl’interprétation de la nature, a work that retains\nthe episodic, propositional structure of his Pensées\nphilosophiques while expanding the explanations within each\nsection.\n\nScholars have also suggested, though never proven definitively, that\nDiderot contributed during these years to Baron\nd’Holbach’s Système de la Nature, first\npublished in 1770, a book that stands alongside\nHelvétius’ De l’Esprit as one of the great\nmasterpieces of French Enlightenment materialist philosophy. Diderot\nwas certainly at the center of the D’Holbach’s coterie,\nand if the dry and programmatic systematicity of\nD’Holbach’s book lacks the lively play of Diderot’s\nbest philosophical writing, it is certain that he and the Baron were\nkindred spirits.\n\nOne of Diderot’s great masterpieces, written during these years\nbut only published posthumously, should be included as a part of the\nnatural-philosophical corpus summarized above, even if it engages with\nthese seminal questions of metaphysics and natural philosophy in an\novertly literary manner, drawing more on Enlightenment epistolary\nnovels and theater for its construction than the classical\nphilosophical genres of antique philosophy (although one should recall\nthat Plato wrote dialogues).\n\nCalled Le Rêve de D’Alembert\n(D’Alembert’s Dream), the work is in fact a\ntrilogy of dialogues whose centerpiece provides the title. This\ncomplex text reveals some of Diderot’s most important thinking\nabout metaphysics as it relates to biology and the life sciences.\nAlthough it was never published in Diderot’s lifetime, it was\nnevertheless one of his favorite works, and he gave one copy to\nCatherine the Great as a gift, together, significantly in terms of his\nunderstanding of the work, with a set of “Fragments” that\nhe presented as belonging to his physiological writings. The dialogues\nwould certainly have been considered a subversive work had they been\npublished when they were written, and whatever Diderot’s\nmotivations in producing it as he did, the creative complexity\nconverges into what is without question one of the great masterpieces\nof Enlightenment philosophie.\n\nThe same combination of literature and philosophy, textual play and\nreasoned argumentation present in Le Rêve de\nD’Alembert is also present in Diderot’s other\nseemingly literary and artistic writings, which also contain much\nserious science and philosophy.\n\nOne important cluster concerns the theory and practice of theater.\nDiderot wrote scripts for plays that were staged in Paris, including\nLe Fils naturel in 1757 and Le père de\nfamille in 1758. These were moralizing melodramas advocating the\nethical value of the conjugal family and the virtues of thrift,\ndomestic love and piety. His plays are not major touchstones in the\nhistory of theater, but his meta-theoretical writings about theater\nitself, which provide many interesting points of departure for his\nphilosophy, are important contributions to aesthetic theory.\nDiderot’s novels and other works of overt fiction also partake\nin the aesthetic explorations that mark his best work on the theater.\nIn both, Diderot manifests an interest in the nature and limits of\nrepresentation itself, and a self-aware consciousness regarding the\ntenuous interaction between language, experience, and their ability to\nmerge (or not) into coherent representations. These are issues that\nare present in all of Diderot’s most sophisticated thought,\nincluding his more explicitly framed philosophy.\n\nDiderot displayed the same philosophical-literary tendencies in his\nart criticism. His work in this area began in 1759 when the journalist\nF.M. Grimm invited Diderot to contribute to his monthly journal\nCorrespondence Littéraire with reflections on the art\ndisplayed at the biennial Parisian art salon. Staged in the Louvre,\nthese shows allowed painters and sculptors to showcase their work in a\nsetting that gave a broad public audience access to the work of the\nbest artists of the day. Others had written commentaries about the\nexhibitions before, but no one before Diderot had provided anything\nlike the critical philosophical assessment of the art of the\nsalons.\n\nA new academically centered art theory had developed in the\nseventeenth century, and by 1700 it was joined by a new persona, the\nconnoisseur, who was helping collectors to hone their judgment when\nseparating truly great art from mere craft. The bi-annual Parisian\nsalons had already become a site of Enlightenment aesthetics and\nconnoisseurship by 1750, yet before Diderot no one had brought\ntogether the job of the connoisseur and the aesthetician with that of\nthe public writer reflecting on art in relation to ordinary human\nexperience. In his “Salons”, as they came to be called,\nDiderot brought all of these agendas together into one discursive\nprogram, inventing as a result a new identity: the art critic\nsustained through contemporary art criticism. The result was also a\nnew and pioneering notion of philosophy of art.\n\nDiderot’s art criticism explored exactly the same dynamics\nbetween form and content, author and interpreter, subject and\nobject—in short, the very problem of artistic representation\nitself—that his theater, his fiction, and his philosophy\nexplored as well. The result was a general understanding of aesthetics\nand its relationship to ethics that was integrally connected to his\nphilosophy overall.\n\nDiderot’s art criticism joined with his theater criticism, his\nprose and other theoretical writings in offering readers reflections\non deep metaphysical and epistemological questions concerning the\npower and limits of representation. From this perspective, it is\nappropriate that arguably Diderot’s greatest and most\ninfluential text is at once a literary fiction, a\nsemi-autobiographical psychological memoir, a theatrical send-up of\nParisian society, an intimate portrait of contemporary social mores,\nand a highly original and complex study of the nature of human\nperception, being, and their interrelation.\n\nCalled Le Neveu de Rameau, the text ostensibly narrates\nDiderot’s meetings and conversation with the nephew of the\nFrench composer Jean-Philippe Rameau. Yet the dialogue unfolds through\na back and forth between characters named “Moi” and\n“Lui”, or me and him, continually turning a discussion\nbetween two discrete subjects into an inner monologue of one subject\ndialoguing with himself. Indeed, as the exchange carries on, the two\ncharacters are revealed to be different sides of a deep existential\ndialectic. At this point the external reality of the characters begins\nto dissolve, and “Moi” and “Lui” start to\nbecome two competing principles within an intractable universal\nethical and metaphysical struggle.\n\nDiderot did not publish Le Neveu de Rameau in his lifetime,\nbut the text found its way to Germany where it was read by Schiller\nand Goethe. Goethe’s German translation, published in 1805, was\na major influence on Hegel: the Neveu is the only modern work\nexplicitly cited in his 1807 Phenomenology of Spirit. Indeed,\nits influence on the formation of Hegel’s own dialectical\nunderstanding of metaphysics and the nature of being is patent, and a\nline connects Diderot and the Neveu with all subsequent\nmetaphysical understandings of the self as a singularity caught in a\nconstant struggle with universal forces pulling the unity of being\napart.\n",
    "section_title": "1.3 The Years of Celebrity (1765–1773)",
    "entry_title": "Denis Diderot",
    "hierarchy_title": "Denis Diderot || Diderot’s Life and Major Writings || The Years of Celebrity (1765–1773)",
    "tokenized_text": [
        "diderot",
        "life",
        "major",
        "writing",
        "year",
        "celebrity",
        "year",
        "celebrity",
        "final",
        "appearance",
        "text",
        "volume",
        "encyclopédie",
        "diderot",
        "experienced",
        "kind",
        "liberation",
        "life",
        "freed",
        "work",
        "occupied",
        "time",
        "energy",
        "previous",
        "fifteen",
        "year",
        "s",
        "diderot",
        "continued",
        "necessary",
        "see",
        "encyclopédie",
        "project",
        "completed",
        "ultimately",
        "authoring",
        "nearly",
        "six",
        "thousand",
        "article",
        "also",
        "gradually",
        "able",
        "step",
        "back",
        "retreating",
        "respect",
        "background",
        "philosophe",
        "movement",
        "liberation",
        "highly",
        "productive",
        "period",
        "life",
        "began",
        "new",
        "original",
        "book",
        "began",
        "flow",
        "pen",
        "diderot",
        "earliest",
        "writing",
        "period",
        "pursued",
        "encyclopédie",
        "project",
        "still",
        "ramping",
        "full",
        "speed",
        "continued",
        "philosophical",
        "literary",
        "exploration",
        "initiated",
        "s",
        "taken",
        "whole",
        "reflect",
        "lifelong",
        "preoccupation",
        "question",
        "life",
        "liberty",
        "purpose",
        "order",
        "within",
        "epicurean",
        "cosmos",
        "may",
        "governed",
        "providential",
        "creator",
        "along",
        "continuing",
        "interest",
        "epistemological",
        "problem",
        "discerning",
        "nature",
        "principle",
        "world",
        "especially",
        "related",
        "emerging",
        "biological",
        "science",
        "eighteenth",
        "century",
        "key",
        "work",
        "vein",
        "include",
        "lettre",
        "sur",
        "le",
        "sourds",
        "et",
        "muets",
        "à",
        "l",
        "usage",
        "de",
        "ceux",
        "qui",
        "entendent",
        "et",
        "qui",
        "parlent",
        "continuation",
        "sort",
        "lettre",
        "sur",
        "le",
        "aveugles",
        "pensées",
        "sur",
        "l",
        "interprétation",
        "de",
        "la",
        "nature",
        "work",
        "retains",
        "episodic",
        "propositional",
        "structure",
        "pensées",
        "philosophiques",
        "expanding",
        "explanation",
        "within",
        "section",
        "scholar",
        "also",
        "suggested",
        "though",
        "never",
        "proven",
        "definitively",
        "diderot",
        "contributed",
        "year",
        "baron",
        "holbach",
        "système",
        "de",
        "la",
        "nature",
        "first",
        "published",
        "book",
        "stand",
        "alongside",
        "helvétius",
        "de",
        "l",
        "esprit",
        "one",
        "great",
        "masterpiece",
        "french",
        "enlightenment",
        "materialist",
        "philosophy",
        "diderot",
        "certainly",
        "center",
        "holbach",
        "coterie",
        "dry",
        "programmatic",
        "systematicity",
        "holbach",
        "book",
        "lack",
        "lively",
        "play",
        "diderot",
        "best",
        "philosophical",
        "writing",
        "certain",
        "baron",
        "kindred",
        "spirit",
        "one",
        "diderot",
        "great",
        "masterpiece",
        "written",
        "year",
        "published",
        "posthumously",
        "included",
        "part",
        "naturalphilosophical",
        "corpus",
        "summarized",
        "even",
        "engages",
        "seminal",
        "question",
        "metaphysics",
        "natural",
        "philosophy",
        "overtly",
        "literary",
        "manner",
        "drawing",
        "enlightenment",
        "epistolary",
        "novel",
        "theater",
        "construction",
        "classical",
        "philosophical",
        "genre",
        "antique",
        "philosophy",
        "although",
        "one",
        "recall",
        "plato",
        "wrote",
        "dialogue",
        "called",
        "le",
        "rêve",
        "de",
        "alembert",
        "alembert",
        "dream",
        "work",
        "fact",
        "trilogy",
        "dialogue",
        "whose",
        "centerpiece",
        "provides",
        "title",
        "complex",
        "text",
        "reveals",
        "diderot",
        "important",
        "thinking",
        "metaphysics",
        "relates",
        "biology",
        "life",
        "science",
        "although",
        "never",
        "published",
        "diderot",
        "lifetime",
        "nevertheless",
        "one",
        "favorite",
        "work",
        "gave",
        "one",
        "copy",
        "catherine",
        "great",
        "gift",
        "together",
        "significantly",
        "term",
        "understanding",
        "work",
        "set",
        "fragment",
        "presented",
        "belonging",
        "physiological",
        "writing",
        "dialogue",
        "would",
        "certainly",
        "considered",
        "subversive",
        "work",
        "published",
        "written",
        "whatever",
        "diderot",
        "motivation",
        "producing",
        "creative",
        "complexity",
        "converges",
        "without",
        "question",
        "one",
        "great",
        "masterpiece",
        "enlightenment",
        "philosophie",
        "combination",
        "literature",
        "philosophy",
        "textual",
        "play",
        "reasoned",
        "argumentation",
        "present",
        "le",
        "rêve",
        "de",
        "alembert",
        "also",
        "present",
        "diderot",
        "seemingly",
        "literary",
        "artistic",
        "writing",
        "also",
        "contain",
        "much",
        "serious",
        "science",
        "philosophy",
        "one",
        "important",
        "cluster",
        "concern",
        "theory",
        "practice",
        "theater",
        "diderot",
        "wrote",
        "script",
        "play",
        "staged",
        "paris",
        "including",
        "le",
        "fils",
        "naturel",
        "le",
        "père",
        "de",
        "famille",
        "moralizing",
        "melodrama",
        "advocating",
        "ethical",
        "value",
        "conjugal",
        "family",
        "virtue",
        "thrift",
        "domestic",
        "love",
        "piety",
        "play",
        "major",
        "touchstone",
        "history",
        "theater",
        "metatheoretical",
        "writing",
        "theater",
        "provide",
        "many",
        "interesting",
        "point",
        "departure",
        "philosophy",
        "important",
        "contribution",
        "aesthetic",
        "theory",
        "diderot",
        "novel",
        "work",
        "overt",
        "fiction",
        "also",
        "partake",
        "aesthetic",
        "exploration",
        "mark",
        "best",
        "work",
        "theater",
        "diderot",
        "manifest",
        "interest",
        "nature",
        "limit",
        "representation",
        "selfaware",
        "consciousness",
        "regarding",
        "tenuous",
        "interaction",
        "language",
        "experience",
        "ability",
        "merge",
        "coherent",
        "representation",
        "issue",
        "present",
        "diderot",
        "sophisticated",
        "thought",
        "including",
        "explicitly",
        "framed",
        "philosophy",
        "diderot",
        "displayed",
        "philosophicalliterary",
        "tendency",
        "art",
        "criticism",
        "work",
        "area",
        "began",
        "journalist",
        "fm",
        "grimm",
        "invited",
        "diderot",
        "contribute",
        "monthly",
        "journal",
        "correspondence",
        "littéraire",
        "reflection",
        "art",
        "displayed",
        "biennial",
        "parisian",
        "art",
        "salon",
        "staged",
        "louvre",
        "show",
        "allowed",
        "painter",
        "sculptor",
        "showcase",
        "work",
        "setting",
        "gave",
        "broad",
        "public",
        "audience",
        "access",
        "work",
        "best",
        "artist",
        "day",
        "others",
        "written",
        "commentary",
        "exhibition",
        "one",
        "diderot",
        "provided",
        "anything",
        "like",
        "critical",
        "philosophical",
        "assessment",
        "art",
        "salon",
        "new",
        "academically",
        "centered",
        "art",
        "theory",
        "developed",
        "seventeenth",
        "century",
        "joined",
        "new",
        "persona",
        "connoisseur",
        "helping",
        "collector",
        "hone",
        "judgment",
        "separating",
        "truly",
        "great",
        "art",
        "mere",
        "craft",
        "biannual",
        "parisian",
        "salon",
        "already",
        "become",
        "site",
        "enlightenment",
        "aesthetic",
        "connoisseurship",
        "yet",
        "diderot",
        "one",
        "brought",
        "together",
        "job",
        "connoisseur",
        "aesthetician",
        "public",
        "writer",
        "reflecting",
        "art",
        "relation",
        "ordinary",
        "human",
        "experience",
        "salon",
        "came",
        "called",
        "diderot",
        "brought",
        "agenda",
        "together",
        "one",
        "discursive",
        "program",
        "inventing",
        "result",
        "new",
        "identity",
        "art",
        "critic",
        "sustained",
        "contemporary",
        "art",
        "criticism",
        "result",
        "also",
        "new",
        "pioneering",
        "notion",
        "philosophy",
        "art",
        "diderot",
        "art",
        "criticism",
        "explored",
        "exactly",
        "dynamic",
        "form",
        "content",
        "author",
        "interpreter",
        "subject",
        "objectin",
        "short",
        "problem",
        "artistic",
        "representation",
        "itselfthat",
        "theater",
        "fiction",
        "philosophy",
        "explored",
        "well",
        "result",
        "general",
        "understanding",
        "aesthetic",
        "relationship",
        "ethic",
        "integrally",
        "connected",
        "philosophy",
        "overall",
        "diderot",
        "art",
        "criticism",
        "joined",
        "theater",
        "criticism",
        "prose",
        "theoretical",
        "writing",
        "offering",
        "reader",
        "reflection",
        "deep",
        "metaphysical",
        "epistemological",
        "question",
        "concerning",
        "power",
        "limit",
        "representation",
        "perspective",
        "appropriate",
        "arguably",
        "diderot",
        "greatest",
        "influential",
        "text",
        "literary",
        "fiction",
        "semiautobiographical",
        "psychological",
        "memoir",
        "theatrical",
        "sendup",
        "parisian",
        "society",
        "intimate",
        "portrait",
        "contemporary",
        "social",
        "more",
        "highly",
        "original",
        "complex",
        "study",
        "nature",
        "human",
        "perception",
        "interrelation",
        "called",
        "le",
        "neveu",
        "de",
        "rameau",
        "text",
        "ostensibly",
        "narrates",
        "diderot",
        "meeting",
        "conversation",
        "nephew",
        "french",
        "composer",
        "jeanphilippe",
        "rameau",
        "yet",
        "dialogue",
        "unfolds",
        "back",
        "forth",
        "character",
        "named",
        "moi",
        "lui",
        "continually",
        "turning",
        "discussion",
        "two",
        "discrete",
        "subject",
        "inner",
        "monologue",
        "one",
        "subject",
        "dialoguing",
        "indeed",
        "exchange",
        "carry",
        "two",
        "character",
        "revealed",
        "different",
        "side",
        "deep",
        "existential",
        "dialectic",
        "point",
        "external",
        "reality",
        "character",
        "begin",
        "dissolve",
        "moi",
        "lui",
        "start",
        "become",
        "two",
        "competing",
        "principle",
        "within",
        "intractable",
        "universal",
        "ethical",
        "metaphysical",
        "struggle",
        "diderot",
        "publish",
        "le",
        "neveu",
        "de",
        "rameau",
        "lifetime",
        "text",
        "found",
        "way",
        "germany",
        "read",
        "schiller",
        "goethe",
        "goethe",
        "german",
        "translation",
        "published",
        "major",
        "influence",
        "hegel",
        "neveu",
        "modern",
        "work",
        "explicitly",
        "cited",
        "phenomenology",
        "spirit",
        "indeed",
        "influence",
        "formation",
        "hegel",
        "dialectical",
        "understanding",
        "metaphysics",
        "nature",
        "patent",
        "line",
        "connects",
        "diderot",
        "neveu",
        "subsequent",
        "metaphysical",
        "understanding",
        "self",
        "singularity",
        "caught",
        "constant",
        "struggle",
        "universal",
        "force",
        "pulling",
        "unity",
        "apart"
    ]
}