{
    "main_text": "Digital Images\n2. Digital Images\n\nWith digital movie projection, we begin to see the importance of\nunderstanding the technology of display for understanding the nature\nof digital art. Another way we see its importance is in relation to\nimages displayed on LCD screens. According to Goodman, images are\nessentially analog. Nevertheless, there seems to be a way for\nengineers to circumvent the essential analogicity of pictorial schemes\nby using digital technologies for encoded subphenomenal\ndiscrimination. Arguably, finite differentiation can be imposed on the\nscheme of all possible images displayed on high-resolution LCD\nscreens. As we shall see, this has far-reaching implications for the\nways in which we think about and properly appreciate image-based\nart.\n\nBoth in his earlier and in his later work in aesthetics, Goodman\ncommits to “a special relation” between the analog and the\npictorial, one that is seen when we compare “the presystematic\nnotions of description and picture in a given culture”. Given\ntwo schemes, S and S′, where S\nconsists of all descriptions or predicates in a language such as\nEnglish, and S′ consists of all pictures, if we were\ntold only of the structures of S and S′, we\ncould distinguish the pictorial scheme by its being analog (Goodman\nand Elgin 1988: 130). The special relation remains, Goodman claims,\ndespite the possibility of a digital sub-scheme made up of black and\nwhite grid patterns all of which happen to be pictures. In such a\nscheme, the differences between patterned types that matter for the\nscheme’s being digital do not include all of the differences\nthat matter for distinguishing pictorial types. Pictures are\ndistinguished by color, shape, and size, which vary continuously; any\nvariation in color, shape, or size potentially results in a different\npicture. When we impose limits on the differences that matter for\ndistinguishing one grid pattern in the scheme from another, we are not\ninterpreting the grid patterns as pictures; if we were to do so, we\nwould have to treat them as members of a syntactically dense, or\nanalog, scheme.\n\nGoodman’s insight about grid patterns and pictures suggests an\nimmediate difficulty for explaining the digital status of images\ndisplayed on LCD screens: Clearly it will not be sufficient to point\nout that such images are pixellated, and therefore made up of small\nidentical building blocks that impose a lower limit on the differences\nbetween display-instances. Remember that pictures are defined by\ncolor, shape, and size, which vary continuously. This means there is\ngoing to be vagueness at the limits of types – even though the\nphysical pixels of an LCD screen are such that there are gaps between\nthe possible shapes, sizes, and colors that the screen can\ninstantiate; and, there are a finite number of shapes, sizes, and\ncolors that the screen can instantiate. Any means of discretely\ncarving up the property spaces of color, shape, and size has to\ninvolve grouping into types what are in fact (subphenomenally)\ndistinct shapes, sizes, and colors, some of which may differ less from\nadjacent properties grouped into other types. This makes it impossible\nalways to determine unique class membership; hence, finite\ndifferentiation fails.\n\nPixellation alone, no matter the resolution, cannot account for images\ndisplayed on LCD screens belonging to a digital scheme; digital images\nqua images thus remain stubbornly analog. But perhaps a\ncloser analysis of digital imaging technology can show that finite\ndifferentiation is met after all. Current technologies for sampling\nand instantiating light intensities group objective colors well below\nthe level of phenomenal discrimination. For example, in the standard\n“Truecolor” system, a display pixel has three 8-bit\nsubpixels, each of which emits a different visible wavelength with an\nintensity from a range of 256 values, yielding over 16 million\nobjective colors. Such a large number of available colors gives the\nimpression of a color continuum when, in fact, digital sampling\ntechnology has been used to carve up the objective color space into a\ndisjoint series of wavelength intensities. On the one hand, from the\nfact that display pixels can be lit at intensities between and\nindiscriminable from adjacent discriminable intensities, it seems to\nfollow that finite differentiation fails. On the other hand, precisely\nbecause digital technology involves microtechnology and metrology for\nsubphenomenal discrimination between colors, the light intensity\ngroupings that are expressed numerically as red-blue-green triplets\n(in, say, the Truecolor system) can be narrower than the\nobjective color types that contribute to the resultant image scheme.\nThe key is keeping the variations in the essentially analog properties\nof color, shape, and size small enough so that they cannot accumulate\nto the point of making a difference to image perception (Zeimbekis\n2012). The types in the scheme of digital images are technologically\nsegmented, transitive groupings of the same color-, shape-, and\nsize-experiences. The carving out of a transitive sub-set of\nmagnitudes has to occur relative to the needs of the users of the\nsystem. In the case of digital color, the types are classes of light\nintensities sufficient to cause the same color experience for\nnormal human perceivers. The replicability of digital images is made\npossible by the gap between the discriminatory limits of the human\nvisual system and the discriminatory limits of digital sampling\ntechnology.\n\nDigital images can be replicated insofar as they are digital and thus\nfinitely differentiated. They are finitely differentiated because they\nrely on subphenomenal sampling and display technology. In practical\nterms, replication depends on the use of binary code, even though this\nis not in fact what makes images qua images digital. Of\ncourse binary code representations are themselves part of a digital\nscheme. But the role of binary code in image-instantiation is just one\nof consistent preservation; preservation for long enough to permit\nreproduction. Despite the inherent replicability of digital images, it\ndoes not appear to follow automatically that artworks involving these\nimages are multiples.\n\nThe SF MoMA is in possession of the original of Kalpakjian’s\nwork, Corridor; they control access to the video imagery. At\npresent, the work is not available to be viewed: it cannot be viewed\non-line as part of a digital archive or collection, nor is it\ncurrently on view in the physical space of the museum. The image\nsequence comprising the work could be multiply instantiated and widely\ndistributed, but in fact it is not, nor is it meant to be. Similarly\nwith Arcangel & Davis’s work, Landscape Study #4:\nThis work is described as an installation, meant to be exhibited in a\nphysical gallery alongside an arrangement of printed stills, with a\ntelevision connected to a Nintendo Entertainment System. Again, the\nimage sequence displayed on the television could be multiply\ninstantiated and widely distributed, but it is not, nor is it meant to\nbe. Clips and copies of the landscape imagery are available on-line,\nbut these do not instantiate parts of the work itself. By contrast,\nworks of net art are instantiated whenever they are accessed by\nsomeone on-line.\n\nThere are many kinds of net art, including various forms of\nexperimental on-line literature, conceptual browser art, and works\ndrawing on software and computer gaming conventions. Extensive on-line\ncollections of visual and audiovisual net art are rigorously curated\nand at the same time immediately accessible to ordinary Internet\nusers. When it comes to the conventions of access and presentation,\nthe contrast is striking between works of net art and works like those\nby Kalpakjian, and Arcangel & Davis. Perhaps a digital artwork\ncomprising multiply instantiable images need not itself be multiply\ninstantiable. At this point, the philosophy of digital art joins an\nongoing debate about the ontology of art.\n\nOn the question of whether artworks are all the same kind of thing or\nmany different kinds of things, ontological pluralism is often taken\nto be implied by the primary role of the artist in\n“sanctioning” features of their work (Irvin 2005, 2008;\nThomasson 2010). A sanction can consist simply in, say, the painting\nof a canvas by a self-professed artist and the subsequent display of\nthe work in a gallery. The artist has sanctioned those features of the\nwork that make it a traditional painting. But what was once largely\nimplicit is now often explicit: many contemporary works of art are\ndefined by a set of instructions for their presentation (e.g., aspect\nratio, resolution). We can find plenty of examples of non-digital\nworks that are defined by a set of instructions, such as Felix\nGonzalez-Torres’ Untitled (Portrait of Ross in L.A.)\n(1991). This work is given to a gallery to display by way of nothing\nmore than a set of instructions for constructing and maintaining a\npile of candies. Whether non-digital or digital, the instructions\ndetermine what is part of the work and what is not, and whether the\nwork is singular or multiply instantiable. As a result, the\ninstructions guide appropriate interpretation of the work. On this\nview, ontology precedes interpretation: we cannot properly and fully\nappreciate a work, for the work that it is, without a prior\ndetermination of what it comprises. This is a matter of contention,\nhowever. On another way of thinking, artworks just are objects of\ninterpretation, and there is no artwork whose boundaries can be\nidentified before we begin interpretation (Davies 2004).\n\nThe issue of the relation between ontology and interpretation is a\ncomplex and difficult one, but progress can be made on the issue\nthrough an examination of digital art practices. This is particularly\nin light of the high degree of self-consciousness with which many\ndigital artists and digital art curators specify the features of\ndigital art works. It is a common practice, for example, when\narchiving net art, to have artists fill out a questionnaire in order\nto specify which features of a work are crucial for its\npreservation—whether features of appearance, timing and motion,\ninteractivity potentials and methods, linking to other sites, or\nhardware and software. When a work of net art is individuated by its\nimagery, say, the artist has chosen to make the inherent replicability\nof digital imagery part of the work. That this is a choice is\nsuggested by the existence of singular works of digital visual art,\nlike the examples discussed above. The question of whether the works\nby Kalpakjian, and Arcangel & Davis can function allographically\nrequires further investigation (see D’Cruz and Magnus 2014). But\nif they can so function, the artist’s presentation instructions\nhave a primary role to play in fixing, not just the art form\n(installation, movie, conceptual work, etc.) but the basic structure\nof the work – for example, in determining whether the work is\nsingular and thus identical with a certain kind of physical display or\nmultiple with no original display. Where interactive digital works are\nconcerned, individuation is determined by a set of algorithms. An\nalgorithmic account of interactive digital art suggests that, although\nthe code is important for adequate instantiation of the work, it is\nthe algorithm that specifies the crucial features of the work (Lopes\n2010; Tavinor 2011; Moser 2018). Since the code is, ontologically\nspeaking, less relevant than the algorithm, this account makes\nallowances for the variability that may be found in the code when an\ninstance of a program is run on different kinds of devices.\n",
    "section_title": "2. Digital Images",
    "entry_title": "The Philosophy of Digital Art",
    "hierarchy_title": "The Philosophy of Digital Art || Digital Images",
    "tokenized_text": [
        "digital",
        "image",
        "digital",
        "image",
        "digital",
        "movie",
        "projection",
        "begin",
        "see",
        "importance",
        "understanding",
        "technology",
        "display",
        "understanding",
        "nature",
        "digital",
        "art",
        "another",
        "way",
        "see",
        "importance",
        "relation",
        "image",
        "displayed",
        "lcd",
        "screen",
        "according",
        "goodman",
        "image",
        "essentially",
        "analog",
        "nevertheless",
        "seems",
        "way",
        "engineer",
        "circumvent",
        "essential",
        "analogicity",
        "pictorial",
        "scheme",
        "using",
        "digital",
        "technology",
        "encoded",
        "subphenomenal",
        "discrimination",
        "arguably",
        "finite",
        "differentiation",
        "imposed",
        "scheme",
        "possible",
        "image",
        "displayed",
        "highresolution",
        "lcd",
        "screen",
        "shall",
        "see",
        "farreaching",
        "implication",
        "way",
        "think",
        "properly",
        "appreciate",
        "imagebased",
        "art",
        "earlier",
        "later",
        "work",
        "aesthetic",
        "goodman",
        "commits",
        "special",
        "relation",
        "analog",
        "pictorial",
        "one",
        "seen",
        "compare",
        "presystematic",
        "notion",
        "description",
        "picture",
        "given",
        "culture",
        "given",
        "two",
        "scheme",
        "s",
        "consists",
        "description",
        "predicate",
        "language",
        "english",
        "s",
        "consists",
        "picture",
        "told",
        "structure",
        "s",
        "could",
        "distinguish",
        "pictorial",
        "scheme",
        "analog",
        "goodman",
        "elgin",
        "special",
        "relation",
        "remains",
        "goodman",
        "claim",
        "despite",
        "possibility",
        "digital",
        "subscheme",
        "made",
        "black",
        "white",
        "grid",
        "pattern",
        "happen",
        "picture",
        "scheme",
        "difference",
        "patterned",
        "type",
        "matter",
        "scheme",
        "digital",
        "include",
        "difference",
        "matter",
        "distinguishing",
        "pictorial",
        "type",
        "picture",
        "distinguished",
        "color",
        "shape",
        "size",
        "vary",
        "continuously",
        "variation",
        "color",
        "shape",
        "size",
        "potentially",
        "result",
        "different",
        "picture",
        "impose",
        "limit",
        "difference",
        "matter",
        "distinguishing",
        "one",
        "grid",
        "pattern",
        "scheme",
        "another",
        "interpreting",
        "grid",
        "pattern",
        "picture",
        "would",
        "treat",
        "member",
        "syntactically",
        "dense",
        "analog",
        "scheme",
        "goodman",
        "insight",
        "grid",
        "pattern",
        "picture",
        "suggests",
        "immediate",
        "difficulty",
        "explaining",
        "digital",
        "status",
        "image",
        "displayed",
        "lcd",
        "screen",
        "clearly",
        "sufficient",
        "point",
        "image",
        "pixellated",
        "therefore",
        "made",
        "small",
        "identical",
        "building",
        "block",
        "impose",
        "lower",
        "limit",
        "difference",
        "displayinstances",
        "remember",
        "picture",
        "defined",
        "color",
        "shape",
        "size",
        "vary",
        "continuously",
        "mean",
        "going",
        "vagueness",
        "limit",
        "type",
        "even",
        "though",
        "physical",
        "pixel",
        "lcd",
        "screen",
        "gap",
        "possible",
        "shape",
        "size",
        "color",
        "screen",
        "instantiate",
        "finite",
        "number",
        "shape",
        "size",
        "color",
        "screen",
        "instantiate",
        "mean",
        "discretely",
        "carving",
        "property",
        "space",
        "color",
        "shape",
        "size",
        "involve",
        "grouping",
        "type",
        "fact",
        "subphenomenally",
        "distinct",
        "shape",
        "size",
        "color",
        "may",
        "differ",
        "le",
        "adjacent",
        "property",
        "grouped",
        "type",
        "make",
        "impossible",
        "always",
        "determine",
        "unique",
        "class",
        "membership",
        "hence",
        "finite",
        "differentiation",
        "fails",
        "pixellation",
        "alone",
        "matter",
        "resolution",
        "account",
        "image",
        "displayed",
        "lcd",
        "screen",
        "belonging",
        "digital",
        "scheme",
        "digital",
        "image",
        "qua",
        "image",
        "thus",
        "remain",
        "stubbornly",
        "analog",
        "perhaps",
        "closer",
        "analysis",
        "digital",
        "imaging",
        "technology",
        "show",
        "finite",
        "differentiation",
        "met",
        "current",
        "technology",
        "sampling",
        "instantiating",
        "light",
        "intensity",
        "group",
        "objective",
        "color",
        "well",
        "level",
        "phenomenal",
        "discrimination",
        "example",
        "standard",
        "truecolor",
        "system",
        "display",
        "pixel",
        "three",
        "bit",
        "subpixels",
        "emits",
        "different",
        "visible",
        "wavelength",
        "intensity",
        "range",
        "value",
        "yielding",
        "million",
        "objective",
        "color",
        "large",
        "number",
        "available",
        "color",
        "give",
        "impression",
        "color",
        "continuum",
        "fact",
        "digital",
        "sampling",
        "technology",
        "used",
        "carve",
        "objective",
        "color",
        "space",
        "disjoint",
        "series",
        "wavelength",
        "intensity",
        "one",
        "hand",
        "fact",
        "display",
        "pixel",
        "lit",
        "intensity",
        "indiscriminable",
        "adjacent",
        "discriminable",
        "intensity",
        "seems",
        "follow",
        "finite",
        "differentiation",
        "fails",
        "hand",
        "precisely",
        "digital",
        "technology",
        "involves",
        "microtechnology",
        "metrology",
        "subphenomenal",
        "discrimination",
        "color",
        "light",
        "intensity",
        "grouping",
        "expressed",
        "numerically",
        "redbluegreen",
        "triplet",
        "say",
        "truecolor",
        "system",
        "narrower",
        "objective",
        "color",
        "type",
        "contribute",
        "resultant",
        "image",
        "scheme",
        "key",
        "keeping",
        "variation",
        "essentially",
        "analog",
        "property",
        "color",
        "shape",
        "size",
        "small",
        "enough",
        "accumulate",
        "point",
        "making",
        "difference",
        "image",
        "perception",
        "zeimbekis",
        "type",
        "scheme",
        "digital",
        "image",
        "technologically",
        "segmented",
        "transitive",
        "grouping",
        "color",
        "shape",
        "sizeexperiences",
        "carving",
        "transitive",
        "subset",
        "magnitude",
        "occur",
        "relative",
        "need",
        "user",
        "system",
        "case",
        "digital",
        "color",
        "type",
        "class",
        "light",
        "intensity",
        "sufficient",
        "cause",
        "color",
        "experience",
        "normal",
        "human",
        "perceiver",
        "replicability",
        "digital",
        "image",
        "made",
        "possible",
        "gap",
        "discriminatory",
        "limit",
        "human",
        "visual",
        "system",
        "discriminatory",
        "limit",
        "digital",
        "sampling",
        "technology",
        "digital",
        "image",
        "replicated",
        "insofar",
        "digital",
        "thus",
        "finitely",
        "differentiated",
        "finitely",
        "differentiated",
        "rely",
        "subphenomenal",
        "sampling",
        "display",
        "technology",
        "practical",
        "term",
        "replication",
        "depends",
        "use",
        "binary",
        "code",
        "even",
        "though",
        "fact",
        "make",
        "image",
        "qua",
        "image",
        "digital",
        "course",
        "binary",
        "code",
        "representation",
        "part",
        "digital",
        "scheme",
        "role",
        "binary",
        "code",
        "imageinstantiation",
        "one",
        "consistent",
        "preservation",
        "preservation",
        "long",
        "enough",
        "permit",
        "reproduction",
        "despite",
        "inherent",
        "replicability",
        "digital",
        "image",
        "appear",
        "follow",
        "automatically",
        "artwork",
        "involving",
        "image",
        "multiple",
        "sf",
        "moma",
        "possession",
        "original",
        "kalpakjian",
        "work",
        "corridor",
        "control",
        "access",
        "video",
        "imagery",
        "present",
        "work",
        "available",
        "viewed",
        "viewed",
        "online",
        "part",
        "digital",
        "archive",
        "collection",
        "currently",
        "view",
        "physical",
        "space",
        "museum",
        "image",
        "sequence",
        "comprising",
        "work",
        "could",
        "multiply",
        "instantiated",
        "widely",
        "distributed",
        "fact",
        "meant",
        "similarly",
        "arcangel",
        "davis",
        "work",
        "landscape",
        "study",
        "work",
        "described",
        "installation",
        "meant",
        "exhibited",
        "physical",
        "gallery",
        "alongside",
        "arrangement",
        "printed",
        "still",
        "television",
        "connected",
        "nintendo",
        "entertainment",
        "system",
        "image",
        "sequence",
        "displayed",
        "television",
        "could",
        "multiply",
        "instantiated",
        "widely",
        "distributed",
        "meant",
        "clip",
        "copy",
        "landscape",
        "imagery",
        "available",
        "online",
        "instantiate",
        "part",
        "work",
        "contrast",
        "work",
        "net",
        "art",
        "instantiated",
        "whenever",
        "accessed",
        "someone",
        "online",
        "many",
        "kind",
        "net",
        "art",
        "including",
        "various",
        "form",
        "experimental",
        "online",
        "literature",
        "conceptual",
        "browser",
        "art",
        "work",
        "drawing",
        "software",
        "computer",
        "gaming",
        "convention",
        "extensive",
        "online",
        "collection",
        "visual",
        "audiovisual",
        "net",
        "art",
        "rigorously",
        "curated",
        "time",
        "immediately",
        "accessible",
        "ordinary",
        "internet",
        "user",
        "come",
        "convention",
        "access",
        "presentation",
        "contrast",
        "striking",
        "work",
        "net",
        "art",
        "work",
        "like",
        "kalpakjian",
        "arcangel",
        "davis",
        "perhaps",
        "digital",
        "artwork",
        "comprising",
        "multiply",
        "instantiable",
        "image",
        "need",
        "multiply",
        "instantiable",
        "point",
        "philosophy",
        "digital",
        "art",
        "join",
        "ongoing",
        "debate",
        "ontology",
        "art",
        "question",
        "whether",
        "artwork",
        "kind",
        "thing",
        "many",
        "different",
        "kind",
        "thing",
        "ontological",
        "pluralism",
        "often",
        "taken",
        "implied",
        "primary",
        "role",
        "artist",
        "sanctioning",
        "feature",
        "work",
        "irvin",
        "thomasson",
        "sanction",
        "consist",
        "simply",
        "say",
        "painting",
        "canvas",
        "selfprofessed",
        "artist",
        "subsequent",
        "display",
        "work",
        "gallery",
        "artist",
        "sanctioned",
        "feature",
        "work",
        "make",
        "traditional",
        "painting",
        "largely",
        "implicit",
        "often",
        "explicit",
        "many",
        "contemporary",
        "work",
        "art",
        "defined",
        "set",
        "instruction",
        "presentation",
        "eg",
        "aspect",
        "ratio",
        "resolution",
        "find",
        "plenty",
        "example",
        "nondigital",
        "work",
        "defined",
        "set",
        "instruction",
        "felix",
        "gonzaleztorres",
        "untitled",
        "portrait",
        "ross",
        "la",
        "work",
        "given",
        "gallery",
        "display",
        "way",
        "nothing",
        "set",
        "instruction",
        "constructing",
        "maintaining",
        "pile",
        "candy",
        "whether",
        "nondigital",
        "digital",
        "instruction",
        "determine",
        "part",
        "work",
        "whether",
        "work",
        "singular",
        "multiply",
        "instantiable",
        "result",
        "instruction",
        "guide",
        "appropriate",
        "interpretation",
        "work",
        "view",
        "ontology",
        "precedes",
        "interpretation",
        "properly",
        "fully",
        "appreciate",
        "work",
        "work",
        "without",
        "prior",
        "determination",
        "comprises",
        "matter",
        "contention",
        "however",
        "another",
        "way",
        "thinking",
        "artwork",
        "object",
        "interpretation",
        "artwork",
        "whose",
        "boundary",
        "identified",
        "begin",
        "interpretation",
        "davy",
        "issue",
        "relation",
        "ontology",
        "interpretation",
        "complex",
        "difficult",
        "one",
        "progress",
        "made",
        "issue",
        "examination",
        "digital",
        "art",
        "practice",
        "particularly",
        "light",
        "high",
        "degree",
        "selfconsciousness",
        "many",
        "digital",
        "artist",
        "digital",
        "art",
        "curator",
        "specify",
        "feature",
        "digital",
        "art",
        "work",
        "common",
        "practice",
        "example",
        "archiving",
        "net",
        "art",
        "artist",
        "fill",
        "questionnaire",
        "order",
        "specify",
        "feature",
        "work",
        "crucial",
        "preservationwhether",
        "feature",
        "appearance",
        "timing",
        "motion",
        "interactivity",
        "potential",
        "method",
        "linking",
        "site",
        "hardware",
        "software",
        "work",
        "net",
        "art",
        "individuated",
        "imagery",
        "say",
        "artist",
        "chosen",
        "make",
        "inherent",
        "replicability",
        "digital",
        "imagery",
        "part",
        "work",
        "choice",
        "suggested",
        "existence",
        "singular",
        "work",
        "digital",
        "visual",
        "art",
        "like",
        "example",
        "discussed",
        "question",
        "whether",
        "work",
        "kalpakjian",
        "arcangel",
        "davis",
        "function",
        "allographically",
        "requires",
        "investigation",
        "see",
        "cruz",
        "magnus",
        "function",
        "artist",
        "presentation",
        "instruction",
        "primary",
        "role",
        "play",
        "fixing",
        "art",
        "form",
        "installation",
        "movie",
        "conceptual",
        "work",
        "etc",
        "basic",
        "structure",
        "work",
        "example",
        "determining",
        "whether",
        "work",
        "singular",
        "thus",
        "identical",
        "certain",
        "kind",
        "physical",
        "display",
        "multiple",
        "original",
        "display",
        "interactive",
        "digital",
        "work",
        "concerned",
        "individuation",
        "determined",
        "set",
        "algorithm",
        "algorithmic",
        "account",
        "interactive",
        "digital",
        "art",
        "suggests",
        "although",
        "code",
        "important",
        "adequate",
        "instantiation",
        "work",
        "algorithm",
        "specifies",
        "crucial",
        "feature",
        "work",
        "lope",
        "tavinor",
        "moser",
        "since",
        "code",
        "ontologically",
        "speaking",
        "le",
        "relevant",
        "algorithm",
        "account",
        "make",
        "allowance",
        "variability",
        "may",
        "found",
        "code",
        "instance",
        "program",
        "run",
        "different",
        "kind",
        "device"
    ]
}