{
    "main_text": "Dilthey’s Main Philosophical Works || 1900–1911: Historical Understanding and Hermeneutics\n3. Dilthey’s Reflections on Ethics and Worldviews and His Doubts about Metaphysics\n\nIn 1890 Dilthey offered a lecture course at the University of Berlin\nthat was posthumously published with the title System of\nEthics (1890b). Here Dilthey sets himself the task of developing\na “psycho-ethical” approach that is rooted in\n“anthropological-historical analysis” (1890b/SW.VI,104).\nWhereas traditional psychology has analyzed feelings mainly as\nresponses to sense impressions that come from without, a\npsycho-ethical understanding of the feelings that can motivate us to\nact must be rooted in anthropological analysis of our inner drives,\ninstincts and desires. Instead of focusing on the intellectual\nprocesses whereby human beings adapt to their surroundings, Dilthey\nargues that most of our responses are basically emotive and\nvolitional. The feelings that measure the effect the world has on us\nare not just the subjective aspect of our representations of the\nworld. These feelings are rooted in certain drives among which a sense\nof group solidarity is central (1890b/SW.VI,104).\n\nThis solidarity encompasses a fellow-feeling\n(Mitgefühl)(1890b/SW.VI,104–05) that goes deeper\nthan the sympathy of the British moralists. Dilthey regards sympathy\nas a feeling “transferred from one living being to\nanother” (1890b/SW.VI,89). Sympathy, compassion, and pity are\nmodes of “suffering with” (Mitleid) that are\nderivative because they affect us from the outside. They involve an\nexternal “conjoint movement” (Mitbewegung) with\nothers (1890b/SW.VI,89). Dilthey considers these psychological forms\nof sympathy or empathy (Mitempfindung) to be superficial\ncompared to the more basic anthropological fellow-feeling of\nsolidarity that produces an “inner relationship”\n(1890b/SW.VI,104)– with others.\n\nThe extent to which we are motivated by a sense of solidarity is a\nfunction of the sphere of commonality of objective spirit that we grow\nup in. Our anthropological sense of solidarity and its fellow-feeling\nprovides a more positive incentive for sociability than Hume’s\nsympathy and Schopenhauer’s compassion. But even the fellowship\nof solidarity is a mere natural incentive which does not become\nethical until it is transformed into a more active or participatory\nincentive of benevolence (1890b/GS.X, 70).\n\nAs he develops his anthropologically based approach to ethics, Dilthey\nleads up to three main ethical incentives. One of them is the\nbenevolence (Wohlwollen) that we just related to human\nsolidarity. The other two incentives are to strive for what is right\n(Rechtschaffenheit) and to perfect oneself in a socially\nlegitimate manner (Vollkommenheit). These three ethical\nincentives had already been predelineated as moral principles in\nDilthey’s Habilitationsschrift of 1864 entitled\n“Versuch einer Analyse des moralischen Bewußtseins”\n(see 1864/GS.VI, 26–27). In fact, the concluding section THREE\n12 of the System of Ethics is taken almost exclusively from\nthis earlier work, where the ethical incentives were formulated as\nthree moral oughts. This raises the question how it is possible to\nmove from anthropologically derived ethical incentives that are a\nposteriori to ultimately arrive at moral oughts that are a\npriori. There is a crucial subsection THREE 9.3 that prepares us\nfor this transition. It is entitled “The Feeling of Duty and\nJustice, the Consciousness of the Commitment that Inheres in the Duty\nto Do What is Right or Just  .” Here Dilthey is quite\nexplicit that the commitment to do what is right demands a\nconsciousness that cannot be conceived as a mere instinctive inner\nbond with others rooted in our sense of solidarity. The commitment to\ndo what is right must now come from within on the basis of\n“respect for others as ends in themselves” (1890b/SW.VI,\n128). The mere life-value of group solidarity is elevated to the\nspiritual value of respect for all others as individual\nends-in-themselves. Having replaced Humean sympathy with benevolence,\nDilthey now engages Kantian duty as part of his analysis of moral\nself-reflection. But instead of appealing to respect for the law to\njustify doing what is right, Dilthey derives moral duty from a\ncommitment that is based on both a “fidelity to oneself and\nrespect for the self-worth of other persons” (1890b/SW.VI,128).\nThe sense of obligation (Verbindlichkeit) that comes with\nthis commitment (Bindung) involves a recognition of a\nreciprocal human connectedness rather than a one-sided dependence on a\nhigher law.\n\nFormally Dilthey moves even closer to Kant at the end of the lectures\nby acknowledging that ultimately we must make “moral\njudgments” that are “unconditional” and\n“synthetic a priori” (1890b/GS.X, 108). Although\nDilthey had rejected the possibility of synthetic a priori\ntheoretical judgments for outer experience, he is now willing to speak\nof synthetic a priori practical judgments for inner\nexperience. Had Dilthey published his 1890 lectures himself he would\nprobably have tempered the language that was imported from his early\nessay. But he clearly still thinks that morality requires judgmental\nassent to oughts that are unconditionally self-binding.\n\nThe normative implications of anthropological reflection about life\nand history also led Dilthey to address the value of worldviews. Just\nas the nature of universal history forces us to conceive of history as\nmore than a human science, so worldviews are more broadly based\nattempts at acquiring a unified perspective on life. The sciences are\nby their nature partial and cannot provide a comprehensive worldview.\nA worldview attempts to provide not only a cognitive picture of the\nworld, but also an estimation of what in life is valuable and worth\npreserving, and finally how we can strive to improve reality.\nWorldviews have been developed in literary, religious and\nphilosophical works. Philosophers have produced metaphysical\nformulations of worldviews that attempt to give them a universal\nconceptual determinacy. Dilthey analyzes three recurrent types of such\nmetaphysical formulations: naturalism, the idealism of freedom, and\nobjective idealism. The naturalism of Democritus, Hobbes and others\nderives everything from what can be cognized and is pluralistic in\nstructure; idealism of freedom as found in Plato, Kant, and others\ninsists on the sovereignty of the will and is dualistic; objective\nidealism as found in Heraclitus, Leibniz and Hegel affirms reality as\nthe embodiment of a harmonious set of values and can be considered\nmonistic. The three types of metaphysical worldviews are\nincommensurable in that each sets its priorities differently. Dilthey\nfinds naturalism too reductive; his ethical views incline him toward\nthe idealism of freedom; aesthetically he felt attracted towards\nobjective idealism. No metaphysical formulation can have more than\nrelative validity because it attempts to arrive at a totalization that\ntranscends experience. Literary and poetic expressions of worldviews\ntend to be more successful because they do not claim to be totalizing.\nAll that is humanly possible is to probe reality on the basis of\nlife-experience and to settle for more limited philosophical insights\ninformed by historical understanding. Ultimately, our reflective\nunderstanding of life and history must remain\ndeterminate-indeterminate.\n\nWe can see certain parallels with Dilthey’s attempt to replace\nmetaphysical systems with more informal life-based\n“meta-physical reflection” or worldviews in the young\nRudolf Carnap, who studied in Jena with Dilthey’s student Herman\nNohl before moving to Vienna. Carnap’s paper “The\nElimination of Metaphysics Through Logical Analysis of Language”\nrefers to Dilthey and his students as positive counterexamples to\nvarieties of meaningless metaphysical systems as found in Fichte,\nHegel and Heidegger. Another essay by Carnap entitled\n“Metaphysics as Expression of an Attitude to Life”\nacknowledges the importance of Dilthey’s notion of\n“Lebensgefuehl.” Carnap’s analogue for\nDilthey’s “Weltanschauung” is\n“Weltauffassung.” Carnap also incorporated a more\nor less Diltheyan conception of the human sciences in his Der\nlogische Aufbau der Welt of 1928. Carnap refers to\nDilthey’s Introduction to the Human Sciences, but\nreplaces its language of “facts of consciousness” with\nthat of “elementary experiences.” He does not refer to\nDilthey’s last main work Der Aufbau der geschichtlichen Welt\nin den Geisteswissenschaften, but he did read Hans Freyer’s\nTheorie des objektiven Geistes, a work heavily influenced by\nDilthey’s Aufbau and its reinterpretation of objective\nspirit as the medium of intersubjective communication. Carnap writes\nin his own Aufbau: \n\n\nonly the more recent history of philosophy (since Dilthey) has called\nattention to the methodological and object-theoretical distinctness of\nthe domain of the human sciences (Geisteswissenschaften).\n(Carnap 1928: 23) \n\n\nCarnap acknowledges the independent nature of spiritual\n(geistigen) or intersubjective objects such as political\nstates and social customs. They differ from psychical and physical\nobjects in that they can “survive” even as the original\nsubjects that generated them “perish and other subjects take\ntheir place” (Carnap 1928: 23). It is not clear why\nDilthey’s reflective analysis of the distinctive methods of the\nvarious sciences and his empirical approach to lived experience did\nnot earn him more serious consideration by the Vienna Circle as a\nwhole and other analytically oriented philosophers. But what is\nevident is that his theory of understanding (Verstehen) came\nto be widely misinterpreted as a kind of empathy. Although Dilthey had\nsharply differentiated between understanding as a judgmental process\nand empathy as a mere feeling, Carnap suggested that the understanding\nof others is an intuitive act that involves a measure of empathy, but\nwhich can be cognitively vetted in part through the analysis of\nobjective manifestations ranging from gestures, linguistic expressions\nto practical actions (Carnap 1928: 55, 143). This suggestion by Carnap\nmay have negatively influenced subsequent discussions of\nDilthey’s theory of Verstehen by analytic philosophers,\nleading Theodor Abel, Ernest Nagel, and Arthur Danto to go even\nfurther by reducing it to “empathic identification.” Later\nDanto recognized that this is not the case and acknowledged that\n“Verstehen is a very brilliant notion, utterly\nmisconceived heretofore by crass philosophical critics, myself\nincluded” (Danto 1970: 215). Verstehen is not some\nimmediate projection of ourselves into others, but stands for a\ndeliberate process that finds the proper context to relate others and\ntheir objectifications to what is already familiar to us. It is a\nreflective mode of inquiry that provides the framework for more\nspecific explanations, whether causal or rational.\n",
    "section_title": "3. Dilthey’s Reflections on Ethics and Worldviews and His Doubts about Metaphysics",
    "entry_title": "Wilhelm Dilthey",
    "hierarchy_title": "Wilhelm Dilthey || Dilthey’s Main Philosophical Works || 1900–1911: Historical Understanding and Hermeneutics",
    "tokenized_text": [
        "dilthey",
        "main",
        "philosophical",
        "work",
        "historical",
        "understanding",
        "hermeneutics",
        "dilthey",
        "reflection",
        "ethic",
        "worldviews",
        "doubt",
        "metaphysics",
        "dilthey",
        "offered",
        "lecture",
        "course",
        "university",
        "berlin",
        "posthumously",
        "published",
        "title",
        "system",
        "ethic",
        "b",
        "dilthey",
        "set",
        "task",
        "developing",
        "psychoethical",
        "approach",
        "rooted",
        "anthropologicalhistorical",
        "analysis",
        "bswvi",
        "whereas",
        "traditional",
        "psychology",
        "analyzed",
        "feeling",
        "mainly",
        "response",
        "sense",
        "impression",
        "come",
        "without",
        "psychoethical",
        "understanding",
        "feeling",
        "motivate",
        "u",
        "act",
        "must",
        "rooted",
        "anthropological",
        "analysis",
        "inner",
        "drive",
        "instinct",
        "desire",
        "instead",
        "focusing",
        "intellectual",
        "process",
        "whereby",
        "human",
        "being",
        "adapt",
        "surroundings",
        "dilthey",
        "argues",
        "response",
        "basically",
        "emotive",
        "volitional",
        "feeling",
        "measure",
        "effect",
        "world",
        "u",
        "subjective",
        "aspect",
        "representation",
        "world",
        "feeling",
        "rooted",
        "certain",
        "drive",
        "among",
        "sense",
        "group",
        "solidarity",
        "central",
        "bswvi",
        "solidarity",
        "encompasses",
        "fellowfeeling",
        "mitgefühl",
        "bswvi",
        "go",
        "deeper",
        "sympathy",
        "british",
        "moralist",
        "dilthey",
        "regard",
        "sympathy",
        "feeling",
        "transferred",
        "one",
        "living",
        "another",
        "bswvi",
        "sympathy",
        "compassion",
        "pity",
        "mode",
        "suffering",
        "mitleid",
        "derivative",
        "affect",
        "u",
        "outside",
        "involve",
        "external",
        "conjoint",
        "movement",
        "mitbewegung",
        "others",
        "bswvi",
        "dilthey",
        "considers",
        "psychological",
        "form",
        "sympathy",
        "empathy",
        "mitempfindung",
        "superficial",
        "compared",
        "basic",
        "anthropological",
        "fellowfeeling",
        "solidarity",
        "produce",
        "inner",
        "relationship",
        "bswvi",
        "others",
        "extent",
        "motivated",
        "sense",
        "solidarity",
        "function",
        "sphere",
        "commonality",
        "objective",
        "spirit",
        "grow",
        "anthropological",
        "sense",
        "solidarity",
        "fellowfeeling",
        "provides",
        "positive",
        "incentive",
        "sociability",
        "hume",
        "sympathy",
        "schopenhauer",
        "compassion",
        "even",
        "fellowship",
        "solidarity",
        "mere",
        "natural",
        "incentive",
        "become",
        "ethical",
        "transformed",
        "active",
        "participatory",
        "incentive",
        "benevolence",
        "bgsx",
        "develops",
        "anthropologically",
        "based",
        "approach",
        "ethic",
        "dilthey",
        "lead",
        "three",
        "main",
        "ethical",
        "incentive",
        "one",
        "benevolence",
        "wohlwollen",
        "related",
        "human",
        "solidarity",
        "two",
        "incentive",
        "strive",
        "right",
        "rechtschaffenheit",
        "perfect",
        "oneself",
        "socially",
        "legitimate",
        "manner",
        "vollkommenheit",
        "three",
        "ethical",
        "incentive",
        "already",
        "predelineated",
        "moral",
        "principle",
        "dilthey",
        "habilitationsschrift",
        "entitled",
        "versuch",
        "einer",
        "analyse",
        "de",
        "moralischen",
        "bewußtseins",
        "see",
        "gsvi",
        "fact",
        "concluding",
        "section",
        "three",
        "system",
        "ethic",
        "taken",
        "almost",
        "exclusively",
        "earlier",
        "work",
        "ethical",
        "incentive",
        "formulated",
        "three",
        "moral",
        "oughts",
        "raise",
        "question",
        "possible",
        "move",
        "anthropologically",
        "derived",
        "ethical",
        "incentive",
        "posteriori",
        "ultimately",
        "arrive",
        "moral",
        "oughts",
        "priori",
        "crucial",
        "subsection",
        "three",
        "prepares",
        "u",
        "transition",
        "entitled",
        "feeling",
        "duty",
        "justice",
        "consciousness",
        "commitment",
        "inheres",
        "duty",
        "right",
        "dilthey",
        "quite",
        "explicit",
        "commitment",
        "right",
        "demand",
        "consciousness",
        "conceived",
        "mere",
        "instinctive",
        "inner",
        "bond",
        "others",
        "rooted",
        "sense",
        "solidarity",
        "commitment",
        "right",
        "must",
        "come",
        "within",
        "basis",
        "respect",
        "others",
        "end",
        "bswvi",
        "mere",
        "lifevalue",
        "group",
        "solidarity",
        "elevated",
        "spiritual",
        "value",
        "respect",
        "others",
        "individual",
        "endsinthemselves",
        "replaced",
        "humean",
        "sympathy",
        "benevolence",
        "dilthey",
        "engages",
        "kantian",
        "duty",
        "part",
        "analysis",
        "moral",
        "selfreflection",
        "instead",
        "appealing",
        "respect",
        "law",
        "justify",
        "right",
        "dilthey",
        "derives",
        "moral",
        "duty",
        "commitment",
        "based",
        "fidelity",
        "oneself",
        "respect",
        "selfworth",
        "person",
        "bswvi",
        "sense",
        "obligation",
        "verbindlichkeit",
        "come",
        "commitment",
        "bindung",
        "involves",
        "recognition",
        "reciprocal",
        "human",
        "connectedness",
        "rather",
        "onesided",
        "dependence",
        "higher",
        "law",
        "formally",
        "dilthey",
        "move",
        "even",
        "closer",
        "kant",
        "end",
        "lecture",
        "acknowledging",
        "ultimately",
        "must",
        "make",
        "moral",
        "judgment",
        "unconditional",
        "synthetic",
        "priori",
        "bgsx",
        "although",
        "dilthey",
        "rejected",
        "possibility",
        "synthetic",
        "priori",
        "theoretical",
        "judgment",
        "outer",
        "experience",
        "willing",
        "speak",
        "synthetic",
        "priori",
        "practical",
        "judgment",
        "inner",
        "experience",
        "dilthey",
        "published",
        "lecture",
        "would",
        "probably",
        "tempered",
        "language",
        "imported",
        "early",
        "essay",
        "clearly",
        "still",
        "think",
        "morality",
        "requires",
        "judgmental",
        "assent",
        "oughts",
        "unconditionally",
        "selfbinding",
        "normative",
        "implication",
        "anthropological",
        "reflection",
        "life",
        "history",
        "also",
        "led",
        "dilthey",
        "address",
        "value",
        "worldviews",
        "nature",
        "universal",
        "history",
        "force",
        "u",
        "conceive",
        "history",
        "human",
        "science",
        "worldviews",
        "broadly",
        "based",
        "attempt",
        "acquiring",
        "unified",
        "perspective",
        "life",
        "science",
        "nature",
        "partial",
        "provide",
        "comprehensive",
        "worldview",
        "worldview",
        "attempt",
        "provide",
        "cognitive",
        "picture",
        "world",
        "also",
        "estimation",
        "life",
        "valuable",
        "worth",
        "preserving",
        "finally",
        "strive",
        "improve",
        "reality",
        "worldviews",
        "developed",
        "literary",
        "religious",
        "philosophical",
        "work",
        "philosopher",
        "produced",
        "metaphysical",
        "formulation",
        "worldviews",
        "attempt",
        "give",
        "universal",
        "conceptual",
        "determinacy",
        "dilthey",
        "analyzes",
        "three",
        "recurrent",
        "type",
        "metaphysical",
        "formulation",
        "naturalism",
        "idealism",
        "freedom",
        "objective",
        "idealism",
        "naturalism",
        "democritus",
        "hobbes",
        "others",
        "derives",
        "everything",
        "cognized",
        "pluralistic",
        "structure",
        "idealism",
        "freedom",
        "found",
        "plato",
        "kant",
        "others",
        "insists",
        "sovereignty",
        "dualistic",
        "objective",
        "idealism",
        "found",
        "heraclitus",
        "leibniz",
        "hegel",
        "affirms",
        "reality",
        "embodiment",
        "harmonious",
        "set",
        "value",
        "considered",
        "monistic",
        "three",
        "type",
        "metaphysical",
        "worldviews",
        "incommensurable",
        "set",
        "priority",
        "differently",
        "dilthey",
        "find",
        "naturalism",
        "reductive",
        "ethical",
        "view",
        "incline",
        "toward",
        "idealism",
        "freedom",
        "aesthetically",
        "felt",
        "attracted",
        "towards",
        "objective",
        "idealism",
        "metaphysical",
        "formulation",
        "relative",
        "validity",
        "attempt",
        "arrive",
        "totalization",
        "transcends",
        "experience",
        "literary",
        "poetic",
        "expression",
        "worldviews",
        "tend",
        "successful",
        "claim",
        "totalizing",
        "humanly",
        "possible",
        "probe",
        "reality",
        "basis",
        "lifeexperience",
        "settle",
        "limited",
        "philosophical",
        "insight",
        "informed",
        "historical",
        "understanding",
        "ultimately",
        "reflective",
        "understanding",
        "life",
        "history",
        "must",
        "remain",
        "determinateindeterminate",
        "see",
        "certain",
        "parallel",
        "dilthey",
        "attempt",
        "replace",
        "metaphysical",
        "system",
        "informal",
        "lifebased",
        "metaphysical",
        "reflection",
        "worldviews",
        "young",
        "rudolf",
        "carnap",
        "studied",
        "jena",
        "dilthey",
        "student",
        "herman",
        "nohl",
        "moving",
        "vienna",
        "carnap",
        "paper",
        "elimination",
        "metaphysics",
        "logical",
        "analysis",
        "language",
        "refers",
        "dilthey",
        "student",
        "positive",
        "counterexample",
        "variety",
        "meaningless",
        "metaphysical",
        "system",
        "found",
        "fichte",
        "hegel",
        "heidegger",
        "another",
        "essay",
        "carnap",
        "entitled",
        "metaphysics",
        "expression",
        "attitude",
        "life",
        "acknowledges",
        "importance",
        "dilthey",
        "notion",
        "lebensgefuehl",
        "carnap",
        "analogue",
        "dilthey",
        "weltanschauung",
        "weltauffassung",
        "carnap",
        "also",
        "incorporated",
        "le",
        "diltheyan",
        "conception",
        "human",
        "science",
        "der",
        "logische",
        "aufbau",
        "der",
        "welt",
        "carnap",
        "refers",
        "dilthey",
        "introduction",
        "human",
        "science",
        "replaces",
        "language",
        "fact",
        "consciousness",
        "elementary",
        "experiences",
        "refer",
        "dilthey",
        "last",
        "main",
        "work",
        "der",
        "aufbau",
        "der",
        "geschichtlichen",
        "welt",
        "den",
        "geisteswissenschaften",
        "read",
        "han",
        "freyer",
        "theorie",
        "de",
        "objektiven",
        "geistes",
        "work",
        "heavily",
        "influenced",
        "dilthey",
        "aufbau",
        "reinterpretation",
        "objective",
        "spirit",
        "medium",
        "intersubjective",
        "communication",
        "carnap",
        "writes",
        "aufbau",
        "recent",
        "history",
        "philosophy",
        "since",
        "dilthey",
        "called",
        "attention",
        "methodological",
        "objecttheoretical",
        "distinctness",
        "domain",
        "human",
        "science",
        "geisteswissenschaften",
        "carnap",
        "carnap",
        "acknowledges",
        "independent",
        "nature",
        "spiritual",
        "geistigen",
        "intersubjective",
        "object",
        "political",
        "state",
        "social",
        "custom",
        "differ",
        "psychical",
        "physical",
        "object",
        "survive",
        "even",
        "original",
        "subject",
        "generated",
        "perish",
        "subject",
        "take",
        "place",
        "carnap",
        "clear",
        "dilthey",
        "reflective",
        "analysis",
        "distinctive",
        "method",
        "various",
        "science",
        "empirical",
        "approach",
        "lived",
        "experience",
        "earn",
        "serious",
        "consideration",
        "vienna",
        "circle",
        "whole",
        "analytically",
        "oriented",
        "philosopher",
        "evident",
        "theory",
        "understanding",
        "verstehen",
        "came",
        "widely",
        "misinterpreted",
        "kind",
        "empathy",
        "although",
        "dilthey",
        "sharply",
        "differentiated",
        "understanding",
        "judgmental",
        "process",
        "empathy",
        "mere",
        "feeling",
        "carnap",
        "suggested",
        "understanding",
        "others",
        "intuitive",
        "act",
        "involves",
        "measure",
        "empathy",
        "cognitively",
        "vetted",
        "part",
        "analysis",
        "objective",
        "manifestation",
        "ranging",
        "gesture",
        "linguistic",
        "expression",
        "practical",
        "action",
        "carnap",
        "suggestion",
        "carnap",
        "may",
        "negatively",
        "influenced",
        "subsequent",
        "discussion",
        "dilthey",
        "theory",
        "verstehen",
        "analytic",
        "philosopher",
        "leading",
        "theodor",
        "abel",
        "ernest",
        "nagel",
        "arthur",
        "danto",
        "go",
        "even",
        "reducing",
        "empathic",
        "identification",
        "later",
        "danto",
        "recognized",
        "case",
        "acknowledged",
        "verstehen",
        "brilliant",
        "notion",
        "utterly",
        "misconceived",
        "heretofore",
        "crass",
        "philosophical",
        "critic",
        "included",
        "danto",
        "verstehen",
        "immediate",
        "projection",
        "others",
        "stand",
        "deliberate",
        "process",
        "find",
        "proper",
        "context",
        "relate",
        "others",
        "objectification",
        "already",
        "familiar",
        "u",
        "reflective",
        "mode",
        "inquiry",
        "provides",
        "framework",
        "specific",
        "explanation",
        "whether",
        "causal",
        "rational"
    ]
}