{
    "main_text": "The Dirty Hands of Citizens\n7. The Issue of Absolutism\n\nBoth dirty hands and moral dilemmas challenge the idea that some moral\nprohibitions or negative duties are “absolute” though they\ndo so in different ways. If we deny that there are moral rules or\nprohibitions that stand whatever the context, then it will not be\nsurprising that deep moral prohibitions may be legitimately overridden\nin some circumstances. Indeed, many contemporary moral theories, other\nthan utilitarianism, insist that such overruling remains a permanent\npossibility. The intuitionism of W.D. Ross and his followers, for\ninstance, insists that all duties and obligations are prima facie. It\nis always possible that the prima facie duty not to kill the innocent\nwill clash with some other prima facie duty, such as the duty to\npromote wellbeing or the ruler’s duty to preserve the state or\nprotect the community, and then one’s actual duty will be the\noutcome of weighing the respective force of the clashing prima facie\nduties. One might thus see the dirty hands story as merely a version\nof this outlook, a version that insists that only a very great\nweighting on the other side of the balance can tip the scales against\nsome very significant prima facie obligations. Using terminology of\nThomas Nagel’s, dirty hands would instantiate “threshold\ndeontology” with a very high threshold for certain action types.\nTo make this assimilation would be to take much of the sting out of\nthe dirty hands story, both because dirty hands would be part of a\nmore commonplace moral perspective rather than a quite special ethic\nfor emergencies, and because there seems to be no room in threshold\ndeontology, or what has been called “balanced\nexceptionism” (Coady 2004, 778–9; Coady 2008, 285–7,\n299). for the idea that one has done wrong in doing what is\nnonetheless right. There may be a sense of regret that one cannot\navoid doing something that was prima facie wrong—it would be\nmore comfortable if one’s prima facie duties did not conflict\nand therefore need resolution—but no wrong can be attributed to\nyou if you have done the balancing\n conscientiously.[6]\n The balanced exceptionist can of course acknowledge that some prima\nfacie duties are stronger than others, and hence some presumptive\nwrongs carry more heft than others. Indeed, the balancing story\ncommits its supporters to this acknowledgement since there would be no\npoint to the talk of balancing as a procedure for decision unless\nthere were such differences of weight. But the fact remains that the\ngranting of exemption from the prohibition on intentionally killing\nthe innocent is part of a normal, even routine, business of balancing\npresumptive obligations in order to find what is finally obligatory or\nprohibited. If the scales tell you that it is morally permitted or\neven morally obligatory intentionally to kill the innocent, then in\nthese circumstances it cannot be wrong to do\n so.[7]\n\nIn fact, there is an interesting comparison here with utilitarianism.\nAs we have seen, it is common to contrast balanced exceptionism or\nthreshold deontology with utilitarianism and to establish dirty hands\nas a form of deontology (or intrinsicalism) that yields to the\nutilitarianism of extremity. But there may be room for a utilitarian\nversion of the threshold story, even possibly the dirty hands story.\nSurely a sophisticated version of utilitarianism, such as rule or\nindirect utilitarianism, can have room for the idea that duties,\nvirtues etc. cannot be overridden by ordinary calculations of utility\nsince to allow this would be to risk too much overall disutility. It\nis only in situations of dire or “supreme” emergency that\nthe disutility of abiding by the prohibitions or rules would be great\nenough to override the utilitarian value of keeping to the\n rule.[8]\n So, depending upon the empirical facts and calculations, a\nutilitarian can admit a role for thresholds, supreme emergencies, and\neven dirty hands. But while this might give us a utilitarian version\nof threshold deontology, it will not do as a version of dirty hands,\nsince the utilitarian overriding at the supreme emergency stage will\ninvolve a decision that is simply right, and not in any sense right\nbut still wrong. The only sense in which it remains wrong is that weak\nsense, akin to that attributed to Ross in endnote 35, in which it\nwould have been wrong but for the supreme emergency. For the\nutilitarian, (as indeed for Ross) there is no real moral remainder,\nthough there may be some room for psychological discomfort.\n\nThe moral remainder and the remorse it generates signals the tribute\nthat dirty hands pays to moral absolutism. While actually rejecting\nmoral absolutes, the dirty hands theorist remains entranced by the\nsignificance they give to certain moral constraints. But how do we\ndecide whether moral absolutism should be rejected? It is difficult in\nthe nature of the case to see what could resolve a dispute between\nabsolutists and non-absolutists. Absolutists do not typically regard\nall moral prohibitions as absolute; they restrict their claim to a few\nsuch prohibitions, such as those against intentional killing of the\ninnocent, rape and (for some theorists) torture. Their opponents claim\nthat, even for these cases, emergency scenarios can be imagined in\nwhich “our” intuitions accept the legitimacy of such acts.\nWhere absolutists don’t reject the scenarios as merely fantastic\n(as some certainly are), they simply have different intuitions about\nthe force of the examples. Moreover, they can point out that most\nmoral theorists, including their opponents, are absolutists about some\nmoral issues. Utilitarians allow no exceptions “whatever the\ncircumstances” to their basic rule of maximising satisfactory\noutcomes, Rawlsian contractualism gives an absolute priority to\ncertain principles of liberty, and similar points apply to other\ntheories normally opposed to absolutism. It might be replied that the\nlevel at which absolutism applies is different, and this is true since\nthe absolutist endorses specific moral prohibitions such as that on\nmurder or torture whereas the other theories are usually absolute at a\nmore abstract level. Yet it is unclear why this is an important\ndifference, or why, if it is, it should count against the absolutist.\nAfter all, it is surely plausible that our conviction that murder or\ntorture is always wrong has more authority than any conviction that we\nshould always maximise the greatest happiness of the greatest number\nor always maximise preference satisfaction. Moreover, some specific\nmoral prohibitions seem proof against even fantastic counter-examples,\ne.g., the principle that it is wrong to torture an innocent child for\nfun. But, even here, it may be hazardous to underestimate the\ningenuity of philosophers in constructing bizarre counter-examples.\nClearly, more remains to be said about the nature of a defensible (or\nobjectionable) absolutism, but our discussion at least serves to\nindicate the significance of absolute prohibitions for the framing of\ndirty hands scenarios.\n\nA further interesting issue about absolutism is its common association\nwith some versions of religious ethics, especially the\nJudeo-Christian. Certainly, there seems to be a strong element of it\nin traditional Catholic moral theology, and Elizabeth Anscombe, who\nwas a committed Catholic of a theologically conservative cast of mind,\nwrote an influential article (1958) which was, inter alia, an\nearly contemporary defence of absolutism against the balanced\nexceptionism of much (she thought all) of the then current moral\nphilosophy. Anscombe tied the notion of moral obligation in the use of\n“ought” and “ought not” to the concept of\nDivine Law the increased unfashionability of appeal to the commands of\nwhich in connection with obligation having palpably diminished outside\nreligious circles (Anscombe 1958).  Even within those circles,\nhowever, there are problems with a Divine Command ethic as an\nendorsement of absolutism. One can be illustrated through the Biblical\nstory of Abraham’s response to God’s command that he\nshould kill and sacrifice to God his son Isaac. In the Akedah, as the\ntale is often named, Abraham complies until a messenger from God stays\nhis hand at the last moment. Since the intentional killing of an\ninnocent child is a prime example of the absolutely forbidden for\nAnscombe and others there is an obvious incompatibility between a\ndivine command ethic in general and this particular command from God\nthat Abraham is so ready to obey. Exegetes have had various\nexplanations of Abraham’s situation and this is not the place to\nexplore them, other than to point to the primary difficulty of\nGod’s commanding Abraham to to form and begin to put into action\nthe intention to murder his child.\n\nIt is noteworthy that at least one Catholic scholar Evan Sandsmark has\nargued forcefully that the rejection of dirty hands, implicit and\nexplicit the Catholic theological absolutist moral tradition is\nmistaken, and moreover acceptance of the dirty hands category is\nconsistent with absolutism, and even requires it, thereby reinforcing\nthe relevance of my earlier point about the tribute that dirty hands\npays to absolutism. His argument is that the moral taint that is\nessential to the dirty hands act of necessity is best explained by its\ninvolving a guilty violation of an absolute prohibition. Since the\nprohibition remains absolute though the violator has by hypothesis\ndone the right thing then the agent must be remorseful and seek\npenance and appropriate recompense for the offence. Sandsmark’s\ningenious argument strains the sense of the term\n“absolute” since some sort of “necessity”\nmakes the prohibition no longer absolutely binding, bringing it nearer\nto Igor Primoratz’s “almost absolute” category in\nconnection with the prohibition of terrorist acts of intentionally\nkilling the innocent (Primoratz, 2013, 110–113). It also seems\nto inherit the problem discussed earlier in this entry about\nseparating the overwhelming dirty hands necessity from morality only\nat the possible cost of achieving coherence at the cost of\nfalsity. \n\nWalzer’s attitude to absolutism is (as it has to be) one of\nrespectful rejection. He says: “I don’t believe that\nterrorism can ever be justified. But I also don’t want to defend\nan absolute ban. ‘Do justice though the heavens fall’ has\nnever seemed to me a plausible moral position” (Walzer 2006, 7).\nElsewhere, he says, after claiming that absolutism is “very old,\nperhaps older than anything else in our moral understanding”,\nthat at the point of disaster or supreme emergency “absolutism\nrepresents, it seems to me, a refusal to think about what it means for\nthe heavens to fall” (Walzer 2004a). Such a refusal can indeed\nbe represented as obtuse, but when we come to cash out contemporary\nthinking about falling heavens we might think about the issue of\ntorture, an issue that was one of Walzer’s earliest examples\ngenerating dirty hands. The easy acceptance since September 11, 2001,\namongst some intellectuals of the recourse to torture in situations of\nemergency, frequently it would seem far short of\n“supreme”, has raised questions of the relevance of\nabsolutism even on the part of those who had previously endorsed dirty\nhands or exceptionism of some sort. So, Henry Shue, for instance,\nalways a strong opponent of torture, had nonetheless allowed in his\noriginal treatment of the issue that torture might be morally\npermissible in certain “extreme” circumstances (Shue\n1977–78). But in a later, Shue criticises his own admission and\nthe widespread intellectual acceptance of torture in extremis as a\nresort to “dreamland” (Shue 2006). By this he means that\nthe philosophers’ stories about “ticking bomb”\nscenarios are basically fantasies that distract from the reality of\nmoral assessment in the real world. Shue’s opposition is now, as\na matter of practice, resolute and absolute. Others have also\nexpressed a commitment to a sort of absolutism in connection with\ntorture. Bob Brecher, for example, provides a criticism of the ticking\nbomb scenario (which is basically the scenario Walzer uses in his\noriginal paper on dirty hands) and from a purely consequentialist\nperspective endorses the need for an absolute condemnation of torture\n(Brecker 2007). As mentioned earlier, Igor Primoratz somewhat\nsimilarly recognises the pull of absolutism about some moral\nimperatives and argues for “almost absolute.” So the\ndebate about torture largely engendered by the “war on\nterror” has revived interest in the credentials of moral\nabsolutism, although much about the nature and types of absolutism\nremain in need of clarification. In any event, there is clearly reason\nto approach the topic of dirty hands with a degree of suspicion\nregarding Lady Carbury’s enthusiasm for “beneficent\naudacity” and her contempt for measuring exceptional people by\nthe “ordinary rule” appropriate to the rest of us.\n",
    "section_title": "7. The Issue of Absolutism",
    "entry_title": "The Problem of Dirty Hands",
    "hierarchy_title": "The Problem of Dirty Hands || The Dirty Hands of Citizens",
    "tokenized_text": [
        "dirty",
        "hand",
        "citizen",
        "issue",
        "absolutism",
        "dirty",
        "hand",
        "moral",
        "dilemma",
        "challenge",
        "idea",
        "moral",
        "prohibition",
        "negative",
        "duty",
        "absolute",
        "though",
        "different",
        "way",
        "deny",
        "moral",
        "rule",
        "prohibition",
        "stand",
        "whatever",
        "context",
        "surprising",
        "deep",
        "moral",
        "prohibition",
        "may",
        "legitimately",
        "overridden",
        "circumstance",
        "indeed",
        "many",
        "contemporary",
        "moral",
        "theory",
        "utilitarianism",
        "insist",
        "overruling",
        "remains",
        "permanent",
        "possibility",
        "intuitionism",
        "wd",
        "ross",
        "follower",
        "instance",
        "insists",
        "duty",
        "obligation",
        "prima",
        "facie",
        "always",
        "possible",
        "prima",
        "facie",
        "duty",
        "kill",
        "innocent",
        "clash",
        "prima",
        "facie",
        "duty",
        "duty",
        "promote",
        "wellbeing",
        "ruler",
        "duty",
        "preserve",
        "state",
        "protect",
        "community",
        "one",
        "actual",
        "duty",
        "outcome",
        "weighing",
        "respective",
        "force",
        "clashing",
        "prima",
        "facie",
        "duty",
        "one",
        "might",
        "thus",
        "see",
        "dirty",
        "hand",
        "story",
        "merely",
        "version",
        "outlook",
        "version",
        "insists",
        "great",
        "weighting",
        "side",
        "balance",
        "tip",
        "scale",
        "significant",
        "prima",
        "facie",
        "obligation",
        "using",
        "terminology",
        "thomas",
        "nagel",
        "dirty",
        "hand",
        "would",
        "instantiate",
        "threshold",
        "deontology",
        "high",
        "threshold",
        "certain",
        "action",
        "type",
        "make",
        "assimilation",
        "would",
        "take",
        "much",
        "sting",
        "dirty",
        "hand",
        "story",
        "dirty",
        "hand",
        "would",
        "part",
        "commonplace",
        "moral",
        "perspective",
        "rather",
        "quite",
        "special",
        "ethic",
        "emergency",
        "seems",
        "room",
        "threshold",
        "deontology",
        "called",
        "balanced",
        "exceptionism",
        "coady",
        "coady",
        "idea",
        "one",
        "done",
        "wrong",
        "nonetheless",
        "right",
        "may",
        "sense",
        "regret",
        "one",
        "avoid",
        "something",
        "prima",
        "facie",
        "wrongit",
        "would",
        "comfortable",
        "one",
        "prima",
        "facie",
        "duty",
        "conflict",
        "therefore",
        "need",
        "resolutionbut",
        "wrong",
        "attributed",
        "done",
        "balancing",
        "conscientiously",
        "balanced",
        "exceptionist",
        "course",
        "acknowledge",
        "prima",
        "facie",
        "duty",
        "stronger",
        "others",
        "hence",
        "presumptive",
        "wrong",
        "carry",
        "heft",
        "others",
        "indeed",
        "balancing",
        "story",
        "commits",
        "supporter",
        "acknowledgement",
        "since",
        "would",
        "point",
        "talk",
        "balancing",
        "procedure",
        "decision",
        "unless",
        "difference",
        "weight",
        "fact",
        "remains",
        "granting",
        "exemption",
        "prohibition",
        "intentionally",
        "killing",
        "innocent",
        "part",
        "normal",
        "even",
        "routine",
        "business",
        "balancing",
        "presumptive",
        "obligation",
        "order",
        "find",
        "finally",
        "obligatory",
        "prohibited",
        "scale",
        "tell",
        "morally",
        "permitted",
        "even",
        "morally",
        "obligatory",
        "intentionally",
        "kill",
        "innocent",
        "circumstance",
        "wrong",
        "fact",
        "interesting",
        "comparison",
        "utilitarianism",
        "seen",
        "common",
        "contrast",
        "balanced",
        "exceptionism",
        "threshold",
        "deontology",
        "utilitarianism",
        "establish",
        "dirty",
        "hand",
        "form",
        "deontology",
        "intrinsicalism",
        "yield",
        "utilitarianism",
        "extremity",
        "may",
        "room",
        "utilitarian",
        "version",
        "threshold",
        "story",
        "even",
        "possibly",
        "dirty",
        "hand",
        "story",
        "surely",
        "sophisticated",
        "version",
        "utilitarianism",
        "rule",
        "indirect",
        "utilitarianism",
        "room",
        "idea",
        "duty",
        "virtue",
        "etc",
        "overridden",
        "ordinary",
        "calculation",
        "utility",
        "since",
        "allow",
        "would",
        "risk",
        "much",
        "overall",
        "disutility",
        "situation",
        "dire",
        "supreme",
        "emergency",
        "disutility",
        "abiding",
        "prohibition",
        "rule",
        "would",
        "great",
        "enough",
        "override",
        "utilitarian",
        "value",
        "keeping",
        "rule",
        "depending",
        "upon",
        "empirical",
        "fact",
        "calculation",
        "utilitarian",
        "admit",
        "role",
        "threshold",
        "supreme",
        "emergency",
        "even",
        "dirty",
        "hand",
        "might",
        "give",
        "u",
        "utilitarian",
        "version",
        "threshold",
        "deontology",
        "version",
        "dirty",
        "hand",
        "since",
        "utilitarian",
        "overriding",
        "supreme",
        "emergency",
        "stage",
        "involve",
        "decision",
        "simply",
        "right",
        "sense",
        "right",
        "still",
        "wrong",
        "sense",
        "remains",
        "wrong",
        "weak",
        "sense",
        "akin",
        "attributed",
        "ross",
        "endnote",
        "would",
        "wrong",
        "supreme",
        "emergency",
        "utilitarian",
        "indeed",
        "ross",
        "real",
        "moral",
        "remainder",
        "though",
        "may",
        "room",
        "psychological",
        "discomfort",
        "moral",
        "remainder",
        "remorse",
        "generates",
        "signal",
        "tribute",
        "dirty",
        "hand",
        "pay",
        "moral",
        "absolutism",
        "actually",
        "rejecting",
        "moral",
        "absolute",
        "dirty",
        "hand",
        "theorist",
        "remains",
        "entranced",
        "significance",
        "give",
        "certain",
        "moral",
        "constraint",
        "decide",
        "whether",
        "moral",
        "absolutism",
        "rejected",
        "difficult",
        "nature",
        "case",
        "see",
        "could",
        "resolve",
        "dispute",
        "absolutist",
        "nonabsolutists",
        "absolutist",
        "typically",
        "regard",
        "moral",
        "prohibition",
        "absolute",
        "restrict",
        "claim",
        "prohibition",
        "intentional",
        "killing",
        "innocent",
        "rape",
        "theorist",
        "torture",
        "opponent",
        "claim",
        "even",
        "case",
        "emergency",
        "scenario",
        "imagined",
        "intuition",
        "accept",
        "legitimacy",
        "act",
        "absolutist",
        "reject",
        "scenario",
        "merely",
        "fantastic",
        "certainly",
        "simply",
        "different",
        "intuition",
        "force",
        "example",
        "moreover",
        "point",
        "moral",
        "theorist",
        "including",
        "opponent",
        "absolutist",
        "moral",
        "issue",
        "utilitarian",
        "allow",
        "exception",
        "whatever",
        "circumstance",
        "basic",
        "rule",
        "maximising",
        "satisfactory",
        "outcome",
        "rawlsian",
        "contractualism",
        "give",
        "absolute",
        "priority",
        "certain",
        "principle",
        "liberty",
        "similar",
        "point",
        "apply",
        "theory",
        "normally",
        "opposed",
        "absolutism",
        "might",
        "replied",
        "level",
        "absolutism",
        "applies",
        "different",
        "true",
        "since",
        "absolutist",
        "endorses",
        "specific",
        "moral",
        "prohibition",
        "murder",
        "torture",
        "whereas",
        "theory",
        "usually",
        "absolute",
        "abstract",
        "level",
        "yet",
        "unclear",
        "important",
        "difference",
        "count",
        "absolutist",
        "surely",
        "plausible",
        "conviction",
        "murder",
        "torture",
        "always",
        "wrong",
        "authority",
        "conviction",
        "always",
        "maximise",
        "greatest",
        "happiness",
        "greatest",
        "number",
        "always",
        "maximise",
        "preference",
        "satisfaction",
        "moreover",
        "specific",
        "moral",
        "prohibition",
        "seem",
        "proof",
        "even",
        "fantastic",
        "counterexamples",
        "eg",
        "principle",
        "wrong",
        "torture",
        "innocent",
        "child",
        "fun",
        "even",
        "may",
        "hazardous",
        "underestimate",
        "ingenuity",
        "philosopher",
        "constructing",
        "bizarre",
        "counterexamples",
        "clearly",
        "remains",
        "said",
        "nature",
        "defensible",
        "objectionable",
        "absolutism",
        "discussion",
        "least",
        "serf",
        "indicate",
        "significance",
        "absolute",
        "prohibition",
        "framing",
        "dirty",
        "hand",
        "scenario",
        "interesting",
        "issue",
        "absolutism",
        "common",
        "association",
        "version",
        "religious",
        "ethic",
        "especially",
        "judeochristian",
        "certainly",
        "seems",
        "strong",
        "element",
        "traditional",
        "catholic",
        "moral",
        "theology",
        "elizabeth",
        "anscombe",
        "committed",
        "catholic",
        "theologically",
        "conservative",
        "cast",
        "mind",
        "wrote",
        "influential",
        "article",
        "inter",
        "alia",
        "early",
        "contemporary",
        "defence",
        "absolutism",
        "balanced",
        "exceptionism",
        "much",
        "thought",
        "current",
        "moral",
        "philosophy",
        "anscombe",
        "tied",
        "notion",
        "moral",
        "obligation",
        "use",
        "ought",
        "ought",
        "concept",
        "divine",
        "law",
        "increased",
        "unfashionability",
        "appeal",
        "command",
        "connection",
        "obligation",
        "palpably",
        "diminished",
        "outside",
        "religious",
        "circle",
        "anscombe",
        "even",
        "within",
        "circle",
        "however",
        "problem",
        "divine",
        "command",
        "ethic",
        "endorsement",
        "absolutism",
        "one",
        "illustrated",
        "biblical",
        "story",
        "abraham",
        "response",
        "god",
        "command",
        "kill",
        "sacrifice",
        "god",
        "son",
        "isaac",
        "akedah",
        "tale",
        "often",
        "named",
        "abraham",
        "complies",
        "messenger",
        "god",
        "stay",
        "hand",
        "last",
        "moment",
        "since",
        "intentional",
        "killing",
        "innocent",
        "child",
        "prime",
        "example",
        "absolutely",
        "forbidden",
        "anscombe",
        "others",
        "obvious",
        "incompatibility",
        "divine",
        "command",
        "ethic",
        "general",
        "particular",
        "command",
        "god",
        "abraham",
        "ready",
        "obey",
        "exegete",
        "various",
        "explanation",
        "abraham",
        "situation",
        "place",
        "explore",
        "point",
        "primary",
        "difficulty",
        "god",
        "commanding",
        "abraham",
        "form",
        "begin",
        "put",
        "action",
        "intention",
        "murder",
        "child",
        "noteworthy",
        "least",
        "one",
        "catholic",
        "scholar",
        "evan",
        "sandsmark",
        "argued",
        "forcefully",
        "rejection",
        "dirty",
        "hand",
        "implicit",
        "explicit",
        "catholic",
        "theological",
        "absolutist",
        "moral",
        "tradition",
        "mistaken",
        "moreover",
        "acceptance",
        "dirty",
        "hand",
        "category",
        "consistent",
        "absolutism",
        "even",
        "requires",
        "thereby",
        "reinforcing",
        "relevance",
        "earlier",
        "point",
        "tribute",
        "dirty",
        "hand",
        "pay",
        "absolutism",
        "argument",
        "moral",
        "taint",
        "essential",
        "dirty",
        "hand",
        "act",
        "necessity",
        "best",
        "explained",
        "involving",
        "guilty",
        "violation",
        "absolute",
        "prohibition",
        "since",
        "prohibition",
        "remains",
        "absolute",
        "though",
        "violator",
        "hypothesis",
        "done",
        "right",
        "thing",
        "agent",
        "must",
        "remorseful",
        "seek",
        "penance",
        "appropriate",
        "recompense",
        "offence",
        "sandsmark",
        "ingenious",
        "argument",
        "strain",
        "sense",
        "term",
        "absolute",
        "since",
        "sort",
        "necessity",
        "make",
        "prohibition",
        "longer",
        "absolutely",
        "binding",
        "bringing",
        "nearer",
        "igor",
        "primoratz",
        "almost",
        "absolute",
        "category",
        "connection",
        "prohibition",
        "terrorist",
        "act",
        "intentionally",
        "killing",
        "innocent",
        "primoratz",
        "also",
        "seems",
        "inherit",
        "problem",
        "discussed",
        "earlier",
        "entry",
        "separating",
        "overwhelming",
        "dirty",
        "hand",
        "necessity",
        "morality",
        "possible",
        "cost",
        "achieving",
        "coherence",
        "cost",
        "falsity",
        "walzer",
        "attitude",
        "absolutism",
        "one",
        "respectful",
        "rejection",
        "say",
        "believe",
        "terrorism",
        "ever",
        "justified",
        "also",
        "want",
        "defend",
        "absolute",
        "ban",
        "justice",
        "though",
        "heaven",
        "fall",
        "never",
        "seemed",
        "plausible",
        "moral",
        "position",
        "walzer",
        "elsewhere",
        "say",
        "claiming",
        "absolutism",
        "old",
        "perhaps",
        "older",
        "anything",
        "else",
        "moral",
        "understanding",
        "point",
        "disaster",
        "supreme",
        "emergency",
        "absolutism",
        "represents",
        "seems",
        "refusal",
        "think",
        "mean",
        "heaven",
        "fall",
        "walzer",
        "a",
        "refusal",
        "indeed",
        "represented",
        "obtuse",
        "come",
        "cash",
        "contemporary",
        "thinking",
        "falling",
        "heaven",
        "might",
        "think",
        "issue",
        "torture",
        "issue",
        "one",
        "walzer",
        "earliest",
        "example",
        "generating",
        "dirty",
        "hand",
        "easy",
        "acceptance",
        "since",
        "september",
        "amongst",
        "intellectual",
        "recourse",
        "torture",
        "situation",
        "emergency",
        "frequently",
        "would",
        "seem",
        "far",
        "short",
        "supreme",
        "raised",
        "question",
        "relevance",
        "absolutism",
        "even",
        "part",
        "previously",
        "endorsed",
        "dirty",
        "hand",
        "exceptionism",
        "sort",
        "henry",
        "shue",
        "instance",
        "always",
        "strong",
        "opponent",
        "torture",
        "nonetheless",
        "allowed",
        "original",
        "treatment",
        "issue",
        "torture",
        "might",
        "morally",
        "permissible",
        "certain",
        "extreme",
        "circumstance",
        "shue",
        "later",
        "shue",
        "criticises",
        "admission",
        "widespread",
        "intellectual",
        "acceptance",
        "torture",
        "extremis",
        "resort",
        "dreamland",
        "shue",
        "mean",
        "philosopher",
        "story",
        "ticking",
        "bomb",
        "scenario",
        "basically",
        "fantasy",
        "distract",
        "reality",
        "moral",
        "assessment",
        "real",
        "world",
        "shue",
        "opposition",
        "matter",
        "practice",
        "resolute",
        "absolute",
        "others",
        "also",
        "expressed",
        "commitment",
        "sort",
        "absolutism",
        "connection",
        "torture",
        "bob",
        "brecher",
        "example",
        "provides",
        "criticism",
        "ticking",
        "bomb",
        "scenario",
        "basically",
        "scenario",
        "walzer",
        "us",
        "original",
        "paper",
        "dirty",
        "hand",
        "purely",
        "consequentialist",
        "perspective",
        "endorses",
        "need",
        "absolute",
        "condemnation",
        "torture",
        "brecker",
        "mentioned",
        "earlier",
        "igor",
        "primoratz",
        "somewhat",
        "similarly",
        "recognises",
        "pull",
        "absolutism",
        "moral",
        "imperative",
        "argues",
        "almost",
        "absolute",
        "debate",
        "torture",
        "largely",
        "engendered",
        "war",
        "terror",
        "revived",
        "interest",
        "credential",
        "moral",
        "absolutism",
        "although",
        "much",
        "nature",
        "type",
        "absolutism",
        "remain",
        "need",
        "clarification",
        "event",
        "clearly",
        "reason",
        "approach",
        "topic",
        "dirty",
        "hand",
        "degree",
        "suspicion",
        "regarding",
        "lady",
        "carbury",
        "enthusiasm",
        "beneficent",
        "audacity",
        "contempt",
        "measuring",
        "exceptional",
        "people",
        "ordinary",
        "rule",
        "appropriate",
        "rest",
        "u"
    ]
}