{
    "main_text": "A Conceptual Confusion?\n3. A Conceptual Confusion?\n\nLet us examine these in turn. The structure of dirty hands is such\nthat it seems to involve a contradiction or paradox. The advocate of\ndirty hands says in effect that it is sometimes right to do what is\nwrong, and this seems tantamount to saying that some act is both wrong\nand not wrong. But the dirty hands theorist is not saying that it is\nwrong in some respects and right in others, nor that what would\nnormally be wrong is here right. Rather, it is the whole act in\ncontext that is both categorically wrong and not wrong. In the dirty\nhands scenario we are asked to believe that doing X is\nmorally wrong and yet it is palpably right to do it. As Walzer has\nmore recently written of his own position, it is both\n“provocative and paradoxical” (Walzer 2004a, 33). Kai\nNielson has urged the point even more strongly, but something of the\nsort has puzzled many who contemplate the problem. The category of\ndirty hands, as described by Walzer and some others is, according to\nNielson “a conceptual confusion with unfortunate moral\nresidues” (Nielson 2000, 140). Clearly such a dismissal would\ncome naturally to a utilitarian or most consequentialists who would\nsimply declare the dirty hands decision to be one in which a right act\n(that producing the best consequences in terms of preference\nsatisfactions, overall increase in happiness or whatever) has been\ndone though it may have been distressing to do it. Nielson disavows\nutilitarianism and calls himself a “weak consequentialist”\nbut the upshot is much the same. He thinks that dirty hands situations\nconfront an agent with a choice of two evils and the agent should\nalways choose the lesser evil. No doubt, in acting against what in\nother circumstances is a deep moral constraint, the agent will\nexperience distress; she will “feel guilty” but feeling\nguilty is not to be confused with being guilty (Nielson 2000,\n140).\n\nFrom the opposite direction the problem can also be resolved by the\ndenial that the hands should become dirty. An insistence on the\ninviolability of some moral prescriptions makes the paradox disappear\nas neatly as the Nielson manoeuvre. If we hold to the prohibition on\nintentionally killing the innocent, for example, in the face of crises\nlike that supposed by Walzer to necessitate the bombing of German\ncities in the early phase of World War II, then there are no dirty\nhands to have. Such a position is often called absolutist. Absolutist\npositions have been explicitly held by many philosophers, notably\nAugustine, Aquinas, and Kant, and implicitly perhaps by many more. The\nposition involves complexities that we will examine later.\n\nBoth these responses agree in holding that moral reasons rightly\ndominate all others. Another way of defusing the strong appearance of\ncontradiction is to hold that morality is not the only legitimate\ndeterminant of right action and that some other determinant may\noccasionally properly trump it. This provides one answer to the second\npoint of clarification mentioned earlier. Dirty hands problems do not\narise within morality but rather when morality clashes with\nsome other rational necessity of a profound kind that correctly\noverrules\n it.[2]\n The overruling must inspire regret, possibly remorse, but it is\nnonetheless clear that the overruling is in order, indeed required.\nHere, it is important to acknowledge that the overruling in question\nis not merely a description of what often happens. It is common\nknowledge that the demands of morality are often enough overridden by\nother persuasive demands, such as imperatives of self-interest,\ncareerism, political advantage and friendship. It may even be that\npolitics is an arena in which such overpowering happens more commonly\nthan elsewhere, so that participation in it is fraught with moral\nhazard that requires an exceptional moral character to overcome.\nNonetheless, the importance and challenge of the dirty hands scenario\nis not that hands get dirty from time to time, but that it is right\nthat they do so.\n\nIf we allow that non-moral “oughts” can sometimes trump\nmoral ones then the dirty hands position may be restated as holding\nthat, in circumstances of extremity, reasons of\n“necessity” (or whatever) defeat important moral reasons.\nThis seems to be one plausible construal of Machiavelli when he talks\nof the necessity that rulers must learn how not to be good. Of course,\nhe has the model of Christian morality in mind when he calls for its\noverriding and so may be understood as opposing one form of morality\nto another, but a good deal of his discussion can be treated as\nelevating “reasons of state” above morality. This is a\nrejection of the idea that moral reasons dominate all other\nreasons.\n\nIt may be useful here to distinguish between dominance and\ncomprehensiveness. Most moral theorists hold that morality is both\ncomprehensive and dominant, that is, it relevant to all decisions and\nwhere relevant it defeats all other reasons. One could however hold\nthat morality is comprehensive but not dominant, or dominant but not\ncomprehensive, or indeed neither dominant nor comprehensive. Our\npresent inquiry is concerned with the first two options. The ideas of\ndominance and comprehensiveness express somewhat different pictures of\nthe status of morality, though an exalted understanding of morality\noften draws on both. Morality’s dominance would consist in its\ntrumping all other considerations whenever it is relevant to them,\nwhereas morality’s comprehensiveness consists in its being\nuniversally relevant whether it trumps other considerations or not. On\nthe present interpretation, dirty hands theorists accept\nmorality’s comprehensiveness (at least with respect to the\ndomains they are concerned with) but reluctantly reject its dominance\nfor one class of decisions.\n\nWe might usefully contrast this with the position of the school of\nthinkers called “political realists” whose outlook has\nsome affinity with the dirty hands theorists to the point that the two\nare sometimes confused. Realists are often viewed (and often present\nthemselves) as rejecting the comprehensive relevance of morality by\nreference to something special about politics or international\nrelations. So we find E.H. Carr stating as “the realist\nview” that “no ethical standards are applicable to\nrelations between states…” (Carr 1962, 153). Other\nrealists come close to this, though their views are clouded by\nuncertainties about morality’s provenance (as indeed are\nCarr’s). Arthur Schlesinger Jr., for instance, claims:\n“The raw material of foreign affairs is, most of the time,\nmorally neutral or ambiguous. In consequence, for the great majority\nof foreign-policy transactions, moral principles cannot be\ndecisive” (Schlesinger 1971, 73).The influential American\nrealist, Hans Morgenthau, is anxious to separate politics from\nmorality by maintaining “the autonomy of the political\nsphere.” He recognises the autonomy of other spheres such as\neconomics, law and morality, but insists that the political realist\nmust “subordinate these other standards to those of\npolitics” (Morgenthau 2006, 13). Here, he echoes the position of\nthe German conservative thinker Carl Schmitt by whom he was clearly\ninfluenced. Schmitt became embroiled with the Nazi Party in the 1930s\nand enjoyed (if that is the word) some fame for a time as a\ntheoretician for the Nazi cause. These quotations all suggest the idea\nthat politics, or some significant area of it, such as international\nrelations, falls quite outside the provenance of morality, thus\ndenying morality comprehensiveness, though the reference to\nmorality’s failure to be “decisive” hints at a\ndenial of dominance. There are many obscurities in the stance of\npolitical realism, and this is not the place to unravel them, but in\nspite of the ambiguities in pronouncements of the leading theorists in\nthe school, and in spite of some continuity between their outlook on\npolitics and that of the dirty hands theorists, it is clear that the\nrealist’s attitude to morality usually has quite a different\nflavour to that of the dirty hands\n theorists.[3]\n Part of this is captured by the difference between the denials of\ncomprehensiveness and dominance, and this connects with the fact that\nwhen realists reject moral considerations they do so with no deep\nsense of regret or remorse for having done what is morally wrong.\n\nThe denial of dominance preserves a certain coherence for morality\nsince it is not, as it were, at odds with itself; it is at times and\nin context at odds with something else which, following both\nMachiavelli and Walzer, might be called “necessity”. But\nwhat is this necessity? Clearly, it is not meant to be some form of\ndeterministic necessity, since it would have been possible for the\nBritish leadership in World War II to have rejected the policy of city\nbombing outright, as their declared policy prior to the war had\nindicated they would do, a policy that their initial bombing practices\nindeed\n respected.[4]\n Yet there is a trace of this deterministic thought in the idea of\nsupreme emergency with its implication of something that overwhelms\nthe normal power of morality. We might recall in this connection\nThomas Hobbes’s argument that moral dictates cannot apply when\nthey would lead to self-destruction. Hobbes’s idea is that the\nrationality of self-preservation, which itself gives rise to morality,\nmakes acting on morality null and void when acting on it would defy\nself-preservation. As Hobbes puts it: “The laws of nature oblige\nin foro interno; that is to say, they bind to a desire that\nthey should take place: but in foro externo: this is to the\nputting of them in act, not always. For he that should be modest, and\ntractable, and perform all he promises, in such time, and place, where\nno man else should do so, should but make himself a prey to others,\nand procure his own certain ruin, contrary to the ground of all laws\nof nature, which tend to nature’s preservation”\n(Leviathan, Ch. XV, p. 99).\n\nHobbes certainly does paint a totally isolated scenario for the person\nwho would obey the moral law—“where no man else should do\nso”—and one might wonder whether the institution of\npromising could even exist in so bleakly uncooperative “time and\nplace” as he supposes. But presumably a sufficient number of\nnon-cooperators would serve to make one “a prey to others”\nand procure “certain ruin”, and it is the necessity of\navoiding some such ruin that motivates the supreme emergency story,\neven though it is collective rather than individual ruin that lies at\nits heart. Hobbes’s exemption from the need to practice morality\n(rather than desire its operation) makes most sense on a contractarian\nview of morality or in connection with those moral obligations that\nare dependent upon agreement (even if other obligations are not). In a\nworld in which hardly anyone kept their promises or adhered to their\ncontracts, the sense of such commitments would dissipate and entering\ninto what shell remained of them might be folly indeed, and very\nlikely futile as well. But many other areas of morality are not like\nthis, and so even where adherence to moral imperatives may be perilous\nin the extreme, it may not be the folly that Hobbes’s comments\nmake it seem. One woman who survived Belsen, Hanna Levy-Haas, records\nin her diary a philosophical debate she had in the camp with a fellow\nMarxist, Professor K who argued the somewhat Hobbesian case\n(embellished with Marxist terminology) that morality did not apply in\nthe camps because it was superseded by the survival imperative. She\nrejected his argument because it required her “simply to\ncompromise with the enemy, to betray one’s principles, to deny\nspiritual values in the interests of saving one’s skin”\n(Levy-Haas 1982, 65). These comments indicate at the very least that\nthe idea of “total ruin” is open to interpretations that\nsee the abandonment or degrading of moral integrity as itself a\nprimary ingredient in such ruin.\n\nThis excursion into the world of the Leviathan nonetheless helps give\nsome sense to the idea that the practice of morality might be\nsuspended for a time and hence morality itself moved aside by an\nexternal necessity. It thus helps show a way that the dirty hands\nstory might be redeemed from incoherence, even if the idea that\nmorality should sometimes be dominated by an external necessity proves\nunacceptable. The dirty hands position might then be coherent but\nfalse. So Hanna Levy-Haas could understand the Professor’s\nargument, but found reason to reject it.\n",
    "section_title": "3. A Conceptual Confusion?",
    "entry_title": "The Problem of Dirty Hands",
    "hierarchy_title": "The Problem of Dirty Hands || A Conceptual Confusion?",
    "tokenized_text": [
        "conceptual",
        "confusion",
        "conceptual",
        "confusion",
        "let",
        "u",
        "examine",
        "turn",
        "structure",
        "dirty",
        "hand",
        "seems",
        "involve",
        "contradiction",
        "paradox",
        "advocate",
        "dirty",
        "hand",
        "say",
        "effect",
        "sometimes",
        "right",
        "wrong",
        "seems",
        "tantamount",
        "saying",
        "act",
        "wrong",
        "wrong",
        "dirty",
        "hand",
        "theorist",
        "saying",
        "wrong",
        "respect",
        "right",
        "others",
        "would",
        "normally",
        "wrong",
        "right",
        "rather",
        "whole",
        "act",
        "context",
        "categorically",
        "wrong",
        "wrong",
        "dirty",
        "hand",
        "scenario",
        "asked",
        "believe",
        "x",
        "morally",
        "wrong",
        "yet",
        "palpably",
        "right",
        "walzer",
        "recently",
        "written",
        "position",
        "provocative",
        "paradoxical",
        "walzer",
        "a",
        "kai",
        "nielson",
        "urged",
        "point",
        "even",
        "strongly",
        "something",
        "sort",
        "puzzled",
        "many",
        "contemplate",
        "problem",
        "category",
        "dirty",
        "hand",
        "described",
        "walzer",
        "others",
        "according",
        "nielson",
        "conceptual",
        "confusion",
        "unfortunate",
        "moral",
        "residue",
        "nielson",
        "clearly",
        "dismissal",
        "would",
        "come",
        "naturally",
        "utilitarian",
        "consequentialists",
        "would",
        "simply",
        "declare",
        "dirty",
        "hand",
        "decision",
        "one",
        "right",
        "act",
        "producing",
        "best",
        "consequence",
        "term",
        "preference",
        "satisfaction",
        "overall",
        "increase",
        "happiness",
        "whatever",
        "done",
        "though",
        "may",
        "distressing",
        "nielson",
        "disavows",
        "utilitarianism",
        "call",
        "weak",
        "consequentialist",
        "upshot",
        "much",
        "think",
        "dirty",
        "hand",
        "situation",
        "confront",
        "agent",
        "choice",
        "two",
        "evil",
        "agent",
        "always",
        "choose",
        "lesser",
        "evil",
        "doubt",
        "acting",
        "circumstance",
        "deep",
        "moral",
        "constraint",
        "agent",
        "experience",
        "distress",
        "feel",
        "guilty",
        "feeling",
        "guilty",
        "confused",
        "guilty",
        "nielson",
        "opposite",
        "direction",
        "problem",
        "also",
        "resolved",
        "denial",
        "hand",
        "become",
        "dirty",
        "insistence",
        "inviolability",
        "moral",
        "prescription",
        "make",
        "paradox",
        "disappear",
        "neatly",
        "nielson",
        "manoeuvre",
        "hold",
        "prohibition",
        "intentionally",
        "killing",
        "innocent",
        "example",
        "face",
        "crisis",
        "like",
        "supposed",
        "walzer",
        "necessitate",
        "bombing",
        "german",
        "city",
        "early",
        "phase",
        "world",
        "war",
        "ii",
        "dirty",
        "hand",
        "position",
        "often",
        "called",
        "absolutist",
        "absolutist",
        "position",
        "explicitly",
        "held",
        "many",
        "philosopher",
        "notably",
        "augustine",
        "aquinas",
        "kant",
        "implicitly",
        "perhaps",
        "many",
        "position",
        "involves",
        "complexity",
        "examine",
        "later",
        "response",
        "agree",
        "holding",
        "moral",
        "reason",
        "rightly",
        "dominate",
        "others",
        "another",
        "way",
        "defusing",
        "strong",
        "appearance",
        "contradiction",
        "hold",
        "morality",
        "legitimate",
        "determinant",
        "right",
        "action",
        "determinant",
        "may",
        "occasionally",
        "properly",
        "trump",
        "provides",
        "one",
        "answer",
        "second",
        "point",
        "clarification",
        "mentioned",
        "earlier",
        "dirty",
        "hand",
        "problem",
        "arise",
        "within",
        "morality",
        "rather",
        "morality",
        "clash",
        "rational",
        "necessity",
        "profound",
        "kind",
        "correctly",
        "overrules",
        "overruling",
        "must",
        "inspire",
        "regret",
        "possibly",
        "remorse",
        "nonetheless",
        "clear",
        "overruling",
        "order",
        "indeed",
        "required",
        "important",
        "acknowledge",
        "overruling",
        "question",
        "merely",
        "description",
        "often",
        "happens",
        "common",
        "knowledge",
        "demand",
        "morality",
        "often",
        "enough",
        "overridden",
        "persuasive",
        "demand",
        "imperative",
        "selfinterest",
        "careerism",
        "political",
        "advantage",
        "friendship",
        "may",
        "even",
        "politics",
        "arena",
        "overpowering",
        "happens",
        "commonly",
        "elsewhere",
        "participation",
        "fraught",
        "moral",
        "hazard",
        "requires",
        "exceptional",
        "moral",
        "character",
        "overcome",
        "nonetheless",
        "importance",
        "challenge",
        "dirty",
        "hand",
        "scenario",
        "hand",
        "get",
        "dirty",
        "time",
        "time",
        "right",
        "allow",
        "nonmoral",
        "oughts",
        "sometimes",
        "trump",
        "moral",
        "one",
        "dirty",
        "hand",
        "position",
        "may",
        "restated",
        "holding",
        "circumstance",
        "extremity",
        "reason",
        "necessity",
        "whatever",
        "defeat",
        "important",
        "moral",
        "reason",
        "seems",
        "one",
        "plausible",
        "construal",
        "machiavelli",
        "talk",
        "necessity",
        "ruler",
        "must",
        "learn",
        "good",
        "course",
        "model",
        "christian",
        "morality",
        "mind",
        "call",
        "overriding",
        "may",
        "understood",
        "opposing",
        "one",
        "form",
        "morality",
        "another",
        "good",
        "deal",
        "discussion",
        "treated",
        "elevating",
        "reason",
        "state",
        "morality",
        "rejection",
        "idea",
        "moral",
        "reason",
        "dominate",
        "reason",
        "may",
        "useful",
        "distinguish",
        "dominance",
        "comprehensiveness",
        "moral",
        "theorist",
        "hold",
        "morality",
        "comprehensive",
        "dominant",
        "relevant",
        "decision",
        "relevant",
        "defeat",
        "reason",
        "one",
        "could",
        "however",
        "hold",
        "morality",
        "comprehensive",
        "dominant",
        "dominant",
        "comprehensive",
        "indeed",
        "neither",
        "dominant",
        "comprehensive",
        "present",
        "inquiry",
        "concerned",
        "first",
        "two",
        "option",
        "idea",
        "dominance",
        "comprehensiveness",
        "express",
        "somewhat",
        "different",
        "picture",
        "status",
        "morality",
        "though",
        "exalted",
        "understanding",
        "morality",
        "often",
        "draw",
        "morality",
        "dominance",
        "would",
        "consist",
        "trumping",
        "consideration",
        "whenever",
        "relevant",
        "whereas",
        "morality",
        "comprehensiveness",
        "consists",
        "universally",
        "relevant",
        "whether",
        "trump",
        "consideration",
        "present",
        "interpretation",
        "dirty",
        "hand",
        "theorist",
        "accept",
        "morality",
        "comprehensiveness",
        "least",
        "respect",
        "domain",
        "concerned",
        "reluctantly",
        "reject",
        "dominance",
        "one",
        "class",
        "decision",
        "might",
        "usefully",
        "contrast",
        "position",
        "school",
        "thinker",
        "called",
        "political",
        "realist",
        "whose",
        "outlook",
        "affinity",
        "dirty",
        "hand",
        "theorist",
        "point",
        "two",
        "sometimes",
        "confused",
        "realist",
        "often",
        "viewed",
        "often",
        "present",
        "rejecting",
        "comprehensive",
        "relevance",
        "morality",
        "reference",
        "something",
        "special",
        "politics",
        "international",
        "relation",
        "find",
        "eh",
        "carr",
        "stating",
        "realist",
        "view",
        "ethical",
        "standard",
        "applicable",
        "relation",
        "states",
        "carr",
        "realist",
        "come",
        "close",
        "though",
        "view",
        "clouded",
        "uncertainty",
        "morality",
        "provenance",
        "indeed",
        "carr",
        "arthur",
        "schlesinger",
        "jr",
        "instance",
        "claim",
        "raw",
        "material",
        "foreign",
        "affair",
        "time",
        "morally",
        "neutral",
        "ambiguous",
        "consequence",
        "great",
        "majority",
        "foreignpolicy",
        "transaction",
        "moral",
        "principle",
        "decisive",
        "schlesinger",
        "the",
        "influential",
        "american",
        "realist",
        "han",
        "morgenthau",
        "anxious",
        "separate",
        "politics",
        "morality",
        "maintaining",
        "autonomy",
        "political",
        "sphere",
        "recognises",
        "autonomy",
        "sphere",
        "economics",
        "law",
        "morality",
        "insists",
        "political",
        "realist",
        "must",
        "subordinate",
        "standard",
        "politics",
        "morgenthau",
        "echo",
        "position",
        "german",
        "conservative",
        "thinker",
        "carl",
        "schmitt",
        "clearly",
        "influenced",
        "schmitt",
        "became",
        "embroiled",
        "nazi",
        "party",
        "s",
        "enjoyed",
        "word",
        "fame",
        "time",
        "theoretician",
        "nazi",
        "cause",
        "quotation",
        "suggest",
        "idea",
        "politics",
        "significant",
        "area",
        "international",
        "relation",
        "fall",
        "quite",
        "outside",
        "provenance",
        "morality",
        "thus",
        "denying",
        "morality",
        "comprehensiveness",
        "though",
        "reference",
        "morality",
        "failure",
        "decisive",
        "hint",
        "denial",
        "dominance",
        "many",
        "obscurity",
        "stance",
        "political",
        "realism",
        "place",
        "unravel",
        "spite",
        "ambiguity",
        "pronouncement",
        "leading",
        "theorist",
        "school",
        "spite",
        "continuity",
        "outlook",
        "politics",
        "dirty",
        "hand",
        "theorist",
        "clear",
        "realist",
        "attitude",
        "morality",
        "usually",
        "quite",
        "different",
        "flavour",
        "dirty",
        "hand",
        "theorist",
        "part",
        "captured",
        "difference",
        "denial",
        "comprehensiveness",
        "dominance",
        "connects",
        "fact",
        "realist",
        "reject",
        "moral",
        "consideration",
        "deep",
        "sense",
        "regret",
        "remorse",
        "done",
        "morally",
        "wrong",
        "denial",
        "dominance",
        "preserve",
        "certain",
        "coherence",
        "morality",
        "since",
        "odds",
        "time",
        "context",
        "odds",
        "something",
        "else",
        "following",
        "machiavelli",
        "walzer",
        "might",
        "called",
        "necessity",
        "necessity",
        "clearly",
        "meant",
        "form",
        "deterministic",
        "necessity",
        "since",
        "would",
        "possible",
        "british",
        "leadership",
        "world",
        "war",
        "ii",
        "rejected",
        "policy",
        "city",
        "bombing",
        "outright",
        "declared",
        "policy",
        "prior",
        "war",
        "indicated",
        "would",
        "policy",
        "initial",
        "bombing",
        "practice",
        "indeed",
        "respected",
        "yet",
        "trace",
        "deterministic",
        "thought",
        "idea",
        "supreme",
        "emergency",
        "implication",
        "something",
        "overwhelms",
        "normal",
        "power",
        "morality",
        "might",
        "recall",
        "connection",
        "thomas",
        "hobbes",
        "argument",
        "moral",
        "dictate",
        "apply",
        "would",
        "lead",
        "selfdestruction",
        "hobbes",
        "idea",
        "rationality",
        "selfpreservation",
        "give",
        "rise",
        "morality",
        "make",
        "acting",
        "morality",
        "null",
        "void",
        "acting",
        "would",
        "defy",
        "selfpreservation",
        "hobbes",
        "put",
        "law",
        "nature",
        "oblige",
        "foro",
        "interno",
        "say",
        "bind",
        "desire",
        "take",
        "place",
        "foro",
        "externo",
        "putting",
        "act",
        "always",
        "modest",
        "tractable",
        "perform",
        "promise",
        "time",
        "place",
        "man",
        "else",
        "make",
        "prey",
        "others",
        "procure",
        "certain",
        "ruin",
        "contrary",
        "ground",
        "law",
        "nature",
        "tend",
        "nature",
        "preservation",
        "leviathan",
        "ch",
        "xv",
        "p",
        "hobbes",
        "certainly",
        "paint",
        "totally",
        "isolated",
        "scenario",
        "person",
        "would",
        "obey",
        "moral",
        "law",
        "man",
        "else",
        "and",
        "one",
        "might",
        "wonder",
        "whether",
        "institution",
        "promising",
        "could",
        "even",
        "exist",
        "bleakly",
        "uncooperative",
        "time",
        "place",
        "supposes",
        "presumably",
        "sufficient",
        "number",
        "noncooperators",
        "would",
        "serve",
        "make",
        "one",
        "prey",
        "others",
        "procure",
        "certain",
        "ruin",
        "necessity",
        "avoiding",
        "ruin",
        "motivates",
        "supreme",
        "emergency",
        "story",
        "even",
        "though",
        "collective",
        "rather",
        "individual",
        "ruin",
        "lie",
        "heart",
        "hobbes",
        "exemption",
        "need",
        "practice",
        "morality",
        "rather",
        "desire",
        "operation",
        "make",
        "sense",
        "contractarian",
        "view",
        "morality",
        "connection",
        "moral",
        "obligation",
        "dependent",
        "upon",
        "agreement",
        "even",
        "obligation",
        "world",
        "hardly",
        "anyone",
        "kept",
        "promise",
        "adhered",
        "contract",
        "sense",
        "commitment",
        "would",
        "dissipate",
        "entering",
        "shell",
        "remained",
        "might",
        "folly",
        "indeed",
        "likely",
        "futile",
        "well",
        "many",
        "area",
        "morality",
        "like",
        "even",
        "adherence",
        "moral",
        "imperative",
        "may",
        "perilous",
        "extreme",
        "may",
        "folly",
        "hobbes",
        "comment",
        "make",
        "seem",
        "one",
        "woman",
        "survived",
        "belsen",
        "hanna",
        "levyhaas",
        "record",
        "diary",
        "philosophical",
        "debate",
        "camp",
        "fellow",
        "marxist",
        "professor",
        "k",
        "argued",
        "somewhat",
        "hobbesian",
        "case",
        "embellished",
        "marxist",
        "terminology",
        "morality",
        "apply",
        "camp",
        "superseded",
        "survival",
        "imperative",
        "rejected",
        "argument",
        "required",
        "simply",
        "compromise",
        "enemy",
        "betray",
        "one",
        "principle",
        "deny",
        "spiritual",
        "value",
        "interest",
        "saving",
        "one",
        "skin",
        "levyhaas",
        "comment",
        "indicate",
        "least",
        "idea",
        "total",
        "ruin",
        "open",
        "interpretation",
        "see",
        "abandonment",
        "degrading",
        "moral",
        "integrity",
        "primary",
        "ingredient",
        "ruin",
        "excursion",
        "world",
        "leviathan",
        "nonetheless",
        "help",
        "give",
        "sense",
        "idea",
        "practice",
        "morality",
        "might",
        "suspended",
        "time",
        "hence",
        "morality",
        "moved",
        "aside",
        "external",
        "necessity",
        "thus",
        "help",
        "show",
        "way",
        "dirty",
        "hand",
        "story",
        "might",
        "redeemed",
        "incoherence",
        "even",
        "idea",
        "morality",
        "sometimes",
        "dominated",
        "external",
        "necessity",
        "prof",
        "unacceptable",
        "dirty",
        "hand",
        "position",
        "might",
        "coherent",
        "false",
        "hanna",
        "levyhaas",
        "could",
        "understand",
        "professor",
        "argument",
        "found",
        "reason",
        "reject"
    ]
}