{
    "main_text": "The Scope of Dirty Hands and Some Significant Distinctions\n5. The Scope of Dirty Hands and Some Significant Distinctions\n\nIn his original article on dirty hands, Walzer allows in passing that\nthe phenomenon he is exploring might have a place beyond politics. So,\nhe says: “I don’t want to argue that it is only a\npolitical dilemma. No doubt we can get our hands dirty in private life\nalso, and sometimes, no doubt, we should. But the issue is posed most\ndramatically in politics…” (Walzer 1974, 76). This\nconcession has, however, little influence on his developed position\nwhich is focused wholly on extreme emergency in political contexts.\n(The original article is, after all, called, “Political Action:\nthe Problem of Dirty Hands”.) Other writers have been puzzled by\nthe heavy concentration on politics. Michael Stocker, for one, rejects\nthis restriction (Stocker 2000, 32–3). Stocker also argues that\nthe dirty hands phenomena, though distinctive in various ways, exhibit\nquite common features of moral conflicts more generally, and partly\nfor this reason he thinks there is no logical incoherence in the dirty\nhands story. Stocker argues that what he calls double-counting, i.e.,\ngiving moral weight to impossible oughts, and allowing for\nnon-action-guiding act evaluations, is a central feature of dirty\nhands, but is not restricted to them since they occur “across\nthe board” of moral thinking and deciding.\n\nHowever it should be located, the phenomenon of dirty hands can be\neasily assimilated to that of moral dilemma, but this is an\nassimilation that should be resisted. Someone confronted with a\nsupreme emergency is indeed in what is often colloquially called\n“a moral dilemma” in the sense that she faces a disturbing\nand difficult choice situation, but that does not make it a moral\ndilemma in a philosophically interesting sense. In common parlance all\nsorts of situations that cause initial uncertainty and require hard\nmoral thinking to sort out are called moral dilemmas, as philosophers\nwho teach or consult on business ethics are fully aware. This usage is\nharmless enough, but the philosophical usage of the term points to a\nmore disturbing situation and one that needs to be distinguished from\ndirty hands. Both the categories of dirty hands and moral dilemma\ninvolve agonising choice in which there will be grave moral loss\neither way. The most salient difference between the categories is that\na moral dilemma arises only when the choice is such that neither horn\nis decisively supported by morality, indeed morality speaks equally\nagainst both. (There is a parallel dilemma for non-moral normative\ncontexts, if there be any, where normative reasons speak equally\nagainst doing p or doing not-p.) Whichever way the\nagent chooses, her action is unjustified and there is no question of\none course being more necessary or demanded than the other. By\ncontrast, the dirty hands choice is always dictated as the\n“necessary” course: in the context of political\nemergencies, the community defence always wins the day even over\ninnocent lives. This is the special feature that marks off dirty hands\nfrom moral dilemmas.\n\nA relatively unexplored question concerns whether anything more\ninformative than a reference to “emergency”, supreme or\notherwise, can be provided to illuminate the typical circumstances in\nwhich it is claimed that hands must be dirtied. One line of\nclarification that might be attempted would be to scrutinise more\ncarefully various broad situations in which moral action might be\nespecially under strain in political contexts. A first suggestion\nmight be that politics is essentially a zone of compromise, and it is\nthe pressure of compromise that creates the need for dirty hands. It\nis certainly true that compromise is a pervasive feature of political\nlife, but compromise is hardly unique to politics, nor is it\nnecessarily a pressure for immoral conduct. Indeed, it is arguable\nthat the capacity to compromise is an essential moral ingredient in\nall successful cooperative endeavours, since, apart from its\ninstrumental value, it shows respect for other reasonable participants\nin public action. Nonetheless, compromise clearly has its morally\ndangerous side as indicated by our use of “compromised” to\ncharacterise someone whose principles have been sullied to an extent\nthat makes them untrustworthy. Since a compromise is a sort of bargain\nwhere parties sacrifice some good objectives in order to gain others,\nit raises a question about how far such deals can go, and this brings\nus into dirty hands territory. Another situation, related to our\nearlier discussion of Hobbes, is that of moral isolation. As noted\nthere, the fact that general adherence to morality has to a\nconsiderable degree broken down, might not give as great a\ndispensation from moral constraints as Hobbes supposes, but at least\nit poses starkly the rationale for compliance. A third situation that\nseems relevant here and needs further exploration is that of\nextrication. Politicians, and others, often find themselves in\nsituations where they have inherited, or are otherwise constrained by,\nthe decisions and policies of others (or even their previous selves)\nthat they now judge unwise or even gravely immoral. So, for example,\nthey may seek to end an unjust war to which their predecessors have\ncommitted the nation, but immediate cessation and withdrawal may not\nbe desirable from several perspectives, including a moral point of\nview. They may very well think that the best extrication strategy\nrequires a temporary continuation of the war, unjust as it is, with a\nview to a withdrawal that better secures the rights of innocent people\nand makes the withdrawal politically possible. Obviously, what such\nsituations might allow in terms of continued immorality needs to be\nspelled out in more detail than space allows here, but equally, it\nseems clear that there is a potential for dirty hands discussion that\nmoves fruitfully beyond the often-vague generalities of\n“emergency” or “extremity”.\n\nSome recent discussions that are relevant to dirty hands problems are\nconcerned with what Cécile Fabre has called “second best”\nmoral justifications. In her book on the ethics of spying she argues\nthat although spying activities can involve acts generally considered\nas morally wrong, such as blackmail, unwanted covert surveillance, and\neven treachery or treason, a resort to acts such as these can be\nmorally justified in some contexts of gathering intelligence in a just\ncause. She qualifies this, however, in various ways including\ndisqualifying such resorts when the cause for which the spying is\nundertaken is unjust. So, when discussing espionage activities by a\nnation and its agents to discover important secrets of another nation\nthat they have unjust designs upon, such as waging an immoral war, she\nfirmly denies such a nation the right to use those activities. If, for\nexample, a nation A is planning an unjust war against\nnation B it would be morally unjustified in spying on a\nsuspected cyber facility of B’s with a view to\ndestroying it, even if the facility is likely to be used\nagainst A (either as a pre-emption or in a later\nretaliation). Yet even here, A may be “second\nbest” morally justified, indeed even have a moral duty, in\nundertaking such spying where it might lead to discovering that the\nfacility is a civilian one and morally should not be targeted. That\nA’s spying reveals the facility to be civilian and\nthus A refrains from attacking it is a sort of moral plus in\nits overall dark moral position in the matter. Fabre insists,\ntherefore, that this second best moral justification allows A\nto proceed but leaves a “moral taint”\non A’s action since it shouldn’t be undertaking\nspying on Green at all in pursuit of an unjust intervention. This\nmoral taint is a clear echo of the dirty hands story. \n\nAnother discussion with such an echo occurs in Tadros 2020, which\nendorses participating in a war that you know to be unjust in order to\nensure that the war is fought with greater restraint (p. 55). Tadros\nmakes no mention of “moral taint” and may see the choice\nas morally straightforward if unusual. It seems possible, however, to\nsee it as involving dirty hands and the “moral taint” of\nparticipating in an unjust war, even for achieving some amelioration\nof the injustice. Either way, a difficulty with the position is that\nit’s hard to see how an individual enlisting in such a war could\nseriously imagine that they could have such an effect in a way that is\nremotely proportional to the extensive moral violations their\ninvolvement requires them to commit or condone, especially given the\nhighly authoritarian structures of armed forces. Those structures mean\nthat the individual would be under regular extreme pressure to kill\nenemy soldiers he has no moral right to harm, as well as the highly\nlikely possibility of similar pressure to kill enemy civilians either\ndirectly or indirectly. Of course, the story might be different if the\nindividual were conscripted to fight in an unjust war and made the\nsecond best of it by doing what they could to minimise the harms they,\nand others, did. This could also come under the heading of extrication\nmorality if they also aimed to extricate themselves by, for instance,\nseeking opportunities to desert.\n\nThe discussion of extrication raises another point about dirty hands\nthat is seldom addressed. Dirty Hands scenarios are often constructed\nvery specifically as giving the agent narrow choices restricted by\nexternal circumstances over which she has no present control. The\nspecific scenario is often then generalised as though those external\ncircumstances, or ones very like them, are immutable for an agent with\nthat sort of background (e.g., a politician). This is, however,, too\nstatic and inflexible a view of moral contexts, roles and agent\ncapacities. In the extrication story discussed earlier, the\npolitician’s “necessary immorality” is forced upon\nher by the circumstances she has created or inherited, but the point\nof invoking extrication morality within the dirty hands problematic is\nto insist on possibilities of temporary involvement in evil and the\nneed to change the circumstances that require such involvement. The\nruler bent on extrication must persist in waging an unjust war only\nbecause at that time there is no other way that she can end the war by\nchanging the context. But this restriction should be seen here and in\nother dirty hands situations as creating a moral imperative for the\nagent or others to change the background against which the moral\ncrisis has arisen so that similar situations are unlikely to recur. In\nthe unjust war example, the politician might use eventual success in\nending the war to change colonial or neo-colonial policies that fed\nthe resort to war, to remove over-belligerent personnel from the\ndefence establishment, rethink alliances that played a part in\npromoting the unjust war, and so on. Courage, imagination and luck may\nbe needed to realise the relevant possibilities, but without making\nefforts at relevant changes, the agent’s appeal to necessity\nwhen invoking the dirty hands plea should ring hollow.\n",
    "section_title": "5. The Scope of Dirty Hands and Some Significant Distinctions",
    "entry_title": "The Problem of Dirty Hands",
    "hierarchy_title": "The Problem of Dirty Hands || The Scope of Dirty Hands and Some Significant Distinctions",
    "tokenized_text": [
        "scope",
        "dirty",
        "hand",
        "significant",
        "distinction",
        "scope",
        "dirty",
        "hand",
        "significant",
        "distinction",
        "original",
        "article",
        "dirty",
        "hand",
        "walzer",
        "allows",
        "passing",
        "phenomenon",
        "exploring",
        "might",
        "place",
        "beyond",
        "politics",
        "say",
        "want",
        "argue",
        "political",
        "dilemma",
        "doubt",
        "get",
        "hand",
        "dirty",
        "private",
        "life",
        "also",
        "sometimes",
        "doubt",
        "issue",
        "posed",
        "dramatically",
        "politics",
        "walzer",
        "concession",
        "however",
        "little",
        "influence",
        "developed",
        "position",
        "focused",
        "wholly",
        "extreme",
        "emergency",
        "political",
        "context",
        "original",
        "article",
        "called",
        "political",
        "action",
        "problem",
        "dirty",
        "hand",
        "writer",
        "puzzled",
        "heavy",
        "concentration",
        "politics",
        "michael",
        "stocker",
        "one",
        "reject",
        "restriction",
        "stocker",
        "stocker",
        "also",
        "argues",
        "dirty",
        "hand",
        "phenomenon",
        "though",
        "distinctive",
        "various",
        "way",
        "exhibit",
        "quite",
        "common",
        "feature",
        "moral",
        "conflict",
        "generally",
        "partly",
        "reason",
        "think",
        "logical",
        "incoherence",
        "dirty",
        "hand",
        "story",
        "stocker",
        "argues",
        "call",
        "doublecounting",
        "ie",
        "giving",
        "moral",
        "weight",
        "impossible",
        "oughts",
        "allowing",
        "nonactionguiding",
        "act",
        "evaluation",
        "central",
        "feature",
        "dirty",
        "hand",
        "restricted",
        "since",
        "occur",
        "across",
        "board",
        "moral",
        "thinking",
        "deciding",
        "however",
        "located",
        "phenomenon",
        "dirty",
        "hand",
        "easily",
        "assimilated",
        "moral",
        "dilemma",
        "assimilation",
        "resisted",
        "someone",
        "confronted",
        "supreme",
        "emergency",
        "indeed",
        "often",
        "colloquially",
        "called",
        "moral",
        "dilemma",
        "sense",
        "face",
        "disturbing",
        "difficult",
        "choice",
        "situation",
        "make",
        "moral",
        "dilemma",
        "philosophically",
        "interesting",
        "sense",
        "common",
        "parlance",
        "sort",
        "situation",
        "cause",
        "initial",
        "uncertainty",
        "require",
        "hard",
        "moral",
        "thinking",
        "sort",
        "called",
        "moral",
        "dilemma",
        "philosopher",
        "teach",
        "consult",
        "business",
        "ethic",
        "fully",
        "aware",
        "usage",
        "harmless",
        "enough",
        "philosophical",
        "usage",
        "term",
        "point",
        "disturbing",
        "situation",
        "one",
        "need",
        "distinguished",
        "dirty",
        "hand",
        "category",
        "dirty",
        "hand",
        "moral",
        "dilemma",
        "involve",
        "agonising",
        "choice",
        "grave",
        "moral",
        "loss",
        "either",
        "way",
        "salient",
        "difference",
        "category",
        "moral",
        "dilemma",
        "arises",
        "choice",
        "neither",
        "horn",
        "decisively",
        "supported",
        "morality",
        "indeed",
        "morality",
        "speaks",
        "equally",
        "parallel",
        "dilemma",
        "nonmoral",
        "normative",
        "context",
        "normative",
        "reason",
        "speak",
        "equally",
        "p",
        "notp",
        "whichever",
        "way",
        "agent",
        "chooses",
        "action",
        "unjustified",
        "question",
        "one",
        "course",
        "necessary",
        "demanded",
        "contrast",
        "dirty",
        "hand",
        "choice",
        "always",
        "dictated",
        "necessary",
        "course",
        "context",
        "political",
        "emergency",
        "community",
        "defence",
        "always",
        "win",
        "day",
        "even",
        "innocent",
        "life",
        "special",
        "feature",
        "mark",
        "dirty",
        "hand",
        "moral",
        "dilemma",
        "relatively",
        "unexplored",
        "question",
        "concern",
        "whether",
        "anything",
        "informative",
        "reference",
        "emergency",
        "supreme",
        "otherwise",
        "provided",
        "illuminate",
        "typical",
        "circumstance",
        "claimed",
        "hand",
        "must",
        "dirtied",
        "one",
        "line",
        "clarification",
        "might",
        "attempted",
        "would",
        "scrutinise",
        "carefully",
        "various",
        "broad",
        "situation",
        "moral",
        "action",
        "might",
        "especially",
        "strain",
        "political",
        "context",
        "first",
        "suggestion",
        "might",
        "politics",
        "essentially",
        "zone",
        "compromise",
        "pressure",
        "compromise",
        "creates",
        "need",
        "dirty",
        "hand",
        "certainly",
        "true",
        "compromise",
        "pervasive",
        "feature",
        "political",
        "life",
        "compromise",
        "hardly",
        "unique",
        "politics",
        "necessarily",
        "pressure",
        "immoral",
        "conduct",
        "indeed",
        "arguable",
        "capacity",
        "compromise",
        "essential",
        "moral",
        "ingredient",
        "successful",
        "cooperative",
        "endeavour",
        "since",
        "apart",
        "instrumental",
        "value",
        "show",
        "respect",
        "reasonable",
        "participant",
        "public",
        "action",
        "nonetheless",
        "compromise",
        "clearly",
        "morally",
        "dangerous",
        "side",
        "indicated",
        "use",
        "compromised",
        "characterise",
        "someone",
        "whose",
        "principle",
        "sullied",
        "extent",
        "make",
        "untrustworthy",
        "since",
        "compromise",
        "sort",
        "bargain",
        "party",
        "sacrifice",
        "good",
        "objective",
        "order",
        "gain",
        "others",
        "raise",
        "question",
        "far",
        "deal",
        "go",
        "brings",
        "u",
        "dirty",
        "hand",
        "territory",
        "another",
        "situation",
        "related",
        "earlier",
        "discussion",
        "hobbes",
        "moral",
        "isolation",
        "noted",
        "fact",
        "general",
        "adherence",
        "morality",
        "considerable",
        "degree",
        "broken",
        "might",
        "give",
        "great",
        "dispensation",
        "moral",
        "constraint",
        "hobbes",
        "supposes",
        "least",
        "pose",
        "starkly",
        "rationale",
        "compliance",
        "third",
        "situation",
        "seems",
        "relevant",
        "need",
        "exploration",
        "extrication",
        "politician",
        "others",
        "often",
        "find",
        "situation",
        "inherited",
        "otherwise",
        "constrained",
        "decision",
        "policy",
        "others",
        "even",
        "previous",
        "self",
        "judge",
        "unwise",
        "even",
        "gravely",
        "immoral",
        "example",
        "may",
        "seek",
        "end",
        "unjust",
        "war",
        "predecessor",
        "committed",
        "nation",
        "immediate",
        "cessation",
        "withdrawal",
        "may",
        "desirable",
        "several",
        "perspective",
        "including",
        "moral",
        "point",
        "view",
        "may",
        "well",
        "think",
        "best",
        "extrication",
        "strategy",
        "requires",
        "temporary",
        "continuation",
        "war",
        "unjust",
        "view",
        "withdrawal",
        "better",
        "secures",
        "right",
        "innocent",
        "people",
        "make",
        "withdrawal",
        "politically",
        "possible",
        "obviously",
        "situation",
        "might",
        "allow",
        "term",
        "continued",
        "immorality",
        "need",
        "spelled",
        "detail",
        "space",
        "allows",
        "equally",
        "seems",
        "clear",
        "potential",
        "dirty",
        "hand",
        "discussion",
        "move",
        "fruitfully",
        "beyond",
        "oftenvague",
        "generality",
        "emergency",
        "extremity",
        "recent",
        "discussion",
        "relevant",
        "dirty",
        "hand",
        "problem",
        "concerned",
        "cécile",
        "fabre",
        "called",
        "second",
        "best",
        "moral",
        "justification",
        "book",
        "ethic",
        "spying",
        "argues",
        "although",
        "spying",
        "activity",
        "involve",
        "act",
        "generally",
        "considered",
        "morally",
        "wrong",
        "blackmail",
        "unwanted",
        "covert",
        "surveillance",
        "even",
        "treachery",
        "treason",
        "resort",
        "act",
        "morally",
        "justified",
        "context",
        "gathering",
        "intelligence",
        "cause",
        "qualifies",
        "however",
        "various",
        "way",
        "including",
        "disqualifying",
        "resort",
        "cause",
        "spying",
        "undertaken",
        "unjust",
        "discussing",
        "espionage",
        "activity",
        "nation",
        "agent",
        "discover",
        "important",
        "secret",
        "another",
        "nation",
        "unjust",
        "design",
        "upon",
        "waging",
        "immoral",
        "war",
        "firmly",
        "denies",
        "nation",
        "right",
        "use",
        "activity",
        "example",
        "nation",
        "planning",
        "unjust",
        "war",
        "nation",
        "b",
        "would",
        "morally",
        "unjustified",
        "spying",
        "suspected",
        "cyber",
        "facility",
        "b",
        "view",
        "destroying",
        "even",
        "facility",
        "likely",
        "used",
        "either",
        "preemption",
        "later",
        "retaliation",
        "yet",
        "even",
        "may",
        "second",
        "best",
        "morally",
        "justified",
        "indeed",
        "even",
        "moral",
        "duty",
        "undertaking",
        "spying",
        "might",
        "lead",
        "discovering",
        "facility",
        "civilian",
        "one",
        "morally",
        "targeted",
        "spying",
        "reveals",
        "facility",
        "civilian",
        "thus",
        "refrain",
        "attacking",
        "sort",
        "moral",
        "plus",
        "overall",
        "dark",
        "moral",
        "position",
        "matter",
        "fabre",
        "insists",
        "therefore",
        "second",
        "best",
        "moral",
        "justification",
        "allows",
        "proceed",
        "leaf",
        "moral",
        "taint",
        "action",
        "since",
        "undertaking",
        "spying",
        "green",
        "pursuit",
        "unjust",
        "intervention",
        "moral",
        "taint",
        "clear",
        "echo",
        "dirty",
        "hand",
        "story",
        "another",
        "discussion",
        "echo",
        "occurs",
        "tadros",
        "endorses",
        "participating",
        "war",
        "know",
        "unjust",
        "order",
        "ensure",
        "war",
        "fought",
        "greater",
        "restraint",
        "p",
        "tadros",
        "make",
        "mention",
        "moral",
        "taint",
        "may",
        "see",
        "choice",
        "morally",
        "straightforward",
        "unusual",
        "seems",
        "possible",
        "however",
        "see",
        "involving",
        "dirty",
        "hand",
        "moral",
        "taint",
        "participating",
        "unjust",
        "war",
        "even",
        "achieving",
        "amelioration",
        "injustice",
        "either",
        "way",
        "difficulty",
        "position",
        "hard",
        "see",
        "individual",
        "enlisting",
        "war",
        "could",
        "seriously",
        "imagine",
        "could",
        "effect",
        "way",
        "remotely",
        "proportional",
        "extensive",
        "moral",
        "violation",
        "involvement",
        "requires",
        "commit",
        "condone",
        "especially",
        "given",
        "highly",
        "authoritarian",
        "structure",
        "armed",
        "force",
        "structure",
        "mean",
        "individual",
        "would",
        "regular",
        "extreme",
        "pressure",
        "kill",
        "enemy",
        "soldier",
        "moral",
        "right",
        "harm",
        "well",
        "highly",
        "likely",
        "possibility",
        "similar",
        "pressure",
        "kill",
        "enemy",
        "civilian",
        "either",
        "directly",
        "indirectly",
        "course",
        "story",
        "might",
        "different",
        "individual",
        "conscripted",
        "fight",
        "unjust",
        "war",
        "made",
        "second",
        "best",
        "could",
        "minimise",
        "harm",
        "others",
        "could",
        "also",
        "come",
        "heading",
        "extrication",
        "morality",
        "also",
        "aimed",
        "extricate",
        "instance",
        "seeking",
        "opportunity",
        "desert",
        "discussion",
        "extrication",
        "raise",
        "another",
        "point",
        "dirty",
        "hand",
        "seldom",
        "addressed",
        "dirty",
        "hand",
        "scenario",
        "often",
        "constructed",
        "specifically",
        "giving",
        "agent",
        "narrow",
        "choice",
        "restricted",
        "external",
        "circumstance",
        "present",
        "control",
        "specific",
        "scenario",
        "often",
        "generalised",
        "though",
        "external",
        "circumstance",
        "one",
        "like",
        "immutable",
        "agent",
        "sort",
        "background",
        "eg",
        "politician",
        "however",
        "static",
        "inflexible",
        "view",
        "moral",
        "context",
        "role",
        "agent",
        "capacity",
        "extrication",
        "story",
        "discussed",
        "earlier",
        "politician",
        "necessary",
        "immorality",
        "forced",
        "upon",
        "circumstance",
        "created",
        "inherited",
        "point",
        "invoking",
        "extrication",
        "morality",
        "within",
        "dirty",
        "hand",
        "problematic",
        "insist",
        "possibility",
        "temporary",
        "involvement",
        "evil",
        "need",
        "change",
        "circumstance",
        "require",
        "involvement",
        "ruler",
        "bent",
        "extrication",
        "must",
        "persist",
        "waging",
        "unjust",
        "war",
        "time",
        "way",
        "end",
        "war",
        "changing",
        "context",
        "restriction",
        "seen",
        "dirty",
        "hand",
        "situation",
        "creating",
        "moral",
        "imperative",
        "agent",
        "others",
        "change",
        "background",
        "moral",
        "crisis",
        "arisen",
        "similar",
        "situation",
        "unlikely",
        "recur",
        "unjust",
        "war",
        "example",
        "politician",
        "might",
        "use",
        "eventual",
        "success",
        "ending",
        "war",
        "change",
        "colonial",
        "neocolonial",
        "policy",
        "fed",
        "resort",
        "war",
        "remove",
        "overbelligerent",
        "personnel",
        "defence",
        "establishment",
        "rethink",
        "alliance",
        "played",
        "part",
        "promoting",
        "unjust",
        "war",
        "courage",
        "imagination",
        "luck",
        "may",
        "needed",
        "realise",
        "relevant",
        "possibility",
        "without",
        "making",
        "effort",
        "relevant",
        "change",
        "agent",
        "appeal",
        "necessity",
        "invoking",
        "dirty",
        "hand",
        "plea",
        "ring",
        "hollow"
    ]
}