{
    "main_text": "Categoricalism, Dispositionalism, and Laws of Nature\n3. Categoricalism, Dispositionalism, and Laws of Nature\n\nIn contemporary metaphysics, a surging number of philosophers express\ntheir allegiance to dispositional essentialism, the position that at\nleast some properties have dispositional essences.\nSome of them go beyond this to take a stronger position,\nthat all suitably qualified properties are\nessentially dispositional (Popper 1959; Harré 1970;\nHarré & Madden 1975; Shoemaker 1980; Mumford 2004; Bird\n2005b, 2007a; Chakravartty 2007; Whittle 2008; Tugby 2013, 2014; Yates\nforthcoming; For the most up-to-date exposition of this view, see Bird\n2016). This position is known as dispositional monism or causal theory\nof properties. Alternatively it is simply named\n‘dispositionalism’. The strongest version of\ndispositionalism is pan-dispositionalism which says that all\nproperties in the broadest sense of ‘property’ have\ndispositional essences. But many philosophers hold a more nuanced\nposition like Bird’s pure power theory which says that all sparse\nproperties in Lewis (1986)’s sense—or, in Bird’s own terms, all\nfundamental ontic properties—have dispositional essences.\n\nThe dispositionalist holds that the essence of a property \\(P\\) is\nwholly constituted by the nomic or causal roles \\(P\\) plays—for\nshort, theoretical roles. Here the nomic role of \\(P\\) is given in\nterms of the Ramsey sentence that we can get from a true and complete\nfinal theory, a sentence that represents the totality of the factual\ncontent of the theory. The causal role of \\(P\\), on the other hand, is\ngiven in terms of its potential causes and effects.  Dispositionalism\nthus implies the following transworld identity condition for\nproperties: properties \\(P\\) and \\(Q\\) are identical iff they play the\nsame theoretical roles. (This identity condition smacks of circularity\nsince theoretical roles can be plausibly considered as high-order\ndispositional properties. This issue is discussed in detail in \n Appendix.)\nNote that the theoretical roles played by a property \\(P\\) determine\nhow its instances are disposed to act or react under various\ncircumstances. On dispositionalism, therefore, \\(P\\) invariably endows\nits instances with the same dispositions, in which sense\ndispositionalism implies that properties have dispositional\nessences—and only dispositional essences.\n\nThe main impetus behind dispositionalism is the discontent\nphilosophers have with the categoricalist’s doctrine that the essence\nof a property doesn’t have to do with what its instances are disposed\nto do under various circumstances. Categoricalism—also known as\ncategorical monism—is the position that all properties, or at\nleast all sparse properties are categorical properties, which serves\nto underpin the traditional Humean metaphysic that asserts that worlds\ncan be characterised in terms of their complete histories of\ninstantiations of categorical properties (Lewis\n1986, p. 162; Mumford 2006, p. 471; Williams 2011).\n\nA famous argument for categoricalism due to Armstrong (1997, p. 79) is\nthat dispositions are Meinongian—or, in\nHandfield’s (2005) terms, dispositions are modally inverted. Suppose\nthat a fragile glass \\(x\\) doesn’t break.\nBut \\(x\\) is fragile inasmuch as it would break in\nresponse to being struck under suitable conditions. If\nso, \\(x\\)’s being fragile has within itself, essentially, an\nimplicit reference to the manifestation, namely, the event of\nbreaking, that didn’t occur. That is, it points to an entirely\ncounterfactual state of affair, in which sense the\nproperty of fragility is at least partly ‘hypothetical’.\nArmstrong takes it that this consequence is a version of\nMeinongianism, a metaphysical position that accepts an overly generous\nontology including non-existent entities, which he finds obnoxious\n(see Handfield 2008a for an attempt to get around this objection).\nArmstrong goes on to offer what he calls an irenic or soft\ndeflationist doctrine of dispositional properties. On this view, we\ncan account for the truth-makers of disposition ascriptions in terms\nof categorical properties and laws of nature. Thus understood, to say\nthat \\(x\\) is fragile is not to ascribe a real property\nto \\(x\\). Rather, it is an abbreviated way of saying that,\ngiven laws of nature, from \\(x\\)’s being struck, we can\ninfer that \\(x\\) would break. On Armstrong’s view, we do not\nuse dispositional terms to describe irreducibly dispositional states\nof affairs. Rather, they are merely convenient ways of talking\nabout categorical properties.\n\nArmstrong implicitly assumes that categorical properties are\nnon-Meinongian. This brings under the spotlight the question of how to\ncharacterise the essences of categorical properties in a way that\nrenders them non-Meinongian. Towards this end, most categoricalists\nincluding Armstrong subscribe to quidditism, according\nto which the essence of a property is constituted by its internal or\nself-contained nature, that is, what is called quiddity,\nthat is only contingently related to the specific theoretical roles it\nplays (Armstrong 1989, 1997; Lewis 2009). (Despite this move,\nHandfield (2005) criticises, Armstrong is still susceptible to the\n‘Meinongianism objection’ as his nomic necessitation\nrelation \\(N\\) is constituted by a relation\nto counterfactual states of affairs.) Armstrong\n(1997, p. 80) thus says, ‘properties are self-contained things,\nkeeping themselves to themselves, not pointing beyond themselves to\nfurther effects brought about in virtue of such properties’.\nThen what exactly is this internal or self-contained nature? Given\nthat theoretical roles are ruled out as being merely contingently\nrelated to it, there seems to be very little to be said about it. Thus\nBlack (2000, p. 91) says that, according to Lewis who accepts\nquidditism, ‘Just about all there is to a Humean fundamental\nquality is its identity with itself and its distinctness from other\nqualities’. On quidditism, the essence of a property\nputs no constraint whatsoever on how its instances\nare disposed to act or react under various circumstances. This is why\nquidditism goes along with categoricalism which asserts that\nproperties have no dispositional essences.\n\nQuidditism is to properties what haecceitism is to individuals.\nHaecceitism famously implies a theory\nof primitive identity of individuals across\npossible worlds. Likewise, quidditism implies a theory\nof primitive transworld identity of properties\nwhich asserts that two properties are identical iff they are\nquiddistically the same, regardless of their theoretical roles (Black\n2000; Whittle 2006; Lewis 2009). This being the case, a property could\nconfer upon its instances completely different causal or nomic powers\nthan it actually does but nonetheless continue to be the same property\nas it actually is so long as it remains quiddistically the same. The\ncausal or nomic profile of a property is thus a merely contingent\nmatter. (Schaffer (2005) points out that this\n‘contingentism’ is not necessarily paired with quidditism:\n‘anti-quiddistic contingentism’ is a respectable\nposition.)\n\nQuidditism therefore implies that laws of nature\nare metaphysically contingent, for, for any class of\nproperties, there seems to be nothing standing in the way of either\nthe possibility that they are bound up with each other by laws of\nnature or the possibility that they are not related at all to each\nother by any laws of nature. A consequence of quidditism is therefore\nthat although, for instance, colour properties and mass properties are\nnot actually linked with each other by any laws, they could have been\nso linked. Laws of nature are therefore a contingent matter. Some\nquidditists may go further to say that laws of nature are a type of\nregularity among property instances (Ramsey 1978; Lewis 1973; Earman\n1984). Others may suggest that laws of nature are nomic necessitation\nrelations between universals (Armstrong 1983; Dretske 1977; Tooley\n1977).\n\nDispositionalism is a stark contrast to categoricalism, maintaining\nthat all properties have dispositional essences. The dispositionalist\ncharges that the categoricalist’s appeal to the internal or\nself-contained nature of a property as its essence\nis unintelligible unless it is somehow related to\nthe causal or nomic powers of its instances. On dispositionalism, as\nnoted earlier, a given property endows all of its instances with the\nsame dispositions, no matter what circumstances they are situated in.\nDispositionalism then necessitates a diametrically opposing view of\nlaws of nature to the one necessitated by categoricalism—more\nto the point, the one necessitated by quidditism. Because the property\nof being negatively charged has the essence characterised in terms of\nthe disposition to attract positively charged particles and repel\nnegatively charged particles, on dispositionalism, all negatively\ncharged particles are necessarily so disposed. This entails that\nCoulomb’s law, which describes how charged particles interact with one\nanother, is metaphysically necessary (see Corry 2011 for\na criticism of this reasoning). In general, the dispositionalist\ntypically maintains what Hildebrand (2014) calls ‘Descriptive\nNon-Humeanism’, the view that laws of nature are just universal\ndescriptions of dispositional essences of properties; and they are\nmetaphysically necessary because their truth is ensured by the\ndispositional essences of relevant properties in all the possible\nworlds where those relevant properties exist. (This point is made by\nSwoyer (1982), Ellis (2001), Kistler (2002), and Bird (2005a, 2007a);\nsee Mumford 2004 for the claim that dispositionalism obviates the need\nfor laws and see Bird 2007a, chapter 9 for a criticism of this claim;\nsee Chalmers 1999 and Fine 2002 for the claim that some of natural\nnecessities, e.g., conservation laws, cannot be accounted for by\ndispositionalism.) Dispositionalism is hoped to provide a\ncomprehensive and unified metaphysical grounding for natural\nmodalities in general that may serve as an alternative to Humeanism.\nFor some attempts at it, see Williams & Borghini 2008, Martin\n2008, Jacobs 2010. Handfield (2008a) does not take dispositionalism\nand Humeanism as incompatible and explores the possibility of\ncombining them to construct what he calls ‘Humean\ndispositionalism’. Simpson (2017), however, criticises this combination as being half-baked.\n\nCategoricalism and dispositionalism are two extremes of a large\nspectrum of possible positions on the essences of properties. For\ninstance, philosophers like Swoyer (1982), Ellis & Lierse (1994),\nEllis (1999, 2001, 2010), and Molnar (2003) maintain that some\nproperties are essentially dispositional but others, most notably\nspatio-temporal properties, are not, in which sense they are\ndispositional essentialists but not dispositionalists. Another\nalternative that has lately gained considerable ground is what is\ncalled the ‘powerful qualities view’. The view is that\nevery property is in some sense both dispositional and qualitative\n(Here ‘qualitative’ is used interchangeably with\n‘categorical’). It was pioneered by Martin and Heil\n(Armstrong, Martin & Place 1996; Martin 1997; Martin & Heil\n1999; Heil 2003, 2005) and further developed by Engelhard (2010),\nJacobs (2011), Ingthorsson (2013), Carruth (2016), and Taylor\n(2018a, 2018b). A big challenge for this view is to\ngive a satisfactory account of exactly how one and the same property\nis both dispositional and qualitative (Armstrong 2005). A popular\nresponse to this challenge is that “the qualitative and\ndispositional are identical with one another and with the unitary\nintrinsic property itself” (Martin 2008, p. 65). However, given\nthat there is a strong inclination to think that the dispositional\nnature of a property is distinct from, if not incompatible with, its\nqualitative nature, there is no doubt that more details are needed in\norder to render this view a fully respectable competitor. Some\nattempts at it have been made by Jacobs (2011), Ingthorsson (2013),\nand Taylor (2018b).\n\nNotwithstanding this profusion of possible positions to be taken,\nhowever, categoricalism and dispositionalism have been the focus of\ndiscussion in the literature. For some of the criticisms and arguments\ndispositionalists and categoricalists have traded, see the \n\nAppendix on Quiddistically Different Worlds, Irremediable Ignorance, and Regress of Powers.\n \n",
    "section_title": "3. Categoricalism, Dispositionalism, and Laws of Nature",
    "entry_title": "Dispositions",
    "hierarchy_title": "Dispositions || Categoricalism, Dispositionalism, and Laws of Nature",
    "tokenized_text": [
        "categoricalism",
        "dispositionalism",
        "law",
        "nature",
        "categoricalism",
        "dispositionalism",
        "law",
        "nature",
        "contemporary",
        "metaphysics",
        "surging",
        "number",
        "philosopher",
        "express",
        "allegiance",
        "dispositional",
        "essentialism",
        "position",
        "least",
        "property",
        "dispositional",
        "essence",
        "go",
        "beyond",
        "take",
        "stronger",
        "position",
        "suitably",
        "qualified",
        "property",
        "essentially",
        "dispositional",
        "popper",
        "harré",
        "harré",
        "madden",
        "shoemaker",
        "mumford",
        "bird",
        "b",
        "a",
        "chakravartty",
        "whittle",
        "tugby",
        "yates",
        "forthcoming",
        "uptodate",
        "exposition",
        "view",
        "see",
        "bird",
        "position",
        "known",
        "dispositional",
        "monism",
        "causal",
        "theory",
        "property",
        "alternatively",
        "simply",
        "named",
        "dispositionalism",
        "strongest",
        "version",
        "dispositionalism",
        "pandispositionalism",
        "say",
        "property",
        "broadest",
        "sense",
        "property",
        "dispositional",
        "essence",
        "many",
        "philosopher",
        "hold",
        "nuanced",
        "position",
        "like",
        "bird",
        "pure",
        "power",
        "theory",
        "say",
        "sparse",
        "property",
        "lewis",
        "senseor",
        "bird",
        "term",
        "fundamental",
        "ontic",
        "propertieshave",
        "dispositional",
        "essence",
        "dispositionalist",
        "hold",
        "essence",
        "property",
        "p",
        "wholly",
        "constituted",
        "nomic",
        "causal",
        "role",
        "p",
        "playsfor",
        "short",
        "theoretical",
        "role",
        "nomic",
        "role",
        "p",
        "given",
        "term",
        "ramsey",
        "sentence",
        "get",
        "true",
        "complete",
        "final",
        "theory",
        "sentence",
        "represents",
        "totality",
        "factual",
        "content",
        "theory",
        "causal",
        "role",
        "p",
        "hand",
        "given",
        "term",
        "potential",
        "cause",
        "effect",
        "dispositionalism",
        "thus",
        "implies",
        "following",
        "transworld",
        "identity",
        "condition",
        "property",
        "property",
        "p",
        "q",
        "identical",
        "iff",
        "play",
        "theoretical",
        "role",
        "identity",
        "condition",
        "smack",
        "circularity",
        "since",
        "theoretical",
        "role",
        "plausibly",
        "considered",
        "highorder",
        "dispositional",
        "property",
        "issue",
        "discussed",
        "detail",
        "appendix",
        "note",
        "theoretical",
        "role",
        "played",
        "property",
        "p",
        "determine",
        "instance",
        "disposed",
        "act",
        "react",
        "various",
        "circumstance",
        "dispositionalism",
        "therefore",
        "p",
        "invariably",
        "endows",
        "instance",
        "disposition",
        "sense",
        "dispositionalism",
        "implies",
        "property",
        "dispositional",
        "essencesand",
        "dispositional",
        "essence",
        "main",
        "impetus",
        "behind",
        "dispositionalism",
        "discontent",
        "philosopher",
        "categoricalist",
        "doctrine",
        "essence",
        "property",
        "instance",
        "disposed",
        "various",
        "circumstance",
        "categoricalismalso",
        "known",
        "categorical",
        "monismis",
        "position",
        "property",
        "least",
        "sparse",
        "property",
        "categorical",
        "property",
        "serf",
        "underpin",
        "traditional",
        "humean",
        "metaphysic",
        "asserts",
        "world",
        "characterised",
        "term",
        "complete",
        "history",
        "instantiation",
        "categorical",
        "property",
        "lewis",
        "p",
        "mumford",
        "p",
        "williams",
        "famous",
        "argument",
        "categoricalism",
        "due",
        "armstrong",
        "p",
        "disposition",
        "meinongianor",
        "handfield",
        "term",
        "disposition",
        "modally",
        "inverted",
        "suppose",
        "fragile",
        "glass",
        "x",
        "break",
        "x",
        "fragile",
        "inasmuch",
        "would",
        "break",
        "response",
        "struck",
        "suitable",
        "condition",
        "x",
        "fragile",
        "within",
        "essentially",
        "implicit",
        "reference",
        "manifestation",
        "namely",
        "event",
        "breaking",
        "occur",
        "point",
        "entirely",
        "counterfactual",
        "state",
        "affair",
        "sense",
        "property",
        "fragility",
        "least",
        "partly",
        "hypothetical",
        "armstrong",
        "take",
        "consequence",
        "version",
        "meinongianism",
        "metaphysical",
        "position",
        "accepts",
        "overly",
        "generous",
        "ontology",
        "including",
        "nonexistent",
        "entity",
        "find",
        "obnoxious",
        "see",
        "handfield",
        "a",
        "attempt",
        "get",
        "around",
        "objection",
        "armstrong",
        "go",
        "offer",
        "call",
        "irenic",
        "soft",
        "deflationist",
        "doctrine",
        "dispositional",
        "property",
        "view",
        "account",
        "truthmakers",
        "disposition",
        "ascription",
        "term",
        "categorical",
        "property",
        "law",
        "nature",
        "thus",
        "understood",
        "say",
        "x",
        "fragile",
        "ascribe",
        "real",
        "property",
        "x",
        "rather",
        "abbreviated",
        "way",
        "saying",
        "given",
        "law",
        "nature",
        "x",
        "struck",
        "infer",
        "x",
        "would",
        "break",
        "armstrong",
        "view",
        "use",
        "dispositional",
        "term",
        "describe",
        "irreducibly",
        "dispositional",
        "state",
        "affair",
        "rather",
        "merely",
        "convenient",
        "way",
        "talking",
        "categorical",
        "property",
        "armstrong",
        "implicitly",
        "assumes",
        "categorical",
        "property",
        "nonmeinongian",
        "brings",
        "spotlight",
        "question",
        "characterise",
        "essence",
        "categorical",
        "property",
        "way",
        "render",
        "nonmeinongian",
        "towards",
        "end",
        "categoricalists",
        "including",
        "armstrong",
        "subscribe",
        "quidditism",
        "according",
        "essence",
        "property",
        "constituted",
        "internal",
        "selfcontained",
        "nature",
        "called",
        "quiddity",
        "contingently",
        "related",
        "specific",
        "theoretical",
        "role",
        "play",
        "armstrong",
        "lewis",
        "despite",
        "move",
        "handfield",
        "criticises",
        "armstrong",
        "still",
        "susceptible",
        "meinongianism",
        "objection",
        "nomic",
        "necessitation",
        "relation",
        "n",
        "constituted",
        "relation",
        "counterfactual",
        "state",
        "affair",
        "armstrong",
        "p",
        "thus",
        "say",
        "property",
        "selfcontained",
        "thing",
        "keeping",
        "pointing",
        "beyond",
        "effect",
        "brought",
        "virtue",
        "property",
        "exactly",
        "internal",
        "selfcontained",
        "nature",
        "given",
        "theoretical",
        "role",
        "ruled",
        "merely",
        "contingently",
        "related",
        "seems",
        "little",
        "said",
        "thus",
        "black",
        "p",
        "say",
        "according",
        "lewis",
        "accepts",
        "quidditism",
        "humean",
        "fundamental",
        "quality",
        "identity",
        "distinctness",
        "quality",
        "quidditism",
        "essence",
        "property",
        "put",
        "constraint",
        "whatsoever",
        "instance",
        "disposed",
        "act",
        "react",
        "various",
        "circumstance",
        "quidditism",
        "go",
        "along",
        "categoricalism",
        "asserts",
        "property",
        "dispositional",
        "essence",
        "quidditism",
        "property",
        "haecceitism",
        "individual",
        "haecceitism",
        "famously",
        "implies",
        "theory",
        "primitive",
        "identity",
        "individual",
        "across",
        "possible",
        "world",
        "likewise",
        "quidditism",
        "implies",
        "theory",
        "primitive",
        "transworld",
        "identity",
        "property",
        "asserts",
        "two",
        "property",
        "identical",
        "iff",
        "quiddistically",
        "regardless",
        "theoretical",
        "role",
        "black",
        "whittle",
        "lewis",
        "case",
        "property",
        "could",
        "confer",
        "upon",
        "instance",
        "completely",
        "different",
        "causal",
        "nomic",
        "power",
        "actually",
        "nonetheless",
        "continue",
        "property",
        "actually",
        "long",
        "remains",
        "quiddistically",
        "causal",
        "nomic",
        "profile",
        "property",
        "thus",
        "merely",
        "contingent",
        "matter",
        "schaffer",
        "point",
        "contingentism",
        "necessarily",
        "paired",
        "quidditism",
        "antiquiddistic",
        "contingentism",
        "respectable",
        "position",
        "quidditism",
        "therefore",
        "implies",
        "law",
        "nature",
        "metaphysically",
        "contingent",
        "class",
        "property",
        "seems",
        "nothing",
        "standing",
        "way",
        "either",
        "possibility",
        "bound",
        "law",
        "nature",
        "possibility",
        "related",
        "law",
        "nature",
        "consequence",
        "quidditism",
        "therefore",
        "although",
        "instance",
        "colour",
        "property",
        "mass",
        "property",
        "actually",
        "linked",
        "law",
        "could",
        "linked",
        "law",
        "nature",
        "therefore",
        "contingent",
        "matter",
        "quidditists",
        "may",
        "go",
        "say",
        "law",
        "nature",
        "type",
        "regularity",
        "among",
        "property",
        "instance",
        "ramsey",
        "lewis",
        "earman",
        "others",
        "may",
        "suggest",
        "law",
        "nature",
        "nomic",
        "necessitation",
        "relation",
        "universal",
        "armstrong",
        "dretske",
        "tooley",
        "dispositionalism",
        "stark",
        "contrast",
        "categoricalism",
        "maintaining",
        "property",
        "dispositional",
        "essence",
        "dispositionalist",
        "charge",
        "categoricalist",
        "appeal",
        "internal",
        "selfcontained",
        "nature",
        "property",
        "essence",
        "unintelligible",
        "unless",
        "somehow",
        "related",
        "causal",
        "nomic",
        "power",
        "instance",
        "dispositionalism",
        "noted",
        "earlier",
        "given",
        "property",
        "endows",
        "instance",
        "disposition",
        "matter",
        "circumstance",
        "situated",
        "dispositionalism",
        "necessitates",
        "diametrically",
        "opposing",
        "view",
        "law",
        "nature",
        "one",
        "necessitated",
        "categoricalismmore",
        "point",
        "one",
        "necessitated",
        "quidditism",
        "property",
        "negatively",
        "charged",
        "essence",
        "characterised",
        "term",
        "disposition",
        "attract",
        "positively",
        "charged",
        "particle",
        "repel",
        "negatively",
        "charged",
        "particle",
        "dispositionalism",
        "negatively",
        "charged",
        "particle",
        "necessarily",
        "disposed",
        "entail",
        "coulomb",
        "law",
        "describes",
        "charged",
        "particle",
        "interact",
        "one",
        "another",
        "metaphysically",
        "necessary",
        "see",
        "corry",
        "criticism",
        "reasoning",
        "general",
        "dispositionalist",
        "typically",
        "maintains",
        "hildebrand",
        "call",
        "descriptive",
        "nonhumeanism",
        "view",
        "law",
        "nature",
        "universal",
        "description",
        "dispositional",
        "essence",
        "property",
        "metaphysically",
        "necessary",
        "truth",
        "ensured",
        "dispositional",
        "essence",
        "relevant",
        "property",
        "possible",
        "world",
        "relevant",
        "property",
        "exist",
        "point",
        "made",
        "swoyer",
        "elli",
        "kistler",
        "bird",
        "a",
        "a",
        "see",
        "mumford",
        "claim",
        "dispositionalism",
        "obviates",
        "need",
        "law",
        "see",
        "bird",
        "a",
        "chapter",
        "criticism",
        "claim",
        "see",
        "chalmers",
        "fine",
        "claim",
        "natural",
        "necessity",
        "eg",
        "conservation",
        "law",
        "accounted",
        "dispositionalism",
        "dispositionalism",
        "hoped",
        "provide",
        "comprehensive",
        "unified",
        "metaphysical",
        "grounding",
        "natural",
        "modality",
        "general",
        "may",
        "serve",
        "alternative",
        "humeanism",
        "attempt",
        "see",
        "williams",
        "borghini",
        "martin",
        "jacob",
        "handfield",
        "a",
        "take",
        "dispositionalism",
        "humeanism",
        "incompatible",
        "explores",
        "possibility",
        "combining",
        "construct",
        "call",
        "humean",
        "dispositionalism",
        "simpson",
        "however",
        "criticises",
        "combination",
        "halfbaked",
        "categoricalism",
        "dispositionalism",
        "two",
        "extreme",
        "large",
        "spectrum",
        "possible",
        "position",
        "essence",
        "property",
        "instance",
        "philosopher",
        "like",
        "swoyer",
        "elli",
        "lierse",
        "elli",
        "molnar",
        "maintain",
        "property",
        "essentially",
        "dispositional",
        "others",
        "notably",
        "spatiotemporal",
        "property",
        "sense",
        "dispositional",
        "essentialists",
        "dispositionalists",
        "another",
        "alternative",
        "lately",
        "gained",
        "considerable",
        "ground",
        "called",
        "powerful",
        "quality",
        "view",
        "view",
        "every",
        "property",
        "sense",
        "dispositional",
        "qualitative",
        "qualitative",
        "used",
        "interchangeably",
        "categorical",
        "pioneered",
        "martin",
        "heil",
        "armstrong",
        "martin",
        "place",
        "martin",
        "martin",
        "heil",
        "heil",
        "developed",
        "engelhard",
        "jacob",
        "ingthorsson",
        "carruth",
        "taylor",
        "a",
        "b",
        "big",
        "challenge",
        "view",
        "give",
        "satisfactory",
        "account",
        "exactly",
        "one",
        "property",
        "dispositional",
        "qualitative",
        "armstrong",
        "popular",
        "response",
        "challenge",
        "qualitative",
        "dispositional",
        "identical",
        "one",
        "another",
        "unitary",
        "intrinsic",
        "property",
        "martin",
        "p",
        "however",
        "given",
        "strong",
        "inclination",
        "think",
        "dispositional",
        "nature",
        "property",
        "distinct",
        "incompatible",
        "qualitative",
        "nature",
        "doubt",
        "detail",
        "needed",
        "order",
        "render",
        "view",
        "fully",
        "respectable",
        "competitor",
        "attempt",
        "made",
        "jacob",
        "ingthorsson",
        "taylor",
        "b",
        "notwithstanding",
        "profusion",
        "possible",
        "position",
        "taken",
        "however",
        "categoricalism",
        "dispositionalism",
        "focus",
        "discussion",
        "literature",
        "criticism",
        "argument",
        "dispositionalists",
        "categoricalists",
        "traded",
        "see",
        "appendix",
        "quiddistically",
        "different",
        "world",
        "irremediable",
        "ignorance",
        "regress",
        "power"
    ]
}