{
    "main_text": "Other assessments of the argument from nonresistant nonbelief\n4. Other assessments of the argument from nonresistant nonbelief\n\nEven if no theistically friendly explanation of nonresistant nonbelief\nwe know of completely satisfies us, we might yet wonder about\nSchellenberg’s premise\n (4):\n necessarily, if God exists, then God perfectly loves such finite\npersons as there may be.\n\nOn the one hand, we might wonder whether, if God exists, God perfectly\nloves anyone. In this connection, some critics have pointed\nout that many “classical theists” affirm a conception of\nGod according to which God is transcendent, ineffable, and/or\nextracategorical, and so beyond all human comprehension, and so\nneither personal nor non-personal, and so neither loving nor\nnon-loving (Rea 2015; Ross 2002; Trakakis 2015; Wojtysiak 2021). It is\ncertainly less than clear whether a conscious, reciprocal personal\nrelationship with the God of apophaticism is possible and, even if it\nis possible, whether it would count as “meaningful” in Schellenberg’s\nsense (Howard-Snyder 2017a, 2017b; Rea 2016, 2018). Moreover, even if\nthere is a personal God, God might be indifferent to finite created\npersons, and so not love them—an implication of some versions of\nDeism.\n\nOn the other hand, we might wonder whether, even if God is perfect in\nlove, God would perfectly love such finite persons as there may be.\nFor, in light of an idea suggested as worthy of consideration by Hud\nHudson in private correspondence, \n\nto love perfectly is for one’s love to be in the right\nproportion to the object of one’s love, everything\nconsidered—loving to the degree that matches the degree of\nworthiness to be loved. \n\nTherefore, even if God is perfectly loving, it does not follow that\nGod loves such finite persons as there may be since they may have\npolluted themselves, rendered themselves utterly unlovable; “and\nit is, of course, no symptom of a disordered love to fail to love the\nunlovable”.\n\nOne might also wonder about premise\n (5):\n necessarily, if God perfectly loves such finite persons as there may\nbe, then, for any capable finite person S and time\nt, God is at t open to being in a positively\nmeaningful and reciprocal conscious relationship with S at\nt. Whether this is true might depend on what sort of love is\nperfect, whether it is more like that of a mother for her child, or a\ngrandparent for her distant descendants, or a benevolent\nreconstructive surgeon for her patient (Cuneo 2013; McGinnis 2015; Rea\n2015; Schellenberg 2013). One might argue that premise\n (5)\n is true only if perfect love is like the first, but wonder what\nfollows if it is like the second or third. In this connection, imagine\nthat what it is for God to perfectly love us is for God to provide for\nour greatest good, and suppose that our greatest good consists in our\nbeing virtuous, caring for our environment and other creatures. In\nthat case, it is not at all clear that openness to a personal\nrelationship of the sort Schellenberg imagines is necessary. So long\nas God has made our flourishing achievable, that is all that\nGod’s perfect love should lead us to expect. In a similar vein,\none might argue that “God loves every human but loves some more\nthan others,” and so “God would not seek the same for each\nperson as lovers do not act impartially between those most loved and\nothers whom they love,” and so a “variable divine\nlove” does not require “that God would always be open to a\npersonal relationship with every person” (Jordan 2021; see\nSchellenberg 2021b for criticism).\n\nFurthermore, one might call into question why God’s love should\nbe our only guide as to whether God would be open to a positively\nmeaningful, reciprocal, conscious relationship. God’s\ntranscendence (Rea 2016, 2018) and/or personality (Rea 2012, 2018; for\ncritique, see Parker 2012, Schellenberg 2017a) might jointly\ndetermine, along with God’s perfect love, the extent to which\nGod is thus open.\n\nSuppose we grant Schellenberg’s understanding of openness to\nrelationship as well as his premise\n (6),\n and suppose we concede that no theistically friendly explanation of\nnonresistant nonbelief we know of is wholly satisfactory, either\nindividually or collectively. Even so, we might wonder whether we\nshould infer that a perfectly loving God would not permit nonresistant\nnonbelief. After all, an open-minded and intellectually humble\ninquirer will want to satisfy her natural curiosity about whether she\nis in a position to tell whether there are any reasons for God to\npermit nonresistant nonbelief that, although inaccessible to her,\nwould be accessible to God. For suppose that she were to discover\nthat, even if there is no good basis for thinking there is a God, and\neven if she does not know of any wholly satisfactory reason for God to\npermit nonresistant nonbelief, she should be in doubt about whether\nshe is in a position to tell whether there are any unknown reasons. In\nthat case, we would expect her open-mindedness and intellectual\nhumility to lead her to refrain from accepting that a perfectly loving\nGod would not permit nonresistant nonbelief and, in refraining from\naccepting this, she would refrain from accepting premise\n (5).\n\nThis assessment of the argument from nonbelief has its parallel in the\nproblem of evil literature where it is (badly) named “skeptical\ntheism”. It has been explicitly used in relation to the argument\nfrom nonbelief in Howard-Snyder 2015 and McBrayer and Swenson 2012.\nFor criticism, see Schellenberg 2007a, 2015b. Whether this assessment\nleads to objectionable skepticism elsewhere is a matter of ongoing\ndebate. For discussion as it relates to the argument from evil, see\nDougherty 2014; Dougherty and McBrayer 2014; Howard-Snyder 2009;\nMcBrayer 2010; McBrayer and Howard-Snyder 2013; and Trakakis\n2007b.\n\nEven if we accept premises\n (4)\n and\n (5),\n we might yet wonder about Schellenberg’s premise\n (6),\n the claim that God’s openness to a personal relationship with\ncapable nonresistant persons entails that such persons will believe\nthat God exists. Schellenberg argues that a person cannot even\n“get started” in a personal\nrelationship—specifically, a conscious, reciprocal, positively\nmeaningful relationship with another person—without believing\nthat the other person exists. “After all,” he says,\n“a personal relationship is a conscious, reciprocal\nrelationship, and a conscious relationship is a relationship one\nrecognizes oneself to be in,” and so “one clearly cannot\neven get started in a personal relationship without believing that the\nother party exists” (Schellenberg 2021a, 64). \n\nOne might wonder, however, whether one could bring to one’s\nconscious awareness a relationship that one is in without\nbelieving the proposition that the other person\nexists, for two reasons. First, perhaps one could bring to\none’s conscious awareness a relationship that one is in while\nbeing in a kind of psychological state toward the proposition that the\nother person exists other than propositional belief, e.g., credence,\nconfidence, acceptance, propositional trust, propositional hope, or\nbeliefless assuming, as well as non-doxastic faith. Second, perhaps\none could bring to one’s conscious awareness a relationship that\none is in while believing a proposition that is “thinner”\nthan the “thick” proposition that the other person\nexists, e.g., the proposition that the other person probably\nexists, or the proposition that it’s more likely than\nnot that the other person exists, or the proposition that its\nlikely enough that the other person exists to act on it. And\nthere are other options for believing “thinner”\npropositions as well. (For more on these optional psychological\nstates, see Alston 1996; Audi 2011; Buchak 2018; Cohen 1992;\nHoward-Snyder 2013, 2016; Howard-Snyder and McKaughan 2022; McKaughan\n2013; McKaughan and Howard-Snyder forthcoming; Poston and Dougherty\n2007; Schellenberg 2011, 2014; Weidner 2018.) Thus, perhaps one might\n“get started” in a personal relationship with God—a\nconscious, reciprocal, positively meaningful personal love\nrelationship with God—without believing that God exists,\nprovided that, e.g., one has non-doxastic faith that God exists and/or\none believes that it’s likely enough that God exists to act on\nit. Indeed, one may well wonder whether propositional belief that God\nexists would be all that important to God since so many people lack\nsuch belief (van Inwagen 2002; Megill and Linford 2017).\n\nFurther pressure has been put on premise (6). Some have recently urged\nthat non-propositional knowledge of persons is strongly differentiable\nfrom propositional knowledge about those persons, perhaps not even\nrequiring the belief that they exist (Benton 2018; Stump 2018, 2021).\nIf that’s possible, then, perhaps, persons capable of a\nconscious, reciprocal, positively meaningful personal relationship\nwith God can have such a relationship without believing that God\nexists. (For critique, see Sweet 2022.) \n\nSome have also recently urged against premise (6) the following\nargument. It is possible for God to be in a conscious, reciprocal,\npositively meaningful personal relationship with created persons in a\nsui generis fashion, specifically, in an “imaging\nrelationship” (Yadav 2020). An imaging relationship is one in\nwhich God creates persons in God’s image—i.e., persons\n“who, like God, are constituted as minds and wills, and like God\nare capable of employing mind and will to serve the best interests of\ncreation” (76)—and then invites them, through the beauty\nand goodness of creation, to image God well instead of badly, which,\namong other things, involves them doing well as cultivators and\nnurturers of, carers-for, and delighters in creation, and them\nenjoying “a kind of communion with God, a kind of intimate\nsharing in the divine mind and will, so that [they] may come to find\nGod uniquely formed within [their] own individual personhood”\n(77). And, closer inspection reveals that it is possible for created\npersons to be in a (de re) conscious, reciprocal, positively\nmeaningful personal love relationship of this sort with God, and yet\nnot be (de dicto) conscious that God exists, i.e., and yet be\na nonbeliever or even a disbeliever (78–81). And so it is\npossible for created persons to be in a conscious, reciprocal,\npositively meaningful personal relationship with God and yet not\nbelieve that God exists.\n\nJust for the sake of argument, suppose that psychological states other\nthan the propositional belief that God exists can suffice as whatever\ncognitive requirement for “getting started” in a personal relationship\nwith God involves. We might yet wonder whether those other states are\nas good as belief that God exists as a cognitive foundation for a\npersonal relationship with God; and, if they are not, we might well\nquestion why a perfectly loving God provides less than the best on\nthis score. Furthermore, even if a perfectly loving God might permit\nless than the best on this score, perhaps we have just as good a\nreason to think that there are nonresistant people who are in none of\nthe optional psychological states who are capable of relating\npersonally with God as we do to think that there are nonresistant\nnonbelievers who are capable of relating personally with God—in\nwhich case we can modify the latest version of his argument to absorb\nthe force of the point (Schellenberg 2007b, 2015b, 2021a).\n\nLast but not least, we might wonder about premise\n (7):\n are there really any nonresistant nonbelievers with a capacity to\nrelate personally with God? Some suggest that, if there are, there\naren’t many; after all, everyone has good Pascalian reason to\nbelieve that God exists (Jackson 2016). Others say that everyone at\nleast implicitly believes in God, although not under the name\n“God” or under a description they might recognize as\nbelonging to God (Wainwright 2002). Further, many religions hold that\nsome kind of basic knowledge of God is universal but can be\nsuppressed, sometimes called the “natural knowledge of\nGod” (Green 2013). Paul’s letter to the Romans claims that\n“since the creation of the world God’s invisible qualities\nhave been clearly seen”. Calvin famously posits that there is a\nsensus divinitatis that provides us with at least a basic\nsense of the divine. According to Jonathan Edwards, there is\n“sufficient light for the knowledge of God”, hence,\nnonbelievers must fail to believe “divine things” owing to\n“a dreadful stupidity of mind, occasioning a sottish\ninsensibility of their truth and importance” (quoted in\nWainwright 2002). This insensibility consists in a “proneness to\nidolatry” and a “disregard of eternal\nthings”—dispositions to ignore familiar and obvious\nconsiderations, to be swayed by ridicule and deference to people in\nauthority, to be prejudiced against religion, and so on, which impair\nthe God-given ability to reason properly about God. People bring such\nimpairments on themselves (Azadegan 2013a; Henry 2001, 2008; Lehe\n2004; Moroney 2000). Of course, one might argue that non-resistant\nnon-believers do not bring such impairments on themselves; rather,\nthey suffer from a “significant disability,” i.e.,\n“spiritual autism,” that prevents them from experiencing\nGod personally, and so prevents them from belief in God’s\nexistence (McFall 2016). Whether such a metaphor is apt or helpful,\nthough, depends in part on important questions in the philosophy of\ndisability, and one ought to be very careful not to misrepresent or\ninstrumentalize autistic persons.\n\nHowever, if we deny the existence of nonresistant nonbelievers, we\nmust square our denial with the evidence marshalled on behalf of their\nexistence (Schellenberg 2005c). Furthermore, some forms of resistant\nnon-belief should be deeply concerning for the theist, such as\npsychological resistance provoked by religious trauma and\ninterpersonal hurts generally (Green 2015; Rea 2018; Panchuk 2018).\nWhether because of suffering or hiddenness, the mere fact that\nnonbelief is resistant is not necessarily a boon to the theist.\n",
    "section_title": "4. Other assessments of the argument from nonresistant nonbelief",
    "entry_title": "Hiddenness of God",
    "hierarchy_title": "Hiddenness of God || Other assessments of the argument from nonresistant nonbelief",
    "tokenized_text": [
        "assessment",
        "argument",
        "nonresistant",
        "nonbelief",
        "assessment",
        "argument",
        "nonresistant",
        "nonbelief",
        "even",
        "theistically",
        "friendly",
        "explanation",
        "nonresistant",
        "nonbelief",
        "know",
        "completely",
        "satisfies",
        "u",
        "might",
        "yet",
        "wonder",
        "schellenberg",
        "premise",
        "necessarily",
        "god",
        "exists",
        "god",
        "perfectly",
        "love",
        "finite",
        "person",
        "may",
        "one",
        "hand",
        "might",
        "wonder",
        "whether",
        "god",
        "exists",
        "god",
        "perfectly",
        "love",
        "anyone",
        "connection",
        "critic",
        "pointed",
        "many",
        "classical",
        "theist",
        "affirm",
        "conception",
        "god",
        "according",
        "god",
        "transcendent",
        "ineffable",
        "andor",
        "extracategorical",
        "beyond",
        "human",
        "comprehension",
        "neither",
        "personal",
        "nonpersonal",
        "neither",
        "loving",
        "nonloving",
        "rea",
        "ross",
        "trakakis",
        "wojtysiak",
        "certainly",
        "le",
        "clear",
        "whether",
        "conscious",
        "reciprocal",
        "personal",
        "relationship",
        "god",
        "apophaticism",
        "possible",
        "even",
        "possible",
        "whether",
        "would",
        "count",
        "meaningful",
        "schellenberg",
        "sense",
        "howardsnyder",
        "a",
        "b",
        "rea",
        "moreover",
        "even",
        "personal",
        "god",
        "god",
        "might",
        "indifferent",
        "finite",
        "created",
        "person",
        "love",
        "theman",
        "implication",
        "version",
        "deism",
        "hand",
        "might",
        "wonder",
        "whether",
        "even",
        "god",
        "perfect",
        "love",
        "god",
        "would",
        "perfectly",
        "love",
        "finite",
        "person",
        "may",
        "light",
        "idea",
        "suggested",
        "worthy",
        "consideration",
        "hud",
        "hudson",
        "private",
        "correspondence",
        "love",
        "perfectly",
        "one",
        "love",
        "right",
        "proportion",
        "object",
        "one",
        "love",
        "everything",
        "consideredloving",
        "degree",
        "match",
        "degree",
        "worthiness",
        "loved",
        "therefore",
        "even",
        "god",
        "perfectly",
        "loving",
        "follow",
        "god",
        "love",
        "finite",
        "person",
        "may",
        "since",
        "may",
        "polluted",
        "rendered",
        "utterly",
        "unlovable",
        "course",
        "symptom",
        "disordered",
        "love",
        "fail",
        "love",
        "unlovable",
        "one",
        "might",
        "also",
        "wonder",
        "premise",
        "necessarily",
        "god",
        "perfectly",
        "love",
        "finite",
        "person",
        "may",
        "capable",
        "finite",
        "person",
        "time",
        "god",
        "open",
        "positively",
        "meaningful",
        "reciprocal",
        "conscious",
        "relationship",
        "t",
        "whether",
        "true",
        "might",
        "depend",
        "sort",
        "love",
        "perfect",
        "whether",
        "like",
        "mother",
        "child",
        "grandparent",
        "distant",
        "descendant",
        "benevolent",
        "reconstructive",
        "surgeon",
        "patient",
        "cuneo",
        "mcginnis",
        "rea",
        "schellenberg",
        "one",
        "might",
        "argue",
        "premise",
        "true",
        "perfect",
        "love",
        "like",
        "first",
        "wonder",
        "follows",
        "like",
        "second",
        "third",
        "connection",
        "imagine",
        "god",
        "perfectly",
        "love",
        "u",
        "god",
        "provide",
        "greatest",
        "good",
        "suppose",
        "greatest",
        "good",
        "consists",
        "virtuous",
        "caring",
        "environment",
        "creature",
        "case",
        "clear",
        "openness",
        "personal",
        "relationship",
        "sort",
        "schellenberg",
        "imago",
        "necessary",
        "long",
        "god",
        "made",
        "flourishing",
        "achievable",
        "god",
        "perfect",
        "love",
        "lead",
        "u",
        "expect",
        "similar",
        "vein",
        "one",
        "might",
        "argue",
        "god",
        "love",
        "every",
        "human",
        "love",
        "others",
        "god",
        "would",
        "seek",
        "person",
        "lover",
        "act",
        "impartially",
        "loved",
        "others",
        "love",
        "variable",
        "divine",
        "love",
        "require",
        "god",
        "would",
        "always",
        "open",
        "personal",
        "relationship",
        "every",
        "person",
        "jordan",
        "see",
        "schellenberg",
        "b",
        "criticism",
        "furthermore",
        "one",
        "might",
        "call",
        "question",
        "god",
        "love",
        "guide",
        "whether",
        "god",
        "would",
        "open",
        "positively",
        "meaningful",
        "reciprocal",
        "conscious",
        "relationship",
        "god",
        "transcendence",
        "rea",
        "andor",
        "personality",
        "rea",
        "critique",
        "see",
        "parker",
        "schellenberg",
        "a",
        "might",
        "jointly",
        "determine",
        "along",
        "god",
        "perfect",
        "love",
        "extent",
        "god",
        "thus",
        "open",
        "suppose",
        "grant",
        "schellenberg",
        "understanding",
        "openness",
        "relationship",
        "well",
        "premise",
        "suppose",
        "concede",
        "theistically",
        "friendly",
        "explanation",
        "nonresistant",
        "nonbelief",
        "know",
        "wholly",
        "satisfactory",
        "either",
        "individually",
        "collectively",
        "even",
        "might",
        "wonder",
        "whether",
        "infer",
        "perfectly",
        "loving",
        "god",
        "would",
        "permit",
        "nonresistant",
        "nonbelief",
        "openminded",
        "intellectually",
        "humble",
        "inquirer",
        "want",
        "satisfy",
        "natural",
        "curiosity",
        "whether",
        "position",
        "tell",
        "whether",
        "reason",
        "god",
        "permit",
        "nonresistant",
        "nonbelief",
        "although",
        "inaccessible",
        "would",
        "accessible",
        "god",
        "suppose",
        "discover",
        "even",
        "good",
        "basis",
        "thinking",
        "god",
        "even",
        "know",
        "wholly",
        "satisfactory",
        "reason",
        "god",
        "permit",
        "nonresistant",
        "nonbelief",
        "doubt",
        "whether",
        "position",
        "tell",
        "whether",
        "unknown",
        "reason",
        "case",
        "would",
        "expect",
        "openmindedness",
        "intellectual",
        "humility",
        "lead",
        "refrain",
        "accepting",
        "perfectly",
        "loving",
        "god",
        "would",
        "permit",
        "nonresistant",
        "nonbelief",
        "refraining",
        "accepting",
        "would",
        "refrain",
        "accepting",
        "premise",
        "assessment",
        "argument",
        "nonbelief",
        "parallel",
        "problem",
        "evil",
        "literature",
        "badly",
        "named",
        "skeptical",
        "theism",
        "explicitly",
        "used",
        "relation",
        "argument",
        "nonbelief",
        "howardsnyder",
        "mcbrayer",
        "swenson",
        "criticism",
        "see",
        "schellenberg",
        "a",
        "b",
        "whether",
        "assessment",
        "lead",
        "objectionable",
        "skepticism",
        "elsewhere",
        "matter",
        "ongoing",
        "debate",
        "discussion",
        "relates",
        "argument",
        "evil",
        "see",
        "dougherty",
        "dougherty",
        "mcbrayer",
        "howardsnyder",
        "mcbrayer",
        "mcbrayer",
        "howardsnyder",
        "trakakis",
        "b",
        "even",
        "accept",
        "premise",
        "might",
        "yet",
        "wonder",
        "schellenberg",
        "premise",
        "claim",
        "god",
        "openness",
        "personal",
        "relationship",
        "capable",
        "nonresistant",
        "person",
        "entail",
        "person",
        "believe",
        "god",
        "exists",
        "schellenberg",
        "argues",
        "person",
        "even",
        "get",
        "started",
        "personal",
        "relationshipspecifically",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "relationship",
        "another",
        "personwithout",
        "believing",
        "person",
        "exists",
        "say",
        "personal",
        "relationship",
        "conscious",
        "reciprocal",
        "relationship",
        "conscious",
        "relationship",
        "relationship",
        "one",
        "recognizes",
        "oneself",
        "one",
        "clearly",
        "even",
        "get",
        "started",
        "personal",
        "relationship",
        "without",
        "believing",
        "party",
        "exists",
        "schellenberg",
        "a",
        "one",
        "might",
        "wonder",
        "however",
        "whether",
        "one",
        "could",
        "bring",
        "one",
        "conscious",
        "awareness",
        "relationship",
        "one",
        "without",
        "believing",
        "proposition",
        "person",
        "exists",
        "two",
        "reason",
        "first",
        "perhaps",
        "one",
        "could",
        "bring",
        "one",
        "conscious",
        "awareness",
        "relationship",
        "one",
        "kind",
        "psychological",
        "state",
        "toward",
        "proposition",
        "person",
        "exists",
        "propositional",
        "belief",
        "eg",
        "credence",
        "confidence",
        "acceptance",
        "propositional",
        "trust",
        "propositional",
        "hope",
        "beliefless",
        "assuming",
        "well",
        "nondoxastic",
        "faith",
        "second",
        "perhaps",
        "one",
        "could",
        "bring",
        "one",
        "conscious",
        "awareness",
        "relationship",
        "one",
        "believing",
        "proposition",
        "thinner",
        "thick",
        "proposition",
        "person",
        "exists",
        "eg",
        "proposition",
        "person",
        "probably",
        "exists",
        "proposition",
        "likely",
        "person",
        "exists",
        "proposition",
        "likely",
        "enough",
        "person",
        "exists",
        "act",
        "option",
        "believing",
        "thinner",
        "proposition",
        "well",
        "optional",
        "psychological",
        "state",
        "see",
        "alston",
        "audi",
        "buchak",
        "cohen",
        "howardsnyder",
        "howardsnyder",
        "mckaughan",
        "mckaughan",
        "mckaughan",
        "howardsnyder",
        "forthcoming",
        "poston",
        "dougherty",
        "schellenberg",
        "weidner",
        "thus",
        "perhaps",
        "one",
        "might",
        "get",
        "started",
        "personal",
        "relationship",
        "goda",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "personal",
        "love",
        "relationship",
        "godwithout",
        "believing",
        "god",
        "exists",
        "provided",
        "eg",
        "one",
        "nondoxastic",
        "faith",
        "god",
        "exists",
        "andor",
        "one",
        "belief",
        "likely",
        "enough",
        "god",
        "exists",
        "act",
        "indeed",
        "one",
        "may",
        "well",
        "wonder",
        "whether",
        "propositional",
        "belief",
        "god",
        "exists",
        "would",
        "important",
        "god",
        "since",
        "many",
        "people",
        "lack",
        "belief",
        "van",
        "inwagen",
        "megill",
        "linford",
        "pressure",
        "put",
        "premise",
        "recently",
        "urged",
        "nonpropositional",
        "knowledge",
        "person",
        "strongly",
        "differentiable",
        "propositional",
        "knowledge",
        "person",
        "perhaps",
        "even",
        "requiring",
        "belief",
        "exist",
        "benton",
        "stump",
        "possible",
        "perhaps",
        "person",
        "capable",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "personal",
        "relationship",
        "god",
        "relationship",
        "without",
        "believing",
        "god",
        "exists",
        "critique",
        "see",
        "sweet",
        "also",
        "recently",
        "urged",
        "premise",
        "following",
        "argument",
        "possible",
        "god",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "personal",
        "relationship",
        "created",
        "person",
        "sui",
        "generis",
        "fashion",
        "specifically",
        "imaging",
        "relationship",
        "yadav",
        "imaging",
        "relationship",
        "one",
        "god",
        "creates",
        "person",
        "god",
        "imageie",
        "person",
        "like",
        "god",
        "constituted",
        "mind",
        "will",
        "like",
        "god",
        "capable",
        "employing",
        "mind",
        "serve",
        "best",
        "interest",
        "creation",
        "and",
        "invite",
        "beauty",
        "goodness",
        "creation",
        "image",
        "god",
        "well",
        "instead",
        "badly",
        "among",
        "thing",
        "involves",
        "well",
        "cultivator",
        "nurturers",
        "carersfor",
        "delighters",
        "creation",
        "enjoying",
        "kind",
        "communion",
        "god",
        "kind",
        "intimate",
        "sharing",
        "divine",
        "mind",
        "may",
        "come",
        "find",
        "god",
        "uniquely",
        "formed",
        "within",
        "individual",
        "personhood",
        "closer",
        "inspection",
        "reveals",
        "possible",
        "created",
        "person",
        "de",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "personal",
        "love",
        "relationship",
        "sort",
        "god",
        "yet",
        "de",
        "dicto",
        "conscious",
        "god",
        "exists",
        "ie",
        "yet",
        "nonbeliever",
        "even",
        "disbeliever",
        "possible",
        "created",
        "person",
        "conscious",
        "reciprocal",
        "positively",
        "meaningful",
        "personal",
        "relationship",
        "god",
        "yet",
        "believe",
        "god",
        "exists",
        "sake",
        "argument",
        "suppose",
        "psychological",
        "state",
        "propositional",
        "belief",
        "god",
        "exists",
        "suffice",
        "whatever",
        "cognitive",
        "requirement",
        "getting",
        "started",
        "personal",
        "relationship",
        "god",
        "involves",
        "might",
        "yet",
        "wonder",
        "whether",
        "state",
        "good",
        "belief",
        "god",
        "exists",
        "cognitive",
        "foundation",
        "personal",
        "relationship",
        "god",
        "might",
        "well",
        "question",
        "perfectly",
        "loving",
        "god",
        "provides",
        "le",
        "best",
        "score",
        "furthermore",
        "even",
        "perfectly",
        "loving",
        "god",
        "might",
        "permit",
        "le",
        "best",
        "score",
        "perhaps",
        "good",
        "reason",
        "think",
        "nonresistant",
        "people",
        "none",
        "optional",
        "psychological",
        "state",
        "capable",
        "relating",
        "personally",
        "god",
        "think",
        "nonresistant",
        "nonbeliever",
        "capable",
        "relating",
        "personally",
        "godin",
        "case",
        "modify",
        "latest",
        "version",
        "argument",
        "absorb",
        "force",
        "point",
        "schellenberg",
        "b",
        "b",
        "a",
        "last",
        "least",
        "might",
        "wonder",
        "premise",
        "really",
        "nonresistant",
        "nonbeliever",
        "capacity",
        "relate",
        "personally",
        "god",
        "suggest",
        "many",
        "everyone",
        "good",
        "pascalian",
        "reason",
        "believe",
        "god",
        "exists",
        "jackson",
        "others",
        "say",
        "everyone",
        "least",
        "implicitly",
        "belief",
        "god",
        "although",
        "name",
        "god",
        "description",
        "might",
        "recognize",
        "belonging",
        "god",
        "wainwright",
        "many",
        "religion",
        "hold",
        "kind",
        "basic",
        "knowledge",
        "god",
        "universal",
        "suppressed",
        "sometimes",
        "called",
        "natural",
        "knowledge",
        "god",
        "green",
        "paul",
        "letter",
        "roman",
        "claim",
        "since",
        "creation",
        "world",
        "god",
        "invisible",
        "quality",
        "clearly",
        "seen",
        "calvin",
        "famously",
        "posit",
        "sensus",
        "divinitatis",
        "provides",
        "u",
        "least",
        "basic",
        "sense",
        "divine",
        "according",
        "jonathan",
        "edward",
        "sufficient",
        "light",
        "knowledge",
        "god",
        "hence",
        "nonbeliever",
        "must",
        "fail",
        "believe",
        "divine",
        "thing",
        "owing",
        "dreadful",
        "stupidity",
        "mind",
        "occasioning",
        "sottish",
        "insensibility",
        "truth",
        "importance",
        "quoted",
        "wainwright",
        "insensibility",
        "consists",
        "proneness",
        "idolatry",
        "disregard",
        "eternal",
        "thing",
        "dispositions",
        "ignore",
        "familiar",
        "obvious",
        "consideration",
        "swayed",
        "ridicule",
        "deference",
        "people",
        "authority",
        "prejudiced",
        "religion",
        "impair",
        "godgiven",
        "ability",
        "reason",
        "properly",
        "god",
        "people",
        "bring",
        "impairment",
        "azadegan",
        "a",
        "henry",
        "lehe",
        "moroney",
        "course",
        "one",
        "might",
        "argue",
        "nonresistant",
        "nonbelievers",
        "bring",
        "impairment",
        "rather",
        "suffer",
        "significant",
        "disability",
        "ie",
        "spiritual",
        "autism",
        "prevents",
        "experiencing",
        "god",
        "personally",
        "prevents",
        "belief",
        "god",
        "existence",
        "mcfall",
        "whether",
        "metaphor",
        "apt",
        "helpful",
        "though",
        "depends",
        "part",
        "important",
        "question",
        "philosophy",
        "disability",
        "one",
        "ought",
        "careful",
        "misrepresent",
        "instrumentalize",
        "autistic",
        "person",
        "however",
        "deny",
        "existence",
        "nonresistant",
        "nonbeliever",
        "must",
        "square",
        "denial",
        "evidence",
        "marshalled",
        "behalf",
        "existence",
        "schellenberg",
        "c",
        "furthermore",
        "form",
        "resistant",
        "nonbelief",
        "deeply",
        "concerning",
        "theist",
        "psychological",
        "resistance",
        "provoked",
        "religious",
        "trauma",
        "interpersonal",
        "hurt",
        "generally",
        "green",
        "rea",
        "panchuk",
        "whether",
        "suffering",
        "hiddenness",
        "mere",
        "fact",
        "nonbelief",
        "resistant",
        "necessarily",
        "boon",
        "theist"
    ]
}