{
    "main_text": "The Modal Collapse Objection to DDS || Solutions to the Problem of Modal Collapse\n7.3 Solutions to the Problem of Modal Collapse\n\n(0) Reject theism. One might argue as follows.\n\nNothing could count as God that is not simple.\nDivine simplicity is logically contradictory.\nWhatever is logically contradictory cannot exist.\nTherefore, God does not exist.\n\nSolution by dissolution.\n\n(1) Accept traditional theism but reject DDS. Many if not most\nChristian theists, Protestants especially, will simply deny the divine\nsimplicity. Alvin Plantinga, for example, is a Christian theist who\nrejects DDS. (Plantinga, 1980) He is followed in this by many others\n(Moreland and Craig 2003, Hasker 2016).\n\n(2) Accept DDS, but reject the commitment to the modal contingency of\nconcrete creatures, either in a Christian way (Pedersen and Lilley\n2022) or in an Islamic way (Andani 2022). The Islamic way is further\nspecified in (5) below.\n\n(3) Accept both limbs of the problematic dyad, despite their apparent\ninconsistency, either by (a) holding that there are true\ncontradictions or, less drastically, by (b) holding that while there\nare no true contradictions, we in our present state are prevented by\nour cognitive architecture from understanding how the limbs\nof the problematic dyad could both be true. Both of these options may\nbe dubbed mysterian. The first could be called\nextreme, the second moderate. The mysterianism of\nDolezal (2011, 210) seems to be of the moderate type. (See section 4.3\nabove.) It must remain a mystery in this life how it could be true\nboth that God is simple and that concrete creatures are modally\ncontingent. And yet both are true without violation of the\nlaw of non-contradiction.\n\n(4) Accept DDS, but hold that “the only necessity or possibility\napplicable to God is not de re but de dicto.”\n(Miller 1996, 13) The problem arises if we think that the modal\ncontingency of concrete creatures requires that God have the ability\nto do otherwise than what he has done. But if the only modality\napplicable to God is de dicto, then it is false to say of\nGod (de deo) that he could have done otherwise, and the\nproblem is supposedly avoided.\n\n(5) Accept DDS, but hold that creatures are really distinct from divine\ncreating and thus can have a different modal status from that of the\ndivine acts whereby they are created. Nathan Greeley writes,\n\n\n… to say that God’s activity of knowing and willing exist\nnecessarily is not to say that created objects of his knowing and\nwilling must also exist necessarily. As long as these created objects\nare considered really distinct from the acts by which they\nare known and willed, then the objects in themselves, need not have\nthe same modal status as these acts. […] God, one can then say,\nnecessarily knows and necessarily wills in an absolute manner, but at\nleast some of the particular objects of his knowledge are contingent.\n(Greeley 2019, 237)\n\n\nThe idea here is that what God necessarily creates, and thus could not\nhave failed to create, can nevertheless be contingent, i.e., possibly\nnonexistent. How might this be true? Here is one way. Suppose that\nGod’s creating of a thing simultaneously releases it into\nontological independence. The divine creative act makes the thing\nexist, but once it exists, it exists on its own, ‘by its own\npower’ without divine assistance. In other words, when God\ncreates a thing, he creates it in such a way that its existence,\nmoment by moment, does not depend on God’s ongoing creative\nsustenance after the initial creative action. It continues by\n‘existential intertia.’ If this is the nature of creation,\nthen the created entity could very well be contingent despite the\ncreative act’s being necessary. For the created entity to exist\nin the first place it would be necessary that God create it, but after\nhe does so the entity exists contingently. On this scheme, there is\ncreatio originans (originating creation), but no creatio\ncontinuans (continuing creation). This allows what is originally\ncaused to exist to be contingent.\n\nUnfortunately, this understanding of creation is foreign to classical\ntheism. On classical theism, creation is both originating and\ncontinuing. In addition, classical theism need not insist on the\nreality of the originating-continuing distinction. For even if the\nworld (the created realm) has an infinite past and always existed, it\ncould nonetheless have creaturely status. If that were the case, then\nthere would be no real distinction between originating and continuing\ncreation. If, on the other hand, the world had a beginning in time,\nthen, on classical theism, it still needs to be kept in being moment\nby moment. The stratagem proposed by Greeley above does not appear to\nallow the proponent of divine simplicity to evade the conclusion that,\nif the simple God creates, then the product of his creative act\nnecessarily exists.\n\n(6) Accept both DDS and the modal contingency of creatures, but reject\nwhat Steven Nemes calls the difference principle (DP)\naccording to which “A difference in the effect presupposes a\ndifference in the cause.” (Nemes 2020, 109) If the created and\nongoingly sustained universe U is contingent, then U might never have\nexisted, and at any given time t at which U exists it might not have\nexisted at t. (God could, so to speak, ‘pull the plug’ on\nthe world at any time.) By DP, the difference in the effect (U’s\nexisting versus U’s not existing) presupposes and thus entails a\ndifference in the cause, namely, God. So on the DP, had God not\ncreated U, then there would have had to have been a difference in the\ncause (God’s actually creating U versus God’s possibly not\ncreating U). But then God would not be actus purus, pure\nactuality bare of all potency. “It is clear, therefore, that the\ndifference principle is at the heart of the argument from modal\ncollapse.” (Nemes 2020, 110) Therefore, to uphold both DDS and\nthe modal contingency of concrete creatures, the DP must be rejected.\nAccordingly, there is no difference within the simple God between his\ncreating U1 and his creating the numerically different U2, and no\ndifference between either and God’s creating nothing at all. The\ndifference between some U existing and no U existing on the current\nproposal reflects no difference in the divine cause. It is all the\nsame to God whether a universe exists or no universe exists. If God is\nidentical to his creating of something, and God is identical to his\ncreating of nothing, then God’s creating of something is\nidentical to God’s creating of nothing. That is, had God not\ncreated our universe U, he would not have been any different than he\nis is given that he has created U. God + U = God. God − U =\nGod.\n\nThe most obvious objection to this attempt at turning aside the MCA is\nthat it is merely ad hoc. If in every other conceivable case\nof agent causation the DP holds, then to deny its application in the\ncase of divine agent causation has no motivation except to avoid the\ndifficulty that MCA presents. But this allegation of\n‘ad-hoc-ness’ is not decisive since Nemes and Co.\nare free to assert that the divine case is sui generis.\nFurthermore, if one can bring oneself to accept both DDS and the\ncontingency of concrete creatures, then why balk at the rejection of\nDP? Everyone ought to admit that DDS is a ‘hard saying’\ndespite the good, though not absolutely compelling, arguments for it.\nThere are good reasons to accept both limbs of the problematic dyad,\nDDS and the modal contingency of concrete creatures. If the only way\nto uphold both is by rejecting DP, then so be it and one must\n‘bite the bullet.’ But then divine agent causation is so\nunlike ordinary agent causation that we lose our grip on the former:\nit threatens to peter out into unintelligibility. So it looks as if\nthe acceptors and the rejectors of the DP are in a stand-off. Suppose\nthe following are individually plausible but collectively\ninconsistent: DDS, DP, and the modal contingency of concrete\ncreatures. Suppose further that there are no true contradictions. Then\none of the propositions must be rejected. Some theists will reject\nDDS; some will reject DP; some will reject the modal contingency of\nconcrete creatures. We now turn to a solution via rejection of the\nthird proposition.\n\n(7) Accept DDS but deny the modal contingency of creatures by holding\nan emanationist view of creation along Avicennian lines according to\nwhich God must create, so that whatever is created is necessary, but\nnot necessary in the way that God is necessary. (Andani 2022) On this\napproach, the original modal collapse problem is solved by rejection\nof the second limb of the problematic dyad, namely, the modal\ncontingency of concrete creatures. But a kind of modal difference is\npreserved in that the divine necessity is held to be absolute whereas\nthe necessity of concrete creatures is held to be from another,\nnamely, from God who alone is absolutely necessary. The key idea here\nis that all creatures are modally necessary, not just the\nabstract ones. (Andani 2022, 15)\n\nWe have already noted that a classical theist can easily allow for a\ndifference between the divine necessity and the necessity of\nsome creatures, namely, those that are co-eternal with God.\nEternal objects other than God such as numbers possess necessary\nexistence through another. What classical Christian theists cannot\nsay, however, given their commitment to the creation of the material\nworld ex nihilo, is that all creatures possess\nnecessary existence through another. For if they said that, then the\nmodal contingency of concrete creatures would go by the boards, and it\nwould then not be the case that God might not have created a material\nuniverse. Not being emanationists, classical Christian theists uphold\nthe possibility that God not create any material beings at all.\nIslamic neoplatonists, however, being emanationists, do not adhere to\ncreatio ex nihilo but to creatio ex deo . This\nallows them to lump together “metaphysically necessary\nbeings” and “actual necessary beings: temporal material\nsubstances.” (Andani 2022, 13) Among the latter we find such\nconcrete items as cats and tables. These are temporal material\nsubstances in Aristotle’s sense of prote ousiai.\nBecause their existence is necessitated by God, they are necessary\nfrom another, unlike God who is not caused by another and is therefore\nnecessary in himself. “Although God and His creation are\nlogically necessary and exist across all possible worlds, they retain\ndifferent modal categories within Ibn Sina’s [Avicenna’s]\nmodal framework.” (Andani 2022, 15) Thus “… there\nis no real modal collapse for the Islamic philosopher working\nwithin the broader Islamic Neoplatonic tradition.” (Andani 2022,\n13, emphasis in original) To further spell it out, there are three\nclasses of necessary beings, where a necessary being is one that\nexists in all broadly logically possible worlds, namely, God who\nexists a se, eternal beings other than God that depend for\ntheir existence on God and thus exist ab alio, and thirdly\n“temporal existents actualized and necessary through\nanother” which also exist ab alio.(Andani 2022, 30)\n\nAnd so the Islamic Neoplatonist accepts the modal collapse\nthat most Christian classical theists fear by positively affirming\nthat everything is necessary in the ‘possible\nworlds’ sense. But “there is no real modal\ncollapse for the Islamic philosopher” (Andani 2022, 13) because\nabsolute necessity is understood as ontological independence and\ncontingency is understood as ontological (existential) dependence.\nThere is no collapse because of the deep difference between two modes\nof existence, existence a se and existence ab alio.\nThus God and Socrates differ in the way they exist. The essence of\nSocrates, considered in and of itself, may or may not exist. It is\n“possible in itself.” Since this essence, so considered,\nmay or may not exist, if it does come to exist in actuality, it must\nhave a cause or causes of its coming to exist in actuality. These\ncauses necessitate its existence. “Therefore, the\npossible in itself — when it actually exists — has the\nmodal status of ‘necessary existence through another’\n(wajib al-wujud li-ghayrihi) and [is therefore] dependent\nupon a distinct cause for its existence.” (Andani 2022, 10.)\n",
    "section_title": "7.3 Solutions to the Problem of Modal Collapse",
    "entry_title": "Divine Simplicity",
    "hierarchy_title": "Divine Simplicity || The Modal Collapse Objection to DDS || Solutions to the Problem of Modal Collapse",
    "tokenized_text": [
        "modal",
        "collapse",
        "objection",
        "dd",
        "solution",
        "problem",
        "modal",
        "collapse",
        "solution",
        "problem",
        "modal",
        "collapse",
        "reject",
        "theism",
        "one",
        "might",
        "argue",
        "follows",
        "nothing",
        "could",
        "count",
        "god",
        "simple",
        "divine",
        "simplicity",
        "logically",
        "contradictory",
        "whatever",
        "logically",
        "contradictory",
        "exist",
        "therefore",
        "god",
        "exist",
        "solution",
        "dissolution",
        "accept",
        "traditional",
        "theism",
        "reject",
        "dd",
        "many",
        "christian",
        "theist",
        "protestant",
        "especially",
        "simply",
        "deny",
        "divine",
        "simplicity",
        "alvin",
        "plantinga",
        "example",
        "christian",
        "theist",
        "reject",
        "dd",
        "plantinga",
        "followed",
        "many",
        "others",
        "moreland",
        "craig",
        "hasker",
        "accept",
        "dd",
        "reject",
        "commitment",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "either",
        "christian",
        "way",
        "pedersen",
        "lilley",
        "islamic",
        "way",
        "andani",
        "islamic",
        "way",
        "specified",
        "accept",
        "limb",
        "problematic",
        "dyad",
        "despite",
        "apparent",
        "inconsistency",
        "either",
        "holding",
        "true",
        "contradiction",
        "le",
        "drastically",
        "b",
        "holding",
        "true",
        "contradiction",
        "present",
        "state",
        "prevented",
        "cognitive",
        "architecture",
        "understanding",
        "limb",
        "problematic",
        "dyad",
        "could",
        "true",
        "option",
        "may",
        "dubbed",
        "mysterian",
        "first",
        "could",
        "called",
        "extreme",
        "second",
        "moderate",
        "mysterianism",
        "dolezal",
        "seems",
        "moderate",
        "type",
        "see",
        "section",
        "must",
        "remain",
        "mystery",
        "life",
        "could",
        "true",
        "god",
        "simple",
        "concrete",
        "creature",
        "modally",
        "contingent",
        "yet",
        "true",
        "without",
        "violation",
        "law",
        "noncontradiction",
        "accept",
        "dd",
        "hold",
        "necessity",
        "possibility",
        "applicable",
        "god",
        "de",
        "de",
        "dicto",
        "miller",
        "problem",
        "arises",
        "think",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "requires",
        "god",
        "ability",
        "otherwise",
        "done",
        "modality",
        "applicable",
        "god",
        "de",
        "dicto",
        "false",
        "say",
        "god",
        "de",
        "deo",
        "could",
        "done",
        "otherwise",
        "problem",
        "supposedly",
        "avoided",
        "accept",
        "dd",
        "hold",
        "creature",
        "really",
        "distinct",
        "divine",
        "creating",
        "thus",
        "different",
        "modal",
        "status",
        "divine",
        "act",
        "whereby",
        "created",
        "nathan",
        "greeley",
        "writes",
        "say",
        "god",
        "activity",
        "knowing",
        "willing",
        "exist",
        "necessarily",
        "say",
        "created",
        "object",
        "knowing",
        "willing",
        "must",
        "also",
        "exist",
        "necessarily",
        "long",
        "created",
        "object",
        "considered",
        "really",
        "distinct",
        "act",
        "known",
        "willed",
        "object",
        "need",
        "modal",
        "status",
        "act",
        "god",
        "one",
        "say",
        "necessarily",
        "know",
        "necessarily",
        "will",
        "absolute",
        "manner",
        "least",
        "particular",
        "object",
        "knowledge",
        "contingent",
        "greeley",
        "idea",
        "god",
        "necessarily",
        "creates",
        "thus",
        "could",
        "failed",
        "create",
        "nevertheless",
        "contingent",
        "ie",
        "possibly",
        "nonexistent",
        "might",
        "true",
        "one",
        "way",
        "suppose",
        "god",
        "creating",
        "thing",
        "simultaneously",
        "release",
        "ontological",
        "independence",
        "divine",
        "creative",
        "act",
        "make",
        "thing",
        "exist",
        "exists",
        "exists",
        "power",
        "without",
        "divine",
        "assistance",
        "word",
        "god",
        "creates",
        "thing",
        "creates",
        "way",
        "existence",
        "moment",
        "moment",
        "depend",
        "god",
        "ongoing",
        "creative",
        "sustenance",
        "initial",
        "creative",
        "action",
        "continues",
        "existential",
        "intertia",
        "nature",
        "creation",
        "created",
        "entity",
        "could",
        "well",
        "contingent",
        "despite",
        "creative",
        "act",
        "necessary",
        "created",
        "entity",
        "exist",
        "first",
        "place",
        "would",
        "necessary",
        "god",
        "create",
        "entity",
        "exists",
        "contingently",
        "scheme",
        "creatio",
        "originans",
        "originating",
        "creation",
        "creatio",
        "continuans",
        "continuing",
        "creation",
        "allows",
        "originally",
        "caused",
        "exist",
        "contingent",
        "unfortunately",
        "understanding",
        "creation",
        "foreign",
        "classical",
        "theism",
        "classical",
        "theism",
        "creation",
        "originating",
        "continuing",
        "addition",
        "classical",
        "theism",
        "need",
        "insist",
        "reality",
        "originatingcontinuing",
        "distinction",
        "even",
        "world",
        "created",
        "realm",
        "infinite",
        "past",
        "always",
        "existed",
        "could",
        "nonetheless",
        "creaturely",
        "status",
        "case",
        "would",
        "real",
        "distinction",
        "originating",
        "continuing",
        "creation",
        "hand",
        "world",
        "beginning",
        "time",
        "classical",
        "theism",
        "still",
        "need",
        "kept",
        "moment",
        "moment",
        "stratagem",
        "proposed",
        "greeley",
        "appear",
        "allow",
        "proponent",
        "divine",
        "simplicity",
        "evade",
        "conclusion",
        "simple",
        "god",
        "creates",
        "product",
        "creative",
        "act",
        "necessarily",
        "exists",
        "accept",
        "dd",
        "modal",
        "contingency",
        "creature",
        "reject",
        "steven",
        "nemes",
        "call",
        "difference",
        "principle",
        "dp",
        "according",
        "difference",
        "effect",
        "presupposes",
        "difference",
        "cause",
        "nemes",
        "created",
        "ongoingly",
        "sustained",
        "universe",
        "u",
        "contingent",
        "u",
        "might",
        "never",
        "existed",
        "given",
        "time",
        "u",
        "exists",
        "might",
        "existed",
        "t",
        "god",
        "could",
        "speak",
        "pull",
        "plug",
        "world",
        "time",
        "dp",
        "difference",
        "effect",
        "u",
        "existing",
        "versus",
        "u",
        "existing",
        "presupposes",
        "thus",
        "entail",
        "difference",
        "cause",
        "namely",
        "god",
        "dp",
        "god",
        "created",
        "u",
        "would",
        "difference",
        "cause",
        "god",
        "actually",
        "creating",
        "u",
        "versus",
        "god",
        "possibly",
        "creating",
        "u",
        "god",
        "would",
        "actus",
        "purus",
        "pure",
        "actuality",
        "bare",
        "potency",
        "clear",
        "therefore",
        "difference",
        "principle",
        "heart",
        "argument",
        "modal",
        "collapse",
        "nemes",
        "therefore",
        "uphold",
        "dd",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "dp",
        "must",
        "rejected",
        "accordingly",
        "difference",
        "within",
        "simple",
        "god",
        "creating",
        "u",
        "creating",
        "numerically",
        "different",
        "u",
        "difference",
        "either",
        "god",
        "creating",
        "nothing",
        "difference",
        "u",
        "existing",
        "u",
        "existing",
        "current",
        "proposal",
        "reflects",
        "difference",
        "divine",
        "cause",
        "god",
        "whether",
        "universe",
        "exists",
        "universe",
        "exists",
        "god",
        "identical",
        "creating",
        "something",
        "god",
        "identical",
        "creating",
        "nothing",
        "god",
        "creating",
        "something",
        "identical",
        "god",
        "creating",
        "nothing",
        "god",
        "created",
        "universe",
        "u",
        "would",
        "different",
        "given",
        "created",
        "u",
        "god",
        "u",
        "god",
        "god",
        "u",
        "god",
        "obvious",
        "objection",
        "attempt",
        "turning",
        "aside",
        "mca",
        "merely",
        "ad",
        "hoc",
        "every",
        "conceivable",
        "case",
        "agent",
        "causation",
        "dp",
        "hold",
        "deny",
        "application",
        "case",
        "divine",
        "agent",
        "causation",
        "motivation",
        "except",
        "avoid",
        "difficulty",
        "mca",
        "present",
        "allegation",
        "adhocness",
        "decisive",
        "since",
        "nemes",
        "co",
        "free",
        "assert",
        "divine",
        "case",
        "sui",
        "generis",
        "furthermore",
        "one",
        "bring",
        "oneself",
        "accept",
        "dd",
        "contingency",
        "concrete",
        "creature",
        "balk",
        "rejection",
        "dp",
        "everyone",
        "ought",
        "admit",
        "dd",
        "hard",
        "saying",
        "despite",
        "good",
        "though",
        "absolutely",
        "compelling",
        "argument",
        "good",
        "reason",
        "accept",
        "limb",
        "problematic",
        "dyad",
        "dd",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "way",
        "uphold",
        "rejecting",
        "dp",
        "one",
        "must",
        "bite",
        "bullet",
        "divine",
        "agent",
        "causation",
        "unlike",
        "ordinary",
        "agent",
        "causation",
        "lose",
        "grip",
        "former",
        "threatens",
        "peter",
        "unintelligibility",
        "look",
        "acceptor",
        "rejectors",
        "dp",
        "standoff",
        "suppose",
        "following",
        "individually",
        "plausible",
        "collectively",
        "inconsistent",
        "dd",
        "dp",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "suppose",
        "true",
        "contradiction",
        "one",
        "proposition",
        "must",
        "rejected",
        "theist",
        "reject",
        "dd",
        "reject",
        "dp",
        "reject",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "turn",
        "solution",
        "via",
        "rejection",
        "third",
        "proposition",
        "accept",
        "dd",
        "deny",
        "modal",
        "contingency",
        "creature",
        "holding",
        "emanationist",
        "view",
        "creation",
        "along",
        "avicennian",
        "line",
        "according",
        "god",
        "must",
        "create",
        "whatever",
        "created",
        "necessary",
        "necessary",
        "way",
        "god",
        "necessary",
        "andani",
        "approach",
        "original",
        "modal",
        "collapse",
        "problem",
        "solved",
        "rejection",
        "second",
        "limb",
        "problematic",
        "dyad",
        "namely",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "kind",
        "modal",
        "difference",
        "preserved",
        "divine",
        "necessity",
        "held",
        "absolute",
        "whereas",
        "necessity",
        "concrete",
        "creature",
        "held",
        "another",
        "namely",
        "god",
        "alone",
        "absolutely",
        "necessary",
        "key",
        "idea",
        "creature",
        "modally",
        "necessary",
        "abstract",
        "one",
        "andani",
        "already",
        "noted",
        "classical",
        "theist",
        "easily",
        "allow",
        "difference",
        "divine",
        "necessity",
        "necessity",
        "creature",
        "namely",
        "coeternal",
        "god",
        "eternal",
        "object",
        "god",
        "number",
        "posse",
        "necessary",
        "existence",
        "another",
        "classical",
        "christian",
        "theist",
        "say",
        "however",
        "given",
        "commitment",
        "creation",
        "material",
        "world",
        "ex",
        "nihilo",
        "creature",
        "posse",
        "necessary",
        "existence",
        "another",
        "said",
        "modal",
        "contingency",
        "concrete",
        "creature",
        "would",
        "go",
        "board",
        "would",
        "case",
        "god",
        "might",
        "created",
        "material",
        "universe",
        "emanationists",
        "classical",
        "christian",
        "theist",
        "uphold",
        "possibility",
        "god",
        "create",
        "material",
        "being",
        "islamic",
        "neoplatonist",
        "however",
        "emanationists",
        "adhere",
        "creatio",
        "ex",
        "nihilo",
        "creatio",
        "ex",
        "deo",
        "allows",
        "lump",
        "together",
        "metaphysically",
        "necessary",
        "being",
        "actual",
        "necessary",
        "being",
        "temporal",
        "material",
        "substances",
        "andani",
        "among",
        "latter",
        "find",
        "concrete",
        "item",
        "cat",
        "table",
        "temporal",
        "material",
        "substance",
        "aristotle",
        "sense",
        "prote",
        "ousiai",
        "existence",
        "necessitated",
        "god",
        "necessary",
        "another",
        "unlike",
        "god",
        "caused",
        "another",
        "therefore",
        "necessary",
        "although",
        "god",
        "creation",
        "logically",
        "necessary",
        "exist",
        "across",
        "possible",
        "world",
        "retain",
        "different",
        "modal",
        "category",
        "within",
        "ibn",
        "sina",
        "avicenna",
        "modal",
        "framework",
        "andani",
        "thus",
        "real",
        "modal",
        "collapse",
        "islamic",
        "philosopher",
        "working",
        "within",
        "broader",
        "islamic",
        "neoplatonic",
        "tradition",
        "andani",
        "emphasis",
        "original",
        "spell",
        "three",
        "class",
        "necessary",
        "being",
        "necessary",
        "one",
        "exists",
        "broadly",
        "logically",
        "possible",
        "world",
        "namely",
        "god",
        "exists",
        "se",
        "eternal",
        "being",
        "god",
        "depend",
        "existence",
        "god",
        "thus",
        "exist",
        "ab",
        "alio",
        "thirdly",
        "temporal",
        "existents",
        "actualized",
        "necessary",
        "another",
        "also",
        "exist",
        "ab",
        "alio",
        "andani",
        "islamic",
        "neoplatonist",
        "accepts",
        "modal",
        "collapse",
        "christian",
        "classical",
        "theist",
        "fear",
        "positively",
        "affirming",
        "everything",
        "necessary",
        "possible",
        "world",
        "sense",
        "real",
        "modal",
        "collapse",
        "islamic",
        "philosopher",
        "andani",
        "absolute",
        "necessity",
        "understood",
        "ontological",
        "independence",
        "contingency",
        "understood",
        "ontological",
        "existential",
        "dependence",
        "collapse",
        "deep",
        "difference",
        "two",
        "mode",
        "existence",
        "existence",
        "se",
        "existence",
        "ab",
        "alio",
        "thus",
        "god",
        "socrates",
        "differ",
        "way",
        "exist",
        "essence",
        "socrates",
        "considered",
        "may",
        "may",
        "exist",
        "possible",
        "itself",
        "since",
        "essence",
        "considered",
        "may",
        "may",
        "exist",
        "come",
        "exist",
        "actuality",
        "must",
        "cause",
        "cause",
        "coming",
        "exist",
        "actuality",
        "cause",
        "necessitate",
        "existence",
        "therefore",
        "possible",
        "actually",
        "exists",
        "modal",
        "status",
        "necessary",
        "existence",
        "another",
        "wajib",
        "alwujud",
        "lighayrihi",
        "therefore",
        "dependent",
        "upon",
        "distinct",
        "cause",
        "existence",
        "andani"
    ]
}