{
    "main_text": "The ‘Most of the Things He Could have Done’ Account\n7. The ‘Most of the Things He Could have Done’ Account\n\nJonathan Bennett thinks that the fundamental distinction between doing\nand allowing is between cases where the upshot occurs because of\none’s action and cases where the upshot occurs because of\none’s inaction—although he prefers to replace\n“action/inaction” talk with “positive/negative\nfact” talk (Bennett 1967, 1981, 1993, 1995). When Bennett\ndiscusses the contrast between positive and negative relevance to\nharm, he is attempting to capture a deep, philosophically interesting\ndistinction that underlies our talk of ‘doing and\nallowing’ ‘making and letting’,‘killing and\nletting die’. He acknowledges that the correspondence between\nhis distinction and the distinctions we make in everyday life and\nlanguage may be inexact. He says that my behavior is negatively\nrelevant to an upshot if a negative fact about my behavior is the\nleast informative fact that suffices to complete a causal explanation\nof it; whereas my behavior is positively relevant to that upshot if a\npositive fact about my behavior is the least informative fact about my\nconduct that suffices to complete a causal explanation of it. For\nexample, if I jog while you drown, your drowning could be explained by\nthe fact that I jogged, but it could also be explained by the less\ninformative fact that I did not pull you out of the water.\n\nIn a nutshell, on Bennett’s view, an agent’s relevance to\nan upshot is positive if most of the ways she could have behaved at\nthe time would not have led to the upshot; otherwise, it is\n negative.[17]\n For example, suppose I douse a slug with salt and it dies as a\nresult. My relevance to its demise is positive, since most of the ways\nI could have behaved would not have led to the death. On the other\nhand, if it dies because I fail to move it from the path of a car,\nthen most of the ways I could have behaved at the time would have led\nto its death, so my relevance to the death is negative.\n\nMost people conclude that on this account doing harm is in itself no\nworse than allowing harm. If some upshot obtains because of the way\nyou behaved, then the fact that there were many ways (rather than only\na few) you could have behaved which would also have had that result\nmay seem obviously morally\n insignificant.[18]\n This conclusion is surprising, even shocking. Bennett’s\naccount, however, does offer an alternative explanation of why we tend\nto think of killing as worse than letting die. He claims, quite\nplausibly, that it is morally worse to be causally relevant to a bad\nupshot one could easily have avoided than a similarly bad upshot one\ncould have avoided only with great difficulty. If most of the ways one\ncould have behaved would have led to an upshot, then it was probably\nsomewhat difficult or onerous to avoid the upshot; whereas if most of\nthe ways one could have behaved would not have led to an upshot, then\nit was probably fairly easy to avoid the upshot. However, on\nBennett’s view when killing and letting die are equally\ndifficult to avoid, and all other factors are equal, then there is no\nmoral difference between them. Thus the doing/allowing distinction is\nnot itself morally relevant. \n\nThe two most persistent objections to Bennett’s accounts are the\nImmobility Objection and the Sassan Counterexample. There are two\ntypes of Immobility Counterexample:\n\n\nImmobility 1: If Henry stays completely still, dust will settle and\nclose a tiny electric circuit, setting off an explosion which will\nkill Bill. If Henry makes any move whatsoever, the dust will not\nsettle and the circuit will not close (Quinn 1989, 295).\n\nImmobility 2: If Henry makes any move whatsoever, he will set off a\nmotion detector which will set off an explosion, killing Bill. If he\nstays completely still, the motion sensor will not go off and Bill\nwill not die (Quinn 1989, 296).\n\n\nMost ways Henry could move in Immobility 1 would not lead to\nBill’s death. Thus on Bennett’s account, Henry counts as\npositively relevant to Bill’s death if he stays still and the\ndust settles on the circuit in Immobility 1. This conflicts with our\nintuition that Henry would merely allow Bill to die by staying still.\nOn the other hand, most ways Henry could move in Immobility 2 would\nlead to Bill’s death. Thus on Bennett’s account Henry is\nnegatively relevant to Bill’s death if he waves an arm and sets\noff the motion sensor in Immobility 2. Again, this conflicts with our\nintuitions: intuitively waving an arm and setting off the explosion\nwould be killing Bill. As Quinn (1989, 296) notes, Bennett’s\naccount also clashes with our moral intuitions. It seems permissible\nfor Henry to stay still in Immobility 1 if this is necessary to save\nfive other lives even if Bill will die, but impermissible for him to\nmove to save five others in Immobility 2 if he would thereby set off\nthe motion sensor and kill Bill. \n\nSome\n philosophers[19]\n argue that such examples refute Bennett’s account because\nBennett wrongly classifies immobility as positive and motion as\nnegative. The suggestion is that immobility is incompatible with\npositive relevance to an upshot. Nifty slogan: ‘You cannot do\nanything by doing nothing.’ \n\nHowever, there are some cases which do intuitively involve doing harm\nby remaining still. In Bennett’s example, Agent finds himself\nsitting on Patient’s chest. If he makes any move, this will\nrelieve the pressure enough for her to breathe, but if he stays still\nshe will suffocate and die (Bennett 1995, 98).\n\nBennett attempts to explain away the intuition that immobility is\nnegative by arguing that we are misled by the fact that in most actual\nstates of affairs, for any upshot that we care about, staying still\nwill be on “the roomy side of the line.” As Bennett notes:\n“It takes work to rig things so that keeping still is almost the\nonly route to some interesting upshot. Perhaps this is why, when\npeople confront a result that is produced by Agent’s immobility,\nthey immediately and invalidly infer that this is a case of\nallowing” (Bennett 1995, 99).\n\nBennett also suggests that our intuitions about doing and allowing are\nresponsive to two distinctions: his positive/negative distinction and\nthe active/passive distinction identified by Alan Donagan (see the\nsection on\n counterfactual accounts).\n An agent is active relative to an upshot if the upshot would not have\noccurred if the agent had temporarily lost the power of agency, i.e.\nhad been temporarily asleep or unconscious. Bennett asks us to imagine\nthat Henry finds it very difficult to stay still and he “sweats\nand strains” against bodily spasms to do so. He suggests that in\nthis case, where both analyses agree, we will see Henry’s\nbehaviour as doing. On the other hand, when the two distinctions\ndisagree, the resulting uncertainty will allow our rule of thumb (rest\nequals allowing and motion equals doing) to prevail (Bennett 1995, 99,\n113).\n\nHoward-Snyder (2002) is responsible for the second persistent\nobjection to Bennett’s account. In Howard-Snyder’s Sassan\ncounterexample, “An assassin, A. Sassan, is preparing to\nassassinate Victor by shooting him. A second assassin, Baxter, is\nwaiting across the street watching Sassan to ensure his success. If\nSassan shows any signs of hesitation, Baxter will shoot Victor\nhimself. Suppose Sassan knows about Baxter and his intentions and also\nknows that he can turn his gun on Baxter instead of on Victor if he so\nchooses. Although this thought crosses his mind, he quickly suppresses\nit, since he is committed to Victor’s annihilation. He shoots\nVictor and Victor dies instantly.” Most of the ways Sassan could\nhave behaved would have led to the shooting and death of Victor\n(either by himself or by Baxter). So it looks like Bennett’s\naccount will classify Sassan as negatively relevant to Victor’s\ndeath e.g. as merely letting Victor die. But as Howard-Snyder points\nout, “I just said that Sassan shot Victor. He pulled the\ntrigger. The gun fired. A bullet flew out of the barrel and entered\nVictor’s body. Victor died from the bullet wound. A clearer case\nof killing is impossible to find” (Howard-Snyder 2002). Bennett\nmight repeat the point that positive relevance to a death is not\nexactly the same as killing. Nevertheless, insofar as we have any\npre-theoretical grip on (and interest in) the concept of positive\nrelevance to a death, Sassan’s relevance to Victor’s death\nmust strike us as positive rather than\n negative.[20]\n And yet Bennett’s account implies that it is negative.\n\nIn response, Bennett has pointed out that the upshot that concerns us\nis not the fact that Victor died (no-one could prevent that) but the\nfact that Victor died at T (or perhaps, the fact that Victor\ndied no later than\n T).[21]\n He suggested that perhaps Sassan is positively relevant to that,\nsince most of the ways he could have behaved would have resulted in\nVictor’s dying later than T. But we could, with minimal\nartifice, ensure that Baxter is disposed to kill Victor at exactly\nT if Sassan does not. For example, we could imagine that\nthere is only a fraction of a second when Victor is vulnerable to a\nbullet and that Baxter is located closer to him (or has a faster\nacting gun) so that there is a moment T2 such that\nif Sassan does not shoot at T2, he will not\nsucceed in killing Victor, but such that Baxter still has a chance to\nget a shot off at T1 with the result that Victor\nwill die at T (Howard-Snyder 2002).\n\nHoward-Snyder (2002) also explores responses which try to get the\nright result by narrowing the description of the upshot. Perhaps\nsomeone may try to argue that Sassan is positively relevant to\nsomething—the fact that Victor is killed with this bullet rather\nthan that, or more simply the fact that Victor is killed by him rather\nthan by Baxter. Howard-Snyder argues that the latter suggestion will\nnot do, since it begs the question. Bennett cannot assume that his\naccount implies that Sassan kills Victor, since that is the very claim\nat issue. Howard-Snyder (2002) also dismisses the suggestion that\nSassan is positively relevant to Victor’s being killed with this\nbullet rather than that, for we can modify the story in such a way\nthat if Sassan does not pull the trigger, Baxter can push a switch\nthat will guarantee that the gun\n fires.T).[22]\n",
    "section_title": "7. The ‘Most of the Things He Could have Done’ Account",
    "entry_title": "Doing vs. Allowing Harm",
    "hierarchy_title": "Doing vs. Allowing Harm || The ‘Most of the Things He Could have Done’ Account",
    "tokenized_text": [
        "thing",
        "could",
        "done",
        "account",
        "thing",
        "could",
        "done",
        "account",
        "jonathan",
        "bennett",
        "think",
        "fundamental",
        "distinction",
        "allowing",
        "case",
        "upshot",
        "occurs",
        "one",
        "action",
        "case",
        "upshot",
        "occurs",
        "one",
        "inactionalthough",
        "prefers",
        "replace",
        "actioninaction",
        "talk",
        "positivenegative",
        "fact",
        "talk",
        "bennett",
        "bennett",
        "discus",
        "contrast",
        "positive",
        "negative",
        "relevance",
        "harm",
        "attempting",
        "capture",
        "deep",
        "philosophically",
        "interesting",
        "distinction",
        "underlies",
        "talk",
        "allowing",
        "making",
        "letting",
        "killing",
        "letting",
        "die",
        "acknowledges",
        "correspondence",
        "distinction",
        "distinction",
        "make",
        "everyday",
        "life",
        "language",
        "may",
        "inexact",
        "say",
        "behavior",
        "negatively",
        "relevant",
        "upshot",
        "negative",
        "fact",
        "behavior",
        "least",
        "informative",
        "fact",
        "suffices",
        "complete",
        "causal",
        "explanation",
        "whereas",
        "behavior",
        "positively",
        "relevant",
        "upshot",
        "positive",
        "fact",
        "behavior",
        "least",
        "informative",
        "fact",
        "conduct",
        "suffices",
        "complete",
        "causal",
        "explanation",
        "example",
        "jog",
        "drown",
        "drowning",
        "could",
        "explained",
        "fact",
        "jogged",
        "could",
        "also",
        "explained",
        "le",
        "informative",
        "fact",
        "pull",
        "water",
        "nutshell",
        "bennett",
        "view",
        "agent",
        "relevance",
        "upshot",
        "positive",
        "way",
        "could",
        "behaved",
        "time",
        "would",
        "led",
        "upshot",
        "otherwise",
        "negative",
        "example",
        "suppose",
        "douse",
        "slug",
        "salt",
        "dy",
        "result",
        "relevance",
        "demise",
        "positive",
        "since",
        "way",
        "could",
        "behaved",
        "would",
        "led",
        "death",
        "hand",
        "dy",
        "fail",
        "move",
        "path",
        "car",
        "way",
        "could",
        "behaved",
        "time",
        "would",
        "led",
        "death",
        "relevance",
        "death",
        "negative",
        "people",
        "conclude",
        "account",
        "harm",
        "worse",
        "allowing",
        "harm",
        "upshot",
        "obtains",
        "way",
        "behaved",
        "fact",
        "many",
        "way",
        "rather",
        "could",
        "behaved",
        "would",
        "also",
        "result",
        "may",
        "seem",
        "obviously",
        "morally",
        "insignificant",
        "conclusion",
        "surprising",
        "even",
        "shocking",
        "bennett",
        "account",
        "however",
        "offer",
        "alternative",
        "explanation",
        "tend",
        "think",
        "killing",
        "worse",
        "letting",
        "die",
        "claim",
        "quite",
        "plausibly",
        "morally",
        "worse",
        "causally",
        "relevant",
        "bad",
        "upshot",
        "one",
        "could",
        "easily",
        "avoided",
        "similarly",
        "bad",
        "upshot",
        "one",
        "could",
        "avoided",
        "great",
        "difficulty",
        "way",
        "one",
        "could",
        "behaved",
        "would",
        "led",
        "upshot",
        "probably",
        "somewhat",
        "difficult",
        "onerous",
        "avoid",
        "upshot",
        "whereas",
        "way",
        "one",
        "could",
        "behaved",
        "would",
        "led",
        "upshot",
        "probably",
        "fairly",
        "easy",
        "avoid",
        "upshot",
        "however",
        "bennett",
        "view",
        "killing",
        "letting",
        "die",
        "equally",
        "difficult",
        "avoid",
        "factor",
        "equal",
        "moral",
        "difference",
        "thus",
        "doingallowing",
        "distinction",
        "morally",
        "relevant",
        "two",
        "persistent",
        "objection",
        "bennett",
        "account",
        "immobility",
        "objection",
        "sassan",
        "counterexample",
        "two",
        "type",
        "immobility",
        "counterexample",
        "immobility",
        "henry",
        "stay",
        "completely",
        "still",
        "dust",
        "settle",
        "close",
        "tiny",
        "electric",
        "circuit",
        "setting",
        "explosion",
        "kill",
        "bill",
        "henry",
        "make",
        "move",
        "whatsoever",
        "dust",
        "settle",
        "circuit",
        "close",
        "quinn",
        "immobility",
        "henry",
        "make",
        "move",
        "whatsoever",
        "set",
        "motion",
        "detector",
        "set",
        "explosion",
        "killing",
        "bill",
        "stay",
        "completely",
        "still",
        "motion",
        "sensor",
        "go",
        "bill",
        "die",
        "quinn",
        "way",
        "henry",
        "could",
        "move",
        "immobility",
        "would",
        "lead",
        "bill",
        "death",
        "thus",
        "bennett",
        "account",
        "henry",
        "count",
        "positively",
        "relevant",
        "bill",
        "death",
        "stay",
        "still",
        "dust",
        "settle",
        "circuit",
        "immobility",
        "conflict",
        "intuition",
        "henry",
        "would",
        "merely",
        "allow",
        "bill",
        "die",
        "staying",
        "still",
        "hand",
        "way",
        "henry",
        "could",
        "move",
        "immobility",
        "would",
        "lead",
        "bill",
        "death",
        "thus",
        "bennett",
        "account",
        "henry",
        "negatively",
        "relevant",
        "bill",
        "death",
        "wave",
        "arm",
        "set",
        "motion",
        "sensor",
        "immobility",
        "conflict",
        "intuition",
        "intuitively",
        "waving",
        "arm",
        "setting",
        "explosion",
        "would",
        "killing",
        "bill",
        "quinn",
        "note",
        "bennett",
        "account",
        "also",
        "clash",
        "moral",
        "intuition",
        "seems",
        "permissible",
        "henry",
        "stay",
        "still",
        "immobility",
        "necessary",
        "save",
        "five",
        "life",
        "even",
        "bill",
        "die",
        "impermissible",
        "move",
        "save",
        "five",
        "others",
        "immobility",
        "would",
        "thereby",
        "set",
        "motion",
        "sensor",
        "kill",
        "bill",
        "philosopher",
        "argue",
        "example",
        "refute",
        "bennett",
        "account",
        "bennett",
        "wrongly",
        "classifies",
        "immobility",
        "positive",
        "motion",
        "negative",
        "suggestion",
        "immobility",
        "incompatible",
        "positive",
        "relevance",
        "upshot",
        "nifty",
        "slogan",
        "anything",
        "nothing",
        "however",
        "case",
        "intuitively",
        "involve",
        "harm",
        "remaining",
        "still",
        "bennett",
        "example",
        "agent",
        "find",
        "sitting",
        "patient",
        "chest",
        "make",
        "move",
        "relieve",
        "pressure",
        "enough",
        "breathe",
        "stay",
        "still",
        "suffocate",
        "die",
        "bennett",
        "bennett",
        "attempt",
        "explain",
        "away",
        "intuition",
        "immobility",
        "negative",
        "arguing",
        "misled",
        "fact",
        "actual",
        "state",
        "affair",
        "upshot",
        "care",
        "staying",
        "still",
        "roomy",
        "side",
        "line",
        "bennett",
        "note",
        "take",
        "work",
        "rig",
        "thing",
        "keeping",
        "still",
        "almost",
        "route",
        "interesting",
        "upshot",
        "perhaps",
        "people",
        "confront",
        "result",
        "produced",
        "agent",
        "immobility",
        "immediately",
        "invalidly",
        "infer",
        "case",
        "allowing",
        "bennett",
        "bennett",
        "also",
        "suggests",
        "intuition",
        "allowing",
        "responsive",
        "two",
        "distinction",
        "positivenegative",
        "distinction",
        "activepassive",
        "distinction",
        "identified",
        "alan",
        "donagan",
        "see",
        "section",
        "counterfactual",
        "account",
        "agent",
        "active",
        "relative",
        "upshot",
        "upshot",
        "would",
        "occurred",
        "agent",
        "temporarily",
        "lost",
        "power",
        "agency",
        "ie",
        "temporarily",
        "asleep",
        "unconscious",
        "bennett",
        "asks",
        "u",
        "imagine",
        "henry",
        "find",
        "difficult",
        "stay",
        "still",
        "sweat",
        "strain",
        "bodily",
        "spasm",
        "suggests",
        "case",
        "analysis",
        "agree",
        "see",
        "henry",
        "behaviour",
        "hand",
        "two",
        "distinction",
        "disagree",
        "resulting",
        "uncertainty",
        "allow",
        "rule",
        "thumb",
        "rest",
        "equal",
        "allowing",
        "motion",
        "equal",
        "prevail",
        "bennett",
        "howardsnyder",
        "responsible",
        "second",
        "persistent",
        "objection",
        "bennett",
        "account",
        "howardsnyder",
        "sassan",
        "counterexample",
        "assassin",
        "a",
        "sassan",
        "preparing",
        "assassinate",
        "victor",
        "shooting",
        "second",
        "assassin",
        "baxter",
        "waiting",
        "across",
        "street",
        "watching",
        "sassan",
        "ensure",
        "success",
        "sassan",
        "show",
        "sign",
        "hesitation",
        "baxter",
        "shoot",
        "victor",
        "suppose",
        "sassan",
        "know",
        "baxter",
        "intention",
        "also",
        "know",
        "turn",
        "gun",
        "baxter",
        "instead",
        "victor",
        "chooses",
        "although",
        "thought",
        "cross",
        "mind",
        "quickly",
        "suppresses",
        "since",
        "committed",
        "victor",
        "annihilation",
        "shoot",
        "victor",
        "victor",
        "dy",
        "instantly",
        "way",
        "sassan",
        "could",
        "behaved",
        "would",
        "led",
        "shooting",
        "death",
        "victor",
        "either",
        "baxter",
        "look",
        "like",
        "bennett",
        "account",
        "classify",
        "sassan",
        "negatively",
        "relevant",
        "victor",
        "death",
        "eg",
        "merely",
        "letting",
        "victor",
        "die",
        "howardsnyder",
        "point",
        "said",
        "sassan",
        "shot",
        "victor",
        "pulled",
        "trigger",
        "gun",
        "fired",
        "bullet",
        "flew",
        "barrel",
        "entered",
        "victor",
        "body",
        "victor",
        "died",
        "bullet",
        "wound",
        "clearer",
        "case",
        "killing",
        "impossible",
        "find",
        "howardsnyder",
        "bennett",
        "might",
        "repeat",
        "point",
        "positive",
        "relevance",
        "death",
        "exactly",
        "killing",
        "nevertheless",
        "insofar",
        "pretheoretical",
        "grip",
        "interest",
        "concept",
        "positive",
        "relevance",
        "death",
        "sassan",
        "relevance",
        "victor",
        "death",
        "must",
        "strike",
        "u",
        "positive",
        "rather",
        "negative",
        "yet",
        "bennett",
        "account",
        "implies",
        "negative",
        "response",
        "bennett",
        "pointed",
        "upshot",
        "concern",
        "u",
        "fact",
        "victor",
        "died",
        "noone",
        "could",
        "prevent",
        "fact",
        "victor",
        "died",
        "perhaps",
        "fact",
        "victor",
        "died",
        "later",
        "suggested",
        "perhaps",
        "sassan",
        "positively",
        "relevant",
        "since",
        "way",
        "could",
        "behaved",
        "would",
        "resulted",
        "victor",
        "dying",
        "later",
        "t",
        "could",
        "minimal",
        "artifice",
        "ensure",
        "baxter",
        "disposed",
        "kill",
        "victor",
        "exactly",
        "sassan",
        "example",
        "could",
        "imagine",
        "fraction",
        "second",
        "victor",
        "vulnerable",
        "bullet",
        "baxter",
        "located",
        "closer",
        "faster",
        "acting",
        "gun",
        "moment",
        "t",
        "sassan",
        "shoot",
        "t",
        "succeed",
        "killing",
        "victor",
        "baxter",
        "still",
        "chance",
        "get",
        "shot",
        "t",
        "result",
        "victor",
        "die",
        "howardsnyder",
        "howardsnyder",
        "also",
        "explores",
        "response",
        "try",
        "get",
        "right",
        "result",
        "narrowing",
        "description",
        "upshot",
        "perhaps",
        "someone",
        "may",
        "try",
        "argue",
        "sassan",
        "positively",
        "relevant",
        "somethingthe",
        "fact",
        "victor",
        "killed",
        "bullet",
        "rather",
        "simply",
        "fact",
        "victor",
        "killed",
        "rather",
        "baxter",
        "howardsnyder",
        "argues",
        "latter",
        "suggestion",
        "since",
        "begs",
        "question",
        "bennett",
        "assume",
        "account",
        "implies",
        "sassan",
        "kill",
        "victor",
        "since",
        "claim",
        "issue",
        "howardsnyder",
        "also",
        "dismisses",
        "suggestion",
        "sassan",
        "positively",
        "relevant",
        "victor",
        "killed",
        "bullet",
        "rather",
        "modify",
        "story",
        "way",
        "sassan",
        "pull",
        "trigger",
        "baxter",
        "push",
        "switch",
        "guarantee",
        "gun",
        "firest"
    ]
}