{
    "main_text": "‘Safety Net’ Cases\n8. ‘Safety Net’ Cases\n\nWhen we first describe the doing/allowing distinction, it is tempting\nto use standard doings and standard allowings of harm as examples. In\nstandard doings of harm, the agent performs some action, setting some\nphysical forces in motion which then run to the victim: Bob pushes a\nboulder which rolls down the hill and crushes Victor to death;\nBystander pulls a lever turning the trolley towards the one. In\nstandard allowing, the agent does not perform some action, refusing to\nintervene in some harmful sequence. \n\nWhat about cases where the agent removes a safety net from beneath a\nfalling victim, unplugs a respirator, kicks a rock out of the path of\nthe runaway vehicle, and other similar cases? In these cases, the\nagent performs some action but does not act on the victim directly.\nInstead, she removes some barrier to a harmful sequence. Such cases\nare now an important part of philosophical discussion of the\ndoing/allowing distinction, in part because of the recognition that\nsome apparently standard cases of doing in fact involve removing a\nbarrier. As Jonathan Schaffer (2000) has argued, in many guns, pulling\nthe trigger fires a bullet by essentially removing a barrier. \n\nThere are four main approaches to such ‘Safety Net’\nCases.\n\nUnified All Doings Accounts: The first approach treats all safety\nnet cases as doings because the upshot occurs because the agent does\nsomething. This in effect, seems to treat the action/inaction\ndistinction and the doing/allowing distinction as identical. Quinn\n(1989) and Bennett (1995) both endorse this approach to safety net\ncases.\nUnified All Allowings Accounts: The second approach treats all\nsafety net cases as mere allowings. This approach is commonly seen as\nfollowing Philippa Foot in holding that all safety net cases count as\nenabling harm (removing a barrier that would have prevented a harmful\n sequence).T).[23]\n For Foot, enabling is a species of allowing. Rickless (2011) endorses\nthis approach. \nNon-Unified Accounts: Others, such as McMahan (1993) and Woollard\n(2015), argue that some safety-net cases should be treated as doings\nand others as merely allowings. \n3rd Category Accounts: Finally, others such as Matthew Hanser\n(1999), Timothy Hall (2008) and Barry and Øverland (2016), argue that\nsafety net cases cannot be classified alongside either standard doings\nof harm or standard allowings of harm. They fall into a third\ncategory. \n\n\nNon-Unified Accounts may seem attractive because there are safety net\ncases that seem like clear cases of doing harm and others that seem\nvery much like merely allowing harm. For example,\n\n\nImpoverished Village: Having given one’s accountant full power\nof attorney one learns that because of a misunderstanding he is\npreparing to sign away 10% of one’s income to save the lives of\npeople in a remote impoverished village. One phones to instruct him\nnot to do it (McMahan 1993,\n 258).[24]\n\nHospital: A doctor has just plugged one person into a respirator. If\nthe patient is moved or unplugged from the respirator, he will die.\nFive more patients arrive and will die unless plugged into the\nrespirator. The doctor unplugs the first patient into order to save\nthe five (Rickless 2011, 68).\n\nBurning Building (Enemy): A person trapped atop a high burning\nbuilding leaps off. Seeing this, a firefighter quickly stations a\nself-standing net underneath and then dashes off to assist with other\nwork. The imperilled person’s enemy, however, is also present\nand, seeing his opportunity, swiftly removes the net so the imperilled\nperson hits the ground and dies. (McMahan 1993, 254)\n\nGallows: A innocent man is standing on a gallows with a noose around\nhis neck. The agent pulls the lever, releasing the trap door. As the\ninnocent man falls through the trap door, the noose tightens around\nhis neck, killing him. (See Vihvelin and Tomkow 2005, 194.)\n\n\nImpoverished Village and Hospital seem like clear cases of merely\nallowing harm whereas Burning Building (Enemy) and Gallows seem like\nclear cases of doing harm. The challenge for Unified All Doings\nAccounts is to explain our intuitions in Impoverished Village and\nHospital, either by arguing that our intuition that these cases count\nas allowings is misleading or by showing that these cases have some\nspecial feature which means they should not be seen as standard safety\nnet cases. Unified All Allowings Accounts face an analogous challenge\nwhen it comes to Burning Building (Enemy) and Gallows. Non-Unified\nAccounts and 3rd Category Accounts must give a convincing account of\nthe status of safety net cases which explains—or explains\naway—our intuitions about all such cases. \n\nRickless (2011) uses both the above-mentioned tactics to defend the\nUnified All Allowings Account. He argues that our intuitions in cases\nlike Burning Building (Enemy) are distorted by the agent’s\nmalicious intentions. He suggests that if we remove the distorting\nfactor of malicious intentions, we will see the Burning Building case\nas morally equivalent to merely allowing harm (Rickless 2011,\n 71).[25]\n Thus, for example, in McMahan’s original Burning Building Case,\nwhen a firefighter removes a net from beneath one imperilled person in\norder to save five others, he counts as merely allowing harm (McMahan\n1993, 262, Rickless 2011, 72). Rickless argues that this would also be\ntrue of a passerby who moved the net from beneath one to save five\n(Rickless 2011, 73). Instead of arguing that our intuitions are wrong\nabout Gallows, Rickless argues that it differs from other safety net\ncases. In Gallows, there is no pre-existing threatening sequence.\nGallows should be understood as the initiation of a harmful sequence,\nand thus as doing harm. \n\nMcMahan (1993) picks out three key factors which he claims affect\nwhether withdrawal of a barrier counts as doing or allowing\n“...whether the person who terminates the aid or protection is\nthe person who has provided it, whether the aid or protection is\nself-sustaining or requires more of the agent, and whether the aid or\nprotection is operative or as yet inoperative” (McMahan 1993,\n262). Withdrawal of a barrier counts as merely allowing harm if and\nonly if the barrier was (a) provided by the agent and the barrier is\neither (b) not self-sustaining or (c) not yet operative. Thus\nMcMahan’s account seems to correctly classify Impoverished\nVillage and Hospital as merely allowing harm and Burning Building\n(Enemy) as doing harm. It may, however, counterintuitively classify\nGallows as merely allowing harm if the trap door belongs to the agent.\nIf the trap door belongs to the agent, the continued use of his\nresources is required to keep the barrier in place, so the barrier may\nnot count as self-sustaining. McMahan also allows that sometimes one\nagent can act on behalf of another, or they can act as a team. This is\nsupposed to explain the intuition that in the Burning Building case\nwhere the net is moved to catch five imperilled persons instead of\none, it doesn’t matter whether it is the original firefighter or\na second firefighter who does the\n moving.[26]\n\n\nMatthew Hanser (1999), Timothy Hall (2008) and Barry and Øverland\n(2016) all argue that safety net cases should not be classified as\neither doing or merely allowing harm. They fall into a third category.\nHanser argues that this third category is ‘preventing people\nfrom being saved’ and it is conceptually distinct from both\ndoing and allowing harm, but morally equivalent to merely allowing\nharm, other things being equal. Other things are not equal i.e.\npreventing someone from being saved is worse than merely allowing harm\nif the resources the victim needs in order to survive do not belong to\nthe agent. The moral implications of Hanser’s account are thus\nsimilar to those of McMahan’s account.\n\nHall argues that safety net cases belong to the category\n‘denials of resources’ which are both conceptually and\nmorally distinct from standard doings and standard allowings. Hall\noffers three main arguments. First, he argues that previous analyses\nhave failed to show that allowing harm by denying resources has\nanything significant in common with allowing harm by failing to act.\nSecond, he argues that the moral status of denials of resources depend\nto a large extent on which person has a right to the resource in\nquestion while the moral status of standard doings and standard\nallowings does not. Third, he argues that constraints against standard\ndoings of harm and permissions for standard allowings of harm are\nrooted in pre-political personal rights but constraints and\npermissions regarding denials of resources are not. \n\nOn Barry and Øverland’s view, safety net cases count as\nenablings. When an agent enables harm, there is a ‘relevant\naction’ (“there is an answer to the question of how she\nwas relevant to [the harm] that refers to something she did”\n– see Barry and Øverland 2016, 116) but the action is not\nconnected to the harm through a complete causal process. Barry and\nØverland argue that an agent can be expected to bear greater costs to\navoid doing harm than to avoid enabling harm, but greater costs to\navoid enabling harm than merely allowing harm.\n",
    "section_title": "8. ‘Safety Net’ Cases",
    "entry_title": "Doing vs. Allowing Harm",
    "hierarchy_title": "Doing vs. Allowing Harm || ‘Safety Net’ Cases",
    "tokenized_text": [
        "safety",
        "net",
        "case",
        "safety",
        "net",
        "case",
        "first",
        "describe",
        "doingallowing",
        "distinction",
        "tempting",
        "use",
        "standard",
        "doings",
        "standard",
        "allowings",
        "harm",
        "example",
        "standard",
        "doings",
        "harm",
        "agent",
        "performs",
        "action",
        "setting",
        "physical",
        "force",
        "motion",
        "run",
        "victim",
        "bob",
        "push",
        "boulder",
        "roll",
        "hill",
        "crush",
        "victor",
        "death",
        "bystander",
        "pull",
        "lever",
        "turning",
        "trolley",
        "towards",
        "one",
        "standard",
        "allowing",
        "agent",
        "perform",
        "action",
        "refusing",
        "intervene",
        "harmful",
        "sequence",
        "case",
        "agent",
        "remove",
        "safety",
        "net",
        "beneath",
        "falling",
        "victim",
        "unplugs",
        "respirator",
        "kick",
        "rock",
        "path",
        "runaway",
        "vehicle",
        "similar",
        "case",
        "case",
        "agent",
        "performs",
        "action",
        "act",
        "victim",
        "directly",
        "instead",
        "remove",
        "barrier",
        "harmful",
        "sequence",
        "case",
        "important",
        "part",
        "philosophical",
        "discussion",
        "doingallowing",
        "distinction",
        "part",
        "recognition",
        "apparently",
        "standard",
        "case",
        "fact",
        "involve",
        "removing",
        "barrier",
        "jonathan",
        "schaffer",
        "argued",
        "many",
        "gun",
        "pulling",
        "trigger",
        "fire",
        "bullet",
        "essentially",
        "removing",
        "barrier",
        "four",
        "main",
        "approach",
        "safety",
        "net",
        "case",
        "unified",
        "doings",
        "account",
        "first",
        "approach",
        "treat",
        "safety",
        "net",
        "case",
        "doings",
        "upshot",
        "occurs",
        "agent",
        "something",
        "effect",
        "seems",
        "treat",
        "actioninaction",
        "distinction",
        "doingallowing",
        "distinction",
        "identical",
        "quinn",
        "bennett",
        "endorse",
        "approach",
        "safety",
        "net",
        "case",
        "unified",
        "allowings",
        "account",
        "second",
        "approach",
        "treat",
        "safety",
        "net",
        "case",
        "mere",
        "allowings",
        "approach",
        "commonly",
        "seen",
        "following",
        "philippa",
        "foot",
        "holding",
        "safety",
        "net",
        "case",
        "count",
        "enabling",
        "harm",
        "removing",
        "barrier",
        "would",
        "prevented",
        "harmful",
        "sequence",
        "t",
        "foot",
        "enabling",
        "specie",
        "allowing",
        "rickless",
        "endorses",
        "approach",
        "nonunified",
        "account",
        "others",
        "mcmahan",
        "woollard",
        "argue",
        "safetynet",
        "case",
        "treated",
        "doings",
        "others",
        "merely",
        "allowings",
        "rd",
        "category",
        "account",
        "finally",
        "others",
        "matthew",
        "hanser",
        "timothy",
        "hall",
        "barry",
        "øverland",
        "argue",
        "safety",
        "net",
        "case",
        "classified",
        "alongside",
        "either",
        "standard",
        "doings",
        "harm",
        "standard",
        "allowings",
        "harm",
        "fall",
        "third",
        "category",
        "nonunified",
        "account",
        "may",
        "seem",
        "attractive",
        "safety",
        "net",
        "case",
        "seem",
        "like",
        "clear",
        "case",
        "harm",
        "others",
        "seem",
        "much",
        "like",
        "merely",
        "allowing",
        "harm",
        "example",
        "impoverished",
        "village",
        "given",
        "one",
        "accountant",
        "full",
        "power",
        "attorney",
        "one",
        "learns",
        "misunderstanding",
        "preparing",
        "sign",
        "away",
        "one",
        "income",
        "save",
        "life",
        "people",
        "remote",
        "impoverished",
        "village",
        "one",
        "phone",
        "instruct",
        "mcmahan",
        "hospital",
        "doctor",
        "plugged",
        "one",
        "person",
        "respirator",
        "patient",
        "moved",
        "unplugged",
        "respirator",
        "die",
        "five",
        "patient",
        "arrive",
        "die",
        "unless",
        "plugged",
        "respirator",
        "doctor",
        "unplugs",
        "first",
        "patient",
        "order",
        "save",
        "five",
        "rickless",
        "burning",
        "building",
        "enemy",
        "person",
        "trapped",
        "atop",
        "high",
        "burning",
        "building",
        "leap",
        "seeing",
        "firefighter",
        "quickly",
        "station",
        "selfstanding",
        "net",
        "underneath",
        "dash",
        "assist",
        "work",
        "imperilled",
        "person",
        "enemy",
        "however",
        "also",
        "present",
        "seeing",
        "opportunity",
        "swiftly",
        "remove",
        "net",
        "imperilled",
        "person",
        "hit",
        "ground",
        "dy",
        "mcmahan",
        "gallows",
        "innocent",
        "man",
        "standing",
        "gallows",
        "noose",
        "around",
        "neck",
        "agent",
        "pull",
        "lever",
        "releasing",
        "trap",
        "door",
        "innocent",
        "man",
        "fall",
        "trap",
        "door",
        "noose",
        "tightens",
        "around",
        "neck",
        "killing",
        "see",
        "vihvelin",
        "tomkow",
        "impoverished",
        "village",
        "hospital",
        "seem",
        "like",
        "clear",
        "case",
        "merely",
        "allowing",
        "harm",
        "whereas",
        "burning",
        "building",
        "enemy",
        "gallows",
        "seem",
        "like",
        "clear",
        "case",
        "harm",
        "challenge",
        "unified",
        "doings",
        "account",
        "explain",
        "intuition",
        "impoverished",
        "village",
        "hospital",
        "either",
        "arguing",
        "intuition",
        "case",
        "count",
        "allowings",
        "misleading",
        "showing",
        "case",
        "special",
        "feature",
        "mean",
        "seen",
        "standard",
        "safety",
        "net",
        "case",
        "unified",
        "allowings",
        "account",
        "face",
        "analogous",
        "challenge",
        "come",
        "burning",
        "building",
        "enemy",
        "gallows",
        "nonunified",
        "account",
        "rd",
        "category",
        "account",
        "must",
        "give",
        "convincing",
        "account",
        "status",
        "safety",
        "net",
        "case",
        "explainsor",
        "explains",
        "awayour",
        "intuition",
        "case",
        "rickless",
        "us",
        "abovementioned",
        "tactic",
        "defend",
        "unified",
        "allowings",
        "account",
        "argues",
        "intuition",
        "case",
        "like",
        "burning",
        "building",
        "enemy",
        "distorted",
        "agent",
        "malicious",
        "intention",
        "suggests",
        "remove",
        "distorting",
        "factor",
        "malicious",
        "intention",
        "see",
        "burning",
        "building",
        "case",
        "morally",
        "equivalent",
        "merely",
        "allowing",
        "harm",
        "rickless",
        "thus",
        "example",
        "mcmahan",
        "original",
        "burning",
        "building",
        "case",
        "firefighter",
        "remove",
        "net",
        "beneath",
        "one",
        "imperilled",
        "person",
        "order",
        "save",
        "five",
        "others",
        "count",
        "merely",
        "allowing",
        "harm",
        "mcmahan",
        "rickless",
        "rickless",
        "argues",
        "would",
        "also",
        "true",
        "passerby",
        "moved",
        "net",
        "beneath",
        "one",
        "save",
        "five",
        "rickless",
        "instead",
        "arguing",
        "intuition",
        "wrong",
        "gallows",
        "rickless",
        "argues",
        "differs",
        "safety",
        "net",
        "case",
        "gallows",
        "preexisting",
        "threatening",
        "sequence",
        "gallows",
        "understood",
        "initiation",
        "harmful",
        "sequence",
        "thus",
        "harm",
        "mcmahan",
        "pick",
        "three",
        "key",
        "factor",
        "claim",
        "affect",
        "whether",
        "withdrawal",
        "barrier",
        "count",
        "allowing",
        "whether",
        "person",
        "terminates",
        "aid",
        "protection",
        "person",
        "provided",
        "whether",
        "aid",
        "protection",
        "selfsustaining",
        "requires",
        "agent",
        "whether",
        "aid",
        "protection",
        "operative",
        "yet",
        "inoperative",
        "mcmahan",
        "withdrawal",
        "barrier",
        "count",
        "merely",
        "allowing",
        "harm",
        "barrier",
        "provided",
        "agent",
        "barrier",
        "either",
        "b",
        "selfsustaining",
        "c",
        "yet",
        "operative",
        "thus",
        "mcmahan",
        "account",
        "seems",
        "correctly",
        "classify",
        "impoverished",
        "village",
        "hospital",
        "merely",
        "allowing",
        "harm",
        "burning",
        "building",
        "enemy",
        "harm",
        "may",
        "however",
        "counterintuitively",
        "classify",
        "gallows",
        "merely",
        "allowing",
        "harm",
        "trap",
        "door",
        "belongs",
        "agent",
        "trap",
        "door",
        "belongs",
        "agent",
        "continued",
        "use",
        "resource",
        "required",
        "keep",
        "barrier",
        "place",
        "barrier",
        "may",
        "count",
        "selfsustaining",
        "mcmahan",
        "also",
        "allows",
        "sometimes",
        "one",
        "agent",
        "act",
        "behalf",
        "another",
        "act",
        "team",
        "supposed",
        "explain",
        "intuition",
        "burning",
        "building",
        "case",
        "net",
        "moved",
        "catch",
        "five",
        "imperilled",
        "person",
        "instead",
        "one",
        "matter",
        "whether",
        "original",
        "firefighter",
        "second",
        "firefighter",
        "moving",
        "matthew",
        "hanser",
        "timothy",
        "hall",
        "barry",
        "øverland",
        "argue",
        "safety",
        "net",
        "case",
        "classified",
        "either",
        "merely",
        "allowing",
        "harm",
        "fall",
        "third",
        "category",
        "hanser",
        "argues",
        "third",
        "category",
        "preventing",
        "people",
        "saved",
        "conceptually",
        "distinct",
        "allowing",
        "harm",
        "morally",
        "equivalent",
        "merely",
        "allowing",
        "harm",
        "thing",
        "equal",
        "thing",
        "equal",
        "ie",
        "preventing",
        "someone",
        "saved",
        "worse",
        "merely",
        "allowing",
        "harm",
        "resource",
        "victim",
        "need",
        "order",
        "survive",
        "belong",
        "agent",
        "moral",
        "implication",
        "hanser",
        "account",
        "thus",
        "similar",
        "mcmahan",
        "account",
        "hall",
        "argues",
        "safety",
        "net",
        "case",
        "belong",
        "category",
        "denial",
        "resource",
        "conceptually",
        "morally",
        "distinct",
        "standard",
        "doings",
        "standard",
        "allowings",
        "hall",
        "offer",
        "three",
        "main",
        "argument",
        "first",
        "argues",
        "previous",
        "analysis",
        "failed",
        "show",
        "allowing",
        "harm",
        "denying",
        "resource",
        "anything",
        "significant",
        "common",
        "allowing",
        "harm",
        "failing",
        "act",
        "second",
        "argues",
        "moral",
        "status",
        "denial",
        "resource",
        "depend",
        "large",
        "extent",
        "person",
        "right",
        "resource",
        "question",
        "moral",
        "status",
        "standard",
        "doings",
        "standard",
        "allowings",
        "third",
        "argues",
        "constraint",
        "standard",
        "doings",
        "harm",
        "permission",
        "standard",
        "allowings",
        "harm",
        "rooted",
        "prepolitical",
        "personal",
        "right",
        "constraint",
        "permission",
        "regarding",
        "denial",
        "resource",
        "barry",
        "øverland",
        "view",
        "safety",
        "net",
        "case",
        "count",
        "enablings",
        "agent",
        "enables",
        "harm",
        "relevant",
        "action",
        "answer",
        "question",
        "relevant",
        "harm",
        "refers",
        "something",
        "see",
        "barry",
        "øverland",
        "action",
        "connected",
        "harm",
        "complete",
        "causal",
        "process",
        "barry",
        "øverland",
        "argue",
        "agent",
        "expected",
        "bear",
        "greater",
        "cost",
        "avoid",
        "harm",
        "avoid",
        "enabling",
        "harm",
        "greater",
        "cost",
        "avoid",
        "enabling",
        "harm",
        "merely",
        "allowing",
        "harm"
    ]
}