{
    "main_text": "Diels’ reconstruction of the narrow doxographical tradition\n2. Diels’ reconstruction of the narrow doxographical tradition\n\nThe starting-point of Diels' (1879) inquiries was a hypothesis\nprovided by his Bonn teacher and Doktorvater Hermann Usener\n(who had predecessors himself), concerning the identical or closely\nsimilar language used in reports of pre-Socratic and other\nphilosophical doctrines contained in two late compendia, the\nPlacita (‘Tenets’) surviving among our\nmanuscripts of Plutarch, and the Eclogae of the anthologizer\nStobaeus; this hypothesis Diels modified in certain respects, and also\nmade much more complicated, as he attempted to trace back from\nps-Plutarch and Stobaeus a long line of predecessors, each\nsuccessively relied upon by later authors in compiling\nphilosophers’ doctrines, all the way down to ps-Plutarch and\nStobaeus themselves. In a truly magisterial way he gave it the aura of\nabsolute certainty and unassailability which did much to ensure its\ndominating position in the study of ancient philosophy until today.\nThe hypothesis may be briefly set out as follows.\n\nThe tradition of authors of works in the doxography of physics begins\nwith Aristotle’s pupil and successor Theophrastus. In the\ncatalogue of his oeuvre preserved in his Life in Diogenes\nLaertius a treatise is listed of ‘Physikôn\nDoxôn, sixteen books’. For the Greek title in the\nnominative one has a choice between Physikôn Doxai\n(‘Tenets of the Natural Philosophers’) and Physikai\nDoxai (‘Tenets in Natural Philosophy’). Usener and\nDiels opted for the first alternative, but in the opinion of many\nscholars today the second option is much more plausible. To this\ntreatise they attributed a number of fragments dealing with the\nprinciples (archai: Thales’ water, Heraclitus’\nfire, etc.) transmitted for the most part by Simplicius, a\nNeoplatonist commentator on Aristotle of the 6th c. CE. That\nSimplicius and others explicitly quote from Theophrastus’\nPhysics, a different treatise, did not bother them. They\nfurther posited that a short monograph of Theophrastus, the De\nSensibus, dealing with theories concerning the senses and their\nobjects from Parmenides to Democritus and Plato, is a fragment of this\ntreatise as well. The simple fact however that Plato, not first and\nforemost a philosopher of nature, is treated here on the same level as\nDemocritus and the other natural philosophers (as is also the case in\nthe fragments dealing with the principles) should have made them more\nhesitant, even within the scope of their own hypothesis, as to the\ninterpretation of the title of the foundational treatise in sixteen\nbooks. \n\nThe Metarsiology attributed to Theophrastus, extant in Syrian\nand Arabic translation, was discovered and published too late to be\ntaken into account by Diels. Doubts about the attribution are\nformulated by Bakker 2016. For the text see Daiber 1992, and for the\nrelation to the Placita Mansfeld & Runia 2020,\n4.3.1135–37. \n\nAccording to Diels’ revision of the hypothesis a number of\nextant writings (as well as sections of writings) concerned with\ndoctrines in the fields of natural philosophy ultimately derive from\nfrom the Physikôn Doxai (as he called the work), via several\nintermediary stages. These stages are: \n\nThe Placita of an otherwise unknown Aëtius, who is\nmentioned several times by Theodoret; to be dated to the late 1st or\nperhaps early 2nd c. CE. Theodoret as source was for the first time\nadduced by Diels. This Aëtian work, he thought, may be\nreconstructed (a) from the Placita of ps-Plutarch, (b) from\nquotations in the Anthology of Stobaeus, and (c) from echoes\nin the Therapy of Greek Diseases of\n Theodoret[3].\n Ps-Plutarch is an epitome of Aëtius. Stobaeus as a rule quotes\nverbatim, but has a different systematic lay-out. The\nAnthology, moreover, has been much abridged and damaged in\nthe course of transmission, so in a number of cases Stobaean parallels\nfor ps-Plutarch are no longer extant. Aëtius will also have been\nused by other authors, whereas ps-Plutarch would have been used by\nother authors again. Diels indeed proved that the second part of\nps-Galen Philosophical History is an epitome of a version of\nps-Plutarch.\nIn his turn, Aëtius would for the most part derive from a\npostulated treatise to which Diels gave the name Vetusta\nPlacita (‘Older Tenets’), which would have been used\nby Cicero, Varro and others. Its latest possible date, accordingly, is\nthe early 1st c. BCE.\n\n\nThe Aëtius hypothesis was new; it has proved to be tenable,\nthough it has been shown to be in need of revision. Before Diels,\nscholars believed in the existence of a single early source, parts of\nwhich would have been taken over and adapted by Cicero as well as much\nlater by, for instance, ps-Galen. The Vetusta Placita\nhypothesis, on the other hand, is dubious, and the way back to\nTheophrastus is much more complicated and uncertain, if only because\nhard evidence is so scarce, than Diels, who just stuck to\nUsener’s point of view about Theophrastus, wished to consider.\n\n\nDiels next posited that Theophrastus’ treatise, the Vetusta\nPlacita, and Aëtius had the same kind of systematic lay-out\nas the extant Placita of ps-Plutarch, viz. according to\nsubject. The individual books and sections of books of this tract are\nindeed concerned with specific themes, such as for instance book two,\nwhich deals with the cosmos and the heavenly bodies. Within the\nframework of a section devoted to a particular subject, e.g., the sun,\nor the moon, the individual chapters may be concerned with various\nspecific issues pertaining to the sun, or the moon, and so on. \n\nDiels further argued that other reports, in other authors, should also\nbe connected with Theophrastus’ foundational treatise. The\npassages dealing with the tenets of Presocratic philosophers in the\nhistory of philosophy by Diogenes Laërtius, which is arranged\naccording to schools and individuals, not subjects, as well as similar\nsections of the first book of Hippolytus’ Refutation of All\nHeresies and of the Stromateis\n(‘Patchworks’) of another ps-Plutarch, in Diels’\nview also went back, ultimately, to the Tenets of the Natural\nPhilosophers. He failed to take the difference between treatment\naccording to subject and that according to person, or school,\nsufficiently into account. His argumentation is also dubious in other\nrespects. From the undeniable fact that there are striking\nresemblances between Theophrastus’ fragments concerned with the\nprinciples on the one hand, and what is found on that score in\nAëtius, Diogenes Laërtius, and Hippolytus on the other, it\ndoes not follow that corresponding passages in these later authors for\nwhich we have no Theophrastean parallels derive from Theophrastus too.\nThis is source criticism, or Quellenforschung, at its most\nvulnerable. Diels moreover preferred to overlook the equally\nundeniable fact that Aristotle’s treatment of the principles in\nthe first book of the Metaphysics exhibits equally striking\ncorrespondences with Theophrastus’ fragments (Zeller 1877), and\nso with the later tradition as well, which could therefore go back\nultimately to Aristotle, and not to Theophrastus.\n\nDiels saw the development from Theophrastus to these later and (in his\nview) dependent authors as a decline, and a progressive obfuscation\nand deterioration. His cladistic reconstruction of the doxographical\ntradition is clearly related to the famous so-called\n‘Lachmannian’ stemma of a group of manuscripts, from later\ncopies to the lost common ancestor, or archetype, the text of which\n(as scholars believed at the time) may be reconstructed in a virtually\nmechanical way. Diels was very much aware of this analogy, which\nsurely was an important factor in convincing him and others that the\nsplendid results of his investigations were irrefutable. In the 19th\ncentury the method attributed to Lachmann was assumed to be beyond\ncriticism.\n\nBy thus (so to speak automatically) tracing back these mutually\ncorresponding passages in later authors to the, as he assumed,\nfaithful reporter Theophrastus, Diels believed he gained access to\nreliable information about Presocratic philosophy. Thanks to the\nstemmatic method back to the archetype it became possible to bestow\nupon a passage (a brief lemma in, for instance, Aëtius) dealing\nwith a tenet of a Presocratic philosopher, the conditional status of\nbeing an attestation which, though still at second hand, should be\nearly and therefore the more to be trusted. It is with the importance\nmeted out to such so-called ‘fragments’ that these\nlemmata, removed by Diels’ scissors from Aëtian chapters\ndealing with subjects, figure in the chronological series of\nchapters devoted to persons in two fundamental works he\npublished. These are the Poetarum Philosophorum Fragmenta\n(‘Fragments of the Poet-Philosophers’) of 1901, reprinted\n2000, and the famous, several times revised (in later editions by\nDiels’ collaborator Kranz), and often reprinted Fragmente\nder Vorsokratiker (‘Fragments of the Presocratics’,\nabbreviated D.-K.), first published in 1903. Scholars indeed still\ntend to view these Aëtian lemmata as a sort of Theophrastean\nfragments, and Theophrastus is believed to be a bona fide source. This\nalso holds for those passages in Hippolytus, Diogenes Laërtius\nand other authors in D.-K. which had been traced back to Theophrastus\nhypothetically.\n\nHowever, when one compares Aëtian lemmata concerned with tenets\nof extant authors, like Plato or Aristotle, with the doctrines found\nin the original texts, it becomes clear to what extent these\ndoxai have been adapted and distorted, or\n‘modernized’, in some sense of the word. This consequently\nshould also hold for lemmata dealing with lost authors, as Xylander\nalready pointed out in his 16th century edition of Plutarch, which\nincluded the Epitome of ps-Plutarch. (For further reading on\nthis topic, see Mansfeld & Runia 1997, and Runia 1999, 2004.)\n\nThe role of Theodoret as a source for Aëtius has been questioned\nand doubted by Lebedev 1983, Frede 1999, Gourinat 2011, and Bottler\n(2015). However, no one doubts that there must be a source PS shared\nby ps.Plutarch and Stobaeus. One can also prove that there must be\nsuch a source (TS) shared by Theodoret and Stobaeus. As a final step\none can prove that the PS source and the TS source cannot be\ndistinguished from each other so are identical. Thus Diels’\noriginal intuition is vindicated. For details see Mansfeld 2018 and\nsection 8 below.\n",
    "section_title": "2. Diels’ reconstruction of the narrow doxographical tradition",
    "entry_title": "Doxography of Ancient Philosophy",
    "hierarchy_title": "Doxography of Ancient Philosophy || Diels’ reconstruction of the narrow doxographical tradition",
    "tokenized_text": [
        "diels",
        "reconstruction",
        "narrow",
        "doxographical",
        "tradition",
        "diels",
        "reconstruction",
        "narrow",
        "doxographical",
        "tradition",
        "startingpoint",
        "diels",
        "inquiry",
        "hypothesis",
        "provided",
        "bonn",
        "teacher",
        "doktorvater",
        "hermann",
        "usener",
        "predecessor",
        "concerning",
        "identical",
        "closely",
        "similar",
        "language",
        "used",
        "report",
        "presocratic",
        "philosophical",
        "doctrine",
        "contained",
        "two",
        "late",
        "compendia",
        "placita",
        "tenet",
        "surviving",
        "among",
        "manuscript",
        "plutarch",
        "eclogae",
        "anthologizer",
        "stobaeus",
        "hypothesis",
        "diels",
        "modified",
        "certain",
        "respect",
        "also",
        "made",
        "much",
        "complicated",
        "attempted",
        "trace",
        "back",
        "psplutarch",
        "stobaeus",
        "long",
        "line",
        "predecessor",
        "successively",
        "relied",
        "upon",
        "later",
        "author",
        "compiling",
        "philosopher",
        "doctrine",
        "way",
        "psplutarch",
        "stobaeus",
        "truly",
        "magisterial",
        "way",
        "gave",
        "aura",
        "absolute",
        "certainty",
        "unassailability",
        "much",
        "ensure",
        "dominating",
        "position",
        "study",
        "ancient",
        "philosophy",
        "today",
        "hypothesis",
        "may",
        "briefly",
        "set",
        "follows",
        "tradition",
        "author",
        "work",
        "doxography",
        "physic",
        "begin",
        "aristotle",
        "pupil",
        "successor",
        "theophrastus",
        "catalogue",
        "oeuvre",
        "preserved",
        "life",
        "diogenes",
        "laertius",
        "treatise",
        "listed",
        "physikôn",
        "doxôn",
        "sixteen",
        "book",
        "greek",
        "title",
        "nominative",
        "one",
        "choice",
        "physikôn",
        "doxai",
        "tenet",
        "natural",
        "philosopher",
        "physikai",
        "doxai",
        "tenet",
        "natural",
        "philosophy",
        "usener",
        "diels",
        "opted",
        "first",
        "alternative",
        "opinion",
        "many",
        "scholar",
        "today",
        "second",
        "option",
        "much",
        "plausible",
        "treatise",
        "attributed",
        "number",
        "fragment",
        "dealing",
        "principle",
        "archai",
        "thales",
        "water",
        "heraclitus",
        "fire",
        "etc",
        "transmitted",
        "part",
        "simplicius",
        "neoplatonist",
        "commentator",
        "aristotle",
        "th",
        "c",
        "ce",
        "simplicius",
        "others",
        "explicitly",
        "quote",
        "theophrastus",
        "physic",
        "different",
        "treatise",
        "bother",
        "posited",
        "short",
        "monograph",
        "theophrastus",
        "de",
        "sensibus",
        "dealing",
        "theory",
        "concerning",
        "sens",
        "object",
        "parmenides",
        "democritus",
        "plato",
        "fragment",
        "treatise",
        "well",
        "simple",
        "fact",
        "however",
        "plato",
        "first",
        "foremost",
        "philosopher",
        "nature",
        "treated",
        "level",
        "democritus",
        "natural",
        "philosopher",
        "also",
        "case",
        "fragment",
        "dealing",
        "principle",
        "made",
        "hesitant",
        "even",
        "within",
        "scope",
        "hypothesis",
        "interpretation",
        "title",
        "foundational",
        "treatise",
        "sixteen",
        "book",
        "metarsiology",
        "attributed",
        "theophrastus",
        "extant",
        "syrian",
        "arabic",
        "translation",
        "discovered",
        "published",
        "late",
        "taken",
        "account",
        "diels",
        "doubt",
        "attribution",
        "formulated",
        "bakker",
        "text",
        "see",
        "daiber",
        "relation",
        "placita",
        "mansfeld",
        "runia",
        "according",
        "diels",
        "revision",
        "hypothesis",
        "number",
        "extant",
        "writing",
        "well",
        "section",
        "writing",
        "concerned",
        "doctrine",
        "field",
        "natural",
        "philosophy",
        "ultimately",
        "derive",
        "physikôn",
        "doxai",
        "called",
        "work",
        "via",
        "several",
        "intermediary",
        "stage",
        "stage",
        "placita",
        "otherwise",
        "unknown",
        "aëtius",
        "mentioned",
        "several",
        "time",
        "theodoret",
        "dated",
        "late",
        "st",
        "perhaps",
        "early",
        "nd",
        "c",
        "ce",
        "theodoret",
        "source",
        "first",
        "time",
        "adduced",
        "diels",
        "aëtian",
        "work",
        "thought",
        "may",
        "reconstructed",
        "placita",
        "psplutarch",
        "b",
        "quotation",
        "anthology",
        "stobaeus",
        "c",
        "echo",
        "therapy",
        "greek",
        "disease",
        "theodoret",
        "psplutarch",
        "epitome",
        "aëtius",
        "stobaeus",
        "rule",
        "quote",
        "verbatim",
        "different",
        "systematic",
        "layout",
        "anthology",
        "moreover",
        "much",
        "abridged",
        "damaged",
        "course",
        "transmission",
        "number",
        "case",
        "stobaean",
        "parallel",
        "psplutarch",
        "longer",
        "extant",
        "aëtius",
        "also",
        "used",
        "author",
        "whereas",
        "psplutarch",
        "would",
        "used",
        "author",
        "diels",
        "indeed",
        "proved",
        "second",
        "part",
        "psgalen",
        "philosophical",
        "history",
        "epitome",
        "version",
        "psplutarch",
        "turn",
        "aëtius",
        "would",
        "part",
        "derive",
        "postulated",
        "treatise",
        "diels",
        "gave",
        "name",
        "vetusta",
        "placita",
        "older",
        "tenet",
        "would",
        "used",
        "cicero",
        "varro",
        "others",
        "latest",
        "possible",
        "date",
        "accordingly",
        "early",
        "st",
        "c",
        "bce",
        "aëtius",
        "hypothesis",
        "new",
        "proved",
        "tenable",
        "though",
        "shown",
        "need",
        "revision",
        "diels",
        "scholar",
        "believed",
        "existence",
        "single",
        "early",
        "source",
        "part",
        "would",
        "taken",
        "adapted",
        "cicero",
        "well",
        "much",
        "later",
        "instance",
        "psgalen",
        "vetusta",
        "placita",
        "hypothesis",
        "hand",
        "dubious",
        "way",
        "back",
        "theophrastus",
        "much",
        "complicated",
        "uncertain",
        "hard",
        "evidence",
        "scarce",
        "diels",
        "stuck",
        "usener",
        "point",
        "view",
        "theophrastus",
        "wished",
        "consider",
        "diels",
        "next",
        "posited",
        "theophrastus",
        "treatise",
        "vetusta",
        "placita",
        "aëtius",
        "kind",
        "systematic",
        "layout",
        "extant",
        "placita",
        "psplutarch",
        "viz",
        "according",
        "subject",
        "individual",
        "book",
        "section",
        "book",
        "tract",
        "indeed",
        "concerned",
        "specific",
        "theme",
        "instance",
        "book",
        "two",
        "deal",
        "cosmos",
        "heavenly",
        "body",
        "within",
        "framework",
        "section",
        "devoted",
        "particular",
        "subject",
        "eg",
        "sun",
        "moon",
        "individual",
        "chapter",
        "may",
        "concerned",
        "various",
        "specific",
        "issue",
        "pertaining",
        "sun",
        "moon",
        "diels",
        "argued",
        "report",
        "author",
        "also",
        "connected",
        "theophrastus",
        "foundational",
        "treatise",
        "passage",
        "dealing",
        "tenet",
        "presocratic",
        "philosopher",
        "history",
        "philosophy",
        "diogenes",
        "laërtius",
        "arranged",
        "according",
        "school",
        "individual",
        "subject",
        "well",
        "similar",
        "section",
        "first",
        "book",
        "hippolytus",
        "refutation",
        "heresy",
        "stromateis",
        "patchwork",
        "another",
        "psplutarch",
        "diels",
        "view",
        "also",
        "went",
        "back",
        "ultimately",
        "tenet",
        "natural",
        "philosopher",
        "failed",
        "take",
        "difference",
        "treatment",
        "according",
        "subject",
        "according",
        "person",
        "school",
        "sufficiently",
        "account",
        "argumentation",
        "also",
        "dubious",
        "respect",
        "undeniable",
        "fact",
        "striking",
        "resemblance",
        "theophrastus",
        "fragment",
        "concerned",
        "principle",
        "one",
        "hand",
        "found",
        "score",
        "aëtius",
        "diogenes",
        "laërtius",
        "hippolytus",
        "follow",
        "corresponding",
        "passage",
        "later",
        "author",
        "theophrastean",
        "parallel",
        "derive",
        "theophrastus",
        "source",
        "criticism",
        "quellenforschung",
        "vulnerable",
        "diels",
        "moreover",
        "preferred",
        "overlook",
        "equally",
        "undeniable",
        "fact",
        "aristotle",
        "treatment",
        "principle",
        "first",
        "book",
        "metaphysics",
        "exhibit",
        "equally",
        "striking",
        "correspondence",
        "theophrastus",
        "fragment",
        "zeller",
        "later",
        "tradition",
        "well",
        "could",
        "therefore",
        "go",
        "back",
        "ultimately",
        "aristotle",
        "theophrastus",
        "diels",
        "saw",
        "development",
        "theophrastus",
        "later",
        "view",
        "dependent",
        "author",
        "decline",
        "progressive",
        "obfuscation",
        "deterioration",
        "cladistic",
        "reconstruction",
        "doxographical",
        "tradition",
        "clearly",
        "related",
        "famous",
        "socalled",
        "lachmannian",
        "stemma",
        "group",
        "manuscript",
        "later",
        "copy",
        "lost",
        "common",
        "ancestor",
        "archetype",
        "text",
        "scholar",
        "believed",
        "time",
        "may",
        "reconstructed",
        "virtually",
        "mechanical",
        "way",
        "diels",
        "much",
        "aware",
        "analogy",
        "surely",
        "important",
        "factor",
        "convincing",
        "others",
        "splendid",
        "result",
        "investigation",
        "irrefutable",
        "th",
        "century",
        "method",
        "attributed",
        "lachmann",
        "assumed",
        "beyond",
        "criticism",
        "thus",
        "speak",
        "automatically",
        "tracing",
        "back",
        "mutually",
        "corresponding",
        "passage",
        "later",
        "author",
        "assumed",
        "faithful",
        "reporter",
        "theophrastus",
        "diels",
        "believed",
        "gained",
        "access",
        "reliable",
        "information",
        "presocratic",
        "philosophy",
        "thanks",
        "stemmatic",
        "method",
        "back",
        "archetype",
        "became",
        "possible",
        "bestow",
        "upon",
        "passage",
        "brief",
        "lemma",
        "instance",
        "aëtius",
        "dealing",
        "tenet",
        "presocratic",
        "philosopher",
        "conditional",
        "status",
        "attestation",
        "though",
        "still",
        "second",
        "hand",
        "early",
        "therefore",
        "trusted",
        "importance",
        "meted",
        "socalled",
        "fragment",
        "lemma",
        "removed",
        "diels",
        "scissors",
        "aëtian",
        "chapter",
        "dealing",
        "subject",
        "figure",
        "chronological",
        "series",
        "chapter",
        "devoted",
        "person",
        "two",
        "fundamental",
        "work",
        "published",
        "poetarum",
        "philosophorum",
        "fragmenta",
        "fragment",
        "poetphilosophers",
        "reprinted",
        "famous",
        "several",
        "time",
        "revised",
        "later",
        "edition",
        "diels",
        "collaborator",
        "kranz",
        "often",
        "reprinted",
        "fragmente",
        "der",
        "vorsokratiker",
        "fragment",
        "presocratics",
        "abbreviated",
        "dk",
        "first",
        "published",
        "scholar",
        "indeed",
        "still",
        "tend",
        "view",
        "aëtian",
        "lemma",
        "sort",
        "theophrastean",
        "fragment",
        "theophrastus",
        "believed",
        "bona",
        "fide",
        "source",
        "also",
        "hold",
        "passage",
        "hippolytus",
        "diogenes",
        "laërtius",
        "author",
        "dk",
        "traced",
        "back",
        "theophrastus",
        "hypothetically",
        "however",
        "one",
        "compare",
        "aëtian",
        "lemma",
        "concerned",
        "tenet",
        "extant",
        "author",
        "like",
        "plato",
        "aristotle",
        "doctrine",
        "found",
        "original",
        "text",
        "becomes",
        "clear",
        "extent",
        "doxai",
        "adapted",
        "distorted",
        "modernized",
        "sense",
        "word",
        "consequently",
        "also",
        "hold",
        "lemma",
        "dealing",
        "lost",
        "author",
        "xylander",
        "already",
        "pointed",
        "th",
        "century",
        "edition",
        "plutarch",
        "included",
        "epitome",
        "psplutarch",
        "reading",
        "topic",
        "see",
        "mansfeld",
        "runia",
        "runia",
        "role",
        "theodoret",
        "source",
        "aëtius",
        "questioned",
        "doubted",
        "lebedev",
        "frede",
        "gourinat",
        "bottler",
        "however",
        "one",
        "doubt",
        "must",
        "source",
        "p",
        "shared",
        "psplutarch",
        "stobaeus",
        "one",
        "also",
        "prove",
        "must",
        "source",
        "t",
        "shared",
        "theodoret",
        "stobaeus",
        "final",
        "step",
        "one",
        "prove",
        "p",
        "source",
        "t",
        "source",
        "distinguished",
        "identical",
        "thus",
        "diels",
        "original",
        "intuition",
        "vindicated",
        "detail",
        "see",
        "mansfeld",
        "section"
    ]
}