{
    "main_text": "Arguments for Dualism || Arguments from Personal Identity\n4.5 Arguments from Personal Identity\n\n\nThere is a long tradition, dating at least from Reid (1785),\nfor arguing that the identity of persons over time is not a matter of\nconvention or degree in the way that the identity of other (complex)\nsubstances is and that this shows that the self is a different kind of\nentity from any physical body. Criticism of these arguments and of the\nintuitions on which they rest, running from Hume to Parfit (1970:\n1984), have left us with an inconclusive clash of intuitions. The\nargument under consideration and which, possibly, has its first\nstatement in Madell (1981), does not concern identity through time, but\nthe consequences for identity of certain counterfactuals concerning\norigin. It can, perhaps, therefore, break the stalemate which faces the\ndebate over diachronic identity. The claim is that the broadly\nconventionalist ways which are used to deal with problem cases through\ntime for both persons and material objects, and which can also be\nemployed in cases of counterfactuals concerning origin for bodies,\ncannot be used for similar counterfactuals concerning persons or\nminds.\n\n\nConcerning ordinary physical objects, it is easy to imagine\ncounterfactual cases where questions of identity become problematic.\nTake the example of a particular table. We can scale counterfactual\nsuggestions as follows:\n\nThis table might have been made of ice.\nThis table might have been made of a different sort of wood.\nThis table might have been made of 95% of the wood it was made of\nand 5% of some other wood.\n\n\n\nThe first suggestion would normally be rejected as clearly false,\nbut there will come a point along the spectrum illustrated by (i) and\n(iii) and towards (iii) where the question of whether the hypothesised\ntable would be the same as the one that actually exists have no obvious\nanswer. It seems that the question of whether it ‘really’\nis the same one has no clear meaning: it is of, say, 75% the same\nmatter and of 25% different matter; these are the only genuine facts in\nthe case; the question of numerical identity can be decided in any\nconvenient fashion, or left unresolved. There will thus be a penumbra\nof counterfactual cases where the question of whether two things would\nbe the same is not a matter of fact.\n\n\nLet us now apply this thought to conscious subjects. Suppose that a\ngiven human individual had had origins different from those which he in\nfact had such that whether that difference affected who he was\nwas not obvious to intuition. What would count as such a case might be\na matter of controversy, but there must be one. Perhaps it is unclear\nwhether, if there had been a counterpart to Jones’ body from the same\negg but a different though genetically identical sperm from the same\nfather, the person there embodied would have been Jones. Some\nphilosophers might regard it as obvious that sameness of sperm is\nessential to the identity of a human body and to personal identity. In\nthat case imagine a counterpart sperm in which some of the molecules in\nthe sperm are different; would that be the same sperm? If one pursues\nthe matter far enough there will be indeterminacy which will infect\nthat of the resulting body. There must therefore be some difference\nsuch that neither natural language nor intuition tells us whether the\ndifference alters the identity of the human body; a point, that is,\nwhere the question of whether we have the same body is not a matter of\nfact.\n\n\nHow one is to describe these cases is, in some respects, a matter of\ncontroversy. Some philosophers think one can talk of vague\nidentity or partial identity. Others think that such\nexpressions are nonsensical. There is no space to discuss this issue\nhere. It is enough to assume, however, that questions of how one is\nallowed to use the concept of identity effect only the care with which\none should characterize these cases, not any substantive matter of\nfact. There are cases of substantial overlap of constitution in which\nthat fact is the only bedrock fact in the case: there is no\nfurther fact about whether they are ‘really’ the same\nobject. If there were, then there would have to be a\nhaecceitas or thisness belonging to and individuating\neach complex physical object, and this I am assuming to be implausible\nif not unintelligible. (More about the conditions under which\nhaecceitas can make sense will be found below.)\n\n\nOne might plausibly claim that no similar overlap of\nconstitution can be applied to the counterfactual identity of\nminds. In Geoffrey Madell’s (1981) words:\nBut while my present body can thus have its partial\ncounterpart in some possible world, my present consciousness cannot.\nAny present state of consciousness that I can imagine either is or is\nnot mine. There is no question of degree here. (91)\n\n\nWhy is this so? Imagine the case where we are not sure whether it\nwould have been Jones’ body – and, hence, Jones – that\nwould have been created by the slightly modified sperm and the same\negg. Can we say, as we would for an object with no consciousness, that\nthe story something the same, something different is the whole\nstory: that overlap of constitution is all there is to it? For the\nJones body as such, this approach would do as well as for any other\nphysical object. But suppose Jones, in reflective mood, asks himself\n‘if that had happened, would I have existed?’ There are at\nleast three answers he might give to himself. (i) I either would or\nwould not, but I cannot tell. (ii) There is no fact of the matter\nwhether I would or would not have existed: it is just a mis-posed\nquestion. (iii) In some ways, or to some degree, I would have, and in\nsome ways, or to some degree, I would not. The creature who would have\nexisted would have had a kind of overlap of psychic constitution with\nme.\n\n\nThe third answer parallels the response we would give in the case of\nbodies. But as an account of the subjective situation, it is arguable\nthat this makes no sense. Call the creature that would have emerged\nfrom the slightly modified sperm, ‘Jones2’. Is the overlap\nsuggestion that, just as, say 85% of Jones2’s original body would have\nbeen identical with Jones’, about 85% of his psychic life would have\nbeen Jones’? That it would have been like \nJones’ – indeed that Jones2 might have had a psychic life 100% like \nJones’ – makes perfect sense, but that he might have been to that\ndegree, the same psyche – that Jones ‘85% existed’\n – arguably makes no sense. Take the case in which Jones and Jones2\nhave exactly similar lives throughout: which 85% of the 100%\nsimilar mental events do they share? Nor does it make sense to suggest\nthat Jones might have participated in the whole of Jones2’s psychic\nlife, but in a rather ghostly only 85% there manner. Clearly,\nthe notion of overlap of numerically identical psychic parts cannot be\napplied in the way that overlap of actual bodily part constitution\nquite unproblematically can.\n\n\nThis might make one try the second answer. We can apply the\n‘overlap’ answer to the Jones body, but the question of\nwhether the minds or subjects would have been the same, has no clear\nsense. It is difficult to see why it does not. Suppose Jones found out\nthat he had originally been one of twins, in the sense that the zygote\nfrom which he developed had divided, but that the other half had died\nsoon afterwards. He can entertain the thought that if it had been his\nhalf that had died, he would never have existed as a conscious being,\nthough someone would whose life, both inner and outer, might have been\nvery similar to his. He might feel rather guiltily grateful that it was\nthe other half that died. It would be strange to think that Jones is\nwrong to think that there is a matter of fact about this. And how is\none to ‘manage’ the transition from the case where there is\na matter of fact to the case where there is not?\n\n\nIf the reasoning above is correct, one is left with only the first\noption. If so, there has to be an absolute matter of fact from the\nsubjective point of view. But the physical examples we have considered\nshow that when something is essentially complex, this cannot be the\ncase. When there is constitution, degree and overlap of constitution\nare inevitably possible. So the mind must be simple, and this is\npossible only if it is something like a Cartesian substance.\n",
    "section_title": "4.5 Arguments from Personal Identity",
    "entry_title": "Dualism",
    "hierarchy_title": "Dualism || Arguments for Dualism || Arguments from Personal Identity",
    "tokenized_text": [
        "argument",
        "dualism",
        "argument",
        "personal",
        "identity",
        "argument",
        "personal",
        "identity",
        "long",
        "tradition",
        "dating",
        "least",
        "reid",
        "arguing",
        "identity",
        "person",
        "time",
        "matter",
        "convention",
        "degree",
        "way",
        "identity",
        "complex",
        "substance",
        "show",
        "self",
        "different",
        "kind",
        "entity",
        "physical",
        "body",
        "criticism",
        "argument",
        "intuition",
        "rest",
        "running",
        "hume",
        "parfit",
        "left",
        "u",
        "inconclusive",
        "clash",
        "intuition",
        "argument",
        "consideration",
        "possibly",
        "first",
        "statement",
        "madell",
        "concern",
        "identity",
        "time",
        "consequence",
        "identity",
        "certain",
        "counterfactuals",
        "concerning",
        "origin",
        "perhaps",
        "therefore",
        "break",
        "stalemate",
        "face",
        "debate",
        "diachronic",
        "identity",
        "claim",
        "broadly",
        "conventionalist",
        "way",
        "used",
        "deal",
        "problem",
        "case",
        "time",
        "person",
        "material",
        "object",
        "also",
        "employed",
        "case",
        "counterfactuals",
        "concerning",
        "origin",
        "body",
        "used",
        "similar",
        "counterfactuals",
        "concerning",
        "person",
        "mind",
        "concerning",
        "ordinary",
        "physical",
        "object",
        "easy",
        "imagine",
        "counterfactual",
        "case",
        "question",
        "identity",
        "become",
        "problematic",
        "take",
        "example",
        "particular",
        "table",
        "scale",
        "counterfactual",
        "suggestion",
        "follows",
        "table",
        "might",
        "made",
        "ice",
        "table",
        "might",
        "made",
        "different",
        "sort",
        "wood",
        "table",
        "might",
        "made",
        "wood",
        "made",
        "wood",
        "first",
        "suggestion",
        "would",
        "normally",
        "rejected",
        "clearly",
        "false",
        "come",
        "point",
        "along",
        "spectrum",
        "illustrated",
        "iii",
        "towards",
        "iii",
        "question",
        "whether",
        "hypothesised",
        "table",
        "would",
        "one",
        "actually",
        "exists",
        "obvious",
        "answer",
        "seems",
        "question",
        "whether",
        "really",
        "one",
        "clear",
        "meaning",
        "say",
        "matter",
        "different",
        "matter",
        "genuine",
        "fact",
        "case",
        "question",
        "numerical",
        "identity",
        "decided",
        "convenient",
        "fashion",
        "left",
        "unresolved",
        "thus",
        "penumbra",
        "counterfactual",
        "case",
        "question",
        "whether",
        "two",
        "thing",
        "would",
        "matter",
        "fact",
        "let",
        "u",
        "apply",
        "thought",
        "conscious",
        "subject",
        "suppose",
        "given",
        "human",
        "individual",
        "origin",
        "different",
        "fact",
        "whether",
        "difference",
        "affected",
        "obvious",
        "intuition",
        "would",
        "count",
        "case",
        "might",
        "matter",
        "controversy",
        "must",
        "one",
        "perhaps",
        "unclear",
        "whether",
        "counterpart",
        "jones",
        "body",
        "egg",
        "different",
        "though",
        "genetically",
        "identical",
        "sperm",
        "father",
        "person",
        "embodied",
        "would",
        "jones",
        "philosopher",
        "might",
        "regard",
        "obvious",
        "sameness",
        "sperm",
        "essential",
        "identity",
        "human",
        "body",
        "personal",
        "identity",
        "case",
        "imagine",
        "counterpart",
        "sperm",
        "molecule",
        "sperm",
        "different",
        "would",
        "sperm",
        "one",
        "pursues",
        "matter",
        "far",
        "enough",
        "indeterminacy",
        "infect",
        "resulting",
        "body",
        "must",
        "therefore",
        "difference",
        "neither",
        "natural",
        "language",
        "intuition",
        "tell",
        "u",
        "whether",
        "difference",
        "alters",
        "identity",
        "human",
        "body",
        "point",
        "question",
        "whether",
        "body",
        "matter",
        "fact",
        "one",
        "describe",
        "case",
        "respect",
        "matter",
        "controversy",
        "philosopher",
        "think",
        "one",
        "talk",
        "vague",
        "identity",
        "partial",
        "identity",
        "others",
        "think",
        "expression",
        "nonsensical",
        "space",
        "discus",
        "issue",
        "enough",
        "assume",
        "however",
        "question",
        "one",
        "allowed",
        "use",
        "concept",
        "identity",
        "effect",
        "care",
        "one",
        "characterize",
        "case",
        "substantive",
        "matter",
        "fact",
        "case",
        "substantial",
        "overlap",
        "constitution",
        "fact",
        "bedrock",
        "fact",
        "case",
        "fact",
        "whether",
        "really",
        "object",
        "would",
        "haecceitas",
        "thisness",
        "belonging",
        "individuating",
        "complex",
        "physical",
        "object",
        "assuming",
        "implausible",
        "unintelligible",
        "condition",
        "haecceitas",
        "make",
        "sense",
        "found",
        "one",
        "might",
        "plausibly",
        "claim",
        "similar",
        "overlap",
        "constitution",
        "applied",
        "counterfactual",
        "identity",
        "mind",
        "geoffrey",
        "madell",
        "word",
        "present",
        "body",
        "thus",
        "partial",
        "counterpart",
        "possible",
        "world",
        "present",
        "consciousness",
        "present",
        "state",
        "consciousness",
        "imagine",
        "either",
        "mine",
        "question",
        "degree",
        "imagine",
        "case",
        "sure",
        "whether",
        "would",
        "jones",
        "body",
        "hence",
        "jones",
        "would",
        "created",
        "slightly",
        "modified",
        "sperm",
        "egg",
        "say",
        "would",
        "object",
        "consciousness",
        "story",
        "something",
        "something",
        "different",
        "whole",
        "story",
        "overlap",
        "constitution",
        "jones",
        "body",
        "approach",
        "would",
        "well",
        "physical",
        "object",
        "suppose",
        "jones",
        "reflective",
        "mood",
        "asks",
        "happened",
        "would",
        "existed",
        "least",
        "three",
        "answer",
        "might",
        "give",
        "either",
        "would",
        "would",
        "tell",
        "ii",
        "fact",
        "matter",
        "whether",
        "would",
        "would",
        "existed",
        "misposed",
        "question",
        "iii",
        "way",
        "degree",
        "would",
        "way",
        "degree",
        "would",
        "creature",
        "would",
        "existed",
        "would",
        "kind",
        "overlap",
        "psychic",
        "constitution",
        "third",
        "answer",
        "parallel",
        "response",
        "would",
        "give",
        "case",
        "body",
        "account",
        "subjective",
        "situation",
        "arguable",
        "make",
        "sense",
        "call",
        "creature",
        "would",
        "emerged",
        "slightly",
        "modified",
        "sperm",
        "jones",
        "overlap",
        "suggestion",
        "say",
        "jones",
        "original",
        "body",
        "would",
        "identical",
        "jones",
        "psychic",
        "life",
        "would",
        "jones",
        "would",
        "like",
        "jones",
        "indeed",
        "jones",
        "might",
        "psychic",
        "life",
        "like",
        "jones",
        "make",
        "perfect",
        "sense",
        "might",
        "degree",
        "psyche",
        "jones",
        "existed",
        "arguably",
        "make",
        "sense",
        "take",
        "case",
        "jones",
        "jones",
        "exactly",
        "similar",
        "life",
        "throughout",
        "similar",
        "mental",
        "event",
        "share",
        "make",
        "sense",
        "suggest",
        "jones",
        "might",
        "participated",
        "whole",
        "jones",
        "psychic",
        "life",
        "rather",
        "ghostly",
        "manner",
        "clearly",
        "notion",
        "overlap",
        "numerically",
        "identical",
        "psychic",
        "part",
        "applied",
        "way",
        "overlap",
        "actual",
        "bodily",
        "part",
        "constitution",
        "quite",
        "unproblematically",
        "might",
        "make",
        "one",
        "try",
        "second",
        "answer",
        "apply",
        "overlap",
        "answer",
        "jones",
        "body",
        "question",
        "whether",
        "mind",
        "subject",
        "would",
        "clear",
        "sense",
        "difficult",
        "see",
        "suppose",
        "jones",
        "found",
        "originally",
        "one",
        "twin",
        "sense",
        "zygote",
        "developed",
        "divided",
        "half",
        "died",
        "soon",
        "afterwards",
        "entertain",
        "thought",
        "half",
        "died",
        "would",
        "never",
        "existed",
        "conscious",
        "though",
        "someone",
        "would",
        "whose",
        "life",
        "inner",
        "outer",
        "might",
        "similar",
        "might",
        "feel",
        "rather",
        "guiltily",
        "grateful",
        "half",
        "died",
        "would",
        "strange",
        "think",
        "jones",
        "wrong",
        "think",
        "matter",
        "fact",
        "one",
        "manage",
        "transition",
        "case",
        "matter",
        "fact",
        "case",
        "reasoning",
        "correct",
        "one",
        "left",
        "first",
        "option",
        "absolute",
        "matter",
        "fact",
        "subjective",
        "point",
        "view",
        "physical",
        "example",
        "considered",
        "show",
        "something",
        "essentially",
        "complex",
        "case",
        "constitution",
        "degree",
        "overlap",
        "constitution",
        "inevitably",
        "possible",
        "mind",
        "must",
        "simple",
        "possible",
        "something",
        "like",
        "cartesian",
        "substance"
    ]
}