{
    "main_text": "Philosophy of Science || Against “Newtonian Method”: The Duhem Thesis\n2.1 Against “Newtonian Method”: The Duhem Thesis\n\n\nDuhem’s work was important for members of the Vienna Circle,\nincluding Otto Neurath and Philipp Frank, as it had been for Ernst\nMach (for a comparison between Duhem and Mach on thought experiments\nand conventionalism, see Buzzoni 2015). Despite Duhem’s\nconservative beliefs, his work was also taken up by participants in\nthe Viennese political scene, such as Friedrich Adler, who had\ntranslated La théorie physique into German in\n1908. The Duhem thesis surfaced fully in Anglo-American philosophy in\nthe 1950s through the work of W. V. O.  Quine. In Quine’s\n“Two Dogmas of Empiricism,” the second dogma is\nreductionism, the belief that “each meaningful statement is\nequivalent to some construct upon terms which refer to immediate\nexperience” (1953, 20). Quine argues that reductionism is an\nill-founded dogma. He asserts that although reductionism has ceased to\nfigure in some empiricists’ thoughts, there remains a more\nsubtle form of reductionism that each statement taken in isolation can\nadmit confirmation or disconfirmation. Against this dogma Quine\nsuggests that “our statements about the external world face the\ntribunal of sense experience not individually, but only as a corporate\nbody” (1953, 41), and, in a footnote of the reprinted article in\nhis collected essays, From a Logical Point of View, says that\nthe doctrine was well argued by Pierre Duhem. Quine proceeds to detail\nan “empiricism without the dogmas” in which knowledge is\nto be likened to a field of force where “a conflict with\nexperience at the periphery occasions readjustments in the interior of\nthe field” (1953, 42), and “any statement can be held true\ncome what may, if we make drastic enough adjustments elsewhere in the\nsystem” (1953, 43). Because of Quine’s reference to Duhem,\nthe thesis formed from the two sub-theses, that (i) since empirical\nstatements are interconnected, they cannot be singly disconfirmed, and\n(ii), if we wish to hold a particular statement true we can always\nadjust another statement, has become known as the Duhem-Quine\nthesis.The antecedent of sub-thesis (i) is often referred to as\n“holism.” Quine attributes only sub-thesis (i) to Duhem;\nDuhem would have recognized sub-thesis (i) as an offspring of his, but\nwould not have fully agreed with it as formulated by Quine.\n\n\nDuhem does not claim that when there is some conflict with\nexperience, we can always make enough adjustments elsewhere in the\nsystem. He makes a weaker claim, also limited in other ways, but which\nwould be equivalent to: when there is some conflict with experience\nwhat is disconfirmed is necessarily ambiguous. Duhem’s\nformulation of his non-falsifiability thesis is that “if the\npredicted phenomenon is not produced, not only is the questioned\nproposition put into doubt, but also the whole theoretical scaffolding\nused by the physicist” (1914, 281; 1954, 185). He does not take\nthe second Quinean step of holding any statement true come what may,\nbut says “the only thing the experiment teaches us is that, among\nall the propositions used to predict the phenomenon and to verify that\nit has not been produced, there is at least one error; but where the\nerror lies is just what the experiment does not tell us” (1914,\n281; 1954, 185). He refers to two possible ways of proceeding when an\nexperiment contradicts the consequences of a theory: a timid scientist\nmight wish to safeguard certain fundamental hypotheses and attempt to\ncomplicate matters by invoking various cases of error and multiplying\nthe corrections, while a bolder scientist can resolve to change some of\nthe essential suppositions supporting the entire system (1914, 329;\n1954, 216–17). The scientist has no guarantee of success: “If\nthey both succeed in satisfying the requirements of the experiment,\neach is logically permitted to declare himself content with\nthe work he has accomplished” (1914, 330; 1954, 217).\n\n\nMoreover, Duhem does not argue directly for the non-falsifiability\nthesis. He seems to regard it as an obvious corollary of another\nthesis, which could be called the non-separability thesis, that the\nphysicist can never submit an isolated hypothesis to experimental test:\n“To seek to separate each of the hypotheses of theoretical\nphysics from the other assumptions upon which this science rests, in\norder to subject it in isolation to the control of observation, is to\npursue a chimera” (1914, 303; 1954, 199–200).\n\n\nThe Duhemian thesis usually makes its appearance in the context of\nDuhem’s critique of the inductive method (or what he calls the\nNewtonian method), which rejects any hypothesis about imperceptible\nbodies and hidden movements and admits only general laws known by\ninduction from observation. Duhem accuses this method of being\nunmanageable; he asserts that a science can only follow the Newtonian\nmethod when its means of knowing are those of common sense: “When\nscience no longer observes facts directly but substitutes for them\nmeasurements, given by instruments, of magnitudes that mathematical\ntheory alone defines, induction can no longer be practiced in the\nmanner that the Newtonian method requires,” (1917, 153; [EHPS,\n234]). He clearly indicates that some sciences can use the Newtonian\nmethod, derive their principles by induction from observation and\ndisconfirm them as tests warrant. What Duhem thinks is wrong with\ninductivism is that it cannot be used by all sciences. For Duhem the\nnon-falsifiability thesis is a consequence of the non-separability thesis, and\nthe non-separability thesis is an empirical thesis depending upon factors\nthat do not govern all sciences. This is supported as well by\nDuhem’s assertions, in La théorie physique, that\nhe is imposing narrow limits on his inquiry, and is restricting his\ngeneralizations to physics; when he first announces the non-separability\nthesis, he announces it as a principle about what physicists do, whose\nconsequences will be developed in the remainder of the\nbook.\n\n\nIt is not generally known that Duhem in his lifetime confronted an\nextension of his thesis in the fashion of Quine and had previously\nrejected it. In the 1913 essay entitled “Examen logique de la\nthéorie physique,” republished as part II of the overview\nof all his work, Duhem sketched the set of theses constituting the\nDuhem thesis and stated:\n\n\nSeparated from the various schools of Pragmatists on the subject of\nthe value of physical theory, we do not take our stand, in any\ncircumstance, among the number of their followers. The analysis we have\ngiven of experiments in physics shows fact to be completely\ninterpenetrated by theoretical interpretation, to the point where it\nbecomes impossible to express fact in isolation from theory, in such\nexperiments. This analysis has found great favor on the side of many\nPragmatists. They have extended it to the most diverse fields: to\nhistory, to exegesis, to theology. (1917, 156 [EHPS, 237])\n\n\nThus, already by 1913, the scope of Duhem’s thesis had been\nstretched beyond Duhem’s intentions. “The several authors\nwe have just cited often draw from this analysis of the experimental\nmethod used in physics conclusions which go beyond the boundaries of\nphysics; we shall not follow them that far, but shall stay always\nwithin the limits of physical science” (1914, 218n; 1954, 144n).\nWhile Duhem did not identify these authors, these\n“pragmatists,” as early as 1905, in a footnote of La\nthéorie physique, he asserts that some of his friends and\nacquaintances and, in particular, Gaston Milhaud, Edouard Le Roy, and\nJoseph Wilbois had adopted his analysis of experimental method, as\ndiscussed in his earlier articles (1914, 217–218n; 1954, 144n). And\nthese same thinkers, together with Duhem’s very good friend,\nMaurice Blondel, were referred to favorably as “French\npragmatists” by William James in 1907 in his Lectures on\nPragmatism: “If my lectures interest any reader in the\ngeneral subject, he will doubtless wish to read farther. I therefore\ngive him a few references. … Furthermore, see J. Milhaud, Le\nRationnel, 1898, and the fine articles by Le Roy in the Revue\nde Metaphysique, vols. 7, 8, and 9. Also articles by Blondel and\nde Sailly in the Annales de Philosophie Chrétienne,\n4eme Série, vols. 2 and 3. Papini announces a book on\nPragmatism, in the French language, to be published very soon”\n(James, 1981, 3; a quick glance at Milhaud’s Le\nRationnel reveals numerous references to Duhem). Thus the Duhem\nthesis in its extended form was favorably received in the Anglophone\nworld during the first few decades of the twentieth century, well\nbefore Quine’s reference to it. Duhem’s reaction to the\nextension of his thesis was as follows:\n\n\nWe do not deny that this extension is legitimate to some extent.\nHowever different the problems may be, it is always the same human\nintellect that exerts itself to resolve them. In the same way, there is\nalways something common in the several procedures reason employs. But\nif it is good to notice the analogies between our diverse scientific\nmethods, it is on condition that we do not forget the differences\nseparating them. And, when we compare the method of physics, so\nstrangely specialized in the application of mathematical theory and by\nthe use of measuring instruments, to other methods, there are surely\nmore differences to describe than analogies to discover. (1917, 156\n[EHPS, 237])\n",
    "section_title": "2.1 Against “Newtonian Method”: The Duhem Thesis",
    "entry_title": "Pierre Duhem",
    "hierarchy_title": "Pierre Duhem || Philosophy of Science || Against “Newtonian Method”: The Duhem Thesis",
    "tokenized_text": [
        "philosophy",
        "science",
        "newtonian",
        "method",
        "duhem",
        "thesis",
        "newtonian",
        "method",
        "duhem",
        "thesis",
        "duhem",
        "work",
        "important",
        "member",
        "vienna",
        "circle",
        "including",
        "otto",
        "neurath",
        "philipp",
        "frank",
        "ernst",
        "mach",
        "comparison",
        "duhem",
        "mach",
        "thought",
        "experiment",
        "conventionalism",
        "see",
        "buzzoni",
        "despite",
        "duhem",
        "conservative",
        "belief",
        "work",
        "also",
        "taken",
        "participant",
        "viennese",
        "political",
        "scene",
        "friedrich",
        "adler",
        "translated",
        "la",
        "théorie",
        "physique",
        "german",
        "duhem",
        "thesis",
        "surfaced",
        "fully",
        "angloamerican",
        "philosophy",
        "s",
        "work",
        "w",
        "v",
        "o",
        "quine",
        "quine",
        "two",
        "dogma",
        "empiricism",
        "second",
        "dogma",
        "reductionism",
        "belief",
        "meaningful",
        "statement",
        "equivalent",
        "construct",
        "upon",
        "term",
        "refer",
        "immediate",
        "experience",
        "quine",
        "argues",
        "reductionism",
        "illfounded",
        "dogma",
        "asserts",
        "although",
        "reductionism",
        "ceased",
        "figure",
        "empiricist",
        "thought",
        "remains",
        "subtle",
        "form",
        "reductionism",
        "statement",
        "taken",
        "isolation",
        "admit",
        "confirmation",
        "disconfirmation",
        "dogma",
        "quine",
        "suggests",
        "statement",
        "external",
        "world",
        "face",
        "tribunal",
        "sense",
        "experience",
        "individually",
        "corporate",
        "body",
        "footnote",
        "reprinted",
        "article",
        "collected",
        "essay",
        "logical",
        "point",
        "view",
        "say",
        "doctrine",
        "well",
        "argued",
        "pierre",
        "duhem",
        "quine",
        "proceeds",
        "detail",
        "empiricism",
        "without",
        "dogma",
        "knowledge",
        "likened",
        "field",
        "force",
        "conflict",
        "experience",
        "periphery",
        "occasion",
        "readjustment",
        "interior",
        "field",
        "statement",
        "held",
        "true",
        "come",
        "may",
        "make",
        "drastic",
        "enough",
        "adjustment",
        "elsewhere",
        "system",
        "quine",
        "reference",
        "duhem",
        "thesis",
        "formed",
        "two",
        "subtheses",
        "since",
        "empirical",
        "statement",
        "interconnected",
        "singly",
        "disconfirmed",
        "ii",
        "wish",
        "hold",
        "particular",
        "statement",
        "true",
        "always",
        "adjust",
        "another",
        "statement",
        "become",
        "known",
        "duhemquine",
        "thesisthe",
        "antecedent",
        "subthesis",
        "often",
        "referred",
        "holism",
        "quine",
        "attribute",
        "subthesis",
        "duhem",
        "duhem",
        "would",
        "recognized",
        "subthesis",
        "offspring",
        "would",
        "fully",
        "agreed",
        "formulated",
        "quine",
        "duhem",
        "claim",
        "conflict",
        "experience",
        "always",
        "make",
        "enough",
        "adjustment",
        "elsewhere",
        "system",
        "make",
        "weaker",
        "claim",
        "also",
        "limited",
        "way",
        "would",
        "equivalent",
        "conflict",
        "experience",
        "disconfirmed",
        "necessarily",
        "ambiguous",
        "duhem",
        "formulation",
        "nonfalsifiability",
        "thesis",
        "predicted",
        "phenomenon",
        "produced",
        "questioned",
        "proposition",
        "put",
        "doubt",
        "also",
        "whole",
        "theoretical",
        "scaffolding",
        "used",
        "physicist",
        "take",
        "second",
        "quinean",
        "step",
        "holding",
        "statement",
        "true",
        "come",
        "may",
        "say",
        "thing",
        "experiment",
        "teach",
        "u",
        "among",
        "proposition",
        "used",
        "predict",
        "phenomenon",
        "verify",
        "produced",
        "least",
        "one",
        "error",
        "error",
        "lie",
        "experiment",
        "tell",
        "u",
        "refers",
        "two",
        "possible",
        "way",
        "proceeding",
        "experiment",
        "contradicts",
        "consequence",
        "theory",
        "timid",
        "scientist",
        "might",
        "wish",
        "safeguard",
        "certain",
        "fundamental",
        "hypothesis",
        "attempt",
        "complicate",
        "matter",
        "invoking",
        "various",
        "case",
        "error",
        "multiplying",
        "correction",
        "bolder",
        "scientist",
        "resolve",
        "change",
        "essential",
        "supposition",
        "supporting",
        "entire",
        "system",
        "scientist",
        "guarantee",
        "success",
        "succeed",
        "satisfying",
        "requirement",
        "experiment",
        "logically",
        "permitted",
        "declare",
        "content",
        "work",
        "accomplished",
        "moreover",
        "duhem",
        "argue",
        "directly",
        "nonfalsifiability",
        "thesis",
        "seems",
        "regard",
        "obvious",
        "corollary",
        "another",
        "thesis",
        "could",
        "called",
        "nonseparability",
        "thesis",
        "physicist",
        "never",
        "submit",
        "isolated",
        "hypothesis",
        "experimental",
        "test",
        "seek",
        "separate",
        "hypothesis",
        "theoretical",
        "physic",
        "assumption",
        "upon",
        "science",
        "rest",
        "order",
        "subject",
        "isolation",
        "control",
        "observation",
        "pursue",
        "chimera",
        "duhemian",
        "thesis",
        "usually",
        "make",
        "appearance",
        "context",
        "duhem",
        "critique",
        "inductive",
        "method",
        "call",
        "newtonian",
        "method",
        "reject",
        "hypothesis",
        "imperceptible",
        "body",
        "hidden",
        "movement",
        "admits",
        "general",
        "law",
        "known",
        "induction",
        "observation",
        "duhem",
        "accuses",
        "method",
        "unmanageable",
        "asserts",
        "science",
        "follow",
        "newtonian",
        "method",
        "mean",
        "knowing",
        "common",
        "sense",
        "science",
        "longer",
        "observes",
        "fact",
        "directly",
        "substitute",
        "measurement",
        "given",
        "instrument",
        "magnitude",
        "mathematical",
        "theory",
        "alone",
        "defines",
        "induction",
        "longer",
        "practiced",
        "manner",
        "newtonian",
        "method",
        "requires",
        "ehps",
        "clearly",
        "indicates",
        "science",
        "use",
        "newtonian",
        "method",
        "derive",
        "principle",
        "induction",
        "observation",
        "disconfirm",
        "test",
        "warrant",
        "duhem",
        "think",
        "wrong",
        "inductivism",
        "used",
        "science",
        "duhem",
        "nonfalsifiability",
        "thesis",
        "consequence",
        "nonseparability",
        "thesis",
        "nonseparability",
        "thesis",
        "empirical",
        "thesis",
        "depending",
        "upon",
        "factor",
        "govern",
        "science",
        "supported",
        "well",
        "duhem",
        "assertion",
        "la",
        "théorie",
        "physique",
        "imposing",
        "narrow",
        "limit",
        "inquiry",
        "restricting",
        "generalization",
        "physic",
        "first",
        "announces",
        "nonseparability",
        "thesis",
        "announces",
        "principle",
        "physicist",
        "whose",
        "consequence",
        "developed",
        "remainder",
        "book",
        "generally",
        "known",
        "duhem",
        "lifetime",
        "confronted",
        "extension",
        "thesis",
        "fashion",
        "quine",
        "previously",
        "rejected",
        "essay",
        "entitled",
        "examen",
        "logique",
        "de",
        "la",
        "théorie",
        "physique",
        "republished",
        "part",
        "ii",
        "overview",
        "work",
        "duhem",
        "sketched",
        "set",
        "thesis",
        "constituting",
        "duhem",
        "thesis",
        "stated",
        "separated",
        "various",
        "school",
        "pragmatist",
        "subject",
        "value",
        "physical",
        "theory",
        "take",
        "stand",
        "circumstance",
        "among",
        "number",
        "follower",
        "analysis",
        "given",
        "experiment",
        "physic",
        "show",
        "fact",
        "completely",
        "interpenetrated",
        "theoretical",
        "interpretation",
        "point",
        "becomes",
        "impossible",
        "express",
        "fact",
        "isolation",
        "theory",
        "experiment",
        "analysis",
        "found",
        "great",
        "favor",
        "side",
        "many",
        "pragmatist",
        "extended",
        "diverse",
        "field",
        "history",
        "exegesis",
        "theology",
        "ehps",
        "thus",
        "already",
        "scope",
        "duhem",
        "thesis",
        "stretched",
        "beyond",
        "duhem",
        "intention",
        "several",
        "author",
        "cited",
        "often",
        "draw",
        "analysis",
        "experimental",
        "method",
        "used",
        "physic",
        "conclusion",
        "go",
        "beyond",
        "boundary",
        "physic",
        "shall",
        "follow",
        "far",
        "shall",
        "stay",
        "always",
        "within",
        "limit",
        "physical",
        "science",
        "n",
        "n",
        "duhem",
        "identify",
        "author",
        "pragmatist",
        "early",
        "footnote",
        "la",
        "théorie",
        "physique",
        "asserts",
        "friend",
        "acquaintance",
        "particular",
        "gaston",
        "milhaud",
        "edouard",
        "le",
        "roy",
        "joseph",
        "wilbois",
        "adopted",
        "analysis",
        "experimental",
        "method",
        "discussed",
        "earlier",
        "article",
        "n",
        "n",
        "thinker",
        "together",
        "duhem",
        "good",
        "friend",
        "maurice",
        "blondel",
        "referred",
        "favorably",
        "french",
        "pragmatist",
        "william",
        "james",
        "lecture",
        "pragmatism",
        "lecture",
        "interest",
        "reader",
        "general",
        "subject",
        "doubtless",
        "wish",
        "read",
        "farther",
        "therefore",
        "give",
        "reference",
        "furthermore",
        "see",
        "j",
        "milhaud",
        "le",
        "rationnel",
        "fine",
        "article",
        "le",
        "roy",
        "revue",
        "de",
        "metaphysique",
        "vols",
        "also",
        "article",
        "blondel",
        "de",
        "sailly",
        "annales",
        "de",
        "philosophie",
        "chrétienne",
        "eme",
        "série",
        "vols",
        "papini",
        "announces",
        "book",
        "pragmatism",
        "french",
        "language",
        "published",
        "soon",
        "james",
        "quick",
        "glance",
        "milhaud",
        "le",
        "rationnel",
        "reveals",
        "numerous",
        "reference",
        "duhem",
        "thus",
        "duhem",
        "thesis",
        "extended",
        "form",
        "favorably",
        "received",
        "anglophone",
        "world",
        "first",
        "decade",
        "twentieth",
        "century",
        "well",
        "quine",
        "reference",
        "duhem",
        "reaction",
        "extension",
        "thesis",
        "follows",
        "deny",
        "extension",
        "legitimate",
        "extent",
        "however",
        "different",
        "problem",
        "may",
        "always",
        "human",
        "intellect",
        "exerts",
        "resolve",
        "way",
        "always",
        "something",
        "common",
        "several",
        "procedure",
        "reason",
        "employ",
        "good",
        "notice",
        "analogy",
        "diverse",
        "scientific",
        "method",
        "condition",
        "forget",
        "difference",
        "separating",
        "compare",
        "method",
        "physic",
        "strangely",
        "specialized",
        "application",
        "mathematical",
        "theory",
        "use",
        "measuring",
        "instrument",
        "method",
        "surely",
        "difference",
        "describe",
        "analogy",
        "discover",
        "ehps"
    ]
}