{
    "main_text": "Philosophy of Science || Later Developments\n3. History of Science\n\n\nFor most of the nineteenth century, scholars treated “medieval\nscience” as an oxymoron. Since nothing from the Middle Ages was\nworthy of the name “science,” no history of medieval\nscience could be written. For example, William Whewell referred to\nGreek philosophy as “the period of the first waking of\nscience” and to the medieval era as “that of its mid-day\nslumber” (1857, I, Introduction). As a result, Whewell’s\nchapter on medieval science from the History of the Inductive\nSciences, entitled “Of the Mysticism of the Middle\nAges,” was just two-pages long.\n\n\nWith work such as Whewell’s being typical of Duhem’s\nintellectual context, when Duhem wrote L’évolution de\nla mécanique, in 1903, he dismissed the Middle Ages as\nscientifically sterile. Similarly, Duhem’s history of chemical\ncombination, Le mixte et la combinaison chimique, published in\nbook-form in 1902, had jumped from Aristotle’s concept of\nmixtio to modern concepts. It was only in 1904, while writing\nLes origines de la statique that Duhem came across an unusual\nreference to a then-unknown medieval thinker, Jordanus de Nemore. His\npursuit of this reference, and the research to which it led, is widely\nacknowledged to have created the field of the history of medieval\nscience. Where Duhem’s previous histories had been silent,\nLes origines de la statique contained a number of chapters on\nmedieval science: one treated Jordanus de Nemore; another treated his\nfollowers; a third argued their influence on Leonardo de Vinci. In the\nsecond volume, Duhem greatly extended his historical scope. As\nexpected, he covered seventeenth-century statics, but he also returned\nto the middle ages, spending four chapters on geostatics, including the\nwork of Albert of Saxony in the fourteenth century. Les origines de\nla statique is thus a transition from Duhem’s early\nconventional histories to the later work for which he is best known,\nEtudes sur Léonard de Vinci, and Le Système\ndu monde, in which his thesis of the continuity of late medieval\nand early modern science is fully displayed.\n\n\nFrom 1906 to 1913, Duhem delved deeply into his favorite guide for the\nrecovery of the past, the scientific notebooks of Leonardo de Vinci. He\npublished a series of essays uncovering de Vinci’s medieval\nsources and their influences on the moderns. The third volume of\nDuhem’s Etudes sur Léonard de Vinci gained a new\nsubtitle, Les précurseurs parisiens de Galilée,\nannouncing Duhem’s bold new thesis that even the works of Galileo\nhad a medieval heritage; reviewing his historical accomplishments,\nDuhem summarized them as follows:\n\n\nWhen we see the science of Galileo triumph over the stubborn\nPeripatetic philosophy of somebody like Cremonini, we believe, since we\nare ill-informed about the history of human thought, that we are\nwitness to the victory of modern, young science over medieval\nphilosophy, so obstinate in its mechanical repetition. In truth, we are\ncontemplating the well-paved triumph of the science born at Paris\nduring the fourteenth century over the doctrines of Aristotle and\nAverroes, restored into repute by the Italian Renaissance. (1917, 162\n[EHPS, 193])\n\n\nDuhem presented Galilean dynamics as a continuous development out of\nmedieval dynamics. He recovered the late medieval theory of impetus,\ntracing it from John Philoponus’ criticism of Aristotle to its\nmature statements in the fourteenth century works of John Buridan and\nNicole Oresme: “The role that impetus played in Buridan’s\ndynamics is exactly the one that Galileo attributed to impeto\nor momento, Descartes to ‘quantity of motion,’ and\nLeibniz finally to vis viva. So exact is this\ncorrespondence that, in order to exhibit Galileo’s dynamics,\nTorricelli, in his Lezioni accademiche, often took up\nBuridan’s reasons and almost his exact words” (1917, 163–62\n[EHPS, 194]). Duhem then sketched the extension of impetus theory from\nterrestrial dynamics to the motions of the heavens and earth:\n\n\nNicole Oresme attributed to the earth a natural impetus similar to\nthe one Buridan attributed to the celestial orbs. In order to account\nfor the vertical fall of weights, he allowed that one must compose this\nimpetus by which the mobile rotates around the earth with the impetus\nengendered by weight. The principle he distinctly formulated was only\nobscurely indicated by Copernicus and merely repeated by Giordano\nBruno. Galileo used geometry to derive the consequences of that\nprinciple, but without correcting the incorrect form of the law of\ninertia implied in it. (1917, 166 [EHPS, 196])\n\n\nDuhem’s essays on Leonardo de Vinci concluded with a\nspeculation about the means for the transmission of medieval ideas to\nmodern science. Since the studies of Buridan and Oresme had remained in\nlarge part in manuscript, Duhem suggested that Albert of Saxony, whose\nworks were printed and reprinted during the sixteenth century, was the\nlikely link to Galileo. Duhem’s key to understanding the\ntransmission of medieval science was Galileo’s use of the phrase\nDoctores Parisienses, a conventional label denoting Buridan\nand Oresme, among others. Based on evidence including references to\ncertain unusual doctrines and the particular order in which the\nquestions were arranged, Duhem conjectured that Galileo had consulted\nGeorge Lokert’s compilation of Albert of Saxony, Themo Judaeus,\nand others, and the works of the Dominican Domingo de Soto (1906–13,\nIII.582–83). Duhem’s conjecture has been revised and expanded\nupon: The means of transmission has been made clearer because of the\nlabor of A. C. Crombie, Adriano Carugo, and William Wallace.\n\n\nIn the three years before his death in 1916, Duhem wrote Le\nSystème du monde, but did not succeed in finishing it. He\nintended it as a twelve-volume work on the history of cosmological\ndoctrines, ending with Copernicus. He completed nine volumes, the\nfirst five being published from 1914 to 1919, and the next four having\nto wait until the 1950s; a tenth, incomplete volume was also published\nthen. These tomes impart an enormous amount of information about\nmedieval astronomy, astrology, tidal theory, and geostatics, again\npresenting many sources for the first time in the modern era. They\nalso trace developments in doctrines associated with such concepts as\ninfinity, place, time, void, and the plurality or unity of the world.\nDuhem intended to write a 300-page summary of his results after he was\ndone with the Le Système du monde; he did not have the\ntime to accomplish what would have surely been an amazing\nvolume. (Duhem [LAS] is an attempt to construct such a single volume\nfrom the ten volumes of the Le Système du monde.)\n\n\nUnlike his philosophical work, Duhem’s influential contemporaries\ndid not receive his historical work with sympathy. As early as 1916,\nAntonio Favaro, the editor of Le Opere di Galileo Galilei,\nrejected the continuity of medieval and early modern science. The next\ngeneration of historians of science, Alexandre Koyré for\nexample, acknowledged Duhem’s studies as the foundation for\nmodern studies of medieval science, but subjected them to harsh\ncriticism. Two themes divide Koyré’s historical work from\nthat of Duhem. It presents histories of science in which metaphysics\nplays a primary role in explaining scientific change and it espouses a\nhistoriography that gives a central place to the concept of revolution.\nMedieval thought and early modern science are judged to be different in\nkind as well as in content.\n\n\nAt the beginning of an essay on void and infinite space, Koyré\nquotes a passage from Duhem that has become infamous: “If we were\nobliged to assign a date to the birth of modern science, we would\nundoubtedly choose 1277, when the Bishop of Paris solemnly proclaimed\nthat a multiplicity of worlds could exist, and that the system of\ncelestial spheres could, without contradiction, be endowed with\nstraight line motion” (1906–13, II.411; see also 1913–59, VII.\n4). Koyré calls the two theses from the condemnations of 1277\n“absurdities,” noting that they arise in a theological\ncontext, and rejects Duhem’s date for the birth of modern\nscience; he remarks that Duhem gives another date elsewhere,\ncorresponding to Buridan’s impetus theory being extended to the\nheavens, but dismisses it also, saying that “it is as false as\nthe first date” (1961, 37n). For Koyré, the introduction\nof Platonic metaphysics, the mathematization of nature, marks a break\nwith the Aristotelian Middle Ages.\n\n\nKoyré’s work influenced Thomas Kuhn and others who made\n“scientific revolutions” a central feature of their\nhistorical accounts. Still, the work of Kuhn and later historically\noriented philosophers and sociologists of science did attempt to\nreintegrate the philosophical and historical studies that Duhem pursued\ntogether but that were separated for a good part of the twentieth\ncentury.\n",
    "section_title": "3. History of Science",
    "entry_title": "Pierre Duhem",
    "hierarchy_title": "Pierre Duhem || Philosophy of Science || Later Developments",
    "tokenized_text": [
        "philosophy",
        "science",
        "later",
        "development",
        "history",
        "science",
        "nineteenth",
        "century",
        "scholar",
        "treated",
        "medieval",
        "science",
        "oxymoron",
        "since",
        "nothing",
        "middle",
        "age",
        "worthy",
        "name",
        "science",
        "history",
        "medieval",
        "science",
        "could",
        "written",
        "example",
        "william",
        "whewell",
        "referred",
        "greek",
        "philosophy",
        "period",
        "first",
        "waking",
        "science",
        "medieval",
        "era",
        "midday",
        "slumber",
        "introduction",
        "result",
        "whewell",
        "chapter",
        "medieval",
        "science",
        "history",
        "inductive",
        "science",
        "entitled",
        "mysticism",
        "middle",
        "age",
        "twopages",
        "long",
        "work",
        "whewell",
        "typical",
        "duhem",
        "intellectual",
        "context",
        "duhem",
        "wrote",
        "l",
        "évolution",
        "de",
        "la",
        "mécanique",
        "dismissed",
        "middle",
        "age",
        "scientifically",
        "sterile",
        "similarly",
        "duhem",
        "history",
        "chemical",
        "combination",
        "le",
        "mixte",
        "et",
        "la",
        "combinaison",
        "chimique",
        "published",
        "bookform",
        "jumped",
        "aristotle",
        "concept",
        "mixtio",
        "modern",
        "concept",
        "writing",
        "le",
        "origines",
        "de",
        "la",
        "statique",
        "duhem",
        "came",
        "across",
        "unusual",
        "reference",
        "thenunknown",
        "medieval",
        "thinker",
        "jordanus",
        "de",
        "nemore",
        "pursuit",
        "reference",
        "research",
        "led",
        "widely",
        "acknowledged",
        "created",
        "field",
        "history",
        "medieval",
        "science",
        "duhem",
        "previous",
        "history",
        "silent",
        "le",
        "origines",
        "de",
        "la",
        "statique",
        "contained",
        "number",
        "chapter",
        "medieval",
        "science",
        "one",
        "treated",
        "jordanus",
        "de",
        "nemore",
        "another",
        "treated",
        "follower",
        "third",
        "argued",
        "influence",
        "leonardo",
        "de",
        "vinci",
        "second",
        "volume",
        "duhem",
        "greatly",
        "extended",
        "historical",
        "scope",
        "expected",
        "covered",
        "seventeenthcentury",
        "static",
        "also",
        "returned",
        "middle",
        "age",
        "spending",
        "four",
        "chapter",
        "geostatics",
        "including",
        "work",
        "albert",
        "saxony",
        "fourteenth",
        "century",
        "le",
        "origines",
        "de",
        "la",
        "statique",
        "thus",
        "transition",
        "duhem",
        "early",
        "conventional",
        "history",
        "later",
        "work",
        "best",
        "known",
        "etude",
        "sur",
        "léonard",
        "de",
        "vinci",
        "le",
        "système",
        "du",
        "monde",
        "thesis",
        "continuity",
        "late",
        "medieval",
        "early",
        "modern",
        "science",
        "fully",
        "displayed",
        "duhem",
        "delved",
        "deeply",
        "favorite",
        "guide",
        "recovery",
        "past",
        "scientific",
        "notebook",
        "leonardo",
        "de",
        "vinci",
        "published",
        "series",
        "essay",
        "uncovering",
        "de",
        "vinci",
        "medieval",
        "source",
        "influence",
        "modern",
        "third",
        "volume",
        "duhem",
        "etude",
        "sur",
        "léonard",
        "de",
        "vinci",
        "gained",
        "new",
        "subtitle",
        "le",
        "précurseurs",
        "parisiens",
        "de",
        "galilée",
        "announcing",
        "duhem",
        "bold",
        "new",
        "thesis",
        "even",
        "work",
        "galileo",
        "medieval",
        "heritage",
        "reviewing",
        "historical",
        "accomplishment",
        "duhem",
        "summarized",
        "follows",
        "see",
        "science",
        "galileo",
        "triumph",
        "stubborn",
        "peripatetic",
        "philosophy",
        "somebody",
        "like",
        "cremonini",
        "believe",
        "since",
        "illinformed",
        "history",
        "human",
        "thought",
        "witness",
        "victory",
        "modern",
        "young",
        "science",
        "medieval",
        "philosophy",
        "obstinate",
        "mechanical",
        "repetition",
        "truth",
        "contemplating",
        "wellpaved",
        "triumph",
        "science",
        "born",
        "paris",
        "fourteenth",
        "century",
        "doctrine",
        "aristotle",
        "averroes",
        "restored",
        "repute",
        "italian",
        "renaissance",
        "ehps",
        "duhem",
        "presented",
        "galilean",
        "dynamic",
        "continuous",
        "development",
        "medieval",
        "dynamic",
        "recovered",
        "late",
        "medieval",
        "theory",
        "impetus",
        "tracing",
        "john",
        "philoponus",
        "criticism",
        "aristotle",
        "mature",
        "statement",
        "fourteenth",
        "century",
        "work",
        "john",
        "buridan",
        "nicole",
        "oresme",
        "role",
        "impetus",
        "played",
        "buridan",
        "dynamic",
        "exactly",
        "one",
        "galileo",
        "attributed",
        "impeto",
        "momento",
        "descartes",
        "quantity",
        "motion",
        "leibniz",
        "finally",
        "vi",
        "viva",
        "exact",
        "correspondence",
        "order",
        "exhibit",
        "galileo",
        "dynamic",
        "torricelli",
        "lezioni",
        "accademiche",
        "often",
        "took",
        "buridan",
        "reason",
        "almost",
        "exact",
        "word",
        "ehps",
        "duhem",
        "sketched",
        "extension",
        "impetus",
        "theory",
        "terrestrial",
        "dynamic",
        "motion",
        "heaven",
        "earth",
        "nicole",
        "oresme",
        "attributed",
        "earth",
        "natural",
        "impetus",
        "similar",
        "one",
        "buridan",
        "attributed",
        "celestial",
        "orb",
        "order",
        "account",
        "vertical",
        "fall",
        "weight",
        "allowed",
        "one",
        "must",
        "compose",
        "impetus",
        "mobile",
        "rotates",
        "around",
        "earth",
        "impetus",
        "engendered",
        "weight",
        "principle",
        "distinctly",
        "formulated",
        "obscurely",
        "indicated",
        "copernicus",
        "merely",
        "repeated",
        "giordano",
        "bruno",
        "galileo",
        "used",
        "geometry",
        "derive",
        "consequence",
        "principle",
        "without",
        "correcting",
        "incorrect",
        "form",
        "law",
        "inertia",
        "implied",
        "ehps",
        "duhem",
        "essay",
        "leonardo",
        "de",
        "vinci",
        "concluded",
        "speculation",
        "mean",
        "transmission",
        "medieval",
        "idea",
        "modern",
        "science",
        "since",
        "study",
        "buridan",
        "oresme",
        "remained",
        "large",
        "part",
        "manuscript",
        "duhem",
        "suggested",
        "albert",
        "saxony",
        "whose",
        "work",
        "printed",
        "reprinted",
        "sixteenth",
        "century",
        "likely",
        "link",
        "galileo",
        "duhem",
        "key",
        "understanding",
        "transmission",
        "medieval",
        "science",
        "galileo",
        "use",
        "phrase",
        "doctores",
        "parisienses",
        "conventional",
        "label",
        "denoting",
        "buridan",
        "oresme",
        "among",
        "others",
        "based",
        "evidence",
        "including",
        "reference",
        "certain",
        "unusual",
        "doctrine",
        "particular",
        "order",
        "question",
        "arranged",
        "duhem",
        "conjectured",
        "galileo",
        "consulted",
        "george",
        "lokert",
        "compilation",
        "albert",
        "saxony",
        "themo",
        "judaeus",
        "others",
        "work",
        "dominican",
        "domingo",
        "de",
        "soto",
        "iii",
        "duhem",
        "conjecture",
        "revised",
        "expanded",
        "upon",
        "mean",
        "transmission",
        "made",
        "clearer",
        "labor",
        "a",
        "c",
        "crombie",
        "adriano",
        "carugo",
        "william",
        "wallace",
        "three",
        "year",
        "death",
        "duhem",
        "wrote",
        "le",
        "système",
        "du",
        "monde",
        "succeed",
        "finishing",
        "intended",
        "twelvevolume",
        "work",
        "history",
        "cosmological",
        "doctrine",
        "ending",
        "copernicus",
        "completed",
        "nine",
        "volume",
        "first",
        "five",
        "published",
        "next",
        "four",
        "wait",
        "s",
        "tenth",
        "incomplete",
        "volume",
        "also",
        "published",
        "tome",
        "impart",
        "enormous",
        "amount",
        "information",
        "medieval",
        "astronomy",
        "astrology",
        "tidal",
        "theory",
        "geostatics",
        "presenting",
        "many",
        "source",
        "first",
        "time",
        "modern",
        "era",
        "also",
        "trace",
        "development",
        "doctrine",
        "associated",
        "concept",
        "infinity",
        "place",
        "time",
        "void",
        "plurality",
        "unity",
        "world",
        "duhem",
        "intended",
        "write",
        "page",
        "summary",
        "result",
        "done",
        "le",
        "système",
        "du",
        "monde",
        "time",
        "accomplish",
        "would",
        "surely",
        "amazing",
        "volume",
        "duhem",
        "la",
        "attempt",
        "construct",
        "single",
        "volume",
        "ten",
        "volume",
        "le",
        "système",
        "du",
        "monde",
        "unlike",
        "philosophical",
        "work",
        "duhem",
        "influential",
        "contemporary",
        "receive",
        "historical",
        "work",
        "sympathy",
        "early",
        "antonio",
        "favaro",
        "editor",
        "le",
        "opere",
        "di",
        "galileo",
        "galilei",
        "rejected",
        "continuity",
        "medieval",
        "early",
        "modern",
        "science",
        "next",
        "generation",
        "historian",
        "science",
        "alexandre",
        "koyré",
        "example",
        "acknowledged",
        "duhem",
        "study",
        "foundation",
        "modern",
        "study",
        "medieval",
        "science",
        "subjected",
        "harsh",
        "criticism",
        "two",
        "theme",
        "divide",
        "koyré",
        "historical",
        "work",
        "duhem",
        "present",
        "history",
        "science",
        "metaphysics",
        "play",
        "primary",
        "role",
        "explaining",
        "scientific",
        "change",
        "espouses",
        "historiography",
        "give",
        "central",
        "place",
        "concept",
        "revolution",
        "medieval",
        "thought",
        "early",
        "modern",
        "science",
        "judged",
        "different",
        "kind",
        "well",
        "content",
        "beginning",
        "essay",
        "void",
        "infinite",
        "space",
        "koyré",
        "quote",
        "passage",
        "duhem",
        "become",
        "infamous",
        "obliged",
        "assign",
        "date",
        "birth",
        "modern",
        "science",
        "would",
        "undoubtedly",
        "choose",
        "bishop",
        "paris",
        "solemnly",
        "proclaimed",
        "multiplicity",
        "world",
        "could",
        "exist",
        "system",
        "celestial",
        "sphere",
        "could",
        "without",
        "contradiction",
        "endowed",
        "straight",
        "line",
        "motion",
        "ii",
        "see",
        "also",
        "vii",
        "koyré",
        "call",
        "two",
        "thesis",
        "condemnation",
        "absurdity",
        "noting",
        "arise",
        "theological",
        "context",
        "reject",
        "duhem",
        "date",
        "birth",
        "modern",
        "science",
        "remark",
        "duhem",
        "give",
        "another",
        "date",
        "elsewhere",
        "corresponding",
        "buridan",
        "impetus",
        "theory",
        "extended",
        "heaven",
        "dismisses",
        "also",
        "saying",
        "false",
        "first",
        "date",
        "n",
        "koyré",
        "introduction",
        "platonic",
        "metaphysics",
        "mathematization",
        "nature",
        "mark",
        "break",
        "aristotelian",
        "middle",
        "age",
        "koyré",
        "work",
        "influenced",
        "thomas",
        "kuhn",
        "others",
        "made",
        "scientific",
        "revolution",
        "central",
        "feature",
        "historical",
        "account",
        "still",
        "work",
        "kuhn",
        "later",
        "historically",
        "oriented",
        "philosopher",
        "sociologist",
        "science",
        "attempt",
        "reintegrate",
        "philosophical",
        "historical",
        "study",
        "duhem",
        "pursued",
        "together",
        "separated",
        "good",
        "part",
        "twentieth",
        "century"
    ]
}