{
    "main_text": "Challenging Choice Situations, Problematic Preference Structures, and Dynamic Choice Problems || Intransitive Preferences\n1.3 Intransitive Preferences\n\nAn agent’s preference structure need not be changing over time\nfor it to prompt dynamic choice problems. Such problems can also be\nprompted by preferences that are stable but intransitive.\n\nOne’s preferences count as transitive if they satisfy the\nfollowing condition: for all x, y, and z,\nif one prefers x to y, and y to z,\nthen one also prefers x to z. If one’s\npreferences over a set of options do not satisfy this condition, then\nthese preferences count as intransitive. When one’s preferences\nover a set of options are intransitive, then one cannot rank the\noptions from most preferred to least preferred. This holds even if\none’s preferences over the options are complete, in the sense\nthat all the options are ranked with respect to one another. Suppose,\nfor example, that one prefers job A to job B, job\nB to job C, but job C to job A. In\nthis case, one’s complete preferences over the set {job\nA, job B, job C} form a preference loop,\nwhich can be represented as follows:\n\n\n\nFigure 3.\n\n\nwhere x > y is to be read as x is\npreferred to y.\n\nCould an agent really have intransitive preferences? Work in\nexperimental and theoretical economics (see, for example, Tversky\n1969) suggests that intransitive preferences exist and may\nbe quite common. Consideration of the following situation might\nhelp make it clear how intransitive preferences can arise (whether or\nnot they are rational). Suppose Jay can accept one of three jobs: job\nA is very stimulating but low-paying; job B is\nsomewhat stimulating and pays decently; job C is not\nstimulating but pays very well. Given this situation, one can imagine\nJay having the following preferences: He prefers job A over\njob B because the difference between having a low-paying job\nand a decently-paying job is not significant enough to make Jay want\nto pass up a very stimulating job. Similarly, he prefers job\nB over job C because the difference between having a\ndecently-paying job and a high-paying job is not significant enough to\nmake Jay want to pass up a stimulating job. But he prefers job\nC over job A because the difference between having a\nhigh-paying job and a low-paying job is significant enough to make Jay\nwant to pass up even a very stimulating job.\n\nGiven the famous “money pump argument,” developed by\nDonald Davidson, J. McKinsey, and Patrick Suppes (1955), it is clear\nthat intransitive preferences can be problematic. Like Dutch book\narguments regarding betting, in which the rationality of an agent is\nput into question because the agent is susceptible to having a book\nmade against her (i.e., to accepting a series of bets which are such\nthat she is bound to lose more than she can gain), the money-pump\nargument is concerned with agents who are vulnerable to making a\ncombination of choices that lead to a sure loss. According to the\nmoney-pump argument, intransitive preferences are irrational because\nthey can prompt an agent to accept a series of trade offers that\nleaves the agent with the same option he began with, but with less\nmoney. Here is a case of the relevant sort. Suppose that Alex has the\nfollowing intransitive preferences: he prefers owning a computer of\ntype A to owning a computer of type B, owning a\ncomputer of type B to owning a computer of type C,\nand owning a computer of type C to owning a computer of type\nA. Suppose also that Alex owns a computer of type C\nand a hundred dollars in spending money. Suppose finally that, given\nhis preferences between different computer types, Alex prefers (i)\nowning a computer of type B and one less dollar of spending\nmoney over owning a computer of type C, (ii) owning a\ncomputer of type A and one less dollar of spending money over\nowning a computer of type B, and (iii) owning a computer of\ntype C and one less dollar of spending money over owning a\ncomputer of type A. Then a series of unanticipated trade\nopportunities can spell trouble for Alex. In particular, given the\nopportunity to trade his current (type C) computer and a\ndollar for a computer of type B, Alex’s preferences\nwill prompt him to make the trade. Given the further opportunity to\ntrade his current (type B) computer and a dollar for a\ncomputer of type A, Alex’s preferences will prompt him\nto trade again. And given the opportunity to trade his current (type\nA) computer and a dollar for a computer of type C,\nAlex’s preferences will prompt him to make a third trade. But\nthis series of trades leaves Alex with the type of computer he started\noff with and only 97 dollars. And, given that unexpected trading\nopportunities may keep popping up, Alex’s situation may continue\nto deteriorate. Even though he values his spending money, his\npreferences make him susceptible to being used as a ‘money\npump.’ Moreover, interesting variations on the basic money pump\nargument show that an agent with intransitive preferences like those\njust considered is susceptible to being money-pumped even if he shows\nforesight and correctly anticipates his upcoming trading\nopportunities. See, for example, Rabinowicz 2000 and Dougherty\n2014.\n\nEven if he does not serve as a money pump, an agent with intransitive\npreferences can get into a great deal of trouble. To see this,\nconsider Warren Quinn’s “puzzle of the\nself-torturer” (1993): Suppose someone—who, for reasons\nthat will become apparent, Quinn calls the self-torturer—has a\nspecial electric device attached to him. The device has 1001 settings:\n0, 1, 2, 3, …, 1000 and works as follows: moving up a setting\nraises, by a tiny increment, the amount of electric current applied to\nthe self-torturer’s body. The increments in current are so small\nthat the self-torturer cannot tell the difference between adjacent\nsettings. He can, however, tell the difference between settings that\nare far apart. And, in fact, there are settings at which the\nself-torturer would experience excruciating pain. Once a week, the\nself-torturer can compare all the different settings. He must then go\nback to the setting he was at and decide if he wants to move up a\nsetting. If he does so, he gets $10,000, but he can never permanently\nreturn to a lower setting. Like most of us, the self-torturer would\nlike to increase his fortune but also cares about feeling well. Since\nthe self-torturer cannot feel any difference in comfort between\nadjacent settings but gets $10,000 at each advance, he prefers, for\nany two consecutive settings s and s+1, stopping at\ns+1 to stopping at s. But, since he does not want to\nlive in excruciating pain, even for a great fortune, he also prefers\nstopping at a low setting, such as 0, over stopping at a high setting,\nsuch as 1000.\n\nGiven his preferences, the self-torturer cannot rank the setting\noptions he faces from most preferred to least preferred. More\nspecifically, his preferences incorporate the following preference\nloop:\n\n\n\nFigure 4.\n\n\nRelatedly, the self-torturer’s preferences over the available\nsetting options are intransitive. If his preferences were transitive,\nthen, given that he prefers setting 2 to setting 1 and setting 1 to\nsetting 0, he would prefer setting 2 to setting 0. Given that he also\nprefers setting 3 to setting 2, he would (assuming transitivity)\nprefer setting 3 to setting 0. Given that he also prefers setting 4 to\nsetting 3, he would (assuming transitivity) prefer setting 4 to\nsetting 0. Continuing with this line of reasoning leads to the\nconclusion that he would, if his preferences were transitive, prefer\nsetting 1000 to setting 0. Since he does not prefer setting 1000 to\nsetting 0, his preferences are intransitive. And this intransitivity\ncan lead the self-torturer down a terrible path. In particular, if,\neach week, the self-torturer follows his preference over the pair of\nsettings he must choose between, he will end up in a situation that he\nfinds completely unacceptable. This is quite disturbing, particularly\nonce one realizes that, although the situation of the self-torturer is\npure science fiction, the self-torturer is not really alone in his\npredicament. As Quinn stresses, “most of us are like him in one\nway or another. [For example, most of us] like to eat but also care\nabout our appearance. Just one more bite will give us pleasure and\nwon’t make us look fatter; but very many bites will”\n(Quinn 1993, 199).\n\nGiven the money pump argument and the puzzle of the self-torturer, we\ncan, it seems, conclude that although intransitive preferences are\nsometimes understandable, acting on them can be far from sensible.\n(Note, however, that, as Duncan MacIntosh (2010) suggests, the notion\nof “an unacceptable situation” plays an important role\nhere and the question of how to cash out this notion stands in need of\nadditional attention. For a recent attempt at addressing this issue,\nsee (Andreou 2015), wherein instrumental rationality is portrayed as\naccountable to “subjective appraisal responses” that go\nbeyond the agent’s preferences and that sometimes allow some\noutcomes in a “preference loop” to figure as (rationally)\nacceptable and others to figure as (rationally) unacceptable.)\n",
    "section_title": "1.3 Intransitive Preferences",
    "entry_title": "Dynamic Choice",
    "hierarchy_title": "Dynamic Choice || Challenging Choice Situations, Problematic Preference Structures, and Dynamic Choice Problems || Intransitive Preferences",
    "tokenized_text": [
        "challenging",
        "choice",
        "situation",
        "problematic",
        "preference",
        "structure",
        "dynamic",
        "choice",
        "problem",
        "intransitive",
        "preference",
        "intransitive",
        "preference",
        "agent",
        "preference",
        "structure",
        "need",
        "changing",
        "time",
        "prompt",
        "dynamic",
        "choice",
        "problem",
        "problem",
        "also",
        "prompted",
        "preference",
        "stable",
        "intransitive",
        "one",
        "preference",
        "count",
        "transitive",
        "satisfy",
        "following",
        "condition",
        "x",
        "z",
        "one",
        "prefers",
        "x",
        "z",
        "one",
        "also",
        "prefers",
        "x",
        "z",
        "one",
        "preference",
        "set",
        "option",
        "satisfy",
        "condition",
        "preference",
        "count",
        "intransitive",
        "one",
        "preference",
        "set",
        "option",
        "intransitive",
        "one",
        "rank",
        "option",
        "preferred",
        "least",
        "preferred",
        "hold",
        "even",
        "one",
        "preference",
        "option",
        "complete",
        "sense",
        "option",
        "ranked",
        "respect",
        "one",
        "another",
        "suppose",
        "example",
        "one",
        "prefers",
        "job",
        "job",
        "b",
        "job",
        "b",
        "job",
        "c",
        "job",
        "c",
        "job",
        "a",
        "case",
        "one",
        "complete",
        "preference",
        "set",
        "job",
        "job",
        "b",
        "job",
        "c",
        "form",
        "preference",
        "loop",
        "represented",
        "follows",
        "figure",
        "x",
        "read",
        "x",
        "preferred",
        "y",
        "could",
        "agent",
        "really",
        "intransitive",
        "preference",
        "work",
        "experimental",
        "theoretical",
        "economics",
        "see",
        "example",
        "tversky",
        "suggests",
        "intransitive",
        "preference",
        "exist",
        "may",
        "quite",
        "common",
        "consideration",
        "following",
        "situation",
        "might",
        "help",
        "make",
        "clear",
        "intransitive",
        "preference",
        "arise",
        "whether",
        "rational",
        "suppose",
        "jay",
        "accept",
        "one",
        "three",
        "job",
        "job",
        "stimulating",
        "lowpaying",
        "job",
        "b",
        "somewhat",
        "stimulating",
        "pay",
        "decently",
        "job",
        "c",
        "stimulating",
        "pay",
        "well",
        "given",
        "situation",
        "one",
        "imagine",
        "jay",
        "following",
        "preference",
        "prefers",
        "job",
        "job",
        "b",
        "difference",
        "lowpaying",
        "job",
        "decentlypaying",
        "job",
        "significant",
        "enough",
        "make",
        "jay",
        "want",
        "pas",
        "stimulating",
        "job",
        "similarly",
        "prefers",
        "job",
        "b",
        "job",
        "c",
        "difference",
        "decentlypaying",
        "job",
        "highpaying",
        "job",
        "significant",
        "enough",
        "make",
        "jay",
        "want",
        "pas",
        "stimulating",
        "job",
        "prefers",
        "job",
        "c",
        "job",
        "difference",
        "highpaying",
        "job",
        "lowpaying",
        "job",
        "significant",
        "enough",
        "make",
        "jay",
        "want",
        "pas",
        "even",
        "stimulating",
        "job",
        "given",
        "famous",
        "money",
        "pump",
        "argument",
        "developed",
        "donald",
        "davidson",
        "j",
        "mckinsey",
        "patrick",
        "suppes",
        "clear",
        "intransitive",
        "preference",
        "problematic",
        "like",
        "dutch",
        "book",
        "argument",
        "regarding",
        "betting",
        "rationality",
        "agent",
        "put",
        "question",
        "agent",
        "susceptible",
        "book",
        "made",
        "ie",
        "accepting",
        "series",
        "bet",
        "bound",
        "lose",
        "gain",
        "moneypump",
        "argument",
        "concerned",
        "agent",
        "vulnerable",
        "making",
        "combination",
        "choice",
        "lead",
        "sure",
        "loss",
        "according",
        "moneypump",
        "argument",
        "intransitive",
        "preference",
        "irrational",
        "prompt",
        "agent",
        "accept",
        "series",
        "trade",
        "offer",
        "leaf",
        "agent",
        "option",
        "began",
        "le",
        "money",
        "case",
        "relevant",
        "sort",
        "suppose",
        "alex",
        "following",
        "intransitive",
        "preference",
        "prefers",
        "owning",
        "computer",
        "type",
        "owning",
        "computer",
        "type",
        "b",
        "owning",
        "computer",
        "type",
        "b",
        "owning",
        "computer",
        "type",
        "c",
        "owning",
        "computer",
        "type",
        "c",
        "owning",
        "computer",
        "type",
        "a",
        "suppose",
        "also",
        "alex",
        "owns",
        "computer",
        "type",
        "c",
        "hundred",
        "dollar",
        "spending",
        "money",
        "suppose",
        "finally",
        "given",
        "preference",
        "different",
        "computer",
        "type",
        "alex",
        "prefers",
        "owning",
        "computer",
        "type",
        "b",
        "one",
        "le",
        "dollar",
        "spending",
        "money",
        "owning",
        "computer",
        "type",
        "c",
        "ii",
        "owning",
        "computer",
        "type",
        "one",
        "le",
        "dollar",
        "spending",
        "money",
        "owning",
        "computer",
        "type",
        "b",
        "iii",
        "owning",
        "computer",
        "type",
        "c",
        "one",
        "le",
        "dollar",
        "spending",
        "money",
        "owning",
        "computer",
        "type",
        "a",
        "series",
        "unanticipated",
        "trade",
        "opportunity",
        "spell",
        "trouble",
        "alex",
        "particular",
        "given",
        "opportunity",
        "trade",
        "current",
        "type",
        "c",
        "computer",
        "dollar",
        "computer",
        "type",
        "b",
        "alex",
        "preference",
        "prompt",
        "make",
        "trade",
        "given",
        "opportunity",
        "trade",
        "current",
        "type",
        "b",
        "computer",
        "dollar",
        "computer",
        "type",
        "alex",
        "preference",
        "prompt",
        "trade",
        "given",
        "opportunity",
        "trade",
        "current",
        "type",
        "computer",
        "dollar",
        "computer",
        "type",
        "c",
        "alex",
        "preference",
        "prompt",
        "make",
        "third",
        "trade",
        "series",
        "trade",
        "leaf",
        "alex",
        "type",
        "computer",
        "started",
        "dollar",
        "given",
        "unexpected",
        "trading",
        "opportunity",
        "may",
        "keep",
        "popping",
        "alex",
        "situation",
        "may",
        "continue",
        "deteriorate",
        "even",
        "though",
        "value",
        "spending",
        "money",
        "preference",
        "make",
        "susceptible",
        "used",
        "money",
        "pump",
        "moreover",
        "interesting",
        "variation",
        "basic",
        "money",
        "pump",
        "argument",
        "show",
        "agent",
        "intransitive",
        "preference",
        "like",
        "considered",
        "susceptible",
        "moneypumped",
        "even",
        "show",
        "foresight",
        "correctly",
        "anticipates",
        "upcoming",
        "trading",
        "opportunity",
        "see",
        "example",
        "rabinowicz",
        "dougherty",
        "even",
        "serve",
        "money",
        "pump",
        "agent",
        "intransitive",
        "preference",
        "get",
        "great",
        "deal",
        "trouble",
        "see",
        "consider",
        "warren",
        "quinn",
        "puzzle",
        "selftorturer",
        "suppose",
        "someonewho",
        "reason",
        "become",
        "apparent",
        "quinn",
        "call",
        "selftorturerhas",
        "special",
        "electric",
        "device",
        "attached",
        "device",
        "setting",
        "work",
        "follows",
        "moving",
        "setting",
        "raise",
        "tiny",
        "increment",
        "amount",
        "electric",
        "current",
        "applied",
        "selftorturer",
        "body",
        "increment",
        "current",
        "small",
        "selftorturer",
        "tell",
        "difference",
        "adjacent",
        "setting",
        "however",
        "tell",
        "difference",
        "setting",
        "far",
        "apart",
        "fact",
        "setting",
        "selftorturer",
        "would",
        "experience",
        "excruciating",
        "pain",
        "week",
        "selftorturer",
        "compare",
        "different",
        "setting",
        "must",
        "go",
        "back",
        "setting",
        "decide",
        "want",
        "move",
        "setting",
        "get",
        "never",
        "permanently",
        "return",
        "lower",
        "setting",
        "like",
        "u",
        "selftorturer",
        "would",
        "like",
        "increase",
        "fortune",
        "also",
        "care",
        "feeling",
        "well",
        "since",
        "selftorturer",
        "feel",
        "difference",
        "comfort",
        "adjacent",
        "setting",
        "get",
        "advance",
        "prefers",
        "two",
        "consecutive",
        "setting",
        "s",
        "stopping",
        "s",
        "stopping",
        "s",
        "since",
        "want",
        "live",
        "excruciating",
        "pain",
        "even",
        "great",
        "fortune",
        "also",
        "prefers",
        "stopping",
        "low",
        "setting",
        "stopping",
        "high",
        "setting",
        "given",
        "preference",
        "selftorturer",
        "rank",
        "setting",
        "option",
        "face",
        "preferred",
        "least",
        "preferred",
        "specifically",
        "preference",
        "incorporate",
        "following",
        "preference",
        "loop",
        "figure",
        "relatedly",
        "selftorturer",
        "preference",
        "available",
        "setting",
        "option",
        "intransitive",
        "preference",
        "transitive",
        "given",
        "prefers",
        "setting",
        "setting",
        "setting",
        "setting",
        "would",
        "prefer",
        "setting",
        "setting",
        "given",
        "also",
        "prefers",
        "setting",
        "setting",
        "would",
        "assuming",
        "transitivity",
        "prefer",
        "setting",
        "setting",
        "given",
        "also",
        "prefers",
        "setting",
        "setting",
        "would",
        "assuming",
        "transitivity",
        "prefer",
        "setting",
        "setting",
        "continuing",
        "line",
        "reasoning",
        "lead",
        "conclusion",
        "would",
        "preference",
        "transitive",
        "prefer",
        "setting",
        "setting",
        "since",
        "prefer",
        "setting",
        "setting",
        "preference",
        "intransitive",
        "intransitivity",
        "lead",
        "selftorturer",
        "terrible",
        "path",
        "particular",
        "week",
        "selftorturer",
        "follows",
        "preference",
        "pair",
        "setting",
        "must",
        "choose",
        "end",
        "situation",
        "find",
        "completely",
        "unacceptable",
        "quite",
        "disturbing",
        "particularly",
        "one",
        "realizes",
        "although",
        "situation",
        "selftorturer",
        "pure",
        "science",
        "fiction",
        "selftorturer",
        "really",
        "alone",
        "predicament",
        "quinn",
        "stress",
        "u",
        "like",
        "one",
        "way",
        "another",
        "example",
        "u",
        "like",
        "eat",
        "also",
        "care",
        "appearance",
        "one",
        "bite",
        "give",
        "u",
        "pleasure",
        "make",
        "u",
        "look",
        "fatter",
        "many",
        "bite",
        "quinn",
        "given",
        "money",
        "pump",
        "argument",
        "puzzle",
        "selftorturer",
        "seems",
        "conclude",
        "although",
        "intransitive",
        "preference",
        "sometimes",
        "understandable",
        "acting",
        "far",
        "sensible",
        "note",
        "however",
        "duncan",
        "macintosh",
        "suggests",
        "notion",
        "unacceptable",
        "situation",
        "play",
        "important",
        "role",
        "question",
        "cash",
        "notion",
        "stand",
        "need",
        "additional",
        "attention",
        "recent",
        "attempt",
        "addressing",
        "issue",
        "see",
        "andreou",
        "wherein",
        "instrumental",
        "rationality",
        "portrayed",
        "accountable",
        "subjective",
        "appraisal",
        "response",
        "go",
        "beyond",
        "agent",
        "preference",
        "sometimes",
        "allow",
        "outcome",
        "preference",
        "loop",
        "figure",
        "rationally",
        "acceptable",
        "others",
        "figure",
        "rationally",
        "unacceptable"
    ]
}