{
    "main_text": "Scientific Status of Economics and its Methodology\n8. Distributive Justice\n\nAs was recognized at the time, the transition from feudalism to\ncapitalism commenced by the early sixteenth century. In his\nHistory of England, Hume argued that commerce arose in\nBritain under Henry VII circa 1500, drawing on the Flemish trade.\nSmith shared this view, and both looked to the Italian city-states of\nFlorence and Genoa a century before as critical developments. The\nshift to capitalism intensified, as both Hume and Smith recognized,\nwith the rise of the joint-stock companies, particularly the East\nIndia companies of the Dutch, French and English.\n\nThere may be no single event or even decade to mark the transition to\ncapitalism. Aristotle’s analysis of the agora in central Athens\nreminds us that markets and money were commonplace in antiquity. What\nsets capitalism apart is the emergence and central role of markets for\nthe three factors of production—land, labour, and\ncapital—and it was these that took hold during the sixteenth\ncentury. By the end of that century, possibly galvanized by other\nmajor transformations, notably the Reformation and the Scientific\nRevolution, it had become evident that prominent bankers and merchants\nwere wealthier than many aristocrats. By the mid-1600s, half the\npeople in the Netherlands lived in towns or cities and most were\nwage-earners.\n\nLand was still the primary source of wealth, and merchants were\nrenowned for retiring to a country estate. And there was widespread\nsuspicion of upstarts, not to mention appeals to the longstanding\nadage that the newly-acquired wealth would disappear by the third\ngeneration. Moreover, there was a deeply-rooted belief in the\nnecessity of ranks, most explicitly voiced by Millar and Smith.\nDespite the considerable expansion of domestic manufacturing in\nWestern Europe, there was a pronounced predilection, at least among\nthe Physiocrats and Adam Smith, to foreground the agrarian sector and\nview the aristocratic landowning class as an essential part of the\neconomic picture. Historical studies justify this emphasis. Until the\ntwentieth century, the majority of capital was invested in the\nagrarian sector, far more than in manufacturing or trade. If anything\nbest characterizes the early modern period, it was the sustained\nincrease in population due to improved fishing and agrarian\nyields.\n\nEgalitarian ideals reach back to ancient times, but in early modern\nphilosophy the arguments appeared to have more efficacy. Locke,\nRousseau, Paine, William Godwin, and Mary Wollstonecraft are just some\nof the more significant philosophers who left their mark on the modern\ntransition to a more equal society. Diderot was an important voice for\nthe abolition of the slave trade and slavery. Both Hume and Smith\nargued that wage labor was more efficient than slavery and thus gave\neconomic motivations for the significant end to slavery that came to\npass in the nineteenth century.\n\nThe primary emphasis in the early modern period was on the rights of\nthe “middling sorts”, merchants, bankers, and\nmanufacturers, in contrast to the landed aristocracy. Fiscal policy,\nas a means to address economic inequality and serve middle-class\ninterests, spawned a large body of thought, running from Hobbes to\nHume and finally to Smith, whose principles of taxation became\ncanonical until John Stuart Mill. Hume’s essay “Of the\nMiddle Station of Life”, in conjunction with his writings on\neconomics, makes plain that this group would provide the impetus for\nfuture economic growth. The commercial class was far more likely to be\nindustrious and enterprising, and serve as the backbone of modern\ncivil society and the custodians of liberal values. In his Enquiry\nConcerning the Principles of Morals (1751), Hume portrays a\nhypothetical son-in-law, Cleanthes, as a paragon of virtue. He was\nalso a lawyer and businessman and, as the father of Hume’s\nhypothetical grandchildren, the one most likely to insure that the\nfamily name would be sustained for at least one more generation.\n\nThe early modern philosophers reflected on the principles of\ninternational distributive justice and its implications for global\npeace. As Istvan Hont highlighted, the rich-country/poor-country\nquestion was vigorously debated in the eighteenth century (Hont 2005).\nGershom Carmichael and Hutcheson, for example, gave voice to these\nconcerns, but it was Hume and Smith who laid the analytic foundations.\nA country was wealthier than another not because of specie but because\nof its people and its accumulated capital in agriculture and\nmanufacturing. Josiah Tucker (1755) gave voice to the potential for\nunlimited growth, noting that higher wages were correlated with more\nskilled labor and capital infrastructure. Both Hume and Smith\nadvocated high wages, but feared that with time capital would be\nshifted to countries with lower wages until those regions were also\nenriched. Because of increasing demand worldwide, however, there was\nno reason to suppose that a nation with a healthy export sector would\ndecline. As was widely understood, Holland was testament to the\npotential of long-lived wealth, having sustained its significant\nfoothold in global trade since it reached its apogee as the most\npowerful economic nation in the 1620s.\n\nSmith is recognized as the critical figure to shift attention to the\nworking class and to advocate higher wages. He noted that merchants\nand manufacturers are strongly inclined to collude so as not to raise\nwages (Smith 1776 [1976: 267]). He noted the degradation of workers\nwho were compelled to spend their entire lives “performing a few\nsimple operations” (1776 [1976: 782]). With pointed words, he\nunderscored the dehumanizing effects of unvaried work, such that a\ntypical person\n\n\ngenerally becomes as stupid and ignorant as it is possible for a human\ncreature to become. (1776 [1976: 782])\n\n\nSmith believed this would become widespread. In\n\n\nevery improved and civilised society this is the state into which the\nlabouring poor, that is, the great body of the people, must\nnecessarily fall, unless government takes some pains to prevent it.\n(1776 [1976: 782])\n\n\nSmith advocated widespread schooling, with mechanics and gymnastics,\nand the fostering of theatre or dancing on the day of rest. He\nbelieved that inventions often came from the shopfloor, and that a\nmore orderly standing army would be fostered by men who learned to\ndevelop both body and mind.\n\nAbove all, Smith exposed the emptiness of the pursuit of wealth, that\nit consisted primarily in “the parade of riches”, which\nfeeds upon the envy of those without (Smith 1776 [1976: 190]). The\nrich garner far more pleasure from being observed riding in a carriage\nthan from the comforts a carriage might offer. Our efforts to pursue\nwealth and power stem from the universal desire for admiration and\napprobation. There is also a deep asymmetry in Smith’s account\nof human sympathy, the act of fellow-feeling, in that we sympathize\nwith the rich and shun the poor. The reason is that we imagine\nourselves in their place and thus fill in the gaps of our otherwise\ninadequate lives. It is for this reason, Smith believes, that the\nstate must insure that royalty indulge in opulent displays. Ranks are\nof great importance in the world, for motivating us to strive, driven\nby “the desire of bettering our condition” (Smith 1776\n[1976: 341]). Smith believed that we are a restless lot, that\n\n\nthere is scarce perhaps a single instant in which any man is so\nperfectly and completely satisfied with his situation, as to be\nwithout any wish of alteration or improvement of any kind. An\naugmentation of fortune is the means by which the greater part of men\npropose and wish to better their condition. (1776 [1976: 341])\n\n\nAs a result, there is nothing worse than a fall from grace and ensuing\nloss of admiration. Smith observes that “bankruptcy is perhaps\nthe greatest and most humiliating calamity which can befall an\ninnocent man” and its fear has thus fostered widespread prudence\nin the modern commercial world (Smith 1776 [1976: 342]).\n\nSmith’s portrayal of human nature is tinged with these dark\nthoughts, similar to the cynicism of Mandeville. We spend our entire\nlife attempting to garner approval, grounded in the sympathetic\nregard, and are for the most part prone to vanity and greed. His\nparable about the poor man’s son, who is driven by ambition to\nbecome wealthy only to realize at the end of his life that the\nindignities he suffered “to serve those whom he hates” and\nto be “obsequious to those whom he despises” have robbed\nhim of a “real tranquillity” that he might have achieved\nhad he known his place and remained poor. (Smith 1759 [1976: 181]).\nOnly at the end of his life does he grasp that “wealth and\ngreatness are mere trinkets”, and that the loss of friendship\nand the “injustice of his enemies” that he has suffered as\nhe climbed upwards has left him bereft of peace of mind (ibid.). Smith\nremarks that the beggar on the highway sleeps better than the king,\nand that the better aim in life is to achieve inner equanimity. Adam\nSmith, the philosopher most readily associated with the voice of\ncapitalism, could not be more disparaging about its tendencies to\nreinforce the baser features of human nature. While he endorsed rising\nstandards of living for the lower orders, his stoicism was the more\ndominant sentiment. Life was a lottery and one had best prepare for\nadversity. As Smith aptly put it, wealth might “keep off the\nsummer shower, [but] not the winter storm” (Smith 1759 [1976:\n183]). Early modern economics thus offered practical wisdom and served\nas a major resource for forging a wise and virtuous life.\n",
    "section_title": "8. Distributive Justice",
    "entry_title": "Economics in Early Modern Philosophy",
    "hierarchy_title": "Economics in Early Modern Philosophy || Scientific Status of Economics and its Methodology",
    "tokenized_text": [
        "scientific",
        "status",
        "economics",
        "methodology",
        "distributive",
        "justice",
        "recognized",
        "time",
        "transition",
        "feudalism",
        "capitalism",
        "commenced",
        "early",
        "sixteenth",
        "century",
        "history",
        "england",
        "hume",
        "argued",
        "commerce",
        "arose",
        "britain",
        "henry",
        "vii",
        "circa",
        "drawing",
        "flemish",
        "trade",
        "smith",
        "shared",
        "view",
        "looked",
        "italian",
        "citystate",
        "florence",
        "genoa",
        "century",
        "critical",
        "development",
        "shift",
        "capitalism",
        "intensified",
        "hume",
        "smith",
        "recognized",
        "rise",
        "jointstock",
        "company",
        "particularly",
        "east",
        "india",
        "company",
        "dutch",
        "french",
        "english",
        "may",
        "single",
        "event",
        "even",
        "decade",
        "mark",
        "transition",
        "capitalism",
        "aristotle",
        "analysis",
        "agora",
        "central",
        "athens",
        "reminds",
        "u",
        "market",
        "money",
        "commonplace",
        "antiquity",
        "set",
        "capitalism",
        "apart",
        "emergence",
        "central",
        "role",
        "market",
        "three",
        "factor",
        "productionland",
        "labour",
        "capitaland",
        "took",
        "hold",
        "sixteenth",
        "century",
        "end",
        "century",
        "possibly",
        "galvanized",
        "major",
        "transformation",
        "notably",
        "reformation",
        "scientific",
        "revolution",
        "become",
        "evident",
        "prominent",
        "banker",
        "merchant",
        "wealthier",
        "many",
        "aristocrat",
        "mids",
        "half",
        "people",
        "netherlands",
        "lived",
        "town",
        "city",
        "wageearners",
        "land",
        "still",
        "primary",
        "source",
        "wealth",
        "merchant",
        "renowned",
        "retiring",
        "country",
        "estate",
        "widespread",
        "suspicion",
        "upstart",
        "mention",
        "appeal",
        "longstanding",
        "adage",
        "newlyacquired",
        "wealth",
        "would",
        "disappear",
        "third",
        "generation",
        "moreover",
        "deeplyrooted",
        "belief",
        "necessity",
        "rank",
        "explicitly",
        "voiced",
        "millar",
        "smith",
        "despite",
        "considerable",
        "expansion",
        "domestic",
        "manufacturing",
        "western",
        "europe",
        "pronounced",
        "predilection",
        "least",
        "among",
        "physiocrats",
        "adam",
        "smith",
        "foreground",
        "agrarian",
        "sector",
        "view",
        "aristocratic",
        "landowning",
        "class",
        "essential",
        "part",
        "economic",
        "picture",
        "historical",
        "study",
        "justify",
        "emphasis",
        "twentieth",
        "century",
        "majority",
        "capital",
        "invested",
        "agrarian",
        "sector",
        "far",
        "manufacturing",
        "trade",
        "anything",
        "best",
        "characterizes",
        "early",
        "modern",
        "period",
        "sustained",
        "increase",
        "population",
        "due",
        "improved",
        "fishing",
        "agrarian",
        "yield",
        "egalitarian",
        "ideal",
        "reach",
        "back",
        "ancient",
        "time",
        "early",
        "modern",
        "philosophy",
        "argument",
        "appeared",
        "efficacy",
        "locke",
        "rousseau",
        "paine",
        "william",
        "godwin",
        "mary",
        "wollstonecraft",
        "significant",
        "philosopher",
        "left",
        "mark",
        "modern",
        "transition",
        "equal",
        "society",
        "diderot",
        "important",
        "voice",
        "abolition",
        "slave",
        "trade",
        "slavery",
        "hume",
        "smith",
        "argued",
        "wage",
        "labor",
        "efficient",
        "slavery",
        "thus",
        "gave",
        "economic",
        "motivation",
        "significant",
        "end",
        "slavery",
        "came",
        "pas",
        "nineteenth",
        "century",
        "primary",
        "emphasis",
        "early",
        "modern",
        "period",
        "right",
        "middling",
        "sort",
        "merchant",
        "banker",
        "manufacturer",
        "contrast",
        "landed",
        "aristocracy",
        "fiscal",
        "policy",
        "mean",
        "address",
        "economic",
        "inequality",
        "serve",
        "middleclass",
        "interest",
        "spawned",
        "large",
        "body",
        "thought",
        "running",
        "hobbes",
        "hume",
        "finally",
        "smith",
        "whose",
        "principle",
        "taxation",
        "became",
        "canonical",
        "john",
        "stuart",
        "mill",
        "hume",
        "essay",
        "middle",
        "station",
        "life",
        "conjunction",
        "writing",
        "economics",
        "make",
        "plain",
        "group",
        "would",
        "provide",
        "impetus",
        "future",
        "economic",
        "growth",
        "commercial",
        "class",
        "far",
        "likely",
        "industrious",
        "enterprising",
        "serve",
        "backbone",
        "modern",
        "civil",
        "society",
        "custodian",
        "liberal",
        "value",
        "enquiry",
        "concerning",
        "principle",
        "moral",
        "hume",
        "portrays",
        "hypothetical",
        "soninlaw",
        "cleanthes",
        "paragon",
        "virtue",
        "also",
        "lawyer",
        "businessman",
        "father",
        "hume",
        "hypothetical",
        "grandchild",
        "one",
        "likely",
        "insure",
        "family",
        "name",
        "would",
        "sustained",
        "least",
        "one",
        "generation",
        "early",
        "modern",
        "philosopher",
        "reflected",
        "principle",
        "international",
        "distributive",
        "justice",
        "implication",
        "global",
        "peace",
        "istvan",
        "hont",
        "highlighted",
        "richcountrypoorcountry",
        "question",
        "vigorously",
        "debated",
        "eighteenth",
        "century",
        "hont",
        "gershom",
        "carmichael",
        "hutcheson",
        "example",
        "gave",
        "voice",
        "concern",
        "hume",
        "smith",
        "laid",
        "analytic",
        "foundation",
        "country",
        "wealthier",
        "another",
        "specie",
        "people",
        "accumulated",
        "capital",
        "agriculture",
        "manufacturing",
        "josiah",
        "tucker",
        "gave",
        "voice",
        "potential",
        "unlimited",
        "growth",
        "noting",
        "higher",
        "wage",
        "correlated",
        "skilled",
        "labor",
        "capital",
        "infrastructure",
        "hume",
        "smith",
        "advocated",
        "high",
        "wage",
        "feared",
        "time",
        "capital",
        "would",
        "shifted",
        "country",
        "lower",
        "wage",
        "region",
        "also",
        "enriched",
        "increasing",
        "demand",
        "worldwide",
        "however",
        "reason",
        "suppose",
        "nation",
        "healthy",
        "export",
        "sector",
        "would",
        "decline",
        "widely",
        "understood",
        "holland",
        "testament",
        "potential",
        "longlived",
        "wealth",
        "sustained",
        "significant",
        "foothold",
        "global",
        "trade",
        "since",
        "reached",
        "apogee",
        "powerful",
        "economic",
        "nation",
        "s",
        "smith",
        "recognized",
        "critical",
        "figure",
        "shift",
        "attention",
        "working",
        "class",
        "advocate",
        "higher",
        "wage",
        "noted",
        "merchant",
        "manufacturer",
        "strongly",
        "inclined",
        "collude",
        "raise",
        "wage",
        "smith",
        "noted",
        "degradation",
        "worker",
        "compelled",
        "spend",
        "entire",
        "life",
        "performing",
        "simple",
        "operation",
        "pointed",
        "word",
        "underscored",
        "dehumanizing",
        "effect",
        "unvaried",
        "work",
        "typical",
        "person",
        "generally",
        "becomes",
        "stupid",
        "ignorant",
        "possible",
        "human",
        "creature",
        "become",
        "smith",
        "believed",
        "would",
        "become",
        "widespread",
        "every",
        "improved",
        "civilised",
        "society",
        "state",
        "labouring",
        "poor",
        "great",
        "body",
        "people",
        "must",
        "necessarily",
        "fall",
        "unless",
        "government",
        "take",
        "pain",
        "prevent",
        "smith",
        "advocated",
        "widespread",
        "schooling",
        "mechanic",
        "gymnastics",
        "fostering",
        "theatre",
        "dancing",
        "day",
        "rest",
        "believed",
        "invention",
        "often",
        "came",
        "shopfloor",
        "orderly",
        "standing",
        "army",
        "would",
        "fostered",
        "men",
        "learned",
        "develop",
        "body",
        "mind",
        "smith",
        "exposed",
        "emptiness",
        "pursuit",
        "wealth",
        "consisted",
        "primarily",
        "parade",
        "rich",
        "feed",
        "upon",
        "envy",
        "without",
        "smith",
        "rich",
        "garner",
        "far",
        "pleasure",
        "observed",
        "riding",
        "carriage",
        "comfort",
        "carriage",
        "might",
        "offer",
        "effort",
        "pursue",
        "wealth",
        "power",
        "stem",
        "universal",
        "desire",
        "admiration",
        "approbation",
        "also",
        "deep",
        "asymmetry",
        "smith",
        "account",
        "human",
        "sympathy",
        "act",
        "fellowfeeling",
        "sympathize",
        "rich",
        "shun",
        "poor",
        "reason",
        "imagine",
        "place",
        "thus",
        "fill",
        "gap",
        "otherwise",
        "inadequate",
        "life",
        "reason",
        "smith",
        "belief",
        "state",
        "must",
        "insure",
        "royalty",
        "indulge",
        "opulent",
        "display",
        "rank",
        "great",
        "importance",
        "world",
        "motivating",
        "u",
        "strive",
        "driven",
        "desire",
        "bettering",
        "condition",
        "smith",
        "smith",
        "believed",
        "restless",
        "lot",
        "scarce",
        "perhaps",
        "single",
        "instant",
        "man",
        "perfectly",
        "completely",
        "satisfied",
        "situation",
        "without",
        "wish",
        "alteration",
        "improvement",
        "kind",
        "augmentation",
        "fortune",
        "mean",
        "greater",
        "part",
        "men",
        "propose",
        "wish",
        "better",
        "condition",
        "result",
        "nothing",
        "worse",
        "fall",
        "grace",
        "ensuing",
        "loss",
        "admiration",
        "smith",
        "observes",
        "bankruptcy",
        "perhaps",
        "greatest",
        "humiliating",
        "calamity",
        "befall",
        "innocent",
        "man",
        "fear",
        "thus",
        "fostered",
        "widespread",
        "prudence",
        "modern",
        "commercial",
        "world",
        "smith",
        "smith",
        "portrayal",
        "human",
        "nature",
        "tinged",
        "dark",
        "thought",
        "similar",
        "cynicism",
        "mandeville",
        "spend",
        "entire",
        "life",
        "attempting",
        "garner",
        "approval",
        "grounded",
        "sympathetic",
        "regard",
        "part",
        "prone",
        "vanity",
        "greed",
        "parable",
        "poor",
        "man",
        "son",
        "driven",
        "ambition",
        "become",
        "wealthy",
        "realize",
        "end",
        "life",
        "indignity",
        "suffered",
        "serve",
        "hate",
        "obsequious",
        "despises",
        "robbed",
        "real",
        "tranquillity",
        "might",
        "achieved",
        "known",
        "place",
        "remained",
        "poor",
        "smith",
        "end",
        "life",
        "grasp",
        "wealth",
        "greatness",
        "mere",
        "trinket",
        "loss",
        "friendship",
        "injustice",
        "enemy",
        "suffered",
        "climbed",
        "upwards",
        "left",
        "bereft",
        "peace",
        "mind",
        "ibid",
        "smith",
        "remark",
        "beggar",
        "highway",
        "sleep",
        "better",
        "king",
        "better",
        "aim",
        "life",
        "achieve",
        "inner",
        "equanimity",
        "adam",
        "smith",
        "philosopher",
        "readily",
        "associated",
        "voice",
        "capitalism",
        "could",
        "disparaging",
        "tendency",
        "reinforce",
        "baser",
        "feature",
        "human",
        "nature",
        "endorsed",
        "rising",
        "standard",
        "living",
        "lower",
        "order",
        "stoicism",
        "dominant",
        "sentiment",
        "life",
        "lottery",
        "one",
        "best",
        "prepare",
        "adversity",
        "smith",
        "aptly",
        "put",
        "wealth",
        "might",
        "keep",
        "summer",
        "shower",
        "winter",
        "storm",
        "smith",
        "early",
        "modern",
        "economics",
        "thus",
        "offered",
        "practical",
        "wisdom",
        "served",
        "major",
        "resource",
        "forging",
        "wise",
        "virtuous",
        "life"
    ]
}