{
    "main_text": "Analytic Philosophy of Education and Its Influence\n2. Analytic Philosophy of Education and Its Influence\n\nConceptual analysis, careful assessment of arguments, the rooting out\nof ambiguity, the drawing of clarifying distinctions—all of\nwhich are at least part of the philosophical toolkit—have been\nrespected activities within philosophy from the dawn of the field. No\ndoubt it somewhat over-simplifies the complex path of intellectual\nhistory to suggest that what happened in the twentieth\ncentury—early on, in the home discipline itself, and with a lag\nof a decade or more in philosophy of education—is that\nphilosophical analysis came to be viewed by some scholars as being the\nmajor philosophical activity (or set of activities), or even as being\nthe only viable or reputable activity. In any case, as they\ngained prominence and for a time hegemonic influence during the rise\nof analytic philosophy early in the twentieth century analytic\ntechniques came to dominate philosophy of education in the middle\nthird of that century (Curren, Robertson, & Hager 2003).\n\nThe pioneering work in the modern period entirely in an analytic mode\nwas the short monograph by C.D. Hardie, Truth and Fallacy in\nEducational Theory (1941; reissued in 1962). In his Introduction,\nHardie (who had studied with C.D. Broad and I.A. Richards) made it\nclear that he was putting all his eggs into the\nordinary-language-analysis basket:\n\n\nThe Cambridge analytical school, led by Moore, Broad and Wittgenstein,\nhas attempted so to analyse propositions that it will always be\napparent whether the disagreement between philosophers is one\nconcerning matters of fact, or is one concerning the use of words, or\nis, as is frequently the case, a purely emotive one. It is time, I\nthink, that a similar attitude became common in the field of\neducational theory. (Hardie 1962: xix)\n\n\nAbout a decade after the end of the Second World War the floodgates\nopened and a stream of work in the analytic mode appeared; the\nfollowing is merely a sample. D. J. O’Connor published An\nIntroduction to Philosophy of Education (1957) in which, among\nother things, he argued that the word “theory” as it is\nused in educational contexts is merely a courtesy title, for\neducational theories are nothing like what bear this title in the\nnatural sciences. Israel Scheffler, who became the paramount\nphilosopher of education in North America, produced a number of\nimportant works including The Language of Education (1960),\nwhich contained clarifying and influential analyses of definitions (he\ndistinguished reportive, stipulative, and programmatic types) and the\nlogic of slogans (often these are literally meaningless, and, he\nargued, should be seen as truncated arguments), Conditions of\nKnowledge (1965), still the best introduction to the\nepistemological side of philosophy of education, and Reason and\nTeaching (1973 [1989]), which in a wide-ranging and influential\nseries of essays makes the case for regarding the fostering of\nrationality/critical thinking as a fundamental educational ideal (cf.\nSiegel 2016). B. O. Smith and R. H. Ennis edited the volume\nLanguage and Concepts in Education (1961); and R.D.\nArchambault edited Philosophical Analysis and Education\n(1965), consisting of essays by a number of prominent British writers,\nmost notably R. S. Peters (whose status in Britain paralleled that of\nScheffler in the United States), Paul Hirst, and John Wilson. Topics\ncovered in the Archambault volume were typical of those that became\nthe “bread and butter” of analytic philosophy of education\n(APE) throughout the English-speaking world—education as a\nprocess of initiation, liberal education, the nature of knowledge,\ntypes of teaching, and instruction versus indoctrination.\n\nAmong the most influential products of APE was the analysis developed\nby Hirst and Peters (1970) and Peters (1973) of the concept of\neducation itself. Using as a touchstone “normal English\nusage,” it was concluded that a person who has been educated\n(rather than instructed or indoctrinated) has been (i) changed for the\nbetter; (ii) this change has involved the acquisition of knowledge and\nintellectual skills and the development of understanding; and (iii)\nthe person has come to care for, or be committed to, the domains of\nknowledge and skill into which he or she has been initiated. The\nmethod used by Hirst and Peters comes across clearly in their handling\nof the analogy with the concept of “reform”, one they\nsometimes drew upon for expository purposes. A criminal who has been\nreformed has changed for the better, and has developed a commitment to\nthe new mode of life (if one or other of these conditions does not\nhold, a speaker of standard English would not say the criminal has\nbeen reformed). Clearly the analogy with reform breaks down with\nrespect to the knowledge and understanding conditions. Elsewhere\nPeters developed the fruitful notion of “education as\ninitiation”.\n\nThe concept of indoctrination was also of great interest to analytic\nphilosophers of education, for, it was argued, getting clear about\nprecisely what constitutes indoctrination also would serve to clarify\nthe border that demarcates it from acceptable educational processes.\nThus, whether or not an instructional episode was a case of\nindoctrination was determined by the content taught, the intention of\nthe instructor, the methods of instruction used, the outcomes of the\ninstruction, or by some combination of these. Adherents of the\ndifferent analyses used the same general type of argument to make\ntheir case, namely, appeal to normal and aberrant usage.\nUnfortunately, ordinary language analysis did not lead to unanimity of\nopinion about where this border was located, and rival analyses of the\nconcept were put forward (Snook 1972). The danger of restricting\nanalysis to ordinary language (“normal English usage”) was\nrecognized early on by Scheffler, whose preferred view of analysis\nemphasized\n\n\nfirst, its greater sophistication as regards language, and the\ninterpenetration of language and inquiry, second, its attempt to\nfollow the modern example of the sciences in empirical spirit, in\nrigor, in attention to detail, in respect for alternatives, and in\nobjectivity of method, and third, its use of techniques of symbolic\nlogic brought to full development only in the last fifty years…\nIt is…this union of scientific spirit and logical method\napplied toward the clarification of basic ideas that characterizes\ncurrent analytic philosophy [and that ought to characterize analytic\nphilosophy of education]. (Scheffler 1973 [1989: 9–10])\n\n\nAfter a period of dominance, for a number of important reasons the\ninfluence of APE went into decline. First, there were growing\ncriticisms that the work of analytic philosophers of education had\nbecome focused upon minutiae and in the main was bereft of practical\nimport. (It is worth noting that a 1966 article in Time,\nreprinted in Lucas 1969, had put forward the same criticism of\nmainstream philosophy.) Second, in the early 1970’s radical\nstudents in Britain accused Peters’ brand of linguistic analysis\nof conservatism, and of tacitly giving support to “traditional\nvalues”—they raised the issue of whose English usage was\nbeing analyzed?\n\nThird, criticisms of language analysis in mainstream philosophy had\nbeen mounting for some time, and finally after a lag of many years\nwere reaching the attention of philosophers of education; there even\nhad been a surprising degree of interest on the part of the general\nreading public in the United Kingdom as early as 1959, when Gilbert\nRyle, editor of the journal Mind, refused to commission a\nreview of Ernest Gellner’s Words and Things\n(1959)—a detailed and quite acerbic critique of\nWittgenstein’s philosophy and its espousal of ordinary language\nanalysis. (Ryle argued that Gellner’s book was too insulting, a\nview that drew Bertrand Russell into the fray on Gellner’s\nside—in the daily press, no less; Russell produced a list of\ninsulting remarks drawn from the work of great philosophers of the\npast. See Mehta 1963.)\n\nRichard Peters had been given warning that all was not well with APE\nat a conference in Canada in 1966; after delivering a paper on\n“The aims of education: A conceptual inquiry” that was\nbased on ordinary language analysis, a philosopher in the audience\n(William Dray) asked Peters “whose concepts do we\nanalyze?” Dray went on to suggest that different people, and\ndifferent groups within society, have different concepts of education.\nFive years before the radical students raised the same issue, Dray\npointed to the possibility that what Peters had presented under the\nguise of a “logical analysis” was nothing but the favored\nusage of a certain class of persons—a class that Peters happened\nto identify with (see Peters 1973, where to the editor’s credit\nthe interaction with Dray is reprinted). \n\nFourth, during the decade of the seventies when these various\ncritiques of analytic philosophy were in the process of eroding its\nluster, a spate of translations from the Continent stimulated some\nphilosophers of education in Britain and North America to set out in\nnew directions, and to adopt a new style of writing and argumentation.\nKey works by Gadamer, Foucault and Derrida appeared in English, and\nthese were followed in 1984 by Lyotard’s The Postmodern\nCondition. The classic works of Heidegger and Husserl also found new admirers; and\nfeminist philosophers of education were finding their\nvoices—Maxine Greene published a number of pieces in the 1970s\nand 1980s, including The Dialectic of Freedom (1988); the\ninfluential book by Nel Noddings, Caring: A Feminine Approach to\nEthics and Moral Education, appeared the same year as the work by\nLyotard, followed a year later by Jane Roland Martin’s\nReclaiming a Conversation. In more recent years all these\ntrends have continued. APE was and is no longer the center of\ninterest, although, as indicated below, it still retains its\nvoice.\n",
    "section_title": "2. Analytic Philosophy of Education and Its Influence",
    "entry_title": "Philosophy of Education",
    "hierarchy_title": "Philosophy of Education || Analytic Philosophy of Education and Its Influence",
    "tokenized_text": [
        "analytic",
        "philosophy",
        "education",
        "influence",
        "analytic",
        "philosophy",
        "education",
        "influence",
        "conceptual",
        "analysis",
        "careful",
        "assessment",
        "argument",
        "rooting",
        "ambiguity",
        "drawing",
        "clarifying",
        "distinctionsall",
        "least",
        "part",
        "philosophical",
        "toolkithave",
        "respected",
        "activity",
        "within",
        "philosophy",
        "dawn",
        "field",
        "doubt",
        "somewhat",
        "oversimplifies",
        "complex",
        "path",
        "intellectual",
        "history",
        "suggest",
        "happened",
        "twentieth",
        "centuryearly",
        "home",
        "discipline",
        "lag",
        "decade",
        "philosophy",
        "educationis",
        "philosophical",
        "analysis",
        "came",
        "viewed",
        "scholar",
        "major",
        "philosophical",
        "activity",
        "set",
        "activity",
        "even",
        "viable",
        "reputable",
        "activity",
        "case",
        "gained",
        "prominence",
        "time",
        "hegemonic",
        "influence",
        "rise",
        "analytic",
        "philosophy",
        "early",
        "twentieth",
        "century",
        "analytic",
        "technique",
        "came",
        "dominate",
        "philosophy",
        "education",
        "middle",
        "third",
        "century",
        "curren",
        "robertson",
        "hager",
        "pioneering",
        "work",
        "modern",
        "period",
        "entirely",
        "analytic",
        "mode",
        "short",
        "monograph",
        "cd",
        "hardie",
        "truth",
        "fallacy",
        "educational",
        "theory",
        "reissued",
        "introduction",
        "hardie",
        "studied",
        "cd",
        "broad",
        "ia",
        "richards",
        "made",
        "clear",
        "putting",
        "egg",
        "ordinarylanguageanalysis",
        "basket",
        "cambridge",
        "analytical",
        "school",
        "led",
        "moore",
        "broad",
        "wittgenstein",
        "attempted",
        "analyse",
        "proposition",
        "always",
        "apparent",
        "whether",
        "disagreement",
        "philosopher",
        "one",
        "concerning",
        "matter",
        "fact",
        "one",
        "concerning",
        "use",
        "word",
        "frequently",
        "case",
        "purely",
        "emotive",
        "one",
        "time",
        "think",
        "similar",
        "attitude",
        "became",
        "common",
        "field",
        "educational",
        "theory",
        "hardie",
        "xix",
        "decade",
        "end",
        "second",
        "world",
        "war",
        "floodgate",
        "opened",
        "stream",
        "work",
        "analytic",
        "mode",
        "appeared",
        "following",
        "merely",
        "sample",
        "d",
        "j",
        "connor",
        "published",
        "introduction",
        "philosophy",
        "education",
        "among",
        "thing",
        "argued",
        "word",
        "theory",
        "used",
        "educational",
        "context",
        "merely",
        "courtesy",
        "title",
        "educational",
        "theory",
        "nothing",
        "like",
        "bear",
        "title",
        "natural",
        "science",
        "israel",
        "scheffler",
        "became",
        "paramount",
        "philosopher",
        "education",
        "north",
        "america",
        "produced",
        "number",
        "important",
        "work",
        "including",
        "language",
        "education",
        "contained",
        "clarifying",
        "influential",
        "analysis",
        "definition",
        "distinguished",
        "reportive",
        "stipulative",
        "programmatic",
        "type",
        "logic",
        "slogan",
        "often",
        "literally",
        "meaningless",
        "argued",
        "seen",
        "truncated",
        "argument",
        "condition",
        "knowledge",
        "still",
        "best",
        "introduction",
        "epistemological",
        "side",
        "philosophy",
        "education",
        "reason",
        "teaching",
        "wideranging",
        "influential",
        "series",
        "essay",
        "make",
        "case",
        "regarding",
        "fostering",
        "rationalitycritical",
        "thinking",
        "fundamental",
        "educational",
        "ideal",
        "cf",
        "siegel",
        "b",
        "o",
        "smith",
        "r",
        "h",
        "ennis",
        "edited",
        "volume",
        "language",
        "concept",
        "education",
        "rd",
        "archambault",
        "edited",
        "philosophical",
        "analysis",
        "education",
        "consisting",
        "essay",
        "number",
        "prominent",
        "british",
        "writer",
        "notably",
        "r",
        "s",
        "peter",
        "whose",
        "status",
        "britain",
        "paralleled",
        "scheffler",
        "united",
        "state",
        "paul",
        "hirst",
        "john",
        "wilson",
        "topic",
        "covered",
        "archambault",
        "volume",
        "typical",
        "became",
        "bread",
        "butter",
        "analytic",
        "philosophy",
        "education",
        "ape",
        "throughout",
        "englishspeaking",
        "worldeducation",
        "process",
        "initiation",
        "liberal",
        "education",
        "nature",
        "knowledge",
        "type",
        "teaching",
        "instruction",
        "versus",
        "indoctrination",
        "among",
        "influential",
        "product",
        "ape",
        "analysis",
        "developed",
        "hirst",
        "peter",
        "peter",
        "concept",
        "education",
        "using",
        "touchstone",
        "normal",
        "english",
        "usage",
        "concluded",
        "person",
        "educated",
        "rather",
        "instructed",
        "indoctrinated",
        "changed",
        "better",
        "ii",
        "change",
        "involved",
        "acquisition",
        "knowledge",
        "intellectual",
        "skill",
        "development",
        "understanding",
        "iii",
        "person",
        "come",
        "care",
        "committed",
        "domain",
        "knowledge",
        "skill",
        "initiated",
        "method",
        "used",
        "hirst",
        "peter",
        "come",
        "across",
        "clearly",
        "handling",
        "analogy",
        "concept",
        "reform",
        "one",
        "sometimes",
        "drew",
        "upon",
        "expository",
        "purpose",
        "criminal",
        "reformed",
        "changed",
        "better",
        "developed",
        "commitment",
        "new",
        "mode",
        "life",
        "one",
        "condition",
        "hold",
        "speaker",
        "standard",
        "english",
        "would",
        "say",
        "criminal",
        "reformed",
        "clearly",
        "analogy",
        "reform",
        "break",
        "respect",
        "knowledge",
        "understanding",
        "condition",
        "elsewhere",
        "peter",
        "developed",
        "fruitful",
        "notion",
        "education",
        "initiation",
        "concept",
        "indoctrination",
        "also",
        "great",
        "interest",
        "analytic",
        "philosopher",
        "education",
        "argued",
        "getting",
        "clear",
        "precisely",
        "constitutes",
        "indoctrination",
        "also",
        "would",
        "serve",
        "clarify",
        "border",
        "demarcates",
        "acceptable",
        "educational",
        "process",
        "thus",
        "whether",
        "instructional",
        "episode",
        "case",
        "indoctrination",
        "determined",
        "content",
        "taught",
        "intention",
        "instructor",
        "method",
        "instruction",
        "used",
        "outcome",
        "instruction",
        "combination",
        "adherent",
        "different",
        "analysis",
        "used",
        "general",
        "type",
        "argument",
        "make",
        "case",
        "namely",
        "appeal",
        "normal",
        "aberrant",
        "usage",
        "unfortunately",
        "ordinary",
        "language",
        "analysis",
        "lead",
        "unanimity",
        "opinion",
        "border",
        "located",
        "rival",
        "analysis",
        "concept",
        "put",
        "forward",
        "snook",
        "danger",
        "restricting",
        "analysis",
        "ordinary",
        "language",
        "normal",
        "english",
        "usage",
        "recognized",
        "early",
        "scheffler",
        "whose",
        "preferred",
        "view",
        "analysis",
        "emphasized",
        "first",
        "greater",
        "sophistication",
        "regard",
        "language",
        "interpenetration",
        "language",
        "inquiry",
        "second",
        "attempt",
        "follow",
        "modern",
        "example",
        "science",
        "empirical",
        "spirit",
        "rigor",
        "attention",
        "detail",
        "respect",
        "alternative",
        "objectivity",
        "method",
        "third",
        "use",
        "technique",
        "symbolic",
        "logic",
        "brought",
        "full",
        "development",
        "last",
        "fifty",
        "years",
        "isthis",
        "union",
        "scientific",
        "spirit",
        "logical",
        "method",
        "applied",
        "toward",
        "clarification",
        "basic",
        "idea",
        "characterizes",
        "current",
        "analytic",
        "philosophy",
        "ought",
        "characterize",
        "analytic",
        "philosophy",
        "education",
        "scheffler",
        "period",
        "dominance",
        "number",
        "important",
        "reason",
        "influence",
        "ape",
        "went",
        "decline",
        "first",
        "growing",
        "criticism",
        "work",
        "analytic",
        "philosopher",
        "education",
        "become",
        "focused",
        "upon",
        "minutia",
        "main",
        "bereft",
        "practical",
        "import",
        "worth",
        "noting",
        "article",
        "time",
        "reprinted",
        "lucas",
        "put",
        "forward",
        "criticism",
        "mainstream",
        "philosophy",
        "second",
        "early",
        "radical",
        "student",
        "britain",
        "accused",
        "peter",
        "brand",
        "linguistic",
        "analysis",
        "conservatism",
        "tacitly",
        "giving",
        "support",
        "traditional",
        "value",
        "they",
        "raised",
        "issue",
        "whose",
        "english",
        "usage",
        "analyzed",
        "third",
        "criticism",
        "language",
        "analysis",
        "mainstream",
        "philosophy",
        "mounting",
        "time",
        "finally",
        "lag",
        "many",
        "year",
        "reaching",
        "attention",
        "philosopher",
        "education",
        "even",
        "surprising",
        "degree",
        "interest",
        "part",
        "general",
        "reading",
        "public",
        "united",
        "kingdom",
        "early",
        "gilbert",
        "ryle",
        "editor",
        "journal",
        "mind",
        "refused",
        "commission",
        "review",
        "ernest",
        "gellner",
        "word",
        "thing",
        "a",
        "detailed",
        "quite",
        "acerbic",
        "critique",
        "wittgenstein",
        "philosophy",
        "espousal",
        "ordinary",
        "language",
        "analysis",
        "ryle",
        "argued",
        "gellner",
        "book",
        "insulting",
        "view",
        "drew",
        "bertrand",
        "russell",
        "fray",
        "gellner",
        "sidein",
        "daily",
        "press",
        "le",
        "russell",
        "produced",
        "list",
        "insulting",
        "remark",
        "drawn",
        "work",
        "great",
        "philosopher",
        "past",
        "see",
        "mehta",
        "richard",
        "peter",
        "given",
        "warning",
        "well",
        "ape",
        "conference",
        "canada",
        "delivering",
        "paper",
        "aim",
        "education",
        "conceptual",
        "inquiry",
        "based",
        "ordinary",
        "language",
        "analysis",
        "philosopher",
        "audience",
        "william",
        "dray",
        "asked",
        "peter",
        "whose",
        "concept",
        "analyze",
        "dray",
        "went",
        "suggest",
        "different",
        "people",
        "different",
        "group",
        "within",
        "society",
        "different",
        "concept",
        "education",
        "five",
        "year",
        "radical",
        "student",
        "raised",
        "issue",
        "dray",
        "pointed",
        "possibility",
        "peter",
        "presented",
        "guise",
        "logical",
        "analysis",
        "nothing",
        "favored",
        "usage",
        "certain",
        "class",
        "personsa",
        "class",
        "peter",
        "happened",
        "identify",
        "see",
        "peter",
        "editor",
        "credit",
        "interaction",
        "dray",
        "reprinted",
        "fourth",
        "decade",
        "seventy",
        "various",
        "critique",
        "analytic",
        "philosophy",
        "process",
        "eroding",
        "luster",
        "spate",
        "translation",
        "continent",
        "stimulated",
        "philosopher",
        "education",
        "britain",
        "north",
        "america",
        "set",
        "new",
        "direction",
        "adopt",
        "new",
        "style",
        "writing",
        "argumentation",
        "key",
        "work",
        "gadamer",
        "foucault",
        "derrida",
        "appeared",
        "english",
        "followed",
        "lyotard",
        "postmodern",
        "condition",
        "classic",
        "work",
        "heidegger",
        "husserl",
        "also",
        "found",
        "new",
        "admirer",
        "feminist",
        "philosopher",
        "education",
        "finding",
        "voicesmaxine",
        "greene",
        "published",
        "number",
        "piece",
        "s",
        "s",
        "including",
        "dialectic",
        "freedom",
        "influential",
        "book",
        "nel",
        "noddings",
        "caring",
        "feminine",
        "approach",
        "ethic",
        "moral",
        "education",
        "appeared",
        "year",
        "work",
        "lyotard",
        "followed",
        "year",
        "later",
        "jane",
        "roland",
        "martin",
        "reclaiming",
        "conversation",
        "recent",
        "year",
        "trend",
        "continued",
        "ape",
        "longer",
        "center",
        "interest",
        "although",
        "indicated",
        "still",
        "retains",
        "voice"
    ]
}