{
    "main_text": "Areas of Contemporary Activity || Social, Political and Moral Philosophy\n3.2 Social, Political and Moral Philosophy\n\nThe publication of John Rawls’s A Theory of Justice in\n1971 was the most notable event in the history of political philosophy\nover the last century. The book spurred a period of ferment in\npolitical philosophy that included, among other things, new research\non educationally fundamental themes. The principles of justice in\neducational distribution have perhaps been the dominant theme in this\nliterature, and Rawls’s influence on its development has been\npervasive.\n\nRawls’s theory of justice made so-called “fair equality of\nopportunity” one of its constitutive principles. Fair equality\nof opportunity entailed that the distribution of education would not\nput the children of those who currently occupied coveted social\npositions at any competitive advantage over other, equally talented\nand motivated children seeking the qualifications for those positions\n(Rawls 1971: 72–75). Its purpose was to prevent socio-economic\ndifferences from hardening into social castes that were perpetuated\nacross generations. One obvious criticism of fair equality of\nopportunity is that it does not prohibit an educational distribution\nthat lavished resources on the most talented children while offering\nminimal opportunities to others. So long as untalented students from\nwealthy families were assigned opportunities no better than those\navailable to their untalented peers among the poor, no breach of the\nprinciple would occur. Even the most moderate egalitarians might find\nsuch a distributive regime to be intuitively repugnant.\n\nRepugnance might be mitigated somewhat by the ways in which the\noverall structure of Rawls’s conception of justice protects the\ninterests of those who fare badly in educational competition. All\ncitizens must enjoy the same basic liberties, and equal liberty always\nhas moral priority over equal opportunity: the former can never be\ncompromised to advance the latter. Further, inequality in the\ndistribution of income and wealth are permitted only to the degree\nthat it serves the interests of the least advantaged group in society.\nBut even with these qualifications, fair equality of opportunity is\narguably less than really fair to anyone. The fact that their\neducation should secure ends other than access to the most selective\nsocial positions—ends such as artistic appreciation, the kind of\nself-knowledge that humanistic study can furnish, or civic\nvirtue—is deemed irrelevant according to Rawls’s\nprinciple. But surely it is relevant, given that a principle of\neducational justice must be responsive to the full range of\neducationally important goods.\n\nSuppose we revise our account of the goods included in educational\ndistribution so that aesthetic appreciation, say, and the necessary\nunderstanding and virtue for conscientious citizenship count for just\nas much as job-related skills. An interesting implication of doing so\nis that the rationale for requiring equality under any just\ndistribution becomes decreasingly clear. That is because job-related\nskills are positional whereas the other educational goods are not\n(Hollis 1982). If you and I both aspire to a career in business\nmanagement for which we are equally qualified, any increase in your\njob-related skills is a corresponding disadvantage to me unless I can\ncatch up. Positional goods have a competitive structure by definition,\nthough the ends of civic or aesthetic education do not fit that\nstructure. If you and I aspire to be good citizens and are equal in\ncivic understanding and virtue, an advance in your civic education is\nno disadvantage to me. On the contrary, it is easier to be a good\ncitizen the better other citizens learn to be. At the very least, so\nfar as non-positional goods figure in our conception of what counts as\na good education, the moral stakes of inequality are thereby\nlowered.\n\nIn fact, an emerging alternative to fair equality of opportunity is a\nprinciple that stipulates some benchmark of adequacy in achievement or\nopportunity as the relevant standard of distribution. But it is\nmisleading to represent this as a contrast between egalitarian and\nsufficientarian conceptions. Philosophically serious interpretations\nof adequacy derive from the ideal of equal citizenship (Satz 2007;\nAnderson 2007). Then again, fair equality of opportunity in\nRawls’s theory is derived from a more fundamental ideal of\nequality among citizens. This was arguably true in A Theory of\nJustice but it is certainly true in his later work (Dworkin 1977:\n150–183; Rawls 1993). So, both Rawls’s principle and the\nemerging alternative share an egalitarian foundation. The debate\nbetween adherents of equal opportunity and those misnamed as\nsufficientarians is certainly not over (e.g., Brighouse & Swift\n2009; Jacobs 2010; Warnick 2015). Further progress will likely hinge\non explicating the most compelling conception of the egalitarian\nfoundation from which distributive principles are to be inferred.\nAnother Rawls-inspired alternative is that a\n“prioritarian” distribution of achievement or opportunity\nmight turn out to be the best principle we can come up\nwith—i.e., one that favors the interests of the least advantaged\nstudents (Schouten 2012). \n\nThe publication of Rawls’s Political Liberalism in 1993\nsignaled a decisive turning point in his thinking about justice. In\nhis earlier book, the theory of justice had been presented as if it\nwere universally valid. But Rawls had come to think that any theory of\njustice presented as such was open to reasonable rejection. A more\ncircumspect approach to justification would seek grounds for justice\nas fairness in an overlapping consensus between the many reasonable\nvalues and doctrines that thrive in a democratic political culture.\nRawls argued that such a culture is informed by a shared ideal of free\nand equal citizenship that provided a new, distinctively democratic\nframework for justifying a conception of justice. The shift to\npolitical liberalism involved little revision on Rawls’s part to\nthe content of the principles he favored. But the salience it gave to\nquestions about citizenship in the fabric of liberal political theory\nhad important educational implications. How was the ideal of free and\nequal citizenship to be instantiated in education in a way that\naccommodated the range of reasonable values and doctrines encompassed\nin an overlapping consensus? Political Liberalism has\ninspired a range of answers to that question (cf. Callan 1997; Clayton\n2006; Bull 2008).\n\nOther philosophers besides Rawls in the 1990s took up a cluster of\nquestions about civic education, and not always from a liberal\nperspective. Alasdair Macintyre’s After Virtue (1984)\nstrongly influenced the development of communitarian political theory\nwhich, as its very name might suggest, argued that the cultivation of\ncommunity could preempt many of the problems with conflicting\nindividual rights at the core of liberalism. As a full-standing\nalternative to liberalism, communitarianism might have little to\nrecommend it. But it was a spur for liberal philosophers to think\nabout how communities could be built and sustained to support the more\nfamiliar projects of liberal politics (e.g., Strike 2010).\nFurthermore, its arguments often converged with those advanced by\nfeminist exponents of the ethic of care (Noddings 1984; Gilligan\n1982). Noddings’ work is particularly notable because she\ninferred a cogent and radical agenda for the reform of schools from\nher conception of care (Noddings 1992). \n\nOne persistent controversy in citizenship theory has been about\nwhether patriotism is correctly deemed a virtue, given our obligations\nto those who are not our fellow citizens in an increasingly\ninterdependent world and the sordid history of xenophobia with which\nmodern nation states are associated. The controversy is partly about\nwhat we should teach in our schools and is commonly discussed by\nphilosophers in that context (Galston 1991; Ben-Porath 2006; Callan\n2006; Miller 2007; Curren & Dorn 2018). The controversy is related\nto a deeper and more pervasive question about how morally or\nintellectually taxing the best conception of our citizenship should\nbe. The more taxing it is, the more constraining its derivative\nconception of civic education will be. Contemporary political\nphilosophers offer divergent arguments about these matters. For\nexample, Gutmann and Thompson claim that citizens of diverse\ndemocracies need to “understand the diverse ways of life of\ntheir fellow citizens” (Gutmann & Thompson 1996: 66). The\nneed arises from the obligation of reciprocity which they (like Rawls)\nbelieve to be integral to citizenship. Because I must seek to\ncooperate with others politically on terms that make sense from\ntheir moral perspective as well as my own, I must be ready to\nenter that perspective imaginatively so as to grasp its distinctive\ncontent. Many such perspectives prosper in liberal democracies, and so\nthe task of reciprocal understanding is necessarily onerous. Still,\nour actions qua deliberative citizen must be grounded in such\nreciprocity if political cooperation on terms acceptable to us as\n(diversely) morally motivated citizens is to be possible at all. This\nis tantamount to an imperative to think autonomously inside the role\nof citizen because I cannot close-mindedly resist critical\nconsideration of moral views alien to my own without flouting my\nresponsibilities as a deliberative citizen.\n\nCivic education does not exhaust the domain of moral education, even\nthough the more robust conceptions of equal citizenship have\nfar-reaching implications for just relations in civil society and the\nfamily. The study of moral education has traditionally taken its\nbearings from normative ethics rather than political philosophy, and\nthis is largely true of work undertaken in recent decades. The major\ndevelopment here has been the revival of virtue ethics as an\nalternative to the deontological and consequentialist theories that\ndominated discussion for much of the twentieth century.\n\nThe defining idea of virtue ethics is that our criterion of moral\nright and wrong must derive from a conception of how the ideally\nvirtuous agent would distinguish between the two. Virtue ethics is\nthus an alternative to both consequentialism and deontology which\nlocate the relevant criterion in producing good consequences or\nmeeting the requirements of moral duty respectively. The debate about\nthe comparative merits of these theories is not resolved, but from an\neducational perspective that may be less important than it has\nsometimes seemed to antagonists in the debate. To be sure,\nadjudicating between rival theories in normative ethics might shed\nlight on how best to construe the process of moral education, and\nphilosophical reflection on the process might help us to adjudicate\nbetween the theories. There has been extensive work on habituation and\nvirtue, largely inspired by Aristotle (Burnyeat 1980; Peters 1981).\nBut whether this does anything to establish the superiority of virtue\nethics over its competitors is far from obvious. Other aspects of\nmoral education—in particular, the paired processes of\nrole-modelling and identification—deserve much more scrutiny\nthan they have received (Audi 2017; Kristjánsson 2015, 2017).\n",
    "section_title": "3.2 Social, Political and Moral Philosophy",
    "entry_title": "Philosophy of Education",
    "hierarchy_title": "Philosophy of Education || Areas of Contemporary Activity || Social, Political and Moral Philosophy",
    "tokenized_text": [
        "area",
        "contemporary",
        "activity",
        "social",
        "political",
        "moral",
        "philosophy",
        "social",
        "political",
        "moral",
        "philosophy",
        "publication",
        "john",
        "rawls",
        "theory",
        "justice",
        "notable",
        "event",
        "history",
        "political",
        "philosophy",
        "last",
        "century",
        "book",
        "spurred",
        "period",
        "ferment",
        "political",
        "philosophy",
        "included",
        "among",
        "thing",
        "new",
        "research",
        "educationally",
        "fundamental",
        "theme",
        "principle",
        "justice",
        "educational",
        "distribution",
        "perhaps",
        "dominant",
        "theme",
        "literature",
        "rawls",
        "influence",
        "development",
        "pervasive",
        "rawls",
        "theory",
        "justice",
        "made",
        "socalled",
        "fair",
        "equality",
        "opportunity",
        "one",
        "constitutive",
        "principle",
        "fair",
        "equality",
        "opportunity",
        "entailed",
        "distribution",
        "education",
        "would",
        "put",
        "child",
        "currently",
        "occupied",
        "coveted",
        "social",
        "position",
        "competitive",
        "advantage",
        "equally",
        "talented",
        "motivated",
        "child",
        "seeking",
        "qualification",
        "position",
        "rawls",
        "purpose",
        "prevent",
        "socioeconomic",
        "difference",
        "hardening",
        "social",
        "caste",
        "perpetuated",
        "across",
        "generation",
        "one",
        "obvious",
        "criticism",
        "fair",
        "equality",
        "opportunity",
        "prohibit",
        "educational",
        "distribution",
        "lavished",
        "resource",
        "talented",
        "child",
        "offering",
        "minimal",
        "opportunity",
        "others",
        "long",
        "untalented",
        "student",
        "wealthy",
        "family",
        "assigned",
        "opportunity",
        "better",
        "available",
        "untalented",
        "peer",
        "among",
        "poor",
        "breach",
        "principle",
        "would",
        "occur",
        "even",
        "moderate",
        "egalitarian",
        "might",
        "find",
        "distributive",
        "regime",
        "intuitively",
        "repugnant",
        "repugnance",
        "might",
        "mitigated",
        "somewhat",
        "way",
        "overall",
        "structure",
        "rawls",
        "conception",
        "justice",
        "protects",
        "interest",
        "fare",
        "badly",
        "educational",
        "competition",
        "citizen",
        "must",
        "enjoy",
        "basic",
        "liberty",
        "equal",
        "liberty",
        "always",
        "moral",
        "priority",
        "equal",
        "opportunity",
        "former",
        "never",
        "compromised",
        "advance",
        "latter",
        "inequality",
        "distribution",
        "income",
        "wealth",
        "permitted",
        "degree",
        "serf",
        "interest",
        "least",
        "advantaged",
        "group",
        "society",
        "even",
        "qualification",
        "fair",
        "equality",
        "opportunity",
        "arguably",
        "le",
        "really",
        "fair",
        "anyone",
        "fact",
        "education",
        "secure",
        "end",
        "access",
        "selective",
        "social",
        "positionsends",
        "artistic",
        "appreciation",
        "kind",
        "selfknowledge",
        "humanistic",
        "study",
        "furnish",
        "civic",
        "virtueis",
        "deemed",
        "irrelevant",
        "according",
        "rawls",
        "principle",
        "surely",
        "relevant",
        "given",
        "principle",
        "educational",
        "justice",
        "must",
        "responsive",
        "full",
        "range",
        "educationally",
        "important",
        "good",
        "suppose",
        "revise",
        "account",
        "good",
        "included",
        "educational",
        "distribution",
        "aesthetic",
        "appreciation",
        "say",
        "necessary",
        "understanding",
        "virtue",
        "conscientious",
        "citizenship",
        "count",
        "much",
        "jobrelated",
        "skill",
        "interesting",
        "implication",
        "rationale",
        "requiring",
        "equality",
        "distribution",
        "becomes",
        "decreasingly",
        "clear",
        "jobrelated",
        "skill",
        "positional",
        "whereas",
        "educational",
        "good",
        "hollis",
        "aspire",
        "career",
        "business",
        "management",
        "equally",
        "qualified",
        "increase",
        "jobrelated",
        "skill",
        "corresponding",
        "disadvantage",
        "unless",
        "catch",
        "positional",
        "good",
        "competitive",
        "structure",
        "definition",
        "though",
        "end",
        "civic",
        "aesthetic",
        "education",
        "fit",
        "structure",
        "aspire",
        "good",
        "citizen",
        "equal",
        "civic",
        "understanding",
        "virtue",
        "advance",
        "civic",
        "education",
        "disadvantage",
        "contrary",
        "easier",
        "good",
        "citizen",
        "better",
        "citizen",
        "learn",
        "least",
        "far",
        "nonpositional",
        "good",
        "figure",
        "conception",
        "count",
        "good",
        "education",
        "moral",
        "stake",
        "inequality",
        "thereby",
        "lowered",
        "fact",
        "emerging",
        "alternative",
        "fair",
        "equality",
        "opportunity",
        "principle",
        "stipulates",
        "benchmark",
        "adequacy",
        "achievement",
        "opportunity",
        "relevant",
        "standard",
        "distribution",
        "misleading",
        "represent",
        "contrast",
        "egalitarian",
        "sufficientarian",
        "conception",
        "philosophically",
        "serious",
        "interpretation",
        "adequacy",
        "derive",
        "ideal",
        "equal",
        "citizenship",
        "satz",
        "anderson",
        "fair",
        "equality",
        "opportunity",
        "rawls",
        "theory",
        "derived",
        "fundamental",
        "ideal",
        "equality",
        "among",
        "citizen",
        "arguably",
        "true",
        "theory",
        "justice",
        "certainly",
        "true",
        "later",
        "work",
        "dworkin",
        "rawls",
        "rawls",
        "principle",
        "emerging",
        "alternative",
        "share",
        "egalitarian",
        "foundation",
        "debate",
        "adherent",
        "equal",
        "opportunity",
        "misnamed",
        "sufficientarians",
        "certainly",
        "eg",
        "brighouse",
        "swift",
        "jacob",
        "warnick",
        "progress",
        "likely",
        "hinge",
        "explicating",
        "compelling",
        "conception",
        "egalitarian",
        "foundation",
        "distributive",
        "principle",
        "inferred",
        "another",
        "rawlsinspired",
        "alternative",
        "prioritarian",
        "distribution",
        "achievement",
        "opportunity",
        "might",
        "turn",
        "best",
        "principle",
        "come",
        "withie",
        "one",
        "favor",
        "interest",
        "least",
        "advantaged",
        "student",
        "schouten",
        "publication",
        "rawls",
        "political",
        "liberalism",
        "signaled",
        "decisive",
        "turning",
        "point",
        "thinking",
        "justice",
        "earlier",
        "book",
        "theory",
        "justice",
        "presented",
        "universally",
        "valid",
        "rawls",
        "come",
        "think",
        "theory",
        "justice",
        "presented",
        "open",
        "reasonable",
        "rejection",
        "circumspect",
        "approach",
        "justification",
        "would",
        "seek",
        "ground",
        "justice",
        "fairness",
        "overlapping",
        "consensus",
        "many",
        "reasonable",
        "value",
        "doctrine",
        "thrive",
        "democratic",
        "political",
        "culture",
        "rawls",
        "argued",
        "culture",
        "informed",
        "shared",
        "ideal",
        "free",
        "equal",
        "citizenship",
        "provided",
        "new",
        "distinctively",
        "democratic",
        "framework",
        "justifying",
        "conception",
        "justice",
        "shift",
        "political",
        "liberalism",
        "involved",
        "little",
        "revision",
        "rawls",
        "part",
        "content",
        "principle",
        "favored",
        "salience",
        "gave",
        "question",
        "citizenship",
        "fabric",
        "liberal",
        "political",
        "theory",
        "important",
        "educational",
        "implication",
        "ideal",
        "free",
        "equal",
        "citizenship",
        "instantiated",
        "education",
        "way",
        "accommodated",
        "range",
        "reasonable",
        "value",
        "doctrine",
        "encompassed",
        "overlapping",
        "consensus",
        "political",
        "liberalism",
        "inspired",
        "range",
        "answer",
        "question",
        "cf",
        "callan",
        "clayton",
        "bull",
        "philosopher",
        "besides",
        "rawls",
        "s",
        "took",
        "cluster",
        "question",
        "civic",
        "education",
        "always",
        "liberal",
        "perspective",
        "alasdair",
        "macintyre",
        "virtue",
        "strongly",
        "influenced",
        "development",
        "communitarian",
        "political",
        "theory",
        "name",
        "might",
        "suggest",
        "argued",
        "cultivation",
        "community",
        "could",
        "preempt",
        "many",
        "problem",
        "conflicting",
        "individual",
        "right",
        "core",
        "liberalism",
        "fullstanding",
        "alternative",
        "liberalism",
        "communitarianism",
        "might",
        "little",
        "recommend",
        "spur",
        "liberal",
        "philosopher",
        "think",
        "community",
        "could",
        "built",
        "sustained",
        "support",
        "familiar",
        "project",
        "liberal",
        "politics",
        "eg",
        "strike",
        "furthermore",
        "argument",
        "often",
        "converged",
        "advanced",
        "feminist",
        "exponent",
        "ethic",
        "care",
        "noddings",
        "gilligan",
        "noddings",
        "work",
        "particularly",
        "notable",
        "inferred",
        "cogent",
        "radical",
        "agenda",
        "reform",
        "school",
        "conception",
        "care",
        "noddings",
        "one",
        "persistent",
        "controversy",
        "citizenship",
        "theory",
        "whether",
        "patriotism",
        "correctly",
        "deemed",
        "virtue",
        "given",
        "obligation",
        "fellow",
        "citizen",
        "increasingly",
        "interdependent",
        "world",
        "sordid",
        "history",
        "xenophobia",
        "modern",
        "nation",
        "state",
        "associated",
        "controversy",
        "partly",
        "teach",
        "school",
        "commonly",
        "discussed",
        "philosopher",
        "context",
        "galston",
        "benporath",
        "callan",
        "miller",
        "curren",
        "dorn",
        "controversy",
        "related",
        "deeper",
        "pervasive",
        "question",
        "morally",
        "intellectually",
        "taxing",
        "best",
        "conception",
        "citizenship",
        "taxing",
        "constraining",
        "derivative",
        "conception",
        "civic",
        "education",
        "contemporary",
        "political",
        "philosopher",
        "offer",
        "divergent",
        "argument",
        "matter",
        "example",
        "gutmann",
        "thompson",
        "claim",
        "citizen",
        "diverse",
        "democracy",
        "need",
        "understand",
        "diverse",
        "way",
        "life",
        "fellow",
        "citizen",
        "gutmann",
        "thompson",
        "need",
        "arises",
        "obligation",
        "reciprocity",
        "like",
        "rawls",
        "believe",
        "integral",
        "citizenship",
        "must",
        "seek",
        "cooperate",
        "others",
        "politically",
        "term",
        "make",
        "sense",
        "moral",
        "perspective",
        "well",
        "must",
        "ready",
        "enter",
        "perspective",
        "imaginatively",
        "grasp",
        "distinctive",
        "content",
        "many",
        "perspective",
        "prosper",
        "liberal",
        "democracy",
        "task",
        "reciprocal",
        "understanding",
        "necessarily",
        "onerous",
        "still",
        "action",
        "qua",
        "deliberative",
        "citizen",
        "must",
        "grounded",
        "reciprocity",
        "political",
        "cooperation",
        "term",
        "acceptable",
        "u",
        "diversely",
        "morally",
        "motivated",
        "citizen",
        "possible",
        "tantamount",
        "imperative",
        "think",
        "autonomously",
        "inside",
        "role",
        "citizen",
        "closemindedly",
        "resist",
        "critical",
        "consideration",
        "moral",
        "view",
        "alien",
        "without",
        "flouting",
        "responsibility",
        "deliberative",
        "citizen",
        "civic",
        "education",
        "exhaust",
        "domain",
        "moral",
        "education",
        "even",
        "though",
        "robust",
        "conception",
        "equal",
        "citizenship",
        "farreaching",
        "implication",
        "relation",
        "civil",
        "society",
        "family",
        "study",
        "moral",
        "education",
        "traditionally",
        "taken",
        "bearing",
        "normative",
        "ethic",
        "rather",
        "political",
        "philosophy",
        "largely",
        "true",
        "work",
        "undertaken",
        "recent",
        "decade",
        "major",
        "development",
        "revival",
        "virtue",
        "ethic",
        "alternative",
        "deontological",
        "consequentialist",
        "theory",
        "dominated",
        "discussion",
        "much",
        "twentieth",
        "century",
        "defining",
        "idea",
        "virtue",
        "ethic",
        "criterion",
        "moral",
        "right",
        "wrong",
        "must",
        "derive",
        "conception",
        "ideally",
        "virtuous",
        "agent",
        "would",
        "distinguish",
        "two",
        "virtue",
        "ethic",
        "thus",
        "alternative",
        "consequentialism",
        "deontology",
        "locate",
        "relevant",
        "criterion",
        "producing",
        "good",
        "consequence",
        "meeting",
        "requirement",
        "moral",
        "duty",
        "respectively",
        "debate",
        "comparative",
        "merit",
        "theory",
        "resolved",
        "educational",
        "perspective",
        "may",
        "le",
        "important",
        "sometimes",
        "seemed",
        "antagonist",
        "debate",
        "sure",
        "adjudicating",
        "rival",
        "theory",
        "normative",
        "ethic",
        "might",
        "shed",
        "light",
        "best",
        "construe",
        "process",
        "moral",
        "education",
        "philosophical",
        "reflection",
        "process",
        "might",
        "help",
        "u",
        "adjudicate",
        "theory",
        "extensive",
        "work",
        "habituation",
        "virtue",
        "largely",
        "inspired",
        "aristotle",
        "burnyeat",
        "peter",
        "whether",
        "anything",
        "establish",
        "superiority",
        "virtue",
        "ethic",
        "competitor",
        "far",
        "obvious",
        "aspect",
        "moral",
        "educationin",
        "particular",
        "paired",
        "process",
        "rolemodelling",
        "identificationdeserve",
        "much",
        "scrutiny",
        "received",
        "audi",
        "kristjánsson"
    ]
}