{
    "main_text": "Introduction: Was Einstein an Epistemological “Opportunist”?\n1. Introduction: Was Einstein an Epistemological “Opportunist”?\n\nLate in 1944, Albert Einstein received a letter from Robert Thornton,\na young African-American philosopher of science who had just finished\nhis Ph.D. under Herbert Feigl at Minnesota and was beginning a new job\nteaching physics at the University of Puerto Rico, Mayaguez. He had\nwritten to solicit from Einstein a few supportive words on behalf of\nhis efforts to introduce “as much of the philosophy of science\nas possible” into the modern physics course that he was to teach\nthe following spring (Thornton to Einstein, 28 November 1944, EA\n61–573). Here is what Einstein offered in reply:\n\nI fully agree with you about the significance and educational value of\nmethodology as well as history and philosophy of science. So many\npeople today—and even professional scientists—seem to me\nlike somebody who has seen thousands of trees but has never seen a\nforest. A knowledge of the historic and philosophical background gives\nthat kind of independence from prejudices of his generation from which\nmost scientists are suffering. This independence created by\nphilosophical insight is—in my opinion—the mark of\ndistinction between a mere artisan or specialist and a real seeker\nafter truth. (Einstein to Thornton, 7 December 1944, EA 61–574)\n\n\nThat Einstein meant what he said about the relevance of philosophy to\nphysics is evidenced by the fact that he had been saying more or less\nthe same thing for decades. Thus, in a 1916 memorial note for Ernst\nMach, a physicist and philosopher to whom Einstein owed a special\ndebt, he wrote:\n\nHow does it happen that a properly endowed natural scientist comes to\nconcern himself with epistemology? Is there no more valuable work in\nhis specialty? I hear many of my colleagues saying, and I sense it\nfrom many more, that they feel this way. I cannot share this\nsentiment. When I think about the ablest students whom I have\nencountered in my teaching, that is, those who distinguish themselves\nby their independence of judgment and not merely their\nquick-wittedness, I can affirm that they had a vigorous interest in\nepistemology. They happily began discussions about the goals and\nmethods of science, and they showed unequivocally, through their\ntenacity in defending their views, that the subject seemed important\nto them. Indeed, one should not be surprised at this. (Einstein 1916,\n101)\n\n\nHow, exactly, does the philosophical habit of mind provide the\nphysicist with such “independence of judgment”? Einstein\ngoes on to explain:\n\nConcepts that have proven useful in ordering things easily achieve\nsuch an authority over us that we forget their earthly origins and\naccept them as unalterable givens. Thus they come to be stamped as\n“necessities of thought,” “a priori givens,”\netc. The path of scientific advance is often made impassable for a\nlong time through such errors. For that reason, it is by no means an\nidle game if we become practiced in analyzing the long commonplace\nconcepts and exhibiting those circumstances upon which their\njustification and usefulness depend, how they have grown up,\nindividually, out of the givens of experience. By this means, their\nall-too-great authority will be broken. They will be removed if they\ncannot be properly legitimated, corrected if their correlation with\ngiven things be far too superfluous, replaced by others if a new\nsystem can be established that we prefer for whatever reason.\n(Einstein 1916, 102)\n\n\nOne is not surprised at Einstein’s then citing Mach’s critical\nanalysis of the Newtonian conception of absolute space as a paradigm\nof what Mach, himself, termed the “historical-critical”\nmethod of philosophical analysis (Einstein 1916, 101, citing Ch. 2,\n§§ 6–7 of Mach’s Mechanik, most likely the\nthird edition, Mach 1897). \n\nThe place of philosophy in physics was a theme to which Einstein\nreturned time and again, it being clearly an issue of deep importance\nto him. Sometimes he adopts a modest pose, as in this oft-quoted\nremark from his 1933 Spencer Lecture:\n\nIf you wish to learn from the theoretical physicist anything about the\nmethods which he uses, I would give you the following piece of advice:\nDon’t listen to his words, examine his achievements. For to the\ndiscoverer in that field, the constructions of his imagination appear\nso necessary and so natural that he is apt to treat them not as the\ncreations of his thoughts but as given realities. (Einstein 1933,\n5–6)\n\n\nMore typical, however, is the confident pose he struck three years\nlater in “Physics and Reality”: \n\nIt has often been said, and certainly not without justification, that\nthe man of science is a poor philosopher. Why then should it not be\nthe right thing for the physicist to let the philosopher do the\nphilosophizing? Such might indeed be the right thing at a time when\nthe physicist believes he has at his disposal a rigid system of\nfundamental concepts and fundamental laws which are so well\nestablished that waves of doubt can not reach them; but it can not be\nright at a time when the very foundations of physics itself have\nbecome problematic as they are now. At a time like the present, when\nexperience forces us to seek a newer and more solid foundation, the\nphysicist cannot simply surrender to the philosopher the critical\ncontemplation of the theoretical foundations; for, he himself knows\nbest, and feels more surely where the shoe pinches. In looking for a\nnew foundation, he must try to make clear in his own mind just how far\nthe concepts which he uses are justified, and are necessities.\n(Einstein 1936, 349)\n\n\nWhat kind of philosophy might we expect from the\nphilosopher-physicist? One thing that we should not expect from a\nphysicist who takes the philosophical turn in order to help solve\nfundamental physical problems is a systematic philosophy:\n\nThe reciprocal relationship of epistemology and science is of\nnoteworthy kind. They are dependent upon each other. Epistemology\nwithout contact with science becomes an empty scheme. Science without\nepistemology is—insofar as it is thinkable at\nall—primitive and muddled. However, no sooner has the\nepistemologist, who is seeking a clear system, fought his way through\nto such a system, than he is inclined to interpret the thought-content\nof science in the sense of his system and to reject whatever does not\nfit into his system. The scientist, however, cannot afford to carry\nhis striving for epistemological systematic that far. He accepts\ngratefully the epistemological conceptual analysis; but the external\nconditions, which are set for him by the facts of experience, do not\npermit him to let himself be too much restricted in the construction\nof his conceptual world by the adherence to an epistemological system.\nHe therefore must appear to the systematic epistemologist as a type of\nunscrupulous opportunist: he appears as realist insofar as he\nseeks to describe a world independent of the acts of perception; as\nidealist insofar as he looks upon the concepts and theories\nas free inventions of the human spirit (not logically derivable from\nwhat is empirically given); as positivist insofar as he\nconsiders his concepts and theories justified only to the\nextent to which they furnish a logical representation of relations\namong sensory experiences. He may even appear as Platonist or\nPythagorean insofar as he considers the viewpoint of logical\nsimplicity as an indispensable and effective tool of his research.\n(Einstein 1949, 683–684)\n\n\nBut what strikes the “systematic epistemologist” as mere\nopportunism might appear otherwise when viewed from the perspective of\na physicist engaged, as Einstein himself put it, in “the\ncritical contemplation of the theoretical foundations.” The\noverarching goal of that critical contemplation was, for Einstein, the\ncreation of a unified foundation for physics after the model of a\nfield theory like general relativity (see Sauer 2014 for non-technical\noverview on Einstein’s approach to the unified field theory program).\nEinstein failed in his quest, but there was a consistency and\nconstancy in the striving that informed as well the philosophy of\nscience developing hand in hand with the scientific project.\n\nIndeed, from early to late a few key ideas played the central, leading\nrole in Einstein’s philosophy of science, ideas about which Einstein\nevinced surprisingly little doubt even while achieving an ever deeper\nunderstanding of their implications. For the purposes of the following\ncomparatively brief overview, we can confine our attention to just\nfive topics:\n\nTheoretical holism.\nSimplicity and theory choice.\nUnivocalness in the theoretical representation of nature.\nRealism and separability.\nThe principle theories-constructive theories distinction.\n\n\nThe emphasis on the continuity and coherence in the development of\nEinstein’s philosophy of science contrasts with an account such as\nGerald Holton’s (1968), which claims to find a major philosophical\nbreak in the mid-1910s, in the form of a turn away from a sympathy for\nan anti-metaphysical positivism and toward a robust scientific\nrealism. Holton sees this turn being driven by Einstein’s alleged\nrealization that general relativity, by contrast with special\nrelativity, requires a realistic ontology. However, Einstein was\nprobably never an ardent “Machian”\n positivist,[1]\n and he was never a scientific realist, at least not in the sense\nacquired by the term “scientific realist” in later\ntwentieth century philosophical discourse (see Howard 1993). Einstein\nexpected scientific theories to have the proper empirical credentials,\nbut he was no positivist; and he expected scientific theories to give\nan account of physical reality, but he was no scientific realist.\nMoreover, in both respects his views remained more or less the same\nfrom the beginning to the end of his career.\n\nWhy Einstein did not think himself a realist (he said so explicitly)\nis discussed below. Why he is not to be understood as a positivist\ndeserves a word or two of further discussion here, if only because the\nbelief that he was sympathetic to positivism, at least early in his\nlife, is so widespread (for a fuller discussion, see Howard 1993).\n\n\nThat Einstein later repudiated positivism is beyond doubt. Many\nremarks from at least the early 1920s through the end of his life make\nthis clear. In 1946 he explained what he took to be Mach’s basic\nerror:\n\nHe did not place in the correct light the essentially constructive and\nspeculative nature of all thinking and more especially of scientific\nthinking; in consequence, he condemned theory precisely at those\npoints where its constructive-speculative character comes to light\nunmistakably, such as in the kinetic theory of atoms. (Einstein 1946,\n21)\n\n\nIs Einstein here also criticizing his own youthful philosophical\nindiscretions? The very example that Einstein gives here makes any\nsuch interpretation highly implausible, because one of Einstein’s main\ngoals in his early work on Brownian motion (Einstein 1905b) was\nprecisely to prove the reality of atoms, this in the face of the then\nfamous skepticism of thinkers like Mach and Wilhelm Ostwald:\n\nMy principal aim in this was to find facts that would guarantee as\nmuch as possible the existence of atoms of definite size.… The\nagreement of these considerations with experience together with\nPlanck’s determination of the true molecular size from the law of\nradiation (for high temperatures) convinced the skeptics, who were\nquite numerous at that time (Ostwald, Mach), of the reality of atoms.\n(Einstein 1946, 45, 47)\n\n\nWhy, then, is the belief in Einstein’s early sympathy for positivism\nso well entrenched? \n\nThe one piece of evidence standardly cited for a youthful flirtation\nwith positivism is Einstein’s critique of the notion of absolute\ndistant simultaneity in his 1905 paper on special relativity (Einstein\n1905c). Einstein speaks there of “observers,” but in an\nepistemologically neutral way that can be replaced by talk of an\ninertial frame of reference. What really bothers Einstein about\ndistant simultaneity is not that it is observationally inaccessible\nbut that it involves a two-fold arbitrariness, one in the choice of an\ninertial frame of reference and one in the stipulation within a given\nframe of a convention regarding the ratio of the times required for a\nlight signal to go from one stationary observer to another and back\nagain. Likewise, Einstein faults classical Maxwellian electrodynamics\nfor an asymmetry in the way it explains electromagnetic induction\ndepending on whether it is the coil or the magnet that is assumed to\nbe at rest. If the effect is the same—a current in the\ncoil—why, asks Einstein, should there be two different\nexplanations: an electrical field created in the vicinity of a moving\nmagnet or an electromotive force induced in a conductor moving through\na stationary magnetic field? To be sure, whether it is the coil or the\nmagnet that is taken to be at rest makes no observable difference, but\nthe problem, from Einstein’s point of view, is the asymmetry in the\ntwo explanations. Even the young Einstein was no positivist.\n\nFirst generation logical empiricists sought to legitimate their\nmovement in part by claiming Einstein as a friend. They may be\nforgiven their putting a forced interpretation on arguments taken out\nof context. We can do better.\n\nEinstein’s philosophy of science is an original synthesis drawing upon\nmany philosophical resources, from neo-Kantianism to Machian\nempiricism and Duhemian conventionalism. Other thinkers and movements,\nmost notably the logical empiricists, drew upon the same resources.\nBut Einstein put the pieces together in a manner importantly different\nfrom Moritz Schlick, Hans Reichenbach, and Rudolf Carnap, and he\nargued with them for decades about who was right (however much they\nobscured these differences in representing Einstein publicly as a\nfriend of logical empiricism and scientific philosophy). Starting from\nthe mid-1920s till the end of the decade Einstein show some interest\nin the rationalistic realism of Émile Meyerson (Einstein, 1928;\ncf. Giovanelli 2018; on the contemporary debate between Einstein and\nBergson, see Canales 2015). Understanding how Einstein puts those\npieces together therefore sheds light not only on the philosophical\naspect of his own achievements in physics but also upon the larger\nhistory of the development of the philosophy of science in the\ntwentieth century.\n",
    "section_title": "1. Introduction: Was Einstein an Epistemological “Opportunist”?",
    "entry_title": "Einstein’s Philosophy of Science",
    "hierarchy_title": "Einstein’s Philosophy of Science || Introduction: Was Einstein an Epistemological “Opportunist”?",
    "tokenized_text": [
        "introduction",
        "einstein",
        "epistemological",
        "opportunist",
        "introduction",
        "einstein",
        "epistemological",
        "opportunist",
        "late",
        "albert",
        "einstein",
        "received",
        "letter",
        "robert",
        "thornton",
        "young",
        "africanamerican",
        "philosopher",
        "science",
        "finished",
        "phd",
        "herbert",
        "feigl",
        "minnesota",
        "beginning",
        "new",
        "job",
        "teaching",
        "physic",
        "university",
        "puerto",
        "rico",
        "mayaguez",
        "written",
        "solicit",
        "einstein",
        "supportive",
        "word",
        "behalf",
        "effort",
        "introduce",
        "much",
        "philosophy",
        "science",
        "possible",
        "modern",
        "physic",
        "course",
        "teach",
        "following",
        "spring",
        "thornton",
        "einstein",
        "november",
        "ea",
        "einstein",
        "offered",
        "reply",
        "fully",
        "agree",
        "significance",
        "educational",
        "value",
        "methodology",
        "well",
        "history",
        "philosophy",
        "science",
        "many",
        "people",
        "todayand",
        "even",
        "professional",
        "scientistsseem",
        "like",
        "somebody",
        "seen",
        "thousand",
        "tree",
        "never",
        "seen",
        "forest",
        "knowledge",
        "historic",
        "philosophical",
        "background",
        "give",
        "kind",
        "independence",
        "prejudice",
        "generation",
        "scientist",
        "suffering",
        "independence",
        "created",
        "philosophical",
        "insight",
        "isin",
        "opinionthe",
        "mark",
        "distinction",
        "mere",
        "artisan",
        "specialist",
        "real",
        "seeker",
        "truth",
        "einstein",
        "thornton",
        "december",
        "ea",
        "einstein",
        "meant",
        "said",
        "relevance",
        "philosophy",
        "physic",
        "evidenced",
        "fact",
        "saying",
        "le",
        "thing",
        "decade",
        "thus",
        "memorial",
        "note",
        "ernst",
        "mach",
        "physicist",
        "philosopher",
        "einstein",
        "owed",
        "special",
        "debt",
        "wrote",
        "happen",
        "properly",
        "endowed",
        "natural",
        "scientist",
        "come",
        "concern",
        "epistemology",
        "valuable",
        "work",
        "specialty",
        "hear",
        "many",
        "colleague",
        "saying",
        "sense",
        "many",
        "feel",
        "way",
        "share",
        "sentiment",
        "think",
        "ablest",
        "student",
        "encountered",
        "teaching",
        "distinguish",
        "independence",
        "judgment",
        "merely",
        "quickwittedness",
        "affirm",
        "vigorous",
        "interest",
        "epistemology",
        "happily",
        "began",
        "discussion",
        "goal",
        "method",
        "science",
        "showed",
        "unequivocally",
        "tenacity",
        "defending",
        "view",
        "subject",
        "seemed",
        "important",
        "indeed",
        "one",
        "surprised",
        "einstein",
        "exactly",
        "philosophical",
        "habit",
        "mind",
        "provide",
        "physicist",
        "independence",
        "judgment",
        "einstein",
        "go",
        "explain",
        "concept",
        "proven",
        "useful",
        "ordering",
        "thing",
        "easily",
        "achieve",
        "authority",
        "u",
        "forget",
        "earthly",
        "origin",
        "accept",
        "unalterable",
        "given",
        "thus",
        "come",
        "stamped",
        "necessity",
        "thought",
        "priori",
        "given",
        "etc",
        "path",
        "scientific",
        "advance",
        "often",
        "made",
        "impassable",
        "long",
        "time",
        "error",
        "reason",
        "mean",
        "idle",
        "game",
        "become",
        "practiced",
        "analyzing",
        "long",
        "commonplace",
        "concept",
        "exhibiting",
        "circumstance",
        "upon",
        "justification",
        "usefulness",
        "depend",
        "grown",
        "individually",
        "given",
        "experience",
        "mean",
        "alltoogreat",
        "authority",
        "broken",
        "removed",
        "properly",
        "legitimated",
        "corrected",
        "correlation",
        "given",
        "thing",
        "far",
        "superfluous",
        "replaced",
        "others",
        "new",
        "system",
        "established",
        "prefer",
        "whatever",
        "reason",
        "einstein",
        "one",
        "surprised",
        "einstein",
        "citing",
        "mach",
        "critical",
        "analysis",
        "newtonian",
        "conception",
        "absolute",
        "space",
        "paradigm",
        "mach",
        "termed",
        "historicalcritical",
        "method",
        "philosophical",
        "analysis",
        "einstein",
        "citing",
        "ch",
        "mach",
        "mechanik",
        "likely",
        "third",
        "edition",
        "mach",
        "place",
        "philosophy",
        "physic",
        "theme",
        "einstein",
        "returned",
        "time",
        "clearly",
        "issue",
        "deep",
        "importance",
        "sometimes",
        "adopts",
        "modest",
        "pose",
        "oftquoted",
        "remark",
        "spencer",
        "lecture",
        "wish",
        "learn",
        "theoretical",
        "physicist",
        "anything",
        "method",
        "us",
        "would",
        "give",
        "following",
        "piece",
        "advice",
        "listen",
        "word",
        "examine",
        "achievement",
        "discoverer",
        "field",
        "construction",
        "imagination",
        "appear",
        "necessary",
        "natural",
        "apt",
        "treat",
        "creation",
        "thought",
        "given",
        "reality",
        "einstein",
        "typical",
        "however",
        "confident",
        "pose",
        "struck",
        "three",
        "year",
        "later",
        "physic",
        "reality",
        "often",
        "said",
        "certainly",
        "without",
        "justification",
        "man",
        "science",
        "poor",
        "philosopher",
        "right",
        "thing",
        "physicist",
        "let",
        "philosopher",
        "philosophizing",
        "might",
        "indeed",
        "right",
        "thing",
        "time",
        "physicist",
        "belief",
        "disposal",
        "rigid",
        "system",
        "fundamental",
        "concept",
        "fundamental",
        "law",
        "well",
        "established",
        "wave",
        "doubt",
        "reach",
        "right",
        "time",
        "foundation",
        "physic",
        "become",
        "problematic",
        "time",
        "like",
        "present",
        "experience",
        "force",
        "u",
        "seek",
        "newer",
        "solid",
        "foundation",
        "physicist",
        "simply",
        "surrender",
        "philosopher",
        "critical",
        "contemplation",
        "theoretical",
        "foundation",
        "know",
        "best",
        "feel",
        "surely",
        "shoe",
        "pinch",
        "looking",
        "new",
        "foundation",
        "must",
        "try",
        "make",
        "clear",
        "mind",
        "far",
        "concept",
        "us",
        "justified",
        "necessity",
        "einstein",
        "kind",
        "philosophy",
        "might",
        "expect",
        "philosopherphysicist",
        "one",
        "thing",
        "expect",
        "physicist",
        "take",
        "philosophical",
        "turn",
        "order",
        "help",
        "solve",
        "fundamental",
        "physical",
        "problem",
        "systematic",
        "philosophy",
        "reciprocal",
        "relationship",
        "epistemology",
        "science",
        "noteworthy",
        "kind",
        "dependent",
        "upon",
        "epistemology",
        "without",
        "contact",
        "science",
        "becomes",
        "empty",
        "scheme",
        "science",
        "without",
        "epistemology",
        "isinsofar",
        "thinkable",
        "allprimitive",
        "muddled",
        "however",
        "sooner",
        "epistemologist",
        "seeking",
        "clear",
        "system",
        "fought",
        "way",
        "system",
        "inclined",
        "interpret",
        "thoughtcontent",
        "science",
        "sense",
        "system",
        "reject",
        "whatever",
        "fit",
        "system",
        "scientist",
        "however",
        "afford",
        "carry",
        "striving",
        "epistemological",
        "systematic",
        "far",
        "accepts",
        "gratefully",
        "epistemological",
        "conceptual",
        "analysis",
        "external",
        "condition",
        "set",
        "fact",
        "experience",
        "permit",
        "let",
        "much",
        "restricted",
        "construction",
        "conceptual",
        "world",
        "adherence",
        "epistemological",
        "system",
        "therefore",
        "must",
        "appear",
        "systematic",
        "epistemologist",
        "type",
        "unscrupulous",
        "opportunist",
        "appears",
        "realist",
        "insofar",
        "seek",
        "describe",
        "world",
        "independent",
        "act",
        "perception",
        "idealist",
        "insofar",
        "look",
        "upon",
        "concept",
        "theory",
        "free",
        "invention",
        "human",
        "spirit",
        "logically",
        "derivable",
        "empirically",
        "given",
        "positivist",
        "insofar",
        "considers",
        "concept",
        "theory",
        "justified",
        "extent",
        "furnish",
        "logical",
        "representation",
        "relation",
        "among",
        "sensory",
        "experience",
        "may",
        "even",
        "appear",
        "platonist",
        "pythagorean",
        "insofar",
        "considers",
        "viewpoint",
        "logical",
        "simplicity",
        "indispensable",
        "effective",
        "tool",
        "research",
        "einstein",
        "strike",
        "systematic",
        "epistemologist",
        "mere",
        "opportunism",
        "might",
        "appear",
        "otherwise",
        "viewed",
        "perspective",
        "physicist",
        "engaged",
        "einstein",
        "put",
        "critical",
        "contemplation",
        "theoretical",
        "foundations",
        "overarching",
        "goal",
        "critical",
        "contemplation",
        "einstein",
        "creation",
        "unified",
        "foundation",
        "physic",
        "model",
        "field",
        "theory",
        "like",
        "general",
        "relativity",
        "see",
        "sauer",
        "nontechnical",
        "overview",
        "einstein",
        "approach",
        "unified",
        "field",
        "theory",
        "program",
        "einstein",
        "failed",
        "quest",
        "consistency",
        "constancy",
        "striving",
        "informed",
        "well",
        "philosophy",
        "science",
        "developing",
        "hand",
        "hand",
        "scientific",
        "project",
        "indeed",
        "early",
        "late",
        "key",
        "idea",
        "played",
        "central",
        "leading",
        "role",
        "einstein",
        "philosophy",
        "science",
        "idea",
        "einstein",
        "evinced",
        "surprisingly",
        "little",
        "doubt",
        "even",
        "achieving",
        "ever",
        "deeper",
        "understanding",
        "implication",
        "purpose",
        "following",
        "comparatively",
        "brief",
        "overview",
        "confine",
        "attention",
        "five",
        "topic",
        "theoretical",
        "holism",
        "simplicity",
        "theory",
        "choice",
        "univocalness",
        "theoretical",
        "representation",
        "nature",
        "realism",
        "separability",
        "principle",
        "theoriesconstructive",
        "theory",
        "distinction",
        "emphasis",
        "continuity",
        "coherence",
        "development",
        "einstein",
        "philosophy",
        "science",
        "contrast",
        "account",
        "gerald",
        "holton",
        "claim",
        "find",
        "major",
        "philosophical",
        "break",
        "mids",
        "form",
        "turn",
        "away",
        "sympathy",
        "antimetaphysical",
        "positivism",
        "toward",
        "robust",
        "scientific",
        "realism",
        "holton",
        "see",
        "turn",
        "driven",
        "einstein",
        "alleged",
        "realization",
        "general",
        "relativity",
        "contrast",
        "special",
        "relativity",
        "requires",
        "realistic",
        "ontology",
        "however",
        "einstein",
        "probably",
        "never",
        "ardent",
        "machian",
        "positivist",
        "never",
        "scientific",
        "realist",
        "least",
        "sense",
        "acquired",
        "term",
        "scientific",
        "realist",
        "later",
        "twentieth",
        "century",
        "philosophical",
        "discourse",
        "see",
        "howard",
        "einstein",
        "expected",
        "scientific",
        "theory",
        "proper",
        "empirical",
        "credential",
        "positivist",
        "expected",
        "scientific",
        "theory",
        "give",
        "account",
        "physical",
        "reality",
        "scientific",
        "realist",
        "moreover",
        "respect",
        "view",
        "remained",
        "le",
        "beginning",
        "end",
        "career",
        "einstein",
        "think",
        "realist",
        "said",
        "explicitly",
        "discussed",
        "understood",
        "positivist",
        "deserves",
        "word",
        "two",
        "discussion",
        "belief",
        "sympathetic",
        "positivism",
        "least",
        "early",
        "life",
        "widespread",
        "fuller",
        "discussion",
        "see",
        "howard",
        "einstein",
        "later",
        "repudiated",
        "positivism",
        "beyond",
        "doubt",
        "many",
        "remark",
        "least",
        "early",
        "s",
        "end",
        "life",
        "make",
        "clear",
        "explained",
        "took",
        "mach",
        "basic",
        "error",
        "place",
        "correct",
        "light",
        "essentially",
        "constructive",
        "speculative",
        "nature",
        "thinking",
        "especially",
        "scientific",
        "thinking",
        "consequence",
        "condemned",
        "theory",
        "precisely",
        "point",
        "constructivespeculative",
        "character",
        "come",
        "light",
        "unmistakably",
        "kinetic",
        "theory",
        "atom",
        "einstein",
        "einstein",
        "also",
        "criticizing",
        "youthful",
        "philosophical",
        "indiscretion",
        "example",
        "einstein",
        "give",
        "make",
        "interpretation",
        "highly",
        "implausible",
        "one",
        "einstein",
        "main",
        "goal",
        "early",
        "work",
        "brownian",
        "motion",
        "einstein",
        "b",
        "precisely",
        "prove",
        "reality",
        "atom",
        "face",
        "famous",
        "skepticism",
        "thinker",
        "like",
        "mach",
        "wilhelm",
        "ostwald",
        "principal",
        "aim",
        "find",
        "fact",
        "would",
        "guarantee",
        "much",
        "possible",
        "existence",
        "atom",
        "definite",
        "size",
        "agreement",
        "consideration",
        "experience",
        "together",
        "planck",
        "determination",
        "true",
        "molecular",
        "size",
        "law",
        "radiation",
        "high",
        "temperature",
        "convinced",
        "skeptic",
        "quite",
        "numerous",
        "time",
        "ostwald",
        "mach",
        "reality",
        "atom",
        "einstein",
        "belief",
        "einstein",
        "early",
        "sympathy",
        "positivism",
        "well",
        "entrenched",
        "one",
        "piece",
        "evidence",
        "standardly",
        "cited",
        "youthful",
        "flirtation",
        "positivism",
        "einstein",
        "critique",
        "notion",
        "absolute",
        "distant",
        "simultaneity",
        "paper",
        "special",
        "relativity",
        "einstein",
        "c",
        "einstein",
        "speaks",
        "observer",
        "epistemologically",
        "neutral",
        "way",
        "replaced",
        "talk",
        "inertial",
        "frame",
        "reference",
        "really",
        "bother",
        "einstein",
        "distant",
        "simultaneity",
        "observationally",
        "inaccessible",
        "involves",
        "twofold",
        "arbitrariness",
        "one",
        "choice",
        "inertial",
        "frame",
        "reference",
        "one",
        "stipulation",
        "within",
        "given",
        "frame",
        "convention",
        "regarding",
        "ratio",
        "time",
        "required",
        "light",
        "signal",
        "go",
        "one",
        "stationary",
        "observer",
        "another",
        "back",
        "likewise",
        "einstein",
        "fault",
        "classical",
        "maxwellian",
        "electrodynamics",
        "asymmetry",
        "way",
        "explains",
        "electromagnetic",
        "induction",
        "depending",
        "whether",
        "coil",
        "magnet",
        "assumed",
        "rest",
        "effect",
        "samea",
        "current",
        "coilwhy",
        "asks",
        "einstein",
        "two",
        "different",
        "explanation",
        "electrical",
        "field",
        "created",
        "vicinity",
        "moving",
        "magnet",
        "electromotive",
        "force",
        "induced",
        "conductor",
        "moving",
        "stationary",
        "magnetic",
        "field",
        "sure",
        "whether",
        "coil",
        "magnet",
        "taken",
        "rest",
        "make",
        "observable",
        "difference",
        "problem",
        "einstein",
        "point",
        "view",
        "asymmetry",
        "two",
        "explanation",
        "even",
        "young",
        "einstein",
        "positivist",
        "first",
        "generation",
        "logical",
        "empiricist",
        "sought",
        "legitimate",
        "movement",
        "part",
        "claiming",
        "einstein",
        "friend",
        "may",
        "forgiven",
        "putting",
        "forced",
        "interpretation",
        "argument",
        "taken",
        "context",
        "better",
        "einstein",
        "philosophy",
        "science",
        "original",
        "synthesis",
        "drawing",
        "upon",
        "many",
        "philosophical",
        "resource",
        "neokantianism",
        "machian",
        "empiricism",
        "duhemian",
        "conventionalism",
        "thinker",
        "movement",
        "notably",
        "logical",
        "empiricist",
        "drew",
        "upon",
        "resource",
        "einstein",
        "put",
        "piece",
        "together",
        "manner",
        "importantly",
        "different",
        "moritz",
        "schlick",
        "han",
        "reichenbach",
        "rudolf",
        "carnap",
        "argued",
        "decade",
        "right",
        "however",
        "much",
        "obscured",
        "difference",
        "representing",
        "einstein",
        "publicly",
        "friend",
        "logical",
        "empiricism",
        "scientific",
        "philosophy",
        "starting",
        "mids",
        "till",
        "end",
        "decade",
        "einstein",
        "show",
        "interest",
        "rationalistic",
        "realism",
        "émile",
        "meyerson",
        "einstein",
        "cf",
        "giovanelli",
        "contemporary",
        "debate",
        "einstein",
        "bergson",
        "see",
        "canales",
        "understanding",
        "einstein",
        "put",
        "piece",
        "together",
        "therefore",
        "shed",
        "light",
        "philosophical",
        "aspect",
        "achievement",
        "physic",
        "also",
        "upon",
        "larger",
        "history",
        "development",
        "philosophy",
        "science",
        "twentieth",
        "century"
    ]
}