{
    "main_text": "Conceptualization || Embodied Concepts\n3.2 Embodied Concepts\n\n\nA far more developed and empirically grounded case for\nConceptualization comes from psychological and neurological studies\nthat show a connection between a subject’s use of a concept and\nactivity in the subject’s sensorimotor systems. Arising from\nthese studies is a view of concepts as containing within their content\nfacts about the sensorimotor particularities of their possessors.\nBecause these particularities reflect the properties of an\norganism’s body—how, for instance, it moves its limbs when\ninteracting with the world—the content of its concepts too will\nbe constrained and informed by the nature of its body.\n\n\nCentral to the idea that concepts are embodied is the description of\nsuch concepts as modal. This label is intended to make stark\nthe anti-computationalism that proponents of embodied concepts\nendorse. Symbols in a computer—strings of 1s and 0s—are\namodal, in the sense that their relationship to their\ncontents is arbitrary. Words too are amodal symbols. The symbol\n‘lake’ means lake, but not in virtue of any\nresemblance or nomological connection it bears towards lakes. There is\nno reason that ‘lake’, rather than some other symbol,\nshould mean lake—as is obvious when thinking about\nwords that mean lake in non-English languages. All mental\nsymbols, from the perspective of computational cognitive science, are\namodal in this sense.\n\n\nModal symbols, on the other hand, retain information about the\nsources of their origin. They are not just symbols, but, in\nBarsalou’s (1999; Barsalou et al. 2003) terminology,\nperceptual symbols. Thoughts about a lake, for instance,\nconsist in activation of the sensorimotor areas of the brain that had\nbeen activated during previous encounters with actual lakes. A\nlake thought re-activates areas of visual cortex that respond\nto visual information corresponding to lakes; areas of auditory cortex\nthat respond to auditory information corresponding to lakes; areas of\nmotor cortex that correspond to actions typically associated with lakes\n(although this activation is suppressed so that it does not lead to\nactual motion), and so on. The result is a lake concept that\nreflects the kinds of sensory and motor activities that are unique to\nhuman bodies and sensory systems. Lake means something like\n“thing that looks like this, sounds like this,\nsmells like this, allows me to swim within it like\nthis”. Moreover, because how things look and sound\ndepend on the properties of sensory systems, and because the\ninteractions something affords depends on the properties of motor\nsystems, concepts will be body-specific.\n\n\nMuch of the evidence for the modality of concepts arises from\ndemonstrations of an orientation-dependent spatial compatibility\neffect (OSC) (Symes, Ellis, and Tucker 2007). Tucker and Ellis\n(1998), for instance, asked subjects to judge whether a given object,\ne.g., a pan, was right-side-up or upside down. The object was oriented\neither rightwards or leftwards. So, for instance, the pan’s\nhandle extended toward the right or left. Subjects would indicate\nwhether the object was right-side-up or upside down by pressing a\nbutton to their right with their right index finger or to their left\nwith their left index finger. Subjects’ reaction times were\nshorter when using a right finger to indicate a response when the\nobject was oriented to the right than when oriented toward the left,\nand, mutatis mutandis, for left-finger responses when the\nobject was oriented to the left. Despite the fact that subjects were\nnot asked to consider horizontal orientation of the stimulus object,\nthis orientation influenced response times (for related work on the\nOSC, see Tucker and Ellis 2001; 2004).\n\n\nRelatedly, Glenberg and Kaschak (2002) showed an action-sentence\ncompatibility effect (ASC) Subjects were asked to judge the\nsensibility of sentences like “open the drawer” or\n“close the drawer.” Sentences of the first kind suggested\nactions that would require a motion of the hand toward the body and\nsentences of the second kind suggested actions with motions away from\nthe body. Subjects would indicate the sensibility of the sentence by\npressing a button that required a hand motion either away from the body\nor toward the body. Glenberg and Kaschak found that reaction times were\nshorter when the response motion was compatible with the motion\nsuggested by the action sentences.\n\n\nBoth the OSC and ASC effects have been taken to show that concepts\nare modal. Thoughts about pans, for instance, activate areas in motor\ncortex that would be activated when actually manipulating a pan.\nSubjects are slower to respond to a leftward oriented pan with their\nright finger, because seeing the pan’s orientation activates\nmotor areas in the brain associated with grasping the pan with the left\nhand, priming a left finger response while inhibiting a right finger\nresponse. Similarly, the meaning of words like “open” and\n“close” include in their content the kinds of motor\nactivity that would be involved in opening or closing motions. The\nmeaning of object concepts thus contain information about how objects\nmight be manipulated by bodies like ours; action concepts\nconsist, in part, of information about how bodies like ours\nmove.\n\n\nFurther evidence for the claim that concepts are packed with\nsensorimotor information comes from Edmiston and Lupyan (2017), who\nasked subjects questions that required for their answers either\n“encyclopedic” knowledge—“Does a swan lay\neggs?”—or visual knowledge—“Does a swan have a\nbeak?”. Interestingly, they found that visual interference\nduring the task would diminish performance on questions requiring\nvisual knowledge but not encyclopedic knowledge. They took this as\nevidence for the embodiment of concepts insofar as the effect of\nvisual interference would be expected if concepts were modal—if,\nin this case, they involved the activation of vision centers in the\nbrain—but not if concepts were amodal symbols, divorced from\ntheir sensorimotor origins.\n\n\nA final source of evidence for embodied concepts comes from\nneurological investigations that reveal activation in the sensorimotor\nareas of the brain associated with particular actions. Reading a word\nlike ‘kick’ or ‘punch’ causes activity in\nmotor areas of the brain associated with kicking and punching\n(Pulvermüller 2005). Stimulation of these areas by transcranial\nmagnetic stimulation can affect comprehension of such words\n(Pulvermüller 2005; Buccino et al. 2005). Again, results like\nthese are precisely what an embodied theory of concepts would predict\nbut would be unexpected on standard computational amodal theories of\nconcepts. If the concept kick includes in its content motions\ndistinctive of a human leg, as determined by activity in the motor\ncortex, then, as Conceptualization entails, it shows the imprint of a\nspecific sort of embodiment.\n\n\nCritics of embodied concepts have issued a number of challenges.\nMost basically, one might question whether empirical studies like those\njust mentioned are targeting concepts at all. Why think, for instance,\nthat the meaning of the concept pan includes information about\nhow pans must be grasped; and that the meaning of open\nincludes information about how an arm should move? Claims like these\nseem inattentive to a distinction between a concept and a\nconception (Rey 1983; 1985; Shapiro 2019a). The meaning of the\nconcept bachelor, for instance, is unmarried male.\nBut apart from this concept is a conception of a bachelor,\nwhere a conception involves something like typical or representative\nfeatures. A bachelor conception might include things like being a\nlothario, or being young, or participating in bro-culture. These\nconcepts are associated with the concept bachelor,\nbut not actually part of the meaning of the concept. Similarly, that\npans might be grasped so, or opening involves moving\nan arm like so, might not be part of the meaning of the\nconcepts pan and open, but instead features of\none’s conception of pans and one’s conception of how to\nopen things.\n\n\nJust as defenders of embodied concepts might not be investigating\nconcepts after all, but instead only conceptions—only features\nassociated with concepts—it may be that the motor\nactivity that accompanies thoughts about concepts does not contribute\nto the meaning of a concept but is instead only associated with the\nconcept. The psychologists Mahon and Caramazza (2008) argue for this\nway of interpreting the neurological studies taken to support of\nembodied concepts. The finding that exposure to the word\n‘kick’ causes activity in the motor areas of the brain\nresponsible for kicking does not show that kick is a modal\nconcept. Mahon and Caramazza suggest that linguistic processing of a\nword might create a cascade of activity that flows to areas of the\nbrain that are associated with the meaning of the word. A\nthought about kick is associated with thoughts about moving\none’s leg, which in turn causes activity in the motor system,\nbut there is no motivation for regarding this activity as part of the\nkick concept—no motivation for seeing it as evidence\nfor the modality of the concept (Mahon 2015). Thinking about a kick\ncauses one to think about moving one’s leg, which causes\nactivity in motor cortex, but the meaning of kick is\nindependent of such activity.\n\n\nFinally, even granting the modality of concepts like pan\nand kick, one might question whether all concepts\nare embodied, as some embodied cognition researchers suggest (Barsalou\n1999). Of special concern are abstract concepts like\ndemocracy, justice, and morality (Dove 2009;\n2016). Unlike pan, the meaning of which might involve\ninformation from sensory and motor systems, what sensory and motor\nactivity might be included in the meaning of justice? Barsalou\n(2008) and Barsalou and Wiemer-Hastings (2005) offer an account of how\nabstract concepts might be analyzed in modal terms, but debate over the\nissue is far from settled.\n",
    "section_title": "3.2 Embodied Concepts",
    "entry_title": "Embodied Cognition",
    "hierarchy_title": "Embodied Cognition || Conceptualization || Embodied Concepts",
    "tokenized_text": [
        "conceptualization",
        "embodied",
        "concept",
        "embodied",
        "concept",
        "far",
        "developed",
        "empirically",
        "grounded",
        "case",
        "conceptualization",
        "come",
        "psychological",
        "neurological",
        "study",
        "show",
        "connection",
        "subject",
        "use",
        "concept",
        "activity",
        "subject",
        "sensorimotor",
        "system",
        "arising",
        "study",
        "view",
        "concept",
        "containing",
        "within",
        "content",
        "fact",
        "sensorimotor",
        "particularity",
        "possessor",
        "particularity",
        "reflect",
        "property",
        "organism",
        "bodyhow",
        "instance",
        "move",
        "limb",
        "interacting",
        "worldthe",
        "content",
        "concept",
        "constrained",
        "informed",
        "nature",
        "body",
        "central",
        "idea",
        "concept",
        "embodied",
        "description",
        "concept",
        "modal",
        "label",
        "intended",
        "make",
        "stark",
        "anticomputationalism",
        "proponent",
        "embodied",
        "concept",
        "endorse",
        "symbol",
        "computerstrings",
        "sare",
        "amodal",
        "sense",
        "relationship",
        "content",
        "arbitrary",
        "word",
        "amodal",
        "symbol",
        "symbol",
        "lake",
        "mean",
        "lake",
        "virtue",
        "resemblance",
        "nomological",
        "connection",
        "bear",
        "towards",
        "lake",
        "reason",
        "lake",
        "rather",
        "symbol",
        "mean",
        "lakeas",
        "obvious",
        "thinking",
        "word",
        "mean",
        "lake",
        "nonenglish",
        "language",
        "mental",
        "symbol",
        "perspective",
        "computational",
        "cognitive",
        "science",
        "amodal",
        "sense",
        "modal",
        "symbol",
        "hand",
        "retain",
        "information",
        "source",
        "origin",
        "symbol",
        "barsalou",
        "barsalou",
        "et",
        "al",
        "terminology",
        "perceptual",
        "symbol",
        "thought",
        "lake",
        "instance",
        "consist",
        "activation",
        "sensorimotor",
        "area",
        "brain",
        "activated",
        "previous",
        "encounter",
        "actual",
        "lake",
        "lake",
        "thought",
        "reactivates",
        "area",
        "visual",
        "cortex",
        "respond",
        "visual",
        "information",
        "corresponding",
        "lake",
        "area",
        "auditory",
        "cortex",
        "respond",
        "auditory",
        "information",
        "corresponding",
        "lake",
        "area",
        "motor",
        "cortex",
        "correspond",
        "action",
        "typically",
        "associated",
        "lake",
        "although",
        "activation",
        "suppressed",
        "lead",
        "actual",
        "motion",
        "result",
        "lake",
        "concept",
        "reflects",
        "kind",
        "sensory",
        "motor",
        "activity",
        "unique",
        "human",
        "body",
        "sensory",
        "system",
        "lake",
        "mean",
        "something",
        "like",
        "thing",
        "look",
        "like",
        "sound",
        "like",
        "smell",
        "like",
        "allows",
        "swim",
        "within",
        "like",
        "moreover",
        "thing",
        "look",
        "sound",
        "depend",
        "property",
        "sensory",
        "system",
        "interaction",
        "something",
        "affords",
        "depends",
        "property",
        "motor",
        "system",
        "concept",
        "bodyspecific",
        "much",
        "evidence",
        "modality",
        "concept",
        "arises",
        "demonstration",
        "orientationdependent",
        "spatial",
        "compatibility",
        "effect",
        "osc",
        "symes",
        "elli",
        "tucker",
        "tucker",
        "elli",
        "instance",
        "asked",
        "subject",
        "judge",
        "whether",
        "given",
        "object",
        "eg",
        "pan",
        "rightsideup",
        "upside",
        "object",
        "oriented",
        "either",
        "rightwards",
        "leftwards",
        "instance",
        "pan",
        "handle",
        "extended",
        "toward",
        "right",
        "left",
        "subject",
        "would",
        "indicate",
        "whether",
        "object",
        "rightsideup",
        "upside",
        "pressing",
        "button",
        "right",
        "right",
        "index",
        "finger",
        "left",
        "left",
        "index",
        "finger",
        "subject",
        "reaction",
        "time",
        "shorter",
        "using",
        "right",
        "finger",
        "indicate",
        "response",
        "object",
        "oriented",
        "right",
        "oriented",
        "toward",
        "left",
        "mutatis",
        "mutandis",
        "leftfinger",
        "response",
        "object",
        "oriented",
        "left",
        "despite",
        "fact",
        "subject",
        "asked",
        "consider",
        "horizontal",
        "orientation",
        "stimulus",
        "object",
        "orientation",
        "influenced",
        "response",
        "time",
        "related",
        "work",
        "osc",
        "see",
        "tucker",
        "elli",
        "relatedly",
        "glenberg",
        "kaschak",
        "showed",
        "actionsentence",
        "compatibility",
        "effect",
        "asc",
        "subject",
        "asked",
        "judge",
        "sensibility",
        "sentence",
        "like",
        "open",
        "drawer",
        "close",
        "drawer",
        "sentence",
        "first",
        "kind",
        "suggested",
        "action",
        "would",
        "require",
        "motion",
        "hand",
        "toward",
        "body",
        "sentence",
        "second",
        "kind",
        "suggested",
        "action",
        "motion",
        "away",
        "body",
        "subject",
        "would",
        "indicate",
        "sensibility",
        "sentence",
        "pressing",
        "button",
        "required",
        "hand",
        "motion",
        "either",
        "away",
        "body",
        "toward",
        "body",
        "glenberg",
        "kaschak",
        "found",
        "reaction",
        "time",
        "shorter",
        "response",
        "motion",
        "compatible",
        "motion",
        "suggested",
        "action",
        "sentence",
        "osc",
        "asc",
        "effect",
        "taken",
        "show",
        "concept",
        "modal",
        "thought",
        "pan",
        "instance",
        "activate",
        "area",
        "motor",
        "cortex",
        "would",
        "activated",
        "actually",
        "manipulating",
        "pan",
        "subject",
        "slower",
        "respond",
        "leftward",
        "oriented",
        "pan",
        "right",
        "finger",
        "seeing",
        "pan",
        "orientation",
        "activates",
        "motor",
        "area",
        "brain",
        "associated",
        "grasping",
        "pan",
        "left",
        "hand",
        "priming",
        "left",
        "finger",
        "response",
        "inhibiting",
        "right",
        "finger",
        "response",
        "similarly",
        "meaning",
        "word",
        "like",
        "open",
        "close",
        "include",
        "content",
        "kind",
        "motor",
        "activity",
        "would",
        "involved",
        "opening",
        "closing",
        "motion",
        "meaning",
        "object",
        "concept",
        "thus",
        "contain",
        "information",
        "object",
        "might",
        "manipulated",
        "body",
        "like",
        "action",
        "concept",
        "consist",
        "part",
        "information",
        "body",
        "like",
        "move",
        "evidence",
        "claim",
        "concept",
        "packed",
        "sensorimotor",
        "information",
        "come",
        "edmiston",
        "lupyan",
        "asked",
        "subject",
        "question",
        "required",
        "answer",
        "either",
        "encyclopedic",
        "knowledge",
        "swan",
        "lay",
        "egg",
        "or",
        "visual",
        "knowledge",
        "swan",
        "beak",
        "interestingly",
        "found",
        "visual",
        "interference",
        "task",
        "would",
        "diminish",
        "performance",
        "question",
        "requiring",
        "visual",
        "knowledge",
        "encyclopedic",
        "knowledge",
        "took",
        "evidence",
        "embodiment",
        "concept",
        "insofar",
        "effect",
        "visual",
        "interference",
        "would",
        "expected",
        "concept",
        "modalif",
        "case",
        "involved",
        "activation",
        "vision",
        "center",
        "brainbut",
        "concept",
        "amodal",
        "symbol",
        "divorced",
        "sensorimotor",
        "origin",
        "final",
        "source",
        "evidence",
        "embodied",
        "concept",
        "come",
        "neurological",
        "investigation",
        "reveal",
        "activation",
        "sensorimotor",
        "area",
        "brain",
        "associated",
        "particular",
        "action",
        "reading",
        "word",
        "like",
        "kick",
        "punch",
        "cause",
        "activity",
        "motor",
        "area",
        "brain",
        "associated",
        "kicking",
        "punching",
        "pulvermüller",
        "stimulation",
        "area",
        "transcranial",
        "magnetic",
        "stimulation",
        "affect",
        "comprehension",
        "word",
        "pulvermüller",
        "buccino",
        "et",
        "al",
        "result",
        "like",
        "precisely",
        "embodied",
        "theory",
        "concept",
        "would",
        "predict",
        "would",
        "unexpected",
        "standard",
        "computational",
        "amodal",
        "theory",
        "concept",
        "concept",
        "kick",
        "includes",
        "content",
        "motion",
        "distinctive",
        "human",
        "leg",
        "determined",
        "activity",
        "motor",
        "cortex",
        "conceptualization",
        "entail",
        "show",
        "imprint",
        "specific",
        "sort",
        "embodiment",
        "critic",
        "embodied",
        "concept",
        "issued",
        "number",
        "challenge",
        "basically",
        "one",
        "might",
        "question",
        "whether",
        "empirical",
        "study",
        "like",
        "mentioned",
        "targeting",
        "concept",
        "think",
        "instance",
        "meaning",
        "concept",
        "pan",
        "includes",
        "information",
        "pan",
        "must",
        "grasped",
        "meaning",
        "open",
        "includes",
        "information",
        "arm",
        "move",
        "claim",
        "like",
        "seem",
        "inattentive",
        "distinction",
        "concept",
        "conception",
        "rey",
        "shapiro",
        "a",
        "meaning",
        "concept",
        "bachelor",
        "instance",
        "unmarried",
        "male",
        "apart",
        "concept",
        "conception",
        "bachelor",
        "conception",
        "involves",
        "something",
        "like",
        "typical",
        "representative",
        "feature",
        "bachelor",
        "conception",
        "might",
        "include",
        "thing",
        "like",
        "lothario",
        "young",
        "participating",
        "broculture",
        "concept",
        "associated",
        "concept",
        "bachelor",
        "actually",
        "part",
        "meaning",
        "concept",
        "similarly",
        "pan",
        "might",
        "grasped",
        "opening",
        "involves",
        "moving",
        "arm",
        "like",
        "might",
        "part",
        "meaning",
        "concept",
        "pan",
        "open",
        "instead",
        "feature",
        "one",
        "conception",
        "pan",
        "one",
        "conception",
        "open",
        "thing",
        "defender",
        "embodied",
        "concept",
        "might",
        "investigating",
        "concept",
        "instead",
        "conceptionsonly",
        "feature",
        "associated",
        "conceptsit",
        "may",
        "motor",
        "activity",
        "accompanies",
        "thought",
        "concept",
        "contribute",
        "meaning",
        "concept",
        "instead",
        "associated",
        "concept",
        "psychologist",
        "mahon",
        "caramazza",
        "argue",
        "way",
        "interpreting",
        "neurological",
        "study",
        "taken",
        "support",
        "embodied",
        "concept",
        "finding",
        "exposure",
        "word",
        "kick",
        "cause",
        "activity",
        "motor",
        "area",
        "brain",
        "responsible",
        "kicking",
        "show",
        "kick",
        "modal",
        "concept",
        "mahon",
        "caramazza",
        "suggest",
        "linguistic",
        "processing",
        "word",
        "might",
        "create",
        "cascade",
        "activity",
        "flow",
        "area",
        "brain",
        "associated",
        "meaning",
        "word",
        "thought",
        "kick",
        "associated",
        "thought",
        "moving",
        "one",
        "leg",
        "turn",
        "cause",
        "activity",
        "motor",
        "system",
        "motivation",
        "regarding",
        "activity",
        "part",
        "kick",
        "conceptno",
        "motivation",
        "seeing",
        "evidence",
        "modality",
        "concept",
        "mahon",
        "thinking",
        "kick",
        "cause",
        "one",
        "think",
        "moving",
        "one",
        "leg",
        "cause",
        "activity",
        "motor",
        "cortex",
        "meaning",
        "kick",
        "independent",
        "activity",
        "finally",
        "even",
        "granting",
        "modality",
        "concept",
        "like",
        "pan",
        "kick",
        "one",
        "might",
        "question",
        "whether",
        "concept",
        "embodied",
        "embodied",
        "cognition",
        "researcher",
        "suggest",
        "barsalou",
        "special",
        "concern",
        "abstract",
        "concept",
        "like",
        "democracy",
        "justice",
        "morality",
        "dove",
        "unlike",
        "pan",
        "meaning",
        "might",
        "involve",
        "information",
        "sensory",
        "motor",
        "system",
        "sensory",
        "motor",
        "activity",
        "might",
        "included",
        "meaning",
        "justice",
        "barsalou",
        "barsalou",
        "wiemerhastings",
        "offer",
        "account",
        "abstract",
        "concept",
        "might",
        "analyzed",
        "modal",
        "term",
        "debate",
        "issue",
        "far",
        "settled"
    ]
}