{
    "main_text": "Empathy, Moral Philosophy, and Moral Psychology || Empathy, Its Partiality, Susceptibility to Bias, and Moral Agency\n5.2 Empathy, Its Partiality, Susceptibility to Bias, and Moral Agency\n\nWithin the psychological literature, one of the most comprehensive\naccounts of empathy and its relation to the moral development of a\nperson is provided by the work of Martin Hoffman (for a summary see\nhis 2000). Hoffman views empathy as a biologically based disposition\nfor altruistic behavior (Hoffman 1981). He conceives of empathy as\nbeing due to various modes of arousal allowing us to respond\nempathically in light of a variety of distress cues from another\nperson. Hoffman mentions mimicry, classical conditioning, and direct\nassociation—where one empathizes because the other’s\nsituation reminds one of one’s own painful experience—as\n“fast acting and automatic” mechanisms producing an\nempathic response. As more cognitively demanding modes, Hoffman lists\nmediated association—where the cues for an empathic response are\nprovided in a linguistic medium—and role taking.\n\nHoffman distinguishes between six (or more) developmental stages of\nempathic responses ranging from the reactive newborn cry, egocentric\nempathic distress, quasi-ego-centric empathic distress, to veridical\nempathy, empathy for another beyond the immediate situation, and\nempathy for whole groups of people. Accordingly, empathic responses\nconstitute a developmental continuum that ranges from emotional\ncontagion (as in the case of a reactive newborn cry) to various forms\nof proper empathy reached at the fourth stage. At the developmentally\nlater stages, the child is able to emotionally respond to the distress\nof another in a more sophisticated manner due to an increase of\ncognitive capacities, particularly due to the increased cognitive\nability to distinguish between self and other and by becoming aware of\nthe fact that others have mental states that are independent from its\nown. Only at the fourth stage of empathic development (after the\nmiddle of the second year) do children acquire such abilities. They do\nno longer try to comfort themselves, when emotionally responding to\nanother child’s distress—like seeking comfort from their\nown mother—, or use helping strategies that are more appropriate\nto comfort themselves than the other person—like using their own\nteddy-bear in trying to comfort the other child. Only at the fourth\nstage does empathy become also transformed or associated with sympathy\nleading to appropriate prosocial behavior. Hoffman’s\ndevelopmental view is further supported by Preston and DeWaal’s\naccount of empathy as a phenomenon to be observed across species at\nvarious levels of complexities related to different degrees of\ncognitive development. (Preston and DeWaal 2002a,b. For a discussion\nof the philosophical relevance of DeWaal’s view see also DeWaal\n2006).\n\nSignificantly, Hoffman combines his developmental explication of\nempathy with a sophisticated analysis of its importance for moral\nagency. He is thereby acutely aware of the limitations in our natural\ncapacity to empathize or sympathize with others, particularly what he\nrefers to as “here and now” biases, that is, the fact that\nwe tend to empathize more with persons that are in some sense\nperceived to be closer to us. (For a neuro-scientific investigation of\nhow racial bias modulates empathic responses see Xuo, Zuo, Wang and\nHan 2009). Like Batson, Hoffman does not regard the moral realm as\nbeing exclusively circumscribed by our ability to empathize with other\npeople. Besides empathic abilities, moral agency requires also\nknowledge of abstract moral principles, such as the principles of\ncaring and justice. Hoffman seems to conceive of those principles as\nbeing derived from cognitive sources that are independent from our\nempathic abilities. Yet Hoffmann is rather optimistic about the\nnatural compatibility of empathic motivation and our commitment to\nmoral principles. He regards stable and effective moral agency as\nrequiring empathy so that moral principles can have a motivational\nbasis in an agent’s psychology. Within this context, he has\nlately emphasized a final stage of empathy development or what he\ncalls “witnessing”, an empathic response to the suffering\nof others that is so intense that we “become fully committed to\nhelp”(Hoffman 2014, 82). As he explains—in light of\nexamples from the history of abolitionism, the civil rights movement,\nserfdom reform in Russia, and various cases before the Supreme\nCourt— it is particularly such witnessing that has contributed\ntowards bending the arc of the moral universe towards justice.\nAccordingly, and despite our natural limitations in empathizing with\nothers, Hoffman still regards empathy as the “bedrock of\nmorality” and “the glue of society”(Hoffman 2014,\n96. Besides Hoffman 2011 and 2014, see also Deigh 2011 for a measured\nevaluation of empathy in the legal context ). \n\nMore recently, such ultimately positive evaluation of empathy’s\ncontributing role in constituting us as moral agents, as agents who\naddress each other from the moral stance, has encountered penetrating\ncriticism, particularly by Prinz (2011a,b) and Bloom (2016). Both\nemphasize the dark side of empathy, that is, the aforementioned\n“here and now” biases. More specifically Prinz mentions\nexplicitly the cuteness, salience, and proximity effects—the\nfact that we tend to empathize more easily with attractive persons,\nwith persons that are in close proximity and only if their suffering\nis particularly noteworthy— similarity biases and the fact that\nwe tend to be rather selective in choosing whom to empathize with.\nEmpathy is also very easily modulated by a variety of top-down factors\nthat influence our perception of the social world and that let us\nregister social divisions that seem to be prima facie incompatible\nwith the more impartial stance demanded by the moral perspective.\nResearch has documented these biases in a more fine-grained manner and\nshown that subjects generally “reported experiencing more\nempathy for the in–group then the out–group targets and\nmore counter–empathy for the out–group than in–group\ntargets”(Cikara et. al. 2014, 120), counter–empathy here\nbeing understood as the feeling of pleasure at the misfortune of\nanother (Schadenfreude) or the feeling displeasure at something\nfortunate happening to another (Glückschmerz). This is\nparticularly true if the other group is viewed to be in competition\nwith one’s own group. Empathy can also be further reduced\nthrough various dehumanizing and objectifying strategies, strategies\nthat have certainly employed in the context of the genocides of the\ntwentieth century and the system of racial slavery in the United\nStates (See Fuchs 2019, Kteily and Bruneau 2017). Heightened empathy\nfor perceived wrongs done to members of the in–group can also\nlead to violent and immoral behavior (Bloom 2016, chap. 5). In\naddition, empathy tends to focus on the one (particularly if he or she\nis identifiable) rather than the many, what Bloom refers to as its\nspotlight feature. Empathy can mislead us particularly in contexts\nwhere we need to take into account statistically relevant information\nwhen addressing a moral or social problem, such as when thinking about\nthe benefits of vaccination where it is more appropriate to think\nabout the large numbers of children saved rather than empathizing with\nthe bad effects such vaccination might have on one specific child. For\nall of these reasons, Prinz favors the moral emotions such as anger,\nguilt and shame as the foundation for morality, while Bloom prefers\nsympathy guided by reason as a more viable means than empathy to steer\nus in moral matters.\n\nHere is not the place for a final evaluation of empathy’s\ncontribution in regard to pro-social and moral motivation or moral and\npro-social behavior, since this question is still very much the topic\nof an ongoing empirical investigation. Yet the following observations\nare certainly justified in light of the empirical evidence so far and\nmight help to further clarify the debate. First, it seems to be pretty\nwell established that however one defines our natural capacity for\nempathy, it is on its own not sufficient to keep us reliably on the\npath of morality (See also Decety and Cowell 2015). Whether that\nultimately means that we should think of our capacity for empathy as a\nlimited resource or whether it would be better to think of empathy as\na motivated phenomenon and its limitations as being due to our\nreluctance to activate that capacity (Zaki 2014), is certainly another\nintriguing question for further empirical inquiry. One might also\nwonder why we should expect that the emotions such as sympathy and\nanger, which Bloom and Prinz point to, are less prone to bias and less\naffected by a universal human tendency to favor the in–group.\nCertainly sympathy within the context of Buddhism, to which Bloom\nappeals to is a highly regulated emotion, controlled through\nmindfulness practices or meditation and guided by an intellectual\ngrasp about the detriments of various forms of attachment to this\nworld. Persson and Savulescu (2018) therefore suggest that rather than\ngiving up on empathy completely one should reform empathy by\nregulating it through one’s reflective capacities in light of\nour knowledge of its natural shortcomings or focus one’s empathy\n(cognitive and affective) particularly on another person’s\nconcerns for his or her well-being as such empathy includes sympathy\nfor the other (Simmons 2014). Such suggestions are also very much in\nline with proposals by David Hume and Adam Smith, who suggested\nalready in the eighteenth century that we need to regulate empathy\nwith the help of certain corrective mechanisms such as “some\nsteady and general points of view” or the perspective of\nthe“impartial spectator” in order to compensate for\nempathy’s limited scope. (For a good analysis of the\nphilosophical discussion about empathy/sympathy in the eighteenth\ncentury see Frazer 2010). \n\nMost importantly, in order to evaluate the empirical discussion about\nempathy’s role for morality, one needs to be very sensitive to\nhow researchers define and measure empathy in arguing for and against\nempathy’s relation to moral motivation or moral judgment. Prinz\nand Bloom are quite explicit in defining empathy merely as an\naffective phenomenon, as our ability to feel what the other person\nfeels. Evidence suggests indeed that merely sharing another\nperson’s emotion empathically does not increase our concern or\nmotivation for moral or pro-social action. Interestingly, however,\nperspective–taking and empathic concern/sympathy, which have\nalways been seen as an integral part of empathy-related phenomena, are\na slightly different matter. They do seem to be positively related to\ncooperation and charitable giving (Jordon et. al. 2016), to reducing\nprejudices against particular groups (Galinski and Morowitz 2011), and\nto an increase in one’s sensitivity to injustices done to others\n(Decety and Yoder 2015). Yet even here further research is needed as\nthe effects of such perspective–taking could be modulated by the\npower differential between groups. It has, for example, been shown\nthat in active intergroup conflicts, positive intergroup interaction\ncan increase empathy for the other group. Yet within such contexts,\ntaking the perspective of a person from the other group while\ninteracting with them might also hinder the development of intergroup\nempathy if the dominant group is reminded through such\nperspective–taking of how they might be viewed by the\nnon-dominant group. Even perspective taking by the non–dominant\ngroup might increase rather than decrease established negative\nstereotypes in thinking about the other group (Cikara et. al. 2014).\nIt seems more effective if the non–dominant group is asked to\narticulate the difficulties of their lives (perspective–giving)\nand the dominant group is asked to translate that description into\ntheir own words (perspective–taking), even if the positive\neffects of such interaction is relatively short-lived (Bruneau and\nSaxe 2012). \n",
    "section_title": "5.2 Empathy, Its Partiality, Susceptibility to Bias, and Moral Agency",
    "entry_title": "Empathy",
    "hierarchy_title": "Empathy || Empathy, Moral Philosophy, and Moral Psychology || Empathy, Its Partiality, Susceptibility to Bias, and Moral Agency",
    "tokenized_text": [
        "empathy",
        "moral",
        "philosophy",
        "moral",
        "psychology",
        "empathy",
        "partiality",
        "susceptibility",
        "bias",
        "moral",
        "agency",
        "empathy",
        "partiality",
        "susceptibility",
        "bias",
        "moral",
        "agency",
        "within",
        "psychological",
        "literature",
        "one",
        "comprehensive",
        "account",
        "empathy",
        "relation",
        "moral",
        "development",
        "person",
        "provided",
        "work",
        "martin",
        "hoffman",
        "summary",
        "see",
        "hoffman",
        "view",
        "empathy",
        "biologically",
        "based",
        "disposition",
        "altruistic",
        "behavior",
        "hoffman",
        "conceives",
        "empathy",
        "due",
        "various",
        "mode",
        "arousal",
        "allowing",
        "u",
        "respond",
        "empathically",
        "light",
        "variety",
        "distress",
        "cue",
        "another",
        "person",
        "hoffman",
        "mention",
        "mimicry",
        "classical",
        "conditioning",
        "direct",
        "associationwhere",
        "one",
        "empathizes",
        "situation",
        "reminds",
        "one",
        "one",
        "painful",
        "experienceas",
        "fast",
        "acting",
        "automatic",
        "mechanism",
        "producing",
        "empathic",
        "response",
        "cognitively",
        "demanding",
        "mode",
        "hoffman",
        "list",
        "mediated",
        "associationwhere",
        "cue",
        "empathic",
        "response",
        "provided",
        "linguistic",
        "mediumand",
        "role",
        "taking",
        "hoffman",
        "distinguishes",
        "six",
        "developmental",
        "stage",
        "empathic",
        "response",
        "ranging",
        "reactive",
        "newborn",
        "cry",
        "egocentric",
        "empathic",
        "distress",
        "quasiegocentric",
        "empathic",
        "distress",
        "veridical",
        "empathy",
        "empathy",
        "another",
        "beyond",
        "immediate",
        "situation",
        "empathy",
        "whole",
        "group",
        "people",
        "accordingly",
        "empathic",
        "response",
        "constitute",
        "developmental",
        "continuum",
        "range",
        "emotional",
        "contagion",
        "case",
        "reactive",
        "newborn",
        "cry",
        "various",
        "form",
        "proper",
        "empathy",
        "reached",
        "fourth",
        "stage",
        "developmentally",
        "later",
        "stage",
        "child",
        "able",
        "emotionally",
        "respond",
        "distress",
        "another",
        "sophisticated",
        "manner",
        "due",
        "increase",
        "cognitive",
        "capacity",
        "particularly",
        "due",
        "increased",
        "cognitive",
        "ability",
        "distinguish",
        "self",
        "becoming",
        "aware",
        "fact",
        "others",
        "mental",
        "state",
        "independent",
        "fourth",
        "stage",
        "empathic",
        "development",
        "middle",
        "second",
        "year",
        "child",
        "acquire",
        "ability",
        "longer",
        "try",
        "comfort",
        "emotionally",
        "responding",
        "another",
        "child",
        "distresslike",
        "seeking",
        "comfort",
        "mother",
        "use",
        "helping",
        "strategy",
        "appropriate",
        "comfort",
        "personlike",
        "using",
        "teddybear",
        "trying",
        "comfort",
        "child",
        "fourth",
        "stage",
        "empathy",
        "become",
        "also",
        "transformed",
        "associated",
        "sympathy",
        "leading",
        "appropriate",
        "prosocial",
        "behavior",
        "hoffman",
        "developmental",
        "view",
        "supported",
        "preston",
        "dewaal",
        "account",
        "empathy",
        "phenomenon",
        "observed",
        "across",
        "specie",
        "various",
        "level",
        "complexity",
        "related",
        "different",
        "degree",
        "cognitive",
        "development",
        "preston",
        "dewaal",
        "a",
        "b",
        "discussion",
        "philosophical",
        "relevance",
        "dewaal",
        "view",
        "see",
        "also",
        "dewaal",
        "significantly",
        "hoffman",
        "combine",
        "developmental",
        "explication",
        "empathy",
        "sophisticated",
        "analysis",
        "importance",
        "moral",
        "agency",
        "thereby",
        "acutely",
        "aware",
        "limitation",
        "natural",
        "capacity",
        "empathize",
        "sympathize",
        "others",
        "particularly",
        "refers",
        "bias",
        "fact",
        "tend",
        "empathize",
        "person",
        "sense",
        "perceived",
        "closer",
        "u",
        "neuroscientific",
        "investigation",
        "racial",
        "bias",
        "modulates",
        "empathic",
        "response",
        "see",
        "xuo",
        "zuo",
        "wang",
        "han",
        "like",
        "batson",
        "hoffman",
        "regard",
        "moral",
        "realm",
        "exclusively",
        "circumscribed",
        "ability",
        "empathize",
        "people",
        "besides",
        "empathic",
        "ability",
        "moral",
        "agency",
        "requires",
        "also",
        "knowledge",
        "abstract",
        "moral",
        "principle",
        "principle",
        "caring",
        "justice",
        "hoffman",
        "seems",
        "conceive",
        "principle",
        "derived",
        "cognitive",
        "source",
        "independent",
        "empathic",
        "ability",
        "yet",
        "hoffmann",
        "rather",
        "optimistic",
        "natural",
        "compatibility",
        "empathic",
        "motivation",
        "commitment",
        "moral",
        "principle",
        "regard",
        "stable",
        "effective",
        "moral",
        "agency",
        "requiring",
        "empathy",
        "moral",
        "principle",
        "motivational",
        "basis",
        "agent",
        "psychology",
        "within",
        "context",
        "lately",
        "emphasized",
        "final",
        "stage",
        "empathy",
        "development",
        "call",
        "witnessing",
        "empathic",
        "response",
        "suffering",
        "others",
        "intense",
        "become",
        "fully",
        "committed",
        "help",
        "hoffman",
        "explainsin",
        "light",
        "example",
        "history",
        "abolitionism",
        "civil",
        "right",
        "movement",
        "serfdom",
        "reform",
        "russia",
        "various",
        "case",
        "supreme",
        "court",
        "particularly",
        "witnessing",
        "contributed",
        "towards",
        "bending",
        "arc",
        "moral",
        "universe",
        "towards",
        "justice",
        "accordingly",
        "despite",
        "natural",
        "limitation",
        "empathizing",
        "others",
        "hoffman",
        "still",
        "regard",
        "empathy",
        "bedrock",
        "morality",
        "glue",
        "society",
        "hoffman",
        "besides",
        "hoffman",
        "see",
        "also",
        "deigh",
        "measured",
        "evaluation",
        "empathy",
        "legal",
        "context",
        "recently",
        "ultimately",
        "positive",
        "evaluation",
        "empathy",
        "contributing",
        "role",
        "constituting",
        "u",
        "moral",
        "agent",
        "agent",
        "address",
        "moral",
        "stance",
        "encountered",
        "penetrating",
        "criticism",
        "particularly",
        "prinz",
        "a",
        "b",
        "bloom",
        "emphasize",
        "dark",
        "side",
        "empathy",
        "aforementioned",
        "bias",
        "specifically",
        "prinz",
        "mention",
        "explicitly",
        "cuteness",
        "salience",
        "proximity",
        "effectsthe",
        "fact",
        "tend",
        "empathize",
        "easily",
        "attractive",
        "person",
        "person",
        "close",
        "proximity",
        "suffering",
        "particularly",
        "noteworthy",
        "similarity",
        "bias",
        "fact",
        "tend",
        "rather",
        "selective",
        "choosing",
        "empathize",
        "empathy",
        "also",
        "easily",
        "modulated",
        "variety",
        "topdown",
        "factor",
        "influence",
        "perception",
        "social",
        "world",
        "let",
        "u",
        "register",
        "social",
        "division",
        "seem",
        "prima",
        "facie",
        "incompatible",
        "impartial",
        "stance",
        "demanded",
        "moral",
        "perspective",
        "research",
        "documented",
        "bias",
        "finegrained",
        "manner",
        "shown",
        "subject",
        "generally",
        "reported",
        "experiencing",
        "empathy",
        "ingroup",
        "outgroup",
        "target",
        "counterempathy",
        "outgroup",
        "ingroup",
        "target",
        "cikara",
        "et",
        "al",
        "counterempathy",
        "understood",
        "feeling",
        "pleasure",
        "misfortune",
        "another",
        "schadenfreude",
        "feeling",
        "displeasure",
        "something",
        "fortunate",
        "happening",
        "another",
        "glückschmerz",
        "particularly",
        "true",
        "group",
        "viewed",
        "competition",
        "one",
        "group",
        "empathy",
        "also",
        "reduced",
        "various",
        "dehumanizing",
        "objectifying",
        "strategy",
        "strategy",
        "certainly",
        "employed",
        "context",
        "genocide",
        "twentieth",
        "century",
        "system",
        "racial",
        "slavery",
        "united",
        "state",
        "see",
        "fuchs",
        "kteily",
        "bruneau",
        "heightened",
        "empathy",
        "perceived",
        "wrong",
        "done",
        "member",
        "ingroup",
        "also",
        "lead",
        "violent",
        "immoral",
        "behavior",
        "bloom",
        "chap",
        "addition",
        "empathy",
        "tends",
        "focus",
        "one",
        "particularly",
        "identifiable",
        "rather",
        "many",
        "bloom",
        "refers",
        "spotlight",
        "feature",
        "empathy",
        "mislead",
        "u",
        "particularly",
        "context",
        "need",
        "take",
        "account",
        "statistically",
        "relevant",
        "information",
        "addressing",
        "moral",
        "social",
        "problem",
        "thinking",
        "benefit",
        "vaccination",
        "appropriate",
        "think",
        "large",
        "number",
        "child",
        "saved",
        "rather",
        "empathizing",
        "bad",
        "effect",
        "vaccination",
        "might",
        "one",
        "specific",
        "child",
        "reason",
        "prinz",
        "favor",
        "moral",
        "emotion",
        "anger",
        "guilt",
        "shame",
        "foundation",
        "morality",
        "bloom",
        "prefers",
        "sympathy",
        "guided",
        "reason",
        "viable",
        "mean",
        "empathy",
        "steer",
        "u",
        "moral",
        "matter",
        "place",
        "final",
        "evaluation",
        "empathy",
        "contribution",
        "regard",
        "prosocial",
        "moral",
        "motivation",
        "moral",
        "prosocial",
        "behavior",
        "since",
        "question",
        "still",
        "much",
        "topic",
        "ongoing",
        "empirical",
        "investigation",
        "yet",
        "following",
        "observation",
        "certainly",
        "justified",
        "light",
        "empirical",
        "evidence",
        "far",
        "might",
        "help",
        "clarify",
        "debate",
        "first",
        "seems",
        "pretty",
        "well",
        "established",
        "however",
        "one",
        "defines",
        "natural",
        "capacity",
        "empathy",
        "sufficient",
        "keep",
        "u",
        "reliably",
        "path",
        "morality",
        "see",
        "also",
        "decety",
        "cowell",
        "whether",
        "ultimately",
        "mean",
        "think",
        "capacity",
        "empathy",
        "limited",
        "resource",
        "whether",
        "would",
        "better",
        "think",
        "empathy",
        "motivated",
        "phenomenon",
        "limitation",
        "due",
        "reluctance",
        "activate",
        "capacity",
        "zaki",
        "certainly",
        "another",
        "intriguing",
        "question",
        "empirical",
        "inquiry",
        "one",
        "might",
        "also",
        "wonder",
        "expect",
        "emotion",
        "sympathy",
        "anger",
        "bloom",
        "prinz",
        "point",
        "le",
        "prone",
        "bias",
        "le",
        "affected",
        "universal",
        "human",
        "tendency",
        "favor",
        "ingroup",
        "certainly",
        "sympathy",
        "within",
        "context",
        "buddhism",
        "bloom",
        "appeal",
        "highly",
        "regulated",
        "emotion",
        "controlled",
        "mindfulness",
        "practice",
        "meditation",
        "guided",
        "intellectual",
        "grasp",
        "detriment",
        "various",
        "form",
        "attachment",
        "world",
        "persson",
        "savulescu",
        "therefore",
        "suggest",
        "rather",
        "giving",
        "empathy",
        "completely",
        "one",
        "reform",
        "empathy",
        "regulating",
        "one",
        "reflective",
        "capacity",
        "light",
        "knowledge",
        "natural",
        "shortcoming",
        "focus",
        "one",
        "empathy",
        "cognitive",
        "affective",
        "particularly",
        "another",
        "person",
        "concern",
        "wellbeing",
        "empathy",
        "includes",
        "sympathy",
        "simmons",
        "suggestion",
        "also",
        "much",
        "line",
        "proposal",
        "david",
        "hume",
        "adam",
        "smith",
        "suggested",
        "already",
        "eighteenth",
        "century",
        "need",
        "regulate",
        "empathy",
        "help",
        "certain",
        "corrective",
        "mechanism",
        "steady",
        "general",
        "point",
        "view",
        "perspective",
        "impartial",
        "spectator",
        "order",
        "compensate",
        "empathy",
        "limited",
        "scope",
        "good",
        "analysis",
        "philosophical",
        "discussion",
        "empathysympathy",
        "eighteenth",
        "century",
        "see",
        "frazer",
        "importantly",
        "order",
        "evaluate",
        "empirical",
        "discussion",
        "empathy",
        "role",
        "morality",
        "one",
        "need",
        "sensitive",
        "researcher",
        "define",
        "measure",
        "empathy",
        "arguing",
        "empathy",
        "relation",
        "moral",
        "motivation",
        "moral",
        "judgment",
        "prinz",
        "bloom",
        "quite",
        "explicit",
        "defining",
        "empathy",
        "merely",
        "affective",
        "phenomenon",
        "ability",
        "feel",
        "person",
        "feel",
        "evidence",
        "suggests",
        "indeed",
        "merely",
        "sharing",
        "another",
        "person",
        "emotion",
        "empathically",
        "increase",
        "concern",
        "motivation",
        "moral",
        "prosocial",
        "action",
        "interestingly",
        "however",
        "perspectivetaking",
        "empathic",
        "concernsympathy",
        "always",
        "seen",
        "integral",
        "part",
        "empathyrelated",
        "phenomenon",
        "slightly",
        "different",
        "matter",
        "seem",
        "positively",
        "related",
        "cooperation",
        "charitable",
        "giving",
        "jordon",
        "et",
        "al",
        "reducing",
        "prejudice",
        "particular",
        "group",
        "galinski",
        "morowitz",
        "increase",
        "one",
        "sensitivity",
        "injustice",
        "done",
        "others",
        "decety",
        "yoder",
        "yet",
        "even",
        "research",
        "needed",
        "effect",
        "perspectivetaking",
        "could",
        "modulated",
        "power",
        "differential",
        "group",
        "example",
        "shown",
        "active",
        "intergroup",
        "conflict",
        "positive",
        "intergroup",
        "interaction",
        "increase",
        "empathy",
        "group",
        "yet",
        "within",
        "context",
        "taking",
        "perspective",
        "person",
        "group",
        "interacting",
        "might",
        "also",
        "hinder",
        "development",
        "intergroup",
        "empathy",
        "dominant",
        "group",
        "reminded",
        "perspectivetaking",
        "might",
        "viewed",
        "nondominant",
        "group",
        "even",
        "perspective",
        "taking",
        "nondominant",
        "group",
        "might",
        "increase",
        "rather",
        "decrease",
        "established",
        "negative",
        "stereotype",
        "thinking",
        "group",
        "cikara",
        "et",
        "al",
        "seems",
        "effective",
        "nondominant",
        "group",
        "asked",
        "articulate",
        "difficulty",
        "life",
        "perspectivegiving",
        "dominant",
        "group",
        "asked",
        "translate",
        "description",
        "word",
        "perspectivetaking",
        "even",
        "positive",
        "effect",
        "interaction",
        "relatively",
        "shortlived",
        "bruneau",
        "saxe"
    ]
}