{
    "main_text": "Empathy as a Topic of Scientific Exploration in Psychology\n4. Empathy as a Topic of Scientific Exploration in Psychology\n\nThe discussion of empathy within psychology has been largely\nunaffected by the critical philosophical discussion of empathy as an\nepistemic means to know other minds or as the unique method of the\nhuman sciences. Rather, psychologists’ interest in\nempathy–related phenomena harks back to eighteenth century moral\nphilosophy, particularly David Hume and Adam Smith (See also Wispe\n1991). Here empathy, or what was then called sympathy, was regarded to\nplay a central role in constituting human beings as social and moral\ncreatures allowing us to emotionally connect to our human companions\nand care for their well-being. Throughout the early 20th\ncentury, but particularly since the late 1940’s, empathy has,\ntherefore, been an intensively studied topic of psychological\nresearch.\n\nMore broadly one can distinguish two psychological research traditions\nstudying empathy–related phenomena; that is, the study of what\nis currently called empathic accuracy and the study of empathy as an\nemotional phenomenon in the encounter of others. The first area of\nstudy defines empathy primarily as a cognitive phenomenon and\nconceives of empathy in general terms as “the intellectual or\nimaginative apprehension of another’s condition or state of\nmind,” to use Hogan’s (1969) terminology. Within this area\nof research, one is primarily interested in determining the\nreliability and accuracy of our ability to perceive and recognize\nother persons’ enduring personality traits, attitudes and\nvalues, and occurrent mental states. One also investigates the various\nfactors that influence empathic accuracy. One has, for example, been\ninterested in determining whether empathic ability depends on gender,\nage, family background, intelligence, emotional stability, the nature\nof interpersonal relations, or whether it depends on specific\nmotivations of the observer. (For a survey see Ickes 1993 and 2003;\nand Taft 1955). A more detailed account of the research on empathic\naccuracy and some of its earlier methodological difficulties can be\nfound in the\n\nSupplementary document on the Study of Cognitive Empathy and Empathic Accuracy.\n \n\nPhilosophically more influential has been the study of empathy defined\nprimarily as an emotional or affective phenomenon, which psychologists\nin the middle of the 1950’s started to focus on. In this\ncontext, psychologists have also addressed issues of moral motivation\nthat have been traditionally topics of intense discussions among moral\nphilosophers. They were particularly interested in investigating (i)\nthe development of various means for measuring empathy as a\ndispositional trait of adults and of children and as a situational\nresponse in specific situations, (ii) the factors on which empathic\nresponses and dispositions depend, and (iii) the relation between\nempathy and pro-social behavior and moral development. Before\ndiscussing the psychological research on emotional empathy and its\nrelevance for moral philosophy and moral psychology in the next\nsection, it is vital to introduce important conceptual distinctions\nthat one should keep in mind in evaluating the various empirical\nstudies.\n\nAnyone reading the emotional empathy literature has to be struck by\nthe fact that empathy tended to be incredibly broadly defined in the\nbeginning of this specific research tradition. Stotland, one of the\nearliest researcher who understood empathy exclusively as an emotional\nphenomenon, defined it as “an observer’s reacting\nemotionally because he perceives that another is experiencing or is\nabout to experience an emotion” (1969, 272). According to\nStotland’s definition very diverse emotional responses such as\nfeeling envy, feeling annoyed, feeling distressed, being relieved\nabout, feeling pity, or feeling what Germans call\nSchadenfreude (feeling joyful about the misfortune of\nanother) have all to be counted as empathic reactions. Since the\n1980’s however, psychologists have fine tuned their\nunderstanding of empathy conceptually and distinguished between\ndifferent aspects of the emotional reaction to another person; thereby\nimplicitly acknowledging the conceptual distinctions articulated by\nMax Scheler (1973) almost a century earlier. In this context, it is\nparticularly useful to distinguish between the following reactive\nemotions that are differentiated in respect to whether or not such\nreactions are self or other oriented and whether they presuppose\nawareness of the distinction between self and others. (See also the\nsurvey in the Introduction to Eisenberg/Strayer 1987 and\nBatson 2009) \n\n\n\nEmotional contagion: Emotional contagion occurs when\npeople start feeling similar emotions caused merely by the association\nwith other people. You start feeling joyful, because other people\naround you are joyful or you start feeling panicky because you are in\na crowd of people feeling panic. Emotional contagion however does not\nrequire that one is aware of the fact that one experiences the\nemotions because other people experience them, rather one experiences\nthem primarily as one’s own emotion (Scheler 1973, 22). A\nnewborn infant’s reactive cry to the distress cry of another,\nwhich Hoffman takes as a “rudimentary precursor of empathic\ndistress” (Hoffman 2000, 65), can probably be understood as a\nphenomenon of emotional contagion, since the infant is not able to\nproperly distinguish between self and other.\n\n\nAffective and proper Empathy: More narrowly and\nproperly understood, empathy in the affective sense is the vicarious\nsharing of an affect. Authors however differ in how strictly they\ninterpret the phrase of vicariously sharing an affect. For some, it\nrequires that the empathizers and the persons they empathize with need\nto be in very similar affective states (Coplan 2011; de Vignemont and\nSinger 2006; Jacob 2011). For Hoffman, on the other hand, it is an\nemotional response requiring only “the involvement of\npsychological processes that make a person have feelings that are more\ncongruent with another’s situation than with his own\nsituation” (Hoffman 2000, 30). According to this definition,\nempathy does not necessarily require that the subject and target feel\nsimilar emotions (even though this is most often the case). Rather the\ndefinition also includes cases of feeling sad when seeing a child who\nplays joyfully but who does not know that it has been diagnosed with a\nserious illness (assuming that this is how the other person himself or\nherself would feel if he or she would fully understand his or her\nsituation). In contrast to mere emotional contagion, genuine empathy\npresupposes the ability to differentiate between oneself and the\nother. It requires that one is minimally aware of the fact that one is\nhaving an emotional experience due to the perception of the\nother’s emotion, or more generally due to attending to his\nsituation. In seeing a sad face of another and feeling sad oneself,\nsuch feeling of sadness should count as genuinely empathic only if one\nrecognizes that in feeling sad one’s attention is still focused\non the other and that it is not an appropriate reaction to aspects of\none’s own life. Moreover, empathy outside the realm of a direct\nperceptual encounter involves some appreciation of the other\nperson’s emotion as an appropriate response to his or her\nsituation. To be happy or unhappy because one’s child is happy\nor sad should not count necessarily as an empathic emotion. It cannot\ncount as a vicarious emotional response if it is due to the perception\nof the outside world from the perspective of the observer and her\ndesire that her children should be happy. My happiness about my child\nbeing happy would therefore not be an emotional state that is more\ncongruent to his situation. Rather, it is an emotional response\nappropriate to my own perspective on the world. In order for my\nhappiness or unhappiness to be genuinely empathic it has to be\nhappiness or unhappiness about what makes the other person happy.\nAccordingly, if I share another person’s emotion vicariously I\ndo not merely have to be in an affective state with a similar\nphenomenal quality. Rather my affective state has to be directed\ntoward the same intentional object. (See Sober and Wilson 1998,\n231–237 and Maibom 2007. For a critical discussion of how and\nwhether such vicarious sharing is possible see also Deonna 2007 and\nMatravers 2018). It should be noted, however, that some authors\nconceive of proper empathy more broadly as not merely being concerned\nwith the vicarious reenactment of affective states but more\ncomprehensively as including non-affective states such as beliefs and\ndesires. This is especially true if they are influenced by the\ndiscussion of of empathy as an epistemic means such as Goldman (2011)\nand Stueber (2006). However, already Adam Smith (1853) constitutes a\ngood example for such broad understanding of proper empathy. Finally,\nothers suggest that it is best to distinguish between affective\nsharing and perspective taking (Decety and Cowell 2015). \n\n\nSympathy: In contrast to affective empathy,\nsympathy—or what some authors also refer to as empathic\nconcern—is not an emotion that is congruent with the\nother’s emotion or situation such as feeling the sadness of the\nother person’s grieving for the death of his father. Rather,\nsympathy is seen as an emotion sui generis that has the\nother’s negative emotion or situation as its object from the\nperspective of somebody who cares for the other person’s well\nbeing (Darwall 1998). In this sense, sympathy consists of\n“feeling sorrow or concern for the distressed or needy\nother,” a feeling for the other out of a “heightened\nawareness of the suffering of another person as something that needs\nto be alleviated.” (Eisenberg 2000a, 678; Wispe 1986, 318; and\nWispe 1991).\n\nWhereas it is quite plausible to assume that empathy—that is,\nempathy with negative emotions of another or what Hoffman (2000) calls\n“veridical empathic distress”—under certain\nconditions (and when certain developmental markers are achieved) can\ngive rise to sympathy, it should be stressed that the relation between\naffective empathy and sympathy is a contingent one; the understanding\nof which requires further empirical research. First, sympathy does not\nnecessarily require feeling any kind of congruent emotions on part of\nthe observer, a detached recognition or representation that the other\nis in need or suffers might be sufficient. (See Scheler 1973 and\nNichols 2004). Second, empathy or empathic distress might not at all\nlead to sympathy. People in the helping professions, who are so\naccustomed to the misery of others, suffer at times from compassion\nfatigue. It is also possible to experience empathic overarousal\nbecause one is emotionally so overwhelmed by one’s empathic\nfeelings that one is unable to be concerned with the suffering of the\nother (Hoffman 2000, chap. 8). In the later case, one’s empathic\nfeeling are transformed or give rise to mere personal distress, a\nreactive emotional phenomenon that needs to be distinguished from\nemotional contagion, empathy, and sympathy.\n\n\nPersonal Distress: Personal distress in the context\nof empathy research is understood as a reactive emotion in response to\nthe perception/recognition of another’s negative emotion or\nsituation. Yet, while personal distress is other-caused like\nsympathy, it is, in contrast to sympathy, primarily\nself-oriented. In this case, another person’s distress\ndoes not make me feel bad for him or her, it just makes\nme feel bad, or “alarmed, grieved, upset, worried,\ndisturbed, perturbed, distressed,and troubled;” to use the list\nof adjectives that according to Batson’s research indicates\npersonal distress (Batson et al. 1987 and Batson 1991). And, in\ncontrast to empathic emotions as defined above, my personal distress\nis not any more congruent with the emotion or situation of another.\nRather it wholly defines my own outlook onto the world. \n\n\nWhile it is conceptually necessary to differentiate between these\nvarious emotional responses, it has to be admitted that it is\nempirically not very easy to discriminate between them, since they\ntend to occur together. Think or imagine yourself attending the\nfuneral of the child of a friend or good acquaintance. This is\nprobably one reason why early researchers tended not to distinguish\nbetween the above aspects in their study of empathy related phenomena.\nYet since the above distinctions refer to very different psychological\nmechanisms, it is absolutely central to distinguish between them when\nempirically assessing the impact and contribution of empathy to an\nagent’s pro-social motivation and behavior. Given the ambiguity\nof the empathy concept within psychology—particularly in the\nearlier literature—in evaluating and comparing different\nempirical empathy studies, it is always crucial to keep in mind how\nempathy has been defined and measured within the context of these\nstudies. For a more extensive discussion of the methods used by\npsychologists to measure empathy see the\n\nSupplementary document on Measuring Empathy.\n \n",
    "section_title": "4. Empathy as a Topic of Scientific Exploration in Psychology",
    "entry_title": "Empathy",
    "hierarchy_title": "Empathy || Empathy as a Topic of Scientific Exploration in Psychology",
    "tokenized_text": [
        "empathy",
        "topic",
        "scientific",
        "exploration",
        "psychology",
        "empathy",
        "topic",
        "scientific",
        "exploration",
        "psychology",
        "discussion",
        "empathy",
        "within",
        "psychology",
        "largely",
        "unaffected",
        "critical",
        "philosophical",
        "discussion",
        "empathy",
        "epistemic",
        "mean",
        "know",
        "mind",
        "unique",
        "method",
        "human",
        "science",
        "rather",
        "psychologist",
        "interest",
        "empathyrelated",
        "phenomenon",
        "harks",
        "back",
        "eighteenth",
        "century",
        "moral",
        "philosophy",
        "particularly",
        "david",
        "hume",
        "adam",
        "smith",
        "see",
        "also",
        "wispe",
        "empathy",
        "called",
        "sympathy",
        "regarded",
        "play",
        "central",
        "role",
        "constituting",
        "human",
        "being",
        "social",
        "moral",
        "creature",
        "allowing",
        "u",
        "emotionally",
        "connect",
        "human",
        "companion",
        "care",
        "wellbeing",
        "throughout",
        "early",
        "th",
        "century",
        "particularly",
        "since",
        "late",
        "empathy",
        "therefore",
        "intensively",
        "studied",
        "topic",
        "psychological",
        "research",
        "broadly",
        "one",
        "distinguish",
        "two",
        "psychological",
        "research",
        "tradition",
        "studying",
        "empathyrelated",
        "phenomenon",
        "study",
        "currently",
        "called",
        "empathic",
        "accuracy",
        "study",
        "empathy",
        "emotional",
        "phenomenon",
        "encounter",
        "others",
        "first",
        "area",
        "study",
        "defines",
        "empathy",
        "primarily",
        "cognitive",
        "phenomenon",
        "conceives",
        "empathy",
        "general",
        "term",
        "intellectual",
        "imaginative",
        "apprehension",
        "another",
        "condition",
        "state",
        "mind",
        "use",
        "hogan",
        "terminology",
        "within",
        "area",
        "research",
        "one",
        "primarily",
        "interested",
        "determining",
        "reliability",
        "accuracy",
        "ability",
        "perceive",
        "recognize",
        "person",
        "enduring",
        "personality",
        "trait",
        "attitude",
        "value",
        "occurrent",
        "mental",
        "state",
        "one",
        "also",
        "investigates",
        "various",
        "factor",
        "influence",
        "empathic",
        "accuracy",
        "one",
        "example",
        "interested",
        "determining",
        "whether",
        "empathic",
        "ability",
        "depends",
        "gender",
        "age",
        "family",
        "background",
        "intelligence",
        "emotional",
        "stability",
        "nature",
        "interpersonal",
        "relation",
        "whether",
        "depends",
        "specific",
        "motivation",
        "observer",
        "survey",
        "see",
        "ickes",
        "taft",
        "detailed",
        "account",
        "research",
        "empathic",
        "accuracy",
        "earlier",
        "methodological",
        "difficulty",
        "found",
        "supplementary",
        "document",
        "study",
        "cognitive",
        "empathy",
        "empathic",
        "accuracy",
        "philosophically",
        "influential",
        "study",
        "empathy",
        "defined",
        "primarily",
        "emotional",
        "affective",
        "phenomenon",
        "psychologist",
        "middle",
        "started",
        "focus",
        "context",
        "psychologist",
        "also",
        "addressed",
        "issue",
        "moral",
        "motivation",
        "traditionally",
        "topic",
        "intense",
        "discussion",
        "among",
        "moral",
        "philosopher",
        "particularly",
        "interested",
        "investigating",
        "development",
        "various",
        "mean",
        "measuring",
        "empathy",
        "dispositional",
        "trait",
        "adult",
        "child",
        "situational",
        "response",
        "specific",
        "situation",
        "ii",
        "factor",
        "empathic",
        "response",
        "disposition",
        "depend",
        "iii",
        "relation",
        "empathy",
        "prosocial",
        "behavior",
        "moral",
        "development",
        "discussing",
        "psychological",
        "research",
        "emotional",
        "empathy",
        "relevance",
        "moral",
        "philosophy",
        "moral",
        "psychology",
        "next",
        "section",
        "vital",
        "introduce",
        "important",
        "conceptual",
        "distinction",
        "one",
        "keep",
        "mind",
        "evaluating",
        "various",
        "empirical",
        "study",
        "anyone",
        "reading",
        "emotional",
        "empathy",
        "literature",
        "struck",
        "fact",
        "empathy",
        "tended",
        "incredibly",
        "broadly",
        "defined",
        "beginning",
        "specific",
        "research",
        "tradition",
        "stotland",
        "one",
        "earliest",
        "researcher",
        "understood",
        "empathy",
        "exclusively",
        "emotional",
        "phenomenon",
        "defined",
        "observer",
        "reacting",
        "emotionally",
        "perceives",
        "another",
        "experiencing",
        "experience",
        "emotion",
        "according",
        "stotland",
        "definition",
        "diverse",
        "emotional",
        "response",
        "feeling",
        "envy",
        "feeling",
        "annoyed",
        "feeling",
        "distressed",
        "relieved",
        "feeling",
        "pity",
        "feeling",
        "german",
        "call",
        "schadenfreude",
        "feeling",
        "joyful",
        "misfortune",
        "another",
        "counted",
        "empathic",
        "reaction",
        "since",
        "however",
        "psychologist",
        "fine",
        "tuned",
        "understanding",
        "empathy",
        "conceptually",
        "distinguished",
        "different",
        "aspect",
        "emotional",
        "reaction",
        "another",
        "person",
        "thereby",
        "implicitly",
        "acknowledging",
        "conceptual",
        "distinction",
        "articulated",
        "max",
        "scheler",
        "almost",
        "century",
        "earlier",
        "context",
        "particularly",
        "useful",
        "distinguish",
        "following",
        "reactive",
        "emotion",
        "differentiated",
        "respect",
        "whether",
        "reaction",
        "self",
        "oriented",
        "whether",
        "presuppose",
        "awareness",
        "distinction",
        "self",
        "others",
        "see",
        "also",
        "survey",
        "introduction",
        "eisenbergstrayer",
        "batson",
        "emotional",
        "contagion",
        "emotional",
        "contagion",
        "occurs",
        "people",
        "start",
        "feeling",
        "similar",
        "emotion",
        "caused",
        "merely",
        "association",
        "people",
        "start",
        "feeling",
        "joyful",
        "people",
        "around",
        "joyful",
        "start",
        "feeling",
        "panicky",
        "crowd",
        "people",
        "feeling",
        "panic",
        "emotional",
        "contagion",
        "however",
        "require",
        "one",
        "aware",
        "fact",
        "one",
        "experience",
        "emotion",
        "people",
        "experience",
        "rather",
        "one",
        "experience",
        "primarily",
        "one",
        "emotion",
        "scheler",
        "newborn",
        "infant",
        "reactive",
        "cry",
        "distress",
        "cry",
        "another",
        "hoffman",
        "take",
        "rudimentary",
        "precursor",
        "empathic",
        "distress",
        "hoffman",
        "probably",
        "understood",
        "phenomenon",
        "emotional",
        "contagion",
        "since",
        "infant",
        "able",
        "properly",
        "distinguish",
        "self",
        "affective",
        "proper",
        "empathy",
        "narrowly",
        "properly",
        "understood",
        "empathy",
        "affective",
        "sense",
        "vicarious",
        "sharing",
        "affect",
        "author",
        "however",
        "differ",
        "strictly",
        "interpret",
        "phrase",
        "vicariously",
        "sharing",
        "affect",
        "requires",
        "empathizers",
        "person",
        "empathize",
        "need",
        "similar",
        "affective",
        "state",
        "coplan",
        "de",
        "vignemont",
        "singer",
        "jacob",
        "hoffman",
        "hand",
        "emotional",
        "response",
        "requiring",
        "involvement",
        "psychological",
        "process",
        "make",
        "person",
        "feeling",
        "congruent",
        "another",
        "situation",
        "situation",
        "hoffman",
        "according",
        "definition",
        "empathy",
        "necessarily",
        "require",
        "subject",
        "target",
        "feel",
        "similar",
        "emotion",
        "even",
        "though",
        "often",
        "case",
        "rather",
        "definition",
        "also",
        "includes",
        "case",
        "feeling",
        "sad",
        "seeing",
        "child",
        "play",
        "joyfully",
        "know",
        "diagnosed",
        "serious",
        "illness",
        "assuming",
        "person",
        "would",
        "feel",
        "would",
        "fully",
        "understand",
        "situation",
        "contrast",
        "mere",
        "emotional",
        "contagion",
        "genuine",
        "empathy",
        "presupposes",
        "ability",
        "differentiate",
        "oneself",
        "requires",
        "one",
        "minimally",
        "aware",
        "fact",
        "one",
        "emotional",
        "experience",
        "due",
        "perception",
        "emotion",
        "generally",
        "due",
        "attending",
        "situation",
        "seeing",
        "sad",
        "face",
        "another",
        "feeling",
        "sad",
        "oneself",
        "feeling",
        "sadness",
        "count",
        "genuinely",
        "empathic",
        "one",
        "recognizes",
        "feeling",
        "sad",
        "one",
        "attention",
        "still",
        "focused",
        "appropriate",
        "reaction",
        "aspect",
        "one",
        "life",
        "moreover",
        "empathy",
        "outside",
        "realm",
        "direct",
        "perceptual",
        "encounter",
        "involves",
        "appreciation",
        "person",
        "emotion",
        "appropriate",
        "response",
        "situation",
        "happy",
        "unhappy",
        "one",
        "child",
        "happy",
        "sad",
        "count",
        "necessarily",
        "empathic",
        "emotion",
        "count",
        "vicarious",
        "emotional",
        "response",
        "due",
        "perception",
        "outside",
        "world",
        "perspective",
        "observer",
        "desire",
        "child",
        "happy",
        "happiness",
        "child",
        "happy",
        "would",
        "therefore",
        "emotional",
        "state",
        "congruent",
        "situation",
        "rather",
        "emotional",
        "response",
        "appropriate",
        "perspective",
        "world",
        "order",
        "happiness",
        "unhappiness",
        "genuinely",
        "empathic",
        "happiness",
        "unhappiness",
        "make",
        "person",
        "happy",
        "accordingly",
        "share",
        "another",
        "person",
        "emotion",
        "vicariously",
        "merely",
        "affective",
        "state",
        "similar",
        "phenomenal",
        "quality",
        "rather",
        "affective",
        "state",
        "directed",
        "toward",
        "intentional",
        "object",
        "see",
        "sober",
        "wilson",
        "maibom",
        "critical",
        "discussion",
        "whether",
        "vicarious",
        "sharing",
        "possible",
        "see",
        "also",
        "deonna",
        "matravers",
        "noted",
        "however",
        "author",
        "conceive",
        "proper",
        "empathy",
        "broadly",
        "merely",
        "concerned",
        "vicarious",
        "reenactment",
        "affective",
        "state",
        "comprehensively",
        "including",
        "nonaffective",
        "state",
        "belief",
        "desire",
        "especially",
        "true",
        "influenced",
        "discussion",
        "empathy",
        "epistemic",
        "mean",
        "goldman",
        "stueber",
        "however",
        "already",
        "adam",
        "smith",
        "constitutes",
        "good",
        "example",
        "broad",
        "understanding",
        "proper",
        "empathy",
        "finally",
        "others",
        "suggest",
        "best",
        "distinguish",
        "affective",
        "sharing",
        "perspective",
        "taking",
        "decety",
        "cowell",
        "sympathy",
        "contrast",
        "affective",
        "empathy",
        "sympathyor",
        "author",
        "also",
        "refer",
        "empathic",
        "concernis",
        "emotion",
        "congruent",
        "emotion",
        "situation",
        "feeling",
        "sadness",
        "person",
        "grieving",
        "death",
        "father",
        "rather",
        "sympathy",
        "seen",
        "emotion",
        "sui",
        "generis",
        "negative",
        "emotion",
        "situation",
        "object",
        "perspective",
        "somebody",
        "care",
        "person",
        "well",
        "darwall",
        "sense",
        "sympathy",
        "consists",
        "feeling",
        "sorrow",
        "concern",
        "distressed",
        "needy",
        "feeling",
        "heightened",
        "awareness",
        "suffering",
        "another",
        "person",
        "something",
        "need",
        "alleviated",
        "eisenberg",
        "a",
        "wispe",
        "wispe",
        "whereas",
        "quite",
        "plausible",
        "assume",
        "empathythat",
        "empathy",
        "negative",
        "emotion",
        "another",
        "hoffman",
        "call",
        "veridical",
        "empathic",
        "distress",
        "under",
        "certain",
        "condition",
        "certain",
        "developmental",
        "marker",
        "achieved",
        "give",
        "rise",
        "sympathy",
        "stressed",
        "relation",
        "affective",
        "empathy",
        "sympathy",
        "contingent",
        "one",
        "understanding",
        "requires",
        "empirical",
        "research",
        "first",
        "sympathy",
        "necessarily",
        "require",
        "feeling",
        "kind",
        "congruent",
        "emotion",
        "part",
        "observer",
        "detached",
        "recognition",
        "representation",
        "need",
        "suffers",
        "might",
        "sufficient",
        "see",
        "scheler",
        "nichols",
        "second",
        "empathy",
        "empathic",
        "distress",
        "might",
        "lead",
        "sympathy",
        "people",
        "helping",
        "profession",
        "accustomed",
        "misery",
        "others",
        "suffer",
        "time",
        "compassion",
        "fatigue",
        "also",
        "possible",
        "experience",
        "empathic",
        "overarousal",
        "one",
        "emotionally",
        "overwhelmed",
        "one",
        "empathic",
        "feeling",
        "one",
        "unable",
        "concerned",
        "suffering",
        "hoffman",
        "chap",
        "later",
        "case",
        "one",
        "empathic",
        "feeling",
        "transformed",
        "give",
        "rise",
        "mere",
        "personal",
        "distress",
        "reactive",
        "emotional",
        "phenomenon",
        "need",
        "distinguished",
        "emotional",
        "contagion",
        "empathy",
        "sympathy",
        "personal",
        "distress",
        "personal",
        "distress",
        "context",
        "empathy",
        "research",
        "understood",
        "reactive",
        "emotion",
        "response",
        "perceptionrecognition",
        "another",
        "negative",
        "emotion",
        "situation",
        "yet",
        "personal",
        "distress",
        "othercaused",
        "like",
        "sympathy",
        "contrast",
        "sympathy",
        "primarily",
        "selforiented",
        "case",
        "another",
        "person",
        "distress",
        "make",
        "feel",
        "bad",
        "make",
        "feel",
        "bad",
        "alarmed",
        "grieved",
        "upset",
        "worried",
        "disturbed",
        "perturbed",
        "distressed",
        "troubled",
        "use",
        "list",
        "adjective",
        "according",
        "batson",
        "research",
        "indicates",
        "personal",
        "distress",
        "batson",
        "et",
        "al",
        "batson",
        "contrast",
        "empathic",
        "emotion",
        "defined",
        "personal",
        "distress",
        "congruent",
        "emotion",
        "situation",
        "another",
        "rather",
        "wholly",
        "defines",
        "outlook",
        "onto",
        "world",
        "conceptually",
        "necessary",
        "differentiate",
        "various",
        "emotional",
        "response",
        "admitted",
        "empirically",
        "easy",
        "discriminate",
        "since",
        "tend",
        "occur",
        "together",
        "think",
        "imagine",
        "attending",
        "funeral",
        "child",
        "friend",
        "good",
        "acquaintance",
        "probably",
        "one",
        "reason",
        "early",
        "researcher",
        "tended",
        "distinguish",
        "aspect",
        "study",
        "empathy",
        "related",
        "phenomenon",
        "yet",
        "since",
        "distinction",
        "refer",
        "different",
        "psychological",
        "mechanism",
        "absolutely",
        "central",
        "distinguish",
        "empirically",
        "assessing",
        "impact",
        "contribution",
        "empathy",
        "agent",
        "prosocial",
        "motivation",
        "behavior",
        "given",
        "ambiguity",
        "empathy",
        "concept",
        "within",
        "psychologyparticularly",
        "earlier",
        "literaturein",
        "evaluating",
        "comparing",
        "different",
        "empirical",
        "empathy",
        "study",
        "always",
        "crucial",
        "keep",
        "mind",
        "empathy",
        "defined",
        "measured",
        "within",
        "context",
        "study",
        "extensive",
        "discussion",
        "method",
        "used",
        "psychologist",
        "measure",
        "empathy",
        "see",
        "supplementary",
        "document",
        "measuring",
        "empathy"
    ]
}