{
    "main_text": "Empathy and the Philosophical Problem of Other Minds || Mirror Neurons, Simulation, and the Discussion of Empathy in the Contemporary Theory of Mind Debate\n2.1 Mirror Neurons, Simulation, and the Discussion of Empathy in the Contemporary Theory of Mind Debate\n\nThe idea that empathy understood as inner imitation is the primary\nepistemic means for understanding other minds has however been revived\nin the 1980’s by simulation theorists in the context of the\ninterdisciplinary debate about folk psychology; an empirically\ninformed debate about how best to describe the underlying causal\nmechanisms of our folk psychological abilities to interpret, explain,\nand predict other agents. (See Davies and Stone 1995). In contrast to\ntheory theory, simulation theorists conceive of our ordinary\nmindreading abilities as an ego-centric method and as a\n“knowledge–poor” strategy, where I do not utilize a\nfolk psychological theory but use myself as a model for the other\nperson’s mental life. It is not the place here to discuss the\ncontemporary debate extensively, but it has to be emphasized that\ncontemporary simulation theorists vigorously discuss how to account\nfor our grasp of mental concepts and whether simulation theory is\ncommitted to Cartesianism. Whereas Goldman (2002, 2006) links his\nversion of simulation theory to a neo-Cartesian account of mental\nconcepts, other simulation theorists develop versions of simulation\ntheory that are not committed to a Cartesian conception of the mind.\n(Gordon 1995a, b, and 2000; Heal 2003; and Stueber 2006, 2012).\n\nMoreover, neuroscientific findings according to which so called mirror\nneurons play an important role in recognizing another person’s\nemotional states and in understanding the goal-directedness of his\nbehavior have been understood as providing empirical evidence for\nLipps’ idea of empathy as inner imitation. With the help of the\nterm “mirror neuron,” scientists refer to the fact that\nthere is significant overlap between neural areas of excitation that\nunderlie our observation of another person’s action and areas\nthat are stimulated when we execute the very same action. A similar\noverlap between neural areas of excitation has also been established\nfor our recognition of another person’s emotion based on his\nfacial expression and our experiencing the emotion. (For a survey on\nmirror neurons see Gallese 2003a and b, Goldman 2006, chap. 6; Keysers\n2011; Rizzolatti and Craighero 2004; and particularly Rizzolatti and\nSinigaglia 2008).\n\nSince the face to face encounter between persons is\nthe primary situation within which human beings recognize themselves\nas minded creatures and attribute mental states to others, the system\nof mirror neurons has been interpreted as playing a causally central\nrole in establishing intersubjective relations between minded\ncreatures. For that very reason, the neuroscientist Gallese thinks of\nmirror neurons as constituting what he calls the “shared\nmanifold of intersubjectivity” (Gallese 2001, 44). Stueber\n(2006, chap. 4)—inspired by Lipps’s conception of empathy\nas inner imitation—refers to mirror neurons as mechanisms of\nbasic\n empathy;[2]\n as mechanisms that allow us to apprehend directly another\nperson’s emotions in light of his facial expressions and that\nenable us to understand his bodily movements as goal-directed actions,\nthat is, as being directed towards an external object like a person\nreaching for the cup. \n\nThe evidence from mirror neurons—and the\nfact that in perceiving other people we use very different\nneurobiological mechanisms than in the perception of physical\nobjects—does suggest that in our primary perceptual encounter\nwith the world we do not merely encounter physical objects. Rather,\neven on this basic level, we distinguish already between mere physical\nobjects and objects that are more like us (See also Meltzoff and\nBrooks 2001). The mechanisms of basic empathy have to be seen as\nNature’s way of dissolving one of the principal assumptions of\nthe traditional philosophical discussion about other minds shared by\nopposing positions such as Cartesianism and Behaviorism; that is, that\nwe perceive other people primarily as physical objects and do not\ndistinguish already on the perceptual level between physical objects\nlike trees and minded creatures like ourselves. Mechanisms of basic\nempathy might therefore be interpreted as providing us with a\nperceptual and non-conceptual basis for developing an\nintersubjectively accessible folk psychological framework that is\napplicable to the subject and observed other (Stueber 2006,\n142–45). \nIt needs to be acknowledged however that this\ninterpretation of mirror neurons crucially depends on the assumption\nthat the primary function of mirror neurons consists in providing us\nwith a cognitive grasp of another person’s actions and emotions.\nThis interpretation has however been criticized by researchers and\nphilosophers who think that neural resonance presupposes rather than\nprovides us with an understanding of what is going on in the minds of\nothers (Csibra 2007, Hickok 2008 and 2014). They have also pointed out\nthat in observing another person’s emotion or behavior, we never\nfully “mirror” another person’s neural stimulation.\nThe neuroscientist Jean Decety has argued that in observing another\nperson’s pain our vicariously stimulated pain matrix is not\nsensitive to the phenomenal quality of pain. Rather it is sensitive to\npain as an indicator of “aversion and withdrawal when exposed to\ndanger and threats”(Decety and Cowell 2015, 6 and Decety 2010).\nAt least as far as empathy for pain is concerned, our neural resonance\nis also modulated by a variety of contextual factors, such as how\nclose we feel to the observed subject, whether we regard the pain to\nbe morally justified (as in the case of punishment, for example) or\nwhether we regard it as unavoidable and necessary, such as in a\nmedical procedure (Singer and Lamm 2009; but see also Allen 2010, Borg\n2007, Debes 2010, Gallese 2016, Goldman 2009, Iacoboni 2011, Jacob\n2008, Rizzolatti and Sinigaglia 2016, and Stueber 2012a). \n\nYet it should be noted that everyday mindreading is not restricted to\nthe realm of basic empathy. Ordinarily we not only recognize that\nother persons are afraid or that they are reaching for a particular\nobject. We understand their behavior in more complex social contexts\nin terms of their reasons for acting using the full range of\npsychological concepts including the concepts of belief and desire.\nEvidence from neuroscience shows that these mentalizing tasks involve\nvery different neuronal areas such as the medial prefrontal cortex,\ntemporoparietal cortex, and the cingulate cortex. (For a survey see\nKain and Perner 2003; Frith and Frith 2003; Zaki and Ochsner 2012).\nLow level mindreading in the realm of basic empathy has therefore to\nbe distinguished from higher levels of mindreading (Goldman 2006). It\nis clear that low level forms of understanding other persons have to\nbe conceived of as being relatively knowledge– poor as they do\nnot involve a psychological theory or complex psychological concepts.\nHow exactly one should conceive of high level mindreading abilities,\nwhether they involve primarily knowledge–poor simulation\nstrategies or knowledge–rich inferences is controversially\ndebated within the contemporary debate about our folk psychological\nmindreading abilities(See Davies and Stone 1995, Gopnik and Meltzoff\n1997, Gordon 1995, Currie and Ravenscroft 2002, Heal 2003, Nichols and\nStich 2003, Goldman 2006, and Stueber 2006). Simulation theorists,\nhowever, insist that even more complex forms of understanding other\nagents involve resonance phenomena that engage our cognitively\nintricate capacities of imaginatively adopting the perspective of\nanother person and reenacting or recreating their thought processes\n(For various forms of perspective-taking see Coplan 2011 and Goldie\n2000). Accordingly, simulation theorists distinguish between different\ntypes of empathy such as between basic and reenactive empathy (Stueber\n2006) or between mirroring and reconstructive empathy (Goldman 2011).\nInterestingly, the debate about how to conceive of these more complex\nforms of mindreading resonates with the traditional debate about\nwhether empathy is the unique method of the human sciences and whether\nor not one has to strictly distinguish between the methods of the\nhuman and the natural sciences. Equally noteworthy is the fact that in\nthe contemporary theory of mind debate voices have grown louder that\nassert that the contemporary theory of mind debate fundamentally\nmisconceives of the nature of social cognition. In light of insights\nfrom the phenomenological and hermeneutic traditions in philosophy,\nthey claim that on the most basic level empathy should not be\nconceived of as a resonance phenomenon but as a type of direct\nperception. (See particularly Zahavi 2010; Zahavi and Overgaard 2012,\nbut Jacob 2011 for a response). More complex forms of social cognition\nare also not to be understood as being based on either theory or\nempathy/simulation, rather they are better best conceived of as the\nability to directly fit observed units of actions into larger\nnarrative or cultural frameworks (For this debate see Gallagher 2012,\nGallagher and Hutto 2008, Hutto 2008, and Seemann 2011, Stueber 2011\nand 2012a, and various articles in Matravers and Waldow 2018). For\nskepticism about empathic perspective-taking understood as a complete\nidentification with the perspective of the other person see also\nGoldie 2011). Regardless of how one views this specific debate it\nshould be clear that ideas about mindreading developed originally by\nproponents of empathy at the beginning of the 20th century\ncan no longer be easily dismissed and have to be taken seriously.\n",
    "section_title": "2.1 Mirror Neurons, Simulation, and the Discussion of Empathy in the Contemporary Theory of Mind Debate",
    "entry_title": "Empathy",
    "hierarchy_title": "Empathy || Empathy and the Philosophical Problem of Other Minds || Mirror Neurons, Simulation, and the Discussion of Empathy in the Contemporary Theory of Mind Debate",
    "tokenized_text": [
        "empathy",
        "philosophical",
        "problem",
        "mind",
        "mirror",
        "neuron",
        "simulation",
        "discussion",
        "empathy",
        "contemporary",
        "theory",
        "mind",
        "debate",
        "mirror",
        "neuron",
        "simulation",
        "discussion",
        "empathy",
        "contemporary",
        "theory",
        "mind",
        "debate",
        "idea",
        "empathy",
        "understood",
        "inner",
        "imitation",
        "primary",
        "epistemic",
        "mean",
        "understanding",
        "mind",
        "however",
        "revived",
        "simulation",
        "theorist",
        "context",
        "interdisciplinary",
        "debate",
        "folk",
        "psychology",
        "empirically",
        "informed",
        "debate",
        "best",
        "describe",
        "underlying",
        "causal",
        "mechanism",
        "folk",
        "psychological",
        "ability",
        "interpret",
        "explain",
        "predict",
        "agent",
        "see",
        "davy",
        "stone",
        "contrast",
        "theory",
        "theory",
        "simulation",
        "theorist",
        "conceive",
        "ordinary",
        "mindreading",
        "ability",
        "egocentric",
        "method",
        "knowledgepoor",
        "strategy",
        "utilize",
        "folk",
        "psychological",
        "theory",
        "use",
        "model",
        "person",
        "mental",
        "life",
        "place",
        "discus",
        "contemporary",
        "debate",
        "extensively",
        "emphasized",
        "contemporary",
        "simulation",
        "theorist",
        "vigorously",
        "discus",
        "account",
        "grasp",
        "mental",
        "concept",
        "whether",
        "simulation",
        "theory",
        "committed",
        "cartesianism",
        "whereas",
        "goldman",
        "link",
        "version",
        "simulation",
        "theory",
        "neocartesian",
        "account",
        "mental",
        "concept",
        "simulation",
        "theorist",
        "develop",
        "version",
        "simulation",
        "theory",
        "committed",
        "cartesian",
        "conception",
        "mind",
        "gordon",
        "a",
        "b",
        "heal",
        "stueber",
        "moreover",
        "neuroscientific",
        "finding",
        "according",
        "called",
        "mirror",
        "neuron",
        "play",
        "important",
        "role",
        "recognizing",
        "another",
        "person",
        "emotional",
        "state",
        "understanding",
        "goaldirectedness",
        "behavior",
        "understood",
        "providing",
        "empirical",
        "evidence",
        "lipps",
        "idea",
        "empathy",
        "inner",
        "imitation",
        "help",
        "term",
        "mirror",
        "neuron",
        "scientist",
        "refer",
        "fact",
        "significant",
        "overlap",
        "neural",
        "area",
        "excitation",
        "underlie",
        "observation",
        "another",
        "person",
        "action",
        "area",
        "stimulated",
        "execute",
        "action",
        "similar",
        "overlap",
        "neural",
        "area",
        "excitation",
        "also",
        "established",
        "recognition",
        "another",
        "person",
        "emotion",
        "based",
        "facial",
        "expression",
        "experiencing",
        "emotion",
        "survey",
        "mirror",
        "neuron",
        "see",
        "gallese",
        "a",
        "b",
        "goldman",
        "chap",
        "keysers",
        "rizzolatti",
        "craighero",
        "particularly",
        "rizzolatti",
        "sinigaglia",
        "since",
        "face",
        "face",
        "encounter",
        "person",
        "primary",
        "situation",
        "within",
        "human",
        "being",
        "recognize",
        "minded",
        "creature",
        "attribute",
        "mental",
        "state",
        "others",
        "system",
        "mirror",
        "neuron",
        "interpreted",
        "playing",
        "causally",
        "central",
        "role",
        "establishing",
        "intersubjective",
        "relation",
        "minded",
        "creature",
        "reason",
        "neuroscientist",
        "gallese",
        "think",
        "mirror",
        "neuron",
        "constituting",
        "call",
        "shared",
        "manifold",
        "intersubjectivity",
        "gallese",
        "stueber",
        "chap",
        "inspired",
        "lipps",
        "conception",
        "empathy",
        "inner",
        "imitationrefers",
        "mirror",
        "neuron",
        "mechanism",
        "basic",
        "empathy",
        "mechanism",
        "allow",
        "u",
        "apprehend",
        "directly",
        "another",
        "person",
        "emotion",
        "light",
        "facial",
        "expression",
        "enable",
        "u",
        "understand",
        "bodily",
        "movement",
        "goaldirected",
        "action",
        "directed",
        "towards",
        "external",
        "object",
        "like",
        "person",
        "reaching",
        "cup",
        "evidence",
        "mirror",
        "neuronsand",
        "fact",
        "perceiving",
        "people",
        "use",
        "different",
        "neurobiological",
        "mechanism",
        "perception",
        "physical",
        "objectsdoes",
        "suggest",
        "primary",
        "perceptual",
        "encounter",
        "world",
        "merely",
        "encounter",
        "physical",
        "object",
        "rather",
        "even",
        "basic",
        "level",
        "distinguish",
        "already",
        "mere",
        "physical",
        "object",
        "object",
        "like",
        "u",
        "see",
        "also",
        "meltzoff",
        "brook",
        "mechanism",
        "basic",
        "empathy",
        "seen",
        "nature",
        "way",
        "dissolving",
        "one",
        "principal",
        "assumption",
        "traditional",
        "philosophical",
        "discussion",
        "mind",
        "shared",
        "opposing",
        "position",
        "cartesianism",
        "behaviorism",
        "perceive",
        "people",
        "primarily",
        "physical",
        "object",
        "distinguish",
        "already",
        "perceptual",
        "level",
        "physical",
        "object",
        "like",
        "tree",
        "minded",
        "creature",
        "like",
        "mechanism",
        "basic",
        "empathy",
        "might",
        "therefore",
        "interpreted",
        "providing",
        "u",
        "perceptual",
        "nonconceptual",
        "basis",
        "developing",
        "intersubjectively",
        "accessible",
        "folk",
        "psychological",
        "framework",
        "applicable",
        "subject",
        "observed",
        "stueber",
        "need",
        "acknowledged",
        "however",
        "interpretation",
        "mirror",
        "neuron",
        "crucially",
        "depends",
        "assumption",
        "primary",
        "function",
        "mirror",
        "neuron",
        "consists",
        "providing",
        "u",
        "cognitive",
        "grasp",
        "another",
        "person",
        "action",
        "emotion",
        "interpretation",
        "however",
        "criticized",
        "researcher",
        "philosopher",
        "think",
        "neural",
        "resonance",
        "presupposes",
        "rather",
        "provides",
        "u",
        "understanding",
        "going",
        "mind",
        "others",
        "csibra",
        "hickok",
        "also",
        "pointed",
        "observing",
        "another",
        "person",
        "emotion",
        "behavior",
        "never",
        "fully",
        "mirror",
        "another",
        "person",
        "neural",
        "stimulation",
        "neuroscientist",
        "jean",
        "decety",
        "argued",
        "observing",
        "another",
        "person",
        "pain",
        "vicariously",
        "stimulated",
        "pain",
        "matrix",
        "sensitive",
        "phenomenal",
        "quality",
        "pain",
        "rather",
        "sensitive",
        "pain",
        "indicator",
        "aversion",
        "withdrawal",
        "exposed",
        "danger",
        "threat",
        "decety",
        "cowell",
        "decety",
        "least",
        "far",
        "empathy",
        "pain",
        "concerned",
        "neural",
        "resonance",
        "also",
        "modulated",
        "variety",
        "contextual",
        "factor",
        "close",
        "feel",
        "observed",
        "subject",
        "whether",
        "regard",
        "pain",
        "morally",
        "justified",
        "case",
        "punishment",
        "example",
        "whether",
        "regard",
        "unavoidable",
        "necessary",
        "medical",
        "procedure",
        "singer",
        "lamm",
        "see",
        "also",
        "allen",
        "borg",
        "debes",
        "gallese",
        "goldman",
        "iacoboni",
        "jacob",
        "rizzolatti",
        "sinigaglia",
        "stueber",
        "a",
        "yet",
        "noted",
        "everyday",
        "mindreading",
        "restricted",
        "realm",
        "basic",
        "empathy",
        "ordinarily",
        "recognize",
        "person",
        "afraid",
        "reaching",
        "particular",
        "object",
        "understand",
        "behavior",
        "complex",
        "social",
        "context",
        "term",
        "reason",
        "acting",
        "using",
        "full",
        "range",
        "psychological",
        "concept",
        "including",
        "concept",
        "belief",
        "desire",
        "evidence",
        "neuroscience",
        "show",
        "mentalizing",
        "task",
        "involve",
        "different",
        "neuronal",
        "area",
        "medial",
        "prefrontal",
        "cortex",
        "temporoparietal",
        "cortex",
        "cingulate",
        "cortex",
        "survey",
        "see",
        "kain",
        "perner",
        "frith",
        "frith",
        "zaki",
        "ochsner",
        "low",
        "level",
        "mindreading",
        "realm",
        "basic",
        "empathy",
        "therefore",
        "distinguished",
        "higher",
        "level",
        "mindreading",
        "goldman",
        "clear",
        "low",
        "level",
        "form",
        "understanding",
        "person",
        "conceived",
        "relatively",
        "knowledge",
        "poor",
        "involve",
        "psychological",
        "theory",
        "complex",
        "psychological",
        "concept",
        "exactly",
        "one",
        "conceive",
        "high",
        "level",
        "mindreading",
        "ability",
        "whether",
        "involve",
        "primarily",
        "knowledgepoor",
        "simulation",
        "strategy",
        "knowledgerich",
        "inference",
        "controversially",
        "debated",
        "within",
        "contemporary",
        "debate",
        "folk",
        "psychological",
        "mindreading",
        "ability",
        "see",
        "davy",
        "stone",
        "gopnik",
        "meltzoff",
        "gordon",
        "currie",
        "ravenscroft",
        "heal",
        "nichols",
        "stich",
        "goldman",
        "stueber",
        "simulation",
        "theorist",
        "however",
        "insist",
        "even",
        "complex",
        "form",
        "understanding",
        "agent",
        "involve",
        "resonance",
        "phenomenon",
        "engage",
        "cognitively",
        "intricate",
        "capacity",
        "imaginatively",
        "adopting",
        "perspective",
        "another",
        "person",
        "reenacting",
        "recreating",
        "thought",
        "process",
        "various",
        "form",
        "perspectivetaking",
        "see",
        "coplan",
        "goldie",
        "accordingly",
        "simulation",
        "theorist",
        "distinguish",
        "different",
        "type",
        "empathy",
        "basic",
        "reenactive",
        "empathy",
        "stueber",
        "mirroring",
        "reconstructive",
        "empathy",
        "goldman",
        "interestingly",
        "debate",
        "conceive",
        "complex",
        "form",
        "mindreading",
        "resonates",
        "traditional",
        "debate",
        "whether",
        "empathy",
        "unique",
        "method",
        "human",
        "science",
        "whether",
        "one",
        "strictly",
        "distinguish",
        "method",
        "human",
        "natural",
        "science",
        "equally",
        "noteworthy",
        "fact",
        "contemporary",
        "theory",
        "mind",
        "debate",
        "voice",
        "grown",
        "louder",
        "assert",
        "contemporary",
        "theory",
        "mind",
        "debate",
        "fundamentally",
        "misconceives",
        "nature",
        "social",
        "cognition",
        "light",
        "insight",
        "phenomenological",
        "hermeneutic",
        "tradition",
        "philosophy",
        "claim",
        "basic",
        "level",
        "empathy",
        "conceived",
        "resonance",
        "phenomenon",
        "type",
        "direct",
        "perception",
        "see",
        "particularly",
        "zahavi",
        "zahavi",
        "overgaard",
        "jacob",
        "response",
        "complex",
        "form",
        "social",
        "cognition",
        "also",
        "understood",
        "based",
        "either",
        "theory",
        "empathysimulation",
        "rather",
        "better",
        "best",
        "conceived",
        "ability",
        "directly",
        "fit",
        "observed",
        "unit",
        "action",
        "larger",
        "narrative",
        "cultural",
        "framework",
        "debate",
        "see",
        "gallagher",
        "gallagher",
        "hutto",
        "hutto",
        "seemann",
        "stueber",
        "a",
        "various",
        "article",
        "matravers",
        "waldow",
        "skepticism",
        "empathic",
        "perspectivetaking",
        "understood",
        "complete",
        "identification",
        "perspective",
        "person",
        "see",
        "also",
        "goldie",
        "regardless",
        "one",
        "view",
        "specific",
        "debate",
        "clear",
        "idea",
        "mindreading",
        "developed",
        "originally",
        "proponent",
        "empathy",
        "beginning",
        "th",
        "century",
        "longer",
        "easily",
        "dismissed",
        "taken",
        "seriously"
    ]
}