{
    "main_text": "Psychology and Ethics\n4. Psychology and Ethics\n\nHaving established the physical basis of the world, Epicurus proceeds\nto explain the nature of the soul (this, at least, is the order in\nwhich Lucretius sets things out). This too, of course, consists of\natoms: first, there is nothing that is not made up of atoms and void\n(secondary qualities are simply accidents of the arrangement of\natoms), and second, an incorporeal entity could neither act on nor be\nmoved by bodies, as the soul is seen to do (e.g., it is conscious of\nwhat happens to the body, and it initiates physical movement).\nEpicurus maintains that soul atoms are particularly fine and are\ndistributed throughout the body (LH 64), and it is by means\nof them that we have sensations (aisthêseis) and the\nexperience of pain and pleasure, which Epicurus calls\npathê (a term used by Aristotle and others to signify\nemotions instead). Body without soul atoms is unconscious and inert,\nand when the atoms of the body are disarranged so that it can no\nlonger support conscious life, the soul atoms are scattered and no\nlonger retain the capacity for sensation (LH 65). There is\nalso a part of the human soul that is concentrated in the chest, and\nis the seat of the higher intellectual functions. The distinction is\nimportant, because it is in the rational part that error of judgment\nenters in. Sensation, like pain and pleasure, is incorrigible just\nbecause it is a function of the non-rational part, which does not\nmodify a perception — that is, the reception of lamina emitted\nfrom macroscopic bodies — by the addition of opinion or\nbelief.\n\nThe corporeal nature of the soul has two crucial consequences for\nEpicureanism. First, it is the basis of Epicurus’ demonstration\nthat the soul does not survive the death of the body (other arguments\nto this effect are presented in Lucretius 3.417–614). The\nsoul’s texture is too delicate to exist independently of the\nbody that contains it, and in any case the connection with the body is\nnecessary for sensation to occur. From this it follows that there can\nbe no punishment after death, nor any regrets for the life that has\nbeen lost. Second, the soul is responsive to physical impressions,\nwhether those that arrive from without in the form of laminas or\nsimulacra, or those that arise from internal motions of the body. No\nphenomena are purely mental, in the sense of being disembodied states\nor objects of pure consciousness conceived as separate from\nembodiment. The elementary sensations of pleasure and pain,\naccordingly, rather than abstract moral principles or abstract\nconcepts of goodness or badness, are the fundamental guides to what is\ngood and bad, since all sentient creatures are naturally attracted to\nthe one and repelled by the other. The function of the human mind\n— that part of the soul that is located in our chest — is\nnot to seek higher things, but to maximize pleasure and minimize pain.\nThat is its entire objective; the risk (a substantial one) is that it\nmay miscalculate, since it is subject to false beliefs and errors in\ncognitive processes.\n\nUnlike other Hellenistic schools, such as those of Aristotle and the\nStoics, the Epicureans were not greatly interested in formal logic,\nbut they certainly needed a theory of the formation of beliefs. As far\nas the ideational content of thinking — that is, the thought of\nsomething — is concerned, Epicurus proposed a radically\nreductive hypothesis: just as sensations occur as a result of thin\nfilms emitted by objects that enter the appropriate sense organ, so\ntoo some of these simulacra are fine enough to penetrate directly to\nthe mind (located in the chest), and that is how we imagine such\nobjects (e.g., gods). This process is invoked to explain not only\ndream images, but many kinds of mental impression, including\nimpressions constituting voluntary thought: the latter occurs when we\nattend to one or another of the exiguous physical films that are\ncontinuously floating through the air. (How we manage to attend\nvoluntarily to whichever of these films we choose is not explained in\nthe surviving sources.) Imagining a thing is thus nothing more than\npicking out the simulacra that have been emitted by it, and which may\nendure beyond the life of the thing itself (hence we can imagine the\ndead). These mental images have no privileged status, such as Plato\ngave to his noetic Ideas or Forms; they are always true, but in this\ndo not differ from the information provided by the senses. Mistakes\noccur here too when the wrong beliefs are associated with such\nimpressions, for example, that because we have a mental image of a\ndead person it follows that he or she still exists in a ghostly form.\nEpicurean physics proves that this is impossible.\n\nA great barrier to correct thinking is language itself, which, because\nit has a name for death, may suggest that death (being dead) is\nsomething a person can experience and hence deserves to be feared.\nWords must be understood in their basic sense, Epicurus says, as\nopposed to what he calls “empty sounds” (LH 37).\nThe culprit in misunderstanding is always an illegitimate inference\nfrom sensation (the latter including thoughts produced by film-like\nimages). An example is the belief that centaurs exist. Epicurus does\nnot deny that the thought of a centaur corresponds to some real\nstimulus in the form of simulacra: his theory of knowledge commits him\nto the view that it must. But the flimsy laminas as they float through\nthe air can become distorted or interfere with one another, and thus\nthe upper part of a human figure may get loosely attached to the lower\npart of a horse’s. We know that this is unreal because such a\ncombination is physically impossible: horses and human beings mature\nat different rates, for example, and eat different foods (see\nLucretius 5.878–91; cf. Palaephatus On Incredible Tales\n20). Beliefs about whether sensations correspond to an actually\nexisting thing must be tested against knowledge of the world, as\ninformed by Epicurean theory.\n\nThe ability to reason or calculate (logismos) cannot be a\nfunction of images. It is the faculty that lets us infer by analogy\nfrom the visible world to the invisible, and also that with which we\nmay recognize that not all pleasures are to be chosen at all times,\nsince some immediate pleasures may lead to long-term pain or harm\n(Letter to Menoeceus = LM 129). What is more, one\nmust know something about the nature of pleasure in order to pursue it\nrationally, and likewise for pain. Epicurus, it appears, uses the\nterms pleasure and pain (hêdonê,\nalgêdôn) strictly in reference to physical\npathê or sensations, that is, those that are\nexperienced via the non-rational soul that is distributed throughout\nthe body. As for the rational part or mind, we have positive and\nnegative experiences through it too. Most prominent among the negative\nmental states is fear, above all the fear of unreal dangers, such as\ndeath. Death, Epicurus insists, is nothing to us, since while we\nexist, our death is not, and when our death occurs, we do not exist\n(LM 124–25); but if one is frightened by the empty name\nof death, the fear will persist since we must all eventually die. This\nfear is one source of perturbation (tarakhê), and is a\nworse curse than physical pain itself; the absence of such fear is\nataraxy, lack of perturbation, and ataraxy, together with freedom from\nphysical pain, is one way of specifying the goal of life, for\nEpicurus.\n\nThere are also positive states of mind, which Epicurus identifies by\nthe special term khara (joy), as opposed to\nhêdonê (pleasure, i.e., physical pleasure). These\nstates too depend on belief, whether true or false. But Epicurus does\nnot treat khara as an end, or part of the end for living:\nrather, he tends to describe the goal by negation, as freedom from\nbodily pain and mental disturbance (LM 128). However,\nhappiness (eudaimonia), according to Epicurus, is not simply\na neutral or privative condition but rather a form of pleasure in its\nown right — what Epicurus called catastematic or (following\nCicero’s Latin translation) “static” as opposed to\n“kinetic” pleasure. Although the precise nature of this\ndistinction is debated, kinetic pleasures seem to be of the\nnon-necessary kind (see below), such as those resulting from agreeable\nodors or sounds, rather than deriving from replenishment, as in the\ncase of hunger or thirst. The philosophical school known as the\nCyrenaics advocated increasing desires and seeking ever new ways of\ngratifying them.\n\nEpicurus objected that such pleasures are necessarily accompanied by\ndistress, for they depend upon a lack that is painful (Plato had\ndemonstrated the problematic nature of this kind of pleasure; see\nGorgias 496C–497A, Philebus 31E–32D,\n46A–50C). In addition, augmenting desires tends to intensify\nrather than reduce the mental agitation (a distressful state of mind)\nthat Epicurean philosophy sought to eliminate. Catastematic pleasure,\non the contrary, is (or is taken in) a state rather than a process: it\nis the pleasure that accompanies well-being as such. The Cyrenaics and\nothers, such as Cicero, maintained, in turn, that this condition is\nnot pleasurable but rather neutral — neither pleasurable nor\npainful.\n\nFor Epicurus, there are some fears that are perfectly legitimate; so\ntoo are some desires. Epicurus offers a classification of desires into\nthree types: some are natural, others are empty; and natural desires\nare of two sorts, those that are necessary and those that are merely\nnatural (see Cooper 1999). Natural and necessary are those that look\nto happiness, physical well-being, or life itself (LM 127).\nUnnecessary but natural desires are for pleasant things like sweet\nodors and good-tasting food and drink (and for various pleasurable\nactivities of sorts other than simple smelling, touching and tasting).\nEmpty desires are those that have as their objects things designated\nby empty sounds, such as immortality, which cannot exist for human\nbeings and do not correspond to any genuine need. The same holds for\nthe desire for great wealth or for marks of fame, such as statues:\nthey cannot provide the security that is the genuine object of the\ndesire. Such desires, accordingly, can never be satisfied, any more\nthan the corresponding fears — e.g., the fear of death —\ncan ever be alleviated, since neither has a genuine referent, i.e.,\ndeath as something harmful (when it is present, we do not exist) or\nwealth and power as salves for anxiety. Such empty fears and desires,\nbased on what Epicurus calls kenodoxia or empty belief, are\nthemselves the main source of perturbation and pain in civilized life,\nwhere more elementary dangers have been brought under control, since\nthey are the reason why people are driven to strive for limitless\nwealth and power, subjecting themselves to the very dangers they\nimagine they are avoiding.\n\nAlthough human beings, like everything else, are composed of atoms\nthat move according to their fixed laws, our actions are not wholly\npredetermined — rather than entertain such a paralyzing\ndoctrine, Epicurus says, it would be better to believe in the old\nmyths, for all their perversities (LM 134). What enables us\nto wrest liberty from a mechanistic universe is the existence of a\ncertain randomness in the motion of atoms, that takes the form of a\nminute swerve in their forward course (evidence for this doctrine\nderives chiefly from later sources, including Lucretius and Cicero).\nIt is not entirely clear how the swerve operates: it may involve a\nsmall angle of deviation from the original path, or else a slight\nshift sideways, perhaps by a single minimum, with no change in\ndirection. The idea of such a minute veering, said to occur at no\ndeterminate time or place, is less strange in the modern age of\nquantum physics than it was in Epicurus’ time, and it gave rise\nto mocking critiques. More problematic today is how the swerve might\nexplain freedom of will — if indeed Epicurus’ idea of the\nwill was like our own. It did, at all events, introduce an\nindeterminacy into the universe, and if soul atoms, thanks to their\nfineness, were more susceptible to the effects of such deviations than\ncoarser matter, the swerve could at least represent a breach in any\nstrict predestination of human behavior. And this might have been\nenough for Epicurus’ purposes: he may not have invoked the\nswerve in order to explain voluntary action (claiming that it is\naction deriving, immediately or ultimately, from a swerve or some\nswerves of the soul’s atoms). He may have wished merely to\nestablish the possibility of action not deriving from the positions of\nthe soul’s constituent atoms at any time plus the effects of\ncollisions among them resulting from their given movements at that\ntime. According to Lucretius (2.225–50), the swerve was also put\nto use to solve a cosmological problem: if at some (as it were)\ninitial moment all atoms were moving uniformly in a single direction\n(downward) at the same speed, it is impossible to conceive how the\nprocess of atomic collisions could have begun, save by some such\ndevice. This seems a curious idea: given that time, like space, was\ninfinite according to Epicurus, he need not have imagined a time prior\nto collisions. Just possibly the tendency of atoms to emerge from\ncollisions in a preferred direction (by definition “down”)\nmight lead over time to local regions of parallel motion, and the\nswerve could serve to reintroduce contact among them. In any event,\nEpicurus may have thought of atoms moving in some uniform direction\nrather than in diverse ones as a default position for physical theory\n(because of the simplicity of that hypothesis); thus he may have felt\nthe need to explain how the diversity of the atoms’ motions\ncould have arisen.\n",
    "section_title": "4. Psychology and Ethics",
    "entry_title": "Epicurus",
    "hierarchy_title": "Epicurus || Psychology and Ethics",
    "tokenized_text": [
        "psychology",
        "ethic",
        "psychology",
        "ethic",
        "established",
        "physical",
        "basis",
        "world",
        "epicurus",
        "proceeds",
        "explain",
        "nature",
        "soul",
        "least",
        "order",
        "lucretius",
        "set",
        "thing",
        "course",
        "consists",
        "atom",
        "first",
        "nothing",
        "made",
        "atom",
        "void",
        "secondary",
        "quality",
        "simply",
        "accident",
        "arrangement",
        "atom",
        "second",
        "incorporeal",
        "entity",
        "could",
        "neither",
        "act",
        "moved",
        "body",
        "soul",
        "seen",
        "eg",
        "conscious",
        "happens",
        "body",
        "initiate",
        "physical",
        "movement",
        "epicurus",
        "maintains",
        "soul",
        "atom",
        "particularly",
        "fine",
        "distributed",
        "throughout",
        "body",
        "lh",
        "mean",
        "sensation",
        "aisthêseis",
        "experience",
        "pain",
        "pleasure",
        "epicurus",
        "call",
        "pathê",
        "term",
        "used",
        "aristotle",
        "others",
        "signify",
        "emotion",
        "instead",
        "body",
        "without",
        "soul",
        "atom",
        "unconscious",
        "inert",
        "atom",
        "body",
        "disarranged",
        "longer",
        "support",
        "conscious",
        "life",
        "soul",
        "atom",
        "scattered",
        "longer",
        "retain",
        "capacity",
        "sensation",
        "lh",
        "also",
        "part",
        "human",
        "soul",
        "concentrated",
        "chest",
        "seat",
        "higher",
        "intellectual",
        "function",
        "distinction",
        "important",
        "rational",
        "part",
        "error",
        "judgment",
        "enters",
        "sensation",
        "like",
        "pain",
        "pleasure",
        "incorrigible",
        "function",
        "nonrational",
        "part",
        "modify",
        "perception",
        "reception",
        "lamina",
        "emitted",
        "macroscopic",
        "body",
        "addition",
        "opinion",
        "belief",
        "corporeal",
        "nature",
        "soul",
        "two",
        "crucial",
        "consequence",
        "epicureanism",
        "first",
        "basis",
        "epicurus",
        "demonstration",
        "soul",
        "survive",
        "death",
        "body",
        "argument",
        "effect",
        "presented",
        "lucretius",
        "soul",
        "texture",
        "delicate",
        "exist",
        "independently",
        "body",
        "contains",
        "case",
        "connection",
        "body",
        "necessary",
        "sensation",
        "occur",
        "follows",
        "punishment",
        "death",
        "regret",
        "life",
        "lost",
        "second",
        "soul",
        "responsive",
        "physical",
        "impression",
        "whether",
        "arrive",
        "without",
        "form",
        "lamina",
        "simulacrum",
        "arise",
        "internal",
        "motion",
        "body",
        "phenomenon",
        "purely",
        "mental",
        "sense",
        "disembodied",
        "state",
        "object",
        "pure",
        "consciousness",
        "conceived",
        "separate",
        "embodiment",
        "elementary",
        "sensation",
        "pleasure",
        "pain",
        "accordingly",
        "rather",
        "abstract",
        "moral",
        "principle",
        "abstract",
        "concept",
        "goodness",
        "badness",
        "fundamental",
        "guide",
        "good",
        "bad",
        "since",
        "sentient",
        "creature",
        "naturally",
        "attracted",
        "one",
        "repelled",
        "function",
        "human",
        "mind",
        "part",
        "soul",
        "located",
        "chest",
        "seek",
        "higher",
        "thing",
        "maximize",
        "pleasure",
        "minimize",
        "pain",
        "entire",
        "objective",
        "risk",
        "substantial",
        "one",
        "may",
        "miscalculate",
        "since",
        "subject",
        "false",
        "belief",
        "error",
        "cognitive",
        "process",
        "unlike",
        "hellenistic",
        "school",
        "aristotle",
        "stoic",
        "epicurean",
        "greatly",
        "interested",
        "formal",
        "logic",
        "certainly",
        "needed",
        "theory",
        "formation",
        "belief",
        "far",
        "ideational",
        "content",
        "thinking",
        "thought",
        "something",
        "concerned",
        "epicurus",
        "proposed",
        "radically",
        "reductive",
        "hypothesis",
        "sensation",
        "occur",
        "result",
        "thin",
        "film",
        "emitted",
        "object",
        "enter",
        "appropriate",
        "sense",
        "organ",
        "simulacrum",
        "fine",
        "enough",
        "penetrate",
        "directly",
        "mind",
        "located",
        "chest",
        "imagine",
        "object",
        "eg",
        "god",
        "process",
        "invoked",
        "explain",
        "dream",
        "image",
        "many",
        "kind",
        "mental",
        "impression",
        "including",
        "impression",
        "constituting",
        "voluntary",
        "thought",
        "latter",
        "occurs",
        "attend",
        "one",
        "another",
        "exiguous",
        "physical",
        "film",
        "continuously",
        "floating",
        "air",
        "manage",
        "attend",
        "voluntarily",
        "whichever",
        "film",
        "choose",
        "explained",
        "surviving",
        "source",
        "imagining",
        "thing",
        "thus",
        "nothing",
        "picking",
        "simulacrum",
        "emitted",
        "may",
        "endure",
        "beyond",
        "life",
        "thing",
        "hence",
        "imagine",
        "dead",
        "mental",
        "image",
        "privileged",
        "status",
        "plato",
        "gave",
        "noetic",
        "idea",
        "form",
        "always",
        "true",
        "differ",
        "information",
        "provided",
        "sens",
        "mistake",
        "occur",
        "wrong",
        "belief",
        "associated",
        "impression",
        "example",
        "mental",
        "image",
        "dead",
        "person",
        "follows",
        "still",
        "exists",
        "ghostly",
        "form",
        "epicurean",
        "physic",
        "prof",
        "impossible",
        "great",
        "barrier",
        "correct",
        "thinking",
        "language",
        "name",
        "death",
        "may",
        "suggest",
        "death",
        "dead",
        "something",
        "person",
        "experience",
        "hence",
        "deserves",
        "feared",
        "word",
        "must",
        "understood",
        "basic",
        "sense",
        "epicurus",
        "say",
        "opposed",
        "call",
        "empty",
        "sound",
        "lh",
        "culprit",
        "misunderstanding",
        "always",
        "illegitimate",
        "inference",
        "sensation",
        "latter",
        "including",
        "thought",
        "produced",
        "filmlike",
        "image",
        "example",
        "belief",
        "centaur",
        "exist",
        "epicurus",
        "deny",
        "thought",
        "centaur",
        "corresponds",
        "real",
        "stimulus",
        "form",
        "simulacrum",
        "theory",
        "knowledge",
        "commits",
        "view",
        "must",
        "flimsy",
        "lamina",
        "float",
        "air",
        "become",
        "distorted",
        "interfere",
        "one",
        "another",
        "thus",
        "upper",
        "part",
        "human",
        "figure",
        "may",
        "get",
        "loosely",
        "attached",
        "lower",
        "part",
        "horse",
        "know",
        "unreal",
        "combination",
        "physically",
        "impossible",
        "horse",
        "human",
        "being",
        "mature",
        "different",
        "rate",
        "example",
        "eat",
        "different",
        "food",
        "see",
        "lucretius",
        "cf",
        "palaephatus",
        "incredible",
        "tale",
        "belief",
        "whether",
        "sensation",
        "correspond",
        "actually",
        "existing",
        "thing",
        "must",
        "tested",
        "knowledge",
        "world",
        "informed",
        "epicurean",
        "theory",
        "ability",
        "reason",
        "calculate",
        "logismos",
        "function",
        "image",
        "faculty",
        "let",
        "u",
        "infer",
        "analogy",
        "visible",
        "world",
        "invisible",
        "also",
        "may",
        "recognize",
        "pleasure",
        "chosen",
        "time",
        "since",
        "immediate",
        "pleasure",
        "may",
        "lead",
        "longterm",
        "pain",
        "harm",
        "letter",
        "menoeceus",
        "lm",
        "one",
        "must",
        "know",
        "something",
        "nature",
        "pleasure",
        "order",
        "pursue",
        "rationally",
        "likewise",
        "pain",
        "epicurus",
        "appears",
        "us",
        "term",
        "pleasure",
        "pain",
        "hêdonê",
        "algêdôn",
        "strictly",
        "reference",
        "physical",
        "pathê",
        "sensation",
        "experienced",
        "via",
        "nonrational",
        "soul",
        "distributed",
        "throughout",
        "body",
        "rational",
        "part",
        "mind",
        "positive",
        "negative",
        "experience",
        "prominent",
        "among",
        "negative",
        "mental",
        "state",
        "fear",
        "fear",
        "unreal",
        "danger",
        "death",
        "death",
        "epicurus",
        "insists",
        "nothing",
        "u",
        "since",
        "exist",
        "death",
        "death",
        "occurs",
        "exist",
        "lm",
        "one",
        "frightened",
        "empty",
        "name",
        "death",
        "fear",
        "persist",
        "since",
        "must",
        "eventually",
        "die",
        "fear",
        "one",
        "source",
        "perturbation",
        "tarakhê",
        "worse",
        "curse",
        "physical",
        "pain",
        "absence",
        "fear",
        "ataraxy",
        "lack",
        "perturbation",
        "ataraxy",
        "together",
        "freedom",
        "physical",
        "pain",
        "one",
        "way",
        "specifying",
        "goal",
        "life",
        "epicurus",
        "also",
        "positive",
        "state",
        "mind",
        "epicurus",
        "identifies",
        "special",
        "term",
        "khara",
        "joy",
        "opposed",
        "hêdonê",
        "pleasure",
        "ie",
        "physical",
        "pleasure",
        "state",
        "depend",
        "belief",
        "whether",
        "true",
        "false",
        "epicurus",
        "treat",
        "khara",
        "end",
        "part",
        "end",
        "living",
        "rather",
        "tends",
        "describe",
        "goal",
        "negation",
        "freedom",
        "bodily",
        "pain",
        "mental",
        "disturbance",
        "lm",
        "however",
        "happiness",
        "eudaimonia",
        "according",
        "epicurus",
        "simply",
        "neutral",
        "privative",
        "condition",
        "rather",
        "form",
        "pleasure",
        "right",
        "epicurus",
        "called",
        "catastematic",
        "following",
        "cicero",
        "latin",
        "translation",
        "static",
        "opposed",
        "kinetic",
        "pleasure",
        "although",
        "precise",
        "nature",
        "distinction",
        "debated",
        "kinetic",
        "pleasure",
        "seem",
        "nonnecessary",
        "kind",
        "see",
        "resulting",
        "agreeable",
        "odor",
        "sound",
        "rather",
        "deriving",
        "replenishment",
        "case",
        "hunger",
        "thirst",
        "philosophical",
        "school",
        "known",
        "cyrenaics",
        "advocated",
        "increasing",
        "desire",
        "seeking",
        "ever",
        "new",
        "way",
        "gratifying",
        "epicurus",
        "objected",
        "pleasure",
        "necessarily",
        "accompanied",
        "distress",
        "depend",
        "upon",
        "lack",
        "painful",
        "plato",
        "demonstrated",
        "problematic",
        "nature",
        "kind",
        "pleasure",
        "see",
        "gorgias",
        "ca",
        "philebus",
        "ed",
        "ac",
        "addition",
        "augmenting",
        "desire",
        "tends",
        "intensify",
        "rather",
        "reduce",
        "mental",
        "agitation",
        "distressful",
        "state",
        "mind",
        "epicurean",
        "philosophy",
        "sought",
        "eliminate",
        "catastematic",
        "pleasure",
        "contrary",
        "taken",
        "state",
        "rather",
        "process",
        "pleasure",
        "accompanies",
        "wellbeing",
        "cyrenaics",
        "others",
        "cicero",
        "maintained",
        "turn",
        "condition",
        "pleasurable",
        "rather",
        "neutral",
        "neither",
        "pleasurable",
        "painful",
        "epicurus",
        "fear",
        "perfectly",
        "legitimate",
        "desire",
        "epicurus",
        "offer",
        "classification",
        "desire",
        "three",
        "type",
        "natural",
        "others",
        "empty",
        "natural",
        "desire",
        "two",
        "sort",
        "necessary",
        "merely",
        "natural",
        "see",
        "cooper",
        "natural",
        "necessary",
        "look",
        "happiness",
        "physical",
        "wellbeing",
        "life",
        "lm",
        "unnecessary",
        "natural",
        "desire",
        "pleasant",
        "thing",
        "like",
        "sweet",
        "odor",
        "goodtasting",
        "food",
        "drink",
        "various",
        "pleasurable",
        "activity",
        "sort",
        "simple",
        "smelling",
        "touching",
        "tasting",
        "empty",
        "desire",
        "object",
        "thing",
        "designated",
        "empty",
        "sound",
        "immortality",
        "exist",
        "human",
        "being",
        "correspond",
        "genuine",
        "need",
        "hold",
        "desire",
        "great",
        "wealth",
        "mark",
        "fame",
        "statue",
        "provide",
        "security",
        "genuine",
        "object",
        "desire",
        "desire",
        "accordingly",
        "never",
        "satisfied",
        "corresponding",
        "fear",
        "eg",
        "fear",
        "death",
        "ever",
        "alleviated",
        "since",
        "neither",
        "genuine",
        "referent",
        "ie",
        "death",
        "something",
        "harmful",
        "present",
        "exist",
        "wealth",
        "power",
        "salve",
        "anxiety",
        "empty",
        "fear",
        "desire",
        "based",
        "epicurus",
        "call",
        "kenodoxia",
        "empty",
        "belief",
        "main",
        "source",
        "perturbation",
        "pain",
        "civilized",
        "life",
        "elementary",
        "danger",
        "brought",
        "control",
        "since",
        "reason",
        "people",
        "driven",
        "strive",
        "limitless",
        "wealth",
        "power",
        "subjecting",
        "danger",
        "imagine",
        "avoiding",
        "although",
        "human",
        "being",
        "like",
        "everything",
        "else",
        "composed",
        "atom",
        "move",
        "according",
        "fixed",
        "law",
        "action",
        "wholly",
        "predetermined",
        "rather",
        "entertain",
        "paralyzing",
        "doctrine",
        "epicurus",
        "say",
        "would",
        "better",
        "believe",
        "old",
        "myth",
        "perversity",
        "lm",
        "enables",
        "u",
        "wrest",
        "liberty",
        "mechanistic",
        "universe",
        "existence",
        "certain",
        "randomness",
        "motion",
        "atom",
        "take",
        "form",
        "minute",
        "swerve",
        "forward",
        "course",
        "evidence",
        "doctrine",
        "derives",
        "chiefly",
        "later",
        "source",
        "including",
        "lucretius",
        "cicero",
        "entirely",
        "clear",
        "swerve",
        "operates",
        "may",
        "involve",
        "small",
        "angle",
        "deviation",
        "original",
        "path",
        "else",
        "slight",
        "shift",
        "sideways",
        "perhaps",
        "single",
        "minimum",
        "change",
        "direction",
        "idea",
        "minute",
        "veering",
        "said",
        "occur",
        "determinate",
        "time",
        "place",
        "le",
        "strange",
        "modern",
        "age",
        "quantum",
        "physic",
        "epicurus",
        "time",
        "gave",
        "rise",
        "mocking",
        "critique",
        "problematic",
        "today",
        "swerve",
        "might",
        "explain",
        "freedom",
        "indeed",
        "epicurus",
        "idea",
        "like",
        "event",
        "introduce",
        "indeterminacy",
        "universe",
        "soul",
        "atom",
        "thanks",
        "fineness",
        "susceptible",
        "effect",
        "deviation",
        "coarser",
        "matter",
        "swerve",
        "could",
        "least",
        "represent",
        "breach",
        "strict",
        "predestination",
        "human",
        "behavior",
        "might",
        "enough",
        "epicurus",
        "purpose",
        "may",
        "invoked",
        "swerve",
        "order",
        "explain",
        "voluntary",
        "action",
        "claiming",
        "action",
        "deriving",
        "immediately",
        "ultimately",
        "swerve",
        "swerve",
        "soul",
        "atom",
        "may",
        "wished",
        "merely",
        "establish",
        "possibility",
        "action",
        "deriving",
        "position",
        "soul",
        "constituent",
        "atom",
        "time",
        "plus",
        "effect",
        "collision",
        "among",
        "resulting",
        "given",
        "movement",
        "time",
        "according",
        "lucretius",
        "swerve",
        "also",
        "put",
        "use",
        "solve",
        "cosmological",
        "problem",
        "initial",
        "moment",
        "atom",
        "moving",
        "uniformly",
        "single",
        "direction",
        "downward",
        "speed",
        "impossible",
        "conceive",
        "process",
        "atomic",
        "collision",
        "could",
        "begun",
        "save",
        "device",
        "seems",
        "curious",
        "idea",
        "given",
        "time",
        "like",
        "space",
        "infinite",
        "according",
        "epicurus",
        "need",
        "imagined",
        "time",
        "prior",
        "collision",
        "possibly",
        "tendency",
        "atom",
        "emerge",
        "collision",
        "preferred",
        "direction",
        "definition",
        "might",
        "lead",
        "time",
        "local",
        "region",
        "parallel",
        "motion",
        "swerve",
        "could",
        "serve",
        "reintroduce",
        "contact",
        "among",
        "event",
        "epicurus",
        "may",
        "thought",
        "atom",
        "moving",
        "uniform",
        "direction",
        "rather",
        "diverse",
        "one",
        "default",
        "position",
        "physical",
        "theory",
        "simplicity",
        "hypothesis",
        "thus",
        "may",
        "felt",
        "need",
        "explain",
        "diversity",
        "atom",
        "motion",
        "could",
        "arisen"
    ]
}