{
    "main_text": "How Far Can Consistency and Coherence Take Us? Categorical Self-Doubting Belief\n1. How Far Can Consistency and Coherence Take Us? Categorical Self-Doubting Belief\n\nIt might seem that consistency and coherence are not strong enough to\ntell us what the relation should be between the first order and the\nsecond order in cases of epistemic self-doubt, in the same way that\nthey don’t seem sufficient for explaining what is wrong with\nMoore-paradoxical statements (see entry on\n epistemic paradoxes).\n In the latter I assert either “p and I don’t\nbelieve p”, or “p and I believe\nnot-p”. There is a lack of fit between my belief and my\nbelief about my belief in either case, but the beliefs I hold\nsimultaneously are not inconsistent in content. What I say of myself\nwould be consistent and quite sensible if said about me by someone\nelse, thus: “p, but she doesn’t believe\np”. Similarly, there is nothing inconsistent in the claim\n“There is a cat in the distance and she is severely\nnear-sighted”, though there does seem to be a problem with the\nfirst-person claim “There is a cat in the distance and I am\nseverely near-sighted” if my assertion about the cat is made on\nthe basis of vision and I give no cue that I mean the second clause as\na qualification of the first. My confidence about the cat should have\nbeen tempered by my awareness of the limitation of my vision. If there\nare general principles of rationality that govern self-doubt of our\nfaculties or expertise it seems that they will have to go beyond\nconsistency among beliefs.\n\nHowever, consistency and coherence do impose constraints on what a\nsubject may believe about the reliability of her beliefs if combined\nwith an assumption that the subject knows what her beliefs are. (This\nis also found for Moore’s paradox, and is used in\nShoemaker’s approach to that problem; Shoemaker 1994.) One way\nof formulating an extreme case of believing that one’s epistemic\nsystem doesn’t function well is as attributing to oneself what\nSorensen calls anti-expertise (Sorensen 1988: 392f.). In the simplest\ntype of case, S is an anti-expert about p if\nand only if\n\n\nAnti-expertise (A)\n\nEither S believes p and p is false or S\ndoes not believe p and p is true. \n\n\nSorensen pointed out that if S is consistent and knows\nperfectly what her beliefs are, then she cannot believe she is an\nanti-expert. For if S believes p then, by perfect\nself-knowledge, she believes that she believes p, but her\nbeliefs that p and that she believes p are together\ninconsistent with both of the disjuncts of A. Similarly for the case\nwhere S does not believe p. This phenomenon generalizes\nfrom outright belief to degrees of belief, and from perfect knowledge\nof one’s beliefs to decent but imperfect knowledge of them (Egan\n& Elga 2005: 84ff.).\n\nBelieving you are an anti-expert is not compatible with coherence and\ndecent knowledge of your own beliefs. Denying that knowledge of our\nown beliefs is a requirement of rationality would not be helpful,\nsince usefully doubting that one’s beliefs are soundly formed\nwould seem to require a good idea of what they are. Egan and Elga\nfavor the view that your response to this fact about anti-expertise\nshould be to maintain coherence and decent self-knowledge of belief,\nand refrain from believing that you are an anti-expert. However, one\ncan imagine examples where the evidence that you are incompetent is so\noverwhelming that one might think you should believe you are an anti-expert even if\nit makes you incoherent (Conee 1987; Sorensen 1987, 1988; Richter\n1990; Christensen 2011).\n\nThe problem with self-attributing unreliability coherently\ndoesn’t go away if the degree of unreliability is more modest.\nConsider the following property:\n\n\nI’m not perfect (INP)\n\n\\(P((P(q) \\gt .99 \\amp -q )\\textrm{ or } (P(q) \\lt .01 \\amp q)) \\gt .05\\) \n\n\n\nThis says that you are at least 5% confident that you’re highly confident\nof q though it’s false or lack confidence in q\nthough it’s true. It is a softened version of anti-expertise,\nand you can’t coherently fulfill it, have \\(P(q) >.99\\), and\nhave perfect knowledge of your beliefs. For in that case \\(P(P(q) >\n.99) = 1\\), which means INP can only be true if \\(P(-q) > .05\\).\nBut \\(P(-q) > .05\\) implies \\(P(q) < .95\\) which contradicts\n\\(P(q) > .99\\). The point survives if you have imperfect but good\nknowledge of what your beliefs are. The self-doubt expressed through\nINP is quite modest, but is no more consistent than attributing to\noneself anti-expertise, and this will be so for any value of\nINP’s right hand side that is not equal to \\(P(-q)\\). \n\nEgan and Elga think that the significance of evidence of\nanti-reliability is taken into account by seeing it as obligating a\nsubject to revise her first-order belief. However, their view implies\nthat to be rational such a revision must be done without attributing\nanti-expertise to oneself. One can revise whenever one wants of\ncourse, but any revision should have a reason or motivation. If one\ndoes not give any credence at all to the possibility one is an\nanti-expert, then what is one’s reason to revise one’s\nfirst-order belief? There would seem to be no other way to take on\nboard and acknowledge the evidence of your anti-expertise than to give\nsome credence to its possibility. Egan and Elga say that the belief\nthe evidence should lead a subject to is that she has been an\nanti-expert and that should lead her to revise (Egan & Elga 2005:\n86). But if she avoids\nincoherence by attributing anti-expertise only to a previous self,\nthen that belief can’t be what leads her to revise her current\nview. If she does not attribute anti-expertise to her current self\nthen she doesn’t give her current self any reason to revise.\n\nThe same problem can be seen with Egan and Elga’s treatment of\ncases of self-attributing less extreme unreliability (such as INP)\nthat they regard as unproblematic. Consider a person with growing\nevidence that his memory isn’t what it once was. What effect\nshould this have on his beliefs about the names of students? They\ncompare what happens to his confidence that a given student is named\n“Sarah” when he hears counterevidence—overhearing\nsomeone calling her “Kate” for example—in the case\nwhere he has and the case where he hasn’t taken the evidence of\nhis decline in memory into account. Via a Bayesian calculation they\nconclude that when he hasn’t taken into account the evidence\nabout his memory, the counterevidence to his particular belief that\nthe student is named Sarah does reduce his belief that she is Sarah,\nbut it does so much less than it would have if he had taken the\nevidence about his memory into account.\n\nBut this analysis represents taking into account the evidence about\none’s memory only implicitly, as an effect that that evidence\nalready had on one’s prior probability that the student is\nSarah. That effect is the difference between a .99 and a .90 prior\nprobability, or degree of belief. The distinction that is then derived\nbetween the effects that counterevidence can have on the self-doubter\nand the non-self-doubter is just the familiar point that\ncounterevidence will have a greater effect the lower one’s\ninitial probability. \n\nThis doesn’t tell us how to assimilate news about one’s\ndecline in reliability to the first-order belief, but only how to\ntreat other evidence about the first-order matter once one has done\nso. The question was supposed to be how the evidence about memory\nshould affect our beliefs, and to answer that requires saying how and\nwhy that evidence about his memory should make our subject have a .90\nrather than .99 initial confidence that the student was Sarah. Surely\none must attribute reduced reliability to oneself if one is to have\nany reason to revise one’s first-order belief that the student\nwas Sarah on the basis of evidence of diminished reliability. Even a\nraw feel of redness of a flower must become an ascription of red to\nthe flower in order for one’s experience of it to affect other\nbeliefs such as that it would or wouldn’t be an appropriate\ngift. Even evidence suggesting a small amount of unreliability, as\nwith INP above, presents us with a trilemma: either we incoherently\nattribute unreliability to ourselves but revise and have a\njustification for doing so, or we coherently fail to attribute\nunreliability and revise without justification for doing so, or we\nremain coherent by failing to attribute unreliability and don’t\nrevise, ignoring evidence of our unreliability. It seems that it is\nnot possible for a rational subject to acknowledge evidence of her own\nunreliability and update her first-order belief on the basis of\nit.\n\nThis approach using consistency (or coherence) plus self-knowledge of\nbelief gives a way of representing what a state of self-doubt is. It\nsensibly implies that it is irrational to stay in such a state but it\nalso implies that it is irrational to be in it in the first place,\nmaking it unclear how self-doubt could be a reason to revise. The\napproach identifies a kind of matching that rationality demands: give\nno more credence to the possibility that one is a bad judge of\nq than one gives to not-q. However, it leaves other\nquestions unanswered. If the rational subject finds herself doubting\nher judgment, should she defer to her first-order evidence, or her\nsecond-order evidence about the reliability of her first-order\njudgment? What are the rules by which she should decide, and how can\nthey be justified?\n",
    "section_title": "1. How Far Can Consistency and Coherence Take Us? Categorical Self-Doubting Belief",
    "entry_title": "Epistemic Self-Doubt",
    "hierarchy_title": "Epistemic Self-Doubt || How Far Can Consistency and Coherence Take Us? Categorical Self-Doubting Belief",
    "tokenized_text": [
        "far",
        "consistency",
        "coherence",
        "take",
        "u",
        "categorical",
        "selfdoubting",
        "belief",
        "far",
        "consistency",
        "coherence",
        "take",
        "u",
        "categorical",
        "selfdoubting",
        "belief",
        "might",
        "seem",
        "consistency",
        "coherence",
        "strong",
        "enough",
        "tell",
        "u",
        "relation",
        "first",
        "order",
        "second",
        "order",
        "case",
        "epistemic",
        "selfdoubt",
        "way",
        "seem",
        "sufficient",
        "explaining",
        "wrong",
        "mooreparadoxical",
        "statement",
        "see",
        "entry",
        "epistemic",
        "paradox",
        "latter",
        "assert",
        "either",
        "p",
        "believe",
        "p",
        "p",
        "believe",
        "notp",
        "lack",
        "fit",
        "belief",
        "belief",
        "belief",
        "either",
        "case",
        "belief",
        "hold",
        "simultaneously",
        "inconsistent",
        "content",
        "say",
        "would",
        "consistent",
        "quite",
        "sensible",
        "said",
        "someone",
        "else",
        "thus",
        "p",
        "believe",
        "p",
        "similarly",
        "nothing",
        "inconsistent",
        "claim",
        "cat",
        "distance",
        "severely",
        "nearsighted",
        "though",
        "seem",
        "problem",
        "firstperson",
        "claim",
        "cat",
        "distance",
        "severely",
        "nearsighted",
        "assertion",
        "cat",
        "made",
        "basis",
        "vision",
        "give",
        "cue",
        "mean",
        "second",
        "clause",
        "qualification",
        "first",
        "confidence",
        "cat",
        "tempered",
        "awareness",
        "limitation",
        "vision",
        "general",
        "principle",
        "rationality",
        "govern",
        "selfdoubt",
        "faculty",
        "expertise",
        "seems",
        "go",
        "beyond",
        "consistency",
        "among",
        "belief",
        "however",
        "consistency",
        "coherence",
        "impose",
        "constraint",
        "subject",
        "may",
        "believe",
        "reliability",
        "belief",
        "combined",
        "assumption",
        "subject",
        "know",
        "belief",
        "also",
        "found",
        "moore",
        "paradox",
        "used",
        "shoemaker",
        "approach",
        "problem",
        "shoemaker",
        "one",
        "way",
        "formulating",
        "extreme",
        "case",
        "believing",
        "one",
        "epistemic",
        "system",
        "function",
        "well",
        "attributing",
        "oneself",
        "sorensen",
        "call",
        "antiexpertise",
        "sorensen",
        "f",
        "simplest",
        "type",
        "case",
        "antiexpert",
        "p",
        "antiexpertise",
        "either",
        "belief",
        "p",
        "p",
        "false",
        "believe",
        "p",
        "p",
        "true",
        "sorensen",
        "pointed",
        "consistent",
        "know",
        "perfectly",
        "belief",
        "believe",
        "antiexpert",
        "belief",
        "p",
        "perfect",
        "selfknowledge",
        "belief",
        "belief",
        "p",
        "belief",
        "p",
        "belief",
        "p",
        "together",
        "inconsistent",
        "disjuncts",
        "a",
        "similarly",
        "case",
        "believe",
        "p",
        "phenomenon",
        "generalizes",
        "outright",
        "belief",
        "degree",
        "belief",
        "perfect",
        "knowledge",
        "one",
        "belief",
        "decent",
        "imperfect",
        "knowledge",
        "egan",
        "elga",
        "ff",
        "believing",
        "antiexpert",
        "compatible",
        "coherence",
        "decent",
        "knowledge",
        "belief",
        "denying",
        "knowledge",
        "belief",
        "requirement",
        "rationality",
        "would",
        "helpful",
        "since",
        "usefully",
        "doubting",
        "one",
        "belief",
        "soundly",
        "formed",
        "would",
        "seem",
        "require",
        "good",
        "idea",
        "egan",
        "elga",
        "favor",
        "view",
        "response",
        "fact",
        "antiexpertise",
        "maintain",
        "coherence",
        "decent",
        "selfknowledge",
        "belief",
        "refrain",
        "believing",
        "antiexpert",
        "however",
        "one",
        "imagine",
        "example",
        "evidence",
        "incompetent",
        "overwhelming",
        "one",
        "might",
        "think",
        "believe",
        "antiexpert",
        "even",
        "make",
        "incoherent",
        "conee",
        "sorensen",
        "richter",
        "christensen",
        "problem",
        "selfattributing",
        "unreliability",
        "coherently",
        "go",
        "away",
        "degree",
        "unreliability",
        "modest",
        "consider",
        "following",
        "property",
        "perfect",
        "inp",
        "p",
        "p",
        "q",
        "gt",
        "amp",
        "q",
        "textrm",
        "p",
        "q",
        "lt",
        "amp",
        "q",
        "gt",
        "say",
        "least",
        "confident",
        "highly",
        "confident",
        "q",
        "though",
        "false",
        "lack",
        "confidence",
        "q",
        "though",
        "true",
        "softened",
        "version",
        "antiexpertise",
        "coherently",
        "fulfill",
        "p",
        "q",
        "perfect",
        "knowledge",
        "belief",
        "case",
        "p",
        "p",
        "q",
        "mean",
        "inp",
        "true",
        "p",
        "q",
        "p",
        "q",
        "implies",
        "p",
        "q",
        "contradicts",
        "p",
        "q",
        "point",
        "survives",
        "imperfect",
        "good",
        "knowledge",
        "belief",
        "selfdoubt",
        "expressed",
        "inp",
        "quite",
        "modest",
        "consistent",
        "attributing",
        "oneself",
        "antiexpertise",
        "value",
        "inp",
        "right",
        "hand",
        "side",
        "equal",
        "p",
        "q",
        "egan",
        "elga",
        "think",
        "significance",
        "evidence",
        "antireliability",
        "taken",
        "account",
        "seeing",
        "obligating",
        "subject",
        "revise",
        "firstorder",
        "belief",
        "however",
        "view",
        "implies",
        "rational",
        "revision",
        "must",
        "done",
        "without",
        "attributing",
        "antiexpertise",
        "oneself",
        "one",
        "revise",
        "whenever",
        "one",
        "want",
        "course",
        "revision",
        "reason",
        "motivation",
        "one",
        "give",
        "credence",
        "possibility",
        "one",
        "antiexpert",
        "one",
        "reason",
        "revise",
        "one",
        "firstorder",
        "belief",
        "would",
        "seem",
        "way",
        "take",
        "board",
        "acknowledge",
        "evidence",
        "antiexpertise",
        "give",
        "credence",
        "possibility",
        "egan",
        "elga",
        "say",
        "belief",
        "evidence",
        "lead",
        "subject",
        "antiexpert",
        "lead",
        "revise",
        "egan",
        "elga",
        "avoids",
        "incoherence",
        "attributing",
        "antiexpertise",
        "previous",
        "self",
        "belief",
        "lead",
        "revise",
        "current",
        "view",
        "attribute",
        "antiexpertise",
        "current",
        "self",
        "give",
        "current",
        "self",
        "reason",
        "revise",
        "problem",
        "seen",
        "egan",
        "elga",
        "treatment",
        "case",
        "selfattributing",
        "le",
        "extreme",
        "unreliability",
        "inp",
        "regard",
        "unproblematic",
        "consider",
        "person",
        "growing",
        "evidence",
        "memory",
        "effect",
        "belief",
        "name",
        "student",
        "compare",
        "happens",
        "confidence",
        "given",
        "student",
        "named",
        "sarah",
        "hears",
        "counterevidenceoverhearing",
        "someone",
        "calling",
        "kate",
        "examplein",
        "case",
        "case",
        "taken",
        "evidence",
        "decline",
        "memory",
        "account",
        "via",
        "bayesian",
        "calculation",
        "conclude",
        "taken",
        "account",
        "evidence",
        "memory",
        "counterevidence",
        "particular",
        "belief",
        "student",
        "named",
        "sarah",
        "reduce",
        "belief",
        "sarah",
        "much",
        "le",
        "would",
        "taken",
        "evidence",
        "memory",
        "account",
        "analysis",
        "represents",
        "taking",
        "account",
        "evidence",
        "one",
        "memory",
        "implicitly",
        "effect",
        "evidence",
        "already",
        "one",
        "prior",
        "probability",
        "student",
        "sarah",
        "effect",
        "difference",
        "prior",
        "probability",
        "degree",
        "belief",
        "distinction",
        "derived",
        "effect",
        "counterevidence",
        "selfdoubter",
        "nonselfdoubter",
        "familiar",
        "point",
        "counterevidence",
        "greater",
        "effect",
        "lower",
        "one",
        "initial",
        "probability",
        "tell",
        "u",
        "assimilate",
        "news",
        "one",
        "decline",
        "reliability",
        "firstorder",
        "belief",
        "treat",
        "evidence",
        "firstorder",
        "matter",
        "one",
        "done",
        "question",
        "supposed",
        "evidence",
        "memory",
        "affect",
        "belief",
        "answer",
        "requires",
        "saying",
        "evidence",
        "memory",
        "make",
        "subject",
        "rather",
        "initial",
        "confidence",
        "student",
        "sarah",
        "surely",
        "one",
        "must",
        "attribute",
        "reduced",
        "reliability",
        "oneself",
        "one",
        "reason",
        "revise",
        "one",
        "firstorder",
        "belief",
        "student",
        "sarah",
        "basis",
        "evidence",
        "diminished",
        "reliability",
        "even",
        "raw",
        "feel",
        "redness",
        "flower",
        "must",
        "become",
        "ascription",
        "red",
        "flower",
        "order",
        "one",
        "experience",
        "affect",
        "belief",
        "would",
        "appropriate",
        "gift",
        "even",
        "evidence",
        "suggesting",
        "small",
        "amount",
        "unreliability",
        "inp",
        "present",
        "u",
        "trilemma",
        "either",
        "incoherently",
        "attribute",
        "unreliability",
        "revise",
        "justification",
        "coherently",
        "fail",
        "attribute",
        "unreliability",
        "revise",
        "without",
        "justification",
        "remain",
        "coherent",
        "failing",
        "attribute",
        "unreliability",
        "revise",
        "ignoring",
        "evidence",
        "unreliability",
        "seems",
        "possible",
        "rational",
        "subject",
        "acknowledge",
        "evidence",
        "unreliability",
        "update",
        "firstorder",
        "belief",
        "basis",
        "approach",
        "using",
        "consistency",
        "coherence",
        "plus",
        "selfknowledge",
        "belief",
        "give",
        "way",
        "representing",
        "state",
        "selfdoubt",
        "sensibly",
        "implies",
        "irrational",
        "stay",
        "state",
        "also",
        "implies",
        "irrational",
        "first",
        "place",
        "making",
        "unclear",
        "selfdoubt",
        "could",
        "reason",
        "revise",
        "approach",
        "identifies",
        "kind",
        "matching",
        "rationality",
        "demand",
        "give",
        "credence",
        "possibility",
        "one",
        "bad",
        "judge",
        "q",
        "one",
        "give",
        "notq",
        "however",
        "leaf",
        "question",
        "unanswered",
        "rational",
        "subject",
        "find",
        "doubting",
        "judgment",
        "defer",
        "firstorder",
        "evidence",
        "secondorder",
        "evidence",
        "reliability",
        "firstorder",
        "judgment",
        "rule",
        "decide",
        "justified"
    ]
}