{
    "main_text": "Inference\n5. Inference\n\n\nLogic is developed in classical India within the traditions of\nepistemology. Inference is a second knowledge source, a means whereby\nwe can know things not immediately evident through perception. Oetke\n(2004) finds three roots to the earliest concerns with logic in India:\n(1) common-sense inference, (2) establishment of doctrines in the frame\nof scientific treatises (śāstra), and (3)\njustification of tenets in a debate. The three of these come together\n(though the latter two are predominant) within the epistemological\ntraditions in an almost universal regard of inference as a knowledge\nsource.\n\nSeeing classical Indian logic as part of epistemology, as explaining\nhow we know facts through the mediation of our knowledge of other\nfacts, makes it easy to understand why both the Buddhist and Vedic\nschools count a valid but unsound argument as fallacious: knowledge\nis not generated. Classical Indian philosophers are not focused on logic\nper se, but rather on a psychological process whereby we come to know\nthings indirectly, by way of a sign, hetu or\nliṅga, an indication of something\ncurrently beyond the range of the senses, whether at a distance\nspatially or temporally or of a sort (such as atoms or God or the\nBuddha mind) that by nature cannot be directly perceived.\n\nThe two greatest names for classical Indian logic belong to logicians\nof the Buddhist Yogācāra school, Dignāga (sixth century)\nand Dharmakīrti (early seventh century). Dignāga laid\nout all the possible relationships of inclusion and exclusion for the\nextensions of two terms called the prover or “sign,” hetu, and\nthe probandum, sādhya, the property “to be proved.”\nThereby he revealed the underpinnings of the\npramāṇa of inference in terms of\nsets of particulars, which, according to Yogācāra ontology,\nare the only reals. Dharmakīrti classified inferences based\non the ontological nature of the class-inclusion relationship that\nunderpins all inference as a knowledge source. Earlier philosophers,\nboth Buddhist and non-Buddhist, provide examples of everyday reasoning,\nseveral of which are abductive in character, informal reasoning to the\nbest explanation, from sight of a swollen river, for example, says\nVātsyāyana in his commentary on the inference\nsūtra (1.1.5) of the\nNyāya-sūtra, to the conclusion that it has\nrained upstream. But there are also instances of inferences comprised\nof deductive, extrapolative, and sometimes properly inductive reasoning\non topics of everyday life as well as philosophy in numerous\npre-Dignāga texts of several schools. It is not true, as is\nsometimes claimed, that no one before Dignāga had the notion of an\ninference-underpinning “pervasion,” vyāpti, of a prover\nproperty by a property to be proved. Dignāga does however get the\ncredit for the earliest systematization, which employs three terms, a\nsite or subject of a proposed inference\n(pakṣa, the mountain in the stock example\nof an inference from sight of smoke on a mountain to knowledge of fire\non the mountain), the prover or prover property (hetu,\nsmokiness), and the probandum (sādhya, fieriness).\n\n\nDignāga, it should be stressed, as a nominalist sees inference\nas proceeding from knowledge of particulars to other knowledge of\nparticulars (avoiding the universals of the realists, as nicely\nexplained by Hayes 1988 with reference to the Buddhist apoha,\n“exclusion,” theory of concepts). Dignāga formulates a threefold\ntest for a good prover, trairūpya-hetu:\n\nthe prover’s occurrence on the inferential subject of a proposed inference must\nbe known to the subject S\nthe prover’s occurrence at least once together with the probandum\nmust be known to S\nno counter-case of a prover occurring without the probandum must\nbe known to S.\n\n\n\nUddyotakara in his Nyāya-sūtra commentary\nincorporates Dignāga’s ideas to formalize many of\nVātsyāyana’s informal inferences. The Nyāya philosopher\nowes almost everything to his Buddhist adversaries, as opposed to his\nNyāya predecessors, but he does criticize and alter what he sees\nas the certification conditions of inference as a knowledge source,\ncombining Dignāga’s second and third tests into a single\nrequirement, knowledge of pervasion. He also adds a third condition,\nthe subject’s having to “reflect” and put the information together, so\nto say:\n\npakṣa-dharmatā: the prover\nhas to be known to S as qualifying the inferential subject\nvyāpti-smaraṇa: the prover’s\nbeing pervaded by the probandum has to be remembered by S\nliṅga-parāmarśa: S\nmust connect by reflection the pervasion with the inferential subject.\n\n\n\nThe upshot of the addition may be interpreted as the recognition\nthat knowledge is not closed under deduction considered in abstraction\nfrom the psychological process of “reflection.” But through that\nprocess, epistemic warrant—or “certainty,”\nniścaya—passes from premises to conclusion, and\nwe act unhesitatingly, for example, to put a fire on yonder mountain\nout.\n\n\nThings are yet more complicated. Inferential knowledge is defeasible,\nor, more precisely stated, what a subject takes to be inferential\nknowledge may turn out to be pseudo, non-genuine, a false cognition\nimitating a true one, or even in Gettier-style cases an accidentally\ntrue cognition masquerading as one genuinely inference-born. Knowledge\nhas a social dimension. Not only would awareness of a counterexample\nbe a defeater, but also if someone were to present a counterinference\nto a conclusion opposed to ours, no longer would we have inferential\nknowledge. Awareness of any of several kinds of “blocker”\nof “reflection” can undermine the generalization on which\nsuch reflection depends. There are potential preventers of inferential\nawareness, “defeaters,” bādhaka, leading to\nbelief relinquishment by someone who has hitherto not noticed a\ncounterexample or the like and who has thus drawn a conclusion\nerroneously.\n\n\nHowever, one should not think that the epistemologists’ inference is\nnon-monotonic, as established by Taber (2004) against Oetke (1996) in\nparticular. The paradigm logical form embedded in a good inference is\nmonotonic. New information is irrelevant to the validity of the\npattern itself, although it may well be relevant to a subject’s\njustification for acceptance of the premises. Examples of inferences\nin classical texts often seem non-monotonic because fallibility\nattaches to the premises. Such fallibility of course passes to the\nconclusion, too. (Cf. Israel 1980 who similarly voices an\nepistemological complaint against the very idea of\nnon-monotonic logic, according to Koons 2013.)\n\n\nTargeting the relationship of pervasion in Uddyotakara’s second\ncondition, vyāpti-smaraṇa, which\nappears to be the ontological underpinning of Dignāga’s conditions\n(2) and (3), Dharmakīrti divides inferences into three\nkinds:\n\nsva-bhāva (self-nature: “It’s a tree because it’s a\nśiṃśapā oak”)\ntad-utpatti (causality: “Fire is there because\nsmoke is there”)\nanupalabdhi (non-perception: “There is no pot\nhere because none is perceived”).\n\n\n\nYogācāra holds that with the first type of inference the\nunderpinning pervasion is “internal” (antar-vyāpti). We\nmay think of this as an internal relation between concepts and thus as\nsimilar to the a priori of Western philosophy. But it is\nactually a technical point about whether the term that picks out the\ninferential subject or subjects—think of the\npakṣa as a set—closes it off from being\nincluded in the inductive base of the generalization (or extrapolation,\naccording to Ganeri 2001b) that gives us knowledge of a pervasion\nrelationship. Mīmāṃsā and\nNyāya rule out this kind of inference as begging the question: we\nwant to know whether the inferential subject possesses the probandum\nproperty and so to cite that subject itself, even a part of it, runs\ncounter to the very purpose of inference.\n\nLater Nyāya divides inferences not according to the ontology of\npervasion (which is mapped onto the\nNyāya-Vaiśeṣika ontology and\ncausal theory, sometimes not very successfully) but rather by the way a\npervasion is known:\n\nanvaya-vyatireka (“positive and negative”): inferences\nbased on positive and negative correlations where both are available,\ni.e., cases where, for example, smokiness and fieriness have been known\nto occur together, kitchen hearths, campfires, etc., like (it is\nclaimed) yonder smoky mountain where being-fiery is to be proved, taken\nalong with negative examples where the prover as well as\nthe probandum is known not to occur\nkevala-anvaya (“positive only”): inferences based on\npositive correlations only, where there are no known examples of an\nabsence of the probandum property, such as would have to be the case\nwith the universally present property, knowability (there is nothing\nthat is not knowable)\nkevala-vyatireka (“negative only”): inferences based on\nnegative correlations only where outside of the inferential subject there\nare no known cases of the probandum.\n\nMany of the inferences that Buddhists identify as hinging on an\n“internal pervasion” (antar-vyāpti)\nNyāya philosophers see as “negative only”\n(kevala-vyatireka). Taking a\nparticular śiṃśapā oak as\nthe pakṣa, we have the negative correlation proving it\nis a tree: whatever is not a tree, is not a\nśiṃśapā\noak, for example, a lotus.\n\nWestern interpretations and representations of inference as classically\nconceived have often missed its unity as a knowledge source. Ganeri\n(2001b: 20) claims that it is better to understand both the Buddhist and\nearly Nyāya patterns as “not enthymematic,” not skipping a step of\ngeneralization and then implicitly using universal instantiation (UI)\nand modus ponens (MP) in applying the rule to a case at hand.\nCase-based reasoning need not be interpreted as relying on universal\nquantifiers, and the representation of Schayer (1933) and others which\nuses them is misleading. Theirs is indeed misleading, and Ganeri\nappears to be right with regard to the early theories. But with late\nNyāya Schayer’s argument form of UI and MP misleads for yet\nanother reason, namely, failing to be sufficiently sensitive to the\nlogic of occurrence and non-occurrence of properties at a location, or\nqualifying a property-bearer, as Staal (1973) and others have brought\nout. Furthermore, Ganeri is right that in analyzing the pattern one\ntends to miss the unity of the causal theory that has one mental state\nbrought about by another. In the Nyāya theory, everything is\nintegrated in the notion of “reflection,”\nparāmarśa, as an inference’s proximate\ninstrumental cause or “trigger,” karaṇa.\nWhile not the only necessary condition, this one is the last in place,\nsecuring the occurrence of inferential knowledge.\n\nFollowing Matilal (1998), we can reconstruct such “reflection” as a\nsingular inference:\n\n\n(K)(SpHa) → (K)Sa\n\n\nThis says that on the condition that a subject knows that\nH-as-qualified-by-being-pervaded-by-S\nqualifies a, then the subject knows that Sa. The arrow\nshould be interpreted as depicting causal sufficiency, in line with\nUddyotakara and the later tradition.  “Reflection” is a\ncomplex mental state that is nevertheless a unity, both as a\nparticular cognition that can be a causal factor for the rise of\nanother cognition and as having intentionality, or “objecthood,”\nexpressible in a single sentence. Attempts to find a single rule are\nin consonance with both of these dimensions of the theory. But a lot\nof inductive depth is packed into the idea of a pervasion being known,\nand a lot about it is said that shows that there is generalization, at\nleast in the later Nyāya theory. Knowing a general rule is\nconsidered crucial, not just extrapolation to a next case. From\nUddyotakara on, Nyāya philosophers treat pervasion as the\nequivalent of a rule stating that—to use the language of sets\nand terms—the extension of the probandum term includes that of\nthe prover term, includes it entirely such that there is nothing that\nlocates the pervaded property (the prover) that does not also locate\nthe pervader (the probandum), as argued by Kisor Chakrabarti (1995)\namong others.\n\n The centralmost issue with inference, to consider the effort of\nlate Nyāya philosophers, is to make plain the logic of pervasion\nas well as how we know the universalized items, or entire extensions,\nof the terms figuring in our knowledge of such rules, the items that\nunderpin our knowledge of such inclusions, such naturally necessary\npervasions of a prover by a probandum property. Lots of work from the\nearliest focuses on fallacies and inference in the context of formal\ndebate. And there are many philosophical inferences advanced in the\nliteratures of the various schools, such as proofs of momentariness,\nthe existence of God, the possibility of liberation from birth and\nrebirth, and dozens more.\n",
    "section_title": "5. Inference",
    "entry_title": "Epistemology in Classical Indian Philosophy",
    "hierarchy_title": "Epistemology in Classical Indian Philosophy || Inference",
    "tokenized_text": [
        "inference",
        "inference",
        "logic",
        "developed",
        "classical",
        "india",
        "within",
        "tradition",
        "epistemology",
        "inference",
        "second",
        "knowledge",
        "source",
        "mean",
        "whereby",
        "know",
        "thing",
        "immediately",
        "evident",
        "perception",
        "oetke",
        "find",
        "three",
        "root",
        "earliest",
        "concern",
        "logic",
        "india",
        "commonsense",
        "inference",
        "establishment",
        "doctrine",
        "frame",
        "scientific",
        "treatise",
        "śāstra",
        "justification",
        "tenet",
        "debate",
        "three",
        "come",
        "together",
        "though",
        "latter",
        "two",
        "predominant",
        "within",
        "epistemological",
        "tradition",
        "almost",
        "universal",
        "regard",
        "inference",
        "knowledge",
        "source",
        "seeing",
        "classical",
        "indian",
        "logic",
        "part",
        "epistemology",
        "explaining",
        "know",
        "fact",
        "mediation",
        "knowledge",
        "fact",
        "make",
        "easy",
        "understand",
        "buddhist",
        "vedic",
        "school",
        "count",
        "valid",
        "unsound",
        "argument",
        "fallacious",
        "knowledge",
        "generated",
        "classical",
        "indian",
        "philosopher",
        "focused",
        "logic",
        "per",
        "se",
        "rather",
        "psychological",
        "process",
        "whereby",
        "come",
        "know",
        "thing",
        "indirectly",
        "way",
        "sign",
        "hetu",
        "liṅga",
        "indication",
        "something",
        "currently",
        "beyond",
        "range",
        "sens",
        "whether",
        "distance",
        "spatially",
        "temporally",
        "sort",
        "atom",
        "god",
        "buddha",
        "mind",
        "nature",
        "directly",
        "perceived",
        "two",
        "greatest",
        "name",
        "classical",
        "indian",
        "logic",
        "belong",
        "logician",
        "buddhist",
        "yogācāra",
        "school",
        "dignāga",
        "sixth",
        "century",
        "dharmakīrti",
        "early",
        "seventh",
        "century",
        "dignāga",
        "laid",
        "possible",
        "relationship",
        "inclusion",
        "exclusion",
        "extension",
        "two",
        "term",
        "called",
        "prover",
        "sign",
        "hetu",
        "probandum",
        "sādhya",
        "property",
        "proved",
        "thereby",
        "revealed",
        "underpinnings",
        "pramāṇa",
        "inference",
        "term",
        "set",
        "particular",
        "according",
        "yogācāra",
        "ontology",
        "real",
        "dharmakīrti",
        "classified",
        "inference",
        "based",
        "ontological",
        "nature",
        "classinclusion",
        "relationship",
        "underpins",
        "inference",
        "knowledge",
        "source",
        "earlier",
        "philosopher",
        "buddhist",
        "nonbuddhist",
        "provide",
        "example",
        "everyday",
        "reasoning",
        "several",
        "abductive",
        "character",
        "informal",
        "reasoning",
        "best",
        "explanation",
        "sight",
        "swollen",
        "river",
        "example",
        "say",
        "vātsyāyana",
        "commentary",
        "inference",
        "sūtra",
        "nyāyasūtra",
        "conclusion",
        "rained",
        "upstream",
        "also",
        "instance",
        "inference",
        "comprised",
        "deductive",
        "extrapolative",
        "sometimes",
        "properly",
        "inductive",
        "reasoning",
        "topic",
        "everyday",
        "life",
        "well",
        "philosophy",
        "numerous",
        "predignāga",
        "text",
        "several",
        "school",
        "true",
        "sometimes",
        "claimed",
        "one",
        "dignāga",
        "notion",
        "inferenceunderpinning",
        "pervasion",
        "vyāpti",
        "prover",
        "property",
        "property",
        "proved",
        "dignāga",
        "however",
        "get",
        "credit",
        "earliest",
        "systematization",
        "employ",
        "three",
        "term",
        "site",
        "subject",
        "proposed",
        "inference",
        "pakṣa",
        "mountain",
        "stock",
        "example",
        "inference",
        "sight",
        "smoke",
        "mountain",
        "knowledge",
        "fire",
        "mountain",
        "prover",
        "prover",
        "property",
        "hetu",
        "smokiness",
        "probandum",
        "sādhya",
        "fieriness",
        "dignāga",
        "stressed",
        "nominalist",
        "see",
        "inference",
        "proceeding",
        "knowledge",
        "particular",
        "knowledge",
        "particular",
        "avoiding",
        "universal",
        "realist",
        "nicely",
        "explained",
        "hayes",
        "reference",
        "buddhist",
        "apoha",
        "exclusion",
        "theory",
        "concept",
        "dignāga",
        "formulates",
        "threefold",
        "test",
        "good",
        "prover",
        "trairūpyahetu",
        "prover",
        "occurrence",
        "inferential",
        "subject",
        "proposed",
        "inference",
        "must",
        "known",
        "subject",
        "prover",
        "occurrence",
        "least",
        "together",
        "probandum",
        "must",
        "known",
        "countercase",
        "prover",
        "occurring",
        "without",
        "probandum",
        "must",
        "known",
        "s",
        "uddyotakara",
        "nyāyasūtra",
        "commentary",
        "incorporates",
        "dignāga",
        "idea",
        "formalize",
        "many",
        "vātsyāyana",
        "informal",
        "inference",
        "nyāya",
        "philosopher",
        "owes",
        "almost",
        "everything",
        "buddhist",
        "adversary",
        "opposed",
        "nyāya",
        "predecessor",
        "criticize",
        "alter",
        "see",
        "certification",
        "condition",
        "inference",
        "knowledge",
        "source",
        "combining",
        "dignāga",
        "second",
        "third",
        "test",
        "single",
        "requirement",
        "knowledge",
        "pervasion",
        "also",
        "add",
        "third",
        "condition",
        "subject",
        "reflect",
        "put",
        "information",
        "together",
        "say",
        "pakṣadharmatā",
        "prover",
        "known",
        "qualifying",
        "inferential",
        "subject",
        "vyāptismaraṇa",
        "prover",
        "pervaded",
        "probandum",
        "remembered",
        "liṅgaparāmarśa",
        "must",
        "connect",
        "reflection",
        "pervasion",
        "inferential",
        "subject",
        "upshot",
        "addition",
        "may",
        "interpreted",
        "recognition",
        "knowledge",
        "closed",
        "deduction",
        "considered",
        "abstraction",
        "psychological",
        "process",
        "reflection",
        "process",
        "epistemic",
        "warrantor",
        "certainty",
        "niścayapasses",
        "premise",
        "conclusion",
        "act",
        "unhesitatingly",
        "example",
        "put",
        "fire",
        "yonder",
        "mountain",
        "thing",
        "yet",
        "complicated",
        "inferential",
        "knowledge",
        "defeasible",
        "precisely",
        "stated",
        "subject",
        "take",
        "inferential",
        "knowledge",
        "may",
        "turn",
        "pseudo",
        "nongenuine",
        "false",
        "cognition",
        "imitating",
        "true",
        "one",
        "even",
        "gettierstyle",
        "case",
        "accidentally",
        "true",
        "cognition",
        "masquerading",
        "one",
        "genuinely",
        "inferenceborn",
        "knowledge",
        "social",
        "dimension",
        "would",
        "awareness",
        "counterexample",
        "defeater",
        "also",
        "someone",
        "present",
        "counterinference",
        "conclusion",
        "opposed",
        "longer",
        "would",
        "inferential",
        "knowledge",
        "awareness",
        "several",
        "kind",
        "blocker",
        "reflection",
        "undermine",
        "generalization",
        "reflection",
        "depends",
        "potential",
        "preventers",
        "inferential",
        "awareness",
        "defeaters",
        "bādhaka",
        "leading",
        "belief",
        "relinquishment",
        "someone",
        "hitherto",
        "noticed",
        "counterexample",
        "like",
        "thus",
        "drawn",
        "conclusion",
        "erroneously",
        "however",
        "one",
        "think",
        "epistemologist",
        "inference",
        "nonmonotonic",
        "established",
        "taber",
        "oetke",
        "particular",
        "paradigm",
        "logical",
        "form",
        "embedded",
        "good",
        "inference",
        "monotonic",
        "new",
        "information",
        "irrelevant",
        "validity",
        "pattern",
        "although",
        "may",
        "well",
        "relevant",
        "subject",
        "justification",
        "acceptance",
        "premise",
        "example",
        "inference",
        "classical",
        "text",
        "often",
        "seem",
        "nonmonotonic",
        "fallibility",
        "attache",
        "premise",
        "fallibility",
        "course",
        "pass",
        "conclusion",
        "cf",
        "israel",
        "similarly",
        "voice",
        "epistemological",
        "complaint",
        "idea",
        "nonmonotonic",
        "logic",
        "according",
        "koons",
        "targeting",
        "relationship",
        "pervasion",
        "uddyotakara",
        "second",
        "condition",
        "vyāptismaraṇa",
        "appears",
        "ontological",
        "underpinning",
        "dignāga",
        "condition",
        "dharmakīrti",
        "divide",
        "inference",
        "three",
        "kind",
        "svabhāva",
        "selfnature",
        "tree",
        "śiṃśapā",
        "oak",
        "tadutpatti",
        "causality",
        "fire",
        "smoke",
        "anupalabdhi",
        "nonperception",
        "pot",
        "none",
        "perceived",
        "yogācāra",
        "hold",
        "first",
        "type",
        "inference",
        "underpinning",
        "pervasion",
        "internal",
        "antarvyāpti",
        "may",
        "think",
        "internal",
        "relation",
        "concept",
        "thus",
        "similar",
        "priori",
        "western",
        "philosophy",
        "actually",
        "technical",
        "point",
        "whether",
        "term",
        "pick",
        "inferential",
        "subject",
        "subjectsthink",
        "pakṣa",
        "setcloses",
        "included",
        "inductive",
        "base",
        "generalization",
        "extrapolation",
        "according",
        "ganeri",
        "b",
        "give",
        "u",
        "knowledge",
        "pervasion",
        "relationship",
        "mīmāṃsā",
        "nyāya",
        "rule",
        "kind",
        "inference",
        "begging",
        "question",
        "want",
        "know",
        "whether",
        "inferential",
        "subject",
        "posse",
        "probandum",
        "property",
        "cite",
        "subject",
        "even",
        "part",
        "run",
        "counter",
        "purpose",
        "inference",
        "later",
        "nyāya",
        "divide",
        "inference",
        "according",
        "ontology",
        "pervasion",
        "mapped",
        "onto",
        "nyāyavaiśeṣika",
        "ontology",
        "causal",
        "theory",
        "sometimes",
        "successfully",
        "rather",
        "way",
        "pervasion",
        "known",
        "anvayavyatireka",
        "positive",
        "negative",
        "inference",
        "based",
        "positive",
        "negative",
        "correlation",
        "available",
        "ie",
        "case",
        "example",
        "smokiness",
        "fieriness",
        "known",
        "occur",
        "together",
        "kitchen",
        "hearth",
        "campfire",
        "etc",
        "like",
        "claimed",
        "yonder",
        "smoky",
        "mountain",
        "beingfiery",
        "proved",
        "taken",
        "along",
        "negative",
        "example",
        "prover",
        "well",
        "probandum",
        "known",
        "occur",
        "kevalaanvaya",
        "positive",
        "inference",
        "based",
        "positive",
        "correlation",
        "known",
        "example",
        "absence",
        "probandum",
        "property",
        "would",
        "case",
        "universally",
        "present",
        "property",
        "knowability",
        "nothing",
        "knowable",
        "kevalavyatireka",
        "negative",
        "inference",
        "based",
        "negative",
        "correlation",
        "outside",
        "inferential",
        "subject",
        "known",
        "case",
        "probandum",
        "many",
        "inference",
        "buddhist",
        "identify",
        "hinging",
        "internal",
        "pervasion",
        "antarvyāpti",
        "nyāya",
        "philosopher",
        "see",
        "negative",
        "kevalavyatireka",
        "taking",
        "particular",
        "śiṃśapā",
        "oak",
        "pakṣa",
        "negative",
        "correlation",
        "proving",
        "tree",
        "whatever",
        "tree",
        "śiṃśapā",
        "oak",
        "example",
        "lotus",
        "western",
        "interpretation",
        "representation",
        "inference",
        "classically",
        "conceived",
        "often",
        "missed",
        "unity",
        "knowledge",
        "source",
        "ganeri",
        "b",
        "claim",
        "better",
        "understand",
        "buddhist",
        "early",
        "nyāya",
        "pattern",
        "enthymematic",
        "skipping",
        "step",
        "generalization",
        "implicitly",
        "using",
        "universal",
        "instantiation",
        "ui",
        "modus",
        "ponens",
        "mp",
        "applying",
        "rule",
        "case",
        "hand",
        "casebased",
        "reasoning",
        "need",
        "interpreted",
        "relying",
        "universal",
        "quantifier",
        "representation",
        "schayer",
        "others",
        "us",
        "misleading",
        "indeed",
        "misleading",
        "ganeri",
        "appears",
        "right",
        "regard",
        "early",
        "theory",
        "late",
        "nyāya",
        "schayer",
        "argument",
        "form",
        "ui",
        "mp",
        "misleads",
        "yet",
        "another",
        "reason",
        "namely",
        "failing",
        "sufficiently",
        "sensitive",
        "logic",
        "occurrence",
        "nonoccurrence",
        "property",
        "location",
        "qualifying",
        "propertybearer",
        "staal",
        "others",
        "brought",
        "furthermore",
        "ganeri",
        "right",
        "analyzing",
        "pattern",
        "one",
        "tends",
        "miss",
        "unity",
        "causal",
        "theory",
        "one",
        "mental",
        "state",
        "brought",
        "another",
        "nyāya",
        "theory",
        "everything",
        "integrated",
        "notion",
        "reflection",
        "parāmarśa",
        "inference",
        "proximate",
        "instrumental",
        "cause",
        "trigger",
        "karaṇa",
        "necessary",
        "condition",
        "one",
        "last",
        "place",
        "securing",
        "occurrence",
        "inferential",
        "knowledge",
        "following",
        "matilal",
        "reconstruct",
        "reflection",
        "singular",
        "inference",
        "k",
        "spha",
        "k",
        "sa",
        "say",
        "condition",
        "subject",
        "know",
        "hasqualifiedbybeingpervadedbys",
        "qualifies",
        "subject",
        "know",
        "sa",
        "arrow",
        "interpreted",
        "depicting",
        "causal",
        "sufficiency",
        "line",
        "uddyotakara",
        "later",
        "tradition",
        "reflection",
        "complex",
        "mental",
        "state",
        "nevertheless",
        "unity",
        "particular",
        "cognition",
        "causal",
        "factor",
        "rise",
        "another",
        "cognition",
        "intentionality",
        "objecthood",
        "expressible",
        "single",
        "sentence",
        "attempt",
        "find",
        "single",
        "rule",
        "consonance",
        "dimension",
        "theory",
        "lot",
        "inductive",
        "depth",
        "packed",
        "idea",
        "pervasion",
        "known",
        "lot",
        "said",
        "show",
        "generalization",
        "least",
        "later",
        "nyāya",
        "theory",
        "knowing",
        "general",
        "rule",
        "considered",
        "crucial",
        "extrapolation",
        "next",
        "case",
        "uddyotakara",
        "nyāya",
        "philosopher",
        "treat",
        "pervasion",
        "equivalent",
        "rule",
        "stating",
        "thatto",
        "use",
        "language",
        "set",
        "termsthe",
        "extension",
        "probandum",
        "term",
        "includes",
        "prover",
        "term",
        "includes",
        "entirely",
        "nothing",
        "locates",
        "pervaded",
        "property",
        "prover",
        "also",
        "locate",
        "pervader",
        "probandum",
        "argued",
        "kisor",
        "chakrabarti",
        "among",
        "others",
        "centralmost",
        "issue",
        "inference",
        "consider",
        "effort",
        "late",
        "nyāya",
        "philosopher",
        "make",
        "plain",
        "logic",
        "pervasion",
        "well",
        "know",
        "universalized",
        "item",
        "entire",
        "extension",
        "term",
        "figuring",
        "knowledge",
        "rule",
        "item",
        "underpin",
        "knowledge",
        "inclusion",
        "naturally",
        "necessary",
        "pervasion",
        "prover",
        "probandum",
        "property",
        "lot",
        "work",
        "earliest",
        "focus",
        "fallacy",
        "inference",
        "context",
        "formal",
        "debate",
        "many",
        "philosophical",
        "inference",
        "advanced",
        "literature",
        "various",
        "school",
        "proof",
        "momentariness",
        "existence",
        "god",
        "possibility",
        "liberation",
        "birth",
        "rebirth",
        "dozen"
    ]
}