{
    "main_text": "Expanding Horizons || Specific Virtues and Vices\n10.2 Specific Virtues and Vices\n\nAnother “growth area” for VE is profiles of individual\nvirtues and vices. Work in this area has progressed in fits and\nstarts, with a great deal of work on some intellectual virtues and\nvices but less on others. Traits that have received significant\nattention include intellectual courage, intellectual humility,\nepistemic justice, as well as the vices that oppose these virtues.\n\nRoberts and Wood (2007: 219) characterize intellectual courage and\ncaution as the virtues that dispose us to respond appropriately to\nperceived threats in our intellectual lives—courage disposing us\nto not be unduly intimidated, caution disposing us to not take\ninappropriate risks in achieving intellectual goods. For them, then,\nintellectual courage is analogous to Aristotelian moral courage, in\nthat it disposes its bearer to respond well to threats, being neither\ntoo rash nor too fearful. Baehr (2011, chap. 9) likewise argues that\nintellectual courage is best construed as a disposition to respond\nwell to threats to one’s epistemic well-being; he focuses in\nparticular on the courage to inquire rather than the courage to\nbelieve or doubt. Drawing on Nietzsche, Alfano (2013a, 2019) explores\na related kind of intellectual courage to inquire into the forbidden.\nHe argues that such Nietzschean courage is needed to understand the\nmost disheartening and shameful aspects of human nature, which people\ntend to whitewash or gloss over. On a different note, Alfano (2013b)\nemphasizes the importance of intellectual courage in publicly\nannouncing what one knows or believes in the face of social and\ninstitutional pressure to conform or be silent. Such courage relates\nto the transmission of knowledge and the destruction of ignorance and\nerror in one’s community rather than the seeking of knowledge\nfor the inquirer’s sake. Having such a sense of when and how to\nspeak one’s mind is a primary constituent of the virtue of being\nan effective whistleblower, an underappreciated exemplar of the\ncurrent era (DesAutels 2009). Medina (2013) offers an account of\nsubjects with exceptional intellectual courage, such as Sor Juana Ines\nde la Cruz in seventeenth century Mexico. Such heroes defy cognitive\nobstacles in contexts of epistemic oppression through inventiveness\nand imagination.\n\nContributors to the profile of intellectual humility include Carter\nand Pritchard (2016), Hazlett (2012), Roberts and Wood (2007),\nSamuelson and Church (2015), Whitcomb et al. (2015), and Christen et\nal. (2014). Hazlett (2012: 220) claims that intellectual humility is\nthe\n\n\ndisposition not to adopt epistemically improper higher order epistemic\nattitudes, and to adopt (in the right way, in the right situations)\nepistemically proper higher order epistemic attitudes.\n\n\nThis conception of intellectual humility is most pertinent in the\nrealm of disagreement. The view of Roberts and Wood is similar,\nholding that intellectual humility is “a striking or unusual\nunconcern for social importance, and thus a kind of emotional\ninsensitivity to the issues of status” (2007: 239).\nTheir definition, like Hazlett’s, emphasizes the social nature\nof intellectual humility. Unlike Hazlett, Roberts and Wood put more\nweight on the intellectually humble person’s concerns and\nemotions, and less on her doxastic states.\n\nSamuelson and Church (2015), by contrast, characterize intellectual\nhumility in the dual-process language popular in contemporary\npsychology. Samuelson and Church think that intellectual humility can\nbe implemented as a motivating trait, but they are inclined to\nconstrue it in the dual-system framework, where it harmonizes\nautomatic intuitive processes (heuristics, affective judgments, etc.)\nwith slow, controlled, effortful, attentive thought and deliberation.\nOn this view, someone who tends to jump to conclusions based on\nintuitions (“System 1”) fails to be intellectually humble,\nespecially if he is not open to revising his beliefs in the face of\nnew evidence. By contrast, someone who forces himself to slow down and\nthink carefully (“System 2”) in situations where intuitive\nresponses are liable to mislead would be a paragon of intellectual\nhumility.\n\nWhitcomb et al. (2015; see also Medina 2013) propose a conception of\nintellectual humility as appropriately attending to and owning\none’s cognitive limitations. Such attentiveness can be\nconscious, but it is grounded in an implicit sensitivity to\none’s own dispositions. Attending to one’s limitations is\nin turn meant to lead to intellectually humble cognitive, behavioral,\nmotivational, and affective responses. This trait leads the\nintellectually humble person to revise her beliefs in light of her\nrecognition of her limitations, to try to overcome or quarantine the\nbad effects of her limitations, to desire to embody fewer and less\nsevere limitations, and to display fitting emotions (e.g., regret\nrather than amusement) towards her limitations.\n\nFinally, Christen, Alfano, and Robinson (2014) give a descriptive\nrather than a normative account of intellectual humility. Like the\nviews canvassed above, they think that intellectual humility can be\nunderstood as a multifaceted disposition that opposes other\ndispositions. Rather than consulting their own intuitions about what\nthe facets of intellectual humility and its opposing vices are,\nhowever, they employ a thesaurus-based psycholexical analysis, which\nsuggests that intellectual humility has three positive facets (the\nsensitive self, the discreet self, and the inquisitive self) and three\nopposing vices (the underrated other, the underrated self, and the\noverrated self). The sensitive self is characterized by comprehension,\nresponsiveness, and mindfulness—all ways of demonstrating\nopenness to new ideas and information. The inquisitive self is\ncharacterized by curiosity, exploration, and learning—all ways\nof seeking new ideas and information. The discreet self is\ncharacterized by demureness and unpretentiousness—ways of\nrelating to other people, especially those one might disagree\nwith.\n\nMiranda Fricker (2003, 2007) provides a detailed case study of the\nvirtue of epistemic justice and the opposing vice of “epistemic\ninjustice” suffered by the marginalized and less powerful.\nEpistemic injustice harms someone in their capacity as a (potential)\nknower and comes in several varieties. One species is\nhermeneutical injustice, which occurs when people are denied\nthe conceptual and linguistic resources to make sense of and\ncommunicate their experience. A prime example is sexual harassment, a\nconcept forged 1970s America. The other main species of epistemic\ninjustice that has received by far the most attention, though, is\ntestimonial injustice, which occurs when someone’s\nassertions are accorded less (or more) credence than they deserve\nbecause of prejudice of some kind, such as bias regarding identities\nlike gender, race, ethnicity, or age. The vice of testimonial\ninjustice is a disposition to commit such acts of epistemic injustice.\nThe virtue of corrective testimonial justice is a disposition to\nremain aware of and compensate for your prejudices by interfering with\nyour estimation of the value of someone’s testimony. This\ncorrective virtue, Fricker (2003: 161) argues, is cultivated through\nsocial training.\n\nMedina (2011, 2012, 2013) has developed a social-contextualist account\nof the virtue of epistemic justice and the corresponding vice of\nepistemic injustice. Medina (2011) argues that testimonial justice\nrequires the development of epistemic sensibility that detects and\ncorrects both undeserved credibility deficits and undeserved\ncredibility excesses. He also argues that hermeneutical injustices are\noften addressed best in dialogical communities that come to a mutual\nunderstanding of their predicament, rather than by individuals.\n\nSherman (2016) agrees with Fricker about the harm caused by\ntestimonial injustice but questions the efficacy of trying to\ncultivate a virtue to correct it. The essential problem is that people\ntend to think that their own opinions and trust in the testimony of\nothers are reasonable. If you thought that you’d given\nsomeone’s word too little weight, you would already have revised\nyour opinion. In light of this, Sherman suggests that efforts to\ncultivate corrective testimonial justice are likely to fail or even\nbackfire.\n\nFollowing Sherman, Alfano (2015; see also Alfano & Skorburg 2018)\nsuggests communalizing the pursuit of testimonial justice by, for\nexample, recruiting your friends to confront you when they think\nyou’ve committed an act of injustice and going out of your way\nto do the same when you witness injustice. Also in response to\nSherman, Davidson and Kelly (2015) argue that while it may be\ndifficult or impossible to adjust one’s credence in the moment,\ntaking distal ecological control (Clark 2007) over one’s\nmaterial, social, and political environment can help to tamp down or\neradicate the biases that lead to testimonial injustice. Likewise,\nWashington (2016: 11) argues that because isolated individuals lack a\n“Bad Judgment Alarm”, the response to testimonial\ninjustice should not be to reflexively cultivate one’s own\ncharacter but to promote a “social and moral ecology that\nfacilitates the expression of our values”. These approaches\nharmonize with the embedded, scaffolded, and extended virtue model\ndescribed above, as well as Kvanvig’s (1992) celebration of the\nrole of the epistemic community.\n\nOther intellectual virtues have received less attention to date,\nthough not for lack of philosophical merit. These include intellectual\ngenerosity (Roberts & Wood 2007: 293), epistemic temperance\n(Battaly 2010), open-mindedness (Adler 2004; Baehr 2011; Carter &\nGordon 2014b), intellectual perseverance (King 2014b), inquisitiveness\n(L. Watson 2015), and curiosity (Alfano 2013a; Whitcomb 2010). In a\nrecent book, Cassam (2019) catalogues a range of epistemic vices.\nSome, such as closed-mindedness, are character traits. Others, such as\nwishful thinking, are better conceptualized as ways of thinking. Still\nothers, such as epistemic malevolence and epistemic insouciance, are\nbest understood as attitudes. Cassam characterizes the attitude of\nmalevolence as a stance, which is a voluntarily-adopted\npolicy to engage in certain types of conduct; by contrast, he\ncharacterizes the attitude of epistemic insouciance as\na posture, which is affective and involuntary (in this\ncase, a reckless and flippant disregard for truth, evidence, and\nexpertise). These theoretical reflections have recently been bolstered\nby empirical work by Meyer, Alfano, & de Bruin (2021), who who\nshow that possession of the epistemic vices of indifference to\ntruth (related to epistemic insouciance) and intellectual rigidity\n(related to closed-mindedness) predicts acceptance of fake news,\nconspiracy theories, and misinformation about COVID-19.\n",
    "section_title": "10.2 Specific Virtues and Vices",
    "entry_title": "Virtue Epistemology",
    "hierarchy_title": "Virtue Epistemology || Expanding Horizons || Specific Virtues and Vices",
    "tokenized_text": [
        "expanding",
        "horizon",
        "specific",
        "virtue",
        "vice",
        "specific",
        "virtue",
        "vice",
        "another",
        "growth",
        "area",
        "profile",
        "individual",
        "virtue",
        "vice",
        "work",
        "area",
        "progressed",
        "fit",
        "start",
        "great",
        "deal",
        "work",
        "intellectual",
        "virtue",
        "vice",
        "le",
        "others",
        "trait",
        "received",
        "significant",
        "attention",
        "include",
        "intellectual",
        "courage",
        "intellectual",
        "humility",
        "epistemic",
        "justice",
        "well",
        "vice",
        "oppose",
        "virtue",
        "robert",
        "wood",
        "characterize",
        "intellectual",
        "courage",
        "caution",
        "virtue",
        "dispose",
        "u",
        "respond",
        "appropriately",
        "perceived",
        "threat",
        "intellectual",
        "livescourage",
        "disposing",
        "u",
        "unduly",
        "intimidated",
        "caution",
        "disposing",
        "u",
        "take",
        "inappropriate",
        "risk",
        "achieving",
        "intellectual",
        "good",
        "intellectual",
        "courage",
        "analogous",
        "aristotelian",
        "moral",
        "courage",
        "disposes",
        "bearer",
        "respond",
        "well",
        "threat",
        "neither",
        "rash",
        "fearful",
        "baehr",
        "chap",
        "likewise",
        "argues",
        "intellectual",
        "courage",
        "best",
        "construed",
        "disposition",
        "respond",
        "well",
        "threat",
        "one",
        "epistemic",
        "wellbeing",
        "focus",
        "particular",
        "courage",
        "inquire",
        "rather",
        "courage",
        "believe",
        "doubt",
        "drawing",
        "nietzsche",
        "alfano",
        "a",
        "explores",
        "related",
        "kind",
        "intellectual",
        "courage",
        "inquire",
        "forbidden",
        "argues",
        "nietzschean",
        "courage",
        "needed",
        "understand",
        "disheartening",
        "shameful",
        "aspect",
        "human",
        "nature",
        "people",
        "tend",
        "whitewash",
        "gloss",
        "different",
        "note",
        "alfano",
        "b",
        "emphasizes",
        "importance",
        "intellectual",
        "courage",
        "publicly",
        "announcing",
        "one",
        "know",
        "belief",
        "face",
        "social",
        "institutional",
        "pressure",
        "conform",
        "silent",
        "courage",
        "relates",
        "transmission",
        "knowledge",
        "destruction",
        "ignorance",
        "error",
        "one",
        "community",
        "rather",
        "seeking",
        "knowledge",
        "inquirer",
        "sake",
        "sense",
        "speak",
        "one",
        "mind",
        "primary",
        "constituent",
        "virtue",
        "effective",
        "whistleblower",
        "underappreciated",
        "exemplar",
        "current",
        "era",
        "desautels",
        "medina",
        "offer",
        "account",
        "subject",
        "exceptional",
        "intellectual",
        "courage",
        "sor",
        "juana",
        "ines",
        "de",
        "la",
        "cruz",
        "seventeenth",
        "century",
        "mexico",
        "hero",
        "defy",
        "cognitive",
        "obstacle",
        "context",
        "epistemic",
        "oppression",
        "inventiveness",
        "imagination",
        "contributor",
        "profile",
        "intellectual",
        "humility",
        "include",
        "carter",
        "pritchard",
        "hazlett",
        "robert",
        "wood",
        "samuelson",
        "church",
        "whitcomb",
        "et",
        "al",
        "christen",
        "et",
        "al",
        "hazlett",
        "claim",
        "intellectual",
        "humility",
        "disposition",
        "adopt",
        "epistemically",
        "improper",
        "higher",
        "order",
        "epistemic",
        "attitude",
        "adopt",
        "right",
        "way",
        "right",
        "situation",
        "epistemically",
        "proper",
        "higher",
        "order",
        "epistemic",
        "attitude",
        "conception",
        "intellectual",
        "humility",
        "pertinent",
        "realm",
        "disagreement",
        "view",
        "robert",
        "wood",
        "similar",
        "holding",
        "intellectual",
        "humility",
        "striking",
        "unusual",
        "unconcern",
        "social",
        "importance",
        "thus",
        "kind",
        "emotional",
        "insensitivity",
        "issue",
        "status",
        "definition",
        "like",
        "hazlett",
        "emphasizes",
        "social",
        "nature",
        "intellectual",
        "humility",
        "unlike",
        "hazlett",
        "robert",
        "wood",
        "put",
        "weight",
        "intellectually",
        "humble",
        "person",
        "concern",
        "emotion",
        "le",
        "doxastic",
        "state",
        "samuelson",
        "church",
        "contrast",
        "characterize",
        "intellectual",
        "humility",
        "dualprocess",
        "language",
        "popular",
        "contemporary",
        "psychology",
        "samuelson",
        "church",
        "think",
        "intellectual",
        "humility",
        "implemented",
        "motivating",
        "trait",
        "inclined",
        "construe",
        "dualsystem",
        "framework",
        "harmonizes",
        "automatic",
        "intuitive",
        "process",
        "heuristic",
        "affective",
        "judgment",
        "etc",
        "slow",
        "controlled",
        "effortful",
        "attentive",
        "thought",
        "deliberation",
        "view",
        "someone",
        "tends",
        "jump",
        "conclusion",
        "based",
        "intuition",
        "system",
        "fails",
        "intellectually",
        "humble",
        "especially",
        "open",
        "revising",
        "belief",
        "face",
        "new",
        "evidence",
        "contrast",
        "someone",
        "force",
        "slow",
        "think",
        "carefully",
        "system",
        "situation",
        "intuitive",
        "response",
        "liable",
        "mislead",
        "would",
        "paragon",
        "intellectual",
        "humility",
        "whitcomb",
        "et",
        "al",
        "see",
        "also",
        "medina",
        "propose",
        "conception",
        "intellectual",
        "humility",
        "appropriately",
        "attending",
        "owning",
        "one",
        "cognitive",
        "limitation",
        "attentiveness",
        "conscious",
        "grounded",
        "implicit",
        "sensitivity",
        "one",
        "disposition",
        "attending",
        "one",
        "limitation",
        "turn",
        "meant",
        "lead",
        "intellectually",
        "humble",
        "cognitive",
        "behavioral",
        "motivational",
        "affective",
        "response",
        "trait",
        "lead",
        "intellectually",
        "humble",
        "person",
        "revise",
        "belief",
        "light",
        "recognition",
        "limitation",
        "try",
        "overcome",
        "quarantine",
        "bad",
        "effect",
        "limitation",
        "desire",
        "embody",
        "fewer",
        "le",
        "severe",
        "limitation",
        "display",
        "fitting",
        "emotion",
        "eg",
        "regret",
        "rather",
        "amusement",
        "towards",
        "limitation",
        "finally",
        "christen",
        "alfano",
        "robinson",
        "give",
        "descriptive",
        "rather",
        "normative",
        "account",
        "intellectual",
        "humility",
        "like",
        "view",
        "canvassed",
        "think",
        "intellectual",
        "humility",
        "understood",
        "multifaceted",
        "disposition",
        "opposes",
        "disposition",
        "rather",
        "consulting",
        "intuition",
        "facet",
        "intellectual",
        "humility",
        "opposing",
        "vice",
        "however",
        "employ",
        "thesaurusbased",
        "psycholexical",
        "analysis",
        "suggests",
        "intellectual",
        "humility",
        "three",
        "positive",
        "facet",
        "sensitive",
        "self",
        "discreet",
        "self",
        "inquisitive",
        "self",
        "three",
        "opposing",
        "vice",
        "underrated",
        "underrated",
        "self",
        "overrated",
        "self",
        "sensitive",
        "self",
        "characterized",
        "comprehension",
        "responsiveness",
        "mindfulnessall",
        "way",
        "demonstrating",
        "openness",
        "new",
        "idea",
        "information",
        "inquisitive",
        "self",
        "characterized",
        "curiosity",
        "exploration",
        "learningall",
        "way",
        "seeking",
        "new",
        "idea",
        "information",
        "discreet",
        "self",
        "characterized",
        "demureness",
        "unpretentiousnessways",
        "relating",
        "people",
        "especially",
        "one",
        "might",
        "disagree",
        "miranda",
        "fricker",
        "provides",
        "detailed",
        "case",
        "study",
        "virtue",
        "epistemic",
        "justice",
        "opposing",
        "vice",
        "epistemic",
        "injustice",
        "suffered",
        "marginalized",
        "le",
        "powerful",
        "epistemic",
        "injustice",
        "harm",
        "someone",
        "capacity",
        "potential",
        "knower",
        "come",
        "several",
        "variety",
        "one",
        "specie",
        "hermeneutical",
        "injustice",
        "occurs",
        "people",
        "denied",
        "conceptual",
        "linguistic",
        "resource",
        "make",
        "sense",
        "communicate",
        "experience",
        "prime",
        "example",
        "sexual",
        "harassment",
        "concept",
        "forged",
        "s",
        "america",
        "main",
        "specie",
        "epistemic",
        "injustice",
        "received",
        "far",
        "attention",
        "though",
        "testimonial",
        "injustice",
        "occurs",
        "someone",
        "assertion",
        "accorded",
        "le",
        "credence",
        "deserve",
        "prejudice",
        "kind",
        "bias",
        "regarding",
        "identity",
        "like",
        "gender",
        "race",
        "ethnicity",
        "age",
        "vice",
        "testimonial",
        "injustice",
        "disposition",
        "commit",
        "act",
        "epistemic",
        "injustice",
        "virtue",
        "corrective",
        "testimonial",
        "justice",
        "disposition",
        "remain",
        "aware",
        "compensate",
        "prejudice",
        "interfering",
        "estimation",
        "value",
        "someone",
        "testimony",
        "corrective",
        "virtue",
        "fricker",
        "argues",
        "cultivated",
        "social",
        "training",
        "medina",
        "developed",
        "socialcontextualist",
        "account",
        "virtue",
        "epistemic",
        "justice",
        "corresponding",
        "vice",
        "epistemic",
        "injustice",
        "medina",
        "argues",
        "testimonial",
        "justice",
        "requires",
        "development",
        "epistemic",
        "sensibility",
        "detects",
        "corrects",
        "undeserved",
        "credibility",
        "deficit",
        "undeserved",
        "credibility",
        "excess",
        "also",
        "argues",
        "hermeneutical",
        "injustice",
        "often",
        "addressed",
        "best",
        "dialogical",
        "community",
        "come",
        "mutual",
        "understanding",
        "predicament",
        "rather",
        "individual",
        "sherman",
        "agrees",
        "fricker",
        "harm",
        "caused",
        "testimonial",
        "injustice",
        "question",
        "efficacy",
        "trying",
        "cultivate",
        "virtue",
        "correct",
        "essential",
        "problem",
        "people",
        "tend",
        "think",
        "opinion",
        "trust",
        "testimony",
        "others",
        "reasonable",
        "thought",
        "given",
        "someone",
        "word",
        "little",
        "weight",
        "would",
        "already",
        "revised",
        "opinion",
        "light",
        "sherman",
        "suggests",
        "effort",
        "cultivate",
        "corrective",
        "testimonial",
        "justice",
        "likely",
        "fail",
        "even",
        "backfire",
        "following",
        "sherman",
        "alfano",
        "see",
        "also",
        "alfano",
        "skorburg",
        "suggests",
        "communalizing",
        "pursuit",
        "testimonial",
        "justice",
        "example",
        "recruiting",
        "friend",
        "confront",
        "think",
        "committed",
        "act",
        "injustice",
        "going",
        "way",
        "witness",
        "injustice",
        "also",
        "response",
        "sherman",
        "davidson",
        "kelly",
        "argue",
        "may",
        "difficult",
        "impossible",
        "adjust",
        "one",
        "credence",
        "moment",
        "taking",
        "distal",
        "ecological",
        "control",
        "clark",
        "one",
        "material",
        "social",
        "political",
        "environment",
        "help",
        "tamp",
        "eradicate",
        "bias",
        "lead",
        "testimonial",
        "injustice",
        "likewise",
        "washington",
        "argues",
        "isolated",
        "individual",
        "lack",
        "bad",
        "judgment",
        "alarm",
        "response",
        "testimonial",
        "injustice",
        "reflexively",
        "cultivate",
        "one",
        "character",
        "promote",
        "social",
        "moral",
        "ecology",
        "facilitates",
        "expression",
        "value",
        "approach",
        "harmonize",
        "embedded",
        "scaffolded",
        "extended",
        "virtue",
        "model",
        "described",
        "well",
        "kvanvig",
        "celebration",
        "role",
        "epistemic",
        "community",
        "intellectual",
        "virtue",
        "received",
        "le",
        "attention",
        "date",
        "though",
        "lack",
        "philosophical",
        "merit",
        "include",
        "intellectual",
        "generosity",
        "robert",
        "wood",
        "epistemic",
        "temperance",
        "battaly",
        "openmindedness",
        "adler",
        "baehr",
        "carter",
        "gordon",
        "b",
        "intellectual",
        "perseverance",
        "king",
        "b",
        "inquisitiveness",
        "l",
        "watson",
        "curiosity",
        "alfano",
        "a",
        "whitcomb",
        "recent",
        "book",
        "cassam",
        "catalogue",
        "range",
        "epistemic",
        "vice",
        "closedmindedness",
        "character",
        "trait",
        "others",
        "wishful",
        "thinking",
        "better",
        "conceptualized",
        "way",
        "thinking",
        "still",
        "others",
        "epistemic",
        "malevolence",
        "epistemic",
        "insouciance",
        "best",
        "understood",
        "attitude",
        "cassam",
        "characterizes",
        "attitude",
        "malevolence",
        "stance",
        "voluntarilyadopted",
        "policy",
        "engage",
        "certain",
        "type",
        "conduct",
        "contrast",
        "characterizes",
        "attitude",
        "epistemic",
        "insouciance",
        "posture",
        "affective",
        "involuntary",
        "case",
        "reckless",
        "flippant",
        "disregard",
        "truth",
        "evidence",
        "expertise",
        "theoretical",
        "reflection",
        "recently",
        "bolstered",
        "empirical",
        "work",
        "meyer",
        "alfano",
        "de",
        "bruin",
        "show",
        "possession",
        "epistemic",
        "vice",
        "indifference",
        "truth",
        "related",
        "epistemic",
        "insouciance",
        "intellectual",
        "rigidity",
        "related",
        "closedmindedness",
        "predicts",
        "acceptance",
        "fake",
        "news",
        "conspiracy",
        "theory",
        "misinformation",
        "covid"
    ]
}