{
    "main_text": "The Structure of Knowledge and Justification || Foundationalism\n4.1 Foundationalism\n\nAccording to foundationalism, our justified beliefs are structured\nlike a building: they are divided into a foundation and a\nsuperstructure, the latter resting upon the former. Beliefs belonging\nto the foundation are basic. Beliefs belonging to the\nsuperstructure are nonbasic and receive justification from\nthe justified beliefs in the\n foundation.[40]\n\nBefore we evaluate this foundationalist account of justification, let\nus first try to spell it out more precisely. What is it for a\njustified belief to be basic? According to one approach, what makes a\njustified belief basic is that it doesn’t receive its\njustification from any other beliefs. The following definition\ncaptures this thought:\n\n\nDoxastic Basicality (DB)\n\nS’s justified belief that p is basic if and only\nif S’s belief that p is justified without owing\nits justification to any of S’s other beliefs.\n\n\nLet’s consider what would, according to DB, qualify as an\nexample of a basic belief. Suppose you notice (for whatever reason)\nsomeone’s hat, and you also notice that that hat looks blue to\nyou. So you believe\n\n(B) It appears\nto me that that hat is blue.\n\n\nUnless something very strange is going on, (B) is an example of a\njustified belief. DB tells us that (B) is basic if and only if it does\nnot owe its justification to any other beliefs of yours. So if (B) is\nindeed basic, there might be some item or other to which (B) owes its\njustification, but that item would not be another belief of yours. We\ncall this kind of basicality “doxastic” because it makes\nbasicality a function of how your doxastic system (your belief system)\nis structured.\n\nLet us turn to the question of where the justification that attaches\nto (B) might come from, if we think of basicality as defined by DB.\nNote that DB merely tells us how (B) is not justified. It\nsays nothing about how (B) is justified. DB, therefore, does\nnot answer that question. What we need, in addition to DB, is an\naccount of what it is that justifies a belief such as (B).\nAccording to one strand of foundationalist thought, (B) is justified\nbecause it can’t be false, doubted, or corrected by others. On\nsuch a view, (B) is justified because (B) carries with it an\nepistemic privilege such as infallibility, indubitability, or\nincorrigibility (for a discussion of various kinds of epistemic\nprivilege, see Alston 1971 [1989]).\n\nNote that (B) is a belief about how the hat appears to you.\nSo (B) is a belief about a perceptual experience of yours. According\nto the version of foundationalism just considered, a subject’s\nbasic beliefs are introspective beliefs about the subject’s own\nmental states, of which perceptual experiences make up one subset.\nOther mental states about which a subject can have basic beliefs may\ninclude such things as having a headache, being tired, feeling\npleasure, or having a desire for a cup of coffee. Beliefs about\nexternal objects cannot qualify as basic, according to this kind of\nfoundationalism, for it is impossible for such beliefs to enjoy the\nkind of epistemic privilege necessary for being basic.\n\nAccording to a different version of foundationalism, (B) is justified\nby some further mental state of yours, but not by a further\nbelief of yours. Rather, (B) is justified by the very\nperceptual experience that (B) itself is about: the\nhat’s looking blue to you. Let “(E)” represent that\nexperience. According to this alternative proposal, (B) and (E) are\ndistinct mental states. The idea is that what justifies (B) is (E).\nSince (E) is an experience, not a belief of yours, (B) can, according\nto DB, still be basic.\n\nLet’s call the two versions of foundationalism we have\ndistinguished privilege foundationalism and experiential\nfoundationalism. Privilege foundationalism is generally thought\nto restrict basic beliefs so that beliefs about contingent,\nmind-independent facts cannot be basic, since beliefs about such facts\nare generally thought to lack the privilege that attends our\nintrospective beliefs about our own present mental states, or our\nbeliefs about a priori necessities. Experiential\nfoundationalism is not restrictive in the same way. Suppose instead of\n(B), you believe\n\n(H) That hat\nis blue.\n\n\nUnlike (B), (H) is about the hat itself, and not the way the hat\nappears to you. Such a belief is not one about which we are infallible\nor otherwise epistemically privileged. Privilege foundationalism\nwould, therefore, classify (H) as nonbasic. It is, however, quite\nplausible to think that (E) justifies not only (B) but (H) as well. If\n(E) is indeed what justifies (H), and (H) does not receive any\nadditional justification from any further beliefs of yours, then (H)\nqualifies, according to DB, as basic.\n\nExperiential Foundationalism, then, combines two crucial ideas: (i)\nwhen a justified belief is basic, its justification is not owed to any\nother belief; (ii) what in fact justifies basic beliefs are\nexperiences.\n\nUnder ordinary circumstances, perceptual beliefs such as (H) are not\nbased on any further beliefs about one’s own perceptual\nexperiences. It is not clear, therefore, how privilege foundationalism\ncan account for the justification of ordinary perceptual beliefs like\n (H).[41]\n Experiential foundationalism, on the other hand, has no trouble at\nall explaining how ordinary perceptual beliefs are justified: they are\njustified by the perceptual experiences that give rise to them. This\ncould be viewed as a reason for preferring experiential\nfoundationalism to privilege foundationalism.\n\nDB articulates one conception of basicality. Here’s an\nalternative conception:\n\n\nEpistemic Basicality (EB)\n\nS’s justified belief that p is basic if and only\nif S’s justification for believing that p does not\ndepend on any justification S possesses for believing a further\nproposition,\n q.[42]\n\n\nEB makes it more difficult for a belief to be basic than DB does. To\nsee why, we turn to the chief question (let’s call it the\n“J-question”) that advocates of experiential\nfoundationalism face:\n\n\nThe J-Question\n\nWhy are perceptual experiences a source of justification?\n\n\nOne way of answering the J-question is as follows: perceptual\nexperiences are a source of justification only when, and only because,\nwe have justification for taking them to be\n reliable.[43]\n Note that your having justification for believing that p\ndoesn’t entail that you actually believe p. Thus, your\nhaving justification for attributing reliability to your perceptual\nexperiences doesn’t entail that you actually believe them to be\nreliable.\n\nWhat might give us justification for thinking that our perceptual\nexperiences are reliable? That’s a complicated issue. For our\npresent purposes, let’s consider the following answer: We\nremember that they have served us well in the past. We are supposing,\nthen, that justification for attributing reliability to your\nperceptual experiences consists of memories of perceptual success. On\nthis view, a perceptual experience (E) justifies a perceptual belief\nonly when, and only because, you have suitable track-record memories\nthat give you justification for considering (E) reliable. (Of course,\nthis raises the question why those memories give us justification, but\nthere are many different approaches to this question, as we’ll\nsee more fully below.)\n\nIf this view is correct, then it is clear how DB and EB differ. Your\nhaving justification for (H) depends on your having justification for\nbelieving something else in addition to (H), namely that your visual\nexperiences are reliable. As a result (H) is not basic in the sense\ndefined by EB. However, (H) might still be basic in the sense defined\nby DB. If you are justified in believing (H) and your justification is\nowed solely to (E) and (M), neither of which includes any beliefs,\nthen your belief is doxastically—though not\nepistemically—basic. \n\nWe’ve considered one possible answer to the J-question, and\nconsidered how EB and DB differ if that answer is correct. But there\nare other possible answers to the J-question. Another answer is that\nperceptual experiences are a source of justification when, and\nbecause, they are of types that reliably produce true\n beliefs.[44]\n Another answer is that perceptual experiences are a source of\njustification when, and because, they are of types that reliably\nindicate the truth of their content. Yet another answer is that\nperceptual experiences are a source of justification when, and\nbecause, they have a certain phenomenology: that of presenting their\ncontent as\n true.[45]\n\nTo conclude this section, let us briefly consider how justification is\nsupposed to be transferred from basic to nonbasic beliefs. There are\ntwo options: the justificatory relation between basic and nonbasic\nbeliefs could be deductive or non-deductive. If we take the relation\nto be deductive, each of one’s nonbasic beliefs would have to be\nsuch that it can be deduced from one’s basic beliefs. But if we\nconsider a random selection of typical beliefs we hold, it is not easy\nto see from which basic beliefs they could be deduced.\nFoundationalists, therefore, typically conceive of the link between\nthe foundation and the superstructure in non-deductive terms. They\nwould say that, for a given set of basic beliefs, B, to justify a\nnonbasic belief, B*, it isn’t necessary that B entails B*.\nRather, it is sufficient that, the inference from B to B* is a\nrational one—however such rationality is to be\n understood.[46]\n",
    "section_title": "4.1 Foundationalism",
    "entry_title": "Epistemology",
    "hierarchy_title": "Epistemology || The Structure of Knowledge and Justification || Foundationalism",
    "tokenized_text": [
        "structure",
        "knowledge",
        "justification",
        "foundationalism",
        "foundationalism",
        "according",
        "foundationalism",
        "justified",
        "belief",
        "structured",
        "like",
        "building",
        "divided",
        "foundation",
        "superstructure",
        "latter",
        "resting",
        "upon",
        "former",
        "belief",
        "belonging",
        "foundation",
        "basic",
        "belief",
        "belonging",
        "superstructure",
        "nonbasic",
        "receive",
        "justification",
        "justified",
        "belief",
        "foundation",
        "evaluate",
        "foundationalist",
        "account",
        "justification",
        "let",
        "u",
        "first",
        "try",
        "spell",
        "precisely",
        "justified",
        "belief",
        "basic",
        "according",
        "one",
        "approach",
        "make",
        "justified",
        "belief",
        "basic",
        "receive",
        "justification",
        "belief",
        "following",
        "definition",
        "capture",
        "thought",
        "doxastic",
        "basicality",
        "db",
        "justified",
        "belief",
        "p",
        "basic",
        "belief",
        "p",
        "justified",
        "without",
        "owing",
        "justification",
        "belief",
        "let",
        "consider",
        "would",
        "according",
        "db",
        "qualify",
        "example",
        "basic",
        "belief",
        "suppose",
        "notice",
        "whatever",
        "reason",
        "someone",
        "hat",
        "also",
        "notice",
        "hat",
        "look",
        "blue",
        "believe",
        "b",
        "appears",
        "hat",
        "blue",
        "unless",
        "something",
        "strange",
        "going",
        "b",
        "example",
        "justified",
        "belief",
        "db",
        "tell",
        "u",
        "b",
        "basic",
        "owe",
        "justification",
        "belief",
        "b",
        "indeed",
        "basic",
        "might",
        "item",
        "b",
        "owes",
        "justification",
        "item",
        "would",
        "another",
        "belief",
        "call",
        "kind",
        "basicality",
        "doxastic",
        "make",
        "basicality",
        "function",
        "doxastic",
        "system",
        "belief",
        "system",
        "structured",
        "let",
        "u",
        "turn",
        "question",
        "justification",
        "attache",
        "b",
        "might",
        "come",
        "think",
        "basicality",
        "defined",
        "db",
        "note",
        "db",
        "merely",
        "tell",
        "u",
        "b",
        "justified",
        "say",
        "nothing",
        "b",
        "justified",
        "db",
        "therefore",
        "answer",
        "question",
        "need",
        "addition",
        "db",
        "account",
        "justifies",
        "belief",
        "b",
        "according",
        "one",
        "strand",
        "foundationalist",
        "thought",
        "b",
        "justified",
        "false",
        "doubted",
        "corrected",
        "others",
        "view",
        "b",
        "justified",
        "b",
        "carry",
        "epistemic",
        "privilege",
        "infallibility",
        "indubitability",
        "incorrigibility",
        "discussion",
        "various",
        "kind",
        "epistemic",
        "privilege",
        "see",
        "alston",
        "note",
        "b",
        "belief",
        "hat",
        "appears",
        "b",
        "belief",
        "perceptual",
        "experience",
        "according",
        "version",
        "foundationalism",
        "considered",
        "subject",
        "basic",
        "belief",
        "introspective",
        "belief",
        "subject",
        "mental",
        "state",
        "perceptual",
        "experience",
        "make",
        "one",
        "subset",
        "mental",
        "state",
        "subject",
        "basic",
        "belief",
        "may",
        "include",
        "thing",
        "headache",
        "tired",
        "feeling",
        "pleasure",
        "desire",
        "cup",
        "coffee",
        "belief",
        "external",
        "object",
        "qualify",
        "basic",
        "according",
        "kind",
        "foundationalism",
        "impossible",
        "belief",
        "enjoy",
        "kind",
        "epistemic",
        "privilege",
        "necessary",
        "basic",
        "according",
        "different",
        "version",
        "foundationalism",
        "b",
        "justified",
        "mental",
        "state",
        "belief",
        "rather",
        "b",
        "justified",
        "perceptual",
        "experience",
        "b",
        "hat",
        "looking",
        "blue",
        "let",
        "e",
        "represent",
        "experience",
        "according",
        "alternative",
        "proposal",
        "b",
        "e",
        "distinct",
        "mental",
        "state",
        "idea",
        "justifies",
        "b",
        "e",
        "since",
        "e",
        "experience",
        "belief",
        "b",
        "according",
        "db",
        "still",
        "basic",
        "let",
        "call",
        "two",
        "version",
        "foundationalism",
        "distinguished",
        "privilege",
        "foundationalism",
        "experiential",
        "foundationalism",
        "privilege",
        "foundationalism",
        "generally",
        "thought",
        "restrict",
        "basic",
        "belief",
        "belief",
        "contingent",
        "mindindependent",
        "fact",
        "basic",
        "since",
        "belief",
        "fact",
        "generally",
        "thought",
        "lack",
        "privilege",
        "attends",
        "introspective",
        "belief",
        "present",
        "mental",
        "state",
        "belief",
        "priori",
        "necessity",
        "experiential",
        "foundationalism",
        "restrictive",
        "way",
        "suppose",
        "instead",
        "b",
        "believe",
        "h",
        "hat",
        "blue",
        "unlike",
        "b",
        "h",
        "hat",
        "way",
        "hat",
        "appears",
        "belief",
        "one",
        "infallible",
        "otherwise",
        "epistemically",
        "privileged",
        "privilege",
        "foundationalism",
        "would",
        "therefore",
        "classify",
        "h",
        "nonbasic",
        "however",
        "quite",
        "plausible",
        "think",
        "e",
        "justifies",
        "b",
        "h",
        "well",
        "e",
        "indeed",
        "justifies",
        "h",
        "h",
        "receive",
        "additional",
        "justification",
        "belief",
        "h",
        "qualifies",
        "according",
        "db",
        "basic",
        "experiential",
        "foundationalism",
        "combine",
        "two",
        "crucial",
        "idea",
        "justified",
        "belief",
        "basic",
        "justification",
        "owed",
        "belief",
        "ii",
        "fact",
        "justifies",
        "basic",
        "belief",
        "experience",
        "ordinary",
        "circumstance",
        "perceptual",
        "belief",
        "h",
        "based",
        "belief",
        "one",
        "perceptual",
        "experience",
        "clear",
        "therefore",
        "privilege",
        "foundationalism",
        "account",
        "justification",
        "ordinary",
        "perceptual",
        "belief",
        "like",
        "h",
        "experiential",
        "foundationalism",
        "hand",
        "trouble",
        "explaining",
        "ordinary",
        "perceptual",
        "belief",
        "justified",
        "justified",
        "perceptual",
        "experience",
        "give",
        "rise",
        "could",
        "viewed",
        "reason",
        "preferring",
        "experiential",
        "foundationalism",
        "privilege",
        "foundationalism",
        "db",
        "articulates",
        "one",
        "conception",
        "basicality",
        "alternative",
        "conception",
        "epistemic",
        "basicality",
        "eb",
        "justified",
        "belief",
        "p",
        "basic",
        "justification",
        "believing",
        "p",
        "depend",
        "justification",
        "posse",
        "believing",
        "proposition",
        "q",
        "eb",
        "make",
        "difficult",
        "belief",
        "basic",
        "db",
        "see",
        "turn",
        "chief",
        "question",
        "let",
        "call",
        "jquestion",
        "advocate",
        "experiential",
        "foundationalism",
        "face",
        "jquestion",
        "perceptual",
        "experience",
        "source",
        "justification",
        "one",
        "way",
        "answering",
        "jquestion",
        "follows",
        "perceptual",
        "experience",
        "source",
        "justification",
        "justification",
        "taking",
        "reliable",
        "note",
        "justification",
        "believing",
        "p",
        "entail",
        "actually",
        "believe",
        "p",
        "thus",
        "justification",
        "attributing",
        "reliability",
        "perceptual",
        "experience",
        "entail",
        "actually",
        "believe",
        "reliable",
        "might",
        "give",
        "u",
        "justification",
        "thinking",
        "perceptual",
        "experience",
        "reliable",
        "complicated",
        "issue",
        "present",
        "purpose",
        "let",
        "consider",
        "following",
        "answer",
        "remember",
        "served",
        "u",
        "well",
        "past",
        "supposing",
        "justification",
        "attributing",
        "reliability",
        "perceptual",
        "experience",
        "consists",
        "memory",
        "perceptual",
        "success",
        "view",
        "perceptual",
        "experience",
        "e",
        "justifies",
        "perceptual",
        "belief",
        "suitable",
        "trackrecord",
        "memory",
        "give",
        "justification",
        "considering",
        "e",
        "reliable",
        "course",
        "raise",
        "question",
        "memory",
        "give",
        "u",
        "justification",
        "many",
        "different",
        "approach",
        "question",
        "see",
        "fully",
        "view",
        "correct",
        "clear",
        "db",
        "eb",
        "differ",
        "justification",
        "h",
        "depends",
        "justification",
        "believing",
        "something",
        "else",
        "addition",
        "h",
        "namely",
        "visual",
        "experience",
        "reliable",
        "result",
        "h",
        "basic",
        "sense",
        "defined",
        "eb",
        "however",
        "h",
        "might",
        "still",
        "basic",
        "sense",
        "defined",
        "db",
        "justified",
        "believing",
        "h",
        "justification",
        "owed",
        "solely",
        "e",
        "neither",
        "includes",
        "belief",
        "belief",
        "doxasticallythough",
        "epistemicallybasic",
        "considered",
        "one",
        "possible",
        "answer",
        "jquestion",
        "considered",
        "eb",
        "db",
        "differ",
        "answer",
        "correct",
        "possible",
        "answer",
        "jquestion",
        "another",
        "answer",
        "perceptual",
        "experience",
        "source",
        "justification",
        "type",
        "reliably",
        "produce",
        "true",
        "belief",
        "another",
        "answer",
        "perceptual",
        "experience",
        "source",
        "justification",
        "type",
        "reliably",
        "indicate",
        "truth",
        "content",
        "yet",
        "another",
        "answer",
        "perceptual",
        "experience",
        "source",
        "justification",
        "certain",
        "phenomenology",
        "presenting",
        "content",
        "true",
        "conclude",
        "section",
        "let",
        "u",
        "briefly",
        "consider",
        "justification",
        "supposed",
        "transferred",
        "basic",
        "nonbasic",
        "belief",
        "two",
        "option",
        "justificatory",
        "relation",
        "basic",
        "nonbasic",
        "belief",
        "could",
        "deductive",
        "nondeductive",
        "take",
        "relation",
        "deductive",
        "one",
        "nonbasic",
        "belief",
        "would",
        "deduced",
        "one",
        "basic",
        "belief",
        "consider",
        "random",
        "selection",
        "typical",
        "belief",
        "hold",
        "easy",
        "see",
        "basic",
        "belief",
        "could",
        "deduced",
        "foundationalists",
        "therefore",
        "typically",
        "conceive",
        "link",
        "foundation",
        "superstructure",
        "nondeductive",
        "term",
        "would",
        "say",
        "given",
        "set",
        "basic",
        "belief",
        "b",
        "justify",
        "nonbasic",
        "belief",
        "b",
        "necessary",
        "b",
        "entail",
        "b",
        "rather",
        "sufficient",
        "inference",
        "b",
        "b",
        "rational",
        "onehowever",
        "rationality",
        "understood"
    ]
}