{
    "main_text": "The Value of Equality: Why Equality? || . Kinds of Egalitarianism\n6.2 Equality vs. Priority or Sufficiency\n\nAlongside the often-raised objections against equality mentioned in\nthe section on “simple equality” (3.1. above) there is a\ndifferent and more fundamental critique formulated by first level\nnon-egalitarians: that equality does not have a foundational role in\nthe grounding of claims to justice. While the older version of a\ncritique of egalitarianism comes mainly from the conservative end of\nthe political spectrum, thus arguing in general against\n“patterned principles of justice” (Nozick 1974, esp. pp.\n156–157), the critique’s newer version also often can be heard in\nprogressive circles (Walzer 1983, Raz 1986, chap. 9, Frankfurt 1987,\n1997, Parfit 1997, Anderson 1999). This first-level critique of\nequality poses the basic question of why justice should in fact be\nconceived relationally and (what is here the same) comparatively.\nReferring back to Joel Feinberg’s (1974) distinction between\ncomparative and non-comparative justice, non-egalitarians object to\nthe moral requirement to treat people as equals, and the many demands\nfor justice emerging from it. They argue that neither the postulate\nnor these demands involve comparative principles, let alone any\nequality principles. They reproach first-level egalitarians for a\nconfusion between “equality” and “universals.”\nAs the non-egalitarians see things, within many principles of justice\n– at least the especially important ones – the\nequality-terminology is redundant. Equality is thus merely a byproduct\nof the general fulfillment of actually non-comparative standards of\njustice: something obscured through the unnecessary insertion of an\nexpression of equality (Raz 1986, p. 227f.). At least the central\nstandards of dignified human life are not relational but\n“absolute.” As Harry Frankfurt puts it: “It is\nwhether people have good lives, and not how their lives compare with\nthe lives of others” (Frankfurt 1997, p. 6). And again:\n“The fundamental error of egalitarianism lies in supposing that\nit is morally important whether one person has less than another\nregardless of how much either of them has” (Frankfurt 1987, p.\n34).\n\nFrom the non-egalitarian perspective, what is really at stake in\nhelping those worse off and improving their lot is humanitarian\nconcern, a desire to alleviate suffering. Such concern is not\nunderstood as egalitarian, as it is not focused on the difference\nbetween the better off and the worse off as such (whatever the applied\nstandard), but on improving the situation of the latter. Their\ndistress constitutes the actual moral foundation. The wealth of those\nbetter off only furnishes a means that has to be transferred for the\nsake of mitigating the distress, as long as other, morally negative\nconsequences do not emerge in the process. The strength of the impetus\nfor more equality lies in the urgency of the claims of those worse\noff, not in the extent of the inequality. For this reason, instead of\nequality the non-egalitarian critics favor one or another\nentitlement theory of justice, such as Nozick’s (1974)\nlibertarianism (cf. 3.2. above) and Frankfurt’s (1987) doctrine of\nsufficiency, according to which “What is important from the\nmoral point of view is not that everyone should have the same\nbut that each should have enough. If everyone had enough, it\nwould be of no moral consequence whether some had more than\nothers” (Frankfurt 1987, p. 21).\n\nParfit’s (1997) priority view accordingly calls for a focus\non improving the situation of society’s weaker and poorer members, and\nindeed all the more urgently the worse off they are, even if they can\nbe less helped than others in the process. Parfit (1995) distinguishes\nbetween egalitarianism and prioritarianism. According to\nprioritarians, benefiting people is more important the worse off those\npeople are. This prioritising will often increase equality, but they\nare two distinct values, since in an important respect equality is a\nrelational value while priority is not. However, egalitarians and\nprioritarians share an important feature, in that both hold that the\nbest possible distribution of a fixed sum of goods is an equal one. It\nis thus a matter of debate whether prioritarianism is a sort of\negalitarianism or a (decent) inegalitarianism. In any case,\nentitlement-based non-egalitarian arguments can practically result in\nan equality of outcome as far-reaching as egalitarian theories. Hence\nthe fulfillment of an absolute or non-comparative standard for\neveryone (e.g. to the effect that nobody should starve) frequently\nresults in a certain equality of outcome, where such a standard\ncomprises not only a decent but a good life. Consequently, the debate\nhere centers on the basis – is it equality or something else?\n– and not so much on the outcome – are persons or groups\nmore or less equal, according to a chosen metric? Possibly, the\ndifference lies even deeper, in their respective conceptions of\nmorality in general.\n\nEgalitarians can respond to the anti-egalitarian critique by conceding\nthat it is the nature of some (however certainly far from all)\nessential norms of morality and justice to be concerned primarily with\nthe adequate fulfillment of the separate claims of individuals.\nHowever, whether a claim can itself be considered suitable can be\nascertained only by asking whether it can be agreed on by all those\naffected in hypothetical conditions of freedom and equality. (See,\ne.g., Casal 2007 for a deeper discussion and critique of the doctrine\nof sufficiency.) This justificatory procedure is more necessary if it\nis less evident that what is at stake is actually suffering, distress,\nor an objective need. In the view of the constitutive egalitarians,\nall the judgments of distributive justice should be approached\nrelationally, by asking which distributive scheme all concerned\nparties can universally and reciprocally agree to. As described at\nsome length in the pertinent section above, many egalitarians argue\nthat a presumption in favor of equality follows from this\njustification requirement. In the eyes of such egalitarians, this is\nall one needs for the justification and determination of the\nconstitutive value of equality.\n\nSecondly, even if – for the sake of argument – the\nquestion is left open as to whether demands for distribution according\nto objective needs (e.g. alleviating hunger) involve non-comparative\nentitlement-claims, it is nonetheless always necessary to resolve the\nquestion of what needy individuals are owed. And this is tied in a\nbasic way to the question of what persons owe one another in\ncomparable or worse situations, and how scarce resources (money,\ngoods, time, energy) must be invested in light of the sum total of our\nobligations. While the claim on our aid may well appear\nnon-relational, determining the kind and extent of the aid must always\nbe relational, at least in circumstances of scarcity (and resources\nare always scarce). Claims are either “satiable” (Raz\n1986, p. 235) – i.e., an upper limit or sufficiency level can be\nindicated, after which each person’s claim to X has been fulfilled\n– or they are not. For insatiable claims, to stipulate any level\nat which one is or ought to be sufficiently satisfied is arbitrary. If\nthe standards of sufficiency are defined as a bare minimum, why should\npersons be content with that minimum? Why should the manner in which\nwelfare and resources are distributed above the poverty level not also\nbe a question of justice? If, by contrast, we are concerned solely\nwith claims that are in principle “satiable,” such claims\nhaving a reasonable definition of sufficiency, then these standards of\nsufficiency will most likely be very high. In Frankfurt’s definition,\nfor example, sufficiency is reached only when persons are satisfied\nand no longer actively strive for more. Since people find themselves\nourselves operating, in practice, in circumstances far beneath such a\nhigh sufficiency level, they (of course) live under conditions of\n(moderate) scarcity. Then the above mentioned argument holds as well\n– namely, that in order to determine to what extent it is to be\nfulfilled, each claim has to be judged in relation to the claims of\nall others and all available resources. In addition, the moral urgency\nof lifting people above dire poverty cannot be invoked to demonstrate\nthe moral urgency of everyone having enough. In both forms of scarcity\n– i.e., with satiable and insatiable claims – the social\nright or claim to goods cannot be conceived as something absolute or\nnon-comparative. Egalitarians may thus conclude that distributive\njustice is always comparative. This would suggest that distributive\nequality, especially equality of life-conditions, should play a\nfundamental role in any adequate theory of justice in particular, and\nof morality in general.\n",
    "section_title": "6.2 Equality vs. Priority or Sufficiency",
    "entry_title": "Equality",
    "hierarchy_title": "Equality || The Value of Equality: Why Equality? || . Kinds of Egalitarianism",
    "tokenized_text": [
        "value",
        "equality",
        "equality",
        "kind",
        "egalitarianism",
        "equality",
        "vs",
        "priority",
        "sufficiency",
        "alongside",
        "oftenraised",
        "objection",
        "equality",
        "mentioned",
        "section",
        "simple",
        "equality",
        "different",
        "fundamental",
        "critique",
        "formulated",
        "first",
        "level",
        "nonegalitarians",
        "equality",
        "foundational",
        "role",
        "grounding",
        "claim",
        "justice",
        "older",
        "version",
        "critique",
        "egalitarianism",
        "come",
        "mainly",
        "conservative",
        "end",
        "political",
        "spectrum",
        "thus",
        "arguing",
        "general",
        "patterned",
        "principle",
        "justice",
        "nozick",
        "esp",
        "pp",
        "critique",
        "newer",
        "version",
        "also",
        "often",
        "heard",
        "progressive",
        "circle",
        "walzer",
        "raz",
        "chap",
        "frankfurt",
        "parfit",
        "anderson",
        "firstlevel",
        "critique",
        "equality",
        "pose",
        "basic",
        "question",
        "justice",
        "fact",
        "conceived",
        "relationally",
        "comparatively",
        "referring",
        "back",
        "joel",
        "feinberg",
        "distinction",
        "comparative",
        "noncomparative",
        "justice",
        "nonegalitarians",
        "object",
        "moral",
        "requirement",
        "treat",
        "people",
        "equal",
        "many",
        "demand",
        "justice",
        "emerging",
        "argue",
        "neither",
        "postulate",
        "demand",
        "involve",
        "comparative",
        "principle",
        "let",
        "alone",
        "equality",
        "principle",
        "reproach",
        "firstlevel",
        "egalitarian",
        "confusion",
        "equality",
        "universals",
        "nonegalitarians",
        "see",
        "thing",
        "within",
        "many",
        "principle",
        "justice",
        "least",
        "especially",
        "important",
        "one",
        "equalityterminology",
        "redundant",
        "equality",
        "thus",
        "merely",
        "byproduct",
        "general",
        "fulfillment",
        "actually",
        "noncomparative",
        "standard",
        "justice",
        "something",
        "obscured",
        "unnecessary",
        "insertion",
        "expression",
        "equality",
        "raz",
        "p",
        "f",
        "least",
        "central",
        "standard",
        "dignified",
        "human",
        "life",
        "relational",
        "absolute",
        "harry",
        "frankfurt",
        "put",
        "whether",
        "people",
        "good",
        "life",
        "life",
        "compare",
        "life",
        "others",
        "frankfurt",
        "p",
        "fundamental",
        "error",
        "egalitarianism",
        "lie",
        "supposing",
        "morally",
        "important",
        "whether",
        "one",
        "person",
        "le",
        "another",
        "regardless",
        "much",
        "either",
        "frankfurt",
        "p",
        "nonegalitarian",
        "perspective",
        "really",
        "stake",
        "helping",
        "worse",
        "improving",
        "lot",
        "humanitarian",
        "concern",
        "desire",
        "alleviate",
        "suffering",
        "concern",
        "understood",
        "egalitarian",
        "focused",
        "difference",
        "better",
        "worse",
        "whatever",
        "applied",
        "standard",
        "improving",
        "situation",
        "latter",
        "distress",
        "constitutes",
        "actual",
        "moral",
        "foundation",
        "wealth",
        "better",
        "furnishes",
        "mean",
        "transferred",
        "sake",
        "mitigating",
        "distress",
        "long",
        "morally",
        "negative",
        "consequence",
        "emerge",
        "process",
        "strength",
        "impetus",
        "equality",
        "lie",
        "urgency",
        "claim",
        "worse",
        "extent",
        "inequality",
        "reason",
        "instead",
        "equality",
        "nonegalitarian",
        "critic",
        "favor",
        "one",
        "another",
        "entitlement",
        "theory",
        "justice",
        "nozick",
        "libertarianism",
        "cf",
        "frankfurt",
        "doctrine",
        "sufficiency",
        "according",
        "important",
        "moral",
        "point",
        "view",
        "everyone",
        "enough",
        "everyone",
        "enough",
        "would",
        "moral",
        "consequence",
        "whether",
        "others",
        "frankfurt",
        "p",
        "parfit",
        "priority",
        "view",
        "accordingly",
        "call",
        "focus",
        "improving",
        "situation",
        "society",
        "weaker",
        "poorer",
        "member",
        "indeed",
        "urgently",
        "worse",
        "even",
        "le",
        "helped",
        "others",
        "process",
        "parfit",
        "distinguishes",
        "egalitarianism",
        "prioritarianism",
        "according",
        "prioritarians",
        "benefiting",
        "people",
        "important",
        "worse",
        "people",
        "prioritising",
        "often",
        "increase",
        "equality",
        "two",
        "distinct",
        "value",
        "since",
        "important",
        "respect",
        "equality",
        "relational",
        "value",
        "priority",
        "however",
        "egalitarian",
        "prioritarians",
        "share",
        "important",
        "feature",
        "hold",
        "best",
        "possible",
        "distribution",
        "fixed",
        "sum",
        "good",
        "equal",
        "one",
        "thus",
        "matter",
        "debate",
        "whether",
        "prioritarianism",
        "sort",
        "egalitarianism",
        "decent",
        "inegalitarianism",
        "case",
        "entitlementbased",
        "nonegalitarian",
        "argument",
        "practically",
        "result",
        "equality",
        "outcome",
        "farreaching",
        "egalitarian",
        "theory",
        "hence",
        "fulfillment",
        "absolute",
        "noncomparative",
        "standard",
        "everyone",
        "eg",
        "effect",
        "nobody",
        "starve",
        "frequently",
        "result",
        "certain",
        "equality",
        "outcome",
        "standard",
        "comprises",
        "decent",
        "good",
        "life",
        "consequently",
        "debate",
        "center",
        "basis",
        "equality",
        "something",
        "else",
        "much",
        "outcome",
        "person",
        "group",
        "le",
        "equal",
        "according",
        "chosen",
        "metric",
        "possibly",
        "difference",
        "lie",
        "even",
        "deeper",
        "respective",
        "conception",
        "morality",
        "general",
        "egalitarian",
        "respond",
        "antiegalitarian",
        "critique",
        "conceding",
        "nature",
        "however",
        "certainly",
        "far",
        "essential",
        "norm",
        "morality",
        "justice",
        "concerned",
        "primarily",
        "adequate",
        "fulfillment",
        "separate",
        "claim",
        "individual",
        "however",
        "whether",
        "claim",
        "considered",
        "suitable",
        "ascertained",
        "asking",
        "whether",
        "agreed",
        "affected",
        "hypothetical",
        "condition",
        "freedom",
        "equality",
        "see",
        "eg",
        "casal",
        "deeper",
        "discussion",
        "critique",
        "doctrine",
        "sufficiency",
        "justificatory",
        "procedure",
        "necessary",
        "le",
        "evident",
        "stake",
        "actually",
        "suffering",
        "distress",
        "objective",
        "need",
        "view",
        "constitutive",
        "egalitarian",
        "judgment",
        "distributive",
        "justice",
        "approached",
        "relationally",
        "asking",
        "distributive",
        "scheme",
        "concerned",
        "party",
        "universally",
        "reciprocally",
        "agree",
        "described",
        "length",
        "pertinent",
        "section",
        "many",
        "egalitarian",
        "argue",
        "presumption",
        "favor",
        "equality",
        "follows",
        "justification",
        "requirement",
        "eye",
        "egalitarian",
        "one",
        "need",
        "justification",
        "determination",
        "constitutive",
        "value",
        "equality",
        "secondly",
        "even",
        "sake",
        "argument",
        "question",
        "left",
        "open",
        "whether",
        "demand",
        "distribution",
        "according",
        "objective",
        "need",
        "eg",
        "alleviating",
        "hunger",
        "involve",
        "noncomparative",
        "entitlementclaims",
        "nonetheless",
        "always",
        "necessary",
        "resolve",
        "question",
        "needy",
        "individual",
        "owed",
        "tied",
        "basic",
        "way",
        "question",
        "person",
        "owe",
        "one",
        "another",
        "comparable",
        "worse",
        "situation",
        "scarce",
        "resource",
        "money",
        "good",
        "time",
        "energy",
        "must",
        "invested",
        "light",
        "sum",
        "total",
        "obligation",
        "claim",
        "aid",
        "may",
        "well",
        "appear",
        "nonrelational",
        "determining",
        "kind",
        "extent",
        "aid",
        "must",
        "always",
        "relational",
        "least",
        "circumstance",
        "scarcity",
        "resource",
        "always",
        "scarce",
        "claim",
        "either",
        "satiable",
        "raz",
        "p",
        "ie",
        "upper",
        "limit",
        "sufficiency",
        "level",
        "indicated",
        "person",
        "claim",
        "x",
        "fulfilled",
        "insatiable",
        "claim",
        "stipulate",
        "level",
        "one",
        "ought",
        "sufficiently",
        "satisfied",
        "arbitrary",
        "standard",
        "sufficiency",
        "defined",
        "bare",
        "minimum",
        "person",
        "content",
        "minimum",
        "manner",
        "welfare",
        "resource",
        "distributed",
        "poverty",
        "level",
        "also",
        "question",
        "justice",
        "contrast",
        "concerned",
        "solely",
        "claim",
        "principle",
        "satiable",
        "claim",
        "reasonable",
        "definition",
        "sufficiency",
        "standard",
        "sufficiency",
        "likely",
        "high",
        "frankfurt",
        "definition",
        "example",
        "sufficiency",
        "reached",
        "person",
        "satisfied",
        "longer",
        "actively",
        "strive",
        "since",
        "people",
        "find",
        "operating",
        "practice",
        "circumstance",
        "far",
        "beneath",
        "high",
        "sufficiency",
        "level",
        "course",
        "live",
        "condition",
        "moderate",
        "scarcity",
        "mentioned",
        "argument",
        "hold",
        "well",
        "namely",
        "order",
        "determine",
        "extent",
        "fulfilled",
        "claim",
        "judged",
        "relation",
        "claim",
        "others",
        "available",
        "resource",
        "addition",
        "moral",
        "urgency",
        "lifting",
        "people",
        "dire",
        "poverty",
        "invoked",
        "demonstrate",
        "moral",
        "urgency",
        "everyone",
        "enough",
        "form",
        "scarcity",
        "ie",
        "satiable",
        "insatiable",
        "claim",
        "social",
        "right",
        "claim",
        "good",
        "conceived",
        "something",
        "absolute",
        "noncomparative",
        "egalitarian",
        "may",
        "thus",
        "conclude",
        "distributive",
        "justice",
        "always",
        "comparative",
        "would",
        "suggest",
        "distributive",
        "equality",
        "especially",
        "equality",
        "lifeconditions",
        "play",
        "fundamental",
        "role",
        "adequate",
        "theory",
        "justice",
        "particular",
        "morality",
        "general"
    ]
}