{
    "main_text": "Equality of Opportunity and the Family\n7. Equality of Opportunity and the Family\n\nOne thing these matters draw our attention to, however, is the\npotential for Equality of Opportunity to conflict with other\nconsiderations and values. A substantial amount of work has been\ndevoted to the scope for conflict between the demands of Equality of\nOpportunity and the role of the family in particular (Brighouse &\nSwift 2009; James Fishkin 1983; 1987; Joseph Fishkin 2014:\n48–56; MacLeod, 2002; Mason 2006: ch. 3; Miller 2013;\nMunoz-Dardé 1999; Okin 1989; Swift 2005). As indicated above,\ndifferent families will foster different environments and take\ndifferent measures for children which will often manifest in\ndifferences in prospects. Indeed, Rawls himself notes that “the\nfamily may be a barrier to equal chances between individuals”\ngiven that\n\n\nthe internal life and culture of the family influence, perhaps as much\nas anything else, a child’s motivation and his capacity to gain\nfrom education, and so in turn his life prospects. (Rawls 1999:\n265)\n\n\nRawls maintains that FEO does not require the eradication of such\ndifferences across families, because it only requires correcting for\nsocial class inequality (Rawls 1999: 265, although other passages in\nRawls seem in tension with this, for instance where he concedes that\nFEO can “be only imperfectly carried out, at least as long as\nsome form of the family exists” (1999: 64)). Nevertheless,\nbecause the existence of the family as a social institution will\nalways result in unequal chances for different individuals, he poses\nthe question\n\n\nIs the family to be abolished then? Taken by itself and given a\ncertain primacy, the idea of equality of opportunity inclines in this\ndirection. (Rawls 1999: 448)\n\n\nThere is a tension, then, between the existence of the family and the\nrealization of equal prospects for all individuals in society. What is\nmore, as Rawls’s remarks suggest, the tension does not seem to\nbe particular only to modes of family organization in present-day\nsocieties but seems to pertain to any conceivable form of the family\n(James Fishkin 1983: 48–49). This provokes the question of\nwhether the family is inconsistent with a defensible conception of\nEquality of Opportunity and, if they are incompatible with one\nanother, how far, if at all, should the activities of the family be\ncircumscribed by the requirements of Equality of Opportunity (for an\nargument that they are not necessarily incompatible, see\nArneson 2002 [2015]).\n\nA number of considerations will have a bearing on the answer to that\nquestion, including the kinds of values that the family embodies or\nserves (for instance, manifesting intimate relationships and nurturing\nresponsible, conscientious future citizens), which kinds of activities\nare integral to the family and its service of those values (for\ninstance, family members engaging in shared leisure and learning),\nwhether there are alternative sources of those values other than the\nfamily as traditionally organized (such as, perhaps, state-run\ncollective child-rearing), how far the equality-disrupting effects of\nthe family can be mitigated by other social measures (for instance, by\ncompensation or affirmative action), and, of course, which factors can\njustly affect differences in peoples’ social prospects.\n\nOne thing worth noting here is that there are different ways of\nconceiving of Equality of Opportunity in relation to such questions.\nThe first independently identifies which factors obstruct\npersons’ enjoyment of a fair chance—such as facing a less\nnurturing family environment—and then considers how far such\nunfairness should circumscribe the activities of the family and/or\ncommend other corrective social measures. On this approach, for\ninstance, one might conclude that differential family nurturing does\nindeed disrupt Equality of Opportunity—because it undermines\nfair life chances—but one might conclude that the values served\nby the family justify tolerating some degree of loss of Equality of\nOpportunity. The second involves specifying Equality of Opportunity\nafter taking into account other values, such as those served\nby the family. On this approach, one might conclude that the nurturing\nrole played by the family is so fundamentally important that even\nthough it creates unequal prospects, those unequal prospects are a\nprice worth paying for a society organized around familial care. On\nthis second way of thinking about Equality of Opportunity, however,\nthose unequal prospects do not undermine Equality of Opportunity\nprecisely because they are justified by the value of an institution\nsuch as the family. The former uses the label “Equality of\nOpportunity” to pick out the pro tanto consideration of\nunfairness involved in differential prospects, the latter uses the\nlabel “Equality of Opportunity” to pick out the\n“more-things-considered” conclusion about which\ndifferential prospects remain unjustified by other values. The\ndifference between these two ways of thinking about Equality of\nOpportunity is not necessarily substantive. Rather, they differ in\nrespect of the degree to which “Equality of Opportunity”\nas an ideal takes into account values other than inequality in\nprospects.\n\nOne account famous for its advocating the abolition of the family is\nfound in Plato’s Republic (V 457). Even those who place\nsignificant weight on a thick understanding of Equality of Opportunity\nhave tended to resist this conclusion, not necessarily because they\nconclude that Equality of Opportunity can be entirely reconciled with\nthe existence of the family, but because the existence of the family\nis often defended as indispensable for serving certain values.\n\nAn apparently straightforward reason to object to the abolition of the\nfamily is that it would place constraints on the freedom and autonomy\nof parents to raise children. Although it is widely accepted that\nparental rights to rear children are limited by the interests of the\nchildren within the family, for many parents raising children is an\nimportant source of flourishing and the abolition of the family would\nconstitute a constraint on this. Indeed, whether or not child-rearing\nis in fact a source of flourishing for any given potential parent, it\nmight still be thought to constrain a potential parent’s\nautonomy if the state were to prohibit that life-choice. One challenge\nto such a parent-centred defence of the family and the parental rights\nassociated with it, draws attention to the difficulty of justifying\nrights of control over others based on the controlling party’s\nown interests (Brighouse & Swift 2006: 82). Rather than justifying\nthe institution of the family on the grounds of parents’\ninterest, one might point to other interests at stake in the form of\nthe interests of children, or in the interests of third parties.\n\nOne such suggestion is that the family is more reliable at cultivating\ncertain capacities for flourishing in children than any alternative\nsocial arrangement (Brennan & Noggle 1997; Munoz Dardé\n1999). There are a range of accounts here, but the basis of broad\nalignment is that familial relationships are generally of important\nservice to children’s interests, either in order to equip\nchildren with the wide range of capacities necessary for healthy\ndevelopment and self-determination (Munoz Dardé 1999), or in\norder to provide the preconditions for a flourishing childhood\n(Brennan 2014). A child-centred account of this kind still seems to\nneed to explain why the family should not still be subject to\nsubstantial constraints when such constraints are necessary to help\nequip other children, outside the family, with such capacities. If\nthere are certain goods that can only be provided for children through\nparental nurture within the family, what does this imply for broader\nsocial obligations to ensure that all children enjoy relevantly equal\nopportunities to enjoy those goods?\n\nA further, compatible, claim is that the institution of the family can\nbe justified by its service to the interest of third parties. It is\nsometimes argued that children are a type of public good (Folbre 1994;\n2008; Olsaretti 2013) whose development as future citizens has\nsignificant implications for the social order as a whole. In this\ncontext, Jennifer Roback Morse (1999) argues, for instance, that the\nfamily plays an indispensable role in raising persons capable of\ntrust, co-operation, and self-restraint. A well-functioning society\ndepends on sufficient numbers of citizens possessing such traits such\nthat they can engage in the forms of social co-operation necessary to\nsustain collective self-governance.\n\nPerhaps the most notable parent-centred account in recent years is\noffered by Brighouse and Swift (2006), who argue that parents’\ninterests are served by certain control rights over children and that\nthose parental interests also permit certain forms of parental\npartiality towards children which will naturally disrupt Equality of\nOpportunity (2009). They argue that\n\n\nParents enjoy a distinctively valuable relationship with their\nchildren; one that is intimate and mutually loving,\n\n\nand that\n\n\nthe institution of the family allows [the parent] to have [this]\nrelationship of a kind that cannot be substituted for by relationships\nwith other adults. (Brighouse & Swift 2009: 53–54)\n\n\nIn other words, the internal life of the family, along with shared\nactivities, experiences and even values between its members, support a\ndistinctive source of intimacy between parent and child which offers a\ndistinctive source of flourishing for parents. Other relationships are\nnot substitutable with those between parent child, so the abolition of\nthe family would mean that a particular, and valuable, source of\nflourishing would be lost. In order to create, sustain, and enjoy\nrelationships of such value, parents need to be able to do things with\nand for their children, and this will inevitably tend to create\ndifferences between families, leading some children to benefit more\nthan others. Although this will almost certainly disrupt Equality of\nOpportunity, Brighouse and Swift suggest that the value of these\nintimate relationships is a potential justification for such\ninequality. Some activities will be necessary to nourish these\nrelations of intimacy, whereas others will not. In the group of\nactivities that will be necessary, Brighouse and Swift (2009: 57) give\nthe examples of reading bedtime stories to children and parents\nenrolling children in associations which will enable them to\nparticipate in communities of value that can be shared between parent\nand child. In contrast, it is very unlikely that enrolling children in\nexpensive private schools designed to maximize their future\nopportunities, or investing in trust funds, will be essential for\nparent and child to enjoy the goods distinctively supported by family\nrelationships (Brighouse & Swift 2009: 58). If those other\nactivities are to be justified, given the inequality they tend to\nperpetuate, it must be on the basis of other values, rather than this\nspecial familial intimacy.\n\nIn work that explores the societal factors which tend to result in\nunequal life chances between different persons the family is\nunderstandably foregrounded in discussion. This is because it is so\nformative as a developmental pathway which has a bearing on the\nprospects for acquiring the traits to be successful in social\ncompetition (for a good analysis of the mechanisms by which families\ntransmit advantages see Swift 2005). At bottom, however, the conflict\nis more general. For it seems that when persons exercise their\nassociational freedom in different ways this generates inequality. The\ntension between the family and Equality of Opportunity reflects a more\ngeneral tension between freedom—to organize associations, to\nfavour some over others—and equality (James Fishkin 1987). The\ntension manifests to different degrees and in different ways,\ndepending on the thickness of one’s conception of Equality of\nOpportunity, but it seems present to at least some degree for all\nconceptions. For instance, the freedom to racially discriminate is\nconstrained by relatively thin, formal conceptions of Equality of\nOpportunity. Meritocratic conceptions go further and constrain the\nfreedom to select on grounds other than the best qualified. More\nsubstantive conceptions of Equality of Opportunity go still further,\nand imply a tension between relevantly equal life chances and the\nfreedom to associate and promote the good of particular others, which\nmanifests different prospects between different persons.\n",
    "section_title": "7. Equality of Opportunity and the Family",
    "entry_title": "Equality of Opportunity",
    "hierarchy_title": "Equality of Opportunity || Equality of Opportunity and the Family",
    "tokenized_text": [
        "equality",
        "opportunity",
        "family",
        "equality",
        "opportunity",
        "family",
        "one",
        "thing",
        "matter",
        "draw",
        "attention",
        "however",
        "potential",
        "equality",
        "opportunity",
        "conflict",
        "consideration",
        "value",
        "substantial",
        "amount",
        "work",
        "devoted",
        "scope",
        "conflict",
        "demand",
        "equality",
        "opportunity",
        "role",
        "family",
        "particular",
        "brighouse",
        "swift",
        "james",
        "fishkin",
        "joseph",
        "fishkin",
        "macleod",
        "mason",
        "ch",
        "miller",
        "munozdardé",
        "okin",
        "swift",
        "indicated",
        "different",
        "family",
        "foster",
        "different",
        "environment",
        "take",
        "different",
        "measure",
        "child",
        "often",
        "manifest",
        "difference",
        "prospect",
        "indeed",
        "rawls",
        "note",
        "family",
        "may",
        "barrier",
        "equal",
        "chance",
        "individual",
        "given",
        "internal",
        "life",
        "culture",
        "family",
        "influence",
        "perhaps",
        "much",
        "anything",
        "else",
        "child",
        "motivation",
        "capacity",
        "gain",
        "education",
        "turn",
        "life",
        "prospect",
        "rawls",
        "rawls",
        "maintains",
        "feo",
        "require",
        "eradication",
        "difference",
        "across",
        "family",
        "requires",
        "correcting",
        "social",
        "class",
        "inequality",
        "rawls",
        "although",
        "passage",
        "rawls",
        "seem",
        "tension",
        "instance",
        "concedes",
        "feo",
        "imperfectly",
        "carried",
        "least",
        "long",
        "form",
        "family",
        "exists",
        "nevertheless",
        "existence",
        "family",
        "social",
        "institution",
        "always",
        "result",
        "unequal",
        "chance",
        "different",
        "individual",
        "pose",
        "question",
        "family",
        "abolished",
        "taken",
        "given",
        "certain",
        "primacy",
        "idea",
        "equality",
        "opportunity",
        "incline",
        "direction",
        "rawls",
        "tension",
        "existence",
        "family",
        "realization",
        "equal",
        "prospect",
        "individual",
        "society",
        "rawls",
        "remark",
        "suggest",
        "tension",
        "seem",
        "particular",
        "mode",
        "family",
        "organization",
        "presentday",
        "society",
        "seems",
        "pertain",
        "conceivable",
        "form",
        "family",
        "james",
        "fishkin",
        "provokes",
        "question",
        "whether",
        "family",
        "inconsistent",
        "defensible",
        "conception",
        "equality",
        "opportunity",
        "incompatible",
        "one",
        "another",
        "far",
        "activity",
        "family",
        "circumscribed",
        "requirement",
        "equality",
        "opportunity",
        "argument",
        "necessarily",
        "incompatible",
        "see",
        "arneson",
        "number",
        "consideration",
        "bearing",
        "answer",
        "question",
        "including",
        "kind",
        "value",
        "family",
        "embodies",
        "serf",
        "instance",
        "manifesting",
        "intimate",
        "relationship",
        "nurturing",
        "responsible",
        "conscientious",
        "future",
        "citizen",
        "kind",
        "activity",
        "integral",
        "family",
        "service",
        "value",
        "instance",
        "family",
        "member",
        "engaging",
        "shared",
        "leisure",
        "learning",
        "whether",
        "alternative",
        "source",
        "value",
        "family",
        "traditionally",
        "organized",
        "perhaps",
        "staterun",
        "collective",
        "childrearing",
        "far",
        "equalitydisrupting",
        "effect",
        "family",
        "mitigated",
        "social",
        "measure",
        "instance",
        "compensation",
        "affirmative",
        "action",
        "course",
        "factor",
        "justly",
        "affect",
        "difference",
        "people",
        "social",
        "prospect",
        "one",
        "thing",
        "worth",
        "noting",
        "different",
        "way",
        "conceiving",
        "equality",
        "opportunity",
        "relation",
        "question",
        "first",
        "independently",
        "identifies",
        "factor",
        "obstruct",
        "person",
        "enjoyment",
        "fair",
        "chancesuch",
        "facing",
        "le",
        "nurturing",
        "family",
        "environmentand",
        "considers",
        "far",
        "unfairness",
        "circumscribe",
        "activity",
        "family",
        "andor",
        "commend",
        "corrective",
        "social",
        "measure",
        "approach",
        "instance",
        "one",
        "might",
        "conclude",
        "differential",
        "family",
        "nurturing",
        "indeed",
        "disrupt",
        "equality",
        "opportunitybecause",
        "undermines",
        "fair",
        "life",
        "chancesbut",
        "one",
        "might",
        "conclude",
        "value",
        "served",
        "family",
        "justify",
        "tolerating",
        "degree",
        "loss",
        "equality",
        "opportunity",
        "second",
        "involves",
        "specifying",
        "equality",
        "opportunity",
        "taking",
        "account",
        "value",
        "served",
        "family",
        "approach",
        "one",
        "might",
        "conclude",
        "nurturing",
        "role",
        "played",
        "family",
        "fundamentally",
        "important",
        "even",
        "though",
        "creates",
        "unequal",
        "prospect",
        "unequal",
        "prospect",
        "price",
        "worth",
        "paying",
        "society",
        "organized",
        "around",
        "familial",
        "care",
        "second",
        "way",
        "thinking",
        "equality",
        "opportunity",
        "however",
        "unequal",
        "prospect",
        "undermine",
        "equality",
        "opportunity",
        "precisely",
        "justified",
        "value",
        "institution",
        "family",
        "former",
        "us",
        "label",
        "equality",
        "opportunity",
        "pick",
        "pro",
        "tanto",
        "consideration",
        "unfairness",
        "involved",
        "differential",
        "prospect",
        "latter",
        "us",
        "label",
        "equality",
        "opportunity",
        "pick",
        "morethingsconsidered",
        "conclusion",
        "differential",
        "prospect",
        "remain",
        "unjustified",
        "value",
        "difference",
        "two",
        "way",
        "thinking",
        "equality",
        "opportunity",
        "necessarily",
        "substantive",
        "rather",
        "differ",
        "respect",
        "degree",
        "equality",
        "opportunity",
        "ideal",
        "take",
        "account",
        "value",
        "inequality",
        "prospect",
        "one",
        "account",
        "famous",
        "advocating",
        "abolition",
        "family",
        "found",
        "plato",
        "republic",
        "v",
        "even",
        "place",
        "significant",
        "weight",
        "thick",
        "understanding",
        "equality",
        "opportunity",
        "tended",
        "resist",
        "conclusion",
        "necessarily",
        "conclude",
        "equality",
        "opportunity",
        "entirely",
        "reconciled",
        "existence",
        "family",
        "existence",
        "family",
        "often",
        "defended",
        "indispensable",
        "serving",
        "certain",
        "value",
        "apparently",
        "straightforward",
        "reason",
        "object",
        "abolition",
        "family",
        "would",
        "place",
        "constraint",
        "freedom",
        "autonomy",
        "parent",
        "raise",
        "child",
        "although",
        "widely",
        "accepted",
        "parental",
        "right",
        "rear",
        "child",
        "limited",
        "interest",
        "child",
        "within",
        "family",
        "many",
        "parent",
        "raising",
        "child",
        "important",
        "source",
        "flourishing",
        "abolition",
        "family",
        "would",
        "constitute",
        "constraint",
        "indeed",
        "whether",
        "childrearing",
        "fact",
        "source",
        "flourishing",
        "given",
        "potential",
        "parent",
        "might",
        "still",
        "thought",
        "constrain",
        "potential",
        "parent",
        "autonomy",
        "state",
        "prohibit",
        "lifechoice",
        "one",
        "challenge",
        "parentcentred",
        "defence",
        "family",
        "parental",
        "right",
        "associated",
        "draw",
        "attention",
        "difficulty",
        "justifying",
        "right",
        "control",
        "others",
        "based",
        "controlling",
        "party",
        "interest",
        "brighouse",
        "swift",
        "rather",
        "justifying",
        "institution",
        "family",
        "ground",
        "parent",
        "interest",
        "one",
        "might",
        "point",
        "interest",
        "stake",
        "form",
        "interest",
        "child",
        "interest",
        "third",
        "party",
        "one",
        "suggestion",
        "family",
        "reliable",
        "cultivating",
        "certain",
        "capacity",
        "flourishing",
        "child",
        "alternative",
        "social",
        "arrangement",
        "brennan",
        "noggle",
        "munoz",
        "dardé",
        "range",
        "account",
        "basis",
        "broad",
        "alignment",
        "familial",
        "relationship",
        "generally",
        "important",
        "service",
        "child",
        "interest",
        "either",
        "order",
        "equip",
        "child",
        "wide",
        "range",
        "capacity",
        "necessary",
        "healthy",
        "development",
        "selfdetermination",
        "munoz",
        "dardé",
        "order",
        "provide",
        "precondition",
        "flourishing",
        "childhood",
        "brennan",
        "childcentred",
        "account",
        "kind",
        "still",
        "seems",
        "need",
        "explain",
        "family",
        "still",
        "subject",
        "substantial",
        "constraint",
        "constraint",
        "necessary",
        "help",
        "equip",
        "child",
        "outside",
        "family",
        "capacity",
        "certain",
        "good",
        "provided",
        "child",
        "parental",
        "nurture",
        "within",
        "family",
        "imply",
        "broader",
        "social",
        "obligation",
        "ensure",
        "child",
        "enjoy",
        "relevantly",
        "equal",
        "opportunity",
        "enjoy",
        "good",
        "compatible",
        "claim",
        "institution",
        "family",
        "justified",
        "service",
        "interest",
        "third",
        "party",
        "sometimes",
        "argued",
        "child",
        "type",
        "public",
        "good",
        "folbre",
        "olsaretti",
        "whose",
        "development",
        "future",
        "citizen",
        "significant",
        "implication",
        "social",
        "order",
        "whole",
        "context",
        "jennifer",
        "roback",
        "morse",
        "argues",
        "instance",
        "family",
        "play",
        "indispensable",
        "role",
        "raising",
        "person",
        "capable",
        "trust",
        "cooperation",
        "selfrestraint",
        "wellfunctioning",
        "society",
        "depends",
        "sufficient",
        "number",
        "citizen",
        "possessing",
        "trait",
        "engage",
        "form",
        "social",
        "cooperation",
        "necessary",
        "sustain",
        "collective",
        "selfgovernance",
        "perhaps",
        "notable",
        "parentcentred",
        "account",
        "recent",
        "year",
        "offered",
        "brighouse",
        "swift",
        "argue",
        "parent",
        "interest",
        "served",
        "certain",
        "control",
        "right",
        "child",
        "parental",
        "interest",
        "also",
        "permit",
        "certain",
        "form",
        "parental",
        "partiality",
        "towards",
        "child",
        "naturally",
        "disrupt",
        "equality",
        "opportunity",
        "argue",
        "parent",
        "enjoy",
        "distinctively",
        "valuable",
        "relationship",
        "child",
        "one",
        "intimate",
        "mutually",
        "loving",
        "institution",
        "family",
        "allows",
        "parent",
        "relationship",
        "kind",
        "substituted",
        "relationship",
        "adult",
        "brighouse",
        "swift",
        "word",
        "internal",
        "life",
        "family",
        "along",
        "shared",
        "activity",
        "experience",
        "even",
        "value",
        "member",
        "support",
        "distinctive",
        "source",
        "intimacy",
        "parent",
        "child",
        "offer",
        "distinctive",
        "source",
        "flourishing",
        "parent",
        "relationship",
        "substitutable",
        "parent",
        "child",
        "abolition",
        "family",
        "would",
        "mean",
        "particular",
        "valuable",
        "source",
        "flourishing",
        "would",
        "lost",
        "order",
        "create",
        "sustain",
        "enjoy",
        "relationship",
        "value",
        "parent",
        "need",
        "able",
        "thing",
        "child",
        "inevitably",
        "tend",
        "create",
        "difference",
        "family",
        "leading",
        "child",
        "benefit",
        "others",
        "although",
        "almost",
        "certainly",
        "disrupt",
        "equality",
        "opportunity",
        "brighouse",
        "swift",
        "suggest",
        "value",
        "intimate",
        "relationship",
        "potential",
        "justification",
        "inequality",
        "activity",
        "necessary",
        "nourish",
        "relation",
        "intimacy",
        "whereas",
        "others",
        "group",
        "activity",
        "necessary",
        "brighouse",
        "swift",
        "give",
        "example",
        "reading",
        "bedtime",
        "story",
        "child",
        "parent",
        "enrolling",
        "child",
        "association",
        "enable",
        "participate",
        "community",
        "value",
        "shared",
        "parent",
        "child",
        "contrast",
        "unlikely",
        "enrolling",
        "child",
        "expensive",
        "private",
        "school",
        "designed",
        "maximize",
        "future",
        "opportunity",
        "investing",
        "trust",
        "fund",
        "essential",
        "parent",
        "child",
        "enjoy",
        "good",
        "distinctively",
        "supported",
        "family",
        "relationship",
        "brighouse",
        "swift",
        "activity",
        "justified",
        "given",
        "inequality",
        "tend",
        "perpetuate",
        "must",
        "basis",
        "value",
        "rather",
        "special",
        "familial",
        "intimacy",
        "work",
        "explores",
        "societal",
        "factor",
        "tend",
        "result",
        "unequal",
        "life",
        "chance",
        "different",
        "person",
        "family",
        "understandably",
        "foregrounded",
        "discussion",
        "formative",
        "developmental",
        "pathway",
        "bearing",
        "prospect",
        "acquiring",
        "trait",
        "successful",
        "social",
        "competition",
        "good",
        "analysis",
        "mechanism",
        "family",
        "transmit",
        "advantage",
        "see",
        "swift",
        "bottom",
        "however",
        "conflict",
        "general",
        "seems",
        "person",
        "exercise",
        "associational",
        "freedom",
        "different",
        "way",
        "generates",
        "inequality",
        "tension",
        "family",
        "equality",
        "opportunity",
        "reflects",
        "general",
        "tension",
        "freedomto",
        "organize",
        "association",
        "favour",
        "othersand",
        "equality",
        "james",
        "fishkin",
        "tension",
        "manifest",
        "different",
        "degree",
        "different",
        "way",
        "depending",
        "thickness",
        "one",
        "conception",
        "equality",
        "opportunity",
        "seems",
        "present",
        "least",
        "degree",
        "conception",
        "instance",
        "freedom",
        "racially",
        "discriminate",
        "constrained",
        "relatively",
        "thin",
        "formal",
        "conception",
        "equality",
        "opportunity",
        "meritocratic",
        "conception",
        "go",
        "constrain",
        "freedom",
        "select",
        "ground",
        "best",
        "qualified",
        "substantive",
        "conception",
        "equality",
        "opportunity",
        "go",
        "still",
        "imply",
        "tension",
        "relevantly",
        "equal",
        "life",
        "chance",
        "freedom",
        "associate",
        "promote",
        "good",
        "particular",
        "others",
        "manifest",
        "different",
        "prospect",
        "different",
        "person"
    ]
}