{
    "main_text": "The Physics of Mass-Energy Equivalence || The Physical Significance of Einstein’s Equation\n1.3 The Physical Significance of Einstein’s Equation\n\nFollowing Geroch, we can begin to explain the physical significance of\nEinstein’s equation \\(E_o = mc^2\\) by considering a very simple\nphysical system. Imagine, as Geroch suggests, a brick being heated or\na battery being charged (Geroch 2005, p. 198). Suppose we consider\nthese objects in the inertial reference frame in which they are at\nrest. As the brick is heated, or the battery charged, it absorbs an\namount of energy \\(E_o\\) as measured in its rest frame.\nEinstein’s equation tells us that the mass of the brick, or\nbattery, after it absorbs an amount of energy \\(E_o\\) is increased\nexactly by an amount \\(E_o /c^2\\). The value of the mass of the hot\nbrick or charged battery is greater than it was before it absorbed\nenergy. So, for example, it takes just a little bit more\nforce to move the charged battery than it did to move the uncharged\nbattery. How much is “a little bit more”? \n\nGeroch has a clever way to answer this question. Suppose we use the\namount of energy \\(E_o\\), as measured in the rest-frame of the\nbattery, to accelerate the battery (instead of charging it) so that it\neventually reaches a final speed of 670 mph. Since 670 mph seems like\nsomething moving pretty fast, at least by the non-relativistic\nstandards of human travel, one might think that one is using quite a\nbit of energy to accelerate the battery to that speed. Now suppose\nthat instead of using the energy \\(E_o\\) to accelerate the battery, we\nuse that same amount of energy \\(E_o\\) to charge the battery. The\nincrease in the mass of the charged battery is \\(E_o /c^2\\), but\nbecause the speed of light is such a large number, approximately 670\nmillion mph, “the mass of the battery would be\nincreased by about 1 part in a million-million (i.e., by a fraction\n\\(10^{-12}\\)…)” (Geroch 2005, p. 199). \n\nThere is nothing unique about energy absorption in these examples. As\nthe battery loses energy, say by powering a device, or the brick emits\nthermal energy as it cools, its mass decreases. Consequently, imagine\na suitably idealized closed system in which two objects \\(B_1\\) and\n\\(B_2\\) are in a state of relative rest. If \\(B_1\\) radiates an amount\nof energy \\(E_o\\) and \\(B_2\\) fully absorbs that same amount of\nenergy, the mass of \\(B_1\\) decreases by \\(E_o /c^2\\) while the mass\nof \\(B_2\\) increases by the same amount. This physical change in the\nmasses of \\(B_1\\) and \\(B_2\\) is a novel prediction in special\nrelativity. For in Newtonian physics, there is no relationship at all\nbetween the inertial mass of a body and the amount of energy it\nradiates or absorbs. This is why Einstein was led to conclude that\n“If the theory agrees with the facts, then radiation transmits\ninertia between emitting and absorbing bodies” (Einstein 1905b).\nIf special relativity is supported by empirical evidence, the inertial\nmass of an object can change, not because we have chopped off a piece\nof the object or attached more stuff to it, but merely because the\nobject has radiated or absorbed energy. To physicists and philosophers\ntrained exclusively in the Newtonian tradition, this result would have\nseemed perhaps extraordinary but certainly revolutionary. \n\nSo far, we have been focusing on what physicists such as Baierlein\n(2007) call the incremental version of mass-energy equivalence,\nbecause we have focused on the strict correlation in special\nrelativity between a change in the rest energy of a body \\(E_o\\) and a\nchange in its mass \\(m\\). However, Einstein also emphasized two subtly\ndifferent “readings” of his equation. First, as early as\n1906, Einstein argued that when one considers physical systems in\nwhich there are electromagnetic processes, such as a\n“complex” of light being emitted from the inside wall of a\nfreely-floating box and absorbed by the opposite wall, one could avoid\na fundamental conflict with the laws of mechanics “if one\nascribes the inertial mass \\(E/V^2\\) to any energy \\(E\\)”\n(Einstein 1906, p. 206. Note that \\(V\\) represents the speed of light. See also Taylor and Wheeler 1992, p. 254, for\na detailed discussion of this example). This insight, sometimes\nexpressed with talk about the “inertia of energy,” was an\nimportant step in the development of general relativity, because that\ntheory uses the principle of equivalence, which states very roughly\nthat inertial mass and gravitational mass are directly proportional,\nas a foundational principle. \n\nAt a time when physicists were moving toward regarding energy-carrying\nfields, such as the electromagnetic field, as entities in their own\nright, combining the principle of equivalence with the “inertia\nof energy” led Einstein to the insight that fields themselves\ncould gravitate. So, for example, Einstein claims in 1907 to show that\n“radiation enclosed in a cavity possesses not only inertia but\nalso weight” (Einstein 1907b, p. 288). A more contemporary and\nfairly common way of making the same point is to say that a mirror box\nwith perfectly reflecting walls filled with light (conceived here for\nconvenience as an energy-carrying disturbance in the electromagnetic\nfield) is attracted by gravity by an amount that is greater than the\nrest mass \\(M\\) of the box itself. Specifically, if the energy of the\nlight in the box is \\(E_L\\), gravity acts on the box not as if the box\nhas a mass \\(M\\) but as if the box has a mass \\(M + E_L /c^2\\).\nAlthough the difference is numerically tiny, strictly speaking a\nbalance with an empty mirror box on one side and an identical mirror\nbox filled with light on the other would not be level. \n\nConversely, Einstein also emphasized reading his famous equation\n“in the other direction,” as it were. For example, in his\nreview article from 1907, he says, “with respect to inertia, a\nmass \\(\\mu\\) is equivalent to an energy content of magnitude \\(\\mu\nc^2\\)” (Einstein 1907b, p. 287). Einstein uses the phrase\n“energy content” (translated from the original German\n“Energieinhalt”) to convey a notion that is new in special\nrelativity: A physical object contains within it energy that, at least\nin principle, could be transformed into other forms of energy such as\nkinetic energy (as we now know only too well). Because this rest\nenergy is contained within the boundaries of a body when we treat the\nobject as a whole, physicists, such as Rindler, also call it\n“internal energy” (Rindler 1991, p. 71). \n\nAs Rindler suggests, it is not at all an idle or childish question to\nask: Where does all that “internal energy” reside (Rindler\n1991, p. 75)? Rindler’s answer to this question assumes that we\nwish to analyze a body all the way down to its subatomic components.\nHe explains: \n\nA very small part of this energy resides in the thermal motions of the\nmolecules constituting the particle, and can be given up as heat; a\npart resides in the intermolecular and interatomic cohesion forces,\nand some of that can be given up in chemical explosions; another part\nmay reside in excited atoms and escape in the form of radiation; much\nmore resides in nuclear bonds and can also sometimes be set free, as\nin the atomic bomb. But by far the largest part of the energy (about\n99 per cent) resides simply in the mass of the ultimate particles and\ncannot be further explained. Nevertheless, it too can be liberated\nunder suitable conditions, e.g., when matter and antimatter annihilate\neach other (Rindler 1991, p.75).\n\n\nHowever, when developing a theoretical description of a macroscopic\nobject, it is seldom practical to construct that description by\ntreating subatomic quantum objects as the fundamental constituents, as\nRindler suggests. \n\nInstead, when one analyzes a physical object theoretically by looking\nat its component parts, one has to decide the level of granularity at\nwhich one wishes to analyze the object. For example, if the object we\nare analyzing is a chunk of iron, and we are studying magnetism, it\nmay be sufficient to analyze the iron by treating its magnetic domains\nas fundamental constituents. However, a magnetic domain is a chunk of\niron that contains many, many atoms. For other purposes, we may elect\nto analyze the sample of iron all the way down to the atomic level. Of\ncourse, the atoms themselves have parts. So, for yet different\npurposes, we may elect to analyze the sample of iron at the sub-atomic\nlevel of quantum objects. \n\nAs Rindler’s description of where the rest energy resides makes\nclear, at each level of analysis, there are two main contributors to\nthe rest energy of the “macroscopic” sample we are\nanalyzing: (1) the energy equivalent of the sum of the rest-masses of\nthe constituent elements considered as fundamental and (2) the sum of\nthe energy “stored” or “carried” by the\nconstituent elements. To perform this kind of analysis for a concrete\nobject is a rather subtle affair. So physicists and philosophers\nwriting about mass-energy equivalence tend to focus on the highly\nidealized notion of an ideal gas. \n\nFor the purposes of this kind of discussion, an ideal gas is composed\nof molecules that are treated as idealized point particles to each of\nwhich we assign a mass (i.e., a rest-mass). The molecules are treated\nas moving uniformly, i.e., with constant velocity, and as interacting\nonly in perfectly elastic collisions. Consequently, if we consider a\nsample of gas contained in a massless vessel, the only energy\n“carried” by the constituent elements is the kinetic\nenergy of the molecules. \n\nWhen viewed from a Newtonian perspective, and assuming that the vessel\ncontaining the gas is itself massless, the mass of the vessel of gas\nis simply equal to the sum of the masses of the molecules. From a\nrelativistic point of view, this last assertion states\nincorrectly that the rest-mass of the vessel of gas is equal\nto the sum of the rest-masses of the molecules. Yet, from a\nrelativistic point of view, the rest-mass of the vessel of gas is\nequal to the sum of the rest-masses of the molecules plus the\nkinetic energy of the molecules divided by \\(c^2\\). Since, according\nto the Kinetic Theory of Gases, the temperature of the gas is\nproportional to the average kinetic energy of its molecules, if the\ngas temperature increases or decreases, the rest-mass of the vessel of\ngas increases or decreases accordingly by a tiny amount. \n\nAssuming the principle of equivalence, which entails that we can\nmeasure inertial mass by measuring gravitational mass with a balance,\nwe can illustrate the difference between the Newtonian and\nrelativistic understanding of the ideal gas as follows. Imagine that\nwe have two otherwise identical massless vessels filled with exactly\nthe same amount and type of gas. In one vessel, the gas is at a\ntemperature very near absolute zero, so its molecules have very little\nkinetic energy. In the other vessel, the gas is at a temperature of\n500° C. Place these two vessels of gas on the ends of a balance.\nAccording to Newtonian physics, the balance will be level, because\nboth gas samples have exactly the same mass. According to relativity,\nthe balance will not be level and will be tipped on the side of the\nhot gas, because the high kinetic energy of the molecules contributes\nto the rest energy of the gas, which contributes, through\nEinstein’s equation, to the rest-mass of the vessel of gas. \n",
    "section_title": "1.3 The Physical Significance of Einstein’s Equation",
    "entry_title": "The Equivalence of Mass and Energy",
    "hierarchy_title": "The Equivalence of Mass and Energy || The Physics of Mass-Energy Equivalence || The Physical Significance of Einstein’s Equation",
    "tokenized_text": [
        "physic",
        "massenergy",
        "equivalence",
        "physical",
        "significance",
        "einstein",
        "equation",
        "physical",
        "significance",
        "einstein",
        "equation",
        "following",
        "geroch",
        "begin",
        "explain",
        "physical",
        "significance",
        "einstein",
        "equation",
        "e_o",
        "mc",
        "considering",
        "simple",
        "physical",
        "system",
        "imagine",
        "geroch",
        "suggests",
        "brick",
        "heated",
        "battery",
        "charged",
        "geroch",
        "p",
        "suppose",
        "consider",
        "object",
        "inertial",
        "reference",
        "frame",
        "rest",
        "brick",
        "heated",
        "battery",
        "charged",
        "absorbs",
        "amount",
        "energy",
        "e_o",
        "measured",
        "rest",
        "frame",
        "einstein",
        "equation",
        "tell",
        "u",
        "mass",
        "brick",
        "battery",
        "absorbs",
        "amount",
        "energy",
        "e_o",
        "increased",
        "exactly",
        "amount",
        "e_o",
        "c",
        "value",
        "mass",
        "hot",
        "brick",
        "charged",
        "battery",
        "greater",
        "absorbed",
        "energy",
        "example",
        "take",
        "little",
        "bit",
        "force",
        "move",
        "charged",
        "battery",
        "move",
        "uncharged",
        "battery",
        "much",
        "little",
        "bit",
        "geroch",
        "clever",
        "way",
        "answer",
        "question",
        "suppose",
        "use",
        "amount",
        "energy",
        "e_o",
        "measured",
        "restframe",
        "battery",
        "accelerate",
        "battery",
        "instead",
        "charging",
        "eventually",
        "reach",
        "final",
        "speed",
        "mph",
        "since",
        "mph",
        "seems",
        "like",
        "something",
        "moving",
        "pretty",
        "fast",
        "least",
        "nonrelativistic",
        "standard",
        "human",
        "travel",
        "one",
        "might",
        "think",
        "one",
        "using",
        "quite",
        "bit",
        "energy",
        "accelerate",
        "battery",
        "speed",
        "suppose",
        "instead",
        "using",
        "energy",
        "e_o",
        "accelerate",
        "battery",
        "use",
        "amount",
        "energy",
        "e_o",
        "charge",
        "battery",
        "increase",
        "mass",
        "charged",
        "battery",
        "e_o",
        "c",
        "speed",
        "light",
        "large",
        "number",
        "approximately",
        "million",
        "mph",
        "mass",
        "battery",
        "would",
        "increased",
        "part",
        "millionmillion",
        "ie",
        "fraction",
        "geroch",
        "p",
        "nothing",
        "unique",
        "energy",
        "absorption",
        "example",
        "battery",
        "loses",
        "energy",
        "say",
        "powering",
        "device",
        "brick",
        "emits",
        "thermal",
        "energy",
        "cool",
        "mass",
        "decrease",
        "consequently",
        "imagine",
        "suitably",
        "idealized",
        "closed",
        "system",
        "two",
        "object",
        "b_",
        "b_",
        "state",
        "relative",
        "rest",
        "b_",
        "radiates",
        "amount",
        "energy",
        "e_o",
        "b_",
        "fully",
        "absorbs",
        "amount",
        "energy",
        "mass",
        "b_",
        "decrease",
        "e_o",
        "c",
        "mass",
        "b_",
        "increase",
        "amount",
        "physical",
        "change",
        "mass",
        "b_",
        "b_",
        "novel",
        "prediction",
        "special",
        "relativity",
        "newtonian",
        "physic",
        "relationship",
        "inertial",
        "mass",
        "body",
        "amount",
        "energy",
        "radiates",
        "absorbs",
        "einstein",
        "led",
        "conclude",
        "theory",
        "agrees",
        "fact",
        "radiation",
        "transmits",
        "inertia",
        "emitting",
        "absorbing",
        "body",
        "einstein",
        "b",
        "special",
        "relativity",
        "supported",
        "empirical",
        "evidence",
        "inertial",
        "mass",
        "object",
        "change",
        "chopped",
        "piece",
        "object",
        "attached",
        "stuff",
        "merely",
        "object",
        "radiated",
        "absorbed",
        "energy",
        "physicist",
        "philosopher",
        "trained",
        "exclusively",
        "newtonian",
        "tradition",
        "result",
        "would",
        "seemed",
        "perhaps",
        "extraordinary",
        "certainly",
        "revolutionary",
        "far",
        "focusing",
        "physicist",
        "baierlein",
        "call",
        "incremental",
        "version",
        "massenergy",
        "equivalence",
        "focused",
        "strict",
        "correlation",
        "special",
        "relativity",
        "change",
        "rest",
        "energy",
        "body",
        "e_o",
        "change",
        "mass",
        "m",
        "however",
        "einstein",
        "also",
        "emphasized",
        "two",
        "subtly",
        "different",
        "reading",
        "equation",
        "first",
        "early",
        "einstein",
        "argued",
        "one",
        "considers",
        "physical",
        "system",
        "electromagnetic",
        "process",
        "complex",
        "light",
        "emitted",
        "inside",
        "wall",
        "freelyfloating",
        "box",
        "absorbed",
        "opposite",
        "wall",
        "one",
        "could",
        "avoid",
        "fundamental",
        "conflict",
        "law",
        "mechanic",
        "one",
        "ascribes",
        "inertial",
        "mass",
        "ev",
        "energy",
        "e",
        "einstein",
        "p",
        "note",
        "v",
        "represents",
        "speed",
        "light",
        "see",
        "also",
        "taylor",
        "wheeler",
        "p",
        "detailed",
        "discussion",
        "example",
        "insight",
        "sometimes",
        "expressed",
        "talk",
        "inertia",
        "energy",
        "important",
        "step",
        "development",
        "general",
        "relativity",
        "theory",
        "us",
        "principle",
        "equivalence",
        "state",
        "roughly",
        "inertial",
        "mass",
        "gravitational",
        "mass",
        "directly",
        "proportional",
        "foundational",
        "principle",
        "time",
        "physicist",
        "moving",
        "toward",
        "regarding",
        "energycarrying",
        "field",
        "electromagnetic",
        "field",
        "entity",
        "right",
        "combining",
        "principle",
        "equivalence",
        "inertia",
        "energy",
        "led",
        "einstein",
        "insight",
        "field",
        "could",
        "gravitate",
        "example",
        "einstein",
        "claim",
        "show",
        "radiation",
        "enclosed",
        "cavity",
        "posse",
        "inertia",
        "also",
        "weight",
        "einstein",
        "b",
        "p",
        "contemporary",
        "fairly",
        "common",
        "way",
        "making",
        "point",
        "say",
        "mirror",
        "box",
        "perfectly",
        "reflecting",
        "wall",
        "filled",
        "light",
        "conceived",
        "convenience",
        "energycarrying",
        "disturbance",
        "electromagnetic",
        "field",
        "attracted",
        "gravity",
        "amount",
        "greater",
        "rest",
        "mass",
        "m",
        "box",
        "specifically",
        "energy",
        "light",
        "box",
        "e_l",
        "gravity",
        "act",
        "box",
        "box",
        "mass",
        "m",
        "box",
        "mass",
        "e_l",
        "c",
        "although",
        "difference",
        "numerically",
        "tiny",
        "strictly",
        "speaking",
        "balance",
        "empty",
        "mirror",
        "box",
        "one",
        "side",
        "identical",
        "mirror",
        "box",
        "filled",
        "light",
        "would",
        "level",
        "conversely",
        "einstein",
        "also",
        "emphasized",
        "reading",
        "famous",
        "equation",
        "direction",
        "example",
        "review",
        "article",
        "say",
        "respect",
        "inertia",
        "mass",
        "mu",
        "equivalent",
        "energy",
        "content",
        "magnitude",
        "mu",
        "c",
        "einstein",
        "b",
        "p",
        "einstein",
        "us",
        "phrase",
        "energy",
        "content",
        "translated",
        "original",
        "german",
        "energieinhalt",
        "convey",
        "notion",
        "new",
        "special",
        "relativity",
        "physical",
        "object",
        "contains",
        "within",
        "energy",
        "least",
        "principle",
        "could",
        "transformed",
        "form",
        "energy",
        "kinetic",
        "energy",
        "know",
        "well",
        "rest",
        "energy",
        "contained",
        "within",
        "boundary",
        "body",
        "treat",
        "object",
        "whole",
        "physicist",
        "rindler",
        "also",
        "call",
        "internal",
        "energy",
        "rindler",
        "p",
        "rindler",
        "suggests",
        "idle",
        "childish",
        "question",
        "ask",
        "internal",
        "energy",
        "reside",
        "rindler",
        "p",
        "rindler",
        "answer",
        "question",
        "assumes",
        "wish",
        "analyze",
        "body",
        "way",
        "subatomic",
        "component",
        "explains",
        "small",
        "part",
        "energy",
        "resides",
        "thermal",
        "motion",
        "molecule",
        "constituting",
        "particle",
        "given",
        "heat",
        "part",
        "resides",
        "intermolecular",
        "interatomic",
        "cohesion",
        "force",
        "given",
        "chemical",
        "explosion",
        "another",
        "part",
        "may",
        "reside",
        "excited",
        "atom",
        "escape",
        "form",
        "radiation",
        "much",
        "resides",
        "nuclear",
        "bond",
        "also",
        "sometimes",
        "set",
        "free",
        "atomic",
        "bomb",
        "far",
        "largest",
        "part",
        "energy",
        "per",
        "cent",
        "resides",
        "simply",
        "mass",
        "ultimate",
        "particle",
        "explained",
        "nevertheless",
        "liberated",
        "suitable",
        "condition",
        "eg",
        "matter",
        "antimatter",
        "annihilate",
        "rindler",
        "p",
        "however",
        "developing",
        "theoretical",
        "description",
        "macroscopic",
        "object",
        "seldom",
        "practical",
        "construct",
        "description",
        "treating",
        "subatomic",
        "quantum",
        "object",
        "fundamental",
        "constituent",
        "rindler",
        "suggests",
        "instead",
        "one",
        "analyzes",
        "physical",
        "object",
        "theoretically",
        "looking",
        "component",
        "part",
        "one",
        "decide",
        "level",
        "granularity",
        "one",
        "wish",
        "analyze",
        "object",
        "example",
        "object",
        "analyzing",
        "chunk",
        "iron",
        "studying",
        "magnetism",
        "may",
        "sufficient",
        "analyze",
        "iron",
        "treating",
        "magnetic",
        "domain",
        "fundamental",
        "constituent",
        "however",
        "magnetic",
        "domain",
        "chunk",
        "iron",
        "contains",
        "many",
        "many",
        "atom",
        "purpose",
        "may",
        "elect",
        "analyze",
        "sample",
        "iron",
        "way",
        "atomic",
        "level",
        "course",
        "atom",
        "part",
        "yet",
        "different",
        "purpose",
        "may",
        "elect",
        "analyze",
        "sample",
        "iron",
        "subatomic",
        "level",
        "quantum",
        "object",
        "rindler",
        "description",
        "rest",
        "energy",
        "resides",
        "make",
        "clear",
        "level",
        "analysis",
        "two",
        "main",
        "contributor",
        "rest",
        "energy",
        "macroscopic",
        "sample",
        "analyzing",
        "energy",
        "equivalent",
        "sum",
        "restmasses",
        "constituent",
        "element",
        "considered",
        "fundamental",
        "sum",
        "energy",
        "stored",
        "carried",
        "constituent",
        "element",
        "perform",
        "kind",
        "analysis",
        "concrete",
        "object",
        "rather",
        "subtle",
        "affair",
        "physicist",
        "philosopher",
        "writing",
        "massenergy",
        "equivalence",
        "tend",
        "focus",
        "highly",
        "idealized",
        "notion",
        "ideal",
        "gas",
        "purpose",
        "kind",
        "discussion",
        "ideal",
        "gas",
        "composed",
        "molecule",
        "treated",
        "idealized",
        "point",
        "particle",
        "assign",
        "mass",
        "ie",
        "restmass",
        "molecule",
        "treated",
        "moving",
        "uniformly",
        "ie",
        "constant",
        "velocity",
        "interacting",
        "perfectly",
        "elastic",
        "collision",
        "consequently",
        "consider",
        "sample",
        "gas",
        "contained",
        "massless",
        "vessel",
        "energy",
        "carried",
        "constituent",
        "element",
        "kinetic",
        "energy",
        "molecule",
        "viewed",
        "newtonian",
        "perspective",
        "assuming",
        "vessel",
        "containing",
        "gas",
        "massless",
        "mass",
        "vessel",
        "gas",
        "simply",
        "equal",
        "sum",
        "mass",
        "molecule",
        "relativistic",
        "point",
        "view",
        "last",
        "assertion",
        "state",
        "incorrectly",
        "restmass",
        "vessel",
        "gas",
        "equal",
        "sum",
        "restmasses",
        "molecule",
        "yet",
        "relativistic",
        "point",
        "view",
        "restmass",
        "vessel",
        "gas",
        "equal",
        "sum",
        "restmasses",
        "molecule",
        "plus",
        "kinetic",
        "energy",
        "molecule",
        "divided",
        "c",
        "since",
        "according",
        "kinetic",
        "theory",
        "gas",
        "temperature",
        "gas",
        "proportional",
        "average",
        "kinetic",
        "energy",
        "molecule",
        "gas",
        "temperature",
        "increase",
        "decrease",
        "restmass",
        "vessel",
        "gas",
        "increase",
        "decrease",
        "accordingly",
        "tiny",
        "amount",
        "assuming",
        "principle",
        "equivalence",
        "entail",
        "measure",
        "inertial",
        "mass",
        "measuring",
        "gravitational",
        "mass",
        "balance",
        "illustrate",
        "difference",
        "newtonian",
        "relativistic",
        "understanding",
        "ideal",
        "gas",
        "follows",
        "imagine",
        "two",
        "otherwise",
        "identical",
        "massless",
        "vessel",
        "filled",
        "exactly",
        "amount",
        "type",
        "gas",
        "one",
        "vessel",
        "gas",
        "temperature",
        "near",
        "absolute",
        "zero",
        "molecule",
        "little",
        "kinetic",
        "energy",
        "vessel",
        "gas",
        "temperature",
        "c",
        "place",
        "two",
        "vessel",
        "gas",
        "end",
        "balance",
        "according",
        "newtonian",
        "physic",
        "balance",
        "level",
        "gas",
        "sample",
        "exactly",
        "mass",
        "according",
        "relativity",
        "balance",
        "level",
        "tipped",
        "side",
        "hot",
        "gas",
        "high",
        "kinetic",
        "energy",
        "molecule",
        "contributes",
        "rest",
        "energy",
        "gas",
        "contributes",
        "einstein",
        "equation",
        "restmass",
        "vessel",
        "gas"
    ]
}