{
    "main_text": "The Physics of Mass-Energy Equivalence || Why Does \\(E_o\\) Equal \\(mc^2\\)?\n1.5 Why Does \\(E_o\\) Equal \\(mc^2\\)?\n\nA common way in which the question “Why does \\(E_o\\)\nequal \\(mc^2\\)?” is interpreted by philosophers and physicists\nis that it is a request for a derivation that shows that given certain\nphysical principles, such as the principle of relativity and the\nprinciple of conservation of energy, Einstein’s equation is a\nlogical consequence of those assumptions. We will discuss briefly the\nhistory of derivation of Einstein’s equation in\n Section 3.\n \n\nHowever, in this section, we wish to present a rather simplified\nversion of just one of Einstein’s derivations, published in 1946\n(Einstein 1946). We will follow closely the simplified version of\nEinstein’s 1946 derivation developed by Ralph Baierlein (1991),\nwho has used his derivation to teach Einstein’s equation to\nundergraduates who are not science majors. John Norton has used\nessentially the same simplified derivation in the Cambridge\nCompanion to Einstein (Norton 2014). \n\nAs we will see, if Baierlein’s assessment of his own derivation\nis correct, the price to pay for this particular simplification is\nthat the derivation ceases to be relativistic, in the sense that none\nof the core principles at the heart of special relativity seem to be\nrequired to derive Einstein’s equation. Nevertheless, it may\nhelp readers get a “feel” for why \\(E_o = mc^2\\) and it\ndoes familiarize those not already conversant in the methods of\nrelativistic physics with a style of reasoning that is common in that\nfield. Those interested in a presentation of Einstein’s own 1946\nderivation, which explicitly shows all of the relativistic assumptions\nand key approximation steps Einstein takes, may be interested in\nconsulting the exposition by Fernflores (Fernflores 2018, vol. II,\n§3.3). \n\nLike Einstein, many physicists and philosophers who wish to derive\nEinstein’s equation do so by considering an idealized physical\nconfiguration. Typically, one considers a physical object \\(B\\)\ninvolved in a symmetric physical interaction. For example, in\nEinstein’s original derivation from 1905, \\(B\\) emits two\nequally energetic pulses of light in opposite directions. Mermin and\nFeigenbaum have shown how one can also derive Einstein’s\nequation by considering the case where \\(B\\) emits two physical\nbodies, instead of pulses of light (Mermin and Feigenbaum 1990). \n\nIn Einstein’s 1946 derivation, instead of emitting light, \\(B\\)\nabsorbs two equally energetic pulses of light symmetrically. The goal\nin all of these approaches is to perform a “before” and\n“after” comparison and to show that “after”\nthe body \\(B\\) absorbs or emits energy, its mass (i.e., rest-mass)\nincreases or decreases according to Einstein’s equation. \n\nUsing a common heuristic in relativistic physics, one considers the\nphysical interaction first in the inertial reference frame in which\n\\(B\\) is at rest, which is sometimes called the “rest\nframe.” One then compares the mathematical description of this\ninteraction to the corresponding description from the perspective of a\ndifferent inertial reference frame that moves with a constant velocity\nrelative to the rest frame. Finally, using dynamical principles, such\nas the conservation of energy or conservation of momentum, and the two\nprinciples at the core of special relativity (i.e., the relativity\nprinciple and the light principle), one shows that the dynamical\nprinciples require that after \\(B\\) suffers the interaction in which\nit absorbs or emits energy, its mass (i.e., rest-mass) must change by\nan amount given by Einstein’s equation. \n\nFrom a very general point of view, the reasoning in these types of\nderivations can be displayed schematically, if somewhat roughly, like\nthis: \n\n\nFor a particular idealized physical interaction, if:\n\ncertain conservation principles are true, such as the principle of\nconservation of energy and the principle of conservation of\nmomentum,\nthe two principles at the core of special relativity are true,\ni.e., the principle of relativity and the light principle, and \na body, treated as an un-analyzed whole, absorbs or emits an amount\nof energy \\(E_o\\) as measured in its rest frame,\n\nthen:\n\nits mass (i.e., rest-mass) increases or decreases by an amount\n \\(E_o /c^2\\).\n\n\n\nEven at this very general level, one can see the limitations of these\napproaches. For example, since the analysis is based on a particular\nphysical interaction \\(\\boldsymbol{I}\\), one cannot immediately\nconclude that a body’s mass will change according to\nEinstein’s equation in a different type of physical interaction\nI’, for instance one in which\nelectromagnetism plays no role. \n\nReasoning along these lines, Ohanian (2009, 2012) has argued that\nEinstein should not be credited with proving his famous equation. On\nthe other hand, the physicist N. David Mermin (2011, 2012) claims that\nOhanian’s demands for what counts as a “proof” in\nphysics are too stringent. Even though we are considering a very\nspecific interaction \\(\\boldsymbol{I}\\), Mermin might say, we can\nunderstand that it is such a generic situation that we can confidently\nexpect the result in all circumstances. Einstein himself believed that\nif \\(\\boldsymbol{I}\\) involved a physical process in which there was\nan interaction between an electromagnetic field (say in the form of\nlight) and an ordinary physical object, then \\(\\boldsymbol{I}\\) was\ntoo specific to support the general conclusion that in all\ncases, a change in the rest energy of a body is accompanied by a\nchange to its mass (i.e., rest-mass). \n\nWith all of these caveats in place, we are almost ready to understand\nBaierlein’s derivation of Einstein’s equation. Because\nBaierlein’s derivation involves analyzing a physical interaction\nin which an object emits light, i.e., electromagnetic radiation, we\nneed first to state two dynamical properties of electromagnetic\nradiation. First, considered as an electromagnetic wave, like all\nwaves, light carries energy. This is quite familiar to us today at an\neveryday level, especially because of all the “solar”\ndevices we use. Second, light also carries momentum. As Baierlein\nreports, in the late nineteenth century, James Clerk Maxwell had\nalready determined that a burst of light of energy \\(E\\) had momentum\n\\(E/c\\). So, for example, if a laser beam strikes a freely-floating\nmirror in outer space, the collision of light against mirror will\nimpart a finite, non-zero momentum to the mirror. One can calculate\nexactly how the mirror will have its state of motion changed as a\nresult of this interaction by using the principle of conservation of\nmomentum. \n\nBaierlein asks us to consider an atom that emits two photons of equal\nenergy “back-to-back” in opposite directions. Although\nBaierlein uses the Planck-Einstein expression \\(E = hf\\) for the\nenergy of a photon, where \\(f\\) is its frequency, and \\(h\\) is\nPlanck’s constant, as he himself points out the right-hand side\nof that expression does not figure significantly in his derivation.\nBaierlein’s derivation, he tells us, works in exactly the same\nway if we just think of an object that emits two “bursts”\nof light construed as classical electromagnetic radiation. We will\nadopt this latter approach and consider a body \\(B\\) that emits two\nbursts of light in opposite directions, each with an energy \\(E/2\\)\n(this is the approach Norton 2014 uses). The total energy emitted by\n\\(B\\) is therefore simply \\(E\\). \n\nWe wish now to examine this emission of light by \\(B\\) from two\ndifferent inertial frames. The first inertial frame we consider is\nsimply the inertial frame in which \\(B\\) is at rest. Since we will not\nbe performing many calculations using quantities defined relative to\nthis inertial frame, we will label it \\(K'\\). The direction of\nmotion of the second inertial frame, which we will label \\(K\\), is\ncarefully chosen to simplify the calculations. \n\nFirst, we choose \\(K'\\) so that \\(B\\) emits the two bursts of\nlight along \\(z'\\)-axis in opposite directions. We then choose\n\\(K\\) so that \\(K\\) moves with velocity \\(v\\) in the negative\ndirection along the \\(x'\\)-axis. Using standard conventions,\nthis means that an observer at rest in \\(K'\\) (Alice) judges\nthat the light emitted by \\(B\\) travels up and down the page. For an\nobserver at rest in \\(K\\) (Bob), the atom \\(B\\) moves to the right\nwith velocity \\(v\\) and the light is emitted toward the right making\nan angle \\(\\theta\\) with the \\(x\\)-axis. \n\nAccording to Baierlein, “symmetry alone requires that the atom\n\\([B]\\) remain at rest in Alice’s frame” (1991, p. 170).\nIt also follows directly from this that since \\(B\\) remains at rest in\n\\(K'\\), the velocity of \\(B\\) does not change in \\(K\\) after the\nemission of light. However, as we will see shortly, the momentum of\n\\(B\\) does change in both \\(K\\) and \\(K'\\) because the light it\nemits carries away momentum. If we assume the classical definition for\nthe momentum of \\(B\\) as the product of its mass \\(m\\) and its\nvelocity \\(v\\), and \\(v\\) does not change, it follows that in order\nfor the law of conservation of momentum to be satisfied, the mass\n(i.e., rest-mass) of \\(B\\) must change. \n\nLet us now examine the light emission from the perspective of the\ninertial frame \\(K\\). Relative to \\(K, B\\) moves (to the right) with\nvelocity \\(v\\). Because relative to \\(K'\\) the bursts of light\nare collinear, the \\(x\\)-component of the velocity of the light as\nmeasured in \\(K\\) must be \\(v\\). However, the velocity of the light\nalso has a vertical component, i.e., a \\(z\\)-component. This is\nsignificant, because we wish to calculate the change in the momentum\nof \\(B\\). \n\nRelative to \\(K\\), the momentum of \\(B\\) only changes along the\n\\(x\\)-direction, because the changes to the momentum along the\n\\(z\\)-direction are equal and opposite. Using elementary trigonometry,\nfor one of the bursts of light, the momentum along the \\(x\\)-direction\nis: \n\n\\[\n\\frac{E}{2c} \\cdot \\cos \\theta = \\frac{E}{2c} \\cdot \\frac{v}{c}.\n\\]\n\n\nSo, the total momentum of the emitted photons, relative to \\(K\\), is\nsimply: \n\n\\[\n\\frac{E}{c} \\cdot \\frac{v}{c},\n\\]\n\n\nwhich, by the principle of conservation of momentum, must be equal to\nthe amount of momentum lost by \\(B\\). \n\nNow, since the velocity of \\(B\\) does not change (in either \\(K\\) or\n\\(K'\\)), and if we assume the classical expression for the momentum of\n\\(B\\), we have, \n\n\\[\nm \\cdot v = \\frac{E}{c^2} \\cdot v,\n\\]\n\n\nor simply, \n\n\\[\nE = mc^2.\n\\]\n\n\nFinally, since \\(E\\) is the amount of energy lost by \\(B\\) as measured\nin \\(B'\\)s rest-frame, we could more perspicuously write: \n\n\\[\nE_o = mc^2\n\\]\n\n\nWe have thus shown that when \\(B\\) emits an amount of energy \\(E_o\\)\n(while remaining in its current state of inertial motion, which is a\nstate of rest relative to \\(K'\\)), the mass (i.e., rest-mass) of \\(B\\)\ndecreases by an amount \\(E_o /c^2\\). \n\nRegardless of whether Ohanian (2009, 2011) is correct that\nEinstein’s own derivations do not constitute a\n“proof” of mass-energy equivalence because they consider\nphysical configurations that are too specific, a new concern arises\nwhen one considers “simplified” versions of derivations of\n\\(E_o = mc^2\\) such as the one we have just reviewed. Baierlein\nconcludes his derivation by praising, as one of its merits, that it\n“requires only the ratio of momentum to energy for\nelectromagnetic radiation” (Baierlein 1991, p. 172). We have\nalready used this aspect of the derivation in our presentation above.\n\n\nHowever, Baierlein then goes on to state: \n\nMoreover, this derivation—unlike Einstein’s 1905\nderivation—makes no use of Lorentz transformations or other\nresults from the special theory of relativity. In short, by 1873,\nMaxwell knew everything necessary to derive the equation \\(\\Delta E =\n(\\Delta m)c^2\\). All that was missing was a context of inquiry that\nwould have led him to search for a connection between energy and\ninertia (Baierlein 1991, p. 172).\n\n\nThis is a remarkable conclusion, for, if correct, it suggests that\nwhen we use this kind of simplified version of Einstein’s 1946\nderivation, we are not displaying how Einstein’s equation is a\nconsequence of special relativity. By contrast, Einstein’s own\n1946 derivation is explicitly relativistic (see Fernflores 2018, vol.\nII, Sec. 3.3). \n",
    "section_title": "1.5 Why Does \\(E_o\\) Equal \\(mc^2\\)?",
    "entry_title": "The Equivalence of Mass and Energy",
    "hierarchy_title": "The Equivalence of Mass and Energy || The Physics of Mass-Energy Equivalence || Why Does \\(E_o\\) Equal \\(mc^2\\)?",
    "tokenized_text": [
        "physic",
        "massenergy",
        "equivalence",
        "e_o",
        "equal",
        "mc",
        "e_o",
        "equal",
        "mc",
        "common",
        "way",
        "question",
        "e_o",
        "equal",
        "mc",
        "interpreted",
        "philosopher",
        "physicist",
        "request",
        "derivation",
        "show",
        "given",
        "certain",
        "physical",
        "principle",
        "principle",
        "relativity",
        "principle",
        "conservation",
        "energy",
        "einstein",
        "equation",
        "logical",
        "consequence",
        "assumption",
        "discus",
        "briefly",
        "history",
        "derivation",
        "einstein",
        "equation",
        "section",
        "however",
        "section",
        "wish",
        "present",
        "rather",
        "simplified",
        "version",
        "one",
        "einstein",
        "derivation",
        "published",
        "einstein",
        "follow",
        "closely",
        "simplified",
        "version",
        "einstein",
        "derivation",
        "developed",
        "ralph",
        "baierlein",
        "used",
        "derivation",
        "teach",
        "einstein",
        "equation",
        "undergraduate",
        "science",
        "major",
        "john",
        "norton",
        "used",
        "essentially",
        "simplified",
        "derivation",
        "cambridge",
        "companion",
        "einstein",
        "norton",
        "see",
        "baierlein",
        "assessment",
        "derivation",
        "correct",
        "price",
        "pay",
        "particular",
        "simplification",
        "derivation",
        "cease",
        "relativistic",
        "sense",
        "none",
        "core",
        "principle",
        "heart",
        "special",
        "relativity",
        "seem",
        "required",
        "derive",
        "einstein",
        "equation",
        "nevertheless",
        "may",
        "help",
        "reader",
        "get",
        "feel",
        "e_o",
        "mc",
        "familiarize",
        "already",
        "conversant",
        "method",
        "relativistic",
        "physic",
        "style",
        "reasoning",
        "common",
        "field",
        "interested",
        "presentation",
        "einstein",
        "derivation",
        "explicitly",
        "show",
        "relativistic",
        "assumption",
        "key",
        "approximation",
        "step",
        "einstein",
        "take",
        "may",
        "interested",
        "consulting",
        "exposition",
        "fernflores",
        "fernflores",
        "vol",
        "ii",
        "like",
        "einstein",
        "many",
        "physicist",
        "philosopher",
        "wish",
        "derive",
        "einstein",
        "equation",
        "considering",
        "idealized",
        "physical",
        "configuration",
        "typically",
        "one",
        "considers",
        "physical",
        "object",
        "b",
        "involved",
        "symmetric",
        "physical",
        "interaction",
        "example",
        "einstein",
        "original",
        "derivation",
        "b",
        "emits",
        "two",
        "equally",
        "energetic",
        "pulse",
        "light",
        "opposite",
        "direction",
        "mermin",
        "feigenbaum",
        "shown",
        "one",
        "also",
        "derive",
        "einstein",
        "equation",
        "considering",
        "case",
        "b",
        "emits",
        "two",
        "physical",
        "body",
        "instead",
        "pulse",
        "light",
        "mermin",
        "feigenbaum",
        "einstein",
        "derivation",
        "instead",
        "emitting",
        "light",
        "b",
        "absorbs",
        "two",
        "equally",
        "energetic",
        "pulse",
        "light",
        "symmetrically",
        "goal",
        "approach",
        "perform",
        "comparison",
        "show",
        "body",
        "b",
        "absorbs",
        "emits",
        "energy",
        "mass",
        "ie",
        "restmass",
        "increase",
        "decrease",
        "according",
        "einstein",
        "equation",
        "using",
        "common",
        "heuristic",
        "relativistic",
        "physic",
        "one",
        "considers",
        "physical",
        "interaction",
        "first",
        "inertial",
        "reference",
        "frame",
        "b",
        "rest",
        "sometimes",
        "called",
        "rest",
        "frame",
        "one",
        "compare",
        "mathematical",
        "description",
        "interaction",
        "corresponding",
        "description",
        "perspective",
        "different",
        "inertial",
        "reference",
        "frame",
        "move",
        "constant",
        "velocity",
        "relative",
        "rest",
        "frame",
        "finally",
        "using",
        "dynamical",
        "principle",
        "conservation",
        "energy",
        "conservation",
        "momentum",
        "two",
        "principle",
        "core",
        "special",
        "relativity",
        "ie",
        "relativity",
        "principle",
        "light",
        "principle",
        "one",
        "show",
        "dynamical",
        "principle",
        "require",
        "b",
        "suffers",
        "interaction",
        "absorbs",
        "emits",
        "energy",
        "mass",
        "ie",
        "restmass",
        "must",
        "change",
        "amount",
        "given",
        "einstein",
        "equation",
        "general",
        "point",
        "view",
        "reasoning",
        "type",
        "derivation",
        "displayed",
        "schematically",
        "somewhat",
        "roughly",
        "like",
        "particular",
        "idealized",
        "physical",
        "interaction",
        "certain",
        "conservation",
        "principle",
        "true",
        "principle",
        "conservation",
        "energy",
        "principle",
        "conservation",
        "momentum",
        "two",
        "principle",
        "core",
        "special",
        "relativity",
        "true",
        "ie",
        "principle",
        "relativity",
        "light",
        "principle",
        "body",
        "treated",
        "unanalyzed",
        "whole",
        "absorbs",
        "emits",
        "amount",
        "energy",
        "e_o",
        "measured",
        "rest",
        "frame",
        "mass",
        "ie",
        "restmass",
        "increase",
        "decrease",
        "amount",
        "e_o",
        "c",
        "even",
        "general",
        "level",
        "one",
        "see",
        "limitation",
        "approach",
        "example",
        "since",
        "analysis",
        "based",
        "particular",
        "physical",
        "interaction",
        "boldsymbol",
        "one",
        "immediately",
        "conclude",
        "body",
        "mass",
        "change",
        "according",
        "einstein",
        "equation",
        "different",
        "type",
        "physical",
        "interaction",
        "instance",
        "one",
        "electromagnetism",
        "play",
        "role",
        "reasoning",
        "along",
        "line",
        "ohanian",
        "argued",
        "einstein",
        "credited",
        "proving",
        "famous",
        "equation",
        "hand",
        "physicist",
        "n",
        "david",
        "mermin",
        "claim",
        "ohanian",
        "demand",
        "count",
        "proof",
        "physic",
        "stringent",
        "even",
        "though",
        "considering",
        "specific",
        "interaction",
        "boldsymbol",
        "mermin",
        "might",
        "say",
        "understand",
        "generic",
        "situation",
        "confidently",
        "expect",
        "result",
        "circumstance",
        "einstein",
        "believed",
        "boldsymbol",
        "involved",
        "physical",
        "process",
        "interaction",
        "electromagnetic",
        "field",
        "say",
        "form",
        "light",
        "ordinary",
        "physical",
        "object",
        "boldsymbol",
        "specific",
        "support",
        "general",
        "conclusion",
        "case",
        "change",
        "rest",
        "energy",
        "body",
        "accompanied",
        "change",
        "mass",
        "ie",
        "restmass",
        "caveat",
        "place",
        "almost",
        "ready",
        "understand",
        "baierlein",
        "derivation",
        "einstein",
        "equation",
        "baierlein",
        "derivation",
        "involves",
        "analyzing",
        "physical",
        "interaction",
        "object",
        "emits",
        "light",
        "ie",
        "electromagnetic",
        "radiation",
        "need",
        "first",
        "state",
        "two",
        "dynamical",
        "property",
        "electromagnetic",
        "radiation",
        "first",
        "considered",
        "electromagnetic",
        "wave",
        "like",
        "wave",
        "light",
        "carry",
        "energy",
        "quite",
        "familiar",
        "u",
        "today",
        "everyday",
        "level",
        "especially",
        "solar",
        "device",
        "use",
        "second",
        "light",
        "also",
        "carry",
        "momentum",
        "baierlein",
        "report",
        "late",
        "nineteenth",
        "century",
        "james",
        "clerk",
        "maxwell",
        "already",
        "determined",
        "burst",
        "light",
        "energy",
        "e",
        "momentum",
        "ec",
        "example",
        "laser",
        "beam",
        "strike",
        "freelyfloating",
        "mirror",
        "outer",
        "space",
        "collision",
        "light",
        "mirror",
        "impart",
        "finite",
        "nonzero",
        "momentum",
        "mirror",
        "one",
        "calculate",
        "exactly",
        "mirror",
        "state",
        "motion",
        "changed",
        "result",
        "interaction",
        "using",
        "principle",
        "conservation",
        "momentum",
        "baierlein",
        "asks",
        "u",
        "consider",
        "atom",
        "emits",
        "two",
        "photon",
        "equal",
        "energy",
        "backtoback",
        "opposite",
        "direction",
        "although",
        "baierlein",
        "us",
        "planckeinstein",
        "expression",
        "e",
        "hf",
        "energy",
        "photon",
        "f",
        "frequency",
        "h",
        "planck",
        "constant",
        "point",
        "righthand",
        "side",
        "expression",
        "figure",
        "significantly",
        "derivation",
        "baierlein",
        "derivation",
        "tell",
        "u",
        "work",
        "exactly",
        "way",
        "think",
        "object",
        "emits",
        "two",
        "burst",
        "light",
        "construed",
        "classical",
        "electromagnetic",
        "radiation",
        "adopt",
        "latter",
        "approach",
        "consider",
        "body",
        "b",
        "emits",
        "two",
        "burst",
        "light",
        "opposite",
        "direction",
        "energy",
        "e",
        "approach",
        "norton",
        "us",
        "total",
        "energy",
        "emitted",
        "b",
        "therefore",
        "simply",
        "e",
        "wish",
        "examine",
        "emission",
        "light",
        "b",
        "two",
        "different",
        "inertial",
        "frame",
        "first",
        "inertial",
        "frame",
        "consider",
        "simply",
        "inertial",
        "frame",
        "b",
        "rest",
        "since",
        "performing",
        "many",
        "calculation",
        "using",
        "quantity",
        "defined",
        "relative",
        "inertial",
        "frame",
        "label",
        "k",
        "direction",
        "motion",
        "second",
        "inertial",
        "frame",
        "label",
        "k",
        "carefully",
        "chosen",
        "simplify",
        "calculation",
        "first",
        "choose",
        "k",
        "b",
        "emits",
        "two",
        "burst",
        "light",
        "along",
        "z",
        "axis",
        "opposite",
        "direction",
        "choose",
        "k",
        "k",
        "move",
        "velocity",
        "v",
        "negative",
        "direction",
        "along",
        "x",
        "axis",
        "using",
        "standard",
        "convention",
        "mean",
        "observer",
        "rest",
        "k",
        "alice",
        "judge",
        "light",
        "emitted",
        "b",
        "travel",
        "page",
        "observer",
        "rest",
        "k",
        "bob",
        "atom",
        "b",
        "move",
        "right",
        "velocity",
        "v",
        "light",
        "emitted",
        "toward",
        "right",
        "making",
        "angle",
        "theta",
        "x",
        "axis",
        "according",
        "baierlein",
        "symmetry",
        "alone",
        "requires",
        "atom",
        "b",
        "remain",
        "rest",
        "alice",
        "frame",
        "p",
        "also",
        "follows",
        "directly",
        "since",
        "b",
        "remains",
        "rest",
        "k",
        "velocity",
        "b",
        "change",
        "k",
        "emission",
        "light",
        "however",
        "see",
        "shortly",
        "momentum",
        "b",
        "change",
        "k",
        "k",
        "light",
        "emits",
        "carry",
        "away",
        "momentum",
        "assume",
        "classical",
        "definition",
        "momentum",
        "b",
        "product",
        "mass",
        "m",
        "velocity",
        "v",
        "v",
        "change",
        "follows",
        "order",
        "law",
        "conservation",
        "momentum",
        "satisfied",
        "mass",
        "ie",
        "restmass",
        "b",
        "must",
        "change",
        "let",
        "u",
        "examine",
        "light",
        "emission",
        "perspective",
        "inertial",
        "frame",
        "k",
        "relative",
        "k",
        "b",
        "move",
        "right",
        "velocity",
        "v",
        "relative",
        "k",
        "burst",
        "light",
        "collinear",
        "x",
        "component",
        "velocity",
        "light",
        "measured",
        "k",
        "must",
        "v",
        "however",
        "velocity",
        "light",
        "also",
        "vertical",
        "component",
        "ie",
        "z",
        "component",
        "significant",
        "wish",
        "calculate",
        "change",
        "momentum",
        "b",
        "relative",
        "k",
        "momentum",
        "b",
        "change",
        "along",
        "x",
        "direction",
        "change",
        "momentum",
        "along",
        "z",
        "direction",
        "equal",
        "opposite",
        "using",
        "elementary",
        "trigonometry",
        "one",
        "burst",
        "light",
        "momentum",
        "along",
        "x",
        "direction",
        "frac",
        "e",
        "c",
        "cdot",
        "cos",
        "theta",
        "frac",
        "e",
        "c",
        "cdot",
        "frac",
        "v",
        "c",
        "total",
        "momentum",
        "emitted",
        "photon",
        "relative",
        "k",
        "simply",
        "frac",
        "e",
        "c",
        "cdot",
        "frac",
        "v",
        "c",
        "principle",
        "conservation",
        "momentum",
        "must",
        "equal",
        "amount",
        "momentum",
        "lost",
        "b",
        "since",
        "velocity",
        "b",
        "change",
        "either",
        "k",
        "k",
        "assume",
        "classical",
        "expression",
        "momentum",
        "b",
        "cdot",
        "v",
        "frac",
        "e",
        "c",
        "cdot",
        "v",
        "simply",
        "e",
        "mc",
        "finally",
        "since",
        "e",
        "amount",
        "energy",
        "lost",
        "b",
        "measured",
        "b",
        "restframe",
        "could",
        "perspicuously",
        "write",
        "e_o",
        "mc",
        "thus",
        "shown",
        "b",
        "emits",
        "amount",
        "energy",
        "e_o",
        "remaining",
        "current",
        "state",
        "inertial",
        "motion",
        "state",
        "rest",
        "relative",
        "k",
        "mass",
        "ie",
        "restmass",
        "b",
        "decrease",
        "amount",
        "e_o",
        "c",
        "regardless",
        "whether",
        "ohanian",
        "correct",
        "einstein",
        "derivation",
        "constitute",
        "proof",
        "massenergy",
        "equivalence",
        "consider",
        "physical",
        "configuration",
        "specific",
        "new",
        "concern",
        "arises",
        "one",
        "considers",
        "simplified",
        "version",
        "derivation",
        "e_o",
        "mc",
        "one",
        "reviewed",
        "baierlein",
        "concludes",
        "derivation",
        "praising",
        "one",
        "merit",
        "requires",
        "ratio",
        "momentum",
        "energy",
        "electromagnetic",
        "radiation",
        "baierlein",
        "p",
        "already",
        "used",
        "aspect",
        "derivation",
        "presentation",
        "however",
        "baierlein",
        "go",
        "state",
        "moreover",
        "derivationunlike",
        "einstein",
        "derivationmakes",
        "use",
        "lorentz",
        "transformation",
        "result",
        "special",
        "theory",
        "relativity",
        "short",
        "maxwell",
        "knew",
        "everything",
        "necessary",
        "derive",
        "equation",
        "delta",
        "e",
        "delta",
        "c",
        "missing",
        "context",
        "inquiry",
        "would",
        "led",
        "search",
        "connection",
        "energy",
        "inertia",
        "baierlein",
        "p",
        "remarkable",
        "conclusion",
        "correct",
        "suggests",
        "use",
        "kind",
        "simplified",
        "version",
        "einstein",
        "derivation",
        "displaying",
        "einstein",
        "equation",
        "consequence",
        "special",
        "relativity",
        "contrast",
        "einstein",
        "derivation",
        "explicitly",
        "relativistic",
        "see",
        "fernflores",
        "vol",
        "ii",
        "sec"
    ]
}