{
    "main_text": "Methodology\n2. Methodology\n\nDuring his lifetime Erasmus’ name became synonymous with\nhumanism, a label also adopted in modern reference works (such as\nNauert 2006). Today the term “humanist” has a broad range\nof meanings. In the 16th century the word denoted a student\nor teacher of the studia humanitatis, a curriculum focusing\non the study of classical languages, rhetoric, and literature. At\nnorthern universities, where scholasticism and the dialectical method\nreigned supreme, the trend-setting humanists were regarded as\nchallengers of the status quo (see Rummel 1995). The defenders of\ntradition belittled their competitors as “grammarians” and\ndismissed the humanities as poetria, the stuff of poetry. To\na certain extent, the tensions between the two schools of thought may\nbe explained in terms of professional jealousy, but at its core was\nthe dispute over methodology and qualifications. Humanists favored\nrhetorical arguments; scholastics insisted on logical proof.\nScholastic theologians in particular regarded the humanists as\ndangerous interlopers. They questioned their orthodoxy because of\ntheir inclination to use the skeptical ars dubitandi and\ndenied their right to apply philological principles to the biblical\ntext. Scripture, they insisted, was the exclusive domain of graduate\ntheologians. Humanists in turn saw the dialectical method used by the\nscholastics as a perversion of Aristotelian logic and derided their\ntechnical terminology as a corruption of the Latin language. In the\nPraise of Folly Erasmus lampooned scholastic theologians in a\npassage that became notorious:\n\n\nThey are fortified with an army of scholastic definition, conclusions,\ncorollaries, and propositions both explicit and implicit…. They\nquibble about concepts, relations, instants, formalities, quiddities\nand ecceities, which a man could not possibly perceive unless like\nLynceus he could see through blackest darkness things which\ndon’t exist…. You’d extricate yourself faster from\na labyrinth than from the tortuous obscurities of realists,\nnominalists, Thomists, Albertists, Ockhamists, and Scotists….\nSuch is the erudition and complexity they all display that I fancy the\napostles themselves would need the help of another Holy Spirit if they\nwere obliged to join issue on these topics with our new breed of\ntheologians. (CWE 27: 126–7)\n\n\nOn a more serious note, he voiced two objections against the\ndialectical disputations of the theologians: “The portentious\nfilth of their barbarous and artificial style” obscured the\nmeaning (CWE 3: 124), and their argumentation lacked a moral\ndimension. Scholastic disputations honed intellectual skills but\nfailed to make better Christians of the protagonists. “Well, we\nare training not a pugilist but a theologian”, Erasmus says in\nhis Methodus, “and a theologian who prefers to express\nwith his life rather than in syllogisms what he professes” (CWE\n41: 452).\n\nHe further insisted on the right of humanists, who were trained in the\nclassical languages, to apply their philological skills to both\nsecular and sacred writings. Translation and textual\ncriticism of the Bible required philological skills, and theologians\nwho engaged in this task “were acting in the capacity of\nphilologists (grammatici)” (Ep. 181: 120–5; CWE\n2).\n\nWhile the need for language studies and the use of philological\nmethods found gradual acceptance among theologians, the skeptical\nars dubitandi, which was also closely associated with\nhumanism, remained anathema. Since skepticism was identified with\natheism in Erasmus’ time, most humanists refrained from\nadvocating this method openly. They expressed their skepticism through\nthe use of open-ended dialogue or rhetorical compositions that argued\nopposing points of view. Erasmus used these means to argue for and\nagainst marriage, for and against monastic vows, and for and against\ndoctrinal positions. Rather surprisingly he admitted to his preference\nfor skepticism in A Discussion of Free Will. This tract was\naimed at Luther’s assertion that free will did not exist and the\nsinner was justified sola fide, by faith alone, and sola\ngratia, by grace alone (more in Boyle 1983).\n\nErasmus’ tract, which he called a diatribe, that is, a\ndisquisition, is a showpiece of his methodology. He begins his\nargumentation in the classic skeptical fashion by collating scriptural\nevidence for and against the concept of free will and demonstrating\nthat there is no consensus and no rational way of resolving the\nresulting dilemma.\n\nThe method of arguing in utramque partem, on both sides of a\nquestion, was first developed by the Greek Sophists as a demonstration\nof their rhetorical prowess. Pyrrhonic skeptics adopted this method as\na preliminary step in arguing a case. If the evidence was ambivalent,\nthey advocated epoche, suspension of judgment. Academic\nskeptics modified this process, admitting probability as a criterion\nto settle an ambiguous question. A variant of the skeptical method\nalso appears in medieval scholastic handbooks where doctrinal\nquestions are argued sic et non, that is, on both sides, then\nsettled by a magisterial decision or resolutio.\n\nErasmus stressed that he was not prepared to pass judgment on the\nquestion of free will himself. Indeed his natural inclination was to\ntake the Pyrrhonic route and suspend judgment since the evidence was\nnot unequivocal. “I take so little pleasure in assertions that I\nwill gladly seek refuge in Scepticism”, he writes (CWE 76: 7),\nbut as a believer he was obliged to take a different route. He\nsubstituted for his own judgment the authoritative decision of the\nCatholic Church, which affirmed the existence of free will. As her\nobedient son, he accepted this resolution. Unlike the scholastics,\nthen, Erasmus does not provide a dialectically reasoned answer, but\nsubmits to “commonly accepted creeds or universal synods”\n(LB IX: 1091C), that is, to long-standing tradition and to decisions\narrived at by the consensus of authorized representatives of the\nCatholic Church. Modern scholars acknowledge this slant when they\nlabel Erasmus a “Christian humanist”. Likewise his\nskepticism might be called a “Christian skepticism”, that\nis, a pagan philosophy modified and adapted to Christian thought.\n\nErasmus’ skepticism shaped his attitude toward the reformers.\nFor several years he gave them his qualified support, but in the 1520s\nwhen he saw Luther openly defy Catholic authorities, he decried his\nradical methods and distanced himself from the Reformation movement.\nThe decision to disengage may have been prompted by considerations for\nhis own safety and a desire to avoid inquisitorial scrutiny, but\nepistemological considerations also played a role in his withdrawal\nfrom the reformers and ultimate reversal of opinion about Luther.\nErasmus regarded consensus as an essential criterion of the doctrinal\ntruth. Schism posed a threat to his decision-making process. If papal\nauthority was questioned in principle and the decrees of the synods\nwere not binding, Erasmus the Christian Skeptic was paralyzed in his\ndecision-making process and unable to settle questions that did not\nallow a resolution based on clear scriptural evidence.\n\nLuther, who believed in the clarity of Scripture, did not accept\nskepticism as a methodological approach. He saw it as waffling. He\nscoffed at Erasmus who wanted “to compare everything and affirm\nnothing” and called him a follower of Lucian or Epicurus, an\natheist who ridiculed the beliefs of others. “Permit us to be\nasserters”, he wrote, “to be devoted to assertions and\ndelight in them, while you stick to your sceptics and\nAcademics… The Holy Spirit is no Sceptic!” Luther\ncriticized Erasmus for using the skeptical method also in his\nCatechismus (1524) and thereby sowing doubt among\ncatechumens. He was unwilling to put up with ambivalence and demanded\na clear-cut judgment. There was no room in doctrinal discussions for\nErasmus’ slippery rhetoric (see CWE 76: 116–24; Luther\n1525, “On the Bondage of the Will” quoted in Rummel 2000,\n59–60).\n\nErasmus responded to Luther’s criticism with a second tract,\nHyperaspistes (A Defensive Shield, 1526), reaffirming his\nskepticism, but clarifying its meaning:\n\n\nA Sceptic is not someone who doesn’t care to know what is true\nor false…but rather someone who does not make a final decision\neasily or fight to the death for his own opinion, but rather accepts\nas probable what someone else accepts as certain.\n\n\nUp to this point he might be describing the position of an Academic\nskeptic, but he goes on to specify:\n\n\nI explicitly exclude from Scepticism whatever is set forth in Sacred\nScripture or whatever has been handed down to us by the authority of\nthe Church. (CWE 76: 118)\n\n\nErasmus’ criteria then are first of all Scripture, but if\nscriptural evidence is ambiguous, he relies on\n\n\nthe decrees of the Catholic Church, especially those issued by general\ncouncils and fully approved by a consensus of the Christian people.\n(CWE 76: 127)\n\n\nIn other words, he substitutes for the Academic criterion of\nprobability, the criteria of Christian tradition and consensus (see\nespecially Payne in Coppens 1969, 2: 77–99).\n\nLuther disapproved of Erasmus’ use of rhetorical terms in what\nwas a doctrinal dispute. His admirers, by contrast, praised his\nskillful use of language. They contrasted his moderate wording with\nLuther’s antagonistic tone and commended Erasmus’\ncourteous and accommodating style, but did not comment on the\nepistemological underpinning of his conclusions. It is possible that\nthey appreciated Erasmus’ arguments but did not think it politic\nor indeed helpful to his cause to acknowledge his skepticism.\n\nIn addition to the arguments rooted in skepticism, Erasmus also brings\nethical criteria to bear on the question of free will. He argued that\ndenying the existence of free will would destroy the moral basis of\nhuman action. Affirming the power of free will was socially expedient.\nHumanists criticized the dialectic method used by the scholastics\nprecisely because it resulted only in a technical victory over their\nopponents and did not produce moral conviction or change their\nopponents’ mind. To convince the other party, consensus was\nnecessary. Thus the characters in Erasmus’ Colloquies\n“Inquiry into Faith” and “The Godly Feast”\nargue on both sides of the questions at issue, but their dialogue ends\nin a friendly consensus. This rhetorical type of argumentation which\nemphasizes collaboration and consensus-building is a typical\nhumanistic approach and an important element also of Erasmus’\npolitical thought and his educational philosophy.\n",
    "section_title": "2. Methodology",
    "entry_title": "Desiderius Erasmus",
    "hierarchy_title": "Desiderius Erasmus || Methodology",
    "tokenized_text": [
        "methodology",
        "methodology",
        "lifetime",
        "erasmus",
        "name",
        "became",
        "synonymous",
        "humanism",
        "label",
        "also",
        "adopted",
        "modern",
        "reference",
        "work",
        "nauert",
        "today",
        "term",
        "humanist",
        "broad",
        "range",
        "meaning",
        "th",
        "century",
        "word",
        "denoted",
        "student",
        "teacher",
        "studia",
        "humanitatis",
        "curriculum",
        "focusing",
        "study",
        "classical",
        "language",
        "rhetoric",
        "literature",
        "northern",
        "university",
        "scholasticism",
        "dialectical",
        "method",
        "reigned",
        "supreme",
        "trendsetting",
        "humanist",
        "regarded",
        "challenger",
        "status",
        "quo",
        "see",
        "rummel",
        "defender",
        "tradition",
        "belittled",
        "competitor",
        "grammarian",
        "dismissed",
        "humanity",
        "poetria",
        "stuff",
        "poetry",
        "certain",
        "extent",
        "tension",
        "two",
        "school",
        "thought",
        "may",
        "explained",
        "term",
        "professional",
        "jealousy",
        "core",
        "dispute",
        "methodology",
        "qualification",
        "humanist",
        "favored",
        "rhetorical",
        "argument",
        "scholastic",
        "insisted",
        "logical",
        "proof",
        "scholastic",
        "theologian",
        "particular",
        "regarded",
        "humanist",
        "dangerous",
        "interloper",
        "questioned",
        "orthodoxy",
        "inclination",
        "use",
        "skeptical",
        "ar",
        "dubitandi",
        "denied",
        "right",
        "apply",
        "philological",
        "principle",
        "biblical",
        "text",
        "scripture",
        "insisted",
        "exclusive",
        "domain",
        "graduate",
        "theologian",
        "humanist",
        "turn",
        "saw",
        "dialectical",
        "method",
        "used",
        "scholastic",
        "perversion",
        "aristotelian",
        "logic",
        "derided",
        "technical",
        "terminology",
        "corruption",
        "latin",
        "language",
        "praise",
        "folly",
        "erasmus",
        "lampooned",
        "scholastic",
        "theologian",
        "passage",
        "became",
        "notorious",
        "fortified",
        "army",
        "scholastic",
        "definition",
        "conclusion",
        "corollary",
        "proposition",
        "explicit",
        "implicit",
        "quibble",
        "concept",
        "relation",
        "instant",
        "formality",
        "quiddity",
        "ecceities",
        "man",
        "could",
        "possibly",
        "perceive",
        "unless",
        "like",
        "lynceus",
        "could",
        "see",
        "blackest",
        "darkness",
        "thing",
        "exist",
        "extricate",
        "faster",
        "labyrinth",
        "tortuous",
        "obscurity",
        "realist",
        "nominalist",
        "thomists",
        "albertists",
        "ockhamists",
        "scotists",
        "erudition",
        "complexity",
        "display",
        "fancy",
        "apostle",
        "would",
        "need",
        "help",
        "another",
        "holy",
        "spirit",
        "obliged",
        "join",
        "issue",
        "topic",
        "new",
        "breed",
        "theologian",
        "cwe",
        "serious",
        "note",
        "voiced",
        "two",
        "objection",
        "dialectical",
        "disputation",
        "theologian",
        "portentious",
        "filth",
        "barbarous",
        "artificial",
        "style",
        "obscured",
        "meaning",
        "cwe",
        "argumentation",
        "lacked",
        "moral",
        "dimension",
        "scholastic",
        "disputation",
        "honed",
        "intellectual",
        "skill",
        "failed",
        "make",
        "better",
        "christian",
        "protagonist",
        "well",
        "training",
        "pugilist",
        "theologian",
        "erasmus",
        "say",
        "methodus",
        "theologian",
        "prefers",
        "express",
        "life",
        "rather",
        "syllogism",
        "professes",
        "cwe",
        "insisted",
        "right",
        "humanist",
        "trained",
        "classical",
        "language",
        "apply",
        "philological",
        "skill",
        "secular",
        "sacred",
        "writing",
        "translation",
        "textual",
        "criticism",
        "bible",
        "required",
        "philological",
        "skill",
        "theologian",
        "engaged",
        "task",
        "acting",
        "capacity",
        "philologist",
        "grammatici",
        "ep",
        "cwe",
        "need",
        "language",
        "study",
        "use",
        "philological",
        "method",
        "found",
        "gradual",
        "acceptance",
        "among",
        "theologian",
        "skeptical",
        "ar",
        "dubitandi",
        "also",
        "closely",
        "associated",
        "humanism",
        "remained",
        "anathema",
        "since",
        "skepticism",
        "identified",
        "atheism",
        "erasmus",
        "time",
        "humanist",
        "refrained",
        "advocating",
        "method",
        "openly",
        "expressed",
        "skepticism",
        "use",
        "openended",
        "dialogue",
        "rhetorical",
        "composition",
        "argued",
        "opposing",
        "point",
        "view",
        "erasmus",
        "used",
        "mean",
        "argue",
        "marriage",
        "monastic",
        "vow",
        "doctrinal",
        "position",
        "rather",
        "surprisingly",
        "admitted",
        "preference",
        "skepticism",
        "discussion",
        "free",
        "tract",
        "aimed",
        "luther",
        "assertion",
        "free",
        "exist",
        "sinner",
        "justified",
        "sola",
        "fide",
        "faith",
        "alone",
        "sola",
        "gratia",
        "grace",
        "alone",
        "boyle",
        "erasmus",
        "tract",
        "called",
        "diatribe",
        "disquisition",
        "showpiece",
        "methodology",
        "begin",
        "argumentation",
        "classic",
        "skeptical",
        "fashion",
        "collating",
        "scriptural",
        "evidence",
        "concept",
        "free",
        "demonstrating",
        "consensus",
        "rational",
        "way",
        "resolving",
        "resulting",
        "dilemma",
        "method",
        "arguing",
        "utramque",
        "partem",
        "side",
        "question",
        "first",
        "developed",
        "greek",
        "sophist",
        "demonstration",
        "rhetorical",
        "prowess",
        "pyrrhonic",
        "skeptic",
        "adopted",
        "method",
        "preliminary",
        "step",
        "arguing",
        "case",
        "evidence",
        "ambivalent",
        "advocated",
        "epoche",
        "suspension",
        "judgment",
        "academic",
        "skeptic",
        "modified",
        "process",
        "admitting",
        "probability",
        "criterion",
        "settle",
        "ambiguous",
        "question",
        "variant",
        "skeptical",
        "method",
        "also",
        "appears",
        "medieval",
        "scholastic",
        "handbook",
        "doctrinal",
        "question",
        "argued",
        "sic",
        "et",
        "non",
        "side",
        "settled",
        "magisterial",
        "decision",
        "resolutio",
        "erasmus",
        "stressed",
        "prepared",
        "pas",
        "judgment",
        "question",
        "free",
        "indeed",
        "natural",
        "inclination",
        "take",
        "pyrrhonic",
        "route",
        "suspend",
        "judgment",
        "since",
        "evidence",
        "unequivocal",
        "take",
        "little",
        "pleasure",
        "assertion",
        "gladly",
        "seek",
        "refuge",
        "scepticism",
        "writes",
        "cwe",
        "believer",
        "obliged",
        "take",
        "different",
        "route",
        "substituted",
        "judgment",
        "authoritative",
        "decision",
        "catholic",
        "church",
        "affirmed",
        "existence",
        "free",
        "obedient",
        "son",
        "accepted",
        "resolution",
        "unlike",
        "scholastic",
        "erasmus",
        "provide",
        "dialectically",
        "reasoned",
        "answer",
        "submits",
        "commonly",
        "accepted",
        "creed",
        "universal",
        "synod",
        "lb",
        "ix",
        "c",
        "longstanding",
        "tradition",
        "decision",
        "arrived",
        "consensus",
        "authorized",
        "representative",
        "catholic",
        "church",
        "modern",
        "scholar",
        "acknowledge",
        "slant",
        "label",
        "erasmus",
        "christian",
        "humanist",
        "likewise",
        "skepticism",
        "might",
        "called",
        "christian",
        "skepticism",
        "pagan",
        "philosophy",
        "modified",
        "adapted",
        "christian",
        "thought",
        "erasmus",
        "skepticism",
        "shaped",
        "attitude",
        "toward",
        "reformer",
        "several",
        "year",
        "gave",
        "qualified",
        "support",
        "s",
        "saw",
        "luther",
        "openly",
        "defy",
        "catholic",
        "authority",
        "decried",
        "radical",
        "method",
        "distanced",
        "reformation",
        "movement",
        "decision",
        "disengage",
        "may",
        "prompted",
        "consideration",
        "safety",
        "desire",
        "avoid",
        "inquisitorial",
        "scrutiny",
        "epistemological",
        "consideration",
        "also",
        "played",
        "role",
        "withdrawal",
        "reformer",
        "ultimate",
        "reversal",
        "opinion",
        "luther",
        "erasmus",
        "regarded",
        "consensus",
        "essential",
        "criterion",
        "doctrinal",
        "truth",
        "schism",
        "posed",
        "threat",
        "decisionmaking",
        "process",
        "papal",
        "authority",
        "questioned",
        "principle",
        "decree",
        "synod",
        "binding",
        "erasmus",
        "christian",
        "skeptic",
        "paralyzed",
        "decisionmaking",
        "process",
        "unable",
        "settle",
        "question",
        "allow",
        "resolution",
        "based",
        "clear",
        "scriptural",
        "evidence",
        "luther",
        "believed",
        "clarity",
        "scripture",
        "accept",
        "skepticism",
        "methodological",
        "approach",
        "saw",
        "waffling",
        "scoffed",
        "erasmus",
        "wanted",
        "compare",
        "everything",
        "affirm",
        "nothing",
        "called",
        "follower",
        "lucian",
        "epicurus",
        "atheist",
        "ridiculed",
        "belief",
        "others",
        "permit",
        "u",
        "asserter",
        "wrote",
        "devoted",
        "assertion",
        "delight",
        "stick",
        "sceptic",
        "academics",
        "holy",
        "spirit",
        "sceptic",
        "luther",
        "criticized",
        "erasmus",
        "using",
        "skeptical",
        "method",
        "also",
        "catechismus",
        "thereby",
        "sowing",
        "doubt",
        "among",
        "catechumen",
        "unwilling",
        "put",
        "ambivalence",
        "demanded",
        "clearcut",
        "judgment",
        "room",
        "doctrinal",
        "discussion",
        "erasmus",
        "slippery",
        "rhetoric",
        "see",
        "cwe",
        "luther",
        "bondage",
        "quoted",
        "rummel",
        "erasmus",
        "responded",
        "luther",
        "criticism",
        "second",
        "tract",
        "hyperaspistes",
        "defensive",
        "shield",
        "reaffirming",
        "skepticism",
        "clarifying",
        "meaning",
        "sceptic",
        "someone",
        "care",
        "know",
        "true",
        "falsebut",
        "rather",
        "someone",
        "make",
        "final",
        "decision",
        "easily",
        "fight",
        "death",
        "opinion",
        "rather",
        "accepts",
        "probable",
        "someone",
        "else",
        "accepts",
        "certain",
        "point",
        "might",
        "describing",
        "position",
        "academic",
        "skeptic",
        "go",
        "specify",
        "explicitly",
        "exclude",
        "scepticism",
        "whatever",
        "set",
        "forth",
        "sacred",
        "scripture",
        "whatever",
        "handed",
        "u",
        "authority",
        "church",
        "cwe",
        "erasmus",
        "criterion",
        "first",
        "scripture",
        "scriptural",
        "evidence",
        "ambiguous",
        "relies",
        "decree",
        "catholic",
        "church",
        "especially",
        "issued",
        "general",
        "council",
        "fully",
        "approved",
        "consensus",
        "christian",
        "people",
        "cwe",
        "word",
        "substitute",
        "academic",
        "criterion",
        "probability",
        "criterion",
        "christian",
        "tradition",
        "consensus",
        "see",
        "especially",
        "payne",
        "coppens",
        "luther",
        "disapproved",
        "erasmus",
        "use",
        "rhetorical",
        "term",
        "doctrinal",
        "dispute",
        "admirer",
        "contrast",
        "praised",
        "skillful",
        "use",
        "language",
        "contrasted",
        "moderate",
        "wording",
        "luther",
        "antagonistic",
        "tone",
        "commended",
        "erasmus",
        "courteous",
        "accommodating",
        "style",
        "comment",
        "epistemological",
        "underpinning",
        "conclusion",
        "possible",
        "appreciated",
        "erasmus",
        "argument",
        "think",
        "politic",
        "indeed",
        "helpful",
        "cause",
        "acknowledge",
        "skepticism",
        "addition",
        "argument",
        "rooted",
        "skepticism",
        "erasmus",
        "also",
        "brings",
        "ethical",
        "criterion",
        "bear",
        "question",
        "free",
        "argued",
        "denying",
        "existence",
        "free",
        "would",
        "destroy",
        "moral",
        "basis",
        "human",
        "action",
        "affirming",
        "power",
        "free",
        "socially",
        "expedient",
        "humanist",
        "criticized",
        "dialectic",
        "method",
        "used",
        "scholastic",
        "precisely",
        "resulted",
        "technical",
        "victory",
        "opponent",
        "produce",
        "moral",
        "conviction",
        "change",
        "opponent",
        "mind",
        "convince",
        "party",
        "consensus",
        "necessary",
        "thus",
        "character",
        "erasmus",
        "colloquy",
        "inquiry",
        "faith",
        "godly",
        "feast",
        "argue",
        "side",
        "question",
        "issue",
        "dialogue",
        "end",
        "friendly",
        "consensus",
        "rhetorical",
        "type",
        "argumentation",
        "emphasizes",
        "collaboration",
        "consensusbuilding",
        "typical",
        "humanistic",
        "approach",
        "important",
        "element",
        "also",
        "erasmus",
        "political",
        "thought",
        "educational",
        "philosophy"
    ]
}