{
    "main_text": "The Ergodic Hierarchy and Statistical Mechanics || Gibbsian SM\n4.2 Gibbsian SM\n\nAt the basis of Gibbs’ approach stands a conceptual shift. The\nobject of study in the Boltzmannian framework is an individual system,\nconsisting of a large but finite number of micro constituents. By\ncontrast, within the Gibbs framework the object of study is a\nso-called ensemble: an imaginary collection of infinitely\nmany copies of the same system (they are the same in that they have\nthe same phase space, dynamics and measure), but who happen to be in\ndifferent states. An ensemble of gases, for instance, consists of\ninfinitely many copies of the same gas bit in different states: one is\nconcentrated in the left corner of the box, one is evenly distributed,\netc. It is important to emphasise that ensembles are fictions, or\n‘mental copies of the one system under consideration’\n(Schrödinger 1952, 3); or alternatively they can be thought of as\ncollections of possible states of the entire system. Hence, it is\nimportant not to confuse ensembles with collections of micro-objects\nsuch as the molecules of a gas!\n\nThe instantaneous state of one system of the ensemble is specified by\none point in its phase space. The state of the ensemble as a\nwhole is therefore specified by a density function \\(\\varrho\\) on\nthe system’s phase space. From a technical point of view\n\\(\\varrho\\) is a function just like \\(f\\) that we encountered in\nSection 1. We furthermore assume that \\(\\varrho\\) is a probability\ndensity, reflecting the probability density of finding the state of a\nsystem chosen at random from the entire ensemble in region \\(R\\), so\nthat the probability of the state being in \\(R\\) is \\(p(R) = \\int_R\n\\varrho d\\mu\\). To make this more intuitive consider the following\nanalogy. You play a special kind of darts: you fix a plank to the\nwall, which serves as your dart board. For some reason you know that\nthe probability of your dart landing at a particular place on the\nboard is given by the curve shown in Figure 7. You are then asked what\nthe probability is that your next dart lands in the left half of the\nboard. The answer is 1 ⁄ 2 since one half of the surface\nunderneath the curve is on the left side. The dart board then plays\nthe role of the system’s state space, a region of the board\n(here the left half) plays the role of \\(R\\), and throwing a dart\nplays the role of picking a system from the ensemble.\n\n\n\nFigure 7: Dart board\n\n\nThe importance of this is that it allows us to calculate expectation\nvalues. Assume that the game is such that you get one Pound if the\ndart hits the left half and three Pounds if it lands on the right\nhalf. What is your expected gain? The answer is 1 ⁄ \\(2 \\times\n1\\) Pound \\(+ 1\\) ⁄ \\(2 \\times 3\\) Pounds \\(= 2\\) Pounds. This\nis the expectation value. The same idea is at work in SM. Physical\nmagnitudes like, for instance, pressure are associated with functions\n\\(f\\) on the phase pace. We then calculate the expectation value of\nthese magnitudes, which, in general is given by \\(\\langle f \\rangle =\n\\int fd\\mu\\). In the context of Gibbsian SM these expectation values\nare also referred to as phase averages or ensemble\naverages. They are of central importance because these values are\nused as predictions for observed values. So if you want to use the\nformalism to predict what will be observed in an experiment, you first\nhave to figure out what the probability density \\(\\varrho\\) is, then\nfind the function \\(f\\) corresponding to the physical quantity you are\ninterested in, and then calculate the phase average. Neither of these\nsteps is easy in practice and working physicists spend most of their\ntime doing these calculations. However, these difficulties need not\noccupy us if we are interested in the conceptual issues underlying\nthis ‘recipe’.\n\nBy definition, a probability density \\(\\varrho\\) is stationary if it\ndoes not change over time. Given that observable quantities are\nassociated with phase averages and that equilibrium is defined in\nterms of the constancy of the macroscopic parameters characterising\nthe system, it is natural to regard the stationarity of the\ndistribution as a necessary condition for equilibrium because\nstationary distributions yield constant averages. For this reason\nGibbs refers to stationarity as the ‘condition of statistical\nequilibrium’.\n\nAmong all stationary distributions those satisfying a further\nrequirement, the Gibbsian maximum entropy principle, play a\nspecial role. The Gibbs entropy (sometimes called\n‘ensemble entropy’) is defined as \n\n\\[\n S_G (\\varrho) = -k_B\\int \\varrho\\log(\\varrho)d\\mu .\n\\]\n\n\nThe Gibbsian maximum entropy principle then requires that \\(S_G\n(\\varrho)\\) be maximal, given the constraints that are imposed on the\n system.[16]\n\nThe last clause is essential because different constraints single out\ndifferent distributions. A common choice is to keep both the energy\nand the particle number in the system fixed. One can prove that under\nthese circumstances \\(S_G (\\varrho)\\) is maximal for the so-called\nmicrocanonical distribution (or microcanonical\nensemble). If we choose to hold the number of particles constant\nwhile allowing for energy fluctuations around a given mean value we\nobtain the so-called canonical distribution; if we also allow\nthe particle number to fluctuate around a given mean value we find the\nso-called grand-canonical\n distribution.[17]\n\n\nThis formalism is enormously successful in that correct predictions\ncan be derived for a vast class of systems. But the success of this\nformalism is rather puzzling. The first and most obvious question\nconcerns the relation of systems and ensembles. The probability\ndistribution in the Gibbs approach is defined over an ensemble, the\nformalism provides ensemble averages, and equilibrium is regarded as a\nproperty of an ensemble. But what we are really interested in is the\nbehaviour of a single system! What could the properties of an\nensemble—a fictional entity consisting of infinitely many mental\ncopies of the real system—tell us about the one real system on\nthe laboratory table? And more specifically, why do averages over an\nensemble coincide with the values found in measurements performed on\nan actual physical system in equilibrium? There is no obvious reason\nwhy this should be so, and it turns out that ergodicity plays a\ncentral role in answering these questions.\n\nCommon textbook wisdom justifies the use of phase averages as follows.\nAs we have seen, the Gibbs formalism associates physical quantities\nwith functions on the system’s phase space. Making an\nexperiment measuring one of these quantities takes time and it is\nassumed that what measurement devices register is not the\ninstantaneous value of the function in question, but rather its time\naverage over the duration of the measurement. Hence, time averages are\nwhat is empirically accessible. Then, so the argument continues,\nalthough measurements take an amount of time that is short by human\nstandards, it is long compared to microscopic time scales on which\ntypical molecular processes take place. For this reason it is assumed\nthat the measured finite time average is approximately equal\nto the infinite time average of the measured function. If we\nnow assume that the system is ergodic, then time averages equal phase\naverages. The latter can easily be obtained from the formalism. Hence\nwe have found the sought-after connection: the Gibbs formalism\nprovides phase averages which, due to ergodicity, are equal to\ninfinite time averages, and these are, to a good approximation, equal\nto the finite time averages obtained from measurements.\n\nThis argument is problematic for at least two reasons. First, from the\nfact that measurements take some time it does not follow that what is\nactually measured are time averages. For instance, it could be the\ncase that the value provided to us by the measurement device is simply\nthe value assumed by at the last moment of the measurement,\nirrespective of what the previous values of were (e.g.\nit’s simply the last pointer reading registered). So we would\nneed an argument for the conclusion that measurements indeed produce\ntime averages. Second, even if we take for granted that\nmeasurements do produce finite time averages, equating these\naverages with infinite time averages is problematic. Even if the\nduration of the measurement is long by experimental standards (which\nneed not be the case), finite and infinite averages may assume very\ndifferent values. That is not to say that they necessarily have to be\ndifferent; they could coincide. But whether or not they do is\nan empirical question, which depends on the specifics of the system\nunder investigation. So care is needed when replacing finite with\ninfinite time averages, and one cannot identify them without further\nargument. \n\nMalament and Zabell (1980) respond to this challenge by suggesting a\nway of explaining the success of equilibrium theory that still invokes\nergodicity, but avoids appeal to time averages. This solves the above\nmentioned problems, but suffers from the difficulty that many systems\nthat are successfully dealt with by the formalism of SM are not\nergodic. To circumvent this difficulty Vranas (1998) suggested\nreplacing ergodicity with what he calls \\(\\varepsilon\\)-ergodicity.\nIntuitively a system is \\(\\varepsilon\\)-ergodic if it is ergodic not\non the entire phase space, but on a very large part of it (those parts\non which it is not ergodic having measure \\(\\varepsilon\\), where\n\\(\\varepsilon\\) is very small). The leading idea behind his approach\nis to challenge the commonly held belief that even if a system is just\na ‘little bit’ non-ergodic, then it behaves in a\ncompletely ‘un-ergodic’ way. Vranas points out that there\nis a middle ground and then argues that this middle ground actually\nprovides us with everything we need. This is a promising proposal, but\nit faces three challenges. First, it needs to be shown that all\nrelevant systems really are \\(\\varepsilon\\)-ergodicity. Second, the\nargument so far has only been developed for the microcanonical\nensemble, but one would like to know whether, and if so how, it works\nfor the canonical and the grandcanonical ensembles. Third, it is still\nbased on the assumption that equilibrium is characterised by a\nstationary distribution, which, as we will see below, is an obstacle\nwhen it comes to formulating a workable Gibbsian non-equilibrium\ntheory.\n\nThe second response begins with Khinchin’s work. Khinchin (1949)\npointed out that the problems of the ergodic programme are due to the\nfact that it focuses on too general a class of systems. Rather than\nstudying dynamical systems at a general level, we should focus on\nthose cases that are relevant in statistical mechanics. This involves\ntwo restrictions. First, we only have to consider systems with a large\nnumber of degrees of freedom; second, we only need to take into\naccount a special class of phase functions, the so-called ‘sum\nfunctions’. These functions are a sum of one-particle functions,\ni.e., functions that take into account only the position and momentum\nof one particle. Under these assumption Khinchin proved that as \\(n\\)\nbecomes larger, the measure of those regions on the energy\n hypersurface[18]\n where the time and the space means differ by more than a small amount\ntends towards zero. Roughly speaking, this result says that for large\n\\(n\\) the system behaves, for all practical purposes, as if it was\nergodic.\n\nThe problem with this result is that it is valid only for sum\nfunctions, and in particular only if the energy function of the system\nis itself a sum function, which is not the case when particles\ninteract. So the question is how this result can be generalised to\nmore realistic cases. This problem stands at the starting point of a\nresearch programme now known as the thermodynamic limit,\nchampioned, among others, by Lanford, Mazur, Ruelle, and van der\nLinden (see van Lith (2001) for a survey). Its leading question is\nwhether one can still prove ‘Khinchin-like’ results in the\ncase of energy function with interaction\n terms.[19]\n Results of this kind can be proven in the limit for \\(n \\rightarrow\n\\infty\\), if also the volume \\(V\\) of the system tends towards\ninfinity in such a way that the number-density \\(n/V\\) remains\nconstant.\n\nSo far we have only dealt with equilibrium, and things get worse once\nwe turn to non-equilibrium. The main problem is that it is a\nconsequence of the formalism that the Gibbs entropy is a constant!\nThis precludes a characterisation of the approach to equilibrium in\nterms of increasing Gibbs entropy, which is what one would expect if\nwe were to treat the Gibbs entropy as the SM counterpart of the\nthermodynamic entropy. The standard way around this problem is to\ncoarse-grain the phase space, and then define the so-called coarse\ngrained Gibbs entropy. Put simply, course-graining the phase space\namounts to putting a grid on the phase space and declare that all\npoints within one cell of the grid are indistinguishable. This\nprocedure turns a continuous phase space into a discrete collection of\ncells, and the state of the system is then specified by saying in\nwhich cell the system’s state is. If we define the Gibbs entropy on\nthis grid, it turns out (for purely mathematical reasons) that the\nentropy is no longer a constant and can actually increase or decrease.\nIf one then assumes that the system is mixing, it follows from the\nso-called convergence theorem of ergodic theory that the\ncoarse-grained Gibbs entropy approaches a maximum. However, this\nsolution is fraught with controversy, the two main bones of contention\nbeing the justification of coarse-graining and the assumption that the\nsystem is mixing.\n\nIn sum, ergodicity plays a central role in many attempts to justify\nthe posits of SM. And even where a simplistic use of ergodicity is\neventually unsuccessful, somewhat modified notions prove fruitful in\nan analysis of the problem and in the search for better solutions.\n",
    "section_title": "4.2 Gibbsian SM",
    "entry_title": "The Ergodic Hierarchy",
    "hierarchy_title": "The Ergodic Hierarchy || The Ergodic Hierarchy and Statistical Mechanics || Gibbsian SM",
    "tokenized_text": [
        "ergodic",
        "hierarchy",
        "statistical",
        "mechanic",
        "gibbsian",
        "sm",
        "gibbsian",
        "sm",
        "basis",
        "gibbs",
        "approach",
        "stand",
        "conceptual",
        "shift",
        "object",
        "study",
        "boltzmannian",
        "framework",
        "individual",
        "system",
        "consisting",
        "large",
        "finite",
        "number",
        "micro",
        "constituent",
        "contrast",
        "within",
        "gibbs",
        "framework",
        "object",
        "study",
        "socalled",
        "ensemble",
        "imaginary",
        "collection",
        "infinitely",
        "many",
        "copy",
        "system",
        "phase",
        "space",
        "dynamic",
        "measure",
        "happen",
        "different",
        "state",
        "ensemble",
        "gas",
        "instance",
        "consists",
        "infinitely",
        "many",
        "copy",
        "gas",
        "bit",
        "different",
        "state",
        "one",
        "concentrated",
        "left",
        "corner",
        "box",
        "one",
        "evenly",
        "distributed",
        "etc",
        "important",
        "emphasise",
        "ensemble",
        "fiction",
        "mental",
        "copy",
        "one",
        "system",
        "consideration",
        "schrödinger",
        "alternatively",
        "thought",
        "collection",
        "possible",
        "state",
        "entire",
        "system",
        "hence",
        "important",
        "confuse",
        "ensemble",
        "collection",
        "microobjects",
        "molecule",
        "gas",
        "instantaneous",
        "state",
        "one",
        "system",
        "ensemble",
        "specified",
        "one",
        "point",
        "phase",
        "space",
        "state",
        "ensemble",
        "whole",
        "therefore",
        "specified",
        "density",
        "function",
        "varrho",
        "system",
        "phase",
        "space",
        "technical",
        "point",
        "view",
        "varrho",
        "function",
        "like",
        "f",
        "encountered",
        "section",
        "furthermore",
        "assume",
        "varrho",
        "probability",
        "density",
        "reflecting",
        "probability",
        "density",
        "finding",
        "state",
        "system",
        "chosen",
        "random",
        "entire",
        "ensemble",
        "region",
        "r",
        "probability",
        "state",
        "r",
        "p",
        "r",
        "int_r",
        "varrho",
        "dmu",
        "make",
        "intuitive",
        "consider",
        "following",
        "analogy",
        "play",
        "special",
        "kind",
        "dart",
        "fix",
        "plank",
        "wall",
        "serf",
        "dart",
        "board",
        "reason",
        "know",
        "probability",
        "dart",
        "landing",
        "particular",
        "place",
        "board",
        "given",
        "curve",
        "shown",
        "figure",
        "asked",
        "probability",
        "next",
        "dart",
        "land",
        "left",
        "half",
        "board",
        "answer",
        "since",
        "one",
        "half",
        "surface",
        "underneath",
        "curve",
        "left",
        "side",
        "dart",
        "board",
        "play",
        "role",
        "system",
        "state",
        "space",
        "region",
        "board",
        "left",
        "half",
        "play",
        "role",
        "r",
        "throwing",
        "dart",
        "play",
        "role",
        "picking",
        "system",
        "ensemble",
        "figure",
        "dart",
        "board",
        "importance",
        "allows",
        "u",
        "calculate",
        "expectation",
        "value",
        "assume",
        "game",
        "get",
        "one",
        "pound",
        "dart",
        "hit",
        "left",
        "half",
        "three",
        "pound",
        "land",
        "right",
        "half",
        "expected",
        "gain",
        "answer",
        "times",
        "pound",
        "times",
        "pound",
        "pound",
        "expectation",
        "value",
        "idea",
        "work",
        "sm",
        "physical",
        "magnitude",
        "like",
        "instance",
        "pressure",
        "associated",
        "function",
        "f",
        "phase",
        "pace",
        "calculate",
        "expectation",
        "value",
        "magnitude",
        "general",
        "given",
        "langle",
        "f",
        "rangle",
        "int",
        "fdmu",
        "context",
        "gibbsian",
        "sm",
        "expectation",
        "value",
        "also",
        "referred",
        "phase",
        "average",
        "ensemble",
        "average",
        "central",
        "importance",
        "value",
        "used",
        "prediction",
        "observed",
        "value",
        "want",
        "use",
        "formalism",
        "predict",
        "observed",
        "experiment",
        "first",
        "figure",
        "probability",
        "density",
        "varrho",
        "find",
        "function",
        "f",
        "corresponding",
        "physical",
        "quantity",
        "interested",
        "calculate",
        "phase",
        "average",
        "neither",
        "step",
        "easy",
        "practice",
        "working",
        "physicist",
        "spend",
        "time",
        "calculation",
        "however",
        "difficulty",
        "need",
        "occupy",
        "u",
        "interested",
        "conceptual",
        "issue",
        "underlying",
        "recipe",
        "definition",
        "probability",
        "density",
        "varrho",
        "stationary",
        "change",
        "time",
        "given",
        "observable",
        "quantity",
        "associated",
        "phase",
        "average",
        "equilibrium",
        "defined",
        "term",
        "constancy",
        "macroscopic",
        "parameter",
        "characterising",
        "system",
        "natural",
        "regard",
        "stationarity",
        "distribution",
        "necessary",
        "condition",
        "equilibrium",
        "stationary",
        "distribution",
        "yield",
        "constant",
        "average",
        "reason",
        "gibbs",
        "refers",
        "stationarity",
        "condition",
        "statistical",
        "equilibrium",
        "among",
        "stationary",
        "distribution",
        "satisfying",
        "requirement",
        "gibbsian",
        "maximum",
        "entropy",
        "principle",
        "play",
        "special",
        "role",
        "gibbs",
        "entropy",
        "sometimes",
        "called",
        "ensemble",
        "entropy",
        "defined",
        "s_g",
        "varrho",
        "k_bint",
        "varrholog",
        "varrho",
        "dmu",
        "gibbsian",
        "maximum",
        "entropy",
        "principle",
        "requires",
        "s_g",
        "varrho",
        "maximal",
        "given",
        "constraint",
        "imposed",
        "system",
        "last",
        "clause",
        "essential",
        "different",
        "constraint",
        "single",
        "different",
        "distribution",
        "common",
        "choice",
        "keep",
        "energy",
        "particle",
        "number",
        "system",
        "fixed",
        "one",
        "prove",
        "circumstance",
        "s_g",
        "varrho",
        "maximal",
        "socalled",
        "microcanonical",
        "distribution",
        "microcanonical",
        "ensemble",
        "choose",
        "hold",
        "number",
        "particle",
        "constant",
        "allowing",
        "energy",
        "fluctuation",
        "around",
        "given",
        "mean",
        "value",
        "obtain",
        "socalled",
        "canonical",
        "distribution",
        "also",
        "allow",
        "particle",
        "number",
        "fluctuate",
        "around",
        "given",
        "mean",
        "value",
        "find",
        "socalled",
        "grandcanonical",
        "distribution",
        "formalism",
        "enormously",
        "successful",
        "correct",
        "prediction",
        "derived",
        "vast",
        "class",
        "system",
        "success",
        "formalism",
        "rather",
        "puzzling",
        "first",
        "obvious",
        "question",
        "concern",
        "relation",
        "system",
        "ensemble",
        "probability",
        "distribution",
        "gibbs",
        "approach",
        "defined",
        "ensemble",
        "formalism",
        "provides",
        "ensemble",
        "average",
        "equilibrium",
        "regarded",
        "property",
        "ensemble",
        "really",
        "interested",
        "behaviour",
        "single",
        "system",
        "could",
        "property",
        "ensemblea",
        "fictional",
        "entity",
        "consisting",
        "infinitely",
        "many",
        "mental",
        "copy",
        "real",
        "systemtell",
        "u",
        "one",
        "real",
        "system",
        "laboratory",
        "table",
        "specifically",
        "average",
        "ensemble",
        "coincide",
        "value",
        "found",
        "measurement",
        "performed",
        "actual",
        "physical",
        "system",
        "equilibrium",
        "obvious",
        "reason",
        "turn",
        "ergodicity",
        "play",
        "central",
        "role",
        "answering",
        "question",
        "common",
        "textbook",
        "wisdom",
        "justifies",
        "use",
        "phase",
        "average",
        "follows",
        "seen",
        "gibbs",
        "formalism",
        "associate",
        "physical",
        "quantity",
        "function",
        "system",
        "phase",
        "space",
        "making",
        "experiment",
        "measuring",
        "one",
        "quantity",
        "take",
        "time",
        "assumed",
        "measurement",
        "device",
        "register",
        "instantaneous",
        "value",
        "function",
        "question",
        "rather",
        "time",
        "average",
        "duration",
        "measurement",
        "hence",
        "time",
        "average",
        "empirically",
        "accessible",
        "argument",
        "continues",
        "although",
        "measurement",
        "take",
        "amount",
        "time",
        "short",
        "human",
        "standard",
        "long",
        "compared",
        "microscopic",
        "time",
        "scale",
        "typical",
        "molecular",
        "process",
        "take",
        "place",
        "reason",
        "assumed",
        "measured",
        "finite",
        "time",
        "average",
        "approximately",
        "equal",
        "infinite",
        "time",
        "average",
        "measured",
        "function",
        "assume",
        "system",
        "ergodic",
        "time",
        "average",
        "equal",
        "phase",
        "average",
        "latter",
        "easily",
        "obtained",
        "formalism",
        "hence",
        "found",
        "soughtafter",
        "connection",
        "gibbs",
        "formalism",
        "provides",
        "phase",
        "average",
        "due",
        "ergodicity",
        "equal",
        "infinite",
        "time",
        "average",
        "good",
        "approximation",
        "equal",
        "finite",
        "time",
        "average",
        "obtained",
        "measurement",
        "argument",
        "problematic",
        "least",
        "two",
        "reason",
        "first",
        "fact",
        "measurement",
        "take",
        "time",
        "follow",
        "actually",
        "measured",
        "time",
        "average",
        "instance",
        "could",
        "case",
        "value",
        "provided",
        "u",
        "measurement",
        "device",
        "simply",
        "value",
        "assumed",
        "last",
        "moment",
        "measurement",
        "irrespective",
        "previous",
        "value",
        "eg",
        "simply",
        "last",
        "pointer",
        "reading",
        "registered",
        "would",
        "need",
        "argument",
        "conclusion",
        "measurement",
        "indeed",
        "produce",
        "time",
        "average",
        "second",
        "even",
        "take",
        "granted",
        "measurement",
        "produce",
        "finite",
        "time",
        "average",
        "equating",
        "average",
        "infinite",
        "time",
        "average",
        "problematic",
        "even",
        "duration",
        "measurement",
        "long",
        "experimental",
        "standard",
        "need",
        "case",
        "finite",
        "infinite",
        "average",
        "may",
        "assume",
        "different",
        "value",
        "say",
        "necessarily",
        "different",
        "could",
        "coincide",
        "whether",
        "empirical",
        "question",
        "depends",
        "specific",
        "system",
        "investigation",
        "care",
        "needed",
        "replacing",
        "finite",
        "infinite",
        "time",
        "average",
        "one",
        "identify",
        "without",
        "argument",
        "malament",
        "zabell",
        "respond",
        "challenge",
        "suggesting",
        "way",
        "explaining",
        "success",
        "equilibrium",
        "theory",
        "still",
        "invokes",
        "ergodicity",
        "avoids",
        "appeal",
        "time",
        "average",
        "solves",
        "mentioned",
        "problem",
        "suffers",
        "difficulty",
        "many",
        "system",
        "successfully",
        "dealt",
        "formalism",
        "sm",
        "ergodic",
        "circumvent",
        "difficulty",
        "vranas",
        "suggested",
        "replacing",
        "ergodicity",
        "call",
        "varepsilon",
        "ergodicity",
        "intuitively",
        "system",
        "varepsilon",
        "ergodic",
        "ergodic",
        "entire",
        "phase",
        "space",
        "large",
        "part",
        "part",
        "ergodic",
        "measure",
        "varepsilon",
        "varepsilon",
        "small",
        "leading",
        "idea",
        "behind",
        "approach",
        "challenge",
        "commonly",
        "held",
        "belief",
        "even",
        "system",
        "little",
        "bit",
        "nonergodic",
        "behaves",
        "completely",
        "unergodic",
        "way",
        "vranas",
        "point",
        "middle",
        "ground",
        "argues",
        "middle",
        "ground",
        "actually",
        "provides",
        "u",
        "everything",
        "need",
        "promising",
        "proposal",
        "face",
        "three",
        "challenge",
        "first",
        "need",
        "shown",
        "relevant",
        "system",
        "really",
        "varepsilon",
        "ergodicity",
        "second",
        "argument",
        "far",
        "developed",
        "microcanonical",
        "ensemble",
        "one",
        "would",
        "like",
        "know",
        "whether",
        "work",
        "canonical",
        "grandcanonical",
        "ensemble",
        "third",
        "still",
        "based",
        "assumption",
        "equilibrium",
        "characterised",
        "stationary",
        "distribution",
        "see",
        "obstacle",
        "come",
        "formulating",
        "workable",
        "gibbsian",
        "nonequilibrium",
        "theory",
        "second",
        "response",
        "begin",
        "khinchin",
        "work",
        "khinchin",
        "pointed",
        "problem",
        "ergodic",
        "programme",
        "due",
        "fact",
        "focus",
        "general",
        "class",
        "system",
        "rather",
        "studying",
        "dynamical",
        "system",
        "general",
        "level",
        "focus",
        "case",
        "relevant",
        "statistical",
        "mechanic",
        "involves",
        "two",
        "restriction",
        "first",
        "consider",
        "system",
        "large",
        "number",
        "degree",
        "freedom",
        "second",
        "need",
        "take",
        "account",
        "special",
        "class",
        "phase",
        "function",
        "socalled",
        "sum",
        "function",
        "function",
        "sum",
        "oneparticle",
        "function",
        "ie",
        "function",
        "take",
        "account",
        "position",
        "momentum",
        "one",
        "particle",
        "assumption",
        "khinchin",
        "proved",
        "n",
        "becomes",
        "larger",
        "measure",
        "region",
        "energy",
        "hypersurface",
        "time",
        "space",
        "mean",
        "differ",
        "small",
        "amount",
        "tends",
        "towards",
        "zero",
        "roughly",
        "speaking",
        "result",
        "say",
        "large",
        "n",
        "system",
        "behaves",
        "practical",
        "purpose",
        "ergodic",
        "problem",
        "result",
        "valid",
        "sum",
        "function",
        "particular",
        "energy",
        "function",
        "system",
        "sum",
        "function",
        "case",
        "particle",
        "interact",
        "question",
        "result",
        "generalised",
        "realistic",
        "case",
        "problem",
        "stand",
        "starting",
        "point",
        "research",
        "programme",
        "known",
        "thermodynamic",
        "limit",
        "championed",
        "among",
        "others",
        "lanford",
        "mazur",
        "ruelle",
        "van",
        "der",
        "linden",
        "see",
        "van",
        "lith",
        "survey",
        "leading",
        "question",
        "whether",
        "one",
        "still",
        "prove",
        "khinchinlike",
        "result",
        "case",
        "energy",
        "function",
        "interaction",
        "term",
        "result",
        "kind",
        "proven",
        "limit",
        "n",
        "rightarrow",
        "infty",
        "also",
        "volume",
        "v",
        "system",
        "tends",
        "towards",
        "infinity",
        "way",
        "numberdensity",
        "nv",
        "remains",
        "constant",
        "far",
        "dealt",
        "equilibrium",
        "thing",
        "get",
        "worse",
        "turn",
        "nonequilibrium",
        "main",
        "problem",
        "consequence",
        "formalism",
        "gibbs",
        "entropy",
        "constant",
        "precludes",
        "characterisation",
        "approach",
        "equilibrium",
        "term",
        "increasing",
        "gibbs",
        "entropy",
        "one",
        "would",
        "expect",
        "treat",
        "gibbs",
        "entropy",
        "sm",
        "counterpart",
        "thermodynamic",
        "entropy",
        "standard",
        "way",
        "around",
        "problem",
        "coarsegrain",
        "phase",
        "space",
        "define",
        "socalled",
        "coarse",
        "grained",
        "gibbs",
        "entropy",
        "put",
        "simply",
        "coursegraining",
        "phase",
        "space",
        "amount",
        "putting",
        "grid",
        "phase",
        "space",
        "declare",
        "point",
        "within",
        "one",
        "cell",
        "grid",
        "indistinguishable",
        "procedure",
        "turn",
        "continuous",
        "phase",
        "space",
        "discrete",
        "collection",
        "cell",
        "state",
        "system",
        "specified",
        "saying",
        "cell",
        "system",
        "state",
        "define",
        "gibbs",
        "entropy",
        "grid",
        "turn",
        "purely",
        "mathematical",
        "reason",
        "entropy",
        "longer",
        "constant",
        "actually",
        "increase",
        "decrease",
        "one",
        "assumes",
        "system",
        "mixing",
        "follows",
        "socalled",
        "convergence",
        "theorem",
        "ergodic",
        "theory",
        "coarsegrained",
        "gibbs",
        "entropy",
        "approach",
        "maximum",
        "however",
        "solution",
        "fraught",
        "controversy",
        "two",
        "main",
        "bone",
        "contention",
        "justification",
        "coarsegraining",
        "assumption",
        "system",
        "mixing",
        "sum",
        "ergodicity",
        "play",
        "central",
        "role",
        "many",
        "attempt",
        "justify",
        "posit",
        "sm",
        "even",
        "simplistic",
        "use",
        "ergodicity",
        "eventually",
        "unsuccessful",
        "somewhat",
        "modified",
        "notion",
        "prove",
        "fruitful",
        "analysis",
        "problem",
        "search",
        "better",
        "solution"
    ]
}