{
    "main_text": "The Ergodic Hierarchy\n3. The Ergodic Hierarchy\n\nIt turns out that ergodicity is only the bottom level of an entire\nhierarchy of dynamical properties. This hierarchy is called the\nergodic hierarchy, and the study of this hierarchy is the\ncore task of a mathematical discipline called ergodic theory.\nThis choice of terminology is somewhat misleading, since ergodicity is\nonly the bottom level of this hierarchy and so EH contains much more\nthan ergodicity and the scope of ergodic theory stretches far beyond\nergodicty. Ergodic theory (thus understood) is part of dynamical\nsystems theory, which studies a wider class of dynamical systems\nthan ergodic theory. \n\nEH is a nested classification of dynamical properties. The hierarchy\nis typically represented as consisting of the following five\nlevels:\n\nBernoulli \\(\\subset\\) Kolmogorov \\(\\subset\\) Strong Mixing \\(\\subset\\)\nWeak Mixing \\(\\subset\\) Ergodic \n\nThe diagram is intended to indicate that all Bernoulli systems are\nKolmogorov systems, all Kolmogorov systems are strong mixing systems,\nand so on. Hence all systems in EH are ergodic. However, the converse\nrelations do not hold: not all ergodic systems are weak mixing, and so\non. In what follows a system that is ergodic but not weak mixing is\nreferred to as merely ergodic and similarly for the next\nthree\n levels.[8]\n\n\n\n\n\n\n\n\n\n \n\n(4a)\n(4b) \n\n\nFigure 4: Mixing\n\n\nMixing can be intuitively explained by the following example, first\nused by Gibbs in introducing the concept of mixing. Begin with a glass\nof water, then add a shot of scotch; this is illustrated in Fig. 4a.\nThe volume \\(C\\) of the cocktail (scotch + water) is \\(\\mu(C)\\) and\nthe volume of scotch that was added to the water is \\(\\mu(S)\\), so\nthat in \\(C\\)the concentration of scotch is \\(\\mu(S)/\\mu(C)\\).\n\nNow stir. Mathematically, stirring is represented by the time\nevolution \\(T\\), meaning that \\(T(S)\\) is the region occupied by the\nscotch after one unit of mixing time. Intuitively we say that the\ncocktail is thoroughly mixed, if the concentration of scotch equals\n\\(\\mu(S) / \\mu(C)\\) not only with respect to the whole volume\nof fluid, but with respect to any region \\(V\\) in that\nvolume. Hence, the drink is thoroughly mixed at time \\(n\\) if\n\n\\[\n\\frac{\\mu(T_n S \\cap V)}{\\mu(V)} = \\frac{\\mu(S)}{\\mu(C)}\n\\]\n\n\nfor any volume \\(V\\) (of non-zero measure). Now assume that the volume\nof the cocktail is one unit: \\(\\mu(C) = 1\\) (which we can do without\nloss of generality since there is always a unit system in which the\nvolume of the glass is one). Then the cocktail is thoroughly mixed\niff \n\n\\[\n\\frac{\\mu(T_n S \\cap V)}{\\mu(V)} = \\mu(S)\n\\]\n\n\nfor any region \\(V\\) (of non-zero measure). But how large must \\(n\\)\nbe before the stirring ends with the cocktail well stirred? We now\ndon’t require that the drink must be thoroughly mixed at any finite\ntime, but only that it approaches a state of being thoroughly mixed as\ntime tends towards infinity: \n\n\\[\n\\lim_{n \\rightarrow \\infty} \\frac{\\mu(T_n S \\cap V)}{\\mu(V)} = \\mu(S)\n\\]\n\n\nfor any region \\(V\\) (of non-zero measure). If we now associate the\nglass with the phase space \\(X\\) and replace the scotch \\(S\\) and the\nvolume \\(V\\) with two arbitrary subsets \\(A\\) and \\(B\\) of \\(X\\), then\nwe get the general definition of what is called strong mixing\n(often also referred to just as ‘mixing’): a system is\nstrong mixing iff \n\n\\[\\tag{S-M}\n\\lim_{n \\rightarrow \\infty} \\mu(T_n B \\cap A) = \\mu(B) \\mu(A)\n\\]\n\n\nfor all subsets \\(A\\) and \\(B\\) of \\(X.\\) This requirement for mixing\ncan be relaxed a bit by allowing for\n fluctuations.[9]\n That is, instead of requiring that the cocktail reach a uniform state\nof being mixed, we now only require that it be mixed on average. In\nother words, we allow that bubbles of either scotch or water may crop\nup every now and then, but they do so in a way that these fluctuations\naverage out as time tends towards infinity. This translates into\nmathematics in a straightforward way. The deviation from the ideally\nmixed state at some time \\(n\\) is \\(\\mu(T_n B \\cap A) -\n\\mu(B)\\mu(A)\\). The requirement that the average of these deviations\nvanishes inspires the notion of weak mixing. A system is weak\nmixing iff \n\n\\[\\tag{W-M}\n\\lim_{n \\rightarrow \\infty} \\frac{1}{n} \\sum_{k=0}^{n-1}\n  \\lvert \\mu(T_n B \\cap A) - \\mu(B) \\mu(A) \\rvert = 0\n\\]\n\n\nfor all subsets \\(A\\) and \\(B\\) of \\(X\\). The vertical strokes denote\nthe so-called absolute value; for instance: \\(\\lvert 5 \\rvert = \\lvert\n-5 \\rvert = 5\\). One can prove that there is a strict implication\nrelation between the three dynamical properties we have introduced so\nfar: strong mixing implies weak mixing, but not vice versa; and weak\nmixing implies ergodicity, but not vice versa. Hence, strong mixing is\nstronger condition than weak mixing, and weak mixing is stronger\ncondition than ergodicity.\n\nThe next higher level in EH are K-systems. Unlike in the cases of\nergodic and mixing systems, there is unfortunately no intuitive way of\nexplaining the standard definition of such systems, and the definition\nis such that one cannot read off from it the characteristics of\nK-systems (we state this definition in the\n Appendix,\n Section C). The least unintuitive way to present K-systems is via a\ntheorem due to Cornfeld et al (1982, 283), who prove that a\ndynamical system is a K-system iff it is K-mixing. A system\nis K-mixing iff for any subsets \\(A_0, A_1 , \\ldots ,A_r\\) of \\(X\\)\n(where \\(r\\) is a natural number of your choice) the following\ncondition holds: \n\n\\[\\tag{K-M}\n\\lim_{n \\rightarrow \\infty} \\sup_{B \\in \\sigma(n,r)}\n \\lvert \\mu(T_n B \\cap A) - \\mu(B) \\mu(A) \\rvert = 0\n\\]\n\n\nwhere \\(\\sigma(n, r)\\) is the minimal \\(\\sigma\\)-algebra generated by\nthe set \n\n\\[\n\\{T_k A_j \\mid k \\ge n; j = 1, \\ldots ,r\\}.\n\\]\n\n\nIt is far from obvious what this so-called sigma algebra is and hence\nthe content of this condition is not immediately transparent. We will\ncome back to this issue in Section 5 where we provide an intuitive\nreading of this condition. What matters for the time being is its\nsimilarity to the mixing condition. Strong mixing is, trivially,\nequivalent to \n\n\\[\n\\lim_{n \\rightarrow \\infty} \\mu(T_n B\\cap A) - \\mu(B)\\mu(A) = 0\n\\]\n\n\nSo we see that K-mixing adds something to strong mixing.\n\nIn passing we would like to mention another important property of\nK-systems: one can prove that K-systems have positive\nKolmogorov-Sinai entropy (KS-entropy); for details see the\n Appendix,\nSection C. The KS-entropy itself does not have an intuitive\ninterpretation, but it relates to three other concepts of dynamical\nsystems theory in an interesting way, and these do have intuitive\ninterpretations. First, Lyapunov exponents are a measure for\nhow fast two originally nearby trajectories diverge on average, and\nthey are often used in chaos theory to characterise the chaotic nature\nof the dynamics of a system. Under certain circumstances (essentially,\nthe system has to be differentiable and ergodic) one can prove that a\ndynamical system has a positive KS-entropy if and only if it has\npositive Lyapounov exponents (Lichtenberg and Liebermann 1992, 304).\nIn such a system initially arbitrarily close trajectories diverge\nexponentially. This result is known as Pessin’s\ntheorem. Second, the algorithmic complexity of a\nsequence is the length of the shortest computer programme needed to\nreproduce the sequence. Some sequences are simple; e.g. a string of a\nmillion ‘1’ is simple: the programme needed to reproduce\nit basically is ‘write ‘1’ a million times’,\nwhich is very short. Others are complex: there is no pattern in the\nsequence 5%8£yu@*mS!}<74^F that one could exploit, and so a\nprogramme reproducing that sequence essentially reads ‘write\n5%8£yu@*mS!}<74^F’, which is similar in length to the\nsequence itself. In the discrete case a trajectory can be represented\nas a sequence of symbols which corresponds to the states of the system\nalong this trajectory.  It is then the case that if a system is a\nK-system, then its KS-entropy equals the algorithmic complexity of\nalmost all its trajectories (Brudno 1978). This is now known\nas Brudno’s theorem (Alekseev and Yakobson\n1981). Third, the Shannon entropy is a common measure for the\nuncertainty of a future outcome: the higher the entropy the more\nuncertain we are about what is going to happen. One can prove that,\ngiven certain plausible assumptions, the KS-entropy is equivalent to a\ngeneralised version of the Shannon entropy, and can hence be regarded\nas a measure for the uncertainty of future events given past events\n(Frigg 2004).\n\nBernoulli systems mark the highest level in EH. In order to define\nBernoulli systems we first have to introduce the notion of a partition\nof \\(X\\) (sometimes also called the ‘coarse graining of\n\\(X\\)’). A partition of X is a division of \\(X\\) into\ndifferent parts (the so-called ‘atoms of the partition’)\nso that these parts don’t overlap and jointly cover \\(X\\) (i.e.,\nthey are mutually exclusive and jointly exhaustive). For instance, in\nFigure 1 there is a partition of the phase space that has two atoms\n(the left and the right part). More formally, \\(\\alpha =\n\\{\\alpha_1,\\ldots , \\alpha_n\\}\\) is a partition of \\(X\\) (and the\n\\(\\alpha_i\\) its atoms) iff (i) the intersection of any two atoms of\nthe partition is the empty set, and (ii) the union of all atoms is\n\\(X\\) (up to measure zero). Furthermore it is important to notice that\na partition remains a partition under the dynamics of the system. That\nis, if \\(\\alpha\\) is a partition, then \\(T_n\\alpha = \\{T_n\\alpha_1\n,\\ldots ,T_n\\alpha_n\\}\\) is also a partition for all \\(n\\).\n\nThere are, of course, many different ways of partitioning a phase\nspace. In what follows we are going to study how different partitions\nrelate to each other. An important concept in this connection is\nindependence. Let \\(\\alpha\\) and \\(\\beta\\) be two partitions of \\(X\\).\nBy definition, these partitions are independent iff\n\\(\\mu(\\alpha_i \\cap \\beta_j) = \\mu(\\alpha_i)\\mu(\\beta_j)\\) for all\natoms \\(\\alpha_i\\) of \\(\\alpha\\) and all atoms \\(\\beta_j\\) of\n\\(\\beta\\). We will explain the intuitive meaning of this definition\n(and justify calling it ‘independence’) in Section 4; for\nthe time being we just use it as a formal definition.\n\nWith these notions in hand we can now define a Bernoulli\ntransformation: a transformation \\(T\\) is a Bernoulli\ntransformation iff there exists a partition \\(\\alpha\\) of \\(X\\) so\nthat the images of \\(\\alpha\\) under \\(T\\) at different instants of\ntime are independent; that is, the partitions \\(\\ldots ,T_{-1}\\alpha ,\nT_0 \\alpha , T_1 \\alpha ,\\ldots\\) are all\n independent.[10]\n In other words, \\(T\\) is a Bernoulli transformation iff\n\n\\[\\tag{B}\n\\mu(\\delta_i \\cap \\beta_j) = \\mu(\\delta_i)\\mu(\\beta_j)\n\\]\n\n\nfor all atoms \\(\\delta_i\\) of \\(T_k\\alpha\\) and all atoms \\(\\beta_j\\)\nof \\(T_l\\alpha\\) for all \\(k \\ne l\\). We then refer to \\(\\alpha\\) as\nthe Bernoulli partition, and we call a dynamical system \\([X,\n\\mu , T]\\) a Bernoulli system if \\(T\\) is a Bernoulli\nautomorphism, i.e., a Bernoulli transformation mapping \\(X\\) onto\nitself.\n\nLet us illustrate this with a well-known example, the\nbaker’s transformation (so named because of its\nsimilarity to the kneading of dough). This transformation maps the\nunit square onto itself. Using standard Cartesian coordinates the\ntransformation can be written as follows: \n\n\\[\\begin{align} T(x, y) &= (2x, \\frac{y}{2}) \\text{ for } 0 \\le x\n\\lt \\frac{1}{2}, \\text{ and} \\\\ T(x, y) &= (2x-1, \\frac{y}{2} +\n\\frac{1}{2}) \\text{ for } \\frac{1}{2} \\le x \\le 1 \\end{align}\\]\n\n\nIn words, for all points \\((x, y)\\) in the unit square that have an\n\\(x\\)-coordinate smaller than \\(1/2\\), the transformation \\(T\\)\ndoubles the value of \\(x\\) and halves the value of \\(y\\). For all the\npoints \\((x, y)\\) that have an \\(x\\)-coordinate greater or equal to\n\\(1/2\\), \\(T\\) transforms \\(x\\) in to \\(2x-1\\) and \\(y\\) into \\(y/2 +\n1/2\\). This is illustrated in Fig. 5a.\n\n\n\nFigure 5a: The Baker’s\ntransformation\n\n\nNow regard the two areas shown in the left-hand part of the above\nfigure as the two atoms of a partition \\(\\alpha = \\{\\alpha_1\n,\\alpha_2\\}\\). It is then easy to see that \\(\\alpha\\) and T\\(\\alpha\\)\nare independent: \\(\\mu(\\alpha_1 \\cap T\\alpha_2) =\n\\mu(\\alpha_1)\\mu(T\\alpha_2)\\), and similarly for all other atoms of\n\\(\\alpha\\) and \\(T\\alpha\\). This is illustrated in Figure 5b.\n\n\n\nFigure 5b: The independence of\n\\(\\alpha\\) and \\(T\\alpha\\).\n\n\nOne can prove that independence holds for all other iterates of\n\\(\\alpha\\) as well. So the baker’s transformation together with\nthe partition \\(\\alpha\\) is a Bernoulli transformation.\n\nIn the literature Bernoulli systems are often introduced using\nso-called shift maps (or Bernoulli shifts). We here\nbriefly indicate how shift maps are related to Bernoulli systems with\nthe example of the baker’s transformation; for a more general\ndiscussion see the\n Appendix,\n Section D. Choose a point in the unit square and write its \\(x\\) and\n\\(y\\) coordinates as binary numbers: \\(x = 0.a_1 a_2 a_3\\ldots\\) and\n\\(y = 0.b_1 b_2 b_3\\ldots\\), where all the \\(a_i\\) and \\(b_i\\) are\neither 0 or 1. Now put both strings together back to back with a dot\nin the middle to form one infinite string: \\(S= \\ldots b_3 b_2 b_1\n.a_1 a_2 a_3\\ldots\\), which may represent the state of the system just\nas a ‘standard’ two-dimensional vector does. Some\nstraightforward algebra then shows that \n\n\\[ T(0.a_1 a_2 a_3\\ldots , 0.b_1 b_2 b_3\\ldots) = (0.a_2 a_3 a_4\\ldots\n, 0.a_1 b_1 b_2 b_3 b_4\\ldots).  \\]\n\n\nFrom this we see that in our ‘one string’ representation\nof the point the operation of \\(T\\) amounts to shifting the dot one\nposition to the right: \\(TS= \\ldots b_3 b_2 b_1 a_1 .a_2 a_3\\ldots\\)\nHence, the baker’s transformation is equivalent to a shift on an\ninfinite string of zeros and\n ones.[11]\n\n\nThere are two further notions that are crucial to the theory of\nBernoulli systems, the property of being weak Bernoulli and\nvery weak Bernoulli. These properties play a crucial role in\nshowing that certain transformations are in fact Bernoulli. The\nbaker’s transformation is one of the few examples that have a\ngeometrically simple Bernoulli partition, and so one often cannot\nprove directly that a system is a Bernoulli system. One then shows\nthat a certain geometrically simple partition is weak Bernoulli and\nuses a theorem due to Ornstein to the effect that if a system is weak\nBernoulli then there exists a Bernoulli partition for that system. The\nmathematics of these notions and the associated proofs of equivalence\nare intricate and a presentation of them is beyond the scope of this\nentry. The interested reader is referred to Ornstein (1974) or Shields\n(1973).\n",
    "section_title": "3. The Ergodic Hierarchy",
    "entry_title": "The Ergodic Hierarchy",
    "hierarchy_title": "The Ergodic Hierarchy || The Ergodic Hierarchy",
    "tokenized_text": [
        "ergodic",
        "hierarchy",
        "ergodic",
        "hierarchy",
        "turn",
        "ergodicity",
        "bottom",
        "level",
        "entire",
        "hierarchy",
        "dynamical",
        "property",
        "hierarchy",
        "called",
        "ergodic",
        "hierarchy",
        "study",
        "hierarchy",
        "core",
        "task",
        "mathematical",
        "discipline",
        "called",
        "ergodic",
        "theory",
        "choice",
        "terminology",
        "somewhat",
        "misleading",
        "since",
        "ergodicity",
        "bottom",
        "level",
        "hierarchy",
        "eh",
        "contains",
        "much",
        "ergodicity",
        "scope",
        "ergodic",
        "theory",
        "stretch",
        "far",
        "beyond",
        "ergodicty",
        "ergodic",
        "theory",
        "thus",
        "understood",
        "part",
        "dynamical",
        "system",
        "theory",
        "study",
        "wider",
        "class",
        "dynamical",
        "system",
        "ergodic",
        "theory",
        "eh",
        "nested",
        "classification",
        "dynamical",
        "property",
        "hierarchy",
        "typically",
        "represented",
        "consisting",
        "following",
        "five",
        "level",
        "bernoulli",
        "subset",
        "kolmogorov",
        "subset",
        "strong",
        "mixing",
        "subset",
        "weak",
        "mixing",
        "subset",
        "ergodic",
        "diagram",
        "intended",
        "indicate",
        "bernoulli",
        "system",
        "kolmogorov",
        "system",
        "kolmogorov",
        "system",
        "strong",
        "mixing",
        "system",
        "hence",
        "system",
        "eh",
        "ergodic",
        "however",
        "converse",
        "relation",
        "hold",
        "ergodic",
        "system",
        "weak",
        "mixing",
        "follows",
        "system",
        "ergodic",
        "weak",
        "mixing",
        "referred",
        "merely",
        "ergodic",
        "similarly",
        "next",
        "three",
        "level",
        "a",
        "b",
        "figure",
        "mixing",
        "mixing",
        "intuitively",
        "explained",
        "following",
        "example",
        "first",
        "used",
        "gibbs",
        "introducing",
        "concept",
        "mixing",
        "begin",
        "glass",
        "water",
        "add",
        "shot",
        "scotch",
        "illustrated",
        "fig",
        "a",
        "volume",
        "c",
        "cocktail",
        "scotch",
        "water",
        "mu",
        "c",
        "volume",
        "scotch",
        "added",
        "water",
        "mu",
        "c",
        "concentration",
        "scotch",
        "mu",
        "mu",
        "c",
        "stir",
        "mathematically",
        "stirring",
        "represented",
        "time",
        "evolution",
        "t",
        "meaning",
        "region",
        "occupied",
        "scotch",
        "one",
        "unit",
        "mixing",
        "time",
        "intuitively",
        "say",
        "cocktail",
        "thoroughly",
        "mixed",
        "concentration",
        "scotch",
        "equal",
        "mu",
        "mu",
        "c",
        "respect",
        "whole",
        "volume",
        "fluid",
        "respect",
        "region",
        "v",
        "volume",
        "hence",
        "drink",
        "thoroughly",
        "mixed",
        "time",
        "n",
        "frac",
        "mu",
        "t_n",
        "cap",
        "v",
        "mu",
        "v",
        "frac",
        "mu",
        "mu",
        "c",
        "volume",
        "v",
        "nonzero",
        "measure",
        "assume",
        "volume",
        "cocktail",
        "one",
        "unit",
        "mu",
        "c",
        "without",
        "loss",
        "generality",
        "since",
        "always",
        "unit",
        "system",
        "volume",
        "glass",
        "one",
        "cocktail",
        "thoroughly",
        "mixed",
        "iff",
        "frac",
        "mu",
        "t_n",
        "cap",
        "v",
        "mu",
        "v",
        "mu",
        "region",
        "v",
        "nonzero",
        "measure",
        "large",
        "must",
        "n",
        "stirring",
        "end",
        "cocktail",
        "well",
        "stirred",
        "require",
        "drink",
        "must",
        "thoroughly",
        "mixed",
        "finite",
        "time",
        "approach",
        "state",
        "thoroughly",
        "mixed",
        "time",
        "tends",
        "towards",
        "infinity",
        "lim_",
        "n",
        "rightarrow",
        "infty",
        "frac",
        "mu",
        "t_n",
        "cap",
        "v",
        "mu",
        "v",
        "mu",
        "region",
        "v",
        "nonzero",
        "measure",
        "associate",
        "glass",
        "phase",
        "space",
        "x",
        "replace",
        "scotch",
        "s",
        "volume",
        "v",
        "two",
        "arbitrary",
        "subset",
        "a",
        "b",
        "x",
        "get",
        "general",
        "definition",
        "called",
        "strong",
        "mixing",
        "often",
        "also",
        "referred",
        "mixing",
        "system",
        "strong",
        "mixing",
        "iff",
        "tag",
        "sm",
        "lim_",
        "n",
        "rightarrow",
        "infty",
        "mu",
        "t_n",
        "b",
        "cap",
        "mu",
        "b",
        "mu",
        "subset",
        "a",
        "b",
        "x",
        "requirement",
        "mixing",
        "relaxed",
        "bit",
        "allowing",
        "fluctuation",
        "instead",
        "requiring",
        "cocktail",
        "reach",
        "uniform",
        "state",
        "mixed",
        "require",
        "mixed",
        "average",
        "word",
        "allow",
        "bubble",
        "either",
        "scotch",
        "water",
        "may",
        "crop",
        "every",
        "way",
        "fluctuation",
        "average",
        "time",
        "tends",
        "towards",
        "infinity",
        "translates",
        "mathematics",
        "straightforward",
        "way",
        "deviation",
        "ideally",
        "mixed",
        "state",
        "time",
        "n",
        "mu",
        "t_n",
        "b",
        "cap",
        "mu",
        "b",
        "mu",
        "requirement",
        "average",
        "deviation",
        "vanishes",
        "inspires",
        "notion",
        "weak",
        "mixing",
        "system",
        "weak",
        "mixing",
        "iff",
        "tag",
        "wm",
        "lim_",
        "n",
        "rightarrow",
        "infty",
        "frac",
        "n",
        "sum_",
        "k",
        "n",
        "lvert",
        "mu",
        "t_n",
        "b",
        "cap",
        "mu",
        "b",
        "mu",
        "rvert",
        "subset",
        "a",
        "b",
        "x",
        "vertical",
        "stroke",
        "denote",
        "socalled",
        "absolute",
        "value",
        "instance",
        "lvert",
        "rvert",
        "lvert",
        "rvert",
        "one",
        "prove",
        "strict",
        "implication",
        "relation",
        "three",
        "dynamical",
        "property",
        "introduced",
        "far",
        "strong",
        "mixing",
        "implies",
        "weak",
        "mixing",
        "vice",
        "versa",
        "weak",
        "mixing",
        "implies",
        "ergodicity",
        "vice",
        "versa",
        "hence",
        "strong",
        "mixing",
        "stronger",
        "condition",
        "weak",
        "mixing",
        "weak",
        "mixing",
        "stronger",
        "condition",
        "ergodicity",
        "next",
        "higher",
        "level",
        "eh",
        "ksystems",
        "unlike",
        "case",
        "ergodic",
        "mixing",
        "system",
        "unfortunately",
        "intuitive",
        "way",
        "explaining",
        "standard",
        "definition",
        "system",
        "definition",
        "one",
        "read",
        "characteristic",
        "ksystems",
        "state",
        "definition",
        "appendix",
        "section",
        "c",
        "least",
        "unintuitive",
        "way",
        "present",
        "ksystems",
        "via",
        "theorem",
        "due",
        "cornfeld",
        "et",
        "al",
        "prove",
        "dynamical",
        "system",
        "ksystem",
        "iff",
        "kmixing",
        "system",
        "kmixing",
        "iff",
        "subset",
        "a_",
        "a_",
        "ldots",
        "a_r",
        "x",
        "r",
        "natural",
        "number",
        "choice",
        "following",
        "condition",
        "hold",
        "tag",
        "km",
        "lim_",
        "n",
        "rightarrow",
        "infty",
        "sup_",
        "b",
        "in",
        "sigma",
        "n",
        "r",
        "lvert",
        "mu",
        "t_n",
        "b",
        "cap",
        "mu",
        "b",
        "mu",
        "rvert",
        "sigma",
        "n",
        "r",
        "minimal",
        "sigma",
        "algebra",
        "generated",
        "set",
        "t_k",
        "a_j",
        "mid",
        "k",
        "ge",
        "n",
        "j",
        "ldots",
        "r",
        "far",
        "obvious",
        "socalled",
        "sigma",
        "algebra",
        "hence",
        "content",
        "condition",
        "immediately",
        "transparent",
        "come",
        "back",
        "issue",
        "section",
        "provide",
        "intuitive",
        "reading",
        "condition",
        "matter",
        "time",
        "similarity",
        "mixing",
        "condition",
        "strong",
        "mixing",
        "trivially",
        "equivalent",
        "lim_",
        "n",
        "rightarrow",
        "infty",
        "mu",
        "t_n",
        "bcap",
        "mu",
        "b",
        "mu",
        "see",
        "kmixing",
        "add",
        "something",
        "strong",
        "mixing",
        "passing",
        "would",
        "like",
        "mention",
        "another",
        "important",
        "property",
        "ksystems",
        "one",
        "prove",
        "ksystems",
        "positive",
        "kolmogorovsinai",
        "entropy",
        "ksentropy",
        "detail",
        "see",
        "appendix",
        "section",
        "c",
        "ksentropy",
        "intuitive",
        "interpretation",
        "relates",
        "three",
        "concept",
        "dynamical",
        "system",
        "theory",
        "interesting",
        "way",
        "intuitive",
        "interpretation",
        "first",
        "lyapunov",
        "exponent",
        "measure",
        "fast",
        "two",
        "originally",
        "nearby",
        "trajectory",
        "diverge",
        "average",
        "often",
        "used",
        "chaos",
        "theory",
        "characterise",
        "chaotic",
        "nature",
        "dynamic",
        "system",
        "certain",
        "circumstance",
        "essentially",
        "system",
        "differentiable",
        "ergodic",
        "one",
        "prove",
        "dynamical",
        "system",
        "positive",
        "ksentropy",
        "positive",
        "lyapounov",
        "exponent",
        "lichtenberg",
        "liebermann",
        "system",
        "initially",
        "arbitrarily",
        "close",
        "trajectory",
        "diverge",
        "exponentially",
        "result",
        "known",
        "pessin",
        "theorem",
        "second",
        "algorithmic",
        "complexity",
        "sequence",
        "length",
        "shortest",
        "computer",
        "programme",
        "needed",
        "reproduce",
        "sequence",
        "sequence",
        "simple",
        "eg",
        "string",
        "million",
        "simple",
        "programme",
        "needed",
        "reproduce",
        "basically",
        "write",
        "million",
        "time",
        "short",
        "others",
        "complex",
        "pattern",
        "sequence",
        "yu",
        "m",
        "f",
        "one",
        "could",
        "exploit",
        "programme",
        "reproducing",
        "sequence",
        "essentially",
        "read",
        "write",
        "yu",
        "m",
        "f",
        "similar",
        "length",
        "sequence",
        "discrete",
        "case",
        "trajectory",
        "represented",
        "sequence",
        "symbol",
        "corresponds",
        "state",
        "system",
        "along",
        "trajectory",
        "case",
        "system",
        "ksystem",
        "ksentropy",
        "equal",
        "algorithmic",
        "complexity",
        "almost",
        "trajectory",
        "brudno",
        "known",
        "brudno",
        "theorem",
        "alekseev",
        "yakobson",
        "third",
        "shannon",
        "entropy",
        "common",
        "measure",
        "uncertainty",
        "future",
        "outcome",
        "higher",
        "entropy",
        "uncertain",
        "going",
        "happen",
        "one",
        "prove",
        "given",
        "certain",
        "plausible",
        "assumption",
        "ksentropy",
        "equivalent",
        "generalised",
        "version",
        "shannon",
        "entropy",
        "hence",
        "regarded",
        "measure",
        "uncertainty",
        "future",
        "event",
        "given",
        "past",
        "event",
        "frigg",
        "bernoulli",
        "system",
        "mark",
        "highest",
        "level",
        "eh",
        "order",
        "define",
        "bernoulli",
        "system",
        "first",
        "introduce",
        "notion",
        "partition",
        "x",
        "sometimes",
        "also",
        "called",
        "coarse",
        "graining",
        "x",
        "partition",
        "x",
        "division",
        "x",
        "different",
        "part",
        "socalled",
        "atom",
        "partition",
        "part",
        "overlap",
        "jointly",
        "cover",
        "x",
        "ie",
        "mutually",
        "exclusive",
        "jointly",
        "exhaustive",
        "instance",
        "figure",
        "partition",
        "phase",
        "space",
        "two",
        "atom",
        "left",
        "right",
        "part",
        "formally",
        "alpha",
        "alpha_",
        "ldots",
        "alpha_n",
        "partition",
        "x",
        "alpha_i",
        "atom",
        "iff",
        "intersection",
        "two",
        "atom",
        "partition",
        "empty",
        "set",
        "ii",
        "union",
        "atom",
        "x",
        "measure",
        "zero",
        "furthermore",
        "important",
        "notice",
        "partition",
        "remains",
        "partition",
        "dynamic",
        "system",
        "alpha",
        "partition",
        "t_nalpha",
        "t_nalpha_",
        "ldots",
        "t_nalpha_n",
        "also",
        "partition",
        "n",
        "course",
        "many",
        "different",
        "way",
        "partitioning",
        "phase",
        "space",
        "follows",
        "going",
        "study",
        "different",
        "partition",
        "relate",
        "important",
        "concept",
        "connection",
        "independence",
        "let",
        "alpha",
        "beta",
        "two",
        "partition",
        "x",
        "definition",
        "partition",
        "independent",
        "iff",
        "mu",
        "alpha_i",
        "cap",
        "beta_j",
        "mu",
        "alpha_i",
        "mu",
        "beta_j",
        "atom",
        "alpha_i",
        "alpha",
        "atom",
        "beta_j",
        "beta",
        "explain",
        "intuitive",
        "meaning",
        "definition",
        "justify",
        "calling",
        "independence",
        "section",
        "time",
        "use",
        "formal",
        "definition",
        "notion",
        "hand",
        "define",
        "bernoulli",
        "transformation",
        "transformation",
        "t",
        "bernoulli",
        "transformation",
        "iff",
        "exists",
        "partition",
        "alpha",
        "x",
        "image",
        "alpha",
        "t",
        "different",
        "instant",
        "time",
        "independent",
        "partition",
        "ldots",
        "t_",
        "alpha",
        "t_",
        "alpha",
        "t_",
        "alpha",
        "ldots",
        "independent",
        "word",
        "t",
        "bernoulli",
        "transformation",
        "iff",
        "tag",
        "b",
        "mu",
        "delta_i",
        "cap",
        "beta_j",
        "mu",
        "delta_i",
        "mu",
        "beta_j",
        "atom",
        "delta_i",
        "t_kalpha",
        "atom",
        "beta_j",
        "t_lalpha",
        "k",
        "ne",
        "l",
        "refer",
        "alpha",
        "bernoulli",
        "partition",
        "call",
        "dynamical",
        "system",
        "x",
        "mu",
        "bernoulli",
        "system",
        "t",
        "bernoulli",
        "automorphism",
        "ie",
        "bernoulli",
        "transformation",
        "mapping",
        "x",
        "onto",
        "let",
        "u",
        "illustrate",
        "wellknown",
        "example",
        "baker",
        "transformation",
        "named",
        "similarity",
        "kneading",
        "dough",
        "transformation",
        "map",
        "unit",
        "square",
        "onto",
        "using",
        "standard",
        "cartesian",
        "coordinate",
        "transformation",
        "written",
        "follows",
        "begin",
        "align",
        "x",
        "x",
        "frac",
        "text",
        "le",
        "x",
        "lt",
        "frac",
        "text",
        "x",
        "x",
        "frac",
        "frac",
        "text",
        "frac",
        "le",
        "x",
        "le",
        "end",
        "align",
        "word",
        "point",
        "x",
        "unit",
        "square",
        "x",
        "coordinate",
        "smaller",
        "transformation",
        "t",
        "double",
        "value",
        "x",
        "half",
        "value",
        "y",
        "point",
        "x",
        "x",
        "coordinate",
        "greater",
        "equal",
        "t",
        "transforms",
        "x",
        "x",
        "y",
        "y",
        "illustrated",
        "fig",
        "a",
        "figure",
        "a",
        "baker",
        "transformation",
        "regard",
        "two",
        "area",
        "shown",
        "lefthand",
        "part",
        "figure",
        "two",
        "atom",
        "partition",
        "alpha",
        "alpha_",
        "alpha_",
        "easy",
        "see",
        "alpha",
        "t",
        "alpha",
        "independent",
        "mu",
        "alpha_",
        "cap",
        "talpha_",
        "mu",
        "alpha_",
        "mu",
        "talpha_",
        "similarly",
        "atom",
        "alpha",
        "talpha",
        "illustrated",
        "figure",
        "b",
        "figure",
        "b",
        "independence",
        "alpha",
        "talpha",
        "one",
        "prove",
        "independence",
        "hold",
        "iterates",
        "alpha",
        "well",
        "baker",
        "transformation",
        "together",
        "partition",
        "alpha",
        "bernoulli",
        "transformation",
        "literature",
        "bernoulli",
        "system",
        "often",
        "introduced",
        "using",
        "socalled",
        "shift",
        "map",
        "bernoulli",
        "shift",
        "briefly",
        "indicate",
        "shift",
        "map",
        "related",
        "bernoulli",
        "system",
        "example",
        "baker",
        "transformation",
        "general",
        "discussion",
        "see",
        "appendix",
        "section",
        "d",
        "choose",
        "point",
        "unit",
        "square",
        "write",
        "x",
        "y",
        "coordinate",
        "binary",
        "number",
        "x",
        "a_",
        "a_",
        "a_ldots",
        "b_",
        "b_",
        "b_ldots",
        "a_i",
        "b_i",
        "either",
        "put",
        "string",
        "together",
        "back",
        "back",
        "dot",
        "middle",
        "form",
        "one",
        "infinite",
        "string",
        "s",
        "ldots",
        "b_",
        "b_",
        "b_",
        "a_",
        "a_",
        "a_ldots",
        "may",
        "represent",
        "state",
        "system",
        "standard",
        "twodimensional",
        "vector",
        "straightforward",
        "algebra",
        "show",
        "a_",
        "a_",
        "a_ldots",
        "b_",
        "b_",
        "b_ldots",
        "a_",
        "a_",
        "a_ldots",
        "a_",
        "b_",
        "b_",
        "b_",
        "b_ldots",
        "see",
        "one",
        "string",
        "representation",
        "point",
        "operation",
        "t",
        "amount",
        "shifting",
        "dot",
        "one",
        "position",
        "right",
        "ts",
        "ldots",
        "b_",
        "b_",
        "b_",
        "a_",
        "a_",
        "a_ldots",
        "hence",
        "baker",
        "transformation",
        "equivalent",
        "shift",
        "infinite",
        "string",
        "zero",
        "one",
        "two",
        "notion",
        "crucial",
        "theory",
        "bernoulli",
        "system",
        "property",
        "weak",
        "bernoulli",
        "weak",
        "bernoulli",
        "property",
        "play",
        "crucial",
        "role",
        "showing",
        "certain",
        "transformation",
        "fact",
        "bernoulli",
        "baker",
        "transformation",
        "one",
        "example",
        "geometrically",
        "simple",
        "bernoulli",
        "partition",
        "one",
        "often",
        "prove",
        "directly",
        "system",
        "bernoulli",
        "system",
        "one",
        "show",
        "certain",
        "geometrically",
        "simple",
        "partition",
        "weak",
        "bernoulli",
        "us",
        "theorem",
        "due",
        "ornstein",
        "effect",
        "system",
        "weak",
        "bernoulli",
        "exists",
        "bernoulli",
        "partition",
        "system",
        "mathematics",
        "notion",
        "associated",
        "proof",
        "equivalence",
        "intricate",
        "presentation",
        "beyond",
        "scope",
        "entry",
        "interested",
        "reader",
        "referred",
        "ornstein",
        "shield"
    ]
}