{
    "main_text": "Biography and Early Development\n2. Biography and Early Development\n\n\nMach was born in Moravia on Feb 18, 1838. In 1840 his family\nmoved to a farm in Untersiebenbrunn, Lower Austria. He studied\nphysics at the University of Vienna from 1855 to 1861, continuing on as\na lecturer until 1864. After spending three years as Professor of\nMathematics at Graz, he received a Chair at Prague where he stayed\nuntil 1895. For the next six years, Mach occupied a Chair in the\nHistory and Philosophy of the Inductive Sciences at Vienna. He\nsuffered a stroke in 1898 and retired in 1901. He died near\nMunich in 1916.\n\n\nHe credited his philosophical awakening to reading, at age fifteen,\nhis father’s copy of Kant’s Prolegomena to any Future\nMetaphysics:\n\n\nThe book made at the time a powerful and ineffaceable impression\nupon me, the like of which I never afterwards experienced in any of my\nphilosophical reading. Some two or three years later the\nsuperfluity of the role played by “the thing in itself”\nabruptly dawned upon me. On a bright summer day in the open air,\nthe world with my ego suddenly appeared to me as one coherent\nmass of sensations, only more strongly coherent in the ego.\nAlthough the actual working out of this thought did not occur until a\nlater period, yet this moment was decisive for my whole view.\n[AS: 30fn]\n\n\nMach attended an Austrian Gymnasium in Moravia, graduating at\nseventeen, entering the University of Vienna as a student of\nmathematics and physics in 1855, and matriculating in 1860.\nAfter graduation, he stayed in Vienna as a privat dozent,\nsupporting himself through giving lectures paid for directly by\nstudents (which means he made very little money).\n\n\nIt was in these years at Vienna that Mach began his interest in\nphysiology. Johannes Müller and his students had started a\nnew school of physiology in the 1840s. Initially centered\nin Berlin, it came to Vienna following the political reforms of 1848 in\nthe guise of Ernst Brüke and Carl Ludwig, a former a student of\nMüller. This new school was characterized not just by\na general suspicion of vitalism (though Müller remained a vitalist\nof sorts), but more by an agreement on the importance of the\napplication of physical-chemical methods to the biological\nsciences. Carl Ludwig, Herman von Helmholtz, and Ernst Haeckel also\nstudied under Müller. Although his degree was in physics, Mach\nenrolled as a student of the Medical Faculty, taking 22 hours of\nclasses in physiology, chemistry, and anatomy. In 1861 he taught\na course in physics for medical students, out of which he developed his\ntextbook, Compendium der Physik für Mediciner. He\nalso published his first article on psychophysics, Über das\nSehen von Lagen und Winkeln durch die Bewegung des Auges, where he\nstudied the relationship between tension in the eye muscles and\nperception of form. This work also contains Mach’s first\nreference to Fechner, whose influential Elements of\nPsychophysics was published in 1860. During the next years\nin Vienna, he also taught classes in psychophysics and a class entitled\nDie Principien der Mechanik und mechanischen Physik in ihrer\nhistorischen Entwicklung, which possibly marks the start of his\ninterest in the history of science (though we do not know the actual\ncontents of the lectures). Mach was also influenced by\nHelmholtz’s Die Lehre von den Tonempfindungen.\n\n\nMach’s first important scientific contribution was over the\nrecently discovered ‘Doppler theory’. In 1841,\nChristian Doppler noticed that sound changes in frequency as a source\nmoves toward and away from an observer. By 1845 he had\ngeneralized this to include all wave phenomena, including light.\nTwo prominent physicists, Petzval and Ångström, challenged\nDoppler. Mach devised a simple apparatus that demonstrated that\nthe Doppler effect was real, at least for sound. A six-foot tube\nwith a whistle at one end was mounted so as to rotate in a vertical\nplane. When the listener stood in the plane of the axis of\nrotation no changes in pitch could be heard. But if the observer\nstood in the plane of rotation, fluctuations in pitch that corresponded\nto the speed of rotation could be heard. The application of this\nwork to Doppler effects with light remained controversial, but Mach is\nregarded as one of the first to realize the possibility of studying a\nstar’s spectrum to understand its movements [see Blackmore 1972:\n17–19; Swoboda 1974: 20–75].\n\n\nMach was highly influenced by Johann Herbart during this period, not\nonly through Herbart’s writings, but also through Franz Lott,\nVienna’s Herbartian spokesperson and Mach’s good\nfriend. In Herbart, Mach found a mechanical approach to\npsychology and physiology that coincided with Mach’s early\nacceptance of atomism. As his interests shifted to physiology and\npsychology, the mechanical models remained, but the atomism became less\nimportant. Eventually, the mechanical approach to physiology gave\nway to an evolutionary approach, and as the mechanical approach lost\nground here atomism did as well. This trend increased the deeper\nMach went into psychophysics, and eventually turned into an\nanti-mechanistic philosophy in Mach’s mature thought. Mach\nmakes little mention of Herbart in his later writings; for instance,\nonly two brief references are made to Herbart in Analysis of\nSensations, both in the context of reflections on his intellectual\ndevelopment.\n\n\nIn 1864 Mach received an appointment in mathematics at Graz.\nFor the first time he had the money and freedom to carry out his own\nexperiments. In 1866 he exchanged his math chair for one in\nphysics. While at Graz he had personal contact with Fechner and\ncarried out his important work on Mach Bands. It was in this work\nthat Mach first made use of evolutionary theory. Mach started\nwork on what later became Analysis of Sensations, but\napparently was discouraged by Fechner’s criticism. He\nreturned to this work twenty years later, after further developing his\nown ideas. It was also in Graz that Mach first encountered Ewald\nHering’s thought, both in physiology and evolution. In\nMach’s first article on Mach Bands [Mach 1865] he refers to\nHering, and in 1866 Hering gave his famous address on Unconscious\nMemory to the Vienna Academy. In 1867 Mach went to\nPrague as a professor of physics. He stayed in Prague for\ntwenty-eight years, until 1895, whereupon he returned to Vienna. It was\nin Prague that his mature thought developed.\n\n\nMach’s name is, of course, associated with the speed of sound,\nwhere Mach 1 means the speed of sound in a given medium. Since the\nspeed of sound varies with the density of the medium it is traveling\nthrough, Mach numbers are not absolute quantities but relational\nones. In the late 1860s developments in gun and artillery technology\nproduced projectiles that traveled faster than sound vibrations. This\nwas realized over a period of time as two effects were\ninvestigated—a second loud ‘boom’, distinct from the\nusual one of the explosion, as well as a different type of wound. It\nwas the latter that began Mach’s interest. In 1868 warring\nEuropean powers had signed The St.  Petersburg Declaration that banned\na new type of bullet that exploded on impact, thus causing\n‘crater’ type wounds. Soon thereafter, however, similar\ntypes of ‘crater’ wounds appeared again. Various theories\nover their cause were put forward, leading Mach to investigate. By\n1885 Mach had worked out the details of supersonic motion, along the\nway developing high-speed photographic techniques. Most importantly\nfor engineers, Mach Number is the ratio of the speed of the object to\nthe speed of sound in the given medium; his work is essential to\nmodern aerodynamics, and through it the word ‘Mach’ has\nbizarrely entered into popular culture as an icon for razors, sound\nsystems, fighter pilots, and high speed fuels.\n\n\nMach’s early intellectual development was very much a product\nof the outstanding developments in the sciences of his time.\nWhereas a generation before, there existed only one truly mature\nscience, physics, by the early 1860s both psychology and biology\nhad entered the scientific scene. Previously, scientifically\nbased views on reality were essentially Newtonian-mechanistic.\nAfter Darwin and Fechner, the new sciences of psychology and\nevolutionary theory opened up new areas of philosophic-scientific\ninteraction. The possibility of a new scientific view opened up,\none based upon these new sciences, and sought to displace the Newtonian\nparadigm with one based upon developmental orientations.\n",
    "section_title": "2. Biography and Early Development",
    "entry_title": "Ernst Mach",
    "hierarchy_title": "Ernst Mach || Biography and Early Development",
    "tokenized_text": [
        "biography",
        "early",
        "development",
        "biography",
        "early",
        "development",
        "mach",
        "born",
        "moravia",
        "feb",
        "family",
        "moved",
        "farm",
        "untersiebenbrunn",
        "lower",
        "austria",
        "studied",
        "physic",
        "university",
        "vienna",
        "continuing",
        "lecturer",
        "spending",
        "three",
        "year",
        "professor",
        "mathematics",
        "graz",
        "received",
        "chair",
        "prague",
        "stayed",
        "next",
        "six",
        "year",
        "mach",
        "occupied",
        "chair",
        "history",
        "philosophy",
        "inductive",
        "science",
        "vienna",
        "suffered",
        "stroke",
        "retired",
        "died",
        "near",
        "munich",
        "credited",
        "philosophical",
        "awakening",
        "reading",
        "age",
        "fifteen",
        "father",
        "copy",
        "kant",
        "prolegomenon",
        "future",
        "metaphysics",
        "book",
        "made",
        "time",
        "powerful",
        "ineffaceable",
        "impression",
        "upon",
        "like",
        "never",
        "afterwards",
        "experienced",
        "philosophical",
        "reading",
        "two",
        "three",
        "year",
        "later",
        "superfluity",
        "role",
        "played",
        "thing",
        "abruptly",
        "dawned",
        "upon",
        "bright",
        "summer",
        "day",
        "open",
        "air",
        "world",
        "ego",
        "suddenly",
        "appeared",
        "one",
        "coherent",
        "mass",
        "sensation",
        "strongly",
        "coherent",
        "ego",
        "although",
        "actual",
        "working",
        "thought",
        "occur",
        "later",
        "period",
        "yet",
        "moment",
        "decisive",
        "whole",
        "view",
        "fn",
        "mach",
        "attended",
        "austrian",
        "gymnasium",
        "moravia",
        "graduating",
        "seventeen",
        "entering",
        "university",
        "vienna",
        "student",
        "mathematics",
        "physic",
        "matriculating",
        "graduation",
        "stayed",
        "vienna",
        "privat",
        "dozent",
        "supporting",
        "giving",
        "lecture",
        "paid",
        "directly",
        "student",
        "mean",
        "made",
        "little",
        "money",
        "year",
        "vienna",
        "mach",
        "began",
        "interest",
        "physiology",
        "johannes",
        "müller",
        "student",
        "started",
        "new",
        "school",
        "physiology",
        "s",
        "initially",
        "centered",
        "berlin",
        "came",
        "vienna",
        "following",
        "political",
        "reform",
        "guise",
        "ernst",
        "brüke",
        "carl",
        "ludwig",
        "former",
        "student",
        "müller",
        "new",
        "school",
        "characterized",
        "general",
        "suspicion",
        "vitalism",
        "though",
        "müller",
        "remained",
        "vitalist",
        "sort",
        "agreement",
        "importance",
        "application",
        "physicalchemical",
        "method",
        "biological",
        "science",
        "carl",
        "ludwig",
        "herman",
        "von",
        "helmholtz",
        "ernst",
        "haeckel",
        "also",
        "studied",
        "müller",
        "although",
        "degree",
        "physic",
        "mach",
        "enrolled",
        "student",
        "medical",
        "faculty",
        "taking",
        "hour",
        "class",
        "physiology",
        "chemistry",
        "anatomy",
        "taught",
        "course",
        "physic",
        "medical",
        "student",
        "developed",
        "textbook",
        "compendium",
        "der",
        "physik",
        "für",
        "mediciner",
        "also",
        "published",
        "first",
        "article",
        "psychophysics",
        "über",
        "da",
        "sehen",
        "von",
        "lagen",
        "und",
        "winkeln",
        "durch",
        "die",
        "bewegung",
        "de",
        "auges",
        "studied",
        "relationship",
        "tension",
        "eye",
        "muscle",
        "perception",
        "form",
        "work",
        "also",
        "contains",
        "mach",
        "first",
        "reference",
        "fechner",
        "whose",
        "influential",
        "element",
        "psychophysics",
        "published",
        "next",
        "year",
        "vienna",
        "also",
        "taught",
        "class",
        "psychophysics",
        "class",
        "entitled",
        "die",
        "principien",
        "der",
        "mechanik",
        "und",
        "mechanischen",
        "physik",
        "ihrer",
        "historischen",
        "entwicklung",
        "possibly",
        "mark",
        "start",
        "interest",
        "history",
        "science",
        "though",
        "know",
        "actual",
        "content",
        "lecture",
        "mach",
        "also",
        "influenced",
        "helmholtz",
        "die",
        "lehre",
        "von",
        "den",
        "tonempfindungen",
        "mach",
        "first",
        "important",
        "scientific",
        "contribution",
        "recently",
        "discovered",
        "doppler",
        "theory",
        "christian",
        "doppler",
        "noticed",
        "sound",
        "change",
        "frequency",
        "source",
        "move",
        "toward",
        "away",
        "observer",
        "generalized",
        "include",
        "wave",
        "phenomenon",
        "including",
        "light",
        "two",
        "prominent",
        "physicist",
        "petzval",
        "ångström",
        "challenged",
        "doppler",
        "mach",
        "devised",
        "simple",
        "apparatus",
        "demonstrated",
        "doppler",
        "effect",
        "real",
        "least",
        "sound",
        "sixfoot",
        "tube",
        "whistle",
        "one",
        "end",
        "mounted",
        "rotate",
        "vertical",
        "plane",
        "listener",
        "stood",
        "plane",
        "axis",
        "rotation",
        "change",
        "pitch",
        "could",
        "heard",
        "observer",
        "stood",
        "plane",
        "rotation",
        "fluctuation",
        "pitch",
        "corresponded",
        "speed",
        "rotation",
        "could",
        "heard",
        "application",
        "work",
        "doppler",
        "effect",
        "light",
        "remained",
        "controversial",
        "mach",
        "regarded",
        "one",
        "first",
        "realize",
        "possibility",
        "studying",
        "star",
        "spectrum",
        "understand",
        "movement",
        "see",
        "blackmore",
        "swoboda",
        "mach",
        "highly",
        "influenced",
        "johann",
        "herbart",
        "period",
        "herbart",
        "writing",
        "also",
        "franz",
        "lott",
        "vienna",
        "herbartian",
        "spokesperson",
        "mach",
        "good",
        "friend",
        "herbart",
        "mach",
        "found",
        "mechanical",
        "approach",
        "psychology",
        "physiology",
        "coincided",
        "mach",
        "early",
        "acceptance",
        "atomism",
        "interest",
        "shifted",
        "physiology",
        "psychology",
        "mechanical",
        "model",
        "remained",
        "atomism",
        "became",
        "le",
        "important",
        "eventually",
        "mechanical",
        "approach",
        "physiology",
        "gave",
        "way",
        "evolutionary",
        "approach",
        "mechanical",
        "approach",
        "lost",
        "ground",
        "atomism",
        "well",
        "trend",
        "increased",
        "deeper",
        "mach",
        "went",
        "psychophysics",
        "eventually",
        "turned",
        "antimechanistic",
        "philosophy",
        "mach",
        "mature",
        "thought",
        "mach",
        "make",
        "little",
        "mention",
        "herbart",
        "later",
        "writing",
        "instance",
        "two",
        "brief",
        "reference",
        "made",
        "herbart",
        "analysis",
        "sensation",
        "context",
        "reflection",
        "intellectual",
        "development",
        "mach",
        "received",
        "appointment",
        "mathematics",
        "graz",
        "first",
        "time",
        "money",
        "freedom",
        "carry",
        "experiment",
        "exchanged",
        "math",
        "chair",
        "one",
        "physic",
        "graz",
        "personal",
        "contact",
        "fechner",
        "carried",
        "important",
        "work",
        "mach",
        "band",
        "work",
        "mach",
        "first",
        "made",
        "use",
        "evolutionary",
        "theory",
        "mach",
        "started",
        "work",
        "later",
        "became",
        "analysis",
        "sensation",
        "apparently",
        "discouraged",
        "fechner",
        "criticism",
        "returned",
        "work",
        "twenty",
        "year",
        "later",
        "developing",
        "idea",
        "also",
        "graz",
        "mach",
        "first",
        "encountered",
        "ewald",
        "hering",
        "thought",
        "physiology",
        "evolution",
        "mach",
        "first",
        "article",
        "mach",
        "band",
        "mach",
        "refers",
        "hering",
        "hering",
        "gave",
        "famous",
        "address",
        "unconscious",
        "memory",
        "vienna",
        "academy",
        "mach",
        "went",
        "prague",
        "professor",
        "physic",
        "stayed",
        "prague",
        "twentyeight",
        "year",
        "whereupon",
        "returned",
        "vienna",
        "prague",
        "mature",
        "thought",
        "developed",
        "mach",
        "name",
        "course",
        "associated",
        "speed",
        "sound",
        "mach",
        "mean",
        "speed",
        "sound",
        "given",
        "medium",
        "since",
        "speed",
        "sound",
        "varies",
        "density",
        "medium",
        "traveling",
        "mach",
        "number",
        "absolute",
        "quantity",
        "relational",
        "one",
        "late",
        "s",
        "development",
        "gun",
        "artillery",
        "technology",
        "produced",
        "projectile",
        "traveled",
        "faster",
        "sound",
        "vibration",
        "realized",
        "period",
        "time",
        "two",
        "effect",
        "investigateda",
        "second",
        "loud",
        "boom",
        "distinct",
        "usual",
        "one",
        "explosion",
        "well",
        "different",
        "type",
        "wound",
        "latter",
        "began",
        "mach",
        "interest",
        "warring",
        "european",
        "power",
        "signed",
        "st",
        "petersburg",
        "declaration",
        "banned",
        "new",
        "type",
        "bullet",
        "exploded",
        "impact",
        "thus",
        "causing",
        "crater",
        "type",
        "wound",
        "soon",
        "thereafter",
        "however",
        "similar",
        "type",
        "crater",
        "wound",
        "appeared",
        "various",
        "theory",
        "cause",
        "put",
        "forward",
        "leading",
        "mach",
        "investigate",
        "mach",
        "worked",
        "detail",
        "supersonic",
        "motion",
        "along",
        "way",
        "developing",
        "highspeed",
        "photographic",
        "technique",
        "importantly",
        "engineer",
        "mach",
        "number",
        "ratio",
        "speed",
        "object",
        "speed",
        "sound",
        "given",
        "medium",
        "work",
        "essential",
        "modern",
        "aerodynamics",
        "word",
        "mach",
        "bizarrely",
        "entered",
        "popular",
        "culture",
        "icon",
        "razor",
        "sound",
        "system",
        "fighter",
        "pilot",
        "high",
        "speed",
        "fuel",
        "mach",
        "early",
        "intellectual",
        "development",
        "much",
        "product",
        "outstanding",
        "development",
        "science",
        "time",
        "whereas",
        "generation",
        "existed",
        "one",
        "truly",
        "mature",
        "science",
        "physic",
        "early",
        "s",
        "psychology",
        "biology",
        "entered",
        "scientific",
        "scene",
        "previously",
        "scientifically",
        "based",
        "view",
        "reality",
        "essentially",
        "newtonianmechanistic",
        "darwin",
        "fechner",
        "new",
        "science",
        "psychology",
        "evolutionary",
        "theory",
        "opened",
        "new",
        "area",
        "philosophicscientific",
        "interaction",
        "possibility",
        "new",
        "scientific",
        "view",
        "opened",
        "one",
        "based",
        "upon",
        "new",
        "science",
        "sought",
        "displace",
        "newtonian",
        "paradigm",
        "one",
        "based",
        "upon",
        "developmental",
        "orientation"
    ]
}