{
    "main_text": "Summary\n1. Summary\n\n\nA broad foundation is laid for the theory in question, and light is\nshed upon it from new sides, if, in conformity with the stimulus given\nby Darwinism, we conceive of all psychical life — including\nscience — as biological appearance, and if we apply to the theory\nthe Darwinian conceptions of struggle for existence, of development,\nand of selection. [Analysis of Sensations, 49–50]\n\n\n\n\nMach was a naturalist and a monist, as well as an anti-materialist\nin the sense of being an anti-mechanist. The connection between\nnaturalism and materialism is an important one for Mach.\nNaturalism, in its simplest sense, is the doctrine that there is\nnothing beyond nature, not even the organic or mental, and evolution is\nthus generally a crucial component of it. The materialism of the\nmechanical philosophy is the further view that this nature consists of\nmatter in motion, and in particular that psychic phenomena can be\nreduced to matter in motion. Although materialism can make as\nmuch use of evolution as naturalism, Mach’s nineteenth century\nevolutionary views influenced his anti-materialism. Whereas\nmechanistic materialism views nature as an organized system of billiard\nballs, Mach’s evolutionary perspective viewed nature as a dynamic\nprocess.\n\n\nMach is part of the empiricist tradition, but he also believed in\nsomething like a priori truths. But it is a biologized a\npriori: what is a priori to an individual organism\nwas a posteriori to its ancestors; not only does the a\npriori pre-form experience, but the a priori is itself\nformed from experience. It was simultaneously the contradiction and\nconfirmation of Kantian epistemology. In as much as Kant used\nthe a priori to explain how knowledge is possible, Mach uses\nthe knowledge of the new sciences to explain how an a priori is\npossible. One more patch of philosophy, it was thought, yielded to\nscience.\n\n\nMach’s empiricism is complicated. It has its roots in\nthe belief that knowledge is a product of evolution, that our senses,\nminds, and cultures have an evolutionary history. It was simple\nexperience to which early organisms responded, and it was out of simple\nexperiences that the first images of the world were constructed.\nThese constructions became a priori, allowing new and more complicated\nunderstandings, and so forth. This process is in a sense repeated\nin development; individual development begins through a process of the\ninteraction of simple sensations with those innate capacities formed in\nour ancestors. Out of this, more complex understandings arise;\nthe process continues. Science furthers this biological process\nby bringing our primitive conceptions into contact with new\nenvironments, thus causing mental adaptation. The one and same\nprocess unites all features of activity in nature: the adaptation\nof early life to primordial environments and the adaptation of modern\nscience to new data are unified under the principle of experience\nforcing adaptation in memory. Though loosely an empiricist in\nthis sense, he rejected Locke’s tabula rasa, and aligned\nhimself against the more empiricist Helmholtz and towards the nativist\nEwald Hering in their famous nature-nurture debates. He is not in\nthe least a traditional empiricist.\n\n\nMach is generally considered a ‘positivist’. However, this\ntells us little, as positivism is really a collection of traditions,\nconnected often by misunderstandings as much as by actual intellectual\nagreement. Furthermore, the word today has come to mean something so\nfar removed from its nineteenth century origins as to be practically\nharmful in understanding the how it was used in the nineteenth\ncentury. Outside of the social sciences (where it is alive and well),\nthe word ‘positivism’ seems to be used mostly by\npost-modernists, deconstructionists, and the Frankfurt school as a\nword to represent that branch of the enlightenment tradition that\nfailed; it has become the ‘other’ which we all know is\nwrong without having to know what it is. Comte was a Positivist. Mach,\ntoo, was a Positivist, but Mach probably has more in common with\nHusserl than Comte, and certainly more in common with James.\n\n\nMach is not a phenomenalist under normal uses of this term, but this\ncertainly requires investigation. First, to whatever extent he was a\nphenomenalist, he was a ‘scientific’ phenomenalist: his\nideas were not derived from philosophical skepticism but through\napplication of the results of psychology and evolutionary theory. He\nprovides clues as to how we should understand his infamous\n“elements”—they are related to the thought of\nFechner and Ewald Hering. Secondly, he advocated that physics should\ndescribe relations of experience as much as possible; in his time this\nwas termed ‘phenomenological physics’. This was clearly\nmeant as a methodological suggestion, arising out of the way he\nthought physics could best respond to the challenges presented to it\nby the life sciences.  Thirdly, he writes that his ideas were the same\nas Avenarius who had approached questions of the relationship between\nthe psychical and the physical from a physicalistic\nperspective. Although Mach undoubtedly adopts a sensationalist basis,\nthis foundation is not crucial for Mach. He recognizes the\npossibility of other foundations:\n\n\n… many readers have found a stumbling-block in what they\ntook, erroneously indeed, to be the general character of my conception\nof the universe. And, to begin with, I must say that anyone who,\nin spite of repeated protests from myself and from other quarters,\nidentifies my view with that of Berkeley, is undoubtedly very far\nremoved from a proper appreciation of my position. This\nmisconception is no doubt partly due to the fact that my view was\ndeveloped from an earlier idealistic phase, which has left on my\nlanguage traces which are probably not even yet entirely\nobliterated. For, of all the approaches to my standpoint, the one\nby way of idealism seems to me the easiest and most natural…. I\nfeel it to be a piece of particularly good fortune that Avenarius has\ndeveloped the same conception of the relation between the physical\nand psychical on an entirely realistic, or, if the phrase be preferred,\na materialistic foundation … [italics mine;\nAS: 361–2; see also 358]\n\n\nExperimental psychology had just been founded. Mach’s elements\nare, quite simply, the variables of a major branch of psychology, the\nnew field of psychophysics. Mach was part of the first generation\nof physiological psychologists that thought they had broken through the\nprimeval walls dividing the physical from the mental. They\nthought they had solved this ancient problem through a scientific,\nmonistic unification. The physical was characterized by its\nability to be quantified: it was part of science.\nNow, the realm of Geist was falling under the same methods\nused so successfully in physics. Following the pioneering work of\nFechner, they had measured sensation and found that the\nrelationship of external stimulus to inner response followed\nmathematical law. Fueled further by developments in evolutionary\ntheory, their optimism soared, perhaps a bit too high. As\nso often happens in periods of scientific optimism, these new\ndiscoveries called for a philosophy in which they would be at\nhome. Mach not only took up this challenge, but as a physicist\nalso applied the results of this tradition to the categories of\nphysics.\n\n\nModern psychologists regard Mach as the forerunner of the idea of\nneural nets in perception. He discovered that the eye has a mind\nof its own; we perceive not direct stimuli but relations of\nstimuli. The visual system operates through a process of\ncontinual adaptation of the present sensation to previous ones.\nWe do not experience ‘reality’ but rather experience the\nafter effects of our nervous system’s adaptations to new\nstimuli. Furthermore, from an evolutionary perspective, it was\nnecessary that this relational nature of perception be\nso. What were once thought of as errors of the brain, Mach showed\nto be adaptations. His argument is brilliant and he is cited even\ntoday in psychology textbooks for these contributions.\nFurthermore, his work in physiology influenced his epistemology.\nIf we perceive not things directly but contrasts of things, then the\nworld is a biological construction formed through the process of our\nnervous system adapting to new sensations. Representationalist\ntheories of perception, which posit a direct correspondence between\nappearance and reality, become untenable.\n\n\nMach is also considered by Gestalt theorists to be one of their\nforerunners. Christian von Ehrenfels, the founder of Gestalt\ntheory, begins his seminal 1890 paper “Über\nGestaltqualitäten” by reviewing Gestalt ideas in\nMach’s Analysis of Sensations. These ideas arose\nin the context of his research on Mach bands where he realized that the\nmind and senses actively contribute to sensation. The\nAnalysis of Sensations is full of examples of this sort; its\ncentral concern is to understand the dynamic relation between our\ncognitive structure and experience. Our cognitive structure is\nitself formed through previous experience, and our current experience\nis structured by it in turn.\n",
    "section_title": "1. Summary",
    "entry_title": "Ernst Mach",
    "hierarchy_title": "Ernst Mach || Summary",
    "tokenized_text": [
        "summary",
        "summary",
        "broad",
        "foundation",
        "laid",
        "theory",
        "question",
        "light",
        "shed",
        "upon",
        "new",
        "side",
        "conformity",
        "stimulus",
        "given",
        "darwinism",
        "conceive",
        "psychical",
        "life",
        "including",
        "science",
        "biological",
        "appearance",
        "apply",
        "theory",
        "darwinian",
        "conception",
        "struggle",
        "existence",
        "development",
        "selection",
        "analysis",
        "sensation",
        "mach",
        "naturalist",
        "monist",
        "well",
        "antimaterialist",
        "sense",
        "antimechanist",
        "connection",
        "naturalism",
        "materialism",
        "important",
        "one",
        "mach",
        "naturalism",
        "simplest",
        "sense",
        "doctrine",
        "nothing",
        "beyond",
        "nature",
        "even",
        "organic",
        "mental",
        "evolution",
        "thus",
        "generally",
        "crucial",
        "component",
        "materialism",
        "mechanical",
        "philosophy",
        "view",
        "nature",
        "consists",
        "matter",
        "motion",
        "particular",
        "psychic",
        "phenomenon",
        "reduced",
        "matter",
        "motion",
        "although",
        "materialism",
        "make",
        "much",
        "use",
        "evolution",
        "naturalism",
        "mach",
        "nineteenth",
        "century",
        "evolutionary",
        "view",
        "influenced",
        "antimaterialism",
        "whereas",
        "mechanistic",
        "materialism",
        "view",
        "nature",
        "organized",
        "system",
        "billiard",
        "ball",
        "mach",
        "evolutionary",
        "perspective",
        "viewed",
        "nature",
        "dynamic",
        "process",
        "mach",
        "part",
        "empiricist",
        "tradition",
        "also",
        "believed",
        "something",
        "like",
        "priori",
        "truth",
        "biologized",
        "priori",
        "priori",
        "individual",
        "organism",
        "posteriori",
        "ancestor",
        "priori",
        "preform",
        "experience",
        "priori",
        "formed",
        "experience",
        "simultaneously",
        "contradiction",
        "confirmation",
        "kantian",
        "epistemology",
        "much",
        "kant",
        "used",
        "priori",
        "explain",
        "knowledge",
        "possible",
        "mach",
        "us",
        "knowledge",
        "new",
        "science",
        "explain",
        "priori",
        "possible",
        "one",
        "patch",
        "philosophy",
        "thought",
        "yielded",
        "science",
        "mach",
        "empiricism",
        "complicated",
        "root",
        "belief",
        "knowledge",
        "product",
        "evolution",
        "sens",
        "mind",
        "culture",
        "evolutionary",
        "history",
        "simple",
        "experience",
        "early",
        "organism",
        "responded",
        "simple",
        "experience",
        "first",
        "image",
        "world",
        "constructed",
        "construction",
        "became",
        "priori",
        "allowing",
        "new",
        "complicated",
        "understanding",
        "forth",
        "process",
        "sense",
        "repeated",
        "development",
        "individual",
        "development",
        "begin",
        "process",
        "interaction",
        "simple",
        "sensation",
        "innate",
        "capacity",
        "formed",
        "ancestor",
        "complex",
        "understanding",
        "arise",
        "process",
        "continues",
        "science",
        "furthers",
        "biological",
        "process",
        "bringing",
        "primitive",
        "conception",
        "contact",
        "new",
        "environment",
        "thus",
        "causing",
        "mental",
        "adaptation",
        "one",
        "process",
        "unites",
        "feature",
        "activity",
        "nature",
        "adaptation",
        "early",
        "life",
        "primordial",
        "environment",
        "adaptation",
        "modern",
        "science",
        "new",
        "data",
        "unified",
        "principle",
        "experience",
        "forcing",
        "adaptation",
        "memory",
        "though",
        "loosely",
        "empiricist",
        "sense",
        "rejected",
        "locke",
        "tabula",
        "rasa",
        "aligned",
        "empiricist",
        "helmholtz",
        "towards",
        "nativist",
        "ewald",
        "hering",
        "famous",
        "naturenurture",
        "debate",
        "least",
        "traditional",
        "empiricist",
        "mach",
        "generally",
        "considered",
        "positivist",
        "however",
        "tell",
        "u",
        "little",
        "positivism",
        "really",
        "collection",
        "tradition",
        "connected",
        "often",
        "misunderstanding",
        "much",
        "actual",
        "intellectual",
        "agreement",
        "furthermore",
        "word",
        "today",
        "come",
        "mean",
        "something",
        "far",
        "removed",
        "nineteenth",
        "century",
        "origin",
        "practically",
        "harmful",
        "understanding",
        "used",
        "nineteenth",
        "century",
        "outside",
        "social",
        "science",
        "alive",
        "well",
        "word",
        "positivism",
        "seems",
        "used",
        "mostly",
        "postmodernists",
        "deconstructionists",
        "frankfurt",
        "school",
        "word",
        "represent",
        "branch",
        "enlightenment",
        "tradition",
        "failed",
        "become",
        "know",
        "wrong",
        "without",
        "know",
        "comte",
        "positivist",
        "mach",
        "positivist",
        "mach",
        "probably",
        "common",
        "husserl",
        "comte",
        "certainly",
        "common",
        "james",
        "mach",
        "phenomenalist",
        "normal",
        "us",
        "term",
        "certainly",
        "requires",
        "investigation",
        "first",
        "whatever",
        "extent",
        "phenomenalist",
        "scientific",
        "phenomenalist",
        "idea",
        "derived",
        "philosophical",
        "skepticism",
        "application",
        "result",
        "psychology",
        "evolutionary",
        "theory",
        "provides",
        "clue",
        "understand",
        "infamous",
        "element",
        "they",
        "related",
        "thought",
        "fechner",
        "ewald",
        "hering",
        "secondly",
        "advocated",
        "physic",
        "describe",
        "relation",
        "experience",
        "much",
        "possible",
        "time",
        "termed",
        "phenomenological",
        "physic",
        "clearly",
        "meant",
        "methodological",
        "suggestion",
        "arising",
        "way",
        "thought",
        "physic",
        "could",
        "best",
        "respond",
        "challenge",
        "presented",
        "life",
        "science",
        "thirdly",
        "writes",
        "idea",
        "avenarius",
        "approached",
        "question",
        "relationship",
        "psychical",
        "physical",
        "physicalistic",
        "perspective",
        "although",
        "mach",
        "undoubtedly",
        "adopts",
        "sensationalist",
        "basis",
        "foundation",
        "crucial",
        "mach",
        "recognizes",
        "possibility",
        "foundation",
        "many",
        "reader",
        "found",
        "stumblingblock",
        "took",
        "erroneously",
        "indeed",
        "general",
        "character",
        "conception",
        "universe",
        "begin",
        "must",
        "say",
        "anyone",
        "spite",
        "repeated",
        "protest",
        "quarter",
        "identifies",
        "view",
        "berkeley",
        "undoubtedly",
        "far",
        "removed",
        "proper",
        "appreciation",
        "position",
        "misconception",
        "doubt",
        "partly",
        "due",
        "fact",
        "view",
        "developed",
        "earlier",
        "idealistic",
        "phase",
        "left",
        "language",
        "trace",
        "probably",
        "even",
        "yet",
        "entirely",
        "obliterated",
        "approach",
        "standpoint",
        "one",
        "way",
        "idealism",
        "seems",
        "easiest",
        "natural",
        "feel",
        "piece",
        "particularly",
        "good",
        "fortune",
        "avenarius",
        "developed",
        "conception",
        "relation",
        "physical",
        "psychical",
        "entirely",
        "realistic",
        "phrase",
        "preferred",
        "materialistic",
        "foundation",
        "italic",
        "mine",
        "see",
        "also",
        "experimental",
        "psychology",
        "founded",
        "mach",
        "element",
        "quite",
        "simply",
        "variable",
        "major",
        "branch",
        "psychology",
        "new",
        "field",
        "psychophysics",
        "mach",
        "part",
        "first",
        "generation",
        "physiological",
        "psychologist",
        "thought",
        "broken",
        "primeval",
        "wall",
        "dividing",
        "physical",
        "mental",
        "thought",
        "solved",
        "ancient",
        "problem",
        "scientific",
        "monistic",
        "unification",
        "physical",
        "characterized",
        "ability",
        "quantified",
        "part",
        "science",
        "realm",
        "geist",
        "falling",
        "method",
        "used",
        "successfully",
        "physic",
        "following",
        "pioneering",
        "work",
        "fechner",
        "measured",
        "sensation",
        "found",
        "relationship",
        "external",
        "stimulus",
        "inner",
        "response",
        "followed",
        "mathematical",
        "law",
        "fueled",
        "development",
        "evolutionary",
        "theory",
        "optimism",
        "soared",
        "perhaps",
        "bit",
        "high",
        "often",
        "happens",
        "period",
        "scientific",
        "optimism",
        "new",
        "discovery",
        "called",
        "philosophy",
        "would",
        "home",
        "mach",
        "took",
        "challenge",
        "physicist",
        "also",
        "applied",
        "result",
        "tradition",
        "category",
        "physic",
        "modern",
        "psychologist",
        "regard",
        "mach",
        "forerunner",
        "idea",
        "neural",
        "net",
        "perception",
        "discovered",
        "eye",
        "mind",
        "perceive",
        "direct",
        "stimulus",
        "relation",
        "stimulus",
        "visual",
        "system",
        "operates",
        "process",
        "continual",
        "adaptation",
        "present",
        "sensation",
        "previous",
        "one",
        "experience",
        "reality",
        "rather",
        "experience",
        "effect",
        "nervous",
        "system",
        "adaptation",
        "new",
        "stimulus",
        "furthermore",
        "evolutionary",
        "perspective",
        "necessary",
        "relational",
        "nature",
        "perception",
        "thought",
        "error",
        "brain",
        "mach",
        "showed",
        "adaptation",
        "argument",
        "brilliant",
        "cited",
        "even",
        "today",
        "psychology",
        "textbook",
        "contribution",
        "furthermore",
        "work",
        "physiology",
        "influenced",
        "epistemology",
        "perceive",
        "thing",
        "directly",
        "contrast",
        "thing",
        "world",
        "biological",
        "construction",
        "formed",
        "process",
        "nervous",
        "system",
        "adapting",
        "new",
        "sensation",
        "representationalist",
        "theory",
        "perception",
        "posit",
        "direct",
        "correspondence",
        "appearance",
        "reality",
        "become",
        "untenable",
        "mach",
        "also",
        "considered",
        "gestalt",
        "theorist",
        "one",
        "forerunner",
        "christian",
        "von",
        "ehrenfels",
        "founder",
        "gestalt",
        "theory",
        "begin",
        "seminal",
        "paper",
        "über",
        "gestaltqualitäten",
        "reviewing",
        "gestalt",
        "idea",
        "mach",
        "analysis",
        "sensation",
        "idea",
        "arose",
        "context",
        "research",
        "mach",
        "band",
        "realized",
        "mind",
        "sens",
        "actively",
        "contribute",
        "sensation",
        "analysis",
        "sensation",
        "full",
        "example",
        "sort",
        "central",
        "concern",
        "understand",
        "dynamic",
        "relation",
        "cognitive",
        "structure",
        "experience",
        "cognitive",
        "structure",
        "formed",
        "previous",
        "experience",
        "current",
        "experience",
        "structured",
        "turn"
    ]
}