{
    "main_text": "Other Ways of Characterizing the Essential/Accidental Property Distinction\n2. Other Ways of Characterizing the Essential/Accidental Property Distinction\n\nThe modal characterization of an essential property of an object as a\nproperty that an object must possess fits well with (at least\none aspect of) our everyday understanding of the notion of\nessentiality, which often seems simply to be the notion of necessity.\nTo say that something is essential for something else is typically\njust to say that the first is necessary for the second. But however\nwell this account fits with (this aspect of) our everyday\nunderstanding of essentiality, it has some consequences that may be\nsurprising: this characterization classifies the property of being\nsuch that there are infinitely many primes (or, perhaps, being such\nthat there are infinitely many primes if the thing in question is\nexistent) as essential to Socrates (as well as to all other things),\nsince Socrates (like all other things) must have this property.\nSocrates must have this property for the simple reason that it is\nnecessary that there are infinitely many primes. Moreover, this\ncharacterization classifies the property of being the sole member of\nthe unit set \\(\\{2\\}\\) as essential to the number 2, given that it is\nnecessary that 2 is the sole member of the unit set \\(\\{2\\}\\).\n\nSome philosophers, most prominently Kit Fine (1994), have found these\nresults disturbing. Fine thinks that the notion of an essential\nproperty of a thing should be bound up with the notion of the thing’s nature or what it\nis to be that thing, but, Fine thinks, being such that there are\ninfinitely many primes intuitively has nothing to do with what it\nis to be Socrates. And although it seems that having the number 2\nas its sole member is part of what it is to be the unit set \\(\\{2\\}\\), it\ndoes not seem that being this unit set’s sole member is part of\nwhat it is to be the number 2. It is Fine’s view that these\nsorts of properties are counterexamples to the modal\n characterization.[2][3]\n To replace the modal characterization, Fine offers a definitional\ncharacterization of essential properties, according to which the\nessential properties of an object are those of its properties that are\npart of the object’s “definition”. What exactly is a\n“definition” of an object? This is a difficult question.\nAt first sight, it seems to be a category mistake: it is words and\nperhaps concepts—but not objects—that have definitions.\nEven so, it must be admitted that some objects—such as the\nnumber 2 and the unit set \\(\\{2\\}\\)—do seem to be definable: it is\nplausible to think that the number 2 is defined as being the successor\nof the number 1; and it is plausible to think that the unit set \\(\\{2\\}\\) is\ndefined as being the set whose sole member is the number 2. But other\nobjects—such as Socrates—do not seem to admit so readily\nof definition. So even if the notion is understood well enough for\nsome objects (never mind that not everyone would allow that the number\n2, for example, is an object), a major challenge for the advocate of\nthe definitional characterization is to provide a respectable general\nunderstanding of the notion of a definition for an object.\n\nAnother issue bears mentioning inasmuch as the present article\nconcerns the distinction between essential and accidental\nproperties and not merely different ways that one may\ncharacterize what an essential property is. There is a recognized\nanalytic connection between the terms ‘essential property’\nand ‘accidental property’ such that the properties of a\ngiven thing divide exclusively and exhaustively into the categories\nessential and accidental. Although the thought that\na thing’s essential properties are those that are a part of its\ndefinition has caught on in the philosophical literature, the thought\nthat a thing’s accidental properties are those of its properties\nthat are not part of its definition has not. For example, few would\nsay that it is merely accidental to Socrates to be the sole member of\n\\(\\{\\text{Socrates}\\}\\). In short, the phrase ‘accidental\nproperty’ tends to be used in the sense of a modally accidental\nproperty.\n\nSeveral philosophers have defended non-standard versions of the modal\ncharacterization in light of Fine’s putative counterexamples.\nEdward Zalta (2006) was among the first. He distinguishes between\nabstract objects (such as numbers and fictional characters) and\nordinary objects (such as Socrates). According to Zalta, every object\nnecessarily exists (whether abstract or ordinary), but ordinary\nobjects are not necessarily concrete. Indeed, an ordinary object such\nas Socrates is concrete in some possible worlds but non-concrete in\nothers. Zalta suggests two separate accounts of essence, one\ncorresponding to abstract objects and the other corresponding to\nordinary objects. Here is Zalta’s account of essence for\nordinary objects, slightly simplified:\n\n\\(P\\) is an essential property of an ordinary object\n\\(o\\) just in case (1) it is necessary that \\(o\\) has\n\\(P\\) if \\(o\\) is concrete, and (2) it is not necessary that\n\\(o\\) has \\(P\\).\n\n\nIn all possible worlds, Socrates is such that there are infinitely\nmany primes (whether Socrates is concrete or non-concrete). Thus,\ncondition (2) is not satisfied. Thus, this is not one of\nSocrates’s essential properties. (In Zalta’s terminology,\nthis is not one of Socrates’s strongly essential\nproperties, although Zalta would say that it is one of\nSocrates’s weakly essential properties, since condition\n(1) is satisfied.) Here is Zalta’s account of essence for\nabstract objects:\n\n\\(P\\) is an essential property of an abstract object\n\\(o\\) just in case it is necessary that \\(o\\) encodes \\(P\\).\n\n\nOnly abstract objects are capable of encoding properties,\naccording to Zalta. To say that an abstract object encodes a property\nis to say that the property is included in our conception of the\nobject. Thus, the fictional character Sherlock Holmes encodes the\nproperty of being a detective, even though Sherlock Holmes does not\nhave this property. (In Zalta’s terminology, Sherlock Holmes\ndoes not exemplify this property. Sherlock Holmes exemplifies\nproperties such as being created by Arthur Conan Doyle and having been\nportrayed by Jeremy Brett.) According to Zalta, being a detective is\none of Sherlock Holmes’s essential properties. In contrast,\nbeing such that there are infinitely many primes is not one of\nSherlock Holmes’s essential properties, since this property is not\nincluded in our conception of Sherlock Holmes.\n\nThe asymmetry between the essential properties of Socrates, who is an\nordinary object, and {Socrates}, which is an abstract object, is\nexplained: given the theory and definitions proposed, it is not\nessential to Socrates that he is an element of {Socrates}, but it is\nessential to {Socrates} that Socrates is an element of it (see Zalta\n2006, §5, for the details).\n\nFabrice Correia (2007) suggests a different version of the modal\ncharacterization, based on a non-standard conception of modality:\n\n\\(P\\) is an essential property of an object \\(o\\)\njust in case it is locally necessary that \\(o\\) has\n\\(P\\) if there are facts about \\(o\\).\n\n\nIn order to understand this characterization, we must first understand\nCorreia’s non-standard conception of modality, inspired by\nArthur Prior (1957). Philosophers typically regard possible worlds as\ngiving a complete description of a possible state of the universe.\nThese are what Correia calls globally possible worlds.\nLocally possible worlds form a broader class. They include\nall the globally possible worlds, but also strictly\nlocally possible worlds, which are incomplete and do not include\nfacts about certain objects. A strictly locally possible world is\n“a globally possible world in miniature” (2007, pp.\n72–73). Correia suggests that there are strictly locally possible\nworlds in which there are facts about Socrates but no facts about\nprime numbers. Thus, it is not locally necessary that\nSocrates has the property of being such that there are infinitely many\nprimes. Thus, this is not one of Socrates’s essential\nproperties.\n\nIn a series of papers, Berit Brogaard and Joe Salerno (2007a, 2007b,\n2013) have defended a version of the modal characterization that\nrelies on their non-standard conception of counterfactuals:\n\n\\(P\\) is an essential property of an object \\(o\\)\njust in case (1) it is necessary that \\(o\\) has \\(P\\) if\n\\(o\\) exists, and (2) if nothing had \\(P\\), then \\(o\\)\nwould not exist.\n\n\nIn order to understand this characterization, we must first understand\nBrogaard and Salerno’s non-standard conception of\ncounterfactuals. According to Brogaard and Salerno, counterfactuals\nwith impossible antecedents (“counterpossibles”) can be\nfalse (rather than being “vacuously true,” as standard\naccounts would have it). For example, Brogaard and Salerno would say\nthat the following counterfactual is false: If nothing had the\nproperty of being such that there are infinitely many primes, then\nSocrates would not exist. Since this counterfactual is false,\ncondition (2) is not satisfied. Thus, Socrates is not essentially such\nthat there are infinitely many primes.\n\nAnother account, defended by Nathan Wildman (2013) and suggested by Sam Cowling (2013), appeals to David Lewis’s (1983, 1986) distinction between sparse\nproperties and abundant properties:\n\n\\(P\\) is an essential property of an object \\(o\\)\njust in case (1) it is necessary that \\(o\\) has \\(P\\) if\n\\(o\\) exists, and (2) \\(P\\) is a sparse property.\n\n\nAs Wildman and Cowling point out, there are several ways of cashing\nout the distinction between sparse properties and abundant properties\n(see Schaffer (2004) for a thorough discussion). The basic idea is\nthat sparse properties are somehow more fundamental than abundant\nproperties (they somehow “carve nature at the joints”).\nWhat is important is that on any plausible account of the distinction,\nthe properties invoked by Fine will not count as sparse properties.\nThus, condition (2) will not be satisfied.\n\nDavid Denby (2014) defends a similar version of the modal\ncharacterization, appealing to the more familiar distinction between\nintrinsic properties and extrinsic properties:\n\n\\(P\\) is an essential property of an object \\(o\\)\njust in case (1) it is necessary that \\(o\\) has \\(P\\) if\n\\(o\\) exists, and (2) \\(P\\) is an intrinsic property.\n\n\nRoughly, an intrinsic property is a property that an object possesses\nin isolation, while an extrinsic property is a property that\nan object possesses only in relation to other objects. Again\nthere are different ways of cashing out this distinction. But again\nthe important point is that on any plausible account of the\ndistinction, the properties invoked by Fine will not count as\nintrinsic properties. Thus, condition (2) will not be\n satisfied.[4]\n\n\nIn connection with the definitional characterization, it should be mentioned that Fine (1994) also argues that modal truths are reducible to truths about essence. Metaphysically necessary truths, for example, are identified with those propositions which are true by virtue of the essence of all objects whatsoever. This reductionist idea has generated a significant amount of literature in recent years. Among others, see Jessica Leech (2018), Carlos Romero (2019), Robert Michels (2019), and Nathan Wildman (forthcoming). \n\n\nIn addition to the modal characterization and the definitional\ncharacterization, there is yet another way of characterizing the\nnotion of an essential property. It agrees with the definitional\ncharacterization that the modal characterization is too liberal in\nwhat it counts as essential, but it avoids appeal to the notion of a\ndefinition of an object. On the explanatory characterization,\nthe essential properties of an object are the object’s deepest\nexplanatory properties—those properties that figure\nfundamentally into explanations of the object’s possessing the\nother properties it does. (For example, having six protons might count\nas an essential property of a carbon atom because this property\nfigures fundamentally into explanations of its possession of other\nproperties, like its bonding characteristics.) This sort of account\nthreatens to make the essential/accidental property distinction\nrelative, since what counts as explanatorily primary seems to depend\non the interests and abilities of the explainers. Some advocates of the explanatory characterization, such as Meghan Sullivan (2017), are willing to accept that the distinction is relative in some sense. Others, such as\nIrving Copi (1954) and Michael Gorman (2005), hold that there is a\nmore “metaphysical” and less “epistemic”\nunderstanding of the notion of explanation, according to which one\nthing explains another thing just in case there is a certain\nmind-independent relation that holds between them. Just as the\nadvocate of the definitional characterization is challenged to provide\na respectable understanding of the relevant notion of definition, the\nadvocate of the explanatory characterization is challenged to provide\n(or to borrow from the philosophy of science) a respectable\nunderstanding of the relevant notion of explanation.\n\nThe distinction between accidental and essential properties is, at\nleast on the most basic version of each account, both exclusive and\nexhaustive. (On some more refined versions of these accounts, the\ndistinction remains exclusive, but not exhaustive. Exhaustiveness is\nlost when certain properties—like the property of being such\nthat there are infinitely many primes—are not counted as\nproperties to which the essential/accidental distinction applies. See\nthe discussion of Della Rocca (1996a) in §3.) In addition, it\nseems that the root of each of the characterizations goes back at\nleast to the work of Aristotle. (For the modal characterization, see\nTopics 102b5ff; for the definitional, see\nMetaphysics 1031a12; and for the explanatory, see\nPosterior Analytics 74b5ff. For more on the notion of essence\nin Aristotle’s work, see the entry on\n Aristotle’s Metaphysics.)\n It is not clear whether these three characterizations should properly\nbe thought of as competing characterizations of a single notion or\ninstead as ways of trying to capture three related, but different, and\nequally legitimate, notions. (A similar point has been made by Livingstone-Banks (2017) and Cowling(2013).) Since the modal characterization has been so common, and since the distinction between essential and accidental properties, which is the topic of this entry, is almost always understood modally, it will dominate the remainder of this entry.\n",
    "section_title": "2. Other Ways of Characterizing the Essential/Accidental Property Distinction",
    "entry_title": "Essential vs. Accidental Properties",
    "hierarchy_title": "Essential vs. Accidental Properties || Other Ways of Characterizing the Essential/Accidental Property Distinction",
    "tokenized_text": [
        "way",
        "characterizing",
        "essentialaccidental",
        "property",
        "distinction",
        "way",
        "characterizing",
        "essentialaccidental",
        "property",
        "distinction",
        "modal",
        "characterization",
        "essential",
        "property",
        "object",
        "property",
        "object",
        "must",
        "posse",
        "fit",
        "well",
        "least",
        "one",
        "aspect",
        "everyday",
        "understanding",
        "notion",
        "essentiality",
        "often",
        "seems",
        "simply",
        "notion",
        "necessity",
        "say",
        "something",
        "essential",
        "something",
        "else",
        "typically",
        "say",
        "first",
        "necessary",
        "second",
        "however",
        "well",
        "account",
        "fit",
        "aspect",
        "everyday",
        "understanding",
        "essentiality",
        "consequence",
        "may",
        "surprising",
        "characterization",
        "classifies",
        "property",
        "infinitely",
        "many",
        "prime",
        "perhaps",
        "infinitely",
        "many",
        "prime",
        "thing",
        "question",
        "existent",
        "essential",
        "socrates",
        "well",
        "thing",
        "since",
        "socrates",
        "like",
        "thing",
        "must",
        "property",
        "socrates",
        "must",
        "property",
        "simple",
        "reason",
        "necessary",
        "infinitely",
        "many",
        "prime",
        "moreover",
        "characterization",
        "classifies",
        "property",
        "sole",
        "member",
        "unit",
        "set",
        "essential",
        "number",
        "given",
        "necessary",
        "sole",
        "member",
        "unit",
        "set",
        "philosopher",
        "prominently",
        "kit",
        "fine",
        "found",
        "result",
        "disturbing",
        "fine",
        "think",
        "notion",
        "essential",
        "property",
        "thing",
        "bound",
        "notion",
        "thing",
        "nature",
        "thing",
        "fine",
        "think",
        "infinitely",
        "many",
        "prime",
        "intuitively",
        "nothing",
        "socrates",
        "although",
        "seems",
        "number",
        "sole",
        "member",
        "part",
        "unit",
        "set",
        "seem",
        "unit",
        "set",
        "sole",
        "member",
        "part",
        "number",
        "fine",
        "view",
        "sort",
        "property",
        "counterexample",
        "modal",
        "characterization",
        "replace",
        "modal",
        "characterization",
        "fine",
        "offer",
        "definitional",
        "characterization",
        "essential",
        "property",
        "according",
        "essential",
        "property",
        "object",
        "property",
        "part",
        "object",
        "definition",
        "exactly",
        "definition",
        "object",
        "difficult",
        "question",
        "first",
        "sight",
        "seems",
        "category",
        "mistake",
        "word",
        "perhaps",
        "conceptsbut",
        "objectsthat",
        "definition",
        "even",
        "must",
        "admitted",
        "objectssuch",
        "number",
        "unit",
        "set",
        "do",
        "seem",
        "definable",
        "plausible",
        "think",
        "number",
        "defined",
        "successor",
        "number",
        "plausible",
        "think",
        "unit",
        "set",
        "defined",
        "set",
        "whose",
        "sole",
        "member",
        "number",
        "objectssuch",
        "socratesdo",
        "seem",
        "admit",
        "readily",
        "definition",
        "even",
        "notion",
        "understood",
        "well",
        "enough",
        "object",
        "never",
        "mind",
        "everyone",
        "would",
        "allow",
        "number",
        "example",
        "object",
        "major",
        "challenge",
        "advocate",
        "definitional",
        "characterization",
        "provide",
        "respectable",
        "general",
        "understanding",
        "notion",
        "definition",
        "object",
        "another",
        "issue",
        "bear",
        "mentioning",
        "inasmuch",
        "present",
        "article",
        "concern",
        "distinction",
        "essential",
        "accidental",
        "property",
        "merely",
        "different",
        "way",
        "one",
        "may",
        "characterize",
        "essential",
        "property",
        "recognized",
        "analytic",
        "connection",
        "term",
        "essential",
        "property",
        "accidental",
        "property",
        "property",
        "given",
        "thing",
        "divide",
        "exclusively",
        "exhaustively",
        "category",
        "essential",
        "accidental",
        "although",
        "thought",
        "thing",
        "essential",
        "property",
        "part",
        "definition",
        "caught",
        "philosophical",
        "literature",
        "thought",
        "thing",
        "accidental",
        "property",
        "property",
        "part",
        "definition",
        "example",
        "would",
        "say",
        "merely",
        "accidental",
        "socrates",
        "sole",
        "member",
        "text",
        "socrates",
        "short",
        "phrase",
        "accidental",
        "property",
        "tends",
        "used",
        "sense",
        "modally",
        "accidental",
        "property",
        "several",
        "philosopher",
        "defended",
        "nonstandard",
        "version",
        "modal",
        "characterization",
        "light",
        "fine",
        "putative",
        "counterexample",
        "edward",
        "zalta",
        "among",
        "first",
        "distinguishes",
        "abstract",
        "object",
        "number",
        "fictional",
        "character",
        "ordinary",
        "object",
        "socrates",
        "according",
        "zalta",
        "every",
        "object",
        "necessarily",
        "exists",
        "whether",
        "abstract",
        "ordinary",
        "ordinary",
        "object",
        "necessarily",
        "concrete",
        "indeed",
        "ordinary",
        "object",
        "socrates",
        "concrete",
        "possible",
        "world",
        "nonconcrete",
        "others",
        "zalta",
        "suggests",
        "two",
        "separate",
        "account",
        "essence",
        "one",
        "corresponding",
        "abstract",
        "object",
        "corresponding",
        "ordinary",
        "object",
        "zalta",
        "account",
        "essence",
        "ordinary",
        "object",
        "slightly",
        "simplified",
        "p",
        "essential",
        "property",
        "ordinary",
        "object",
        "o",
        "case",
        "necessary",
        "o",
        "p",
        "o",
        "concrete",
        "necessary",
        "o",
        "p",
        "possible",
        "world",
        "socrates",
        "infinitely",
        "many",
        "prime",
        "whether",
        "socrates",
        "concrete",
        "nonconcrete",
        "thus",
        "condition",
        "satisfied",
        "thus",
        "one",
        "socrates",
        "essential",
        "property",
        "zalta",
        "terminology",
        "one",
        "socrates",
        "strongly",
        "essential",
        "property",
        "although",
        "zalta",
        "would",
        "say",
        "one",
        "socrates",
        "weakly",
        "essential",
        "property",
        "since",
        "condition",
        "satisfied",
        "zalta",
        "account",
        "essence",
        "abstract",
        "object",
        "p",
        "essential",
        "property",
        "abstract",
        "object",
        "o",
        "case",
        "necessary",
        "o",
        "encodes",
        "p",
        "abstract",
        "object",
        "capable",
        "encoding",
        "property",
        "according",
        "zalta",
        "say",
        "abstract",
        "object",
        "encodes",
        "property",
        "say",
        "property",
        "included",
        "conception",
        "object",
        "thus",
        "fictional",
        "character",
        "sherlock",
        "holmes",
        "encodes",
        "property",
        "detective",
        "even",
        "though",
        "sherlock",
        "holmes",
        "property",
        "zalta",
        "terminology",
        "sherlock",
        "holmes",
        "exemplify",
        "property",
        "sherlock",
        "holmes",
        "exemplifies",
        "property",
        "created",
        "arthur",
        "conan",
        "doyle",
        "portrayed",
        "jeremy",
        "brett",
        "according",
        "zalta",
        "detective",
        "one",
        "sherlock",
        "holmes",
        "essential",
        "property",
        "contrast",
        "infinitely",
        "many",
        "prime",
        "one",
        "sherlock",
        "holmes",
        "essential",
        "property",
        "since",
        "property",
        "included",
        "conception",
        "sherlock",
        "holmes",
        "asymmetry",
        "essential",
        "property",
        "socrates",
        "ordinary",
        "object",
        "socrates",
        "abstract",
        "object",
        "explained",
        "given",
        "theory",
        "definition",
        "proposed",
        "essential",
        "socrates",
        "element",
        "socrates",
        "essential",
        "socrates",
        "socrates",
        "element",
        "see",
        "zalta",
        "detail",
        "fabrice",
        "correia",
        "suggests",
        "different",
        "version",
        "modal",
        "characterization",
        "based",
        "nonstandard",
        "conception",
        "modality",
        "p",
        "essential",
        "property",
        "object",
        "o",
        "case",
        "locally",
        "necessary",
        "o",
        "p",
        "fact",
        "o",
        "order",
        "understand",
        "characterization",
        "must",
        "first",
        "understand",
        "correia",
        "nonstandard",
        "conception",
        "modality",
        "inspired",
        "arthur",
        "prior",
        "philosopher",
        "typically",
        "regard",
        "possible",
        "world",
        "giving",
        "complete",
        "description",
        "possible",
        "state",
        "universe",
        "correia",
        "call",
        "globally",
        "possible",
        "world",
        "locally",
        "possible",
        "world",
        "form",
        "broader",
        "class",
        "include",
        "globally",
        "possible",
        "world",
        "also",
        "strictly",
        "locally",
        "possible",
        "world",
        "incomplete",
        "include",
        "fact",
        "certain",
        "object",
        "strictly",
        "locally",
        "possible",
        "world",
        "globally",
        "possible",
        "world",
        "miniature",
        "pp",
        "correia",
        "suggests",
        "strictly",
        "locally",
        "possible",
        "world",
        "fact",
        "socrates",
        "fact",
        "prime",
        "number",
        "thus",
        "locally",
        "necessary",
        "socrates",
        "property",
        "infinitely",
        "many",
        "prime",
        "thus",
        "one",
        "socrates",
        "essential",
        "property",
        "series",
        "paper",
        "berit",
        "brogaard",
        "joe",
        "salerno",
        "a",
        "b",
        "defended",
        "version",
        "modal",
        "characterization",
        "relies",
        "nonstandard",
        "conception",
        "counterfactuals",
        "p",
        "essential",
        "property",
        "object",
        "o",
        "case",
        "necessary",
        "o",
        "p",
        "o",
        "exists",
        "nothing",
        "p",
        "o",
        "would",
        "exist",
        "order",
        "understand",
        "characterization",
        "must",
        "first",
        "understand",
        "brogaard",
        "salerno",
        "nonstandard",
        "conception",
        "counterfactuals",
        "according",
        "brogaard",
        "salerno",
        "counterfactuals",
        "impossible",
        "antecedent",
        "counterpossibles",
        "false",
        "rather",
        "vacuously",
        "true",
        "standard",
        "account",
        "would",
        "example",
        "brogaard",
        "salerno",
        "would",
        "say",
        "following",
        "counterfactual",
        "false",
        "nothing",
        "property",
        "infinitely",
        "many",
        "prime",
        "socrates",
        "would",
        "exist",
        "since",
        "counterfactual",
        "false",
        "condition",
        "satisfied",
        "thus",
        "socrates",
        "essentially",
        "infinitely",
        "many",
        "prime",
        "another",
        "account",
        "defended",
        "nathan",
        "wildman",
        "suggested",
        "sam",
        "cowling",
        "appeal",
        "david",
        "lewis",
        "distinction",
        "sparse",
        "property",
        "abundant",
        "property",
        "p",
        "essential",
        "property",
        "object",
        "o",
        "case",
        "necessary",
        "o",
        "p",
        "o",
        "exists",
        "p",
        "sparse",
        "property",
        "wildman",
        "cowling",
        "point",
        "several",
        "way",
        "cashing",
        "distinction",
        "sparse",
        "property",
        "abundant",
        "property",
        "see",
        "schaffer",
        "thorough",
        "discussion",
        "basic",
        "idea",
        "sparse",
        "property",
        "somehow",
        "fundamental",
        "abundant",
        "property",
        "somehow",
        "carve",
        "nature",
        "joint",
        "important",
        "plausible",
        "account",
        "distinction",
        "property",
        "invoked",
        "fine",
        "count",
        "sparse",
        "property",
        "thus",
        "condition",
        "satisfied",
        "david",
        "denby",
        "defends",
        "similar",
        "version",
        "modal",
        "characterization",
        "appealing",
        "familiar",
        "distinction",
        "intrinsic",
        "property",
        "extrinsic",
        "property",
        "p",
        "essential",
        "property",
        "object",
        "o",
        "case",
        "necessary",
        "o",
        "p",
        "o",
        "exists",
        "p",
        "intrinsic",
        "property",
        "roughly",
        "intrinsic",
        "property",
        "property",
        "object",
        "posse",
        "isolation",
        "extrinsic",
        "property",
        "property",
        "object",
        "posse",
        "relation",
        "object",
        "different",
        "way",
        "cashing",
        "distinction",
        "important",
        "point",
        "plausible",
        "account",
        "distinction",
        "property",
        "invoked",
        "fine",
        "count",
        "intrinsic",
        "property",
        "thus",
        "condition",
        "satisfied",
        "connection",
        "definitional",
        "characterization",
        "mentioned",
        "fine",
        "also",
        "argues",
        "modal",
        "truth",
        "reducible",
        "truth",
        "essence",
        "metaphysically",
        "necessary",
        "truth",
        "example",
        "identified",
        "proposition",
        "true",
        "virtue",
        "essence",
        "object",
        "whatsoever",
        "reductionist",
        "idea",
        "generated",
        "significant",
        "amount",
        "literature",
        "recent",
        "year",
        "among",
        "others",
        "see",
        "jessica",
        "leech",
        "carlos",
        "romero",
        "robert",
        "michels",
        "nathan",
        "wildman",
        "forthcoming",
        "addition",
        "modal",
        "characterization",
        "definitional",
        "characterization",
        "yet",
        "another",
        "way",
        "characterizing",
        "notion",
        "essential",
        "property",
        "agrees",
        "definitional",
        "characterization",
        "modal",
        "characterization",
        "liberal",
        "count",
        "essential",
        "avoids",
        "appeal",
        "notion",
        "definition",
        "object",
        "explanatory",
        "characterization",
        "essential",
        "property",
        "object",
        "object",
        "deepest",
        "explanatory",
        "propertiesthose",
        "property",
        "figure",
        "fundamentally",
        "explanation",
        "object",
        "possessing",
        "property",
        "example",
        "six",
        "proton",
        "might",
        "count",
        "essential",
        "property",
        "carbon",
        "atom",
        "property",
        "figure",
        "fundamentally",
        "explanation",
        "possession",
        "property",
        "like",
        "bonding",
        "characteristic",
        "sort",
        "account",
        "threatens",
        "make",
        "essentialaccidental",
        "property",
        "distinction",
        "relative",
        "since",
        "count",
        "explanatorily",
        "primary",
        "seems",
        "depend",
        "interest",
        "ability",
        "explainers",
        "advocate",
        "explanatory",
        "characterization",
        "meghan",
        "sullivan",
        "willing",
        "accept",
        "distinction",
        "relative",
        "sense",
        "others",
        "irving",
        "copi",
        "michael",
        "gorman",
        "hold",
        "metaphysical",
        "le",
        "epistemic",
        "understanding",
        "notion",
        "explanation",
        "according",
        "one",
        "thing",
        "explains",
        "another",
        "thing",
        "case",
        "certain",
        "mindindependent",
        "relation",
        "hold",
        "advocate",
        "definitional",
        "characterization",
        "challenged",
        "provide",
        "respectable",
        "understanding",
        "relevant",
        "notion",
        "definition",
        "advocate",
        "explanatory",
        "characterization",
        "challenged",
        "provide",
        "borrow",
        "philosophy",
        "science",
        "respectable",
        "understanding",
        "relevant",
        "notion",
        "explanation",
        "distinction",
        "accidental",
        "essential",
        "property",
        "least",
        "basic",
        "version",
        "account",
        "exclusive",
        "exhaustive",
        "refined",
        "version",
        "account",
        "distinction",
        "remains",
        "exclusive",
        "exhaustive",
        "exhaustiveness",
        "lost",
        "certain",
        "propertieslike",
        "property",
        "infinitely",
        "many",
        "primesare",
        "counted",
        "property",
        "essentialaccidental",
        "distinction",
        "applies",
        "see",
        "discussion",
        "della",
        "rocca",
        "a",
        "addition",
        "seems",
        "root",
        "characterization",
        "go",
        "back",
        "least",
        "work",
        "aristotle",
        "modal",
        "characterization",
        "see",
        "topic",
        "bff",
        "definitional",
        "see",
        "metaphysics",
        "a",
        "explanatory",
        "see",
        "posterior",
        "analytics",
        "bff",
        "notion",
        "essence",
        "aristotle",
        "work",
        "see",
        "entry",
        "aristotle",
        "metaphysics",
        "clear",
        "whether",
        "three",
        "characterization",
        "properly",
        "thought",
        "competing",
        "characterization",
        "single",
        "notion",
        "instead",
        "way",
        "trying",
        "capture",
        "three",
        "related",
        "different",
        "equally",
        "legitimate",
        "notion",
        "similar",
        "point",
        "made",
        "livingstonebanks",
        "cowling",
        "since",
        "modal",
        "characterization",
        "common",
        "since",
        "distinction",
        "essential",
        "accidental",
        "property",
        "topic",
        "entry",
        "almost",
        "always",
        "understood",
        "modally",
        "dominate",
        "remainder",
        "entry"
    ]
}