{
    "main_text": "Compromises of Pregnant Women's Autonomy || Incapacity for Autonomy: Pregnancy in Decisionally Impaired Women\n3.1 Incapacity for Autonomy: Pregnancy in Decisionally Impaired Women\n\nWhen a patient is decisionally impaired or incapacitated, ethical\ndilemmas concerning medical decision-making arise: Should the patient\nbe included in decision-making in a limited way, to the best of her\nabilities, or should paternalistic decision-making take over? Should a\nproxy decision-maker make choices on the basis of the patient's best\ninterest, or by simulating as best she can the autonomous decision\nthat the patient would have made, had she been in a position to make\none? Such issues are familiar in the context of end of life care and\ncare for children and the cognitively impaired.\n\nWhen a pregnant woman is decisionally impaired or incompetent,\nhowever, there are extra layers of ethical complexity to contend with,\nbecause her treatment typically affects not only her, but also her\nchild to-be. The developing fetus clearly has welfare (or at least\nfuture welfare) but no capacity for autonomous choice, and we have no\nformula for combining its interests and moral claims with those of the\nmother. For extra complication, the well-being of the child to-be is\ntypically not independent of the well-being of its mother. Further\nethical issues may arise in cases where, prior to serious decision\nimpairment (due, for example, to massive brain injury or brain death),\nthe pregnant woman has autonomously expressed her preference to\ncontinue to gestate and give birth. In such cases, ethicists at both\nthe clinical and policy-making level may face questions about how to\nrespect the pregnant woman's autonomy while balancing concerns for the\npotential child. They may be required to consider how external factors\nsuch as available caregivers for the potential child may factor into\nthe possibility and desirability of going forward with the pregnancy.\nThus doctors must balance autonomy-based and beneficence-based\nobligations to the pregnant woman, along with beneficence-based\nobligations to the fetus (e.g. Coverdale et al. 2004). When a pregnant\nwoman is decisionally competent, health care practitioners and\nethicists strongly privilege her right to make final treatment\ndecisions in complicated cases where her interests may conflict with\nthose of her future child (although see section 3.2 below). Moreover,\nthe fetus generally has no legal standing that would allow its\ninterest to override the pregnant woman's interest (Sperling 2006).\nBut when the pregnant woman has diminished or no autonomy, the\nsituation is murkier.\n3.1.1 Pregnancy in Fully Incapacitated Women\n\nCases have arisen in which a pregnant woman has zero decisional\ncapacity and no hope of future agency, for instance when she is in a\nlong-term persistent vegetative state or has suffered frontal brain\ndeath and is being kept alive artificially (for recent case studies\nsee, e.g., Said et al. 2013; Esmaeilzadeh et al. 2010). The central\nquestions raised in such cases include whether it is ethical to keep a\npregnant woman alive for the sole purpose of continuing the pregnancy,\nwho should make this determination, and which considerations should\nfactor into that decision. One recent case demonstrates the continuing\npower of fetal protections in contexts where anti-abortion laws are\nstill in place. In 2013, a woman from Texas became braindead at 14\nweeks pregnant, and was kept on life-support against her and her\nfamily's wishes, until it was established that her fetus was also\nbrain dead (Ecker 2014). In many situations, however, the woman's\npreference will remain unclear. In 1992, a pregnant German woman\nsuffered brain death in a car accident that did no apparent damage to\nthe fetus, and debate ensued over whether to keep her alive\nartificially so that the ‘Erlanger baby’ could continue to\ngestate (Anstötz 1993). (The woman miscarried while the debate\nwas still in progress.) Other recent medical attempts to continue\nfetal gestation in the wake of maternal brain death have enjoyed some\nsuccess (Esmaeilzadeh et al. 2010).\n\nIn some of these cases, questions about how to include the woman's\nvoice or respect her agency are off the table, and her welfare\ninterests, if any, are minimal. She has no conscious experience or\nfuture narrative to protect. We may, however, believe that she still\nhas interests in dignity and in having her former narrative and values\nrespected. Protecting these interests may preclude certain forms of\ntreatment of the dead, including artificially continuing pregnancy\n(Sperling 2006 77-80). Protecting these interests may also,\nconversely, raise issues regarding performing abortions on pregnant\nwomen who have become brain dead (Watt 2016 57-58). Some feel that it\nis unacceptable to use a pregnant woman's body as a mere means by\ncontinuing her life solely for its incubation function; others will\nargue that if the father-to-be wants to raise his child, it is callous\nto deny the child-to-be its chance at life and the father his chance\nat parenthood in virtue of abstract concerns about instrumentalism and\nrespect, given that the woman will experience no extra suffering, and\nno thwarting of her autonomous preferences (assuming she left no\nadvance directive). Anstötz (1993) argues that the fetus has a\nright to life sufficiently strong to mandate that the woman\nbe kept alive to enable the fetus to become viable. Fost (1994) argues\nthat a brain-dead pregnant woman ought not be counted as a person with\ninterests relevant to the moral calculation, and he urges moving moral\nattention away from the ‘interests’ of the fetus as well.\nInstead, he urges that the next of kin ought to have the right to\ndecide when to remove life support, as they would in normal cases of\nnon-pregnant patients.\n\nHilde Lindemann (writing as Hilde Lindemann Nelson, 1994) and Laura\nPurdy (1994) argue that keeping a brain dead woman alive for the\nsingular purpose of continuing her pregnancy is problematic. Lindemann\nargues that the woman no longer exists as a person of the sort that\ncan have agent-relative duties towards her fetus. Furthermore, keeping\nher alive as an incubator grossly misrepresents the significance of\npregnancy, reducing it to a passive biological process rather than a\ncreative, cooperative process involving the woman's agency. Similarly,\nPurdy (1994) argues that such postmortem pregnancies contribute to a\nproblematic view of pregnant women as mere fetal\n‘containers’. On the other hand, in these cases\npregnancy is clearly not a creative or active project for the\nwoman, and, while it may be symbolically problematic not to\nacknowledge women's creative, agential role in typical pregnancies, it\nseems odd to argue that we should prevent pregnancies that do not fit\nthis typical profile from existing in order to symbolically protect\nthe myth that they always do so.\n\nPurdy also points out that sustaining such pregnancies is ethically\nproblematic because it involves extreme interventions on women's\nbodies without their consent. Both Lindemann and Purdy question\nwhether such extraordinary and expensive medical interventions, aimed\nat saving a fetus who is not yet a baby, are a just or reasonable use\nof medical resources (especially if the fetus stands a low chance of\nsurvival and normal development). Lindemann worries, furthermore, that\nsuch extraordinary measures help enforce an image of the fetus as\nalready a person with a claim on resources as large as or even larger\nthan that of existing persons.\n3.1.2 Pregnancy in Decisionally Impaired Women\n\nPregnant women with limited capacity for autonomous agency and\ndecision-making (due to cognitive disability, mental illness, drug\nuse, etc.) still have the right to have their (limited) autonomy\nrespected and fostered to the largest extent possible; at the same\ntime, both they and their future children must be protected somehow\nfrom harms that bad choices stemming from decisional impairment could\ncause. Such women are often particularly socially vulnerable and\nfrequent targets of manipulation; they face multiple barriers to\nhaving their reproductive and sexual health needs recognized and met\n(e.g. see Greenwood and Wilkinson 2013 on women with intellectual\ndisabilities). Protecting their agency and well-being as well as the\nwell-being of their future children can thus be a delicate\nnegotiation. Furthermore, physicians and family members may not be\nneutral parties when it comes to assessing a pregnant woman's level of\ndecisional competence: if they disagree with her expressed desires\nconcerning her own care (for example, her opposition to abortion, or\nrefusal of medication or bed rest) or believe her choices put her\nfetus at unacceptable risk, they may be motivated to overestimate her\nlevel of decisional impairment, thereby justifying paternalistically\noverriding her expressed wishes.\n\nDouglas Diekema (2003) points out that decisional capacity is not a\nthreshold capacity, and that it may fluctuate with timing, context,\nand type of decision. Hence, in settling on how much paternalism is\nappropriate in managing a decisionally impaired patient, doctors have\na responsibility to try to find a time and approach that will promote\nand assist rather than foreclose the possibility of the patient's\nmeaningful autonomous participation in medical decision making.\nFacilitating patients' autonomy in reproductive decision-making while\nprotecting their best interests is perhaps especially challenging in\ncases where mood or personality disorders may erratically influence\ndecision-making capacity (e.g. Zalpuri et al. 2015). Coverdale et al.\n(2004) argue that respecting the autonomy of decisionally compromised\npatients involves actively working towards removing or diminishing\ncircumstantial and reversible barriers to participation in\ndecision-making. This might include education, creative forms of\ninvolvement in decision-making from loved ones, postponing a medical\ndecision until after psychotropic medication has had time to become\neffective, accommodating a patient's special needs for an environment\nconducive to making a decision, etc. The presence of a fetus should\nnot serve as ground for detracting from our duty to protect a pregnant\nwoman's right to participate in decisions about her own care to\nwhatever extent she is capable (which is not to say that paternalistic\ninterventions on behalf of her or her fetus's welfare are never\nappropriate for decisionally impaired women).\n",
    "section_title": "3.1 Incapacity for Autonomy: Pregnancy in Decisionally Impaired Women",
    "entry_title": "Pregnancy, Birth, and Medicine",
    "hierarchy_title": "Pregnancy, Birth, and Medicine || Compromises of Pregnant Women's Autonomy || Incapacity for Autonomy: Pregnancy in Decisionally Impaired Women",
    "tokenized_text": [
        "compromise",
        "pregnant",
        "woman",
        "s",
        "autonomy",
        "incapacity",
        "autonomy",
        "pregnancy",
        "decisionally",
        "impaired",
        "woman",
        "incapacity",
        "autonomy",
        "pregnancy",
        "decisionally",
        "impaired",
        "woman",
        "patient",
        "decisionally",
        "impaired",
        "incapacitated",
        "ethical",
        "dilemma",
        "concerning",
        "medical",
        "decisionmaking",
        "arise",
        "patient",
        "included",
        "decisionmaking",
        "limited",
        "way",
        "best",
        "ability",
        "paternalistic",
        "decisionmaking",
        "take",
        "proxy",
        "decisionmaker",
        "make",
        "choice",
        "basis",
        "patient",
        "s",
        "best",
        "interest",
        "simulating",
        "best",
        "autonomous",
        "decision",
        "patient",
        "would",
        "made",
        "position",
        "make",
        "one",
        "issue",
        "familiar",
        "context",
        "end",
        "life",
        "care",
        "care",
        "child",
        "cognitively",
        "impaired",
        "pregnant",
        "woman",
        "decisionally",
        "impaired",
        "incompetent",
        "however",
        "extra",
        "layer",
        "ethical",
        "complexity",
        "contend",
        "treatment",
        "typically",
        "affect",
        "also",
        "child",
        "tobe",
        "developing",
        "fetus",
        "clearly",
        "welfare",
        "least",
        "future",
        "welfare",
        "capacity",
        "autonomous",
        "choice",
        "formula",
        "combining",
        "interest",
        "moral",
        "claim",
        "mother",
        "extra",
        "complication",
        "wellbeing",
        "child",
        "tobe",
        "typically",
        "independent",
        "wellbeing",
        "mother",
        "ethical",
        "issue",
        "may",
        "arise",
        "case",
        "prior",
        "serious",
        "decision",
        "impairment",
        "due",
        "example",
        "massive",
        "brain",
        "injury",
        "brain",
        "death",
        "pregnant",
        "woman",
        "autonomously",
        "expressed",
        "preference",
        "continue",
        "gestate",
        "give",
        "birth",
        "case",
        "ethicist",
        "clinical",
        "policymaking",
        "level",
        "may",
        "face",
        "question",
        "respect",
        "pregnant",
        "woman",
        "s",
        "autonomy",
        "balancing",
        "concern",
        "potential",
        "child",
        "may",
        "required",
        "consider",
        "external",
        "factor",
        "available",
        "caregiver",
        "potential",
        "child",
        "may",
        "factor",
        "possibility",
        "desirability",
        "going",
        "forward",
        "pregnancy",
        "thus",
        "doctor",
        "must",
        "balance",
        "autonomybased",
        "beneficencebased",
        "obligation",
        "pregnant",
        "woman",
        "along",
        "beneficencebased",
        "obligation",
        "fetus",
        "eg",
        "coverdale",
        "et",
        "al",
        "pregnant",
        "woman",
        "decisionally",
        "competent",
        "health",
        "care",
        "practitioner",
        "ethicist",
        "strongly",
        "privilege",
        "right",
        "make",
        "final",
        "treatment",
        "decision",
        "complicated",
        "case",
        "interest",
        "may",
        "conflict",
        "future",
        "child",
        "although",
        "see",
        "section",
        "moreover",
        "fetus",
        "generally",
        "legal",
        "standing",
        "would",
        "allow",
        "interest",
        "override",
        "pregnant",
        "woman",
        "s",
        "interest",
        "sperling",
        "pregnant",
        "woman",
        "diminished",
        "autonomy",
        "situation",
        "murkier",
        "pregnancy",
        "fully",
        "incapacitated",
        "woman",
        "case",
        "arisen",
        "pregnant",
        "woman",
        "zero",
        "decisional",
        "capacity",
        "hope",
        "future",
        "agency",
        "instance",
        "longterm",
        "persistent",
        "vegetative",
        "state",
        "suffered",
        "frontal",
        "brain",
        "death",
        "kept",
        "alive",
        "artificially",
        "recent",
        "case",
        "study",
        "see",
        "eg",
        "said",
        "et",
        "al",
        "esmaeilzadeh",
        "et",
        "al",
        "central",
        "question",
        "raised",
        "case",
        "include",
        "whether",
        "ethical",
        "keep",
        "pregnant",
        "woman",
        "alive",
        "sole",
        "purpose",
        "continuing",
        "pregnancy",
        "make",
        "determination",
        "consideration",
        "factor",
        "decision",
        "one",
        "recent",
        "case",
        "demonstrates",
        "continuing",
        "power",
        "fetal",
        "protection",
        "context",
        "antiabortion",
        "law",
        "still",
        "place",
        "woman",
        "texas",
        "became",
        "braindead",
        "week",
        "pregnant",
        "kept",
        "lifesupport",
        "family",
        "s",
        "wish",
        "established",
        "fetus",
        "also",
        "brain",
        "dead",
        "ecker",
        "many",
        "situation",
        "however",
        "woman",
        "s",
        "preference",
        "remain",
        "unclear",
        "pregnant",
        "german",
        "woman",
        "suffered",
        "brain",
        "death",
        "car",
        "accident",
        "apparent",
        "damage",
        "fetus",
        "debate",
        "ensued",
        "whether",
        "keep",
        "alive",
        "artificially",
        "erlanger",
        "baby",
        "could",
        "continue",
        "gestate",
        "anstötz",
        "woman",
        "miscarried",
        "debate",
        "still",
        "progress",
        "recent",
        "medical",
        "attempt",
        "continue",
        "fetal",
        "gestation",
        "wake",
        "maternal",
        "brain",
        "death",
        "enjoyed",
        "success",
        "esmaeilzadeh",
        "et",
        "al",
        "case",
        "question",
        "include",
        "woman",
        "s",
        "voice",
        "respect",
        "agency",
        "table",
        "welfare",
        "interest",
        "minimal",
        "conscious",
        "experience",
        "future",
        "narrative",
        "protect",
        "may",
        "however",
        "believe",
        "still",
        "interest",
        "dignity",
        "former",
        "narrative",
        "value",
        "respected",
        "protecting",
        "interest",
        "may",
        "preclude",
        "certain",
        "form",
        "treatment",
        "dead",
        "including",
        "artificially",
        "continuing",
        "pregnancy",
        "sperling",
        "protecting",
        "interest",
        "may",
        "also",
        "conversely",
        "raise",
        "issue",
        "regarding",
        "performing",
        "abortion",
        "pregnant",
        "woman",
        "become",
        "brain",
        "dead",
        "watt",
        "feel",
        "unacceptable",
        "use",
        "pregnant",
        "woman",
        "s",
        "body",
        "mere",
        "mean",
        "continuing",
        "life",
        "solely",
        "incubation",
        "function",
        "others",
        "argue",
        "fathertobe",
        "want",
        "raise",
        "child",
        "callous",
        "deny",
        "childtobe",
        "chance",
        "life",
        "father",
        "chance",
        "parenthood",
        "virtue",
        "abstract",
        "concern",
        "instrumentalism",
        "respect",
        "given",
        "woman",
        "experience",
        "extra",
        "suffering",
        "thwarting",
        "autonomous",
        "preference",
        "assuming",
        "left",
        "advance",
        "directive",
        "anstötz",
        "argues",
        "fetus",
        "right",
        "life",
        "sufficiently",
        "strong",
        "mandate",
        "woman",
        "kept",
        "alive",
        "enable",
        "fetus",
        "become",
        "viable",
        "fost",
        "argues",
        "braindead",
        "pregnant",
        "woman",
        "ought",
        "counted",
        "person",
        "interest",
        "relevant",
        "moral",
        "calculation",
        "urge",
        "moving",
        "moral",
        "attention",
        "away",
        "interest",
        "fetus",
        "well",
        "instead",
        "urge",
        "next",
        "kin",
        "ought",
        "right",
        "decide",
        "remove",
        "life",
        "support",
        "would",
        "normal",
        "case",
        "nonpregnant",
        "patient",
        "hilde",
        "lindemann",
        "writing",
        "hilde",
        "lindemann",
        "nelson",
        "laura",
        "purdy",
        "argue",
        "keeping",
        "brain",
        "dead",
        "woman",
        "alive",
        "singular",
        "purpose",
        "continuing",
        "pregnancy",
        "problematic",
        "lindemann",
        "argues",
        "woman",
        "longer",
        "exists",
        "person",
        "sort",
        "agentrelative",
        "duty",
        "towards",
        "fetus",
        "furthermore",
        "keeping",
        "alive",
        "incubator",
        "grossly",
        "misrepresents",
        "significance",
        "pregnancy",
        "reducing",
        "passive",
        "biological",
        "process",
        "rather",
        "creative",
        "cooperative",
        "process",
        "involving",
        "woman",
        "s",
        "agency",
        "similarly",
        "purdy",
        "argues",
        "postmortem",
        "pregnancy",
        "contribute",
        "problematic",
        "view",
        "pregnant",
        "woman",
        "mere",
        "fetal",
        "container",
        "hand",
        "case",
        "pregnancy",
        "clearly",
        "creative",
        "active",
        "project",
        "woman",
        "may",
        "symbolically",
        "problematic",
        "acknowledge",
        "woman",
        "s",
        "creative",
        "agential",
        "role",
        "typical",
        "pregnancy",
        "seems",
        "odd",
        "argue",
        "prevent",
        "pregnancy",
        "fit",
        "typical",
        "profile",
        "existing",
        "order",
        "symbolically",
        "protect",
        "myth",
        "always",
        "purdy",
        "also",
        "point",
        "sustaining",
        "pregnancy",
        "ethically",
        "problematic",
        "involves",
        "extreme",
        "intervention",
        "woman",
        "s",
        "body",
        "without",
        "consent",
        "lindemann",
        "purdy",
        "question",
        "whether",
        "extraordinary",
        "expensive",
        "medical",
        "intervention",
        "aimed",
        "saving",
        "fetus",
        "yet",
        "baby",
        "reasonable",
        "use",
        "medical",
        "resource",
        "especially",
        "fetus",
        "stand",
        "low",
        "chance",
        "survival",
        "normal",
        "development",
        "lindemann",
        "worry",
        "furthermore",
        "extraordinary",
        "measure",
        "help",
        "enforce",
        "image",
        "fetus",
        "already",
        "person",
        "claim",
        "resource",
        "large",
        "even",
        "larger",
        "existing",
        "person",
        "pregnancy",
        "decisionally",
        "impaired",
        "woman",
        "pregnant",
        "woman",
        "limited",
        "capacity",
        "autonomous",
        "agency",
        "decisionmaking",
        "due",
        "cognitive",
        "disability",
        "mental",
        "illness",
        "drug",
        "use",
        "etc",
        "still",
        "right",
        "limited",
        "autonomy",
        "respected",
        "fostered",
        "largest",
        "extent",
        "possible",
        "time",
        "future",
        "child",
        "must",
        "protected",
        "somehow",
        "harm",
        "bad",
        "choice",
        "stemming",
        "decisional",
        "impairment",
        "could",
        "cause",
        "woman",
        "often",
        "particularly",
        "socially",
        "vulnerable",
        "frequent",
        "target",
        "manipulation",
        "face",
        "multiple",
        "barrier",
        "reproductive",
        "sexual",
        "health",
        "need",
        "recognized",
        "met",
        "eg",
        "see",
        "greenwood",
        "wilkinson",
        "woman",
        "intellectual",
        "disability",
        "protecting",
        "agency",
        "wellbeing",
        "well",
        "wellbeing",
        "future",
        "child",
        "thus",
        "delicate",
        "negotiation",
        "furthermore",
        "physician",
        "family",
        "member",
        "may",
        "neutral",
        "party",
        "come",
        "assessing",
        "pregnant",
        "woman",
        "s",
        "level",
        "decisional",
        "competence",
        "disagree",
        "expressed",
        "desire",
        "concerning",
        "care",
        "example",
        "opposition",
        "abortion",
        "refusal",
        "medication",
        "bed",
        "rest",
        "believe",
        "choice",
        "put",
        "fetus",
        "unacceptable",
        "risk",
        "may",
        "motivated",
        "overestimate",
        "level",
        "decisional",
        "impairment",
        "thereby",
        "justifying",
        "paternalistically",
        "overriding",
        "expressed",
        "wish",
        "douglas",
        "diekema",
        "point",
        "decisional",
        "capacity",
        "threshold",
        "capacity",
        "may",
        "fluctuate",
        "timing",
        "context",
        "type",
        "decision",
        "hence",
        "settling",
        "much",
        "paternalism",
        "appropriate",
        "managing",
        "decisionally",
        "impaired",
        "patient",
        "doctor",
        "responsibility",
        "try",
        "find",
        "time",
        "approach",
        "promote",
        "assist",
        "rather",
        "foreclose",
        "possibility",
        "patient",
        "s",
        "meaningful",
        "autonomous",
        "participation",
        "medical",
        "decision",
        "making",
        "facilitating",
        "patient",
        "autonomy",
        "reproductive",
        "decisionmaking",
        "protecting",
        "best",
        "interest",
        "perhaps",
        "especially",
        "challenging",
        "case",
        "mood",
        "personality",
        "disorder",
        "may",
        "erratically",
        "influence",
        "decisionmaking",
        "capacity",
        "eg",
        "zalpuri",
        "et",
        "al",
        "coverdale",
        "et",
        "al",
        "argue",
        "respecting",
        "autonomy",
        "decisionally",
        "compromised",
        "patient",
        "involves",
        "actively",
        "working",
        "towards",
        "removing",
        "diminishing",
        "circumstantial",
        "reversible",
        "barrier",
        "participation",
        "decisionmaking",
        "might",
        "include",
        "education",
        "creative",
        "form",
        "involvement",
        "decisionmaking",
        "loved",
        "one",
        "postponing",
        "medical",
        "decision",
        "psychotropic",
        "medication",
        "time",
        "become",
        "effective",
        "accommodating",
        "patient",
        "s",
        "special",
        "need",
        "environment",
        "conducive",
        "making",
        "decision",
        "etc",
        "presence",
        "fetus",
        "serve",
        "ground",
        "detracting",
        "duty",
        "protect",
        "pregnant",
        "woman",
        "s",
        "right",
        "participate",
        "decision",
        "care",
        "whatever",
        "extent",
        "capable",
        "say",
        "paternalistic",
        "intervention",
        "behalf",
        "fetus",
        "s",
        "welfare",
        "never",
        "appropriate",
        "decisionally",
        "impaired",
        "woman"
    ]
}