{
    "main_text": "Socrates\n2. Socrates\n\nIn this section we confine ourselves to the character Socrates in\nPlato’s dialogues, and indeed to only certain ones of the\ndialogues in which a Socrates character plays a role. In those\ndialogues in which he plays a major role, Socrates varies considerably\nbetween two extremes. On the one hand, there is the Socrates who\nclaims to know nothing about virtue and confines himself to asking\nother characters questions; this Socrates is found in the\nApology and in certain dialogues most of which end\ninconclusively. These dialogues, e.g., Charmides,\nLaches, Crito, Euthydemus, and\nEuthyphro, are called aporetic. On the other hand, in other\ndialogues we find a Socrates who expounds positive teachings about\nvirtue; this Socrates usually asks questions only to elicit agreement.\nThese dialogues are didactic, and conclusive in tone, e.g.,\nRepublic, Phaedo, Phaedrus, and Philebus. However,\nthese distinctions between kinds of dialogues and kinds of Socratic\ncharacters are not exclusive; there are dialogues that mix the\naporetic and conclusive styles, e.g., Protagoras, Meno, and\nGorgias. In observing these distinctions, we refer only to\nthe characteristic style of the dialogue and leave aside controversies\nabout the relative dates of composition of the dialogues. (See the\nentry on\n Plato,\n especially the section on\n Socrates\n and the section on\n the historical Socrates.)\n\nThe significance of this distinction among dialogues is that one can\nisolate a strain of moral teaching in the aporetic and mixed\ndialogues. In spite of their inconclusive nature, in the aporetic\ndialogues the character Socrates maintains principles about morality\nthat he seems to take to be fundamental. In the mixed dialogues we\nfind similar teaching. This strain is distinct enough from the\naccounts of morality in the more didactic dialogues that it has been\ncalled Socratic, as opposed to Platonic, and associated with the\nhistorical personage’s own views. In what follows we limit\nourselves to this “Socratic” moral teaching –\nwithout taking a position about the relation of “Socratic”\nmoral teaching to that of the historical Socrates. For our purposes it\nis sufficient to point out a distinction between kinds of moral\nteaching in the dialogues. We will focus on the aporetic dialogues as\nwell as the mixed dialogues Protagoras, Gorgias, and\nMeno.\n\nThe first feature of Socratic teaching is its heroic quality. In the\nApology, Socrates says that a man worth anything at all does\nnot reckon whether his course of action endangers his life or\nthreatens death. He looks only at one thing – whether what he\ndoes is just or not, the work of a good or of a bad man (28b–c).\nSaid in the context of his trial, this statement is both about himself\nand a fundamental claim of his moral teaching. Socrates puts moral\nconsiderations above all others. If we think of justice as, roughly,\nthe way we treat others, the just actions to which he refers cover a\nwide range. It is unjust to rob temples, betray friends, steal, break\noaths, commit adultery, and mistreat parents (Rep\n443a–b). A similarly strong statement about wrong-doing is found\nin the Crito, where the question is whether Socrates should\nsave his life by escaping from the jail in Athens and aborting the\nsentence of death. Socrates says that whether he should escape or not\nmust be governed only by whether it is just or unjust to do so (48d).\nObviously, by posing wrong-doing against losing one’s life,\nSocrates means to emphasize that nothing outweighs in positive value\nthe disvalue of doing unjust actions. In such passages, then, Socrates\nseems to be a moral hero, willing to sacrifice his very life rather\nthan commit an injustice, and to recommend such heroism to others.\n\nHowever, this heroism also includes an important element of\nself-regard. In the passage from the Apology just quoted\nSocrates goes on to describe his approach to the citizens of Athens.\nHe chides them for being absorbed in the acquisition of wealth,\nreputation, and honor while they do not take care for nor think about\nwisdom, truth, and how to make their souls better (Ap.\n29d–e). As he develops this idea it becomes clear that the\nperfection of the soul, making it better, means acquiring and having\nmoral virtue. Rather than heaping up riches and honor, Athenians\nshould seek to perfect their souls in virtue. From this exhortation we\ncan conclude that for Socrates psychological good outweighs material\ngood and that virtue is a psychological good of the first importance.\nThe Crito gives another perspective on psychological good.\nSocrates says (as something obvious to everyone) that life is not\nworth living if that which is harmed by disease and benefited by\nhealth – i.e., the body – is ruined. But even more so, he\nadds, life is not worth living if that which is harmed by wrong-doing\n(to adikon) and benefited by the right – sc.\nthe soul – is ruined, insofar as the soul is more valuable than\nthe body (47e–48a). We can understand this claim in positive\nterms. Virtue is the chief psychological good; wrong-doing destroys\nvirtue. So Socrates’ strong commitment to virtue reflects his\nbelief in its value for the soul, as well as the importance of the\nsoul’s condition for the quality of our lives.\n\nA second feature of Socratic teaching is its intellectualism. Socratic\nintellectualism is usually expressed in the claim that virtue is\nknowledge, implying that if one knows what is good one will do what is\ngood. We find a clear statement of the claim in Protagoras\n352c; but it underlies a lot of Socratic teaching. The idea is\nparadoxical because it flies in the face of what seems to be the\nordinary experience of knowingly doing what is not good, called\nakrasia or being overcome (sometimes anachronistically\ntranslated as weakness of will). However, Socrates defends the idea\nthat akrasia is impossible. First, he argues that virtue is\nall one needs for happiness. In the Apology (41c), Socrates\nsays that no evil at all can come to a good man either in living or in\ndying (…ouk esti andri agathô(i) kakon ouden oute\nzônti oute teleutêsanti), implying the good\nman’s virtue alone makes him proof against bad fortune. In the\nCrito (48b), he says living well and finely and justly are\nthe same thing (to de eu kai kalôs kai dikaiôs\n[zên] hoti tauton estin…). In turn, in the Meno\n(77c–78b), Socrates argues that everyone desires happiness,\ni.e., one’s own welfare. So, in the first place, one always has\na good reason for acting virtuously; doing so entails one’s own\nhappiness. However, even if the link between virtue and happiness is\ngranted, another problem remains. It is possible that one can,\nknowingly, act against one’s happiness, understood, as it is by\nSocrates, as one’s own welfare. It seems that an individual can\nchoose to do what is not in her own best interest. People can all too\neasily desire and go after the pastry that they know is bad for them.\nSocrates, however, seems to think that once one recognizes (i.e.,\nreally knows and fully appreciates) that the pastry is not good in\nthis way, one will cease to desire it. There is no residual desire\nfor, e.g., pleasure, that might compete with the desire for what is\ngood. This position is called intellectualism because it implies that\nwhat ultimately motivates any action is some cognitive state, rational\nor doxastic: if you know what is good you will do it, and if you do an\naction, and it is bad, that is because you thought somehow that it was\ngood. All error in such choices is due to ignorance.\n\nIn support of the idea that if one knows what happiness is, one will\npursue it, Socrates argues, in the Euthydemus, that wisdom is\nnecessary and sufficient for happiness. While most of this dialogue is\ngiven over to Euthydemus’ and Dionysiodorus’ eristic\ndisplay, there are two Socratic interludes. In the first of these\n– in a passage that has a parallel in Meno (88a ff)\n– Socrates helps the young Cleinias to see that wisdom is a kind\nof knowledge that infallibly brings happiness. He uses an analogy with\ncraft (technê); a carpenter must not only have but know\nhow to use his tools and materials to be successful (Euthyd.\n280b–d). In turn, someone may have such goods as health, wealth,\ngood birth, and beauty, as well as the virtues of justice, moderation,\ncourage, and wisdom (279a–c). Wisdom is the most important,\nhowever, because, like carpentry, for example, it is a kind of\nknowledge, about how to use the other assets so that they are\nbeneficial (281b–c). Moreover, all of these other so-called\ngoods are useless – in fact, even harmful – without\nwisdom, because without it one will misuse any of the other assets one\nmay possess, so as to act not well but badly. Wisdom is the only\nunconditional good (281d–e). Socrates’ argument leaves it\nambiguous whether wisdom (taken together with its exercise) is\nidentical with happiness or whether it is the dominant and essential\ncomponent of happiness (282a–b).\n\nIn this account, the focus is on a kind of knowledge as the active\ningredient in happiness. The other parts of the account are certain\nassets that seem as passive in relation to wisdom as wood and tools\nare to the carpenter. Socratic intellectualism has been criticized for\neither ignoring the non-rational, desiderative and volitional causes\nof human action or providing an implausibly rationalist account of\nthem. In either case, the common charge is that it fails to account\nfor or appreciate the apparent complexities of moral psychology.\n",
    "section_title": "2. Socrates",
    "entry_title": "Ancient Ethical Theory",
    "hierarchy_title": "Ancient Ethical Theory || Socrates",
    "tokenized_text": [
        "socrates",
        "socrates",
        "section",
        "confine",
        "character",
        "socrates",
        "plato",
        "dialogue",
        "indeed",
        "certain",
        "one",
        "dialogue",
        "socrates",
        "character",
        "play",
        "role",
        "dialogue",
        "play",
        "major",
        "role",
        "socrates",
        "varies",
        "considerably",
        "two",
        "extreme",
        "one",
        "hand",
        "socrates",
        "claim",
        "know",
        "nothing",
        "virtue",
        "confines",
        "asking",
        "character",
        "question",
        "socrates",
        "found",
        "apology",
        "certain",
        "dialogue",
        "end",
        "inconclusively",
        "dialogue",
        "eg",
        "charmides",
        "laches",
        "crito",
        "euthydemus",
        "euthyphro",
        "called",
        "aporetic",
        "hand",
        "dialogue",
        "find",
        "socrates",
        "expounds",
        "positive",
        "teaching",
        "virtue",
        "socrates",
        "usually",
        "asks",
        "question",
        "elicit",
        "agreement",
        "dialogue",
        "didactic",
        "conclusive",
        "tone",
        "eg",
        "republic",
        "phaedo",
        "phaedrus",
        "philebus",
        "however",
        "distinction",
        "kind",
        "dialogue",
        "kind",
        "socratic",
        "character",
        "exclusive",
        "dialogue",
        "mix",
        "aporetic",
        "conclusive",
        "style",
        "eg",
        "protagoras",
        "meno",
        "gorgias",
        "observing",
        "distinction",
        "refer",
        "characteristic",
        "style",
        "dialogue",
        "leave",
        "aside",
        "controversy",
        "relative",
        "date",
        "composition",
        "dialogue",
        "see",
        "entry",
        "plato",
        "especially",
        "section",
        "socrates",
        "section",
        "historical",
        "socrates",
        "significance",
        "distinction",
        "among",
        "dialogue",
        "one",
        "isolate",
        "strain",
        "moral",
        "teaching",
        "aporetic",
        "mixed",
        "dialogue",
        "spite",
        "inconclusive",
        "nature",
        "aporetic",
        "dialogue",
        "character",
        "socrates",
        "maintains",
        "principle",
        "morality",
        "seems",
        "take",
        "fundamental",
        "mixed",
        "dialogue",
        "find",
        "similar",
        "teaching",
        "strain",
        "distinct",
        "enough",
        "account",
        "morality",
        "didactic",
        "dialogue",
        "called",
        "socratic",
        "opposed",
        "platonic",
        "associated",
        "historical",
        "personage",
        "view",
        "follows",
        "limit",
        "socratic",
        "moral",
        "teaching",
        "without",
        "taking",
        "position",
        "relation",
        "socratic",
        "moral",
        "teaching",
        "historical",
        "socrates",
        "purpose",
        "sufficient",
        "point",
        "distinction",
        "kind",
        "moral",
        "teaching",
        "dialogue",
        "focus",
        "aporetic",
        "dialogue",
        "well",
        "mixed",
        "dialogue",
        "protagoras",
        "gorgias",
        "meno",
        "first",
        "feature",
        "socratic",
        "teaching",
        "heroic",
        "quality",
        "apology",
        "socrates",
        "say",
        "man",
        "worth",
        "anything",
        "reckon",
        "whether",
        "course",
        "action",
        "endangers",
        "life",
        "threatens",
        "death",
        "look",
        "one",
        "thing",
        "whether",
        "work",
        "good",
        "bad",
        "man",
        "bc",
        "said",
        "context",
        "trial",
        "statement",
        "fundamental",
        "claim",
        "moral",
        "teaching",
        "socrates",
        "put",
        "moral",
        "consideration",
        "others",
        "think",
        "justice",
        "roughly",
        "way",
        "treat",
        "others",
        "action",
        "refers",
        "cover",
        "wide",
        "range",
        "unjust",
        "rob",
        "temple",
        "betray",
        "friend",
        "steal",
        "break",
        "oath",
        "commit",
        "adultery",
        "mistreat",
        "parent",
        "rep",
        "ab",
        "similarly",
        "strong",
        "statement",
        "wrongdoing",
        "found",
        "crito",
        "question",
        "whether",
        "socrates",
        "save",
        "life",
        "escaping",
        "jail",
        "athens",
        "aborting",
        "sentence",
        "death",
        "socrates",
        "say",
        "whether",
        "escape",
        "must",
        "governed",
        "whether",
        "unjust",
        "d",
        "obviously",
        "posing",
        "wrongdoing",
        "losing",
        "one",
        "life",
        "socrates",
        "mean",
        "emphasize",
        "nothing",
        "outweighs",
        "positive",
        "value",
        "disvalue",
        "unjust",
        "action",
        "passage",
        "socrates",
        "seems",
        "moral",
        "hero",
        "willing",
        "sacrifice",
        "life",
        "rather",
        "commit",
        "injustice",
        "recommend",
        "heroism",
        "others",
        "however",
        "heroism",
        "also",
        "includes",
        "important",
        "element",
        "selfregard",
        "passage",
        "apology",
        "quoted",
        "socrates",
        "go",
        "describe",
        "approach",
        "citizen",
        "athens",
        "chides",
        "absorbed",
        "acquisition",
        "wealth",
        "reputation",
        "honor",
        "take",
        "care",
        "think",
        "wisdom",
        "truth",
        "make",
        "soul",
        "better",
        "ap",
        "de",
        "develops",
        "idea",
        "becomes",
        "clear",
        "perfection",
        "soul",
        "making",
        "better",
        "mean",
        "acquiring",
        "moral",
        "virtue",
        "rather",
        "heaping",
        "rich",
        "honor",
        "athenian",
        "seek",
        "perfect",
        "soul",
        "virtue",
        "exhortation",
        "conclude",
        "socrates",
        "psychological",
        "good",
        "outweighs",
        "material",
        "good",
        "virtue",
        "psychological",
        "good",
        "first",
        "importance",
        "crito",
        "give",
        "another",
        "perspective",
        "psychological",
        "good",
        "socrates",
        "say",
        "something",
        "obvious",
        "everyone",
        "life",
        "worth",
        "living",
        "harmed",
        "disease",
        "benefited",
        "health",
        "ie",
        "body",
        "ruined",
        "even",
        "add",
        "life",
        "worth",
        "living",
        "harmed",
        "wrongdoing",
        "adikon",
        "benefited",
        "right",
        "sc",
        "soul",
        "ruined",
        "insofar",
        "soul",
        "valuable",
        "body",
        "ea",
        "understand",
        "claim",
        "positive",
        "term",
        "virtue",
        "chief",
        "psychological",
        "good",
        "wrongdoing",
        "destroys",
        "virtue",
        "socrates",
        "strong",
        "commitment",
        "virtue",
        "reflects",
        "belief",
        "value",
        "soul",
        "well",
        "importance",
        "soul",
        "condition",
        "quality",
        "life",
        "second",
        "feature",
        "socratic",
        "teaching",
        "intellectualism",
        "socratic",
        "intellectualism",
        "usually",
        "expressed",
        "claim",
        "virtue",
        "knowledge",
        "implying",
        "one",
        "know",
        "good",
        "one",
        "good",
        "find",
        "clear",
        "statement",
        "claim",
        "protagoras",
        "c",
        "underlies",
        "lot",
        "socratic",
        "teaching",
        "idea",
        "paradoxical",
        "fly",
        "face",
        "seems",
        "ordinary",
        "experience",
        "knowingly",
        "good",
        "called",
        "akrasia",
        "overcome",
        "sometimes",
        "anachronistically",
        "translated",
        "weakness",
        "however",
        "socrates",
        "defends",
        "idea",
        "akrasia",
        "impossible",
        "first",
        "argues",
        "virtue",
        "one",
        "need",
        "happiness",
        "apology",
        "c",
        "socrates",
        "say",
        "evil",
        "come",
        "good",
        "man",
        "either",
        "living",
        "dying",
        "ouk",
        "esti",
        "andri",
        "agathô",
        "kakon",
        "ouden",
        "oute",
        "zônti",
        "oute",
        "teleutêsanti",
        "implying",
        "good",
        "man",
        "virtue",
        "alone",
        "make",
        "proof",
        "bad",
        "fortune",
        "crito",
        "b",
        "say",
        "living",
        "well",
        "finely",
        "justly",
        "thing",
        "de",
        "eu",
        "kai",
        "kalôs",
        "kai",
        "dikaiôs",
        "zên",
        "hoti",
        "tauton",
        "estin",
        "turn",
        "meno",
        "cb",
        "socrates",
        "argues",
        "everyone",
        "desire",
        "happiness",
        "ie",
        "one",
        "welfare",
        "first",
        "place",
        "one",
        "always",
        "good",
        "reason",
        "acting",
        "virtuously",
        "entail",
        "one",
        "happiness",
        "however",
        "even",
        "link",
        "virtue",
        "happiness",
        "granted",
        "another",
        "problem",
        "remains",
        "possible",
        "one",
        "knowingly",
        "act",
        "one",
        "happiness",
        "understood",
        "socrates",
        "one",
        "welfare",
        "seems",
        "individual",
        "choose",
        "best",
        "interest",
        "people",
        "easily",
        "desire",
        "go",
        "pastry",
        "know",
        "bad",
        "socrates",
        "however",
        "seems",
        "think",
        "one",
        "recognizes",
        "ie",
        "really",
        "know",
        "fully",
        "appreciates",
        "pastry",
        "good",
        "way",
        "one",
        "cease",
        "desire",
        "residual",
        "desire",
        "eg",
        "pleasure",
        "might",
        "compete",
        "desire",
        "good",
        "position",
        "called",
        "intellectualism",
        "implies",
        "ultimately",
        "motivates",
        "action",
        "cognitive",
        "state",
        "rational",
        "doxastic",
        "know",
        "good",
        "action",
        "bad",
        "thought",
        "somehow",
        "good",
        "error",
        "choice",
        "due",
        "ignorance",
        "support",
        "idea",
        "one",
        "know",
        "happiness",
        "one",
        "pursue",
        "socrates",
        "argues",
        "euthydemus",
        "wisdom",
        "necessary",
        "sufficient",
        "happiness",
        "dialogue",
        "given",
        "euthydemus",
        "dionysiodorus",
        "eristic",
        "display",
        "two",
        "socratic",
        "interlude",
        "first",
        "passage",
        "parallel",
        "meno",
        "a",
        "ff",
        "socrates",
        "help",
        "young",
        "cleinias",
        "see",
        "wisdom",
        "kind",
        "knowledge",
        "infallibly",
        "brings",
        "happiness",
        "us",
        "analogy",
        "craft",
        "technê",
        "carpenter",
        "must",
        "know",
        "use",
        "tool",
        "material",
        "successful",
        "euthyd",
        "bd",
        "turn",
        "someone",
        "may",
        "good",
        "health",
        "wealth",
        "good",
        "birth",
        "beauty",
        "well",
        "virtue",
        "justice",
        "moderation",
        "courage",
        "wisdom",
        "ac",
        "wisdom",
        "important",
        "however",
        "like",
        "carpentry",
        "example",
        "kind",
        "knowledge",
        "use",
        "asset",
        "beneficial",
        "bc",
        "moreover",
        "socalled",
        "good",
        "useless",
        "fact",
        "even",
        "harmful",
        "without",
        "wisdom",
        "without",
        "one",
        "misuse",
        "asset",
        "one",
        "may",
        "posse",
        "act",
        "well",
        "badly",
        "wisdom",
        "unconditional",
        "good",
        "de",
        "socrates",
        "argument",
        "leaf",
        "ambiguous",
        "whether",
        "wisdom",
        "taken",
        "together",
        "exercise",
        "identical",
        "happiness",
        "whether",
        "dominant",
        "essential",
        "component",
        "happiness",
        "ab",
        "account",
        "focus",
        "kind",
        "knowledge",
        "active",
        "ingredient",
        "happiness",
        "part",
        "account",
        "certain",
        "asset",
        "seem",
        "passive",
        "relation",
        "wisdom",
        "wood",
        "tool",
        "carpenter",
        "socratic",
        "intellectualism",
        "criticized",
        "either",
        "ignoring",
        "nonrational",
        "desiderative",
        "volitional",
        "cause",
        "human",
        "action",
        "providing",
        "implausibly",
        "rationalist",
        "account",
        "either",
        "case",
        "common",
        "charge",
        "fails",
        "account",
        "appreciate",
        "apparent",
        "complexity",
        "moral",
        "psychology"
    ]
}