{
    "main_text": "Confucian Ethics || Responsibility and agency in Confucian ethics\n2.8 Responsibility and agency in Confucian ethics\n\nIn many respects, the ethics associated with the canonical figures of\nConfucius, Mencius, and Xunzi is about the way people should respond\nto one another, and in this sense it is a paradigmatic ethic of\nresponsibility. Confucian ethics exemplifies, along with most other\nethics, the idea that we must be responsive to, held responsible for,\nthat which makes us morally valuable.  Confucian virtues\nof ren, yi, li, and filiality are conceived\nto make their possessor trustworthy and reliable responders to the\nneeds, welfare, and dignity of others. The centrality that Confucian\nethics accords to relationship in what is valuable in human life\nresults in some distinctive features of its conception of\nresponsibility. A supreme degree of responsiveness to the needs and\nsuffering of people is required of exemplary officials. In Mencius\n4B29, Yu, legendary for working tirelessly to control the flooding of\nthe great rivers of China and who later became King, is described as\nregarded those drowning as if he had drowned them himself. Ji, who\nbore his official responsibilities in a time of famine, regarded those\nstarving as if he had starved them himself.  Xunzi says\nthat Tian gave birth to the people not for the sake of their\nlords, but established the lords for the sake of the people (chapter\n27). \n\nThe authority of rulers rests on their being given the responsibility\nfor bringing about the conditions under which their people can live\nfulfilling lives and develop their virtue. Recall Mencius’ declaration\nto King Xuan that if the people do not have a constant means of\nlivelihood, they will not have the constant minds to set themselves on\ndeveloping their virtue, and fall into crime (1A7). If a king allows\nsuch circumstances to afflict his people, if his people commit crimes\nto feed themselves and their families, and if the king punishes them,\nhe will have entrapped them. Mencius’ declaration, then, amounts to\ndistributing a great share of the responsibility for the people’s\ncrimes to their king.\n\nMencius goes on to propose concrete policies to the king to avoid\nentrapping the people: not overtaxing them to fund aggressive wars\nagainst neighboring states, prohibiting close-mesh fishing nets so as\nnot to catch young fish and turtles, limiting the harvesting of trees\nto certain seasons, and planting mulberry trees so that the people\nwill have silk clothing to wear (1A3, 1A7). Such policies make for\nsufficiently fertile soil from which his people’s duan might\ngrow. Mencius might here be construed as invoking what has been called\n“circumstantial luck” by Thomas Nagel in his classic “Moral Luck”\nessay (1976). While we do have control over some of our circumstances,\nwe have none or very little control over other circumstances that\ngreatly affect what can we make of ourselves. This is the source of\nNagel’s intuition that an arbitrariness of evaluation infects our\njudgments of what we tend to hold people to answer for.  Some of\nus have very unfavorable circumstances in which we choose, yet others\nwith more favorable circumstances get more credit for their choices.\nInterestingly, the only exception Mengzi makes to the rule that those\nwithout a constant means will be unable to have a constant mind is the\nclass of shi 士, the gentry-scholar class of which\nMengzi himself was a member. In an era of great political turbulence\nand disintegrating social order, members of this class were dislodged\nfrom their comfortable niches in the lower aristocracy, but their\nknowledge of traditions made them valuable to competing warlord-kings\nwho wished to replicate the glory of the old kings. This distinct set\nof circumstances for the shi made genteel poverty and itinerancy more\nfavorable, or at least less adverse, circumstances for maintaining a\nconstant mind than others lower in the social order.\n\nPeople normally have responsibility to refrain from crime, which\ninvolves their responsibility to respond to the needs of their\npotential victims, but that responsibility can be mitigated by the\nlack of control they have to avoid severe suffering if they refrain\nfrom crime. Their responsibility is mitigated by the way desperation\nfocuses the mind on self and those for whom one cares the most. When\ngovernments fail to realize the material conditions under which their\npeople could devote adequate attention to the development of their\nvirtue, they share a great deal of the responsibility for the\nwrongdoing and harm that results.\n\nThough Xunzi has a very different theory of what happens in the\ncultivation of virtue, he too believes that helping individuals to\nbecome competent moral agents is a collective task.\nHe recounts a story that occurred when Confucius was Minister of\nJustice. A father and son had become embroiled in a legal\ndispute. Kongzi detained them both but ultimately releases both. When\nquestioned as to why he let the son go when he should have been\npunished for being unfilial, Kongzi questions the permissibility\nof killing subordinates when their superiors are at fault: to\nfail to teach the people and then judge their crimes is to kill the\ninnocent; to fail to teach the people and yet hold them responsible\nfor achieving meritorious works is being cruel; it is only when one\nstops these practices that it is permissible to apply\npunishments (chapter 28, see translation by Hutton 2014: 319).\nHowever, if the material conditions sufficient for the focusing\nof one’s attention on moral virtue are present, and if others capable\nof pointing the way toward learning are available to be followed, then\nit is up to the individual to put in the effort (see Mencius 6A9 and\nJiang 2002). \n\nLack of control over the conditions under which one becomes a\nresponsible moral agent, as discussed above, can result in mitigation\nof personal responsibility. However, it is also possible to become\nresponsible for what is not under one’s control. This can happen\nbecause others who commit a moral wrong stand in special relationship\nto oneself. In addition, such others can enter so deeply into\none’s identity that one cannot repudiate what they do without\ndisowning part of the self. In the text Kongzi Jiayu\n(孔子家語 The School Sayings of\nConfucius, 37.4 – see Other Internet Resources), a story is told\nof the time Kongzi refrains from denouncing the unseemly conduct of an\nold friend and does not distance himself from it or his friend. In\nexplaining this, Kongzi says that family members never lose that which\nmakes them family and old friends never lose that which makes them old\nfriends. Deep and lasting friendship can make us partly responsible\nfor the misconduct of our friends (see Ing 2017 for an illuminating\ndiscussion of this passage).\n\nSuch consequences for the allotment of responsibility stem from the\nmoral centrality given to relationship in Confucian ethics, but are\nnot peculiar to Confucian ethics. Margaret Urban Walker (1993) has\nobserved that moral agents who accept responsibility for circumstances\nbeyond their control and who therefore “recognize their vulnerability\nto fortune are primed for dependability of humanly invaluable sorts”\nand “won’t fail us even under the blows of bad fortune or odd turns of\nfate which might otherwise prompt denial or opportunism” (1993,\n25–26).\n\nAgency, then, can be distributed among a larger group of people and is\nnot limited to the agent who directly chooses the action in question;\nit is distributed among those who can some significant degree of\ncontrol over the conditions under which the direct agent chooses.\nOthers can share responsibility through having a relevant relationship\nto the direct agent. A significant degree of responsibility is\nretained by the direct agent, however, especially if the conditions\n(such as a constant means of livelihood and the presence of reliable\nteachers and models) favorable to the development of agency are\npresent. Then responsibility is conceived to rest on the individual to\nexercise their heart-mind. In Mencius’ case, the individual needs to\nexercise the heart-mind’s capacity to think about the importance of\ndeveloping the moral duan within; in Xunzi’s case,\nthe individual needs to reflect on what qualities of character and\nwhat kinds of cooperative relationships with others would provide\nthe greatest, and most stable satisfaction of desire. In each case,\nthere is an internal normative hierarchywithin the person that should\nbe established, with the heart-mind as the leader or commander of the\nrest of the person. The heart-mind directs how the person should\ncultivate the self and conduct itself in relation to others. This\nhierarchy corresponds to the meritocratic order that Confucians\nbelieve should obtain in state and society: the most virtuous and\nmost able (those who have developed their heart-minds the most) should\nhave the most authority to govern. We shall see how\nthe Zhuangzi (section 4.2) in particular poses a\nstriking critique of both forms of hierarchy.\n",
    "section_title": "2.8 Responsibility and agency in Confucian ethics",
    "entry_title": "Chinese Ethics",
    "hierarchy_title": "Chinese Ethics || Confucian Ethics || Responsibility and agency in Confucian ethics",
    "tokenized_text": [
        "confucian",
        "ethic",
        "responsibility",
        "agency",
        "confucian",
        "ethic",
        "responsibility",
        "agency",
        "confucian",
        "ethic",
        "many",
        "respect",
        "ethic",
        "associated",
        "canonical",
        "figure",
        "confucius",
        "mencius",
        "xunzi",
        "way",
        "people",
        "respond",
        "one",
        "another",
        "sense",
        "paradigmatic",
        "ethic",
        "responsibility",
        "confucian",
        "ethic",
        "exemplifies",
        "along",
        "ethic",
        "idea",
        "must",
        "responsive",
        "held",
        "responsible",
        "make",
        "u",
        "morally",
        "valuable",
        "confucian",
        "virtue",
        "ren",
        "yi",
        "li",
        "filiality",
        "conceived",
        "make",
        "possessor",
        "trustworthy",
        "reliable",
        "responder",
        "need",
        "welfare",
        "dignity",
        "others",
        "centrality",
        "confucian",
        "ethic",
        "accord",
        "relationship",
        "valuable",
        "human",
        "life",
        "result",
        "distinctive",
        "feature",
        "conception",
        "responsibility",
        "supreme",
        "degree",
        "responsiveness",
        "need",
        "suffering",
        "people",
        "required",
        "exemplary",
        "official",
        "mencius",
        "b",
        "yu",
        "legendary",
        "working",
        "tirelessly",
        "control",
        "flooding",
        "great",
        "river",
        "china",
        "later",
        "became",
        "king",
        "described",
        "regarded",
        "drowning",
        "drowned",
        "ji",
        "bore",
        "official",
        "responsibility",
        "time",
        "famine",
        "regarded",
        "starving",
        "starved",
        "xunzi",
        "say",
        "tian",
        "gave",
        "birth",
        "people",
        "sake",
        "lord",
        "established",
        "lord",
        "sake",
        "people",
        "chapter",
        "authority",
        "ruler",
        "rest",
        "given",
        "responsibility",
        "bringing",
        "condition",
        "people",
        "live",
        "fulfilling",
        "life",
        "develop",
        "virtue",
        "recall",
        "mencius",
        "declaration",
        "king",
        "xuan",
        "people",
        "constant",
        "mean",
        "livelihood",
        "constant",
        "mind",
        "set",
        "developing",
        "virtue",
        "fall",
        "crime",
        "a",
        "king",
        "allows",
        "circumstance",
        "afflict",
        "people",
        "people",
        "commit",
        "crime",
        "feed",
        "family",
        "king",
        "punishes",
        "entrapped",
        "mencius",
        "declaration",
        "amount",
        "distributing",
        "great",
        "share",
        "responsibility",
        "people",
        "crime",
        "king",
        "mencius",
        "go",
        "propose",
        "concrete",
        "policy",
        "king",
        "avoid",
        "entrapping",
        "people",
        "overtaxing",
        "fund",
        "aggressive",
        "war",
        "neighboring",
        "state",
        "prohibiting",
        "closemesh",
        "fishing",
        "net",
        "catch",
        "young",
        "fish",
        "turtle",
        "limiting",
        "harvesting",
        "tree",
        "certain",
        "season",
        "planting",
        "mulberry",
        "tree",
        "people",
        "silk",
        "clothing",
        "wear",
        "a",
        "a",
        "policy",
        "make",
        "sufficiently",
        "fertile",
        "soil",
        "people",
        "duan",
        "might",
        "grow",
        "mencius",
        "might",
        "construed",
        "invoking",
        "called",
        "circumstantial",
        "luck",
        "thomas",
        "nagel",
        "classic",
        "moral",
        "luck",
        "essay",
        "control",
        "circumstance",
        "none",
        "little",
        "control",
        "circumstance",
        "greatly",
        "affect",
        "make",
        "source",
        "nagel",
        "intuition",
        "arbitrariness",
        "evaluation",
        "infects",
        "judgment",
        "tend",
        "hold",
        "people",
        "answer",
        "u",
        "unfavorable",
        "circumstance",
        "choose",
        "yet",
        "others",
        "favorable",
        "circumstance",
        "get",
        "credit",
        "choice",
        "interestingly",
        "exception",
        "mengzi",
        "make",
        "rule",
        "without",
        "constant",
        "mean",
        "unable",
        "constant",
        "mind",
        "class",
        "shi",
        "士",
        "gentryscholar",
        "class",
        "mengzi",
        "member",
        "era",
        "great",
        "political",
        "turbulence",
        "disintegrating",
        "social",
        "order",
        "member",
        "class",
        "dislodged",
        "comfortable",
        "niche",
        "lower",
        "aristocracy",
        "knowledge",
        "tradition",
        "made",
        "valuable",
        "competing",
        "warlordkings",
        "wished",
        "replicate",
        "glory",
        "old",
        "king",
        "distinct",
        "set",
        "circumstance",
        "shi",
        "made",
        "genteel",
        "poverty",
        "itinerancy",
        "favorable",
        "least",
        "le",
        "adverse",
        "circumstance",
        "maintaining",
        "constant",
        "mind",
        "others",
        "lower",
        "social",
        "order",
        "people",
        "normally",
        "responsibility",
        "refrain",
        "crime",
        "involves",
        "responsibility",
        "respond",
        "need",
        "potential",
        "victim",
        "responsibility",
        "mitigated",
        "lack",
        "control",
        "avoid",
        "severe",
        "suffering",
        "refrain",
        "crime",
        "responsibility",
        "mitigated",
        "way",
        "desperation",
        "focus",
        "mind",
        "self",
        "one",
        "care",
        "government",
        "fail",
        "realize",
        "material",
        "condition",
        "people",
        "could",
        "devote",
        "adequate",
        "attention",
        "development",
        "virtue",
        "share",
        "great",
        "deal",
        "responsibility",
        "wrongdoing",
        "harm",
        "result",
        "though",
        "xunzi",
        "different",
        "theory",
        "happens",
        "cultivation",
        "virtue",
        "belief",
        "helping",
        "individual",
        "become",
        "competent",
        "moral",
        "agent",
        "collective",
        "task",
        "recount",
        "story",
        "occurred",
        "confucius",
        "minister",
        "justice",
        "father",
        "son",
        "become",
        "embroiled",
        "legal",
        "dispute",
        "kongzi",
        "detained",
        "ultimately",
        "release",
        "questioned",
        "let",
        "son",
        "go",
        "punished",
        "unfilial",
        "kongzi",
        "question",
        "permissibility",
        "killing",
        "subordinate",
        "superior",
        "fault",
        "fail",
        "teach",
        "people",
        "judge",
        "crime",
        "kill",
        "innocent",
        "fail",
        "teach",
        "people",
        "yet",
        "hold",
        "responsible",
        "achieving",
        "meritorious",
        "work",
        "cruel",
        "one",
        "stop",
        "practice",
        "permissible",
        "apply",
        "punishment",
        "chapter",
        "see",
        "translation",
        "hutton",
        "however",
        "material",
        "condition",
        "sufficient",
        "focusing",
        "one",
        "attention",
        "moral",
        "virtue",
        "present",
        "others",
        "capable",
        "pointing",
        "way",
        "toward",
        "learning",
        "available",
        "followed",
        "individual",
        "put",
        "effort",
        "see",
        "mencius",
        "a",
        "jiang",
        "lack",
        "control",
        "condition",
        "one",
        "becomes",
        "responsible",
        "moral",
        "agent",
        "discussed",
        "result",
        "mitigation",
        "personal",
        "responsibility",
        "however",
        "also",
        "possible",
        "become",
        "responsible",
        "one",
        "control",
        "happen",
        "others",
        "commit",
        "moral",
        "wrong",
        "stand",
        "special",
        "relationship",
        "oneself",
        "addition",
        "others",
        "enter",
        "deeply",
        "one",
        "identity",
        "one",
        "repudiate",
        "without",
        "disowning",
        "part",
        "self",
        "text",
        "kongzi",
        "jiayu",
        "孔子家語",
        "school",
        "saying",
        "confucius",
        "see",
        "internet",
        "resource",
        "story",
        "told",
        "time",
        "kongzi",
        "refrain",
        "denouncing",
        "unseemly",
        "conduct",
        "old",
        "friend",
        "distance",
        "friend",
        "explaining",
        "kongzi",
        "say",
        "family",
        "member",
        "never",
        "lose",
        "make",
        "family",
        "old",
        "friend",
        "never",
        "lose",
        "make",
        "old",
        "friend",
        "deep",
        "lasting",
        "friendship",
        "make",
        "u",
        "partly",
        "responsible",
        "misconduct",
        "friend",
        "see",
        "ing",
        "illuminating",
        "discussion",
        "passage",
        "consequence",
        "allotment",
        "responsibility",
        "stem",
        "moral",
        "centrality",
        "given",
        "relationship",
        "confucian",
        "ethic",
        "peculiar",
        "confucian",
        "ethic",
        "margaret",
        "urban",
        "walker",
        "observed",
        "moral",
        "agent",
        "accept",
        "responsibility",
        "circumstance",
        "beyond",
        "control",
        "therefore",
        "recognize",
        "vulnerability",
        "fortune",
        "primed",
        "dependability",
        "humanly",
        "invaluable",
        "sort",
        "fail",
        "u",
        "even",
        "blow",
        "bad",
        "fortune",
        "odd",
        "turn",
        "fate",
        "might",
        "otherwise",
        "prompt",
        "denial",
        "opportunism",
        "agency",
        "distributed",
        "among",
        "larger",
        "group",
        "people",
        "limited",
        "agent",
        "directly",
        "chooses",
        "action",
        "question",
        "distributed",
        "among",
        "significant",
        "degree",
        "control",
        "condition",
        "direct",
        "agent",
        "chooses",
        "others",
        "share",
        "responsibility",
        "relevant",
        "relationship",
        "direct",
        "agent",
        "significant",
        "degree",
        "responsibility",
        "retained",
        "direct",
        "agent",
        "however",
        "especially",
        "condition",
        "constant",
        "mean",
        "livelihood",
        "presence",
        "reliable",
        "teacher",
        "model",
        "favorable",
        "development",
        "agency",
        "present",
        "responsibility",
        "conceived",
        "rest",
        "individual",
        "exercise",
        "heartmind",
        "mencius",
        "case",
        "individual",
        "need",
        "exercise",
        "heartmind",
        "capacity",
        "think",
        "importance",
        "developing",
        "moral",
        "duan",
        "within",
        "xunzi",
        "case",
        "individual",
        "need",
        "reflect",
        "quality",
        "character",
        "kind",
        "cooperative",
        "relationship",
        "others",
        "would",
        "provide",
        "greatest",
        "stable",
        "satisfaction",
        "desire",
        "case",
        "internal",
        "normative",
        "hierarchywithin",
        "person",
        "established",
        "heartmind",
        "leader",
        "commander",
        "rest",
        "person",
        "heartmind",
        "directs",
        "person",
        "cultivate",
        "self",
        "conduct",
        "relation",
        "others",
        "hierarchy",
        "corresponds",
        "meritocratic",
        "order",
        "confucian",
        "believe",
        "obtain",
        "state",
        "society",
        "virtuous",
        "able",
        "developed",
        "heartminds",
        "authority",
        "govern",
        "shall",
        "see",
        "zhuangzi",
        "section",
        "particular",
        "pose",
        "striking",
        "critique",
        "form",
        "hierarchy"
    ]
}