{
    "main_text": "Human Subjects Research\n2. Human Subjects Research\n\nThe practical, professional, and theoretical implications of human\nsubjects protections has been covered extensively in scholarly\nliterature, ranging from medical/biomedical to social sciences to\ncomputing and technical disciplines (see Beauchamp & Childress\n2008; Emanual et al. 2003; PRIM&R et al. 2021; Sieber 1992; Wright\n2006). Relevant protections and regulations continue to receive much\nattention in the face of research ethics violations (see, for example,\nSkloot 2010, on Henrietta Lacks; the U.S. Government’s admission\nand apology to the Guatemalan Government for STD testing in the 1940s\n(BBC 2011); and Gaw & Burns 2011, on how lessons from the past\nmight inform current research ethics and conduct).\n\nThe history of human subjects protections (Sparks 2002 [see\n Other Internet Resources aka OIR])\n grew out of atrocities such as Nazi human experimentation during\nWorld War II, which resulted in the Nuremberg Code (1947);\nsubsequently followed by the Declaration of Helsinki on Ethical\nPrinciples for Medical Research Involving Human Subjects (World\nMedical Association 1964/2008). Partially in response to the Tuskegee\nsyphilis experiment, an infamous clinical study conducted between 1932\nand 1972 by the U.S. Public Health Service studying the natural\nprogression of untreated syphilis in rural African-American men in\nAlabama under the guise of receiving free health care from the\ngovernment, the U.S. Department of Health and Human Services put forth\na set of basic regulations governing the protection of human subjects\n(45 C.F.R. § 46) (see the links in the Other Internet Resources\nsection, under Laws and Government Documents). This was later followed\nby the publication of the “Ethical Principles and Guidelines for\nthe Protection of Human Subjects of Research” by the National\nCommission for the Protection of Human Subjects of Biomedical and\nBehavioral Research, known as the Belmont Report (NCPHSBBR 1979). The\nBelmont Report identifies three fundamental ethical principles for all\nhuman subjects research: Respect for Persons, Beneficence, and\nJustice.\n\nTo ensure consistency across federal agencies in the United States\ncontext in human subjects protections, in 1991, the Federal Policy for\nthe Protection of Human Subjects, also known as the “Common\nRule” was codified; the Revised Common Rule was released in the\nFederal Register on 19 January 2017, and went into effect 19 July\n2018. Similar regulatory frameworks for the protection of human\nsubjects exist across the world, and include, for example, the\nCanadian Tri-Council, the Australian Research Council, The European\nCommission, The Research Council of Norway and its National Committee\nfor Research Ethics in the Social Sciences and Humanities (NESH 2006;\nNESH 2019), and the U.K.’s NHS National Research Ethics Service\nand the Research Ethics Framework (REF) of the ESRC (Economic and\nSocial Research Council) General Guidelines, and the Forum for Ethical\nReview Committees in Asia and the Western Pacific (FERCAP).\n\nIn the United States, the various regulatory agencies who have signed\non to the Common Rule (45 C.F.R. 46 Subpart A) have not issued formal\nguidance on Internet research (see the links in the Other Internet\nResources section, under Laws and Government Documents). The Preamble\nto the Revised Rule referenced significant changes in the research\nenvironment, recognizing a need to broaden the scope of the Rule.\nHowever, substantial changes to the actual Rule in regards to Internet\nresearch in its broadest context, were minimal.\n\nFor example, the Preamble states:\n\n\nThis final rule recognizes that in the past two decades a paradigm\nshift has occurred in how research is conducted. Evolving\ntechnologies—including imaging, mobile technologies, and the\ngrowth in computing power—have changed the scale and nature of\ninformation collected in many disciplines. Computer scientists,\nengineers, and social scientists are developing techniques to\nintegrate different types of data so they can be combined, mined,\nanalyzed, and shared. The advent of sophisticated computer software\nprograms, the Internet, and mobile technology has created new areas of\nresearch activity, particularly within the social and behavioral\nsciences (Federal Register 2017 and HHS 2017).\n\n\nModest changes to the definition of human subjects included changing\n“data” to “information” and\n“biospecimens;” the definition now reads:\n\n(e)\n\n\n(1) Human subject means a living individual about\nwhom an investigator (whether professional or student) conducting\nresearch:\n\n\n(i) Obtains information or biospecimens through intervention or\ninteraction with the individual, and uses, studies, or analyzes the\ninformation or biospecimens; or\n(ii) Obtains, uses, studies, analyzes, or generates identifiable\nprivate information or identifiable biospecimens.\n \n(2) Intervention includes both physical\nprocedures by which information or biospecimens are gathered (e.g.,\nvenipuncture) and manipulations of the subject or the subject's\nenvironment that are performed for research purposes.\n(3) Interaction includes communication or\ninterpersonal contact between investigator and subject.\n(4) Private information includes information\nabout behavior that occurs in a context in which an individual can\nreasonably expect that no observation or recording is taking place,\nand information that has been provided for specific purposes by an\nindividual and that the individual can reasonably expect will not be\nmade public (e.g., a medical record).\n(5) Identifiable private information is private\ninformation for which the identity of the subject is or may readily be\nascertained by the investigator or associated with the\ninformation.\n(6) An identifiable biospecimen is a biospecimen\nfor which the identity of the subject is or may readily be ascertained\nby the investigator or associated with the biospecimen (45 C.F.R.\n§ 46.102 (2018)).\n\n\n\nHowever, the Revised Rule does have a provision that stands to be of\nimport in regards to Internet research; the Rule calls for\nimplementing departments or agencies to,\n\n[(e)(7)]\n\n\n(i) Upon consultation with appropriate experts (including experts\nin data matching and re-identification), reexamine the meaning of\n“identifiable private information”, as defined in\nparagraph (e)(5) of this section, and “identifiable\nbiospecimen”, as defined in paragraph (e)(6) of this section.\nThis reexamination shall take place within 1 year and regularly\nthereafter (at least every 4 years). This process will be conducted by\ncollaboration among the Federal departments and agencies implementing\nthis policy. If appropriate and permitted by law, such Federal\ndepartments and agencies may alter the interpretation of these terms,\nincluding through the use of guidance.\n(ii) Upon consultation with appropriate experts, assess whether\nthere are analytic technologies or techniques that should be\nconsidered by investigators to generate “identifiable private\ninformation”, as defined in paragraph (e)(5) of this section, or\nan “identifiable biospecimen”, as defined in paragraph\n(e)(6) of this section. This assessment shall take place within 1 year\nand regularly thereafter (at least every 4 years). This process will\nbe conducted by collaboration among the Federal departments and\nagencies implementing this policy. Any such technologies or techniques\nwill be included on a list of technologies or techniques that produce\nidentifiable private information or identifiable biospecimens. This\nlist will be published in the Federal Register after notice and an\nopportunity for public comment. The Secretary, HHS, shall maintain the\nlist on a publicly accessible Web site (45 C.F.R. § 46.102\n(2018)).\n\n\n\nAs of this writing, there has not yet been a reexamination of the\nconcepts of “identifiable private information” or\n“identifiable biospecimens”. However, as data analytics,\nAI, and machine learning continue to expose ethical issues in human\nsubjects research, we expect to see engaged discussion at the federal\nlevel and amongst research communities (PRIM&R 2021). Those\ndiscussions may refer to previous conceptual work by Carpenter and\nDittrich (2012) and Aycock et al. (2012) that is concerned with risk\nand identifiability. Secondary uses of identifiable, private data, for\nexample, may pose downstream harms, or unintentional risks, causing\nreputational or informational harms. Reexaminations of\n“identifiable private information” can not occur without\nserious consideration of risk and “human harming\nresearch”. Carpenter and Dittrich (2012) encourage\n\n\n“Review boards should transition from an informed consent driven\nreview to a risk analysis review that addresses potential harms\nstemming from research in which a researcher does not directly\ninteract with the at-risk individuals” (p. 4) as “[T]his\ndistance between researcher and affected individual indicates that a\nparadigm shift is necessary in the research arena. We must transition\nour idea of research protection from ‘human subjects\nresearch’ to ‘human harming research’” (p.\n 14).[1]\n\n\nSimilarly, Aycock et al. (2012) assert that\n\n\nResearchers and boards must balance presenting risks related to the\nspecific research with risks related to the technologies in use. With\ncomputer security research, major issues around risk arise, for\nsociety at large especially. The risk may not seem evident to an\nindividual but in the scope of security research, larger populations\nmay be vulnerable. There is a significant difficulty in quantifying\nrisks and benefits, in the traditional sense of research\nethics….An aggregation of surfing behaviors collected by a bot\npresents greater distance between researcher and respondent than an\ninterview done in a virtual world between avatars. This distance leads\nus to suggest that computer security research focus less concern\naround human subjects research in the traditional sense and\nmore concern with human harming research (p. 3, italics\noriginal).\n\n\nThese two conceptual notions are relevant for considering emergent\nforms of identities or personally identifiable information (PII) such\nas avatars, virtual beings, bots, textual and graphical information.\nWithin the Code of Federal Regulations (45 C.F.R. § 46.102(f)\n2009): New forms of representations are considered human subjects if\nPII about living individuals is obtained. PII can be obtained by\nresearchers through scraping data sources, profiles or avatars, or\nother pieces of data made available by the platform. Fairfield agrees:\n“An avatar, for example, does not merely represent a collection\nof pixels—it represents the identity of the user” (2012:\n701).\n\nThe multiple academic disciplines already long engaged in human\nsubjects research (medicine, sociology, anthropology, psychology,\ncommunication) have established ethical guidelines intended to assist\nresearchers and those charged with ensuring that research on human\nsubjects follows both legal requirements and ethical practices. But\nwith research involving the Internet—where individuals\nincreasingly share personal information on platforms with porous and\nshifting boundaries, where both the spread and aggregation of data\nfrom disparate sources has become the norm, and where web-based\nservices, and their privacy policies and terms of service statements,\nmorph and evolve rapidly—the ethical frameworks and assumptions\ntraditionally used by researchers and REBs are frequently\nchallenged.\n\nResearch ethics boards themselves are increasingly challenged with the\nunique ethical dimensions of internet-based research protocols. In a\n2008 survey of U.S. IRBs, less than half of the ethical review boards\nidentified internet-based research was “an area of concern or\nimportance” at that time, and only 6% had guidelines or\nchecklists in place for reviewing internet-based research protocols\n(Buchanan & Ess 2009). By 2015, 93% of IRBs surveyed acknowledged\nthat are ethical issues unique to research using “online\ndata”, yet only 55% said they felt their IRBs are well versed in\nthe technical aspects of online data collection, and only 57% agreed\nthat their IRB has the expertise to stay abreast of changes in online\ntechnology. IRBs are now further challenged with the growth of big\ndata research (see\n §4.5 below),\n which increasingly relies on large datasets of personal information\ngenerated via social media, digital devices, or other means often\nhidden from users. A 2019 study of IRBs revealed only 25% felt\nprepared to evaluate protocols relying on big data, and only 6% had\ntools sufficient for considering this emerging area of internet\nresearch (Zimmer & Chapman 2020). Further, after being presented\nvarious hypothetical research scenarios utilizing big data and asked\nhow their IRB would likely review such a protocol, numerous viewpoints\ndifferent strongly in many cases. Consider the following scenario:\n\n\nResearchers plan to scrape public comments from online newspaper pages\nto predict election outcomes. They will aggregate their analysis to\ndetermine public sentiment. The researchers don’t plan to inform\ncommenters, and they plan to collect potentially-identifiable user\nnames. Scraping comments violates the newspaper’s terms of\nservice.\n\n\n18% of respondents indicated their IRB would view this as exempt, 21%\nindicated expedited review, 33% suggested it would need full board\nreview, while 28% did not think this was even human subjects research\nthat would fall under their IRB’s purview (Zimmer & Chapman\n2020). This points to potential gaps and inconsistencies in how IRBs\nreview the ethical implications of big data research protocols.\n",
    "section_title": "2. Human Subjects Research",
    "entry_title": "Internet Research Ethics",
    "hierarchy_title": "Internet Research Ethics || Human Subjects Research",
    "tokenized_text": [
        "human",
        "subject",
        "research",
        "human",
        "subject",
        "research",
        "practical",
        "professional",
        "theoretical",
        "implication",
        "human",
        "subject",
        "protection",
        "covered",
        "extensively",
        "scholarly",
        "literature",
        "ranging",
        "medicalbiomedical",
        "social",
        "science",
        "computing",
        "technical",
        "discipline",
        "see",
        "beauchamp",
        "childress",
        "emanual",
        "et",
        "al",
        "prim",
        "r",
        "et",
        "al",
        "sieber",
        "wright",
        "relevant",
        "protection",
        "regulation",
        "continue",
        "receive",
        "much",
        "attention",
        "face",
        "research",
        "ethic",
        "violation",
        "see",
        "example",
        "skloot",
        "henrietta",
        "lack",
        "us",
        "government",
        "admission",
        "apology",
        "guatemalan",
        "government",
        "std",
        "testing",
        "s",
        "bbc",
        "gaw",
        "burn",
        "lesson",
        "past",
        "might",
        "inform",
        "current",
        "research",
        "ethic",
        "conduct",
        "history",
        "human",
        "subject",
        "protection",
        "spark",
        "see",
        "internet",
        "resource",
        "aka",
        "oir",
        "grew",
        "atrocity",
        "nazi",
        "human",
        "experimentation",
        "world",
        "war",
        "ii",
        "resulted",
        "nuremberg",
        "code",
        "subsequently",
        "followed",
        "declaration",
        "helsinki",
        "ethical",
        "principle",
        "medical",
        "research",
        "involving",
        "human",
        "subject",
        "world",
        "medical",
        "association",
        "partially",
        "response",
        "tuskegee",
        "syphilis",
        "experiment",
        "infamous",
        "clinical",
        "study",
        "conducted",
        "us",
        "public",
        "health",
        "service",
        "studying",
        "natural",
        "progression",
        "untreated",
        "syphilis",
        "rural",
        "africanamerican",
        "men",
        "alabama",
        "guise",
        "receiving",
        "free",
        "health",
        "care",
        "government",
        "us",
        "department",
        "health",
        "human",
        "service",
        "put",
        "forth",
        "set",
        "basic",
        "regulation",
        "governing",
        "protection",
        "human",
        "subject",
        "cfr",
        "see",
        "link",
        "internet",
        "resource",
        "section",
        "law",
        "government",
        "document",
        "later",
        "followed",
        "publication",
        "ethical",
        "principle",
        "guideline",
        "protection",
        "human",
        "subject",
        "research",
        "national",
        "commission",
        "protection",
        "human",
        "subject",
        "biomedical",
        "behavioral",
        "research",
        "known",
        "belmont",
        "report",
        "ncphsbbr",
        "belmont",
        "report",
        "identifies",
        "three",
        "fundamental",
        "ethical",
        "principle",
        "human",
        "subject",
        "research",
        "respect",
        "person",
        "beneficence",
        "justice",
        "ensure",
        "consistency",
        "across",
        "federal",
        "agency",
        "united",
        "state",
        "context",
        "human",
        "subject",
        "protection",
        "federal",
        "policy",
        "protection",
        "human",
        "subject",
        "also",
        "known",
        "common",
        "rule",
        "codified",
        "revised",
        "common",
        "rule",
        "released",
        "federal",
        "register",
        "january",
        "went",
        "effect",
        "july",
        "similar",
        "regulatory",
        "framework",
        "protection",
        "human",
        "subject",
        "exist",
        "across",
        "world",
        "include",
        "example",
        "canadian",
        "tricouncil",
        "australian",
        "research",
        "council",
        "european",
        "commission",
        "research",
        "council",
        "norway",
        "national",
        "committee",
        "research",
        "ethic",
        "social",
        "science",
        "humanity",
        "nesh",
        "nesh",
        "uk",
        "nh",
        "national",
        "research",
        "ethic",
        "service",
        "research",
        "ethic",
        "framework",
        "ref",
        "esrc",
        "economic",
        "social",
        "research",
        "council",
        "general",
        "guideline",
        "forum",
        "ethical",
        "review",
        "committee",
        "asia",
        "western",
        "pacific",
        "fercap",
        "united",
        "state",
        "various",
        "regulatory",
        "agency",
        "signed",
        "common",
        "rule",
        "cfr",
        "subpart",
        "issued",
        "formal",
        "guidance",
        "internet",
        "research",
        "see",
        "link",
        "internet",
        "resource",
        "section",
        "law",
        "government",
        "document",
        "preamble",
        "revised",
        "rule",
        "referenced",
        "significant",
        "change",
        "research",
        "environment",
        "recognizing",
        "need",
        "broaden",
        "scope",
        "rule",
        "however",
        "substantial",
        "change",
        "actual",
        "rule",
        "regard",
        "internet",
        "research",
        "broadest",
        "context",
        "minimal",
        "example",
        "preamble",
        "state",
        "final",
        "rule",
        "recognizes",
        "past",
        "two",
        "decade",
        "paradigm",
        "shift",
        "occurred",
        "research",
        "conducted",
        "evolving",
        "technologiesincluding",
        "imaging",
        "mobile",
        "technology",
        "growth",
        "computing",
        "powerhave",
        "changed",
        "scale",
        "nature",
        "information",
        "collected",
        "many",
        "discipline",
        "computer",
        "scientist",
        "engineer",
        "social",
        "scientist",
        "developing",
        "technique",
        "integrate",
        "different",
        "type",
        "data",
        "combined",
        "mined",
        "analyzed",
        "shared",
        "advent",
        "sophisticated",
        "computer",
        "software",
        "program",
        "internet",
        "mobile",
        "technology",
        "created",
        "new",
        "area",
        "research",
        "activity",
        "particularly",
        "within",
        "social",
        "behavioral",
        "science",
        "federal",
        "register",
        "hhs",
        "modest",
        "change",
        "definition",
        "human",
        "subject",
        "included",
        "changing",
        "data",
        "information",
        "biospecimens",
        "definition",
        "read",
        "e",
        "human",
        "subject",
        "mean",
        "living",
        "individual",
        "investigator",
        "whether",
        "professional",
        "student",
        "conducting",
        "research",
        "obtains",
        "information",
        "biospecimens",
        "intervention",
        "interaction",
        "individual",
        "us",
        "study",
        "analyzes",
        "information",
        "biospecimens",
        "ii",
        "obtains",
        "us",
        "study",
        "analyzes",
        "generates",
        "identifiable",
        "private",
        "information",
        "identifiable",
        "biospecimens",
        "intervention",
        "includes",
        "physical",
        "procedure",
        "information",
        "biospecimens",
        "gathered",
        "eg",
        "venipuncture",
        "manipulation",
        "subject",
        "subject",
        "s",
        "environment",
        "performed",
        "research",
        "purpose",
        "interaction",
        "includes",
        "communication",
        "interpersonal",
        "contact",
        "investigator",
        "subject",
        "private",
        "information",
        "includes",
        "information",
        "behavior",
        "occurs",
        "context",
        "individual",
        "reasonably",
        "expect",
        "observation",
        "recording",
        "taking",
        "place",
        "information",
        "provided",
        "specific",
        "purpose",
        "individual",
        "individual",
        "reasonably",
        "expect",
        "made",
        "public",
        "eg",
        "medical",
        "record",
        "identifiable",
        "private",
        "information",
        "private",
        "information",
        "identity",
        "subject",
        "may",
        "readily",
        "ascertained",
        "investigator",
        "associated",
        "information",
        "identifiable",
        "biospecimen",
        "biospecimen",
        "identity",
        "subject",
        "may",
        "readily",
        "ascertained",
        "investigator",
        "associated",
        "biospecimen",
        "cfr",
        "however",
        "revised",
        "rule",
        "provision",
        "stand",
        "import",
        "regard",
        "internet",
        "research",
        "rule",
        "call",
        "implementing",
        "department",
        "agency",
        "e",
        "upon",
        "consultation",
        "appropriate",
        "expert",
        "including",
        "expert",
        "data",
        "matching",
        "reidentification",
        "reexamine",
        "meaning",
        "identifiable",
        "private",
        "information",
        "defined",
        "paragraph",
        "e",
        "section",
        "identifiable",
        "biospecimen",
        "defined",
        "paragraph",
        "e",
        "section",
        "reexamination",
        "shall",
        "take",
        "place",
        "within",
        "year",
        "regularly",
        "thereafter",
        "least",
        "every",
        "year",
        "process",
        "conducted",
        "collaboration",
        "among",
        "federal",
        "department",
        "agency",
        "implementing",
        "policy",
        "appropriate",
        "permitted",
        "law",
        "federal",
        "department",
        "agency",
        "may",
        "alter",
        "interpretation",
        "term",
        "including",
        "use",
        "guidance",
        "ii",
        "upon",
        "consultation",
        "appropriate",
        "expert",
        "ass",
        "whether",
        "analytic",
        "technology",
        "technique",
        "considered",
        "investigator",
        "generate",
        "identifiable",
        "private",
        "information",
        "defined",
        "paragraph",
        "e",
        "section",
        "identifiable",
        "biospecimen",
        "defined",
        "paragraph",
        "e",
        "section",
        "assessment",
        "shall",
        "take",
        "place",
        "within",
        "year",
        "regularly",
        "thereafter",
        "least",
        "every",
        "year",
        "process",
        "conducted",
        "collaboration",
        "among",
        "federal",
        "department",
        "agency",
        "implementing",
        "policy",
        "technology",
        "technique",
        "included",
        "list",
        "technology",
        "technique",
        "produce",
        "identifiable",
        "private",
        "information",
        "identifiable",
        "biospecimens",
        "list",
        "published",
        "federal",
        "register",
        "notice",
        "opportunity",
        "public",
        "comment",
        "secretary",
        "hhs",
        "shall",
        "maintain",
        "list",
        "publicly",
        "accessible",
        "web",
        "site",
        "cfr",
        "writing",
        "yet",
        "reexamination",
        "concept",
        "identifiable",
        "private",
        "information",
        "identifiable",
        "biospecimens",
        "however",
        "data",
        "analytics",
        "ai",
        "machine",
        "learning",
        "continue",
        "expose",
        "ethical",
        "issue",
        "human",
        "subject",
        "research",
        "expect",
        "see",
        "engaged",
        "discussion",
        "federal",
        "level",
        "amongst",
        "research",
        "community",
        "prim",
        "r",
        "discussion",
        "may",
        "refer",
        "previous",
        "conceptual",
        "work",
        "carpenter",
        "dittrich",
        "aycock",
        "et",
        "al",
        "concerned",
        "risk",
        "identifiability",
        "secondary",
        "us",
        "identifiable",
        "private",
        "data",
        "example",
        "may",
        "pose",
        "downstream",
        "harm",
        "unintentional",
        "risk",
        "causing",
        "reputational",
        "informational",
        "harm",
        "reexamination",
        "identifiable",
        "private",
        "information",
        "occur",
        "without",
        "serious",
        "consideration",
        "risk",
        "human",
        "harming",
        "research",
        "carpenter",
        "dittrich",
        "encourage",
        "review",
        "board",
        "transition",
        "informed",
        "consent",
        "driven",
        "review",
        "risk",
        "analysis",
        "review",
        "address",
        "potential",
        "harm",
        "stemming",
        "research",
        "researcher",
        "directly",
        "interact",
        "atrisk",
        "individual",
        "p",
        "distance",
        "researcher",
        "affected",
        "individual",
        "indicates",
        "paradigm",
        "shift",
        "necessary",
        "research",
        "arena",
        "must",
        "transition",
        "idea",
        "research",
        "protection",
        "human",
        "subject",
        "research",
        "human",
        "harming",
        "research",
        "p",
        "similarly",
        "aycock",
        "et",
        "al",
        "assert",
        "researcher",
        "board",
        "must",
        "balance",
        "presenting",
        "risk",
        "related",
        "specific",
        "research",
        "risk",
        "related",
        "technology",
        "use",
        "computer",
        "security",
        "research",
        "major",
        "issue",
        "around",
        "risk",
        "arise",
        "society",
        "large",
        "especially",
        "risk",
        "may",
        "seem",
        "evident",
        "individual",
        "scope",
        "security",
        "research",
        "larger",
        "population",
        "may",
        "vulnerable",
        "significant",
        "difficulty",
        "quantifying",
        "risk",
        "benefit",
        "traditional",
        "sense",
        "research",
        "ethicsan",
        "aggregation",
        "surfing",
        "behavior",
        "collected",
        "bot",
        "present",
        "greater",
        "distance",
        "researcher",
        "respondent",
        "interview",
        "done",
        "virtual",
        "world",
        "avatar",
        "distance",
        "lead",
        "u",
        "suggest",
        "computer",
        "security",
        "research",
        "focus",
        "le",
        "concern",
        "around",
        "human",
        "subject",
        "research",
        "traditional",
        "sense",
        "concern",
        "human",
        "harming",
        "research",
        "p",
        "italic",
        "original",
        "two",
        "conceptual",
        "notion",
        "relevant",
        "considering",
        "emergent",
        "form",
        "identity",
        "personally",
        "identifiable",
        "information",
        "pii",
        "avatar",
        "virtual",
        "being",
        "bot",
        "textual",
        "graphical",
        "information",
        "within",
        "code",
        "federal",
        "regulation",
        "cfr",
        "f",
        "new",
        "form",
        "representation",
        "considered",
        "human",
        "subject",
        "pii",
        "living",
        "individual",
        "obtained",
        "pii",
        "obtained",
        "researcher",
        "scraping",
        "data",
        "source",
        "profile",
        "avatar",
        "piece",
        "data",
        "made",
        "available",
        "platform",
        "fairfield",
        "agrees",
        "avatar",
        "example",
        "merely",
        "represent",
        "collection",
        "pixelsit",
        "represents",
        "identity",
        "user",
        "multiple",
        "academic",
        "discipline",
        "already",
        "long",
        "engaged",
        "human",
        "subject",
        "research",
        "medicine",
        "sociology",
        "anthropology",
        "psychology",
        "communication",
        "established",
        "ethical",
        "guideline",
        "intended",
        "assist",
        "researcher",
        "charged",
        "ensuring",
        "research",
        "human",
        "subject",
        "follows",
        "legal",
        "requirement",
        "ethical",
        "practice",
        "research",
        "involving",
        "internetwhere",
        "individual",
        "increasingly",
        "share",
        "personal",
        "information",
        "platform",
        "porous",
        "shifting",
        "boundary",
        "spread",
        "aggregation",
        "data",
        "disparate",
        "source",
        "become",
        "norm",
        "webbased",
        "service",
        "privacy",
        "policy",
        "term",
        "service",
        "statement",
        "morph",
        "evolve",
        "rapidlythe",
        "ethical",
        "framework",
        "assumption",
        "traditionally",
        "used",
        "researcher",
        "reb",
        "frequently",
        "challenged",
        "research",
        "ethic",
        "board",
        "increasingly",
        "challenged",
        "unique",
        "ethical",
        "dimension",
        "internetbased",
        "research",
        "protocol",
        "survey",
        "us",
        "irbs",
        "le",
        "half",
        "ethical",
        "review",
        "board",
        "identified",
        "internetbased",
        "research",
        "area",
        "concern",
        "importance",
        "time",
        "guideline",
        "checklist",
        "place",
        "reviewing",
        "internetbased",
        "research",
        "protocol",
        "buchanan",
        "es",
        "irbs",
        "surveyed",
        "acknowledged",
        "ethical",
        "issue",
        "unique",
        "research",
        "using",
        "online",
        "data",
        "yet",
        "said",
        "felt",
        "irbs",
        "well",
        "versed",
        "technical",
        "aspect",
        "online",
        "data",
        "collection",
        "agreed",
        "irb",
        "expertise",
        "stay",
        "abreast",
        "change",
        "online",
        "technology",
        "irbs",
        "challenged",
        "growth",
        "big",
        "data",
        "research",
        "see",
        "increasingly",
        "relies",
        "large",
        "datasets",
        "personal",
        "information",
        "generated",
        "via",
        "social",
        "medium",
        "digital",
        "device",
        "mean",
        "often",
        "hidden",
        "user",
        "study",
        "irbs",
        "revealed",
        "felt",
        "prepared",
        "evaluate",
        "protocol",
        "relying",
        "big",
        "data",
        "tool",
        "sufficient",
        "considering",
        "emerging",
        "area",
        "internet",
        "research",
        "zimmer",
        "chapman",
        "presented",
        "various",
        "hypothetical",
        "research",
        "scenario",
        "utilizing",
        "big",
        "data",
        "asked",
        "irb",
        "would",
        "likely",
        "review",
        "protocol",
        "numerous",
        "viewpoint",
        "different",
        "strongly",
        "many",
        "case",
        "consider",
        "following",
        "scenario",
        "researcher",
        "plan",
        "scrape",
        "public",
        "comment",
        "online",
        "newspaper",
        "page",
        "predict",
        "election",
        "outcome",
        "aggregate",
        "analysis",
        "determine",
        "public",
        "sentiment",
        "researcher",
        "plan",
        "inform",
        "commenters",
        "plan",
        "collect",
        "potentiallyidentifiable",
        "user",
        "name",
        "scraping",
        "comment",
        "violates",
        "newspaper",
        "term",
        "service",
        "respondent",
        "indicated",
        "irb",
        "would",
        "view",
        "exempt",
        "indicated",
        "expedited",
        "review",
        "suggested",
        "would",
        "need",
        "full",
        "board",
        "review",
        "think",
        "even",
        "human",
        "subject",
        "research",
        "would",
        "fall",
        "irb",
        "purview",
        "zimmer",
        "chapman",
        "point",
        "potential",
        "gap",
        "inconsistency",
        "irbs",
        "review",
        "ethical",
        "implication",
        "big",
        "data",
        "research",
        "protocol"
    ]
}