{
    "main_text": "Wilderness, the Built Environment, Poverty and Politics\n5. Wilderness, the Built Environment, Poverty and Politics\n\nDespite the variety of positions in environmental ethics developed\nover the last thirty years, they have often focused on issues\nconcerned with wilderness and the reasons for its preservation (see\nCallicott and Nelson 1998 for a collection of essays on the ideas and\nmoral significance of wilderness). The importance of wilderness\nexperience to the human psyche has been emphasized by many\nenvironmental philosophers. Næss, for instance, urges us to\nensure we spend time dwelling in situations of intrinsic value,\nwhereas Rolston seeks “re-creation” of the human soul by\nmeditating in the wilderness. Likewise, the critical theorists believe\nthat aesthetic appreciation of nature has the power to re-enchant\nhuman life. As wilderness becomes increasingly rare, people’s\nexposure to wild things in their natural state has become reduced, and\naccording to some authors this may reduce the chance of our lives and\nother values being transformed as a result of interactions with\nnature. An argument by Bryan Norton draws attention to an analogy with\nmusic. Someone exposed for the first time to a new musical genre may\nundergo a transformation in musical preferences, tastes and values as\na result of the experience (Norton 1987. Such a transformation can\naffect their other preferences and desires too, in both direct and\nindirect ways (see Sarkar 2005, ch. 4, esp. pp. 82–7). In the\nattempt to preserve opportunities for experiences that can change or\nenhance people’s valuations of nature, there has been a move\nsince the early 2000s to find ways of rewilding degraded environments,\nand even parts of cities (Fraser 2009, Monbiot 2013). Note that such\nrewilding is distinct from more traditional forms of restoration,\nsince it need not be pursued with the intention of re-creating some\noriginal landscape or biological system (duToit and Pettorelli 2019).\nA spectacular form of rewilding may be associated with efforts to\nresurrect some long-dead species by using genetic technology to\ncombine the DNA of an extinct species with the DNA of some\nclosely-related contemporary species. For a review of some of the\nissues about de-extinction see Minteer 2015, and also Siipi and\nFinkelman 2017. Cautions about thinking of de-extinction as radically\ndifferent from more conventional conservation and restoration\npractices are expressed in Novak 2018.\n\nBy contrast to the focus on wild places, relatively little attention\nhas been paid to the built environment, although this is the one in\nwhich most people spend most of their time. In post-war Britain, for\nexample, cheaply constructed new housing developments were often poor\nreplacements for traditional communities. They have been associated\nwith lower amounts of social interaction and increased crime compared\nwith the earlier situation. The destruction of highly functional\nhigh-density traditional housing, indeed, might be compared with the\ndestruction of highly diverse ecosystems and biotic communities.\nLikewise, the loss of the world’s huge diversity of natural\nlanguages has been mourned by many, not just professionals with an\ninterest in linguistics. Urban and linguistic environments are just\ntwo of the many “places” inhabited by humans. Some\nphilosophical theories about natural environments and objects have\npotential to be extended to cover built environments and non-natural\nobjects of several sorts (see King 2000, Light 2001, Palmer 2003,\nwhile Fox 2007 aims to include both built and natural environments in\nthe scope of a single ethical theory). Certainly there are many\nparallels between natural and artificial domains: for example, many of\nthe conceptual problems involved in discussing the restoration of\nnatural objects such as landscapes and ecosystems also appear in the\nparallel context of restoring human-made objects such as buildings and\nworks of art (Vogel 2015).\n\nLovers of wilderness sometimes consider the high human populations in\nsome developing countries as a key problem underlying the\nenvironmental crisis. Rolston (1996), for instance, claims that (some)\nhumans are a kind of planetary “cancer”. He maintains that\nwhile “feeding people always seems humane, ... when we face up\nto what is really going on, by just feeding people, without attention\nto the larger social results, we could be feeding a kind of\ncancer.” This remark is meant to justify the view that saving\nnature should, in some circumstances, have a higher priority than\nfeeding people. But such a view has been criticized for seeming to\nreveal a degree of misanthropy, directed at those human beings least\nable to protect and defend themselves (see Attfield 1998, Brennan\n1998a). The empirical basis of Rolston’s claims has been queried\nby work showing that poor people are often extremely good\nenvironmental managers (Martinez-Alier 2002). Guha’s worries\nabout the elitist and “missionary” tendencies of some\nkinds of deep green environmentalism in certain rich western countries\ncan be quite readily extended to theorists such as Rolston (Guha\n1999). Can such an apparently elitist sort of wilderness ethics ever\nbe democratised? How can the psychically-reviving power of the wild\nbecome available to those living in the slums of Kolkata or São\nPaolo? These questions so far lack convincing answers.\n\nConnections between environmental destruction, unequal resource\nconsumption, poverty and the global economic order have been discussed\nby political scientists, development theorists, geographers and\neconomists as well as by philosophers. Links between economics and\nenvironmental ethics are particularly well established. Work by Mark\nSagoff (1988), for instance, has played a major part in bringing the\ntwo fields together. He argues that “as citizens rather than\nconsumers” people are concerned about values, which cannot\nplausibly be reduced to mere ordered preferences or quantified in\nmonetary terms. Sagoff’s distinction between people as consumers\nand people as citizens was intended to blunt the use of cost-benefit\nanalysis as the final arbiter in discussions about nature’s\nvalue. Of course, spouses take out insurance on each others’\nlives. We pay extra for travel insurance to cover the cost of\ncancellation, illness, or lost baggage. Such actions are economically\nrational. They provide us with some compensation in case of loss.\nNo-one, however, would regard insurance payments as replacing lost\nlimbs, a loved one or even the joys of a cancelled vacation. So it is\nfor nature, according to Sagoff. We can put dollar values on a stand\nof timber, a reef, a beach, a national park. We can measure the travel\ncosts, the money spent by visitors, the real estate values, the park\nfees and all the rest. But these dollar measures do not tell us the\nvalue of nature any more than my insurance premiums tell you the value\nof a human life (also see Shrader-Frechette 1987, O’Neill 1993,\nand Brennan 1995). If Sagoff is right, cost-benefit analysis cannot be\na basis for an ethic of sustainability any more than for an ethic of\nbiodiversity. The potentially misleading appeal to economic reason\nused to justify the expansion of the corporate sector has also come\nunder critical scrutiny by globalisation theorists (see Korten 1999).\nThese critiques do not aim to eliminate economics from environmental\nthinking; rather, they resist any reductive, and strongly\nanthropocentric, tendency to believe that all social and environmental\nproblems are fundamentally or essentially economic. The development of\necological economics explores the scope for common ground between\neconomists and environmental policy-makers, and also the role of\nenvironmental ethics in such discussions (Washington and Maloney\n2020).\n\nOther interdisciplinary approaches link environmental ethics with\nbiology, policy studies, public administration, political theory,\ncultural history, post-colonial theory, literature, geography, and\nhuman ecology (for some examples, see Norton, Hutchins, Stevens, Maple\n1995, Shrader-Frechette 1984, Gruen and Jamieson (eds.) 1994, Karliner\n1997, Diesendorf and Hamilton 1997, Schmidtz and Willott 2002). Many\nassessments of issues concerned with biodiversity, ecosystem health,\npoverty, environmental justice and sustainability look at both human\nand environmental issues, eschewing in the process commitment either\nto a purely anthropocentric or purely ecocentric perspective (see\nHayward and O’Neill 1997, and Dobson 1999 for collections of\nessays looking at the links between sustainability, justice, welfare\nand the distribution of environmental goods). The future development\nof environmental ethics depends on these, and other interdisciplinary\nsynergies, as much as on its anchorage within philosophy (Dereniowska\nand Matzke 2014).\n",
    "section_title": "5. Wilderness, the Built Environment, Poverty and Politics",
    "entry_title": "Environmental Ethics",
    "hierarchy_title": "Environmental Ethics || Wilderness, the Built Environment, Poverty and Politics",
    "tokenized_text": [
        "wilderness",
        "built",
        "environment",
        "poverty",
        "politics",
        "wilderness",
        "built",
        "environment",
        "poverty",
        "politics",
        "despite",
        "variety",
        "position",
        "environmental",
        "ethic",
        "developed",
        "last",
        "thirty",
        "year",
        "often",
        "focused",
        "issue",
        "concerned",
        "wilderness",
        "reason",
        "preservation",
        "see",
        "callicott",
        "nelson",
        "collection",
        "essay",
        "idea",
        "moral",
        "significance",
        "wilderness",
        "importance",
        "wilderness",
        "experience",
        "human",
        "psyche",
        "emphasized",
        "many",
        "environmental",
        "philosopher",
        "næss",
        "instance",
        "urge",
        "u",
        "ensure",
        "spend",
        "time",
        "dwelling",
        "situation",
        "intrinsic",
        "value",
        "whereas",
        "rolston",
        "seek",
        "recreation",
        "human",
        "soul",
        "meditating",
        "wilderness",
        "likewise",
        "critical",
        "theorist",
        "believe",
        "aesthetic",
        "appreciation",
        "nature",
        "power",
        "reenchant",
        "human",
        "life",
        "wilderness",
        "becomes",
        "increasingly",
        "rare",
        "people",
        "exposure",
        "wild",
        "thing",
        "natural",
        "state",
        "become",
        "reduced",
        "according",
        "author",
        "may",
        "reduce",
        "chance",
        "life",
        "value",
        "transformed",
        "result",
        "interaction",
        "nature",
        "argument",
        "bryan",
        "norton",
        "draw",
        "attention",
        "analogy",
        "music",
        "someone",
        "exposed",
        "first",
        "time",
        "new",
        "musical",
        "genre",
        "may",
        "undergo",
        "transformation",
        "musical",
        "preference",
        "taste",
        "value",
        "result",
        "experience",
        "norton",
        "transformation",
        "affect",
        "preference",
        "desire",
        "direct",
        "indirect",
        "way",
        "see",
        "sarkar",
        "ch",
        "esp",
        "pp",
        "attempt",
        "preserve",
        "opportunity",
        "experience",
        "change",
        "enhance",
        "people",
        "valuation",
        "nature",
        "move",
        "since",
        "early",
        "s",
        "find",
        "way",
        "rewilding",
        "degraded",
        "environment",
        "even",
        "part",
        "city",
        "fraser",
        "monbiot",
        "note",
        "rewilding",
        "distinct",
        "traditional",
        "form",
        "restoration",
        "since",
        "need",
        "pursued",
        "intention",
        "recreating",
        "original",
        "landscape",
        "biological",
        "system",
        "dutoit",
        "pettorelli",
        "spectacular",
        "form",
        "rewilding",
        "may",
        "associated",
        "effort",
        "resurrect",
        "longdead",
        "specie",
        "using",
        "genetic",
        "technology",
        "combine",
        "dna",
        "extinct",
        "specie",
        "dna",
        "closelyrelated",
        "contemporary",
        "specie",
        "review",
        "issue",
        "deextinction",
        "see",
        "minteer",
        "also",
        "siipi",
        "finkelman",
        "caution",
        "thinking",
        "deextinction",
        "radically",
        "different",
        "conventional",
        "conservation",
        "restoration",
        "practice",
        "expressed",
        "novak",
        "contrast",
        "focus",
        "wild",
        "place",
        "relatively",
        "little",
        "attention",
        "paid",
        "built",
        "environment",
        "although",
        "one",
        "people",
        "spend",
        "time",
        "postwar",
        "britain",
        "example",
        "cheaply",
        "constructed",
        "new",
        "housing",
        "development",
        "often",
        "poor",
        "replacement",
        "traditional",
        "community",
        "associated",
        "lower",
        "amount",
        "social",
        "interaction",
        "increased",
        "crime",
        "compared",
        "earlier",
        "situation",
        "destruction",
        "highly",
        "functional",
        "highdensity",
        "traditional",
        "housing",
        "indeed",
        "might",
        "compared",
        "destruction",
        "highly",
        "diverse",
        "ecosystem",
        "biotic",
        "community",
        "likewise",
        "loss",
        "world",
        "huge",
        "diversity",
        "natural",
        "language",
        "mourned",
        "many",
        "professional",
        "interest",
        "linguistics",
        "urban",
        "linguistic",
        "environment",
        "two",
        "many",
        "place",
        "inhabited",
        "human",
        "philosophical",
        "theory",
        "natural",
        "environment",
        "object",
        "potential",
        "extended",
        "cover",
        "built",
        "environment",
        "nonnatural",
        "object",
        "several",
        "sort",
        "see",
        "king",
        "light",
        "palmer",
        "fox",
        "aim",
        "include",
        "built",
        "natural",
        "environment",
        "scope",
        "single",
        "ethical",
        "theory",
        "certainly",
        "many",
        "parallel",
        "natural",
        "artificial",
        "domain",
        "example",
        "many",
        "conceptual",
        "problem",
        "involved",
        "discussing",
        "restoration",
        "natural",
        "object",
        "landscape",
        "ecosystem",
        "also",
        "appear",
        "parallel",
        "context",
        "restoring",
        "humanmade",
        "object",
        "building",
        "work",
        "art",
        "vogel",
        "lover",
        "wilderness",
        "sometimes",
        "consider",
        "high",
        "human",
        "population",
        "developing",
        "country",
        "key",
        "problem",
        "underlying",
        "environmental",
        "crisis",
        "rolston",
        "instance",
        "claim",
        "human",
        "kind",
        "planetary",
        "cancer",
        "maintains",
        "feeding",
        "people",
        "always",
        "seems",
        "humane",
        "face",
        "really",
        "going",
        "feeding",
        "people",
        "without",
        "attention",
        "larger",
        "social",
        "result",
        "could",
        "feeding",
        "kind",
        "cancer",
        "remark",
        "meant",
        "justify",
        "view",
        "saving",
        "nature",
        "circumstance",
        "higher",
        "priority",
        "feeding",
        "people",
        "view",
        "criticized",
        "seeming",
        "reveal",
        "degree",
        "misanthropy",
        "directed",
        "human",
        "being",
        "least",
        "able",
        "protect",
        "defend",
        "see",
        "attfield",
        "brennan",
        "a",
        "empirical",
        "basis",
        "rolston",
        "claim",
        "queried",
        "work",
        "showing",
        "poor",
        "people",
        "often",
        "extremely",
        "good",
        "environmental",
        "manager",
        "martinezalier",
        "guha",
        "worry",
        "elitist",
        "missionary",
        "tendency",
        "kind",
        "deep",
        "green",
        "environmentalism",
        "certain",
        "rich",
        "western",
        "country",
        "quite",
        "readily",
        "extended",
        "theorist",
        "rolston",
        "guha",
        "apparently",
        "elitist",
        "sort",
        "wilderness",
        "ethic",
        "ever",
        "democratised",
        "psychicallyreviving",
        "power",
        "wild",
        "become",
        "available",
        "living",
        "slum",
        "kolkata",
        "são",
        "paolo",
        "question",
        "far",
        "lack",
        "convincing",
        "answer",
        "connection",
        "environmental",
        "destruction",
        "unequal",
        "resource",
        "consumption",
        "poverty",
        "global",
        "economic",
        "order",
        "discussed",
        "political",
        "scientist",
        "development",
        "theorist",
        "geographer",
        "economist",
        "well",
        "philosopher",
        "link",
        "economics",
        "environmental",
        "ethic",
        "particularly",
        "well",
        "established",
        "work",
        "mark",
        "sagoff",
        "instance",
        "played",
        "major",
        "part",
        "bringing",
        "two",
        "field",
        "together",
        "argues",
        "citizen",
        "rather",
        "consumer",
        "people",
        "concerned",
        "value",
        "plausibly",
        "reduced",
        "mere",
        "ordered",
        "preference",
        "quantified",
        "monetary",
        "term",
        "sagoff",
        "distinction",
        "people",
        "consumer",
        "people",
        "citizen",
        "intended",
        "blunt",
        "use",
        "costbenefit",
        "analysis",
        "final",
        "arbiter",
        "discussion",
        "nature",
        "value",
        "course",
        "spouse",
        "take",
        "insurance",
        "others",
        "life",
        "pay",
        "extra",
        "travel",
        "insurance",
        "cover",
        "cost",
        "cancellation",
        "illness",
        "lost",
        "baggage",
        "action",
        "economically",
        "rational",
        "provide",
        "u",
        "compensation",
        "case",
        "loss",
        "noone",
        "however",
        "would",
        "regard",
        "insurance",
        "payment",
        "replacing",
        "lost",
        "limb",
        "loved",
        "one",
        "even",
        "joy",
        "cancelled",
        "vacation",
        "nature",
        "according",
        "sagoff",
        "put",
        "dollar",
        "value",
        "stand",
        "timber",
        "reef",
        "beach",
        "national",
        "park",
        "measure",
        "travel",
        "cost",
        "money",
        "spent",
        "visitor",
        "real",
        "estate",
        "value",
        "park",
        "fee",
        "rest",
        "dollar",
        "measure",
        "tell",
        "u",
        "value",
        "nature",
        "insurance",
        "premium",
        "tell",
        "value",
        "human",
        "life",
        "also",
        "see",
        "shraderfrechette",
        "neill",
        "brennan",
        "sagoff",
        "right",
        "costbenefit",
        "analysis",
        "basis",
        "ethic",
        "sustainability",
        "ethic",
        "biodiversity",
        "potentially",
        "misleading",
        "appeal",
        "economic",
        "reason",
        "used",
        "justify",
        "expansion",
        "corporate",
        "sector",
        "also",
        "come",
        "critical",
        "scrutiny",
        "globalisation",
        "theorist",
        "see",
        "korten",
        "critique",
        "aim",
        "eliminate",
        "economics",
        "environmental",
        "thinking",
        "rather",
        "resist",
        "reductive",
        "strongly",
        "anthropocentric",
        "tendency",
        "believe",
        "social",
        "environmental",
        "problem",
        "fundamentally",
        "essentially",
        "economic",
        "development",
        "ecological",
        "economics",
        "explores",
        "scope",
        "common",
        "ground",
        "economist",
        "environmental",
        "policymakers",
        "also",
        "role",
        "environmental",
        "ethic",
        "discussion",
        "washington",
        "maloney",
        "interdisciplinary",
        "approach",
        "link",
        "environmental",
        "ethic",
        "biology",
        "policy",
        "study",
        "public",
        "administration",
        "political",
        "theory",
        "cultural",
        "history",
        "postcolonial",
        "theory",
        "literature",
        "geography",
        "human",
        "ecology",
        "example",
        "see",
        "norton",
        "hutchins",
        "stevens",
        "maple",
        "shraderfrechette",
        "gruen",
        "jamieson",
        "ed",
        "karliner",
        "diesendorf",
        "hamilton",
        "schmidtz",
        "willott",
        "many",
        "assessment",
        "issue",
        "concerned",
        "biodiversity",
        "ecosystem",
        "health",
        "poverty",
        "environmental",
        "justice",
        "sustainability",
        "look",
        "human",
        "environmental",
        "issue",
        "eschewing",
        "process",
        "commitment",
        "either",
        "purely",
        "anthropocentric",
        "purely",
        "ecocentric",
        "perspective",
        "see",
        "hayward",
        "neill",
        "dobson",
        "collection",
        "essay",
        "looking",
        "link",
        "sustainability",
        "justice",
        "welfare",
        "distribution",
        "environmental",
        "good",
        "future",
        "development",
        "environmental",
        "ethic",
        "depends",
        "interdisciplinary",
        "synergy",
        "much",
        "anchorage",
        "within",
        "philosophy",
        "dereniowska",
        "matzke"
    ]
}