{
    "main_text": "Epicurus\n7. Epicurus\n\nEpicurean moral theory is the most prominent hedonistic theory in the\nancient world. While Epicurus holds that pleasure is the sole\nintrinsic good and pain is what is intrinsically bad for humans, he is\nalso very careful about defining these two. Aware of the Cyrenaics who\nhold that pleasures, moral and immoral, are the end or goal of all\naction, Epicurus presents a sustained argument that pleasure,\ncorrectly understood, will coincide with virtue.\n\nIn the Letter to Menoeceus, Epicurus begins by making a\ndistinction among desires. Some desires are empty or groundless and\nothers are natural; the natural are further subdivided into the merely\nnatural and the necessary. Finally, the necessary are those necessary\nfor happiness, those necessary for the body’s freedom from\ndistress, and those necessary for life itself (Letter to\nMenoeceus 127). A helpful scholiast (cf. Principal\nDoctrines XXIX) gives us some examples; necessary desires are\nones that bring relief from unavoidable pain, such as drinking when\nthirsty – if we don’t drink when we need replenishment, we\nwill just get thirstier and thirstier, a painful experience. The\nnatural but not necessary are the ones that vary pleasure but are not\nneeded in order to motivate us to remove or ward off pain,\nsuch as the desire for expensive food: we do not need to want, or to\neat, expensive food in order to ward off the pain of prolonged hunger.\nFinally, the groundless desires are for such things as crowns and\nstatues bestowed as civic honors – these are things that when\ndesired at all are desired with intense and harmful cravings. Keeping\nthese distinctions in mind is a great help in one’s life because\nit shows us what we need to aim for. The aim of the blessed life is\nthe body’s health and the soul’s freedom from disturbance\n(ataraxia) (128).\n\nAfter this austere introduction, Epicurus makes the bold claim that\npleasure is the beginning and end of the blessed life. Then he makes\nan important qualification. Just because pleasure is the good,\nEpicureans do not seek every pleasure. Some lead to greater pain. Just\nso, they do not avoid all pains; some lead to greater pleasures\n(128–29). Such a position sounds, of course, like common-sense\nhedonism. If one’s aim is to have as much pleasure as possible\nover the long term, it makes sense to avoid some smaller pleasures\nthat will be followed by larger pains. If one wants, for example, to\nhave as much pleasure from drinking wine as possible, then it would\nmake sense to exercise some judgment about how much to drink on an\noccasion since the next morning’s hangover will be very\nunpleasant, and might keep one from having wine the next day. However,\nhis distinction among groundless, natural, and necessary desires\nshould make us suspicious that Epicurus is no common-sense hedonist.\nThe aim of life is not maximizing pleasures in the way the above\nexample suggests. Rather, real pleasure, the aim of life, is what we\nexperience through freedom from pain and distress. So it is not the\npains of the hangover or the possible loss of further bouts of wine\ndrinking that should restrain my drinking on this occasion. Rather one\nshould be aiming at the pleasure given by freedom from bodily pain and\nmental distress (131–32).\n\nThe usual way to understand the pleasure of freedom from pain and from\ndistress is by way of the distinction between kinetic pleasures and\nkatastematic, or what are, following Cicero, misleadingly called\n‘static’ ones (Diogenes Laertius X 136). The name of the\nformer implies motion and the name of the latter implies a state or\ncondition. The reason the distinction is important is that freedom\nfrom pain and from distress is a state or condition, not a motion.\nEpicurus holds not only that this state is a kind of pleasure but that\nit is the most complete pleasure (Principal Doctrines III).\nModern commentators have taken various approaches to explaining why\nthis state should be considered a pleasure, as opposed to, e.g., the\nattitude of taking pleasure in the fact that one is free of pain and\ndistress. After all, taking pleasure in a fact is not a feeling in the\nsame sense as the pleasure of drinking when thirsty. Since the latter\nis usually taken to be an example of kinetic pleasure (and is\nassociated with the pain of thirst), sometimes katastematic pleasure\nis said to be just kinetic pleasure free from pain and distress, e.g.,\nthe pleasure of satiety. A somewhat broader conception of katastematic\npleasure holds that it is the enjoyment of one’s natural\nconstitution when one is not distracted by bodily pain or mental\ndistress. Finally, some commentators hold the pleasure of freedom from\npain and from distress to be a feeling available only to the wise\nperson, who properly appreciates simple pleasures. Since eating plain\nbread and drinking water are usually not difficult to achieve, to the\nwise, their enjoyment is not overwhelmed by fear (130–31).\nAccordingly, the pleasure they take in these is free of pain and\ndistress. Of course, the wise do not have to confine themselves to\nsimple pleasures; they can enjoy luxurious ones as well – as\nlong as they avoid needing them, which entails fear.\n\nAt this point, we can see that Epicurus has so refined the account of\npleasure and pain that he is able to tie them to virtue. In the\nLetter to Menoeceus, he claims, as a truth for which he does\nnot argue, that virtue and pleasure are inseparable and that living a\nprudent, honorable, and just life is the necessary and sufficient\nmeans to the pleasure that is the end of life (132). An example of\nwhat he might mean is found in Principal Doctrines, where\nEpicurus holds that justice is a contract among humans to avoid\nsuffering harm from one another. Then he argues that injustice is not\nbad per se but is bad because of the fear that arises from\nthe expectation that one will be punished for his misdeeds. He\nreinforces this claim by arguing that it is impossible for someone who\nviolates the compact to be confident that he will escape detection\n(Principal Doctrines XXXIV–V). While one might doubt\nthis claim about the malfactor’s state of mind, nevertheless, we\ncan see that Epicurus means to ground justice, understood as the rules\ngoverning human intercourse, in his moral psychology, i.e., the need\nto avoid distress.\n\nEpicurus, like his predecessors in the ancient moral tradition,\nidentified the good as something psychological. However, instead of,\nfor example, the complex Aristotelian notion of excellent activity of\nthe soul, Epicurus settled on the fairly obvious psychological good of\npleasure. Of course, Aristotle argues that excellent activity of the\nsoul is intrinsically pleasurable (Nicomachean Ethics\n1099a5). Still, in his account pleasure seems something like a\ndividend of excellent activity (1175b30). By contrast, for Epicurus\npleasure itself is the end of life. However, since Epicureans hold\nfreedom from pain (aponia) and distress (ataraxia)\ngives the preferable pleasure, they emphasize tranquility\n(ataraxia) as the end of life. Modern utilitarians, for whom\nfreedom from pain and distress is not paramount, would include a\nbroader palate of pleasures.\n\nEpicurus’ doctrine can be considered eudaimonist. While Plato\nand Aristotle maintain that virtue is constitutive of happiness,\nEpicurus holds that virtue is the only means to achieve happiness,\nwhere happiness is understood as a continuous experience of the\npleasure that comes from freedom from pain and from mental distress.\nThus, he is a eudaimonist in that he holds virtue is indispensable to\nhappiness; but he does not identify virtuous activity, in whole or in\npart, with happiness. Finally, Epicurus is usually interpreted to have\nheld a version of psychological hedonism – i.e., everything we\ndo is done for the sake of pleasure – rather than ethical\nhedonism – i.e., we ought to do everything for the sake of\npleasure. However, Principal Doctrine XXV suggests the latter\nposition; and when in the Letter to Menoeceus he says that\n“we” do everything in order not to be in pain or in fear,\nhe might mean to be referring to “we” Epicureans. If so,\nthe claim would be normative. Still, once all disturbance of the soul\nis dispelled, he says, one is no longer in need nor is there any other\ngood that could be added (128). Since this claim appears to be\ndescriptive, Epicurus could be taken, as he usually has been, to be\narguing that whatever we do is done for the sake of pleasure. In this\naccount, that aspect of human nature on which virtue is based is\nfairly straightforward. The account is certainly less complex than,\ne.g., Aristotle’s. In turn, Epicurus seems to have argued in\nsuch a way as to make pleasure the only reason for being virtuous. If\npsychological hedonism is true, then when one realizes the necessary\nlink between virtue and pleasure, one has all the reason one needs to\nbe virtuous and the only reason one can have.\n",
    "section_title": "7. Epicurus",
    "entry_title": "Ancient Ethical Theory",
    "hierarchy_title": "Ancient Ethical Theory || Epicurus",
    "tokenized_text": [
        "epicurus",
        "epicurus",
        "epicurean",
        "moral",
        "theory",
        "prominent",
        "hedonistic",
        "theory",
        "ancient",
        "world",
        "epicurus",
        "hold",
        "pleasure",
        "sole",
        "intrinsic",
        "good",
        "pain",
        "intrinsically",
        "bad",
        "human",
        "also",
        "careful",
        "defining",
        "two",
        "aware",
        "cyrenaics",
        "hold",
        "pleasure",
        "moral",
        "immoral",
        "end",
        "goal",
        "action",
        "epicurus",
        "present",
        "sustained",
        "argument",
        "pleasure",
        "correctly",
        "understood",
        "coincide",
        "virtue",
        "letter",
        "menoeceus",
        "epicurus",
        "begin",
        "making",
        "distinction",
        "among",
        "desire",
        "desire",
        "empty",
        "groundless",
        "others",
        "natural",
        "natural",
        "subdivided",
        "merely",
        "natural",
        "necessary",
        "finally",
        "necessary",
        "necessary",
        "happiness",
        "necessary",
        "body",
        "freedom",
        "distress",
        "necessary",
        "life",
        "letter",
        "menoeceus",
        "helpful",
        "scholiast",
        "cf",
        "principal",
        "doctrine",
        "xxix",
        "give",
        "u",
        "example",
        "necessary",
        "desire",
        "one",
        "bring",
        "relief",
        "unavoidable",
        "pain",
        "drinking",
        "thirsty",
        "drink",
        "need",
        "replenishment",
        "get",
        "thirstier",
        "thirstier",
        "painful",
        "experience",
        "natural",
        "necessary",
        "one",
        "vary",
        "pleasure",
        "needed",
        "order",
        "motivate",
        "u",
        "remove",
        "ward",
        "pain",
        "desire",
        "expensive",
        "food",
        "need",
        "want",
        "eat",
        "expensive",
        "food",
        "order",
        "ward",
        "pain",
        "prolonged",
        "hunger",
        "finally",
        "groundless",
        "desire",
        "thing",
        "crown",
        "statue",
        "bestowed",
        "civic",
        "honor",
        "thing",
        "desired",
        "desired",
        "intense",
        "harmful",
        "craving",
        "keeping",
        "distinction",
        "mind",
        "great",
        "help",
        "one",
        "life",
        "show",
        "u",
        "need",
        "aim",
        "aim",
        "blessed",
        "life",
        "body",
        "health",
        "soul",
        "freedom",
        "disturbance",
        "ataraxia",
        "austere",
        "introduction",
        "epicurus",
        "make",
        "bold",
        "claim",
        "pleasure",
        "beginning",
        "end",
        "blessed",
        "life",
        "make",
        "important",
        "qualification",
        "pleasure",
        "good",
        "epicurean",
        "seek",
        "every",
        "pleasure",
        "lead",
        "greater",
        "pain",
        "avoid",
        "pain",
        "lead",
        "greater",
        "pleasure",
        "position",
        "sound",
        "course",
        "like",
        "commonsense",
        "hedonism",
        "one",
        "aim",
        "much",
        "pleasure",
        "possible",
        "long",
        "term",
        "make",
        "sense",
        "avoid",
        "smaller",
        "pleasure",
        "followed",
        "larger",
        "pain",
        "one",
        "want",
        "example",
        "much",
        "pleasure",
        "drinking",
        "wine",
        "possible",
        "would",
        "make",
        "sense",
        "exercise",
        "judgment",
        "much",
        "drink",
        "occasion",
        "since",
        "next",
        "morning",
        "hangover",
        "unpleasant",
        "might",
        "keep",
        "one",
        "wine",
        "next",
        "day",
        "however",
        "distinction",
        "among",
        "groundless",
        "natural",
        "necessary",
        "desire",
        "make",
        "u",
        "suspicious",
        "epicurus",
        "commonsense",
        "hedonist",
        "aim",
        "life",
        "maximizing",
        "pleasure",
        "way",
        "example",
        "suggests",
        "rather",
        "real",
        "pleasure",
        "aim",
        "life",
        "experience",
        "freedom",
        "pain",
        "distress",
        "pain",
        "hangover",
        "possible",
        "loss",
        "bout",
        "wine",
        "drinking",
        "restrain",
        "drinking",
        "occasion",
        "rather",
        "one",
        "aiming",
        "pleasure",
        "given",
        "freedom",
        "bodily",
        "pain",
        "mental",
        "distress",
        "usual",
        "way",
        "understand",
        "pleasure",
        "freedom",
        "pain",
        "distress",
        "way",
        "distinction",
        "kinetic",
        "pleasure",
        "katastematic",
        "following",
        "cicero",
        "misleadingly",
        "called",
        "static",
        "one",
        "diogenes",
        "laertius",
        "x",
        "name",
        "former",
        "implies",
        "motion",
        "name",
        "latter",
        "implies",
        "state",
        "condition",
        "reason",
        "distinction",
        "important",
        "freedom",
        "pain",
        "distress",
        "state",
        "condition",
        "motion",
        "epicurus",
        "hold",
        "state",
        "kind",
        "pleasure",
        "complete",
        "pleasure",
        "principal",
        "doctrine",
        "iii",
        "modern",
        "commentator",
        "taken",
        "various",
        "approach",
        "explaining",
        "state",
        "considered",
        "pleasure",
        "opposed",
        "eg",
        "attitude",
        "taking",
        "pleasure",
        "fact",
        "one",
        "free",
        "pain",
        "distress",
        "taking",
        "pleasure",
        "fact",
        "feeling",
        "sense",
        "pleasure",
        "drinking",
        "thirsty",
        "since",
        "latter",
        "usually",
        "taken",
        "example",
        "kinetic",
        "pleasure",
        "associated",
        "pain",
        "thirst",
        "sometimes",
        "katastematic",
        "pleasure",
        "said",
        "kinetic",
        "pleasure",
        "free",
        "pain",
        "distress",
        "eg",
        "pleasure",
        "satiety",
        "somewhat",
        "broader",
        "conception",
        "katastematic",
        "pleasure",
        "hold",
        "enjoyment",
        "one",
        "natural",
        "constitution",
        "one",
        "distracted",
        "bodily",
        "pain",
        "mental",
        "distress",
        "finally",
        "commentator",
        "hold",
        "pleasure",
        "freedom",
        "pain",
        "distress",
        "feeling",
        "available",
        "wise",
        "person",
        "properly",
        "appreciates",
        "simple",
        "pleasure",
        "since",
        "eating",
        "plain",
        "bread",
        "drinking",
        "water",
        "usually",
        "difficult",
        "achieve",
        "wise",
        "enjoyment",
        "overwhelmed",
        "fear",
        "accordingly",
        "pleasure",
        "take",
        "free",
        "pain",
        "distress",
        "course",
        "wise",
        "confine",
        "simple",
        "pleasure",
        "enjoy",
        "luxurious",
        "one",
        "well",
        "long",
        "avoid",
        "needing",
        "entail",
        "fear",
        "point",
        "see",
        "epicurus",
        "refined",
        "account",
        "pleasure",
        "pain",
        "able",
        "tie",
        "virtue",
        "letter",
        "menoeceus",
        "claim",
        "truth",
        "argue",
        "virtue",
        "pleasure",
        "inseparable",
        "living",
        "prudent",
        "honorable",
        "life",
        "necessary",
        "sufficient",
        "mean",
        "pleasure",
        "end",
        "life",
        "example",
        "might",
        "mean",
        "found",
        "principal",
        "doctrine",
        "epicurus",
        "hold",
        "justice",
        "contract",
        "among",
        "human",
        "avoid",
        "suffering",
        "harm",
        "one",
        "another",
        "argues",
        "injustice",
        "bad",
        "per",
        "se",
        "bad",
        "fear",
        "arises",
        "expectation",
        "one",
        "punished",
        "misdeed",
        "reinforces",
        "claim",
        "arguing",
        "impossible",
        "someone",
        "violates",
        "compact",
        "confident",
        "escape",
        "detection",
        "principal",
        "doctrine",
        "xxxivv",
        "one",
        "might",
        "doubt",
        "claim",
        "malfactor",
        "state",
        "mind",
        "nevertheless",
        "see",
        "epicurus",
        "mean",
        "ground",
        "justice",
        "understood",
        "rule",
        "governing",
        "human",
        "intercourse",
        "moral",
        "psychology",
        "ie",
        "need",
        "avoid",
        "distress",
        "epicurus",
        "like",
        "predecessor",
        "ancient",
        "moral",
        "tradition",
        "identified",
        "good",
        "something",
        "psychological",
        "however",
        "instead",
        "example",
        "complex",
        "aristotelian",
        "notion",
        "excellent",
        "activity",
        "soul",
        "epicurus",
        "settled",
        "fairly",
        "obvious",
        "psychological",
        "good",
        "pleasure",
        "course",
        "aristotle",
        "argues",
        "excellent",
        "activity",
        "soul",
        "intrinsically",
        "pleasurable",
        "nicomachean",
        "ethic",
        "a",
        "still",
        "account",
        "pleasure",
        "seems",
        "something",
        "like",
        "dividend",
        "excellent",
        "activity",
        "b",
        "contrast",
        "epicurus",
        "pleasure",
        "end",
        "life",
        "however",
        "since",
        "epicurean",
        "hold",
        "freedom",
        "pain",
        "aponia",
        "distress",
        "ataraxia",
        "give",
        "preferable",
        "pleasure",
        "emphasize",
        "tranquility",
        "ataraxia",
        "end",
        "life",
        "modern",
        "utilitarian",
        "freedom",
        "pain",
        "distress",
        "paramount",
        "would",
        "include",
        "broader",
        "palate",
        "pleasure",
        "epicurus",
        "doctrine",
        "considered",
        "eudaimonist",
        "plato",
        "aristotle",
        "maintain",
        "virtue",
        "constitutive",
        "happiness",
        "epicurus",
        "hold",
        "virtue",
        "mean",
        "achieve",
        "happiness",
        "happiness",
        "understood",
        "continuous",
        "experience",
        "pleasure",
        "come",
        "freedom",
        "pain",
        "mental",
        "distress",
        "thus",
        "eudaimonist",
        "hold",
        "virtue",
        "indispensable",
        "happiness",
        "identify",
        "virtuous",
        "activity",
        "whole",
        "part",
        "happiness",
        "finally",
        "epicurus",
        "usually",
        "interpreted",
        "held",
        "version",
        "psychological",
        "hedonism",
        "ie",
        "everything",
        "done",
        "sake",
        "pleasure",
        "rather",
        "ethical",
        "hedonism",
        "ie",
        "ought",
        "everything",
        "sake",
        "pleasure",
        "however",
        "principal",
        "doctrine",
        "xxv",
        "suggests",
        "latter",
        "position",
        "letter",
        "menoeceus",
        "say",
        "everything",
        "order",
        "pain",
        "fear",
        "might",
        "mean",
        "referring",
        "epicurean",
        "claim",
        "would",
        "normative",
        "still",
        "disturbance",
        "soul",
        "dispelled",
        "say",
        "one",
        "longer",
        "need",
        "good",
        "could",
        "added",
        "since",
        "claim",
        "appears",
        "descriptive",
        "epicurus",
        "could",
        "taken",
        "usually",
        "arguing",
        "whatever",
        "done",
        "sake",
        "pleasure",
        "account",
        "aspect",
        "human",
        "nature",
        "virtue",
        "based",
        "fairly",
        "straightforward",
        "account",
        "certainly",
        "le",
        "complex",
        "eg",
        "aristotle",
        "turn",
        "epicurus",
        "seems",
        "argued",
        "way",
        "make",
        "pleasure",
        "reason",
        "virtuous",
        "psychological",
        "hedonism",
        "true",
        "one",
        "realizes",
        "necessary",
        "link",
        "virtue",
        "pleasure",
        "one",
        "reason",
        "one",
        "need",
        "virtuous",
        "reason",
        "one"
    ]
}