{
    "main_text": "Contemporary Ethical Concerns about Social Networking Services || Social Networking Services and Privacy\n3.1 Social Networking Services and Privacy\n\nFundamental practices of concern for direct ethical impacts on privacy\ninclude: the transfer of users’ data to third parties for\nintrusive purposes, especially marketing, data mining, and\nsurveillance; the use of SNS data to train facial-recognition systems\nor other algorithmic tools that identify, track and profile people\nwithout their free consent; the ability of third-party applications to\ncollect and publish user data without their permission or awareness;\nthe dominant reliance by SNS on opaque or inadequate privacy settings;\nthe use of ‘cookies’ to track online user activities after\nthey have left a SNS; the abuse of social networking tools or data for\nstalking or harassment; widespread scraping of social media data by\nacademic researchers for a variety of unconsented purposes;\nundisclosed sharing of user information or patterns of activity with\ngovernment entities; and, last but not least, the tendency of SNS to\nfoster imprudent, ill-informed or unethical information sharing\npractices by users, either with respect to their own personal data or\ndata related to other persons and entities. Facebook has been a\nparticular lightning-rod for criticism of its privacy practices\n(Spinello 2011, Vaidhyanathan 2018), but it is just the most visible\nmember of a far broader and more complex network of SNS actors with\naccess to unprecedented quantities of sensitive personal data.\n\nIndirectly, the incentives of social media environments create\nparticular problems with respect to privacy norms. For example, since\nit is the ability to access information freely shared by others that\nmakes SNS uniquely attractive and useful, and since platforms are\ngenerally designed to reward disclosure, it turns out that contrary to\ntraditional views of information privacy, giving users greater control\nover their information-sharing practices can actually lead to\ndecreased privacy for themselves and others in their network.\nIndeed, advertisers, insurance companies and employers are\nincreasingly less interested in knowing the private facts of\nindividual users’ lives, and more interested in using their data\nto train algorithms that can predict the behavior of people very\nmuch like that user. Thus the real privacy risk of our social\nmedia practices is often not to ourselves but to other people; if a\nperson is comfortable with the personal risk of their data sharing\nhabits, it does not follow that these habits are ethically benign.\nMoreover, users are still caught in the tension between their personal\nmotivations for using SNS and the profit-driven motivations of the\ncorporations that possess their data (Baym 2011, Vaidhyanathan 2018).\nJared Lanier frames the point cynically when he states that:\n“The only hope for social networking sites from a business point\nof view is for a magic formula to appear in which some method of\nviolating privacy and dignity becomes acceptable” (Lanier\n2010).\n\nScholars also note the way in which SNS architectures are often\nstructurally insensitive to the granularity of human sociality (Hull,\nLipford & Latulipe 2011). That is, such architectures tend to\ntreat human relations as if they are all of a kind, ignoring the\nprofound differences among types of social relation (familial,\nprofessional, collegial, commercial, civic, etc.). As a consequence,\nthe privacy controls of such architectures often flatten the\nvariability of privacy norms within different but overlapping social\nspheres. Among philosophical accounts of privacy, Nissenbaum’s\n(2010) view of contextual integrity has seemed to many to be\nparticularly well suited to explaining the diversity and complexity of\nprivacy expectations generated by new social media (see for example\nGrodzinsky and Tavani 2010; Capurro 2011). Contextual integrity\ndemands that our information practices respect context-sensitive\nprivacy norms, where ‘context’ refers not to the overly\ncoarse distinction between ‘private’ and\n‘public,’ but to a far richer array of social settings\ncharacterized by distinctive roles, norms and values. For example, the\nsame piece of information made ‘public’ in the context of\na status update to family and friends on Facebook may nevertheless be\nconsidered by the same discloser to be ‘private’ in other\ncontexts; that is, she may not expect that same information to be\nprovided to strangers Googling her name, or to bank employees\nexamining her credit history.\n\nOn the design side, such complexity means that attempts to produce\nmore ‘user-friendly’ privacy controls face an uphill\nchallenge—they must balance the need for simplicity and ease of\nuse with the need to better represent the rich and complex structures\nof our social universes. A key design question, then, is how SNS\nprivacy interfaces can be made more accessible and more\nsocially intuitive for users.\n\nHull et al. (2011) also take note of the apparent plasticity of user\nattitudes about privacy in SNS contexts, as evidenced by the pattern\nof widespread outrage over changed or newly disclosed privacy\npractices of SNS providers being followed by a period of accommodation\nto and acceptance of the new practices (Boyd and Hargittai 2010). In\ntheir 2018 book Re-Engineering Humanity, Brett Frischmann and\nEvan Selinger argue that SNS contribute to a slippery slope of\n“techno-social engineering creep” that produces a gradual\nnormalization of increasingly pervasive and intrusive digital\nsurveillance. A related concern is the “privacy paradox,”\nin which users’ voluntary sharing of data online belies their\nown stated values concerning privacy. However, recent data from\nApple’s introduction in iOS 14.5 of opt-in for ad tracking,\nwhich the vast majority of iOS users have declined to allow, suggests\nthat most people continue to value and act to protect their privacy,\nwhen given a straightforward choice that does not inhibit their access\nto services (Axon 2021). Working from the late writings of Foucault,\nHull (2015) has explored the way in which the\n‘self-management’ model of online privacy protection\nembodied in standard ‘notice and consent’ practices only\nreinforces a narrow neoliberal conception of privacy, and of\nourselves, as commodities for sale and exchange. The debate continues\nabout whether privacy violations can be usefully addressed by users\nmaking wiser privacy-preserving choices (Véliz 2021), or\nwhether the responsibilization of individuals only obscures the urgent\nneed for radical structural reforms of SNS business models\n(Vaidhyanathan 2018).\n\nIn an early study of online communities, Bakardjieva and Feenberg\n(2000) suggested that the rise of communities predicated on the open\nexchange of information may in fact require us to relocate our focus\nin information ethics from privacy concerns to concerns about\nalienation; that is, the exploitation of information for\npurposes not intended by the relevant community. Such considerations\ngive rise to the possibility of users deploying “guerrilla\ntactics” of misinformation, for example, by providing SNS hosts\nwith false names, addresses, birthdates, hometowns or employment\ninformation. Such tactics would aim to subvert the emergence of a new\n“digital totalitarianism” that uses the power of\ninformation rather than physical force as a political control (Capurro\n2011).\n\nFinally, privacy issues with SNS highlight a broader philosophical and\nstructural problem involving the intercultural dimensions of\ninformation ethics and the challenges for ethical pluralism in global\ndigital spaces (Ess 2021). Pak Hang Wong (2013) has argued for the\nneed for privacy norms to be contextualized in ways that do not impose\na culturally hegemonic Western understanding of why privacy matters;\nfor example, in the Confucian context, it is familial privacy rather\nthan individual privacy that is of greatest moral concern. Rafael\nCapurro (2005) has also noted the way in which narrowly Western\nconceptions of privacy occlude other legitimate ethical concerns\nregarding new media practices. For example, he notes that in addition\nto Western worries about protecting the private domain from public\nexposure, we must also take care to protect the public sphere\nfrom the excessive intrusion of the private. Though he illustrates the\npoint with a comment about intrusive uses of cell phones in public\nspaces (2005, 47), the rise of mobile social networking has amplified\nthis concern by several factors. When one must compete with Facebook\nor Twitter for the attention of not only one’s dinner companions\nand family members, but also one’s fellow drivers, pedestrians,\nstudents, moviegoers, patients and audience members, the integrity of\nthe public sphere comes to look as fragile as that of the private.\n",
    "section_title": "3.1 Social Networking Services and Privacy",
    "entry_title": "Social Networking and Ethics",
    "hierarchy_title": "Social Networking and Ethics || Contemporary Ethical Concerns about Social Networking Services || Social Networking Services and Privacy",
    "tokenized_text": [
        "contemporary",
        "ethical",
        "concern",
        "social",
        "networking",
        "service",
        "social",
        "networking",
        "service",
        "privacy",
        "social",
        "networking",
        "service",
        "privacy",
        "fundamental",
        "practice",
        "concern",
        "direct",
        "ethical",
        "impact",
        "privacy",
        "include",
        "transfer",
        "user",
        "data",
        "third",
        "party",
        "intrusive",
        "purpose",
        "especially",
        "marketing",
        "data",
        "mining",
        "surveillance",
        "use",
        "sn",
        "data",
        "train",
        "facialrecognition",
        "system",
        "algorithmic",
        "tool",
        "identify",
        "track",
        "profile",
        "people",
        "without",
        "free",
        "consent",
        "ability",
        "thirdparty",
        "application",
        "collect",
        "publish",
        "user",
        "data",
        "without",
        "permission",
        "awareness",
        "dominant",
        "reliance",
        "sn",
        "opaque",
        "inadequate",
        "privacy",
        "setting",
        "use",
        "cooky",
        "track",
        "online",
        "user",
        "activity",
        "left",
        "sn",
        "abuse",
        "social",
        "networking",
        "tool",
        "data",
        "stalking",
        "harassment",
        "widespread",
        "scraping",
        "social",
        "medium",
        "data",
        "academic",
        "researcher",
        "variety",
        "unconsented",
        "purpose",
        "undisclosed",
        "sharing",
        "user",
        "information",
        "pattern",
        "activity",
        "government",
        "entity",
        "last",
        "least",
        "tendency",
        "sn",
        "foster",
        "imprudent",
        "illinformed",
        "unethical",
        "information",
        "sharing",
        "practice",
        "user",
        "either",
        "respect",
        "personal",
        "data",
        "data",
        "related",
        "person",
        "entity",
        "facebook",
        "particular",
        "lightningrod",
        "criticism",
        "privacy",
        "practice",
        "spinello",
        "vaidhyanathan",
        "visible",
        "member",
        "far",
        "broader",
        "complex",
        "network",
        "sn",
        "actor",
        "access",
        "unprecedented",
        "quantity",
        "sensitive",
        "personal",
        "data",
        "indirectly",
        "incentive",
        "social",
        "medium",
        "environment",
        "create",
        "particular",
        "problem",
        "respect",
        "privacy",
        "norm",
        "example",
        "since",
        "ability",
        "access",
        "information",
        "freely",
        "shared",
        "others",
        "make",
        "sn",
        "uniquely",
        "attractive",
        "useful",
        "since",
        "platform",
        "generally",
        "designed",
        "reward",
        "disclosure",
        "turn",
        "contrary",
        "traditional",
        "view",
        "information",
        "privacy",
        "giving",
        "user",
        "greater",
        "control",
        "informationsharing",
        "practice",
        "actually",
        "lead",
        "decreased",
        "privacy",
        "others",
        "network",
        "indeed",
        "advertiser",
        "insurance",
        "company",
        "employer",
        "increasingly",
        "le",
        "interested",
        "knowing",
        "private",
        "fact",
        "individual",
        "user",
        "life",
        "interested",
        "using",
        "data",
        "train",
        "algorithm",
        "predict",
        "behavior",
        "people",
        "much",
        "like",
        "user",
        "thus",
        "real",
        "privacy",
        "risk",
        "social",
        "medium",
        "practice",
        "often",
        "people",
        "person",
        "comfortable",
        "personal",
        "risk",
        "data",
        "sharing",
        "habit",
        "follow",
        "habit",
        "ethically",
        "benign",
        "moreover",
        "user",
        "still",
        "caught",
        "tension",
        "personal",
        "motivation",
        "using",
        "sn",
        "profitdriven",
        "motivation",
        "corporation",
        "posse",
        "data",
        "baym",
        "vaidhyanathan",
        "jared",
        "lanier",
        "frame",
        "point",
        "cynically",
        "state",
        "hope",
        "social",
        "networking",
        "site",
        "business",
        "point",
        "view",
        "magic",
        "formula",
        "appear",
        "method",
        "violating",
        "privacy",
        "dignity",
        "becomes",
        "acceptable",
        "lanier",
        "scholar",
        "also",
        "note",
        "way",
        "sn",
        "architecture",
        "often",
        "structurally",
        "insensitive",
        "granularity",
        "human",
        "sociality",
        "hull",
        "lipford",
        "latulipe",
        "architecture",
        "tend",
        "treat",
        "human",
        "relation",
        "kind",
        "ignoring",
        "profound",
        "difference",
        "among",
        "type",
        "social",
        "relation",
        "familial",
        "professional",
        "collegial",
        "commercial",
        "civic",
        "etc",
        "consequence",
        "privacy",
        "control",
        "architecture",
        "often",
        "flatten",
        "variability",
        "privacy",
        "norm",
        "within",
        "different",
        "overlapping",
        "social",
        "sphere",
        "among",
        "philosophical",
        "account",
        "privacy",
        "nissenbaum",
        "view",
        "contextual",
        "integrity",
        "seemed",
        "many",
        "particularly",
        "well",
        "suited",
        "explaining",
        "diversity",
        "complexity",
        "privacy",
        "expectation",
        "generated",
        "new",
        "social",
        "medium",
        "see",
        "example",
        "grodzinsky",
        "tavani",
        "capurro",
        "contextual",
        "integrity",
        "demand",
        "information",
        "practice",
        "respect",
        "contextsensitive",
        "privacy",
        "norm",
        "context",
        "refers",
        "overly",
        "coarse",
        "distinction",
        "private",
        "public",
        "far",
        "richer",
        "array",
        "social",
        "setting",
        "characterized",
        "distinctive",
        "role",
        "norm",
        "value",
        "example",
        "piece",
        "information",
        "made",
        "public",
        "context",
        "status",
        "update",
        "family",
        "friend",
        "facebook",
        "may",
        "nevertheless",
        "considered",
        "discloser",
        "private",
        "context",
        "may",
        "expect",
        "information",
        "provided",
        "stranger",
        "googling",
        "name",
        "bank",
        "employee",
        "examining",
        "credit",
        "history",
        "design",
        "side",
        "complexity",
        "mean",
        "attempt",
        "produce",
        "userfriendly",
        "privacy",
        "control",
        "face",
        "uphill",
        "challengethey",
        "must",
        "balance",
        "need",
        "simplicity",
        "ease",
        "use",
        "need",
        "better",
        "represent",
        "rich",
        "complex",
        "structure",
        "social",
        "universe",
        "key",
        "design",
        "question",
        "sn",
        "privacy",
        "interface",
        "made",
        "accessible",
        "socially",
        "intuitive",
        "user",
        "hull",
        "et",
        "al",
        "also",
        "take",
        "note",
        "apparent",
        "plasticity",
        "user",
        "attitude",
        "privacy",
        "sn",
        "context",
        "evidenced",
        "pattern",
        "widespread",
        "outrage",
        "changed",
        "newly",
        "disclosed",
        "privacy",
        "practice",
        "sn",
        "provider",
        "followed",
        "period",
        "accommodation",
        "acceptance",
        "new",
        "practice",
        "boyd",
        "hargittai",
        "book",
        "reengineering",
        "humanity",
        "brett",
        "frischmann",
        "evan",
        "selinger",
        "argue",
        "sn",
        "contribute",
        "slippery",
        "slope",
        "technosocial",
        "engineering",
        "creep",
        "produce",
        "gradual",
        "normalization",
        "increasingly",
        "pervasive",
        "intrusive",
        "digital",
        "surveillance",
        "related",
        "concern",
        "privacy",
        "paradox",
        "user",
        "voluntary",
        "sharing",
        "data",
        "online",
        "belies",
        "stated",
        "value",
        "concerning",
        "privacy",
        "however",
        "recent",
        "data",
        "apple",
        "introduction",
        "io",
        "optin",
        "ad",
        "tracking",
        "vast",
        "majority",
        "io",
        "user",
        "declined",
        "allow",
        "suggests",
        "people",
        "continue",
        "value",
        "act",
        "protect",
        "privacy",
        "given",
        "straightforward",
        "choice",
        "inhibit",
        "access",
        "service",
        "axon",
        "working",
        "late",
        "writing",
        "foucault",
        "hull",
        "explored",
        "way",
        "selfmanagement",
        "model",
        "online",
        "privacy",
        "protection",
        "embodied",
        "standard",
        "notice",
        "consent",
        "practice",
        "reinforces",
        "narrow",
        "neoliberal",
        "conception",
        "privacy",
        "commodity",
        "sale",
        "exchange",
        "debate",
        "continues",
        "whether",
        "privacy",
        "violation",
        "usefully",
        "addressed",
        "user",
        "making",
        "wiser",
        "privacypreserving",
        "choice",
        "véliz",
        "whether",
        "responsibilization",
        "individual",
        "obscures",
        "urgent",
        "need",
        "radical",
        "structural",
        "reform",
        "sn",
        "business",
        "model",
        "vaidhyanathan",
        "early",
        "study",
        "online",
        "community",
        "bakardjieva",
        "feenberg",
        "suggested",
        "rise",
        "community",
        "predicated",
        "open",
        "exchange",
        "information",
        "may",
        "fact",
        "require",
        "u",
        "relocate",
        "focus",
        "information",
        "ethic",
        "privacy",
        "concern",
        "concern",
        "alienation",
        "exploitation",
        "information",
        "purpose",
        "intended",
        "relevant",
        "community",
        "consideration",
        "give",
        "rise",
        "possibility",
        "user",
        "deploying",
        "guerrilla",
        "tactic",
        "misinformation",
        "example",
        "providing",
        "sn",
        "host",
        "false",
        "name",
        "address",
        "birthdates",
        "hometown",
        "employment",
        "information",
        "tactic",
        "would",
        "aim",
        "subvert",
        "emergence",
        "new",
        "digital",
        "totalitarianism",
        "us",
        "power",
        "information",
        "rather",
        "physical",
        "force",
        "political",
        "control",
        "capurro",
        "finally",
        "privacy",
        "issue",
        "sn",
        "highlight",
        "broader",
        "philosophical",
        "structural",
        "problem",
        "involving",
        "intercultural",
        "dimension",
        "information",
        "ethic",
        "challenge",
        "ethical",
        "pluralism",
        "global",
        "digital",
        "space",
        "es",
        "pak",
        "hang",
        "wong",
        "argued",
        "need",
        "privacy",
        "norm",
        "contextualized",
        "way",
        "impose",
        "culturally",
        "hegemonic",
        "western",
        "understanding",
        "privacy",
        "matter",
        "example",
        "confucian",
        "context",
        "familial",
        "privacy",
        "rather",
        "individual",
        "privacy",
        "greatest",
        "moral",
        "concern",
        "rafael",
        "capurro",
        "also",
        "noted",
        "way",
        "narrowly",
        "western",
        "conception",
        "privacy",
        "occlude",
        "legitimate",
        "ethical",
        "concern",
        "regarding",
        "new",
        "medium",
        "practice",
        "example",
        "note",
        "addition",
        "western",
        "worry",
        "protecting",
        "private",
        "domain",
        "public",
        "exposure",
        "must",
        "also",
        "take",
        "care",
        "protect",
        "public",
        "sphere",
        "excessive",
        "intrusion",
        "private",
        "though",
        "illustrates",
        "point",
        "comment",
        "intrusive",
        "us",
        "cell",
        "phone",
        "public",
        "space",
        "rise",
        "mobile",
        "social",
        "networking",
        "amplified",
        "concern",
        "several",
        "factor",
        "one",
        "must",
        "compete",
        "facebook",
        "twitter",
        "attention",
        "one",
        "dinner",
        "companion",
        "family",
        "member",
        "also",
        "one",
        "fellow",
        "driver",
        "pedestrian",
        "student",
        "moviegoer",
        "patient",
        "audience",
        "member",
        "integrity",
        "public",
        "sphere",
        "come",
        "look",
        "fragile",
        "private"
    ]
}