{
    "main_text": "Ethical Implications and Core Ethical Issues || Monitoring and Surveillance\n3.3 Monitoring and Surveillance\n\n\nWe next examine privacy concerns in which search engine users\nthemselves are the data subjects (i.e., for search engine companies).\nZimmer (2008, 83) notes that personal information about users is\n“routinely collected” when they use search engines for\ntheir “information-seeking activities.” But why, exactly,\nis this problematic from the perspective of privacy? For one thing,\nsearch engine companies such as Google create a record of every search\nmade by users, and these records are also archived. The topic searched\nfor, as well as the date and time the specific search request is made\nby a user, are included in the record. Until recently, many people had\nbeen unaware that their search queries were being recorded and\ntracked.\n\n\nIn January 2006, many Google users learned that the search engine\ncompany had kept a log of all of their previous searches. At least\nfour major search engine companies had been subpoenaed by the Bush\nAdministration in 2005 for search records based on one week’s of\nsearches during the summer of 2005 (see, for example, Nissenbaum\n2010). They were Google, Yahoo, AOL, and Microsoft (MSN). Google\nrefused to turn over the information. The other search engine\ncompanies would not say how they responded; many assumed, however,\nthat those companies complied with the government’s\nsubpoena. Google was requested to turn over two items: (1) the results\nof search queries/requests it received during a one-week period, and\n(2) a random list of approximately one million URLs searched. Google\nargued that turning over this information would: (a) violate the\nprivacy of its users (and undermine their trust in the search engine\ncompany), and (b) reveal information about the (proprietary) algorithm\nand the processes that Google uses and that this would potentially\nharm its competitive edge as a search service. A court ruled that\nGoogle did not have to comply with (1), but it reached a compromise\nregarding (2), ruling that Google turn over 50,000 URLs to the\ngovernment (Nissenbaum 2010, 29–30).\n\n\nThe information collected about a user’s search queries might\nseem relatively innocuous—after all, who would be interested in\nknowing about the kinds of searches we conduct on the Internet, and who\nwould want to use this information against us? On the other hand,\nhowever, seemingly innocuous personal information can be mined by\ninformation merchants and used to construct personal profiles about us,\nand that these profiles, in turn, can be based on information that is\nnot accurate and can be used to make decisions about us that are not\nfair. For example, imagine a case in which a student happens to be\nwriting a paper on Internet pornography and uses a search engine to\nacquire some references for her research. Records of this user’s\nsearch requests could reveal several queries that individual made about\npornographic Web sites, which in turn might suggest that this user is\ninterested in viewing pornography. So individual searches made by a\nparticular user could theoretically be analyzed in ways to construct a\nprofile of that user that is inaccurate. And, records of the searches\nmade by this and other users could later be subpoenaed in court\ncases (Tavani 2016).\n\n\nAs already noted, information about a user’s search queries is\ncollected by search engine companies as well as by many different kinds\nof “information merchants” in the commercial sphere.\nHalpern (2011, 8) notes that there are approximately 500 companies\nthat are able to track all of our online movements, thereby\n“mining the raw material of the Web and selling it to…data\nmining companies.” Pariser (2011) points out that in tracking our\nactivities, Google’s uses fifty-seven signals—\n\neverything from where you were logged in, from what browser you\nwere using, to what you had searched for before to make queries about,\nto who you were and what kinds of sites you’d like.\n\n And\nZimmer (2008, 77) notes that Google integrates information gathered\nfrom\n\nWeb cookies, detailed server logs, and user\naccounts… [from Google applications such as Gmail, Google +, and\nGoogle Chrome]… which provides a powerful infrastructure of\ndataveillance to monitor, record, and aggregate users’ online\nactivities.\n\n Furthermore, Pariser notes that Google and other\nmajor search engine companies use “prediction engines” to\nconstruct and refine theories about who we are (and what we want to do\nnext). He also notes that many information merchants regard every\n“click signal” a user creates as a “commodity”\nthat can be “auctioned off within microseconds to the highest\nbidding consumer.” Pariser points out that one information\nmerchant, a company called Acxiom, has\n\n accumulated an average of\n1500 pieces of data on every person in its database—personal\ndata that ranges from credit scores to medications used.\n\n\n\nOf course, some users might respond that they do not feel threatened\nby this practice; for example, they might be inclined to feel safe\nfrom a loss of personal privacy because they assume that the data\ncollected about them is anonymous in the sense that it is identifiable\nonly as an IP address, as opposed to a person’s name. However, Zimmer\n(2008, 83) notes that in 2005, one AOL user was able to be identified\nby name “because the Web searches she performed on various\ntopics were recorded and later released by AOL.” It turns out\nthat AOL Research had released over three months worth of personal\nsearch data involving 650,000 users (Wall 2011, 18). Nissenbaum (2010,\n30) points out that in this case, AOL used a process in which\n\n certain\nidentities could be extracted from massive records of anonymized\nsearch-query data that AOL regularly posted on the Internet for use by\nthe scientific research community.\n\n Zimmer believes that the\nincident involving AOL is not unique, but is instead one more use of\ndata surveillance or “dataveillance” (a term coined by\nRoger Clarke in 1988)—i.e., one applied in the context of\nsearch queries.\n\n\nIt is also important to consider whether a meaningful distinction\ncan be drawn between monitoring and surveillance in this context.\nNoting that the two terms are often used interchangeably, Nissenbaum\n(2010, 22) differentiates between them in the following way. Whereas\nsurveillance is a “form of monitoring ‘from above’ by\npolitical regimes and those in authority,” monitoring is used in\nbroader social and “socio-technical” contexts. In\nNissenbaum’s scheme, both monitoring and surveillance are\nexamples of what she calls “socio-technical contexts,” but\nthey are usually put to different uses. For example, Nissenbaum points\nout that monitoring can be done by systems “whose explicit\npurpose is to monitor” (e.g., CCTVs). But she also notes that\ninformation itself can constitute a “modality of\nmonitoring.” For example, she points out that Clarke’s\nnotion of “dataveillance” includes monitoring practices\nthat involve both interactions and transactions. However, we can\ngenerally regard the kinds of practices carried out by information\nmerchants in the consumer sphere as instances of monitoring (rather\nthan surveillance) in Nissenbaum’s sense of that term.\n\n\nWe next shift our focus away from privacy concerns about monitoring\nin the commercial sector to worries about surveillance by\ngovernment actors with respect to information acquired as a result of\nusers’ search queries. Earlier in this section we noted that in\n2005, the Bush Administration informed Google that it must turn over a\nlist of all users’ queries entered into its search engine during\na one week period (the exact dates were not specified by Google). The\nBush Administration’s decision to seek information about the\nsearch requests of ordinary users triggered significant criticism from\nmany privacy advocates. Although the Bush Administration claimed that\nit had the authority to seek electronic information in order to fight\nthe “war on terror” and to prevent another September\n11-like attack, some critics worried that the government was trying to\nuse the subpoenaed information, not for national defense or\nanti-terrorism purposes, but rather to gain data to support its stance\non the Child Online Protection Act, which had been challenged in a U.S.\nDistrict Court and was being revisited by Congress (Nissenbaum 2010, 29).\nThese critics also worried about the implications this has for privacy\n(as an important human value) in the ongoing tension involving security\nvs. privacy interests. And even if privacy is not an absolute value but\nis sometimes outweighed by security concerns, as Himma (2007) argues,\nsome critics question the rationale used for obtaining records of\nsearch requests made by ordinary citizens.\n\n\nHinman (2005) notes that the Patriot Act, passed in the aftermath of\n9/11, allowed U.S. government officials to get information from\nlibraries about which books members had borrowed. He then shows how the\nreasoning used in the case of libraries could easily be extended to\nsearch engines—for example,\n\n if the government could see\nwhich books someone was taking out of a library, why couldn’t it\nalso see which searches we made on search engines?\n\n Hinman also points out that there are several other ways in which\na user’s search requests can be disclosed because of practices\nused by major search engine companies such as Google. He also worries\nthat such practices could eventually lead to surveillance and to\nsuppressing political dissent (as is it has in China). Hinman\nquestions whether Google might have been under political pressure from\noutside interests (e.g., the Bush Administration) to take down\nphotographs of tortured prisoners in the controversial Abu Ghraib\ndetention center (used by the U.S. during the Iraq War in 2004), which\nwere posted but then soon removed with no apparent explanation by that\nsearch engine company. (Some related, as well as additional, questions\nconcerning moral-responsibility-related issues for search engine\ncompanies are examined in detail in Section 4.)\n",
    "section_title": "3.3 Monitoring and Surveillance",
    "entry_title": "Search Engines and Ethics",
    "hierarchy_title": "Search Engines and Ethics || Ethical Implications and Core Ethical Issues || Monitoring and Surveillance",
    "tokenized_text": [
        "ethical",
        "implication",
        "core",
        "ethical",
        "issue",
        "monitoring",
        "surveillance",
        "monitoring",
        "surveillance",
        "next",
        "examine",
        "privacy",
        "concern",
        "search",
        "engine",
        "user",
        "data",
        "subject",
        "ie",
        "search",
        "engine",
        "company",
        "zimmer",
        "note",
        "personal",
        "information",
        "user",
        "routinely",
        "collected",
        "use",
        "search",
        "engine",
        "informationseeking",
        "activities",
        "exactly",
        "problematic",
        "perspective",
        "privacy",
        "one",
        "thing",
        "search",
        "engine",
        "company",
        "google",
        "create",
        "record",
        "every",
        "search",
        "made",
        "user",
        "record",
        "also",
        "archived",
        "topic",
        "searched",
        "well",
        "date",
        "time",
        "specific",
        "search",
        "request",
        "made",
        "user",
        "included",
        "record",
        "recently",
        "many",
        "people",
        "unaware",
        "search",
        "query",
        "recorded",
        "tracked",
        "january",
        "many",
        "google",
        "user",
        "learned",
        "search",
        "engine",
        "company",
        "kept",
        "log",
        "previous",
        "search",
        "least",
        "four",
        "major",
        "search",
        "engine",
        "company",
        "subpoenaed",
        "bush",
        "administration",
        "search",
        "record",
        "based",
        "one",
        "week",
        "search",
        "summer",
        "see",
        "example",
        "nissenbaum",
        "google",
        "yahoo",
        "aol",
        "microsoft",
        "msn",
        "google",
        "refused",
        "turn",
        "information",
        "search",
        "engine",
        "company",
        "would",
        "say",
        "responded",
        "many",
        "assumed",
        "however",
        "company",
        "complied",
        "government",
        "subpoena",
        "google",
        "requested",
        "turn",
        "two",
        "item",
        "result",
        "search",
        "queriesrequests",
        "received",
        "oneweek",
        "period",
        "random",
        "list",
        "approximately",
        "one",
        "million",
        "url",
        "searched",
        "google",
        "argued",
        "turning",
        "information",
        "would",
        "violate",
        "privacy",
        "user",
        "undermine",
        "trust",
        "search",
        "engine",
        "company",
        "b",
        "reveal",
        "information",
        "proprietary",
        "algorithm",
        "process",
        "google",
        "us",
        "would",
        "potentially",
        "harm",
        "competitive",
        "edge",
        "search",
        "service",
        "court",
        "ruled",
        "google",
        "comply",
        "reached",
        "compromise",
        "regarding",
        "ruling",
        "google",
        "turn",
        "url",
        "government",
        "nissenbaum",
        "information",
        "collected",
        "user",
        "search",
        "query",
        "might",
        "seem",
        "relatively",
        "innocuousafter",
        "would",
        "interested",
        "knowing",
        "kind",
        "search",
        "conduct",
        "internet",
        "would",
        "want",
        "use",
        "information",
        "u",
        "hand",
        "however",
        "seemingly",
        "innocuous",
        "personal",
        "information",
        "mined",
        "information",
        "merchant",
        "used",
        "construct",
        "personal",
        "profile",
        "u",
        "profile",
        "turn",
        "based",
        "information",
        "accurate",
        "used",
        "make",
        "decision",
        "u",
        "fair",
        "example",
        "imagine",
        "case",
        "student",
        "happens",
        "writing",
        "paper",
        "internet",
        "pornography",
        "us",
        "search",
        "engine",
        "acquire",
        "reference",
        "research",
        "record",
        "user",
        "search",
        "request",
        "could",
        "reveal",
        "several",
        "query",
        "individual",
        "made",
        "pornographic",
        "web",
        "site",
        "turn",
        "might",
        "suggest",
        "user",
        "interested",
        "viewing",
        "pornography",
        "individual",
        "search",
        "made",
        "particular",
        "user",
        "could",
        "theoretically",
        "analyzed",
        "way",
        "construct",
        "profile",
        "user",
        "inaccurate",
        "record",
        "search",
        "made",
        "user",
        "could",
        "later",
        "subpoenaed",
        "court",
        "case",
        "tavani",
        "already",
        "noted",
        "information",
        "user",
        "search",
        "query",
        "collected",
        "search",
        "engine",
        "company",
        "well",
        "many",
        "different",
        "kind",
        "information",
        "merchant",
        "commercial",
        "sphere",
        "halpern",
        "note",
        "approximately",
        "company",
        "able",
        "track",
        "online",
        "movement",
        "thereby",
        "mining",
        "raw",
        "material",
        "web",
        "selling",
        "todata",
        "mining",
        "companies",
        "pariser",
        "point",
        "tracking",
        "activity",
        "google",
        "us",
        "fiftyseven",
        "signals",
        "everything",
        "logged",
        "browser",
        "using",
        "searched",
        "make",
        "query",
        "kind",
        "site",
        "like",
        "zimmer",
        "note",
        "google",
        "integrates",
        "information",
        "gathered",
        "web",
        "cooky",
        "detailed",
        "server",
        "log",
        "user",
        "accounts",
        "google",
        "application",
        "gmail",
        "google",
        "google",
        "chrome",
        "provides",
        "powerful",
        "infrastructure",
        "dataveillance",
        "monitor",
        "record",
        "aggregate",
        "user",
        "online",
        "activity",
        "furthermore",
        "pariser",
        "note",
        "google",
        "major",
        "search",
        "engine",
        "company",
        "use",
        "prediction",
        "engine",
        "construct",
        "refine",
        "theory",
        "want",
        "next",
        "also",
        "note",
        "many",
        "information",
        "merchant",
        "regard",
        "every",
        "click",
        "signal",
        "user",
        "creates",
        "commodity",
        "auctioned",
        "within",
        "microsecond",
        "highest",
        "bidding",
        "consumer",
        "pariser",
        "point",
        "one",
        "information",
        "merchant",
        "company",
        "called",
        "acxiom",
        "accumulated",
        "average",
        "piece",
        "data",
        "every",
        "person",
        "databasepersonal",
        "data",
        "range",
        "credit",
        "score",
        "medication",
        "used",
        "course",
        "user",
        "might",
        "respond",
        "feel",
        "threatened",
        "practice",
        "example",
        "might",
        "inclined",
        "feel",
        "safe",
        "loss",
        "personal",
        "privacy",
        "assume",
        "data",
        "collected",
        "anonymous",
        "sense",
        "identifiable",
        "ip",
        "address",
        "opposed",
        "person",
        "name",
        "however",
        "zimmer",
        "note",
        "one",
        "aol",
        "user",
        "able",
        "identified",
        "name",
        "web",
        "search",
        "performed",
        "various",
        "topic",
        "recorded",
        "later",
        "released",
        "aol",
        "turn",
        "aol",
        "research",
        "released",
        "three",
        "month",
        "worth",
        "personal",
        "search",
        "data",
        "involving",
        "user",
        "wall",
        "nissenbaum",
        "point",
        "case",
        "aol",
        "used",
        "process",
        "certain",
        "identity",
        "could",
        "extracted",
        "massive",
        "record",
        "anonymized",
        "searchquery",
        "data",
        "aol",
        "regularly",
        "posted",
        "internet",
        "use",
        "scientific",
        "research",
        "community",
        "zimmer",
        "belief",
        "incident",
        "involving",
        "aol",
        "unique",
        "instead",
        "one",
        "use",
        "data",
        "surveillance",
        "dataveillance",
        "term",
        "coined",
        "roger",
        "clarke",
        "ie",
        "one",
        "applied",
        "context",
        "search",
        "query",
        "also",
        "important",
        "consider",
        "whether",
        "meaningful",
        "distinction",
        "drawn",
        "monitoring",
        "surveillance",
        "context",
        "noting",
        "two",
        "term",
        "often",
        "used",
        "interchangeably",
        "nissenbaum",
        "differentiates",
        "following",
        "way",
        "whereas",
        "surveillance",
        "form",
        "monitoring",
        "political",
        "regime",
        "authority",
        "monitoring",
        "used",
        "broader",
        "social",
        "sociotechnical",
        "context",
        "nissenbaum",
        "scheme",
        "monitoring",
        "surveillance",
        "example",
        "call",
        "sociotechnical",
        "context",
        "usually",
        "put",
        "different",
        "us",
        "example",
        "nissenbaum",
        "point",
        "monitoring",
        "done",
        "system",
        "whose",
        "explicit",
        "purpose",
        "monitor",
        "eg",
        "cctvs",
        "also",
        "note",
        "information",
        "constitute",
        "modality",
        "monitoring",
        "example",
        "point",
        "clarke",
        "notion",
        "dataveillance",
        "includes",
        "monitoring",
        "practice",
        "involve",
        "interaction",
        "transaction",
        "however",
        "generally",
        "regard",
        "kind",
        "practice",
        "carried",
        "information",
        "merchant",
        "consumer",
        "sphere",
        "instance",
        "monitoring",
        "rather",
        "surveillance",
        "nissenbaum",
        "sense",
        "term",
        "next",
        "shift",
        "focus",
        "away",
        "privacy",
        "concern",
        "monitoring",
        "commercial",
        "sector",
        "worry",
        "surveillance",
        "government",
        "actor",
        "respect",
        "information",
        "acquired",
        "result",
        "user",
        "search",
        "query",
        "earlier",
        "section",
        "noted",
        "bush",
        "administration",
        "informed",
        "google",
        "must",
        "turn",
        "list",
        "user",
        "query",
        "entered",
        "search",
        "engine",
        "one",
        "week",
        "period",
        "exact",
        "date",
        "specified",
        "google",
        "bush",
        "administration",
        "decision",
        "seek",
        "information",
        "search",
        "request",
        "ordinary",
        "user",
        "triggered",
        "significant",
        "criticism",
        "many",
        "privacy",
        "advocate",
        "although",
        "bush",
        "administration",
        "claimed",
        "authority",
        "seek",
        "electronic",
        "information",
        "order",
        "fight",
        "war",
        "terror",
        "prevent",
        "another",
        "september",
        "like",
        "attack",
        "critic",
        "worried",
        "government",
        "trying",
        "use",
        "subpoenaed",
        "information",
        "national",
        "defense",
        "antiterrorism",
        "purpose",
        "rather",
        "gain",
        "data",
        "support",
        "stance",
        "child",
        "online",
        "protection",
        "act",
        "challenged",
        "us",
        "district",
        "court",
        "revisited",
        "congress",
        "nissenbaum",
        "critic",
        "also",
        "worried",
        "implication",
        "privacy",
        "important",
        "human",
        "value",
        "ongoing",
        "tension",
        "involving",
        "security",
        "vs",
        "privacy",
        "interest",
        "even",
        "privacy",
        "absolute",
        "value",
        "sometimes",
        "outweighed",
        "security",
        "concern",
        "himma",
        "argues",
        "critic",
        "question",
        "rationale",
        "used",
        "obtaining",
        "record",
        "search",
        "request",
        "made",
        "ordinary",
        "citizen",
        "hinman",
        "note",
        "patriot",
        "act",
        "passed",
        "aftermath",
        "allowed",
        "us",
        "government",
        "official",
        "get",
        "information",
        "library",
        "book",
        "member",
        "borrowed",
        "show",
        "reasoning",
        "used",
        "case",
        "library",
        "could",
        "easily",
        "extended",
        "search",
        "enginesfor",
        "example",
        "government",
        "could",
        "see",
        "book",
        "someone",
        "taking",
        "library",
        "also",
        "see",
        "search",
        "made",
        "search",
        "engine",
        "hinman",
        "also",
        "point",
        "several",
        "way",
        "user",
        "search",
        "request",
        "disclosed",
        "practice",
        "used",
        "major",
        "search",
        "engine",
        "company",
        "google",
        "also",
        "worry",
        "practice",
        "could",
        "eventually",
        "lead",
        "surveillance",
        "suppressing",
        "political",
        "dissent",
        "china",
        "hinman",
        "question",
        "whether",
        "google",
        "might",
        "political",
        "pressure",
        "outside",
        "interest",
        "eg",
        "bush",
        "administration",
        "take",
        "photograph",
        "tortured",
        "prisoner",
        "controversial",
        "abu",
        "ghraib",
        "detention",
        "center",
        "used",
        "us",
        "iraq",
        "war",
        "posted",
        "soon",
        "removed",
        "apparent",
        "explanation",
        "search",
        "engine",
        "company",
        "related",
        "well",
        "additional",
        "question",
        "concerning",
        "moralresponsibilityrelated",
        "issue",
        "search",
        "engine",
        "company",
        "examined",
        "detail",
        "section"
    ]
}