{
    "main_text": "Basic Teachings of Buddhist Ethics\n1. Basic Teachings of Buddhist Ethics\n\nThe main goal of Buddhist practice is to reach freedom from suffering\nby coming to see the world as it actually is and abandoning the\ndistorted projections that our thoughts and emotions create. A very\nimportant means to reach this goal is to refrain from destructive\nactions, since these actions cause harm to others and create mental\ndisturbances in us that generate suffering and keep us from seeing\nthings as they are. Moreover, according to Buddhist teachings, those\nwho reach the goal of freedom thenceforward act in a loving and\ncompassionate manner towards others, helping these others in turn to\nbe more happy and free. Ethical action is thus both an important part\nof the Buddhist path and an important aspect of the results said to\nflow from that path.\n\nThere is no word in Buddhist languages such as Sanskrit, Pāli and\nTibetan that exactly corresponds to the English word\n“ethics.” The term most commonly translated as\n“ethics” is Sanskrit śīla (Pāli\nsīla, Tib. tshul khrims.) But this word\nactually means something more like “moral discipline”;\nsomeone has śīla when, having made a commitment to\nfollow a certain set of moral rules, she is actually disposed to\nfollow those rules.\n\nThere are central concepts of Western ethical theory that have no\nexact equivalent in Buddhist texts. It’s not clear that Buddhist\nthinkers have a concept of moral obligation at all. Moreover, Buddhist\ntexts often make points which we can understand in terms of the\ndistinction between intrinsic and instrumental value – that is,\nthe distinction between what is valuable in itself and what is\nvaluable as a means to bring about something else. But they have no\ntechnical terms that correspond to “intrinsic value” and\n“instrumental value.” And many statements that can be read\nas being about ethics can also be understood in a non-normative way,\nas descriptions of how a spiritually developed being actually\nbehaves.\n\nNevertheless, there are many statements in Buddhist scriptures and\ntreatises that are hard to understand otherwise than as ethical\nclaims. The Sanskrit terms kuśala and\nśubha are used in a strongly evaluative way and often\ntranslated as “good,” though in some contexts there are\nother possible translations (“skillful” for\nkuśala, “beautiful” for\nśubha). Buddhist texts talk about what we should do, and\nhold up models of spectacular altruism for our admiration and\nemulation. And Buddhism attaches considerable importance to systems of\nrules that codify moral discipline.\n\nA consideration that has motivated many Buddhists to vow to follow\nrules of moral discipline is a wish to avoid the karmic consequences\nof actions that harm others. These consequences have traditionally\nbeen understood largely in terms of rebirth in the various realms of\ncyclic existence. In the earliest texts, there are five such realms:\nthe hells, the worlds of hungry ghosts, animals, and humans, and the\nheavenly worlds of the gods (Skt. deva). Later texts add a\nsixth realm, that of the titans (Skt. asura).\n\nThe hells are terrible places of torture and suffering, in which\nbeings who are dominated by anger and hatred are cut to pieces,\nburned, frozen, and tormented by demonic apparitions that are in fact\nprojections of their own distorted minds. Hungry ghosts are depicted\nwith large bellies and tiny mouths; driven by greed, they seek\nendlessly for something to eat or drink, but even when they find a\nmorsel they can swallow, it turns into filth or fire in their mouths.\nAnimals are seen as dominated by stupidity, limited to a fixed set of\npossible behaviors and primarily trying simply to survive. In this\nsystem, the human world is primarily characterized by the instrumental\npursuit of objects of desire. The titans are powerful beings who live\nin relatively pleasant circumstances, but are driven by\ncompetitiveness and obsessively envious of the splendor of the gods.\nThey continually plot to invade the heavens. Unfortunately for the\ntitans, when they actually do battle with the gods, they always lose.\nThe gods of the lower heavens, the heavens of desire, live in palaces\nof astonishing beauty and exquisite sensual pleasure. Blinded by\npride, they disregard the suffering of those below them and ignore the\nfact that their high status is impermanent: they, too, will die. At\nthe top of cyclic existence, in the heavens of form and the formless\nheavens, other gods rest in a state of peaceful, quiet bliss, with\nalmost no manifest suffering and for vast, but finite, periods of\ntime.\n\nActions motivated by greed, hatred and delusion have a tendency to\ndrive those who do them into the three lower realms of suffering: the\nhells, the hungry ghost realm, and the animal realm. Actions carried\nout with better motivations, but still infused with a sense of self,\ntend to produce rebirth in the three higher realms of titans, humans,\nand gods. Vast numbers of sentient beings are trapped in this cycle,\ncontinually wandering from one realm to another, unable to escape and\nforced to experience the forms of suffering that exist in each realm.\nThe human realm is particularly fortunate, because it is only in this\nrealm that one can attain Awakening, which liberates one from the\nwhole cycle.\n\nSome modern teachers have interpreted the doctrine of the six realms\nas a psychological process unfolding in this one life: the realms are\nunderstood as the different ways we understand the world when under\nthe influence of the reactive emotions of anger, greed, stupidity,\ndesire, competitiveness, and pride. (See, e.g., McLeod 2002,\n146–51.) But historically, most Buddhists have taken this system\nliterally, as a cosmological account of how the world works and what\nhappens when we die. Therefore, to avoid the actions most likely to\ndrive them into the lower realms, many Buddhists have undertaken to\nobey rules of moral discipline.\n\nThe two most important systems of moral discipline in Buddhism are the\nFive Precepts, which apply to lay people, and the Vows of Individual\nLiberation (Skt. prātimokṣa) which apply to monks\nand nuns. Accepting these commitments is a crucial part of what\ndefines someone as a Buddhist lay person or as a Buddhist monastic.\nThe Five Precepts are quite similar to basic lists of prohibitions in\nother great world religions: those who take them make a commitment to\nrefrain from killing, stealing, sexual misconduct, lying, and\ndrunkenness. The Vows of Individual Liberation are stricter, ruling\nout all forms of sexual activity and laying down detailed regulations\nfor monastic etiquette and deportment.\n\nFollowing the Five Precepts is said to lead to rebirth as a human and\nprevent rebirth in one of the lower realms of suffering. This form of\nmoral discipline helps people develop self-respect, so that they are\nconfident in appearing in any gathering. It prevents many forms of\ntrouble and suffering that harmful actions produce for both the agent\nand others. Meanwhile, the Vows of Individual Liberation help the\nmonastic community function in a way that serves the spiritual\ndevelopment of the monks and nuns. They also create a foundation for\nmeditation practice that leads toward freedom.\n\nOther notable aspects of Buddhist moral discipline are captured in a\nlist known as the Ten Good Courses of Action (Pāli\ndasa-kusala-kamma-patha). In the Tibetan tradition, these are\nreferred to simply as the Ten Virtues (dge ba bcu). They are\nnegatively phrased: each of the Ten Good Courses of Action just\nconsists in refraining from the corresponding element of the Ten Bad\nCourses of Action (mi dge ba bcu). The Ten Bad Courses of\nAction are:\n\nTaking life\nStealing\nSexual misconduct\nLying\nDivisive speech\nHarsh speech\nIdle chitchat\nCovetousness\nMalice\nWrong view\n\n\n(See Keown, 1992, 30 for this list, with somewhat different\ntranslations.) Note that the behaviors forbidden by four of the five\nprecepts are included in this list, with the exception of drunkenness.\nThe reason for omitting drunkenness may be that getting drunk does not\nnecessarily harm others, though it may put one in a state in which the\nrisk of harming others is much greater.\n\nThe Ten Bad Courses of Action are traditionally classified into three\nactions of the body (1–3), four forms of speech (4–7), and\nthree mental states (8–10). Among the actions of speech,\ndivisive speech means speaking in a way as to aggravate conflict and\ndivide friends from each other. Harsh speech is speech motivated by\nanger that wounds another emotionally through insulting and severely\ncritical words. Idle chitchat is speech which fills time and absorbs\nattention without communicating anything of practical or spiritual\nimportance.\n\nThe three mental states on the list are closely related to the three\npoisons, which are among the most fundamental psychological causes of\nthe cycle of existence and the suffering that comes with it. The three\npoisons are attraction, aversion and indifference. When we encounter\nan experience that appears to strengthen and confirm our sense of\nself, we are attracted to that experience and attempt to prolong or\nrepeat it. When an experience appears to threaten our sense of self,\nwe react with aversion, trying to avoid it or push it away. Any\nexperience that doesn’t fall into these two categories seems\nunimportant; since we are indifferent to it, we ignore that\nexperience. Thus, in Buddhist teachings, indifference is very closely\nassociated with ignorance, confusion, and incorrect understandings of\nthe way things are. Completely overcoming these three poisons leads to\nliberation from cyclic existence, compassion, joy, freedom, and\nhappiness.\n",
    "section_title": "1. Basic Teachings of Buddhist Ethics",
    "entry_title": "Ethics in Indian and Tibetan Buddhism",
    "hierarchy_title": "Ethics in Indian and Tibetan Buddhism || Basic Teachings of Buddhist Ethics",
    "tokenized_text": [
        "basic",
        "teaching",
        "buddhist",
        "ethic",
        "basic",
        "teaching",
        "buddhist",
        "ethic",
        "main",
        "goal",
        "buddhist",
        "practice",
        "reach",
        "freedom",
        "suffering",
        "coming",
        "see",
        "world",
        "actually",
        "abandoning",
        "distorted",
        "projection",
        "thought",
        "emotion",
        "create",
        "important",
        "mean",
        "reach",
        "goal",
        "refrain",
        "destructive",
        "action",
        "since",
        "action",
        "cause",
        "harm",
        "others",
        "create",
        "mental",
        "disturbance",
        "u",
        "generate",
        "suffering",
        "keep",
        "u",
        "seeing",
        "thing",
        "moreover",
        "according",
        "buddhist",
        "teaching",
        "reach",
        "goal",
        "freedom",
        "thenceforward",
        "act",
        "loving",
        "compassionate",
        "manner",
        "towards",
        "others",
        "helping",
        "others",
        "turn",
        "happy",
        "free",
        "ethical",
        "action",
        "thus",
        "important",
        "part",
        "buddhist",
        "path",
        "important",
        "aspect",
        "result",
        "said",
        "flow",
        "path",
        "word",
        "buddhist",
        "language",
        "sanskrit",
        "pāli",
        "tibetan",
        "exactly",
        "corresponds",
        "english",
        "word",
        "ethics",
        "term",
        "commonly",
        "translated",
        "ethic",
        "sanskrit",
        "śīla",
        "pāli",
        "sīla",
        "tib",
        "tshul",
        "khrims",
        "word",
        "actually",
        "mean",
        "something",
        "like",
        "moral",
        "discipline",
        "someone",
        "śīla",
        "made",
        "commitment",
        "follow",
        "certain",
        "set",
        "moral",
        "rule",
        "actually",
        "disposed",
        "follow",
        "rule",
        "central",
        "concept",
        "western",
        "ethical",
        "theory",
        "exact",
        "equivalent",
        "buddhist",
        "text",
        "clear",
        "buddhist",
        "thinker",
        "concept",
        "moral",
        "obligation",
        "moreover",
        "buddhist",
        "text",
        "often",
        "make",
        "point",
        "understand",
        "term",
        "distinction",
        "intrinsic",
        "instrumental",
        "value",
        "distinction",
        "valuable",
        "valuable",
        "mean",
        "bring",
        "something",
        "else",
        "technical",
        "term",
        "correspond",
        "intrinsic",
        "value",
        "instrumental",
        "value",
        "many",
        "statement",
        "read",
        "ethic",
        "also",
        "understood",
        "nonnormative",
        "way",
        "description",
        "spiritually",
        "developed",
        "actually",
        "behaves",
        "nevertheless",
        "many",
        "statement",
        "buddhist",
        "scripture",
        "treatise",
        "hard",
        "understand",
        "otherwise",
        "ethical",
        "claim",
        "sanskrit",
        "term",
        "kuśala",
        "śubha",
        "used",
        "strongly",
        "evaluative",
        "way",
        "often",
        "translated",
        "good",
        "though",
        "context",
        "possible",
        "translation",
        "skillful",
        "kuśala",
        "beautiful",
        "śubha",
        "buddhist",
        "text",
        "talk",
        "hold",
        "model",
        "spectacular",
        "altruism",
        "admiration",
        "emulation",
        "buddhism",
        "attache",
        "considerable",
        "importance",
        "system",
        "rule",
        "codify",
        "moral",
        "discipline",
        "consideration",
        "motivated",
        "many",
        "buddhist",
        "vow",
        "follow",
        "rule",
        "moral",
        "discipline",
        "wish",
        "avoid",
        "karmic",
        "consequence",
        "action",
        "harm",
        "others",
        "consequence",
        "traditionally",
        "understood",
        "largely",
        "term",
        "rebirth",
        "various",
        "realm",
        "cyclic",
        "existence",
        "earliest",
        "text",
        "five",
        "realm",
        "hell",
        "world",
        "hungry",
        "ghost",
        "animal",
        "human",
        "heavenly",
        "world",
        "god",
        "skt",
        "deva",
        "later",
        "text",
        "add",
        "sixth",
        "realm",
        "titan",
        "skt",
        "asura",
        "hell",
        "terrible",
        "place",
        "torture",
        "suffering",
        "being",
        "dominated",
        "anger",
        "hatred",
        "cut",
        "piece",
        "burned",
        "frozen",
        "tormented",
        "demonic",
        "apparition",
        "fact",
        "projection",
        "distorted",
        "mind",
        "hungry",
        "ghost",
        "depicted",
        "large",
        "belly",
        "tiny",
        "mouth",
        "driven",
        "greed",
        "seek",
        "endlessly",
        "something",
        "eat",
        "drink",
        "even",
        "find",
        "morsel",
        "swallow",
        "turn",
        "filth",
        "fire",
        "mouth",
        "animal",
        "seen",
        "dominated",
        "stupidity",
        "limited",
        "fixed",
        "set",
        "possible",
        "behavior",
        "primarily",
        "trying",
        "simply",
        "survive",
        "system",
        "human",
        "world",
        "primarily",
        "characterized",
        "instrumental",
        "pursuit",
        "object",
        "desire",
        "titan",
        "powerful",
        "being",
        "live",
        "relatively",
        "pleasant",
        "circumstance",
        "driven",
        "competitiveness",
        "obsessively",
        "envious",
        "splendor",
        "god",
        "continually",
        "plot",
        "invade",
        "heaven",
        "unfortunately",
        "titan",
        "actually",
        "battle",
        "god",
        "always",
        "lose",
        "god",
        "lower",
        "heaven",
        "heaven",
        "desire",
        "live",
        "palace",
        "astonishing",
        "beauty",
        "exquisite",
        "sensual",
        "pleasure",
        "blinded",
        "pride",
        "disregard",
        "suffering",
        "ignore",
        "fact",
        "high",
        "status",
        "impermanent",
        "die",
        "top",
        "cyclic",
        "existence",
        "heaven",
        "form",
        "formless",
        "heaven",
        "god",
        "rest",
        "state",
        "peaceful",
        "quiet",
        "bliss",
        "almost",
        "manifest",
        "suffering",
        "vast",
        "finite",
        "period",
        "time",
        "action",
        "motivated",
        "greed",
        "hatred",
        "delusion",
        "tendency",
        "drive",
        "three",
        "lower",
        "realm",
        "suffering",
        "hell",
        "hungry",
        "ghost",
        "realm",
        "animal",
        "realm",
        "action",
        "carried",
        "better",
        "motivation",
        "still",
        "infused",
        "sense",
        "self",
        "tend",
        "produce",
        "rebirth",
        "three",
        "higher",
        "realm",
        "titan",
        "human",
        "god",
        "vast",
        "number",
        "sentient",
        "being",
        "trapped",
        "cycle",
        "continually",
        "wandering",
        "one",
        "realm",
        "another",
        "unable",
        "escape",
        "forced",
        "experience",
        "form",
        "suffering",
        "exist",
        "realm",
        "human",
        "realm",
        "particularly",
        "fortunate",
        "realm",
        "one",
        "attain",
        "awakening",
        "liberates",
        "one",
        "whole",
        "cycle",
        "modern",
        "teacher",
        "interpreted",
        "doctrine",
        "six",
        "realm",
        "psychological",
        "process",
        "unfolding",
        "one",
        "life",
        "realm",
        "understood",
        "different",
        "way",
        "understand",
        "world",
        "influence",
        "reactive",
        "emotion",
        "anger",
        "greed",
        "stupidity",
        "desire",
        "competitiveness",
        "pride",
        "see",
        "eg",
        "mcleod",
        "historically",
        "buddhist",
        "taken",
        "system",
        "literally",
        "cosmological",
        "account",
        "world",
        "work",
        "happens",
        "die",
        "therefore",
        "avoid",
        "action",
        "likely",
        "drive",
        "lower",
        "realm",
        "many",
        "buddhist",
        "undertaken",
        "obey",
        "rule",
        "moral",
        "discipline",
        "two",
        "important",
        "system",
        "moral",
        "discipline",
        "buddhism",
        "five",
        "precept",
        "apply",
        "lay",
        "people",
        "vow",
        "individual",
        "liberation",
        "skt",
        "prātimokṣa",
        "apply",
        "monk",
        "nun",
        "accepting",
        "commitment",
        "crucial",
        "part",
        "defines",
        "someone",
        "buddhist",
        "lay",
        "person",
        "buddhist",
        "monastic",
        "five",
        "precept",
        "quite",
        "similar",
        "basic",
        "list",
        "prohibition",
        "great",
        "world",
        "religion",
        "take",
        "make",
        "commitment",
        "refrain",
        "killing",
        "stealing",
        "sexual",
        "misconduct",
        "lying",
        "drunkenness",
        "vow",
        "individual",
        "liberation",
        "stricter",
        "ruling",
        "form",
        "sexual",
        "activity",
        "laying",
        "detailed",
        "regulation",
        "monastic",
        "etiquette",
        "deportment",
        "following",
        "five",
        "precept",
        "said",
        "lead",
        "rebirth",
        "human",
        "prevent",
        "rebirth",
        "one",
        "lower",
        "realm",
        "suffering",
        "form",
        "moral",
        "discipline",
        "help",
        "people",
        "develop",
        "selfrespect",
        "confident",
        "appearing",
        "gathering",
        "prevents",
        "many",
        "form",
        "trouble",
        "suffering",
        "harmful",
        "action",
        "produce",
        "agent",
        "others",
        "meanwhile",
        "vow",
        "individual",
        "liberation",
        "help",
        "monastic",
        "community",
        "function",
        "way",
        "serf",
        "spiritual",
        "development",
        "monk",
        "nun",
        "also",
        "create",
        "foundation",
        "meditation",
        "practice",
        "lead",
        "toward",
        "freedom",
        "notable",
        "aspect",
        "buddhist",
        "moral",
        "discipline",
        "captured",
        "list",
        "known",
        "ten",
        "good",
        "course",
        "action",
        "pāli",
        "dasakusalakammapatha",
        "tibetan",
        "tradition",
        "referred",
        "simply",
        "ten",
        "virtue",
        "dge",
        "ba",
        "bcu",
        "negatively",
        "phrased",
        "ten",
        "good",
        "course",
        "action",
        "consists",
        "refraining",
        "corresponding",
        "element",
        "ten",
        "bad",
        "course",
        "action",
        "mi",
        "dge",
        "ba",
        "bcu",
        "ten",
        "bad",
        "course",
        "action",
        "taking",
        "life",
        "stealing",
        "sexual",
        "misconduct",
        "lying",
        "divisive",
        "speech",
        "harsh",
        "speech",
        "idle",
        "chitchat",
        "covetousness",
        "malice",
        "wrong",
        "view",
        "see",
        "keown",
        "list",
        "somewhat",
        "different",
        "translation",
        "note",
        "behavior",
        "forbidden",
        "four",
        "five",
        "precept",
        "included",
        "list",
        "exception",
        "drunkenness",
        "reason",
        "omitting",
        "drunkenness",
        "may",
        "getting",
        "drunk",
        "necessarily",
        "harm",
        "others",
        "though",
        "may",
        "put",
        "one",
        "state",
        "risk",
        "harming",
        "others",
        "much",
        "greater",
        "ten",
        "bad",
        "course",
        "action",
        "traditionally",
        "classified",
        "three",
        "action",
        "body",
        "four",
        "form",
        "speech",
        "three",
        "mental",
        "state",
        "among",
        "action",
        "speech",
        "divisive",
        "speech",
        "mean",
        "speaking",
        "way",
        "aggravate",
        "conflict",
        "divide",
        "friend",
        "harsh",
        "speech",
        "speech",
        "motivated",
        "anger",
        "wound",
        "another",
        "emotionally",
        "insulting",
        "severely",
        "critical",
        "word",
        "idle",
        "chitchat",
        "speech",
        "fill",
        "time",
        "absorbs",
        "attention",
        "without",
        "communicating",
        "anything",
        "practical",
        "spiritual",
        "importance",
        "three",
        "mental",
        "state",
        "list",
        "closely",
        "related",
        "three",
        "poison",
        "among",
        "fundamental",
        "psychological",
        "cause",
        "cycle",
        "existence",
        "suffering",
        "come",
        "three",
        "poison",
        "attraction",
        "aversion",
        "indifference",
        "encounter",
        "experience",
        "appears",
        "strengthen",
        "confirm",
        "sense",
        "self",
        "attracted",
        "experience",
        "attempt",
        "prolong",
        "repeat",
        "experience",
        "appears",
        "threaten",
        "sense",
        "self",
        "react",
        "aversion",
        "trying",
        "avoid",
        "push",
        "away",
        "experience",
        "fall",
        "two",
        "category",
        "seems",
        "unimportant",
        "since",
        "indifferent",
        "ignore",
        "experience",
        "thus",
        "buddhist",
        "teaching",
        "indifference",
        "closely",
        "associated",
        "ignorance",
        "confusion",
        "incorrect",
        "understanding",
        "way",
        "thing",
        "completely",
        "overcoming",
        "three",
        "poison",
        "lead",
        "liberation",
        "cyclic",
        "existence",
        "compassion",
        "joy",
        "freedom",
        "happiness"
    ]
}