{
    "main_text": "Ethical Implications and Core Ethical Issues || Democracy, Censorship, and the Threat to Liberty and Freedom\n3.4 Democracy, Censorship, and the Threat to Liberty and Freedom\n\n\nIn this section, we consider some implications that the surveillance\nof users’ queries by search-engine companies can have for a free\nand open society. In the early days of the Internet, many people\nassumed that search engine technology favored democracy and democratic\nideals. For example, Introna and Nissenbaum (2000, 169) note that\nsearch engines were viewed as a technology that would\n\n…give voice to diverse social, economic, and cultural\ngroups, to members of society not frequently heard in the public sphere\n[and] empower the traditionally disempowered, giving them access both\nto typically unreachable modes of power and to previously unavailable\ntroves of information.\n\n\n\nHowever, Introna and Nissenbaum also describe what can be viewed as an\n“anti-democratic” aspect of contemporary search technology\nwhen they note that search engines “systematically\nexclude” certain Web sites, as well as “certain types of\nsites, ” over others. And Diaz (2008, 11) echoes this concern\nwhen he notes that that major search engine companies such as Google\ndirect “hundreds of millions of users towards some content and\nnot others, towards some sources and not others.” So, following\nDiaz (p. 15), we can ask whether the kinds of “independent\nvoices and diverse viewpoints” that are essential for a\ndemocracy are capable of being “heard through the filter of\nsearch engines.”\n\n\nSearch engines have often been described as the “gatekeepers\nof cyberspace,” and some critics note that this has significant\nimplications for democracy. For example, Diaz (2008, 11) points out that\n\n if\nwe believe in the principles of deliberative democracy—and\nespecially if we believe that that the Web is an open\n‘democratic’ medium—then we should expect our\nsearch engines to disseminate a broad spectrum of information on any\ngiven topic.\n\n Hinman (2005, 25) makes a similar point, when he\nnotes that “the flourishing of deliberative democracy is\ndependent on the free and undistorted access to information.” And\nbecause search engines are “increasingly the principal\ngatekeepers of knowledge,” Hinman argues that “we find\nourselves moving in a philosophically dangerous position.” (We\nbriefly return to Hinman’s point in the\n concluding section of this entry.)\n\n\nMorozov (2011) also describes some concerns for democracy\nvis-à-vis contemporary search engines by calling attention to\nthe filtering of information that search engines make possible. For one\nthing, he agrees with Sunstein (2001) who worries that the kind of\nselectivity made possible by Internet filtering can easily trap us\ninside our “information cocoons.” And Lessig (2000)\nsuggests that any kind of filtering on the Internet is equivalent to\ncensorship because it blocks out some forms of expression. Morozov\npoints out that whereas Sunstein worries that people could use\nInternet technology to “overly customize what they read,”\nthe reality is that contemporary search engine companies have already\nsilently done this for them. Morozov’s concerns about what search\nengine companies are now doing through filtering and customization\nschemes, and why this is problematic for a democracy, are echoed by\nPariser (2011, 13) who points out that “personalization\nfilters serve up a kind of invisible autopropaganda,\nindoctrinating us with our own ideas, amplifying our desire for things\nthat are familiar and leaving us oblivious to the dangers lurking in\nthe dark territory of the unknown”.\n\n\nPariser notes that while democracy “requires citizens to see\nthings from one another’s point of view,” we are instead\nincreasingly “more enclosed in our own bubbles.” He goes\non to note that democracy also “requires a reliance on shared\nfacts,” but instead we are being presented with “parallel\nbut separate universes.” To illustrate how this trend away from\ncitizens having shared facts can be so dangerous for a democracy,\nPariser uses the example of the debate about climate change in the U.S\nduring the past decade. He points out that studies have shown that\nbetween 2001 and 2010 many people’s beliefs about whether the climate\nwas warming shifted significantly, based on one’s affiliation with a\nmajor political party. Pariser notes that a Web search for\n“climate change” will yield very different results for a\nperson whom the search algorithm determines to be a Democrat than for\nsomeone it determines to be a Republican. He also notes that the\nsearch algorithm will generate different results for someone it\ndetermines to be an oil company executive vs. an environmental\nactivist.\n\n\nAlong lines similar to Pariser’s, Halpern (2011, 5–6) notes that\nsearch engines like Google direct us to material that is most likely\nto reinforce our own “worldview, ideology, and\nassumptions” and thus “cut us off from dissenting opinion\nand conflicting points of view.” Pariser points out that with\nGoogle, a user now gets the results that the search engine company\nbelieves are best for that particular user.  He describes a case where\ntwo people entered in the keyword “BP” (for British\nPetroleum) during the time period of the accident involving the Deep\nWater Horizon oil rig in the Gulf of Mexico. In response to one user’s\nquery, investment information about BP was returned as the lead\nresult, while the other user received information about the oil\nspill.\n\n\nNot only do some practices by search engine companies pose a threat\nfor democracy and democratic ideals, other practices (in which search\nengine companies are arguably complicit) reinforce censorship schemes\ncurrently used by non-democratic nations. For example, it is well know\nthat China has succeeded in blocking access to political sites that it\nregards as threatening. Consider that it blocks ordinary Chinese users\nfrom access to sites such as “Tiananmen Square,”\n“Free Tibet,” and “Dalai Lama.” Critics note\nthat Google agreed to comply with China’s censorship laws when\nthe search engine company entered the Chinese market in 2006. Spinello\n(2012) believes that this agreement violated Google’s\n“don’t be evil” principle—a core principle of\nthe search engine company—because Google “facilitated and\nsupported” China’s censorship regime. But some of\nGoogle’s defenders have argued that the search engine\ncompany’s entry into China made it possible for China’s\nresidents to have greater access to information, overall (i.e., beyond\nwhat would otherwise be accessible through Baidu (www.Baidu.com), a\nChinese-owned search engine service founded in 2000). Other defenders\nof Google point out that the search engine giant did not act alone\nbecause major U.S. companies, such as Yahoo and MSN, also complied\nwith China’s censorship laws. And Hinman notes that the Chinese\ngovernment also received cooperation from other American companies,\nsuch as Cisco Systems, in establishing the infrastructure or backbone\ncomponents of its Internet firewall.\n\n\nIn 2010, Google changed its policy for operating in China and directed\nits Google.cn users to a site in Hong Kong that was then uncensored.\nHowever, Hinman believes that we should still worry about\nGoogle’s willingness to comply with the Chinese\ngovernment’s strict censorship laws when initially setting up\nits business operations in China. He reasons that if this search\nengine giant could be so easily influenced by a government that has a\nrelatively low economic impact on its business overall, it could be\nmuch more influenced by the U.S. Government, where the political and\neconomic impact would be far more significant. Some worry that this\nfactor has also given Google considerable power over companies that\nrely on it for their Internet traffic (Spinello 2012). They also worry\nthat Google, in an effort to retain that economic power in the U.S. in\nthe future, could conceivably cave into pressure to comply with\ngovernment policies (in the U.S. and possibly other democratic nations\nas well) that might support censorship at some level.\n\n\nWhile many initially believed that that the Internet would promote\ndemocracy by weeding out totalitarian societies, because they are\n“inefficient and wasteful” (Chorost 2011), Berners-Lee\n(2010) believes that the Web “we have come to know” is now\nthreatened because both totalitarian and democratic governments alike\nare “monitoring people’s online habits, endangering important\nhuman rights.” Perhaps Hinman (2005, 25) best sums up this\nworry, when he remarks,\n\n\nWe risk having  our access to information controlled by ever-powerful,\nincreasingly opaque, and almost completely unregulated search engines\nthat could shape and distort our future largely without our knowledge.\nFor the sake of a free society, we must pursue the development of\nstructures of accountability for search engines.\n\n\nIf Berners-Lee, Hinman, and others are correct, it would seem that we\nhave much to worry about indeed as we go forward trying to preserve\nour basic freedoms in a democracy, while at the same time taking\nadvantage of many of the personalizing- and customizing-based features\nthat search engines such as Google now offer us. It would also seem\nthat increased transparency on the part of search engine companies\ncould would be an important step in helping us to alleviate some of\nthese concerns. But who, exactly, should be responsible for regulating\nsearch engine companies and for holding them accountable? We examine\nthese and related questions in Section 4. First, however, we briefly\nconsider some ethical issues, particularly cyber-security related\nconcerns, that arise because of a relatively new kind of search engine\nthat is capable of “discovering” the location of “things” (objects)\nvia the Internet.\n",
    "section_title": "3.4 Democracy, Censorship, and the Threat to Liberty and Freedom",
    "entry_title": "Search Engines and Ethics",
    "hierarchy_title": "Search Engines and Ethics || Ethical Implications and Core Ethical Issues || Democracy, Censorship, and the Threat to Liberty and Freedom",
    "tokenized_text": [
        "ethical",
        "implication",
        "core",
        "ethical",
        "issue",
        "democracy",
        "censorship",
        "threat",
        "liberty",
        "freedom",
        "democracy",
        "censorship",
        "threat",
        "liberty",
        "freedom",
        "section",
        "consider",
        "implication",
        "surveillance",
        "user",
        "query",
        "searchengine",
        "company",
        "free",
        "open",
        "society",
        "early",
        "day",
        "internet",
        "many",
        "people",
        "assumed",
        "search",
        "engine",
        "technology",
        "favored",
        "democracy",
        "democratic",
        "ideal",
        "example",
        "introna",
        "nissenbaum",
        "note",
        "search",
        "engine",
        "viewed",
        "technology",
        "would",
        "give",
        "voice",
        "diverse",
        "social",
        "economic",
        "cultural",
        "group",
        "member",
        "society",
        "frequently",
        "heard",
        "public",
        "sphere",
        "empower",
        "traditionally",
        "disempowered",
        "giving",
        "access",
        "typically",
        "unreachable",
        "mode",
        "power",
        "previously",
        "unavailable",
        "trove",
        "information",
        "however",
        "introna",
        "nissenbaum",
        "also",
        "describe",
        "viewed",
        "antidemocratic",
        "aspect",
        "contemporary",
        "search",
        "technology",
        "note",
        "search",
        "engine",
        "systematically",
        "exclude",
        "certain",
        "web",
        "site",
        "well",
        "certain",
        "type",
        "site",
        "others",
        "diaz",
        "echo",
        "concern",
        "note",
        "major",
        "search",
        "engine",
        "company",
        "google",
        "direct",
        "hundred",
        "million",
        "user",
        "towards",
        "content",
        "others",
        "towards",
        "source",
        "others",
        "following",
        "diaz",
        "p",
        "ask",
        "whether",
        "kind",
        "independent",
        "voice",
        "diverse",
        "viewpoint",
        "essential",
        "democracy",
        "capable",
        "heard",
        "filter",
        "search",
        "engines",
        "search",
        "engine",
        "often",
        "described",
        "gatekeeper",
        "cyberspace",
        "critic",
        "note",
        "significant",
        "implication",
        "democracy",
        "example",
        "diaz",
        "point",
        "believe",
        "principle",
        "deliberative",
        "democracyand",
        "especially",
        "believe",
        "web",
        "open",
        "democratic",
        "mediumthen",
        "expect",
        "search",
        "engine",
        "disseminate",
        "broad",
        "spectrum",
        "information",
        "given",
        "topic",
        "hinman",
        "make",
        "similar",
        "point",
        "note",
        "flourishing",
        "deliberative",
        "democracy",
        "dependent",
        "free",
        "undistorted",
        "access",
        "information",
        "search",
        "engine",
        "increasingly",
        "principal",
        "gatekeeper",
        "knowledge",
        "hinman",
        "argues",
        "find",
        "moving",
        "philosophically",
        "dangerous",
        "position",
        "briefly",
        "return",
        "hinman",
        "point",
        "concluding",
        "section",
        "entry",
        "morozov",
        "also",
        "describes",
        "concern",
        "democracy",
        "visàvis",
        "contemporary",
        "search",
        "engine",
        "calling",
        "attention",
        "filtering",
        "information",
        "search",
        "engine",
        "make",
        "possible",
        "one",
        "thing",
        "agrees",
        "sunstein",
        "worry",
        "kind",
        "selectivity",
        "made",
        "possible",
        "internet",
        "filtering",
        "easily",
        "trap",
        "u",
        "inside",
        "information",
        "cocoons",
        "lessig",
        "suggests",
        "kind",
        "filtering",
        "internet",
        "equivalent",
        "censorship",
        "block",
        "form",
        "expression",
        "morozov",
        "point",
        "whereas",
        "sunstein",
        "worry",
        "people",
        "could",
        "use",
        "internet",
        "technology",
        "overly",
        "customize",
        "read",
        "reality",
        "contemporary",
        "search",
        "engine",
        "company",
        "already",
        "silently",
        "done",
        "morozov",
        "concern",
        "search",
        "engine",
        "company",
        "filtering",
        "customization",
        "scheme",
        "problematic",
        "democracy",
        "echoed",
        "pariser",
        "point",
        "personalization",
        "filter",
        "serve",
        "kind",
        "invisible",
        "autopropaganda",
        "indoctrinating",
        "u",
        "idea",
        "amplifying",
        "desire",
        "thing",
        "familiar",
        "leaving",
        "u",
        "oblivious",
        "danger",
        "lurking",
        "dark",
        "territory",
        "unknown",
        "pariser",
        "note",
        "democracy",
        "requires",
        "citizen",
        "see",
        "thing",
        "one",
        "another",
        "point",
        "view",
        "instead",
        "increasingly",
        "enclosed",
        "bubbles",
        "go",
        "note",
        "democracy",
        "also",
        "requires",
        "reliance",
        "shared",
        "fact",
        "instead",
        "presented",
        "parallel",
        "separate",
        "universes",
        "illustrate",
        "trend",
        "away",
        "citizen",
        "shared",
        "fact",
        "dangerous",
        "democracy",
        "pariser",
        "us",
        "example",
        "debate",
        "climate",
        "change",
        "us",
        "past",
        "decade",
        "point",
        "study",
        "shown",
        "many",
        "people",
        "belief",
        "whether",
        "climate",
        "warming",
        "shifted",
        "significantly",
        "based",
        "one",
        "affiliation",
        "major",
        "political",
        "party",
        "pariser",
        "note",
        "web",
        "search",
        "climate",
        "change",
        "yield",
        "different",
        "result",
        "person",
        "search",
        "algorithm",
        "determines",
        "democrat",
        "someone",
        "determines",
        "republican",
        "also",
        "note",
        "search",
        "algorithm",
        "generate",
        "different",
        "result",
        "someone",
        "determines",
        "oil",
        "company",
        "executive",
        "vs",
        "environmental",
        "activist",
        "along",
        "line",
        "similar",
        "pariser",
        "halpern",
        "note",
        "search",
        "engine",
        "like",
        "google",
        "direct",
        "u",
        "material",
        "likely",
        "reinforce",
        "worldview",
        "ideology",
        "assumption",
        "thus",
        "cut",
        "u",
        "dissenting",
        "opinion",
        "conflicting",
        "point",
        "view",
        "pariser",
        "point",
        "google",
        "user",
        "get",
        "result",
        "search",
        "engine",
        "company",
        "belief",
        "best",
        "particular",
        "user",
        "describes",
        "case",
        "two",
        "people",
        "entered",
        "keyword",
        "bp",
        "british",
        "petroleum",
        "time",
        "period",
        "accident",
        "involving",
        "deep",
        "water",
        "horizon",
        "oil",
        "rig",
        "gulf",
        "mexico",
        "response",
        "one",
        "user",
        "query",
        "investment",
        "information",
        "bp",
        "returned",
        "lead",
        "result",
        "user",
        "received",
        "information",
        "oil",
        "spill",
        "practice",
        "search",
        "engine",
        "company",
        "pose",
        "threat",
        "democracy",
        "democratic",
        "ideal",
        "practice",
        "search",
        "engine",
        "company",
        "arguably",
        "complicit",
        "reinforce",
        "censorship",
        "scheme",
        "currently",
        "used",
        "nondemocratic",
        "nation",
        "example",
        "well",
        "know",
        "china",
        "succeeded",
        "blocking",
        "access",
        "political",
        "site",
        "regard",
        "threatening",
        "consider",
        "block",
        "ordinary",
        "chinese",
        "user",
        "access",
        "site",
        "tiananmen",
        "square",
        "free",
        "tibet",
        "dalai",
        "lama",
        "critic",
        "note",
        "google",
        "agreed",
        "comply",
        "china",
        "censorship",
        "law",
        "search",
        "engine",
        "company",
        "entered",
        "chinese",
        "market",
        "spinello",
        "belief",
        "agreement",
        "violated",
        "google",
        "evil",
        "principlea",
        "core",
        "principle",
        "search",
        "engine",
        "companybecause",
        "google",
        "facilitated",
        "supported",
        "china",
        "censorship",
        "regime",
        "google",
        "defender",
        "argued",
        "search",
        "engine",
        "company",
        "entry",
        "china",
        "made",
        "possible",
        "china",
        "resident",
        "greater",
        "access",
        "information",
        "overall",
        "ie",
        "beyond",
        "would",
        "otherwise",
        "accessible",
        "baidu",
        "wwwbaiducom",
        "chineseowned",
        "search",
        "engine",
        "service",
        "founded",
        "defender",
        "google",
        "point",
        "search",
        "engine",
        "giant",
        "act",
        "alone",
        "major",
        "us",
        "company",
        "yahoo",
        "msn",
        "also",
        "complied",
        "china",
        "censorship",
        "law",
        "hinman",
        "note",
        "chinese",
        "government",
        "also",
        "received",
        "cooperation",
        "american",
        "company",
        "cisco",
        "system",
        "establishing",
        "infrastructure",
        "backbone",
        "component",
        "internet",
        "firewall",
        "google",
        "changed",
        "policy",
        "operating",
        "china",
        "directed",
        "googlecn",
        "user",
        "site",
        "hong",
        "kong",
        "uncensored",
        "however",
        "hinman",
        "belief",
        "still",
        "worry",
        "google",
        "willingness",
        "comply",
        "chinese",
        "government",
        "strict",
        "censorship",
        "law",
        "initially",
        "setting",
        "business",
        "operation",
        "china",
        "reason",
        "search",
        "engine",
        "giant",
        "could",
        "easily",
        "influenced",
        "government",
        "relatively",
        "low",
        "economic",
        "impact",
        "business",
        "overall",
        "could",
        "much",
        "influenced",
        "us",
        "government",
        "political",
        "economic",
        "impact",
        "would",
        "far",
        "significant",
        "worry",
        "factor",
        "also",
        "given",
        "google",
        "considerable",
        "power",
        "company",
        "rely",
        "internet",
        "traffic",
        "spinello",
        "also",
        "worry",
        "google",
        "effort",
        "retain",
        "economic",
        "power",
        "us",
        "future",
        "could",
        "conceivably",
        "cave",
        "pressure",
        "comply",
        "government",
        "policy",
        "us",
        "possibly",
        "democratic",
        "nation",
        "well",
        "might",
        "support",
        "censorship",
        "level",
        "many",
        "initially",
        "believed",
        "internet",
        "would",
        "promote",
        "democracy",
        "weeding",
        "totalitarian",
        "society",
        "inefficient",
        "wasteful",
        "chorost",
        "bernerslee",
        "belief",
        "web",
        "come",
        "know",
        "threatened",
        "totalitarian",
        "democratic",
        "government",
        "alike",
        "monitoring",
        "people",
        "online",
        "habit",
        "endangering",
        "important",
        "human",
        "rights",
        "perhaps",
        "hinman",
        "best",
        "sum",
        "worry",
        "remark",
        "risk",
        "access",
        "information",
        "controlled",
        "everpowerful",
        "increasingly",
        "opaque",
        "almost",
        "completely",
        "unregulated",
        "search",
        "engine",
        "could",
        "shape",
        "distort",
        "future",
        "largely",
        "without",
        "knowledge",
        "sake",
        "free",
        "society",
        "must",
        "pursue",
        "development",
        "structure",
        "accountability",
        "search",
        "engine",
        "bernerslee",
        "hinman",
        "others",
        "correct",
        "would",
        "seem",
        "much",
        "worry",
        "indeed",
        "go",
        "forward",
        "trying",
        "preserve",
        "basic",
        "freedom",
        "democracy",
        "time",
        "taking",
        "advantage",
        "many",
        "personalizing",
        "customizingbased",
        "feature",
        "search",
        "engine",
        "google",
        "offer",
        "u",
        "would",
        "also",
        "seem",
        "increased",
        "transparency",
        "part",
        "search",
        "engine",
        "company",
        "could",
        "would",
        "important",
        "step",
        "helping",
        "u",
        "alleviate",
        "concern",
        "exactly",
        "responsible",
        "regulating",
        "search",
        "engine",
        "company",
        "holding",
        "accountable",
        "examine",
        "related",
        "question",
        "section",
        "first",
        "however",
        "briefly",
        "consider",
        "ethical",
        "issue",
        "particularly",
        "cybersecurity",
        "related",
        "concern",
        "arise",
        "relatively",
        "new",
        "kind",
        "search",
        "engine",
        "capable",
        "discovering",
        "location",
        "thing",
        "object",
        "via",
        "internet"
    ]
}