{
    "main_text": "Stoics\n8. Stoics\n\nThe Stoics are well known for their teaching that the good is to be\nidentified with virtue. Virtues include logic, physics, and ethics\n(Stoicorum Veterum Fragmenta [=SVF]II 35), as well as wisdom,\nmoderation, justice, and courage. To our modern ears, the first three\nsound like academic subjects; but for the Stoics, they were virtues of\nthought. However, orthodox Stoics do not follow the Aristotelian\ndistinction between intellectual and moral virtues because – as\nwe shall see – they hold that all human psychological functions,\nincluding the affective and volitional, are rational in a single,\nunified sense. For them, consequently, all virtues form a unity around\nthe core concept of knowledge. Finally, all that is required for\nhappiness (i.e., the secure possession of the good, of what is needed\nto make one’s life a thoroughly good one) – and the only\nthing – is to lead a virtuous life. In this teaching Stoics are\naddressing the problem of bodily and external goods raised by\nAristotle. Their solution takes the radical course of dismissing such\nalleged goods from the account of happiness because they are not\nnecessary for virtue, and are not, in fact, in any way good at\nall.\n\nThey argue that health, pleasure, beauty, strength, wealth, good\nreputation, and noble birth are neither good nor bad. Since they can\nbe used well or badly and the good is invariably good, these assets\nare not good. The virtues, however, are good (DL VII 102–103),\nsince they are perfections of our rationality, and only rationally\nperfected thoughts and decisions can possibly have the features of\nharmony and order in which goodness itself consists. Since possessing\nand exercising virtue is happiness, happiness does not include such\nthings as health, pleasure, and wealth. Still, the Stoics do not\ndismiss these assets altogether since they still have a kind of value.\nThese things are indifferent to happiness in that they do not add to\none’s virtue nor detract from it, and so they do not add to or\ntake away from one’s possession of the good. One is not more\nvirtuous because healthy nor less virtuous because ill. But being\nhealthy generally conforms with nature’s plans for the lives of\nanimals and plants, so it is preferable to be healthy, and one should\ntry to preserve and maintain one’s health. Health is, then, the\nkind of value they call a preferred indifferent; but it is not in any\nway a good, and it makes no contribution to the quality of one’s\nlife as a good or a bad one, happy or miserable.\n\nIn order to understand the Stoic claims about the relation of virtue\nto happiness, we can begin with virtue. Chrysippus says that virtue is\na craft (technê) having to do with the things of life\n(SVF II 909). In other texts, we learn that the things of\nlife include impulse (hormê). Each animal has an\nimpulse for self-preservation; it has an awareness of its constitution\nand strives to preserve its integrity. There is also a natural impulse\nto care for offspring. Humans, then, are naturally inclined toward\npreserving life, health, and children. But then grown-up humans also\ndo these things under the guidance of reason; reason in the adult\nhuman case is the craftsman of impulse (DL VII 85–6). This\nlatter phrase is significant because it implies that just following\nnatural impulse is not enough. In fact, it is not even possible for an\nadult human, whose nature is such as to do everything they do\nby reason, even to follow the sort of natural impulses that\nanimals and immature humans do in their actions. In order to lead a\nvirtuous life, reason must shape our impulses and guide their\nexpression in action.\n\nImpulse is the key to understanding the relation between virtue and\nhappiness. An impulse is a propositional attitude that, when assented\nto, leads to action, e.g., ‘I should eat this bread now.’\nHowever, impulses do not arise in a separate, non-rational part of the\nsoul. Stoics deny there are any non-rational desires of appetite\ncapable of impelling action. The soul, insofar as it provides\nmotivations and is the cause of our actions, consists of the\ncommanding faculty (hêgemonikon) which is also reason\n(SVF I 202). We can distinguish correct impulses into those\nwhich treat virtue as the only good and those which treat things\nindifferent as indifferent. By contrast, emotions or passions (\npathê) are incorrect impulses that treat what is\nindifferent as good. However, they do not come from a non-rational\npart of the soul but are false judgments about the good, where\njudgment is understood as assent to some impulse. Emotions, such as\ndesire, fear, pleasure, and pain, embody such erroneous judgments\n(SVF III 391, 393, 394). For instance, the desire for health\narises from assenting to the impulse that embodies the false judgment\nthat health is good, instead of a preferred indifferent. The sage\n– someone perfected in virtue – would never assent to such\nfalse propositions and thus would never have emotions in this sense,\nno feelings that carried him beyond reason’s true assessment. He\nwould, however, experience feelings attuned to reason,  eupatheiai\n –literally good emotions or feelings. For instance, he\nwould feel joy over his virtue, but not pleasure – the latter\nbeing an emotion that treats the actual possession of an indifferent\nas a good.\n\nKnowledge, then, about what is good, bad, and indifferent is the heart\nof virtue. Courage, e.g., is simply knowledge of what is to be\nendured: the impulse to endure or not, and the only impulse\nthat is needed by courage, then follows automatically, as a product or\naspect of that knowledge. This tight unity in the soul is the basis\nfor the Stoic teaching about the unity of the virtues. Zeno (the\nfounder of the school) defines wisdom (phronêsis), or\nrather practical knowledge, in matters requiring distribution\nas justice, in matters requiring choice as moderation, and in matters\nrequiring endurance as courage (Plutarch On Moral Virtue\n440E–441D). Practical knowledge, then, is a single,\ncomprehensive knowledge of what is good and bad in each of these kinds\nof circumstance.\n\nAttending to this identification of virtue and practical knowledge is\na good way to understand the central Stoic teaching that virtue is\nliving in agreement with nature (SVF III 16). Nature includes\nnot only what produces natural impulses but also the rest of the\ngovernment of the cosmos, the natural world. The universe is governed\nby right reason that pervades everything and directs (causes) the way\nit functions – with the exception of the only rational animals\nthere are, the adult human beings: their actions are governed by\nthemselves, i.e., by assenting to, or withholding assent from\nparticular impulses. Nature is even identified with Zeus, who is said\nto be the director of the administration of all that exists (DL VII\n87–9). Since reason governs the universe for the good,\neverything happens of necessity and for the overall good. Virtue,\nthen, includes understanding both one’s individual nature as a\nhuman being and the way nature arranges the whole universe. At this\npoint, we can appreciate the role of logic and physics as virtue since\nthese entail knowledge of the universe. This understanding is the\nbasis for living in agreement with the government of the universe,\ni.e., with nature, by making one’s decisions and actions be such\nas to agree with Zeus’s or nature’s own plans, so far as\none can understand what those are.\n\nIt is in this context that we can best understand the Stoic teaching\nabout indifferents, such as health and wealth. An individual’s\nhealth is vulnerable to being lost if right reason that governs the\nuniverse requires it for the good of the whole. If happiness depended\non having these assets and avoiding their opposites, then, in these\ncases, happiness would be impossible. However, if virtue is living in\nagreement with nature’s government of the universe and if virtue\nis the only good, one’s happiness is entirely determined by his\npatterns of assent and is therefore not vulnerable to being lost. If\none understands that the good of the whole dictates that in a\nparticular case one’s health must be sacrificed, then one\nrecognizes that his happiness does not require health. We should not,\nhowever, see this recognition as tantamount to renunciation. If the\nStoic notion of happiness has any relation at all to the ordinary\nsense, renunciation cannot be a part of it. Rather, the Stoic view of\nliving in accordance with nature should imply not only understanding\nthe way right reason rules the universe but agreeing with it and even\ndesiring that things happen as they do. We can best appreciate the\nnotion that virtue is the good, then, if we take virtue as both\nacknowledging that the universe is well governed and adopting the\npoint of view, so to speak, of the government (DL VII 87–9).\n\nA refinement of the Stoic approach to indifferents gives us a way of\nunderstanding what living in agreement with nature might look like.\nAfter all, such things as health and wealth cannot just be dismissed\nsince they are something like the raw material of virtue. It is in\npursuing and using them that one exercises virtue, for instance. In\nthe attempt to integrate preferred indifferents into the pursuit of\nthe good, Stoics used an analogy with archery (On Ends\nIII.22). Since he aims to hit the target, the archer does everything\nin his power to hit the target. Trying everything in his power\nreflects the idea that such factors as a gust of wind – chance\nhappenings that cannot be controlled or foreseen – can intervene\nand keep him from achieving the goal. To account for this type of\nfactor, it is claimed that the goal of the archer is really trying\neverything in his power to attain the end. The analogy with the art of\nliving focuses on this shift from the goal of hitting the target to\nthe goal of trying everything in one’s power to hit the target\n(On Ends V.17–20). It is the art of trying everything\nin one’s power to attain such preferred indifferents as health\nand wealth. However, if right reason, which governs the universe,\ndecides that one will not have either, then the sage follows right\nreason. At this point the analogy with archery breaks down since, for\nthe sage, trying everything in one’s power does not mean\nstriving until one fails; rather, it means seeking preferred\nindifferents guided by right reason. By this reasoning, one should see\nthat virtue and happiness are not identified with achieving heath and\nwealth but with the way one seeks them and the evaluative propositions\none assents to. Finally, the art of living is best compared to such\nskills as acting and dancing (On Ends V. 24–5).\n\nThis way of relating preferred indifferents to the end, i.e., to\nhappiness, was challenged in antiquity as incoherent. Plutarch, for\ninstance, argues that it is contrary to common understanding to say\nthat the end is different from the reference point of all action. If\nthe reference point of all action – what one does everything to\nachieve – is to have preferred indifferents such as health, then\nthe end is to have preferred indifferents. However, if the end is not\nto have preferred indifferents (but, say, always to act prudently),\nthen the reference point of all action cannot be the preferred\nindifferents (On Common Conceptions 1070F–1071E). The\nStoics are presented with a dilemma: either preferred indifferents are\nintegral to the end or they are not the object of choice.\n\nThe Stoics are extreme eudaimonists compared to Plato or Aristotle,\nalthough they are clearly inspired by Socratic intellectualism. While\nPlato clearly associates virtue and happiness, he never squarely faces\nthe issue whether happiness may require other goods, e.g., wealth and\nhealth. Aristotle holds happiness to be virtuous activity of the soul;\nbut he raises – without solving – the problem of bodily\nand external goods and happiness. For these two, virtue, together with\nits active exercise, is the dominant and most important component of\nhappiness, while Stoics simply identify virtue and the good, and so\nmake it the only thing needed for a happy life. Still, Stoics do not\nreduce happiness to virtue, as though ‘happiness’ is just\na name for being perfectly just, courageous, and moderate. Rather they\nhave independent ways of describing happiness. Following Zeno, all the\nStoics say it is a good flow of life. Seneca says the happy life is\npeacefulness and constant tranquility. However, we should keep in mind\nthat, while they do not reduce happiness to virtue, their account of\nhappiness is not that of the common person. So in recommending virtue\nbecause it secures happiness the Stoics are relying on happiness in a\nspecial, although not idiosyncratic, sense. In fact, their idea of\nhappiness shares an important feature with the Epicurean, which puts a\npremium on tranquil pleasures. In Stoicism as well, deliverance from\nthe vicissitudes of fate leads to a notion of happiness that\nemphasizes tranquility. And, as we shall see, tranquility is a value\nfor the Skeptics.\n\nClearly, the Stoic account of virtue and happiness depends on their\ntheory about human nature. For Aristotle, virtue is perfection of the\nhuman function and the Stoics follow in this line of thinking. While\ntheir notion of virtue builds on their notion of the underlying human\nnature, their account of the perfection of human nature is more\ncomplex than Aristotle’s. It includes accommodation to the\nnature of the universe. Virtue is the perfection of human nature that\nmakes it harmonious with the workings of fate, i.e. with Zeus’s\noverall plan, regarded as the ineluctable, though providential, cause\nof what happens in the world at large.\n",
    "section_title": "8. Stoics",
    "entry_title": "Ancient Ethical Theory",
    "hierarchy_title": "Ancient Ethical Theory || Stoics",
    "tokenized_text": [
        "stoic",
        "stoic",
        "stoic",
        "well",
        "known",
        "teaching",
        "good",
        "identified",
        "virtue",
        "virtue",
        "include",
        "logic",
        "physic",
        "ethic",
        "stoicorum",
        "veterum",
        "fragmenta",
        "svf",
        "ii",
        "well",
        "wisdom",
        "moderation",
        "justice",
        "courage",
        "modern",
        "ear",
        "first",
        "three",
        "sound",
        "like",
        "academic",
        "subject",
        "stoic",
        "virtue",
        "thought",
        "however",
        "orthodox",
        "stoic",
        "follow",
        "aristotelian",
        "distinction",
        "intellectual",
        "moral",
        "virtue",
        "shall",
        "see",
        "hold",
        "human",
        "psychological",
        "function",
        "including",
        "affective",
        "volitional",
        "rational",
        "single",
        "unified",
        "sense",
        "consequently",
        "virtue",
        "form",
        "unity",
        "around",
        "core",
        "concept",
        "knowledge",
        "finally",
        "required",
        "happiness",
        "ie",
        "secure",
        "possession",
        "good",
        "needed",
        "make",
        "one",
        "life",
        "thoroughly",
        "good",
        "one",
        "thing",
        "lead",
        "virtuous",
        "life",
        "teaching",
        "stoic",
        "addressing",
        "problem",
        "bodily",
        "external",
        "good",
        "raised",
        "aristotle",
        "solution",
        "take",
        "radical",
        "course",
        "dismissing",
        "alleged",
        "good",
        "account",
        "happiness",
        "necessary",
        "virtue",
        "fact",
        "way",
        "good",
        "argue",
        "health",
        "pleasure",
        "beauty",
        "strength",
        "wealth",
        "good",
        "reputation",
        "noble",
        "birth",
        "neither",
        "good",
        "bad",
        "since",
        "used",
        "well",
        "badly",
        "good",
        "invariably",
        "good",
        "asset",
        "good",
        "virtue",
        "however",
        "good",
        "dl",
        "vii",
        "since",
        "perfection",
        "rationality",
        "rationally",
        "perfected",
        "thought",
        "decision",
        "possibly",
        "feature",
        "harmony",
        "order",
        "goodness",
        "consists",
        "since",
        "possessing",
        "exercising",
        "virtue",
        "happiness",
        "happiness",
        "include",
        "thing",
        "health",
        "pleasure",
        "wealth",
        "still",
        "stoic",
        "dismiss",
        "asset",
        "altogether",
        "since",
        "still",
        "kind",
        "value",
        "thing",
        "indifferent",
        "happiness",
        "add",
        "one",
        "virtue",
        "detract",
        "add",
        "take",
        "away",
        "one",
        "possession",
        "good",
        "one",
        "virtuous",
        "healthy",
        "le",
        "virtuous",
        "ill",
        "healthy",
        "generally",
        "conforms",
        "nature",
        "plan",
        "life",
        "animal",
        "plant",
        "preferable",
        "healthy",
        "one",
        "try",
        "preserve",
        "maintain",
        "one",
        "health",
        "health",
        "kind",
        "value",
        "call",
        "preferred",
        "indifferent",
        "way",
        "good",
        "make",
        "contribution",
        "quality",
        "one",
        "life",
        "good",
        "bad",
        "one",
        "happy",
        "miserable",
        "order",
        "understand",
        "stoic",
        "claim",
        "relation",
        "virtue",
        "happiness",
        "begin",
        "virtue",
        "chrysippus",
        "say",
        "virtue",
        "craft",
        "technê",
        "thing",
        "life",
        "svf",
        "ii",
        "text",
        "learn",
        "thing",
        "life",
        "include",
        "impulse",
        "hormê",
        "animal",
        "impulse",
        "selfpreservation",
        "awareness",
        "constitution",
        "strives",
        "preserve",
        "integrity",
        "also",
        "natural",
        "impulse",
        "care",
        "offspring",
        "human",
        "naturally",
        "inclined",
        "toward",
        "preserving",
        "life",
        "health",
        "child",
        "grownup",
        "human",
        "also",
        "thing",
        "guidance",
        "reason",
        "reason",
        "adult",
        "human",
        "case",
        "craftsman",
        "impulse",
        "dl",
        "vii",
        "latter",
        "phrase",
        "significant",
        "implies",
        "following",
        "natural",
        "impulse",
        "enough",
        "fact",
        "even",
        "possible",
        "adult",
        "human",
        "whose",
        "nature",
        "everything",
        "reason",
        "even",
        "follow",
        "sort",
        "natural",
        "impulse",
        "animal",
        "immature",
        "human",
        "action",
        "order",
        "lead",
        "virtuous",
        "life",
        "reason",
        "must",
        "shape",
        "impulse",
        "guide",
        "expression",
        "action",
        "impulse",
        "key",
        "understanding",
        "relation",
        "virtue",
        "happiness",
        "impulse",
        "propositional",
        "attitude",
        "assented",
        "lead",
        "action",
        "eg",
        "eat",
        "bread",
        "now",
        "however",
        "impulse",
        "arise",
        "separate",
        "nonrational",
        "part",
        "soul",
        "stoic",
        "deny",
        "nonrational",
        "desire",
        "appetite",
        "capable",
        "impelling",
        "action",
        "soul",
        "insofar",
        "provides",
        "motivation",
        "cause",
        "action",
        "consists",
        "commanding",
        "faculty",
        "hêgemonikon",
        "also",
        "reason",
        "svf",
        "distinguish",
        "correct",
        "impulse",
        "treat",
        "virtue",
        "good",
        "treat",
        "thing",
        "indifferent",
        "indifferent",
        "contrast",
        "emotion",
        "passion",
        "pathê",
        "incorrect",
        "impulse",
        "treat",
        "indifferent",
        "good",
        "however",
        "come",
        "nonrational",
        "part",
        "soul",
        "false",
        "judgment",
        "good",
        "judgment",
        "understood",
        "assent",
        "impulse",
        "emotion",
        "desire",
        "fear",
        "pleasure",
        "pain",
        "embody",
        "erroneous",
        "judgment",
        "svf",
        "iii",
        "instance",
        "desire",
        "health",
        "arises",
        "assenting",
        "impulse",
        "embodies",
        "false",
        "judgment",
        "health",
        "good",
        "instead",
        "preferred",
        "indifferent",
        "sage",
        "someone",
        "perfected",
        "virtue",
        "would",
        "never",
        "assent",
        "false",
        "proposition",
        "thus",
        "would",
        "never",
        "emotion",
        "sense",
        "feeling",
        "carried",
        "beyond",
        "reason",
        "true",
        "assessment",
        "would",
        "however",
        "experience",
        "feeling",
        "attuned",
        "reason",
        "eupatheiai",
        "literally",
        "good",
        "emotion",
        "feeling",
        "instance",
        "would",
        "feel",
        "joy",
        "virtue",
        "pleasure",
        "latter",
        "emotion",
        "treat",
        "actual",
        "possession",
        "indifferent",
        "good",
        "knowledge",
        "good",
        "bad",
        "indifferent",
        "heart",
        "virtue",
        "courage",
        "eg",
        "simply",
        "knowledge",
        "endured",
        "impulse",
        "endure",
        "impulse",
        "needed",
        "courage",
        "follows",
        "automatically",
        "product",
        "aspect",
        "knowledge",
        "tight",
        "unity",
        "soul",
        "basis",
        "stoic",
        "teaching",
        "unity",
        "virtue",
        "zeno",
        "founder",
        "school",
        "defines",
        "wisdom",
        "phronêsis",
        "rather",
        "practical",
        "knowledge",
        "matter",
        "requiring",
        "distribution",
        "justice",
        "matter",
        "requiring",
        "choice",
        "moderation",
        "matter",
        "requiring",
        "endurance",
        "courage",
        "plutarch",
        "moral",
        "virtue",
        "ed",
        "practical",
        "knowledge",
        "single",
        "comprehensive",
        "knowledge",
        "good",
        "bad",
        "kind",
        "circumstance",
        "attending",
        "identification",
        "virtue",
        "practical",
        "knowledge",
        "good",
        "way",
        "understand",
        "central",
        "stoic",
        "teaching",
        "virtue",
        "living",
        "agreement",
        "nature",
        "svf",
        "iii",
        "nature",
        "includes",
        "produce",
        "natural",
        "impulse",
        "also",
        "rest",
        "government",
        "cosmos",
        "natural",
        "world",
        "universe",
        "governed",
        "right",
        "reason",
        "pervades",
        "everything",
        "directs",
        "cause",
        "way",
        "function",
        "exception",
        "rational",
        "animal",
        "adult",
        "human",
        "being",
        "action",
        "governed",
        "ie",
        "assenting",
        "withholding",
        "assent",
        "particular",
        "impulse",
        "nature",
        "even",
        "identified",
        "zeus",
        "said",
        "director",
        "administration",
        "exists",
        "dl",
        "vii",
        "since",
        "reason",
        "governs",
        "universe",
        "good",
        "everything",
        "happens",
        "necessity",
        "overall",
        "good",
        "virtue",
        "includes",
        "understanding",
        "one",
        "individual",
        "nature",
        "human",
        "way",
        "nature",
        "arranges",
        "whole",
        "universe",
        "point",
        "appreciate",
        "role",
        "logic",
        "physic",
        "virtue",
        "since",
        "entail",
        "knowledge",
        "universe",
        "understanding",
        "basis",
        "living",
        "agreement",
        "government",
        "universe",
        "ie",
        "nature",
        "making",
        "one",
        "decision",
        "action",
        "agree",
        "zeus",
        "nature",
        "plan",
        "far",
        "one",
        "understand",
        "context",
        "best",
        "understand",
        "stoic",
        "teaching",
        "indifferents",
        "health",
        "wealth",
        "individual",
        "health",
        "vulnerable",
        "lost",
        "right",
        "reason",
        "governs",
        "universe",
        "requires",
        "good",
        "whole",
        "happiness",
        "depended",
        "asset",
        "avoiding",
        "opposite",
        "case",
        "happiness",
        "would",
        "impossible",
        "however",
        "virtue",
        "living",
        "agreement",
        "nature",
        "government",
        "universe",
        "virtue",
        "good",
        "one",
        "happiness",
        "entirely",
        "determined",
        "pattern",
        "assent",
        "therefore",
        "vulnerable",
        "lost",
        "one",
        "understands",
        "good",
        "whole",
        "dictate",
        "particular",
        "case",
        "one",
        "health",
        "must",
        "sacrificed",
        "one",
        "recognizes",
        "happiness",
        "require",
        "health",
        "however",
        "see",
        "recognition",
        "tantamount",
        "renunciation",
        "stoic",
        "notion",
        "happiness",
        "relation",
        "ordinary",
        "sense",
        "renunciation",
        "part",
        "rather",
        "stoic",
        "view",
        "living",
        "accordance",
        "nature",
        "imply",
        "understanding",
        "way",
        "right",
        "reason",
        "rule",
        "universe",
        "agreeing",
        "even",
        "desiring",
        "thing",
        "happen",
        "best",
        "appreciate",
        "notion",
        "virtue",
        "good",
        "take",
        "virtue",
        "acknowledging",
        "universe",
        "well",
        "governed",
        "adopting",
        "point",
        "view",
        "speak",
        "government",
        "dl",
        "vii",
        "refinement",
        "stoic",
        "approach",
        "indifferents",
        "give",
        "u",
        "way",
        "understanding",
        "living",
        "agreement",
        "nature",
        "might",
        "look",
        "like",
        "thing",
        "health",
        "wealth",
        "dismissed",
        "since",
        "something",
        "like",
        "raw",
        "material",
        "virtue",
        "pursuing",
        "using",
        "one",
        "exercise",
        "virtue",
        "instance",
        "attempt",
        "integrate",
        "preferred",
        "indifferents",
        "pursuit",
        "good",
        "stoic",
        "used",
        "analogy",
        "archery",
        "end",
        "iii",
        "since",
        "aim",
        "hit",
        "target",
        "archer",
        "everything",
        "power",
        "hit",
        "target",
        "trying",
        "everything",
        "power",
        "reflects",
        "idea",
        "factor",
        "gust",
        "wind",
        "chance",
        "happening",
        "controlled",
        "foreseen",
        "intervene",
        "keep",
        "achieving",
        "goal",
        "account",
        "type",
        "factor",
        "claimed",
        "goal",
        "archer",
        "really",
        "trying",
        "everything",
        "power",
        "attain",
        "end",
        "analogy",
        "art",
        "living",
        "focus",
        "shift",
        "goal",
        "hitting",
        "target",
        "goal",
        "trying",
        "everything",
        "one",
        "power",
        "hit",
        "target",
        "end",
        "v",
        "art",
        "trying",
        "everything",
        "one",
        "power",
        "attain",
        "preferred",
        "indifferents",
        "health",
        "wealth",
        "however",
        "right",
        "reason",
        "governs",
        "universe",
        "decides",
        "one",
        "either",
        "sage",
        "follows",
        "right",
        "reason",
        "point",
        "analogy",
        "archery",
        "break",
        "since",
        "sage",
        "trying",
        "everything",
        "one",
        "power",
        "mean",
        "striving",
        "one",
        "fails",
        "rather",
        "mean",
        "seeking",
        "preferred",
        "indifferents",
        "guided",
        "right",
        "reason",
        "reasoning",
        "one",
        "see",
        "virtue",
        "happiness",
        "identified",
        "achieving",
        "heath",
        "wealth",
        "way",
        "one",
        "seek",
        "evaluative",
        "proposition",
        "one",
        "assent",
        "finally",
        "art",
        "living",
        "best",
        "compared",
        "skill",
        "acting",
        "dancing",
        "end",
        "v",
        "way",
        "relating",
        "preferred",
        "indifferents",
        "end",
        "ie",
        "happiness",
        "challenged",
        "antiquity",
        "incoherent",
        "plutarch",
        "instance",
        "argues",
        "contrary",
        "common",
        "understanding",
        "say",
        "end",
        "different",
        "reference",
        "point",
        "action",
        "reference",
        "point",
        "action",
        "one",
        "everything",
        "achieve",
        "preferred",
        "indifferents",
        "health",
        "end",
        "preferred",
        "indifferents",
        "however",
        "end",
        "preferred",
        "indifferents",
        "say",
        "always",
        "act",
        "prudently",
        "reference",
        "point",
        "action",
        "preferred",
        "indifferents",
        "common",
        "conception",
        "fe",
        "stoic",
        "presented",
        "dilemma",
        "either",
        "preferred",
        "indifferents",
        "integral",
        "end",
        "object",
        "choice",
        "stoic",
        "extreme",
        "eudaimonists",
        "compared",
        "plato",
        "aristotle",
        "although",
        "clearly",
        "inspired",
        "socratic",
        "intellectualism",
        "plato",
        "clearly",
        "associate",
        "virtue",
        "happiness",
        "never",
        "squarely",
        "face",
        "issue",
        "whether",
        "happiness",
        "may",
        "require",
        "good",
        "eg",
        "wealth",
        "health",
        "aristotle",
        "hold",
        "happiness",
        "virtuous",
        "activity",
        "soul",
        "raise",
        "without",
        "solving",
        "problem",
        "bodily",
        "external",
        "good",
        "happiness",
        "two",
        "virtue",
        "together",
        "active",
        "exercise",
        "dominant",
        "important",
        "component",
        "happiness",
        "stoic",
        "simply",
        "identify",
        "virtue",
        "good",
        "make",
        "thing",
        "needed",
        "happy",
        "life",
        "still",
        "stoic",
        "reduce",
        "happiness",
        "virtue",
        "though",
        "happiness",
        "name",
        "perfectly",
        "courageous",
        "moderate",
        "rather",
        "independent",
        "way",
        "describing",
        "happiness",
        "following",
        "zeno",
        "stoic",
        "say",
        "good",
        "flow",
        "life",
        "seneca",
        "say",
        "happy",
        "life",
        "peacefulness",
        "constant",
        "tranquility",
        "however",
        "keep",
        "mind",
        "reduce",
        "happiness",
        "virtue",
        "account",
        "happiness",
        "common",
        "person",
        "recommending",
        "virtue",
        "secures",
        "happiness",
        "stoic",
        "relying",
        "happiness",
        "special",
        "although",
        "idiosyncratic",
        "sense",
        "fact",
        "idea",
        "happiness",
        "share",
        "important",
        "feature",
        "epicurean",
        "put",
        "premium",
        "tranquil",
        "pleasure",
        "stoicism",
        "well",
        "deliverance",
        "vicissitude",
        "fate",
        "lead",
        "notion",
        "happiness",
        "emphasizes",
        "tranquility",
        "shall",
        "see",
        "tranquility",
        "value",
        "skeptic",
        "clearly",
        "stoic",
        "account",
        "virtue",
        "happiness",
        "depends",
        "theory",
        "human",
        "nature",
        "aristotle",
        "virtue",
        "perfection",
        "human",
        "function",
        "stoic",
        "follow",
        "line",
        "thinking",
        "notion",
        "virtue",
        "build",
        "notion",
        "underlying",
        "human",
        "nature",
        "account",
        "perfection",
        "human",
        "nature",
        "complex",
        "aristotle",
        "includes",
        "accommodation",
        "nature",
        "universe",
        "virtue",
        "perfection",
        "human",
        "nature",
        "make",
        "harmonious",
        "working",
        "fate",
        "ie",
        "zeus",
        "overall",
        "plan",
        "regarded",
        "ineluctable",
        "though",
        "providential",
        "cause",
        "happens",
        "world",
        "large"
    ]
}