{
    "main_text": "Contemporary Ethical Concerns about Social Networking Services || The Ethics of Identity and Community on Social Networking Services\n3.2 The Ethics of Identity and Community on Social Networking Services\n\nSocial networking technologies open up a new type of ethical space in\nwhich personal identities and communities, both ‘real’ and\nvirtual, are constructed, presented, negotiated, managed and\nperformed. Accordingly, philosophers have analyzed SNS both in terms\nof their uses as Foucaultian “technologies of the self”\n(Bakardjieva and Gaden 2012) that facilitate the construction and\nperformance of personal identity, and in terms of the distinctive\nkinds of communal norms and moral practices generated by SNS (Parsell\n2008).\n\nThe ethical and metaphysical issues generated by the formation of\nvirtual identities and communities have attracted much philosophical\ninterest (see Introna 2011 and Rodogno 2012). Yet as noted by Patrick\nStokes (2012), unlike earlier forms of online community in which\nanonymity and the construction of alter-egos were typical, SNS such as\nFacebook increasingly anchor member identities and connections to\nreal, embodied selves and offline ‘real-world’ networks.\nYet SNS still enable users to directly manage their self-presentation\nand their social networks in ways that offline social spaces at home,\nschool or work often do not permit. The result, then, is an identity\ngrounded in the person’s material reality and embodiment but\nmore explicitly “reflective and aspirational” (Stokes\n2012, 365) in its presentation, a phenomenon encapsulated in social\nmedia platforms such as Instagram. This raises a number of ethical\nquestions: first, from what source of normative guidance or value does\nthe aspirational content of an SNS user’s identity primarily\nderive? Do identity performances on SNS generally represent the same\naspirations and reflect the same value profiles as users’\noffline identity performances? Do they display any notable differences\nfrom the aspirational identities of non-SNS users? Are the values and\naspirations made explicit in SNS contexts more or less heteronomous in\norigin than those expressed in non-SNS contexts? Do the more\nexplicitly aspirational identity performances on SNS encourage users\nto take steps to actually embody those aspirations offline, or do they\ntend to weaken the motivation to do so?\n\nA further SNS phenomenon of relevance here is the persistence and\ncommunal memorialization of Facebook profiles after the user’s\ndeath; not only does this reinvigorate a number of classical ethical\nquestions about our ethical duties to honor and remember the dead, it\nalso renews questions about whether our moral identities can persist\nafter our embodied identities expire, and whether the dead have\nongoing interests in their social presence or reputation (Stokes\n2012).\n\nMitch Parsell (2008) raised early concerns about the unique\ntemptations of ‘narrowcast’ social networking communities\nthat are “composed of those just like yourself, whatever your\nopinion, personality or prejudices.” (41) Such worries about\n‘echo chambers’ and ‘filter bubbles’ have only\nbecome more acute as political polarization continues to dominate\nonline culture. Among the structural affordances of SNS is a tendency\nto constrict our identities to a closed set of communal norms that\nperpetuate increased polarization, prejudice and insularity. Parsells\nadmitted that in theory the many-to-many or one-to-many\nrelations enabled by SNS allow for exposure to a greater variety of\nopinions and attitudes, but in practice they often have the\nopposite effect. Building from de Laat (2006), who suggests that\nmembers of virtual communities embrace a distinctly\nhyperactive style of communication to compensate for\ndiminished informational cues, Parsell claimed that in the absence of\nthe full range of personal identifiers evident through face-to-face\ncontact, SNS may also indirectly promote the deindividuation\nof personal identity by exaggerating and reinforcing the significance\nof singular shared traits (liberal, conservative, gay, Catholic, etc.)\nthat lead us to see ourselves and our SNS contacts more as\nrepresentatives of a group than as unique persons (2008, 46).\n\nParsell also noted the existence of inherently pernicious\nidentities and communities that may be enabled or enhanced by SNS\ntools—he cites the example of apotemnophiliacs, or would-be\namputees, who use such resources to create mutually supportive\nnetworks in which their self-destructive desires receive validation\n(2008, 48). Related concerns have been raised about\n“Pro-ANA” sites that provide mutually supportive networks\nfor anorexics seeking information and tools to allow them to\nperpetuate disordered and self-harming identities (Giles 2006;\nManders-Huits 2010).\n\nRestraint of such affordances necessarily comes at some cost to user\nautonomy—a value that in other circumstances is critical to\nrespecting the ethical demands of identity, as noted by Noemi\nManders-Huits (2010). Manders-Huits explores the tension between the\nway in which SNS treat users as profiled and forensically\nreidentifiable “objects of (algorithmic) computation”\n(2010, 52) while at the same time offering those users an attractive\nspace for ongoing identity construction. She argues that SNS\ndevelopers have a duty to protect and promote the interests of their\nusers in autonomously constructing and managing their own moral and\npractical identities. This autonomy exists in some tension with\nwidespread but still crude practices of automated SNS content\nmoderation that seek on the one hand, to preserve a ’safe’\nspace for expression, yet may disproportionately suppress marginalized\nidentities (Gillespie 2020).\n\nThe ethical concern about SNS constraints on user autonomy is also\nvoiced by Bakardjieva and Gaden (2012) who note that whether they wish\ntheir identities to be formed and used in this manner or not, the\nonline selves of SNS users are constituted by the categories\nestablished by SNS developers, and ranked and evaluated according to\nthe currency which primarily drives the narrow “moral\neconomy” of SNS communities: popularity (2012, 410). They note,\nhowever, that users are not rendered wholly powerless by this schema;\nusers retain, and many exercise, “the liberty to make informed\nchoices and negotiate the terms of their self-constitution and\ninteraction with others,” (2012, 411) whether by employing means\nto resist the “commercial imperatives” of SNS sites\n(ibid.) or by deliberately restricting the scope and extent of their\npersonal SNS practices.\n\nSNS can also enable authenticity in important ways. While a\n‘Timeline’ feature that displays my entire online personal\nhistory for all my friends to see can prompt me to ‘edit’\nmy past, it can also prompt me to face up to and assimilate into my\nself-conception thoughts and actions that might otherwise be\nconveniently forgotten. The messy collision of my family, friends and\ncoworkers on Facebook can be managed with various tools offered by the\nsite, allowing me to direct posts only to specific sub-networks that I\ndefine. But the far simpler and less time-consuming strategy is to\ncome to terms with the collision—allowing each network member to\nget a glimpse of who I am to others, while at the same time asking\nmyself whether these expanded presentations project a person that is\nmore multidimensional and interesting, or one that is manifestly\ninsincere. As Tamara Wandel and Anthony Beavers put it:\n\nI am thus no longer radically free to engage in creating a completely\nfictive self, I must become someone real, not who I really am pregiven\nfrom the start, but who I am allowed to be and what I am able to\nnegotiate in the careful dynamic between who I want to be and who my\nfriends from these multiple constituencies perceive me, allow me, and\nneed me to be. (2011, 93)\n\n\nEven so, Dean Cocking (2008) has argued that many online social\nenvironments, by amplifying active aspects of self-presentation under\nour direct control, compromise the important function of\npassive modes of embodied self-presentation beyond our\nconscious control, such as body language, facial expression, and\nspontaneous displays of emotion (130). He regards these as important\nindicators of character that play a critical role in how others see\nus, and by extension, how we come to understand ourselves through\nothers’ perceptions and reactions. If Cocking’s view is\ncorrect, then SNS that privilege text-based and asynchronous\ncommunications may hamper our ability to cultivate and express\nauthentic identities. The subsequent rise in popularity of video and\nlivestream SNS services such as YouTube, TikTok, Stream and Twitch\nmight therefore be seen as enabling of greater authenticity in\nself-presentation. Yet in reality, the algorithmic and profit\nincentives of these platforms have been seen to reward distorted\npatterns of expression: compulsive, ‘always performing’\nnorms that are reported to contribute to burnout and breakdown by\ncontent creators (Parkin 2018).\n\nEthical preoccupations with the impact of SNS on our authentic\nself-constitution and representation may be assuming a false dichotomy\nbetween online and offline identities; the informational theory of\npersonal identity offered by Luciano Floridi (2011) problematizes this\ndistinction. Soraj Hongladarom (2011) employs such an informational\nmetaphysic to deny that any clear boundary can be drawn between our\noffline selves and our selves as cultivated through SNS. Instead, our\npersonal identities online and off are taken as externally constituted\nby our informational relations to other selves, events and\nobjects.\n\nLikewise, Charles Ess makes a link between relational models of the\nself found in Aristotle, Confucius and many contemporary feminist\nthinkers and emerging notions of the networked individual as a\n“smeared-out self” (2010, 111) constituted by a shifting\nweb of embodied and informational relations. Ess points out that by\nundermining the atomic and dualistic model of the self upon which\nWestern liberal democracies are founded, this new conception of the\nself forces us to reassess traditional philosophical approaches to\nethical concerns about privacy and autonomy—and may even promote\nthe emergence of a much-needed “global information ethics”\n(2010, 112). Yet he worries that our ‘smeared-out selves’\nmay lose coherence as the relations that constitute us are\nincreasingly multiplied and scattered among a vast and expanding web\nof networked channels. Can such selves retain the capacities of\ncritical rationality required for the exercise of liberal democracy,\nor will our networked selves increasingly be characterized by\npolitical and intellectual passivity, hampered in self-governance by\n“shorter attention spans and less capacity to engage with\ncritical argument” (2010, 114)? Ess suggests that we hope for,\nand work to enable the emergence of, ‘hybrid selves’ that\ncultivate the individual moral and practical virtues needed to\nflourish within our networked and embodied relations (2010, 116).\n",
    "section_title": "3.2 The Ethics of Identity and Community on Social Networking Services",
    "entry_title": "Social Networking and Ethics",
    "hierarchy_title": "Social Networking and Ethics || Contemporary Ethical Concerns about Social Networking Services || The Ethics of Identity and Community on Social Networking Services",
    "tokenized_text": [
        "contemporary",
        "ethical",
        "concern",
        "social",
        "networking",
        "service",
        "ethic",
        "identity",
        "community",
        "social",
        "networking",
        "service",
        "ethic",
        "identity",
        "community",
        "social",
        "networking",
        "service",
        "social",
        "networking",
        "technology",
        "open",
        "new",
        "type",
        "ethical",
        "space",
        "personal",
        "identity",
        "community",
        "real",
        "virtual",
        "constructed",
        "presented",
        "negotiated",
        "managed",
        "performed",
        "accordingly",
        "philosopher",
        "analyzed",
        "sn",
        "term",
        "us",
        "foucaultian",
        "technology",
        "self",
        "bakardjieva",
        "gaden",
        "facilitate",
        "construction",
        "performance",
        "personal",
        "identity",
        "term",
        "distinctive",
        "kind",
        "communal",
        "norm",
        "moral",
        "practice",
        "generated",
        "sn",
        "parsell",
        "ethical",
        "metaphysical",
        "issue",
        "generated",
        "formation",
        "virtual",
        "identity",
        "community",
        "attracted",
        "much",
        "philosophical",
        "interest",
        "see",
        "introna",
        "rodogno",
        "yet",
        "noted",
        "patrick",
        "stokes",
        "unlike",
        "earlier",
        "form",
        "online",
        "community",
        "anonymity",
        "construction",
        "alteregos",
        "typical",
        "sn",
        "facebook",
        "increasingly",
        "anchor",
        "member",
        "identity",
        "connection",
        "real",
        "embodied",
        "self",
        "offline",
        "realworld",
        "network",
        "yet",
        "sn",
        "still",
        "enable",
        "user",
        "directly",
        "manage",
        "selfpresentation",
        "social",
        "network",
        "way",
        "offline",
        "social",
        "space",
        "home",
        "school",
        "work",
        "often",
        "permit",
        "result",
        "identity",
        "grounded",
        "person",
        "material",
        "reality",
        "embodiment",
        "explicitly",
        "reflective",
        "aspirational",
        "stokes",
        "presentation",
        "phenomenon",
        "encapsulated",
        "social",
        "medium",
        "platform",
        "instagram",
        "raise",
        "number",
        "ethical",
        "question",
        "first",
        "source",
        "normative",
        "guidance",
        "value",
        "aspirational",
        "content",
        "sn",
        "user",
        "identity",
        "primarily",
        "derive",
        "identity",
        "performance",
        "sn",
        "generally",
        "represent",
        "aspiration",
        "reflect",
        "value",
        "profile",
        "user",
        "offline",
        "identity",
        "performance",
        "display",
        "notable",
        "difference",
        "aspirational",
        "identity",
        "nonsns",
        "user",
        "value",
        "aspiration",
        "made",
        "explicit",
        "sn",
        "context",
        "le",
        "heteronomous",
        "origin",
        "expressed",
        "nonsns",
        "context",
        "explicitly",
        "aspirational",
        "identity",
        "performance",
        "sn",
        "encourage",
        "user",
        "take",
        "step",
        "actually",
        "embody",
        "aspiration",
        "offline",
        "tend",
        "weaken",
        "motivation",
        "sn",
        "phenomenon",
        "relevance",
        "persistence",
        "communal",
        "memorialization",
        "facebook",
        "profile",
        "user",
        "death",
        "reinvigorate",
        "number",
        "classical",
        "ethical",
        "question",
        "ethical",
        "duty",
        "honor",
        "remember",
        "dead",
        "also",
        "renews",
        "question",
        "whether",
        "moral",
        "identity",
        "persist",
        "embodied",
        "identity",
        "expire",
        "whether",
        "dead",
        "ongoing",
        "interest",
        "social",
        "presence",
        "reputation",
        "stokes",
        "mitch",
        "parsell",
        "raised",
        "early",
        "concern",
        "unique",
        "temptation",
        "narrowcast",
        "social",
        "networking",
        "community",
        "composed",
        "like",
        "whatever",
        "opinion",
        "personality",
        "prejudices",
        "worry",
        "echo",
        "chamber",
        "filter",
        "bubble",
        "become",
        "acute",
        "political",
        "polarization",
        "continues",
        "dominate",
        "online",
        "culture",
        "among",
        "structural",
        "affordances",
        "sn",
        "tendency",
        "constrict",
        "identity",
        "closed",
        "set",
        "communal",
        "norm",
        "perpetuate",
        "increased",
        "polarization",
        "prejudice",
        "insularity",
        "parsells",
        "admitted",
        "theory",
        "manytomany",
        "onetomany",
        "relation",
        "enabled",
        "sn",
        "allow",
        "exposure",
        "greater",
        "variety",
        "opinion",
        "attitude",
        "practice",
        "often",
        "opposite",
        "effect",
        "building",
        "de",
        "laat",
        "suggests",
        "member",
        "virtual",
        "community",
        "embrace",
        "distinctly",
        "hyperactive",
        "style",
        "communication",
        "compensate",
        "diminished",
        "informational",
        "cue",
        "parsell",
        "claimed",
        "absence",
        "full",
        "range",
        "personal",
        "identifier",
        "evident",
        "facetoface",
        "contact",
        "sn",
        "may",
        "also",
        "indirectly",
        "promote",
        "deindividuation",
        "personal",
        "identity",
        "exaggerating",
        "reinforcing",
        "significance",
        "singular",
        "shared",
        "trait",
        "liberal",
        "conservative",
        "gay",
        "catholic",
        "etc",
        "lead",
        "u",
        "see",
        "sn",
        "contact",
        "representative",
        "group",
        "unique",
        "person",
        "parsell",
        "also",
        "noted",
        "existence",
        "inherently",
        "pernicious",
        "identity",
        "community",
        "may",
        "enabled",
        "enhanced",
        "sn",
        "toolshe",
        "cite",
        "example",
        "apotemnophiliacs",
        "wouldbe",
        "amputee",
        "use",
        "resource",
        "create",
        "mutually",
        "supportive",
        "network",
        "selfdestructive",
        "desire",
        "receive",
        "validation",
        "related",
        "concern",
        "raised",
        "proana",
        "site",
        "provide",
        "mutually",
        "supportive",
        "network",
        "anorexic",
        "seeking",
        "information",
        "tool",
        "allow",
        "perpetuate",
        "disordered",
        "selfharming",
        "identity",
        "giles",
        "mandershuits",
        "restraint",
        "affordances",
        "necessarily",
        "come",
        "cost",
        "user",
        "autonomya",
        "value",
        "circumstance",
        "critical",
        "respecting",
        "ethical",
        "demand",
        "identity",
        "noted",
        "noemi",
        "mandershuits",
        "mandershuits",
        "explores",
        "tension",
        "way",
        "sn",
        "treat",
        "user",
        "profiled",
        "forensically",
        "reidentifiable",
        "object",
        "algorithmic",
        "computation",
        "time",
        "offering",
        "user",
        "attractive",
        "space",
        "ongoing",
        "identity",
        "construction",
        "argues",
        "sn",
        "developer",
        "duty",
        "protect",
        "promote",
        "interest",
        "user",
        "autonomously",
        "constructing",
        "managing",
        "moral",
        "practical",
        "identity",
        "autonomy",
        "exists",
        "tension",
        "widespread",
        "still",
        "crude",
        "practice",
        "automated",
        "sn",
        "content",
        "moderation",
        "seek",
        "one",
        "hand",
        "preserve",
        "safe",
        "space",
        "expression",
        "yet",
        "may",
        "disproportionately",
        "suppress",
        "marginalized",
        "identity",
        "gillespie",
        "ethical",
        "concern",
        "sn",
        "constraint",
        "user",
        "autonomy",
        "also",
        "voiced",
        "bakardjieva",
        "gaden",
        "note",
        "whether",
        "wish",
        "identity",
        "formed",
        "used",
        "manner",
        "online",
        "self",
        "sn",
        "user",
        "constituted",
        "category",
        "established",
        "sn",
        "developer",
        "ranked",
        "evaluated",
        "according",
        "currency",
        "primarily",
        "drive",
        "narrow",
        "moral",
        "economy",
        "sn",
        "community",
        "popularity",
        "note",
        "however",
        "user",
        "rendered",
        "wholly",
        "powerless",
        "schema",
        "user",
        "retain",
        "many",
        "exercise",
        "liberty",
        "make",
        "informed",
        "choice",
        "negotiate",
        "term",
        "selfconstitution",
        "interaction",
        "others",
        "whether",
        "employing",
        "mean",
        "resist",
        "commercial",
        "imperative",
        "sn",
        "site",
        "ibid",
        "deliberately",
        "restricting",
        "scope",
        "extent",
        "personal",
        "sn",
        "practice",
        "sn",
        "also",
        "enable",
        "authenticity",
        "important",
        "way",
        "timeline",
        "feature",
        "display",
        "entire",
        "online",
        "personal",
        "history",
        "friend",
        "see",
        "prompt",
        "edit",
        "past",
        "also",
        "prompt",
        "face",
        "assimilate",
        "selfconception",
        "thought",
        "action",
        "might",
        "otherwise",
        "conveniently",
        "forgotten",
        "messy",
        "collision",
        "family",
        "friend",
        "coworkers",
        "facebook",
        "managed",
        "various",
        "tool",
        "offered",
        "site",
        "allowing",
        "direct",
        "post",
        "specific",
        "subnetworks",
        "define",
        "far",
        "simpler",
        "le",
        "timeconsuming",
        "strategy",
        "come",
        "term",
        "collisionallowing",
        "network",
        "member",
        "get",
        "glimpse",
        "others",
        "time",
        "asking",
        "whether",
        "expanded",
        "presentation",
        "project",
        "person",
        "multidimensional",
        "interesting",
        "one",
        "manifestly",
        "insincere",
        "tamara",
        "wandel",
        "anthony",
        "beaver",
        "put",
        "thus",
        "longer",
        "radically",
        "free",
        "engage",
        "creating",
        "completely",
        "fictive",
        "self",
        "must",
        "become",
        "someone",
        "real",
        "really",
        "pregiven",
        "start",
        "allowed",
        "able",
        "negotiate",
        "careful",
        "dynamic",
        "want",
        "friend",
        "multiple",
        "constituency",
        "perceive",
        "allow",
        "need",
        "even",
        "dean",
        "cocking",
        "argued",
        "many",
        "online",
        "social",
        "environment",
        "amplifying",
        "active",
        "aspect",
        "selfpresentation",
        "direct",
        "control",
        "compromise",
        "important",
        "function",
        "passive",
        "mode",
        "embodied",
        "selfpresentation",
        "beyond",
        "conscious",
        "control",
        "body",
        "language",
        "facial",
        "expression",
        "spontaneous",
        "display",
        "emotion",
        "regard",
        "important",
        "indicator",
        "character",
        "play",
        "critical",
        "role",
        "others",
        "see",
        "u",
        "extension",
        "come",
        "understand",
        "others",
        "perception",
        "reaction",
        "cocking",
        "view",
        "correct",
        "sn",
        "privilege",
        "textbased",
        "asynchronous",
        "communication",
        "may",
        "hamper",
        "ability",
        "cultivate",
        "express",
        "authentic",
        "identity",
        "subsequent",
        "rise",
        "popularity",
        "video",
        "livestream",
        "sn",
        "service",
        "youtube",
        "tiktok",
        "stream",
        "twitch",
        "might",
        "therefore",
        "seen",
        "enabling",
        "greater",
        "authenticity",
        "selfpresentation",
        "yet",
        "reality",
        "algorithmic",
        "profit",
        "incentive",
        "platform",
        "seen",
        "reward",
        "distorted",
        "pattern",
        "expression",
        "compulsive",
        "always",
        "performing",
        "norm",
        "reported",
        "contribute",
        "burnout",
        "breakdown",
        "content",
        "creator",
        "parkin",
        "ethical",
        "preoccupation",
        "impact",
        "sn",
        "authentic",
        "selfconstitution",
        "representation",
        "may",
        "assuming",
        "false",
        "dichotomy",
        "online",
        "offline",
        "identity",
        "informational",
        "theory",
        "personal",
        "identity",
        "offered",
        "luciano",
        "floridi",
        "problematizes",
        "distinction",
        "soraj",
        "hongladarom",
        "employ",
        "informational",
        "metaphysic",
        "deny",
        "clear",
        "boundary",
        "drawn",
        "offline",
        "self",
        "self",
        "cultivated",
        "sn",
        "instead",
        "personal",
        "identity",
        "online",
        "taken",
        "externally",
        "constituted",
        "informational",
        "relation",
        "self",
        "event",
        "object",
        "likewise",
        "charles",
        "es",
        "make",
        "link",
        "relational",
        "model",
        "self",
        "found",
        "aristotle",
        "confucius",
        "many",
        "contemporary",
        "feminist",
        "thinker",
        "emerging",
        "notion",
        "networked",
        "individual",
        "smearedout",
        "self",
        "constituted",
        "shifting",
        "web",
        "embodied",
        "informational",
        "relation",
        "es",
        "point",
        "undermining",
        "atomic",
        "dualistic",
        "model",
        "self",
        "upon",
        "western",
        "liberal",
        "democracy",
        "founded",
        "new",
        "conception",
        "self",
        "force",
        "u",
        "reassess",
        "traditional",
        "philosophical",
        "approach",
        "ethical",
        "concern",
        "privacy",
        "autonomyand",
        "may",
        "even",
        "promote",
        "emergence",
        "muchneeded",
        "global",
        "information",
        "ethic",
        "yet",
        "worry",
        "smearedout",
        "self",
        "may",
        "lose",
        "coherence",
        "relation",
        "constitute",
        "u",
        "increasingly",
        "multiplied",
        "scattered",
        "among",
        "vast",
        "expanding",
        "web",
        "networked",
        "channel",
        "self",
        "retain",
        "capacity",
        "critical",
        "rationality",
        "required",
        "exercise",
        "liberal",
        "democracy",
        "networked",
        "self",
        "increasingly",
        "characterized",
        "political",
        "intellectual",
        "passivity",
        "hampered",
        "selfgovernance",
        "shorter",
        "attention",
        "span",
        "le",
        "capacity",
        "engage",
        "critical",
        "argument",
        "es",
        "suggests",
        "hope",
        "work",
        "enable",
        "emergence",
        "hybrid",
        "self",
        "cultivate",
        "individual",
        "moral",
        "practical",
        "virtue",
        "needed",
        "flourish",
        "within",
        "networked",
        "embodied",
        "relation"
    ]
}