{
    "main_text": "Short history of eugenics\n1. Short history of eugenics\n\n\nPhilosophers have contemplated the meaning and\nvalue of eugenics at least since Plato recommended a state-run program\nof mating intended to strengthen the guardian class in\nhis Republic. However, the modern version of eugenics had\nits start with the 19th century cousin of Charles\nDarwin, British scientist Francis Galton (1883). Galton was interested\nin “improving human stock” through scientific management of\nmating. His explicit goal was to create better humans. His ideas were\ntaken up widely in the early part of the 20th century\nby seemingly well-intended, and ideologically diverse, scientists and\npolicy makers, particularly in the United States, Britain, and the\nScandinavian countries. Notable eugenicists included Alexander Graham\nBell and Margaret Sanger. (For an excellent history of eugenics, see\nKevles 1985.)\n\n\nEugenicists had two-fold aims: to encourage people\nwith various desirable traits, e.g., health, intelligence, character,\nto reproduce together to create good births (what is known as\n“positive” eugenics), and to end certain diseases and\ndisabilities by discouraging or preventing those with characteristics\nconsidered undesirable from reproducing (what is known as\n“negative” eugenics). In the United States, programs to\nencourage positive eugenics involved the creation of “Fitter\nFamily Fairs” in which families competed for prizes at local\ncounty fairs, much in the way that livestock is judged for conformation\nand physical dexterity (Stern 2002). Negative eugenics took the form of\nencouraged or forced sterilizations of men and, particularly, women\ndeemed unfit to reproduce (in the language of the day, this included\nindividuals who were “poor, mentally insane, feeble-minded,\nidiots, drunken” and more). Much of eugenics ideology was\nreductionistic in nature, with many eugenicists assuming that social\nand behavioral conditions, such as poverty, vagrancy, or prostitution,\nwere inherited as genetic traits rather than shared as common social\nsituations. Nonetheless proponents of eugenic policies were aware of\nthe interplay between biology and the environment, even if they were\nnot very concerned with differentiating the various contributory\nfactors (Dyck 2014). Social problems such as alcoholism or diseases\nrelated to mental health were understood to have a genetic component\nthat could lead to difficulties in taking appropriate care of children\n(For an interesting discussion of the relevant social moral\nepistemology, see Buchanan 2007).\n\n\nRacist, sexist, ableist, xenophobic, and classist\nassumptions pervaded the discourse. In the US, for instance, alarm\ncalls were raised about the lower birth rates among white Protestant\nAmericans compared to the large immigrant Catholic populations of\nItalian and Irish descent. German scientists and policymakers visited\nthe United States to learn from their methods, and when the Nazis came\nto power in Germany, they began eugenic policies of their own. Early\nGerman policies called for the killing of people in institutions whose\nphysical or mental illnesses were deemed incurable. Such individuals\nwere considered to have “lives unworthy of life”\n(lebensunwertes Leben). The Nazis\nalso encouraged selective breeding for Aryan traits (e.g., athletic,\nblond, blue-eyed). This policy quickly expanded to include bans on\nmarriage between particular groups, forced sterilization, and then\ninternment in concentration camps for individuals belonging to groups\ndeemed inferior (i.e., people who were disabled, homosexual, diagnosed\nwith psychiatric conditions, communists, considered to be Roma/gypsies,\nand/or Jewish). The purported aim was to promote the\n“health” of the German population by controlling those who\nwere “unhealthy.” Prisoners faced extremely hard labor,\nmedical experimentation that was torturous and designed to test the\nlimits of the human body (Lifton 1986) and daily degradation and abuse.\nEventually, the Nazis escalated their eugenic program to the\n“final solution” of death camps, ultimately killing more\nthan six million Jewish people in the name of promoting Germany’s\nhealth.\n\n\nFollowing the end of WWII, the term\n“eugenic” was so closely associated with the horrific\nprograms of Nazi Germany that eugenics societies across the world\nchanged their names (e.g., the American Eugenics Society became the\nSociety for the Study of Social Biology) and tempered their aims. Yet\nmany of the same practices and beliefs continued under a different\nguise, from immigration policies, to forced sterilization, to\npopulation control (Kevles 1985; MacLaren 1990; Kline 2001; Broberg and\nRoll-Hansen 2005; Lombardo 2008; Paul, Stenhouse, and Spencer 2018;\nWillson 2018). In the United States, involuntary eugenic sterilizations\nof “feeble-minded” women in a variety of states didn’t\nofficially end until the late 1970s and may continue covertly in some\nstate institutions. California had the highest rate of forced\nsterilizations, which were widely performed on prison inmates, people\nin mental institutions, and women considered to be bad mothers. Such\nsterilizations were motivated by both perceived individual and social\ngoods but were grounded on deep-seated prejudice as well as scientific\ninaccuracies (Kluchin 2009; Stern 2015). Concepts of\n“feeble-mindedness” were historically entangled in deeply\nproblematic ways with ideas of race, class, and gender (Stubblefield\n2007). California has now joined Virginia and North Carolina in passing\nlegislation to compensate forced sterilization victims.\n\n\nLater, attempts to promote positive eugenics were\nrenewed with the creation of the Repository for Germinal Choice, a\nsperm bank created in 1978 with the idea of collecting sperm from Nobel\nlaureates, others deemed “geniuses” and Olympic level\nathletes. Artificial insemination and IVF would thus allow women to\nchoose to reproduce with men presumed to have high-quality genes,\nwithout needing to form relationships with them. Although most Nobel\nprizewinners proved reluctant to donate to the sperm bank, the general\nidea took off. Today, advances in egg freezing have also permitted the\ncreation of egg banks and print and online ads in college newspapers\nregularly request sperm or eggs from donors who meet certain\nqualifications for health, intelligence, athleticism, and/or\nattractiveness. Individuals or couples who require gamete donation to\nreproduce can shop around for a donor who meets their desired criteria\n(see the entry on the\n donation and sale of human eggs and sperm). \n Importantly, these practices are not only examples of\npositive eugenics but also of negative eugenics. Racist, classist, and\nableist prejudices underlie these practices in ways that promote\nnegative eugenics by preventing or discouraging some women from\nreproducing (Roberts 1997; Daar 2018).  \n\n\nThe widespread practice of prenatal genetic\ntesting (traditionally through chorionic villus sampling or\namniocentesis in the second trimester of pregnancy, but now more\nroutinely done through non-invasive blood tests in the first trimester,\nat least as a first screen), similarly presents the opportunity for\nindividuals or couples to identify genes or genetic markers for traits\nthey prefer for their future children not to have. If prenatal testing\nidentifies an undesired gene variant, prospective parents may choose to\nabort the fetus, often with the plan to later attempt a new pregnancy.\nStudies suggest that approximately 80 to 90% of parents terminate\npregnancies identified with certain disorders (Rothschild 2005,\nBlakeley et al 2019). With the advent of preimplantation genetic\ntesting, prospective parents can choose to use IVF, and then test\nearly cells of the created embryos to identify embryos with genomic\nvariants they favor or those prefer to avoid. In this way, they\npreclude the potential need for abortion by choosing to implant only\nembryos that contain the desired genes.\n\n\nThe aim of these practices certainly appears\neugenic, though without an obviously coercive structure, and presumably\ndirected at benefiting the individual family rather than the state. The\nprofession of genetic counseling, started in the 1990s, provides\nprospective parents with detailed information about the meaning of the\ntests, and the opportunity for discussion of test results. In part due\nto concerns about eugenic overtones, genetic counseling is built on a\npolicy of “non-directiveness” to ensure that the\nreproductive autonomy of prospective parents is respected. That tenet\nof genetic counseling has been challenged by scholars on grounds that\nit is impossible (Clarke 2017) and that it is undesirable (Davis 2010;\nDietz and Reynolds 2021).\n\n\nFinally, while past testing methods allowed\nidentification of chromosomal abnormalities such as Trisomy 13, Trisomy\n18, Trisomy 21 (Down Syndrome), and monogenic disorders such as\nHuntington’s disease, next generation sequencing (NGS) technologies now\npermit an unparalleled wealth of information about fetuses’ and\nembryos’ genomes.  Although these technologies are not yet\nused routinely, their utility is being assessed in clinical trials.\nShould this expanded genomic information be available on prenatal\ntesting panels? Or for all prospective parents who request prenatal\ntesting? What about other additions that might be of interest to\nparticular parents, even if the genetic linkages to the particular\ntraits are less direct or even only mildly predictive: diabetes,\nobesity, or psychiatric conditions such as bipolar disorder or\nschizophrenia?\n\n\nMoreover, new genome editing technologies are now\nbeing used to modify sperm, eggs, and embryos. Indeed, although genome\nediting for reproductive purposes is implicitly or explicitly\nprohibited in most countries, in November 2018, Chinese researcher He\nJiankui used it to modify human embryos (Kirksey 2021). He and his team\nedited the embryos to disable a genetic pathway that HIV uses to infect\ncells. According to reports, three babies have been born from the\nedited embryos\n\n\nThese new genomic technologies could provide\nprospective parents –and others – with a significant degree of\ncontrol over the characteristics of their children and the traits that\nshould and should not be promoted. Deciding how to deal with\nthem – as a society, and potentially as individual prospective\nparents – is a monumental task that calls for clarity about the\nbenefits and drawbacks of genomic testing and editing, and requires us\nto revisit the meaning of eugenics and the problems associated with\nit.\n\n\nAs this short history should make clear, past,\nstate-run, involuntary eugenic endeavors have been unjust and socially\ndisastrous. Yet advances in genomic testing and interventions continue\nto make possible practices that have eugenic features, albeit framed\ndifferently. Prenatal testing and preimplantation genetic testing, for\ninstance, are understood to enhance reproductive choice, even as they\nare clearly used by prospective parents to determine which individuals\nshould come into existence. Should they be considered eugenic\npractices? Is that necessarily morally troubling? As technological\nadvances push us to consider what genomic variants we ought to be able\nto test for, which to choose prenatally, and which to manipulate we may\nneed to reassess our current practices, explore their justifications,\nand sort through the ways in which they are eugenic and morally\nworrisome.\n",
    "section_title": "1. Short history of eugenics",
    "entry_title": "Eugenics",
    "hierarchy_title": "Eugenics || Short history of eugenics",
    "tokenized_text": [
        "short",
        "history",
        "eugenics",
        "short",
        "history",
        "eugenics",
        "philosopher",
        "contemplated",
        "meaning",
        "value",
        "eugenics",
        "least",
        "since",
        "plato",
        "recommended",
        "staterun",
        "program",
        "mating",
        "intended",
        "strengthen",
        "guardian",
        "class",
        "republic",
        "however",
        "modern",
        "version",
        "eugenics",
        "start",
        "th",
        "century",
        "cousin",
        "charles",
        "darwin",
        "british",
        "scientist",
        "francis",
        "galton",
        "galton",
        "interested",
        "improving",
        "human",
        "stock",
        "scientific",
        "management",
        "mating",
        "explicit",
        "goal",
        "create",
        "better",
        "human",
        "idea",
        "taken",
        "widely",
        "early",
        "part",
        "th",
        "century",
        "seemingly",
        "wellintended",
        "ideologically",
        "diverse",
        "scientist",
        "policy",
        "maker",
        "particularly",
        "united",
        "state",
        "britain",
        "scandinavian",
        "country",
        "notable",
        "eugenicists",
        "included",
        "alexander",
        "graham",
        "bell",
        "margaret",
        "sanger",
        "excellent",
        "history",
        "eugenics",
        "see",
        "kevles",
        "eugenicists",
        "twofold",
        "aim",
        "encourage",
        "people",
        "various",
        "desirable",
        "trait",
        "eg",
        "health",
        "intelligence",
        "character",
        "reproduce",
        "together",
        "create",
        "good",
        "birth",
        "known",
        "positive",
        "eugenics",
        "end",
        "certain",
        "disease",
        "disability",
        "discouraging",
        "preventing",
        "characteristic",
        "considered",
        "undesirable",
        "reproducing",
        "known",
        "negative",
        "eugenics",
        "united",
        "state",
        "program",
        "encourage",
        "positive",
        "eugenics",
        "involved",
        "creation",
        "fitter",
        "family",
        "fair",
        "family",
        "competed",
        "prize",
        "local",
        "county",
        "fair",
        "much",
        "way",
        "livestock",
        "judged",
        "conformation",
        "physical",
        "dexterity",
        "stern",
        "negative",
        "eugenics",
        "took",
        "form",
        "encouraged",
        "forced",
        "sterilization",
        "men",
        "particularly",
        "woman",
        "deemed",
        "unfit",
        "reproduce",
        "language",
        "day",
        "included",
        "individual",
        "poor",
        "mentally",
        "insane",
        "feebleminded",
        "idiot",
        "drunken",
        "much",
        "eugenics",
        "ideology",
        "reductionistic",
        "nature",
        "many",
        "eugenicists",
        "assuming",
        "social",
        "behavioral",
        "condition",
        "poverty",
        "vagrancy",
        "prostitution",
        "inherited",
        "genetic",
        "trait",
        "rather",
        "shared",
        "common",
        "social",
        "situation",
        "nonetheless",
        "proponent",
        "eugenic",
        "policy",
        "aware",
        "interplay",
        "biology",
        "environment",
        "even",
        "concerned",
        "differentiating",
        "various",
        "contributory",
        "factor",
        "dyck",
        "social",
        "problem",
        "alcoholism",
        "disease",
        "related",
        "mental",
        "health",
        "understood",
        "genetic",
        "component",
        "could",
        "lead",
        "difficulty",
        "taking",
        "appropriate",
        "care",
        "child",
        "interesting",
        "discussion",
        "relevant",
        "social",
        "moral",
        "epistemology",
        "see",
        "buchanan",
        "racist",
        "sexist",
        "ableist",
        "xenophobic",
        "classist",
        "assumption",
        "pervaded",
        "discourse",
        "u",
        "instance",
        "alarm",
        "call",
        "raised",
        "lower",
        "birth",
        "rate",
        "among",
        "white",
        "protestant",
        "american",
        "compared",
        "large",
        "immigrant",
        "catholic",
        "population",
        "italian",
        "irish",
        "descent",
        "german",
        "scientist",
        "policymakers",
        "visited",
        "united",
        "state",
        "learn",
        "method",
        "nazi",
        "came",
        "power",
        "germany",
        "began",
        "eugenic",
        "policy",
        "early",
        "german",
        "policy",
        "called",
        "killing",
        "people",
        "institution",
        "whose",
        "physical",
        "mental",
        "illness",
        "deemed",
        "incurable",
        "individual",
        "considered",
        "life",
        "unworthy",
        "life",
        "lebensunwertes",
        "leben",
        "nazi",
        "also",
        "encouraged",
        "selective",
        "breeding",
        "aryan",
        "trait",
        "eg",
        "athletic",
        "blond",
        "blueeyed",
        "policy",
        "quickly",
        "expanded",
        "include",
        "ban",
        "marriage",
        "particular",
        "group",
        "forced",
        "sterilization",
        "internment",
        "concentration",
        "camp",
        "individual",
        "belonging",
        "group",
        "deemed",
        "inferior",
        "ie",
        "people",
        "disabled",
        "homosexual",
        "diagnosed",
        "psychiatric",
        "condition",
        "communist",
        "considered",
        "romagypsies",
        "andor",
        "jewish",
        "purported",
        "aim",
        "promote",
        "health",
        "german",
        "population",
        "controlling",
        "unhealthy",
        "prisoner",
        "faced",
        "extremely",
        "hard",
        "labor",
        "medical",
        "experimentation",
        "torturous",
        "designed",
        "test",
        "limit",
        "human",
        "body",
        "lifton",
        "daily",
        "degradation",
        "abuse",
        "eventually",
        "nazi",
        "escalated",
        "eugenic",
        "program",
        "final",
        "solution",
        "death",
        "camp",
        "ultimately",
        "killing",
        "six",
        "million",
        "jewish",
        "people",
        "name",
        "promoting",
        "germany",
        "health",
        "following",
        "end",
        "wwii",
        "term",
        "eugenic",
        "closely",
        "associated",
        "horrific",
        "program",
        "nazi",
        "germany",
        "eugenics",
        "society",
        "across",
        "world",
        "changed",
        "name",
        "eg",
        "american",
        "eugenics",
        "society",
        "became",
        "society",
        "study",
        "social",
        "biology",
        "tempered",
        "aim",
        "yet",
        "many",
        "practice",
        "belief",
        "continued",
        "different",
        "guise",
        "immigration",
        "policy",
        "forced",
        "sterilization",
        "population",
        "control",
        "kevles",
        "maclaren",
        "kline",
        "broberg",
        "rollhansen",
        "lombardo",
        "paul",
        "stenhouse",
        "spencer",
        "willson",
        "united",
        "state",
        "involuntary",
        "eugenic",
        "sterilization",
        "feebleminded",
        "woman",
        "variety",
        "state",
        "officially",
        "end",
        "late",
        "s",
        "may",
        "continue",
        "covertly",
        "state",
        "institution",
        "california",
        "highest",
        "rate",
        "forced",
        "sterilization",
        "widely",
        "performed",
        "prison",
        "inmate",
        "people",
        "mental",
        "institution",
        "woman",
        "considered",
        "bad",
        "mother",
        "sterilization",
        "motivated",
        "perceived",
        "individual",
        "social",
        "good",
        "grounded",
        "deepseated",
        "prejudice",
        "well",
        "scientific",
        "inaccuracy",
        "kluchin",
        "stern",
        "concept",
        "feeblemindedness",
        "historically",
        "entangled",
        "deeply",
        "problematic",
        "way",
        "idea",
        "race",
        "class",
        "gender",
        "stubblefield",
        "california",
        "joined",
        "virginia",
        "north",
        "carolina",
        "passing",
        "legislation",
        "compensate",
        "forced",
        "sterilization",
        "victim",
        "later",
        "attempt",
        "promote",
        "positive",
        "eugenics",
        "renewed",
        "creation",
        "repository",
        "germinal",
        "choice",
        "sperm",
        "bank",
        "created",
        "idea",
        "collecting",
        "sperm",
        "nobel",
        "laureate",
        "others",
        "deemed",
        "genius",
        "olympic",
        "level",
        "athlete",
        "artificial",
        "insemination",
        "ivf",
        "would",
        "thus",
        "allow",
        "woman",
        "choose",
        "reproduce",
        "men",
        "presumed",
        "highquality",
        "gene",
        "without",
        "needing",
        "form",
        "relationship",
        "although",
        "nobel",
        "prizewinners",
        "proved",
        "reluctant",
        "donate",
        "sperm",
        "bank",
        "general",
        "idea",
        "took",
        "today",
        "advance",
        "egg",
        "freezing",
        "also",
        "permitted",
        "creation",
        "egg",
        "bank",
        "print",
        "online",
        "ad",
        "college",
        "newspaper",
        "regularly",
        "request",
        "sperm",
        "egg",
        "donor",
        "meet",
        "certain",
        "qualification",
        "health",
        "intelligence",
        "athleticism",
        "andor",
        "attractiveness",
        "individual",
        "couple",
        "require",
        "gamete",
        "donation",
        "reproduce",
        "shop",
        "around",
        "donor",
        "meet",
        "desired",
        "criterion",
        "see",
        "entry",
        "donation",
        "sale",
        "human",
        "egg",
        "sperm",
        "importantly",
        "practice",
        "example",
        "positive",
        "eugenics",
        "also",
        "negative",
        "eugenics",
        "racist",
        "classist",
        "ableist",
        "prejudice",
        "underlie",
        "practice",
        "way",
        "promote",
        "negative",
        "eugenics",
        "preventing",
        "discouraging",
        "woman",
        "reproducing",
        "robert",
        "daar",
        "widespread",
        "practice",
        "prenatal",
        "genetic",
        "testing",
        "traditionally",
        "chorionic",
        "villus",
        "sampling",
        "amniocentesis",
        "second",
        "trimester",
        "pregnancy",
        "routinely",
        "done",
        "noninvasive",
        "blood",
        "test",
        "first",
        "trimester",
        "least",
        "first",
        "screen",
        "similarly",
        "present",
        "opportunity",
        "individual",
        "couple",
        "identify",
        "gene",
        "genetic",
        "marker",
        "trait",
        "prefer",
        "future",
        "child",
        "prenatal",
        "testing",
        "identifies",
        "undesired",
        "gene",
        "variant",
        "prospective",
        "parent",
        "may",
        "choose",
        "abort",
        "fetus",
        "often",
        "plan",
        "later",
        "attempt",
        "new",
        "pregnancy",
        "study",
        "suggest",
        "approximately",
        "parent",
        "terminate",
        "pregnancy",
        "identified",
        "certain",
        "disorder",
        "rothschild",
        "blakeley",
        "et",
        "al",
        "advent",
        "preimplantation",
        "genetic",
        "testing",
        "prospective",
        "parent",
        "choose",
        "use",
        "ivf",
        "test",
        "early",
        "cell",
        "created",
        "embryo",
        "identify",
        "embryo",
        "genomic",
        "variant",
        "favor",
        "prefer",
        "avoid",
        "way",
        "preclude",
        "potential",
        "need",
        "abortion",
        "choosing",
        "implant",
        "embryo",
        "contain",
        "desired",
        "gene",
        "aim",
        "practice",
        "certainly",
        "appears",
        "eugenic",
        "though",
        "without",
        "obviously",
        "coercive",
        "structure",
        "presumably",
        "directed",
        "benefiting",
        "individual",
        "family",
        "rather",
        "state",
        "profession",
        "genetic",
        "counseling",
        "started",
        "s",
        "provides",
        "prospective",
        "parent",
        "detailed",
        "information",
        "meaning",
        "test",
        "opportunity",
        "discussion",
        "test",
        "result",
        "part",
        "due",
        "concern",
        "eugenic",
        "overtone",
        "genetic",
        "counseling",
        "built",
        "policy",
        "nondirectiveness",
        "ensure",
        "reproductive",
        "autonomy",
        "prospective",
        "parent",
        "respected",
        "tenet",
        "genetic",
        "counseling",
        "challenged",
        "scholar",
        "ground",
        "impossible",
        "clarke",
        "undesirable",
        "davis",
        "dietz",
        "reynolds",
        "finally",
        "past",
        "testing",
        "method",
        "allowed",
        "identification",
        "chromosomal",
        "abnormality",
        "trisomy",
        "trisomy",
        "trisomy",
        "syndrome",
        "monogenic",
        "disorder",
        "huntington",
        "disease",
        "next",
        "generation",
        "sequencing",
        "ng",
        "technology",
        "permit",
        "unparalleled",
        "wealth",
        "information",
        "fetus",
        "embryo",
        "genome",
        "although",
        "technology",
        "yet",
        "used",
        "routinely",
        "utility",
        "assessed",
        "clinical",
        "trial",
        "expanded",
        "genomic",
        "information",
        "available",
        "prenatal",
        "testing",
        "panel",
        "prospective",
        "parent",
        "request",
        "prenatal",
        "testing",
        "addition",
        "might",
        "interest",
        "particular",
        "parent",
        "even",
        "genetic",
        "linkage",
        "particular",
        "trait",
        "le",
        "direct",
        "even",
        "mildly",
        "predictive",
        "diabetes",
        "obesity",
        "psychiatric",
        "condition",
        "bipolar",
        "disorder",
        "schizophrenia",
        "moreover",
        "new",
        "genome",
        "editing",
        "technology",
        "used",
        "modify",
        "sperm",
        "egg",
        "embryo",
        "indeed",
        "although",
        "genome",
        "editing",
        "reproductive",
        "purpose",
        "implicitly",
        "explicitly",
        "prohibited",
        "country",
        "november",
        "chinese",
        "researcher",
        "jiankui",
        "used",
        "modify",
        "human",
        "embryo",
        "kirksey",
        "team",
        "edited",
        "embryo",
        "disable",
        "genetic",
        "pathway",
        "hiv",
        "us",
        "infect",
        "cell",
        "according",
        "report",
        "three",
        "baby",
        "born",
        "edited",
        "embryo",
        "new",
        "genomic",
        "technology",
        "could",
        "provide",
        "prospective",
        "parent",
        "and",
        "others",
        "significant",
        "degree",
        "control",
        "characteristic",
        "child",
        "trait",
        "promoted",
        "deciding",
        "deal",
        "society",
        "potentially",
        "individual",
        "prospective",
        "parent",
        "monumental",
        "task",
        "call",
        "clarity",
        "benefit",
        "drawback",
        "genomic",
        "testing",
        "editing",
        "requires",
        "u",
        "revisit",
        "meaning",
        "eugenics",
        "problem",
        "associated",
        "short",
        "history",
        "make",
        "clear",
        "past",
        "staterun",
        "involuntary",
        "eugenic",
        "endeavor",
        "unjust",
        "socially",
        "disastrous",
        "yet",
        "advance",
        "genomic",
        "testing",
        "intervention",
        "continue",
        "make",
        "possible",
        "practice",
        "eugenic",
        "feature",
        "albeit",
        "framed",
        "differently",
        "prenatal",
        "testing",
        "preimplantation",
        "genetic",
        "testing",
        "instance",
        "understood",
        "enhance",
        "reproductive",
        "choice",
        "even",
        "clearly",
        "used",
        "prospective",
        "parent",
        "determine",
        "individual",
        "come",
        "existence",
        "considered",
        "eugenic",
        "practice",
        "necessarily",
        "morally",
        "troubling",
        "technological",
        "advance",
        "push",
        "u",
        "consider",
        "genomic",
        "variant",
        "ought",
        "able",
        "test",
        "choose",
        "prenatally",
        "manipulate",
        "may",
        "need",
        "reassess",
        "current",
        "practice",
        "explore",
        "justification",
        "sort",
        "way",
        "eugenic",
        "morally",
        "worrisome"
    ]
}