{
    "main_text": "Introduction\n1. Introduction\n\nWhen a person performs an act of euthanasia, she brings about the\ndeath of another person because she believes the latter’s\npresent existence is so bad that he would be better off dead, or\nbelieves that unless she intervenes and ends his life, his life will\nvery soon become so bad that he would be better off dead. Accordingly,\nthe motive of the person who performs an act of euthanasia is to\nbenefit the one whose death is brought about. (This also holds for\nmany instances of physician-assisted suicide, but use of the latter\nterm is usually restricted to forms of assistance which stop short of\nthe physician ‘bringing about the death’ of the patient,\nfor example, those involving means that have to be activated by the\npatient.)\n\nIt is important to emphasize the motive of benefiting the person who\nis assisted to die because well-being is a key value in relation to\nthe morality of euthanasia (see Section 3 below). Nonetheless, the\ndefensibility of the contention that someone can be better off dead\nhas been the subject of extensive philosophical deliberation. Those\nwho claim that a person can be better off dead believe this to be true\nwhen the life that remains in prospect for that person has no positive\nvalue for her (a possibility which is discussed by e.g., Foot, 1977;\nMcMahan 2002; Bradley 2009), whereas some of those who hold that a\nperson’s life is inviolable deny that a person can ever be\nbetter off dead (e.g., Keown in Jackson and Keown 2012). A\nKant-inspired variant on this latter position has been advanced by\nVelleman (1999). He considers that a person’s well-being can\nonly matter if she is of intrinsic value and so that it is\nimpermissible to violate a person’s rational nature (the source\nof her intrinsic value) for the sake of her well-being. Accordingly,\nhe holds that it is impermissible to assist someone to die who judges\nthat she would be better off dead and competently requests assistance\nwith dying. The only exception is when a person’s life is so\ndegraded as to call into question her rational nature, albeit he\nthinks it unlikely that anyone in that position will remain competent\nto request assistance with dying. This position appears to be at odds\nwith the well-established right of a competent patient to refuse\nlife-prolonging medical treatment, at least when further treatment is\nrefused because she considers that her life no longer has value for\nher and further treatment will not restore its value to her. (For\nfurther reasons to reject arguments for the inviolability of the life\nof a person, including Velleman’s, see e.g., McMahan 2002; Young\n2007; Sumner 2011.)\n\nBecause our concern will be with voluntary euthanasia –\nthat is, with those instances of euthanasia in which a clearly\ncompetent person makes a voluntary and enduring request to be helped\nto die (or, by extension, when an authorised proxy makes a substituted\njudgment by choosing in the manner the no-longer-competent person\nwould have chosen had he remained competent) – a second key\nvalue is the competence of the person requesting assistance with\ndying. There will be occasion to mention non-voluntary\neuthanasia – instances of euthanasia where a person lacks\nthe competence at the time when a decision is to be made to request\neuthanasia and has not previously competently declared a preference\nfor it via an advance directive (see the entry on\n advance directives)\n – only when consideration is given to the claim that permitting\nvoluntary euthanasia will lead via a slippery slope to permitting\nnon-voluntary euthanasia. Nothing will be said here about\ninvoluntary euthanasia, where a competent person’s life\nis brought to an end despite an explicit expression of opposition to\neuthanasia, beyond saying that, no matter how honorable the\nperpetrator’s motive, such a death is, and ought to be,\nunlawful.\n\nDebate about the morality and legality of voluntary euthanasia has\nbeen, for the most part, a phenomenon of the second half of the\ntwentieth century and the beginning of the twenty first century.\nCertainly, the ancient Greeks and Romans did not believe that life\nneeded to be preserved at any cost and were, in consequence, tolerant\nof suicide when no relief could be offered to a dying person or, in\nthe case of the Stoics and Epicureans, when a person no longer cared\nfor his life. In the sixteenth century, Thomas More, in describing a\nutopian community, envisaged such a community as one that would\nfacilitate the death of those whose lives had become burdensome as a\nresult of ‘torturing and lingering pain’. But it has only\nbeen in the last hundred years that there have been concerted efforts\nto make legal provision for voluntary euthanasia. Until quite recently\nthere had been no success in obtaining such legal provision (though\nassisted suicide, including, but not limited to, physician-assisted\nsuicide, has been legally tolerated in Switzerland for a number of\ndecades). However, the outlook changed dramatically in the 1970s and\n80s because of a series of court cases in The Netherlands which\nculminated in an agreement between the legal and medical authorities\nto ensure that no physician would be prosecuted for assisting a\npatient to die as long as certain guidelines were strictly adhered to\n(see Griffiths, et al., 1998). In brief, the guidelines were\nestablished to permit physicians to practise voluntary euthanasia in\nthose instances in which a competent patient had made a voluntary and\ninformed request to be helped to die, the patient’s suffering\nwas unbearable, there was no way of making that suffering bearable\nthat was acceptable to the patient, and the physician’s\njudgements as to diagnosis and prognosis were confirmed after\nconsultation with another physician.\n\nThe first legislative approval for voluntary euthanasia was achieved\nwith the passage in the parliament of Australia’s Northern\nTerritory of a bill enabling physicians to practise voluntary\neuthanasia. Subsequent to the Act’s proclamation in 1996, it\nfaced a series of legal challenges from opponents of voluntary\neuthanasia. In 1997 the challenges culminated in the Australian\nNational Parliament overturning the legislation when it prohibited\nAustralian territories from enacting legislation to permit voluntary\neuthanasia on constitutional grounds. Australia is a federation\nconsisting of six states and two territories. Unlike the territories,\nthe states do have the constitutional right to enact such legislation\nand in 2017 the state of Victoria did just that. The legislation came\ninto effect in 2019. In 2019, a second state, Western Australia,\nenacted legislation to enable voluntary medically assisted death. The\nlegislation became effective in 2021. In 2021 three further states,\nTasmania, South Australia and Queensland enacted legislation to enable\nvoluntary medically assisted death which will come into force in 2022\nfor the first two, and 2023 for the third. In 2022 NSW enacted\nlegislation which will come into force in 2023 thereby ensuring that\nvoluntary medically assisted death will be available in each of the\nstates by the end of 2023. \n\nIn November 2000, The Netherlands passed legislation to legalize the\npractice of voluntary euthanasia. The legislation passed through all\nthe parliamentary stages early in 2001. The Belgian parliament passed\nsimilar legislation in 2002 and Luxembourg followed suit in 2009. (For\na very helpful comparative study of relevant legislation see Lewis\n2007. See also Griffiths, et al. 2008.)\n\nIn Oregon in the United States, legislation was introduced in 1997 to\npermit physician-assisted suicide after a referendum strongly endorsed\nthe proposed legislation. Later in 1997 the Supreme Court of the\nUnited States ruled that there is no constitutional right to\nphysician-assisted suicide; however, the Court did not preclude\nindividual states from legislating in favor of physician-assisted\nsuicide (so the Oregon legislation was unaffected). Since that time\nthe Oregon legislation has been successfully utilised by a significant\nnumber of people and similar legislation has been passed in the state\nof Washington in 2009, in Vermont in 2013, and more recently still in\nCalifornia, Colorado, Hawaii, Maine, New Jersey, New Mexico and the\nDistrict of Columbia. A series of judicial decisions in the state of\nMontana in 2008 and 2009 established that the state could not prohibit\nphysician-assisted suicide but legislation has not yet been introduced\nto codify the legal situation. A number of the remaining states are\ncurrently considering physician-assisted suicide bills.\n\nA similar legal position to that in Montana has obtained in the nation\nof Colombia since the late 1990s as a result of a majority ruling by\nits Constitutional Court in favor of the legality of\nphysician-assisted suicide. In 2021, Spain legalized voluntary\neuthanasia. In Austria and Germany courts have authorised\nphysician-assisted suicide but no legislative backing for the practice\nhas been introduced, while in Italy legislation for voluntary\nmedically assisted death has been passed in one house of the bicameral\nparliament and in Portugal there is legislation in place for\nphysician-assisted suicide which is currently under review for its\nconstitutionality. \n\nIn Canada, the province of Quebec introduced legislation permitting\nmedical aid in dying in 2014. The legislation came into effect in 2016\nat around the same time that the Canadian National Parliament passed\nlegislation permitting both physician-assisted suicide and voluntary\neuthanasia throughout all of the Canadian federation. (For a brief\naccount of events leading up to the enactment of the various pieces of\nlegislation in the United States and in Canada see Sumner 2017.)\n\nNew Zealand held a referendum in 2019 which resulted in approval for\nthe introduction of legislation for voluntary medically assisted\ndeath. The legislation comes into effect late in 2021.\n\nWith that brief sketch of the historical background in place, we will\nproceed first to consider the conditions that those who have advocated\nmaking voluntary medically assisted death legally permissible have\ntypically insisted should be satisfied. Consideration of the proposed\nconditions will establish a framework for the moral interrogation that\nwill follow in Sections 3 and 4. Section 3 will outline the positive\nmoral case put forward by those who want voluntary euthanasia and\nphysician-assisted suicide to be legally permissible. Section 4 will\nbe devoted to scrutinising the most important of the objections that\nhave been levelled against that case by those opposed to the\nlegalization of voluntary euthanasia and physician-assisted\nsuicide.\n",
    "section_title": "1. Introduction",
    "entry_title": "Voluntary Euthanasia",
    "hierarchy_title": "Voluntary Euthanasia || Introduction",
    "tokenized_text": [
        "introduction",
        "introduction",
        "person",
        "performs",
        "act",
        "euthanasia",
        "brings",
        "death",
        "another",
        "person",
        "belief",
        "latter",
        "present",
        "existence",
        "bad",
        "would",
        "better",
        "dead",
        "belief",
        "unless",
        "intervenes",
        "end",
        "life",
        "life",
        "soon",
        "become",
        "bad",
        "would",
        "better",
        "dead",
        "accordingly",
        "motive",
        "person",
        "performs",
        "act",
        "euthanasia",
        "benefit",
        "one",
        "whose",
        "death",
        "brought",
        "also",
        "hold",
        "many",
        "instance",
        "physicianassisted",
        "suicide",
        "use",
        "latter",
        "term",
        "usually",
        "restricted",
        "form",
        "assistance",
        "stop",
        "short",
        "physician",
        "bringing",
        "death",
        "patient",
        "example",
        "involving",
        "mean",
        "activated",
        "patient",
        "important",
        "emphasize",
        "motive",
        "benefiting",
        "person",
        "assisted",
        "die",
        "wellbeing",
        "key",
        "value",
        "relation",
        "morality",
        "euthanasia",
        "see",
        "section",
        "nonetheless",
        "defensibility",
        "contention",
        "someone",
        "better",
        "dead",
        "subject",
        "extensive",
        "philosophical",
        "deliberation",
        "claim",
        "person",
        "better",
        "dead",
        "believe",
        "true",
        "life",
        "remains",
        "prospect",
        "person",
        "positive",
        "value",
        "possibility",
        "discussed",
        "eg",
        "foot",
        "mcmahan",
        "bradley",
        "whereas",
        "hold",
        "person",
        "life",
        "inviolable",
        "deny",
        "person",
        "ever",
        "better",
        "dead",
        "eg",
        "keown",
        "jackson",
        "keown",
        "kantinspired",
        "variant",
        "latter",
        "position",
        "advanced",
        "velleman",
        "considers",
        "person",
        "wellbeing",
        "matter",
        "intrinsic",
        "value",
        "impermissible",
        "violate",
        "person",
        "rational",
        "nature",
        "source",
        "intrinsic",
        "value",
        "sake",
        "wellbeing",
        "accordingly",
        "hold",
        "impermissible",
        "assist",
        "someone",
        "die",
        "judge",
        "would",
        "better",
        "dead",
        "competently",
        "request",
        "assistance",
        "dying",
        "exception",
        "person",
        "life",
        "degraded",
        "call",
        "question",
        "rational",
        "nature",
        "albeit",
        "think",
        "unlikely",
        "anyone",
        "position",
        "remain",
        "competent",
        "request",
        "assistance",
        "dying",
        "position",
        "appears",
        "odds",
        "wellestablished",
        "right",
        "competent",
        "patient",
        "refuse",
        "lifeprolonging",
        "medical",
        "treatment",
        "least",
        "treatment",
        "refused",
        "considers",
        "life",
        "longer",
        "value",
        "treatment",
        "restore",
        "value",
        "reason",
        "reject",
        "argument",
        "inviolability",
        "life",
        "person",
        "including",
        "velleman",
        "see",
        "eg",
        "mcmahan",
        "young",
        "sumner",
        "concern",
        "voluntary",
        "euthanasia",
        "instance",
        "euthanasia",
        "clearly",
        "competent",
        "person",
        "make",
        "voluntary",
        "enduring",
        "request",
        "helped",
        "die",
        "extension",
        "authorised",
        "proxy",
        "make",
        "substituted",
        "judgment",
        "choosing",
        "manner",
        "nolongercompetent",
        "person",
        "would",
        "chosen",
        "remained",
        "competent",
        "second",
        "key",
        "value",
        "competence",
        "person",
        "requesting",
        "assistance",
        "dying",
        "occasion",
        "mention",
        "nonvoluntary",
        "euthanasia",
        "instance",
        "euthanasia",
        "person",
        "lack",
        "competence",
        "time",
        "decision",
        "made",
        "request",
        "euthanasia",
        "previously",
        "competently",
        "declared",
        "preference",
        "via",
        "advance",
        "directive",
        "see",
        "entry",
        "advance",
        "directive",
        "consideration",
        "given",
        "claim",
        "permitting",
        "voluntary",
        "euthanasia",
        "lead",
        "via",
        "slippery",
        "slope",
        "permitting",
        "nonvoluntary",
        "euthanasia",
        "nothing",
        "said",
        "involuntary",
        "euthanasia",
        "competent",
        "person",
        "life",
        "brought",
        "end",
        "despite",
        "explicit",
        "expression",
        "opposition",
        "euthanasia",
        "beyond",
        "saying",
        "matter",
        "honorable",
        "perpetrator",
        "motive",
        "death",
        "ought",
        "unlawful",
        "debate",
        "morality",
        "legality",
        "voluntary",
        "euthanasia",
        "part",
        "phenomenon",
        "second",
        "half",
        "twentieth",
        "century",
        "beginning",
        "twenty",
        "first",
        "century",
        "certainly",
        "ancient",
        "greek",
        "roman",
        "believe",
        "life",
        "needed",
        "preserved",
        "cost",
        "consequence",
        "tolerant",
        "suicide",
        "relief",
        "could",
        "offered",
        "dying",
        "person",
        "case",
        "stoic",
        "epicurean",
        "person",
        "longer",
        "cared",
        "life",
        "sixteenth",
        "century",
        "thomas",
        "describing",
        "utopian",
        "community",
        "envisaged",
        "community",
        "one",
        "would",
        "facilitate",
        "death",
        "whose",
        "life",
        "become",
        "burdensome",
        "result",
        "torturing",
        "lingering",
        "pain",
        "last",
        "hundred",
        "year",
        "concerted",
        "effort",
        "make",
        "legal",
        "provision",
        "voluntary",
        "euthanasia",
        "quite",
        "recently",
        "success",
        "obtaining",
        "legal",
        "provision",
        "though",
        "assisted",
        "suicide",
        "including",
        "limited",
        "physicianassisted",
        "suicide",
        "legally",
        "tolerated",
        "switzerland",
        "number",
        "decade",
        "however",
        "outlook",
        "changed",
        "dramatically",
        "s",
        "series",
        "court",
        "case",
        "netherlands",
        "culminated",
        "agreement",
        "legal",
        "medical",
        "authority",
        "ensure",
        "physician",
        "would",
        "prosecuted",
        "assisting",
        "patient",
        "die",
        "long",
        "certain",
        "guideline",
        "strictly",
        "adhered",
        "see",
        "griffith",
        "et",
        "al",
        "brief",
        "guideline",
        "established",
        "permit",
        "physician",
        "practise",
        "voluntary",
        "euthanasia",
        "instance",
        "competent",
        "patient",
        "made",
        "voluntary",
        "informed",
        "request",
        "helped",
        "die",
        "patient",
        "suffering",
        "unbearable",
        "way",
        "making",
        "suffering",
        "bearable",
        "acceptable",
        "patient",
        "physician",
        "judgement",
        "diagnosis",
        "prognosis",
        "confirmed",
        "consultation",
        "another",
        "physician",
        "first",
        "legislative",
        "approval",
        "voluntary",
        "euthanasia",
        "achieved",
        "passage",
        "parliament",
        "australia",
        "northern",
        "territory",
        "bill",
        "enabling",
        "physician",
        "practise",
        "voluntary",
        "euthanasia",
        "subsequent",
        "act",
        "proclamation",
        "faced",
        "series",
        "legal",
        "challenge",
        "opponent",
        "voluntary",
        "euthanasia",
        "challenge",
        "culminated",
        "australian",
        "national",
        "parliament",
        "overturning",
        "legislation",
        "prohibited",
        "australian",
        "territory",
        "enacting",
        "legislation",
        "permit",
        "voluntary",
        "euthanasia",
        "constitutional",
        "ground",
        "australia",
        "federation",
        "consisting",
        "six",
        "state",
        "two",
        "territory",
        "unlike",
        "territory",
        "state",
        "constitutional",
        "right",
        "enact",
        "legislation",
        "state",
        "victoria",
        "legislation",
        "came",
        "effect",
        "second",
        "state",
        "western",
        "australia",
        "enacted",
        "legislation",
        "enable",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "legislation",
        "became",
        "effective",
        "three",
        "state",
        "tasmania",
        "south",
        "australia",
        "queensland",
        "enacted",
        "legislation",
        "enable",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "come",
        "force",
        "first",
        "two",
        "third",
        "nsw",
        "enacted",
        "legislation",
        "come",
        "force",
        "thereby",
        "ensuring",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "available",
        "state",
        "end",
        "november",
        "netherlands",
        "passed",
        "legislation",
        "legalize",
        "practice",
        "voluntary",
        "euthanasia",
        "legislation",
        "passed",
        "parliamentary",
        "stage",
        "early",
        "belgian",
        "parliament",
        "passed",
        "similar",
        "legislation",
        "luxembourg",
        "followed",
        "suit",
        "helpful",
        "comparative",
        "study",
        "relevant",
        "legislation",
        "see",
        "lewis",
        "see",
        "also",
        "griffith",
        "et",
        "al",
        "oregon",
        "united",
        "state",
        "legislation",
        "introduced",
        "permit",
        "physicianassisted",
        "suicide",
        "referendum",
        "strongly",
        "endorsed",
        "proposed",
        "legislation",
        "later",
        "supreme",
        "court",
        "united",
        "state",
        "ruled",
        "constitutional",
        "right",
        "physicianassisted",
        "suicide",
        "however",
        "court",
        "preclude",
        "individual",
        "state",
        "legislating",
        "favor",
        "physicianassisted",
        "suicide",
        "oregon",
        "legislation",
        "unaffected",
        "since",
        "time",
        "oregon",
        "legislation",
        "successfully",
        "utilised",
        "significant",
        "number",
        "people",
        "similar",
        "legislation",
        "passed",
        "state",
        "washington",
        "vermont",
        "recently",
        "still",
        "california",
        "colorado",
        "hawaii",
        "maine",
        "new",
        "jersey",
        "new",
        "mexico",
        "district",
        "columbia",
        "series",
        "judicial",
        "decision",
        "state",
        "montana",
        "established",
        "state",
        "could",
        "prohibit",
        "physicianassisted",
        "suicide",
        "legislation",
        "yet",
        "introduced",
        "codify",
        "legal",
        "situation",
        "number",
        "remaining",
        "state",
        "currently",
        "considering",
        "physicianassisted",
        "suicide",
        "bill",
        "similar",
        "legal",
        "position",
        "montana",
        "obtained",
        "nation",
        "colombia",
        "since",
        "late",
        "s",
        "result",
        "majority",
        "ruling",
        "constitutional",
        "court",
        "favor",
        "legality",
        "physicianassisted",
        "suicide",
        "spain",
        "legalized",
        "voluntary",
        "euthanasia",
        "austria",
        "germany",
        "court",
        "authorised",
        "physicianassisted",
        "suicide",
        "legislative",
        "backing",
        "practice",
        "introduced",
        "italy",
        "legislation",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "passed",
        "one",
        "house",
        "bicameral",
        "parliament",
        "portugal",
        "legislation",
        "place",
        "physicianassisted",
        "suicide",
        "currently",
        "review",
        "constitutionality",
        "canada",
        "province",
        "quebec",
        "introduced",
        "legislation",
        "permitting",
        "medical",
        "aid",
        "dying",
        "legislation",
        "came",
        "effect",
        "around",
        "time",
        "canadian",
        "national",
        "parliament",
        "passed",
        "legislation",
        "permitting",
        "physicianassisted",
        "suicide",
        "voluntary",
        "euthanasia",
        "throughout",
        "canadian",
        "federation",
        "brief",
        "account",
        "event",
        "leading",
        "enactment",
        "various",
        "piece",
        "legislation",
        "united",
        "state",
        "canada",
        "see",
        "sumner",
        "new",
        "zealand",
        "held",
        "referendum",
        "resulted",
        "approval",
        "introduction",
        "legislation",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "legislation",
        "come",
        "effect",
        "late",
        "brief",
        "sketch",
        "historical",
        "background",
        "place",
        "proceed",
        "first",
        "consider",
        "condition",
        "advocated",
        "making",
        "voluntary",
        "medically",
        "assisted",
        "death",
        "legally",
        "permissible",
        "typically",
        "insisted",
        "satisfied",
        "consideration",
        "proposed",
        "condition",
        "establish",
        "framework",
        "moral",
        "interrogation",
        "follow",
        "section",
        "section",
        "outline",
        "positive",
        "moral",
        "case",
        "put",
        "forward",
        "want",
        "voluntary",
        "euthanasia",
        "physicianassisted",
        "suicide",
        "legally",
        "permissible",
        "section",
        "devoted",
        "scrutinising",
        "important",
        "objection",
        "levelled",
        "case",
        "opposed",
        "legalization",
        "voluntary",
        "euthanasia",
        "physicianassisted",
        "suicide"
    ]
}