{
    "main_text": "Evidence as That Which Justifies Belief\n1. Evidence as That Which Justifies Belief\n\nIn any event, the concept of evidence is inseparable from that of\njustification. When we talk of ‘evidence’ in an\nepistemological sense we are talking about justification: one thing is\n‘evidence’ for another just in case the first tends to\nenhance the reasonableness or justification of the second.… A\nstrictly nonnormative concept of evidence is not our concept of\nevidence; it is something that we do not understand.\n   —Jaegwon Kim, ‘What is\n“Naturalized Epistemology”?’\n\n\n Evidence, whatever else it is, is the kind of thing which can make a\ndifference to what one is justified in believing or (what is\noften, but not always, taken to be the same thing) what it is\nreasonable for one to believe. Some philosophers hold that\nwhat one is justified in believing is entirely determined by one's\nevidence. This view—which sometimes travels under the banner of\n‘Evidentialism’—can be formulated as a supervenience\nthesis, according to which normative facts about what one is justified\nin believing supervene on facts about one's evidence (See especially\nConee and Feldman 2004). Thus, according to the Evidentialist, any two\nindividuals who possessed exactly the same evidence would be exactly\nalike with respect to what they are justified in believing about any\ngiven question.\n\n Given Evidentialism, various traditional debates within the theory of\nknowledge are naturally cast as debates about the status of various\nunderdetermination theses. Thus, the skeptic about our knowledge\nof the external world maintains that one's evidence (understood,\nperhaps, as the totality of one's present experiences) does not favor\none's ordinary, commonsense views about one's surroundings over\nvarious skeptical alternatives (e.g., the hypothesis that one is\nhallucinating in an undetectable way). Similarly, one longstanding\ncontroversy that divides realists and antirealists in the philosophy\nof science can be understood as a debate about whether the kind of\nevidence which is available to scientists is ever sufficient to\njustify belief in theories that quantify over entities that are in\nprinciple unobservable, such as electrons or quarks.\n\n Inasmuch as evidence is the sort of thing which confers\njustification, the concept of evidence is closely related to other\nfundamental normative concepts such as the concept of a\nreason. Indeed, it is natural to think that ‘reason to\nbelieve’ and ‘evidence’ are more or less synonymous,\nbeing distinguished chiefly by the fact that the former functions\ngrammatically as a count noun while the latter functions as a mass\n term.[4] \n\n To the extent that what one is justified in believing depends upon\none's evidence, what is relevant is the bearing of one's\ntotal evidence. Even if evidence E is sufficient to\njustify believing hypothesis H when considered in isolation,\nit does not follow that one who possesses evidence E is\njustified in believing H on its basis. For one might possess\nsome additional evidence E′, such that one is not\njustified in believing H given E and\nE′. In these circumstances, evidence E′\ndefeats the justification for believing H that would\nbe afforded by E in its absence. Thus, even if I am initially\njustified in believing that your name is Fritz on the basis\nof your testimony to that effect, the subsequent acquisition of\nevidence which suggests that you are a pathological liar tends to\nrender this same belief unjustified. A given piece of evidence is\ndefeasible evidence just in case it is in principle\nsusceptible to being undermined by further evidence in this way;\nevidence which is not susceptible to such undermining would be\nindefeasible evidence. It is controversial whether any\nevidence is indefeasible in this\n sense.[5]\n\n Following Pollock (1986), we can distinguish between\nundercutting and rebutting defeaters. Intuitively,\nwhere E is evidence for H, an undercutting defeater\nis evidence which undermines the evidential connection between\nE and H. Thus, evidence which suggests that you are\na pathological liar constitutes an undercutting defeater for your\ntestimony: although your testimony would ordinarily afford excellent\nreason for me to believe that your name is Fritz, evidence\nthat you are a pathological liar tends to sever the evidential\nconnection between your testimony and that to which you testify. In\ncontrast, a rebutting defeater is evidence which prevents E\nfrom justifying belief in H by supporting not-H in a\nmore direct way. Thus, credible testimony from another source that\nyour name is not Fritz but rather Leopold constitutes a rebutting\ndefeater for your original testimony. It is something of an open\nquestion how deeply the distinction between ‘undermining’\nand ‘rebutting’ defeaters cuts.\n\n Significantly, defeating evidence can itself be defeated by yet\nfurther evidence: at a still later point in time, I might acquire\nevidence E″ which suggests that you are not a\npathological liar after all, the evidence to that effect having been\nan artifice of your sworn enemy. In these circumstances, my initial\njustification for believing that your name is Fritz afforded by the\noriginal evidence E is restored. In principle, there is no\nlimit to the complexity of the relations of defeat that might obtain\nbetween the members of a given body of evidence. Such complexity is\none source of our fallibility in responding to evidence in the\nappropriate way. \n\n In order to be justified in believing some proposition then, it is\nnot enough that that proposition be well-supported by some proper\nsubset of one's total evidence; rather, what is relevant is how\nwell-supported the proposition is by one's total evidence. In\ninsisting that facts about what one is justified in believing\nsupervene on facts about one's evidence, the Evidentialist should be\nunderstood as holding that it is one's total evidence that is\nrelevant. Of course, this leaves open questions about what relation\none must bear to a piece of evidence E in order for\nE to count as part of one's total evidence, as well as the\nrelated question of what sorts of things are eligible for inclusion\namong one's total\n evidence.[6]\n\n Given the thesis that evidence is that which justifies belief, one's\nintuitions about the evidence that is available to an individual in a\nhypothetical scenario will shape one's views about what the individual\nwould be justified in believing in that scenario. Of course, one can\nalso theorize in the opposite direction as well: to the extent that\none has independent intuitions about what an individual would be\njustified in believing in a given scenario, such intuitions will shape\none's views about what evidence must be available to an individual so\nsituated—and therefore, one's views about the more general\ntheoretical issue about what evidence is, or what sorts of things can\nand cannot qualify as evidence. Thus, if one is firmly convinced that\nan individual in circumstances C might be justified in\nbelieving that p is the case, it follows immediately that\nbeing in circumstances of kind C is consistent with having\nevidence sufficient to justify the belief that p. As we will\nsee below (Section 2), reasoning of this general form has often\nencouraged a picture according to which one's total evidence is\nexhausted by one's present experiences.\n\n Here is an example of the way in which intuitions about justification\ncan drive one's account of evidence, given a commitment to the\nEvidentialist thesis that changes in what an individual is justified\nin believing always reflect changes in her total evidence. It is\nsometimes suggested that how confident a scientist is justified in\nbeing that a given hypothesis is true depends, not only on the\ncharacter of relevant data to which she has been exposed, but also on\nthe space of alternative hypotheses of which she is aware. According\nto this line of thought, how strongly a given collection of data\nsupports a hypothesis is not wholly determined by the content of the\ndata and the hypothesis. (Nor is it wholly determined by their content\ntogether with the scientist's background theory of how the world\nworks.) Rather, it also depends upon whether there are other plausible\ncompeting hypotheses in the field. It is because of this that the mere\narticulation of a plausible alternative hypothesis can dramatically\nreduce how likely the original hypothesis is on the available\n data.[7] \n\n Consider an historical example that is often thought to illustrate\nthis phenomenon. Many organisms manifest special characteristics that\nenable them to flourish in their typical environments. According to\nthe Design Hypothesis, this is due to the fact that such\norganisms were designed by an Intelligent Creator (i.e., God). The\nDesign Hypothesis is a potential explanation of the relevant facts: if\ntrue, it would account for the facts in question. How much support do\nthe relevant facts lend to the Design Hypothesis? Plausibly, the\nintroduction of the Darwinian Hypothesis as a competitor in the\nnineteenth century significantly diminished the support enjoyed by the\nDesign Hypothesis. That is, even if there were no reason to\nprefer the Darwinian Hypothesis to the Design Hypothesis, the\nmere fact that the Design Hypothesis was no longer the only potential\nexplanation in the field tends to erode (to some extent at least) how\nmuch credence the Design Hypothesis merits on the basis of the\nrelevant considerations.\n\n Assume for the sake of illustration that what one is justified in\nbelieving does in fact depend upon the space of alternative hypotheses\nof which one is aware: as new hypotheses are introduced, one's\njustification for believing already proposed hypotheses changes. Given\nthe Evidentialist thesis that differences in justification are always\nunderwritten by differences in evidence, it follows that a complete\nspecification of one's evidence at any given time will make reference\nto the set of hypotheses which one is aware of at that time. This is\nan example of the way in which intuitive judgments about what\nindividuals are justified in believing in certain circumstances, when\ncoupled with a commitment to Evidentialism, can drive one's theory of\nevidence (i.e., make a difference to which items one classifies as\n‘evidence’ in one's theorizing).\n\n The justifying or rationalizing role of evidence is also central to\nother prominent epistemological views, including views which are\nstrictly speaking incompatible with Evidentialism as formulated\nabove. Consider, for example, Bayesianism. (See the entry on\n Bayesian epistemology.)\n The Bayesian holds that what it is reasonable for one to believe\ndepends both on the evidence to which one is exposed as well as on\none's prior probability distribution. According to the Bayesian then,\ntwo individuals who share exactly the same total evidence might differ\nin what it is reasonable for them to believe about some question in\nvirtue of having started with different prior probability\ndistributions. Still, inasmuch as Bayesians often focus upon rational\nbelief change, or on what is involved in rationally revising\none's beliefs over time, the justificatory role of evidence retains a\ncertain pride of place within the Bayesian scheme. For Bayesians\ntypically maintain that that which distinguishes those changes in\none's beliefs that are reasonable from those that are not is that the\nformer, unlike the latter, involve responding to newly-acquired\nevidence in an appropriate\n way.[8]\n Thus, for the Bayesian no less than for the Evidentialist, it is\nevidence which justifies that which stands in need of justification. \n\n Notably, even views which tend to marginalize the role of a subject's\nevidence in determining facts about what he or she is justified in\nbelieving typically do not take facts about the subject's evidence to\nbe wholly irrelevant. Consider, for example, reliabilist\ntheories of epistemic justification (Goldman 1979, 1986). In its\npurest and most straightforward form, reliabilism holds that the\nstatus of a token belief as justified or unjustified depends upon\nwhether or not the psychological process which gives rise to the\nbelief is a reliable one, i.e., one that is truth-conducive. When\nformulated in this way, the concept of evidence plays no role in the\nreliabilist account of justification: in particular, the status of a\ngiven belief as justified or unjustified depends upon whether the\nrelevant belief-forming process is in fact reliable, and not on\nany evidence which the believer might possess which bears on the\nquestion of its reliability (or even, for that matter, on any evidence\nwhich the believer might possess which bears more directly on the\ntruth of the belief itself). Thus, someone who was in fact a reliable\nclairvoyant would be justified in holding beliefs that she forms on\nthe basis of clairvoyance, even if her total evidence strongly\nsuggested both that (i) she does not possess the faculty of\nclairvoyance, and that (ii) the relevant beliefs are false (BonJour\n1985, Chapter 3). However, in response to such examples, reliabilists\ntypically seek to accommodate the intuition that such a subject is not\njustified in maintaining her reliably-arrived-at beliefs in the face\nof her evidence, and they seek to modify the simple reliabilist\naccount to allow for this (See, e.g., Goldman 1986: 109–112). The felt\nneed to modify the original, more straightforward account is, perhaps,\na testament to the resilience of the idea that one's evidence can make\na difference to what one is justified in believing—even if\nother factors are also taken to be relevant.\n",
    "section_title": "1. Evidence as That Which Justifies Belief",
    "entry_title": "Evidence",
    "hierarchy_title": "Evidence || Evidence as That Which Justifies Belief",
    "tokenized_text": [
        "evidence",
        "justifies",
        "belief",
        "evidence",
        "justifies",
        "belief",
        "event",
        "concept",
        "evidence",
        "inseparable",
        "justification",
        "talk",
        "evidence",
        "epistemological",
        "sense",
        "talking",
        "justification",
        "one",
        "thing",
        "evidence",
        "another",
        "case",
        "first",
        "tends",
        "enhance",
        "reasonableness",
        "justification",
        "second",
        "strictly",
        "nonnormative",
        "concept",
        "evidence",
        "concept",
        "evidence",
        "something",
        "understand",
        "jaegwon",
        "kim",
        "naturalized",
        "epistemology",
        "evidence",
        "whatever",
        "else",
        "kind",
        "thing",
        "make",
        "difference",
        "one",
        "justified",
        "believing",
        "often",
        "always",
        "taken",
        "thing",
        "reasonable",
        "one",
        "believe",
        "philosopher",
        "hold",
        "one",
        "justified",
        "believing",
        "entirely",
        "determined",
        "one",
        "s",
        "evidence",
        "viewwhich",
        "sometimes",
        "travel",
        "banner",
        "evidentialism",
        "can",
        "formulated",
        "supervenience",
        "thesis",
        "according",
        "normative",
        "fact",
        "one",
        "justified",
        "believing",
        "supervene",
        "fact",
        "one",
        "s",
        "evidence",
        "see",
        "especially",
        "conee",
        "feldman",
        "thus",
        "according",
        "evidentialist",
        "two",
        "individual",
        "possessed",
        "exactly",
        "evidence",
        "would",
        "exactly",
        "alike",
        "respect",
        "justified",
        "believing",
        "given",
        "question",
        "given",
        "evidentialism",
        "various",
        "traditional",
        "debate",
        "within",
        "theory",
        "knowledge",
        "naturally",
        "cast",
        "debate",
        "status",
        "various",
        "underdetermination",
        "thesis",
        "thus",
        "skeptic",
        "knowledge",
        "external",
        "world",
        "maintains",
        "one",
        "s",
        "evidence",
        "understood",
        "perhaps",
        "totality",
        "one",
        "s",
        "present",
        "experience",
        "favor",
        "one",
        "s",
        "ordinary",
        "commonsense",
        "view",
        "one",
        "s",
        "surroundings",
        "various",
        "skeptical",
        "alternative",
        "eg",
        "hypothesis",
        "one",
        "hallucinating",
        "undetectable",
        "way",
        "similarly",
        "one",
        "longstanding",
        "controversy",
        "divide",
        "realist",
        "antirealists",
        "philosophy",
        "science",
        "understood",
        "debate",
        "whether",
        "kind",
        "evidence",
        "available",
        "scientist",
        "ever",
        "sufficient",
        "justify",
        "belief",
        "theory",
        "quantify",
        "entity",
        "principle",
        "unobservable",
        "electron",
        "quark",
        "inasmuch",
        "evidence",
        "sort",
        "thing",
        "confers",
        "justification",
        "concept",
        "evidence",
        "closely",
        "related",
        "fundamental",
        "normative",
        "concept",
        "concept",
        "reason",
        "indeed",
        "natural",
        "think",
        "reason",
        "believe",
        "evidence",
        "le",
        "synonymous",
        "distinguished",
        "chiefly",
        "fact",
        "former",
        "function",
        "grammatically",
        "count",
        "noun",
        "latter",
        "function",
        "mass",
        "term",
        "extent",
        "one",
        "justified",
        "believing",
        "depends",
        "upon",
        "one",
        "s",
        "evidence",
        "relevant",
        "bearing",
        "one",
        "s",
        "total",
        "evidence",
        "even",
        "evidence",
        "e",
        "sufficient",
        "justify",
        "believing",
        "hypothesis",
        "h",
        "considered",
        "isolation",
        "follow",
        "one",
        "posse",
        "evidence",
        "e",
        "justified",
        "believing",
        "h",
        "basis",
        "one",
        "might",
        "posse",
        "additional",
        "evidence",
        "e",
        "one",
        "justified",
        "believing",
        "h",
        "given",
        "e",
        "e",
        "circumstance",
        "evidence",
        "e",
        "defeat",
        "justification",
        "believing",
        "h",
        "would",
        "afforded",
        "e",
        "absence",
        "thus",
        "even",
        "initially",
        "justified",
        "believing",
        "name",
        "fritz",
        "basis",
        "testimony",
        "effect",
        "subsequent",
        "acquisition",
        "evidence",
        "suggests",
        "pathological",
        "liar",
        "tends",
        "render",
        "belief",
        "unjustified",
        "given",
        "piece",
        "evidence",
        "defeasible",
        "evidence",
        "case",
        "principle",
        "susceptible",
        "undermined",
        "evidence",
        "way",
        "evidence",
        "susceptible",
        "undermining",
        "would",
        "indefeasible",
        "evidence",
        "controversial",
        "whether",
        "evidence",
        "indefeasible",
        "sense",
        "following",
        "pollock",
        "distinguish",
        "undercutting",
        "rebutting",
        "defeaters",
        "intuitively",
        "e",
        "evidence",
        "h",
        "undercutting",
        "defeater",
        "evidence",
        "undermines",
        "evidential",
        "connection",
        "e",
        "h",
        "thus",
        "evidence",
        "suggests",
        "pathological",
        "liar",
        "constitutes",
        "undercutting",
        "defeater",
        "testimony",
        "although",
        "testimony",
        "would",
        "ordinarily",
        "afford",
        "excellent",
        "reason",
        "believe",
        "name",
        "fritz",
        "evidence",
        "pathological",
        "liar",
        "tends",
        "sever",
        "evidential",
        "connection",
        "testimony",
        "testify",
        "contrast",
        "rebutting",
        "defeater",
        "evidence",
        "prevents",
        "e",
        "justifying",
        "belief",
        "h",
        "supporting",
        "noth",
        "direct",
        "way",
        "thus",
        "credible",
        "testimony",
        "another",
        "source",
        "name",
        "fritz",
        "rather",
        "leopold",
        "constitutes",
        "rebutting",
        "defeater",
        "original",
        "testimony",
        "something",
        "open",
        "question",
        "deeply",
        "distinction",
        "undermining",
        "rebutting",
        "defeaters",
        "cut",
        "significantly",
        "defeating",
        "evidence",
        "defeated",
        "yet",
        "evidence",
        "still",
        "later",
        "point",
        "time",
        "might",
        "acquire",
        "evidence",
        "e",
        "suggests",
        "pathological",
        "liar",
        "evidence",
        "effect",
        "artifice",
        "sworn",
        "enemy",
        "circumstance",
        "initial",
        "justification",
        "believing",
        "name",
        "fritz",
        "afforded",
        "original",
        "evidence",
        "e",
        "restored",
        "principle",
        "limit",
        "complexity",
        "relation",
        "defeat",
        "might",
        "obtain",
        "member",
        "given",
        "body",
        "evidence",
        "complexity",
        "one",
        "source",
        "fallibility",
        "responding",
        "evidence",
        "appropriate",
        "way",
        "order",
        "justified",
        "believing",
        "proposition",
        "enough",
        "proposition",
        "wellsupported",
        "proper",
        "subset",
        "one",
        "s",
        "total",
        "evidence",
        "rather",
        "relevant",
        "wellsupported",
        "proposition",
        "one",
        "s",
        "total",
        "evidence",
        "insisting",
        "fact",
        "one",
        "justified",
        "believing",
        "supervene",
        "fact",
        "one",
        "s",
        "evidence",
        "evidentialist",
        "understood",
        "holding",
        "one",
        "s",
        "total",
        "evidence",
        "relevant",
        "course",
        "leaf",
        "open",
        "question",
        "relation",
        "one",
        "must",
        "bear",
        "piece",
        "evidence",
        "e",
        "order",
        "e",
        "count",
        "part",
        "one",
        "s",
        "total",
        "evidence",
        "well",
        "related",
        "question",
        "sort",
        "thing",
        "eligible",
        "inclusion",
        "among",
        "one",
        "s",
        "total",
        "evidence",
        "given",
        "thesis",
        "evidence",
        "justifies",
        "belief",
        "one",
        "s",
        "intuition",
        "evidence",
        "available",
        "individual",
        "hypothetical",
        "scenario",
        "shape",
        "one",
        "s",
        "view",
        "individual",
        "would",
        "justified",
        "believing",
        "scenario",
        "course",
        "one",
        "also",
        "theorize",
        "opposite",
        "direction",
        "well",
        "extent",
        "one",
        "independent",
        "intuition",
        "individual",
        "would",
        "justified",
        "believing",
        "given",
        "scenario",
        "intuition",
        "shape",
        "one",
        "s",
        "view",
        "evidence",
        "must",
        "available",
        "individual",
        "situatedand",
        "therefore",
        "one",
        "s",
        "view",
        "general",
        "theoretical",
        "issue",
        "evidence",
        "sort",
        "thing",
        "qualify",
        "evidence",
        "thus",
        "one",
        "firmly",
        "convinced",
        "individual",
        "circumstance",
        "c",
        "might",
        "justified",
        "believing",
        "p",
        "case",
        "follows",
        "immediately",
        "circumstance",
        "kind",
        "c",
        "consistent",
        "evidence",
        "sufficient",
        "justify",
        "belief",
        "p",
        "see",
        "section",
        "reasoning",
        "general",
        "form",
        "often",
        "encouraged",
        "picture",
        "according",
        "one",
        "s",
        "total",
        "evidence",
        "exhausted",
        "one",
        "s",
        "present",
        "experience",
        "example",
        "way",
        "intuition",
        "justification",
        "drive",
        "one",
        "s",
        "account",
        "evidence",
        "given",
        "commitment",
        "evidentialist",
        "thesis",
        "change",
        "individual",
        "justified",
        "believing",
        "always",
        "reflect",
        "change",
        "total",
        "evidence",
        "sometimes",
        "suggested",
        "confident",
        "scientist",
        "justified",
        "given",
        "hypothesis",
        "true",
        "depends",
        "character",
        "relevant",
        "data",
        "exposed",
        "also",
        "space",
        "alternative",
        "hypothesis",
        "aware",
        "according",
        "line",
        "thought",
        "strongly",
        "given",
        "collection",
        "data",
        "support",
        "hypothesis",
        "wholly",
        "determined",
        "content",
        "data",
        "hypothesis",
        "wholly",
        "determined",
        "content",
        "together",
        "scientist",
        "s",
        "background",
        "theory",
        "world",
        "work",
        "rather",
        "also",
        "depends",
        "upon",
        "whether",
        "plausible",
        "competing",
        "hypothesis",
        "field",
        "mere",
        "articulation",
        "plausible",
        "alternative",
        "hypothesis",
        "dramatically",
        "reduce",
        "likely",
        "original",
        "hypothesis",
        "available",
        "data",
        "consider",
        "historical",
        "example",
        "often",
        "thought",
        "illustrate",
        "phenomenon",
        "many",
        "organism",
        "manifest",
        "special",
        "characteristic",
        "enable",
        "flourish",
        "typical",
        "environment",
        "according",
        "design",
        "hypothesis",
        "due",
        "fact",
        "organism",
        "designed",
        "intelligent",
        "creator",
        "ie",
        "god",
        "design",
        "hypothesis",
        "potential",
        "explanation",
        "relevant",
        "fact",
        "true",
        "would",
        "account",
        "fact",
        "question",
        "much",
        "support",
        "relevant",
        "fact",
        "lend",
        "design",
        "hypothesis",
        "plausibly",
        "introduction",
        "darwinian",
        "hypothesis",
        "competitor",
        "nineteenth",
        "century",
        "significantly",
        "diminished",
        "support",
        "enjoyed",
        "design",
        "hypothesis",
        "even",
        "reason",
        "prefer",
        "darwinian",
        "hypothesis",
        "design",
        "hypothesis",
        "mere",
        "fact",
        "design",
        "hypothesis",
        "longer",
        "potential",
        "explanation",
        "field",
        "tends",
        "erode",
        "extent",
        "least",
        "much",
        "credence",
        "design",
        "hypothesis",
        "merit",
        "basis",
        "relevant",
        "consideration",
        "assume",
        "sake",
        "illustration",
        "one",
        "justified",
        "believing",
        "fact",
        "depend",
        "upon",
        "space",
        "alternative",
        "hypothesis",
        "one",
        "aware",
        "new",
        "hypothesis",
        "introduced",
        "one",
        "s",
        "justification",
        "believing",
        "already",
        "proposed",
        "hypothesis",
        "change",
        "given",
        "evidentialist",
        "thesis",
        "difference",
        "justification",
        "always",
        "underwritten",
        "difference",
        "evidence",
        "follows",
        "complete",
        "specification",
        "one",
        "s",
        "evidence",
        "given",
        "time",
        "make",
        "reference",
        "set",
        "hypothesis",
        "one",
        "aware",
        "time",
        "example",
        "way",
        "intuitive",
        "judgment",
        "individual",
        "justified",
        "believing",
        "certain",
        "circumstance",
        "coupled",
        "commitment",
        "evidentialism",
        "drive",
        "one",
        "s",
        "theory",
        "evidence",
        "ie",
        "make",
        "difference",
        "item",
        "one",
        "classifies",
        "evidence",
        "one",
        "s",
        "theorizing",
        "justifying",
        "rationalizing",
        "role",
        "evidence",
        "also",
        "central",
        "prominent",
        "epistemological",
        "view",
        "including",
        "view",
        "strictly",
        "speaking",
        "incompatible",
        "evidentialism",
        "formulated",
        "consider",
        "example",
        "bayesianism",
        "see",
        "entry",
        "bayesian",
        "epistemology",
        "bayesian",
        "hold",
        "reasonable",
        "one",
        "believe",
        "depends",
        "evidence",
        "one",
        "exposed",
        "well",
        "one",
        "s",
        "prior",
        "probability",
        "distribution",
        "according",
        "bayesian",
        "two",
        "individual",
        "share",
        "exactly",
        "total",
        "evidence",
        "might",
        "differ",
        "reasonable",
        "believe",
        "question",
        "virtue",
        "started",
        "different",
        "prior",
        "probability",
        "distribution",
        "still",
        "inasmuch",
        "bayesians",
        "often",
        "focus",
        "upon",
        "rational",
        "belief",
        "change",
        "involved",
        "rationally",
        "revising",
        "one",
        "s",
        "belief",
        "time",
        "justificatory",
        "role",
        "evidence",
        "retains",
        "certain",
        "pride",
        "place",
        "within",
        "bayesian",
        "scheme",
        "bayesians",
        "typically",
        "maintain",
        "distinguishes",
        "change",
        "one",
        "s",
        "belief",
        "reasonable",
        "former",
        "unlike",
        "latter",
        "involve",
        "responding",
        "newlyacquired",
        "evidence",
        "appropriate",
        "way",
        "thus",
        "bayesian",
        "le",
        "evidentialist",
        "evidence",
        "justifies",
        "stand",
        "need",
        "justification",
        "notably",
        "even",
        "view",
        "tend",
        "marginalize",
        "role",
        "subject",
        "s",
        "evidence",
        "determining",
        "fact",
        "justified",
        "believing",
        "typically",
        "take",
        "fact",
        "subject",
        "s",
        "evidence",
        "wholly",
        "irrelevant",
        "consider",
        "example",
        "reliabilist",
        "theory",
        "epistemic",
        "justification",
        "goldman",
        "purest",
        "straightforward",
        "form",
        "reliabilism",
        "hold",
        "status",
        "token",
        "belief",
        "justified",
        "unjustified",
        "depends",
        "upon",
        "whether",
        "psychological",
        "process",
        "give",
        "rise",
        "belief",
        "reliable",
        "one",
        "ie",
        "one",
        "truthconducive",
        "formulated",
        "way",
        "concept",
        "evidence",
        "play",
        "role",
        "reliabilist",
        "account",
        "justification",
        "particular",
        "status",
        "given",
        "belief",
        "justified",
        "unjustified",
        "depends",
        "upon",
        "whether",
        "relevant",
        "beliefforming",
        "process",
        "fact",
        "reliable",
        "evidence",
        "believer",
        "might",
        "posse",
        "bear",
        "question",
        "reliability",
        "even",
        "matter",
        "evidence",
        "believer",
        "might",
        "posse",
        "bear",
        "directly",
        "truth",
        "belief",
        "thus",
        "someone",
        "fact",
        "reliable",
        "clairvoyant",
        "would",
        "justified",
        "holding",
        "belief",
        "form",
        "basis",
        "clairvoyance",
        "even",
        "total",
        "evidence",
        "strongly",
        "suggested",
        "posse",
        "faculty",
        "clairvoyance",
        "ii",
        "relevant",
        "belief",
        "false",
        "bonjour",
        "chapter",
        "however",
        "response",
        "example",
        "reliabilists",
        "typically",
        "seek",
        "accommodate",
        "intuition",
        "subject",
        "justified",
        "maintaining",
        "reliablyarrivedat",
        "belief",
        "face",
        "evidence",
        "seek",
        "modify",
        "simple",
        "reliabilist",
        "account",
        "allow",
        "see",
        "eg",
        "goldman",
        "felt",
        "need",
        "modify",
        "original",
        "straightforward",
        "account",
        "perhaps",
        "testament",
        "resilience",
        "idea",
        "one",
        "s",
        "evidence",
        "make",
        "difference",
        "one",
        "justified",
        "believingeven",
        "factor",
        "also",
        "taken",
        "relevant"
    ]
}