{
    "main_text": "Inductive Versions of the Argument from Evil || Inductive Logic and the Evidential Argument from Evil\n3.5 Inductive Logic and the Evidential Argument from Evil\n\nIn section 3.2.1, a concrete, deontological, and direct inductive\nformulation of the argument from evil was set out.  All of the steps\nin that argument were deductive, except for the following crucial\ninference:\n\nThere are events in our world — such as an animal’s dying an agonizing death in a forest fire, and a child’s undergo lingering suffering and eventual death due to cancer — such that the actions of allowing those events, when one could prevent them, both (a) have very serious, known wrongmaking characteristics, and (b) have no rightmaking characteristics of which we are aware that are sufficient to balance out the known wrongmaking properties.\n\n\nTherefore it is likely that:\n\nFor any such action, the totality of the wrongmaking properties, both known and unknown, outweighs the totality of the rightmaking properties, both known and unknown.\n\n\nThe question, accordingly, is whether this inductive step is\ncorrect.\nEssentially, there are three ways in which one might attempt to\ndefend this inference. One is by treating it as a case of instantial\ngeneralization. But as we saw in effect in section 3.2.3, when we\nconsidered a formulation of the evidential argument from evil advanced\nby William Rowe, it appears that the inductive step in the argument\nfrom evil cannot be defended by appealing to instantial\ngeneralization.\nA second approach is to view that inductive step as a matter of\ninference to the best explanation, and this is a more promising\npossibility.  That approach would lead to an argument of the general\nform advanced by David Hume and Paul Draper, considered in\nsection.\nThere is, however, a third possibility, which is the focus of the\npresent section.  Underlying this approach are two general ideas: the\nfirst is that both induction via instantial generalization and\ninference to the best explanation (abduction, the method of\nhypothesis, hypothetico-deductive method) stand in need of\njustification; the second idea is that at the heart of such a\njustification will be the defense of an account of logical\nprobability.\nThe fundamental idea, accordingly, is that the way to determine\nwhether the inductive step that lies at the heart of the evidential\nargument from evil is sound is by bringing serious inductive\nlogic—understood as a theory of logical probability—to\nbear upon the question.\nWhat is the appropriate theory of logical probability?  Tooley\n(2008 and 2012) employs a Carnapian theory in which the basic\nequiprobability assumption is formulated in terms of what are called\n‘structure descriptions’, and the fundamental postulate is that all\nstructure descriptions are equally likely. But if one holds, as Tooley\n(1977 and 1987) does, that governing laws are logically possible, then\nit is clear that the fundamental equiprobability assumption needs to\nbe formulated in terms of governing laws of nature. At present,\nhowever, no detailed formulation of such an approach to logical\nprobability is available.\n3.5.1 An Illustration of the General Underlying Idea\n To establish that the inductive step in the version of the\nevidential argument from evil set out above is sound requires a rather\ntechnical argument in inductive logic.  But one can gain an intuitive\nunderstanding of the underlying idea in the following way.  Suppose\nthat there is a rightmaking property of which we have no knowledge.\nIf an action of allowing a child to be brutally killed possessed that\nproperty, then it might not be wrong to allow that action, depending\nupon the weightiness of that unknown rightmaking property.  But the\nexistence of unknown rightmaking properties is no more likely, a\npriori, than of unknown wrongmaking properties.  So let us suppose,\nthen, for this illustration, that there are two morally significant\nproperties of which we humans have no knowledge—a rightmaking\nproperty \\(R\\), and a wrongmaking property \\(W\\).  Let us\nsuppose, further, that these two properties are equally weighty,\nsince, a priori, there is no reason for supposing that one is more\nsignificant than the other.  Finally, let \\(A\\) be an action of\nknowingly allowing a child to be brutally killed, and let us suppose\nthat the unknown morally significant rightmaking property \\(R\\)\nis weightier than the wrongmaking property of knowingly allowing a\nchild to be brutally killed.  One can then see that there are the\nfollowing four possibilities:\n\n Action \\(A\\) has both unknown properties, \\(R\\) and\n\\(W\\).  In this case, those two unknown properties cancel one\nanother out, and action \\(A\\) will be morally wrong, all things\nconsidered.\n Action \\(A\\) has the unknown rightmaking property\n\\(R\\), but not the unknown wrongmaking property \\(W\\).  In\nthis case, action \\(A\\) may be morally permissible, all things\nconsidered, on the assumption that property \\(R\\) is\nsufficiently strong to outweigh the known wrongmaking property of\nallowing a child to be brutally killed.\n Action \\(A\\) has the unknown wrongmaking property\n\\(W\\), but not the unknown rightmaking property \\(R\\).  In\nthis case, action \\(A\\) is even more wrong, all things\nconsidered, than it initially appeared to be.\n Action \\(A\\) does not have either of the unknown, morally\nsignificant properties, \\(R\\) and \\(W\\).  In this case\naction \\(A\\) is morally wrong to precisely the degree that it\ninitially appeared to be.\n\n\nThe upshot is that in this simplified example, at least three of the\nfour possibilities that we have considered are such that action\n\\(A\\) turns out to be morally wrong, all things considered.\nThe intuitive idea, then, is that if one has an action that, given\nonly its known rightmaking and wrongmaking properties, is an action\nthat it would be morally wrong to perform, then it is more likely than\nnot it is also an action that it would be morally wrong to perform,\ngiven the totality of its morally significant properties, both\nknown and unknown.\nBut what underlies this intuitive idea? The answer is a certain\nvery fundamental and very plausible equiprobability principle, to the\neffect that if one has a family of mutually exclusive properties, and\nif \\(P\\) and \\(Q\\) are any two members of that family, then\nthe a priori probability that something has property\n\\(P\\) is equal to the a priori probability that that\nthing has property \\(Q\\). For then given that principle, one can\nconsider the family of second order properties that contains the\nsecond-order property of being a rightmaking property and the\nsecond-order property of being a wrongmaking property, and then the\nequiprobability principle in question entails that the a\npriori probability that a given property \\(P\\) has the\nsecond-order property of being a rightmaking property is equal to the\na priori probability that property \\(P\\) has the\nsecond-order property of being a wrongmaking property. Similarly, if\none considers instead the family of properties that contains, for\nexample, the second-order property of being a rightmaking property of\nweight \\(W\\) and the second-order property of being a wrongmaking\nproperty of weight \\(W\\), the a priori probability that\na given property \\(P\\) has the first of those second-order\nproperties is equal to the a priori probability that property\n\\(P\\) has the second of those properties.\nThe upshot is that given an action that would be morally wrong if\njudged only by its known morally significant properties, every\npossibility of a combination of unknown rightmaking and wrongmaking\nproperties that would make that action morally right all things\nconsidered would be precisely counterbalanced by a combination of\nunknown rightmaking and wrongmaking properties that would make that\naction morally even more wrong, all things considered.  But, in\naddition, there can be combinations of unknown rightmaking and\nwrongmaking properties that would move an action in the\ndirection of being morally right all things considered, but not\nsufficiently far to make it morally right all things\nconsidered. Finally, there is the possibility that the action has no\nunknown morally significant properties.\n Consequently, if an action is one that it would be morally wrong\nto perform, if judged only by its known morally significant\nproperties, then it is more likely than not that it is one that it is\nmorally wrong to perform given the totality of its morally significant\nproperties, both known and unknown.\nThen, the probability that, judged in the light of all rightmaking\nand wrongmaking properties, known and unknown, it would not be morally\nwrong to allow the event in question must be less than \\(\\frac{1}{2}\\).\n\nThe upshot is that the probabilistic inference that is involved in the\nmove from statement (1) to statement (2) in the argument set out above\nin section 3.2.1 is inductively sound.\n\n3.5.2 The Formal Result\nHow is the formal calculation carried out? The answer is somewhat\ncomplicated, and there are slightly different ways of doing it, as in\n(Tooley 2008 and 2012b), with the method used in the latter case being\nperhaps slightly more perspicuous, but with both methods generating\nthe same result. The key in both cases, moreover, is to make\nassumptions that increase the probability that an action that is\nmorally wrong as judged only by its known rightmaking and wrongmaking\nproperties is morally right relative to the totality of its morally\nsignificant properties, both known and unknown. In the absence of\nthose ‘probability-increasing’ assumptions, it is not at\nall clear how the calculation could be carried out.\nIn the case where one focuses only upon a single action whose known\nwrongmaking properties outweigh its known rightmaking properties, the\nresult is as one would expect, namely, that the probability that the\naction in question is not morally wrong relative to the totality of\nits morally significant properties, both known and unknown, must be\nless than one half.\nBut what is the general result? Suppose, for example, that there\nare \\(n\\) events, each of which is such that, judged simply by\nknown rightmaking and wrongmaking properties, it would be morally\nwrong to allow that event. What is the probability that none\nof those \\(n\\) events is such that it would be morally wrong to\nallow that event, judged in the light of all rightmaking and\nwrongmaking properties, both known and unknown?\nThe answer is arrived at by proving the following theorem dealing\nwith the case where there are precisely \\(k\\) unknown morally\nsignificant properties:\nIf there are \\(k\\) unknown morally significant properties,\nthen given \\(n\\) events, each of which is such that, judged\nsimply by known rightmaking and wrongmaking properties, it would be\nmorally wrong to allow that event, the probability that none of those\nevents is such that it is morally wrong to allow that event, judged in\nthe light of all rightmaking and wrongmaking properties, known and\nunknown, must be less than \n\\[\n\\notag\n\\left( \\dfrac{k}{k+1} \\right) \\left( \\dfrac{1}{n+1} \\right) \\,.\n\\]\n\nAs one can see, this upper bound on the probability that it is not\nmorally wrong to allow any of the \\(n\\) events increases as \\(k\\),\nthe number of unknown morally significant properties, increases, and\nas \\(k\\) increases without limit, it will tend to the limit of\n\\(\\frac{1}{n+1}\\).\nOne therefore has the following theorem:\nGiven \\(k\\) events, each of which is such that,\njudged simply by known rightmaking and wrongmaking properties, it\nwould be morally wrong to allow that event, the probability that none\nof those events is such that it is morally wrong to allow that event,\njudged in the light of all rightmaking and wrongmaking properties,\nboth known and unknown, must be less than \\(\\frac{1}{n+1}\\).\n\n3.5.3 The Argument from Evil: A Quantitative Result\nThis approach arguably has two advantages over alternative accounts\nof the inductive step that lies at the heart of the argument from\nevil. One is that in bringing in an equiprobability principle, one is\napproaching the issue at a more fundamental level than any approach\nthat appeals either to instantial generalization or inference to the\nbest explanation. The other is that this approach generates a result that enables\none not just to conclude that it is more likely than not that God does\nnot exist, but also to assign an upper bound to the probability that\nGod exists.\nThe upper bound, moreover, is surely very low indeed, for of the\nbillions of people and sentient non-persons who have existed, the\nproportion who have had the good fortune never to have suffered in\nways such that the known wrongmaking properties of allowing such\nsuffering outweighed the known rightmaking properties must be small.\nAccordingly, \\(n\\) must be extremely large, and thus the\nprobability that there is an omnipotent, omniscient, and morally\nperfect person must be very low indeed.\n",
    "section_title": "3.5 Inductive Logic and the Evidential Argument from Evil",
    "entry_title": "The Problem of Evil",
    "hierarchy_title": "The Problem of Evil || Inductive Versions of the Argument from Evil || Inductive Logic and the Evidential Argument from Evil",
    "tokenized_text": [
        "inductive",
        "version",
        "argument",
        "evil",
        "inductive",
        "logic",
        "evidential",
        "argument",
        "evil",
        "inductive",
        "logic",
        "evidential",
        "argument",
        "evil",
        "section",
        "concrete",
        "deontological",
        "direct",
        "inductive",
        "formulation",
        "argument",
        "evil",
        "set",
        "step",
        "argument",
        "deductive",
        "except",
        "following",
        "crucial",
        "inference",
        "event",
        "world",
        "animal",
        "dying",
        "agonizing",
        "death",
        "forest",
        "fire",
        "child",
        "undergo",
        "lingering",
        "suffering",
        "eventual",
        "death",
        "due",
        "cancer",
        "action",
        "allowing",
        "event",
        "one",
        "could",
        "prevent",
        "serious",
        "known",
        "wrongmaking",
        "characteristic",
        "b",
        "rightmaking",
        "characteristic",
        "aware",
        "sufficient",
        "balance",
        "known",
        "wrongmaking",
        "property",
        "therefore",
        "likely",
        "action",
        "totality",
        "wrongmaking",
        "property",
        "known",
        "unknown",
        "outweighs",
        "totality",
        "rightmaking",
        "property",
        "known",
        "unknown",
        "question",
        "accordingly",
        "whether",
        "inductive",
        "step",
        "correct",
        "essentially",
        "three",
        "way",
        "one",
        "might",
        "attempt",
        "defend",
        "inference",
        "one",
        "treating",
        "case",
        "instantial",
        "generalization",
        "saw",
        "effect",
        "section",
        "considered",
        "formulation",
        "evidential",
        "argument",
        "evil",
        "advanced",
        "william",
        "rowe",
        "appears",
        "inductive",
        "step",
        "argument",
        "evil",
        "defended",
        "appealing",
        "instantial",
        "generalization",
        "second",
        "approach",
        "view",
        "inductive",
        "step",
        "matter",
        "inference",
        "best",
        "explanation",
        "promising",
        "possibility",
        "approach",
        "would",
        "lead",
        "argument",
        "general",
        "form",
        "advanced",
        "david",
        "hume",
        "paul",
        "draper",
        "considered",
        "section",
        "however",
        "third",
        "possibility",
        "focus",
        "present",
        "section",
        "underlying",
        "approach",
        "two",
        "general",
        "idea",
        "first",
        "induction",
        "via",
        "instantial",
        "generalization",
        "inference",
        "best",
        "explanation",
        "abduction",
        "method",
        "hypothesis",
        "hypotheticodeductive",
        "method",
        "stand",
        "need",
        "justification",
        "second",
        "idea",
        "heart",
        "justification",
        "defense",
        "account",
        "logical",
        "probability",
        "fundamental",
        "idea",
        "accordingly",
        "way",
        "determine",
        "whether",
        "inductive",
        "step",
        "lie",
        "heart",
        "evidential",
        "argument",
        "evil",
        "sound",
        "bringing",
        "serious",
        "inductive",
        "logicunderstood",
        "theory",
        "logical",
        "probabilityto",
        "bear",
        "upon",
        "question",
        "appropriate",
        "theory",
        "logical",
        "probability",
        "tooley",
        "employ",
        "carnapian",
        "theory",
        "basic",
        "equiprobability",
        "assumption",
        "formulated",
        "term",
        "called",
        "structure",
        "description",
        "fundamental",
        "postulate",
        "structure",
        "description",
        "equally",
        "likely",
        "one",
        "hold",
        "tooley",
        "governing",
        "law",
        "logically",
        "possible",
        "clear",
        "fundamental",
        "equiprobability",
        "assumption",
        "need",
        "formulated",
        "term",
        "governing",
        "law",
        "nature",
        "present",
        "however",
        "detailed",
        "formulation",
        "approach",
        "logical",
        "probability",
        "available",
        "illustration",
        "general",
        "underlying",
        "idea",
        "establish",
        "inductive",
        "step",
        "version",
        "evidential",
        "argument",
        "evil",
        "set",
        "sound",
        "requires",
        "rather",
        "technical",
        "argument",
        "inductive",
        "logic",
        "one",
        "gain",
        "intuitive",
        "understanding",
        "underlying",
        "idea",
        "following",
        "way",
        "suppose",
        "rightmaking",
        "property",
        "knowledge",
        "action",
        "allowing",
        "child",
        "brutally",
        "killed",
        "possessed",
        "property",
        "might",
        "wrong",
        "allow",
        "action",
        "depending",
        "upon",
        "weightiness",
        "unknown",
        "rightmaking",
        "property",
        "existence",
        "unknown",
        "rightmaking",
        "property",
        "likely",
        "priori",
        "unknown",
        "wrongmaking",
        "property",
        "let",
        "u",
        "suppose",
        "illustration",
        "two",
        "morally",
        "significant",
        "property",
        "human",
        "knowledgea",
        "rightmaking",
        "property",
        "r",
        "wrongmaking",
        "property",
        "w",
        "let",
        "u",
        "suppose",
        "two",
        "property",
        "equally",
        "weighty",
        "since",
        "priori",
        "reason",
        "supposing",
        "one",
        "significant",
        "finally",
        "let",
        "a",
        "action",
        "knowingly",
        "allowing",
        "child",
        "brutally",
        "killed",
        "let",
        "u",
        "suppose",
        "unknown",
        "morally",
        "significant",
        "rightmaking",
        "property",
        "r",
        "weightier",
        "wrongmaking",
        "property",
        "knowingly",
        "allowing",
        "child",
        "brutally",
        "killed",
        "one",
        "see",
        "following",
        "four",
        "possibility",
        "action",
        "a",
        "unknown",
        "property",
        "r",
        "w",
        "case",
        "two",
        "unknown",
        "property",
        "cancel",
        "one",
        "another",
        "action",
        "a",
        "morally",
        "wrong",
        "thing",
        "considered",
        "action",
        "a",
        "unknown",
        "rightmaking",
        "property",
        "r",
        "unknown",
        "wrongmaking",
        "property",
        "w",
        "case",
        "action",
        "a",
        "may",
        "morally",
        "permissible",
        "thing",
        "considered",
        "assumption",
        "property",
        "r",
        "sufficiently",
        "strong",
        "outweigh",
        "known",
        "wrongmaking",
        "property",
        "allowing",
        "child",
        "brutally",
        "killed",
        "action",
        "a",
        "unknown",
        "wrongmaking",
        "property",
        "w",
        "unknown",
        "rightmaking",
        "property",
        "r",
        "case",
        "action",
        "a",
        "even",
        "wrong",
        "thing",
        "considered",
        "initially",
        "appeared",
        "action",
        "a",
        "either",
        "unknown",
        "morally",
        "significant",
        "property",
        "r",
        "w",
        "case",
        "action",
        "a",
        "morally",
        "wrong",
        "precisely",
        "degree",
        "initially",
        "appeared",
        "upshot",
        "simplified",
        "example",
        "least",
        "three",
        "four",
        "possibility",
        "considered",
        "action",
        "a",
        "turn",
        "morally",
        "wrong",
        "thing",
        "considered",
        "intuitive",
        "idea",
        "one",
        "action",
        "given",
        "known",
        "rightmaking",
        "wrongmaking",
        "property",
        "action",
        "would",
        "morally",
        "wrong",
        "perform",
        "likely",
        "also",
        "action",
        "would",
        "morally",
        "wrong",
        "perform",
        "given",
        "totality",
        "morally",
        "significant",
        "property",
        "known",
        "unknown",
        "underlies",
        "intuitive",
        "idea",
        "answer",
        "certain",
        "fundamental",
        "plausible",
        "equiprobability",
        "principle",
        "effect",
        "one",
        "family",
        "mutually",
        "exclusive",
        "property",
        "p",
        "q",
        "two",
        "member",
        "family",
        "priori",
        "probability",
        "something",
        "property",
        "p",
        "equal",
        "priori",
        "probability",
        "thing",
        "property",
        "q",
        "given",
        "principle",
        "one",
        "consider",
        "family",
        "second",
        "order",
        "property",
        "contains",
        "secondorder",
        "property",
        "rightmaking",
        "property",
        "secondorder",
        "property",
        "wrongmaking",
        "property",
        "equiprobability",
        "principle",
        "question",
        "entail",
        "priori",
        "probability",
        "given",
        "property",
        "p",
        "secondorder",
        "property",
        "rightmaking",
        "property",
        "equal",
        "priori",
        "probability",
        "property",
        "p",
        "secondorder",
        "property",
        "wrongmaking",
        "property",
        "similarly",
        "one",
        "considers",
        "instead",
        "family",
        "property",
        "contains",
        "example",
        "secondorder",
        "property",
        "rightmaking",
        "property",
        "weight",
        "w",
        "secondorder",
        "property",
        "wrongmaking",
        "property",
        "weight",
        "w",
        "priori",
        "probability",
        "given",
        "property",
        "p",
        "first",
        "secondorder",
        "property",
        "equal",
        "priori",
        "probability",
        "property",
        "p",
        "second",
        "property",
        "upshot",
        "given",
        "action",
        "would",
        "morally",
        "wrong",
        "judged",
        "known",
        "morally",
        "significant",
        "property",
        "every",
        "possibility",
        "combination",
        "unknown",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "make",
        "action",
        "morally",
        "right",
        "thing",
        "considered",
        "would",
        "precisely",
        "counterbalanced",
        "combination",
        "unknown",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "make",
        "action",
        "morally",
        "even",
        "wrong",
        "thing",
        "considered",
        "addition",
        "combination",
        "unknown",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "move",
        "action",
        "direction",
        "morally",
        "right",
        "thing",
        "considered",
        "sufficiently",
        "far",
        "make",
        "morally",
        "right",
        "thing",
        "considered",
        "finally",
        "possibility",
        "action",
        "unknown",
        "morally",
        "significant",
        "property",
        "consequently",
        "action",
        "one",
        "would",
        "morally",
        "wrong",
        "perform",
        "judged",
        "known",
        "morally",
        "significant",
        "property",
        "likely",
        "one",
        "morally",
        "wrong",
        "perform",
        "given",
        "totality",
        "morally",
        "significant",
        "property",
        "known",
        "unknown",
        "probability",
        "judged",
        "light",
        "rightmaking",
        "wrongmaking",
        "property",
        "known",
        "unknown",
        "would",
        "morally",
        "wrong",
        "allow",
        "event",
        "question",
        "must",
        "le",
        "frac",
        "upshot",
        "probabilistic",
        "inference",
        "involved",
        "move",
        "statement",
        "statement",
        "argument",
        "set",
        "section",
        "inductively",
        "sound",
        "formal",
        "result",
        "formal",
        "calculation",
        "carried",
        "answer",
        "somewhat",
        "complicated",
        "slightly",
        "different",
        "way",
        "tooley",
        "b",
        "method",
        "used",
        "latter",
        "case",
        "perhaps",
        "slightly",
        "perspicuous",
        "method",
        "generating",
        "result",
        "key",
        "case",
        "moreover",
        "make",
        "assumption",
        "increase",
        "probability",
        "action",
        "morally",
        "wrong",
        "judged",
        "known",
        "rightmaking",
        "wrongmaking",
        "property",
        "morally",
        "right",
        "relative",
        "totality",
        "morally",
        "significant",
        "property",
        "known",
        "unknown",
        "absence",
        "probabilityincreasing",
        "assumption",
        "clear",
        "calculation",
        "could",
        "carried",
        "case",
        "one",
        "focus",
        "upon",
        "single",
        "action",
        "whose",
        "known",
        "wrongmaking",
        "property",
        "outweigh",
        "known",
        "rightmaking",
        "property",
        "result",
        "one",
        "would",
        "expect",
        "namely",
        "probability",
        "action",
        "question",
        "morally",
        "wrong",
        "relative",
        "totality",
        "morally",
        "significant",
        "property",
        "known",
        "unknown",
        "must",
        "le",
        "one",
        "half",
        "general",
        "result",
        "suppose",
        "example",
        "n",
        "event",
        "judged",
        "simply",
        "known",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "morally",
        "wrong",
        "allow",
        "event",
        "probability",
        "none",
        "n",
        "event",
        "would",
        "morally",
        "wrong",
        "allow",
        "event",
        "judged",
        "light",
        "rightmaking",
        "wrongmaking",
        "property",
        "known",
        "unknown",
        "answer",
        "arrived",
        "proving",
        "following",
        "theorem",
        "dealing",
        "case",
        "precisely",
        "k",
        "unknown",
        "morally",
        "significant",
        "property",
        "k",
        "unknown",
        "morally",
        "significant",
        "property",
        "given",
        "n",
        "event",
        "judged",
        "simply",
        "known",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "morally",
        "wrong",
        "allow",
        "event",
        "probability",
        "none",
        "event",
        "morally",
        "wrong",
        "allow",
        "event",
        "judged",
        "light",
        "rightmaking",
        "wrongmaking",
        "property",
        "known",
        "unknown",
        "must",
        "le",
        "notag",
        "left",
        "dfrac",
        "k",
        "k",
        "right",
        "left",
        "dfrac",
        "n",
        "right",
        "one",
        "see",
        "upper",
        "bound",
        "probability",
        "morally",
        "wrong",
        "allow",
        "n",
        "event",
        "increase",
        "k",
        "number",
        "unknown",
        "morally",
        "significant",
        "property",
        "increase",
        "k",
        "increase",
        "without",
        "limit",
        "tend",
        "limit",
        "frac",
        "n",
        "one",
        "therefore",
        "following",
        "theorem",
        "given",
        "k",
        "event",
        "judged",
        "simply",
        "known",
        "rightmaking",
        "wrongmaking",
        "property",
        "would",
        "morally",
        "wrong",
        "allow",
        "event",
        "probability",
        "none",
        "event",
        "morally",
        "wrong",
        "allow",
        "event",
        "judged",
        "light",
        "rightmaking",
        "wrongmaking",
        "property",
        "known",
        "unknown",
        "must",
        "le",
        "frac",
        "n",
        "argument",
        "evil",
        "quantitative",
        "result",
        "approach",
        "arguably",
        "two",
        "advantage",
        "alternative",
        "account",
        "inductive",
        "step",
        "lie",
        "heart",
        "argument",
        "evil",
        "one",
        "bringing",
        "equiprobability",
        "principle",
        "one",
        "approaching",
        "issue",
        "fundamental",
        "level",
        "approach",
        "appeal",
        "either",
        "instantial",
        "generalization",
        "inference",
        "best",
        "explanation",
        "approach",
        "generates",
        "result",
        "enables",
        "one",
        "conclude",
        "likely",
        "god",
        "exist",
        "also",
        "assign",
        "upper",
        "bound",
        "probability",
        "god",
        "exists",
        "upper",
        "bound",
        "moreover",
        "surely",
        "low",
        "indeed",
        "billion",
        "people",
        "sentient",
        "nonpersons",
        "existed",
        "proportion",
        "good",
        "fortune",
        "never",
        "suffered",
        "way",
        "known",
        "wrongmaking",
        "property",
        "allowing",
        "suffering",
        "outweighed",
        "known",
        "rightmaking",
        "property",
        "must",
        "small",
        "accordingly",
        "n",
        "must",
        "extremely",
        "large",
        "thus",
        "probability",
        "omnipotent",
        "omniscient",
        "morally",
        "perfect",
        "person",
        "must",
        "low",
        "indeed"
    ]
}