{
    "main_text": "Responses to the Argument from Evil: Refutations, Theodicies, and Defenses\n4. Responses to the Argument from Evil: Refutations, Theodicies, and Defenses\n\nGiven an evidential formulation of the evidential argument from evil,\nwhat sorts of responses are possible? A natural way of dividing up\npossible responses is into what may be referred to as total\nrefutations, theodicies, and defenses. So let us begin by considering\nwhat is involved in these three different, general types of\nresponses.\n\nThis threefold classification can be arrived at by the following line\nof thought. An advocate of the argument from evil is claiming, in the\nfirst place, that there are facts about the evils in the world that\nmake it prima facie unreasonable to believe in the existence\nof God, and, in the second place, that the situation is not altered\nwhen those facts are conjoined with all the other things that one is\njustified in believing, both inferentially and non-inferentially, so\nthat belief in the existence of God is also unreasonable relative\nto the total evidence available, together with all relevant basis\nstates. In responding to the argument from evil, then, one might\nchallenge either of these claims. That is to say, one might grant, at\nleast for the sake of argument, that there are facts about evil that,\nother things being equal, render belief in God unreasonable, but then\nargue that when those considerations are embedded within one’s total\nepistemic situation, belief in the existence of God can be seen to be\nreasonable, all things considered. Alternatively, one might defend the\nmore radical thesis that there are no facts about evil in the world\nthat make it even prima facie unreasonable to believe in the\nexistence of God.\n\n \nIf the latter thesis is correct, the argument from evil does not even\nget started.  Such responses to the argument from evil are naturally\nclassified, therefore, as attempted, total refutations of\nthe argument.\n\nThe proposition that relevant facts about evil do not make it even\nprima facie unreasonable to believe in the existence of God\nprobably strikes most philosophers, of course, as rather implausible.\nWe shall see, however, that a number of philosophical theists have\nattempted to defend this type of response to the argument from\nevil.\n\nThe alternative course is to grant that there are facts about\nintrinsically undesirable states of the world that make it prima\nfacie unreasonable to believe that God exists, but then to argue\nthat belief in the existence of God is not unreasonable, all things\nconsidered.  This response may take, however, two slightly different\nforms.  One possibility is the offering of a complete\ntheodicy.  As I shall use that term, this involves the\nthesis that, for every actual evil found in the world, one can\ndescribe some state of affairs that it is reasonable to believe\nexists, and which is such that, if it exists, will provide an\nomnipotent and omniscient being with a morally sufficient reason for\nallowing the evil in question.  \n\nIt should be noted here that the term “theodicy” is\nsometimes used in a stronger sense, according to which a person who\noffers a theodicy is attempting to show not only that such morally\nsufficient reasons exist, but that the reasons cited are in fact\nGod’s reasons.  Alvin Plantinga (1974a, 10; 1985a, 35) and\nRobert Adams (1985, 242) use the term in that way, but, as has been\npointed out by a number of writers, including Richard Swinburne\n(1988, 298), and William Hasker (1988, 5), that is to saddle the\ntheodicist with an unnecessarily ambitious program.\n\nThe other possibility is that of offering a defense.  But what is a\ndefense?  In the context of abstract, incompatibility versions of the\nargument from evil, this term is generally used to refer to attempts\nto show that there is no logical incompatibility between the\nexistence of evil and the existence of God.  Such attempts involve\nsetting out a story that entails the existence of both God and evil,\nand that is logically consistent.  But as soon as one focuses upon\nevidential formulations of the argument from evil, a different\ninterpretation is needed if the term is to remain a useful one, since\nthe production of a logically consistent story that involves the\nexistence of both God and evil will do nothing to show that evil does\nnot render the existence of God unlikely, or even very unlikely.\n\nSo what more is required beyond a logically consistent story of a\ncertain sort? One answer that is suggested by some discussions is\nthat the story needs to be one that is true for all we know.  Thus\nPeter van Inwagen, throughout his book The Problem of Evil,\nfrequently claims that various propositions are “true for all\nwe know,” and in the “Detailed Contents” section at\nthe beginning of his book, he offers the following characterization\nof the idea of a defense:\n\nThe idea of a “defense” is introduced: that is, the idea of\na story that contains both God and all the evils that actually exist,\na story that is put forward not as true but as “true for all anyone\nknows”. (2006, xii)\n\nIt seems very unlikely, however, that its merely being the case that\none does not know that the story is false can suffice, since it may\nvery well be the case that, though one does not know that p\nis false, one does have very strong evidence that it is.  But if one\nhas strong evidence that a story is false, it is hard to see how the\nstory on its own could possibly counter an evidential argument from\nevil.\n It seems, accordingly, that some claim about the probability of\nthe story’s being true is needed.  One possibility, suggested by some\ndiscussions, is that one might claim that rather than the story’s\nbeing a remote possibility that has only a minuscule chance of being\ntrue, the story represents “a real possibility”, and so\nhas a substantial chance of being true. Thus, while Peter van Inwagen\nusually talks about his stories’ being true for all anyone knows, he\nalso introduces the distinction between remote possibilities, and real\npossibilities (2006, Lecture 4, esp. pp. 66–71).\n\nIt is also hard to see, however, how this can be sufficient either.\nSuppose, for example, that one tells a story about God and the\nHolocaust, which is such that if it were true, an omnipotent being\nwould have been morally justified in not preventing the Holocaust.\nSuppose, further, that one claims that there is a twenty percent\nchance that the story is true.  A twenty percent chance is certainly\na real possibility, but how would that twenty percent chance\nundermine a version of the argument from evil whose conclusion was\nthat the probability that an omnipotent being would be justified in\nallowing the Holocaust was very low?\n\nGiven the apparent failure of the previous two suggestions, a natural\nconclusion is that the story that is involved in a defense must be\none that is likely to be true.  But if this is right, how does a\ndefense differ from a theodicy?  The answer is that while a theodicy\nmust specify reasons that would suffice to justify an omnipotent and\nomniscient being in allowing all of the evils found in the world, a\ndefense need merely show that it is likely that there are reasons\nwhich would justify an omnipotent and omniscient being in not\npreventing the evils that one finds in the world, even if one does\nnot know what those reasons are.  A defense differs from a theodicy,\nthen, in that a defense attempts to show only that some\nGod-justifying reasons probably exist; it does not attempt to specify\nwhat they are.\n\nThere is, however, one final possibility that needs to be considered.\nThis is the idea that what is needed in a defense is not a story that\ncan be shown to be likely to be true, but, rather, a story that, for\nall we know, is not unlikely.  The thought here is that, even if\nthere is some probability that the story has relative to our\nevidential base, we may not be able to determine what that\nprobability is, or even any reasonably delimited range in which that\nprobability falls.  If so, it cannot be shown that the story is likely\nto be true, but neither can it be shown that the story is unlikely to\nbe true.\n\nThe question that immediately arises is whether a proposition that\nwould undercut an inductive argument from evil if one knew it were true can\nundercut the argument if one is unable to assign any probability to the\nproposition’s being true, and if so, how.  One thought might be that\nif one can assign no probability to a proposition, one should treat\nit as equally likely to be true as to be false.  But propositions\nvary dramatically in logical form: some are such as might naturally\nbe viewed as atomic, others are sweeping generalizations, others are\ncomplex conjunctions, and so on.  If one treated any proposition to\nwhich one could not assign a probability as equally likely to be true\nas to be false, the result would be an incoherent assignment of\nprobabilities.  On the other hand, if one adopts this idea only in\nthe case of atomic propositions, then given that stories that are\nadvanced in defenses and theodicies are typically quite complex,\nthose stories will wind up getting assigned low probabilities, and it\nis then unclear how they could undercut an inductive argument from\nevil.  \n",
    "section_title": "4. Responses to the Argument from Evil: Refutations, Theodicies, and Defenses",
    "entry_title": "The Problem of Evil",
    "hierarchy_title": "The Problem of Evil || Responses to the Argument from Evil: Refutations, Theodicies, and Defenses",
    "tokenized_text": [
        "response",
        "argument",
        "evil",
        "refutation",
        "theodicy",
        "defense",
        "response",
        "argument",
        "evil",
        "refutation",
        "theodicy",
        "defense",
        "given",
        "evidential",
        "formulation",
        "evidential",
        "argument",
        "evil",
        "sort",
        "response",
        "possible",
        "natural",
        "way",
        "dividing",
        "possible",
        "response",
        "may",
        "referred",
        "total",
        "refutation",
        "theodicy",
        "defense",
        "let",
        "u",
        "begin",
        "considering",
        "involved",
        "three",
        "different",
        "general",
        "type",
        "response",
        "threefold",
        "classification",
        "arrived",
        "following",
        "line",
        "thought",
        "advocate",
        "argument",
        "evil",
        "claiming",
        "first",
        "place",
        "fact",
        "evil",
        "world",
        "make",
        "prima",
        "facie",
        "unreasonable",
        "believe",
        "existence",
        "god",
        "second",
        "place",
        "situation",
        "altered",
        "fact",
        "conjoined",
        "thing",
        "one",
        "justified",
        "believing",
        "inferentially",
        "noninferentially",
        "belief",
        "existence",
        "god",
        "also",
        "unreasonable",
        "relative",
        "total",
        "evidence",
        "available",
        "together",
        "relevant",
        "basis",
        "state",
        "responding",
        "argument",
        "evil",
        "one",
        "might",
        "challenge",
        "either",
        "claim",
        "say",
        "one",
        "might",
        "grant",
        "least",
        "sake",
        "argument",
        "fact",
        "evil",
        "thing",
        "equal",
        "render",
        "belief",
        "god",
        "unreasonable",
        "argue",
        "consideration",
        "embedded",
        "within",
        "one",
        "total",
        "epistemic",
        "situation",
        "belief",
        "existence",
        "god",
        "seen",
        "reasonable",
        "thing",
        "considered",
        "alternatively",
        "one",
        "might",
        "defend",
        "radical",
        "thesis",
        "fact",
        "evil",
        "world",
        "make",
        "even",
        "prima",
        "facie",
        "unreasonable",
        "believe",
        "existence",
        "god",
        "latter",
        "thesis",
        "correct",
        "argument",
        "evil",
        "even",
        "get",
        "started",
        "response",
        "argument",
        "evil",
        "naturally",
        "classified",
        "therefore",
        "attempted",
        "total",
        "refutation",
        "argument",
        "proposition",
        "relevant",
        "fact",
        "evil",
        "make",
        "even",
        "prima",
        "facie",
        "unreasonable",
        "believe",
        "existence",
        "god",
        "probably",
        "strike",
        "philosopher",
        "course",
        "rather",
        "implausible",
        "shall",
        "see",
        "however",
        "number",
        "philosophical",
        "theist",
        "attempted",
        "defend",
        "type",
        "response",
        "argument",
        "evil",
        "alternative",
        "course",
        "grant",
        "fact",
        "intrinsically",
        "undesirable",
        "state",
        "world",
        "make",
        "prima",
        "facie",
        "unreasonable",
        "believe",
        "god",
        "exists",
        "argue",
        "belief",
        "existence",
        "god",
        "unreasonable",
        "thing",
        "considered",
        "response",
        "may",
        "take",
        "however",
        "two",
        "slightly",
        "different",
        "form",
        "one",
        "possibility",
        "offering",
        "complete",
        "theodicy",
        "shall",
        "use",
        "term",
        "involves",
        "thesis",
        "every",
        "actual",
        "evil",
        "found",
        "world",
        "one",
        "describe",
        "state",
        "affair",
        "reasonable",
        "believe",
        "exists",
        "exists",
        "provide",
        "omnipotent",
        "omniscient",
        "morally",
        "sufficient",
        "reason",
        "allowing",
        "evil",
        "question",
        "noted",
        "term",
        "theodicy",
        "sometimes",
        "used",
        "stronger",
        "sense",
        "according",
        "person",
        "offer",
        "theodicy",
        "attempting",
        "show",
        "morally",
        "sufficient",
        "reason",
        "exist",
        "reason",
        "cited",
        "fact",
        "god",
        "reason",
        "alvin",
        "plantinga",
        "a",
        "a",
        "robert",
        "adam",
        "use",
        "term",
        "way",
        "pointed",
        "number",
        "writer",
        "including",
        "richard",
        "swinburne",
        "william",
        "hasker",
        "saddle",
        "theodicist",
        "unnecessarily",
        "ambitious",
        "program",
        "possibility",
        "offering",
        "defense",
        "defense",
        "context",
        "abstract",
        "incompatibility",
        "version",
        "argument",
        "evil",
        "term",
        "generally",
        "used",
        "refer",
        "attempt",
        "show",
        "logical",
        "incompatibility",
        "existence",
        "evil",
        "existence",
        "god",
        "attempt",
        "involve",
        "setting",
        "story",
        "entail",
        "existence",
        "god",
        "evil",
        "logically",
        "consistent",
        "soon",
        "one",
        "focus",
        "upon",
        "evidential",
        "formulation",
        "argument",
        "evil",
        "different",
        "interpretation",
        "needed",
        "term",
        "remain",
        "useful",
        "one",
        "since",
        "production",
        "logically",
        "consistent",
        "story",
        "involves",
        "existence",
        "god",
        "evil",
        "nothing",
        "show",
        "evil",
        "render",
        "existence",
        "god",
        "unlikely",
        "even",
        "unlikely",
        "required",
        "beyond",
        "logically",
        "consistent",
        "story",
        "certain",
        "sort",
        "one",
        "answer",
        "suggested",
        "discussion",
        "story",
        "need",
        "one",
        "true",
        "know",
        "thus",
        "peter",
        "van",
        "inwagen",
        "throughout",
        "book",
        "problem",
        "evil",
        "frequently",
        "claim",
        "various",
        "proposition",
        "true",
        "know",
        "detailed",
        "content",
        "section",
        "beginning",
        "book",
        "offer",
        "following",
        "characterization",
        "idea",
        "defense",
        "idea",
        "defense",
        "introduced",
        "idea",
        "story",
        "contains",
        "god",
        "evil",
        "actually",
        "exist",
        "story",
        "put",
        "forward",
        "true",
        "true",
        "anyone",
        "know",
        "xii",
        "seems",
        "unlikely",
        "however",
        "merely",
        "case",
        "one",
        "know",
        "story",
        "false",
        "suffice",
        "since",
        "may",
        "well",
        "case",
        "though",
        "one",
        "know",
        "p",
        "false",
        "one",
        "strong",
        "evidence",
        "one",
        "strong",
        "evidence",
        "story",
        "false",
        "hard",
        "see",
        "story",
        "could",
        "possibly",
        "counter",
        "evidential",
        "argument",
        "evil",
        "seems",
        "accordingly",
        "claim",
        "probability",
        "story",
        "true",
        "needed",
        "one",
        "possibility",
        "suggested",
        "discussion",
        "one",
        "might",
        "claim",
        "rather",
        "story",
        "remote",
        "possibility",
        "minuscule",
        "chance",
        "true",
        "story",
        "represents",
        "real",
        "possibility",
        "substantial",
        "chance",
        "true",
        "thus",
        "peter",
        "van",
        "inwagen",
        "usually",
        "talk",
        "story",
        "true",
        "anyone",
        "know",
        "also",
        "introduces",
        "distinction",
        "remote",
        "possibility",
        "real",
        "possibility",
        "lecture",
        "esp",
        "pp",
        "also",
        "hard",
        "see",
        "however",
        "sufficient",
        "either",
        "suppose",
        "example",
        "one",
        "tell",
        "story",
        "god",
        "holocaust",
        "true",
        "omnipotent",
        "would",
        "morally",
        "justified",
        "preventing",
        "holocaust",
        "suppose",
        "one",
        "claim",
        "twenty",
        "percent",
        "chance",
        "story",
        "true",
        "twenty",
        "percent",
        "chance",
        "certainly",
        "real",
        "possibility",
        "would",
        "twenty",
        "percent",
        "chance",
        "undermine",
        "version",
        "argument",
        "evil",
        "whose",
        "conclusion",
        "probability",
        "omnipotent",
        "would",
        "justified",
        "allowing",
        "holocaust",
        "low",
        "given",
        "apparent",
        "failure",
        "previous",
        "two",
        "suggestion",
        "natural",
        "conclusion",
        "story",
        "involved",
        "defense",
        "must",
        "one",
        "likely",
        "true",
        "right",
        "defense",
        "differ",
        "theodicy",
        "answer",
        "theodicy",
        "must",
        "specify",
        "reason",
        "would",
        "suffice",
        "justify",
        "omnipotent",
        "omniscient",
        "allowing",
        "evil",
        "found",
        "world",
        "defense",
        "need",
        "merely",
        "show",
        "likely",
        "reason",
        "would",
        "justify",
        "omnipotent",
        "omniscient",
        "preventing",
        "evil",
        "one",
        "find",
        "world",
        "even",
        "one",
        "know",
        "reason",
        "defense",
        "differs",
        "theodicy",
        "defense",
        "attempt",
        "show",
        "godjustifying",
        "reason",
        "probably",
        "exist",
        "attempt",
        "specify",
        "however",
        "one",
        "final",
        "possibility",
        "need",
        "considered",
        "idea",
        "needed",
        "defense",
        "story",
        "shown",
        "likely",
        "true",
        "rather",
        "story",
        "know",
        "unlikely",
        "thought",
        "even",
        "probability",
        "story",
        "relative",
        "evidential",
        "base",
        "may",
        "able",
        "determine",
        "probability",
        "even",
        "reasonably",
        "delimited",
        "range",
        "probability",
        "fall",
        "shown",
        "story",
        "likely",
        "true",
        "neither",
        "shown",
        "story",
        "unlikely",
        "true",
        "question",
        "immediately",
        "arises",
        "whether",
        "proposition",
        "would",
        "undercut",
        "inductive",
        "argument",
        "evil",
        "one",
        "knew",
        "true",
        "undercut",
        "argument",
        "one",
        "unable",
        "assign",
        "probability",
        "proposition",
        "true",
        "one",
        "thought",
        "might",
        "one",
        "assign",
        "probability",
        "proposition",
        "one",
        "treat",
        "equally",
        "likely",
        "true",
        "false",
        "proposition",
        "vary",
        "dramatically",
        "logical",
        "form",
        "might",
        "naturally",
        "viewed",
        "atomic",
        "others",
        "sweeping",
        "generalization",
        "others",
        "complex",
        "conjunction",
        "one",
        "treated",
        "proposition",
        "one",
        "could",
        "assign",
        "probability",
        "equally",
        "likely",
        "true",
        "false",
        "result",
        "would",
        "incoherent",
        "assignment",
        "probability",
        "hand",
        "one",
        "adopts",
        "idea",
        "case",
        "atomic",
        "proposition",
        "given",
        "story",
        "advanced",
        "defense",
        "theodicy",
        "typically",
        "quite",
        "complex",
        "story",
        "wind",
        "getting",
        "assigned",
        "low",
        "probability",
        "unclear",
        "could",
        "undercut",
        "inductive",
        "argument",
        "evil"
    ]
}