{
    "main_text": "Theodicies || Religious Theodicies\n7.5 Religious Theodicies\nThe four types of theodicies considered so far all appeal to\nbeliefs and evaluative claims that the theodicist thinks should be\nacceptable, upon careful reflection, to anyone, including those who\nare not religious.  But if one thinks that one’s religious beliefs are\nones that it is reasonable to accept, what is wrong with a theodicy\nthat appeals to some of one’s religious beliefs? Of course, if the\nreligious beliefs to which one appeals, taken together, entail the\nexistence of an omnipotent, omniscient, and morally perfect person,\nsuch a theodicy would be question-begging. But one can choose a subset\nthat, even if it entails the existence of a very powerful and\nknowledgeable creator—or even an omnipotent and omniscient\none—does not entail the existence of God.\nThere are many religions, and even within a given religion, very\nsignificant differences in the religious beliefs of people, and very\ndifferent beliefs to which one might appeal, so there are many\ndifferent religious theodicies that can be constructed. Here I shall\nfocus only on one general type. I think, however, that it will\nillustrate the kinds of objections that arise.\nThe religious theodicy in question is as follows. First, human\nbeings, rather than having arisen through a process of natural\nevolution, were brought into existence by the creator of the\nuniverse. He placed the first two human beings in a perfect world,\nfree of suffering and death. Those human beings, however, freely chose\nto disobey a command of the creator, and the result was the Fall of\nmankind, which meant not only that the first two humans became subject\nto suffering and death, but that all of their descendants did so as\nwell.  The creator, however, lovingly engaged, several generations\nlater, in a rescue operation, in which he, in the person of his son,\nbecame incarnated as a human being, and by undergoing a sacrificial\ndeath, made it possible for the creator to forgive every human who\naccepted this sacrifice, and who would then enjoy eternal beatitude living in the\npresence of the creator.\nThis type of religious theodicy has been advanced by a number of\nChristians, with a variant of it being found, for example, in Peter\nvan Inwagen’s book, The Problem of Evil (2006, 85ff.). It is\nnot, of course, a full theodicy, since it does not account for the\nsuffering of non-human animals, at least before the Fall. So let us\nfocus on it simply as offering an account of God’s justification for\nallowing human suffering.  Thus viewed, how successful is it?\nTo be successful, a theodicy must appeal only to beliefs that it is\nreasonable to accept. Do the beliefs involved in the above story\nqualify? It would seem not. First of all, among the crucial beliefs\nis the belief that human beings, rather than coming into being via a\nnatural process of evolution, were specially created. In setting out\nthe story, I have not specified how that was done.  Traditionally\nChristians believed, either that Adam and Eve were created ex\nnihilo, as the story of creation in Genesis 1 seems to say, or\nelse, as the creation story in Genesis 2 says, that Adam was created\nout of the dust of the earth, and then Eve was formed, sometime later,\nout of one of Adam’s ribs.\nThere are very good reasons for rejecting both of these accounts,\nsince the evidence that humans are descended from earlier primates is\nextremely strong indeed. Especially impressive is the evidence\nprovided by DNA studies, described by Daniel J. Fairbanks his book\nRelics of Eden, and which includes such as things as the\nevidence that human chromosome number two resulted by fusion from two\nprimate chromosomes, together with facts about (1) transposable\nelements, including retroelements, (2) pseudogenes, and (3)\nmitochondrial DNA.\nIn the light of such evidence, it is not surprising that many\nChristian philosophers have accepted the hypothesis of common descent,\nand have adopted some form of theistic evolution, in which the creator\nintervened at some point to transform some earlier primates into\nmembers of a new species, Homo sapiens. But while this version of\nspecial creation is an improvement, given the very close relations\nbetween human and chimpanzee DNA, and the fact that known mechanisms\nof chromosome rearrangement render the transition from some non-human\nspecies to Homo sapiens not at all improbable, the postulation of\ndivine intervention at that particular point does not seem\nplausible.\nIt would be a different matter, of course, if humans had immaterial\nminds, but there is very strong empirical evidence against that view,\nincluding such things as the effects of a blow to the head and brain\ndamage of different sorts, the effects of diseases such as\nAlzheimer’s, the decline of mental capacities with aging, the\nrelations between the mental development of children and the growth of\nneural circuitry, the inheritance of personality traits, the different\ncorrelations in the case of identical twins versus fraternal twins\nwith regard to such traits as intelligence, the effects of\npsychotropic drugs, such as Prozac, and so on (Tooley, 2012,\n42–4).\nSecondly, the story postulates not just a special creation, but\nalso a special creation in which humans, initially, were not subject\nto suffering or death. Given, among other things, that that period was\na very short one, one cannot offer positive historical evidence again\nthe existence of such a short period that involved only two\nhumans. But the belief is surely a remarkable one that can be viewed\nas likely only if it is supported by evidence. The evidence that can\nbe offered, however, consists entirely of the creation story in\nGenesis, so that question is, how reliable is such evidence? To answer\nthat question, one can see what other stories one finds in\nGenesis. One striking story is that of Noah—who apparently lived\naround 4500 years ago—according to which there was a worldwide\nflood that killed all animals on Earth, except for those that were on\nthe ark. But there are excellent reasons for believing that such a\nstory is very unlikely to be true, both in the light of the number of\nanimal species that currently exist, and in the light of the\nevidence—attempts by authors such as Whitcomb and Morris in\ntheir book The Genesis Flood: The Biblical Record and its\nScientific Implications (1966) to argue otherwise\nnotwithstanding—that there has not been any world-wide flood in\nthe past 5000 years.\nIn addition, those who view Genesis as a source of important truths\ndo so because it is part of the Bible.  So one can also ask about the\nreliability of the Bible when it testifies to remarkable events. In\nmany cases, of course, there is no way of checking whether those remarkable events actually took place, but when there is, one finds that there is good reason to believe that the event in\nquestion did not take place. Thus, for example, there is the story of\nthe sun’s standing still for about a day during Joshua’s battle at\nJericho, the story of the slaughter of all of the Egyptian first-born\nchildren, and the story of the graves being opened and the dead\nwalking around the city at the time of Jesus’s death (Matthew 27:\n52–53). One would surely expect non-Biblical records of such events if\nthey had really taken place, but there are none.\nFinally, the religious theodicy that we are considering also\ninvolves a number of very problematic moral claims. First, we are\nasked to believe that there is nothing morally problematic about a\nmorally good deity making it the case that if one of the first two\nhumans disobeys some command, all of the many billions of descendants\nof that human will, as a consequence, be subject to suffering and\ndeath to which they would not otherwise be exposed. Secondly, we are\nalso asked to believe that a morally good deity is unable to forgive\npeople their misdeeds unless he becomes incarnate in the form of his\nson and suffers a sacrificial death. Thirdly, while, according to this story,\nthose who accept the sacrifice made on their behalf have all their\ntears wiped away and enjoy eternal happiness in the presence of God,\nthose who do not accept the sacrifice fare considerably less well, and\nsuffer eternal torment in hell. So we are being asked to believe that\nsuch eternal punishment is not morally problematic.\nIn short, the religious theodicy that we have been considering in\nthis section is very implausible, not only on scientific and\nhistorical grounds, but on moral grounds as well. The question,\naccordingly, is whether there is some religious theodicy that is not\nexposed to scientific, or historical, or moral objections.\n",
    "section_title": "7.5 Religious Theodicies",
    "entry_title": "The Problem of Evil",
    "hierarchy_title": "The Problem of Evil || Theodicies || Religious Theodicies",
    "tokenized_text": [
        "theodicy",
        "religious",
        "theodicy",
        "religious",
        "theodicy",
        "four",
        "type",
        "theodicy",
        "considered",
        "far",
        "appeal",
        "belief",
        "evaluative",
        "claim",
        "theodicist",
        "think",
        "acceptable",
        "upon",
        "careful",
        "reflection",
        "anyone",
        "including",
        "religious",
        "one",
        "think",
        "one",
        "religious",
        "belief",
        "one",
        "reasonable",
        "accept",
        "wrong",
        "theodicy",
        "appeal",
        "one",
        "religious",
        "belief",
        "course",
        "religious",
        "belief",
        "one",
        "appeal",
        "taken",
        "together",
        "entail",
        "existence",
        "omnipotent",
        "omniscient",
        "morally",
        "perfect",
        "person",
        "theodicy",
        "would",
        "questionbegging",
        "one",
        "choose",
        "subset",
        "even",
        "entail",
        "existence",
        "powerful",
        "knowledgeable",
        "creatoror",
        "even",
        "omnipotent",
        "omniscient",
        "onedoes",
        "entail",
        "existence",
        "god",
        "many",
        "religion",
        "even",
        "within",
        "given",
        "religion",
        "significant",
        "difference",
        "religious",
        "belief",
        "people",
        "different",
        "belief",
        "one",
        "might",
        "appeal",
        "many",
        "different",
        "religious",
        "theodicy",
        "constructed",
        "shall",
        "focus",
        "one",
        "general",
        "type",
        "think",
        "however",
        "illustrate",
        "kind",
        "objection",
        "arise",
        "religious",
        "theodicy",
        "question",
        "follows",
        "first",
        "human",
        "being",
        "rather",
        "arisen",
        "process",
        "natural",
        "evolution",
        "brought",
        "existence",
        "creator",
        "universe",
        "placed",
        "first",
        "two",
        "human",
        "being",
        "perfect",
        "world",
        "free",
        "suffering",
        "death",
        "human",
        "being",
        "however",
        "freely",
        "chose",
        "disobey",
        "command",
        "creator",
        "result",
        "fall",
        "mankind",
        "meant",
        "first",
        "two",
        "human",
        "became",
        "subject",
        "suffering",
        "death",
        "descendant",
        "well",
        "creator",
        "however",
        "lovingly",
        "engaged",
        "several",
        "generation",
        "later",
        "rescue",
        "operation",
        "person",
        "son",
        "became",
        "incarnated",
        "human",
        "undergoing",
        "sacrificial",
        "death",
        "made",
        "possible",
        "creator",
        "forgive",
        "every",
        "human",
        "accepted",
        "sacrifice",
        "would",
        "enjoy",
        "eternal",
        "beatitude",
        "living",
        "presence",
        "creator",
        "type",
        "religious",
        "theodicy",
        "advanced",
        "number",
        "christian",
        "variant",
        "found",
        "example",
        "peter",
        "van",
        "inwagen",
        "book",
        "problem",
        "evil",
        "ff",
        "course",
        "full",
        "theodicy",
        "since",
        "account",
        "suffering",
        "nonhuman",
        "animal",
        "least",
        "fall",
        "let",
        "u",
        "focus",
        "simply",
        "offering",
        "account",
        "god",
        "justification",
        "allowing",
        "human",
        "suffering",
        "thus",
        "viewed",
        "successful",
        "successful",
        "theodicy",
        "must",
        "appeal",
        "belief",
        "reasonable",
        "accept",
        "belief",
        "involved",
        "story",
        "qualify",
        "would",
        "seem",
        "first",
        "among",
        "crucial",
        "belief",
        "belief",
        "human",
        "being",
        "rather",
        "coming",
        "via",
        "natural",
        "process",
        "evolution",
        "specially",
        "created",
        "setting",
        "story",
        "specified",
        "done",
        "traditionally",
        "christian",
        "believed",
        "either",
        "adam",
        "eve",
        "created",
        "ex",
        "nihilo",
        "story",
        "creation",
        "genesis",
        "seems",
        "say",
        "else",
        "creation",
        "story",
        "genesis",
        "say",
        "adam",
        "created",
        "dust",
        "earth",
        "eve",
        "formed",
        "sometime",
        "later",
        "one",
        "adam",
        "rib",
        "good",
        "reason",
        "rejecting",
        "account",
        "since",
        "evidence",
        "human",
        "descended",
        "earlier",
        "primate",
        "extremely",
        "strong",
        "indeed",
        "especially",
        "impressive",
        "evidence",
        "provided",
        "dna",
        "study",
        "described",
        "daniel",
        "j",
        "fairbanks",
        "book",
        "relic",
        "eden",
        "includes",
        "thing",
        "evidence",
        "human",
        "chromosome",
        "number",
        "two",
        "resulted",
        "fusion",
        "two",
        "primate",
        "chromosome",
        "together",
        "fact",
        "transposable",
        "element",
        "including",
        "retroelements",
        "pseudogenes",
        "mitochondrial",
        "dna",
        "light",
        "evidence",
        "surprising",
        "many",
        "christian",
        "philosopher",
        "accepted",
        "hypothesis",
        "common",
        "descent",
        "adopted",
        "form",
        "theistic",
        "evolution",
        "creator",
        "intervened",
        "point",
        "transform",
        "earlier",
        "primate",
        "member",
        "new",
        "specie",
        "homo",
        "sapiens",
        "version",
        "special",
        "creation",
        "improvement",
        "given",
        "close",
        "relation",
        "human",
        "chimpanzee",
        "dna",
        "fact",
        "known",
        "mechanism",
        "chromosome",
        "rearrangement",
        "render",
        "transition",
        "nonhuman",
        "specie",
        "homo",
        "sapiens",
        "improbable",
        "postulation",
        "divine",
        "intervention",
        "particular",
        "point",
        "seem",
        "plausible",
        "would",
        "different",
        "matter",
        "course",
        "human",
        "immaterial",
        "mind",
        "strong",
        "empirical",
        "evidence",
        "view",
        "including",
        "thing",
        "effect",
        "blow",
        "head",
        "brain",
        "damage",
        "different",
        "sort",
        "effect",
        "disease",
        "alzheimer",
        "decline",
        "mental",
        "capacity",
        "aging",
        "relation",
        "mental",
        "development",
        "child",
        "growth",
        "neural",
        "circuitry",
        "inheritance",
        "personality",
        "trait",
        "different",
        "correlation",
        "case",
        "identical",
        "twin",
        "versus",
        "fraternal",
        "twin",
        "regard",
        "trait",
        "intelligence",
        "effect",
        "psychotropic",
        "drug",
        "prozac",
        "tooley",
        "secondly",
        "story",
        "postulate",
        "special",
        "creation",
        "also",
        "special",
        "creation",
        "human",
        "initially",
        "subject",
        "suffering",
        "death",
        "given",
        "among",
        "thing",
        "period",
        "short",
        "one",
        "one",
        "offer",
        "positive",
        "historical",
        "evidence",
        "existence",
        "short",
        "period",
        "involved",
        "two",
        "human",
        "belief",
        "surely",
        "remarkable",
        "one",
        "viewed",
        "likely",
        "supported",
        "evidence",
        "evidence",
        "offered",
        "however",
        "consists",
        "entirely",
        "creation",
        "story",
        "genesis",
        "question",
        "reliable",
        "evidence",
        "answer",
        "question",
        "one",
        "see",
        "story",
        "one",
        "find",
        "genesis",
        "one",
        "striking",
        "story",
        "noahwho",
        "apparently",
        "lived",
        "around",
        "year",
        "agoaccording",
        "worldwide",
        "flood",
        "killed",
        "animal",
        "earth",
        "except",
        "ark",
        "excellent",
        "reason",
        "believing",
        "story",
        "unlikely",
        "true",
        "light",
        "number",
        "animal",
        "specie",
        "currently",
        "exist",
        "light",
        "evidenceattempts",
        "author",
        "whitcomb",
        "morris",
        "book",
        "genesis",
        "flood",
        "biblical",
        "record",
        "scientific",
        "implication",
        "argue",
        "otherwise",
        "notwithstandingthat",
        "worldwide",
        "flood",
        "past",
        "year",
        "addition",
        "view",
        "genesis",
        "source",
        "important",
        "truth",
        "part",
        "bible",
        "one",
        "also",
        "ask",
        "reliability",
        "bible",
        "testifies",
        "remarkable",
        "event",
        "many",
        "case",
        "course",
        "way",
        "checking",
        "whether",
        "remarkable",
        "event",
        "actually",
        "took",
        "place",
        "one",
        "find",
        "good",
        "reason",
        "believe",
        "event",
        "question",
        "take",
        "place",
        "thus",
        "example",
        "story",
        "sun",
        "standing",
        "still",
        "day",
        "joshua",
        "battle",
        "jericho",
        "story",
        "slaughter",
        "egyptian",
        "firstborn",
        "child",
        "story",
        "graf",
        "opened",
        "dead",
        "walking",
        "around",
        "city",
        "time",
        "jesus",
        "death",
        "matthew",
        "one",
        "would",
        "surely",
        "expect",
        "nonbiblical",
        "record",
        "event",
        "really",
        "taken",
        "place",
        "none",
        "finally",
        "religious",
        "theodicy",
        "considering",
        "also",
        "involves",
        "number",
        "problematic",
        "moral",
        "claim",
        "first",
        "asked",
        "believe",
        "nothing",
        "morally",
        "problematic",
        "morally",
        "good",
        "deity",
        "making",
        "case",
        "one",
        "first",
        "two",
        "human",
        "disobeys",
        "command",
        "many",
        "billion",
        "descendant",
        "human",
        "consequence",
        "subject",
        "suffering",
        "death",
        "would",
        "otherwise",
        "exposed",
        "secondly",
        "also",
        "asked",
        "believe",
        "morally",
        "good",
        "deity",
        "unable",
        "forgive",
        "people",
        "misdeed",
        "unless",
        "becomes",
        "incarnate",
        "form",
        "son",
        "suffers",
        "sacrificial",
        "death",
        "thirdly",
        "according",
        "story",
        "accept",
        "sacrifice",
        "made",
        "behalf",
        "tear",
        "wiped",
        "away",
        "enjoy",
        "eternal",
        "happiness",
        "presence",
        "god",
        "accept",
        "sacrifice",
        "fare",
        "considerably",
        "le",
        "well",
        "suffer",
        "eternal",
        "torment",
        "hell",
        "asked",
        "believe",
        "eternal",
        "punishment",
        "morally",
        "problematic",
        "short",
        "religious",
        "theodicy",
        "considering",
        "section",
        "implausible",
        "scientific",
        "historical",
        "ground",
        "moral",
        "ground",
        "well",
        "question",
        "accordingly",
        "whether",
        "religious",
        "theodicy",
        "exposed",
        "scientific",
        "historical",
        "moral",
        "objection"
    ]
}