{
    "main_text": "Buffon’s Transformation of Enlightenment Natural History || Buffon and the Degeneration of Species\n3.3 Buffon and the Degeneration of Species\n\nIt is in the context of his proposed solution to the issue of organic\ngeneration that Buffon then addressed the issue of organic species and\ntheir permanence. In the fourth volume of the Natural History\n(1753), devoted to the large domestic quadrupeds, Buffon first raised\nthe option of species transformism, only to reject it. In the article\n“The Ass”, devoted to the domestic donkey, Buffon drew\nattention to the close anatomical similarity between the horse and the\nass, as revealed by his collaborator Daubenton’s anatomical\ndescriptions. This similarity strongly suggested an underlying unity\nof plan of all the quadrupeds, a similarity raising the possibility\nthat all quadrupeds might have been derived in historical time from a\nsingle stem (souche) which “in the succession of time,\nhas produced, by perfection and degeneration, all the other\nanimals” (Buffon 1753, [OP, 355]). In a move that has confused\ncommentators every since, Buffon then rejected this possibility and\ninstead argued that because of the infertility of hybrids, species\nmust have been distinct from the beginning.\n\nThe explanation of Buffon’s initial 1753 rejection of\ntransformism, and his subsequent development of proto-evolutionary\nviews as the Natural History progressed, has taken many forms\n(Bowler 2003: chp. 3; Lovejoy 1911 [1959]). The argument of this\narticle is that both Buffon’s initial rejection of transformism,\nand his subsequent development toward the acceptance of historical\nspecies change reflect a coherent and consistent development of his\nconcept of “physical truth” (see above Section 3.1).\nDrawing on his emphasis on serial recurrence and material connection\nas the foundation of physical truth, the species is maintained in time\nand given its ontological reality by the recurring passing on of the\ninternal mould which shapes the organic molecules into a new organism\nin time. \n\nThis analysis implied for Buffon a significant redefinition of the\nconcept of an organic species, a redefinition that has affected the\ntradition of natural history and biology since the 1750s. Buffon\nexplicitly rejected the long-accepted meaning of ‘species’\nas a universal— or, in modern parlance, a “class”\nconcept, constituted by a set of individuals on the basis of\npossession of explicit defining properties. This was the meaning\nimplicit in the Linnaean classification of his time. This concept\nBuffon criticized as an “abstract” meaning of species. By\ncontrast, Buffon defined a species in natural history exclusively as\nthe historical succession of ancestor and descendant linked by\nmaterial connection through generation. Such a species\nis,“… neither the number nor the collection of similar\nindividuals which forms the species; it is the constant succession and\nuninterrupted renewal of these individuals which constitutes it”\n(Buffon 1753, [OP, 355]).\n\nThe empirical sign of this essential unity of the species over time is\nthe ability of its members to interbreed and produce fertile\noffspring, a criterion that takes precedence over similarities of\nanatomy or habits of life. The horse and ass must be two different\nspecies because they cannot interbreed and produce fertile offspring,\nwhatever may be their anatomical resemblances. The dogs, on the other\nhand, must, in spite of great morphological differences between\nbreeds, constitute one species because of their interfertility. \n\nIn setting forth this new meaning of ‘species’ in natural\nhistory, and distinguishing it from the alternative meaning of species\nas a logical universal, Buffon was doing more than distinguishing the\n“category” from the “taxon” as these terms\nhave come to be understood in contemporary philosophy of biology. In\nan important sense, Buffon introduced an opposition between\nthese two meanings of “species” found in the tradition\nreaching back to Aristotle (see Section 1.1 above), granting\n“reality” in biology only to species conceived as material\nsuccessions of individuals sharing in the same internal mould spread\nout in time. By contrast, Buffon considered the understanding of\nspecies in the sense of a universal class concept to be\n“abstract” and “artificial”.\n\nThis explicit opposition of two meanings of “species”\nintroduced by Buffon, divorcing concepts previously linked together by\na complex relation of thought and world within the Aristotelian and\nScholastic discussions, has been seen by some commentators as marking\nthe introduction of a fundamental confusion over the conception of\nspecies in subsequent discussions in the biological literature. This\nis at least one of the underlying causes of the so-called\n“species problem”. In their historical extension, these\nissues continue to generate contemporary disputes that oppose\nconceptions of “species as sets” to those of\n“species as spatio-temporal individuals” (Dupré\n1993; Ereshefsky (ed.) 1992; Ghiselin 1997; Hull 1999; R.A. Richards\n2010; Sloan 1987, 2013; Stamos 2003; Wheeler & Meier (eds) 2000;\nWilkins 2009; R.A. Wilson (ed.) 1999; and the entry on species in this\nencyclopedia).\n\nThe subsequent developments in Buffon’s thought toward what an\nolder tradition of scholarship mistakenly interpreted to be\n“evolutionism”, involved the gradual broadening of his\nnatural-historical or “physical” species to include wider\nand wider degrees of material relationship. This expansion of his\noriginal species concept Buffon expressed in the language of a\n“degeneration” of forms in time in response to\nenvironmental conditions.\n\nThe encounter with a wide body of new data from the colonies and\nexploratory voyages returned to Paris during the course of the writing\nof the Natural History impressed Buffon with the degree to\nwhich species seemed to be affected by external circumstances such\nthat from a single source numerous “degenerations” could\narise in some groups. This formed the conceptual basis for his concept\nof a race as distinguished from a Linnaean Variety.\nA “race” in the Buffonian sense was a historical\ndegeneration from a common ancestor that maintained material and\nhistorical connection to this common source form. But this lineage\ncould undergo substantial and quasi-permanent hereditary\ndifferentiation into different lineages, with the cause of these\ndegenerations explained by slight changes in the organic molecules\nproduced by varying environmental circumstances as a given physical\nspecies migrates to new environments. These slight changes in turn\naffected the internal mould. Developed in greatest detail in his long\narticle, “On the Degeneration of Animals” in volume XIV\n(1766) of the Natural History, Buffon’s theory of the\ndegeneration of species extended so far as to allow the lumping of the\nquadrupeds of both the Old and New worlds into a limited number of\nprimary “families” (familles) and\n“genera” (genres) that from points of origin in\nthe Northern European hemisphere, have degenerated in time in response\nto migration to new locales. By including human beings in this\nnaturalistic scenario in his later writings, and assuming that human\nlineages underwent similar degenerative changes as they migrated from\ntheir postulated point of origin of human beings in the Caucasus,\nBuffon’s theory played a major role in the development of\nEnlightenment racial theory (Sloan 1973, 2014).\n\nBuffon subsequently made some steps toward combining the thesis of the\nhistorical degeneration of species with his theory of historical\ncosmology in his late Des (subsequently Les)\nÉpoques de la Nature first published in\nSuppléments volume 5 (1788), and subsequently issued\nseparately in 1789. In this treatise he reworked his earlier\nspeculations on the “theory of the earth”, first set out\nin 1749, adding to this a historical chronology of the age of the\nearth determined experimentally in the 1770s by quantitative studies\non cooling spheres of metal. In this imaginative synthesis, and\ndrawing on an allegorical reading of Genesis 1, Buffon\ncombined a history of the Earth with a historical sequence of the\nemergence of living forms (Buffon 1779 [1988]; Zalasiewicz et al.,\n2018). In doing so he expanded the time scale of earth history\nconsiderably beyond the accepted “Mosaic” chronology of\nless than 10,000 years from the beginning of the world to the present,\nto an estimate of approximately 75,000 years in the published version,\nand over two million years in his draft manuscript. In this treatise\nBuffon offered a naturalistic solution to the two inherited Cartesian\ndilemmas. First, his schema was offered as a realistic account. The\nCartesian language of counter-factualism has disappeared. Second, he\nintegrated the history of living forms into this comprehensive history\nof the world. Further naturalizing his theory of the internal moulds\nand organic molecules, both were now seen to arise by natural laws\nfrom the natural attraction of different shapes of matter and from the\nchanges in matter as the earth cooled from its origin in matter cast\noff by the sun. Animals first originated by the spontaneous clumping\ntogether of these organic molecules on the cooling earth (Buffon 1779\n[1988]: Fifth Epoch).\n\nThe Epochs also offered a schema for a historical sequence of\nforms that appear sequentially in a series of six major\n“epochs” to which Buffon gives precise dates of duration.\nThis begins with the origin of the earth from a cooled star, and then\ndescribes the beginning of living nature with marine life and plants\nin the early stages of the earth’s history, terminating with\npresent forms His account even suggested a naturalistic origin of\nhuman beings, although this issue is left vague. Humankind appears,\nwithout explanation in the text, in a non-paradisal state in the\nnorthern latitudes of Eurasia, surrounded by ferocious animals,\nearthquakes and floods, and in a primitive social condition that\nrequired collaboration for survival. Buffon’s liberal use of a\nform of spontaneous generation that allowed for the origin of even\nmajor animal groups from the clumping together of organic molecules as\nthe earth cooled, rendered the actual derivation of forms from\nprevious forms unnecessary. In several respects, the development of\ngenuine transformist theories by Buffon’s successors required a\nmuch more restricted use of the possibility of spontaneous generation.\n\n",
    "section_title": "3.3 Buffon and the Degeneration of Species",
    "entry_title": "Evolutionary Thought Before Darwin",
    "hierarchy_title": "Evolutionary Thought Before Darwin || Buffon’s Transformation of Enlightenment Natural History || Buffon and the Degeneration of Species",
    "tokenized_text": [
        "buffon",
        "transformation",
        "enlightenment",
        "natural",
        "history",
        "buffon",
        "degeneration",
        "specie",
        "buffon",
        "degeneration",
        "specie",
        "context",
        "proposed",
        "solution",
        "issue",
        "organic",
        "generation",
        "buffon",
        "addressed",
        "issue",
        "organic",
        "specie",
        "permanence",
        "fourth",
        "volume",
        "natural",
        "history",
        "devoted",
        "large",
        "domestic",
        "quadruped",
        "buffon",
        "first",
        "raised",
        "option",
        "specie",
        "transformism",
        "reject",
        "article",
        "as",
        "devoted",
        "domestic",
        "donkey",
        "buffon",
        "drew",
        "attention",
        "close",
        "anatomical",
        "similarity",
        "horse",
        "as",
        "revealed",
        "collaborator",
        "daubenton",
        "anatomical",
        "description",
        "similarity",
        "strongly",
        "suggested",
        "underlying",
        "unity",
        "plan",
        "quadruped",
        "similarity",
        "raising",
        "possibility",
        "quadruped",
        "might",
        "derived",
        "historical",
        "time",
        "single",
        "stem",
        "souche",
        "succession",
        "time",
        "produced",
        "perfection",
        "degeneration",
        "animal",
        "buffon",
        "op",
        "move",
        "confused",
        "commentator",
        "every",
        "since",
        "buffon",
        "rejected",
        "possibility",
        "instead",
        "argued",
        "infertility",
        "hybrid",
        "specie",
        "must",
        "distinct",
        "beginning",
        "explanation",
        "buffon",
        "initial",
        "rejection",
        "transformism",
        "subsequent",
        "development",
        "protoevolutionary",
        "view",
        "natural",
        "history",
        "progressed",
        "taken",
        "many",
        "form",
        "bowler",
        "chp",
        "lovejoy",
        "argument",
        "article",
        "buffon",
        "initial",
        "rejection",
        "transformism",
        "subsequent",
        "development",
        "toward",
        "acceptance",
        "historical",
        "specie",
        "change",
        "reflect",
        "coherent",
        "consistent",
        "development",
        "concept",
        "physical",
        "truth",
        "see",
        "section",
        "drawing",
        "emphasis",
        "serial",
        "recurrence",
        "material",
        "connection",
        "foundation",
        "physical",
        "truth",
        "specie",
        "maintained",
        "time",
        "given",
        "ontological",
        "reality",
        "recurring",
        "passing",
        "internal",
        "mould",
        "shape",
        "organic",
        "molecule",
        "new",
        "organism",
        "time",
        "analysis",
        "implied",
        "buffon",
        "significant",
        "redefinition",
        "concept",
        "organic",
        "specie",
        "redefinition",
        "affected",
        "tradition",
        "natural",
        "history",
        "biology",
        "since",
        "s",
        "buffon",
        "explicitly",
        "rejected",
        "longaccepted",
        "meaning",
        "specie",
        "universal",
        "modern",
        "parlance",
        "class",
        "concept",
        "constituted",
        "set",
        "individual",
        "basis",
        "possession",
        "explicit",
        "defining",
        "property",
        "meaning",
        "implicit",
        "linnaean",
        "classification",
        "time",
        "concept",
        "buffon",
        "criticized",
        "abstract",
        "meaning",
        "specie",
        "contrast",
        "buffon",
        "defined",
        "specie",
        "natural",
        "history",
        "exclusively",
        "historical",
        "succession",
        "ancestor",
        "descendant",
        "linked",
        "material",
        "connection",
        "generation",
        "specie",
        "neither",
        "number",
        "collection",
        "similar",
        "individual",
        "form",
        "specie",
        "constant",
        "succession",
        "uninterrupted",
        "renewal",
        "individual",
        "constitutes",
        "buffon",
        "op",
        "empirical",
        "sign",
        "essential",
        "unity",
        "specie",
        "time",
        "ability",
        "member",
        "interbreed",
        "produce",
        "fertile",
        "offspring",
        "criterion",
        "take",
        "precedence",
        "similarity",
        "anatomy",
        "habit",
        "life",
        "horse",
        "as",
        "must",
        "two",
        "different",
        "specie",
        "interbreed",
        "produce",
        "fertile",
        "offspring",
        "whatever",
        "may",
        "anatomical",
        "resemblance",
        "dog",
        "hand",
        "must",
        "spite",
        "great",
        "morphological",
        "difference",
        "breed",
        "constitute",
        "one",
        "specie",
        "interfertility",
        "setting",
        "forth",
        "new",
        "meaning",
        "specie",
        "natural",
        "history",
        "distinguishing",
        "alternative",
        "meaning",
        "specie",
        "logical",
        "universal",
        "buffon",
        "distinguishing",
        "category",
        "taxon",
        "term",
        "come",
        "understood",
        "contemporary",
        "philosophy",
        "biology",
        "important",
        "sense",
        "buffon",
        "introduced",
        "opposition",
        "two",
        "meaning",
        "specie",
        "found",
        "tradition",
        "reaching",
        "back",
        "aristotle",
        "see",
        "section",
        "granting",
        "reality",
        "biology",
        "specie",
        "conceived",
        "material",
        "succession",
        "individual",
        "sharing",
        "internal",
        "mould",
        "spread",
        "time",
        "contrast",
        "buffon",
        "considered",
        "understanding",
        "specie",
        "sense",
        "universal",
        "class",
        "concept",
        "abstract",
        "artificial",
        "explicit",
        "opposition",
        "two",
        "meaning",
        "specie",
        "introduced",
        "buffon",
        "divorcing",
        "concept",
        "previously",
        "linked",
        "together",
        "complex",
        "relation",
        "thought",
        "world",
        "within",
        "aristotelian",
        "scholastic",
        "discussion",
        "seen",
        "commentator",
        "marking",
        "introduction",
        "fundamental",
        "confusion",
        "conception",
        "specie",
        "subsequent",
        "discussion",
        "biological",
        "literature",
        "least",
        "one",
        "underlying",
        "cause",
        "socalled",
        "specie",
        "problem",
        "historical",
        "extension",
        "issue",
        "continue",
        "generate",
        "contemporary",
        "dispute",
        "oppose",
        "conception",
        "specie",
        "set",
        "specie",
        "spatiotemporal",
        "individual",
        "dupré",
        "ereshefsky",
        "ed",
        "ghiselin",
        "hull",
        "ra",
        "richards",
        "sloan",
        "stamos",
        "wheeler",
        "meier",
        "ed",
        "wilkins",
        "ra",
        "wilson",
        "ed",
        "entry",
        "specie",
        "encyclopedia",
        "subsequent",
        "development",
        "buffon",
        "thought",
        "toward",
        "older",
        "tradition",
        "scholarship",
        "mistakenly",
        "interpreted",
        "evolutionism",
        "involved",
        "gradual",
        "broadening",
        "naturalhistorical",
        "physical",
        "specie",
        "include",
        "wider",
        "wider",
        "degree",
        "material",
        "relationship",
        "expansion",
        "original",
        "specie",
        "concept",
        "buffon",
        "expressed",
        "language",
        "degeneration",
        "form",
        "time",
        "response",
        "environmental",
        "condition",
        "encounter",
        "wide",
        "body",
        "new",
        "data",
        "colony",
        "exploratory",
        "voyage",
        "returned",
        "paris",
        "course",
        "writing",
        "natural",
        "history",
        "impressed",
        "buffon",
        "degree",
        "specie",
        "seemed",
        "affected",
        "external",
        "circumstance",
        "single",
        "source",
        "numerous",
        "degeneration",
        "could",
        "arise",
        "group",
        "formed",
        "conceptual",
        "basis",
        "concept",
        "race",
        "distinguished",
        "linnaean",
        "variety",
        "race",
        "buffonian",
        "sense",
        "historical",
        "degeneration",
        "common",
        "ancestor",
        "maintained",
        "material",
        "historical",
        "connection",
        "common",
        "source",
        "form",
        "lineage",
        "could",
        "undergo",
        "substantial",
        "quasipermanent",
        "hereditary",
        "differentiation",
        "different",
        "lineage",
        "cause",
        "degeneration",
        "explained",
        "slight",
        "change",
        "organic",
        "molecule",
        "produced",
        "varying",
        "environmental",
        "circumstance",
        "given",
        "physical",
        "specie",
        "migrates",
        "new",
        "environment",
        "slight",
        "change",
        "turn",
        "affected",
        "internal",
        "mould",
        "developed",
        "greatest",
        "detail",
        "long",
        "article",
        "degeneration",
        "animal",
        "volume",
        "xiv",
        "natural",
        "history",
        "buffon",
        "theory",
        "degeneration",
        "specie",
        "extended",
        "far",
        "allow",
        "lumping",
        "quadruped",
        "old",
        "new",
        "world",
        "limited",
        "number",
        "primary",
        "family",
        "familles",
        "genus",
        "genre",
        "point",
        "origin",
        "northern",
        "european",
        "hemisphere",
        "degenerated",
        "time",
        "response",
        "migration",
        "new",
        "locale",
        "including",
        "human",
        "being",
        "naturalistic",
        "scenario",
        "later",
        "writing",
        "assuming",
        "human",
        "lineage",
        "underwent",
        "similar",
        "degenerative",
        "change",
        "migrated",
        "postulated",
        "point",
        "origin",
        "human",
        "being",
        "caucasus",
        "buffon",
        "theory",
        "played",
        "major",
        "role",
        "development",
        "enlightenment",
        "racial",
        "theory",
        "sloan",
        "buffon",
        "subsequently",
        "made",
        "step",
        "toward",
        "combining",
        "thesis",
        "historical",
        "degeneration",
        "specie",
        "theory",
        "historical",
        "cosmology",
        "late",
        "de",
        "subsequently",
        "le",
        "époques",
        "de",
        "la",
        "nature",
        "first",
        "published",
        "suppléments",
        "volume",
        "subsequently",
        "issued",
        "separately",
        "treatise",
        "reworked",
        "earlier",
        "speculation",
        "theory",
        "earth",
        "first",
        "set",
        "adding",
        "historical",
        "chronology",
        "age",
        "earth",
        "determined",
        "experimentally",
        "s",
        "quantitative",
        "study",
        "cooling",
        "sphere",
        "metal",
        "imaginative",
        "synthesis",
        "drawing",
        "allegorical",
        "reading",
        "genesis",
        "buffon",
        "combined",
        "history",
        "earth",
        "historical",
        "sequence",
        "emergence",
        "living",
        "form",
        "buffon",
        "zalasiewicz",
        "et",
        "al",
        "expanded",
        "time",
        "scale",
        "earth",
        "history",
        "considerably",
        "beyond",
        "accepted",
        "mosaic",
        "chronology",
        "le",
        "year",
        "beginning",
        "world",
        "present",
        "estimate",
        "approximately",
        "year",
        "published",
        "version",
        "two",
        "million",
        "year",
        "draft",
        "manuscript",
        "treatise",
        "buffon",
        "offered",
        "naturalistic",
        "solution",
        "two",
        "inherited",
        "cartesian",
        "dilemma",
        "first",
        "schema",
        "offered",
        "realistic",
        "account",
        "cartesian",
        "language",
        "counterfactualism",
        "disappeared",
        "second",
        "integrated",
        "history",
        "living",
        "form",
        "comprehensive",
        "history",
        "world",
        "naturalizing",
        "theory",
        "internal",
        "mould",
        "organic",
        "molecule",
        "seen",
        "arise",
        "natural",
        "law",
        "natural",
        "attraction",
        "different",
        "shape",
        "matter",
        "change",
        "matter",
        "earth",
        "cooled",
        "origin",
        "matter",
        "cast",
        "sun",
        "animal",
        "first",
        "originated",
        "spontaneous",
        "clumping",
        "together",
        "organic",
        "molecule",
        "cooling",
        "earth",
        "buffon",
        "fifth",
        "epoch",
        "epoch",
        "also",
        "offered",
        "schema",
        "historical",
        "sequence",
        "form",
        "appear",
        "sequentially",
        "series",
        "six",
        "major",
        "epoch",
        "buffon",
        "give",
        "precise",
        "date",
        "duration",
        "begin",
        "origin",
        "earth",
        "cooled",
        "star",
        "describes",
        "beginning",
        "living",
        "nature",
        "marine",
        "life",
        "plant",
        "early",
        "stage",
        "earth",
        "history",
        "terminating",
        "present",
        "form",
        "account",
        "even",
        "suggested",
        "naturalistic",
        "origin",
        "human",
        "being",
        "although",
        "issue",
        "left",
        "vague",
        "humankind",
        "appears",
        "without",
        "explanation",
        "text",
        "nonparadisal",
        "state",
        "northern",
        "latitude",
        "eurasia",
        "surrounded",
        "ferocious",
        "animal",
        "earthquake",
        "flood",
        "primitive",
        "social",
        "condition",
        "required",
        "collaboration",
        "survival",
        "buffon",
        "liberal",
        "use",
        "form",
        "spontaneous",
        "generation",
        "allowed",
        "origin",
        "even",
        "major",
        "animal",
        "group",
        "clumping",
        "together",
        "organic",
        "molecule",
        "earth",
        "cooled",
        "rendered",
        "actual",
        "derivation",
        "form",
        "previous",
        "form",
        "unnecessary",
        "several",
        "respect",
        "development",
        "genuine",
        "transformist",
        "theory",
        "buffon",
        "successor",
        "required",
        "much",
        "restricted",
        "use",
        "possibility",
        "spontaneous",
        "generation"
    ]
}