{
    "main_text": "\n\nExistence raises deep and important problems in metaphysics,\nphilosophy of language, and philosophical logic. Many of the issues\ncan be organized around the following two questions: Is existence\na property of individuals? and Assuming that existence is a\nproperty of individuals, are there individuals that lack it?\n\nWhat does it mean to ask if existence is a property? A full answer to\nthis question requires a general theory of properties, which is well\nbeyond the scope of this article. But we can briefly sketch the\nlandscape to set up our discussion of existence. (See the entries on\n properties\n and\n substance\n for deeper discussion.) Properties contrast with individuals. This\ndistinction can be explicated using the instantiation relation. My cat\ninstantiates the property of being hungry, as that is a way he is. As\nmy cat is himself an individual, he is not instantiated by\nanything. So, while properties also instantiate—the property of\nbeing red, for example, has the property of being a color—only\nproperties are instantiated; individuals only instantiate. Our first\nquestion is whether existence is instantiated and, if so, whether it\nis instantiated by individuals like Obama, my chair, and the fig tree\nin my backyard. Do individuals, in addition to ordinary properties\nlike being hungry, being human, being comfortable to sit in, and\nneeding more water, instantiate a property expressed by the English\nverb ‘exists’? \n\nThere is a debate in the literature on properties between the abundant\nconception of properties, according to which there is a property\ncorresponding to every natural language predicate and, more generally,\nevery class of individuals, and the sparse conception of properties,\naccording to which a predicate expresses a property only if the\nobjects that predicate is true of resemble one another in an intrinsic\nway. If the abundant conception is true, then our first question may\nseem trivial: Existence is a property of individuals because sentences\nlike ‘Bill Gates exists’ are grammatical and there is a\nclass of all individuals and hence a corresponding property of\nexisting. It seems, then, that our first question has bite only if the\nsparse conception is true. But appearances deceive. As we will see in\nsection 1, there is a controversy as to whether the logical form of a\nsentence like ‘Bill Gates exists’ is really\nsubject-predicate in structure and so whether the English verb\n‘exists’ really is predicated of individuals. The question\nwhether existence is a property of individuals is perhaps more\nstraightforward on the sparse conception of properties. But the\nquestion can still be raised even on the abundant conception as the\nquestion whether existence is a property of individuals involved in\nour talk of what exists and what does not, which is then a question\nabout the logical form of the sentences used in our existential\ndiscourse. \n\nWe can trace the issue of whether existence is a property to a\ndisagreement between the ancient Greek philosopher Aristotle and some\nof his medieval followers over the relationship between an\nindividual’s essence and its existence. The debate requires some\nbackground. We begin with the distinction between accident and essence\nand that distinction’s relation to contingency and necessity.\nSome of a thing’s properties are contingent, in the sense that\nthe thing might not have had them. I am writing right now, but I might\nhave been out for a run instead. So working on a paper right now is\none of my contingent properties. Contingent properties contrast with\nnecessary properties. I am necessarily human, in the sense that it is\nimpossible that I am a nonhuman. (It may be possible that it is not\nthe case that I am human, insofar as it is possible that I never\nexisted at all, in which case I would not have been, in that\npossibility, among the class of humans. But that is a different\nmatter.) All contingent properties are accidents and all essences are\nnecessary but, according to the Aristotelian, some necessary\nproperties are accidents. A thing’s essential properties are\ninseparable from the bearer, not only in the sense that the property\nis necessarily had by that object (insofar as that object were to\nexist), but in the deeper sense that any adequate account of what that\nobject is involves that property; they are part of any adequate\ndefinition of the thing or answer to the question ‘What is\nit?’. I am essentially a human and perhaps essentially the\nperson I in fact am, if there are individual essences in addition to\ngeneral essences. I am necessarily identical to something and\nnecessarily such that 2+2=4, but these properties are among my\naccidents, as they are not part of any adequate account of what I am\nand what distinguishes me from others.  While this distinction between\na thing’s necessary properties and its essential properties is\ncontroversial, there is no doubt that it was Aristotle’s view,\nshared by most of his medieval followers, and so informed the first\nhistorical occurrence of the debate about existence under\ndiscussion. Aristotle seems to have seen nothing more to existence\nthan essence; there is not a space between an articulation of what a\nthing is and that thing’s existing.  Saint Thomas Aquinas, on\nthe other hand, famously distinguished a thing’s essence from\nits existence. Aquinas argued something as follows, in chapter 4 of\nhis On Being and Essence. One can have an understanding of\nwhat a man or a phoenix is without knowing whether it exists. So,\nexistence is something in addition to essence.  In short, Aquinas\nargued that existence is a separate property as existence is not part\nof most objects’s natures and so those objects can be conceived\nor thought of separately from their existing.\n\nThere is a long and distinguished line of philosophers, including\nDavid Hume, Immanuel Kant, Gottlob Frege, and Bertrand Russell, who\nfollowed Aristotle in denying that existence is a separate property of\nindividuals, even as they rejected other aspects of Aristotle’s\nviews. Hume argued (in A Treatise of Human Nature 1.2.6) that\nthere is no impression of existence distinct from the impression of an\nobject, which is ultimately on Hume’s view a bundle of\nqualities. As all of our contentful ideas derive from impressions,\nHume concluded that existence is not a separate property of an object.\nKant’s criticism of the ontological arguments for the existence\nof God rested on a rejection of the claim that existence is a property\nof an object. Proponents of the ontological argument argue that the\nconcept of God as an entity with all perfections or a being of which\nno greater can be conceived entails God’s existence, as\nexistence is a perfection and a being that exists is greater than a\nbeing that does not exist. Kant objected (in his Critique of Pure\nReason, A596/B624-A602/B630) that existence is not a property.\n“Thus when I think a thing, through whichever and however many\npredicates I like (even in its thoroughgoing determination), not the\nleast bit gets added to the thing when I posit in addition that this\nthing is. For otherwise what would exist would not be the same as what\nI had thought in my concept, but more than that, and I could not say\nthat the very object of my concept exists” (A600/B628). Finally,\nboth Frege and Russell maintained that existence is not a property of\nindividuals but instead a second-order property—a property of\nconcepts, for Frege, and of propositional functions, for Russell.\nCrudely, to say that dinosaurs do not exist is to say that the\nproperty of being a dinosaur is not instantiated; to say that\nJean-Baptiste Botul does not exist is to say that some\nproperty—say, the property of being a unique post-war critic of\nKant and father of Butolism—is not instantiated. In neither case\nis it to say of some individual that it does not exist, which neither\nFrege nor Russell thought made sense.\n\nThe view that existence is not a property of individuals became the\ncommon view in the early 20th Century. While Aristotle, Hume, and\nKant’s related reasons for the thesis have persuaded some, the\ndominant force behind this agreement is the thought, developed most\nforcefully in [Russell 1905b], that denying that existence is a\nfirst-order property is the only way to avoid the consequence that\nthere are things that do not exist and thus that there is a\ndistinction between being and existing, our second framing question\nfrom above. The thesis that there are things that do not exist was\nheld by the Austrian philosopher Alexius Meinong. Existence is a\ngenuine property of individuals, Meinong maintained, but not\nuniversally had. While there are many ways to motivate Meinongianism,\na primary motivation is the puzzle of negative singular\nexistentials—sentences that seem to truly assert the\nnonexistence of an individual, such as the sentence\n‘Jean-Baptiste Botul does not exist’. In order to be true,\nit seems, the subject position must designate some entity of which\nnonexistence is truly predicated, in which case there are\nthings—the designation of these singular terms—that do not\nexist. Frege and Russell, by contrast, take the same sentences to\ndemonstrate that those expressions are not genuine singular terms at\nall and that negative existentials all have a general form, asserting\nthe noninstantiation of a property.\n\nThe following section discusses\nFrege and Russell’s account of true negative existentials. \nThe second section discusses Meinongianism, comparing the account of\ntrue negative existentials on offer by the Meinongian with the\nRussellian account discussed in the first section. The article ends\nwith a discussion of an anti-Meinongian account according to which\nexistence is a universal property of individuals and a discussion of\nthe related issues of existence in the context of quantified tense and\nmodal logics.\n",
    "section_title": "Preamble",
    "entry_title": "Existence",
    "hierarchy_title": "Existence || Preamble",
    "tokenized_text": [
        "existence",
        "raise",
        "deep",
        "important",
        "problem",
        "metaphysics",
        "philosophy",
        "language",
        "philosophical",
        "logic",
        "many",
        "issue",
        "organized",
        "around",
        "following",
        "two",
        "question",
        "existence",
        "property",
        "individual",
        "assuming",
        "existence",
        "property",
        "individual",
        "individual",
        "lack",
        "mean",
        "ask",
        "existence",
        "property",
        "full",
        "answer",
        "question",
        "requires",
        "general",
        "theory",
        "property",
        "well",
        "beyond",
        "scope",
        "article",
        "briefly",
        "sketch",
        "landscape",
        "set",
        "discussion",
        "existence",
        "see",
        "entry",
        "property",
        "substance",
        "deeper",
        "discussion",
        "property",
        "contrast",
        "individual",
        "distinction",
        "explicated",
        "using",
        "instantiation",
        "relation",
        "cat",
        "instantiates",
        "property",
        "hungry",
        "way",
        "cat",
        "individual",
        "instantiated",
        "anything",
        "property",
        "also",
        "instantiatethe",
        "property",
        "red",
        "example",
        "property",
        "coloronly",
        "property",
        "instantiated",
        "individual",
        "instantiate",
        "first",
        "question",
        "whether",
        "existence",
        "instantiated",
        "whether",
        "instantiated",
        "individual",
        "like",
        "obama",
        "chair",
        "fig",
        "tree",
        "backyard",
        "individual",
        "addition",
        "ordinary",
        "property",
        "like",
        "hungry",
        "human",
        "comfortable",
        "sit",
        "needing",
        "water",
        "instantiate",
        "property",
        "expressed",
        "english",
        "verb",
        "exists",
        "debate",
        "literature",
        "property",
        "abundant",
        "conception",
        "property",
        "according",
        "property",
        "corresponding",
        "every",
        "natural",
        "language",
        "predicate",
        "generally",
        "every",
        "class",
        "individual",
        "sparse",
        "conception",
        "property",
        "according",
        "predicate",
        "express",
        "property",
        "object",
        "predicate",
        "true",
        "resemble",
        "one",
        "another",
        "intrinsic",
        "way",
        "abundant",
        "conception",
        "true",
        "first",
        "question",
        "may",
        "seem",
        "trivial",
        "existence",
        "property",
        "individual",
        "sentence",
        "like",
        "bill",
        "gate",
        "exists",
        "grammatical",
        "class",
        "individual",
        "hence",
        "corresponding",
        "property",
        "existing",
        "seems",
        "first",
        "question",
        "bite",
        "sparse",
        "conception",
        "true",
        "appearance",
        "deceive",
        "see",
        "section",
        "controversy",
        "whether",
        "logical",
        "form",
        "sentence",
        "like",
        "bill",
        "gate",
        "exists",
        "really",
        "subjectpredicate",
        "structure",
        "whether",
        "english",
        "verb",
        "exists",
        "really",
        "predicated",
        "individual",
        "question",
        "whether",
        "existence",
        "property",
        "individual",
        "perhaps",
        "straightforward",
        "sparse",
        "conception",
        "property",
        "question",
        "still",
        "raised",
        "even",
        "abundant",
        "conception",
        "question",
        "whether",
        "existence",
        "property",
        "individual",
        "involved",
        "talk",
        "exists",
        "question",
        "logical",
        "form",
        "sentence",
        "used",
        "existential",
        "discourse",
        "trace",
        "issue",
        "whether",
        "existence",
        "property",
        "disagreement",
        "ancient",
        "greek",
        "philosopher",
        "aristotle",
        "medieval",
        "follower",
        "relationship",
        "individual",
        "essence",
        "existence",
        "debate",
        "requires",
        "background",
        "begin",
        "distinction",
        "accident",
        "essence",
        "distinction",
        "relation",
        "contingency",
        "necessity",
        "thing",
        "property",
        "contingent",
        "sense",
        "thing",
        "might",
        "writing",
        "right",
        "might",
        "run",
        "instead",
        "working",
        "paper",
        "right",
        "one",
        "contingent",
        "property",
        "contingent",
        "property",
        "contrast",
        "necessary",
        "property",
        "necessarily",
        "human",
        "sense",
        "impossible",
        "nonhuman",
        "may",
        "possible",
        "case",
        "human",
        "insofar",
        "possible",
        "never",
        "existed",
        "case",
        "would",
        "possibility",
        "among",
        "class",
        "human",
        "different",
        "matter",
        "contingent",
        "property",
        "accident",
        "essence",
        "necessary",
        "according",
        "aristotelian",
        "necessary",
        "property",
        "accident",
        "thing",
        "essential",
        "property",
        "inseparable",
        "bearer",
        "sense",
        "property",
        "necessarily",
        "object",
        "insofar",
        "object",
        "exist",
        "deeper",
        "sense",
        "adequate",
        "account",
        "object",
        "involves",
        "property",
        "part",
        "adequate",
        "definition",
        "thing",
        "answer",
        "question",
        "essentially",
        "human",
        "perhaps",
        "essentially",
        "person",
        "fact",
        "individual",
        "essence",
        "addition",
        "general",
        "essence",
        "necessarily",
        "identical",
        "something",
        "necessarily",
        "property",
        "among",
        "accident",
        "part",
        "adequate",
        "account",
        "distinguishes",
        "others",
        "distinction",
        "thing",
        "necessary",
        "property",
        "essential",
        "property",
        "controversial",
        "doubt",
        "aristotle",
        "view",
        "shared",
        "medieval",
        "follower",
        "informed",
        "first",
        "historical",
        "occurrence",
        "debate",
        "existence",
        "discussion",
        "aristotle",
        "seems",
        "seen",
        "nothing",
        "existence",
        "essence",
        "space",
        "articulation",
        "thing",
        "thing",
        "existing",
        "saint",
        "thomas",
        "aquinas",
        "hand",
        "famously",
        "distinguished",
        "thing",
        "essence",
        "existence",
        "aquinas",
        "argued",
        "something",
        "follows",
        "chapter",
        "essence",
        "one",
        "understanding",
        "man",
        "phoenix",
        "without",
        "knowing",
        "whether",
        "exists",
        "existence",
        "something",
        "addition",
        "essence",
        "short",
        "aquinas",
        "argued",
        "existence",
        "separate",
        "property",
        "existence",
        "part",
        "object",
        "nature",
        "object",
        "conceived",
        "thought",
        "separately",
        "existing",
        "long",
        "distinguished",
        "line",
        "philosopher",
        "including",
        "david",
        "hume",
        "immanuel",
        "kant",
        "gottlob",
        "frege",
        "bertrand",
        "russell",
        "followed",
        "aristotle",
        "denying",
        "existence",
        "separate",
        "property",
        "individual",
        "even",
        "rejected",
        "aspect",
        "aristotle",
        "view",
        "hume",
        "argued",
        "treatise",
        "human",
        "nature",
        "impression",
        "existence",
        "distinct",
        "impression",
        "object",
        "ultimately",
        "hume",
        "view",
        "bundle",
        "quality",
        "contentful",
        "idea",
        "derive",
        "impression",
        "hume",
        "concluded",
        "existence",
        "separate",
        "property",
        "object",
        "kant",
        "criticism",
        "ontological",
        "argument",
        "existence",
        "god",
        "rested",
        "rejection",
        "claim",
        "existence",
        "property",
        "object",
        "proponent",
        "ontological",
        "argument",
        "argue",
        "concept",
        "god",
        "entity",
        "perfection",
        "greater",
        "conceived",
        "entail",
        "god",
        "existence",
        "existence",
        "perfection",
        "exists",
        "greater",
        "exist",
        "kant",
        "objected",
        "critique",
        "pure",
        "reason",
        "abab",
        "existence",
        "property",
        "thus",
        "think",
        "thing",
        "whichever",
        "however",
        "many",
        "predicate",
        "like",
        "even",
        "thoroughgoing",
        "determination",
        "least",
        "bit",
        "get",
        "added",
        "thing",
        "posit",
        "addition",
        "thing",
        "otherwise",
        "would",
        "exist",
        "would",
        "thought",
        "concept",
        "could",
        "say",
        "object",
        "concept",
        "exists",
        "ab",
        "finally",
        "frege",
        "russell",
        "maintained",
        "existence",
        "property",
        "individual",
        "instead",
        "secondorder",
        "propertya",
        "property",
        "concept",
        "frege",
        "propositional",
        "function",
        "russell",
        "crudely",
        "say",
        "dinosaur",
        "exist",
        "say",
        "property",
        "dinosaur",
        "instantiated",
        "say",
        "jeanbaptiste",
        "botul",
        "exist",
        "say",
        "propertysay",
        "property",
        "unique",
        "postwar",
        "critic",
        "kant",
        "father",
        "butolismis",
        "instantiated",
        "neither",
        "case",
        "say",
        "individual",
        "exist",
        "neither",
        "frege",
        "russell",
        "thought",
        "made",
        "sense",
        "view",
        "existence",
        "property",
        "individual",
        "became",
        "common",
        "view",
        "early",
        "th",
        "century",
        "aristotle",
        "hume",
        "kant",
        "related",
        "reason",
        "thesis",
        "persuaded",
        "dominant",
        "force",
        "behind",
        "agreement",
        "thought",
        "developed",
        "forcefully",
        "russell",
        "b",
        "denying",
        "existence",
        "firstorder",
        "property",
        "way",
        "avoid",
        "consequence",
        "thing",
        "exist",
        "thus",
        "distinction",
        "existing",
        "second",
        "framing",
        "question",
        "thesis",
        "thing",
        "exist",
        "held",
        "austrian",
        "philosopher",
        "alexius",
        "meinong",
        "existence",
        "genuine",
        "property",
        "individual",
        "meinong",
        "maintained",
        "universally",
        "many",
        "way",
        "motivate",
        "meinongianism",
        "primary",
        "motivation",
        "puzzle",
        "negative",
        "singular",
        "existentialssentences",
        "seem",
        "truly",
        "assert",
        "nonexistence",
        "individual",
        "sentence",
        "jeanbaptiste",
        "botul",
        "exist",
        "order",
        "true",
        "seems",
        "subject",
        "position",
        "must",
        "designate",
        "entity",
        "nonexistence",
        "truly",
        "predicated",
        "case",
        "thingsthe",
        "designation",
        "singular",
        "termsthat",
        "exist",
        "frege",
        "russell",
        "contrast",
        "take",
        "sentence",
        "demonstrate",
        "expression",
        "genuine",
        "singular",
        "term",
        "negative",
        "existentials",
        "general",
        "form",
        "asserting",
        "noninstantiation",
        "property",
        "following",
        "section",
        "discus",
        "frege",
        "russell",
        "account",
        "true",
        "negative",
        "existentials",
        "second",
        "section",
        "discus",
        "meinongianism",
        "comparing",
        "account",
        "true",
        "negative",
        "existentials",
        "offer",
        "meinongian",
        "russellian",
        "account",
        "discussed",
        "first",
        "section",
        "article",
        "end",
        "discussion",
        "antimeinongian",
        "account",
        "according",
        "existence",
        "universal",
        "property",
        "individual",
        "discussion",
        "related",
        "issue",
        "existence",
        "context",
        "quantified",
        "tense",
        "modal",
        "logic"
    ]
}