{
    "main_text": "Philosophies of Facts || Facts, Intentionality, Semantics and Truthmaking\n1.4 Facts, Intentionality, Semantics and Truthmaking\n\nWe have mentioned the view that facts may explain actions and mental\nstates and the view that facts are what we know. Facts are also\ninvoked in the philosophy of mind by philosophers who claim that\njudgments or beliefs enjoy the property of intentionality, of\nbeing “directed towards” something, because they\nrepresent states of affairs or are psychological relations to\nstates of affairs and that judgments and beliefs are correct or\nsatisfied only if states of affairs obtain, that is, if facts exist.\nVersions of these claims are given by many philosophers from Meinong,\nthe early Husserl and Russell to Searle (Searle 1983). Analogous\nclaims in semantics are sometimes made about propositions or other\ntruth-bearers: the proposition that Sam is sad represents the state of\naffairs that Sam is sad and is true only if this state of affairs\nobtains. Versions of this view are given by Husserl, Wittgenstein and\nCarnap. See the\n supplementary document on the History of Philosophies of Facts.\n\nOne objection to the view that the judgment that Sam is sad represents\na state of affairs is that although the judger arguably thinks of Sam\nand of his sadness, he may not possess any concept of a state of\naffairs. (Consider the analogous claim that one may judge that \\(p\\)\nwithout employing the concept of truth). Perhaps then a judgment\nrepresents a state of affairs but does not represent it as a\nstate of affairs. One objection to this claim is that it commits one\nto the ontological view that there are states of affairs which do not\nobtain, the states of affairs represented by false judgments or\nbeliefs.\n\nIf we reject the view that judgments and beliefs represent states of\naffairs, it is still possible to claim that judgments and beliefs have\ncorrectness conditions which mention states of affairs: if \\(x\\)\njudges correctly that \\(p\\), then the state of affairs that \\(p\\)\nobtains. And if this is plausible, so too is the further claim that if\n\\(x\\) judges correctly that \\(p\\), then \\(x\\) judges correctly that\n\\(p\\) because the state of affairs that \\(p\\) obtains. Facts make\njudgments correct.\n\nDoes the proposition that Sam is sad represent the state of affairs\nthat Sam is sad? It may be objected that the proposition does not\nrefer to anything as a state of affairs. And once again the friend of\nstates of affairs may retreat to the safer claims that the proposition\nthat Sam is sad is true only if the state of affairs that Sam is sad\nobtains and that if the proposition that Sam is sad is true, it is\ntrue because the state of affairs obtains. Facts make propositions\ntrue.\n\nFacts, then, are perhaps qualified to play the role of what makes\njudgments correct and propositions true. But the theory of correctness\nand of truth does not require us to accept that there are facts.\nIndeed it may be thought that the requirements of such a theory are\nsatisfied by the observations that a judgment that \\(p\\) is correct\nonly if \\(p\\), and that the proposition that \\(p\\) is true only if\n\\(p\\). If arguments in metaphysics or epistemology persuade us that\nthere are facts, then we may perhaps appeal to facts in giving\naccounts of correctness and of truth. In the case of the theory of\ncorrectness conditions for judgment and belief the argument that\nknowledge is of facts together with the view that, contrary to a long\nand influential tradition, the theory of belief and of judgment\npresupposes a theory of knowledge (Williamson 2000) may persuade us\nthat facts make judgments and beliefs correct.\n\nThe view that facts make propositions or other truth-bearers true is\none theory among many of truthmaking. The theory of truthmaking deals\nwith questions at the intersection between ontology, metaphysics and\nsemantics. The view that facts are what make truth-bearers true is the\noldest theory of truthmaking. One central choice within truthmaker\ntheory is between acceptance and rejection of truthmaker maximalism.\nTruthmaker maximalism is the view that every truth has a truthmaker.\n(It is an analogue of claims about modalities other than the modality\nof truth such as that every necessity is made necessary, that every\nprobability has a probabiliser, that if something has a value there is\nsomething which makes it valuable, a “valifier” etc.)\nFactualist truthmaker maximalism says that every truth is made true by\na fact. Factualist truthmaker maximalism comes in many shapes and\nsizes. It is sometimes combined with the view that propositions\nrepresent states of affairs. It is sometimes defended by friends of\nthe view that facts are obtaining states of affairs (Pfänder\n1921), sometimes by friends of the view that facts are neither true\npropositions nor obtaining states of affairs but exemplifications of\nproperties (Armstrong 2004).\n\nBy far the most popular objection to factualist truthmaker maximalism,\nan objection made by both friends and enemies of facts, is that it is\nontologically baroque, that is to say, incredible. The idea that there\nare negative or conditional facts, the objection goes, is incompatible\nwith the demands of metaphysical economy or with the requirements of\nnaturalism. By far the most popular factualist alternative to\nfactualist truthmaker maximalism is the view that all logically atomic\ntruths have truthmakers and that these are formally simple or atomic\nfacts or the view that the only truthmakers which are facts are\nformally simple. Versions of these views are defended by the logical\natomists (see the entry on the\n correspondence theory of truth\n and\n section 2.4.2\n below).\n\nAppeals to facts as truthmakers presuppose that there are different\nfacts. But it has been argued that if there are any facts, there is\nonly one Great Fact. See the\n supplementary document on the Slingshot Argument.\n\nIf this argument is sound, then theories of facts as truthmakers and\nas what correspond to truths as well as many other theories which rely\non facts, are trivialised.\n\nIn the debate between friends and enemies of factualist truthmaker\nmaximalism it is often assumed that truthmakers must be ontologically\nor metaphysically fundamental. Indeed it is sometimes argued that the\ntheory of truthmaking is a guide to what there is and it is assumed\nthat what there is is just what is ontologically fundamental. The\nassumption may be rejected (see the entry on\n truthmakers).\n Perhaps there are facts but facts are not ontologically fundamental.\n(Compare the claim that there are social entities but that these are\nnot ontologically fundamental.) Then even atomic facts would not be\nontologically fundamental. Perhaps Sam and his concrete state of\nsadness are ontologically fundamental and the fact that Sam is sad is\nnot ontologically fundamental.\n\nWhat might it mean to say that there are facts but they are not\nontologically fundamental? Perhaps that facts or the unity of facts\nare determined by non-facts (Vallicella 2000, Mulligan 2006b).\nPossible candidates for this role are truth-bearers, for example\npropositions, together with what is ontologically fundamental. If\nfacts are not ontologically fundamental, then one objection to\nfactualist truthmaker maximalism misses its mark. According to yet\nanother view, facts are complexes made up of objects and properties\nand those complexes which are facts are less basic than their parts\n(Fine 1982).\n\nAny philosophy of facts owes us an account of the form of such\nexpressions as “the fact that Sam is sad” (Lowe 1998) and\n“the state of affairs that Sam is sad”. (Analogous\nquestions arise concerning the form of “the proposition that Sam\nis sad”, “the property of sadness”, “the\nconcept of sadness” etc.) Friends of facts who have written at\ngreat length about facts and given the distinct impression that they\nare referring to facts and predicating properties of facts have\nnevertheless claimed that facts or situations cannot be named\n(Russell, Wittgenstein; cf. Clarke 1975) or that they have no\nproperties (Ingarden 1965). The expression “the fact that Sam is\nsad” looks like a definite description. What is the form of such\na description? One possibility (Künne 2003: 10) is that it should\nbe read as: the unique \\(x\\) such that \\(x\\) is a fact and \\(x =\\)\nthat Sam is sad.\n\nOne objection to this suggestion is that clauses such as “that\nSam is sad” cannot flank the identity sign. The following\nidentity sentence, on the other hand, is perfectly well-formed and,\nmany friends of facts claim, false:\n\n\nThe fact that Sam is sad = the proposition that Sam is sad\n\n\nThis suggests that clauses such as “that Sam is sad” can\nonly flank the identity sign if they are governed by expressions such\nas “the fact”, “the proposition”, “the\nbelief”. The suggested analysis of our definite descriptions may\nbe motivated by the assumption that “the fact that Sam is\nsad” is derived by nominalising “It is a fact that Sam is\nsad” and the assumption that in the latter sentence “It is\na fact” takes “that Sam is sad” to make a\nsentence.\n\nAnother account of expressions such as “the fact that\nFa” builds on suggestions made by Russell in 1913\n(Hochberg 2001). Let ‘\\(\\mathbf{T}\\)’,\n‘\\(\\mathbf{A}\\)’ and ‘\\(\\mathbf{IN}\\)’ express\nthe relations ‘is a term in’, ‘is an attribute\nin’ and ‘informs’, respectively. These relations are\nthe formal ontological relations between atomic facts, on the one\nhand, and their terms (objects), attributes (properties) and forms, on\nthe other hand. Then the structure of “the fact that Fa\nexists” is: \n\n\\[ \\mathrm{E}![\\iota f(\\mathbf{T}(a, f) \\amp \\mathbf{A}(F, f) \\amp \\mathbf{IN}(\\phi x, f))] \\]\n\n\nThat is, the fact that contains \\(a\\) as a term and \\(F\\) as an\nattribute and that is of the form \\(\\phi x\\) exists. It has also been\nargued that what underlies talk about an object exemplifying a\nproperty is just the relations of being a term in a fact and being an\nattribute in a fact (Sprigge 1970).\n\nHow do expressions such as “the state of affairs that Sam is\nsad” relate to their referents? One view is that they are rigid\ndesignators. (For discussion of this question in connection with\nrelated cases such as instances of “the property of being\n\\(F\\)” and “the proposition that \\(p\\)”, see\nSchnieder 2005, Yagiwasa 1997, Tye 1981).\n",
    "section_title": "1.4 Facts, Intentionality, Semantics and Truthmaking",
    "entry_title": "Facts",
    "hierarchy_title": "Facts || Philosophies of Facts || Facts, Intentionality, Semantics and Truthmaking",
    "tokenized_text": [
        "philosophy",
        "fact",
        "fact",
        "intentionality",
        "semantics",
        "truthmaking",
        "fact",
        "intentionality",
        "semantics",
        "truthmaking",
        "mentioned",
        "view",
        "fact",
        "may",
        "explain",
        "action",
        "mental",
        "state",
        "view",
        "fact",
        "know",
        "fact",
        "also",
        "invoked",
        "philosophy",
        "mind",
        "philosopher",
        "claim",
        "judgment",
        "belief",
        "enjoy",
        "property",
        "intentionality",
        "directed",
        "towards",
        "something",
        "represent",
        "state",
        "affair",
        "psychological",
        "relation",
        "state",
        "affair",
        "judgment",
        "belief",
        "correct",
        "satisfied",
        "state",
        "affair",
        "obtain",
        "fact",
        "exist",
        "version",
        "claim",
        "given",
        "many",
        "philosopher",
        "meinong",
        "early",
        "husserl",
        "russell",
        "searle",
        "searle",
        "analogous",
        "claim",
        "semantics",
        "sometimes",
        "made",
        "proposition",
        "truthbearers",
        "proposition",
        "sam",
        "sad",
        "represents",
        "state",
        "affair",
        "sam",
        "sad",
        "true",
        "state",
        "affair",
        "obtains",
        "version",
        "view",
        "given",
        "husserl",
        "wittgenstein",
        "carnap",
        "see",
        "supplementary",
        "document",
        "history",
        "philosophy",
        "fact",
        "one",
        "objection",
        "view",
        "judgment",
        "sam",
        "sad",
        "represents",
        "state",
        "affair",
        "although",
        "judger",
        "arguably",
        "think",
        "sam",
        "sadness",
        "may",
        "posse",
        "concept",
        "state",
        "affair",
        "consider",
        "analogous",
        "claim",
        "one",
        "may",
        "judge",
        "p",
        "without",
        "employing",
        "concept",
        "truth",
        "perhaps",
        "judgment",
        "represents",
        "state",
        "affair",
        "represent",
        "state",
        "affair",
        "one",
        "objection",
        "claim",
        "commits",
        "one",
        "ontological",
        "view",
        "state",
        "affair",
        "obtain",
        "state",
        "affair",
        "represented",
        "false",
        "judgment",
        "belief",
        "reject",
        "view",
        "judgment",
        "belief",
        "represent",
        "state",
        "affair",
        "still",
        "possible",
        "claim",
        "judgment",
        "belief",
        "correctness",
        "condition",
        "mention",
        "state",
        "affair",
        "x",
        "judge",
        "correctly",
        "p",
        "state",
        "affair",
        "p",
        "obtains",
        "plausible",
        "claim",
        "x",
        "judge",
        "correctly",
        "p",
        "x",
        "judge",
        "correctly",
        "p",
        "state",
        "affair",
        "p",
        "obtains",
        "fact",
        "make",
        "judgment",
        "correct",
        "proposition",
        "sam",
        "sad",
        "represent",
        "state",
        "affair",
        "sam",
        "sad",
        "may",
        "objected",
        "proposition",
        "refer",
        "anything",
        "state",
        "affair",
        "friend",
        "state",
        "affair",
        "may",
        "retreat",
        "safer",
        "claim",
        "proposition",
        "sam",
        "sad",
        "true",
        "state",
        "affair",
        "sam",
        "sad",
        "obtains",
        "proposition",
        "sam",
        "sad",
        "true",
        "true",
        "state",
        "affair",
        "obtains",
        "fact",
        "make",
        "proposition",
        "true",
        "fact",
        "perhaps",
        "qualified",
        "play",
        "role",
        "make",
        "judgment",
        "correct",
        "proposition",
        "true",
        "theory",
        "correctness",
        "truth",
        "require",
        "u",
        "accept",
        "fact",
        "indeed",
        "may",
        "thought",
        "requirement",
        "theory",
        "satisfied",
        "observation",
        "judgment",
        "p",
        "correct",
        "p",
        "proposition",
        "p",
        "true",
        "p",
        "argument",
        "metaphysics",
        "epistemology",
        "persuade",
        "u",
        "fact",
        "may",
        "perhaps",
        "appeal",
        "fact",
        "giving",
        "account",
        "correctness",
        "truth",
        "case",
        "theory",
        "correctness",
        "condition",
        "judgment",
        "belief",
        "argument",
        "knowledge",
        "fact",
        "together",
        "view",
        "contrary",
        "long",
        "influential",
        "tradition",
        "theory",
        "belief",
        "judgment",
        "presupposes",
        "theory",
        "knowledge",
        "williamson",
        "may",
        "persuade",
        "u",
        "fact",
        "make",
        "judgment",
        "belief",
        "correct",
        "view",
        "fact",
        "make",
        "proposition",
        "truthbearers",
        "true",
        "one",
        "theory",
        "among",
        "many",
        "truthmaking",
        "theory",
        "truthmaking",
        "deal",
        "question",
        "intersection",
        "ontology",
        "metaphysics",
        "semantics",
        "view",
        "fact",
        "make",
        "truthbearers",
        "true",
        "oldest",
        "theory",
        "truthmaking",
        "one",
        "central",
        "choice",
        "within",
        "truthmaker",
        "theory",
        "acceptance",
        "rejection",
        "truthmaker",
        "maximalism",
        "truthmaker",
        "maximalism",
        "view",
        "every",
        "truth",
        "truthmaker",
        "analogue",
        "claim",
        "modality",
        "modality",
        "truth",
        "every",
        "necessity",
        "made",
        "necessary",
        "every",
        "probability",
        "probabiliser",
        "something",
        "value",
        "something",
        "make",
        "valuable",
        "valifier",
        "etc",
        "factualist",
        "truthmaker",
        "maximalism",
        "say",
        "every",
        "truth",
        "made",
        "true",
        "fact",
        "factualist",
        "truthmaker",
        "maximalism",
        "come",
        "many",
        "shape",
        "size",
        "sometimes",
        "combined",
        "view",
        "proposition",
        "represent",
        "state",
        "affair",
        "sometimes",
        "defended",
        "friend",
        "view",
        "fact",
        "obtaining",
        "state",
        "affair",
        "pfänder",
        "sometimes",
        "friend",
        "view",
        "fact",
        "neither",
        "true",
        "proposition",
        "obtaining",
        "state",
        "affair",
        "exemplification",
        "property",
        "armstrong",
        "far",
        "popular",
        "objection",
        "factualist",
        "truthmaker",
        "maximalism",
        "objection",
        "made",
        "friend",
        "enemy",
        "fact",
        "ontologically",
        "baroque",
        "say",
        "incredible",
        "idea",
        "negative",
        "conditional",
        "fact",
        "objection",
        "go",
        "incompatible",
        "demand",
        "metaphysical",
        "economy",
        "requirement",
        "naturalism",
        "far",
        "popular",
        "factualist",
        "alternative",
        "factualist",
        "truthmaker",
        "maximalism",
        "view",
        "logically",
        "atomic",
        "truth",
        "truthmakers",
        "formally",
        "simple",
        "atomic",
        "fact",
        "view",
        "truthmakers",
        "fact",
        "formally",
        "simple",
        "version",
        "view",
        "defended",
        "logical",
        "atomists",
        "see",
        "entry",
        "correspondence",
        "theory",
        "truth",
        "section",
        "appeal",
        "fact",
        "truthmakers",
        "presuppose",
        "different",
        "fact",
        "argued",
        "fact",
        "one",
        "great",
        "fact",
        "see",
        "supplementary",
        "document",
        "slingshot",
        "argument",
        "argument",
        "sound",
        "theory",
        "fact",
        "truthmakers",
        "correspond",
        "truth",
        "well",
        "many",
        "theory",
        "rely",
        "fact",
        "trivialised",
        "debate",
        "friend",
        "enemy",
        "factualist",
        "truthmaker",
        "maximalism",
        "often",
        "assumed",
        "truthmakers",
        "must",
        "ontologically",
        "metaphysically",
        "fundamental",
        "indeed",
        "sometimes",
        "argued",
        "theory",
        "truthmaking",
        "guide",
        "assumed",
        "ontologically",
        "fundamental",
        "assumption",
        "may",
        "rejected",
        "see",
        "entry",
        "truthmakers",
        "perhaps",
        "fact",
        "fact",
        "ontologically",
        "fundamental",
        "compare",
        "claim",
        "social",
        "entity",
        "ontologically",
        "fundamental",
        "even",
        "atomic",
        "fact",
        "would",
        "ontologically",
        "fundamental",
        "perhaps",
        "sam",
        "concrete",
        "state",
        "sadness",
        "ontologically",
        "fundamental",
        "fact",
        "sam",
        "sad",
        "ontologically",
        "fundamental",
        "might",
        "mean",
        "say",
        "fact",
        "ontologically",
        "fundamental",
        "perhaps",
        "fact",
        "unity",
        "fact",
        "determined",
        "nonfacts",
        "vallicella",
        "mulligan",
        "b",
        "possible",
        "candidate",
        "role",
        "truthbearers",
        "example",
        "proposition",
        "together",
        "ontologically",
        "fundamental",
        "fact",
        "ontologically",
        "fundamental",
        "one",
        "objection",
        "factualist",
        "truthmaker",
        "maximalism",
        "miss",
        "mark",
        "according",
        "yet",
        "another",
        "view",
        "fact",
        "complex",
        "made",
        "object",
        "property",
        "complex",
        "fact",
        "le",
        "basic",
        "part",
        "fine",
        "philosophy",
        "fact",
        "owes",
        "u",
        "account",
        "form",
        "expression",
        "fact",
        "sam",
        "sad",
        "lowe",
        "state",
        "affair",
        "sam",
        "sad",
        "analogous",
        "question",
        "arise",
        "concerning",
        "form",
        "proposition",
        "sam",
        "sad",
        "property",
        "sadness",
        "concept",
        "sadness",
        "etc",
        "friend",
        "fact",
        "written",
        "great",
        "length",
        "fact",
        "given",
        "distinct",
        "impression",
        "referring",
        "fact",
        "predicating",
        "property",
        "fact",
        "nevertheless",
        "claimed",
        "fact",
        "situation",
        "named",
        "russell",
        "wittgenstein",
        "cf",
        "clarke",
        "property",
        "ingarden",
        "expression",
        "fact",
        "sam",
        "sad",
        "look",
        "like",
        "definite",
        "description",
        "form",
        "description",
        "one",
        "possibility",
        "künne",
        "read",
        "unique",
        "x",
        "x",
        "fact",
        "x",
        "sam",
        "sad",
        "one",
        "objection",
        "suggestion",
        "clause",
        "sam",
        "sad",
        "flank",
        "identity",
        "sign",
        "following",
        "identity",
        "sentence",
        "hand",
        "perfectly",
        "wellformed",
        "many",
        "friend",
        "fact",
        "claim",
        "false",
        "fact",
        "sam",
        "sad",
        "proposition",
        "sam",
        "sad",
        "suggests",
        "clause",
        "sam",
        "sad",
        "flank",
        "identity",
        "sign",
        "governed",
        "expression",
        "fact",
        "proposition",
        "belief",
        "suggested",
        "analysis",
        "definite",
        "description",
        "may",
        "motivated",
        "assumption",
        "fact",
        "sam",
        "sad",
        "derived",
        "nominalising",
        "fact",
        "sam",
        "sad",
        "assumption",
        "latter",
        "sentence",
        "fact",
        "take",
        "sam",
        "sad",
        "make",
        "sentence",
        "another",
        "account",
        "expression",
        "fact",
        "fa",
        "build",
        "suggestion",
        "made",
        "russell",
        "hochberg",
        "let",
        "mathbf",
        "mathbf",
        "mathbf",
        "express",
        "relation",
        "term",
        "attribute",
        "informs",
        "respectively",
        "relation",
        "formal",
        "ontological",
        "relation",
        "atomic",
        "fact",
        "one",
        "hand",
        "term",
        "object",
        "attribute",
        "property",
        "form",
        "hand",
        "structure",
        "fact",
        "fa",
        "exists",
        "mathrm",
        "e",
        "iota",
        "f",
        "mathbf",
        "f",
        "amp",
        "mathbf",
        "f",
        "f",
        "amp",
        "mathbf",
        "phi",
        "x",
        "f",
        "fact",
        "contains",
        "a",
        "term",
        "f",
        "attribute",
        "form",
        "phi",
        "x",
        "exists",
        "also",
        "argued",
        "underlies",
        "talk",
        "object",
        "exemplifying",
        "property",
        "relation",
        "term",
        "fact",
        "attribute",
        "fact",
        "sprigge",
        "expression",
        "state",
        "affair",
        "sam",
        "sad",
        "relate",
        "referent",
        "one",
        "view",
        "rigid",
        "designators",
        "discussion",
        "question",
        "connection",
        "related",
        "case",
        "instance",
        "property",
        "f",
        "proposition",
        "p",
        "see",
        "schnieder",
        "yagiwasa",
        "tye"
    ]
}