{
    "main_text": "Logical Fatalism: Aristotle’s argument and the nature of truth || Aristotle’s solution\n1.1 Aristotle’s solution\n\nFirst we should notice Aristotle’s solution. Aristotle is in no\ndoubt that not everything that happens, happens of necessity. He\naccepts indeed (19a23–5) that “What is, necessarily is,\nwhen it is; and what is not, necessarily is not, when it is\nnot.” But he goes on to say, “But not everything that is,\nnecessarily is; and not everything that is not, necessarily is\nnot.” So what is his solution? Here it must be said that there\nis more than one view (Aristotle, Categories and De\nInterpretatione, 137–42). On one view he rejects the move\nfrom truth to necessity. That may indeed be the right move to make,\nbut in what follows I shall take it that Aristotle actually offers a\ndifferent solution, which, rightly or wrongly, I shall refer to as\n“the Aristotelian solution”. On this view his solution is\nto deny that it is necessary that the affirmation or the negation is\ntrue or false when this relates to things that do not happen of\nnecessity. That is to say, his solution is that neither what the first\nperson said in 1900 (“There will be a sea-battle on\n1/1/2100.”) nor what the second person said (“There will\nnot be a sea-battle on 1/1/2100.”) was true. What each person\nsaid was in fact neither true nor false. So we may represent the\nAristotelian solution as one which rejects the law of bivalence:\n\nThe law of bivalence: every proposition is either true or false.\n\n\nIt is to be rejected in particular in relation to such propositions\nas, “there will be a sea-battle on 1/1/2100”; that is, in\nrelation to propositions about future contingents, about what is\nneither necessary nor impossible. (For the view that Aristotle does\nnot reject the law of bivalence see Whitaker 1996.)\n\nThough Aristotle does not explicitly say so, it seems that he would\nalso accept that if a sea-battle takes place on 1/1/2100, then what\nthe first person said would then be true, and if it does not, what the\nsecond person said would then be true. So we may represent the\nAristotelian solution as holding the following:\n\nSome propositions are true at some times and not at others.\n\n\nAre there any objections to this solution?\n\nOne objection is that the solution appears to require the rejection of\nthe law of the excluded middle in addition to the law of bivalence.\nNow it is true that it involves the rejection of one form of the\nlaw:\n\nLEM1: in the case of any proposition, p, either p is\ntrue or not-p is true.\n\n\nBut another form of the law is:\n\nLEM2: in the case of any proposition, p, either p or\nnot-p.\n\n\nDoes it involve the rejection of this? One might think it does, on the\ngrounds that “p” is equivalent to\n“p is true”. So LEM1 and LEM2 stand or fall\ntogether. Or one might think like this: “p or\nq” can be true only if either p is true or\nq is true (or both are). But, where p is a\nproposition about a future contingent it is not true, whether the\ncontingent state of affairs comes about or not; neither is its\nnegation true; so the disjunction, “p or\nnot-p” is not true.\n\nAs a matter of fact, though, this is not what Aristotle seems to have\nthought. He says (19a28–32):\n\nEverything necessarily is or is not, and will be or will not be; but\none cannot divide and say that one or the other is necessary. I mean,\nfor example: it is necessary for there to be or not to be a sea-battle\ntomorrow; but it is not necessary for a sea-battle to take place\ntomorrow, nor for one not to take place.\n\n\nSo, on the assumption that he would have accepted that “there\nwill or will not be a sea-battle tomorrow” is equivalent to\n“there will be a sea-battle tomorrow or there will not be a\nsea-battle tomorrow”, he would, it seems, have accepted LEM2.\nHow could this be? Well, what stops its being true that there will be\na sea-battle tomorrow is that there is nothing yet to determine that\nit is true. But there is something to determine that there will be or\nwill not be a sea-battle tomorrow; in the nature of things one or the\nother must occur. So it is now true that there will be a sea-battle\ntomorrow or there will not be a sea-battle tomorrow.\n\nThis suggests adopting the following rule for determining the\ntruth-value of complex propositions some of whose constituents are\nneither true nor false. One considers in turn each of the possible\nways in which things may turn out, and works out what truth-value the\ncomplex proposition would then have. If it turns out to be true in\nevery case, it is true; if it turns out to be false in every case, it\nis false; otherwise it is neither true nor false (van Fraassen\n1966).\n\nOf course this is not a wholly cost free line to take. Apart from the\nfact that it means that “p” and “p\nis true” are not in general interchangeable, it also creates\nproblems for truth-functionality. We normally think of\n“or”, “and” and “not” as being\ntruth-functional. That is to say, we think that the truth-values of\n“p or q”, “p and\nq” and “not-p” are determined by\nthe truth-values of “p” and\n“q”. But if we adopt the Aristotelian solution,\nand accept the way outlined just now of determining the truth-value of\na complex proposition, “or”, for instance, will not be\ntruth functional. In some case “p or q”\nwill be true when neither p nor q is true (when, for\ninstance, “q” is “not-p”),\nand in some case it will not be (if, say, “p” is\n“there will be a sea-battle tomorrow” and\n“q” is “there will be a football match\ntomorrow”). (If one thinks in terms of there being a third\ntruth-value, indeterminacy, say, in addition to truth and falsity, the\nposition will be that, when p and q are both\nindeterminate, sometimes “p or q” is\ntrue, and sometimes it is indeterminate.). Similarly “p\nand q” will be false in the one case and indeterminate\nin the other.\n\nHowever, this objection might not seem very pressing compared with the\nthreat of fatalism. If accepting a lack of equivalence between\n“p” and “p is true” and a\nfailure of truth-functionality for “or” and\n“and” were the only alternative to accepting fatalism,\nmost people would find it easier to accept these theoretical oddities,\nif oddities they are.\n\nBut there is another objection to the Aristotelian solution which\nmakes it harder to accept — the way we treat bare predictions.\nIf someone had said in 1972, “Red Rum will win the Grand\nNational next year”, surely, we would think, he was right. Not\nright in 1973, but right in 1972. That is to say, surely what he said\nwas true, when he said it; not just later. Of course, we would not\nhave known in 1972 that what he said was true; nor, presumably did he.\nNor, of course would we have supposed that there was anything\ninevitable about the victory; these things, we naturally suppose, are\na matter of chance. But, of course, this objection to the Aristotelian\nsolution is also an objection to the argument for fatalism which was\nbased on the assumption of bivalence. We are, effectively, rejecting\nthe idea that if what someone says at a time is true at that time,\nthen the state of the world at the time must determine that it is\ntrue. What we seem to be quite prepared to accept instead is the idea\nthat for what is said to be true at a time it is sufficient if the\nstate of the world will sometime be such as to determine that\nit is true.\n\nThere is another problem about the theory of truth which the\nAristotelian argument seems to be invoking. If the theory really is\nthat the truth of what is said depends on the state of the world at\nthe time of the saying, does not that raise a problem for statements\nabout the past? Suppose someone says that a dinosaur stood on this\nspot millions of years ago. For this to be true, must the present\nstate of the world be such as to determine that it is? Some people\nhave indeed thought this; and they have thought that, just as some\npropositions that were not true come to be true, so also some that\nwere true cease to be true (Łukasiewicz 1967). But this is even\nfurther from what we are naturally inclined to say. A more attractive\nalternative, if we wished to retain something like this theory of\ntruth, would be to say that what happened in the past counts as part\nof the present state of the world, because the past, like the present,\nis necessary. But it is not clear why that should be enough to make it\npart of the present state of the world. Perhaps it would be better to\ntake the view simply that something is true at a time only if it is\nnecessary at that time. But then we would need some argument for this\nposition which went beyond the simple thought that what is said is\nmade true by the way the world is at the time it is said.\n\nIt is worth noticing some other solutions which are closely related to\nthe Aristotelian solution, but avoid some of the problems.\n",
    "section_title": "1.1 Aristotle’s solution",
    "entry_title": "Fatalism",
    "hierarchy_title": "Fatalism || Logical Fatalism: Aristotle’s argument and the nature of truth || Aristotle’s solution",
    "tokenized_text": [
        "logical",
        "fatalism",
        "aristotle",
        "argument",
        "nature",
        "truth",
        "aristotle",
        "solution",
        "aristotle",
        "solution",
        "first",
        "notice",
        "aristotle",
        "solution",
        "aristotle",
        "doubt",
        "everything",
        "happens",
        "happens",
        "necessity",
        "accepts",
        "indeed",
        "a",
        "necessarily",
        "necessarily",
        "not",
        "go",
        "say",
        "everything",
        "necessarily",
        "everything",
        "necessarily",
        "not",
        "solution",
        "must",
        "said",
        "one",
        "view",
        "aristotle",
        "category",
        "de",
        "interpretatione",
        "one",
        "view",
        "reject",
        "move",
        "truth",
        "necessity",
        "may",
        "indeed",
        "right",
        "move",
        "make",
        "follows",
        "shall",
        "take",
        "aristotle",
        "actually",
        "offer",
        "different",
        "solution",
        "rightly",
        "wrongly",
        "shall",
        "refer",
        "aristotelian",
        "solution",
        "view",
        "solution",
        "deny",
        "necessary",
        "affirmation",
        "negation",
        "true",
        "false",
        "relates",
        "thing",
        "happen",
        "necessity",
        "say",
        "solution",
        "neither",
        "first",
        "person",
        "said",
        "seabattle",
        "second",
        "person",
        "said",
        "seabattle",
        "true",
        "person",
        "said",
        "fact",
        "neither",
        "true",
        "false",
        "may",
        "represent",
        "aristotelian",
        "solution",
        "one",
        "reject",
        "law",
        "bivalence",
        "law",
        "bivalence",
        "every",
        "proposition",
        "either",
        "true",
        "false",
        "rejected",
        "particular",
        "relation",
        "proposition",
        "seabattle",
        "relation",
        "proposition",
        "future",
        "contingent",
        "neither",
        "necessary",
        "impossible",
        "view",
        "aristotle",
        "reject",
        "law",
        "bivalence",
        "see",
        "whitaker",
        "though",
        "aristotle",
        "explicitly",
        "say",
        "seems",
        "would",
        "also",
        "accept",
        "seabattle",
        "take",
        "place",
        "first",
        "person",
        "said",
        "would",
        "true",
        "second",
        "person",
        "said",
        "would",
        "true",
        "may",
        "represent",
        "aristotelian",
        "solution",
        "holding",
        "following",
        "proposition",
        "true",
        "time",
        "others",
        "objection",
        "solution",
        "one",
        "objection",
        "solution",
        "appears",
        "require",
        "rejection",
        "law",
        "excluded",
        "middle",
        "addition",
        "law",
        "bivalence",
        "true",
        "involves",
        "rejection",
        "one",
        "form",
        "law",
        "lem",
        "case",
        "proposition",
        "p",
        "either",
        "p",
        "true",
        "notp",
        "true",
        "another",
        "form",
        "law",
        "lem",
        "case",
        "proposition",
        "p",
        "either",
        "p",
        "notp",
        "involve",
        "rejection",
        "one",
        "might",
        "think",
        "ground",
        "p",
        "equivalent",
        "p",
        "true",
        "lem",
        "lem",
        "stand",
        "fall",
        "together",
        "one",
        "might",
        "think",
        "like",
        "p",
        "q",
        "true",
        "either",
        "p",
        "true",
        "q",
        "true",
        "p",
        "proposition",
        "future",
        "contingent",
        "true",
        "whether",
        "contingent",
        "state",
        "affair",
        "come",
        "neither",
        "negation",
        "true",
        "disjunction",
        "p",
        "notp",
        "true",
        "matter",
        "fact",
        "though",
        "aristotle",
        "seems",
        "thought",
        "say",
        "a",
        "everything",
        "necessarily",
        "one",
        "divide",
        "say",
        "one",
        "necessary",
        "mean",
        "example",
        "necessary",
        "seabattle",
        "tomorrow",
        "necessary",
        "seabattle",
        "take",
        "place",
        "tomorrow",
        "one",
        "take",
        "place",
        "assumption",
        "would",
        "accepted",
        "seabattle",
        "tomorrow",
        "equivalent",
        "seabattle",
        "tomorrow",
        "seabattle",
        "tomorrow",
        "would",
        "seems",
        "accepted",
        "lem",
        "could",
        "well",
        "stop",
        "true",
        "seabattle",
        "tomorrow",
        "nothing",
        "yet",
        "determine",
        "true",
        "something",
        "determine",
        "seabattle",
        "tomorrow",
        "nature",
        "thing",
        "one",
        "must",
        "occur",
        "true",
        "seabattle",
        "tomorrow",
        "seabattle",
        "tomorrow",
        "suggests",
        "adopting",
        "following",
        "rule",
        "determining",
        "truthvalue",
        "complex",
        "proposition",
        "whose",
        "constituent",
        "neither",
        "true",
        "false",
        "one",
        "considers",
        "turn",
        "possible",
        "way",
        "thing",
        "may",
        "turn",
        "work",
        "truthvalue",
        "complex",
        "proposition",
        "would",
        "turn",
        "true",
        "every",
        "case",
        "true",
        "turn",
        "false",
        "every",
        "case",
        "false",
        "otherwise",
        "neither",
        "true",
        "false",
        "van",
        "fraassen",
        "course",
        "wholly",
        "cost",
        "free",
        "line",
        "take",
        "apart",
        "fact",
        "mean",
        "p",
        "p",
        "true",
        "general",
        "interchangeable",
        "also",
        "creates",
        "problem",
        "truthfunctionality",
        "normally",
        "think",
        "truthfunctional",
        "say",
        "think",
        "truthvalues",
        "p",
        "q",
        "p",
        "q",
        "notp",
        "determined",
        "truthvalues",
        "p",
        "q",
        "adopt",
        "aristotelian",
        "solution",
        "accept",
        "way",
        "outlined",
        "determining",
        "truthvalue",
        "complex",
        "proposition",
        "instance",
        "truth",
        "functional",
        "case",
        "p",
        "q",
        "true",
        "neither",
        "p",
        "q",
        "true",
        "instance",
        "q",
        "notp",
        "case",
        "say",
        "p",
        "seabattle",
        "tomorrow",
        "q",
        "football",
        "match",
        "tomorrow",
        "one",
        "think",
        "term",
        "third",
        "truthvalue",
        "indeterminacy",
        "say",
        "addition",
        "truth",
        "falsity",
        "position",
        "p",
        "q",
        "indeterminate",
        "sometimes",
        "p",
        "q",
        "true",
        "sometimes",
        "indeterminate",
        "similarly",
        "p",
        "q",
        "false",
        "one",
        "case",
        "indeterminate",
        "however",
        "objection",
        "might",
        "seem",
        "pressing",
        "compared",
        "threat",
        "fatalism",
        "accepting",
        "lack",
        "equivalence",
        "p",
        "p",
        "true",
        "failure",
        "truthfunctionality",
        "alternative",
        "accepting",
        "fatalism",
        "people",
        "would",
        "find",
        "easier",
        "accept",
        "theoretical",
        "oddity",
        "oddity",
        "another",
        "objection",
        "aristotelian",
        "solution",
        "make",
        "harder",
        "accept",
        "way",
        "treat",
        "bare",
        "prediction",
        "someone",
        "said",
        "red",
        "rum",
        "win",
        "grand",
        "national",
        "next",
        "year",
        "surely",
        "would",
        "think",
        "right",
        "right",
        "right",
        "say",
        "surely",
        "said",
        "true",
        "said",
        "later",
        "course",
        "would",
        "known",
        "said",
        "true",
        "presumably",
        "course",
        "would",
        "supposed",
        "anything",
        "inevitable",
        "victory",
        "thing",
        "naturally",
        "suppose",
        "matter",
        "chance",
        "course",
        "objection",
        "aristotelian",
        "solution",
        "also",
        "objection",
        "argument",
        "fatalism",
        "based",
        "assumption",
        "bivalence",
        "effectively",
        "rejecting",
        "idea",
        "someone",
        "say",
        "time",
        "true",
        "time",
        "state",
        "world",
        "time",
        "must",
        "determine",
        "true",
        "seem",
        "quite",
        "prepared",
        "accept",
        "instead",
        "idea",
        "said",
        "true",
        "time",
        "sufficient",
        "state",
        "world",
        "sometime",
        "determine",
        "true",
        "another",
        "problem",
        "theory",
        "truth",
        "aristotelian",
        "argument",
        "seems",
        "invoking",
        "theory",
        "really",
        "truth",
        "said",
        "depends",
        "state",
        "world",
        "time",
        "saying",
        "raise",
        "problem",
        "statement",
        "past",
        "suppose",
        "someone",
        "say",
        "dinosaur",
        "stood",
        "spot",
        "million",
        "year",
        "ago",
        "true",
        "must",
        "present",
        "state",
        "world",
        "determine",
        "people",
        "indeed",
        "thought",
        "thought",
        "proposition",
        "true",
        "come",
        "true",
        "also",
        "true",
        "cease",
        "true",
        "łukasiewicz",
        "even",
        "naturally",
        "inclined",
        "say",
        "attractive",
        "alternative",
        "wished",
        "retain",
        "something",
        "like",
        "theory",
        "truth",
        "would",
        "say",
        "happened",
        "past",
        "count",
        "part",
        "present",
        "state",
        "world",
        "past",
        "like",
        "present",
        "necessary",
        "clear",
        "enough",
        "make",
        "part",
        "present",
        "state",
        "world",
        "perhaps",
        "would",
        "better",
        "take",
        "view",
        "simply",
        "something",
        "true",
        "time",
        "necessary",
        "time",
        "would",
        "need",
        "argument",
        "position",
        "went",
        "beyond",
        "simple",
        "thought",
        "said",
        "made",
        "true",
        "way",
        "world",
        "time",
        "said",
        "worth",
        "noticing",
        "solution",
        "closely",
        "related",
        "aristotelian",
        "solution",
        "avoid",
        "problem"
    ]
}