{
    "main_text": "Twentieth Century Feminist Criticism of Analytic Philosophy\n5. Twentieth Century Feminist Criticism of Analytic Philosophy\n\nAlthough every philosophical method is subject to feminist critique,\n“classic” analytic philosophy might seem to be a paradigm\ncase of “male-biased philosophy”—a kind of\nphilosophy least hospitable to feminist values. Among the features\nthat feminists have criticized are that it is committed to pure\nobjectivity and value-neutrality, and uses an unlocated, disembodied,\ndisinterested, autonomous individual reasoner, knower, and agent.\nHaving stated it this boldly, let us look briefly at examples of late\ntwentieth-century arguments offered by feminists who themselves had\nanalytic training that became classic critiques of analytic\nphilosophy. In\n Section 6\n we will turn to the responses of other analytic feminists to\nunderstand why they nevertheless find valuable resources in the\nanalytic tradition.\n\nIn some respects it is hard to disentangle feminist\nphilosophers’ critiques of analytic philosophy from their\nbroader critiques of Western thought because sometimes their critique\nof analytic philosophy is supported by their critiques of either its\nantecedents in modern philosophy or its sister scientific disciplines.\nFor example, when Jaggar criticized abstract individualism and other\nconcepts of modern liberal political theory her critique was also\nrelevant to the disinterested, detached investigator prized by the\nlogical positivists. Jaggar faults liberalism for\n\nits normative dualism that arises when the mental capacity for\nrationality is “what is especially valuable about human\nbeings” (1983: 40),\nabstract individualism—“the assumption that the\nessential human characteristics are properties of individuals and are\ngiven independently of any particular social context” (1983:\n42), and\nits assumption that rationality is instrumental, value-neutral,\nand detached.\n\n\nJaggar did not claim that her critique applied to analytic philosophy\nbeyond positivism, but notes that neopositivist values are held in\nnormative theories even in the late twentieth century. She is\nthinking, for example, of political or moral theorists’\ncharacterization of objectivity as impartiality and lack of bias\n(1983: 357).\n\nAmong Sandra Harding’s analyses of the discourses upon which\nfeminists draw, the most relevant to analytic philosophy is her\naccount of empiricism as practiced by natural and social scientists.\nAlthough Harding is speaking about scientists rather than\nphilosophers, her critique of the limitations of the empiricist\nview—especially its assumed account of “value-free”\nobjectivity—is also applicable to philosophers who utilize this\nconcept of objectivity. Harding advocates that feminists retain a\nnotion of objectivity that incorporates appropriate values (her\n“strong objectivity”) and criticizes the\nempiricists’ alleged “value-free” objectivity by the\nuse of the arguments below.\n\nIt perpetuates the values of the researchers, and is, in differing\nways, both too narrow and too broad. It is too narrow because it can\ndetect only values that differ between researchers and\n“competent” critics, and too broad because it purports to\neliminate all social values, when it may well be that some values\nbenefit science while others undermine it (Harding 1991:\n143–4).\nIt is politically and morally regressive; for example, it\nconstructs science in a way that permits scientists to be “fast\nguns for hire” rather than individuals who attend to the moral\nand political values that support and are implied by their actions.\n(Harding 1991: 158–9)\nIt is linked to other implausible views. Examples include, first,\nthat only false beliefs have social causes while true beliefs have\nnatural ones, and, second, that the ideal agent must create and\nconstantly police the borders of a gulf, a no-man’s-land,\nbetween himself as the subject and the object of his research,\nknowledge, or action\n\nin order to be “a self whose mind would perfectly reflect the\nworld” (1991: 158). Harding utilizes Nancy Hartsock’s term\n“abstract masculinity” for this last idea (Harding 1991:\n158).\n\n\nNancy Holland utilizes the overlapping critiques of Harding and\nJaggar, particularly that of abstract individualism, and takes them to\nbe telling of Anglo-American philosophy in general (she considers\nLocke and Hume as well as contemporary analytic philosophers to\nexemplify Anglo-American philosophy). Holland focuses on the\nmetaphysical assumptions of empiricism that exclude women from\nphilosophy. She writes that contemporary analytic philosophy,\n\n\nby remaining within the Empiricist tradition, inherits not only the\nproblems of that tradition, but also a self-definition that identifies\nit as necessarily men’s philosophy…. [Men’s]\nphilosophy defines itself throughout its history in such a way as to\nexclude what our culture defines as women’s experience from what\nis considered to be properly philosophical. (1990: 3)\n\n\nAlthough Jane Duran values the rigor of analytic philosophy and wants\nto incorporate it into feminist epistemology, she sees analytic\nepistemology (“pure epistemology”) as a recent incarnation\nof “a masculinist, androcentric tradition that yields a\nhypernormative, idealized, and stylistically aggressive mode of\nthought” (1991: 8). She appeals not only to Harding, but also to\nEvelyn Fox Keller (1985) and Susan Bordo (1987) as well as to Janice\nMoulton’s (1983) critique of the adversary paradigm discussed\nabove in\n Section 4.\n Duran’s examples of traits that have been seen as androcentric\ninclude,\n\n\nanalysis in terms of logically necessary and sufficient conditions,\nlack of allusion to descriptively adequate models, the importance of\ncounterexampling, putative universalization of the conditions, and so\nforth. (1991: 44)\n\n\nNaomi Scheman refers to herself as an “analytic philosopher\nsemi-manqué”—one who has left the analytic\nneighborhood of her philosophical training. She has made several kinds\nof arguments that bear on the adequacy of analytic philosophy: the\nimpact of individualism in philosophy of mind, the nature of the self,\nand the nature of the normative philosophical subject (see her papers\ncollected in 1993 and 2011). For example, Scheman argues that it is\nthe ideology of liberal individualism rather than sound argument that\nunderlies the widespread belief that psychological objects such as\n“emotions, beliefs, intentions, virtues, and vices” are\nproperties of individuals (1993: 37). In fact, part of Jaggar’s\nargument against abstract individualism relies on Scheman’s\nconceptual point that questions of identifying and interpreting\npsychological states must be answered in a social context, not in\nabstraction from it. Scheman acknowledges her debt to Wittgenstein in\nmaking this point, but goes beyond his views by arguing that\nwomen’s experiences and psychosexual development do not bear out\nthis kind of individualistic assumption.\n\nIn other essays Scheman argues that the philosophical\n“we”—the subject who has philosophical\nproblems—is a normative subject, one that bears the\nmarkings of various kinds of privilege. Her examples of normative\nsubjects are the ideally rational scientist or the citizen of a\nliberal state (1993: 7). In this way she shifts her argument away from\nthe experiences and developmental differences between actual men and\nwomen (or between white people/people of color, or other actual\ndifferences of privilege/marginality) in order to focus on the\nconnection between privilege and normativity. If one were to take a\nFreudian-tinted view that philosophical problems are\n“intellectual sublimations of the neuroses of privilege”,\nthen their resolution would come, à la Wittgenstein, through\nchanges in our forms of life (1993:\n 8).[9]\n\nLorraine Code is among those who have criticized analytic philosophy\nfor use of a moral-epistemic individual who is “abstract,\n‘generalized,’ and disengaged” and a tradition that\nis more concerned with what an ideal agent or knower would do than\nwith a real one (1995: xi). Code uses the example of an\n“S knows that p” epistemology to focus one\nof her most widely known critiques. The knowing subject S, in\nwhat Code hyphenates as the “positivist-empiricist”\nepistemology, is an individual—a detached, neutral,\ninterchangeable spectator whose knowledge is most reliable when his or\nher sensory observations occur in ideal conditions, not real, everyday\nones. Code argues that “S knows that p”\nmodels of knowledge work only in a prescribed area; indeed, they favor\na narrow kind of scientific knowledge. A more adequate\ncharacterization of knowing must be applicable to a broad range of\nexamples in the lives of real people. In order to do so, it cannot use\nthe interchangeable subject, S, but must include subjective\nfeatures of S such as the person’s identity, interests or\ncircumstances. For without these features we cannot explain complex,\nrelational knowing, for example, knowing a person. In addition, an\nadequate account of knowledge should uncover ways in which political\ninterests are used to determine who is allowed to be a standard\nknower, that is, an S (Code 1991, 1995, 1998). This is only one\nof Code’s early lines of argument against analytic philosophy.\nIn\n Section 7\n we will discuss her arguments that point to the limitations of\nnaturalized epistemology in the analytic style as well.\n\nAs we close our discussion of some of the important classic feminist\ncritiques of analytic philosophy, recall that another criticism was\ndiscussed in\n Section 4:\n Janice Moulton’s critique of the adversary method as a paradigm\nof philosophy. Although use of the adversary method need not be\nlimited to analytic philosophers, Moulton’s critique is clearly\napplicable to widespread practices in twentieth century analytic\nphilosophy.\n",
    "section_title": "5. Twentieth Century Feminist Criticism of Analytic Philosophy",
    "entry_title": "Analytic Feminism",
    "hierarchy_title": "Analytic Feminism || Twentieth Century Feminist Criticism of Analytic Philosophy",
    "tokenized_text": [
        "twentieth",
        "century",
        "feminist",
        "criticism",
        "analytic",
        "philosophy",
        "twentieth",
        "century",
        "feminist",
        "criticism",
        "analytic",
        "philosophy",
        "although",
        "every",
        "philosophical",
        "method",
        "subject",
        "feminist",
        "critique",
        "classic",
        "analytic",
        "philosophy",
        "might",
        "seem",
        "paradigm",
        "case",
        "malebiased",
        "philosophy",
        "a",
        "kind",
        "philosophy",
        "least",
        "hospitable",
        "feminist",
        "value",
        "among",
        "feature",
        "feminist",
        "criticized",
        "committed",
        "pure",
        "objectivity",
        "valueneutrality",
        "us",
        "unlocated",
        "disembodied",
        "disinterested",
        "autonomous",
        "individual",
        "reasoner",
        "knower",
        "agent",
        "stated",
        "boldly",
        "let",
        "u",
        "look",
        "briefly",
        "example",
        "late",
        "twentiethcentury",
        "argument",
        "offered",
        "feminist",
        "analytic",
        "training",
        "became",
        "classic",
        "critique",
        "analytic",
        "philosophy",
        "section",
        "turn",
        "response",
        "analytic",
        "feminist",
        "understand",
        "nevertheless",
        "find",
        "valuable",
        "resource",
        "analytic",
        "tradition",
        "respect",
        "hard",
        "disentangle",
        "feminist",
        "philosopher",
        "critique",
        "analytic",
        "philosophy",
        "broader",
        "critique",
        "western",
        "thought",
        "sometimes",
        "critique",
        "analytic",
        "philosophy",
        "supported",
        "critique",
        "either",
        "antecedent",
        "modern",
        "philosophy",
        "sister",
        "scientific",
        "discipline",
        "example",
        "jaggar",
        "criticized",
        "abstract",
        "individualism",
        "concept",
        "modern",
        "liberal",
        "political",
        "theory",
        "critique",
        "also",
        "relevant",
        "disinterested",
        "detached",
        "investigator",
        "prized",
        "logical",
        "positivist",
        "jaggar",
        "fault",
        "liberalism",
        "normative",
        "dualism",
        "arises",
        "mental",
        "capacity",
        "rationality",
        "especially",
        "valuable",
        "human",
        "being",
        "abstract",
        "individualism",
        "assumption",
        "essential",
        "human",
        "characteristic",
        "property",
        "individual",
        "given",
        "independently",
        "particular",
        "social",
        "context",
        "assumption",
        "rationality",
        "instrumental",
        "valueneutral",
        "detached",
        "jaggar",
        "claim",
        "critique",
        "applied",
        "analytic",
        "philosophy",
        "beyond",
        "positivism",
        "note",
        "neopositivist",
        "value",
        "held",
        "normative",
        "theory",
        "even",
        "late",
        "twentieth",
        "century",
        "thinking",
        "example",
        "political",
        "moral",
        "theorist",
        "characterization",
        "objectivity",
        "impartiality",
        "lack",
        "bias",
        "among",
        "sandra",
        "harding",
        "analysis",
        "discourse",
        "upon",
        "feminist",
        "draw",
        "relevant",
        "analytic",
        "philosophy",
        "account",
        "empiricism",
        "practiced",
        "natural",
        "social",
        "scientist",
        "although",
        "harding",
        "speaking",
        "scientist",
        "rather",
        "philosopher",
        "critique",
        "limitation",
        "empiricist",
        "viewespecially",
        "assumed",
        "account",
        "valuefree",
        "objectivityis",
        "also",
        "applicable",
        "philosopher",
        "utilize",
        "concept",
        "objectivity",
        "harding",
        "advocate",
        "feminist",
        "retain",
        "notion",
        "objectivity",
        "incorporates",
        "appropriate",
        "value",
        "strong",
        "objectivity",
        "criticizes",
        "empiricist",
        "alleged",
        "valuefree",
        "objectivity",
        "use",
        "argument",
        "perpetuates",
        "value",
        "researcher",
        "differing",
        "way",
        "narrow",
        "broad",
        "narrow",
        "detect",
        "value",
        "differ",
        "researcher",
        "competent",
        "critic",
        "broad",
        "purport",
        "eliminate",
        "social",
        "value",
        "may",
        "well",
        "value",
        "benefit",
        "science",
        "others",
        "undermine",
        "harding",
        "politically",
        "morally",
        "regressive",
        "example",
        "construct",
        "science",
        "way",
        "permit",
        "scientist",
        "fast",
        "gun",
        "hire",
        "rather",
        "individual",
        "attend",
        "moral",
        "political",
        "value",
        "support",
        "implied",
        "action",
        "harding",
        "linked",
        "implausible",
        "view",
        "example",
        "include",
        "first",
        "false",
        "belief",
        "social",
        "cause",
        "true",
        "belief",
        "natural",
        "one",
        "second",
        "ideal",
        "agent",
        "must",
        "create",
        "constantly",
        "police",
        "border",
        "gulf",
        "noman",
        "sland",
        "subject",
        "object",
        "research",
        "knowledge",
        "action",
        "order",
        "self",
        "whose",
        "mind",
        "would",
        "perfectly",
        "reflect",
        "world",
        "harding",
        "utilizes",
        "nancy",
        "hartsock",
        "term",
        "abstract",
        "masculinity",
        "last",
        "idea",
        "harding",
        "nancy",
        "holland",
        "utilizes",
        "overlapping",
        "critique",
        "harding",
        "jaggar",
        "particularly",
        "abstract",
        "individualism",
        "take",
        "telling",
        "angloamerican",
        "philosophy",
        "general",
        "considers",
        "locke",
        "hume",
        "well",
        "contemporary",
        "analytic",
        "philosopher",
        "exemplify",
        "angloamerican",
        "philosophy",
        "holland",
        "focus",
        "metaphysical",
        "assumption",
        "empiricism",
        "exclude",
        "woman",
        "philosophy",
        "writes",
        "contemporary",
        "analytic",
        "philosophy",
        "remaining",
        "within",
        "empiricist",
        "tradition",
        "inherits",
        "problem",
        "tradition",
        "also",
        "selfdefinition",
        "identifies",
        "necessarily",
        "men",
        "philosophy",
        "men",
        "philosophy",
        "defines",
        "throughout",
        "history",
        "way",
        "exclude",
        "culture",
        "defines",
        "woman",
        "experience",
        "considered",
        "properly",
        "philosophical",
        "although",
        "jane",
        "duran",
        "value",
        "rigor",
        "analytic",
        "philosophy",
        "want",
        "incorporate",
        "feminist",
        "epistemology",
        "see",
        "analytic",
        "epistemology",
        "pure",
        "epistemology",
        "recent",
        "incarnation",
        "masculinist",
        "androcentric",
        "tradition",
        "yield",
        "hypernormative",
        "idealized",
        "stylistically",
        "aggressive",
        "mode",
        "thought",
        "appeal",
        "harding",
        "also",
        "evelyn",
        "fox",
        "keller",
        "susan",
        "bordo",
        "well",
        "janice",
        "moulton",
        "critique",
        "adversary",
        "paradigm",
        "discussed",
        "section",
        "duran",
        "example",
        "trait",
        "seen",
        "androcentric",
        "include",
        "analysis",
        "term",
        "logically",
        "necessary",
        "sufficient",
        "condition",
        "lack",
        "allusion",
        "descriptively",
        "adequate",
        "model",
        "importance",
        "counterexampling",
        "putative",
        "universalization",
        "condition",
        "forth",
        "naomi",
        "scheman",
        "refers",
        "analytic",
        "philosopher",
        "semimanqué",
        "one",
        "left",
        "analytic",
        "neighborhood",
        "philosophical",
        "training",
        "made",
        "several",
        "kind",
        "argument",
        "bear",
        "adequacy",
        "analytic",
        "philosophy",
        "impact",
        "individualism",
        "philosophy",
        "mind",
        "nature",
        "self",
        "nature",
        "normative",
        "philosophical",
        "subject",
        "see",
        "paper",
        "collected",
        "example",
        "scheman",
        "argues",
        "ideology",
        "liberal",
        "individualism",
        "rather",
        "sound",
        "argument",
        "underlies",
        "widespread",
        "belief",
        "psychological",
        "object",
        "emotion",
        "belief",
        "intention",
        "virtue",
        "vice",
        "property",
        "individual",
        "fact",
        "part",
        "jaggar",
        "argument",
        "abstract",
        "individualism",
        "relies",
        "scheman",
        "conceptual",
        "point",
        "question",
        "identifying",
        "interpreting",
        "psychological",
        "state",
        "must",
        "answered",
        "social",
        "context",
        "abstraction",
        "scheman",
        "acknowledges",
        "debt",
        "wittgenstein",
        "making",
        "point",
        "go",
        "beyond",
        "view",
        "arguing",
        "woman",
        "experience",
        "psychosexual",
        "development",
        "bear",
        "kind",
        "individualistic",
        "assumption",
        "essay",
        "scheman",
        "argues",
        "philosophical",
        "the",
        "subject",
        "philosophical",
        "problemsis",
        "normative",
        "subject",
        "one",
        "bear",
        "marking",
        "various",
        "kind",
        "privilege",
        "example",
        "normative",
        "subject",
        "ideally",
        "rational",
        "scientist",
        "citizen",
        "liberal",
        "state",
        "way",
        "shift",
        "argument",
        "away",
        "experience",
        "developmental",
        "difference",
        "actual",
        "men",
        "woman",
        "white",
        "peoplepeople",
        "color",
        "actual",
        "difference",
        "privilegemarginality",
        "order",
        "focus",
        "connection",
        "privilege",
        "normativity",
        "one",
        "take",
        "freudiantinted",
        "view",
        "philosophical",
        "problem",
        "intellectual",
        "sublimation",
        "neurosis",
        "privilege",
        "resolution",
        "would",
        "come",
        "à",
        "la",
        "wittgenstein",
        "change",
        "form",
        "life",
        "lorraine",
        "code",
        "among",
        "criticized",
        "analytic",
        "philosophy",
        "use",
        "moralepistemic",
        "individual",
        "abstract",
        "generalized",
        "disengaged",
        "tradition",
        "concerned",
        "ideal",
        "agent",
        "knower",
        "would",
        "real",
        "one",
        "xi",
        "code",
        "us",
        "example",
        "know",
        "p",
        "epistemology",
        "focus",
        "one",
        "widely",
        "known",
        "critique",
        "knowing",
        "subject",
        "code",
        "hyphenates",
        "positivistempiricist",
        "epistemology",
        "individuala",
        "detached",
        "neutral",
        "interchangeable",
        "spectator",
        "whose",
        "knowledge",
        "reliable",
        "sensory",
        "observation",
        "occur",
        "ideal",
        "condition",
        "real",
        "everyday",
        "one",
        "code",
        "argues",
        "know",
        "p",
        "model",
        "knowledge",
        "work",
        "prescribed",
        "area",
        "indeed",
        "favor",
        "narrow",
        "kind",
        "scientific",
        "knowledge",
        "adequate",
        "characterization",
        "knowing",
        "must",
        "applicable",
        "broad",
        "range",
        "example",
        "life",
        "real",
        "people",
        "order",
        "use",
        "interchangeable",
        "subject",
        "must",
        "include",
        "subjective",
        "feature",
        "person",
        "identity",
        "interest",
        "circumstance",
        "without",
        "feature",
        "explain",
        "complex",
        "relational",
        "knowing",
        "example",
        "knowing",
        "person",
        "addition",
        "adequate",
        "account",
        "knowledge",
        "uncover",
        "way",
        "political",
        "interest",
        "used",
        "determine",
        "allowed",
        "standard",
        "knower",
        "code",
        "one",
        "code",
        "early",
        "line",
        "argument",
        "analytic",
        "philosophy",
        "section",
        "discus",
        "argument",
        "point",
        "limitation",
        "naturalized",
        "epistemology",
        "analytic",
        "style",
        "well",
        "close",
        "discussion",
        "important",
        "classic",
        "feminist",
        "critique",
        "analytic",
        "philosophy",
        "recall",
        "another",
        "criticism",
        "discussed",
        "section",
        "janice",
        "moulton",
        "critique",
        "adversary",
        "method",
        "paradigm",
        "philosophy",
        "although",
        "use",
        "adversary",
        "method",
        "need",
        "limited",
        "analytic",
        "philosopher",
        "moulton",
        "critique",
        "clearly",
        "applicable",
        "widespread",
        "practice",
        "twentieth",
        "century",
        "analytic",
        "philosophy"
    ]
}