{
    "main_text": "Early Feminist Contributions to American Pragmatism\n1. Early Feminist Contributions to American Pragmatism\n\nWomen were significant partners in the development and articulation of\nclassical American pragmatism. Historical analyses bring into view\nthe lives of philosophers and activists such as Jane Addams, Mary\nParker Follett, Charlotte Perkins Gilman, Emily Greene Balch, Lucy\nSprague Mitchell, Anna Julia Cooper, Mary Whiton Calkins, and Ella\nFlagg Young. These women bring added dimensions to pragmatism; they\nremind us of the issues that were subsequently left behind as American\nphilosophy became more exclusively technical and academic. For most of\nthese women, pragmatism was a philosophic practice used to accommodate\ntheir new academic and political engagement with the world, as well as\na method of reforming politics and culture. The pragmatist approach to\nphilosophy that brought theory and practice together helped these\nwomen trust in and learn from experience and intellectually engage in\na host of social reform movements.\n\nThe historical recovery of female voices in the history of philosophy\nin the last few decades is an ongoing project; it both helps us become\naware of women’s influence on the history of philosophy and\nshines a light on the processes that lead to the marginalization of women’s\nvoices (see the entry\n feminist history of philosophy).\n Recovering these women thinkers also allows us to hear new or\nexcluded voices in the philosophic conversation, in some cases\nresulting in opening up the definition of philosophy itself.\nRecognizing “philosophical techniques are means, not\nends”, these women rejected “philosophizing as an\nintellectual game that takes purely logical analysis as its special\ntask…” (Seigfried 1996: 37). Because of the gender-based\ndiscrimination against women as rational thinkers and their exclusion\nfrom the academy, history has rarely carried the names and texts of\nthese women into our philosophy textbooks (see for example Eileen\nO’Neill’s 1998 essay “Disappearing Ink”).\nThus, it should not be surprising that many of the women whose work\nhas been brought into the feminist-pragmatist discussion were\ncollege-educated activists rather than professional academic\nphilosophers; nevertheless, scholarship has shown that their\nwork had an enormous impact on the development of pragmatist thought.\nA historical look at how these women affected what became known as\npragmatism demonstrates the interactive and relational nature of\nphilosophizing.\n\nThe history of pragmatism is recent enough that we can more easily\nrecover and recognize the women who participated in forming this\nuniquely American school of thought, formerly considered only through\nthe work of such male thinkers as William James, Charles Sanders\nPeirce, George Herbert Mead, George Santayana, and John Dewey. The\nwork of women who were in philosophic and activist dialogue with these\nphilosophers, and who were original philosophers in their own right,\nhad mostly disappeared until the latter part of the twentieth\ncentury. Charlene Haddock Seigfried’s work, particularly her\n1996 book Pragmatism and Feminism, was central in the effort\nto bring these invisible women back into the philosophical discussion,\nas well as to bring feminist perspectives to the field of\npragmatism.\n\nIn the Progressive Era, many of the college-educated social reformers\nin the Chicago area lived at Hull House or were associated with the\nUniversity of Chicago. Some of the Hull-House reformers, such as\nSophonisba Breckinridge and Edith and Grace Abbott, held academic\npositions but did most of their academic and activist work in the\nrealm of social reform. Some, such as Julia Lathrop and Florence\nKelly, went on to hold influential governmental positions. Other\nfeminist pragmatists working on social and philosophic issues worked\nwith James and Royce at Harvard or were engaged with feminist reforms\nin other fields such as suffrage activism or peace work. Early\nfeminist pragmatists included the following women:\n\nJane Addams (1860–1935) was a central figure in\nthe development of pragmatist thought. In her lifetime Addams was\nrevered as one of America’s most famous social reformers, the\nfounder of Hull House, and the recipient of the 1931 Nobel Peace Prize.\nHer pragmatist philosophies emerged from her experiences working in\nthe poverty-stricken immigrant neighborhoods of Chicago, from her\ncollaborations with the talented women who lived at Hull House, as\nwell from reflection on texts and direct dialogue with philosophers of\nher time (including John Dewey, William James, George Herbert Mead, and W.E.B.\nDuBois). Addams published eleven books and hundreds of essays, writing\non ethics, social philosophy, and pacifism, in addition to analyzing\nsocial issues concerning women, industrialization, immigration, urban\nyouth, and international mediation.\n\nEmily Greene Balch (1867–1961) was a member of\nthe first graduating class at Bryn Mawr, engaging in graduate studies\nat the University of Chicago and the Harvard Annex, and ultimately\nteaching at Wellesley College for over 20 years. Along with Addams,\nshe was a founding member of Women’s International League for\nPeace and Freedom. While trained as a sociologist and an economist,\nevidence of pragmatist philosophy is abundant in her work. This is\nparticularly true in her support of social democracy and in her\nfundamental faith that the social environment was capable of\ntransformation through philosophical reflection and action. Her\ncommitment to pluralism and economic justice led her to work on\nsuffrage activism and global racial justice. She received the Nobel\nPeace Prize in 1946.\n\nElla Lyman Cabot (1866–1934) struggled to be a\nphilosopher in the male-dominated philosophies of early\n20th century. She took classes at Harvard and Radcliffe\nwith James and Royce. She continued to be part of the Harvard\nphilosophical community and as such was also a formative influence on\nothers’ writings. She was also a longtime advocate of\nwomen’s rights. She wrote seven books on ethics and\neducation. Her work was recovered in John Kaag’s 2013\nbook Pragmatism, Feminism, and Idealism in the Philosophy of Ella\nLyman Cabot.\n\nMary Whiton Calkins (1863–1930) studied under\npragmatists William James and Josiah Royce at Harvard, primarily\nworking in psychology, which was then a sub-field of philosophy. In\n1905, Calkins became the first woman president of the American\nPsychological Association and in 1918 became the first woman president\nof the American Philosophical Association. She was an advocate for\nwomen’s suffrage, claiming in 1905 that “a distinction\nbased on difference of sex is artificial and illogical” (Harper\n(ed.) 1922: 171). While not generally categorized as a pragmatist\nphilosopher, her influence as a female philosopher created a pathway\nfor other women philosophers.\n\nElsie Ripley Clapp (1882–1965) was a student of\nclassical pragmatists, taking over fourteen courses from Dewey at\nColumbia, working as his graduate assistant, and collaborating on\nresearch projects with him for years (see Seigfried 2001:\n89–90). Clapp commented on drafts of Dewey’s work, and\ncontributed original ideas (Seigfried 1996: 92). Dewey publicly\nacknowledged Clapp for her contributions to Democracy and\nEducation, but only in the introduction, not attributing to her\nany particular ideas in the body of the text. At his retirement in\n1927, Dewey suggested that Clapp should be appointed to teach his\ncourses at the Teachers College, but she was not offered the position\nby the college. She went on to collaborate with Eleanor Roosevelt on\nsignificant rural education projects of her time.\n\nAnna Julia Cooper (1858–1954) was an\neducational reformer, particularly focused on the education of\nAfrican-American women. She received her BA and MA at Oberlin College\nand earned her Ph.D. at the Sorbonne at the age of 66. Her writings\nabout the dual oppressions of race and gender are considered one of\nthe foundations of contemporary feminist theories of\nintersectionality. She is best known for her 1892 book, A Voice\nfrom the South by a Black Woman of the South.\n\nAlice Chipman Dewey (1858–1927) is generally\ncredited with bringing Dewey’s philosophic Hegelian thinking\ninto contact with real social issues. She was raised in Michigan by\nher pioneering grandfather and attended a Baptist seminary after high\nschool. Her lifelong interest in education led her to be a school\nteacher. This work along with her commitment to the women’s\nrights movement led her to study at the University of Michigan where\nshe met John Dewey. Their daughter Jane described Alice’s\ninfluence on John by saying that “things which previously had\nbeen matters of theory acquired through his contact with her a vital\nand direct human significance” (Rockefeller 1991: 150).  Alice\nDewey continued her interest in education as principal of University\nof Chicago Lab School where she worked with Dewey on experimental and\nexperiential education reform. \n\nMary Parker Follett (1868–1933) studied with\nRoyce, James, and Hart at Radcliffe/Harvard. Her academic training was\nprimarily in political theory and philosophy. Like Addams and many of\nthe feminist pragmatists of her era, her philosophy was developed out\nof her deep engagement with issues in her Boston community, and from\nobserving how people interact in public life.  Follett thought that\nthe simple act of voting would never change society and thus never\ndirectly advocated for women’s suffrage.  Like most pragmatists,\nFollett critiqued the dualism of individualism claiming “(t)he\ngroup and the individual come into existence simultaneously”\n(1918: 127). Follett’s advocacy of “power-with”\nrather than “power-over” in political as well as\norganizational work is considered a precursor to contemporary feminist\nanalyses of power (see Pratt 2011; Kaag 2011; Whipps 2014b). Follett\npublished three books and many essays and speeches. Her work has\ngained new significance in contemporary management theory and in\nmodern leadership studies.\n\nCharlotte Perkins Gilman (1860–1935) was a\nlifelong friend of both John Dewey and Jane Addams. Gilman stayed at Hull House\nfor about a month in 1895 where she lectured and explored the\nsettlement culture. Gilman, not formally trained in philosophy, was\ninterested in the philosophy of “find(ing) out what ailed\nsociety and how most easily to improve it” (Upin 1993: 42).\nGilman was particularly concerned with the industrial and economic\nconditions of women, both in the home and in the workplace. She sought\nto use philosophy in order to address the social and political\nproblems of her time and place, particularly related to women’s\nissues. She is the author of nine novels, including the feminist\nutopian novel Herland, and ten works of nonfiction, including\nWomen and Economics: A Study of the Economic Relation Between Men\nand Women as a Factor in Social Evolution. Gilman’s short\nstory “The Yellow Wallpaper” is a classic in feminist\nliterature.\n\nLucy Sprague Mitchell (1878–1967) was born in\nthe generation after Jane Addams and was a student of the classical\npragmatists. As a feminist educator she both defined and reflected the\nprogressive era philosophies of reform and social change through\neducational progress. In 1903, Mitchell became the first dean of women\nat the University of California at Berkeley where she encountered the\nsexism that was pervasive in the academy in that era. After moving\nback to New York, she began a 60-year career in child-centered\neducation, combining educational scholarship in both research and\npractice, with founding and administrating innovative programs. In her\nlifetime, she was also seen as an example for other women who were\ninterested in professional lives while marrying and raising children,\nsomething that was rarely available to the women of her\ngeneration. Mitchell’s Bank Street School demonstrated\nthe effectiveness of pragmatist child-centered education and continues\nto influence childhood development specialists and educators.\n\nElla Flagg Young (1845–1918) was a lifelong\neducator and then administrator in the school system in Chicago, and\nlater was a professor of education at the University of Chicago. She\nwas elected the first woman president of the National Education\nAssociation and worked for women’s suffrage. According to\nSeigfried, Dewey was specific about how Young’s “original\ninterpretations and applications of his theories went beyond his own\nunderstanding” (Seigfried 1996: 80).  According to Joan K. Smith (1977), Young\nbegan taking classes from John Dewey at the University of Chicago in\nthe fall of 1895; at that point she had over 30 years of experience in\nteaching and administration. She published three books on\neducation.\n",
    "section_title": "1. Early Feminist Contributions to American Pragmatism",
    "entry_title": "Pragmatist Feminism",
    "hierarchy_title": "Pragmatist Feminism || Early Feminist Contributions to American Pragmatism",
    "tokenized_text": [
        "early",
        "feminist",
        "contribution",
        "american",
        "pragmatism",
        "early",
        "feminist",
        "contribution",
        "american",
        "pragmatism",
        "woman",
        "significant",
        "partner",
        "development",
        "articulation",
        "classical",
        "american",
        "pragmatism",
        "historical",
        "analysis",
        "bring",
        "view",
        "life",
        "philosopher",
        "activist",
        "jane",
        "addams",
        "mary",
        "parker",
        "follett",
        "charlotte",
        "perkins",
        "gilman",
        "emily",
        "greene",
        "balch",
        "lucy",
        "sprague",
        "mitchell",
        "anna",
        "julia",
        "cooper",
        "mary",
        "whiton",
        "calkin",
        "ella",
        "flagg",
        "young",
        "woman",
        "bring",
        "added",
        "dimension",
        "pragmatism",
        "remind",
        "u",
        "issue",
        "subsequently",
        "left",
        "behind",
        "american",
        "philosophy",
        "became",
        "exclusively",
        "technical",
        "academic",
        "woman",
        "pragmatism",
        "philosophic",
        "practice",
        "used",
        "accommodate",
        "new",
        "academic",
        "political",
        "engagement",
        "world",
        "well",
        "method",
        "reforming",
        "politics",
        "culture",
        "pragmatist",
        "approach",
        "philosophy",
        "brought",
        "theory",
        "practice",
        "together",
        "helped",
        "woman",
        "trust",
        "learn",
        "experience",
        "intellectually",
        "engage",
        "host",
        "social",
        "reform",
        "movement",
        "historical",
        "recovery",
        "female",
        "voice",
        "history",
        "philosophy",
        "last",
        "decade",
        "ongoing",
        "project",
        "help",
        "u",
        "become",
        "aware",
        "woman",
        "influence",
        "history",
        "philosophy",
        "shine",
        "light",
        "process",
        "lead",
        "marginalization",
        "woman",
        "voice",
        "see",
        "entry",
        "feminist",
        "history",
        "philosophy",
        "recovering",
        "woman",
        "thinker",
        "also",
        "allows",
        "u",
        "hear",
        "new",
        "excluded",
        "voice",
        "philosophic",
        "conversation",
        "case",
        "resulting",
        "opening",
        "definition",
        "philosophy",
        "recognizing",
        "philosophical",
        "technique",
        "mean",
        "end",
        "woman",
        "rejected",
        "philosophizing",
        "intellectual",
        "game",
        "take",
        "purely",
        "logical",
        "analysis",
        "special",
        "task",
        "seigfried",
        "genderbased",
        "discrimination",
        "woman",
        "rational",
        "thinker",
        "exclusion",
        "academy",
        "history",
        "rarely",
        "carried",
        "name",
        "text",
        "woman",
        "philosophy",
        "textbook",
        "see",
        "example",
        "eileen",
        "neill",
        "essay",
        "disappearing",
        "ink",
        "thus",
        "surprising",
        "many",
        "woman",
        "whose",
        "work",
        "brought",
        "feministpragmatist",
        "discussion",
        "collegeeducated",
        "activist",
        "rather",
        "professional",
        "academic",
        "philosopher",
        "nevertheless",
        "scholarship",
        "shown",
        "work",
        "enormous",
        "impact",
        "development",
        "pragmatist",
        "thought",
        "historical",
        "look",
        "woman",
        "affected",
        "became",
        "known",
        "pragmatism",
        "demonstrates",
        "interactive",
        "relational",
        "nature",
        "philosophizing",
        "history",
        "pragmatism",
        "recent",
        "enough",
        "easily",
        "recover",
        "recognize",
        "woman",
        "participated",
        "forming",
        "uniquely",
        "american",
        "school",
        "thought",
        "formerly",
        "considered",
        "work",
        "male",
        "thinker",
        "william",
        "james",
        "charles",
        "sander",
        "peirce",
        "george",
        "herbert",
        "mead",
        "george",
        "santayana",
        "john",
        "dewey",
        "work",
        "woman",
        "philosophic",
        "activist",
        "dialogue",
        "philosopher",
        "original",
        "philosopher",
        "right",
        "mostly",
        "disappeared",
        "latter",
        "part",
        "twentieth",
        "century",
        "charlene",
        "haddock",
        "seigfried",
        "work",
        "particularly",
        "book",
        "pragmatism",
        "feminism",
        "central",
        "effort",
        "bring",
        "invisible",
        "woman",
        "back",
        "philosophical",
        "discussion",
        "well",
        "bring",
        "feminist",
        "perspective",
        "field",
        "pragmatism",
        "progressive",
        "era",
        "many",
        "collegeeducated",
        "social",
        "reformer",
        "chicago",
        "area",
        "lived",
        "hull",
        "house",
        "associated",
        "university",
        "chicago",
        "hullhouse",
        "reformer",
        "sophonisba",
        "breckinridge",
        "edith",
        "grace",
        "abbott",
        "held",
        "academic",
        "position",
        "academic",
        "activist",
        "work",
        "realm",
        "social",
        "reform",
        "julia",
        "lathrop",
        "florence",
        "kelly",
        "went",
        "hold",
        "influential",
        "governmental",
        "position",
        "feminist",
        "pragmatist",
        "working",
        "social",
        "philosophic",
        "issue",
        "worked",
        "james",
        "royce",
        "harvard",
        "engaged",
        "feminist",
        "reform",
        "field",
        "suffrage",
        "activism",
        "peace",
        "work",
        "early",
        "feminist",
        "pragmatist",
        "included",
        "following",
        "woman",
        "jane",
        "addams",
        "central",
        "figure",
        "development",
        "pragmatist",
        "thought",
        "lifetime",
        "addams",
        "revered",
        "one",
        "america",
        "famous",
        "social",
        "reformer",
        "founder",
        "hull",
        "house",
        "recipient",
        "nobel",
        "peace",
        "prize",
        "pragmatist",
        "philosophy",
        "emerged",
        "experience",
        "working",
        "povertystricken",
        "immigrant",
        "neighborhood",
        "chicago",
        "collaboration",
        "talented",
        "woman",
        "lived",
        "hull",
        "house",
        "well",
        "reflection",
        "text",
        "direct",
        "dialogue",
        "philosopher",
        "time",
        "including",
        "john",
        "dewey",
        "william",
        "james",
        "george",
        "herbert",
        "mead",
        "web",
        "dubois",
        "addams",
        "published",
        "eleven",
        "book",
        "hundred",
        "essay",
        "writing",
        "ethic",
        "social",
        "philosophy",
        "pacifism",
        "addition",
        "analyzing",
        "social",
        "issue",
        "concerning",
        "woman",
        "industrialization",
        "immigration",
        "urban",
        "youth",
        "international",
        "mediation",
        "emily",
        "greene",
        "balch",
        "member",
        "first",
        "graduating",
        "class",
        "bryn",
        "mawr",
        "engaging",
        "graduate",
        "study",
        "university",
        "chicago",
        "harvard",
        "annex",
        "ultimately",
        "teaching",
        "wellesley",
        "college",
        "year",
        "along",
        "addams",
        "founding",
        "member",
        "woman",
        "international",
        "league",
        "peace",
        "freedom",
        "trained",
        "sociologist",
        "economist",
        "evidence",
        "pragmatist",
        "philosophy",
        "abundant",
        "work",
        "particularly",
        "true",
        "support",
        "social",
        "democracy",
        "fundamental",
        "faith",
        "social",
        "environment",
        "capable",
        "transformation",
        "philosophical",
        "reflection",
        "action",
        "commitment",
        "pluralism",
        "economic",
        "justice",
        "led",
        "work",
        "suffrage",
        "activism",
        "global",
        "racial",
        "justice",
        "received",
        "nobel",
        "peace",
        "prize",
        "ella",
        "lyman",
        "cabot",
        "struggled",
        "philosopher",
        "maledominated",
        "philosophy",
        "early",
        "th",
        "century",
        "took",
        "class",
        "harvard",
        "radcliffe",
        "james",
        "royce",
        "continued",
        "part",
        "harvard",
        "philosophical",
        "community",
        "also",
        "formative",
        "influence",
        "others",
        "writing",
        "also",
        "longtime",
        "advocate",
        "woman",
        "right",
        "wrote",
        "seven",
        "book",
        "ethic",
        "education",
        "work",
        "recovered",
        "john",
        "kaag",
        "book",
        "pragmatism",
        "feminism",
        "idealism",
        "philosophy",
        "ella",
        "lyman",
        "cabot",
        "mary",
        "whiton",
        "calkin",
        "studied",
        "pragmatist",
        "william",
        "james",
        "josiah",
        "royce",
        "harvard",
        "primarily",
        "working",
        "psychology",
        "subfield",
        "philosophy",
        "calkin",
        "became",
        "first",
        "woman",
        "president",
        "american",
        "psychological",
        "association",
        "became",
        "first",
        "woman",
        "president",
        "american",
        "philosophical",
        "association",
        "advocate",
        "woman",
        "suffrage",
        "claiming",
        "distinction",
        "based",
        "difference",
        "sex",
        "artificial",
        "illogical",
        "harper",
        "ed",
        "generally",
        "categorized",
        "pragmatist",
        "philosopher",
        "influence",
        "female",
        "philosopher",
        "created",
        "pathway",
        "woman",
        "philosopher",
        "elsie",
        "ripley",
        "clapp",
        "student",
        "classical",
        "pragmatist",
        "taking",
        "fourteen",
        "course",
        "dewey",
        "columbia",
        "working",
        "graduate",
        "assistant",
        "collaborating",
        "research",
        "project",
        "year",
        "see",
        "seigfried",
        "clapp",
        "commented",
        "draft",
        "dewey",
        "work",
        "contributed",
        "original",
        "idea",
        "seigfried",
        "dewey",
        "publicly",
        "acknowledged",
        "clapp",
        "contribution",
        "democracy",
        "education",
        "introduction",
        "attributing",
        "particular",
        "idea",
        "body",
        "text",
        "retirement",
        "dewey",
        "suggested",
        "clapp",
        "appointed",
        "teach",
        "course",
        "teacher",
        "college",
        "offered",
        "position",
        "college",
        "went",
        "collaborate",
        "eleanor",
        "roosevelt",
        "significant",
        "rural",
        "education",
        "project",
        "time",
        "anna",
        "julia",
        "cooper",
        "educational",
        "reformer",
        "particularly",
        "focused",
        "education",
        "africanamerican",
        "woman",
        "received",
        "ba",
        "oberlin",
        "college",
        "earned",
        "phd",
        "sorbonne",
        "age",
        "writing",
        "dual",
        "oppression",
        "race",
        "gender",
        "considered",
        "one",
        "foundation",
        "contemporary",
        "feminist",
        "theory",
        "intersectionality",
        "best",
        "known",
        "book",
        "voice",
        "south",
        "black",
        "woman",
        "south",
        "alice",
        "chipman",
        "dewey",
        "generally",
        "credited",
        "bringing",
        "dewey",
        "philosophic",
        "hegelian",
        "thinking",
        "contact",
        "real",
        "social",
        "issue",
        "raised",
        "michigan",
        "pioneering",
        "grandfather",
        "attended",
        "baptist",
        "seminary",
        "high",
        "school",
        "lifelong",
        "interest",
        "education",
        "led",
        "school",
        "teacher",
        "work",
        "along",
        "commitment",
        "woman",
        "right",
        "movement",
        "led",
        "study",
        "university",
        "michigan",
        "met",
        "john",
        "dewey",
        "daughter",
        "jane",
        "described",
        "alice",
        "influence",
        "john",
        "saying",
        "thing",
        "previously",
        "matter",
        "theory",
        "acquired",
        "contact",
        "vital",
        "direct",
        "human",
        "significance",
        "rockefeller",
        "alice",
        "dewey",
        "continued",
        "interest",
        "education",
        "principal",
        "university",
        "chicago",
        "lab",
        "school",
        "worked",
        "dewey",
        "experimental",
        "experiential",
        "education",
        "reform",
        "mary",
        "parker",
        "follett",
        "studied",
        "royce",
        "james",
        "hart",
        "radcliffeharvard",
        "academic",
        "training",
        "primarily",
        "political",
        "theory",
        "philosophy",
        "like",
        "addams",
        "many",
        "feminist",
        "pragmatist",
        "era",
        "philosophy",
        "developed",
        "deep",
        "engagement",
        "issue",
        "boston",
        "community",
        "observing",
        "people",
        "interact",
        "public",
        "life",
        "follett",
        "thought",
        "simple",
        "act",
        "voting",
        "would",
        "never",
        "change",
        "society",
        "thus",
        "never",
        "directly",
        "advocated",
        "woman",
        "suffrage",
        "like",
        "pragmatist",
        "follett",
        "critiqued",
        "dualism",
        "individualism",
        "claiming",
        "group",
        "individual",
        "come",
        "existence",
        "simultaneously",
        "follett",
        "advocacy",
        "powerwith",
        "rather",
        "powerover",
        "political",
        "well",
        "organizational",
        "work",
        "considered",
        "precursor",
        "contemporary",
        "feminist",
        "analysis",
        "power",
        "see",
        "pratt",
        "kaag",
        "whipps",
        "b",
        "follett",
        "published",
        "three",
        "book",
        "many",
        "essay",
        "speech",
        "work",
        "gained",
        "new",
        "significance",
        "contemporary",
        "management",
        "theory",
        "modern",
        "leadership",
        "study",
        "charlotte",
        "perkins",
        "gilman",
        "lifelong",
        "friend",
        "john",
        "dewey",
        "jane",
        "addams",
        "gilman",
        "stayed",
        "hull",
        "house",
        "month",
        "lectured",
        "explored",
        "settlement",
        "culture",
        "gilman",
        "formally",
        "trained",
        "philosophy",
        "interested",
        "philosophy",
        "find",
        "ing",
        "ailed",
        "society",
        "easily",
        "improve",
        "upin",
        "gilman",
        "particularly",
        "concerned",
        "industrial",
        "economic",
        "condition",
        "woman",
        "home",
        "workplace",
        "sought",
        "use",
        "philosophy",
        "order",
        "address",
        "social",
        "political",
        "problem",
        "time",
        "place",
        "particularly",
        "related",
        "woman",
        "issue",
        "author",
        "nine",
        "novel",
        "including",
        "feminist",
        "utopian",
        "novel",
        "herland",
        "ten",
        "work",
        "nonfiction",
        "including",
        "woman",
        "economics",
        "study",
        "economic",
        "relation",
        "men",
        "woman",
        "factor",
        "social",
        "evolution",
        "gilman",
        "short",
        "story",
        "yellow",
        "wallpaper",
        "classic",
        "feminist",
        "literature",
        "lucy",
        "sprague",
        "mitchell",
        "born",
        "generation",
        "jane",
        "addams",
        "student",
        "classical",
        "pragmatist",
        "feminist",
        "educator",
        "defined",
        "reflected",
        "progressive",
        "era",
        "philosophy",
        "reform",
        "social",
        "change",
        "educational",
        "progress",
        "mitchell",
        "became",
        "first",
        "dean",
        "woman",
        "university",
        "california",
        "berkeley",
        "encountered",
        "sexism",
        "pervasive",
        "academy",
        "era",
        "moving",
        "back",
        "new",
        "york",
        "began",
        "year",
        "career",
        "childcentered",
        "education",
        "combining",
        "educational",
        "scholarship",
        "research",
        "practice",
        "founding",
        "administrating",
        "innovative",
        "program",
        "lifetime",
        "also",
        "seen",
        "example",
        "woman",
        "interested",
        "professional",
        "life",
        "marrying",
        "raising",
        "child",
        "something",
        "rarely",
        "available",
        "woman",
        "generation",
        "mitchell",
        "bank",
        "street",
        "school",
        "demonstrated",
        "effectiveness",
        "pragmatist",
        "childcentered",
        "education",
        "continues",
        "influence",
        "childhood",
        "development",
        "specialist",
        "educator",
        "ella",
        "flagg",
        "young",
        "lifelong",
        "educator",
        "administrator",
        "school",
        "system",
        "chicago",
        "later",
        "professor",
        "education",
        "university",
        "chicago",
        "elected",
        "first",
        "woman",
        "president",
        "national",
        "education",
        "association",
        "worked",
        "woman",
        "suffrage",
        "according",
        "seigfried",
        "dewey",
        "specific",
        "young",
        "original",
        "interpretation",
        "application",
        "theory",
        "went",
        "beyond",
        "understanding",
        "seigfried",
        "according",
        "joan",
        "k",
        "smith",
        "young",
        "began",
        "taking",
        "class",
        "john",
        "dewey",
        "university",
        "chicago",
        "fall",
        "point",
        "year",
        "experience",
        "teaching",
        "administration",
        "published",
        "three",
        "book",
        "education"
    ]
}