{
    "main_text": "Analytic Feminists’ Responses to Critiques\n6. Analytic Feminists’ Responses to Critiques\n\nThe most frequent kinds of responses by analytic feminists to feminist\ncritiques of analytic philosophy are variations of the following\narguments and claims:\n\nFeminist critiques may have been legitimate for\nsome kinds of analytic philosophy, especially logical positivism, but\nbecause analytic philosophy has changed, the objections do not hold\nfor most contemporary work. The analytic feminist then develops a\nstrand of analytic philosophy that is not subject to a particular kind\nof objection, for example, that knowers are unlocated.\nThere were errors of interpretation in\nfeminists’ critiques, for example, concerning the extent to\nwhich analytic philosophy incorporated empiricism. After correction,\nanalytic philosophy will not be vulnerable to this particular kind of\ncriticism.\nCritics have gone too far in undermining fields of\nphilosophy such as metaphysics and central concepts such as\nrationality. Such fields and concepts are needed both on philosophical\nand feminist grounds.\n\n\nAll three kinds of responses allow analytic feminists to engage in\nactivities on which they thrive—disentangling strands of\nargument from each other, making distinctions among concepts,\nsearching for kernels of truth among points with which they disagree,\nand so on.\n\nResponse (1).\n Regardless of the precise characterization of contemporary analytic\nphilosophy, it clearly cannot to be equated with logical positivism.\nSo to the degree that feminist critiques focus on logical positivism\nrather than current analytic work, they will likely be off the mark.\nAs analytic feminists respond to other feminists’ critiques,\nthey try to decipher which strands of analytic philosophy might be\nmost useful and the degree to which old assumptions and concepts that\nare male-biased still linger. Although some feminists have defended\nfacets of the work of Neurath (Okrulik 2004) and Carnap (Yap 2010) as\nuseful for feminism, most analytic feminists find resources in\nphilosophers who themselves reject central dogmas and methods of\nclassical analytic philosophy, for example,\n Wittgenstein,\n J.L. Austin,\n Quine,\n Davidson, and others.\n\nLet’s take as examples of argument (1) feminists who believe\nthat useful strands of analytic philosophy will be\nnaturalized in some way. We need to cast a wide, permissive\nnet here for what counts as “naturalized” and to\nacknowledge some controversies over its relation to analytic\nphilosophy and to feminism. As used here, “naturalized\nphilosophy” includes philosophy that is explicitly informed\nby, rather than replaced by, empirical information about knowers,\nagents, and social structures from psychology/cognitive science,\nsociology, anthropology, and elsewhere. Although most analytic\nfeminists favor “naturalizing” philosophy (with a strong\npreference for its subcategory of social epistemology), they are\ncritical of many nonfeminist ways of doing\n it.[10]\n\nFor example, the focus in traditional naturalized epistemology on\n“individual” rather than “social” sciences\nneglects the “situatedness” of our thinking. A final\ncaveat about terminology: since there is disagreement over the proper\nscope of both “naturalized” and “analytic”,\nsome will object that naturalized philosophy is not a strand of\nanalytic philosophy at all. For example, Quine, who might be\nconsidered the father of naturalized epistemology, fits squarely into\nour characterization of analytic philosophy; however, Lynn Hankinson\nNelson considers him post-analytic (Nelson and Nelson 2003). And, of\ncourse, there is no necessary link between naturalized philosophy and\nanalytic philosophy in any case; one need only think of Foucault or\nDewey to sever that connection.\n\nKeeping in mind all these caveats and controversies, let’s turn\nto the example of naturalized epistemology to consider what\n“naturalizing” can do to help feminists overcome\ndifficulties with analytic philosophy. Feminists criticize analytic\nphilosophy for its concepts of a knower (and an agent), for example,\nthat it is an individual who is abstract, idealized,\ninterchangeable, unlocated, disconnected, disembodied, disinterested,\netc. The first thing that naturalized epistemology can do is to shift\nthe focus from the abstract or idealized knower to the concrete facets\nof the person who has beliefs and knowledge. Although this move is not\nin itself feminist, Jane Duran finds it a positive step toward\n“gynocentric”, i.e., woman-centered, epistemology. She\nbelieves that naturalized epistemology—by its descriptive\ncharacter and its concern with the context and details of\nknowing—is capable of including features valued by feminist\nstandpoint epistemology, for example, the relational aspects of\nknowing and the grounding that knowledge has in the body and in\nactivities of daily life (1991: 112, 246). Duran is one of the first\nfeminists who explicitly combined feminist standpoint theory with\nanalytically oriented naturalized epistemology, and is an exception to\nthe widespread tendency of analytic feminists to stay clear of\ngynocentrism. Of course, one need not agree with the specifics of\nDuran’s analysis to appreciate the importance of naturalized\nepistemology’s descriptive attention to context and concrete\ndetails: this descriptive attention allows gender into\nepistemology as facets of the knower and the context become\nrelevant. One can then debate what kinds of social structures,\nindividual variations, and their interactions are fruitful avenues of\nexploration.\n\nA second naturalized approach is Louise Antony’s argument\nconcerning a different aspect of the knower—neutrality. Antony\nmaintains that naturalized epistemology resolves the “paradox of\nbias” (how one can consistently critique male bias and at the\nsame time object to the notion of unbiased, neutral, objective, or\nimpartial knowledge). Naturalized epistemology rejects the ideal of\nneutrality and instead gives us empirical norms by which to\ndifferentiate good from bad biases, that is, biases that lead us\ntoward rather than away from truth (1993 [2002: 113–116,\n 134–144]).[11]\n Antony also engages in many other facets of the debate between\nanalytic and non-analytic feminists to which we will return later.\n\nA third strategy, still within the context of a naturalized\nepistemology/philosophy of science, is to change the relationship\nbetween empiricism and the individual. Lynn Hankinson Nelson and Helen\nLongino are empiricists not in the style of Locke or Hume, but in\ntheir positions that evidence comes from the senses, from\nexperience (Nelson 1990: 21; Longino 1990: 215). This is encapsulated\nby saying that empiricism is a theory of evidence. Using different\nlines of argument, they both shift the focus from the individual to\ncommunities. Nelson argues that communities rather than individuals\n“‘acquire’ and possess knowledge” (Nelson\n1990: 14). She wants to use both Quinian and feminist\nresources to forge an empiricism sufficiently rich and sophisticated\nto overcome critiques of earlier feminist empiricism offered, for\nexample, by Harding as well as to avoid feminist objections\nto individualism (whether to Jaggar’s “abstract\nindividualism” or the other forms discussed above). Nelson\nmaintains that Quine—while remaining an empiricist—had\nalready undermined or abandoned many of the postpositivist\ncharacteristics to which Jaggar and Harding object. Thus empiricism,\ntempered by Nelson’s focus on communities as knowers, can\nadequately take into account the social identities of knowers and the\ncomplex dependencies of individuals on epistemological\ncommunities.\n\nHelen Longino’s approach in Science as Social Knowledge\n(1990) is to argue that among the many ways in which science is social\nis that epistemological norms apply to practices of\ncommunities, not just to individuals. In The Fate of\nKnowledge (2002), she further develops her contextual empiricist\nargument along lines that break down the dichotomy between the\nrational and the social (and many other dichotomies along the way).\nAlthough her argument has a wide scope, we are now concerned only with\nthe ways in which her view breaks the connection between individualism\nand empiricism. Longino distinguishes between individualism as a\nphilosophical position (that, among other things, tends to consider\nknowers interchangeable) and whether individuals, in fact, have\nknowledge (2002: 14–48). She does not deny that epistemic norms\napply to the practices of individuals or that Einstein had an\n“extraordinary intellect, but what made [Einstein’s] brilliant\nideas knowledge were the processes of critical reception” (2002:\n122). Knowledge requires social interaction, not a dichotomy\nbetween the rational and the social; it also integrates\nvalues—some of them social—at both the constitutive and\ncontextual levels.\n\nThe responses of Longino, Nelson, Antony, and Duran to feminist\ncritiques of earlier stages of analytic philosophy all illustrate\nvariations on theme (1): they agree with certain facets of the\nfeminist critique, but draw on resources within particular strands of\nanalytic philosophy (in their cases naturalized\nepistemology/philosophy of science) as well as other feminist\nresources to produce epistemologies that overcome the objections to\nanalytic epistemology. Their strategies vary: Longino and Nelson\nde-emphasize the individual in favor of communities; Antony and Duran\nkeep the focus on individuals, but make them more concrete; in\naddition, Antony tries to resolve the paradox of bias.\n\nLet us turn much more briefly to strategies\n (2)\n and\n (3).\n The claim in (2) is that there were errors of interpretation in the\nfeminist analyses of analytic philosophy and its antecedents that\nweaken the feminist critiques. In (3) it is that critics have gone too\nfar in undermining fields of philosophy such as metaphysics or central\nnotions such as rationality that we need to retain. Examples of both\napproaches (sometimes even in one paper) can be found in Louise Antony\nand Charlotte Witt’s A Mind of One’s Own, a\ncollection of papers that focused on reason and objectivity in both\nthe history of Western philosophy and various fields of contemporary\nphilosophy (1993 [2002]). Those who propound claim (2) include\nMargaret Atherton and Louise Antony. Atherton (1993 [2002]) criticizes\nboth Genevieve Lloyd (1984) and Susan Bordo (1987) for their\ninterpretations of Descartes. Although Atherton’s piece is\npurely historical, it is relevant to our discussion because feminists\nof all persuasions who debate the merit of analytic philosophy\nacknowledge historical analyses, especially Lloyd’s extensive\nwork on “the man of reason”. Louise Antony argues that\nJaggar (1983) and Jane Flax (1987) mischaracterize the rationalist or\nempiricist traditions, and so miss the extent to which analytic\nphilosophers have already rejected aspects of them. This leads\nfeminists to misidentify analytic epistemology with empiricism and\noverlook more rationalistic possibilities (Antony 1993 [2002]).\n\nFinally,\n strategy (3).\n When analytic feminists defend a field or a concept from critiques of\nother feminists who have “gone too far”, they might be\nfending off poststructuralist critics who do not want to do\ntraditional metaphysics at all or they might be arguing about which\naspects of the field are male-biased (for example, foundationalist\nstyles of metaphysics or the tendency to see selected categories as\nnatural). Both Charlotte Witt and Sally Haslanger argue that there is\nno specifically feminist reason for rejecting metaphysics in general.\nWitt considers the particular case of “what it is to be\nhuman”. She argues that feminists, in fact, need assumptions and\ntheories about what it is to be human even in order to criticize\ntraditional metaphysical theories (1993 [2002]). Haslanger discusses a\nrange of issues concerning social construction, realism, and natural\nand social kinds. In the course of her discussion of feminists such as\nCatharine MacKinnon and Judith Butler, Haslanger makes many\ndistinctions among kinds and functions of social constructions, sorts\nout ways in which metaphysics and politics are related, and, in\ngeneral, provides an example of feminist metaphysical debate that\ndistinguishes male-biased facets of metaphysics from facets useful for\nfeminists (1995b, 1996, 2000, 2012). One way of characterizing this\napproach is that it goes for the “kernels of truth” within\nlarger, more problematic (or at least more polemical) discussions, and\nthereby performs a service for readers who might be sympathetic with\nsome aspects of the views of MacKinnon or Butler, but who are not\nwilling to accept the body of work that encompasses them.\n\nA more controversial analytic feminist response that fits into\n (3)\n is Martha Nussbaum’s defense of concepts and standards of\nobjectivity and reason. She argues forcefully that it is in\nfeminists’ interests, both theoretically and practically, to\nretain fairly traditional ideals of objectivity and rationality while\nacknowledging their abusive use. This position, in itself, would not\nhave generated great controversy, even if not universally accepted.\nHowever, because Nussbaum sees certain critics of the male-biased\naspects of objectivity and reason as part of a “feminist assault\non reason” (1994: 59), her essay and her interpretation of other\nfeminists’ views generated wide and heated discussion among\nfeminist philosophers at the\n time.[12]\n\nAs we close the discussion of analytic feminists’ responses to\ncritiques of analytic philosophy, it is important to restate the\nobvious: not every analytic feminist would agree with the responses\narticulated in the few examples chosen here. Indeed, in spite of the\ndesire that analytic feminist philosophy be sufficiently normative,\nthere is disagreement over issues such as the attitude to take toward\nconcepts that have typically embodied that normativity. Consider\ntraditional ideals of objectivity: views range from the claim that\nalthough the ideals of rationality and objectivity are “both\nunattainable and undesirable”, we nevertheless ought to embrace\nthem as “regulative norms” or “heuristics”\n(Antony 1995: 87) to a number of different understandings of\nobjectivity that would make them not so subject to distortion or\nmisuse (for example, E. Lloyd 1995a, 1995b; Haslanger 1993 [2002];\nScheman 2001a; Heldke 2001; Janack 2002).\n\nFinally, we need to remember that what feminists expect of a\nphilosophical method—their own preferred method(s) or\nothers—will influence their critique of it. It is important to\nbe realistic in considering what any particular method might offer a\nfeminist. For example, an analytic method is likely to provide a\nfeminist with much more assistance in clarifying concepts, making\ndistinctions, and evaluating arguments than with creating her\n“vision” or defining the goals of her work (see Garry\n1995).\n",
    "section_title": "6. Analytic Feminists’ Responses to Critiques",
    "entry_title": "Analytic Feminism",
    "hierarchy_title": "Analytic Feminism || Analytic Feminists’ Responses to Critiques",
    "tokenized_text": [
        "analytic",
        "feminist",
        "response",
        "critique",
        "analytic",
        "feminist",
        "response",
        "critique",
        "frequent",
        "kind",
        "response",
        "analytic",
        "feminist",
        "feminist",
        "critique",
        "analytic",
        "philosophy",
        "variation",
        "following",
        "argument",
        "claim",
        "feminist",
        "critique",
        "may",
        "legitimate",
        "kind",
        "analytic",
        "philosophy",
        "especially",
        "logical",
        "positivism",
        "analytic",
        "philosophy",
        "changed",
        "objection",
        "hold",
        "contemporary",
        "work",
        "analytic",
        "feminist",
        "develops",
        "strand",
        "analytic",
        "philosophy",
        "subject",
        "particular",
        "kind",
        "objection",
        "example",
        "knower",
        "unlocated",
        "error",
        "interpretation",
        "feminist",
        "critique",
        "example",
        "concerning",
        "extent",
        "analytic",
        "philosophy",
        "incorporated",
        "empiricism",
        "correction",
        "analytic",
        "philosophy",
        "vulnerable",
        "particular",
        "kind",
        "criticism",
        "critic",
        "gone",
        "far",
        "undermining",
        "field",
        "philosophy",
        "metaphysics",
        "central",
        "concept",
        "rationality",
        "field",
        "concept",
        "needed",
        "philosophical",
        "feminist",
        "ground",
        "three",
        "kind",
        "response",
        "allow",
        "analytic",
        "feminist",
        "engage",
        "activity",
        "thrivedisentangling",
        "strand",
        "argument",
        "making",
        "distinction",
        "among",
        "concept",
        "searching",
        "kernel",
        "truth",
        "among",
        "point",
        "disagree",
        "response",
        "regardless",
        "precise",
        "characterization",
        "contemporary",
        "analytic",
        "philosophy",
        "clearly",
        "equated",
        "logical",
        "positivism",
        "degree",
        "feminist",
        "critique",
        "focus",
        "logical",
        "positivism",
        "rather",
        "current",
        "analytic",
        "work",
        "likely",
        "mark",
        "analytic",
        "feminist",
        "respond",
        "feminist",
        "critique",
        "try",
        "decipher",
        "strand",
        "analytic",
        "philosophy",
        "might",
        "useful",
        "degree",
        "old",
        "assumption",
        "concept",
        "malebiased",
        "still",
        "linger",
        "although",
        "feminist",
        "defended",
        "facet",
        "work",
        "neurath",
        "okrulik",
        "carnap",
        "yap",
        "useful",
        "feminism",
        "analytic",
        "feminist",
        "find",
        "resource",
        "philosopher",
        "reject",
        "central",
        "dogma",
        "method",
        "classical",
        "analytic",
        "philosophy",
        "example",
        "wittgenstein",
        "jl",
        "austin",
        "quine",
        "davidson",
        "others",
        "let",
        "take",
        "example",
        "argument",
        "feminist",
        "believe",
        "useful",
        "strand",
        "analytic",
        "philosophy",
        "naturalized",
        "way",
        "need",
        "cast",
        "wide",
        "permissive",
        "net",
        "count",
        "naturalized",
        "acknowledge",
        "controversy",
        "relation",
        "analytic",
        "philosophy",
        "feminism",
        "used",
        "naturalized",
        "philosophy",
        "includes",
        "philosophy",
        "explicitly",
        "informed",
        "rather",
        "replaced",
        "empirical",
        "information",
        "knower",
        "agent",
        "social",
        "structure",
        "psychologycognitive",
        "science",
        "sociology",
        "anthropology",
        "elsewhere",
        "although",
        "analytic",
        "feminist",
        "favor",
        "naturalizing",
        "philosophy",
        "strong",
        "preference",
        "subcategory",
        "social",
        "epistemology",
        "critical",
        "many",
        "nonfeminist",
        "way",
        "example",
        "focus",
        "traditional",
        "naturalized",
        "epistemology",
        "individual",
        "rather",
        "social",
        "science",
        "neglect",
        "situatedness",
        "thinking",
        "final",
        "caveat",
        "terminology",
        "since",
        "disagreement",
        "proper",
        "scope",
        "naturalized",
        "analytic",
        "object",
        "naturalized",
        "philosophy",
        "strand",
        "analytic",
        "philosophy",
        "example",
        "quine",
        "might",
        "considered",
        "father",
        "naturalized",
        "epistemology",
        "fit",
        "squarely",
        "characterization",
        "analytic",
        "philosophy",
        "however",
        "lynn",
        "hankinson",
        "nelson",
        "considers",
        "postanalytic",
        "nelson",
        "nelson",
        "course",
        "necessary",
        "link",
        "naturalized",
        "philosophy",
        "analytic",
        "philosophy",
        "case",
        "one",
        "need",
        "think",
        "foucault",
        "dewey",
        "sever",
        "connection",
        "keeping",
        "mind",
        "caveat",
        "controversy",
        "let",
        "turn",
        "example",
        "naturalized",
        "epistemology",
        "consider",
        "naturalizing",
        "help",
        "feminist",
        "overcome",
        "difficulty",
        "analytic",
        "philosophy",
        "feminist",
        "criticize",
        "analytic",
        "philosophy",
        "concept",
        "knower",
        "agent",
        "example",
        "individual",
        "abstract",
        "idealized",
        "interchangeable",
        "unlocated",
        "disconnected",
        "disembodied",
        "disinterested",
        "etc",
        "first",
        "thing",
        "naturalized",
        "epistemology",
        "shift",
        "focus",
        "abstract",
        "idealized",
        "knower",
        "concrete",
        "facet",
        "person",
        "belief",
        "knowledge",
        "although",
        "move",
        "feminist",
        "jane",
        "duran",
        "find",
        "positive",
        "step",
        "toward",
        "gynocentric",
        "ie",
        "womancentered",
        "epistemology",
        "belief",
        "naturalized",
        "epistemologyby",
        "descriptive",
        "character",
        "concern",
        "context",
        "detail",
        "knowingis",
        "capable",
        "including",
        "feature",
        "valued",
        "feminist",
        "standpoint",
        "epistemology",
        "example",
        "relational",
        "aspect",
        "knowing",
        "grounding",
        "knowledge",
        "body",
        "activity",
        "daily",
        "life",
        "duran",
        "one",
        "first",
        "feminist",
        "explicitly",
        "combined",
        "feminist",
        "standpoint",
        "theory",
        "analytically",
        "oriented",
        "naturalized",
        "epistemology",
        "exception",
        "widespread",
        "tendency",
        "analytic",
        "feminist",
        "stay",
        "clear",
        "gynocentrism",
        "course",
        "one",
        "need",
        "agree",
        "specific",
        "duran",
        "analysis",
        "appreciate",
        "importance",
        "naturalized",
        "epistemology",
        "descriptive",
        "attention",
        "context",
        "concrete",
        "detail",
        "descriptive",
        "attention",
        "allows",
        "gender",
        "epistemology",
        "facet",
        "knower",
        "context",
        "become",
        "relevant",
        "one",
        "debate",
        "kind",
        "social",
        "structure",
        "individual",
        "variation",
        "interaction",
        "fruitful",
        "avenue",
        "exploration",
        "second",
        "naturalized",
        "approach",
        "louise",
        "antony",
        "argument",
        "concerning",
        "different",
        "aspect",
        "knowerneutrality",
        "antony",
        "maintains",
        "naturalized",
        "epistemology",
        "resolve",
        "paradox",
        "bias",
        "one",
        "consistently",
        "critique",
        "male",
        "bias",
        "time",
        "object",
        "notion",
        "unbiased",
        "neutral",
        "objective",
        "impartial",
        "knowledge",
        "naturalized",
        "epistemology",
        "reject",
        "ideal",
        "neutrality",
        "instead",
        "give",
        "u",
        "empirical",
        "norm",
        "differentiate",
        "good",
        "bad",
        "bias",
        "bias",
        "lead",
        "u",
        "toward",
        "rather",
        "away",
        "truth",
        "antony",
        "also",
        "engages",
        "many",
        "facet",
        "debate",
        "analytic",
        "nonanalytic",
        "feminist",
        "return",
        "later",
        "third",
        "strategy",
        "still",
        "within",
        "context",
        "naturalized",
        "epistemologyphilosophy",
        "science",
        "change",
        "relationship",
        "empiricism",
        "individual",
        "lynn",
        "hankinson",
        "nelson",
        "helen",
        "longino",
        "empiricist",
        "style",
        "locke",
        "hume",
        "position",
        "evidence",
        "come",
        "sens",
        "experience",
        "nelson",
        "longino",
        "encapsulated",
        "saying",
        "empiricism",
        "theory",
        "evidence",
        "using",
        "different",
        "line",
        "argument",
        "shift",
        "focus",
        "individual",
        "community",
        "nelson",
        "argues",
        "community",
        "rather",
        "individual",
        "acquire",
        "posse",
        "knowledge",
        "nelson",
        "want",
        "use",
        "quinian",
        "feminist",
        "resource",
        "forge",
        "empiricism",
        "sufficiently",
        "rich",
        "sophisticated",
        "overcome",
        "critique",
        "earlier",
        "feminist",
        "empiricism",
        "offered",
        "example",
        "harding",
        "well",
        "avoid",
        "feminist",
        "objection",
        "individualism",
        "whether",
        "jaggar",
        "abstract",
        "individualism",
        "form",
        "discussed",
        "nelson",
        "maintains",
        "quinewhile",
        "remaining",
        "empiricisthad",
        "already",
        "undermined",
        "abandoned",
        "many",
        "postpositivist",
        "characteristic",
        "jaggar",
        "harding",
        "object",
        "thus",
        "empiricism",
        "tempered",
        "nelson",
        "focus",
        "community",
        "knower",
        "adequately",
        "take",
        "account",
        "social",
        "identity",
        "knower",
        "complex",
        "dependency",
        "individual",
        "epistemological",
        "community",
        "helen",
        "longino",
        "approach",
        "science",
        "social",
        "knowledge",
        "argue",
        "among",
        "many",
        "way",
        "science",
        "social",
        "epistemological",
        "norm",
        "apply",
        "practice",
        "community",
        "individual",
        "fate",
        "knowledge",
        "develops",
        "contextual",
        "empiricist",
        "argument",
        "along",
        "line",
        "break",
        "dichotomy",
        "rational",
        "social",
        "many",
        "dichotomy",
        "along",
        "way",
        "although",
        "argument",
        "wide",
        "scope",
        "concerned",
        "way",
        "view",
        "break",
        "connection",
        "individualism",
        "empiricism",
        "longino",
        "distinguishes",
        "individualism",
        "philosophical",
        "position",
        "among",
        "thing",
        "tends",
        "consider",
        "knower",
        "interchangeable",
        "whether",
        "individual",
        "fact",
        "knowledge",
        "deny",
        "epistemic",
        "norm",
        "apply",
        "practice",
        "individual",
        "einstein",
        "extraordinary",
        "intellect",
        "made",
        "einstein",
        "brilliant",
        "idea",
        "knowledge",
        "process",
        "critical",
        "reception",
        "knowledge",
        "requires",
        "social",
        "interaction",
        "dichotomy",
        "rational",
        "social",
        "also",
        "integrates",
        "valuessome",
        "socialat",
        "constitutive",
        "contextual",
        "level",
        "response",
        "longino",
        "nelson",
        "antony",
        "duran",
        "feminist",
        "critique",
        "earlier",
        "stage",
        "analytic",
        "philosophy",
        "illustrate",
        "variation",
        "theme",
        "agree",
        "certain",
        "facet",
        "feminist",
        "critique",
        "draw",
        "resource",
        "within",
        "particular",
        "strand",
        "analytic",
        "philosophy",
        "case",
        "naturalized",
        "epistemologyphilosophy",
        "science",
        "well",
        "feminist",
        "resource",
        "produce",
        "epistemology",
        "overcome",
        "objection",
        "analytic",
        "epistemology",
        "strategy",
        "vary",
        "longino",
        "nelson",
        "deemphasize",
        "individual",
        "favor",
        "community",
        "antony",
        "duran",
        "keep",
        "focus",
        "individual",
        "make",
        "concrete",
        "addition",
        "antony",
        "try",
        "resolve",
        "paradox",
        "bias",
        "let",
        "u",
        "turn",
        "much",
        "briefly",
        "strategy",
        "claim",
        "error",
        "interpretation",
        "feminist",
        "analysis",
        "analytic",
        "philosophy",
        "antecedent",
        "weaken",
        "feminist",
        "critique",
        "critic",
        "gone",
        "far",
        "undermining",
        "field",
        "philosophy",
        "metaphysics",
        "central",
        "notion",
        "rationality",
        "need",
        "retain",
        "example",
        "approach",
        "sometimes",
        "even",
        "one",
        "paper",
        "found",
        "louise",
        "antony",
        "charlotte",
        "witt",
        "mind",
        "one",
        "collection",
        "paper",
        "focused",
        "reason",
        "objectivity",
        "history",
        "western",
        "philosophy",
        "various",
        "field",
        "contemporary",
        "philosophy",
        "propound",
        "claim",
        "include",
        "margaret",
        "atherton",
        "louise",
        "antony",
        "atherton",
        "criticizes",
        "genevieve",
        "lloyd",
        "susan",
        "bordo",
        "interpretation",
        "descartes",
        "although",
        "atherton",
        "piece",
        "purely",
        "historical",
        "relevant",
        "discussion",
        "feminist",
        "persuasion",
        "debate",
        "merit",
        "analytic",
        "philosophy",
        "acknowledge",
        "historical",
        "analysis",
        "especially",
        "lloyd",
        "extensive",
        "work",
        "man",
        "reason",
        "louise",
        "antony",
        "argues",
        "jaggar",
        "jane",
        "flax",
        "mischaracterize",
        "rationalist",
        "empiricist",
        "tradition",
        "miss",
        "extent",
        "analytic",
        "philosopher",
        "already",
        "rejected",
        "aspect",
        "lead",
        "feminist",
        "misidentify",
        "analytic",
        "epistemology",
        "empiricism",
        "overlook",
        "rationalistic",
        "possibility",
        "antony",
        "finally",
        "strategy",
        "analytic",
        "feminist",
        "defend",
        "field",
        "concept",
        "critique",
        "feminist",
        "gone",
        "far",
        "might",
        "fending",
        "poststructuralist",
        "critic",
        "want",
        "traditional",
        "metaphysics",
        "might",
        "arguing",
        "aspect",
        "field",
        "malebiased",
        "example",
        "foundationalist",
        "style",
        "metaphysics",
        "tendency",
        "see",
        "selected",
        "category",
        "natural",
        "charlotte",
        "witt",
        "sally",
        "haslanger",
        "argue",
        "specifically",
        "feminist",
        "reason",
        "rejecting",
        "metaphysics",
        "general",
        "witt",
        "considers",
        "particular",
        "case",
        "human",
        "argues",
        "feminist",
        "fact",
        "need",
        "assumption",
        "theory",
        "human",
        "even",
        "order",
        "criticize",
        "traditional",
        "metaphysical",
        "theory",
        "haslanger",
        "discus",
        "range",
        "issue",
        "concerning",
        "social",
        "construction",
        "realism",
        "natural",
        "social",
        "kind",
        "course",
        "discussion",
        "feminist",
        "catharine",
        "mackinnon",
        "judith",
        "butler",
        "haslanger",
        "make",
        "many",
        "distinction",
        "among",
        "kind",
        "function",
        "social",
        "construction",
        "sort",
        "way",
        "metaphysics",
        "politics",
        "related",
        "general",
        "provides",
        "example",
        "feminist",
        "metaphysical",
        "debate",
        "distinguishes",
        "malebiased",
        "facet",
        "metaphysics",
        "facet",
        "useful",
        "feminist",
        "b",
        "one",
        "way",
        "characterizing",
        "approach",
        "go",
        "kernel",
        "truth",
        "within",
        "larger",
        "problematic",
        "least",
        "polemical",
        "discussion",
        "thereby",
        "performs",
        "service",
        "reader",
        "might",
        "sympathetic",
        "aspect",
        "view",
        "mackinnon",
        "butler",
        "willing",
        "accept",
        "body",
        "work",
        "encompasses",
        "controversial",
        "analytic",
        "feminist",
        "response",
        "fit",
        "martha",
        "nussbaum",
        "defense",
        "concept",
        "standard",
        "objectivity",
        "reason",
        "argues",
        "forcefully",
        "feminist",
        "interest",
        "theoretically",
        "practically",
        "retain",
        "fairly",
        "traditional",
        "ideal",
        "objectivity",
        "rationality",
        "acknowledging",
        "abusive",
        "use",
        "position",
        "would",
        "generated",
        "great",
        "controversy",
        "even",
        "universally",
        "accepted",
        "however",
        "nussbaum",
        "see",
        "certain",
        "critic",
        "malebiased",
        "aspect",
        "objectivity",
        "reason",
        "part",
        "feminist",
        "assault",
        "reason",
        "essay",
        "interpretation",
        "feminist",
        "view",
        "generated",
        "wide",
        "heated",
        "discussion",
        "among",
        "feminist",
        "philosopher",
        "time",
        "close",
        "discussion",
        "analytic",
        "feminist",
        "response",
        "critique",
        "analytic",
        "philosophy",
        "important",
        "restate",
        "obvious",
        "every",
        "analytic",
        "feminist",
        "would",
        "agree",
        "response",
        "articulated",
        "example",
        "chosen",
        "indeed",
        "spite",
        "desire",
        "analytic",
        "feminist",
        "philosophy",
        "sufficiently",
        "normative",
        "disagreement",
        "issue",
        "attitude",
        "take",
        "toward",
        "concept",
        "typically",
        "embodied",
        "normativity",
        "consider",
        "traditional",
        "ideal",
        "objectivity",
        "view",
        "range",
        "claim",
        "although",
        "ideal",
        "rationality",
        "objectivity",
        "unattainable",
        "undesirable",
        "nevertheless",
        "ought",
        "embrace",
        "regulative",
        "norm",
        "heuristic",
        "antony",
        "number",
        "different",
        "understanding",
        "objectivity",
        "would",
        "make",
        "subject",
        "distortion",
        "misuse",
        "example",
        "e",
        "lloyd",
        "a",
        "b",
        "haslanger",
        "scheman",
        "a",
        "heldke",
        "janack",
        "finally",
        "need",
        "remember",
        "feminist",
        "expect",
        "philosophical",
        "methodtheir",
        "preferred",
        "method",
        "otherswill",
        "influence",
        "critique",
        "important",
        "realistic",
        "considering",
        "particular",
        "method",
        "might",
        "offer",
        "feminist",
        "example",
        "analytic",
        "method",
        "likely",
        "provide",
        "feminist",
        "much",
        "assistance",
        "clarifying",
        "concept",
        "making",
        "distinction",
        "evaluating",
        "argument",
        "creating",
        "vision",
        "defining",
        "goal",
        "work",
        "see",
        "garry"
    ]
}