{
    "main_text": "Continental Feminism and Asian American Feminist Thought\n6. Continental Feminism and Asian American Feminist Thought\n\nThis section explores the relationship between Continental feminism\nand Asian American feminist thought, both the tensions between the two\nas well as new directions that this relation brings to Continental\nfeminism. A major point of convergence between the two fields is the\nfocus on lived experience of Asian American women. This section begins\nby discussing the hypervisibility that Asian American women experience\ndue to the specific forms of oppression that they face, namely,\norientalization and the Model Minority myth. It then highlights the\nparadoxical form of invisibility that Asian American feminist\nphenomenologist trace in their body of work. Next, this section\nconsiders the historical position of Asian American women in\ncoalitional feminist projects, especially focusing on the ways in\nwhich Asian American women have been relegated to a\n“tag-along” group. Finally, this section will highlight\nrecent scholarship in Continental feminism that engages with Asian\nAmerican feminist theory and draws upon both Eastern and Western\ntraditions.\n\nIt must be noted from the outset that “Asian” is an\nexceptionally broad term, and the peoples that are considered\nAsian/Asian American have often changed throughout history. In\naccordance with anthologies by Asian American women that respond to\nthis very issue, this section addresses the identities of women who\ntrace their roots back to East Asia, Southeast Asia, and the Indian\nsubcontinent (Asian Women United of California 1989; The Women of\nSouth Asian Descent Collective 1993).\n\nIn This Bridge Called My Back (Moraga & Anzaldúa\n1981 [2015]), Asian American thinkers such as Genny Lim, Merle Woo, Nellie\nWong, and Mitsuye Yamada established their positions in feminist\ntheorizing by exploring their own perspectives on topics surrounding\ngendered identity, sexuality, silencing, the feeling of not-belonging,\nand living against stereotypes of Asian American women as docile,\nquiet, agreeable, and submissive. Similarly, in This Bridge We\nCall Home (Anzaldúa & Keating 2002), Minh-ha T. Pham,\nShirley Geok-Lin Lim, and Jid Lee theorize from the specific\nexperiences that they face as Asian American immigrant women, such as\nexploring a connection to an Asian mother who emigrated to the United\nStates, navigating the cultural connection they still hold to a land\nthat they may have never visited, and living in the face of the Model\nMinority myth while also subverting the stereotype. Writings that\ncenter the perspective of the Asian American and diasporic Asian woman\nare essential for Asian American feminist theorizing, for, as Sonia\nShah emphasized,\n\n\n[a]n Asian American feminist movement is the only movement\nthat will consistently represent Asian American women’s\ninterests. (1998: xix)\n\n\nTwo early anthologies were very important for the formation of Asian\nAmerican feminism: Making Waves (Asian Women United of\nCalifornia [AWUC] 1989) and The Forbidden Stitch (Lim &\nTsutakawa 1989); they both include writings from different ethnic and\nnational backgrounds, specifically Chinese, Japanese, Filipino,\nKorean, Vietnamese, and Indian (Hill-Collins & Bilge 2016: 73). In\na recent volume entitled Asian American Feminisms and Women of\nColor Politics, editors Lynn Fujiwara and Shireen Roshanravan\npresent a series of articles emerging at the intersection of Asian\nAmerican feminist engagement with Women of Color coalition politics,\norganizing around concepts, methods, and epistemic principles central\nto Women of Color feminist scholarship (Fujiwara & Roshanravan\n2018)\n\nHypervisibility of Asian American women is a central issue in most\nAsian American feminist projects. Some Asian American feminist\ntheorists, such as Robin Zheng, argue that Asian American women are\nhypervisible because they are hypersexualized, orientalized, and\nexoticized. Robin Zheng (2016) discusses the complexities of\nhypervisibility “Why Yellow Fever Isn’t Flattering: A Case\nAgainst Racial Fetishes”. Zheng argues that there is little\ndifference between what is known as “yellow fever”, the\nracial fetishization and preference of Asian women and men, and what\nshe calls the “Mere Preference Argument”, which attempts\nto claim that there is nothing morally wrong with preferring certain\nracialized phenotypic traits; as she shows, despite the origin of a\nracialized fetish, both yellow fever and other racialized fetishes\n“depersonalize and otherize” their subjects (2016: 412).\nZheng shows that these fetishes are not just harmless personal\npreferences, but a set of practices and thought patterns that result\nin negative social impacts for Asian American women. Relatedly, Asian\nAmerican women are also hypervisible due to the “Model Minority\nmyth”, that is, the myth that asserts that Asian Americans are\nuniquely hard-working and thus, the ideal “model”\nminority, especially in contrast with other minority groups. This myth\nmakes Asian American women hypervisible by making them a part of a\ngroup of people who are defined by their ability to achieve upward\nclass mobility (K. Lee 2014).\n\nParadoxically, Asian American women are also rendered invisible in\nvarious feminist movements and discourses. Asian American feminist\ndiscussions on invisibility differ from other discussions within\nContinental feminism on visibility and feminine erasure due to their\ndual existence as both invisible subjects and hypervisible\nrepresentations of stereotypes. Poet and activist Mitsuye Yamada\nstates that Asian American women are “the visible minority that\nis invisible” (1981b). Yamada means this claim in two ways:\nfirst, in regard to how Asian American women are rendered invisible in\nconversations surrounding women of color oppressions; and second, in\nregard to how the oppressions experienced by Asian American women are\noften invisible to themselves. In order to carve out a space for\nthemselves in feminist theorizing, Asian American women in this book\nshared their stories that demonstrate the struggle of becoming visible\nto oneself while existing in a world that constantly demands\none’s invisibility. Yamada’s explains how she was\ninvisible to herself because she practiced passive resistance while\nbelieving that others did not see her as the stereotype of an Asian\nAmerican women. In order to become visible to herself and others, she\nrealized that she must act in ways, such as displaying anger in\nresponse to sexist and racist acts, that an oppressive gaze would\nclaim was “uncharacteristic” of her as an Asian American\nwoman (1981b: 40). At the same time, the Model Minority myth can also\nparadoxically render Asian American women invisible by making them\nhypervisible as successful paradigms that are perceived as lacking\nexperiences of oppression and violence and thus have no credibility to\nspeak to these lived experiences.\n\nAs a result of this specific form of invisibility, Asian American\nfeminists proposed new methods of political organization in order to\ninclude the voices of Asian American women in feminist coalitions. The\nsimilarities between writings that span nearly two decades gesture to\none of the many issues faced by Asian American feminism: Asian\nAmerican feminists have often been seen, and arguably still are seen,\nas a group in the background that is simply, as Yamada described,\n“tagging along” in feminist theorization against\noppressions (1981b: 40). In other words, Asian American women are\noften seen as individuals who do not often experience oppressions that\nare specific to their own identities and, therefore, have no place in\nfighting oppression. In response to this, we can see activists such as\nGrace Lee Boggs, who have worked closely with other people of color in\nthe fight against different oppressions (Boggs & Boggs 1974; 1998\n[2016]; Boggs & Kurashige 2011); Lisa Lowe’s essay on\nheterogeneity, hybridity, and multipolicy of Asian American\nwomen’s experiences (Lowe 1991); and more recent Asian American\nfeminist projects that include Asian Americans women in liberatory\nprojects in a manner that does not simply relegate them to tag-along\npositions (Shah 1998; Fujiwara & Roshanravan, 2018).\n\nA growing number of recent works in Asian American feminism engage\nwith figures and themes in Continental feminism through the framework\nEastern philosophy and the Asian American women’s perspective\nand as such they provide new directions for a genuinely\ntransContinental feminism. For example, building on the discussions\nconcerning gender in Continental feminisms, thinkers such as Kyoo Lee\n(2014) and Robin Wang (2016) have explored different ways that the\ngendered body has been discussed. Engaging with the concept of the\n“dark female animal” (xuapin) in\nDaodejing, Kyoo Lee explores the revolutionary potential of\nxuapin, which she claims possesses a gender-bending power.\nLee argues that xuapin demonstrates\n\n\nin a sense, superiority of femaleness and femininity –as\nthe norm, albeit invisible and inaudible\n\n\nand that it is\n\n\ngender-bending: female and not female at once, heterosexualized and\nnot at once. (K. Lee 2014: 59)\n\n\nWang investigates yin-yang gender dynamics through a variety of both\nEastern and Western sources in order to answer whether yin-yang gender\nconstruction allows for gender equality. Alluding to Continental\nfeminists who wrote on gender such as Simone de Beauvoir, Judith\nButler, and Luce Irigaray, Wang discusses an exploration of gender\nthrough a Chinese framework (the yin-yang) that does not make a clear\ndistinction between sex and gender. Wang argues that yin-yang gender\nconstruction offers a dynamic and fluid description of gender\nrelationships (Wang 2016: 224).\n",
    "section_title": "6. Continental Feminism and Asian American Feminist Thought",
    "entry_title": "Continental Feminism",
    "hierarchy_title": "Continental Feminism || Continental Feminism and Asian American Feminist Thought",
    "tokenized_text": [
        "continental",
        "feminism",
        "asian",
        "american",
        "feminist",
        "thought",
        "continental",
        "feminism",
        "asian",
        "american",
        "feminist",
        "thought",
        "section",
        "explores",
        "relationship",
        "continental",
        "feminism",
        "asian",
        "american",
        "feminist",
        "thought",
        "tension",
        "two",
        "well",
        "new",
        "direction",
        "relation",
        "brings",
        "continental",
        "feminism",
        "major",
        "point",
        "convergence",
        "two",
        "field",
        "focus",
        "lived",
        "experience",
        "asian",
        "american",
        "woman",
        "section",
        "begin",
        "discussing",
        "hypervisibility",
        "asian",
        "american",
        "woman",
        "experience",
        "due",
        "specific",
        "form",
        "oppression",
        "face",
        "namely",
        "orientalization",
        "model",
        "minority",
        "myth",
        "highlight",
        "paradoxical",
        "form",
        "invisibility",
        "asian",
        "american",
        "feminist",
        "phenomenologist",
        "trace",
        "body",
        "work",
        "next",
        "section",
        "considers",
        "historical",
        "position",
        "asian",
        "american",
        "woman",
        "coalitional",
        "feminist",
        "project",
        "especially",
        "focusing",
        "way",
        "asian",
        "american",
        "woman",
        "relegated",
        "tagalong",
        "group",
        "finally",
        "section",
        "highlight",
        "recent",
        "scholarship",
        "continental",
        "feminism",
        "engages",
        "asian",
        "american",
        "feminist",
        "theory",
        "draw",
        "upon",
        "eastern",
        "western",
        "tradition",
        "must",
        "noted",
        "outset",
        "asian",
        "exceptionally",
        "broad",
        "term",
        "people",
        "considered",
        "asianasian",
        "american",
        "often",
        "changed",
        "throughout",
        "history",
        "accordance",
        "anthology",
        "asian",
        "american",
        "woman",
        "respond",
        "issue",
        "section",
        "address",
        "identity",
        "woman",
        "trace",
        "root",
        "back",
        "east",
        "asia",
        "southeast",
        "asia",
        "indian",
        "subcontinent",
        "asian",
        "woman",
        "united",
        "california",
        "woman",
        "south",
        "asian",
        "descent",
        "collective",
        "bridge",
        "called",
        "back",
        "moraga",
        "anzaldúa",
        "asian",
        "american",
        "thinker",
        "genny",
        "lim",
        "merle",
        "woo",
        "nellie",
        "wong",
        "mitsuye",
        "yamada",
        "established",
        "position",
        "feminist",
        "theorizing",
        "exploring",
        "perspective",
        "topic",
        "surrounding",
        "gendered",
        "identity",
        "sexuality",
        "silencing",
        "feeling",
        "notbelonging",
        "living",
        "stereotype",
        "asian",
        "american",
        "woman",
        "docile",
        "quiet",
        "agreeable",
        "submissive",
        "similarly",
        "bridge",
        "call",
        "home",
        "anzaldúa",
        "keating",
        "minhha",
        "t",
        "pham",
        "shirley",
        "geoklin",
        "lim",
        "jid",
        "lee",
        "theorize",
        "specific",
        "experience",
        "face",
        "asian",
        "american",
        "immigrant",
        "woman",
        "exploring",
        "connection",
        "asian",
        "mother",
        "emigrated",
        "united",
        "state",
        "navigating",
        "cultural",
        "connection",
        "still",
        "hold",
        "land",
        "may",
        "never",
        "visited",
        "living",
        "face",
        "model",
        "minority",
        "myth",
        "also",
        "subverting",
        "stereotype",
        "writing",
        "center",
        "perspective",
        "asian",
        "american",
        "diasporic",
        "asian",
        "woman",
        "essential",
        "asian",
        "american",
        "feminist",
        "theorizing",
        "sonia",
        "shah",
        "emphasized",
        "n",
        "asian",
        "american",
        "feminist",
        "movement",
        "movement",
        "consistently",
        "represent",
        "asian",
        "american",
        "woman",
        "interest",
        "xix",
        "two",
        "early",
        "anthology",
        "important",
        "formation",
        "asian",
        "american",
        "feminism",
        "making",
        "wave",
        "asian",
        "woman",
        "united",
        "california",
        "awuc",
        "forbidden",
        "stitch",
        "lim",
        "tsutakawa",
        "include",
        "writing",
        "different",
        "ethnic",
        "national",
        "background",
        "specifically",
        "chinese",
        "japanese",
        "filipino",
        "korean",
        "vietnamese",
        "indian",
        "hillcollins",
        "bilge",
        "recent",
        "volume",
        "entitled",
        "asian",
        "american",
        "feminism",
        "woman",
        "color",
        "politics",
        "editor",
        "lynn",
        "fujiwara",
        "shireen",
        "roshanravan",
        "present",
        "series",
        "article",
        "emerging",
        "intersection",
        "asian",
        "american",
        "feminist",
        "engagement",
        "woman",
        "color",
        "coalition",
        "politics",
        "organizing",
        "around",
        "concept",
        "method",
        "epistemic",
        "principle",
        "central",
        "woman",
        "color",
        "feminist",
        "scholarship",
        "fujiwara",
        "roshanravan",
        "hypervisibility",
        "asian",
        "american",
        "woman",
        "central",
        "issue",
        "asian",
        "american",
        "feminist",
        "project",
        "asian",
        "american",
        "feminist",
        "theorist",
        "robin",
        "zheng",
        "argue",
        "asian",
        "american",
        "woman",
        "hypervisible",
        "hypersexualized",
        "orientalized",
        "exoticized",
        "robin",
        "zheng",
        "discus",
        "complexity",
        "hypervisibility",
        "yellow",
        "fever",
        "flattering",
        "case",
        "racial",
        "fetish",
        "zheng",
        "argues",
        "little",
        "difference",
        "known",
        "yellow",
        "fever",
        "racial",
        "fetishization",
        "preference",
        "asian",
        "woman",
        "men",
        "call",
        "mere",
        "preference",
        "argument",
        "attempt",
        "claim",
        "nothing",
        "morally",
        "wrong",
        "preferring",
        "certain",
        "racialized",
        "phenotypic",
        "trait",
        "show",
        "despite",
        "origin",
        "racialized",
        "fetish",
        "yellow",
        "fever",
        "racialized",
        "fetish",
        "depersonalize",
        "otherize",
        "subject",
        "zheng",
        "show",
        "fetish",
        "harmless",
        "personal",
        "preference",
        "set",
        "practice",
        "thought",
        "pattern",
        "result",
        "negative",
        "social",
        "impact",
        "asian",
        "american",
        "woman",
        "relatedly",
        "asian",
        "american",
        "woman",
        "also",
        "hypervisible",
        "due",
        "model",
        "minority",
        "myth",
        "myth",
        "asserts",
        "asian",
        "american",
        "uniquely",
        "hardworking",
        "thus",
        "ideal",
        "model",
        "minority",
        "especially",
        "contrast",
        "minority",
        "group",
        "myth",
        "make",
        "asian",
        "american",
        "woman",
        "hypervisible",
        "making",
        "part",
        "group",
        "people",
        "defined",
        "ability",
        "achieve",
        "upward",
        "class",
        "mobility",
        "k",
        "lee",
        "paradoxically",
        "asian",
        "american",
        "woman",
        "also",
        "rendered",
        "invisible",
        "various",
        "feminist",
        "movement",
        "discourse",
        "asian",
        "american",
        "feminist",
        "discussion",
        "invisibility",
        "differ",
        "discussion",
        "within",
        "continental",
        "feminism",
        "visibility",
        "feminine",
        "erasure",
        "due",
        "dual",
        "existence",
        "invisible",
        "subject",
        "hypervisible",
        "representation",
        "stereotype",
        "poet",
        "activist",
        "mitsuye",
        "yamada",
        "state",
        "asian",
        "american",
        "woman",
        "visible",
        "minority",
        "invisible",
        "b",
        "yamada",
        "mean",
        "claim",
        "two",
        "way",
        "first",
        "regard",
        "asian",
        "american",
        "woman",
        "rendered",
        "invisible",
        "conversation",
        "surrounding",
        "woman",
        "color",
        "oppression",
        "second",
        "regard",
        "oppression",
        "experienced",
        "asian",
        "american",
        "woman",
        "often",
        "invisible",
        "order",
        "carve",
        "space",
        "feminist",
        "theorizing",
        "asian",
        "american",
        "woman",
        "book",
        "shared",
        "story",
        "demonstrate",
        "struggle",
        "becoming",
        "visible",
        "oneself",
        "existing",
        "world",
        "constantly",
        "demand",
        "one",
        "invisibility",
        "yamada",
        "explains",
        "invisible",
        "practiced",
        "passive",
        "resistance",
        "believing",
        "others",
        "see",
        "stereotype",
        "asian",
        "american",
        "woman",
        "order",
        "become",
        "visible",
        "others",
        "realized",
        "must",
        "act",
        "way",
        "displaying",
        "anger",
        "response",
        "sexist",
        "racist",
        "act",
        "oppressive",
        "gaze",
        "would",
        "claim",
        "uncharacteristic",
        "asian",
        "american",
        "woman",
        "b",
        "time",
        "model",
        "minority",
        "myth",
        "also",
        "paradoxically",
        "render",
        "asian",
        "american",
        "woman",
        "invisible",
        "making",
        "hypervisible",
        "successful",
        "paradigm",
        "perceived",
        "lacking",
        "experience",
        "oppression",
        "violence",
        "thus",
        "credibility",
        "speak",
        "lived",
        "experience",
        "result",
        "specific",
        "form",
        "invisibility",
        "asian",
        "american",
        "feminist",
        "proposed",
        "new",
        "method",
        "political",
        "organization",
        "order",
        "include",
        "voice",
        "asian",
        "american",
        "woman",
        "feminist",
        "coalition",
        "similarity",
        "writing",
        "span",
        "nearly",
        "two",
        "decade",
        "gesture",
        "one",
        "many",
        "issue",
        "faced",
        "asian",
        "american",
        "feminism",
        "asian",
        "american",
        "feminist",
        "often",
        "seen",
        "arguably",
        "still",
        "seen",
        "group",
        "background",
        "simply",
        "yamada",
        "described",
        "tagging",
        "along",
        "feminist",
        "theorization",
        "oppression",
        "b",
        "word",
        "asian",
        "american",
        "woman",
        "often",
        "seen",
        "individual",
        "often",
        "experience",
        "oppression",
        "specific",
        "identity",
        "therefore",
        "place",
        "fighting",
        "oppression",
        "response",
        "see",
        "activist",
        "grace",
        "lee",
        "boggs",
        "worked",
        "closely",
        "people",
        "color",
        "fight",
        "different",
        "oppression",
        "boggs",
        "boggs",
        "boggs",
        "kurashige",
        "lisa",
        "lowe",
        "essay",
        "heterogeneity",
        "hybridity",
        "multipolicy",
        "asian",
        "american",
        "woman",
        "experience",
        "lowe",
        "recent",
        "asian",
        "american",
        "feminist",
        "project",
        "include",
        "asian",
        "american",
        "woman",
        "liberatory",
        "project",
        "manner",
        "simply",
        "relegate",
        "tagalong",
        "position",
        "shah",
        "fujiwara",
        "roshanravan",
        "growing",
        "number",
        "recent",
        "work",
        "asian",
        "american",
        "feminism",
        "engage",
        "figure",
        "theme",
        "continental",
        "feminism",
        "framework",
        "eastern",
        "philosophy",
        "asian",
        "american",
        "woman",
        "perspective",
        "provide",
        "new",
        "direction",
        "genuinely",
        "transcontinental",
        "feminism",
        "example",
        "building",
        "discussion",
        "concerning",
        "gender",
        "continental",
        "feminism",
        "thinker",
        "kyoo",
        "lee",
        "robin",
        "wang",
        "explored",
        "different",
        "way",
        "gendered",
        "body",
        "discussed",
        "engaging",
        "concept",
        "dark",
        "female",
        "animal",
        "xuapin",
        "daodejing",
        "kyoo",
        "lee",
        "explores",
        "revolutionary",
        "potential",
        "xuapin",
        "claim",
        "posse",
        "genderbending",
        "power",
        "lee",
        "argues",
        "xuapin",
        "demonstrates",
        "sense",
        "superiority",
        "femaleness",
        "femininity",
        "as",
        "norm",
        "albeit",
        "invisible",
        "inaudible",
        "genderbending",
        "female",
        "female",
        "heterosexualized",
        "k",
        "lee",
        "wang",
        "investigates",
        "yinyang",
        "gender",
        "dynamic",
        "variety",
        "eastern",
        "western",
        "source",
        "order",
        "answer",
        "whether",
        "yinyang",
        "gender",
        "construction",
        "allows",
        "gender",
        "equality",
        "alluding",
        "continental",
        "feminist",
        "wrote",
        "gender",
        "simone",
        "de",
        "beauvoir",
        "judith",
        "butler",
        "luce",
        "irigaray",
        "wang",
        "discus",
        "exploration",
        "gender",
        "chinese",
        "framework",
        "yinyang",
        "make",
        "clear",
        "distinction",
        "sex",
        "gender",
        "wang",
        "argues",
        "yinyang",
        "gender",
        "construction",
        "offer",
        "dynamic",
        "fluid",
        "description",
        "gender",
        "relationship",
        "wang"
    ]
}