{
    "main_text": "The Wrongs and Harms of Rape || Harms to women\n3.2 Harms to women as a group\n\nRape is unquestionably a gendered crime: 91% of rape victims are\nfemale, while almost 99% of perpetrators are male (Greenfield 1997).\nIn light both of these numbers and of rape’s broader ideological\ndynamics and social consequences, feminists have long contended that\nrape harms not only its individual victims, but also women as a class.\nBrison, for instance, calls rape “gender-motivated violence\nagainst women, which is perpetrated against women collectively, albeit\nnot all at once and in the same place” (2002, 98). Understanding\nhow rape harms women as a group requires analyzing it not only as an\nindividual act but also as an institution—that is, a structured\nsocial practice with distinct positions and roles, and with (explicit\nor implicit) rules that define who may (or must) do what under what\ncircumstances (Card 1991). Feminists have highlighted the ways in\nwhich the institution of rape reinforces the group-based subordination\nof women to men: for instance, by making women fearful, and by\nenforcing patriarchal dictates both about proper female behavior and\nabout the conditions of male sexual entitlement to women’s\nbodies. As Burgess-Jackson puts it, “Rape—the act and the\npractice—subjugates an entire class of individuals (women) to\nanother (men) …. every woman, qua woman, is wronged by\nit” (2000, 289).\n\nFeminists have long claimed that, in patriarchal cultures, rape is not\nanomalous but paradigmatic—that it enacts and reinforces, rather\nthan contradicting, widely shared cultural views about gender and\nsexuality. As Dworkin puts it, “rape is not committed by\npsychopaths or deviants from our social norms—rape is committed\nby exemplars of our social norms …. Rape is no excess,\nno aberration, no accident, no mistake—it embodies sexuality as\nthe culture defines it” (1976, 45–46). A core dynamic of\npatriarchal sexuality, on this view, is the normalizing and\nsexualizing of male (or masculine) control and dominance over females\n(or the feminine). This dynamic finds expression in a number of\nbeliefs about what is natural, acceptable, and even desirable in\nmale-female sexual interaction: that the male will be persistent and\naggressive, the female often reluctant and passive; that the male is\ninvulnerable, powerful, hard, and commanding, and that women desire\nsuch behavior from men; that “real men” are able to get\nsexual access to women when, where, and how they want it; that sexual\nintercourse is an act of male conquest; that women are men’s\nsexual objects or possessions; and that men “need” and are\nentitled to sex.\n\nOne study of undetected, self-reported acquaintance rapists found that\nthese individuals’ propensity to rape was significantly related\nnot only to their acceptance of rape myths and of traditional ideas\nabout male and female sexuality, but also to their belief that male\nsexual aggression is normal (Hinck and Thomas 1999, 816). Such beliefs\nhave repeatedly been shown to play a role not only in men’s\nself-reported likelihood of committing rape, but also in\npeople’s tendency to define rape more restrictively, and to\nattribute responsibility and blame to rape victims (1999, 816). (The\ninfluence of rape myths on people’s definitions of rape explains\nwhy most men who report engaging in “sexually assaultive,\nabusive, or coercive behavior in order to procure sexual\nintercourse” (1999, 816) do not define their own behavior as\nrape.) Feminists have coined the term ‘rape culture’ to\ndescribe the pervasiveness and acceptability of rape-supportive\nmessages in media and popular discourse. Some have further contended\nthat many rapes, being at least partially motivated by group-based\nanimus as expressed in rape-supportive beliefs, should be categorized\nas hate crimes (Wellman 2006).\n\nOn this view, rape is a political practice by which spurious beliefs\nabout gender and sexuality are expressed, inscribed, and enforced via\nthe violation and control of women’s bodies. Hampton thus claims\nthat “rape as it occurs in our society … is a moral\ninjury to all women … insofar as it is part of a pattern of\nresponse of many men toward many women that aims to establish their\nmastery qua male over a woman qua female ….\nRape confirms that women are ‘for’ men: to be used,\ndominated, treated as objects” (1999, 135). This underlying\ngender ideology helps to explain why, when men and boys are raped\n(almost always by other males), they are often seen as having been\nfeminized, treated like women and thus rendered shamefully\nwoman-like.\n\nMany feminists have emphasized the role of rape in controlling\nwomen’s behavior through fear. Dworkin contends that, due to the\nthreat of rape, “all women live in constant jeopardy, in a\nvirtual state of siege” (1976, 37); and several feminists have\ndrawn analogies between rape and lynching as forms of terrorizing,\ngroup-based social control (Burgess-Jackson 2000, 286-88). Card argues\nthat rape is a terrorist institution, one which—despite its\nadmitted differences from acts more normally labeled terrorism, such\nas bombing and hijacking—advances its political purpose, the\ncontinued subordination of women, by terrorizing a target population\n(1991). Like all terrorism, she contends, rape has two targets: the\ndirect victims, who are seen as expendable, and the broader population\nto whom a message is sent, and who can then be manipulated by fear\ninto complying with demands they would otherwise reject. In response\nto the threat of rape, women scrutinize and restrict their own\nchoices—what they wear, where they go and with whom, whether\nthey drink, what “messages” they may be inadvertently\nsending men, and so on—to ensure that they are following the\nunwritten rules that govern female behavior and that (supposedly)\ndistinguish the bad girls who get raped from the good girls who do\nnot. Even women who, because of their conformity to these rules, do\nnot feel afraid of being raped have nonetheless, Card points out, been\nterrorized into compliance.\n\nA central element of rape as a terrorist institution, Card claims, is\na protection racket in which men, as the group both creating the\ndanger and proposing to deliver women from it, dole out\nprotection—sometimes temporary, sometimes permanent, often\nillusory—in exchange for women’s service, loyalty, and\ncompliance. In this system, “good” men protect virtuous\nand deserving women from “bad” men, and part of what\ndefines a woman as deserving protection is her conformity to rules of\npatriarchal femininity. Women who are not offered protection, or who\ndecline it when offered, are then frequently blamed for being raped.\nFurthermore, as Card points out, the rules of the institution often\ngrant “protectors”—whether husbands, boyfriends, or\npimps—sexual access to the woman or women whom they protect, so\nthat nothing they do to those women is taken to count as rape. The\ninstitution thus requires a woman to give up her sexual autonomy in\nrelation to one man, in order to gain his (conditional and unreliable)\n“protection” from other men.\n\nThe threat of rape, with its false promise that by being\n“good” we can avoid disaster, plays an important role in\ntraining women in the requirements of femininity. Describing a\n“feminine bodily comportment that is marked by fear,”\nCahill observes that the female body well-trained in femininity\n“is that of a pre-victim” (2001, 157). The feminine body\nis marked by hesitancy, relative weakness, delicacy, and\nrestraint—qualities that in fact render women more vulnerable to\nviolence—and yet the woman or girl is taught to view her sexual\nbody as dangerously provocative because inherently\n“rapable” (159). Hence her duty to control, conceal, and\nmonitor her body and its movements, so as not to bring disaster upon\nherself. “The socially produced feminine body,” Cahill\nclaims, “is the body of the guilty pre-victim ….\nshe was somewhere she should not have been, moving her body in ways\nshe should not have, carrying on in a manner so free and easy as to\nconvey an utter abandonment of her responsibilities of self-protection\nand self-surveillance” (160). By molding women both to\nfemininity and to self-blame, the threat of rape thus systematically\nundermines women’s capacity to resist not only rape itself, but\nvarious other elements of their oppression as well. The threat is so\npervasive in the cultural environment that, according to Brison, girls\n“enter womanhood freighted with postmemories of sexual\nviolence” (2002,\n 87)[1],\n and years of peremptory warnings and cautionary tales lead many\nvictims to experience rape as “a threat fulfilled” (Cahill\n2001, 164).\n\nMany feminists contend that even as the institution of rape\nsystematically disadvantages women, it benefits men as a class by\nunderwriting beliefs about the naturalness of male dominance, defining\nwomen of certain kinds or in certain circumstances as “fair\ngame,” rendering women dependent on and thus beholden to men for\nprotection, and giving men a competitive advantage by restricting\nwomen’s freedom of action and movement. May and Strikwerda\ncontend that “just as the benefit to men distributes throughout\nthe male population in a given society, so the responsibility (for\nrape) should distribute as well” (1994, 148); in their view, men\nas a group bear collective responsibility for rape. Rape’s role\nin increasing the burden of fear in women’s and girls’\nlives leads Burgess-Jackson to highlight it as an issue of\ndistributive justice (1996, 181-205). He contends that the\nstate’s obligation to advance justice requires that it take\nsteps to redistribute fear so that women no longer bear it as an\nunfair and disproportionate burden; furthermore, he claims, since men\nas a class are overwhelmingly the cause of women’s fear, most or\nall of the costs of such redistribution should be borne by men.\n",
    "section_title": "3.2 Harms to women",
    "entry_title": "Feminist Perspectives on Rape",
    "hierarchy_title": "Feminist Perspectives on Rape || The Wrongs and Harms of Rape || Harms to women",
    "tokenized_text": [
        "wrong",
        "harm",
        "rape",
        "harm",
        "woman",
        "harm",
        "woman",
        "group",
        "rape",
        "unquestionably",
        "gendered",
        "crime",
        "rape",
        "victim",
        "female",
        "almost",
        "perpetrator",
        "male",
        "greenfield",
        "light",
        "number",
        "rape",
        "broader",
        "ideological",
        "dynamic",
        "social",
        "consequence",
        "feminist",
        "long",
        "contended",
        "rape",
        "harm",
        "individual",
        "victim",
        "also",
        "woman",
        "class",
        "brison",
        "instance",
        "call",
        "rape",
        "gendermotivated",
        "violence",
        "woman",
        "perpetrated",
        "woman",
        "collectively",
        "albeit",
        "place",
        "understanding",
        "rape",
        "harm",
        "woman",
        "group",
        "requires",
        "analyzing",
        "individual",
        "act",
        "also",
        "institutionthat",
        "structured",
        "social",
        "practice",
        "distinct",
        "position",
        "role",
        "explicit",
        "implicit",
        "rule",
        "define",
        "may",
        "must",
        "circumstance",
        "card",
        "feminist",
        "highlighted",
        "way",
        "institution",
        "rape",
        "reinforces",
        "groupbased",
        "subordination",
        "woman",
        "men",
        "instance",
        "making",
        "woman",
        "fearful",
        "enforcing",
        "patriarchal",
        "dictate",
        "proper",
        "female",
        "behavior",
        "condition",
        "male",
        "sexual",
        "entitlement",
        "woman",
        "body",
        "burgessjackson",
        "put",
        "rapethe",
        "act",
        "practicesubjugates",
        "entire",
        "class",
        "individual",
        "woman",
        "another",
        "men",
        "every",
        "woman",
        "qua",
        "woman",
        "wronged",
        "feminist",
        "long",
        "claimed",
        "patriarchal",
        "culture",
        "rape",
        "anomalous",
        "paradigmaticthat",
        "enacts",
        "reinforces",
        "rather",
        "contradicting",
        "widely",
        "shared",
        "cultural",
        "view",
        "gender",
        "sexuality",
        "dworkin",
        "put",
        "rape",
        "committed",
        "psychopath",
        "deviant",
        "social",
        "normsrape",
        "committed",
        "exemplar",
        "social",
        "norm",
        "rape",
        "excess",
        "aberration",
        "accident",
        "mistakeit",
        "embodies",
        "sexuality",
        "culture",
        "defines",
        "core",
        "dynamic",
        "patriarchal",
        "sexuality",
        "view",
        "normalizing",
        "sexualizing",
        "male",
        "masculine",
        "control",
        "dominance",
        "female",
        "feminine",
        "dynamic",
        "find",
        "expression",
        "number",
        "belief",
        "natural",
        "acceptable",
        "even",
        "desirable",
        "malefemale",
        "sexual",
        "interaction",
        "male",
        "persistent",
        "aggressive",
        "female",
        "often",
        "reluctant",
        "passive",
        "male",
        "invulnerable",
        "powerful",
        "hard",
        "commanding",
        "woman",
        "desire",
        "behavior",
        "men",
        "real",
        "men",
        "able",
        "get",
        "sexual",
        "access",
        "woman",
        "want",
        "sexual",
        "intercourse",
        "act",
        "male",
        "conquest",
        "woman",
        "men",
        "sexual",
        "object",
        "possession",
        "men",
        "need",
        "entitled",
        "sex",
        "one",
        "study",
        "undetected",
        "selfreported",
        "acquaintance",
        "rapist",
        "found",
        "individual",
        "propensity",
        "rape",
        "significantly",
        "related",
        "acceptance",
        "rape",
        "myth",
        "traditional",
        "idea",
        "male",
        "female",
        "sexuality",
        "also",
        "belief",
        "male",
        "sexual",
        "aggression",
        "normal",
        "hinck",
        "thomas",
        "belief",
        "repeatedly",
        "shown",
        "play",
        "role",
        "men",
        "selfreported",
        "likelihood",
        "committing",
        "rape",
        "also",
        "people",
        "tendency",
        "define",
        "rape",
        "restrictively",
        "attribute",
        "responsibility",
        "blame",
        "rape",
        "victim",
        "influence",
        "rape",
        "myth",
        "people",
        "definition",
        "rape",
        "explains",
        "men",
        "report",
        "engaging",
        "sexually",
        "assaultive",
        "abusive",
        "coercive",
        "behavior",
        "order",
        "procure",
        "sexual",
        "intercourse",
        "define",
        "behavior",
        "rape",
        "feminist",
        "coined",
        "term",
        "rape",
        "culture",
        "describe",
        "pervasiveness",
        "acceptability",
        "rapesupportive",
        "message",
        "medium",
        "popular",
        "discourse",
        "contended",
        "many",
        "rape",
        "least",
        "partially",
        "motivated",
        "groupbased",
        "animus",
        "expressed",
        "rapesupportive",
        "belief",
        "categorized",
        "hate",
        "crime",
        "wellman",
        "view",
        "rape",
        "political",
        "practice",
        "spurious",
        "belief",
        "gender",
        "sexuality",
        "expressed",
        "inscribed",
        "enforced",
        "via",
        "violation",
        "control",
        "woman",
        "body",
        "hampton",
        "thus",
        "claim",
        "rape",
        "occurs",
        "society",
        "moral",
        "injury",
        "woman",
        "insofar",
        "part",
        "pattern",
        "response",
        "many",
        "men",
        "toward",
        "many",
        "woman",
        "aim",
        "establish",
        "mastery",
        "qua",
        "male",
        "woman",
        "qua",
        "female",
        "rape",
        "confirms",
        "woman",
        "men",
        "used",
        "dominated",
        "treated",
        "object",
        "underlying",
        "gender",
        "ideology",
        "help",
        "explain",
        "men",
        "boy",
        "raped",
        "almost",
        "always",
        "male",
        "often",
        "seen",
        "feminized",
        "treated",
        "like",
        "woman",
        "thus",
        "rendered",
        "shamefully",
        "womanlike",
        "many",
        "feminist",
        "emphasized",
        "role",
        "rape",
        "controlling",
        "woman",
        "behavior",
        "fear",
        "dworkin",
        "contends",
        "due",
        "threat",
        "rape",
        "woman",
        "live",
        "constant",
        "jeopardy",
        "virtual",
        "state",
        "siege",
        "several",
        "feminist",
        "drawn",
        "analogy",
        "rape",
        "lynching",
        "form",
        "terrorizing",
        "groupbased",
        "social",
        "control",
        "burgessjackson",
        "card",
        "argues",
        "rape",
        "terrorist",
        "institution",
        "one",
        "whichdespite",
        "admitted",
        "difference",
        "act",
        "normally",
        "labeled",
        "terrorism",
        "bombing",
        "hijackingadvances",
        "political",
        "purpose",
        "continued",
        "subordination",
        "woman",
        "terrorizing",
        "target",
        "population",
        "like",
        "terrorism",
        "contends",
        "rape",
        "two",
        "target",
        "direct",
        "victim",
        "seen",
        "expendable",
        "broader",
        "population",
        "message",
        "sent",
        "manipulated",
        "fear",
        "complying",
        "demand",
        "would",
        "otherwise",
        "reject",
        "response",
        "threat",
        "rape",
        "woman",
        "scrutinize",
        "restrict",
        "choiceswhat",
        "wear",
        "go",
        "whether",
        "drink",
        "message",
        "may",
        "inadvertently",
        "sending",
        "men",
        "onto",
        "ensure",
        "following",
        "unwritten",
        "rule",
        "govern",
        "female",
        "behavior",
        "supposedly",
        "distinguish",
        "bad",
        "girl",
        "get",
        "raped",
        "good",
        "girl",
        "even",
        "woman",
        "conformity",
        "rule",
        "feel",
        "afraid",
        "raped",
        "nonetheless",
        "card",
        "point",
        "terrorized",
        "compliance",
        "central",
        "element",
        "rape",
        "terrorist",
        "institution",
        "card",
        "claim",
        "protection",
        "racket",
        "men",
        "group",
        "creating",
        "danger",
        "proposing",
        "deliver",
        "woman",
        "dole",
        "protectionsometimes",
        "temporary",
        "sometimes",
        "permanent",
        "often",
        "illusoryin",
        "exchange",
        "woman",
        "service",
        "loyalty",
        "compliance",
        "system",
        "good",
        "men",
        "protect",
        "virtuous",
        "deserving",
        "woman",
        "bad",
        "men",
        "part",
        "defines",
        "woman",
        "deserving",
        "protection",
        "conformity",
        "rule",
        "patriarchal",
        "femininity",
        "woman",
        "offered",
        "protection",
        "decline",
        "offered",
        "frequently",
        "blamed",
        "raped",
        "furthermore",
        "card",
        "point",
        "rule",
        "institution",
        "often",
        "grant",
        "protector",
        "whether",
        "husband",
        "boyfriend",
        "pimpssexual",
        "access",
        "woman",
        "woman",
        "protect",
        "nothing",
        "woman",
        "taken",
        "count",
        "rape",
        "institution",
        "thus",
        "requires",
        "woman",
        "give",
        "sexual",
        "autonomy",
        "relation",
        "one",
        "man",
        "order",
        "gain",
        "conditional",
        "unreliable",
        "protection",
        "men",
        "threat",
        "rape",
        "false",
        "promise",
        "good",
        "avoid",
        "disaster",
        "play",
        "important",
        "role",
        "training",
        "woman",
        "requirement",
        "femininity",
        "describing",
        "feminine",
        "bodily",
        "comportment",
        "marked",
        "fear",
        "cahill",
        "observes",
        "female",
        "body",
        "welltrained",
        "femininity",
        "previctim",
        "feminine",
        "body",
        "marked",
        "hesitancy",
        "relative",
        "weakness",
        "delicacy",
        "restraintqualities",
        "fact",
        "render",
        "woman",
        "vulnerable",
        "violenceand",
        "yet",
        "woman",
        "girl",
        "taught",
        "view",
        "sexual",
        "body",
        "dangerously",
        "provocative",
        "inherently",
        "rapable",
        "hence",
        "duty",
        "control",
        "conceal",
        "monitor",
        "body",
        "movement",
        "bring",
        "disaster",
        "upon",
        "socially",
        "produced",
        "feminine",
        "body",
        "cahill",
        "claim",
        "body",
        "guilty",
        "previctim",
        "somewhere",
        "moving",
        "body",
        "way",
        "carrying",
        "manner",
        "free",
        "easy",
        "convey",
        "utter",
        "abandonment",
        "responsibility",
        "selfprotection",
        "selfsurveillance",
        "molding",
        "woman",
        "femininity",
        "selfblame",
        "threat",
        "rape",
        "thus",
        "systematically",
        "undermines",
        "woman",
        "capacity",
        "resist",
        "rape",
        "various",
        "element",
        "oppression",
        "well",
        "threat",
        "pervasive",
        "cultural",
        "environment",
        "according",
        "brison",
        "girl",
        "enter",
        "womanhood",
        "freighted",
        "postmemories",
        "sexual",
        "violence",
        "year",
        "peremptory",
        "warning",
        "cautionary",
        "tale",
        "lead",
        "many",
        "victim",
        "experience",
        "rape",
        "threat",
        "fulfilled",
        "cahill",
        "many",
        "feminist",
        "contend",
        "even",
        "institution",
        "rape",
        "systematically",
        "disadvantage",
        "woman",
        "benefit",
        "men",
        "class",
        "underwriting",
        "belief",
        "naturalness",
        "male",
        "dominance",
        "defining",
        "woman",
        "certain",
        "kind",
        "certain",
        "circumstance",
        "fair",
        "game",
        "rendering",
        "woman",
        "dependent",
        "thus",
        "beholden",
        "men",
        "protection",
        "giving",
        "men",
        "competitive",
        "advantage",
        "restricting",
        "woman",
        "freedom",
        "action",
        "movement",
        "may",
        "strikwerda",
        "contend",
        "benefit",
        "men",
        "distributes",
        "throughout",
        "male",
        "population",
        "given",
        "society",
        "responsibility",
        "rape",
        "distribute",
        "well",
        "view",
        "men",
        "group",
        "bear",
        "collective",
        "responsibility",
        "rape",
        "rape",
        "role",
        "increasing",
        "burden",
        "fear",
        "woman",
        "girl",
        "life",
        "lead",
        "burgessjackson",
        "highlight",
        "issue",
        "distributive",
        "justice",
        "contends",
        "state",
        "obligation",
        "advance",
        "justice",
        "requires",
        "take",
        "step",
        "redistribute",
        "fear",
        "woman",
        "longer",
        "bear",
        "unfair",
        "disproportionate",
        "burden",
        "furthermore",
        "claim",
        "since",
        "men",
        "class",
        "overwhelmingly",
        "cause",
        "woman",
        "fear",
        "cost",
        "redistribution",
        "borne",
        "men"
    ]
}