{
    "main_text": "Art and Artists: Historical Background\n1. Art and Artists: Historical Background\n\nFeminist perspectives in aesthetics first arose in the 1970s from a\ncombination of political activism in the contemporary art world and\ncritiques of the historical traditions of philosophy and of the arts.\nThey have developed in conjunction with the postmodern debates about\nculture and society that have taken place in many fields in the social\nsciences and humanities. These debates often begin with an assessment\nof the western philosophical legacy, a legacy that is nowhere more\nchallenged than in the art world itself. Therefore, the significance\nof many contemporary art movements, including feminist and\npostfeminist work, is dramatized and clarified by understanding the\ntraditional values and theories that they address and challenge.\n\nThe richest historical target for feminist critiques of philosophies\nof art has been the concept of fine art, which refers to art that is\ncreated chiefly for aesthetic enjoyment. It includes at its core\npainting, music, literature, and sculpture, and it excludes crafts,\npopular art, and entertainment. Closely related to the concept of fine\nart are ideas about the creative genius of the artist, who is often\nconceived as possessing a unique vision expressed in art works. It was\nthe fine art tradition of painting that art historian Linda Nochlin\nhad in mind in 1971 when she asked her famous question, “Why\nhave there been no great women artists?” (Nochlin 1971 [1988]).\nSince the modifier “fine” already contains profound\nimplications for the gender of artists, some background regarding the\nolder history of ideas about art and artists is first needed in order\nto understand the variety of answers that can be provided to that\nquestion. This inquiry also positions us to understand the media,\nsubject matter, and styles that contemporary feminist artists and art\ntheorists have advanced. What is more, examination of the ancient\nroots of philosophy of art reveals a gendered value structure that\npersists to this day.\n\nThe term “art” has not always served as shorthand for the\nfine arts. Like most of the terms that refer to major conceptual\nanchors of the western intellectual tradition, its origins may be\ntraced to classical antiquity. The Greek term that we now usually\ntranslate “art” is techne, a term that is equally\nwell translated as “skill,” and that in its broadest sense\nwas used to distinguish products of human endeavor from objects of\nnature. The types of techne that most resemble our modern\nconcept of art are those that are “mimetic” or imitative,\nthat is, that reproduce the look of an object or that express an idea\nin narrative or drama. Sculpture imitates the human form, for\ninstance; music imitates sounds of nature and voices or—more\nabstractly—human emotions. Drama and epic poetry imitate lived\nevents. That art’s nature is to be mimetic was widely assumed\nfor centuries, and most commentators, including Aristotle, extolled\nthe ability of the mimetic artist to capture with beauty and skill\nsome truth about life and the world. The Roman historian Pliny the\nElder recorded the acclaim for painters who were able to render their\nsubjects in line and color so accurately that they were\nindistinguishable from their appearance in nature.\n\nProbably the earliest philosophical discussion of art in the Greek\ntradition occurs in Plato’s Republic. Unlike most of\nhis contemporaries, Plato regarded mimesis as dangerous. The\nRepublic is an extended investigation of the nature of\njustice, in the course of which Socrates and his friends envision an\nideal society that strictly censors and controls art forms such as\ndrama, music, painting, and sculpture. According to Plato’s\nmetaphysics, the abstract world of the Forms possesses a greater\ndegree of reality than the physical world with its changing, unstable\nevents and objects. Hence the more direct the apprehension of Forms,\nthe closer a human mind can approach Truth. Imitations such as\npaintings mimic the mere appearance of physical objects, becoming (as\nhe puts it in Republic X) three times removed from reality\nand the truth. Mimesis substitutes illusion for truth, and it does so\nin seductively pleasurable ways. What is more, arts such as tragic\npoetry rivet attention by engaging powerful emotions such as fear,\nenervating the virtues of a courageous person but paradoxically\npleasing at the same time. According to Plato’s analysis of the\nhuman psyche, the nonrational elements of the soul are powerful forces\nthat might divert the intellect from the cooler apprehension of\nwisdom; thus the pleasures that mimetic art delivers are sufficiently\nrisky that art should be carefully curbed in a well-governed\nsociety.\n\nPlato’s denigration of mimesis does not seem immediately to have\nanything to do with gender, although his influential system has\nimportant indirect implications that are rife with gendered\nsignificance. In his preference for the philosophical quest to attain\nknowledge of the Forms over indulgence in the pleasures of mimesis,\nfor example, one can see a hierarchy of values that rank the eternal,\nabstract, intellectual world of ideal forms over the transient,\nparticular, sensuous world of physical objects. This hierarchy\nsupports the dualism between mind and body that is deeply correlated\nwith gender asymmetry, and that was a fundamental target of critique\nin the early development of feminist perspectives in philosophy.\nFeminist philosophers take note of certain concepts that appear in\n“binary” combinations: mind-body; universal-particular;\nreason-emotion, sense, and appetite; and so forth—including\nmale-female. These are not merely correlative pairs, they are ranked\npairs in which the first item is taken to be naturally superior to the\nsecond (Gatens 1991: 92). Universality is considered superior to\nparticularity because it provides more general knowledge, for example;\nreason is superior to emotion because it is supposedly a more reliable\nfaculty. Both preferences represent a partiality for\n“objectivity” over “subjectivity,” concepts\nthat have an especially complicated significance in aesthetics. What\nis more, the sorts of pleasures that mimesis arouses are emotional and\nappetitive, appealing more to the body than to the intellect.\nTherefore we can find in Plato’s peculiar assessment of mimetic\narts an elevation of intellect and abstraction over emotion and\nparticularity. While not explicitly invoked, gender is present in\nassumptions of this discussion, because “male” and\n“female” (sometimes conflated with “masculine”\nand “feminine,” though the terms are not synonymous) are\nroot members of the pairs of opposites that have been present in\nwestern philosophy since Pythagoras. While there are no direct\nreferences to women creators in the Republic, this philosophy\nof art partakes of gendered concepts at its very core. The\nimplications of such concepts for artists evolve into explicit form\nwith the genesis of the modern category of fine art and its\ncreators.\n\nScholars disagree about how to date the rise of the special category\nof arts designated “fine arts” or “beaux\narts.” Some claim that the concept begins to emerge in the\nRenaissance, while others argue that it is not until the eighteenth\ncentury that fine art really firms up as a distinct classification\n(Kristeller 1951–52; Shiner 2001). At this time the idea that art is\nessentially mimetic begins to recede, and it gradually gives way to a\nromantic concept of art as self-expression. The eighteenth century is\nalso the period that produces many treatises comparing arts to one\nanother according to shared principles and, even more importantly,\ndevelops influential theories about a particular kind of pleasure\ntaken in objects of nature and art that becomes known as\n“aesthetic” enjoyment. This type of pleasure was central\nto the theories of taste that characterize the formative theories of\naesthetics.\n\nThe focus on fine art singles out the purely aesthetic values of works\nof art and positions them so centrally that the very concept of art is\nnarrowed. Art that is appreciated for its beauty or other aesthetic\nvirtues is distinct from the sorts of arts that produce items for\npractical use, such as furniture, cushions, or utensils. The latter\ncame to be designated “crafts,” and while their usefulness\nand skill-requirements were recognized, the making of a craft object\nwas considered decidedly less of an original achievement than the\ncreation of a work of fine art. Artistic creativity increasingly came\nto be regarded as a kind of personal expression that externalizes the\nvision of the individual artist in a work of autonomous value; craft,\nby contrast, aims at some practical function.\n\nThe significance of the fine art-craft distinction for the assessment\nof women’s creative production is substantial. While there are\nmany objects that are excluded from the category of fine art whose\nmakers are male, those objects of domestic use whose creation was\npredominantly the occupation of women were all marginalized by this\ncategory and its attendant values (Parker and Pollock 1981). Thereby\nthe traditional domestic arts were removed from the history of art\nproper. This historical change suggests one reason that painting, for\nexample, has had so few “great” female practitioners:\nhistorically women’s creative efforts were likely to be directed\nto the production of domestic wares; when these were shunted into the\ncategory of “craft,” women’s presence in the genre\nof visual arts shrank radically.\n\nWhat is more, the rise of attention to the fine arts gave those arts a\nparticularly public presence. The modern institution of the museum put\npaintings and sculptures on display; the concert hall made\nperformances available to a larger public (Shiner 2001). This is a\nperiod of history when ideas of social propriety were especially\ndivergent for men and women of the middle and upper classes, the chief\nconsumers of the fine arts. While it was considered a domestic benefit\nfor well-bred young ladies to be able to perform music at home for\nfamily and guests and to decorate the walls of the home with deft\npaintings, public exposure of such talents was widely regarded as\nimproper and unfeminine. Therefore, what talents women exercised in\nareas such as music tended to remain in the amateur realm rather than\nbe exerted in the more public professional world that monitored\nimportant developments of art forms. (There are notable exceptions\nsuch as the musicians Clara Schumann and Fanny Mendelssohn Hensel, but\nthey are comparatively few.) Thus another reason women artists in many\ngenres take a back seat to their male colleagues is that they withdrew\nfrom or were denied the kind of education and training that prepared\nthem for the exacting standards of the public audience. (Nochlin notes\nhow many women painters were trained by artist-fathers who were able\nto provide them with the kind of training that would otherwise be\ndifficult to obtain; the same may be said of women musicians [Citron\n1993; McClary 1991].) These historical explanations illuminate another\npair of opposites marked by gender: public-private. This binary has\nbeen especially investigated by feminist political theorists but also\nhas considerable significance for philosophy of art (Pollock\n1988).\n\nFrom the above we can see how the concept of “art,”\nconsidered in its aspect of “fine art,” is a gendered\nconcept that selects as its paradigms mostly works that have been made\nby male creators. Awareness of fine art’s exclusionary criteria\nis evident in contemporary feminist art practice. Mindful of the\neffects that strict divisions between fine art and craft have exerted\nover female creativity, feminist artists who were active in the\nwomen’s movement of the 1970s, such as Faith Ringgold and Miriam\nSchapiro, incorporated craft materials such as fiber and cloth into\ntheir displays (Lauter 1993). Their work employs materials with\ndomestic and feminine associations, calling attention to the\nlong-overlooked labor of women in art traditions that are different\nfrom but no less worthy of attention than the fine arts of painting\nand sculpture. Indeed, craft objects themselves such as quilts are now\noccasionally the subject of exhibits in fine-art museums, another\nrecognition that the problematic distinction between fine art and\ncraft dissolves with changing cultural assessments. These sorts of\nwork suggest that, from one point of view, women have not been so much\nabsent from the history of art, as the history of art has screened out\nmany of the forms to which they have traditionally directed their\nenergies.\n\nThe area known as “Everyday Aesthetics,” discussed below,\nhas taken up some of these insights and widened the attention of\nphilosophy so that it more readily recognizes the role of creativity\nin domestic life. Perspectives on domesticity and the daily lives of\nwomen have dramatically influenced not only the materials of art but\nalso subjects portrayed. There has been a notable increase of\ndepictions of pregnancy and motherhood in art that manifests feminist\nthinking, for example (Liss 2009; Brand and Granger 2011). Feminist\nand postfeminist art has been groundbreaking in the theoretical\nexploration of the body in its varieties and meanings, including\nsexuality and maternity. (For an example of the tandem work of art and\nphilosophy, see Dorothea Olkowski’s discussion of the art of\nMary Kelly (Olkowski 1999).) The body in art is reviewed in Section 5\nbelow.\n\nIn addition to principles of selection, another bias infuses gender\ninto the idea of fine art: the very concept of the artist. For much of\nthe modern period, the very best examples of fine art were understood\nto be the creative products of artists with special talent amounting\nto “genius,” and genius is a trait that possesses\nespecially emphatic gender meaning.\n",
    "section_title": "1. Art and Artists: Historical Background",
    "entry_title": "Feminist Aesthetics",
    "hierarchy_title": "Feminist Aesthetics || Art and Artists: Historical Background",
    "tokenized_text": [
        "art",
        "artist",
        "historical",
        "background",
        "art",
        "artist",
        "historical",
        "background",
        "feminist",
        "perspective",
        "aesthetic",
        "first",
        "arose",
        "s",
        "combination",
        "political",
        "activism",
        "contemporary",
        "art",
        "world",
        "critique",
        "historical",
        "tradition",
        "philosophy",
        "art",
        "developed",
        "conjunction",
        "postmodern",
        "debate",
        "culture",
        "society",
        "taken",
        "place",
        "many",
        "field",
        "social",
        "science",
        "humanity",
        "debate",
        "often",
        "begin",
        "assessment",
        "western",
        "philosophical",
        "legacy",
        "legacy",
        "nowhere",
        "challenged",
        "art",
        "world",
        "therefore",
        "significance",
        "many",
        "contemporary",
        "art",
        "movement",
        "including",
        "feminist",
        "postfeminist",
        "work",
        "dramatized",
        "clarified",
        "understanding",
        "traditional",
        "value",
        "theory",
        "address",
        "challenge",
        "richest",
        "historical",
        "target",
        "feminist",
        "critique",
        "philosophy",
        "art",
        "concept",
        "fine",
        "art",
        "refers",
        "art",
        "created",
        "chiefly",
        "aesthetic",
        "enjoyment",
        "includes",
        "core",
        "painting",
        "music",
        "literature",
        "sculpture",
        "excludes",
        "craft",
        "popular",
        "art",
        "entertainment",
        "closely",
        "related",
        "concept",
        "fine",
        "art",
        "idea",
        "creative",
        "genius",
        "artist",
        "often",
        "conceived",
        "possessing",
        "unique",
        "vision",
        "expressed",
        "art",
        "work",
        "fine",
        "art",
        "tradition",
        "painting",
        "art",
        "historian",
        "linda",
        "nochlin",
        "mind",
        "asked",
        "famous",
        "question",
        "great",
        "woman",
        "artist",
        "nochlin",
        "since",
        "modifier",
        "fine",
        "already",
        "contains",
        "profound",
        "implication",
        "gender",
        "artist",
        "background",
        "regarding",
        "older",
        "history",
        "idea",
        "art",
        "artist",
        "first",
        "needed",
        "order",
        "understand",
        "variety",
        "answer",
        "provided",
        "question",
        "inquiry",
        "also",
        "position",
        "u",
        "understand",
        "medium",
        "subject",
        "matter",
        "style",
        "contemporary",
        "feminist",
        "artist",
        "art",
        "theorist",
        "advanced",
        "examination",
        "ancient",
        "root",
        "philosophy",
        "art",
        "reveals",
        "gendered",
        "value",
        "structure",
        "persists",
        "day",
        "term",
        "art",
        "always",
        "served",
        "shorthand",
        "fine",
        "art",
        "like",
        "term",
        "refer",
        "major",
        "conceptual",
        "anchor",
        "western",
        "intellectual",
        "tradition",
        "origin",
        "may",
        "traced",
        "classical",
        "antiquity",
        "greek",
        "term",
        "usually",
        "translate",
        "art",
        "techne",
        "term",
        "equally",
        "well",
        "translated",
        "skill",
        "broadest",
        "sense",
        "used",
        "distinguish",
        "product",
        "human",
        "endeavor",
        "object",
        "nature",
        "type",
        "techne",
        "resemble",
        "modern",
        "concept",
        "art",
        "mimetic",
        "imitative",
        "reproduce",
        "look",
        "object",
        "express",
        "idea",
        "narrative",
        "drama",
        "sculpture",
        "imitates",
        "human",
        "form",
        "instance",
        "music",
        "imitates",
        "sound",
        "nature",
        "voice",
        "ormore",
        "abstractlyhuman",
        "emotion",
        "drama",
        "epic",
        "poetry",
        "imitate",
        "lived",
        "event",
        "art",
        "nature",
        "mimetic",
        "widely",
        "assumed",
        "century",
        "commentator",
        "including",
        "aristotle",
        "extolled",
        "ability",
        "mimetic",
        "artist",
        "capture",
        "beauty",
        "skill",
        "truth",
        "life",
        "world",
        "roman",
        "historian",
        "pliny",
        "elder",
        "recorded",
        "acclaim",
        "painter",
        "able",
        "render",
        "subject",
        "line",
        "color",
        "accurately",
        "indistinguishable",
        "appearance",
        "nature",
        "probably",
        "earliest",
        "philosophical",
        "discussion",
        "art",
        "greek",
        "tradition",
        "occurs",
        "plato",
        "republic",
        "unlike",
        "contemporary",
        "plato",
        "regarded",
        "mimesis",
        "dangerous",
        "republic",
        "extended",
        "investigation",
        "nature",
        "justice",
        "course",
        "socrates",
        "friend",
        "envision",
        "ideal",
        "society",
        "strictly",
        "censor",
        "control",
        "art",
        "form",
        "drama",
        "music",
        "painting",
        "sculpture",
        "according",
        "plato",
        "metaphysics",
        "abstract",
        "world",
        "form",
        "posse",
        "greater",
        "degree",
        "reality",
        "physical",
        "world",
        "changing",
        "unstable",
        "event",
        "object",
        "hence",
        "direct",
        "apprehension",
        "form",
        "closer",
        "human",
        "mind",
        "approach",
        "truth",
        "imitation",
        "painting",
        "mimic",
        "mere",
        "appearance",
        "physical",
        "object",
        "becoming",
        "put",
        "republic",
        "x",
        "three",
        "time",
        "removed",
        "reality",
        "truth",
        "mimesis",
        "substitute",
        "illusion",
        "truth",
        "seductively",
        "pleasurable",
        "way",
        "art",
        "tragic",
        "poetry",
        "rivet",
        "attention",
        "engaging",
        "powerful",
        "emotion",
        "fear",
        "enervating",
        "virtue",
        "courageous",
        "person",
        "paradoxically",
        "pleasing",
        "time",
        "according",
        "plato",
        "analysis",
        "human",
        "psyche",
        "nonrational",
        "element",
        "soul",
        "powerful",
        "force",
        "might",
        "divert",
        "intellect",
        "cooler",
        "apprehension",
        "wisdom",
        "thus",
        "pleasure",
        "mimetic",
        "art",
        "delivers",
        "sufficiently",
        "risky",
        "art",
        "carefully",
        "curbed",
        "wellgoverned",
        "society",
        "plato",
        "denigration",
        "mimesis",
        "seem",
        "immediately",
        "anything",
        "gender",
        "although",
        "influential",
        "system",
        "important",
        "indirect",
        "implication",
        "rife",
        "gendered",
        "significance",
        "preference",
        "philosophical",
        "quest",
        "attain",
        "knowledge",
        "form",
        "indulgence",
        "pleasure",
        "mimesis",
        "example",
        "one",
        "see",
        "hierarchy",
        "value",
        "rank",
        "eternal",
        "abstract",
        "intellectual",
        "world",
        "ideal",
        "form",
        "transient",
        "particular",
        "sensuous",
        "world",
        "physical",
        "object",
        "hierarchy",
        "support",
        "dualism",
        "mind",
        "body",
        "deeply",
        "correlated",
        "gender",
        "asymmetry",
        "fundamental",
        "target",
        "critique",
        "early",
        "development",
        "feminist",
        "perspective",
        "philosophy",
        "feminist",
        "philosopher",
        "take",
        "note",
        "certain",
        "concept",
        "appear",
        "binary",
        "combination",
        "mindbody",
        "universalparticular",
        "reasonemotion",
        "sense",
        "appetite",
        "forthincluding",
        "malefemale",
        "merely",
        "correlative",
        "pair",
        "ranked",
        "pair",
        "first",
        "item",
        "taken",
        "naturally",
        "superior",
        "second",
        "gatens",
        "universality",
        "considered",
        "superior",
        "particularity",
        "provides",
        "general",
        "knowledge",
        "example",
        "reason",
        "superior",
        "emotion",
        "supposedly",
        "reliable",
        "faculty",
        "preference",
        "represent",
        "partiality",
        "objectivity",
        "subjectivity",
        "concept",
        "especially",
        "complicated",
        "significance",
        "aesthetic",
        "sort",
        "pleasure",
        "mimesis",
        "arouses",
        "emotional",
        "appetitive",
        "appealing",
        "body",
        "intellect",
        "therefore",
        "find",
        "plato",
        "peculiar",
        "assessment",
        "mimetic",
        "art",
        "elevation",
        "intellect",
        "abstraction",
        "emotion",
        "particularity",
        "explicitly",
        "invoked",
        "gender",
        "present",
        "assumption",
        "discussion",
        "male",
        "female",
        "sometimes",
        "conflated",
        "masculine",
        "feminine",
        "though",
        "term",
        "synonymous",
        "root",
        "member",
        "pair",
        "opposite",
        "present",
        "western",
        "philosophy",
        "since",
        "pythagoras",
        "direct",
        "reference",
        "woman",
        "creator",
        "republic",
        "philosophy",
        "art",
        "partakes",
        "gendered",
        "concept",
        "core",
        "implication",
        "concept",
        "artist",
        "evolve",
        "explicit",
        "form",
        "genesis",
        "modern",
        "category",
        "fine",
        "art",
        "creator",
        "scholar",
        "disagree",
        "date",
        "rise",
        "special",
        "category",
        "art",
        "designated",
        "fine",
        "art",
        "beau",
        "arts",
        "claim",
        "concept",
        "begin",
        "emerge",
        "renaissance",
        "others",
        "argue",
        "eighteenth",
        "century",
        "fine",
        "art",
        "really",
        "firm",
        "distinct",
        "classification",
        "kristeller",
        "shiner",
        "time",
        "idea",
        "art",
        "essentially",
        "mimetic",
        "begin",
        "recede",
        "gradually",
        "give",
        "way",
        "romantic",
        "concept",
        "art",
        "selfexpression",
        "eighteenth",
        "century",
        "also",
        "period",
        "produce",
        "many",
        "treatise",
        "comparing",
        "art",
        "one",
        "another",
        "according",
        "shared",
        "principle",
        "even",
        "importantly",
        "develops",
        "influential",
        "theory",
        "particular",
        "kind",
        "pleasure",
        "taken",
        "object",
        "nature",
        "art",
        "becomes",
        "known",
        "aesthetic",
        "enjoyment",
        "type",
        "pleasure",
        "central",
        "theory",
        "taste",
        "characterize",
        "formative",
        "theory",
        "aesthetic",
        "focus",
        "fine",
        "art",
        "single",
        "purely",
        "aesthetic",
        "value",
        "work",
        "art",
        "position",
        "centrally",
        "concept",
        "art",
        "narrowed",
        "art",
        "appreciated",
        "beauty",
        "aesthetic",
        "virtue",
        "distinct",
        "sort",
        "art",
        "produce",
        "item",
        "practical",
        "use",
        "furniture",
        "cushion",
        "utensil",
        "latter",
        "came",
        "designated",
        "craft",
        "usefulness",
        "skillrequirements",
        "recognized",
        "making",
        "craft",
        "object",
        "considered",
        "decidedly",
        "le",
        "original",
        "achievement",
        "creation",
        "work",
        "fine",
        "art",
        "artistic",
        "creativity",
        "increasingly",
        "came",
        "regarded",
        "kind",
        "personal",
        "expression",
        "externalizes",
        "vision",
        "individual",
        "artist",
        "work",
        "autonomous",
        "value",
        "craft",
        "contrast",
        "aim",
        "practical",
        "function",
        "significance",
        "fine",
        "artcraft",
        "distinction",
        "assessment",
        "woman",
        "creative",
        "production",
        "substantial",
        "many",
        "object",
        "excluded",
        "category",
        "fine",
        "art",
        "whose",
        "maker",
        "male",
        "object",
        "domestic",
        "use",
        "whose",
        "creation",
        "predominantly",
        "occupation",
        "woman",
        "marginalized",
        "category",
        "attendant",
        "value",
        "parker",
        "pollock",
        "thereby",
        "traditional",
        "domestic",
        "art",
        "removed",
        "history",
        "art",
        "proper",
        "historical",
        "change",
        "suggests",
        "one",
        "reason",
        "painting",
        "example",
        "great",
        "female",
        "practitioner",
        "historically",
        "woman",
        "creative",
        "effort",
        "likely",
        "directed",
        "production",
        "domestic",
        "ware",
        "shunted",
        "category",
        "craft",
        "woman",
        "presence",
        "genre",
        "visual",
        "art",
        "shrank",
        "radically",
        "rise",
        "attention",
        "fine",
        "art",
        "gave",
        "art",
        "particularly",
        "public",
        "presence",
        "modern",
        "institution",
        "museum",
        "put",
        "painting",
        "sculpture",
        "display",
        "concert",
        "hall",
        "made",
        "performance",
        "available",
        "larger",
        "public",
        "shiner",
        "period",
        "history",
        "idea",
        "social",
        "propriety",
        "especially",
        "divergent",
        "men",
        "woman",
        "middle",
        "upper",
        "class",
        "chief",
        "consumer",
        "fine",
        "art",
        "considered",
        "domestic",
        "benefit",
        "wellbred",
        "young",
        "lady",
        "able",
        "perform",
        "music",
        "home",
        "family",
        "guest",
        "decorate",
        "wall",
        "home",
        "deft",
        "painting",
        "public",
        "exposure",
        "talent",
        "widely",
        "regarded",
        "improper",
        "unfeminine",
        "therefore",
        "talent",
        "woman",
        "exercised",
        "area",
        "music",
        "tended",
        "remain",
        "amateur",
        "realm",
        "rather",
        "exerted",
        "public",
        "professional",
        "world",
        "monitored",
        "important",
        "development",
        "art",
        "form",
        "notable",
        "exception",
        "musician",
        "clara",
        "schumann",
        "fanny",
        "mendelssohn",
        "hensel",
        "comparatively",
        "thus",
        "another",
        "reason",
        "woman",
        "artist",
        "many",
        "genre",
        "take",
        "back",
        "seat",
        "male",
        "colleague",
        "withdrew",
        "denied",
        "kind",
        "education",
        "training",
        "prepared",
        "exacting",
        "standard",
        "public",
        "audience",
        "nochlin",
        "note",
        "many",
        "woman",
        "painter",
        "trained",
        "artistfathers",
        "able",
        "provide",
        "kind",
        "training",
        "would",
        "otherwise",
        "difficult",
        "obtain",
        "may",
        "said",
        "woman",
        "musician",
        "citron",
        "mcclary",
        "historical",
        "explanation",
        "illuminate",
        "another",
        "pair",
        "opposite",
        "marked",
        "gender",
        "publicprivate",
        "binary",
        "especially",
        "investigated",
        "feminist",
        "political",
        "theorist",
        "also",
        "considerable",
        "significance",
        "philosophy",
        "art",
        "pollock",
        "see",
        "concept",
        "art",
        "considered",
        "aspect",
        "fine",
        "art",
        "gendered",
        "concept",
        "selects",
        "paradigm",
        "mostly",
        "work",
        "made",
        "male",
        "creator",
        "awareness",
        "fine",
        "art",
        "exclusionary",
        "criterion",
        "evident",
        "contemporary",
        "feminist",
        "art",
        "practice",
        "mindful",
        "effect",
        "strict",
        "division",
        "fine",
        "art",
        "craft",
        "exerted",
        "female",
        "creativity",
        "feminist",
        "artist",
        "active",
        "woman",
        "movement",
        "s",
        "faith",
        "ringgold",
        "miriam",
        "schapiro",
        "incorporated",
        "craft",
        "material",
        "fiber",
        "cloth",
        "display",
        "lauter",
        "work",
        "employ",
        "material",
        "domestic",
        "feminine",
        "association",
        "calling",
        "attention",
        "longoverlooked",
        "labor",
        "woman",
        "art",
        "tradition",
        "different",
        "le",
        "worthy",
        "attention",
        "fine",
        "art",
        "painting",
        "sculpture",
        "indeed",
        "craft",
        "object",
        "quilt",
        "occasionally",
        "subject",
        "exhibit",
        "fineart",
        "museum",
        "another",
        "recognition",
        "problematic",
        "distinction",
        "fine",
        "art",
        "craft",
        "dissolve",
        "changing",
        "cultural",
        "assessment",
        "sort",
        "work",
        "suggest",
        "one",
        "point",
        "view",
        "woman",
        "much",
        "absent",
        "history",
        "art",
        "history",
        "art",
        "screened",
        "many",
        "form",
        "traditionally",
        "directed",
        "energy",
        "area",
        "known",
        "everyday",
        "aesthetic",
        "discussed",
        "taken",
        "insight",
        "widened",
        "attention",
        "philosophy",
        "readily",
        "recognizes",
        "role",
        "creativity",
        "domestic",
        "life",
        "perspective",
        "domesticity",
        "daily",
        "life",
        "woman",
        "dramatically",
        "influenced",
        "material",
        "art",
        "also",
        "subject",
        "portrayed",
        "notable",
        "increase",
        "depiction",
        "pregnancy",
        "motherhood",
        "art",
        "manifest",
        "feminist",
        "thinking",
        "example",
        "li",
        "brand",
        "granger",
        "feminist",
        "postfeminist",
        "art",
        "groundbreaking",
        "theoretical",
        "exploration",
        "body",
        "variety",
        "meaning",
        "including",
        "sexuality",
        "maternity",
        "example",
        "tandem",
        "work",
        "art",
        "philosophy",
        "see",
        "dorothea",
        "olkowski",
        "discussion",
        "art",
        "mary",
        "kelly",
        "olkowski",
        "body",
        "art",
        "reviewed",
        "section",
        "addition",
        "principle",
        "selection",
        "another",
        "bias",
        "infuses",
        "gender",
        "idea",
        "fine",
        "art",
        "concept",
        "artist",
        "much",
        "modern",
        "period",
        "best",
        "example",
        "fine",
        "art",
        "understood",
        "creative",
        "product",
        "artist",
        "special",
        "talent",
        "amounting",
        "genius",
        "genius",
        "trait",
        "posse",
        "especially",
        "emphatic",
        "gender",
        "meaning"
    ]
}