{
    "main_text": "Reconceptualizations of the Self || The Dynamic and Relational Self\n3.1 The Dynamic and Relational Self\n\nAs we have seen, many feminist philosophers argue that it is a mistake\nto hold that rationality alone is essential to the self and that the\nideal self is transparent, unified, coherent, and independent, since\nthey discern misogynist subtexts in the atomistic individualism of the\nKantian ethical subject and homo economicus (see\n section 1).\n While some feminists argue for a relational model of autonomy, others\nreject the narrative of separation from the maternal sphere as an\noverarching framing device for maturation. Drawing upon multicultural\nand global sources, they see this narrative arc as falling short of\nthe complex dynamics of a multilayered, interconnected self that may\ngrow through sustained interactions through its community rather than\nin decisive breaks from them. In this section, we take up new\nconceptions of the relational self. These conceptions involve novel\ncontributions to the philosophy of selfhood, sometimes drawing on\nframeworks from traditions such as poststructuralism, psychoanalysis,\nnarrative theory, and local knowledges. Feminist philosophers\ngravitate toward these approaches to understanding selfhood because\nthey do not share the drawbacks that prompt feminist critiques of the\nKantian ethical subject and homo economicus. None of these approaches\nregards the self as homogeneous or transparent; none removes the self\nfrom its cultural or interpersonal setting; none sidelines the\nbody.\n\nTaking a psychoanalytic approach, Julia Kristeva maintains that\ninfants gradually develop autonomy from their caregivers, but\ncomplicates this narrative by transposing the classical Freudian\nconception of the self and its distinction between consciousness and\nthe unconscious into an explicitly gendered framework (Kristeva 1980;\nOliver 1993; McAfee 2003; Miller 2014). For Kristeva, the self is a\nsubject of enunciation—a speaker who can use the pronoun\n“I”. But speakers are neither unitary nor fully in control\nof what they say because discourse is bifurcated. The symbolic\ndimension of language, which is characterized by referential signs and\nlinear logic, corresponds to consciousness and control. The semiotic\ndimension of language, which is characterized by figurative language,\ncadences, and intonations, corresponds to the unruly, passion-fueled\nunconscious. All discourse combines elements of both registers. This\ncontention connects Kristeva’s account to feminist concerns\nabout gender and the self. Since the rational orderliness of the\nsymbolic is culturally coded masculine, while the affect-laden allure\nof the semiotic is culturally coded feminine, it follows that no\ndiscourse is purely masculine or purely feminine. The masculine\nsymbolic and the feminine semiotic are equally indispensable to the\nspeaking subject, whatever this individual’s socially assigned\ngender may be. Every self amalgamates masculine and feminine\ndiscursive modalities.\n\nLike the unconscious in classical psychoanalytic theory, the semiotic\ndecenters the self. One may try to express one’s thoughts in\ndefinite, straightforward language, yet because of the semiotic\naspects of one’s utterances, what one says carries no single\nmeaning and is amenable to being interpreted in more than one way. In\nKristeva’s view, this is all to the good, for accessing the\nsemiotic—that which is conveyed, often inadvertently, by the\nstyle of an utterance—kindles social critique. The semiotic\ngives expression to repressed, unconscious material. According to\nKristeva, what society systematically represses provides clues to what\nis oppressive about society and how society needs to be changed. Thus,\nshe discerns a vital ethical potential in the semiotic (Kristeva 1983\n[1987]). Since this ethical potential is explicitly linked to the\nfeminine, moreover, Kristeva’s account of the self displaces\n“masculine” adherence to principle as the prime mode of\nethical agency and recognizes the urgent need for a\n“feminine” ethical approach. At the same time,\nKristeva’s questionable-subject-in-process seems for some to\nenshrine the very gender dichotomy that causes women so much grief.\nThe association of the woman/mother with the unruly and ambiguous\nsemiotic may obscure the rich affect attunement and preverbal\ndialogues between caregivers and their socially-oriented infants\n(Willett 1995). Kelly Oliver’s interpretation of Kristeva\nresists some of these more gendered components of Kristeva’s\nview and expands upon the relational self as a capacity for a loving\nsense of “response-ability” to otherness and difference\n(Oliver 1998). For Oliver, the self is fluidly defined by its openness\nto others.\n\nIn contrast with the revaluing of motherhood and/or femininity that\nKristeva and others undertake (see\n section 2),\n poststructuralists, critical race theorists, and trans* feminists\nhave been vocal about the heterosexist and binary assumptions in some\nfeminist conceptions of the self, as well as their inattention to\nother forms of difference among women. In the face of this, many\nfeminists have offered accounts of the self designed to accommodate a\nwider range of differences. The earlier work of poststructuralist\nJudith Butler maintains that personal identity is an illusion (Butler\n1990). The self is merely an unstable discursive node, and\nsexed/gendered identity is a “corporeal style”—the\nimitation and repeated enactment of norms, frequently ones that are\ndemanded by cultural contexts. For Butler, psychodynamic accounts of\nthe self such as Kristeva’s camouflage the performative nature\nof the self and collaborate in the cultural conspiracy that maintains\nthe illusion that one has an anchored identity derived from\none’s biological nature (manifested in one’s genitalia).\nSuch accounts perniciously conceal the ways that normalizing regimes\nof the state and culture deploy power to enforce “natural”\nsexed/gendered bodies together with “unnatural” bodies,\nobscuring the arbitrariness of the constraints that are being imposed\nin order to deflect resistance to them. The solution, in\nButler’s view, is to question the categories of biological sex,\ngender, and sexuality that serve as markers of personal identity. Sex,\ngender, and sexuality are at the very “core” of\nself-identity, because self-identity is constructed through modes of\npower. Thus, resistance may be developed in enacting one’s\nidentity differently, through unorthodox performances and parodic\nidentities: the construction of identity is a site of political\ncontestation. Butler’s more recent work continues to emphasize\nthe relationality of the self through its dispossession by the very\ndiscursive structures that call the self into existence (Butler 2005).\n\nButler is also a major contributor to feminist theories of narrative\nidentity, one of the most important strands of contemporary feminist\ntheories of the self. Feminist narrative views of the self are\nprominent in both Anglo-American and Continental traditions of\nphilosophy. Adriana Cavarero promulgates the “narratable\nself” as an alternative to the self-constituting subject of\ntraditional philosophy (Cavarero 1997). This self does not have a\npremium on self-narration; rather, others may actually have a better\nhandle on one’s own self. For this reason, narrating oneself\nmust occur within a communal, political context. Subjectivity is\nnecessarily inclined toward others (Cavarero 1997). Butler, in part drawing on\nCavarero’s views, suggests that the self is constructed in an\nongoing fashion through giving an account of itself to others (Butler\n2005). Linda Martín Alcoff combines poststructuralism with a\nhermeneutic approach, declaring that social identities are\nrelational and core to narratives of the self (Alcoff\n2006). Memory has long been seen as a locus of\nself-identity, and narrating one’s life story is crucially\nlinked with memory. Yet feminists contend that narration and memory\nare relational, often involving communal social practices (Brison\n2002; Campbell 2003). Rather than promulgating an ideal of\nself-knowledge, which presumes a fixed self that a reliable, rational\nknower discovers at the core of everyday life, feminist narrative\ntheorists advocate self-cultivation within contextual practices.\nHere we see again that for\nfeminists, the ontology and metaphysics of selfhood are inseparable\nfrom ethical, social, and political domains.\n\nThis is also the case for strands of queer and trans* theory as they\nintersect with feminist approaches. For trans* theorists, metaphysical\nquestions about identity operate within dominant discourses that\nfrequently perpetuate violence and transphobia, as well as within\nqueer and transgender subcultures that redefine gender and sex\nidentities in a dynamic, collaborative fashion (Bettcher 2014, 2016,\n2017a, 2017b). Trans feminist Talia Mae Bettcher pushes back on\nnarratives of trans identity that are modeled on liberal individualist\nmodels of selfhood, such as the idea that a trans individual might\nhave been “trapped in the wrong body” and, after coming\nout, may let their core true self come to the surface (Bettcher 2014).\nBettcher contends that the idea of a true gendered self at the core of\na person overlooks the ways that gender and sex are created by culture\n(Bettcher 2014). It also tends to entrench mind-body dualism, whereas\nmovements such as phenomenology have shown that gendered embodiment is\na very feature of selfhood. In this vein, Bettcher argues that sexism\nand transphobia trade on a presumed hierarchy where one’s\n“proper” appearance, or clothed appearance in public, is\ntaken to be subordinate to one’s “intimate”\nappearance when naked. For Bettcher, these two forms of appearance are\nin fact on par, since both are culturally constituted.\n\nTrans* feminist accounts frequently underscore the relationality of\nthe self, including the potential that others have to define us. If\nothers did not have such power, internalized sources of psychic\ndiscord such as gender dysphoria, and the desire that many trans*\nfolks express for recognition or “passing”, would be\ndifficult to explain. It would also be difficult to explain\ntransphobia: as Alexis Shotwell and Trevor Sangrey argue, cisgender\nindividuals’ resistance to recognizing trans* identities hinges\non the fact that trans* gender expression affects cisgender identity\n(Shotwell and Sangrey 2009). Shotwell and Sangrey draw on the feminist\ntheory of selfhood put forth by Brison to develop this argument. And,\nwhile the relational constitution of gender identity within a given\nculture is a cause of transphobia, some queer and trans* feminists\nhold that it is also the basis of self-transformation. Specifically,\nKim Q. Hall points out that queer crip communities affirm transforming\noneself through transforming one’s bodies. These creative\ntransformations occur within “the context of communities of\nsupport and recognition” (Hall 2009). They frequently involve\nthe desire for intersubjective recognition, where body modifications\nmay be undertaken in order to foster a relatively continuous sense of\nself (Rubin 2003). This further demonstrates the way that public\nidentities are not removed from an interior sense of self, as liberal\nindividual models tended to assume. This continuity, however, need not\nrely on the narrative of a “core” interior self that is\nmerely seeking validation from a public. Instead, intersubjective\nself-fashioning may reject an interior/exterior dichotomy to begin\nwith, following arguments such as Bettcher’s above. They also\nfollow feminist phenomenology in disrupting the presumed binary\nbetween nature and culture in bodily comportment (Salamon 2010; Heyes\n2007; Hale 1998). Although discussions in trans* theory and queer\ntheory often do not occur within a feminist context, the emphasis on\nlived embodiment, first-person authority, and the relationality of\nselfhood frequently found in these discourses both draw on and\ncontribute to feminist discussions of selfhood in crucial ways.\n",
    "section_title": "3.1 The Dynamic and Relational Self",
    "entry_title": "Feminist Perspectives on the Self",
    "hierarchy_title": "Feminist Perspectives on the Self || Reconceptualizations of the Self || The Dynamic and Relational Self",
    "tokenized_text": [
        "reconceptualizations",
        "self",
        "dynamic",
        "relational",
        "self",
        "dynamic",
        "relational",
        "self",
        "seen",
        "many",
        "feminist",
        "philosopher",
        "argue",
        "mistake",
        "hold",
        "rationality",
        "alone",
        "essential",
        "self",
        "ideal",
        "self",
        "transparent",
        "unified",
        "coherent",
        "independent",
        "since",
        "discern",
        "misogynist",
        "subtexts",
        "atomistic",
        "individualism",
        "kantian",
        "ethical",
        "subject",
        "homo",
        "economicus",
        "see",
        "section",
        "feminist",
        "argue",
        "relational",
        "model",
        "autonomy",
        "others",
        "reject",
        "narrative",
        "separation",
        "maternal",
        "sphere",
        "overarching",
        "framing",
        "device",
        "maturation",
        "drawing",
        "upon",
        "multicultural",
        "global",
        "source",
        "see",
        "narrative",
        "arc",
        "falling",
        "short",
        "complex",
        "dynamic",
        "multilayered",
        "interconnected",
        "self",
        "may",
        "grow",
        "sustained",
        "interaction",
        "community",
        "rather",
        "decisive",
        "break",
        "section",
        "take",
        "new",
        "conception",
        "relational",
        "self",
        "conception",
        "involve",
        "novel",
        "contribution",
        "philosophy",
        "selfhood",
        "sometimes",
        "drawing",
        "framework",
        "tradition",
        "poststructuralism",
        "psychoanalysis",
        "narrative",
        "theory",
        "local",
        "knowledge",
        "feminist",
        "philosopher",
        "gravitate",
        "toward",
        "approach",
        "understanding",
        "selfhood",
        "share",
        "drawback",
        "prompt",
        "feminist",
        "critique",
        "kantian",
        "ethical",
        "subject",
        "homo",
        "economicus",
        "none",
        "approach",
        "regard",
        "self",
        "homogeneous",
        "transparent",
        "none",
        "remove",
        "self",
        "cultural",
        "interpersonal",
        "setting",
        "none",
        "sideline",
        "body",
        "taking",
        "psychoanalytic",
        "approach",
        "julia",
        "kristeva",
        "maintains",
        "infant",
        "gradually",
        "develop",
        "autonomy",
        "caregiver",
        "complicates",
        "narrative",
        "transposing",
        "classical",
        "freudian",
        "conception",
        "self",
        "distinction",
        "consciousness",
        "unconscious",
        "explicitly",
        "gendered",
        "framework",
        "kristeva",
        "oliver",
        "mcafee",
        "miller",
        "kristeva",
        "self",
        "subject",
        "enunciationa",
        "speaker",
        "use",
        "pronoun",
        "speaker",
        "neither",
        "unitary",
        "fully",
        "control",
        "say",
        "discourse",
        "bifurcated",
        "symbolic",
        "dimension",
        "language",
        "characterized",
        "referential",
        "sign",
        "linear",
        "logic",
        "corresponds",
        "consciousness",
        "control",
        "semiotic",
        "dimension",
        "language",
        "characterized",
        "figurative",
        "language",
        "cadence",
        "intonation",
        "corresponds",
        "unruly",
        "passionfueled",
        "unconscious",
        "discourse",
        "combine",
        "element",
        "register",
        "contention",
        "connects",
        "kristeva",
        "account",
        "feminist",
        "concern",
        "gender",
        "self",
        "since",
        "rational",
        "orderliness",
        "symbolic",
        "culturally",
        "coded",
        "masculine",
        "affectladen",
        "allure",
        "semiotic",
        "culturally",
        "coded",
        "feminine",
        "follows",
        "discourse",
        "purely",
        "masculine",
        "purely",
        "feminine",
        "masculine",
        "symbolic",
        "feminine",
        "semiotic",
        "equally",
        "indispensable",
        "speaking",
        "subject",
        "whatever",
        "individual",
        "socially",
        "assigned",
        "gender",
        "may",
        "every",
        "self",
        "amalgamates",
        "masculine",
        "feminine",
        "discursive",
        "modality",
        "like",
        "unconscious",
        "classical",
        "psychoanalytic",
        "theory",
        "semiotic",
        "decenters",
        "self",
        "one",
        "may",
        "try",
        "express",
        "one",
        "thought",
        "definite",
        "straightforward",
        "language",
        "yet",
        "semiotic",
        "aspect",
        "one",
        "utterance",
        "one",
        "say",
        "carry",
        "single",
        "meaning",
        "amenable",
        "interpreted",
        "one",
        "way",
        "kristeva",
        "view",
        "good",
        "accessing",
        "semioticthat",
        "conveyed",
        "often",
        "inadvertently",
        "style",
        "utterancekindles",
        "social",
        "critique",
        "semiotic",
        "give",
        "expression",
        "repressed",
        "unconscious",
        "material",
        "according",
        "kristeva",
        "society",
        "systematically",
        "represses",
        "provides",
        "clue",
        "oppressive",
        "society",
        "society",
        "need",
        "changed",
        "thus",
        "discerns",
        "vital",
        "ethical",
        "potential",
        "semiotic",
        "kristeva",
        "since",
        "ethical",
        "potential",
        "explicitly",
        "linked",
        "feminine",
        "moreover",
        "kristeva",
        "account",
        "self",
        "displaces",
        "masculine",
        "adherence",
        "principle",
        "prime",
        "mode",
        "ethical",
        "agency",
        "recognizes",
        "urgent",
        "need",
        "feminine",
        "ethical",
        "approach",
        "time",
        "kristeva",
        "questionablesubjectinprocess",
        "seems",
        "enshrine",
        "gender",
        "dichotomy",
        "cause",
        "woman",
        "much",
        "grief",
        "association",
        "womanmother",
        "unruly",
        "ambiguous",
        "semiotic",
        "may",
        "obscure",
        "rich",
        "affect",
        "attunement",
        "preverbal",
        "dialogue",
        "caregiver",
        "sociallyoriented",
        "infant",
        "willett",
        "kelly",
        "oliver",
        "interpretation",
        "kristeva",
        "resists",
        "gendered",
        "component",
        "kristeva",
        "view",
        "expands",
        "upon",
        "relational",
        "self",
        "capacity",
        "loving",
        "sense",
        "responseability",
        "otherness",
        "difference",
        "oliver",
        "oliver",
        "self",
        "fluidly",
        "defined",
        "openness",
        "others",
        "contrast",
        "revaluing",
        "motherhood",
        "andor",
        "femininity",
        "kristeva",
        "others",
        "undertake",
        "see",
        "section",
        "poststructuralists",
        "critical",
        "race",
        "theorist",
        "trans",
        "feminist",
        "vocal",
        "heterosexist",
        "binary",
        "assumption",
        "feminist",
        "conception",
        "self",
        "well",
        "inattention",
        "form",
        "difference",
        "among",
        "woman",
        "face",
        "many",
        "feminist",
        "offered",
        "account",
        "self",
        "designed",
        "accommodate",
        "wider",
        "range",
        "difference",
        "earlier",
        "work",
        "poststructuralist",
        "judith",
        "butler",
        "maintains",
        "personal",
        "identity",
        "illusion",
        "butler",
        "self",
        "merely",
        "unstable",
        "discursive",
        "node",
        "sexedgendered",
        "identity",
        "corporeal",
        "style",
        "the",
        "imitation",
        "repeated",
        "enactment",
        "norm",
        "frequently",
        "one",
        "demanded",
        "cultural",
        "context",
        "butler",
        "psychodynamic",
        "account",
        "self",
        "kristeva",
        "camouflage",
        "performative",
        "nature",
        "self",
        "collaborate",
        "cultural",
        "conspiracy",
        "maintains",
        "illusion",
        "one",
        "anchored",
        "identity",
        "derived",
        "one",
        "biological",
        "nature",
        "manifested",
        "one",
        "genitalia",
        "account",
        "perniciously",
        "conceal",
        "way",
        "normalizing",
        "regime",
        "state",
        "culture",
        "deploy",
        "power",
        "enforce",
        "natural",
        "sexedgendered",
        "body",
        "together",
        "unnatural",
        "body",
        "obscuring",
        "arbitrariness",
        "constraint",
        "imposed",
        "order",
        "deflect",
        "resistance",
        "solution",
        "butler",
        "view",
        "question",
        "category",
        "biological",
        "sex",
        "gender",
        "sexuality",
        "serve",
        "marker",
        "personal",
        "identity",
        "sex",
        "gender",
        "sexuality",
        "core",
        "selfidentity",
        "selfidentity",
        "constructed",
        "mode",
        "power",
        "thus",
        "resistance",
        "may",
        "developed",
        "enacting",
        "one",
        "identity",
        "differently",
        "unorthodox",
        "performance",
        "parodic",
        "identity",
        "construction",
        "identity",
        "site",
        "political",
        "contestation",
        "butler",
        "recent",
        "work",
        "continues",
        "emphasize",
        "relationality",
        "self",
        "dispossession",
        "discursive",
        "structure",
        "call",
        "self",
        "existence",
        "butler",
        "butler",
        "also",
        "major",
        "contributor",
        "feminist",
        "theory",
        "narrative",
        "identity",
        "one",
        "important",
        "strand",
        "contemporary",
        "feminist",
        "theory",
        "self",
        "feminist",
        "narrative",
        "view",
        "self",
        "prominent",
        "angloamerican",
        "continental",
        "tradition",
        "philosophy",
        "adriana",
        "cavarero",
        "promulgates",
        "narratable",
        "self",
        "alternative",
        "selfconstituting",
        "subject",
        "traditional",
        "philosophy",
        "cavarero",
        "self",
        "premium",
        "selfnarration",
        "rather",
        "others",
        "may",
        "actually",
        "better",
        "handle",
        "one",
        "self",
        "reason",
        "narrating",
        "oneself",
        "must",
        "occur",
        "within",
        "communal",
        "political",
        "context",
        "subjectivity",
        "necessarily",
        "inclined",
        "toward",
        "others",
        "cavarero",
        "butler",
        "part",
        "drawing",
        "cavarero",
        "view",
        "suggests",
        "self",
        "constructed",
        "ongoing",
        "fashion",
        "giving",
        "account",
        "others",
        "butler",
        "linda",
        "martín",
        "alcoff",
        "combine",
        "poststructuralism",
        "hermeneutic",
        "approach",
        "declaring",
        "social",
        "identity",
        "relational",
        "core",
        "narrative",
        "self",
        "alcoff",
        "memory",
        "long",
        "seen",
        "locus",
        "selfidentity",
        "narrating",
        "one",
        "life",
        "story",
        "crucially",
        "linked",
        "memory",
        "yet",
        "feminist",
        "contend",
        "narration",
        "memory",
        "relational",
        "often",
        "involving",
        "communal",
        "social",
        "practice",
        "brison",
        "campbell",
        "rather",
        "promulgating",
        "ideal",
        "selfknowledge",
        "presumes",
        "fixed",
        "self",
        "reliable",
        "rational",
        "knower",
        "discovers",
        "core",
        "everyday",
        "life",
        "feminist",
        "narrative",
        "theorist",
        "advocate",
        "selfcultivation",
        "within",
        "contextual",
        "practice",
        "see",
        "feminist",
        "ontology",
        "metaphysics",
        "selfhood",
        "inseparable",
        "ethical",
        "social",
        "political",
        "domain",
        "also",
        "case",
        "strand",
        "queer",
        "trans",
        "theory",
        "intersect",
        "feminist",
        "approach",
        "trans",
        "theorist",
        "metaphysical",
        "question",
        "identity",
        "operate",
        "within",
        "dominant",
        "discourse",
        "frequently",
        "perpetuate",
        "violence",
        "transphobia",
        "well",
        "within",
        "queer",
        "transgender",
        "subculture",
        "redefine",
        "gender",
        "sex",
        "identity",
        "dynamic",
        "collaborative",
        "fashion",
        "bettcher",
        "a",
        "b",
        "trans",
        "feminist",
        "talia",
        "mae",
        "bettcher",
        "push",
        "back",
        "narrative",
        "trans",
        "identity",
        "modeled",
        "liberal",
        "individualist",
        "model",
        "selfhood",
        "idea",
        "trans",
        "individual",
        "might",
        "trapped",
        "wrong",
        "body",
        "coming",
        "may",
        "let",
        "core",
        "true",
        "self",
        "come",
        "surface",
        "bettcher",
        "bettcher",
        "contends",
        "idea",
        "true",
        "gendered",
        "self",
        "core",
        "person",
        "overlook",
        "way",
        "gender",
        "sex",
        "created",
        "culture",
        "bettcher",
        "also",
        "tends",
        "entrench",
        "mindbody",
        "dualism",
        "whereas",
        "movement",
        "phenomenology",
        "shown",
        "gendered",
        "embodiment",
        "feature",
        "selfhood",
        "vein",
        "bettcher",
        "argues",
        "sexism",
        "transphobia",
        "trade",
        "presumed",
        "hierarchy",
        "one",
        "proper",
        "appearance",
        "clothed",
        "appearance",
        "public",
        "taken",
        "subordinate",
        "one",
        "intimate",
        "appearance",
        "naked",
        "bettcher",
        "two",
        "form",
        "appearance",
        "fact",
        "par",
        "since",
        "culturally",
        "constituted",
        "trans",
        "feminist",
        "account",
        "frequently",
        "underscore",
        "relationality",
        "self",
        "including",
        "potential",
        "others",
        "define",
        "u",
        "others",
        "power",
        "internalized",
        "source",
        "psychic",
        "discord",
        "gender",
        "dysphoria",
        "desire",
        "many",
        "trans",
        "folk",
        "express",
        "recognition",
        "passing",
        "would",
        "difficult",
        "explain",
        "would",
        "also",
        "difficult",
        "explain",
        "transphobia",
        "alexis",
        "shotwell",
        "trevor",
        "sangrey",
        "argue",
        "cisgender",
        "individual",
        "resistance",
        "recognizing",
        "trans",
        "identity",
        "hinge",
        "fact",
        "trans",
        "gender",
        "expression",
        "affect",
        "cisgender",
        "identity",
        "shotwell",
        "sangrey",
        "shotwell",
        "sangrey",
        "draw",
        "feminist",
        "theory",
        "selfhood",
        "put",
        "forth",
        "brison",
        "develop",
        "argument",
        "relational",
        "constitution",
        "gender",
        "identity",
        "within",
        "given",
        "culture",
        "cause",
        "transphobia",
        "queer",
        "trans",
        "feminist",
        "hold",
        "also",
        "basis",
        "selftransformation",
        "specifically",
        "kim",
        "q",
        "hall",
        "point",
        "queer",
        "crip",
        "community",
        "affirm",
        "transforming",
        "oneself",
        "transforming",
        "one",
        "body",
        "creative",
        "transformation",
        "occur",
        "within",
        "context",
        "community",
        "support",
        "recognition",
        "hall",
        "frequently",
        "involve",
        "desire",
        "intersubjective",
        "recognition",
        "body",
        "modification",
        "may",
        "undertaken",
        "order",
        "foster",
        "relatively",
        "continuous",
        "sense",
        "self",
        "rubin",
        "demonstrates",
        "way",
        "public",
        "identity",
        "removed",
        "interior",
        "sense",
        "self",
        "liberal",
        "individual",
        "model",
        "tended",
        "assume",
        "continuity",
        "however",
        "need",
        "rely",
        "narrative",
        "core",
        "interior",
        "self",
        "merely",
        "seeking",
        "validation",
        "public",
        "instead",
        "intersubjective",
        "selffashioning",
        "may",
        "reject",
        "interiorexterior",
        "dichotomy",
        "begin",
        "following",
        "argument",
        "bettcher",
        "also",
        "follow",
        "feminist",
        "phenomenology",
        "disrupting",
        "presumed",
        "binary",
        "nature",
        "culture",
        "bodily",
        "comportment",
        "salamon",
        "heyes",
        "hale",
        "although",
        "discussion",
        "trans",
        "theory",
        "queer",
        "theory",
        "often",
        "occur",
        "within",
        "feminist",
        "context",
        "emphasis",
        "lived",
        "embodiment",
        "firstperson",
        "authority",
        "relationality",
        "selfhood",
        "frequently",
        "found",
        "discourse",
        "draw",
        "contribute",
        "feminist",
        "discussion",
        "selfhood",
        "crucial",
        "way"
    ]
}