{
    "main_text": "Race, Class, and Intersectional Feminist Analyses\n9. Race, Class, and Intersectional Feminist Analyses\n\nMany in the contemporary feminist theory debate are interested in\ndeveloping concrete “intersectional” or “integrative\nfeminist” analyses of particular issues which try to give equal\nweight to gender, race, class and sexuality in a global context\nwithout defining themselves by the categories, such as liberal,\nradical or materialist, of the earlier feminist debate categories (cf.\nwork by Davis 1983; Brewer 1995; Crenshaw 1997; Stanlie and James\n1997; Anzaldúa 1999; hooks 1984, 2000). Nonetheless strong\nemphasis on issues of race and ethnicity can be found in their work on\nwomen, class and work. For example, Brewer shows that white and\nAfrican-American working class women are divided by race in the\nworkforce, and that even changes in the occupational structure\nhistorically tend to maintain this racial division of labor. Hooks\nargues that women of color and some radical feminists were more\nsensitive to class and race issues than those, primarily white,\nfeminists whom she labels “reformist feminists” (hooks\n2000).\n\nPresupposed in the general theoretical debates concerning the\nrelations between gender, social and economic class, and work are\nusually definitions of each of these categories that some thinkers\nwould argue are problematic. For example, Tokarczyk and Fay have an\nexcellent anthology on working class women in the academy (1993) in\nwhich various contributors discuss the ambiguous positions in which\nthey find themselves by coming from poor family backgrounds and\nbecoming academics. One problem is whether they are still members of\nthe working class in so doing, and if not, whether they are betraying\ntheir families of origin by a rise to middle class status. Another is,\nwhether they have the same status in the academy, as workers, thinkers\nand women, as those men or women whose families of origin were middle\nclass or above. Rita Mae Brown wrote an early article on this, arguing\nthat education and academic status did not automatically change a\nworking class woman’s identity, which is based not just on\none’s relation to production, but one’s behavior, basic\nassumptions about life, and experiences in childhood (Brown 1974).\nJoanna Kadi (1999) describes herself as cultural worker who tackles\nelitism in the white academy, including in women’s studies\ncourses. Tokarczyk and Fay acknowledge that the definition of\n“class” is vague in the U.S. Rather than provide a\nstandard philosophical definition in terms of necessary and sufficient\nconditions for membership in the working class, they provide a cluster\nof characteristics and examples of jobs, such as physically demanding,\nrepetitive and dangerous jobs, jobs that lack autonomy and are\ngenerally paid badly. Examples of working class jobs they give are\ncleaning women, waitresses, lumberjacks, janitors and police officers.\nThey then define their term “working class women\nacademics” to include women whose parents had jobs such as these\nand are in the first generation in their family to attend college\n(Tokarczyk and Fay, 5). They challenge those that would argue that\nfamily origin can be overcome by the present position one has in the\nsocial division of labor: simply performing a professional job and\nearning a salary does not eradicate the class identity formed in\none’s “family class” (cf. Ferguson 1979).\n\nMore recent work in socio-legal studies also has begun to question the\nlimits of intersectional analysis (Grabham et al. 2009). It\nacknowledges the importance of intersectionality, a term coined by law\nprofessor Kimberlé Crenshaw (1989) to shed light on epistemic\ninjustice done to Black women in anti-discrimination law. Yet, despite\nits merit for overcoming the dual system’s theoretical impasse,\nJoanna Conaghan also critiques the essentializing tendencies of\nintersectional analysis which succeeds mainly dealing with race and\ngender oppression at an individual level, but it has little to offer\nto remedy structural injustice. Furthermore, because such method is\nidentity-focused it will not get at the dimension of class which has\nbeen traditionally thought in relational not locational terms (2008,\n29–30).\n\nTo theorize the problematic relation of women to social class,\nFerguson (1979, 1989, 1991) argues that there are at least three\ndifferent variables — an individual’s work, family of\norigin, and present household economic unit — which relate an\nindividual to a specific socio-economic class. For example, a woman\nmay work on two levels: as a day care worker (working class), but also\nas a member of a household where she does the housework and\nmothering/child care, while her husband is a wealthy contractor (petit\nbourgeois, small capitalist class). If in addition her family of\norigin is professional middle class (because, say, her parents were\ncollege educated academics), the woman may be seen and see herself as\neither working class or middle class, depending on whether she and\nothers emphasize her present relations of wage work (her individual\neconomic class, which in this case is working class), her household\nincome (middle class) or her family of origin (middle class).\n\nSylvia Walby deals with this ambiguity of economic class as applying\nto women as unpaid houseworkers by claiming against Delphy (1984) that\nthe relevant economic sex classes are those who are housewives vs.\nthose who are husbands benefiting from such work, not those of\nall women and men, whether or not they do or receive\nhousework services (Walby 1990). Ferguson, however, sides with Delphy\nin putting all women into “sex class”, since all women,\nsince trained into the gender roles of patriarchal wife and\nmotherhood, are potentially those whose unpaid housework can be so\nexploited. But seeing herself as a member of a fourth class category,\n“sex class,” and hence, in a patriarchal capitalist\nsystem, seeing herself exploited as a woman worker in her wage work\nand unpaid second shift housework,\n [4]\n is thus not a given but an achieved social identity. Such an identity\nis usually formed through political organizing and coalitions with\nother women at her place of employment, in her home and her community.\nIn this sense the concept of sex class is exactly analogous to the\nconcept of a feminist epistemological standpoint: not a given identity\nor perspective, but one that is achievable under the right\nconditions.\n\nRealizing the importance of this disjuncture between economic class\nand sex class for women, Maxine Molyneux (1984) argues in a often\ncited article that there are no “women’s interests”\nin the abstract that can unify women in political struggle. Instead,\nshe theorizes that women have both “practical gender\ninterests” and “strategic gender interests.”\nPractical gender interests are those that women develop because of the\nsexual division of labor, which makes them responsible for the\nnurturant work of sustaining the physical and psychological well-being\nof children, partners and relatives through caring labor. Such\npractical gender interests, because they tie a woman’s\nconception of her own interests as a woman to those of her family,\nsupport women’s popular movements for food, water, child and\nhealth care, even defense against state violence, which ally them with\nthe economic class interests of their family. Strategic gender\ninterests, on the contrary, may ally women across otherwise divided\neconomic class interests, since they are those, like rights against\nphysical male violence and reproductive rights, which women have as a\nsex class to eliminate male domination.\n\nMolyneux used her distinctions between practical and strategic gender\ninterests to distinguish between the popular women’s movement in\nNicaragua based on demands for economic justice for workers and\nfarmers against the owning classes, demands such as education, health\nand maternity care, clean water, food and housing, and the feminist\nmovement which emphasized the fight for legal abortion, fathers’\nobligation to pay child support to single mothers, and rights against\nrape and domestic violence. She and others have used this distinction\nbetween practical and strategic gender interests to characterize the\ntension between popular women’s movements and feminist movements\nin Latin America (Molyneux 2001; Alvarez 1998; Foweraker 1998).\n\nA similar distinction between different types of women’s\ninterests was developed further as a critique of interest group\nparadigms of politics by Anna Jónasdóttir (1988, 1994).\nJónasdóttir argues that women have a common formal\ninterest in votes for women, women’s political caucuses, gender\nparity demands, and other mechanisms which allow women a way to\ndevelop a collective political voice, even though their content\ninterests, that is, their specific needs and priorities, may vary by\nrace and economic class, among others. Her distinctions, and those of\nMolyneux, have been changed slightly — practical vs. strategic\ngender needs, rather than interests — to compare and contrast\ndifferent paradigms of economic development by World Bank feminist\ntheorist Carolyn Moser (1993). Most recently the\nJónasdóttir distinctions have been used by Mohanty\n(1997) to defend and maintain, in spite of postmodernists’\nemphasis on intersectional differences, that commonalities in\nwomen’s gendered work can create a cross-class base for\ndemanding a collective political voice for women: a transnational\nfeminism which creates a demand for women’s political\nrepresentation, developing the platform of women’s human rights\nas women and as workers. Nonetheless, the tension between\nwomen’s economic class-based interests or needs and their\nvisionary/strategic gender interests or needs is still always present,\nand must therefore always be negotiated concretely by popular\nmovements for social justice involving women’s issues.\n\nAnother approach to the problematic nature of socio-economic class as\nit relates to women are empirical studies which show how class\ndistinctions are still important for women in their daily lives as a\nway to compare and contrast themselves with other women and men, even\nif they do not use the concepts of “working class,”\n“professional class” or “capitalist class”.\nMany have pointed out that the concept of class itself is mystified in\nthe U.S. context, but that nonetheless class distinctions still\noperate because of different structural economic constraints, which\nact on some differently from others. The Ehrenreichs (1979), in a\nclassic article, argue that this mystification is due to the emergence\nof a professional-managerial class that has some interests in common\nwith the capitalist class and some with the working class. Whatever\nits causes, there are empirical studies which show that class\ndistinctions still operate between women, albeit in an indirect way.\nBarbara Ehrenreich (2001), by adopting the material life conditions of\na poor woman, did an empirical study of the lives of women working for\nminimum wages and found their issues to be quite different from and\nignored by middle and upper-class women. Diane Reay (2004) does an\nempirical study of women from manual labor family backgrounds and\ntheir relation to the schooling of their children, and discovers that\nthey use a discourse that acknowledges class differences of\neducational access and career possibilities, even though it does not\nspecifically define these by class per se. Similarly, Julie Bettie\n(2000) does an impressive discourse analysis of the way that Latina\nhigh school students create their own class distinctions through\nconcepts such as “chicas,” “cholas” and\n“trash” to refer to themselves and their peers. These\ncategories pick out girls as having middle class, working class or\npoor aspirations by performance indicators such as dress, speech,\nterritorial hang-outs and school achievement, while never mentioning\n“class” by name. Women’s experiences of growing up\nworking class are presented in the anthology edited by Tea (2003).\n\nDrawing on a socialist feminist framework, Margaret McLaren (2019)\noffers an ethnographic study of cross-border feminist solidarity. She\nfocuses on SEWA, the largest women’s union in the world with\nover 700,000 members and its own cooperative bank. This Indian\norganization of self-employed women has ties with a sister\norganization in South Africa and builds global grassroots trading\nnetworks in addition to fostering cross-cultural dialogues and\npeace-building. Utilizing traditional gendered expectations, married\nwomen leave the home to work in women-only groups where the artisans\norganize beyond the workplace for public health, sewage treatment and\nother social justice issues such as violence prevention. Such\ncooperatives which also forge ties with Global North consumers\nshowcase the possibilities for transnational feminist organizing in\nthe face of neoliberalist finance and resource extraction. \n",
    "section_title": "9. Race, Class, and Intersectional Feminist Analyses",
    "entry_title": "Feminist Perspectives on Class and Work",
    "hierarchy_title": "Feminist Perspectives on Class and Work || Race, Class, and Intersectional Feminist Analyses",
    "tokenized_text": [
        "race",
        "class",
        "intersectional",
        "feminist",
        "analysis",
        "race",
        "class",
        "intersectional",
        "feminist",
        "analysis",
        "many",
        "contemporary",
        "feminist",
        "theory",
        "debate",
        "interested",
        "developing",
        "concrete",
        "intersectional",
        "integrative",
        "feminist",
        "analysis",
        "particular",
        "issue",
        "try",
        "give",
        "equal",
        "weight",
        "gender",
        "race",
        "class",
        "sexuality",
        "global",
        "context",
        "without",
        "defining",
        "category",
        "liberal",
        "radical",
        "materialist",
        "earlier",
        "feminist",
        "debate",
        "category",
        "cf",
        "work",
        "davis",
        "brewer",
        "crenshaw",
        "stanlie",
        "james",
        "anzaldúa",
        "hook",
        "nonetheless",
        "strong",
        "emphasis",
        "issue",
        "race",
        "ethnicity",
        "found",
        "work",
        "woman",
        "class",
        "work",
        "example",
        "brewer",
        "show",
        "white",
        "africanamerican",
        "working",
        "class",
        "woman",
        "divided",
        "race",
        "workforce",
        "even",
        "change",
        "occupational",
        "structure",
        "historically",
        "tend",
        "maintain",
        "racial",
        "division",
        "labor",
        "hook",
        "argues",
        "woman",
        "color",
        "radical",
        "feminist",
        "sensitive",
        "class",
        "race",
        "issue",
        "primarily",
        "white",
        "feminist",
        "label",
        "reformist",
        "feminist",
        "hook",
        "presupposed",
        "general",
        "theoretical",
        "debate",
        "concerning",
        "relation",
        "gender",
        "social",
        "economic",
        "class",
        "work",
        "usually",
        "definition",
        "category",
        "thinker",
        "would",
        "argue",
        "problematic",
        "example",
        "tokarczyk",
        "fay",
        "excellent",
        "anthology",
        "working",
        "class",
        "woman",
        "academy",
        "various",
        "contributor",
        "discus",
        "ambiguous",
        "position",
        "find",
        "coming",
        "poor",
        "family",
        "background",
        "becoming",
        "academic",
        "one",
        "problem",
        "whether",
        "still",
        "member",
        "working",
        "class",
        "whether",
        "betraying",
        "family",
        "origin",
        "rise",
        "middle",
        "class",
        "status",
        "another",
        "whether",
        "status",
        "academy",
        "worker",
        "thinker",
        "woman",
        "men",
        "woman",
        "whose",
        "family",
        "origin",
        "middle",
        "class",
        "rita",
        "mae",
        "brown",
        "wrote",
        "early",
        "article",
        "arguing",
        "education",
        "academic",
        "status",
        "automatically",
        "change",
        "working",
        "class",
        "woman",
        "identity",
        "based",
        "one",
        "relation",
        "production",
        "one",
        "behavior",
        "basic",
        "assumption",
        "life",
        "experience",
        "childhood",
        "brown",
        "joanna",
        "kadi",
        "describes",
        "cultural",
        "worker",
        "tackle",
        "elitism",
        "white",
        "academy",
        "including",
        "woman",
        "study",
        "course",
        "tokarczyk",
        "fay",
        "acknowledge",
        "definition",
        "class",
        "vague",
        "us",
        "rather",
        "provide",
        "standard",
        "philosophical",
        "definition",
        "term",
        "necessary",
        "sufficient",
        "condition",
        "membership",
        "working",
        "class",
        "provide",
        "cluster",
        "characteristic",
        "example",
        "job",
        "physically",
        "demanding",
        "repetitive",
        "dangerous",
        "job",
        "job",
        "lack",
        "autonomy",
        "generally",
        "paid",
        "badly",
        "example",
        "working",
        "class",
        "job",
        "give",
        "cleaning",
        "woman",
        "waitress",
        "lumberjack",
        "janitor",
        "police",
        "officer",
        "define",
        "term",
        "working",
        "class",
        "woman",
        "academic",
        "include",
        "woman",
        "whose",
        "parent",
        "job",
        "first",
        "generation",
        "family",
        "attend",
        "college",
        "tokarczyk",
        "fay",
        "challenge",
        "would",
        "argue",
        "family",
        "origin",
        "overcome",
        "present",
        "position",
        "one",
        "social",
        "division",
        "labor",
        "simply",
        "performing",
        "professional",
        "job",
        "earning",
        "salary",
        "eradicate",
        "class",
        "identity",
        "formed",
        "one",
        "family",
        "class",
        "cf",
        "ferguson",
        "recent",
        "work",
        "sociolegal",
        "study",
        "also",
        "begun",
        "question",
        "limit",
        "intersectional",
        "analysis",
        "grabham",
        "et",
        "al",
        "acknowledges",
        "importance",
        "intersectionality",
        "term",
        "coined",
        "law",
        "professor",
        "kimberlé",
        "crenshaw",
        "shed",
        "light",
        "epistemic",
        "injustice",
        "done",
        "black",
        "woman",
        "antidiscrimination",
        "law",
        "yet",
        "despite",
        "merit",
        "overcoming",
        "dual",
        "system",
        "theoretical",
        "impasse",
        "joanna",
        "conaghan",
        "also",
        "critique",
        "essentializing",
        "tendency",
        "intersectional",
        "analysis",
        "succeeds",
        "mainly",
        "dealing",
        "race",
        "gender",
        "oppression",
        "individual",
        "level",
        "little",
        "offer",
        "remedy",
        "structural",
        "injustice",
        "furthermore",
        "method",
        "identityfocused",
        "get",
        "dimension",
        "class",
        "traditionally",
        "thought",
        "relational",
        "locational",
        "term",
        "theorize",
        "problematic",
        "relation",
        "woman",
        "social",
        "class",
        "ferguson",
        "argues",
        "least",
        "three",
        "different",
        "variable",
        "individual",
        "work",
        "family",
        "origin",
        "present",
        "household",
        "economic",
        "unit",
        "relate",
        "individual",
        "specific",
        "socioeconomic",
        "class",
        "example",
        "woman",
        "may",
        "work",
        "two",
        "level",
        "day",
        "care",
        "worker",
        "working",
        "class",
        "also",
        "member",
        "household",
        "housework",
        "motheringchild",
        "care",
        "husband",
        "wealthy",
        "contractor",
        "petit",
        "bourgeois",
        "small",
        "capitalist",
        "class",
        "addition",
        "family",
        "origin",
        "professional",
        "middle",
        "class",
        "say",
        "parent",
        "college",
        "educated",
        "academic",
        "woman",
        "may",
        "seen",
        "see",
        "either",
        "working",
        "class",
        "middle",
        "class",
        "depending",
        "whether",
        "others",
        "emphasize",
        "present",
        "relation",
        "wage",
        "work",
        "individual",
        "economic",
        "class",
        "case",
        "working",
        "class",
        "household",
        "income",
        "middle",
        "class",
        "family",
        "origin",
        "middle",
        "class",
        "sylvia",
        "walby",
        "deal",
        "ambiguity",
        "economic",
        "class",
        "applying",
        "woman",
        "unpaid",
        "houseworkers",
        "claiming",
        "delphy",
        "relevant",
        "economic",
        "sex",
        "class",
        "housewife",
        "vs",
        "husband",
        "benefiting",
        "work",
        "woman",
        "men",
        "whether",
        "receive",
        "housework",
        "service",
        "walby",
        "ferguson",
        "however",
        "side",
        "delphy",
        "putting",
        "woman",
        "sex",
        "class",
        "since",
        "woman",
        "since",
        "trained",
        "gender",
        "role",
        "patriarchal",
        "wife",
        "motherhood",
        "potentially",
        "whose",
        "unpaid",
        "housework",
        "exploited",
        "seeing",
        "member",
        "fourth",
        "class",
        "category",
        "sex",
        "class",
        "hence",
        "patriarchal",
        "capitalist",
        "system",
        "seeing",
        "exploited",
        "woman",
        "worker",
        "wage",
        "work",
        "unpaid",
        "second",
        "shift",
        "housework",
        "thus",
        "given",
        "achieved",
        "social",
        "identity",
        "identity",
        "usually",
        "formed",
        "political",
        "organizing",
        "coalition",
        "woman",
        "place",
        "employment",
        "home",
        "community",
        "sense",
        "concept",
        "sex",
        "class",
        "exactly",
        "analogous",
        "concept",
        "feminist",
        "epistemological",
        "standpoint",
        "given",
        "identity",
        "perspective",
        "one",
        "achievable",
        "right",
        "condition",
        "realizing",
        "importance",
        "disjuncture",
        "economic",
        "class",
        "sex",
        "class",
        "woman",
        "maxine",
        "molyneux",
        "argues",
        "often",
        "cited",
        "article",
        "woman",
        "interest",
        "abstract",
        "unify",
        "woman",
        "political",
        "struggle",
        "instead",
        "theorizes",
        "woman",
        "practical",
        "gender",
        "interest",
        "strategic",
        "gender",
        "interests",
        "practical",
        "gender",
        "interest",
        "woman",
        "develop",
        "sexual",
        "division",
        "labor",
        "make",
        "responsible",
        "nurturant",
        "work",
        "sustaining",
        "physical",
        "psychological",
        "wellbeing",
        "child",
        "partner",
        "relative",
        "caring",
        "labor",
        "practical",
        "gender",
        "interest",
        "tie",
        "woman",
        "conception",
        "interest",
        "woman",
        "family",
        "support",
        "woman",
        "popular",
        "movement",
        "food",
        "water",
        "child",
        "health",
        "care",
        "even",
        "defense",
        "state",
        "violence",
        "ally",
        "economic",
        "class",
        "interest",
        "family",
        "strategic",
        "gender",
        "interest",
        "contrary",
        "may",
        "ally",
        "woman",
        "across",
        "otherwise",
        "divided",
        "economic",
        "class",
        "interest",
        "since",
        "like",
        "right",
        "physical",
        "male",
        "violence",
        "reproductive",
        "right",
        "woman",
        "sex",
        "class",
        "eliminate",
        "male",
        "domination",
        "molyneux",
        "used",
        "distinction",
        "practical",
        "strategic",
        "gender",
        "interest",
        "distinguish",
        "popular",
        "woman",
        "movement",
        "nicaragua",
        "based",
        "demand",
        "economic",
        "justice",
        "worker",
        "farmer",
        "owning",
        "class",
        "demand",
        "education",
        "health",
        "maternity",
        "care",
        "clean",
        "water",
        "food",
        "housing",
        "feminist",
        "movement",
        "emphasized",
        "fight",
        "legal",
        "abortion",
        "father",
        "obligation",
        "pay",
        "child",
        "support",
        "single",
        "mother",
        "right",
        "rape",
        "domestic",
        "violence",
        "others",
        "used",
        "distinction",
        "practical",
        "strategic",
        "gender",
        "interest",
        "characterize",
        "tension",
        "popular",
        "woman",
        "movement",
        "feminist",
        "movement",
        "latin",
        "america",
        "molyneux",
        "alvarez",
        "foweraker",
        "similar",
        "distinction",
        "different",
        "type",
        "woman",
        "interest",
        "developed",
        "critique",
        "interest",
        "group",
        "paradigm",
        "politics",
        "anna",
        "jónasdóttir",
        "jónasdóttir",
        "argues",
        "woman",
        "common",
        "formal",
        "interest",
        "vote",
        "woman",
        "woman",
        "political",
        "caucus",
        "gender",
        "parity",
        "demand",
        "mechanism",
        "allow",
        "woman",
        "way",
        "develop",
        "collective",
        "political",
        "voice",
        "even",
        "though",
        "content",
        "interest",
        "specific",
        "need",
        "priority",
        "may",
        "vary",
        "race",
        "economic",
        "class",
        "among",
        "others",
        "distinction",
        "molyneux",
        "changed",
        "slightly",
        "practical",
        "vs",
        "strategic",
        "gender",
        "need",
        "rather",
        "interest",
        "compare",
        "contrast",
        "different",
        "paradigm",
        "economic",
        "development",
        "world",
        "bank",
        "feminist",
        "theorist",
        "carolyn",
        "moser",
        "recently",
        "jónasdóttir",
        "distinction",
        "used",
        "mohanty",
        "defend",
        "maintain",
        "spite",
        "postmodernists",
        "emphasis",
        "intersectional",
        "difference",
        "commonality",
        "woman",
        "gendered",
        "work",
        "create",
        "crossclass",
        "base",
        "demanding",
        "collective",
        "political",
        "voice",
        "woman",
        "transnational",
        "feminism",
        "creates",
        "demand",
        "woman",
        "political",
        "representation",
        "developing",
        "platform",
        "woman",
        "human",
        "right",
        "woman",
        "worker",
        "nonetheless",
        "tension",
        "woman",
        "economic",
        "classbased",
        "interest",
        "need",
        "visionarystrategic",
        "gender",
        "interest",
        "need",
        "still",
        "always",
        "present",
        "must",
        "therefore",
        "always",
        "negotiated",
        "concretely",
        "popular",
        "movement",
        "social",
        "justice",
        "involving",
        "woman",
        "issue",
        "another",
        "approach",
        "problematic",
        "nature",
        "socioeconomic",
        "class",
        "relates",
        "woman",
        "empirical",
        "study",
        "show",
        "class",
        "distinction",
        "still",
        "important",
        "woman",
        "daily",
        "life",
        "way",
        "compare",
        "contrast",
        "woman",
        "men",
        "even",
        "use",
        "concept",
        "working",
        "class",
        "professional",
        "class",
        "capitalist",
        "class",
        "many",
        "pointed",
        "concept",
        "class",
        "mystified",
        "us",
        "context",
        "nonetheless",
        "class",
        "distinction",
        "still",
        "operate",
        "different",
        "structural",
        "economic",
        "constraint",
        "act",
        "differently",
        "others",
        "ehrenreichs",
        "classic",
        "article",
        "argue",
        "mystification",
        "due",
        "emergence",
        "professionalmanagerial",
        "class",
        "interest",
        "common",
        "capitalist",
        "class",
        "working",
        "class",
        "whatever",
        "cause",
        "empirical",
        "study",
        "show",
        "class",
        "distinction",
        "still",
        "operate",
        "woman",
        "albeit",
        "indirect",
        "way",
        "barbara",
        "ehrenreich",
        "adopting",
        "material",
        "life",
        "condition",
        "poor",
        "woman",
        "empirical",
        "study",
        "life",
        "woman",
        "working",
        "minimum",
        "wage",
        "found",
        "issue",
        "quite",
        "different",
        "ignored",
        "middle",
        "upperclass",
        "woman",
        "diane",
        "reay",
        "empirical",
        "study",
        "woman",
        "manual",
        "labor",
        "family",
        "background",
        "relation",
        "schooling",
        "child",
        "discovers",
        "use",
        "discourse",
        "acknowledges",
        "class",
        "difference",
        "educational",
        "access",
        "career",
        "possibility",
        "even",
        "though",
        "specifically",
        "define",
        "class",
        "per",
        "se",
        "similarly",
        "julie",
        "bettie",
        "impressive",
        "discourse",
        "analysis",
        "way",
        "latina",
        "high",
        "school",
        "student",
        "create",
        "class",
        "distinction",
        "concept",
        "chicas",
        "cholas",
        "trash",
        "refer",
        "peer",
        "category",
        "pick",
        "girl",
        "middle",
        "class",
        "working",
        "class",
        "poor",
        "aspiration",
        "performance",
        "indicator",
        "dress",
        "speech",
        "territorial",
        "hangouts",
        "school",
        "achievement",
        "never",
        "mentioning",
        "class",
        "name",
        "woman",
        "experience",
        "growing",
        "working",
        "class",
        "presented",
        "anthology",
        "edited",
        "tea",
        "drawing",
        "socialist",
        "feminist",
        "framework",
        "margaret",
        "mclaren",
        "offer",
        "ethnographic",
        "study",
        "crossborder",
        "feminist",
        "solidarity",
        "focus",
        "sewa",
        "largest",
        "woman",
        "union",
        "world",
        "member",
        "cooperative",
        "bank",
        "indian",
        "organization",
        "selfemployed",
        "woman",
        "tie",
        "sister",
        "organization",
        "south",
        "africa",
        "build",
        "global",
        "grassroots",
        "trading",
        "network",
        "addition",
        "fostering",
        "crosscultural",
        "dialogue",
        "peacebuilding",
        "utilizing",
        "traditional",
        "gendered",
        "expectation",
        "married",
        "woman",
        "leave",
        "home",
        "work",
        "womenonly",
        "group",
        "artisan",
        "organize",
        "beyond",
        "workplace",
        "public",
        "health",
        "sewage",
        "treatment",
        "social",
        "justice",
        "issue",
        "violence",
        "prevention",
        "cooperative",
        "also",
        "forge",
        "tie",
        "global",
        "north",
        "consumer",
        "showcase",
        "possibility",
        "transnational",
        "feminist",
        "organizing",
        "face",
        "neoliberalist",
        "finance",
        "resource",
        "extraction"
    ]
}