{
    "main_text": "Problems with the sex/gender distinction || Is sex classification solely a matter of biology?\n3.2 Is sex classification solely a matter of biology?\n\nMany people, including many feminists, have ordinarily taken sex\nascriptions to be solely a matter of biology with no social or\ncultural dimension. It is commonplace to think that there are only two\nsexes and that biological sex classifications are utterly\nunproblematic. By contrast, some feminists have argued that sex\nclassifications are not unproblematic and that they are not solely a\nmatter of biology. In order to make sense of this, it is helpful to\ndistinguish object- and idea-construction (see Haslanger 2003b for\nmore): social forces can be said to construct certain kinds of objects\n(e.g. sexed bodies or gendered individuals) and certain kinds of ideas\n(e.g. sex or gender concepts). First, take the object-construction of\nsexed bodies. Secondary sex characteristics, or the physiological and\nbiological features commonly associated with males and females, are\naffected by social practices. In some societies, females’ lower\nsocial status has meant that they have been fed less and so, the lack\nof nutrition has had the effect of making them smaller in size (Jaggar\n1983, 37). Uniformity in muscular shape, size and strength within sex\ncategories is not caused entirely by biological factors, but depends\nheavily on exercise opportunities: if males and females were allowed\nthe same exercise opportunities and equal encouragement to exercise,\nit is thought that bodily dimorphism would diminish (Fausto-Sterling\n1993a, 218). A number of medical phenomena involving bones (like\nosteoporosis) have social causes directly related to expectations\nabout gender, women’s diet and their exercise opportunities\n(Fausto-Sterling 2005). These examples suggest that physiological\nfeatures thought to be sex-specific traits not affected by social and\ncultural factors are, after all, to some extent products of social\nconditioning. Social conditioning, then, shapes our biology.\n\nSecond, take the idea-construction of sex concepts. Our concept of\nsex is said to be a product of social forces in the sense\nthat what counts as sex is shaped by social meanings. Standardly,\nthose with XX-chromosomes, ovaries that produce large egg cells,\nfemale genitalia, a relatively high proportion of ‘female’\nhormones, and other secondary sex characteristics (relatively small\nbody size, less body hair) count as biologically female. Those with\nXY-chromosomes, testes that produce small sperm cells, male genitalia,\na relatively high proportion of ‘male’ hormones and other\nsecondary sex traits (relatively large body size, significant amounts\nof body hair) count as male. This understanding is fairly recent. The\nprevalent scientific view from Ancient Greeks until the late\n18th century, did not consider female and male sexes to be\ndistinct categories with specific traits; instead, a ‘one-sex\nmodel’ held that males and females were members of the same sex\ncategory. Females’ genitals were thought to be the same as\nmales’ but simply directed inside the body; ovaries and testes\n(for instance) were referred to by the same term and whether the term\nreferred to the former or the latter was made clear by the context\n(Laqueur 1990, 4). It was not until the late 1700s that scientists\nbegan to think of female and male anatomies as radically different\nmoving away from the ‘one-sex model’ of a single sex\nspectrum to the (nowadays prevalent) ‘two-sex model’ of\nsexual dimorphism. (For an alternative view, see King 2013.)\n\nFausto-Sterling has argued that this ‘two-sex model’\nisn’t straightforward either (1993b; 2000a; 2000b). Based on a\nmeta-study of empirical medical research, she estimates that 1.7% of\npopulation fail to neatly fall within the usual sex classifications\npossessing various combinations of different sex characteristics\n(Fausto-Sterling 2000a, 20). In her earlier work, she claimed that\nintersex individuals make up (at least) three further sex classes:\n‘herms’ who possess one testis and one ovary;\n‘merms’ who possess testes, some aspects of female\ngenitalia but no ovaries; and ‘ferms’ who have ovaries,\nsome aspects of male genitalia but no testes (Fausto-Sterling 1993b,\n21). (In her [2000a], Fausto-Sterling notes that these labels were put\nforward tongue–in–cheek.) Recognition of intersex people\nsuggests that feminists (and society at large) are wrong to think that\nhumans are either female or male.\n\nTo illustrate further the idea-construction of sex, consider the case\nof the athlete Maria Patiño. Patiño has female\ngenitalia, has always considered herself to be female and was\nconsidered so by others. However, she was discovered to have XY\nchromosomes and was barred from competing in women’s sports\n(Fausto-Sterling 2000b, 1–3). Patiño’s genitalia\nwere at odds with her chromosomes and the latter were taken to\ndetermine her sex. Patiño successfully fought to be recognised\nas a female athlete arguing that her chromosomes alone were not\nsufficient to not make her female. Intersex people, like\nPatiño, illustrate that our understandings of sex differ and\nsuggest that there is no immediately obvious way to settle what sex\namounts to purely biologically or scientifically. Deciding what sex is\ninvolves evaluative judgements that are influenced by social\nfactors.\n\nInsofar as our cultural conceptions affect our understandings of sex,\nfeminists must be much more careful about sex classifications and\nrethink what sex amounts to (Stone 2007, chapter 1). More\nspecifically, intersex people illustrate that sex traits associated\nwith females and males need not always go together and that\nindividuals can have some mixture of these traits. This suggests to\nStone that sex is a cluster concept: it is sufficient to\nsatisfy enough of the sex features that tend to cluster together in\norder to count as being of a particular sex. But, one need not satisfy\nall of those features or some arbitrarily chosen supposedly\nnecessary sex feature, like chromosomes (Stone 2007, 44).\nThis makes sex a matter of degree and sex classifications should take\nplace on a spectrum: one can be more or less female/male but there is\nno sharp distinction between the two. Further, intersex people (along\nwith trans people) are located at the centre of the sex spectrum and\nin many cases their sex will be indeterminate (Stone 2007).\n\nMore recently, Ayala and Vasilyeva (2015) have argued for an inclusive\nand extended conception of sex: just as certain tools can be seen to\nextend our minds beyond the limits of our brains (e.g. white canes),\nother tools (like dildos) can extend our sex beyond our bodily\nboundaries. This view aims to motivate the idea that what counts as\nsex should not be determined by looking inwards at genitalia or other\nanatomical features. In a different vein, Ásta (2018) argues\nthat sex is a conferred social property. This follows her more general\nconferralist framework to analyse all social properties: properties\nthat are conferred by others thereby generating a social status that\nconsists in contextually specific constraints and enablements on\nindividual behaviour. The general schema for conferred properties is\nas follows (Ásta 2018, 8):\n\n\nConferred property: what property is conferred.\n\nWho: who the subjects are.\n\nWhat: what attitude, state, or action of the subjects\nmatter.\n\nWhen: under what conditions the conferral takes\nplace.\n\nBase property: what the subjects are attempting to\ntrack (consciously or not), if anything.\n\n\nWith being of a certain sex (e.g. male, female) in mind, Ásta\nholds that it is a conferred property that merely aims to track\nphysical features. Hence sex is a social – or in fact, an\ninstitutional – property rather than a natural one. The schema\nfor sex goes as follows (72):\n\n\nConferred property: being female, male.\n\nWho: legal authorities, drawing on the expert opinion\nof doctors, other medical personnel.\n\nWhat: “the recording of a sex in official\ndocuments ... The judgment of the doctors (and others) as to what sex\nrole might be the most fitting, given the biological characteristics\npresent.”\n\nWhen: at birth or after surgery/ hormonal\ntreatment.\n\nBase property: “the aim is to track as many\nsex-stereotypical characteristics as possible, and doctors perform\nsurgery in cases where that might help bring the physical\ncharacteristics more in line with the stereotype of male and\nfemale.”\n\n\nThis (among other things) offers a debunking analysis of sex: it may\nappear to be a natural property, but on the conferralist analysis is\nbetter understood as a conferred legal status. Ásta holds that\ngender too is a conferred property, but contra the discussion in the\nfollowing section, she does not think that this collapses the\ndistinction between sex and gender: sex and gender are differently\nconferred albeit both satisfying the general schema noted above.\nNonetheless, on the conferralist framework what underlies both sex and\ngender is the idea of social construction as social significance:\nsex-stereotypical characteristics are taken to be socially significant\ncontext specifically, whereby they become the basis for conferring sex\nonto individuals and this brings with it various constraints and\nenablements on individuals and their behaviour. This fits object- and\nidea-constructions introduced above, although offers a different\ngeneral framework to analyse the matter at hand.\n",
    "section_title": "3.2 Is sex classification solely a matter of biology?",
    "entry_title": "Feminist Perspectives on Sex and Gender",
    "hierarchy_title": "Feminist Perspectives on Sex and Gender || Problems with the sex/gender distinction || Is sex classification solely a matter of biology?",
    "tokenized_text": [
        "problem",
        "sexgender",
        "distinction",
        "sex",
        "classification",
        "solely",
        "matter",
        "biology",
        "sex",
        "classification",
        "solely",
        "matter",
        "biology",
        "many",
        "people",
        "including",
        "many",
        "feminist",
        "ordinarily",
        "taken",
        "sex",
        "ascription",
        "solely",
        "matter",
        "biology",
        "social",
        "cultural",
        "dimension",
        "commonplace",
        "think",
        "two",
        "sex",
        "biological",
        "sex",
        "classification",
        "utterly",
        "unproblematic",
        "contrast",
        "feminist",
        "argued",
        "sex",
        "classification",
        "unproblematic",
        "solely",
        "matter",
        "biology",
        "order",
        "make",
        "sense",
        "helpful",
        "distinguish",
        "object",
        "ideaconstruction",
        "see",
        "haslanger",
        "b",
        "social",
        "force",
        "said",
        "construct",
        "certain",
        "kind",
        "object",
        "eg",
        "sexed",
        "body",
        "gendered",
        "individual",
        "certain",
        "kind",
        "idea",
        "eg",
        "sex",
        "gender",
        "concept",
        "first",
        "take",
        "objectconstruction",
        "sexed",
        "body",
        "secondary",
        "sex",
        "characteristic",
        "physiological",
        "biological",
        "feature",
        "commonly",
        "associated",
        "male",
        "female",
        "affected",
        "social",
        "practice",
        "society",
        "female",
        "lower",
        "social",
        "status",
        "meant",
        "fed",
        "le",
        "lack",
        "nutrition",
        "effect",
        "making",
        "smaller",
        "size",
        "jaggar",
        "uniformity",
        "muscular",
        "shape",
        "size",
        "strength",
        "within",
        "sex",
        "category",
        "caused",
        "entirely",
        "biological",
        "factor",
        "depends",
        "heavily",
        "exercise",
        "opportunity",
        "male",
        "female",
        "allowed",
        "exercise",
        "opportunity",
        "equal",
        "encouragement",
        "exercise",
        "thought",
        "bodily",
        "dimorphism",
        "would",
        "diminish",
        "faustosterling",
        "a",
        "number",
        "medical",
        "phenomenon",
        "involving",
        "bone",
        "like",
        "osteoporosis",
        "social",
        "cause",
        "directly",
        "related",
        "expectation",
        "gender",
        "woman",
        "diet",
        "exercise",
        "opportunity",
        "faustosterling",
        "example",
        "suggest",
        "physiological",
        "feature",
        "thought",
        "sexspecific",
        "trait",
        "affected",
        "social",
        "cultural",
        "factor",
        "extent",
        "product",
        "social",
        "conditioning",
        "social",
        "conditioning",
        "shape",
        "biology",
        "second",
        "take",
        "ideaconstruction",
        "sex",
        "concept",
        "concept",
        "sex",
        "said",
        "product",
        "social",
        "force",
        "sense",
        "count",
        "sex",
        "shaped",
        "social",
        "meaning",
        "standardly",
        "xxchromosomes",
        "ovary",
        "produce",
        "large",
        "egg",
        "cell",
        "female",
        "genitalia",
        "relatively",
        "high",
        "proportion",
        "female",
        "hormone",
        "secondary",
        "sex",
        "characteristic",
        "relatively",
        "small",
        "body",
        "size",
        "le",
        "body",
        "hair",
        "count",
        "biologically",
        "female",
        "xychromosomes",
        "testis",
        "produce",
        "small",
        "sperm",
        "cell",
        "male",
        "genitalia",
        "relatively",
        "high",
        "proportion",
        "male",
        "hormone",
        "secondary",
        "sex",
        "trait",
        "relatively",
        "large",
        "body",
        "size",
        "significant",
        "amount",
        "body",
        "hair",
        "count",
        "male",
        "understanding",
        "fairly",
        "recent",
        "prevalent",
        "scientific",
        "view",
        "ancient",
        "greek",
        "late",
        "th",
        "century",
        "consider",
        "female",
        "male",
        "sex",
        "distinct",
        "category",
        "specific",
        "trait",
        "instead",
        "onesex",
        "model",
        "held",
        "male",
        "female",
        "member",
        "sex",
        "category",
        "female",
        "genitals",
        "thought",
        "male",
        "simply",
        "directed",
        "inside",
        "body",
        "ovary",
        "testis",
        "instance",
        "referred",
        "term",
        "whether",
        "term",
        "referred",
        "former",
        "latter",
        "made",
        "clear",
        "context",
        "laqueur",
        "late",
        "s",
        "scientist",
        "began",
        "think",
        "female",
        "male",
        "anatomy",
        "radically",
        "different",
        "moving",
        "away",
        "onesex",
        "model",
        "single",
        "sex",
        "spectrum",
        "nowadays",
        "prevalent",
        "twosex",
        "model",
        "sexual",
        "dimorphism",
        "alternative",
        "view",
        "see",
        "king",
        "faustosterling",
        "argued",
        "twosex",
        "model",
        "straightforward",
        "either",
        "b",
        "a",
        "b",
        "based",
        "metastudy",
        "empirical",
        "medical",
        "research",
        "estimate",
        "population",
        "fail",
        "neatly",
        "fall",
        "within",
        "usual",
        "sex",
        "classification",
        "possessing",
        "various",
        "combination",
        "different",
        "sex",
        "characteristic",
        "faustosterling",
        "a",
        "earlier",
        "work",
        "claimed",
        "intersex",
        "individual",
        "make",
        "least",
        "three",
        "sex",
        "class",
        "herm",
        "posse",
        "one",
        "testis",
        "one",
        "ovary",
        "merms",
        "posse",
        "testis",
        "aspect",
        "female",
        "genitalia",
        "ovary",
        "ferms",
        "ovary",
        "aspect",
        "male",
        "genitalia",
        "testis",
        "faustosterling",
        "b",
        "a",
        "faustosterling",
        "note",
        "label",
        "put",
        "forward",
        "tongueincheek",
        "recognition",
        "intersex",
        "people",
        "suggests",
        "feminist",
        "society",
        "large",
        "wrong",
        "think",
        "human",
        "either",
        "female",
        "male",
        "illustrate",
        "ideaconstruction",
        "sex",
        "consider",
        "case",
        "athlete",
        "maria",
        "patiño",
        "patiño",
        "female",
        "genitalia",
        "always",
        "considered",
        "female",
        "considered",
        "others",
        "however",
        "discovered",
        "xy",
        "chromosome",
        "barred",
        "competing",
        "woman",
        "sport",
        "faustosterling",
        "b",
        "patiño",
        "genitalia",
        "odds",
        "chromosome",
        "latter",
        "taken",
        "determine",
        "sex",
        "patiño",
        "successfully",
        "fought",
        "recognised",
        "female",
        "athlete",
        "arguing",
        "chromosome",
        "alone",
        "sufficient",
        "make",
        "female",
        "intersex",
        "people",
        "like",
        "patiño",
        "illustrate",
        "understanding",
        "sex",
        "differ",
        "suggest",
        "immediately",
        "obvious",
        "way",
        "settle",
        "sex",
        "amount",
        "purely",
        "biologically",
        "scientifically",
        "deciding",
        "sex",
        "involves",
        "evaluative",
        "judgement",
        "influenced",
        "social",
        "factor",
        "insofar",
        "cultural",
        "conception",
        "affect",
        "understanding",
        "sex",
        "feminist",
        "must",
        "much",
        "careful",
        "sex",
        "classification",
        "rethink",
        "sex",
        "amount",
        "stone",
        "chapter",
        "specifically",
        "intersex",
        "people",
        "illustrate",
        "sex",
        "trait",
        "associated",
        "female",
        "male",
        "need",
        "always",
        "go",
        "together",
        "individual",
        "mixture",
        "trait",
        "suggests",
        "stone",
        "sex",
        "cluster",
        "concept",
        "sufficient",
        "satisfy",
        "enough",
        "sex",
        "feature",
        "tend",
        "cluster",
        "together",
        "order",
        "count",
        "particular",
        "sex",
        "one",
        "need",
        "satisfy",
        "feature",
        "arbitrarily",
        "chosen",
        "supposedly",
        "necessary",
        "sex",
        "feature",
        "like",
        "chromosome",
        "stone",
        "make",
        "sex",
        "matter",
        "degree",
        "sex",
        "classification",
        "take",
        "place",
        "spectrum",
        "one",
        "le",
        "femalemale",
        "sharp",
        "distinction",
        "two",
        "intersex",
        "people",
        "along",
        "trans",
        "people",
        "located",
        "centre",
        "sex",
        "spectrum",
        "many",
        "case",
        "sex",
        "indeterminate",
        "stone",
        "recently",
        "ayala",
        "vasilyeva",
        "argued",
        "inclusive",
        "extended",
        "conception",
        "sex",
        "certain",
        "tool",
        "seen",
        "extend",
        "mind",
        "beyond",
        "limit",
        "brain",
        "eg",
        "white",
        "cane",
        "tool",
        "like",
        "dildo",
        "extend",
        "sex",
        "beyond",
        "bodily",
        "boundary",
        "view",
        "aim",
        "motivate",
        "idea",
        "count",
        "sex",
        "determined",
        "looking",
        "inwards",
        "genitalia",
        "anatomical",
        "feature",
        "different",
        "vein",
        "ásta",
        "argues",
        "sex",
        "conferred",
        "social",
        "property",
        "follows",
        "general",
        "conferralist",
        "framework",
        "analyse",
        "social",
        "property",
        "property",
        "conferred",
        "others",
        "thereby",
        "generating",
        "social",
        "status",
        "consists",
        "contextually",
        "specific",
        "constraint",
        "enablements",
        "individual",
        "behaviour",
        "general",
        "schema",
        "conferred",
        "property",
        "follows",
        "ásta",
        "conferred",
        "property",
        "property",
        "conferred",
        "subject",
        "attitude",
        "state",
        "action",
        "subject",
        "matter",
        "condition",
        "conferral",
        "take",
        "place",
        "base",
        "property",
        "subject",
        "attempting",
        "track",
        "consciously",
        "anything",
        "certain",
        "sex",
        "eg",
        "male",
        "female",
        "mind",
        "ásta",
        "hold",
        "conferred",
        "property",
        "merely",
        "aim",
        "track",
        "physical",
        "feature",
        "hence",
        "sex",
        "social",
        "fact",
        "institutional",
        "property",
        "rather",
        "natural",
        "one",
        "schema",
        "sex",
        "go",
        "follows",
        "conferred",
        "property",
        "female",
        "male",
        "legal",
        "authority",
        "drawing",
        "expert",
        "opinion",
        "doctor",
        "medical",
        "personnel",
        "recording",
        "sex",
        "official",
        "document",
        "judgment",
        "doctor",
        "others",
        "sex",
        "role",
        "might",
        "fitting",
        "given",
        "biological",
        "characteristic",
        "present",
        "birth",
        "surgery",
        "hormonal",
        "treatment",
        "base",
        "property",
        "aim",
        "track",
        "many",
        "sexstereotypical",
        "characteristic",
        "possible",
        "doctor",
        "perform",
        "surgery",
        "case",
        "might",
        "help",
        "bring",
        "physical",
        "characteristic",
        "line",
        "stereotype",
        "male",
        "female",
        "among",
        "thing",
        "offer",
        "debunking",
        "analysis",
        "sex",
        "may",
        "appear",
        "natural",
        "property",
        "conferralist",
        "analysis",
        "better",
        "understood",
        "conferred",
        "legal",
        "status",
        "ásta",
        "hold",
        "gender",
        "conferred",
        "property",
        "contra",
        "discussion",
        "following",
        "section",
        "think",
        "collapse",
        "distinction",
        "sex",
        "gender",
        "sex",
        "gender",
        "differently",
        "conferred",
        "albeit",
        "satisfying",
        "general",
        "schema",
        "noted",
        "nonetheless",
        "conferralist",
        "framework",
        "underlies",
        "sex",
        "gender",
        "idea",
        "social",
        "construction",
        "social",
        "significance",
        "sexstereotypical",
        "characteristic",
        "taken",
        "socially",
        "significant",
        "context",
        "specifically",
        "whereby",
        "become",
        "basis",
        "conferring",
        "sex",
        "onto",
        "individual",
        "brings",
        "various",
        "constraint",
        "enablements",
        "individual",
        "behaviour",
        "fit",
        "object",
        "ideaconstructions",
        "introduced",
        "although",
        "offer",
        "different",
        "general",
        "framework",
        "analyse",
        "matter",
        "hand"
    ]
}