{
    "main_text": "Historical Context and Developments\n1. Historical Context and Developments\n\nHistorically, political philosophy focused on the state and various\nforms of governance. It largely ignored other realms as outside the\nscope of the political. In general, political thought presumed that\npolitical actors were necessarily male and that politics was a\nmasculine enterprise (Okin 1979). It sharply distinguished the public\nrealm of the state from the purportedly non-political realms of civil\nsociety and the household, hence forgoing any serious scrutiny of\nrelations of domination in the private sphere. It presumed that women\nwere naturally inferior to men and lacked the capacity to rule\nthemselves. Hence traditional political thought deemed that it was\nappropriate for them to be ruled by their fathers or husbands, all in\nthe sanctity of the home, immune from public scrutiny. These\npresuppositions went largely unremarked upon until some women began to\ndemand the same “universal” human dignity that men were\nproclaiming in newly republican and democratic states of the\neighteenth century (Gouges 1791). The first feminist\ntheorists—avant la lettre of feminism—began\nquestioning the tenets of political thought not as an abstract\nexercise but out of their very real, lived experience. As feminist\nactivists and theorists entered the fray, they quickly pointed out how\nmany of political theory’s presuppositions were thoroughly\ngendered. Over millennia, feminists noted, political thought coded the\npublic realm as masculine and the private one as feminine; there was\nthe public world of men’s work and the private domain of\nwomen’s labor. Political claims of universality were usually\nquite particular: for men alone.\n\nAs they did this work, drawing on their own experience, feminist\npolitical thinkers began creating new philosophical concepts. Early\nfeminist thinkers pointed out how social conditions (such as the lack\nof education) diminished women’s capacities. Later, other\ntheorists pointed to the ways that women and their concerns were\nexcluded or sidelined. Already in the nineteenth century they were\nnoticing how people are socially constituted. By the mid-twentieth\ncentury, again drawing from their experience and collective\n“consciousness-raising” groups, they began challenging\nnorms that countenanced women being harassed on the street by catcalls\nand whistles. They created new concepts like “sexual\nharassment” and “objectification”. Over time\nfeminist political philosophers began to notice deeper metaphysical\npresuppositions underlying gender divisions and to comment on how\nphilosophy had long construed such fundamental concepts as reason,\nuniversality, and nature in thoroughly gendered and hence suspect\nways. In doing this work, feminist philosophers began to transform the\nfield of political philosophy itself, moving it from its narrow focus\non governance to a broader focus on philosophical questions of\nidentity, essence, equity, difference, justice, and the good life.\n\nIn the European and U.S. context, earlier generations of feminist\nscholarship and activism, including the first wave of feminism in the\nEnglish-speaking world from the 1840s to the 1920s, focused on\nimproving the political, educational, and economic system primarily\nfor middle-class white women. Its greatest achievements were to\ndevelop a language of equal rights for women and to garner women the\nright to vote. Beginning in the 1960s, second wave feminists made\nfurther interventions in political theory by drawing on the language\nof the civil rights movements (e.g., the language of liberation) and\non a new feminist consciousness that emerged through women’s\nsolidarity movements and new forms of reflection that uncovered sexist\nattitudes and impediments throughout the whole of society.\n\nThese advances opened up new questions, namely: is there anything that\nunites women across cultures, time, and contexts? Just as Marxist\ntheory sought out a universal subject in the person of the worker,\nfeminists theorists sought out a commonality that united women across\ncultures, someone for whom feminist theory could speak. No sooner had\nthat question been posed than it got taken down, as in the title of a\npaper co-written by the Latina feminist philosopher María\nLugones and the white philosopher Elizabeth Spelman: “Have We\nGot A Theory For You: Feminist Theory, Cultural Imperialism, and the\nDemand for ‘The Woman’s Voice” (1986). This notion\nof a universal womanhood was also interrupted by other thinkers, such\nas bell hooks, saying that it excluded non-white and non-middle-class\nwomen’s experience and concerns. Hooks’ 1981 book titled\nAin’t I a Woman? exposed mainstream feminism as a\nmovement of a small group of middle- and upper-class white women whose\nexperience was very particular, hardly universal. The work of Lugones,\nSpelman, hooks and also Cherríe Moraga, Gloria Anzaldúa,\nAudre Lorde, and others foregrounded the need to account for\nwomen’s multiple and complex identities and experiences. By the\n1990s the debates about whether there was a coherent concept of woman\nthat could underlie feminist politics was further challenged by\nnon-Western women challenging the Western women’s movement as\ncaught up in Eurocentric ideals that led to the colonization and\ndomination of “Third World” people. What is now known as\npostcolonial and decolonial theories further heighten the debate\nbetween feminists who wanted to identify a universal feminist subject\nof woman (e.g., Okin, Nussbaum, and Ackerly) and those who call for\nrecognizing multiplicity, diversity, and intersectionality (e.g.,\nSpivak, Narayan, Mahmood, and Jaggar).\n\nAs a branch of political philosophy, feminist political philosophy has\noften mirrored the various divisions at work in political philosophy\nmore broadly. Prior to the fall of the Berlin Wall and the end of the\nCold War, political philosophy was usually divided into categories\nsuch as liberal, conservative, socialist, and Marxist. Except for\nconservatism, for each category there were often feminists working and\ncritiquing alongside it. Hence, as Alison Jaggar’s classic text,\nFeminist Politics and Human Nature, spelled out, each\nideological approach drew feminist scholars who would both take their\ncue from and borrow the language of a particular ideology (Jaggar\n1983). Jaggar’s text grouped feminist political philosophy into\nfour camps: liberal feminism, socialist feminism, Marxist feminism,\nand radical feminism. The first three groups followed the lines of\nCold War global political divisions: American liberalism, European\nsocialism, and a revolutionary communism (though few in the west would\nembrace Soviet-style communism). Radical feminism was the most rooted\nin specifically feminist approaches and activism, developing its own\npolitical vocabulary with its roots in the deep criticisms of\npatriarchy that feminist consciousness had produced in its first and\nsecond waves. Otherwise, feminist political philosophy largely\nfollowed the lines of traditional political philosophy. But this has\nnever been an uncritical following. As a field bent on changing the\nworld, even liberal feminist theorists tended to criticize liberalism\nas much or more than they embraced it, and to embrace socialism and\nother more radical points of view more than to reject them. Still, on\nthe whole, these theorists generally operated within the language and\nframework of their chosen approach to political philosophy.\n\nPolitical philosophy began to change enormously in the late 1980s,\njust before the end of the Cold War, with a new invocation of an old\nHegelian category: civil society, an arena of political life\nintermediate between the state and the household. This was the arena\nof associations, churches, labor unions, book clubs, choral societies\nand manifold other nongovernmental yet still public organizations. In\nthe 1980s political theorists began to turn their focus from the state\nto this intermediate realm, which suddenly took center stage in\nEastern Europe in organizations that challenged the power of the state\nand ultimately led to the downfall of communist regimes. It also\nopened up more avenues, beyond the state, for feminist political\ntheorizing.\n\nAfter the end of the Cold War, political philosophy along with\npolitical life radically realigned. New attention focused on civil\nsociety and the public sphere, especially with the timely translation\nof Jürgen Habermas’s early work, the Structural\nTransformation of the Public Sphere (Habermas 1962 [1989]).\nVolumes soon appeared on civil society and the public sphere, focusing\non the ways that people organized themselves and developed public\npower rather than on the ways that the state garnered and exerted its\npower. In fact, there arose a sense that the public sphere ultimately\nmight exert more power than the state, at least in the fundamental way\nin which public will is formed and serves to legitimate—or\nnot—state power. In the latter respect, John Rawls’s work\nwas influential by developing a theory of justice that tied the\nlegitimacy of institutions to the normative judgments that a\nreflective and deliberative people might make (Rawls 1971). By the\nearly 1990s, Marxists seemed to have disappeared or at least become\nvery circumspect (though the downfall of communist regimes\nneedn’t have had any effect on Marxist analysis proper, which\nnever subscribed to Leninist or Maoist thought). Socialists also\nretreated or transformed themselves into “radical\ndemocrats” (Mouffe [ed.] 1992a, 1993, 2000).\n\nNow the old schema of liberal, radical, socialist, and Marxist\nfeminisms were much less relevant. There were fewer debates about what\nkind of state organization and economic structure would be better for\nwomen and more debates about the value of the private sphere of the\nhousehold and the nongovernmental space of associations. Along with\npolitical philosophy more broadly, more feminist political\nphilosophers began to turn to the meaning and interpretation of civil\nsociety, the public sphere, and democracy itself. At this point in the\nearly 1990s new work in political theory turning to civil society\nconverged with feminist political theory that was rendering\n“political” realms that heretofore had been excluded from\nmainstream political theory. A synergy arose between those studying\ncommunitarianisms and feminists working in an ethics-of-care\ntradition: both pointed to how particular care relations and communal\nties were as or more important than abstract principles of justice.\nThey also began to question the binary and hierarchical divisions of\njustice over care, universality over particularity, and the right over\nthe good, all metaphysical suppositions that were hardly neutral.\n",
    "section_title": "1. Historical Context and Developments",
    "entry_title": "Feminist Political Philosophy",
    "hierarchy_title": "Feminist Political Philosophy || Historical Context and Developments",
    "tokenized_text": [
        "historical",
        "context",
        "development",
        "historical",
        "context",
        "development",
        "historically",
        "political",
        "philosophy",
        "focused",
        "state",
        "various",
        "form",
        "governance",
        "largely",
        "ignored",
        "realm",
        "outside",
        "scope",
        "political",
        "general",
        "political",
        "thought",
        "presumed",
        "political",
        "actor",
        "necessarily",
        "male",
        "politics",
        "masculine",
        "enterprise",
        "okin",
        "sharply",
        "distinguished",
        "public",
        "realm",
        "state",
        "purportedly",
        "nonpolitical",
        "realm",
        "civil",
        "society",
        "household",
        "hence",
        "forgoing",
        "serious",
        "scrutiny",
        "relation",
        "domination",
        "private",
        "sphere",
        "presumed",
        "woman",
        "naturally",
        "inferior",
        "men",
        "lacked",
        "capacity",
        "rule",
        "hence",
        "traditional",
        "political",
        "thought",
        "deemed",
        "appropriate",
        "ruled",
        "father",
        "husband",
        "sanctity",
        "home",
        "immune",
        "public",
        "scrutiny",
        "presupposition",
        "went",
        "largely",
        "unremarked",
        "upon",
        "woman",
        "began",
        "demand",
        "universal",
        "human",
        "dignity",
        "men",
        "proclaiming",
        "newly",
        "republican",
        "democratic",
        "state",
        "eighteenth",
        "century",
        "gouge",
        "first",
        "feminist",
        "theoristsavant",
        "la",
        "lettre",
        "feminismbegan",
        "questioning",
        "tenet",
        "political",
        "thought",
        "abstract",
        "exercise",
        "real",
        "lived",
        "experience",
        "feminist",
        "activist",
        "theorist",
        "entered",
        "fray",
        "quickly",
        "pointed",
        "many",
        "political",
        "theory",
        "presupposition",
        "thoroughly",
        "gendered",
        "millennium",
        "feminist",
        "noted",
        "political",
        "thought",
        "coded",
        "public",
        "realm",
        "masculine",
        "private",
        "one",
        "feminine",
        "public",
        "world",
        "men",
        "work",
        "private",
        "domain",
        "woman",
        "labor",
        "political",
        "claim",
        "universality",
        "usually",
        "quite",
        "particular",
        "men",
        "alone",
        "work",
        "drawing",
        "experience",
        "feminist",
        "political",
        "thinker",
        "began",
        "creating",
        "new",
        "philosophical",
        "concept",
        "early",
        "feminist",
        "thinker",
        "pointed",
        "social",
        "condition",
        "lack",
        "education",
        "diminished",
        "woman",
        "capacity",
        "later",
        "theorist",
        "pointed",
        "way",
        "woman",
        "concern",
        "excluded",
        "sidelined",
        "already",
        "nineteenth",
        "century",
        "noticing",
        "people",
        "socially",
        "constituted",
        "midtwentieth",
        "century",
        "drawing",
        "experience",
        "collective",
        "consciousnessraising",
        "group",
        "began",
        "challenging",
        "norm",
        "countenanced",
        "woman",
        "harassed",
        "street",
        "catcall",
        "whistle",
        "created",
        "new",
        "concept",
        "like",
        "sexual",
        "harassment",
        "objectification",
        "time",
        "feminist",
        "political",
        "philosopher",
        "began",
        "notice",
        "deeper",
        "metaphysical",
        "presupposition",
        "underlying",
        "gender",
        "division",
        "comment",
        "philosophy",
        "long",
        "construed",
        "fundamental",
        "concept",
        "reason",
        "universality",
        "nature",
        "thoroughly",
        "gendered",
        "hence",
        "suspect",
        "way",
        "work",
        "feminist",
        "philosopher",
        "began",
        "transform",
        "field",
        "political",
        "philosophy",
        "moving",
        "narrow",
        "focus",
        "governance",
        "broader",
        "focus",
        "philosophical",
        "question",
        "identity",
        "essence",
        "equity",
        "difference",
        "justice",
        "good",
        "life",
        "european",
        "us",
        "context",
        "earlier",
        "generation",
        "feminist",
        "scholarship",
        "activism",
        "including",
        "first",
        "wave",
        "feminism",
        "englishspeaking",
        "world",
        "s",
        "s",
        "focused",
        "improving",
        "political",
        "educational",
        "economic",
        "system",
        "primarily",
        "middleclass",
        "white",
        "woman",
        "greatest",
        "achievement",
        "develop",
        "language",
        "equal",
        "right",
        "woman",
        "garner",
        "woman",
        "right",
        "vote",
        "beginning",
        "s",
        "second",
        "wave",
        "feminist",
        "made",
        "intervention",
        "political",
        "theory",
        "drawing",
        "language",
        "civil",
        "right",
        "movement",
        "eg",
        "language",
        "liberation",
        "new",
        "feminist",
        "consciousness",
        "emerged",
        "woman",
        "solidarity",
        "movement",
        "new",
        "form",
        "reflection",
        "uncovered",
        "sexist",
        "attitude",
        "impediment",
        "throughout",
        "whole",
        "society",
        "advance",
        "opened",
        "new",
        "question",
        "namely",
        "anything",
        "unites",
        "woman",
        "across",
        "culture",
        "time",
        "context",
        "marxist",
        "theory",
        "sought",
        "universal",
        "subject",
        "person",
        "worker",
        "feminist",
        "theorist",
        "sought",
        "commonality",
        "united",
        "woman",
        "across",
        "culture",
        "someone",
        "feminist",
        "theory",
        "could",
        "speak",
        "sooner",
        "question",
        "posed",
        "got",
        "taken",
        "title",
        "paper",
        "cowritten",
        "latina",
        "feminist",
        "philosopher",
        "maría",
        "lugones",
        "white",
        "philosopher",
        "elizabeth",
        "spelman",
        "got",
        "theory",
        "feminist",
        "theory",
        "cultural",
        "imperialism",
        "demand",
        "woman",
        "voice",
        "notion",
        "universal",
        "womanhood",
        "also",
        "interrupted",
        "thinker",
        "bell",
        "hook",
        "saying",
        "excluded",
        "nonwhite",
        "nonmiddleclass",
        "woman",
        "experience",
        "concern",
        "hook",
        "book",
        "titled",
        "woman",
        "exposed",
        "mainstream",
        "feminism",
        "movement",
        "small",
        "group",
        "middle",
        "upperclass",
        "white",
        "woman",
        "whose",
        "experience",
        "particular",
        "hardly",
        "universal",
        "work",
        "lugones",
        "spelman",
        "hook",
        "also",
        "cherríe",
        "moraga",
        "gloria",
        "anzaldúa",
        "audre",
        "lorde",
        "others",
        "foregrounded",
        "need",
        "account",
        "woman",
        "multiple",
        "complex",
        "identity",
        "experience",
        "s",
        "debate",
        "whether",
        "coherent",
        "concept",
        "woman",
        "could",
        "underlie",
        "feminist",
        "politics",
        "challenged",
        "nonwestern",
        "woman",
        "challenging",
        "western",
        "woman",
        "movement",
        "caught",
        "eurocentric",
        "ideal",
        "led",
        "colonization",
        "domination",
        "third",
        "world",
        "people",
        "known",
        "postcolonial",
        "decolonial",
        "theory",
        "heighten",
        "debate",
        "feminist",
        "wanted",
        "identify",
        "universal",
        "feminist",
        "subject",
        "woman",
        "eg",
        "okin",
        "nussbaum",
        "ackerly",
        "call",
        "recognizing",
        "multiplicity",
        "diversity",
        "intersectionality",
        "eg",
        "spivak",
        "narayan",
        "mahmood",
        "jaggar",
        "branch",
        "political",
        "philosophy",
        "feminist",
        "political",
        "philosophy",
        "often",
        "mirrored",
        "various",
        "division",
        "work",
        "political",
        "philosophy",
        "broadly",
        "prior",
        "fall",
        "berlin",
        "wall",
        "end",
        "cold",
        "war",
        "political",
        "philosophy",
        "usually",
        "divided",
        "category",
        "liberal",
        "conservative",
        "socialist",
        "marxist",
        "except",
        "conservatism",
        "category",
        "often",
        "feminist",
        "working",
        "critiquing",
        "alongside",
        "hence",
        "alison",
        "jaggar",
        "classic",
        "text",
        "feminist",
        "politics",
        "human",
        "nature",
        "spelled",
        "ideological",
        "approach",
        "drew",
        "feminist",
        "scholar",
        "would",
        "take",
        "cue",
        "borrow",
        "language",
        "particular",
        "ideology",
        "jaggar",
        "jaggar",
        "text",
        "grouped",
        "feminist",
        "political",
        "philosophy",
        "four",
        "camp",
        "liberal",
        "feminism",
        "socialist",
        "feminism",
        "marxist",
        "feminism",
        "radical",
        "feminism",
        "first",
        "three",
        "group",
        "followed",
        "line",
        "cold",
        "war",
        "global",
        "political",
        "division",
        "american",
        "liberalism",
        "european",
        "socialism",
        "revolutionary",
        "communism",
        "though",
        "west",
        "would",
        "embrace",
        "sovietstyle",
        "communism",
        "radical",
        "feminism",
        "rooted",
        "specifically",
        "feminist",
        "approach",
        "activism",
        "developing",
        "political",
        "vocabulary",
        "root",
        "deep",
        "criticism",
        "patriarchy",
        "feminist",
        "consciousness",
        "produced",
        "first",
        "second",
        "wave",
        "otherwise",
        "feminist",
        "political",
        "philosophy",
        "largely",
        "followed",
        "line",
        "traditional",
        "political",
        "philosophy",
        "never",
        "uncritical",
        "following",
        "field",
        "bent",
        "changing",
        "world",
        "even",
        "liberal",
        "feminist",
        "theorist",
        "tended",
        "criticize",
        "liberalism",
        "much",
        "embraced",
        "embrace",
        "socialism",
        "radical",
        "point",
        "view",
        "reject",
        "still",
        "whole",
        "theorist",
        "generally",
        "operated",
        "within",
        "language",
        "framework",
        "chosen",
        "approach",
        "political",
        "philosophy",
        "political",
        "philosophy",
        "began",
        "change",
        "enormously",
        "late",
        "s",
        "end",
        "cold",
        "war",
        "new",
        "invocation",
        "old",
        "hegelian",
        "category",
        "civil",
        "society",
        "arena",
        "political",
        "life",
        "intermediate",
        "state",
        "household",
        "arena",
        "association",
        "church",
        "labor",
        "union",
        "book",
        "club",
        "choral",
        "society",
        "manifold",
        "nongovernmental",
        "yet",
        "still",
        "public",
        "organization",
        "s",
        "political",
        "theorist",
        "began",
        "turn",
        "focus",
        "state",
        "intermediate",
        "realm",
        "suddenly",
        "took",
        "center",
        "stage",
        "eastern",
        "europe",
        "organization",
        "challenged",
        "power",
        "state",
        "ultimately",
        "led",
        "downfall",
        "communist",
        "regime",
        "also",
        "opened",
        "avenue",
        "beyond",
        "state",
        "feminist",
        "political",
        "theorizing",
        "end",
        "cold",
        "war",
        "political",
        "philosophy",
        "along",
        "political",
        "life",
        "radically",
        "realigned",
        "new",
        "attention",
        "focused",
        "civil",
        "society",
        "public",
        "sphere",
        "especially",
        "timely",
        "translation",
        "jürgen",
        "habermas",
        "early",
        "work",
        "structural",
        "transformation",
        "public",
        "sphere",
        "habermas",
        "volume",
        "soon",
        "appeared",
        "civil",
        "society",
        "public",
        "sphere",
        "focusing",
        "way",
        "people",
        "organized",
        "developed",
        "public",
        "power",
        "rather",
        "way",
        "state",
        "garnered",
        "exerted",
        "power",
        "fact",
        "arose",
        "sense",
        "public",
        "sphere",
        "ultimately",
        "might",
        "exert",
        "power",
        "state",
        "least",
        "fundamental",
        "way",
        "public",
        "formed",
        "serf",
        "legitimateor",
        "notstate",
        "power",
        "latter",
        "respect",
        "john",
        "rawls",
        "work",
        "influential",
        "developing",
        "theory",
        "justice",
        "tied",
        "legitimacy",
        "institution",
        "normative",
        "judgment",
        "reflective",
        "deliberative",
        "people",
        "might",
        "make",
        "rawls",
        "early",
        "s",
        "marxist",
        "seemed",
        "disappeared",
        "least",
        "become",
        "circumspect",
        "though",
        "downfall",
        "communist",
        "regime",
        "effect",
        "marxist",
        "analysis",
        "proper",
        "never",
        "subscribed",
        "leninist",
        "maoist",
        "thought",
        "socialist",
        "also",
        "retreated",
        "transformed",
        "radical",
        "democrat",
        "mouffe",
        "ed",
        "a",
        "old",
        "schema",
        "liberal",
        "radical",
        "socialist",
        "marxist",
        "feminism",
        "much",
        "le",
        "relevant",
        "fewer",
        "debate",
        "kind",
        "state",
        "organization",
        "economic",
        "structure",
        "would",
        "better",
        "woman",
        "debate",
        "value",
        "private",
        "sphere",
        "household",
        "nongovernmental",
        "space",
        "association",
        "along",
        "political",
        "philosophy",
        "broadly",
        "feminist",
        "political",
        "philosopher",
        "began",
        "turn",
        "meaning",
        "interpretation",
        "civil",
        "society",
        "public",
        "sphere",
        "democracy",
        "point",
        "early",
        "s",
        "new",
        "work",
        "political",
        "theory",
        "turning",
        "civil",
        "society",
        "converged",
        "feminist",
        "political",
        "theory",
        "rendering",
        "political",
        "realm",
        "heretofore",
        "excluded",
        "mainstream",
        "political",
        "theory",
        "synergy",
        "arose",
        "studying",
        "communitarianisms",
        "feminist",
        "working",
        "ethicsofcare",
        "tradition",
        "pointed",
        "particular",
        "care",
        "relation",
        "communal",
        "tie",
        "important",
        "abstract",
        "principle",
        "justice",
        "also",
        "began",
        "question",
        "binary",
        "hierarchical",
        "division",
        "justice",
        "care",
        "universality",
        "particularity",
        "right",
        "good",
        "metaphysical",
        "supposition",
        "hardly",
        "neutral"
    ]
}