{
    "main_text": "Anglo-American Psychoanalytic Feminism\n5. Anglo-American Psychoanalytic Feminism\n\nThere are a number of Anglo-American (and Australian) feminist\ntheorists and scholars who read Lacan and laid the groundwork for the\npassage from French to English and from France to the US, Britain, and\nAustralia in the 1970s, 1980s, and early 1990s. Among these are Juliet\nMitchell (Psychoanalysis and Feminism, 1974), Teresa Brennan\n(The Interpretation of the Flesh: Freud and Femininity,\n1992), Elizabeth Grosz (Jacques Lacan: A Feminist\nIntroduction, 1990), Jane Gallop (Reading Lacan [1985]\nand The Daughter’s Seduction [1982]), and Jacqueline\nRose (Sexuality in the Field of Vision, 1986). While writing\nin English, these theorists take their bearings from the French\nLacanian approach to psychoanalysis and can generally be classified in\nthe field of what today gets called “Continental\nFeminism.” Responsible for revitalizing psychoanalysis for\nfeminist thought and countering earlier feminist dismissals, they aim\nto reclaim Freud’s central analyses for feminist purposes.\nJuliet Mitchell, for instance, develops the insight indispensable to\nany feminist reading, that “psychoanalysis is not a\nrecommendation for a patriarchal society, but an analysis\nof one” (Mitchell 1974: xiii). Mitchell and Rose are\nalso the co-editors of Feminine Sexuality, a selection from\nLacan’s seminars, for which both editors wrote influential\nintroductions.\n\nThis section will address, however, not the Lacanian inspired feminist\nappropriation of psychoanalysis in the English speaking world, but the\nAnglo-American development of feminist psychoanalysis that has\ndescended from and is indebted to British object relations theory and\nits focus on the pre-Oedipal mother-child bond, especially the work of\nMelanie Klein and Donald Winnicott. Authors who work in this vein\ninclude Nancy Chodorow (The Reproduction of Mothering, 1978),\nDorothy Dinnerstein (The Mermaid and the Minotaur, 1976), and\nJessica Benjamin (Bonds of Love [1988] and Like Subjects,\nLove Objects [1995]). What distinguishes this Anglo-American\ntradition from the French-influenced one is its emphasis on\npre-Oedipal sociality or intersubjectivity and its focus on the values\nof integration, harmony, and wholeness, as opposed to those of\nself-division and respecting the alien within. \n\nThe remainder of this section will focus on the work of Benjamin as\nexemplary of the Anglo-American approach, and clarify its differences\nfrom and similarities with the French approach. Like Irigaray,\nBenjamin is perturbed by the psychoanalytic depiction of social life\nas the world of men, developed on the basis of the father-son relation\nand its aggression, hostility, love, and mourning. Deploring this\n“struggle for power” (Benjamin 1988: 6) in which women are\nmerely the triangulating object of desire, Benjamin argues that, in\nthe formation of identity, subjects become bound by love to oppressive\nsocial relations. She worries that “domination is anchored in\nthe hearts of the dominated” (1988: 5), that women are\nerotically attached to patriarchal power, and she believes that\npsychoanalysis can help explain how and why this is so. Psychoanalysis\nthus offers to Benjamin insights not only into the individual psyche\nbut also into the organization, structure, and distribution of\npolitical power and hierarchy. Her aim is “to grasp the deep\nstructure of gender as a binary opposition which is common to psychic\nand cultural representations” (1988: 218). Unlike Kristeva and\nIrigaray, both of whom problematize the duality and comprehensiveness\nof the nature/culture distinction, and emphasize transformation of\nsymbolic bonds, Benjamin highlights the role of (contradictory)\ncultural stereotypes in bringing forth gender as we know and live it,\nand emphasizes the need for social transformation.\n\nTaking what she calls an eclectic approach, and eschewing\nmethodological orthodoxy with regard to Freudian metapsychology and\nthe theory of the instincts, Benjamin establishes her project on the\nbasis of a two person relational perspective, with the other as a\nseparate independent subject. Rather than an undifferentiated unity\ngoverning early infantile life in the pre-Oedipal period, which would\nmake of the infant merely a “monadic energy system”\n(Benjamin 1988: 17), she maintains that a genuine duality and\nrelationality exists from the start and that the process of growth\nentails development within relationships rather than a development of\nthem. The infant, she postulates, is a fundamentally active and social\ncreature, reaching out to the world and expressing a desire for\nrecognition. The knots of identity are formed via the interplay of\nthis desire with the response of another who variously affirms or\ndefies the child. Benjamin claims that this emphasis on sociality and\nintersubjectivity is not intended to disregard the intrapsychic\nelements of subject formation, and in fact she argues for “the\ninteraction between the psyche and social life” (1988: 5). She\nholds that the inner and the outer are not competitive but\ncomplementary theoretical perspectives. Nonetheless, she does want to\nsituate identity generally, and gendered identity more specifically,\nwithin the purview of the subject’s multiple and ambiguous\nsocial identifications.\n\nDomination, she argues, ensues from the failures of recognition built\ninto the political and social order, not merely failures that take\nplace at the personal or individual level in a single relationship.\nBorrowing an initial insight from Foucault, Benjamin looks at the way\npower shapes and forms identities and desires, producing gendered\nrelations (Benjamin 1988: 4). Borrowing another insight from Hegel,\nBenjamin depicts the dialectic of recognition in the struggle for\nidentity as a “conflict between independence and\ndependence” (1988: 33). In her view, however, the Hegelian tale,\nlike the Freudian one, erroneously begins with a “monadic,\nself-interested ego” (1988: 33) and it thus concludes with the\ninevitability of breakdown and domination. According to Benjamin,\nWinnicott resolves the Hegelian and Freudian dilemma (Benjamin 1988:\n38), the solitary egoism of the fight to the death, by reformulating\nthe problem of recognition at the level of fantasy and distinguishing\nbetween internal and external worlds. The infant feels confident in\nasserting its independence, and destroying its object in fantasy, so\nlong as that object is discovered to have a secure external existence\nin reality. In other words, the fantasy of destruction is appeased by\nits failure; the infant destroys internally but externally is relieved\nto still have an object to address and interact with. More\nparticularly, the infant destroys or separates from the mother\ninternally and in fantasy, but simultaneously retains a relation to\nher externally and in reality. The good enough mother must foster this\nrelationship between two separate egos, neither allowing the child to\nsucceed in destroying or dominating her, nor allowing herself to\nsquash the child’s nascent attempts at self-assertion. The\nmother-child relation is then a kind of revised neo-Hegelian struggle\nfor power, retaining the aim of mutual recognition or respect, but\nrisking domination and rebellion. The violent conflicts within are not\nrepressed but neutralized and pacified in the reality of\nintersubjective life that affirms and recognizes autonomy.\n\nAsking, as do Chodorow and Dinnerstein, about the genesis of\npatriarchal power, Benjamin concludes, as they also do, that a main\nsource or component lies in exclusive childrearing by women/mothers,\nwhich occasions the related risks of collapsing maternal authority\ninto mere dominance, supporting the fantasy of maternal omnipotence,\ncentering potent ambivalence on the mother, and fostering rigid gender\nidentities and identifications. While the boy attains autonomy via\nloving identification with the father and separation from the mother,\nthe girl’s relation to paternal power is complicated by its\ninaccessibility to her. If she seeks “liberation in the\nfather” (Benjamin 1988: 99), she connects her femininity to\nsubmission rather than agency, and attaches to masculinity as an\nidealized object of love (and as its love-object), conferring on it\nvalue while devaluing the mother, and creating a divide between\nfeminine sexuality and autonomous subjectivity. Benjamin argues,\nhowever, that the “protean impersonality” (Benjamin 1988:\n216) of male domination cannot be addressed by a critique that focuses\nsolely on the family and childcare and that power relations cannot be\novercome solely through a transformation in caretaking roles, although\nthe equation of women with motherhood is certainly one component of\nthe problem. If gendered identities are encouraged by social power\nrelations—masculinity is developed as a denial of dependency and\nassertion of independence, while femininity is developed in an\nidentification with nurturing and concession of autonomy—then\nreal transformation requires attention to social roles and\n“cultural representations” (Benjamin 1988: 217), since\n“the core feature of the gender system—promoting\nmasculinity as separation from and femininity as continuity with the\nprimary bond—is maintained even when mother and father\nparticipate equally in that bond” (Benjamin 1988: 217). In\nBenjamin’s theoretical model, children are responsive not only\nto their social environment, but also to ideas with opaque meanings\n(mandates, expectations, prohibitions, exhortations, etc.) that are\noften covertly, indirectly, or unknowingly conveyed in parental\nlanguage and edicts. Gender equality thus requires that women be\nrecognized, by themselves and by men, as subjects in culture and that\nintersubjectivity itself be revalued.\n\nBenjamin’s analysis can be distinguished from those of Irigaray\nand Kristeva precisely by the way in which it tends to conflate or\ncollapse the distinction between representation and social roles.\nWhile Anglo-American psychoanalytic feminism theorizes gender as\nderived from or dependent on social (including familial) inequalities\nand power relations, and thus aims to reduce its psychic effects by\nredressing social and familial domination/subordination, French\nfeminism does not calibrate the psyche on socio-cultural relations but\non imaginary and symbolic representations. Benjamin’s\npartitioning of intrapsychic life into internal and external\nrelations, and her vision of intersubjective equilibrium is, in\ncontrast to Irigaray and Kristeva’s assertion of discord within\nand between subjects, oriented by the conviction that social harmony\nis desirable and attainable.\n",
    "section_title": "5. Anglo-American Psychoanalytic Feminism",
    "entry_title": "Psychoanalytic Feminism",
    "hierarchy_title": "Psychoanalytic Feminism || Anglo-American Psychoanalytic Feminism",
    "tokenized_text": [
        "angloamerican",
        "psychoanalytic",
        "feminism",
        "angloamerican",
        "psychoanalytic",
        "feminism",
        "number",
        "angloamerican",
        "australian",
        "feminist",
        "theorist",
        "scholar",
        "read",
        "lacan",
        "laid",
        "groundwork",
        "passage",
        "french",
        "english",
        "france",
        "u",
        "britain",
        "australia",
        "s",
        "s",
        "early",
        "s",
        "among",
        "juliet",
        "mitchell",
        "psychoanalysis",
        "feminism",
        "teresa",
        "brennan",
        "interpretation",
        "flesh",
        "freud",
        "femininity",
        "elizabeth",
        "grosz",
        "jacques",
        "lacan",
        "feminist",
        "introduction",
        "jane",
        "gallop",
        "reading",
        "lacan",
        "daughter",
        "seduction",
        "jacqueline",
        "rose",
        "sexuality",
        "field",
        "vision",
        "writing",
        "english",
        "theorist",
        "take",
        "bearing",
        "french",
        "lacanian",
        "approach",
        "psychoanalysis",
        "generally",
        "classified",
        "field",
        "today",
        "get",
        "called",
        "continental",
        "feminism",
        "responsible",
        "revitalizing",
        "psychoanalysis",
        "feminist",
        "thought",
        "countering",
        "earlier",
        "feminist",
        "dismissal",
        "aim",
        "reclaim",
        "freud",
        "central",
        "analysis",
        "feminist",
        "purpose",
        "juliet",
        "mitchell",
        "instance",
        "develops",
        "insight",
        "indispensable",
        "feminist",
        "reading",
        "psychoanalysis",
        "recommendation",
        "patriarchal",
        "society",
        "analysis",
        "one",
        "mitchell",
        "xiii",
        "mitchell",
        "rose",
        "also",
        "coeditors",
        "feminine",
        "sexuality",
        "selection",
        "lacan",
        "seminar",
        "editor",
        "wrote",
        "influential",
        "introduction",
        "section",
        "address",
        "however",
        "lacanian",
        "inspired",
        "feminist",
        "appropriation",
        "psychoanalysis",
        "english",
        "speaking",
        "world",
        "angloamerican",
        "development",
        "feminist",
        "psychoanalysis",
        "descended",
        "indebted",
        "british",
        "object",
        "relation",
        "theory",
        "focus",
        "preoedipal",
        "motherchild",
        "bond",
        "especially",
        "work",
        "melanie",
        "klein",
        "donald",
        "winnicott",
        "author",
        "work",
        "vein",
        "include",
        "nancy",
        "chodorow",
        "reproduction",
        "mothering",
        "dorothy",
        "dinnerstein",
        "mermaid",
        "minotaur",
        "jessica",
        "benjamin",
        "bond",
        "love",
        "like",
        "subject",
        "love",
        "object",
        "distinguishes",
        "angloamerican",
        "tradition",
        "frenchinfluenced",
        "one",
        "emphasis",
        "preoedipal",
        "sociality",
        "intersubjectivity",
        "focus",
        "value",
        "integration",
        "harmony",
        "wholeness",
        "opposed",
        "selfdivision",
        "respecting",
        "alien",
        "within",
        "remainder",
        "section",
        "focus",
        "work",
        "benjamin",
        "exemplary",
        "angloamerican",
        "approach",
        "clarify",
        "difference",
        "similarity",
        "french",
        "approach",
        "like",
        "irigaray",
        "benjamin",
        "perturbed",
        "psychoanalytic",
        "depiction",
        "social",
        "life",
        "world",
        "men",
        "developed",
        "basis",
        "fatherson",
        "relation",
        "aggression",
        "hostility",
        "love",
        "mourning",
        "deploring",
        "struggle",
        "power",
        "benjamin",
        "woman",
        "merely",
        "triangulating",
        "object",
        "desire",
        "benjamin",
        "argues",
        "formation",
        "identity",
        "subject",
        "become",
        "bound",
        "love",
        "oppressive",
        "social",
        "relation",
        "worry",
        "domination",
        "anchored",
        "heart",
        "dominated",
        "woman",
        "erotically",
        "attached",
        "patriarchal",
        "power",
        "belief",
        "psychoanalysis",
        "help",
        "explain",
        "psychoanalysis",
        "thus",
        "offer",
        "benjamin",
        "insight",
        "individual",
        "psyche",
        "also",
        "organization",
        "structure",
        "distribution",
        "political",
        "power",
        "hierarchy",
        "aim",
        "grasp",
        "deep",
        "structure",
        "gender",
        "binary",
        "opposition",
        "common",
        "psychic",
        "cultural",
        "representation",
        "unlike",
        "kristeva",
        "irigaray",
        "problematize",
        "duality",
        "comprehensiveness",
        "natureculture",
        "distinction",
        "emphasize",
        "transformation",
        "symbolic",
        "bond",
        "benjamin",
        "highlight",
        "role",
        "contradictory",
        "cultural",
        "stereotype",
        "bringing",
        "forth",
        "gender",
        "know",
        "live",
        "emphasizes",
        "need",
        "social",
        "transformation",
        "taking",
        "call",
        "eclectic",
        "approach",
        "eschewing",
        "methodological",
        "orthodoxy",
        "regard",
        "freudian",
        "metapsychology",
        "theory",
        "instinct",
        "benjamin",
        "establishes",
        "project",
        "basis",
        "two",
        "person",
        "relational",
        "perspective",
        "separate",
        "independent",
        "subject",
        "rather",
        "undifferentiated",
        "unity",
        "governing",
        "early",
        "infantile",
        "life",
        "preoedipal",
        "period",
        "would",
        "make",
        "infant",
        "merely",
        "monadic",
        "energy",
        "system",
        "benjamin",
        "maintains",
        "genuine",
        "duality",
        "relationality",
        "exists",
        "start",
        "process",
        "growth",
        "entail",
        "development",
        "within",
        "relationship",
        "rather",
        "development",
        "infant",
        "postulate",
        "fundamentally",
        "active",
        "social",
        "creature",
        "reaching",
        "world",
        "expressing",
        "desire",
        "recognition",
        "knot",
        "identity",
        "formed",
        "via",
        "interplay",
        "desire",
        "response",
        "another",
        "variously",
        "affirms",
        "defies",
        "child",
        "benjamin",
        "claim",
        "emphasis",
        "sociality",
        "intersubjectivity",
        "intended",
        "disregard",
        "intrapsychic",
        "element",
        "subject",
        "formation",
        "fact",
        "argues",
        "interaction",
        "psyche",
        "social",
        "life",
        "hold",
        "inner",
        "outer",
        "competitive",
        "complementary",
        "theoretical",
        "perspective",
        "nonetheless",
        "want",
        "situate",
        "identity",
        "generally",
        "gendered",
        "identity",
        "specifically",
        "within",
        "purview",
        "subject",
        "multiple",
        "ambiguous",
        "social",
        "identification",
        "domination",
        "argues",
        "ensues",
        "failure",
        "recognition",
        "built",
        "political",
        "social",
        "order",
        "merely",
        "failure",
        "take",
        "place",
        "personal",
        "individual",
        "level",
        "single",
        "relationship",
        "borrowing",
        "initial",
        "insight",
        "foucault",
        "benjamin",
        "look",
        "way",
        "power",
        "shape",
        "form",
        "identity",
        "desire",
        "producing",
        "gendered",
        "relation",
        "benjamin",
        "borrowing",
        "another",
        "insight",
        "hegel",
        "benjamin",
        "depicts",
        "dialectic",
        "recognition",
        "struggle",
        "identity",
        "conflict",
        "independence",
        "dependence",
        "view",
        "however",
        "hegelian",
        "tale",
        "like",
        "freudian",
        "one",
        "erroneously",
        "begin",
        "monadic",
        "selfinterested",
        "ego",
        "thus",
        "concludes",
        "inevitability",
        "breakdown",
        "domination",
        "according",
        "benjamin",
        "winnicott",
        "resolve",
        "hegelian",
        "freudian",
        "dilemma",
        "benjamin",
        "solitary",
        "egoism",
        "fight",
        "death",
        "reformulating",
        "problem",
        "recognition",
        "level",
        "fantasy",
        "distinguishing",
        "internal",
        "external",
        "world",
        "infant",
        "feel",
        "confident",
        "asserting",
        "independence",
        "destroying",
        "object",
        "fantasy",
        "long",
        "object",
        "discovered",
        "secure",
        "external",
        "existence",
        "reality",
        "word",
        "fantasy",
        "destruction",
        "appeased",
        "failure",
        "infant",
        "destroys",
        "internally",
        "externally",
        "relieved",
        "still",
        "object",
        "address",
        "interact",
        "particularly",
        "infant",
        "destroys",
        "separate",
        "mother",
        "internally",
        "fantasy",
        "simultaneously",
        "retains",
        "relation",
        "externally",
        "reality",
        "good",
        "enough",
        "mother",
        "must",
        "foster",
        "relationship",
        "two",
        "separate",
        "ego",
        "neither",
        "allowing",
        "child",
        "succeed",
        "destroying",
        "dominating",
        "allowing",
        "squash",
        "child",
        "nascent",
        "attempt",
        "selfassertion",
        "motherchild",
        "relation",
        "kind",
        "revised",
        "neohegelian",
        "struggle",
        "power",
        "retaining",
        "aim",
        "mutual",
        "recognition",
        "respect",
        "risking",
        "domination",
        "rebellion",
        "violent",
        "conflict",
        "within",
        "repressed",
        "neutralized",
        "pacified",
        "reality",
        "intersubjective",
        "life",
        "affirms",
        "recognizes",
        "autonomy",
        "asking",
        "chodorow",
        "dinnerstein",
        "genesis",
        "patriarchal",
        "power",
        "benjamin",
        "concludes",
        "also",
        "main",
        "source",
        "component",
        "lie",
        "exclusive",
        "childrearing",
        "womenmothers",
        "occasion",
        "related",
        "risk",
        "collapsing",
        "maternal",
        "authority",
        "mere",
        "dominance",
        "supporting",
        "fantasy",
        "maternal",
        "omnipotence",
        "centering",
        "potent",
        "ambivalence",
        "mother",
        "fostering",
        "rigid",
        "gender",
        "identity",
        "identification",
        "boy",
        "attains",
        "autonomy",
        "via",
        "loving",
        "identification",
        "father",
        "separation",
        "mother",
        "girl",
        "relation",
        "paternal",
        "power",
        "complicated",
        "inaccessibility",
        "seek",
        "liberation",
        "father",
        "benjamin",
        "connects",
        "femininity",
        "submission",
        "rather",
        "agency",
        "attache",
        "masculinity",
        "idealized",
        "object",
        "love",
        "loveobject",
        "conferring",
        "value",
        "devaluing",
        "mother",
        "creating",
        "divide",
        "feminine",
        "sexuality",
        "autonomous",
        "subjectivity",
        "benjamin",
        "argues",
        "however",
        "protean",
        "impersonality",
        "benjamin",
        "male",
        "domination",
        "addressed",
        "critique",
        "focus",
        "solely",
        "family",
        "childcare",
        "power",
        "relation",
        "overcome",
        "solely",
        "transformation",
        "caretaking",
        "role",
        "although",
        "equation",
        "woman",
        "motherhood",
        "certainly",
        "one",
        "component",
        "problem",
        "gendered",
        "identity",
        "encouraged",
        "social",
        "power",
        "relationsmasculinity",
        "developed",
        "denial",
        "dependency",
        "assertion",
        "independence",
        "femininity",
        "developed",
        "identification",
        "nurturing",
        "concession",
        "autonomythen",
        "real",
        "transformation",
        "requires",
        "attention",
        "social",
        "role",
        "cultural",
        "representation",
        "benjamin",
        "since",
        "core",
        "feature",
        "gender",
        "systempromoting",
        "masculinity",
        "separation",
        "femininity",
        "continuity",
        "primary",
        "bondis",
        "maintained",
        "even",
        "mother",
        "father",
        "participate",
        "equally",
        "bond",
        "benjamin",
        "benjamin",
        "theoretical",
        "model",
        "child",
        "responsive",
        "social",
        "environment",
        "also",
        "idea",
        "opaque",
        "meaning",
        "mandate",
        "expectation",
        "prohibition",
        "exhortation",
        "etc",
        "often",
        "covertly",
        "indirectly",
        "unknowingly",
        "conveyed",
        "parental",
        "language",
        "edict",
        "gender",
        "equality",
        "thus",
        "requires",
        "woman",
        "recognized",
        "men",
        "subject",
        "culture",
        "intersubjectivity",
        "revalued",
        "benjamin",
        "analysis",
        "distinguished",
        "irigaray",
        "kristeva",
        "precisely",
        "way",
        "tends",
        "conflate",
        "collapse",
        "distinction",
        "representation",
        "social",
        "role",
        "angloamerican",
        "psychoanalytic",
        "feminism",
        "theorizes",
        "gender",
        "derived",
        "dependent",
        "social",
        "including",
        "familial",
        "inequality",
        "power",
        "relation",
        "thus",
        "aim",
        "reduce",
        "psychic",
        "effect",
        "redressing",
        "social",
        "familial",
        "dominationsubordination",
        "french",
        "feminism",
        "calibrate",
        "psyche",
        "sociocultural",
        "relation",
        "imaginary",
        "symbolic",
        "representation",
        "benjamin",
        "partitioning",
        "intrapsychic",
        "life",
        "internal",
        "external",
        "relation",
        "vision",
        "intersubjective",
        "equilibrium",
        "contrast",
        "irigaray",
        "kristeva",
        "assertion",
        "discord",
        "within",
        "subject",
        "oriented",
        "conviction",
        "social",
        "harmony",
        "desirable",
        "attainable"
    ]
}