{
    "main_text": "Feminist Philosophy of Science || Feminist Standpoint Theory\n4.3 Feminist Standpoint Theory\n\nWhile there are various standpoint theories, the commonalities include\nendorsement of the following three theses: the situated knowledge\nthesis, the thesis of epistemic privilege, and the achievement thesis\n(Wylie 2003; Rolin 2009; Intemann 2010; Crasnow 2013, 2014). The\nthesis of situated knowledge is based in the understanding that\nknowledge is for and by a particular set of socially\nsituated knowers and so is always local—a\ncultural/social/political “location” characterized by the\npower relations endemic in such settings. The differential\ndistribution of power and differences in interests are closely\nrelated—and thus the questions asked and the features of the\nworld that are relevant to answering those questions vary depending on\nlocation as well. Among the differences that are most salient are\nthose that are in conflict with the interests of the dominant groups.\nThus the metaphors of situated knowledge and social location give rise\nto one of the key ideas of feminist standpoint theory—the idea\nof the researcher as an insider/outsider who has “double\nvision”. She has access to the lived experience of those studied\nand the dominant culture of those who are doing the studying (the\nscholars). It is this double vision that aids in recognizing the\nlimits of the dominant frameworks.\n\nPatricia Hill Collins (1986), for example, advocates the use of\nstandpoint to analyze race and class. She argues that the researcher\nwho is marginalized may recognize that many of the concepts and\nprocedures adopted by the discipline are problematic when her\ncolleagues do not, precisely because she understands the objects of\ninquiry through her disciplinary research tradition and through her\nown experience occupying a marginalized social location. It is this\ndouble vision that makes the social scientist sensitive to the lines\nof fault that give rise to shifts in concepts and methods discussed in\n section 2\n and\n section 3.\n\nThe thesis of epistemic privilege is one of the more contentious\ncomponents of feminist standpoint theory. Many criticisms of the view\nstem from the mistaken understanding of epistemic privilege as\nautomatic. As Intemann points out, if this had been feminist\nstandpoint theory’s claim the view would be either trivial or\nfalse (Intemann 2010). But feminist standpoint theory is not committed\nto the trivial claim that only those who have had a particular\nexperience know what that experience is like. Nor does it make the\nobviously false claim that any woman can automatically know\nabout the experience of all other women. Such a claim would depend on\na presupposition of some sameness of women’s\nexperience—a presupposition that is not only false, but\nproblematically so since it erases the differences that race, class,\ndisability, sexuality, and gender identification make among\nwomen’s experiences. \n\nMisunderstandings of the situated knowledge and epistemic advantage\ntheses are partly due to two errors: thinking of them in isolation\nfrom each other and mistakenly taking them to be claims about\nindividualistic knowledge. Feminist standpoint theory is not an\naccount of how an individual acquires knowledge, but rather an account\nthat treats knowledge as social. This point can be made more clearly\nby considering the achievement thesis—the idea that standpoint\nis not automatic and must be achieved. Harding distinguishes between a\nperspective and a standpoint in order to clarify this. First, feminist\nstandpoint theory \n\n\nintends to map the practices of power, the ways the dominant\ninstitutions and their conceptual frameworks create and maintain\noppressive social relations. Secondly, it does this by locating, in a\nmaterial and political disadvantage or form of oppression, a\ndistinctive insight about how a hierarchical social structure works.\n(Harding 2004b: 31) \n\n\nHarding goes on to point out that just recording what members of\noppressed groups say is not adequate since they may have absorbed\ndominant understandings of the hierarchy. Standpoint requires the\ncreation of a group consciousness, and this is not equivalent to the\nshift in perspective of an individual (Harding 2004b: 31–32). A\nchange in the location of an individual automatically brings a\ndifferent perspective, however the achievement of a standpoint\nrequires working out where one is socially situated with others whose\nexperiences come to be mutually understood as shared.\n\nHarding’s account of what it is to achieve a standpoint thus\nemphasizes the deeply political nature of feminist standpoint theory.\nThis characterization also makes clear the challenge that feminist\nstandpoint theory raises for objectivity since both neutrality and\nimpartiality are in tension with feminist standpoint theory. Since\nknowledge is situated, it is also always partial. Recognizing that\nsome social locations provide epistemic privilege depends on\nacknowledging that partiality. Given this, it is not surprising that\nresistance to feminist standpoint theory has revolved around the way\nit has been perceived as a threat to the objectivity of science\n(Pinnick 2005).\n\nHarding has addressed the concern about objectivity repeatedly, most\nrecently in Harding 2015, through what she calls “strong\nobjectivity”. “Strong objectivity”, calls for the\nsubject of knowledge (the knowers) and the process through which\nknowledge is produced to be scrutinized according to the same\nstandards as the objects of knowledge. The contextual elements that\nfunction as part of the evidence, the selection of problems, the\nformation of hypotheses, the design of research (including the\norganization of research communities), the collection, interpretation,\nand sorting of data, decisions about when to stop research, the way\nresults of research are reported and so on need to be open to critical\nevaluation. But such evaluation requires that these contextual\nelements be accessible to researchers. The insider/outsider\ndouble-vision that feminist standpoint theory produces gives rise to\nthe epistemic advantage through which researchers have this access.\n\n\n\n…[A] maximally critical study of scientists and their\ncommunities can be done only from the perspective of those whose lives\nhave been marginalized by such communities. Thus, strong objectivity\nrequires that scientists and their communities be integrated into\ndemocracy-advancing projects for scientific and epistemological\nreasons as well as moral and political ones. (Harding 2004a: 136)\n\n\nAlison Wylie (2003) offers an alternative account of how feminist\nstandpoint can be understood to produce objectivity. Her approach is\nalso characteristic of shifts in the feminist epistemological landscape\nthat blur the lines between feminist empiricism and feminist\nstandpoint theory (Intemann 2010). Wylie notes that\n“objectivity” is frequently used to indicate a\nrelationship between theory and the world and so is identified as a\nproperty of knowledge claims. She proposes that we think about\nobjectivity as the degree to which these claims conform to some\nstandard set of epistemic virtues. She proposes empirical adequacy,\nexplanatory power, internal coherence, consistency with other\nestablished bodies of knowledge, although she notes that some other\nsuch list might serve as well. These theoretical virtues are rarely,\nif ever, all maximized by any one theory. Consequently, researchers\nmust make judgments about which virtues are most important at any\ngiven time for any particular knowledge project. These judgments\ndepend on the interests, purposes, intentions, and goals of the\nresearchers and research community, which can be seen as reflective of\na standpoint. Consequently, feminist standpoint can improve\nobjectivity through determining what sort of empirical adequacy,\nexplanatory power, or other virtues are relevant for a particular\nknowledge project and the degree to which each is relevant.\n\nOn Wylie’s account, science is not neutral (values inform\nhypotheses and are implied by them), nor is it impartial, given that\nvalues determine which among the characteristics that determine\nobjectivity are to be considered the most relevant for any\nspecific knowledge project. But impartiality has not entirely\nvanished in that what counts as empirical is not determined by values,\neven though its relevance is. Those in positions of subordination have\nepistemic privilege regarding some kinds of evidence and its\nrelevance, special inferential heuristics, and interpretative or\nexplanatory hypotheses.\n\nBoth Harding and Wylie appeal to standards (epistemic values) that do\nnot depend on any social/political (non-epistemic values) and yet\ntheir accounts accommodate social/political values and provide ways of\nunderstanding how such values play a positive role in knowledge\nproduction. Kristen Intemann (2010) has argued that refinements in\nboth feminist empiricism and feminist standpoint theory have resulted\nin a convergence of the two approaches. She identifies three shared\nfeatures: they are contextual, normative, and social. Feminist\n(holist) empiricism (both radical and gap empiricism) is contextual in\nthat it takes background assumptions and beliefs within a particular\ncontext either as part of the evidence for a theory or as determining\nwhat counts as evidence. Contemporary standpoint approaches are\ncontextual in that they point to social situatedness as a determinant\nof knowledge through the role that it plays either in revealing the\nevidence itself or the relevance of it. Both sorts of approaches are\nnormative in their focus on the role of social, political, and\ncultural values for knowledge production, in specification of\nevidence, and in determining the ends or goals of science. Both are\nalso social, focusing on the socio-political structure of the\nknowledge community. However, Intemann identifies two remaining areas\nof difference: feminist empiricism and feminist standpoint theory\ndiffer over the kind of diversity needed for objectivity and they\ndiffer over the role that non-epistemic values play in enhancing\nobjectivity (Intemann 2010: 790). For the former, Intemann argues that\nstandpoint’s understanding of diversity as social location\noffers a better grounding for a positive account of the role of\nfeminist values in science than feminist empiricist approaches in that\nit better explains the significance of particular sorts of evidence\nand why it is relevant for some knowledge projects and not others. But\nthe question of which knowledge projects are the ones that should be\npursued remains. It is not enough to say “women’s\nknowledge project” since women form a heterogeneous and unstable\ngroup. That is to say, which characteristics—sex, gender, race,\nsocio-economic class, ethnicity, sexuality, or differences in\nability—matter will vary depending on context.\n\nSharon Crasnow (2013, 2014) suggests that while the interests of the\nheterogeneous group “women” are often in conflict, through\nconversation, negotiation, and political action shared interests can\nbe identified and serve to provisionally stabilize evidential\nrelevance relations around a particular knowledge project. She\nconceives of this process as part of what it means for standpoint to\nbe achieved. Such an extension of feminist standpoint theory also\nsuggests a connection with current research in social epistemology\n(see the entry on\n feminist social epistemology).\n",
    "section_title": "4.3 Feminist Standpoint Theory",
    "entry_title": "Feminist Perspectives on Science",
    "hierarchy_title": "Feminist Perspectives on Science || Feminist Philosophy of Science || Feminist Standpoint Theory",
    "tokenized_text": [
        "feminist",
        "philosophy",
        "science",
        "feminist",
        "standpoint",
        "theory",
        "feminist",
        "standpoint",
        "theory",
        "various",
        "standpoint",
        "theory",
        "commonality",
        "include",
        "endorsement",
        "following",
        "three",
        "thesis",
        "situated",
        "knowledge",
        "thesis",
        "thesis",
        "epistemic",
        "privilege",
        "achievement",
        "thesis",
        "wylie",
        "rolin",
        "intemann",
        "crasnow",
        "thesis",
        "situated",
        "knowledge",
        "based",
        "understanding",
        "knowledge",
        "particular",
        "set",
        "socially",
        "situated",
        "knower",
        "always",
        "locala",
        "culturalsocialpolitical",
        "location",
        "characterized",
        "power",
        "relation",
        "endemic",
        "setting",
        "differential",
        "distribution",
        "power",
        "difference",
        "interest",
        "closely",
        "relatedand",
        "thus",
        "question",
        "asked",
        "feature",
        "world",
        "relevant",
        "answering",
        "question",
        "vary",
        "depending",
        "location",
        "well",
        "among",
        "difference",
        "salient",
        "conflict",
        "interest",
        "dominant",
        "group",
        "thus",
        "metaphor",
        "situated",
        "knowledge",
        "social",
        "location",
        "give",
        "rise",
        "one",
        "key",
        "idea",
        "feminist",
        "standpoint",
        "theorythe",
        "idea",
        "researcher",
        "insideroutsider",
        "double",
        "vision",
        "access",
        "lived",
        "experience",
        "studied",
        "dominant",
        "culture",
        "studying",
        "scholar",
        "double",
        "vision",
        "aid",
        "recognizing",
        "limit",
        "dominant",
        "framework",
        "patricia",
        "hill",
        "collins",
        "example",
        "advocate",
        "use",
        "standpoint",
        "analyze",
        "race",
        "class",
        "argues",
        "researcher",
        "marginalized",
        "may",
        "recognize",
        "many",
        "concept",
        "procedure",
        "adopted",
        "discipline",
        "problematic",
        "colleague",
        "precisely",
        "understands",
        "object",
        "inquiry",
        "disciplinary",
        "research",
        "tradition",
        "experience",
        "occupying",
        "marginalized",
        "social",
        "location",
        "double",
        "vision",
        "make",
        "social",
        "scientist",
        "sensitive",
        "line",
        "fault",
        "give",
        "rise",
        "shift",
        "concept",
        "method",
        "discussed",
        "section",
        "section",
        "thesis",
        "epistemic",
        "privilege",
        "one",
        "contentious",
        "component",
        "feminist",
        "standpoint",
        "theory",
        "many",
        "criticism",
        "view",
        "stem",
        "mistaken",
        "understanding",
        "epistemic",
        "privilege",
        "automatic",
        "intemann",
        "point",
        "feminist",
        "standpoint",
        "theory",
        "claim",
        "view",
        "would",
        "either",
        "trivial",
        "false",
        "intemann",
        "feminist",
        "standpoint",
        "theory",
        "committed",
        "trivial",
        "claim",
        "particular",
        "experience",
        "know",
        "experience",
        "like",
        "make",
        "obviously",
        "false",
        "claim",
        "woman",
        "automatically",
        "know",
        "experience",
        "woman",
        "claim",
        "would",
        "depend",
        "presupposition",
        "sameness",
        "woman",
        "experiencea",
        "presupposition",
        "false",
        "problematically",
        "since",
        "era",
        "difference",
        "race",
        "class",
        "disability",
        "sexuality",
        "gender",
        "identification",
        "make",
        "among",
        "woman",
        "experience",
        "misunderstanding",
        "situated",
        "knowledge",
        "epistemic",
        "advantage",
        "thesis",
        "partly",
        "due",
        "two",
        "error",
        "thinking",
        "isolation",
        "mistakenly",
        "taking",
        "claim",
        "individualistic",
        "knowledge",
        "feminist",
        "standpoint",
        "theory",
        "account",
        "individual",
        "acquires",
        "knowledge",
        "rather",
        "account",
        "treat",
        "knowledge",
        "social",
        "point",
        "made",
        "clearly",
        "considering",
        "achievement",
        "thesisthe",
        "idea",
        "standpoint",
        "automatic",
        "must",
        "achieved",
        "harding",
        "distinguishes",
        "perspective",
        "standpoint",
        "order",
        "clarify",
        "first",
        "feminist",
        "standpoint",
        "theory",
        "intends",
        "map",
        "practice",
        "power",
        "way",
        "dominant",
        "institution",
        "conceptual",
        "framework",
        "create",
        "maintain",
        "oppressive",
        "social",
        "relation",
        "secondly",
        "locating",
        "material",
        "political",
        "disadvantage",
        "form",
        "oppression",
        "distinctive",
        "insight",
        "hierarchical",
        "social",
        "structure",
        "work",
        "harding",
        "b",
        "harding",
        "go",
        "point",
        "recording",
        "member",
        "oppressed",
        "group",
        "say",
        "adequate",
        "since",
        "may",
        "absorbed",
        "dominant",
        "understanding",
        "hierarchy",
        "standpoint",
        "requires",
        "creation",
        "group",
        "consciousness",
        "equivalent",
        "shift",
        "perspective",
        "individual",
        "harding",
        "b",
        "change",
        "location",
        "individual",
        "automatically",
        "brings",
        "different",
        "perspective",
        "however",
        "achievement",
        "standpoint",
        "requires",
        "working",
        "one",
        "socially",
        "situated",
        "others",
        "whose",
        "experience",
        "come",
        "mutually",
        "understood",
        "shared",
        "harding",
        "account",
        "achieve",
        "standpoint",
        "thus",
        "emphasizes",
        "deeply",
        "political",
        "nature",
        "feminist",
        "standpoint",
        "theory",
        "characterization",
        "also",
        "make",
        "clear",
        "challenge",
        "feminist",
        "standpoint",
        "theory",
        "raise",
        "objectivity",
        "since",
        "neutrality",
        "impartiality",
        "tension",
        "feminist",
        "standpoint",
        "theory",
        "since",
        "knowledge",
        "situated",
        "also",
        "always",
        "partial",
        "recognizing",
        "social",
        "location",
        "provide",
        "epistemic",
        "privilege",
        "depends",
        "acknowledging",
        "partiality",
        "given",
        "surprising",
        "resistance",
        "feminist",
        "standpoint",
        "theory",
        "revolved",
        "around",
        "way",
        "perceived",
        "threat",
        "objectivity",
        "science",
        "pinnick",
        "harding",
        "addressed",
        "concern",
        "objectivity",
        "repeatedly",
        "recently",
        "harding",
        "call",
        "strong",
        "objectivity",
        "strong",
        "objectivity",
        "call",
        "subject",
        "knowledge",
        "knower",
        "process",
        "knowledge",
        "produced",
        "scrutinized",
        "according",
        "standard",
        "object",
        "knowledge",
        "contextual",
        "element",
        "function",
        "part",
        "evidence",
        "selection",
        "problem",
        "formation",
        "hypothesis",
        "design",
        "research",
        "including",
        "organization",
        "research",
        "community",
        "collection",
        "interpretation",
        "sorting",
        "data",
        "decision",
        "stop",
        "research",
        "way",
        "result",
        "research",
        "reported",
        "need",
        "open",
        "critical",
        "evaluation",
        "evaluation",
        "requires",
        "contextual",
        "element",
        "accessible",
        "researcher",
        "insideroutsider",
        "doublevision",
        "feminist",
        "standpoint",
        "theory",
        "produce",
        "give",
        "rise",
        "epistemic",
        "advantage",
        "researcher",
        "access",
        "maximally",
        "critical",
        "study",
        "scientist",
        "community",
        "done",
        "perspective",
        "whose",
        "life",
        "marginalized",
        "community",
        "thus",
        "strong",
        "objectivity",
        "requires",
        "scientist",
        "community",
        "integrated",
        "democracyadvancing",
        "project",
        "scientific",
        "epistemological",
        "reason",
        "well",
        "moral",
        "political",
        "one",
        "harding",
        "a",
        "alison",
        "wylie",
        "offer",
        "alternative",
        "account",
        "feminist",
        "standpoint",
        "understood",
        "produce",
        "objectivity",
        "approach",
        "also",
        "characteristic",
        "shift",
        "feminist",
        "epistemological",
        "landscape",
        "blur",
        "line",
        "feminist",
        "empiricism",
        "feminist",
        "standpoint",
        "theory",
        "intemann",
        "wylie",
        "note",
        "objectivity",
        "frequently",
        "used",
        "indicate",
        "relationship",
        "theory",
        "world",
        "identified",
        "property",
        "knowledge",
        "claim",
        "proposes",
        "think",
        "objectivity",
        "degree",
        "claim",
        "conform",
        "standard",
        "set",
        "epistemic",
        "virtue",
        "proposes",
        "empirical",
        "adequacy",
        "explanatory",
        "power",
        "internal",
        "coherence",
        "consistency",
        "established",
        "body",
        "knowledge",
        "although",
        "note",
        "list",
        "might",
        "serve",
        "well",
        "theoretical",
        "virtue",
        "rarely",
        "ever",
        "maximized",
        "one",
        "theory",
        "consequently",
        "researcher",
        "must",
        "make",
        "judgment",
        "virtue",
        "important",
        "given",
        "time",
        "particular",
        "knowledge",
        "project",
        "judgment",
        "depend",
        "interest",
        "purpose",
        "intention",
        "goal",
        "researcher",
        "research",
        "community",
        "seen",
        "reflective",
        "standpoint",
        "consequently",
        "feminist",
        "standpoint",
        "improve",
        "objectivity",
        "determining",
        "sort",
        "empirical",
        "adequacy",
        "explanatory",
        "power",
        "virtue",
        "relevant",
        "particular",
        "knowledge",
        "project",
        "degree",
        "relevant",
        "wylie",
        "account",
        "science",
        "neutral",
        "value",
        "inform",
        "hypothesis",
        "implied",
        "impartial",
        "given",
        "value",
        "determine",
        "among",
        "characteristic",
        "determine",
        "objectivity",
        "considered",
        "relevant",
        "specific",
        "knowledge",
        "project",
        "impartiality",
        "entirely",
        "vanished",
        "count",
        "empirical",
        "determined",
        "value",
        "even",
        "though",
        "relevance",
        "position",
        "subordination",
        "epistemic",
        "privilege",
        "regarding",
        "kind",
        "evidence",
        "relevance",
        "special",
        "inferential",
        "heuristic",
        "interpretative",
        "explanatory",
        "hypothesis",
        "harding",
        "wylie",
        "appeal",
        "standard",
        "epistemic",
        "value",
        "depend",
        "socialpolitical",
        "nonepistemic",
        "value",
        "yet",
        "account",
        "accommodate",
        "socialpolitical",
        "value",
        "provide",
        "way",
        "understanding",
        "value",
        "play",
        "positive",
        "role",
        "knowledge",
        "production",
        "kristen",
        "intemann",
        "argued",
        "refinement",
        "feminist",
        "empiricism",
        "feminist",
        "standpoint",
        "theory",
        "resulted",
        "convergence",
        "two",
        "approach",
        "identifies",
        "three",
        "shared",
        "feature",
        "contextual",
        "normative",
        "social",
        "feminist",
        "holist",
        "empiricism",
        "radical",
        "gap",
        "empiricism",
        "contextual",
        "take",
        "background",
        "assumption",
        "belief",
        "within",
        "particular",
        "context",
        "either",
        "part",
        "evidence",
        "theory",
        "determining",
        "count",
        "evidence",
        "contemporary",
        "standpoint",
        "approach",
        "contextual",
        "point",
        "social",
        "situatedness",
        "determinant",
        "knowledge",
        "role",
        "play",
        "either",
        "revealing",
        "evidence",
        "relevance",
        "sort",
        "approach",
        "normative",
        "focus",
        "role",
        "social",
        "political",
        "cultural",
        "value",
        "knowledge",
        "production",
        "specification",
        "evidence",
        "determining",
        "end",
        "goal",
        "science",
        "also",
        "social",
        "focusing",
        "sociopolitical",
        "structure",
        "knowledge",
        "community",
        "however",
        "intemann",
        "identifies",
        "two",
        "remaining",
        "area",
        "difference",
        "feminist",
        "empiricism",
        "feminist",
        "standpoint",
        "theory",
        "differ",
        "kind",
        "diversity",
        "needed",
        "objectivity",
        "differ",
        "role",
        "nonepistemic",
        "value",
        "play",
        "enhancing",
        "objectivity",
        "intemann",
        "former",
        "intemann",
        "argues",
        "standpoint",
        "understanding",
        "diversity",
        "social",
        "location",
        "offer",
        "better",
        "grounding",
        "positive",
        "account",
        "role",
        "feminist",
        "value",
        "science",
        "feminist",
        "empiricist",
        "approach",
        "better",
        "explains",
        "significance",
        "particular",
        "sort",
        "evidence",
        "relevant",
        "knowledge",
        "project",
        "others",
        "question",
        "knowledge",
        "project",
        "one",
        "pursued",
        "remains",
        "enough",
        "say",
        "woman",
        "knowledge",
        "project",
        "since",
        "woman",
        "form",
        "heterogeneous",
        "unstable",
        "group",
        "say",
        "characteristicssex",
        "gender",
        "race",
        "socioeconomic",
        "class",
        "ethnicity",
        "sexuality",
        "difference",
        "abilitymatter",
        "vary",
        "depending",
        "context",
        "sharon",
        "crasnow",
        "suggests",
        "interest",
        "heterogeneous",
        "group",
        "woman",
        "often",
        "conflict",
        "conversation",
        "negotiation",
        "political",
        "action",
        "shared",
        "interest",
        "identified",
        "serve",
        "provisionally",
        "stabilize",
        "evidential",
        "relevance",
        "relation",
        "around",
        "particular",
        "knowledge",
        "project",
        "conceives",
        "process",
        "part",
        "mean",
        "standpoint",
        "achieved",
        "extension",
        "feminist",
        "standpoint",
        "theory",
        "also",
        "suggests",
        "connection",
        "current",
        "research",
        "social",
        "epistemology",
        "see",
        "entry",
        "feminist",
        "social",
        "epistemology"
    ]
}