{
    "main_text": "Formal Equality and Equal Citizenship\n2. Formal Equality and Equal Citizenship\n\nThe mid-twentieth century women’s movement—so-called\nsecond wave feminism—began as a liberation movement (see the\nentry on\n feminist political philosophy).\n The idea was that women are entitled to be free and equal\ncitizens—as free as men to participate in their societies, to\npursue their ambitions and determine their own lives. A starting place\nfor achieving equal citizenship was political equality. Despite the\nfacts that political equality had been defended by the Seneca Falls\nConvention in 1848 and by and\n Harriet Taylor Mill\n in the “Enfranchisement of Women” in 1851, and that\nwomen’s suffrage had been achieved in the United States and in\nmany other countries by the early 20th century, at\nmid-century political equality remained a radical idea that led to\nsome radical legal reform. And it remains a deeply contested concept\nnearly 75 years later.\n\nWhile the basic right to political equality is taken for granted in\nmany societies today and is explicit in the norms of international law\n(CEDAW 1979), in some cultures women are still not equal citizens.\nSome are unable to vote, hold office, attend school, engage in\nbusiness, or travel about freely. Some do not control their own\nreproductive lives, access to their bodies, the opportunity to pursue\nany life ambition other than marriage, or who their marriage partner\nwill be. Some women have little control over any major decisions about\ntheir lives. In some societies they are banned by law from making all\nor some such decisions, and thereby are rendered dependent on those\nwho can. \n\nOne of the most fundamental goals of global feminist jurisprudence is\nto oppose and reform barriers to women’s participation in the\npublic sphere. The basic premise is that unequal citizenship\nconstitutes second-class status that cannot be justified. Equal\ncitizenship is a presumptive value in the modern world.\nProblematically, in law the burden of justification typically lies\nwith the reformer and precedent favors the status quo (MacKinnon\n2006).\n\nInternational recognition of human rights has been particularly\nimportant as a means to achieve equal citizenship. Feminist legal\nscholars have been pursuing issues of women’s human rights\ninternationally for many years, at least since the United Nations was\nofficially formed in 1945. CEDAW, adopted in 1979, sets the\ninternational human rights standard against gender discrimination.\nEspecially since the 1980s, these efforts have been aided by mass\ncommunication, international travel, and the Internet (Rhode &\nSanger, 2004). International conferences have promoted dialogue and\nexchange of ideas on issues ranging from honor killing to labor law.\nSome international groups (both NGOs and government-sponsored) are\nspecifically focused on (what are often called) women’s issues,\nsuch as violence against women and girls, women’s economic\nviability, or women’s health and reproductive issues (see, e.g.,\nthe links in the Other Internet Resources Section to CRLP, Futures\nwithout Violence, Gendercide Watch, Human Rights Watch, National\nNetwork to End Domestic Violence, Wild for Human Rights, and\nWomenWatch). The collection of data by social scientists is more\naccurate and inclusive than ever in history, thus providing better\nfoundations for analysis. Finally, collaborative research and\ncomparative analysis of diverse legal systems and social customs have\nbeen increasing for at least thirty years, and in virtually every\nsociety more women are available to engage in these efforts and more\nmen have become interested in them (see Jain 2005; Rhode & Sanger\n2005; Stark 2004; Sen 1995; Peters & Wolper 1995)\n\nBeyond equal citizenship, feminist jurisprudence also criticizes legal\nor political structures that would put disproportionate burdens on\nwomen or children seeking to live or to become citizens in countries\nother than their country of origin. Here, feminists reveal how asylum\nor refugee policies may be based on male models of what constitutes\npersecutions, discounting forms of structural injustice that\ndisproportionately burden women (e.g. Parekh 2012; Freedman 2008).\n\nThe cumulative result of these efforts has been to globalize both the\nissues and the approaches to them. Providing a global perspective\nencourages conditions favorable to the conceptual revision needed for\nlegal reform. As nations join and sign international conventions and\ntreaties that increasingly include rights for women, feminists are\nsupplied with a foundation from which to argue that local laws must\ncomply with these international commitments. For example, signing the\nDeclaration on the Elimination of Violence Against Women implies that\na nation is committed to enacting and enforcing laws against violence\ntoward women. Ratifying the U.N. Declaration of Political and Civil\nRights implies that a nation is committed at a minimum to universal\nsuffrage and more generally to equal citizenship. Becoming a state\nparty to CEDAW affirms support for equal human rights and for\nelimination of all forms of discrimination against women. Although a\nnumber of states expressed reservations in their acceptance of CEDAW,\nthe US did not. Thus, international law and treaty commitments can be\nused to argue for national or local legal reform (Schneider 2004;\nPeters & Wolper 1995).\n\nYet even if the goal of stated legal equality is achieved, law\nprovides no protection unless it is enforced. Feminist legal critics\nhave argued that laws and treaties that exist on paper frequently are\nignored in fact when they apply to women and contradict local customs\nand beliefs (Husseini 2007; MacKinnon 2006). An additional concern is\nthat formal acceptance of treaties may mask failures to implement\ntreaty requirements (Hathaway 2005)\n\nMoreover, the meaning of equal citizenship beyond equal political\nparticipation remains contested. An initial liberal feminist approach\nwas to argue strictly for formal equality, that is, to deny that any\nsexual difference was ever relevant to legal doctrine. This strategy,\noften called the assimilation model, was an effective strategy for\nchallenging overt legal restrictions on women and legally enforced\nexclusion (Taub & Williams 1993; Smith 1993; Bartlett &\nKennedy 1991). For example, in the US feminist lawyers argued\nsuccessfully that statutes treating women differently for purposes\nsuch as estate administration or age of majority violated\nconstitutional equal protection, following the initial lead of Ruth\nBader Ginsburg as director of the ACLU Women’s Rights Project in\n Reed v. Reed\n (404 U.S. 71 (1971)). At its most comprehensive, this was the\napproach of US feminists seeking passage of the unsuccessful Equal\nRights Amendment (ERA) to the Constitution, an amendment that would\nhave put sex on the same fundamental legal footing as race.\n\nAchievement of equal citizenship viewed as the removal of explicit\nlegal barriers leaves open whether equality requires more. Even in the\nUnited States, much legal room remains for continuing controversy. The\neffort to establish full constitutional equal protection through the\nERA foundered on assertions that differences matter to issues as\ndiverse as military service, child support, or bathroom utilization\n(Mayeri 2011; Frug 1992).   This argument fueled\nconservative opposition to the ERA, but these issues were raised in\ndifferent forms for feminists as well.  Feminists emphasizing\nclass differences and labor rights were concerned that hard-won\nbenefits for women could be jeopardized. Critical race theorists were\nconcerned that formal equality for women failed to understand the\ncomplex intersectionality of discrimination against women of color\n(Mayeri 2011). Critics of patriarchy insisted that histories of\ndiscrimination were central to understanding the functioning of male\nnorms in social institutions from the family to employment to\npolitical structures. At present, in US constitutional law what equal\nprotection requires when sex is a category has not been modeled on the\nstrict scrutiny accorded race as a category; sexual differences\nconcretized in law must only pass a level of heightened scrutiny as to\ntheir rationale to garner constitutional acceptance.\n\nAcross the globe, there are similar debates about what more is\nrequired beyond formal equality of citizenship. CEDAW’s (1979)\nrequirement for the elimination of “all forms” of\ndiscrimination against women has been a framework for these debates\n(IWRAW-AP 2012). These debates are complicated, however, by concerns\nthat at least certain ways of understanding human rights norms\nincorporate so-called western values and are incompatible with\nlegitimate cultural differences. Whether theories of rights can be\nformulated in a manner that accommodates cultural differences has been\ngiven considerable attention by feminist political philosophers\n(Mookherjee 2009; Ackerly 2008) and is centrally relevant to the\nunderstanding of international human rights norms and their role in\nlaw.\n",
    "section_title": "2. Formal Equality and Equal Citizenship",
    "entry_title": "Feminist Philosophy of Law",
    "hierarchy_title": "Feminist Philosophy of Law || Formal Equality and Equal Citizenship",
    "tokenized_text": [
        "formal",
        "equality",
        "equal",
        "citizenship",
        "formal",
        "equality",
        "equal",
        "citizenship",
        "midtwentieth",
        "century",
        "woman",
        "movementsocalled",
        "second",
        "wave",
        "feminismbegan",
        "liberation",
        "movement",
        "see",
        "entry",
        "feminist",
        "political",
        "philosophy",
        "idea",
        "woman",
        "entitled",
        "free",
        "equal",
        "citizensas",
        "free",
        "men",
        "participate",
        "society",
        "pursue",
        "ambition",
        "determine",
        "life",
        "starting",
        "place",
        "achieving",
        "equal",
        "citizenship",
        "political",
        "equality",
        "despite",
        "fact",
        "political",
        "equality",
        "defended",
        "seneca",
        "fall",
        "convention",
        "harriet",
        "taylor",
        "mill",
        "enfranchisement",
        "woman",
        "woman",
        "suffrage",
        "achieved",
        "united",
        "state",
        "many",
        "country",
        "early",
        "th",
        "century",
        "midcentury",
        "political",
        "equality",
        "remained",
        "radical",
        "idea",
        "led",
        "radical",
        "legal",
        "reform",
        "remains",
        "deeply",
        "contested",
        "concept",
        "nearly",
        "year",
        "later",
        "basic",
        "right",
        "political",
        "equality",
        "taken",
        "granted",
        "many",
        "society",
        "today",
        "explicit",
        "norm",
        "international",
        "law",
        "cedaw",
        "culture",
        "woman",
        "still",
        "equal",
        "citizen",
        "unable",
        "vote",
        "hold",
        "office",
        "attend",
        "school",
        "engage",
        "business",
        "travel",
        "freely",
        "control",
        "reproductive",
        "life",
        "access",
        "body",
        "opportunity",
        "pursue",
        "life",
        "ambition",
        "marriage",
        "marriage",
        "partner",
        "woman",
        "little",
        "control",
        "major",
        "decision",
        "life",
        "society",
        "banned",
        "law",
        "making",
        "decision",
        "thereby",
        "rendered",
        "dependent",
        "one",
        "fundamental",
        "goal",
        "global",
        "feminist",
        "jurisprudence",
        "oppose",
        "reform",
        "barrier",
        "woman",
        "participation",
        "public",
        "sphere",
        "basic",
        "premise",
        "unequal",
        "citizenship",
        "constitutes",
        "secondclass",
        "status",
        "justified",
        "equal",
        "citizenship",
        "presumptive",
        "value",
        "modern",
        "world",
        "problematically",
        "law",
        "burden",
        "justification",
        "typically",
        "lie",
        "reformer",
        "precedent",
        "favor",
        "status",
        "quo",
        "mackinnon",
        "international",
        "recognition",
        "human",
        "right",
        "particularly",
        "important",
        "mean",
        "achieve",
        "equal",
        "citizenship",
        "feminist",
        "legal",
        "scholar",
        "pursuing",
        "issue",
        "woman",
        "human",
        "right",
        "internationally",
        "many",
        "year",
        "least",
        "since",
        "united",
        "nation",
        "officially",
        "formed",
        "cedaw",
        "adopted",
        "set",
        "international",
        "human",
        "right",
        "standard",
        "gender",
        "discrimination",
        "especially",
        "since",
        "s",
        "effort",
        "aided",
        "mass",
        "communication",
        "international",
        "travel",
        "internet",
        "rhode",
        "sanger",
        "international",
        "conference",
        "promoted",
        "dialogue",
        "exchange",
        "idea",
        "issue",
        "ranging",
        "honor",
        "killing",
        "labor",
        "law",
        "international",
        "group",
        "ngo",
        "governmentsponsored",
        "specifically",
        "focused",
        "often",
        "called",
        "woman",
        "issue",
        "violence",
        "woman",
        "girl",
        "woman",
        "economic",
        "viability",
        "woman",
        "health",
        "reproductive",
        "issue",
        "see",
        "eg",
        "link",
        "internet",
        "resource",
        "section",
        "crlp",
        "future",
        "without",
        "violence",
        "gendercide",
        "watch",
        "human",
        "right",
        "watch",
        "national",
        "network",
        "end",
        "domestic",
        "violence",
        "wild",
        "human",
        "right",
        "womenwatch",
        "collection",
        "data",
        "social",
        "scientist",
        "accurate",
        "inclusive",
        "ever",
        "history",
        "thus",
        "providing",
        "better",
        "foundation",
        "analysis",
        "finally",
        "collaborative",
        "research",
        "comparative",
        "analysis",
        "diverse",
        "legal",
        "system",
        "social",
        "custom",
        "increasing",
        "least",
        "thirty",
        "year",
        "virtually",
        "every",
        "society",
        "woman",
        "available",
        "engage",
        "effort",
        "men",
        "become",
        "interested",
        "see",
        "jain",
        "rhode",
        "sanger",
        "stark",
        "sen",
        "peter",
        "wolper",
        "beyond",
        "equal",
        "citizenship",
        "feminist",
        "jurisprudence",
        "also",
        "criticizes",
        "legal",
        "political",
        "structure",
        "would",
        "put",
        "disproportionate",
        "burden",
        "woman",
        "child",
        "seeking",
        "live",
        "become",
        "citizen",
        "country",
        "country",
        "origin",
        "feminist",
        "reveal",
        "asylum",
        "refugee",
        "policy",
        "may",
        "based",
        "male",
        "model",
        "constitutes",
        "persecution",
        "discounting",
        "form",
        "structural",
        "injustice",
        "disproportionately",
        "burden",
        "woman",
        "eg",
        "parekh",
        "freedman",
        "cumulative",
        "result",
        "effort",
        "globalize",
        "issue",
        "approach",
        "providing",
        "global",
        "perspective",
        "encourages",
        "condition",
        "favorable",
        "conceptual",
        "revision",
        "needed",
        "legal",
        "reform",
        "nation",
        "join",
        "sign",
        "international",
        "convention",
        "treaty",
        "increasingly",
        "include",
        "right",
        "woman",
        "feminist",
        "supplied",
        "foundation",
        "argue",
        "local",
        "law",
        "must",
        "comply",
        "international",
        "commitment",
        "example",
        "signing",
        "declaration",
        "elimination",
        "violence",
        "woman",
        "implies",
        "nation",
        "committed",
        "enacting",
        "enforcing",
        "law",
        "violence",
        "toward",
        "woman",
        "ratifying",
        "un",
        "declaration",
        "political",
        "civil",
        "right",
        "implies",
        "nation",
        "committed",
        "minimum",
        "universal",
        "suffrage",
        "generally",
        "equal",
        "citizenship",
        "becoming",
        "state",
        "party",
        "cedaw",
        "affirms",
        "support",
        "equal",
        "human",
        "right",
        "elimination",
        "form",
        "discrimination",
        "woman",
        "although",
        "number",
        "state",
        "expressed",
        "reservation",
        "acceptance",
        "cedaw",
        "u",
        "thus",
        "international",
        "law",
        "treaty",
        "commitment",
        "used",
        "argue",
        "national",
        "local",
        "legal",
        "reform",
        "schneider",
        "peter",
        "wolper",
        "yet",
        "even",
        "goal",
        "stated",
        "legal",
        "equality",
        "achieved",
        "law",
        "provides",
        "protection",
        "unless",
        "enforced",
        "feminist",
        "legal",
        "critic",
        "argued",
        "law",
        "treaty",
        "exist",
        "paper",
        "frequently",
        "ignored",
        "fact",
        "apply",
        "woman",
        "contradict",
        "local",
        "custom",
        "belief",
        "husseini",
        "mackinnon",
        "additional",
        "concern",
        "formal",
        "acceptance",
        "treaty",
        "may",
        "mask",
        "failure",
        "implement",
        "treaty",
        "requirement",
        "hathaway",
        "moreover",
        "meaning",
        "equal",
        "citizenship",
        "beyond",
        "equal",
        "political",
        "participation",
        "remains",
        "contested",
        "initial",
        "liberal",
        "feminist",
        "approach",
        "argue",
        "strictly",
        "formal",
        "equality",
        "deny",
        "sexual",
        "difference",
        "ever",
        "relevant",
        "legal",
        "doctrine",
        "strategy",
        "often",
        "called",
        "assimilation",
        "model",
        "effective",
        "strategy",
        "challenging",
        "overt",
        "legal",
        "restriction",
        "woman",
        "legally",
        "enforced",
        "exclusion",
        "taub",
        "williams",
        "smith",
        "bartlett",
        "kennedy",
        "example",
        "u",
        "feminist",
        "lawyer",
        "argued",
        "successfully",
        "statute",
        "treating",
        "woman",
        "differently",
        "purpose",
        "estate",
        "administration",
        "age",
        "majority",
        "violated",
        "constitutional",
        "equal",
        "protection",
        "following",
        "initial",
        "lead",
        "ruth",
        "bader",
        "ginsburg",
        "director",
        "aclu",
        "woman",
        "right",
        "project",
        "reed",
        "v",
        "reed",
        "us",
        "comprehensive",
        "approach",
        "u",
        "feminist",
        "seeking",
        "passage",
        "unsuccessful",
        "equal",
        "right",
        "amendment",
        "era",
        "constitution",
        "amendment",
        "would",
        "put",
        "sex",
        "fundamental",
        "legal",
        "footing",
        "race",
        "achievement",
        "equal",
        "citizenship",
        "viewed",
        "removal",
        "explicit",
        "legal",
        "barrier",
        "leaf",
        "open",
        "whether",
        "equality",
        "requires",
        "even",
        "united",
        "state",
        "much",
        "legal",
        "room",
        "remains",
        "continuing",
        "controversy",
        "effort",
        "establish",
        "full",
        "constitutional",
        "equal",
        "protection",
        "era",
        "foundered",
        "assertion",
        "difference",
        "matter",
        "issue",
        "diverse",
        "military",
        "service",
        "child",
        "support",
        "bathroom",
        "utilization",
        "mayeri",
        "frug",
        "argument",
        "fueled",
        "conservative",
        "opposition",
        "era",
        "issue",
        "raised",
        "different",
        "form",
        "feminist",
        "well",
        "feminist",
        "emphasizing",
        "class",
        "difference",
        "labor",
        "right",
        "concerned",
        "hardwon",
        "benefit",
        "woman",
        "could",
        "jeopardized",
        "critical",
        "race",
        "theorist",
        "concerned",
        "formal",
        "equality",
        "woman",
        "failed",
        "understand",
        "complex",
        "intersectionality",
        "discrimination",
        "woman",
        "color",
        "mayeri",
        "critic",
        "patriarchy",
        "insisted",
        "history",
        "discrimination",
        "central",
        "understanding",
        "functioning",
        "male",
        "norm",
        "social",
        "institution",
        "family",
        "employment",
        "political",
        "structure",
        "present",
        "u",
        "constitutional",
        "law",
        "equal",
        "protection",
        "requires",
        "sex",
        "category",
        "modeled",
        "strict",
        "scrutiny",
        "accorded",
        "race",
        "category",
        "sexual",
        "difference",
        "concretized",
        "law",
        "must",
        "pas",
        "level",
        "heightened",
        "scrutiny",
        "rationale",
        "garner",
        "constitutional",
        "acceptance",
        "across",
        "globe",
        "similar",
        "debate",
        "required",
        "beyond",
        "formal",
        "equality",
        "citizenship",
        "cedaw",
        "requirement",
        "elimination",
        "form",
        "discrimination",
        "woman",
        "framework",
        "debate",
        "iwrawap",
        "debate",
        "complicated",
        "however",
        "concern",
        "least",
        "certain",
        "way",
        "understanding",
        "human",
        "right",
        "norm",
        "incorporate",
        "socalled",
        "western",
        "value",
        "incompatible",
        "legitimate",
        "cultural",
        "difference",
        "whether",
        "theory",
        "right",
        "formulated",
        "manner",
        "accommodates",
        "cultural",
        "difference",
        "given",
        "considerable",
        "attention",
        "feminist",
        "political",
        "philosopher",
        "mookherjee",
        "ackerly",
        "centrally",
        "relevant",
        "understanding",
        "international",
        "human",
        "right",
        "norm",
        "role",
        "law"
    ]
}