{
    "main_text": "Feminist Criticism of Psychoanalysis\n2. Feminist Criticism of Psychoanalysis\n\nEven in Freud’s circle, not all analysts agreed with\nFreud’s assessment and there were debates concerning\nwomen’s sexuality and the roles of castration and penis envy\ntherein, notably among Karl Abraham, Ernest Jones, Helene Deutsch, and\nKaren Horney. Horney in particular argued for an inherent feminine\ndisposition that is not merely a secondary formation premised on\ncastration and she took issue with the ostensible effects of penis\nenvy and women’s supposed feelings of inferiority. As with some\nlater feminist criticisms of Freud, Horney attempted to retrieve\nfemale sexuality, and by extension a valid form of feminine existence,\nby appealing to a genuinely independent nature and holding culture\nculpable for women’s subordinate status. By thus reasserting the\nprimacy of biological and social forces, however, Horney disputes\nprecisely the idea that is central to Freud’s hypothesis and\nthat marks psychoanalysis as a unique field of inquiry, that of a\ndistinctive psychical realm of representation that is unconscious.\n\nSomewhat later, Simone de Beauvoir addressed the discourse of\npsychoanalysis in\nThe Second Sex (1949), devoting an early chapter to her\ndistrust of “The Psychoanalytic Point of View” (Beauvoir\n1949 [1989: 38–52]). Like Horney, Beauvoir denounces\nFreud’s idea that there is but one, masculine, libido and no\nfeminine libido with “its own original nature” (1949\n[1989: 39]). Freud, in her view, takes for granted what he needs to\naccount for, namely the value placed on virility. Beauvoir takes Freud\nto task for not considering the social origins of masculine and\npaternal power and privilege and deems his theory inadequate to\naccount for woman’s otherness. If women envy men, she argues, it\nis because of the social power and privilege they enjoy, and not\nbecause of anatomical superiority. Unlike the determinisms and\nobjectifications of human life offered by biological science (which\ntreats human beings as determinate objects in the natural world and\nthus not as free or self-determining subjects with agency), but\nsimilar to the “economic monism” of historical materialism\n(1949 [1989: 52]), psychoanalysis is characterized by Beauvoir as\n“sexual monism” (1949 [1989: 52]): everything in its\npurview is interpreted through a single lens. Beauvoir indicates at\nthe opening of the chapter that psychoanalysis offers a perspective\nwhich she does “not intend to criticize as a whole” (1949\n[1989: 38]), especially since it does understand that “no factor\nbecomes involved in the psychic life without having taken on human\nsignificance” (1949 [1989: 38]), but she questions both its\ndogmatic reliance on determinate elements of development and\nits “embarrassing flexibility on a basis of rigid\nconcepts” (1949 [1989: 38]). Most seriously, in Beauvoir’s\nview, psychoanalysis allots to women the same destiny of self-division\nand conflict between subjectivity and femininity that follows from\nsocial dictates and biological norms. Psychoanalysis presents the\ncharacteristics of femininity and subjectivity as divergent paths,\nincompatible with one another. Women might be able to be full persons,\nsubjects with agency, but only at the expense of their femininity; or\nthey can embark on the course of femininity, but only by sacrificing\ntheir independence and agency. This either/or between the\nmasculinization of subjectivity and the submission to femininity\nretains the moral, political, and metaphysical opposition between free\nself-creation and corporeal incarceration that precludes the\npossibility of being both a woman and a subject.\n\nBeauvoir alleges that psychoanalysis holds women to a fixed destiny, a\ndevelopmental and teleological life process, precisely insofar as it\ndefines subjects with reference to a past beyond their control. By\nassigning to women an essence or determinate identity, the\npsychoanalytic reliance on sexual categories once again renders woman\nas the other to a subject rather than a subject herself, and\nthereby denies her existential freedom. In Beauvoir’s view,\nhowever, if women are not themselves subjects, but that in contrast\nwith which men’s subjectivities are constituted, they are still\nfreely responsible for this situation, insofar as women collaborate in\nthis process by seeing themselves through the eyes of men, justifying\ntheir existence through their romantic relationships, and attempting\nto mirror men’s being. By casting women’s otherness as an\neffect not only of their social situation (with its power relations),\nbut also of their choices (and hence responsibility), Beauvoir\npreserves women’s freedom, unlike the psychoanalytic discourse\nthat she claims rejects “the idea of choice and the correlated\nconcept of value” (Beauvoir 1949 [1989: 45]).\n\nBeauvoir’s misgivings about Freud’s account of femininity\nstem from two sources, a feminist suspicion that women, in\npsychoanalytic discourse, are understood on the basis of a masculine\nmodel, and an existentialist conviction that human beings are\nself-defining, choosing themselves through their own actions.\nFollowing her existentialist convictions, Beauvoir insists that even\nwhen women abdicate their freedom, they do so as agents responsible\nfor their own destinies, not merely as passive victims following a\ndevelopmentally determined fate. Following her feminist convictions,\nBeauvoir recognizes that women’s choices may be constrained by\npowerful social and bodily forces, but insists that women nonetheless\nbear ultimate responsibility for realizing their own possibilities by\nemancipating themselves. Her reading of Freud is thus largely directed\nagainst the perceived determinism of psychoanalysis and less against\nthe idea of an unconscious per se, although she does want to defend\nthe notion of a unitary subject at the origin of choice, insisting\nthat “psychic life is not a mosaic, it is a single whole in\nevery one of its aspects and we must respect that unity”\n(Beauvoir 1949 [1989: 44]), a supposition that certainly limits the\naffinities between existentialism and psychoanalysis. Nonetheless,\nBeauvoir’s dispute with Freud appears to be less about whether\nconstraint is part of our being in the world, and more about where\nthat constraint is located: psychoanalysis locates constraint\ninternally, in the constitution of the psyche itself, not only in the\nsituations of social life, whereas Beauvoir locates it externally, in\nthe cultural forces that impact even the most intimate sense of our\nown agency. Beauvoir thus claims that her own interpretations of\nwomen’s femininity will disclose women in their liberty,\noriented freely by the future and not simply explained by a past. She\nthereby ratifies the promise of existentialism for feminism.\n\nBeauvoir’s own project of elucidating the paradoxical relation\nbetween femininity and subjectivity is nonetheless influenced by\npsychoanalytic concepts and appropriates its theoretical insights in\nvarious ways. The Second Sex highlights the practices by\nwhich women become women through their appropriation of bodily\n(sexual) difference, as well as the manner in which a human being\ngenerally is limited and compelled by bodily and unconscious forces.\nIndeed Beauvoir and Freud seem to agree that one is not born but\nbecomes a woman, i.e., that femininity involves some sort of (social\nor psychical) process rather than a biological or natural given. Both\nare interested in the ‘how’ of this process, how one\nbecomes a woman, although, as discussed above, they disagree about\nwhat this ‘how’ is. Moreover, in her articulation of\nwomen’s ambivalent attitudes toward embodiment, sexuality, and\nmaternity, Beauvoir is clearly indebted to the attention\npsychoanalytic practice gives to listening to women’s first\nperson narratives, interpreting the emotional impact of events that\ncan not be easily categorized, and heeding attachments that carry both\naffection and resentment. Like Freud, Beauvoir recognizes that we are\nembodied as sexual beings and that our bodies not only testify to our\nown finitude and limits but also matter as sites of encounters with\nothers, encounters that are multivalent—including loving\nconnections and threatening defenses, moments of affirmation and of\ndissolution. Beauvoir refuses any political program that demands we\ndeny our bodily possibilities in order to be fully human and proclaims\nthat bodies and bodily difference are integral to projects of\nselfhood, and not merely accidental contingencies of a rational and\ndisembodied mind. For Beauvoir, as for Freud, there is no such thing\nas a disembodied, non-sexed human being; any ideal of the human apart\nfrom sexual identity or difference is an abstraction that can only be\naffirmed on the basis of a mind/body dualism. Femininity for her is\nnot merely a mystification that imprisons women’s subjectivity\n(even if its social construal has had this effect). Finally, like\nFreud, Beauvoir is fully aware of the impact on children of their\ndomestic situation, the way familial life resonates with meaning that\ninforms not only intimate relations but relations to the larger\nworld.\n\nBeauvoir’s portrayal of living a feminine existence, of sexual\ndifference as an embodied situation, developed through a series of\nphenomenological descriptions, tries to understand how women have been\ncast as other in the drama of masculine subjectivity and doubts the\npremise that this is an historical event, occurring at some definitive\npoint in time. Beauvoir herself has often been (mis)read in a way\nanalogous to her (mis)reading of psychoanalysis, as proferring a\ndeterminate succession of experiences for women, rather than\ndescribing socially extant processes. But The Second Sex\ndepicts the effects on women’s character of inequitable social\narrangements; it neither proffers a normalized destiny for women nor\npresupposes a common metaphysical identity. Even so, in many ways\nBeauvoir’s work is more easily aligned with the sociologically\noriented Anglo-American feminists than with Irigaray and Kristeva.\n",
    "section_title": "2. Feminist Criticism of Psychoanalysis",
    "entry_title": "Psychoanalytic Feminism",
    "hierarchy_title": "Psychoanalytic Feminism || Feminist Criticism of Psychoanalysis",
    "tokenized_text": [
        "feminist",
        "criticism",
        "psychoanalysis",
        "feminist",
        "criticism",
        "psychoanalysis",
        "even",
        "freud",
        "circle",
        "analyst",
        "agreed",
        "freud",
        "assessment",
        "debate",
        "concerning",
        "woman",
        "sexuality",
        "role",
        "castration",
        "penis",
        "envy",
        "therein",
        "notably",
        "among",
        "karl",
        "abraham",
        "ernest",
        "jones",
        "helene",
        "deutsch",
        "karen",
        "horney",
        "horney",
        "particular",
        "argued",
        "inherent",
        "feminine",
        "disposition",
        "merely",
        "secondary",
        "formation",
        "premised",
        "castration",
        "took",
        "issue",
        "ostensible",
        "effect",
        "penis",
        "envy",
        "woman",
        "supposed",
        "feeling",
        "inferiority",
        "later",
        "feminist",
        "criticism",
        "freud",
        "horney",
        "attempted",
        "retrieve",
        "female",
        "sexuality",
        "extension",
        "valid",
        "form",
        "feminine",
        "existence",
        "appealing",
        "genuinely",
        "independent",
        "nature",
        "holding",
        "culture",
        "culpable",
        "woman",
        "subordinate",
        "status",
        "thus",
        "reasserting",
        "primacy",
        "biological",
        "social",
        "force",
        "however",
        "horney",
        "dispute",
        "precisely",
        "idea",
        "central",
        "freud",
        "hypothesis",
        "mark",
        "psychoanalysis",
        "unique",
        "field",
        "inquiry",
        "distinctive",
        "psychical",
        "realm",
        "representation",
        "unconscious",
        "somewhat",
        "later",
        "simone",
        "de",
        "beauvoir",
        "addressed",
        "discourse",
        "psychoanalysis",
        "second",
        "sex",
        "devoting",
        "early",
        "chapter",
        "distrust",
        "psychoanalytic",
        "point",
        "view",
        "beauvoir",
        "like",
        "horney",
        "beauvoir",
        "denounces",
        "freud",
        "idea",
        "one",
        "masculine",
        "libido",
        "feminine",
        "libido",
        "original",
        "nature",
        "freud",
        "view",
        "take",
        "granted",
        "need",
        "account",
        "namely",
        "value",
        "placed",
        "virility",
        "beauvoir",
        "take",
        "freud",
        "task",
        "considering",
        "social",
        "origin",
        "masculine",
        "paternal",
        "power",
        "privilege",
        "deems",
        "theory",
        "inadequate",
        "account",
        "woman",
        "otherness",
        "woman",
        "envy",
        "men",
        "argues",
        "social",
        "power",
        "privilege",
        "enjoy",
        "anatomical",
        "superiority",
        "unlike",
        "determinism",
        "objectification",
        "human",
        "life",
        "offered",
        "biological",
        "science",
        "treat",
        "human",
        "being",
        "determinate",
        "object",
        "natural",
        "world",
        "thus",
        "free",
        "selfdetermining",
        "subject",
        "agency",
        "similar",
        "economic",
        "monism",
        "historical",
        "materialism",
        "psychoanalysis",
        "characterized",
        "beauvoir",
        "sexual",
        "monism",
        "everything",
        "purview",
        "interpreted",
        "single",
        "lens",
        "beauvoir",
        "indicates",
        "opening",
        "chapter",
        "psychoanalysis",
        "offer",
        "perspective",
        "intend",
        "criticize",
        "whole",
        "especially",
        "since",
        "understand",
        "factor",
        "becomes",
        "involved",
        "psychic",
        "life",
        "without",
        "taken",
        "human",
        "significance",
        "question",
        "dogmatic",
        "reliance",
        "determinate",
        "element",
        "development",
        "embarrassing",
        "flexibility",
        "basis",
        "rigid",
        "concept",
        "seriously",
        "beauvoir",
        "view",
        "psychoanalysis",
        "allots",
        "woman",
        "destiny",
        "selfdivision",
        "conflict",
        "subjectivity",
        "femininity",
        "follows",
        "social",
        "dictate",
        "biological",
        "norm",
        "psychoanalysis",
        "present",
        "characteristic",
        "femininity",
        "subjectivity",
        "divergent",
        "path",
        "incompatible",
        "one",
        "another",
        "woman",
        "might",
        "able",
        "full",
        "person",
        "subject",
        "agency",
        "expense",
        "femininity",
        "embark",
        "course",
        "femininity",
        "sacrificing",
        "independence",
        "agency",
        "eitheror",
        "masculinization",
        "subjectivity",
        "submission",
        "femininity",
        "retains",
        "moral",
        "political",
        "metaphysical",
        "opposition",
        "free",
        "selfcreation",
        "corporeal",
        "incarceration",
        "precludes",
        "possibility",
        "woman",
        "subject",
        "beauvoir",
        "alleges",
        "psychoanalysis",
        "hold",
        "woman",
        "fixed",
        "destiny",
        "developmental",
        "teleological",
        "life",
        "process",
        "precisely",
        "insofar",
        "defines",
        "subject",
        "reference",
        "past",
        "beyond",
        "control",
        "assigning",
        "woman",
        "essence",
        "determinate",
        "identity",
        "psychoanalytic",
        "reliance",
        "sexual",
        "category",
        "render",
        "woman",
        "subject",
        "rather",
        "subject",
        "thereby",
        "denies",
        "existential",
        "freedom",
        "beauvoir",
        "view",
        "however",
        "woman",
        "subject",
        "contrast",
        "men",
        "subjectivity",
        "constituted",
        "still",
        "freely",
        "responsible",
        "situation",
        "insofar",
        "woman",
        "collaborate",
        "process",
        "seeing",
        "eye",
        "men",
        "justifying",
        "existence",
        "romantic",
        "relationship",
        "attempting",
        "mirror",
        "men",
        "casting",
        "woman",
        "otherness",
        "effect",
        "social",
        "situation",
        "power",
        "relation",
        "also",
        "choice",
        "hence",
        "responsibility",
        "beauvoir",
        "preserve",
        "woman",
        "freedom",
        "unlike",
        "psychoanalytic",
        "discourse",
        "claim",
        "reject",
        "idea",
        "choice",
        "correlated",
        "concept",
        "value",
        "beauvoir",
        "beauvoir",
        "misgiving",
        "freud",
        "account",
        "femininity",
        "stem",
        "two",
        "source",
        "feminist",
        "suspicion",
        "woman",
        "psychoanalytic",
        "discourse",
        "understood",
        "basis",
        "masculine",
        "model",
        "existentialist",
        "conviction",
        "human",
        "being",
        "selfdefining",
        "choosing",
        "action",
        "following",
        "existentialist",
        "conviction",
        "beauvoir",
        "insists",
        "even",
        "woman",
        "abdicate",
        "freedom",
        "agent",
        "responsible",
        "destiny",
        "merely",
        "passive",
        "victim",
        "following",
        "developmentally",
        "determined",
        "fate",
        "following",
        "feminist",
        "conviction",
        "beauvoir",
        "recognizes",
        "woman",
        "choice",
        "may",
        "constrained",
        "powerful",
        "social",
        "bodily",
        "force",
        "insists",
        "woman",
        "nonetheless",
        "bear",
        "ultimate",
        "responsibility",
        "realizing",
        "possibility",
        "emancipating",
        "reading",
        "freud",
        "thus",
        "largely",
        "directed",
        "perceived",
        "determinism",
        "psychoanalysis",
        "le",
        "idea",
        "unconscious",
        "per",
        "se",
        "although",
        "want",
        "defend",
        "notion",
        "unitary",
        "subject",
        "origin",
        "choice",
        "insisting",
        "psychic",
        "life",
        "mosaic",
        "single",
        "whole",
        "every",
        "one",
        "aspect",
        "must",
        "respect",
        "unity",
        "beauvoir",
        "supposition",
        "certainly",
        "limit",
        "affinity",
        "existentialism",
        "psychoanalysis",
        "nonetheless",
        "beauvoir",
        "dispute",
        "freud",
        "appears",
        "le",
        "whether",
        "constraint",
        "part",
        "world",
        "constraint",
        "located",
        "psychoanalysis",
        "locates",
        "constraint",
        "internally",
        "constitution",
        "psyche",
        "situation",
        "social",
        "life",
        "whereas",
        "beauvoir",
        "locates",
        "externally",
        "cultural",
        "force",
        "impact",
        "even",
        "intimate",
        "sense",
        "agency",
        "beauvoir",
        "thus",
        "claim",
        "interpretation",
        "woman",
        "femininity",
        "disclose",
        "woman",
        "liberty",
        "oriented",
        "freely",
        "future",
        "simply",
        "explained",
        "past",
        "thereby",
        "ratifies",
        "promise",
        "existentialism",
        "feminism",
        "beauvoir",
        "project",
        "elucidating",
        "paradoxical",
        "relation",
        "femininity",
        "subjectivity",
        "nonetheless",
        "influenced",
        "psychoanalytic",
        "concept",
        "appropriates",
        "theoretical",
        "insight",
        "various",
        "way",
        "second",
        "sex",
        "highlight",
        "practice",
        "woman",
        "become",
        "woman",
        "appropriation",
        "bodily",
        "sexual",
        "difference",
        "well",
        "manner",
        "human",
        "generally",
        "limited",
        "compelled",
        "bodily",
        "unconscious",
        "force",
        "indeed",
        "beauvoir",
        "freud",
        "seem",
        "agree",
        "one",
        "born",
        "becomes",
        "woman",
        "ie",
        "femininity",
        "involves",
        "sort",
        "social",
        "psychical",
        "process",
        "rather",
        "biological",
        "natural",
        "given",
        "interested",
        "process",
        "one",
        "becomes",
        "woman",
        "although",
        "discussed",
        "disagree",
        "moreover",
        "articulation",
        "woman",
        "ambivalent",
        "attitude",
        "toward",
        "embodiment",
        "sexuality",
        "maternity",
        "beauvoir",
        "clearly",
        "indebted",
        "attention",
        "psychoanalytic",
        "practice",
        "give",
        "listening",
        "woman",
        "first",
        "person",
        "narrative",
        "interpreting",
        "emotional",
        "impact",
        "event",
        "easily",
        "categorized",
        "heeding",
        "attachment",
        "carry",
        "affection",
        "resentment",
        "like",
        "freud",
        "beauvoir",
        "recognizes",
        "embodied",
        "sexual",
        "being",
        "body",
        "testify",
        "finitude",
        "limit",
        "also",
        "matter",
        "site",
        "encounter",
        "others",
        "encounter",
        "multivalentincluding",
        "loving",
        "connection",
        "threatening",
        "defense",
        "moment",
        "affirmation",
        "dissolution",
        "beauvoir",
        "refuse",
        "political",
        "program",
        "demand",
        "deny",
        "bodily",
        "possibility",
        "order",
        "fully",
        "human",
        "proclaims",
        "body",
        "bodily",
        "difference",
        "integral",
        "project",
        "selfhood",
        "merely",
        "accidental",
        "contingency",
        "rational",
        "disembodied",
        "mind",
        "beauvoir",
        "freud",
        "thing",
        "disembodied",
        "nonsexed",
        "human",
        "ideal",
        "human",
        "apart",
        "sexual",
        "identity",
        "difference",
        "abstraction",
        "affirmed",
        "basis",
        "mindbody",
        "dualism",
        "femininity",
        "merely",
        "mystification",
        "imprisons",
        "woman",
        "subjectivity",
        "even",
        "social",
        "construal",
        "effect",
        "finally",
        "like",
        "freud",
        "beauvoir",
        "fully",
        "aware",
        "impact",
        "child",
        "domestic",
        "situation",
        "way",
        "familial",
        "life",
        "resonates",
        "meaning",
        "informs",
        "intimate",
        "relation",
        "relation",
        "larger",
        "world",
        "beauvoir",
        "portrayal",
        "living",
        "feminine",
        "existence",
        "sexual",
        "difference",
        "embodied",
        "situation",
        "developed",
        "series",
        "phenomenological",
        "description",
        "try",
        "understand",
        "woman",
        "cast",
        "drama",
        "masculine",
        "subjectivity",
        "doubt",
        "premise",
        "historical",
        "event",
        "occurring",
        "definitive",
        "point",
        "time",
        "beauvoir",
        "often",
        "mi",
        "read",
        "way",
        "analogous",
        "mi",
        "reading",
        "psychoanalysis",
        "proferring",
        "determinate",
        "succession",
        "experience",
        "woman",
        "rather",
        "describing",
        "socially",
        "extant",
        "process",
        "second",
        "sex",
        "depicts",
        "effect",
        "woman",
        "character",
        "inequitable",
        "social",
        "arrangement",
        "neither",
        "proffer",
        "normalized",
        "destiny",
        "woman",
        "presupposes",
        "common",
        "metaphysical",
        "identity",
        "even",
        "many",
        "way",
        "beauvoir",
        "work",
        "easily",
        "aligned",
        "sociologically",
        "oriented",
        "angloamerican",
        "feminist",
        "irigaray",
        "kristeva"
    ]
}