{
    "main_text": "Responsibility || Responsibility for Resisting One’s Own Oppression; Victim-blaming\n3.5 Responsibility for Resisting One’s Own Oppression; Victim-blaming\n\nAre the oppressed responsible for contributing to their own oppression\nby not resisting it?\n\nNot only men, but women contribute to women’s oppression, not by\ndirectly causing it, but by sustaining it through their attitudes and\nbehavior. “Right-wing” women are those whose lifestyles\nlargely reflect right-wing values, and for the reason that they\nbelieve that women belong in stereotypical roles (Superson 1993). They\npossess the same attitudes about women as do sexist men. This\nconception excludes women who on occasion engage in right-wing\nbehavior, for reasons other than because they believe women ought to\nadopt stereotypical roles. The property of being right-wing can more\nor less reflect prevalent sexist stereotypes. Many right-wing women\nhave deformed desires (see Section 2). Other women who neither endorse\npatriarchal values nor have deformed desires choose roles that when\nenough other women also choose them, perpetuate sexist stereotypes\nabout women and thereby contribute to their own oppression. Are such\nwomen responsible and/or blameworthy for contributing to their own\noppression? On the one hand, sexist behavior, no matter who causes it,\nsustains women’s oppression and harms women, so we might want to\nhold responsible and blame these women for their participation in the\nsystem. On the other hand, blaming women for their own oppression\nseems to blame the victim.\n\nFeminists are divided over whether women are responsible and/or\nblameworthy for contributing to their own oppression. Some believe\nthat women’s strong indoctrination into patriarchal beliefs and\nvalues makes it likely that they would come to have them (Bartky\n1999a; Luker 1984; Nussbaum 1999a; Superson 1993). For example, some\nreligious, particularly Christian, right-wing women adopt and act on\npatriarchal values because they believe this is the way things ought\nto be as part of God’s plan, while some secular right-wing women\nadopt patriarchal values because they believe that oppression is\nunalterable and that conformity is their best option. Some feminists\nbelieve that such right-wing women fail completely to understand\nfeminism, and fail to see that their choice of lifestyle limits their\nchoices even further (Superson 1993). Blaming entails judging the one\nblamed as morally remiss. But if women really do not understand\nfeminism and fail to see that their choice of lifestyle is\nnon-liberating, these feminists find it as inappropriate to blame or\nhold responsible women for their role in their own oppression as it is\nto blame or hold responsible rape victims for rape who play no moral\nrole in their own harm.\n\nYet other feminists might blame or hold responsible women who do not\nresist their own oppression. Some argue that women have an obligation\nto resist their own oppression, at least under certain conditions, and\nso are responsible for resisting. Carol Hay responds to the view that\nwomen’s having an obligation to resist their own oppression\nunfairly restricts their choices and blames the victim (2005). Hay\nacknowledges that both external and internal forces of patriarchy,\nincluding deformed desires, often restrict a woman’s autonomy,\nbut argues that this is not a sufficient reason not to require women\nto resist their oppression. She believes that women under patriarchy\nhave a fair degree of autonomy, and that autonomy is a necessary\ncondition for the possibility of moral obligation, which in turn is at\nleast partially constitutive of moral agency (105). She accepts as a\ngeneral principle that we should hold agents responsible only for\nactions that are undertaken autonomously: if the agent has no\nautonomy, she has no obligation, and if the agent is fully autonomous,\nshe is fully subject to all possible moral obligations that might\nexist in a situation (99). Hay also believes that it is unfair to\nrequire moral obligations of someone who is incapable of fulfilling\nthem. But she believes that demanding more responsibility of someone\nwho is capable of fulfilling their moral obligations because they have\nat least some degree of autonomy might end up increasing their\nautonomy. This is the case, Hay believes, for women under patriarchy.\nHay acknowledges that it may be unfair to burden women with an\nobligation to resist their oppression, but believes that women’s\nfulfilling this obligation is essential to eliminating patriarchy in\naddition to increasing their autonomy. Indeed, she believes that this\nincreased burden is yet another reason to eliminate patriarchy\n(104–105). Hay notes that whether a woman is in fact obligated\nto resist her oppression in a particular instance of sexism (e.g.,\nconfronting a sexual harasser) depends on the danger involved in doing\nso: when the risk of harm to herself is significant, she is free from\nthe obligation.\n\nAnn Cudd also argues that women have an obligation to resist their own\noppression. She takes up the case where women understand their\noppression and are not under the sway of deformed desires, and where\noppression is not so pervasive that it is impossible or seriously\nrisky to resist it (2006). She offers the case of Larry and Lisa, a\ncouple who agrees that it is best if one of them assumes most of the\nchildrearing duties. Given the existing gender wage gap, the couple\nreasons that it is rational for them to choose that Lisa opt out of\nthe paid labor force and raise the children. But her doing so, when\nenough other women do so as well, lends strength and stability to\nwomen’s oppression because it makes employers perceive women as\nunreliable wage workers, which feeds the very stereotypical image that\ncreates the gender wage gap in the first place (199). Further,\nLisa’s participating in a sexist division of labor increases the\nexpectation that other women will do the same. Cudd argues that Lisa\nneeds to weigh the benefit of the economic gain her family can expect\nif Larry is the wage worker against the harm caused by perpetuation of\nthe stereotype of women as primarily domestic workers and unreliable\nwage workers, and then do the least undeserved harm. Women like Lisa\nhave an obligation to sacrifice their immediate wants for a long-term\nvision of a better future (188). Cudd argues further that requiring\nthe oppressed to resist their oppression is not a case of wrongful\nblaming of the victim; rather, it is like the case of a person who\nsuffers a superficial cut by someone’s careless use of sharp\nscissors, but who is to blame for some of the harm if he loses his\nhand to gangrene because he refuses to wash and care for the cut. Both\nvictims participate in some way in the harm they suffer, even though\nneither is the initial cause of the harm.\n\nIn contrast to feminists who defend an obligation to resist\noppression, Daniel Silvermint examines the phenomenon of\n“passing as privileged” as a way to navigate one’s\noppression so as to promote one’s well-being. Silvermint\ndescribes “passing as privileged” as occurring “when\na member of an oppressed, stigmatized, or otherwise\ndiscriminated-against group x is passively or actively\nperceived to be a member of a privileged group y, thereby\nescaping the unjust barriers and burdens that come with being\nidentified as an x and/or accessing the advantages that come\nwith being (mis)identified as a y” (Silvermint 2018,\n6). He is concerned mainly with “active passing,” which is\na strategy used to create or avoid the perception of a certain kind of\nperson, such as when an immigrant family Anglicizes their last name in\norder to hide their naturalized status (3). His concern is whether a\nvictim of oppression ought to pass as a non-victim when they can\nsuccessfully do so.\n\nAccording to Silvermint, passing and resisting one’s oppression\nshare the aim that they are both ways to improve one’s life or\ncircumstances in the face of oppression (38). The main difference he\nsees between them is that persons who resist in various ways attempt\nto improve their well-being by undermining, changing, or escaping the\noppressive system that constrains their well-being, while persons who\nengage in passing as a member of a privileged group act in ways that\nsustain those constraints while attempting to exploit the way in which\nthey are distributed so as to avoid being constrained by them.\nEssentially, the latter make a trade-off between two valuable\nconstituents of their well-being, both of which cannot simultaneously\nbe promoted under oppression. For example, a trans woman might pass as\na cis-gender woman in order to avoid physical violence; a victim of\nstereotype threat might pass as a confident professional in order to\nsucceed (31); and a queer femme might pass as a cis-gender woman by\navoiding holding hands with her girlfriend in order to ward off an\ninsensitive co-worker (11). But unlike classic resisters, persons who\nengage in passing leave intact rather than challenge the very system\nthat harms them. Silvermint likens them to the teenager who is bullied\nand comes to school dressed like his bullies and engages in behavior\nsimilar to them and eventually gets accepted by them. Silvermint takes\nissue with three main arguments that passing is morally wrong, namely,\nthat it compromises the agent’s authenticity, that it involves\ndeception, and that it harms fellow victims by reinforcing\nstereotypes. He instead defends the view that passing is a permissible\nform of self-regarding complicity on the grounds that persons who\nengage in passing are not responsible for being victims of oppression\nand are navigating their circumstances in the best way they can in\norder to promote their well-being (40).\n",
    "section_title": "3.5 Responsibility for Resisting One’s Own Oppression; Victim-blaming",
    "entry_title": "Feminist Moral Psychology",
    "hierarchy_title": "Feminist Moral Psychology || Responsibility || Responsibility for Resisting One’s Own Oppression; Victim-blaming",
    "tokenized_text": [
        "responsibility",
        "responsibility",
        "resisting",
        "one",
        "oppression",
        "victimblaming",
        "responsibility",
        "resisting",
        "one",
        "oppression",
        "victimblaming",
        "oppressed",
        "responsible",
        "contributing",
        "oppression",
        "resisting",
        "men",
        "woman",
        "contribute",
        "woman",
        "oppression",
        "directly",
        "causing",
        "sustaining",
        "attitude",
        "behavior",
        "rightwing",
        "woman",
        "whose",
        "lifestyle",
        "largely",
        "reflect",
        "rightwing",
        "value",
        "reason",
        "believe",
        "woman",
        "belong",
        "stereotypical",
        "role",
        "superson",
        "posse",
        "attitude",
        "woman",
        "sexist",
        "men",
        "conception",
        "excludes",
        "woman",
        "occasion",
        "engage",
        "rightwing",
        "behavior",
        "reason",
        "believe",
        "woman",
        "ought",
        "adopt",
        "stereotypical",
        "role",
        "property",
        "rightwing",
        "le",
        "reflect",
        "prevalent",
        "sexist",
        "stereotype",
        "many",
        "rightwing",
        "woman",
        "deformed",
        "desire",
        "see",
        "section",
        "woman",
        "neither",
        "endorse",
        "patriarchal",
        "value",
        "deformed",
        "desire",
        "choose",
        "role",
        "enough",
        "woman",
        "also",
        "choose",
        "perpetuate",
        "sexist",
        "stereotype",
        "woman",
        "thereby",
        "contribute",
        "oppression",
        "woman",
        "responsible",
        "andor",
        "blameworthy",
        "contributing",
        "oppression",
        "one",
        "hand",
        "sexist",
        "behavior",
        "matter",
        "cause",
        "sustains",
        "woman",
        "oppression",
        "harm",
        "woman",
        "might",
        "want",
        "hold",
        "responsible",
        "blame",
        "woman",
        "participation",
        "system",
        "hand",
        "blaming",
        "woman",
        "oppression",
        "seems",
        "blame",
        "victim",
        "feminist",
        "divided",
        "whether",
        "woman",
        "responsible",
        "andor",
        "blameworthy",
        "contributing",
        "oppression",
        "believe",
        "woman",
        "strong",
        "indoctrination",
        "patriarchal",
        "belief",
        "value",
        "make",
        "likely",
        "would",
        "come",
        "bartky",
        "a",
        "luker",
        "nussbaum",
        "a",
        "superson",
        "example",
        "religious",
        "particularly",
        "christian",
        "rightwing",
        "woman",
        "adopt",
        "act",
        "patriarchal",
        "value",
        "believe",
        "way",
        "thing",
        "ought",
        "part",
        "god",
        "plan",
        "secular",
        "rightwing",
        "woman",
        "adopt",
        "patriarchal",
        "value",
        "believe",
        "oppression",
        "unalterable",
        "conformity",
        "best",
        "option",
        "feminist",
        "believe",
        "rightwing",
        "woman",
        "fail",
        "completely",
        "understand",
        "feminism",
        "fail",
        "see",
        "choice",
        "lifestyle",
        "limit",
        "choice",
        "even",
        "superson",
        "blaming",
        "entail",
        "judging",
        "one",
        "blamed",
        "morally",
        "remiss",
        "woman",
        "really",
        "understand",
        "feminism",
        "fail",
        "see",
        "choice",
        "lifestyle",
        "nonliberating",
        "feminist",
        "find",
        "inappropriate",
        "blame",
        "hold",
        "responsible",
        "woman",
        "role",
        "oppression",
        "blame",
        "hold",
        "responsible",
        "rape",
        "victim",
        "rape",
        "play",
        "moral",
        "role",
        "harm",
        "yet",
        "feminist",
        "might",
        "blame",
        "hold",
        "responsible",
        "woman",
        "resist",
        "oppression",
        "argue",
        "woman",
        "obligation",
        "resist",
        "oppression",
        "least",
        "certain",
        "condition",
        "responsible",
        "resisting",
        "carol",
        "hay",
        "responds",
        "view",
        "woman",
        "obligation",
        "resist",
        "oppression",
        "unfairly",
        "restricts",
        "choice",
        "blame",
        "victim",
        "hay",
        "acknowledges",
        "external",
        "internal",
        "force",
        "patriarchy",
        "including",
        "deformed",
        "desire",
        "often",
        "restrict",
        "woman",
        "autonomy",
        "argues",
        "sufficient",
        "reason",
        "require",
        "woman",
        "resist",
        "oppression",
        "belief",
        "woman",
        "patriarchy",
        "fair",
        "degree",
        "autonomy",
        "autonomy",
        "necessary",
        "condition",
        "possibility",
        "moral",
        "obligation",
        "turn",
        "least",
        "partially",
        "constitutive",
        "moral",
        "agency",
        "accepts",
        "general",
        "principle",
        "hold",
        "agent",
        "responsible",
        "action",
        "undertaken",
        "autonomously",
        "agent",
        "autonomy",
        "obligation",
        "agent",
        "fully",
        "autonomous",
        "fully",
        "subject",
        "possible",
        "moral",
        "obligation",
        "might",
        "exist",
        "situation",
        "hay",
        "also",
        "belief",
        "unfair",
        "require",
        "moral",
        "obligation",
        "someone",
        "incapable",
        "fulfilling",
        "belief",
        "demanding",
        "responsibility",
        "someone",
        "capable",
        "fulfilling",
        "moral",
        "obligation",
        "least",
        "degree",
        "autonomy",
        "might",
        "end",
        "increasing",
        "autonomy",
        "case",
        "hay",
        "belief",
        "woman",
        "patriarchy",
        "hay",
        "acknowledges",
        "may",
        "unfair",
        "burden",
        "woman",
        "obligation",
        "resist",
        "oppression",
        "belief",
        "woman",
        "fulfilling",
        "obligation",
        "essential",
        "eliminating",
        "patriarchy",
        "addition",
        "increasing",
        "autonomy",
        "indeed",
        "belief",
        "increased",
        "burden",
        "yet",
        "another",
        "reason",
        "eliminate",
        "patriarchy",
        "hay",
        "note",
        "whether",
        "woman",
        "fact",
        "obligated",
        "resist",
        "oppression",
        "particular",
        "instance",
        "sexism",
        "eg",
        "confronting",
        "sexual",
        "harasser",
        "depends",
        "danger",
        "involved",
        "risk",
        "harm",
        "significant",
        "free",
        "obligation",
        "ann",
        "cudd",
        "also",
        "argues",
        "woman",
        "obligation",
        "resist",
        "oppression",
        "take",
        "case",
        "woman",
        "understand",
        "oppression",
        "sway",
        "deformed",
        "desire",
        "oppression",
        "pervasive",
        "impossible",
        "seriously",
        "risky",
        "resist",
        "offer",
        "case",
        "larry",
        "lisa",
        "couple",
        "agrees",
        "best",
        "one",
        "assumes",
        "childrearing",
        "duty",
        "given",
        "existing",
        "gender",
        "wage",
        "gap",
        "couple",
        "reason",
        "rational",
        "choose",
        "lisa",
        "opt",
        "paid",
        "labor",
        "force",
        "raise",
        "child",
        "enough",
        "woman",
        "well",
        "lends",
        "strength",
        "stability",
        "woman",
        "oppression",
        "make",
        "employer",
        "perceive",
        "woman",
        "unreliable",
        "wage",
        "worker",
        "feed",
        "stereotypical",
        "image",
        "creates",
        "gender",
        "wage",
        "gap",
        "first",
        "place",
        "lisa",
        "participating",
        "sexist",
        "division",
        "labor",
        "increase",
        "expectation",
        "woman",
        "cudd",
        "argues",
        "lisa",
        "need",
        "weigh",
        "benefit",
        "economic",
        "gain",
        "family",
        "expect",
        "larry",
        "wage",
        "worker",
        "harm",
        "caused",
        "perpetuation",
        "stereotype",
        "woman",
        "primarily",
        "domestic",
        "worker",
        "unreliable",
        "wage",
        "worker",
        "least",
        "undeserved",
        "harm",
        "woman",
        "like",
        "lisa",
        "obligation",
        "sacrifice",
        "immediate",
        "want",
        "longterm",
        "vision",
        "better",
        "future",
        "cudd",
        "argues",
        "requiring",
        "oppressed",
        "resist",
        "oppression",
        "case",
        "wrongful",
        "blaming",
        "victim",
        "rather",
        "like",
        "case",
        "person",
        "suffers",
        "superficial",
        "cut",
        "someone",
        "careless",
        "use",
        "sharp",
        "scissors",
        "blame",
        "harm",
        "loses",
        "hand",
        "gangrene",
        "refuse",
        "wash",
        "care",
        "cut",
        "victim",
        "participate",
        "way",
        "harm",
        "suffer",
        "even",
        "though",
        "neither",
        "initial",
        "cause",
        "harm",
        "contrast",
        "feminist",
        "defend",
        "obligation",
        "resist",
        "oppression",
        "daniel",
        "silvermint",
        "examines",
        "phenomenon",
        "passing",
        "privileged",
        "way",
        "navigate",
        "one",
        "oppression",
        "promote",
        "one",
        "wellbeing",
        "silvermint",
        "describes",
        "passing",
        "privileged",
        "occurring",
        "member",
        "oppressed",
        "stigmatized",
        "otherwise",
        "discriminatedagainst",
        "group",
        "x",
        "passively",
        "actively",
        "perceived",
        "member",
        "privileged",
        "group",
        "thereby",
        "escaping",
        "unjust",
        "barrier",
        "burden",
        "come",
        "identified",
        "x",
        "andor",
        "accessing",
        "advantage",
        "come",
        "mi",
        "identified",
        "silvermint",
        "concerned",
        "mainly",
        "active",
        "passing",
        "strategy",
        "used",
        "create",
        "avoid",
        "perception",
        "certain",
        "kind",
        "person",
        "immigrant",
        "family",
        "anglicizes",
        "last",
        "name",
        "order",
        "hide",
        "naturalized",
        "status",
        "concern",
        "whether",
        "victim",
        "oppression",
        "ought",
        "pas",
        "nonvictim",
        "successfully",
        "according",
        "silvermint",
        "passing",
        "resisting",
        "one",
        "oppression",
        "share",
        "aim",
        "way",
        "improve",
        "one",
        "life",
        "circumstance",
        "face",
        "oppression",
        "main",
        "difference",
        "see",
        "person",
        "resist",
        "various",
        "way",
        "attempt",
        "improve",
        "wellbeing",
        "undermining",
        "changing",
        "escaping",
        "oppressive",
        "system",
        "constrains",
        "wellbeing",
        "person",
        "engage",
        "passing",
        "member",
        "privileged",
        "group",
        "act",
        "way",
        "sustain",
        "constraint",
        "attempting",
        "exploit",
        "way",
        "distributed",
        "avoid",
        "constrained",
        "essentially",
        "latter",
        "make",
        "tradeoff",
        "two",
        "valuable",
        "constituent",
        "wellbeing",
        "simultaneously",
        "promoted",
        "oppression",
        "example",
        "trans",
        "woman",
        "might",
        "pas",
        "cisgender",
        "woman",
        "order",
        "avoid",
        "physical",
        "violence",
        "victim",
        "stereotype",
        "threat",
        "might",
        "pas",
        "confident",
        "professional",
        "order",
        "succeed",
        "queer",
        "femme",
        "might",
        "pas",
        "cisgender",
        "woman",
        "avoiding",
        "holding",
        "hand",
        "girlfriend",
        "order",
        "ward",
        "insensitive",
        "coworker",
        "unlike",
        "classic",
        "resister",
        "person",
        "engage",
        "passing",
        "leave",
        "intact",
        "rather",
        "challenge",
        "system",
        "harm",
        "silvermint",
        "likens",
        "teenager",
        "bullied",
        "come",
        "school",
        "dressed",
        "like",
        "bully",
        "engages",
        "behavior",
        "similar",
        "eventually",
        "get",
        "accepted",
        "silvermint",
        "take",
        "issue",
        "three",
        "main",
        "argument",
        "passing",
        "morally",
        "wrong",
        "namely",
        "compromise",
        "agent",
        "authenticity",
        "involves",
        "deception",
        "harm",
        "fellow",
        "victim",
        "reinforcing",
        "stereotype",
        "instead",
        "defends",
        "view",
        "passing",
        "permissible",
        "form",
        "selfregarding",
        "complicity",
        "ground",
        "person",
        "engage",
        "passing",
        "responsible",
        "victim",
        "oppression",
        "navigating",
        "circumstance",
        "best",
        "way",
        "order",
        "promote",
        "wellbeing"
    ]
}