{
    "main_text": "Feminist Theoretical Approaches to Globalization || Distinctive Feminist Approaches\n2.2 Distinctive Feminist Approaches\n\nDespite these common aims and methodological commitments, feminists\nhave analyzed globalization from a number of different theoretical\nperspectives. Below, we examine three prominent approaches to\nglobalization, developed by postcolonial and decolonial,\ntransnational, and ethics of care feminists. Although it is not\npossible to draw sharp boundaries around these theoretical\nperspectives, we identify some distinctive features of each.\n2.2.1 Postcolonial and Decolonial Feminisms\n\nPostcolonial and decolonial feminisms offer primarily critical\ntheoretical frameworks, which analyze globalization within the context\nof the history of Western colonialism and imperialism. They begin with\nthe claim that Western colonialism and imperialism have played\nimportant roles in shaping the contemporary world, and highlight their\nenduring effects on global relations and local cultural practices.\nAlthough postcolonial and decolonial feminists write from all over the\nworld, they foreground non-Eurocentric epistemic standpoints and\ncriticize North-South power asymmetries from the diverse perspectives\nof members of Indigenous communities and people in the global South\n(Herr 2013, Khader 2019, McLaren 2017, Schutte 2002, 2005). \n\nPostcolonial and decolonial feminists make several important claims.\nFirst, they insist that it is impossible to understand local practices\nin developing countries without acknowledging the ways in which these\npractices have been shaped by their economic and historical contexts,\nparticularly their connection to Western colonialism and imperialism.\nMoreover, they warn that attempts to explain the suffering of women in\ndeveloping countries in simplistic terms often tend to reproduce a\n“colonial stance” toward the global South. For instance,\nas we explained above, Chandra Mohanty sees elements of imperialism in\nWestern feminist scholarship on women in the global South. Similarly,\nUma Narayan criticize feminists for unwittingly adopting a Eurocentric\nperspective. For example, some Western feminist scholars, such as Mary\nDaly, strongly criticize cultural practices, such as sati, the Indian\npractice of widow immolation, as self-evidently wrong. However,\nNarayan argues that approaching sati as an isolated, local phenomenon\nfundamentally misrepresents it. Understanding sati in the context of\ncolonial history provides a richer analysis of this practice, since it\ngained its symbolic power during British rule as an emblem of Hindu\nand Indian culture (Narayan 1997). Highlighting the role that\ncolonialism has played in shaping local practices enables feminists to\navoid adopting a Eurocentric perspective. Likewise, postcolonial and\ndecolonial feminists insist that any feminist analysis of the harms of\nglobalization must take seriously the history and ongoing cultural,\neconomic, and political effects of colonialism and imperialism.\n\nPostcolonial and decolonial feminists further argue that although\ntraditional forms of colonialism have formally ended, many aspects of\nglobalization are best understood as neo-colonial practices. As Sally\nScholz explains:\n\nMultinational corporations and global businesses, largely centered in\nWestern nations, bring their own colonizing influence through business\nmodels, hegemonic culture, exploitation of workers, and displacement\nof traditional trades. Whereas traditional forms of colonialism\nentailed the colonizer assuming the privilege of ruling the colony,\nthis neocolonialism rules indirectly through the power it creates and\nenjoys by bringing manufacturing jobs to an area or providing consumer\ngoods to a people – often Western inspired consumer goods as\nwell. Old style colonialism often killed or displaced indigenous\npeoples; the new style of colonialism impoverishes a culture by\nswamping society with Western values, products or ideals (2010, 139).\n\n\nMore broadly, postcolonial and decolonial feminists observe that many\nof the conditions created by colonialism—economic inequality and\nexploitation, racism, cultural marginalization, and the domination of\nthe global South by the global North—have been sustained and\nintensified by neoliberalism. Moreover, they argue, neoliberal\npolicies and institutions systematically favor countries in the global\nNorth to the detriment of southern nations. International trade\npolicies serve Western interests even while claiming to be politically\nneutral and fair. Global economic institutions also privilege Western\nculture and political norms, presenting them as models for the rest of\nthe world, while ignoring and marginalizing the claims of\nwomen’s and indigenous movements in the global South as well as\nsettler nations (Weendon 2002). Since appeals to so-called universal\nconcepts, epistemologies, and values, such as freedom, rights, and\nautonomy, can be used to further imperialist projects, postcolonial\nand decolonial feminists seek to develop normative positions that\ncriticize neoliberal and neocolonial practices while rejecting\nproblematic ethnocentric ideals that often masquerade as universal\n(Alcoff 2017, Khader, 2019, McLaren 2017, Pohlhaus Jr. 2017, Weir\n2017).\n2.2.2 Ethics of Care\n\nAnother prominent school of feminist theoretical responses to\nglobalization puts care, both caring labor—the work of caring\nfor the young, old, sick, and disabled, and the everyday maintenance\nof households—and the moral ideal of care, at the center of its\nanalyses. Proponents of this approach begin by observing that most\nmainstream analyses of globalization either ignore or devalue care.\nThis is problematic, they argue, for at least three reasons: (1) care\nwork, which is done almost exclusively by women, has been profoundly\ninfluenced by globalization; (2) the values and work associated with\ncare are both undervalued and insufficiently supported, and this\ncontributes to gender, racial, and economic inequality, both within\ncountries and between the global North and the global South; and (3)\nany viable alternative to neoliberal globalization must prioritize the\nmoral ideal of care. Thus, ethics of care approaches to globalization\nhave both theoretical and practical dimensions.\n\nTheoretically, ethics of care feminists aim to provide a systematic\ncritique of neoliberal assumptions and develop moral ideals capable of\nguiding more just forms of globalization. In their view, neoliberalism\npresupposes a problematic notion of the self, which posits individuals\nas atomistic, independent, and self-interested, and an inaccurate\nsocial ontology, which suggests that human relationships are formed by\nchoice rather than necessity or dependency. These assumptions lead\nneoliberalism to prioritize economic growth, efficiency, and profit\nmaking over other values, such as equality, human rights, and care.\nEthics of care feminists reject these assumptions. In their view,\nhuman beings are fundamentally relational and interdependent;\nindividuals are defined, indeed constituted, by their caring\nrelationships. All persons experience long periods during which their\nlives literally depend on the care of others, and everyone needs some\ndegree of care in order flourish. Thus, vulnerability, dependency, and\nneed should be understood not as deficits or limitations, but rather\nas essential human qualities requiring an adequate political\nresponse.\n\nEthics of care feminists contend that relational values, including\ncare, should form the basis of more just forms of globalization. In\nHankivsky’s view, a global ethics of care begins with three\nassumptions: “1) care is considered to be a fundamental aspect\nof all human life; 2) all human beings are interdependent by virtue of\nbeing part of ongoing relations of care; and 3) ‘people are\nentitled to care because they are part of ongoing relations of\ncare’” (9). Because a global care ethics begins with a\nrelational ontology, it requires global political leaders to develop\nsocial and economic policies that aim to meet human needs and reduce\nsuffering rather than to expand markets and increase economic\ncompetition (Hankivsky 2006). Held endorses a similar view. According\nto her, an ethic of care requires leaders to foster a global economy\nthat is capable of meeting universal human needs (Held 2004, 2007).\nSimilarly, Miller advocates a “global duty to care,” which\nrequires individuals to take responsibility for their role in\ncontributing to global oppression, and obligates leaders to advocate\nfor institutions that embody the moral value of care (Miller\n2006).\n\nConcretely, feminist theorists who favor an ethics of care approach\nhighlight the role of care work in the global economy and put forth\nrecommendations for reevaluating it. For example, Robinson develops a\nrelational moral ontology that sheds lights on the features of\nglobalization that are usually invisible: the global distribution of\ncare work and the corresponding patterns of gender and racial\ninequality; the under-provision of public resources for care work in\nboth developed and developing countries; and the ways in which unpaid\nor low-paid care work sustains cycles of exploitation and inequality\non a global scale (Robinson 2006a, 2006b). Similarly, Held advocates\nfor increased state support of various forms of care work and for\npolicies designed to meet people’s needs in caring ways (Held\n2004, 2007).\n2.2.3 Transnational Feminism\n\nIn its broadest sense, transnational feminism maintains that\nglobalization has created the conditions for feminist solidarity\nacross national borders. On the one hand, globalization has enabled\ntransnational processes that generate injustices for women in multiple\ngeographical locations, such the global assembly line (discussed\nbelow). Yet on the other, the technologies associated with\nglobalization have created new political spaces that enable feminist\npolitical resistance. Thus, transnational feminists incorporate the\ncritical insights of postcolonial, Third World and ethics of care\nfeminists into a positive vision of transnational feminist solidarity.\n\n\nTransnational feminism is sometimes contrasted with global or\ninternational feminism, a second-wave theory that emphasizes\nsolidarity among women across national boundaries based on their\ncommon experience of patriarchal oppression. However, transnational\nfeminism differs from global feminism in at least three significant\nrespects. \n\nFirst, transnational feminism is sensitive to differences among women.\nGlobal feminists argue that patriarchy is universal; women across the\nglobe have a common experience of gender oppression. They promote the\nrecognition of a “global sisterhood” based on these shared\nexperiences, which transcends differences in race, class, sexuality,\nand national boundaries. This solidarity is thought to provide a\nunified front against global patriarchy. Transnational feminists also\nadvocate for solidarity across national boundaries. However, their\napproach emphasizes the methodological commitments discussed above,\nspecifically intersectionality, sensitivity to concrete specificity,\nand self-reflexivity. Transnational feminists are careful to point out\nthat although globalizing processes affect everyone, they affect\ndifferent women very differently, based on their geographical and\nsocial locations. They are also quick to acknowledge that many aspects\nof globalization may benefit some women while unduly burdening many\nothers. \n\nSecond, transnational feminist solidarity is political in nature.\nWhereas global feminists advocate a form of social solidarity defined\non the basis of characteristics shared by all women, such as a common\ngender identity or experience of patriarchal oppression, transnational\nfeminist solidarity is grounded in the political commitments of\nindividuals, such as the commitment to challenge injustice or\noppression. Because transnational feminist solidarity is based on\nshared political commitments rather than a common identity or uniform\nset of experiences, advantaged individuals, including those who have\nbenefited from injustice, can join in solidarity with those who have\nexperienced injustice or oppression directly (Ferguson 2009, Scholz\n2008). The emphasis on shared political commitments also enables\nfeminists to resist oppressive conditions that manifest differently in\ndifferent geographical locations but are nonetheless prevalent in many\ncountries, such as racialized violence against women (Khader 2019,\n44–48). \n\nThird, transnational feminists focus on specific globalizing\nprocesses, such as the growth of offshore manufacturing, rather than a\ntheorized global patriarchy, and often take existing transnational\nfeminist collectives as a model for their theoretical accounts of\nsolidarity. For instance, Ann Ferguson argues that anti-globalization\nnetworks, such as worker-owned cooperatives, labor unions, fair trade\norganizations, and land reform movements, are creating the conditions\nfor North-South women’s coalition movements based on\nnon-essentialist political commitments to global gender justice\n(Ferguson, 2009; see also Kang 2008, Khader 2019, Mendoza, 2002,\nVargas, 2003).\n",
    "section_title": "2.2 Distinctive Feminist Approaches",
    "entry_title": "Feminist Perspectives on Globalization",
    "hierarchy_title": "Feminist Perspectives on Globalization || Feminist Theoretical Approaches to Globalization || Distinctive Feminist Approaches",
    "tokenized_text": [
        "feminist",
        "theoretical",
        "approach",
        "globalization",
        "distinctive",
        "feminist",
        "approach",
        "distinctive",
        "feminist",
        "approach",
        "despite",
        "common",
        "aim",
        "methodological",
        "commitment",
        "feminist",
        "analyzed",
        "globalization",
        "number",
        "different",
        "theoretical",
        "perspective",
        "examine",
        "three",
        "prominent",
        "approach",
        "globalization",
        "developed",
        "postcolonial",
        "decolonial",
        "transnational",
        "ethic",
        "care",
        "feminist",
        "although",
        "possible",
        "draw",
        "sharp",
        "boundary",
        "around",
        "theoretical",
        "perspective",
        "identify",
        "distinctive",
        "feature",
        "postcolonial",
        "decolonial",
        "feminism",
        "postcolonial",
        "decolonial",
        "feminism",
        "offer",
        "primarily",
        "critical",
        "theoretical",
        "framework",
        "analyze",
        "globalization",
        "within",
        "context",
        "history",
        "western",
        "colonialism",
        "imperialism",
        "begin",
        "claim",
        "western",
        "colonialism",
        "imperialism",
        "played",
        "important",
        "role",
        "shaping",
        "contemporary",
        "world",
        "highlight",
        "enduring",
        "effect",
        "global",
        "relation",
        "local",
        "cultural",
        "practice",
        "although",
        "postcolonial",
        "decolonial",
        "feminist",
        "write",
        "world",
        "foreground",
        "noneurocentric",
        "epistemic",
        "standpoint",
        "criticize",
        "northsouth",
        "power",
        "asymmetry",
        "diverse",
        "perspective",
        "member",
        "indigenous",
        "community",
        "people",
        "global",
        "south",
        "herr",
        "khader",
        "mclaren",
        "schutte",
        "postcolonial",
        "decolonial",
        "feminist",
        "make",
        "several",
        "important",
        "claim",
        "first",
        "insist",
        "impossible",
        "understand",
        "local",
        "practice",
        "developing",
        "country",
        "without",
        "acknowledging",
        "way",
        "practice",
        "shaped",
        "economic",
        "historical",
        "context",
        "particularly",
        "connection",
        "western",
        "colonialism",
        "imperialism",
        "moreover",
        "warn",
        "attempt",
        "explain",
        "suffering",
        "woman",
        "developing",
        "country",
        "simplistic",
        "term",
        "often",
        "tend",
        "reproduce",
        "colonial",
        "stance",
        "toward",
        "global",
        "south",
        "instance",
        "explained",
        "chandra",
        "mohanty",
        "see",
        "element",
        "imperialism",
        "western",
        "feminist",
        "scholarship",
        "woman",
        "global",
        "south",
        "similarly",
        "uma",
        "narayan",
        "criticize",
        "feminist",
        "unwittingly",
        "adopting",
        "eurocentric",
        "perspective",
        "example",
        "western",
        "feminist",
        "scholar",
        "mary",
        "daly",
        "strongly",
        "criticize",
        "cultural",
        "practice",
        "sati",
        "indian",
        "practice",
        "widow",
        "immolation",
        "selfevidently",
        "wrong",
        "however",
        "narayan",
        "argues",
        "approaching",
        "sati",
        "isolated",
        "local",
        "phenomenon",
        "fundamentally",
        "misrepresents",
        "understanding",
        "sati",
        "context",
        "colonial",
        "history",
        "provides",
        "richer",
        "analysis",
        "practice",
        "since",
        "gained",
        "symbolic",
        "power",
        "british",
        "rule",
        "emblem",
        "hindu",
        "indian",
        "culture",
        "narayan",
        "highlighting",
        "role",
        "colonialism",
        "played",
        "shaping",
        "local",
        "practice",
        "enables",
        "feminist",
        "avoid",
        "adopting",
        "eurocentric",
        "perspective",
        "likewise",
        "postcolonial",
        "decolonial",
        "feminist",
        "insist",
        "feminist",
        "analysis",
        "harm",
        "globalization",
        "must",
        "take",
        "seriously",
        "history",
        "ongoing",
        "cultural",
        "economic",
        "political",
        "effect",
        "colonialism",
        "imperialism",
        "postcolonial",
        "decolonial",
        "feminist",
        "argue",
        "although",
        "traditional",
        "form",
        "colonialism",
        "formally",
        "ended",
        "many",
        "aspect",
        "globalization",
        "best",
        "understood",
        "neocolonial",
        "practice",
        "sally",
        "scholz",
        "explains",
        "multinational",
        "corporation",
        "global",
        "business",
        "largely",
        "centered",
        "western",
        "nation",
        "bring",
        "colonizing",
        "influence",
        "business",
        "model",
        "hegemonic",
        "culture",
        "exploitation",
        "worker",
        "displacement",
        "traditional",
        "trade",
        "whereas",
        "traditional",
        "form",
        "colonialism",
        "entailed",
        "colonizer",
        "assuming",
        "privilege",
        "ruling",
        "colony",
        "neocolonialism",
        "rule",
        "indirectly",
        "power",
        "creates",
        "enjoys",
        "bringing",
        "manufacturing",
        "job",
        "area",
        "providing",
        "consumer",
        "good",
        "people",
        "often",
        "western",
        "inspired",
        "consumer",
        "good",
        "well",
        "old",
        "style",
        "colonialism",
        "often",
        "killed",
        "displaced",
        "indigenous",
        "people",
        "new",
        "style",
        "colonialism",
        "impoverishes",
        "culture",
        "swamping",
        "society",
        "western",
        "value",
        "product",
        "ideal",
        "broadly",
        "postcolonial",
        "decolonial",
        "feminist",
        "observe",
        "many",
        "condition",
        "created",
        "colonialismeconomic",
        "inequality",
        "exploitation",
        "racism",
        "cultural",
        "marginalization",
        "domination",
        "global",
        "south",
        "global",
        "northhave",
        "sustained",
        "intensified",
        "neoliberalism",
        "moreover",
        "argue",
        "neoliberal",
        "policy",
        "institution",
        "systematically",
        "favor",
        "country",
        "global",
        "north",
        "detriment",
        "southern",
        "nation",
        "international",
        "trade",
        "policy",
        "serve",
        "western",
        "interest",
        "even",
        "claiming",
        "politically",
        "neutral",
        "fair",
        "global",
        "economic",
        "institution",
        "also",
        "privilege",
        "western",
        "culture",
        "political",
        "norm",
        "presenting",
        "model",
        "rest",
        "world",
        "ignoring",
        "marginalizing",
        "claim",
        "woman",
        "indigenous",
        "movement",
        "global",
        "south",
        "well",
        "settler",
        "nation",
        "weendon",
        "since",
        "appeal",
        "socalled",
        "universal",
        "concept",
        "epistemology",
        "value",
        "freedom",
        "right",
        "autonomy",
        "used",
        "imperialist",
        "project",
        "postcolonial",
        "decolonial",
        "feminist",
        "seek",
        "develop",
        "normative",
        "position",
        "criticize",
        "neoliberal",
        "neocolonial",
        "practice",
        "rejecting",
        "problematic",
        "ethnocentric",
        "ideal",
        "often",
        "masquerade",
        "universal",
        "alcoff",
        "khader",
        "mclaren",
        "pohlhaus",
        "jr",
        "weir",
        "ethic",
        "care",
        "another",
        "prominent",
        "school",
        "feminist",
        "theoretical",
        "response",
        "globalization",
        "put",
        "care",
        "caring",
        "laborthe",
        "work",
        "caring",
        "young",
        "old",
        "sick",
        "disabled",
        "everyday",
        "maintenance",
        "householdsand",
        "moral",
        "ideal",
        "care",
        "center",
        "analysis",
        "proponent",
        "approach",
        "begin",
        "observing",
        "mainstream",
        "analysis",
        "globalization",
        "either",
        "ignore",
        "devalue",
        "care",
        "problematic",
        "argue",
        "least",
        "three",
        "reason",
        "care",
        "work",
        "done",
        "almost",
        "exclusively",
        "woman",
        "profoundly",
        "influenced",
        "globalization",
        "value",
        "work",
        "associated",
        "care",
        "undervalued",
        "insufficiently",
        "supported",
        "contributes",
        "gender",
        "racial",
        "economic",
        "inequality",
        "within",
        "country",
        "global",
        "north",
        "global",
        "south",
        "viable",
        "alternative",
        "neoliberal",
        "globalization",
        "must",
        "prioritize",
        "moral",
        "ideal",
        "care",
        "thus",
        "ethic",
        "care",
        "approach",
        "globalization",
        "theoretical",
        "practical",
        "dimension",
        "theoretically",
        "ethic",
        "care",
        "feminist",
        "aim",
        "provide",
        "systematic",
        "critique",
        "neoliberal",
        "assumption",
        "develop",
        "moral",
        "ideal",
        "capable",
        "guiding",
        "form",
        "globalization",
        "view",
        "neoliberalism",
        "presupposes",
        "problematic",
        "notion",
        "self",
        "posit",
        "individual",
        "atomistic",
        "independent",
        "selfinterested",
        "inaccurate",
        "social",
        "ontology",
        "suggests",
        "human",
        "relationship",
        "formed",
        "choice",
        "rather",
        "necessity",
        "dependency",
        "assumption",
        "lead",
        "neoliberalism",
        "prioritize",
        "economic",
        "growth",
        "efficiency",
        "profit",
        "making",
        "value",
        "equality",
        "human",
        "right",
        "care",
        "ethic",
        "care",
        "feminist",
        "reject",
        "assumption",
        "view",
        "human",
        "being",
        "fundamentally",
        "relational",
        "interdependent",
        "individual",
        "defined",
        "indeed",
        "constituted",
        "caring",
        "relationship",
        "person",
        "experience",
        "long",
        "period",
        "life",
        "literally",
        "depend",
        "care",
        "others",
        "everyone",
        "need",
        "degree",
        "care",
        "order",
        "flourish",
        "thus",
        "vulnerability",
        "dependency",
        "need",
        "understood",
        "deficit",
        "limitation",
        "rather",
        "essential",
        "human",
        "quality",
        "requiring",
        "adequate",
        "political",
        "response",
        "ethic",
        "care",
        "feminist",
        "contend",
        "relational",
        "value",
        "including",
        "care",
        "form",
        "basis",
        "form",
        "globalization",
        "hankivsky",
        "view",
        "global",
        "ethic",
        "care",
        "begin",
        "three",
        "assumption",
        "care",
        "considered",
        "fundamental",
        "aspect",
        "human",
        "life",
        "human",
        "being",
        "interdependent",
        "virtue",
        "part",
        "ongoing",
        "relation",
        "care",
        "people",
        "entitled",
        "care",
        "part",
        "ongoing",
        "relation",
        "care",
        "global",
        "care",
        "ethic",
        "begin",
        "relational",
        "ontology",
        "requires",
        "global",
        "political",
        "leader",
        "develop",
        "social",
        "economic",
        "policy",
        "aim",
        "meet",
        "human",
        "need",
        "reduce",
        "suffering",
        "rather",
        "expand",
        "market",
        "increase",
        "economic",
        "competition",
        "hankivsky",
        "held",
        "endorses",
        "similar",
        "view",
        "according",
        "ethic",
        "care",
        "requires",
        "leader",
        "foster",
        "global",
        "economy",
        "capable",
        "meeting",
        "universal",
        "human",
        "need",
        "held",
        "similarly",
        "miller",
        "advocate",
        "global",
        "duty",
        "care",
        "requires",
        "individual",
        "take",
        "responsibility",
        "role",
        "contributing",
        "global",
        "oppression",
        "obligates",
        "leader",
        "advocate",
        "institution",
        "embody",
        "moral",
        "value",
        "care",
        "miller",
        "concretely",
        "feminist",
        "theorist",
        "favor",
        "ethic",
        "care",
        "approach",
        "highlight",
        "role",
        "care",
        "work",
        "global",
        "economy",
        "put",
        "forth",
        "recommendation",
        "reevaluating",
        "example",
        "robinson",
        "develops",
        "relational",
        "moral",
        "ontology",
        "shed",
        "light",
        "feature",
        "globalization",
        "usually",
        "invisible",
        "global",
        "distribution",
        "care",
        "work",
        "corresponding",
        "pattern",
        "gender",
        "racial",
        "inequality",
        "underprovision",
        "public",
        "resource",
        "care",
        "work",
        "developed",
        "developing",
        "country",
        "way",
        "unpaid",
        "lowpaid",
        "care",
        "work",
        "sustains",
        "cycle",
        "exploitation",
        "inequality",
        "global",
        "scale",
        "robinson",
        "a",
        "b",
        "similarly",
        "held",
        "advocate",
        "increased",
        "state",
        "support",
        "various",
        "form",
        "care",
        "work",
        "policy",
        "designed",
        "meet",
        "people",
        "need",
        "caring",
        "way",
        "held",
        "transnational",
        "feminism",
        "broadest",
        "sense",
        "transnational",
        "feminism",
        "maintains",
        "globalization",
        "created",
        "condition",
        "feminist",
        "solidarity",
        "across",
        "national",
        "border",
        "one",
        "hand",
        "globalization",
        "enabled",
        "transnational",
        "process",
        "generate",
        "injustice",
        "woman",
        "multiple",
        "geographical",
        "location",
        "global",
        "assembly",
        "line",
        "discussed",
        "yet",
        "technology",
        "associated",
        "globalization",
        "created",
        "new",
        "political",
        "space",
        "enable",
        "feminist",
        "political",
        "resistance",
        "thus",
        "transnational",
        "feminist",
        "incorporate",
        "critical",
        "insight",
        "postcolonial",
        "third",
        "world",
        "ethic",
        "care",
        "feminist",
        "positive",
        "vision",
        "transnational",
        "feminist",
        "solidarity",
        "transnational",
        "feminism",
        "sometimes",
        "contrasted",
        "global",
        "international",
        "feminism",
        "secondwave",
        "theory",
        "emphasizes",
        "solidarity",
        "among",
        "woman",
        "across",
        "national",
        "boundary",
        "based",
        "common",
        "experience",
        "patriarchal",
        "oppression",
        "however",
        "transnational",
        "feminism",
        "differs",
        "global",
        "feminism",
        "least",
        "three",
        "significant",
        "respect",
        "first",
        "transnational",
        "feminism",
        "sensitive",
        "difference",
        "among",
        "woman",
        "global",
        "feminist",
        "argue",
        "patriarchy",
        "universal",
        "woman",
        "across",
        "globe",
        "common",
        "experience",
        "gender",
        "oppression",
        "promote",
        "recognition",
        "global",
        "sisterhood",
        "based",
        "shared",
        "experience",
        "transcends",
        "difference",
        "race",
        "class",
        "sexuality",
        "national",
        "boundary",
        "solidarity",
        "thought",
        "provide",
        "unified",
        "front",
        "global",
        "patriarchy",
        "transnational",
        "feminist",
        "also",
        "advocate",
        "solidarity",
        "across",
        "national",
        "boundary",
        "however",
        "approach",
        "emphasizes",
        "methodological",
        "commitment",
        "discussed",
        "specifically",
        "intersectionality",
        "sensitivity",
        "concrete",
        "specificity",
        "selfreflexivity",
        "transnational",
        "feminist",
        "careful",
        "point",
        "although",
        "globalizing",
        "process",
        "affect",
        "everyone",
        "affect",
        "different",
        "woman",
        "differently",
        "based",
        "geographical",
        "social",
        "location",
        "also",
        "quick",
        "acknowledge",
        "many",
        "aspect",
        "globalization",
        "may",
        "benefit",
        "woman",
        "unduly",
        "burdening",
        "many",
        "others",
        "second",
        "transnational",
        "feminist",
        "solidarity",
        "political",
        "nature",
        "whereas",
        "global",
        "feminist",
        "advocate",
        "form",
        "social",
        "solidarity",
        "defined",
        "basis",
        "characteristic",
        "shared",
        "woman",
        "common",
        "gender",
        "identity",
        "experience",
        "patriarchal",
        "oppression",
        "transnational",
        "feminist",
        "solidarity",
        "grounded",
        "political",
        "commitment",
        "individual",
        "commitment",
        "challenge",
        "injustice",
        "oppression",
        "transnational",
        "feminist",
        "solidarity",
        "based",
        "shared",
        "political",
        "commitment",
        "rather",
        "common",
        "identity",
        "uniform",
        "set",
        "experience",
        "advantaged",
        "individual",
        "including",
        "benefited",
        "injustice",
        "join",
        "solidarity",
        "experienced",
        "injustice",
        "oppression",
        "directly",
        "ferguson",
        "scholz",
        "emphasis",
        "shared",
        "political",
        "commitment",
        "also",
        "enables",
        "feminist",
        "resist",
        "oppressive",
        "condition",
        "manifest",
        "differently",
        "different",
        "geographical",
        "location",
        "nonetheless",
        "prevalent",
        "many",
        "country",
        "racialized",
        "violence",
        "woman",
        "khader",
        "third",
        "transnational",
        "feminist",
        "focus",
        "specific",
        "globalizing",
        "process",
        "growth",
        "offshore",
        "manufacturing",
        "rather",
        "theorized",
        "global",
        "patriarchy",
        "often",
        "take",
        "existing",
        "transnational",
        "feminist",
        "collective",
        "model",
        "theoretical",
        "account",
        "solidarity",
        "instance",
        "ann",
        "ferguson",
        "argues",
        "antiglobalization",
        "network",
        "workerowned",
        "cooperative",
        "labor",
        "union",
        "fair",
        "trade",
        "organization",
        "land",
        "reform",
        "movement",
        "creating",
        "condition",
        "northsouth",
        "woman",
        "coalition",
        "movement",
        "based",
        "nonessentialist",
        "political",
        "commitment",
        "global",
        "gender",
        "justice",
        "ferguson",
        "see",
        "also",
        "kang",
        "khader",
        "mendoza",
        "vargas"
    ]
}