{
    "main_text": "Historical Development\n1. Historical Development\n\n\nAs the second wave of feminism progressed throughout the 1970s,\nfeminist philosophical work began to appear, first in ethics and\npolitical philosophy. At the same time, feminists working in other\ndisciplines such as the social sciences were documenting the sexism and\nandrocentrism in their fields. These theorists increasingly found the\nmethodologies of their disciplines incapable of accounting for their\nfeminist insights. Their interests turned to epistemological issues\nwhen it became apparent that alternative accounts of knowledge and of\njustification were required “in order to overthrow presuppositions in\ntheir disciplines which functioned as obstacles to necessary change”\n(Longino 1999, 330).\n\n\nTwo of the earliest pieces clearly identifiable as feminist\nepistemology were Lorraine Code’s “Is the Sex of the Knower\nEpistemically Significant?” appearing in 1981 in\nMetaphilosophy and Sandra Harding’s “Is Gender a\nVariable in Conceptions of Rationality: A Survey of Issues”\nappearing in 1982 in Dialectica. The first significant\ncollection of articles in feminist epistemology appeared in 1983 with\nSandra Harding and Merrill Hintikka’s\nDiscovering Reality: Feminist Perspectives on Epistemology,\nMetaphysics, Methodology and Philosophy of Science. Soon after\nthe Harding and Hintikka volume, rates of publication in feminist\nepistemology picked up significantly. By contrast, although there are\nclear historical roots to the current form of the field (Goldman\n2001), social epistemology didn’t make its presence felt on the\nterrain of contemporary epistemology until the late 1980s and early\n1990s. Steve Fuller’s book Social Epistemology appeared in\n1988 and in 1994 Schmitt’s volume Socializing Epistemology\nappeared, the first significant collection of work in contemporary\nsocial epistemology (1994b). Though few articles in this collection\nmake specific reference to feminist\n epistemology,[3]\n in his introduction Schmitt acknowledges feminist philosophers of\nscience, along with sociology of science, and naturalistic\nepistemology as the major inspirations for social epistemology since\n1980 (Schmitt 1994a, 3–4).\n\n\nThe Harding and Hintikka volume represented several angles of\nresearch, and set the stage for future discussions within feminist\nepistemology. Several pieces undertook deconstructive projects,\ndemonstrating how masculinist perspectives and assumptions infiltrate\nthe philosophies of particular historical figures. Other selections\nfocused on science studies, offering illustrations of the congruence\nbetween specific scientific theories and the social and political\nideologies of the day, including patriarchal ideologies. Still others\nrepresented reconstructive epistemological projects in response to\nsuch findings, arguing for a requisite role of values in scientific\ntheorizing, or arguing that rational investigation requires a critical\nassessment of the metaphysical (and sometimes gendered) assumptions\nunderlying a field of study. Additionally, Nancy Hartsock’s\ncontribution to the volume outlined her version of feminist standpoint\ntheory, invoking the Marxist idea that social position is inversely\nrelated to epistemic\n position.[4]\n Standpoint theory offered an extensive argument for the grounding of\nepistemic perspective in one’s social position, and would soon form\none of the most fruitful and heavily debated areas of theorizing for\nfeminist epistemologists.\n\n\nAs feminists turned to the reconstructive projects of developing new\nepistemologies, one of their major tasks was to explain the connection\nbetween the rise of the feminist movement and the recognition of sexism\nand androcentrism in what had previously been taken to be excellent\ncases of objective knowledge production. Why was it only with the rise\nof the feminist movement that critiques of the role of gendered\nassumptions in canonical figures such as Aristotle and Descartes began\nto appear? Why did primatology begin to question research based on male\ndominance schemas and begin to develop alternative models involving\ncloser observation of female primate behavior at the same time that there\nwas an increase in the number of women in the field? Why did it take feminist\npsychologists to point out the androcentrism involved in drawing\nconclusions about human beings based on all-male studies? In her\ncontribution to the Discovering Reality volume, Sandra Harding\nphrased the question as “Why has the Sex/Gender System Become Visible\nOnly Now?” To answer it, feminists very clearly needed to develop\nsocial epistemologies. They needed to show not only how\nfeminist interests might motivate such knowledge production, but also\nhow such feminist motivated work could offer what many (feminists and\nnonfeminists alike) considered improved knowledge production, not just\nalternative knowledge production.\n\n\nHarding’s 1986 book The Science Question in Feminism examined\nvarious epistemological options for feminists seeking to explain such\npolitical-epistemic connections within science. She set out what was\nto become a classic tripartite taxonomy of feminist epistemologies:\nfeminist empiricism, feminist standpoint theory and feminist\npostmodernism. Harding characterized feminist empiricism as arguing\nthat the sexist and androcentric biases present in science are the\nresult of “bad” science and can be corrected by stricter adherence to\ntraditional norms of science, as represented by the feminist critiques\nidentifying such biases (for example Bleier 1984; Hubbard 1983;\nLongino and Doell 1983). Feminist standpoint theory, according to\nHarding, argues that the political engagement of feminists and their\ncorresponding focus on the lives of women leads to an epistemically\nprivileged “standpoint” on social reality (for example Hartsock 1983;\nRose 1983; Smith 1974), with the political engagement requirement\ndistinguishing the idea of a standpoint from the more generic idea of\na “perspective”. In contrast, feminist postmodernism, skeptical of\nuniversal claims of reason and the progress of science, argues that\nonly political solidarity across social locations can ground feminist\nfindings, there being no independent epistemological groundings (for\nexample Flax 1990; Haraway 1991).\n\n\nFeminist epistemologies continued to multiply throughout the 1980s and\nearly 1990s, quickly cross-fertilizing and in the process undermining\nHarding’s classification system. Few current works in feminist\nepistemology fall unequivocally into a single category given\nHarding’s three original definitions. For example, the leading\ntheories of feminist empiricism from the 1990s on have very little in\ncommon with Harding’s characterization of feminist empiricism, given\nthat they do not explain past instances of sexism and androcentrism as\nsimply “bad science” and they do not accept traditional norms of\nscience as appropriate\n correctives (Longino 1990, 2002; Nelson 1990,\n 1993).[5]\n Even Harding has developed her own position as a blend of standpoint\ntheory and feminist postmodernism (Harding 1991). In spite of their\nsignificant limitations, however, Harding’s divisions are still often\ncited, and remain useful in characterizing some of the main directions\nof the literature.\n\n\nMuch of the early work in feminist social epistemology was highly\ncritical of many mainstream epistemological approaches. As feminists\nturned to their reconstructive projects in the early 1990s, however,\nthey focused their criticisms on particular versions of epistemology,\nrecognizing that not all existing epistemologies were equally\ndifficult to work with. In particular, post-Kuhnian\nhistorically-oriented philosophies of science as well as naturalized\nepistemology proved to be very important resources. Besides the fact\nthat many feminists have been particularly interested in the workings\nof science as a dominant force in society, they have also found many\nforms of philosophy of science comparatively open to social\nanalyses.[6] This\nopenness stems from a recognition of the historically dynamic nature\nof knowledge not often evident in analytic epistemologies that focus\non the general conditions of knowledge rather than the specific\nmethodologies and activities of the sciences. Even more prominently,\nnaturalized epistemology has proven to be very conducive to analyses\nof the role of gender in knowing. It demands that we look and see,\nturning to empirical evidence of how in fact we do know rather than\nmaking a priori announcements concerning how we\nknow.[7] Thus,\nwhere it has been easy for certain forms of analytical epistemology to\ndismiss feminist empirical findings of the role of gender in knowledge\nas irrelevant to questions of serious epistemological import,\nnaturalized epistemology insists that such empirical findings must\nhave something important to tell us about knowledge production, or at\na minimum, must be accounted for. Hence naturalized epistemology\ncannot consistently dismiss such findings of the role of\ngender. Despite the individualism of many naturalized epistemologies,\na naturalized approach can operate as a very strong argument for a\nsocial epistemology: looking at how human beings know leaves little\ndoubt that the vast majority of our knowing takes place socially. Even\nif the “socially” is understood in the minimal sense of individuals\ninteracting with each other by exchanging information, this social\ninteraction has the potential to be infused with the dynamics of\ngender, opening the door for analyses of how gender affects knowledge\nexchanges. While rejecting his individualism, many feminist\nepistemologists have relied heavily on the resources of Quine, from\nhis overall naturalized approach to the specifics of his holistic\ntheory of evidence (Antony 1993; Campbell 1998; Nelson 1990,\n1996). Other feminists have followed by adopting a strongly pragmatic\nmodel, encouraging an empirical process of decision making in which\ntruth is assigned locally and fallibly, and issues of skepticism that\nhave plagued epistemology are demoted (Clough 2003). \n\n\nThroughout the 1990s, the output of works in feminist social\nepistemology was rich and varied. Early in the decade substantive\nworks appeared in feminist philosophy of science (Harding 1991;\nLongino 1990; Nelson 1990) along with significant developments in\nstandpoint theory (Collins 1990; Harding 1991), postmodern feminist\nepistemology (Haraway 1991) and analyses of the role of subjectivity\nin knowing (Code 1991).  By the mid-1990s, articles of feminist social\nepistemology were making appearances in numerous mainstream analytic\nphilosophical journals, with special issues devoted to feminist\nepistemology in The Monist (1994), Philosophical\nTopics (1995) and Synthese (1995). Throughout the\ndecade, the work of feminist social epistemologists addressed many\nissues being taken up by other social epistemologists as well: the\ndynamics of testimony and relations of cognitive authority, communal\nanalyses of evidence and epistemic agency, the social structure of\nscientific knowledge, social conceptions of objectivity, and\nunderstandings of knowledge as social practice. In 2002, Social\nEpistemology devoted a special issue to “Feminist\nEpistemology as Social Epistemology” in which it was noted that\nsocial epistemology and feminist epistemology shared many challenges\nand were similarly positioned against “a dominant\nepistemological tradition of hypernormative and individualistic\nanalysis” (Grasswick and Webb 2002). The\njournal Episteme, which began in 2004 as a journal of social\nepistemology (though it later broadened its scope to cover both\nindividual and social epistemology) devoted two issues in 2006 to\nquestions of the epistemic relevance of diversity. Yet despite\nfeminist epistemology’s shared interests with others in the developing\nfield of social epistemology, there has been perhaps less\ncross-pollination over the years than one might\n expect.[8] \nA partial explanation for this lies in the different intellectual\nagendas that drive the development of the respective fields, including\nthe fact that nonfeminist social epistemologists have generally had a\nless political agenda than feminist social epistemologists. For\nexample, feminist social epistemologies have been driven by, and\nfocused on, epistemological questions directly pertinent to knowing\nunder conditions of oppression, conditions that are very significant\nfor feminists to come to understand. Ultimately, the direction of\nfeminist social epistemology as a field has been guided by the needs\nand challenges of feminist theory and activism. A good example of this\nis evident in the shift to a broadening of social identity categories\ntaken to be epistemically relevant. As feminist theory in all its\nguises developed throughout the 1980s and early 1990s, it became\napparent that gender was not the only significant social category, and\nmore importantly that gender could not be properly understood in\nisolation from other social categories such as race and ethnicity,\nclass, sexuality, ability status, and global location. Many feminist\ntheorists were criticized on the grounds that their focus on gender\nhad assumed a commonality across women and paid inadequate attention\nto the ways in which one person’s gendered experience is\nsimultaneously shaped by their other social positions. The feminist\ncommitment to investigating the role of power relations in epistemic\nmatters (whatever form they took) soon revealed that the relevant\npower relations were complex and dynamic. As a result, feminist social\nepistemology began to attend more closely to the intersections between\nvarious social categories. By 1993, Alcoff and Potter noted that\nfeminist epistemology should no longer be taken “as involving a\ncommitment to gender as the primary axis of oppression, in any sense\nof ‘primary,’ or positing that gender is a theoretical\nvariable separable from other axes of oppression and susceptible to a\nunique analysis” (Alcoff and Potter 1993,\n3–4). Nevertheless, they suggested the continued use of the term\n“feminist epistemologies” as marking the body of work that\nhas historically evolved out of a concern with the relations between\ngender and knowledge (Alcoff and Potter 1993, 4). \n",
    "section_title": "1. Historical Development",
    "entry_title": "Feminist Social Epistemology",
    "hierarchy_title": "Feminist Social Epistemology || Historical Development",
    "tokenized_text": [
        "historical",
        "development",
        "historical",
        "development",
        "second",
        "wave",
        "feminism",
        "progressed",
        "throughout",
        "s",
        "feminist",
        "philosophical",
        "work",
        "began",
        "appear",
        "first",
        "ethic",
        "political",
        "philosophy",
        "time",
        "feminist",
        "working",
        "discipline",
        "social",
        "science",
        "documenting",
        "sexism",
        "androcentrism",
        "field",
        "theorist",
        "increasingly",
        "found",
        "methodology",
        "discipline",
        "incapable",
        "accounting",
        "feminist",
        "insight",
        "interest",
        "turned",
        "epistemological",
        "issue",
        "became",
        "apparent",
        "alternative",
        "account",
        "knowledge",
        "justification",
        "required",
        "order",
        "overthrow",
        "presupposition",
        "discipline",
        "functioned",
        "obstacle",
        "necessary",
        "change",
        "longino",
        "two",
        "earliest",
        "piece",
        "clearly",
        "identifiable",
        "feminist",
        "epistemology",
        "lorraine",
        "code",
        "sex",
        "knower",
        "epistemically",
        "significant",
        "appearing",
        "metaphilosophy",
        "sandra",
        "harding",
        "gender",
        "variable",
        "conception",
        "rationality",
        "survey",
        "issue",
        "appearing",
        "dialectica",
        "first",
        "significant",
        "collection",
        "article",
        "feminist",
        "epistemology",
        "appeared",
        "sandra",
        "harding",
        "merrill",
        "hintikka",
        "discovering",
        "reality",
        "feminist",
        "perspective",
        "epistemology",
        "metaphysics",
        "methodology",
        "philosophy",
        "science",
        "soon",
        "harding",
        "hintikka",
        "volume",
        "rate",
        "publication",
        "feminist",
        "epistemology",
        "picked",
        "significantly",
        "contrast",
        "although",
        "clear",
        "historical",
        "root",
        "current",
        "form",
        "field",
        "goldman",
        "social",
        "epistemology",
        "make",
        "presence",
        "felt",
        "terrain",
        "contemporary",
        "epistemology",
        "late",
        "s",
        "early",
        "s",
        "steve",
        "fuller",
        "book",
        "social",
        "epistemology",
        "appeared",
        "schmitt",
        "volume",
        "socializing",
        "epistemology",
        "appeared",
        "first",
        "significant",
        "collection",
        "work",
        "contemporary",
        "social",
        "epistemology",
        "b",
        "though",
        "article",
        "collection",
        "make",
        "specific",
        "reference",
        "feminist",
        "epistemology",
        "introduction",
        "schmitt",
        "acknowledges",
        "feminist",
        "philosopher",
        "science",
        "along",
        "sociology",
        "science",
        "naturalistic",
        "epistemology",
        "major",
        "inspiration",
        "social",
        "epistemology",
        "since",
        "schmitt",
        "a",
        "harding",
        "hintikka",
        "volume",
        "represented",
        "several",
        "angle",
        "research",
        "set",
        "stage",
        "future",
        "discussion",
        "within",
        "feminist",
        "epistemology",
        "several",
        "piece",
        "undertook",
        "deconstructive",
        "project",
        "demonstrating",
        "masculinist",
        "perspective",
        "assumption",
        "infiltrate",
        "philosophy",
        "particular",
        "historical",
        "figure",
        "selection",
        "focused",
        "science",
        "study",
        "offering",
        "illustration",
        "congruence",
        "specific",
        "scientific",
        "theory",
        "social",
        "political",
        "ideology",
        "day",
        "including",
        "patriarchal",
        "ideology",
        "still",
        "others",
        "represented",
        "reconstructive",
        "epistemological",
        "project",
        "response",
        "finding",
        "arguing",
        "requisite",
        "role",
        "value",
        "scientific",
        "theorizing",
        "arguing",
        "rational",
        "investigation",
        "requires",
        "critical",
        "assessment",
        "metaphysical",
        "sometimes",
        "gendered",
        "assumption",
        "underlying",
        "field",
        "study",
        "additionally",
        "nancy",
        "hartsock",
        "contribution",
        "volume",
        "outlined",
        "version",
        "feminist",
        "standpoint",
        "theory",
        "invoking",
        "marxist",
        "idea",
        "social",
        "position",
        "inversely",
        "related",
        "epistemic",
        "position",
        "standpoint",
        "theory",
        "offered",
        "extensive",
        "argument",
        "grounding",
        "epistemic",
        "perspective",
        "one",
        "social",
        "position",
        "would",
        "soon",
        "form",
        "one",
        "fruitful",
        "heavily",
        "debated",
        "area",
        "theorizing",
        "feminist",
        "epistemologist",
        "feminist",
        "turned",
        "reconstructive",
        "project",
        "developing",
        "new",
        "epistemology",
        "one",
        "major",
        "task",
        "explain",
        "connection",
        "rise",
        "feminist",
        "movement",
        "recognition",
        "sexism",
        "androcentrism",
        "previously",
        "taken",
        "excellent",
        "case",
        "objective",
        "knowledge",
        "production",
        "rise",
        "feminist",
        "movement",
        "critique",
        "role",
        "gendered",
        "assumption",
        "canonical",
        "figure",
        "aristotle",
        "descartes",
        "began",
        "appear",
        "primatology",
        "begin",
        "question",
        "research",
        "based",
        "male",
        "dominance",
        "schema",
        "begin",
        "develop",
        "alternative",
        "model",
        "involving",
        "closer",
        "observation",
        "female",
        "primate",
        "behavior",
        "time",
        "increase",
        "number",
        "woman",
        "field",
        "take",
        "feminist",
        "psychologist",
        "point",
        "androcentrism",
        "involved",
        "drawing",
        "conclusion",
        "human",
        "being",
        "based",
        "allmale",
        "study",
        "contribution",
        "discovering",
        "reality",
        "volume",
        "sandra",
        "harding",
        "phrased",
        "question",
        "sexgender",
        "system",
        "become",
        "visible",
        "answer",
        "feminist",
        "clearly",
        "needed",
        "develop",
        "social",
        "epistemology",
        "needed",
        "show",
        "feminist",
        "interest",
        "might",
        "motivate",
        "knowledge",
        "production",
        "also",
        "feminist",
        "motivated",
        "work",
        "could",
        "offer",
        "many",
        "feminist",
        "nonfeminists",
        "alike",
        "considered",
        "improved",
        "knowledge",
        "production",
        "alternative",
        "knowledge",
        "production",
        "harding",
        "book",
        "science",
        "question",
        "feminism",
        "examined",
        "various",
        "epistemological",
        "option",
        "feminist",
        "seeking",
        "explain",
        "politicalepistemic",
        "connection",
        "within",
        "science",
        "set",
        "become",
        "classic",
        "tripartite",
        "taxonomy",
        "feminist",
        "epistemology",
        "feminist",
        "empiricism",
        "feminist",
        "standpoint",
        "theory",
        "feminist",
        "postmodernism",
        "harding",
        "characterized",
        "feminist",
        "empiricism",
        "arguing",
        "sexist",
        "androcentric",
        "bias",
        "present",
        "science",
        "result",
        "bad",
        "science",
        "corrected",
        "stricter",
        "adherence",
        "traditional",
        "norm",
        "science",
        "represented",
        "feminist",
        "critique",
        "identifying",
        "bias",
        "example",
        "bleier",
        "hubbard",
        "longino",
        "doell",
        "feminist",
        "standpoint",
        "theory",
        "according",
        "harding",
        "argues",
        "political",
        "engagement",
        "feminist",
        "corresponding",
        "focus",
        "life",
        "woman",
        "lead",
        "epistemically",
        "privileged",
        "standpoint",
        "social",
        "reality",
        "example",
        "hartsock",
        "rose",
        "smith",
        "political",
        "engagement",
        "requirement",
        "distinguishing",
        "idea",
        "standpoint",
        "generic",
        "idea",
        "perspective",
        "contrast",
        "feminist",
        "postmodernism",
        "skeptical",
        "universal",
        "claim",
        "reason",
        "progress",
        "science",
        "argues",
        "political",
        "solidarity",
        "across",
        "social",
        "location",
        "ground",
        "feminist",
        "finding",
        "independent",
        "epistemological",
        "grounding",
        "example",
        "flax",
        "haraway",
        "feminist",
        "epistemology",
        "continued",
        "multiply",
        "throughout",
        "s",
        "early",
        "s",
        "quickly",
        "crossfertilizing",
        "process",
        "undermining",
        "harding",
        "classification",
        "system",
        "current",
        "work",
        "feminist",
        "epistemology",
        "fall",
        "unequivocally",
        "single",
        "category",
        "given",
        "harding",
        "three",
        "original",
        "definition",
        "example",
        "leading",
        "theory",
        "feminist",
        "empiricism",
        "s",
        "little",
        "common",
        "harding",
        "characterization",
        "feminist",
        "empiricism",
        "given",
        "explain",
        "past",
        "instance",
        "sexism",
        "androcentrism",
        "simply",
        "bad",
        "science",
        "accept",
        "traditional",
        "norm",
        "science",
        "appropriate",
        "corrective",
        "longino",
        "nelson",
        "even",
        "harding",
        "developed",
        "position",
        "blend",
        "standpoint",
        "theory",
        "feminist",
        "postmodernism",
        "harding",
        "spite",
        "significant",
        "limitation",
        "however",
        "harding",
        "division",
        "still",
        "often",
        "cited",
        "remain",
        "useful",
        "characterizing",
        "main",
        "direction",
        "literature",
        "much",
        "early",
        "work",
        "feminist",
        "social",
        "epistemology",
        "highly",
        "critical",
        "many",
        "mainstream",
        "epistemological",
        "approach",
        "feminist",
        "turned",
        "reconstructive",
        "project",
        "early",
        "s",
        "however",
        "focused",
        "criticism",
        "particular",
        "version",
        "epistemology",
        "recognizing",
        "existing",
        "epistemology",
        "equally",
        "difficult",
        "work",
        "particular",
        "postkuhnian",
        "historicallyoriented",
        "philosophy",
        "science",
        "well",
        "naturalized",
        "epistemology",
        "proved",
        "important",
        "resource",
        "besides",
        "fact",
        "many",
        "feminist",
        "particularly",
        "interested",
        "working",
        "science",
        "dominant",
        "force",
        "society",
        "also",
        "found",
        "many",
        "form",
        "philosophy",
        "science",
        "comparatively",
        "open",
        "social",
        "analysis",
        "openness",
        "stem",
        "recognition",
        "historically",
        "dynamic",
        "nature",
        "knowledge",
        "often",
        "evident",
        "analytic",
        "epistemology",
        "focus",
        "general",
        "condition",
        "knowledge",
        "rather",
        "specific",
        "methodology",
        "activity",
        "science",
        "even",
        "prominently",
        "naturalized",
        "epistemology",
        "proven",
        "conducive",
        "analysis",
        "role",
        "gender",
        "knowing",
        "demand",
        "look",
        "see",
        "turning",
        "empirical",
        "evidence",
        "fact",
        "know",
        "rather",
        "making",
        "priori",
        "announcement",
        "concerning",
        "know",
        "thus",
        "easy",
        "certain",
        "form",
        "analytical",
        "epistemology",
        "dismiss",
        "feminist",
        "empirical",
        "finding",
        "role",
        "gender",
        "knowledge",
        "irrelevant",
        "question",
        "serious",
        "epistemological",
        "import",
        "naturalized",
        "epistemology",
        "insists",
        "empirical",
        "finding",
        "must",
        "something",
        "important",
        "tell",
        "u",
        "knowledge",
        "production",
        "minimum",
        "must",
        "accounted",
        "hence",
        "naturalized",
        "epistemology",
        "consistently",
        "dismiss",
        "finding",
        "role",
        "gender",
        "despite",
        "individualism",
        "many",
        "naturalized",
        "epistemology",
        "naturalized",
        "approach",
        "operate",
        "strong",
        "argument",
        "social",
        "epistemology",
        "looking",
        "human",
        "being",
        "know",
        "leaf",
        "little",
        "doubt",
        "vast",
        "majority",
        "knowing",
        "take",
        "place",
        "socially",
        "even",
        "socially",
        "understood",
        "minimal",
        "sense",
        "individual",
        "interacting",
        "exchanging",
        "information",
        "social",
        "interaction",
        "potential",
        "infused",
        "dynamic",
        "gender",
        "opening",
        "door",
        "analysis",
        "gender",
        "affect",
        "knowledge",
        "exchange",
        "rejecting",
        "individualism",
        "many",
        "feminist",
        "epistemologist",
        "relied",
        "heavily",
        "resource",
        "quine",
        "overall",
        "naturalized",
        "approach",
        "specific",
        "holistic",
        "theory",
        "evidence",
        "antony",
        "campbell",
        "nelson",
        "feminist",
        "followed",
        "adopting",
        "strongly",
        "pragmatic",
        "model",
        "encouraging",
        "empirical",
        "process",
        "decision",
        "making",
        "truth",
        "assigned",
        "locally",
        "fallibly",
        "issue",
        "skepticism",
        "plagued",
        "epistemology",
        "demoted",
        "clough",
        "throughout",
        "s",
        "output",
        "work",
        "feminist",
        "social",
        "epistemology",
        "rich",
        "varied",
        "early",
        "decade",
        "substantive",
        "work",
        "appeared",
        "feminist",
        "philosophy",
        "science",
        "harding",
        "longino",
        "nelson",
        "along",
        "significant",
        "development",
        "standpoint",
        "theory",
        "collins",
        "harding",
        "postmodern",
        "feminist",
        "epistemology",
        "haraway",
        "analysis",
        "role",
        "subjectivity",
        "knowing",
        "code",
        "mids",
        "article",
        "feminist",
        "social",
        "epistemology",
        "making",
        "appearance",
        "numerous",
        "mainstream",
        "analytic",
        "philosophical",
        "journal",
        "special",
        "issue",
        "devoted",
        "feminist",
        "epistemology",
        "monist",
        "philosophical",
        "topic",
        "synthese",
        "throughout",
        "decade",
        "work",
        "feminist",
        "social",
        "epistemologist",
        "addressed",
        "many",
        "issue",
        "taken",
        "social",
        "epistemologist",
        "well",
        "dynamic",
        "testimony",
        "relation",
        "cognitive",
        "authority",
        "communal",
        "analysis",
        "evidence",
        "epistemic",
        "agency",
        "social",
        "structure",
        "scientific",
        "knowledge",
        "social",
        "conception",
        "objectivity",
        "understanding",
        "knowledge",
        "social",
        "practice",
        "social",
        "epistemology",
        "devoted",
        "special",
        "issue",
        "feminist",
        "epistemology",
        "social",
        "epistemology",
        "noted",
        "social",
        "epistemology",
        "feminist",
        "epistemology",
        "shared",
        "many",
        "challenge",
        "similarly",
        "positioned",
        "dominant",
        "epistemological",
        "tradition",
        "hypernormative",
        "individualistic",
        "analysis",
        "grasswick",
        "webb",
        "journal",
        "episteme",
        "began",
        "journal",
        "social",
        "epistemology",
        "though",
        "later",
        "broadened",
        "scope",
        "cover",
        "individual",
        "social",
        "epistemology",
        "devoted",
        "two",
        "issue",
        "question",
        "epistemic",
        "relevance",
        "diversity",
        "yet",
        "despite",
        "feminist",
        "epistemology",
        "shared",
        "interest",
        "others",
        "developing",
        "field",
        "social",
        "epistemology",
        "perhaps",
        "le",
        "crosspollination",
        "year",
        "one",
        "might",
        "expect",
        "partial",
        "explanation",
        "lie",
        "different",
        "intellectual",
        "agenda",
        "drive",
        "development",
        "respective",
        "field",
        "including",
        "fact",
        "nonfeminist",
        "social",
        "epistemologist",
        "generally",
        "le",
        "political",
        "agenda",
        "feminist",
        "social",
        "epistemologist",
        "example",
        "feminist",
        "social",
        "epistemology",
        "driven",
        "focused",
        "epistemological",
        "question",
        "directly",
        "pertinent",
        "knowing",
        "condition",
        "oppression",
        "condition",
        "significant",
        "feminist",
        "come",
        "understand",
        "ultimately",
        "direction",
        "feminist",
        "social",
        "epistemology",
        "field",
        "guided",
        "need",
        "challenge",
        "feminist",
        "theory",
        "activism",
        "good",
        "example",
        "evident",
        "shift",
        "broadening",
        "social",
        "identity",
        "category",
        "taken",
        "epistemically",
        "relevant",
        "feminist",
        "theory",
        "guise",
        "developed",
        "throughout",
        "s",
        "early",
        "s",
        "became",
        "apparent",
        "gender",
        "significant",
        "social",
        "category",
        "importantly",
        "gender",
        "could",
        "properly",
        "understood",
        "isolation",
        "social",
        "category",
        "race",
        "ethnicity",
        "class",
        "sexuality",
        "ability",
        "status",
        "global",
        "location",
        "many",
        "feminist",
        "theorist",
        "criticized",
        "ground",
        "focus",
        "gender",
        "assumed",
        "commonality",
        "across",
        "woman",
        "paid",
        "inadequate",
        "attention",
        "way",
        "one",
        "person",
        "gendered",
        "experience",
        "simultaneously",
        "shaped",
        "social",
        "position",
        "feminist",
        "commitment",
        "investigating",
        "role",
        "power",
        "relation",
        "epistemic",
        "matter",
        "whatever",
        "form",
        "took",
        "soon",
        "revealed",
        "relevant",
        "power",
        "relation",
        "complex",
        "dynamic",
        "result",
        "feminist",
        "social",
        "epistemology",
        "began",
        "attend",
        "closely",
        "intersection",
        "various",
        "social",
        "category",
        "alcoff",
        "potter",
        "noted",
        "feminist",
        "epistemology",
        "longer",
        "taken",
        "involving",
        "commitment",
        "gender",
        "primary",
        "axis",
        "oppression",
        "sense",
        "primary",
        "positing",
        "gender",
        "theoretical",
        "variable",
        "separable",
        "ax",
        "oppression",
        "susceptible",
        "unique",
        "analysis",
        "alcoff",
        "potter",
        "nevertheless",
        "suggested",
        "continued",
        "use",
        "term",
        "feminist",
        "epistemology",
        "marking",
        "body",
        "work",
        "historically",
        "evolved",
        "concern",
        "relation",
        "gender",
        "knowledge",
        "alcoff",
        "potter"
    ]
}