{
    "main_text": "Critique of Classical Approaches to Selfhood\n1. Critique of Classical Approaches to Selfhood\n\nModern philosophy in the West championed the individual. Extending\ninto contemporary moral and political thought is the idea that the\nself is a free, rational chooser and actor—an autonomous agent.\nTwo views of the self dominate this milieu: a Kantian ethical subject\nand a utilitarian “homo economicus”. Nevertheless, these\ntwo views differ in their emphasis. The Kantian ethical subject uses\nreason to transcend cultural norms and personal preferences in order\nto discover absolute truth, whereas homo economicus uses reason to\nrank desires in a coherent order and to figure out how to maximize\ndesire satisfaction with the instrumental rationality of the\nmarketplace. Both of these conceptions of the self minimize the\npersonal and ethical import of unchosen circumstances, interpersonal\nrelationships, and biosocial forces. They isolate the individual from\nits relationships and environment, as well as reinforcing a modern\nbinary that divides the social sphere into autonomous agents and\ndependents. For the Kantian ethical subject, emotional and social\nbonds imperil objectivity and undermine rational commitment to duty.\nFor homo economicus, it makes no difference which forces shape\none’s desires, provided they do not result from coercion or\nfraud, and one’s ties to other people are to be factored into\none’s calculations along with the rest of one’s desires.\nFor these prevailing conceptions of the self, structural domination\nand subordination are thought not to penetrate the “inner\ncitadel” of selfhood. The multiple, sometimes fractious sources\nof social identity constituted at the intersections of one’s\ngender, sexual orientation, race, class, age, ethnicity, ability, and\nso forth, are ignored. Likewise, these conceptions deny the complexity\nof the intrapsychic world of unconscious fantasies, fears, and\ndesires, and they overlook the ways in which such dynamics intrude\nupon conscious life. The modern philosophical construct of the\nrational subject projects a self that is not prey to ambivalence,\nanxiety and depression, obsession, prejudice, hatred, or violence. A\ndisembodied mind, the body is peripheral—a source of desires for\nhomo economicus to weigh and a distracting temptation to the Kantian\nethical subject. Age, looks, sexuality, biological composition, and\nphysical competencies are considered extraneous to the self.\n\nYet, as valuable as rational analysis and free choice undoubtedly are,\nsome feminists argue that these capacities do not operate apart from\nthe phenomenon we call the self. As such, feminist philosophers have\ncharged that dominant views of the self as rational and independent\nare fundamentally misleading. Although represented as genderless,\nraceless, ageless, and classless, feminists argue that the Kantian\nsubject and homo economicus mask a white, healthy, youthfully\nmiddle-aged, middle- or upper-class, heterosexual, cisgender male\ncitizen. On the Kantian view, he is an impartial judge deliberating\nabout applying universal principles, while on the utilitarian view, he\nis a self-interested bargainer wheeling and dealing in the\nmarketplace.\n\nIt is no accident that law and commerce are both public domains from\nwhich women have historically been excluded. It is no accident,\neither, that the philosophers who originated these views of the self\ntypically endorsed this exclusion. Deeming women emotional and\nunprincipled, these thinkers advocated confining women to the private\ndomestic sphere where their voices could be neutralized and even\ntransformed into virtues, in the role of empathetic, supportive wife,\nvulnerable sexual partner, and nurturing mother. Associated with\nbodies rather than minds, women were tasked with the maintenance of\ntheir own bodies and those of others in a gendered division of labor\n(Rawlinson 2016). The division of values along binary gendered lines\nhas historically been associated with the valorization of the\nmasculine and the stigmatization of the feminine. The masculine realm\nof rational selfhood is a realm of moral decency, principled respect\nfor duties, and prudent good sense. However, femininity has been\nassociated with a sentimental attachment to loved ones that spawns\nfavoritism and compromises principles. Likewise, femininity is\nassociated with immersion in the unpredictable domestic exigencies of\nthe private sphere, while the masculinized self appears as a sturdy\nfortress of integrity in the public domain of dutiful citizenship. The\nself is essentially masculine, and the masculine self is essentially\ngood and wise.\n\nSome feminist philosophers modify and defend these conceptions of the\nself, taking issue only with women’s historical exclusion from\nthem and claiming they should be extended to include women. However,\nthe decontextualized individualism and abstraction of reason from\nother capacities inherent in these two dominant views trouble many\nfeminist philosophers and have led them to seek alternative\nperspectives on the self. Many claim that the misogynist heritage of\nthe Kantian subject and homo economicus cannot be remedied simply by\nadvocating equal selves for women. Rather, these very conceptions of\nthe self are gendered. In Western culture, the mind and reason are\ncoded masculine, whereas the body and emotion are coded feminine\n(Irigaray 1985b; Lloyd 1984). To identify the self with the rational\nmind is, then, to masculinize the self according to entrenched\nstereotypes. Far from being apolitical, this conception of the self\nperpetuates neoliberal inequalities by teaching women to value\neconomic success and social independence in a way that requires the\ncontinual exploitation of other, less privileged, women (Oksala 2016;\nArruzza, Bhattacharya, and Fraser 2019).\n\nThe philosophical preeminence of the masculine over the feminine rests\non untenable assumptions about the transparency of the self, the\nimmunity of the self to social influences, and the reliability of\nreason to correct distorted moral judgment. People grow up in social\nenvironments saturated with culturally normative prejudice and\nimplicit bias, even in communities where overt forms of bigotry are\nstrictly proscribed (Meyers 1994). Although official norms uphold the\nvalues of equality and tolerance, cultures continue to transmit\ncamouflaged messages of the inferiority of historically subordinated\nsocial groups through stereotypes and other imagery. These deeply\ningrained schemas commonly structure attitudes, perceptions,\nbehavioral habits, judgment, and compassion or empathy despite the\nindividual’s conscious good will (Fischer 2014; Sullivan 2001\nand 2015; Valian 1998; Collins 1990). As Kate Manne elaborates,\nmisogynist norms skew empathy in favor of men in what she calls\n“himpathy” (Manne 2019). These norms also render societies more likely to believe\nthe testimony of those who are privileged and to diminish the\nperspectives of those not considered objective, rational knowers\n(Fricker 2007). As a\nresult, people often consider themselves objective and fair while\nsystematically discriminating against “different” others\n(Piper 1990; Young 1990). Such prejudice cannot be dispelled through\nrational reflection alone (Meyers 1994; Al-Saji 2014). In effect,\nthen, the conception of the unbiased rational self countenances\n“innocent” wrongdoing and reinforcement of the social\nstratification that privileges an elite whom this conception takes as\nparadigmatic.\n\nThe nullification of women’s selfhood was once explicitly\ncodified in Anglo-European and American law. The legal doctrine of\ncoverture held that a woman’s personhood was absorbed into that\nof her husband when she married (McDonagh 1996). Assuming her\nhusband’s surname symbolized the denial of the wife’s\nseparate identity. In addition, coverture deprived the wife of her\nright to bodily integrity, since rape and other forms of physical\nabuse within marriage were not recognized as crimes. She lost her\nright to owning property, controlling her own earnings, and making\ncontracts in her own name. Lacking the right to vote or serve on\njuries, she was a second-class citizen whose enfranchised husband\npurportedly represented her politically. Although coverture has been\nrescinded, vestiges of this denial of women’s selfhood can be\ndiscerned in recent legal rulings and in contemporary culture. For\nexample, pregnant women remain vulnerable to legally sanctioned\nviolations of their bodily integrity and legal autonomy, especially if\nthey lack race and class privilege (Bordo 1993; Brown 1998).\nSelflessness remains the pregnant woman’s legal status.\nMoreover, the stereotype of feminine selflessness still thrives in the\npopular imagination. Any self-confident, self-assertive woman is out\nof step with prevalent gender norms, and a mother who is not\nunstintingly devoted to her children is likely to be perceived as\nselfish or even a welfare “fraud” and to face severe\nsocial censure and deprivation of social services (Sparks, 2015).\n\nComplementing this line of argument, a number of feminists argue that\nthe very ideal of an independent, rational self has invidious social\nconsequences. To realize this ideal, it is necessary to repress inner\nconflict and to police the rigid boundaries of a purified self. Alien\ndesires and impulses are consigned to the unconscious, but this\nunconscious material inevitably intrudes upon conscious life and\ninfluences people’s attitudes and desires. In particular, the\nfeared and despised Other within is projected onto “other”\nsocial groups, and hatred and contempt are redirected at these\nimagined enemies (Kristeva 1988 [1991]; McAfee 2019; Scheman 1993).\nMisogyny and other forms of bigotry are thus borne of the demand that\nthe self be decisive, invulnerable, and unitary together with the\nimpossibility of meeting this demand. Worse still, these irrational\nhatreds cannot be cured unless this demand for self-mastery is\nrepudiated, but to repudiate it is to be resigned to a degraded,\nfeminized self whose concerns are not taken seriously. Indeed,\nall-too-often women’s protests are dismissed as those of a\nhysteric or killjoy (Ahmed 2017). Far from functioning as the\nguarantor of moral probity, the fictive Kantian self is the condition\nfor the possibility of intractable animosity and injustice.\n\nA further problem with the traditional modern views from a feminist\nstandpoint is that they fail to furnish an account of internalized\noppression and the process of overcoming it. It is common for women to\ncomport themselves in a feminine fashion, to scale down their\naspirations, and to embrace gender-compliant goals (Irigaray 1985a;\nBartky 1990; Babbitt 1993; Cudd 2006; Beauvoir 1949 [2011]). Feminists\naccount for this phenomenon by explaining that women internalize\npatriarchal norms: these norms are integrated into the cognitive,\nemotional, and conative structure of the self. Women may contribute to\ntheir own oppression without realizing it. At times, warped norms may\neven lead women to question their own sanity through a process that\nKate Abramson terms “gaslighting”. A gaslighted woman may\nlose her sense of self to the point where depression and grieving is\nappropriate (Abramson 2014). Once embedded in a woman’s psychic economy,\ninternalized oppression conditions her core desires. To maximize\ndesire-satisfaction, then, would be to collaborate in her own\noppression. Homo economicus’s equation of fulfillment with\ndesire-satisfaction is unable to get out of this bind.\n\nFinally, in dominant conceptions of the self, no one seems to be born\nand raised, for caregivers and birth mothers are driven offstage\n(Irigaray 1985b; Baier 1987; Code 1987; Held 1987; Willett 1995 and 2001; Kittay 1999; LaChance\nAdams and Lundquist 2012). The self appears to materialize on its own\nwith a starter set of basic physical desires and rational skills. No\none’s powers ever seem to deteriorate or change in different\ncontexts. Since dependency and vulnerability are denied, all\naffiliations are assumed to be freely chosen, and all transactions\nfreely negotiated. The repudiation of caregiving underwrites the\nvoluntaristic illusion of independence that characterizes the Kantian\nethical subject and homo economicus—and it is no coincidence\nhere that caregiving has traditionally been women’s work.\nAlternative virtues, such as care, love, tenderness, spontaneity, and\ninterdependence are registered as defeats for the “Man with the\nPlan” rather than aspects of resilient selfhood and a fluid\nsense of agency (Baier 1987; Koziej 2019). The mother cultivating a\n“social erotic” between herself and her infant through the\ndance of affect attunements (Willett 1995 and 2001), like the lover\nembracing the unexpected, transgress rigid modern norms of\nselfhood.\n\nFeminist critique exposes the partiality of the ostensibly universal\nKantian ethical subject and homo economicus. These conceptions of the\nself are: (1) androcentric because they replicate masculine\nstereotypes and ideals; (2) sexist because they demean anything that\nsmacks of the feminine; (3) masculinist because they help to\nperpetuate male dominance; and (4) elitist because they perpetuate\nother associated biases, including heterosexist, transphobic, racist,\nethnocentric, ableist, classist, and, arguably, speciesist biases\n(Haraway 2008). While the latter dimensions of these prevalent\nconceptions of the self are outside the scope of this article, these\nproblems cannot be disentangled from the larger critique and efforts\nat reconceptualizing a self that do not duplicate the modernist\nAnglo-European structures of dominance.\n",
    "section_title": "1. Critique of Classical Approaches to Selfhood",
    "entry_title": "Feminist Perspectives on the Self",
    "hierarchy_title": "Feminist Perspectives on the Self || Critique of Classical Approaches to Selfhood",
    "tokenized_text": [
        "critique",
        "classical",
        "approach",
        "selfhood",
        "critique",
        "classical",
        "approach",
        "selfhood",
        "modern",
        "philosophy",
        "west",
        "championed",
        "individual",
        "extending",
        "contemporary",
        "moral",
        "political",
        "thought",
        "idea",
        "self",
        "free",
        "rational",
        "chooser",
        "actoran",
        "autonomous",
        "agent",
        "two",
        "view",
        "self",
        "dominate",
        "milieu",
        "kantian",
        "ethical",
        "subject",
        "utilitarian",
        "homo",
        "economicus",
        "nevertheless",
        "two",
        "view",
        "differ",
        "emphasis",
        "kantian",
        "ethical",
        "subject",
        "us",
        "reason",
        "transcend",
        "cultural",
        "norm",
        "personal",
        "preference",
        "order",
        "discover",
        "absolute",
        "truth",
        "whereas",
        "homo",
        "economicus",
        "us",
        "reason",
        "rank",
        "desire",
        "coherent",
        "order",
        "figure",
        "maximize",
        "desire",
        "satisfaction",
        "instrumental",
        "rationality",
        "marketplace",
        "conception",
        "self",
        "minimize",
        "personal",
        "ethical",
        "import",
        "unchosen",
        "circumstance",
        "interpersonal",
        "relationship",
        "biosocial",
        "force",
        "isolate",
        "individual",
        "relationship",
        "environment",
        "well",
        "reinforcing",
        "modern",
        "binary",
        "divide",
        "social",
        "sphere",
        "autonomous",
        "agent",
        "dependent",
        "kantian",
        "ethical",
        "subject",
        "emotional",
        "social",
        "bond",
        "imperil",
        "objectivity",
        "undermine",
        "rational",
        "commitment",
        "duty",
        "homo",
        "economicus",
        "make",
        "difference",
        "force",
        "shape",
        "one",
        "desire",
        "provided",
        "result",
        "coercion",
        "fraud",
        "one",
        "tie",
        "people",
        "factored",
        "one",
        "calculation",
        "along",
        "rest",
        "one",
        "desire",
        "prevailing",
        "conception",
        "self",
        "structural",
        "domination",
        "subordination",
        "thought",
        "penetrate",
        "inner",
        "citadel",
        "selfhood",
        "multiple",
        "sometimes",
        "fractious",
        "source",
        "social",
        "identity",
        "constituted",
        "intersection",
        "one",
        "gender",
        "sexual",
        "orientation",
        "race",
        "class",
        "age",
        "ethnicity",
        "ability",
        "forth",
        "ignored",
        "likewise",
        "conception",
        "deny",
        "complexity",
        "intrapsychic",
        "world",
        "unconscious",
        "fantasy",
        "fear",
        "desire",
        "overlook",
        "way",
        "dynamic",
        "intrude",
        "upon",
        "conscious",
        "life",
        "modern",
        "philosophical",
        "construct",
        "rational",
        "subject",
        "project",
        "self",
        "prey",
        "ambivalence",
        "anxiety",
        "depression",
        "obsession",
        "prejudice",
        "hatred",
        "violence",
        "disembodied",
        "mind",
        "body",
        "peripherala",
        "source",
        "desire",
        "homo",
        "economicus",
        "weigh",
        "distracting",
        "temptation",
        "kantian",
        "ethical",
        "subject",
        "age",
        "look",
        "sexuality",
        "biological",
        "composition",
        "physical",
        "competency",
        "considered",
        "extraneous",
        "self",
        "yet",
        "valuable",
        "rational",
        "analysis",
        "free",
        "choice",
        "undoubtedly",
        "feminist",
        "argue",
        "capacity",
        "operate",
        "apart",
        "phenomenon",
        "call",
        "self",
        "feminist",
        "philosopher",
        "charged",
        "dominant",
        "view",
        "self",
        "rational",
        "independent",
        "fundamentally",
        "misleading",
        "although",
        "represented",
        "genderless",
        "raceless",
        "ageless",
        "classless",
        "feminist",
        "argue",
        "kantian",
        "subject",
        "homo",
        "economicus",
        "mask",
        "white",
        "healthy",
        "youthfully",
        "middleaged",
        "middle",
        "upperclass",
        "heterosexual",
        "cisgender",
        "male",
        "citizen",
        "kantian",
        "view",
        "impartial",
        "judge",
        "deliberating",
        "applying",
        "universal",
        "principle",
        "utilitarian",
        "view",
        "selfinterested",
        "bargainer",
        "wheeling",
        "dealing",
        "marketplace",
        "accident",
        "law",
        "commerce",
        "public",
        "domain",
        "woman",
        "historically",
        "excluded",
        "accident",
        "either",
        "philosopher",
        "originated",
        "view",
        "self",
        "typically",
        "endorsed",
        "exclusion",
        "deeming",
        "woman",
        "emotional",
        "unprincipled",
        "thinker",
        "advocated",
        "confining",
        "woman",
        "private",
        "domestic",
        "sphere",
        "voice",
        "could",
        "neutralized",
        "even",
        "transformed",
        "virtue",
        "role",
        "empathetic",
        "supportive",
        "wife",
        "vulnerable",
        "sexual",
        "partner",
        "nurturing",
        "mother",
        "associated",
        "body",
        "rather",
        "mind",
        "woman",
        "tasked",
        "maintenance",
        "body",
        "others",
        "gendered",
        "division",
        "labor",
        "rawlinson",
        "division",
        "value",
        "along",
        "binary",
        "gendered",
        "line",
        "historically",
        "associated",
        "valorization",
        "masculine",
        "stigmatization",
        "feminine",
        "masculine",
        "realm",
        "rational",
        "selfhood",
        "realm",
        "moral",
        "decency",
        "principled",
        "respect",
        "duty",
        "prudent",
        "good",
        "sense",
        "however",
        "femininity",
        "associated",
        "sentimental",
        "attachment",
        "loved",
        "one",
        "spawn",
        "favoritism",
        "compromise",
        "principle",
        "likewise",
        "femininity",
        "associated",
        "immersion",
        "unpredictable",
        "domestic",
        "exigency",
        "private",
        "sphere",
        "masculinized",
        "self",
        "appears",
        "sturdy",
        "fortress",
        "integrity",
        "public",
        "domain",
        "dutiful",
        "citizenship",
        "self",
        "essentially",
        "masculine",
        "masculine",
        "self",
        "essentially",
        "good",
        "wise",
        "feminist",
        "philosopher",
        "modify",
        "defend",
        "conception",
        "self",
        "taking",
        "issue",
        "woman",
        "historical",
        "exclusion",
        "claiming",
        "extended",
        "include",
        "woman",
        "however",
        "decontextualized",
        "individualism",
        "abstraction",
        "reason",
        "capacity",
        "inherent",
        "two",
        "dominant",
        "view",
        "trouble",
        "many",
        "feminist",
        "philosopher",
        "led",
        "seek",
        "alternative",
        "perspective",
        "self",
        "many",
        "claim",
        "misogynist",
        "heritage",
        "kantian",
        "subject",
        "homo",
        "economicus",
        "remedied",
        "simply",
        "advocating",
        "equal",
        "self",
        "woman",
        "rather",
        "conception",
        "self",
        "gendered",
        "western",
        "culture",
        "mind",
        "reason",
        "coded",
        "masculine",
        "whereas",
        "body",
        "emotion",
        "coded",
        "feminine",
        "irigaray",
        "b",
        "lloyd",
        "identify",
        "self",
        "rational",
        "mind",
        "masculinize",
        "self",
        "according",
        "entrenched",
        "stereotype",
        "far",
        "apolitical",
        "conception",
        "self",
        "perpetuates",
        "neoliberal",
        "inequality",
        "teaching",
        "woman",
        "value",
        "economic",
        "success",
        "social",
        "independence",
        "way",
        "requires",
        "continual",
        "exploitation",
        "le",
        "privileged",
        "woman",
        "oksala",
        "arruzza",
        "bhattacharya",
        "fraser",
        "philosophical",
        "preeminence",
        "masculine",
        "feminine",
        "rest",
        "untenable",
        "assumption",
        "transparency",
        "self",
        "immunity",
        "self",
        "social",
        "influence",
        "reliability",
        "reason",
        "correct",
        "distorted",
        "moral",
        "judgment",
        "people",
        "grow",
        "social",
        "environment",
        "saturated",
        "culturally",
        "normative",
        "prejudice",
        "implicit",
        "bias",
        "even",
        "community",
        "overt",
        "form",
        "bigotry",
        "strictly",
        "proscribed",
        "meyers",
        "although",
        "official",
        "norm",
        "uphold",
        "value",
        "equality",
        "tolerance",
        "culture",
        "continue",
        "transmit",
        "camouflaged",
        "message",
        "inferiority",
        "historically",
        "subordinated",
        "social",
        "group",
        "stereotype",
        "imagery",
        "deeply",
        "ingrained",
        "schema",
        "commonly",
        "structure",
        "attitude",
        "perception",
        "behavioral",
        "habit",
        "judgment",
        "compassion",
        "empathy",
        "despite",
        "individual",
        "conscious",
        "good",
        "fischer",
        "sullivan",
        "valian",
        "collins",
        "kate",
        "manne",
        "elaborates",
        "misogynist",
        "norm",
        "skew",
        "empathy",
        "favor",
        "men",
        "call",
        "himpathy",
        "manne",
        "norm",
        "also",
        "render",
        "society",
        "likely",
        "believe",
        "testimony",
        "privileged",
        "diminish",
        "perspective",
        "considered",
        "objective",
        "rational",
        "knower",
        "fricker",
        "result",
        "people",
        "often",
        "consider",
        "objective",
        "fair",
        "systematically",
        "discriminating",
        "different",
        "others",
        "piper",
        "young",
        "prejudice",
        "dispelled",
        "rational",
        "reflection",
        "alone",
        "meyers",
        "alsaji",
        "effect",
        "conception",
        "unbiased",
        "rational",
        "self",
        "countenance",
        "innocent",
        "wrongdoing",
        "reinforcement",
        "social",
        "stratification",
        "privilege",
        "elite",
        "conception",
        "take",
        "paradigmatic",
        "nullification",
        "woman",
        "selfhood",
        "explicitly",
        "codified",
        "angloeuropean",
        "american",
        "law",
        "legal",
        "doctrine",
        "coverture",
        "held",
        "woman",
        "personhood",
        "absorbed",
        "husband",
        "married",
        "mcdonagh",
        "assuming",
        "husband",
        "surname",
        "symbolized",
        "denial",
        "wife",
        "separate",
        "identity",
        "addition",
        "coverture",
        "deprived",
        "wife",
        "right",
        "bodily",
        "integrity",
        "since",
        "rape",
        "form",
        "physical",
        "abuse",
        "within",
        "marriage",
        "recognized",
        "crime",
        "lost",
        "right",
        "owning",
        "property",
        "controlling",
        "earnings",
        "making",
        "contract",
        "name",
        "lacking",
        "right",
        "vote",
        "serve",
        "jury",
        "secondclass",
        "citizen",
        "whose",
        "enfranchised",
        "husband",
        "purportedly",
        "represented",
        "politically",
        "although",
        "coverture",
        "rescinded",
        "vestige",
        "denial",
        "woman",
        "selfhood",
        "discerned",
        "recent",
        "legal",
        "ruling",
        "contemporary",
        "culture",
        "example",
        "pregnant",
        "woman",
        "remain",
        "vulnerable",
        "legally",
        "sanctioned",
        "violation",
        "bodily",
        "integrity",
        "legal",
        "autonomy",
        "especially",
        "lack",
        "race",
        "class",
        "privilege",
        "bordo",
        "brown",
        "selflessness",
        "remains",
        "pregnant",
        "woman",
        "legal",
        "status",
        "moreover",
        "stereotype",
        "feminine",
        "selflessness",
        "still",
        "thrives",
        "popular",
        "imagination",
        "selfconfident",
        "selfassertive",
        "woman",
        "step",
        "prevalent",
        "gender",
        "norm",
        "mother",
        "unstintingly",
        "devoted",
        "child",
        "likely",
        "perceived",
        "selfish",
        "even",
        "welfare",
        "fraud",
        "face",
        "severe",
        "social",
        "censure",
        "deprivation",
        "social",
        "service",
        "spark",
        "complementing",
        "line",
        "argument",
        "number",
        "feminist",
        "argue",
        "ideal",
        "independent",
        "rational",
        "self",
        "invidious",
        "social",
        "consequence",
        "realize",
        "ideal",
        "necessary",
        "repress",
        "inner",
        "conflict",
        "police",
        "rigid",
        "boundary",
        "purified",
        "self",
        "alien",
        "desire",
        "impulse",
        "consigned",
        "unconscious",
        "unconscious",
        "material",
        "inevitably",
        "intrudes",
        "upon",
        "conscious",
        "life",
        "influence",
        "people",
        "attitude",
        "desire",
        "particular",
        "feared",
        "despised",
        "within",
        "projected",
        "onto",
        "social",
        "group",
        "hatred",
        "contempt",
        "redirected",
        "imagined",
        "enemy",
        "kristeva",
        "mcafee",
        "scheman",
        "misogyny",
        "form",
        "bigotry",
        "thus",
        "borne",
        "demand",
        "self",
        "decisive",
        "invulnerable",
        "unitary",
        "together",
        "impossibility",
        "meeting",
        "demand",
        "worse",
        "still",
        "irrational",
        "hatred",
        "cured",
        "unless",
        "demand",
        "selfmastery",
        "repudiated",
        "repudiate",
        "resigned",
        "degraded",
        "feminized",
        "self",
        "whose",
        "concern",
        "taken",
        "seriously",
        "indeed",
        "alltoooften",
        "woman",
        "protest",
        "dismissed",
        "hysteric",
        "killjoy",
        "ahmed",
        "far",
        "functioning",
        "guarantor",
        "moral",
        "probity",
        "fictive",
        "kantian",
        "self",
        "condition",
        "possibility",
        "intractable",
        "animosity",
        "injustice",
        "problem",
        "traditional",
        "modern",
        "view",
        "feminist",
        "standpoint",
        "fail",
        "furnish",
        "account",
        "internalized",
        "oppression",
        "process",
        "overcoming",
        "common",
        "woman",
        "comport",
        "feminine",
        "fashion",
        "scale",
        "aspiration",
        "embrace",
        "gendercompliant",
        "goal",
        "irigaray",
        "a",
        "bartky",
        "babbitt",
        "cudd",
        "beauvoir",
        "feminist",
        "account",
        "phenomenon",
        "explaining",
        "woman",
        "internalize",
        "patriarchal",
        "norm",
        "norm",
        "integrated",
        "cognitive",
        "emotional",
        "conative",
        "structure",
        "self",
        "woman",
        "may",
        "contribute",
        "oppression",
        "without",
        "realizing",
        "time",
        "warped",
        "norm",
        "may",
        "even",
        "lead",
        "woman",
        "question",
        "sanity",
        "process",
        "kate",
        "abramson",
        "term",
        "gaslighting",
        "gaslighted",
        "woman",
        "may",
        "lose",
        "sense",
        "self",
        "point",
        "depression",
        "grieving",
        "appropriate",
        "abramson",
        "embedded",
        "woman",
        "psychic",
        "economy",
        "internalized",
        "oppression",
        "condition",
        "core",
        "desire",
        "maximize",
        "desiresatisfaction",
        "would",
        "collaborate",
        "oppression",
        "homo",
        "economicus",
        "equation",
        "fulfillment",
        "desiresatisfaction",
        "unable",
        "get",
        "bind",
        "finally",
        "dominant",
        "conception",
        "self",
        "one",
        "seems",
        "born",
        "raised",
        "caregiver",
        "birth",
        "mother",
        "driven",
        "offstage",
        "irigaray",
        "b",
        "baier",
        "code",
        "held",
        "willett",
        "kittay",
        "lachance",
        "adam",
        "lundquist",
        "self",
        "appears",
        "materialize",
        "starter",
        "set",
        "basic",
        "physical",
        "desire",
        "rational",
        "skill",
        "one",
        "power",
        "ever",
        "seem",
        "deteriorate",
        "change",
        "different",
        "context",
        "since",
        "dependency",
        "vulnerability",
        "denied",
        "affiliation",
        "assumed",
        "freely",
        "chosen",
        "transaction",
        "freely",
        "negotiated",
        "repudiation",
        "caregiving",
        "underwrites",
        "voluntaristic",
        "illusion",
        "independence",
        "characterizes",
        "kantian",
        "ethical",
        "subject",
        "homo",
        "economicusand",
        "coincidence",
        "caregiving",
        "traditionally",
        "woman",
        "work",
        "alternative",
        "virtue",
        "care",
        "love",
        "tenderness",
        "spontaneity",
        "interdependence",
        "registered",
        "defeat",
        "man",
        "plan",
        "rather",
        "aspect",
        "resilient",
        "selfhood",
        "fluid",
        "sense",
        "agency",
        "baier",
        "koziej",
        "mother",
        "cultivating",
        "social",
        "erotic",
        "infant",
        "dance",
        "affect",
        "attunements",
        "willett",
        "like",
        "lover",
        "embracing",
        "unexpected",
        "transgress",
        "rigid",
        "modern",
        "norm",
        "selfhood",
        "feminist",
        "critique",
        "expose",
        "partiality",
        "ostensibly",
        "universal",
        "kantian",
        "ethical",
        "subject",
        "homo",
        "economicus",
        "conception",
        "self",
        "androcentric",
        "replicate",
        "masculine",
        "stereotype",
        "ideal",
        "sexist",
        "demean",
        "anything",
        "smack",
        "feminine",
        "masculinist",
        "help",
        "perpetuate",
        "male",
        "dominance",
        "elitist",
        "perpetuate",
        "associated",
        "bias",
        "including",
        "heterosexist",
        "transphobic",
        "racist",
        "ethnocentric",
        "ableist",
        "classist",
        "arguably",
        "speciesist",
        "bias",
        "haraway",
        "latter",
        "dimension",
        "prevalent",
        "conception",
        "self",
        "outside",
        "scope",
        "article",
        "problem",
        "disentangled",
        "larger",
        "critique",
        "effort",
        "reconceptualizing",
        "self",
        "duplicate",
        "modernist",
        "angloeuropean",
        "structure",
        "dominance"
    ]
}