{
    "main_text": "Feminist Criticisms of the Canon as Misogynist || Synoptic Interpretations of the Philosophical Canon\n1.3 Synoptic Interpretations of the Philosophical Canon\n\n\nThe philosophical canon can allow the luster some of its members to be\ntarnished by feminist criticism, just as it has weathered criticisms\nfrom analytic or continental perspectives. The most radical feminist\ncritics, however, have urged that the canon's central philosophical\nnorms and values, like reason and objectivity, are gendered notions.\nThe synoptic approach considers the Western philosophical tradition as a\nwhole, and argues that its core concepts are gendered male. But, if\nthis is so, then the Western philosophical tradition as a whole, and\nthe central concepts that we have inherited from it, requires critical\nscrutiny by feminists. Moreover, philosophy's self-image as universal\nand objective, rather than particular and biased, is mistaken. \n\n\nFeminist synoptic interpretations of the canon take several forms.\nThe first, exemplified by Genevieve Lloyd's Man of Reason,\nargues that reason and objectivity in the history of philosophy are\ngendered male.[4]\n The way that reason and objectivity are\ngendered male varies as philosophical theory and historical period\nvaries, but the fact that they are gendered is a constant. From\nAristotle to Hume, from Plato to Sartre, reason is associated with\nmaleness. Therefore, the notion of reason that we have inherited,\nwhether we are empiricists or existentialists, requires critical\nscrutiny.\n\n\nThe second form of synoptic interpretation, exemplified by Susan\nBordo's The Flight to Objectivity, argues that the modern\nperiod in philosophy, and, in particular, the philosophy of Descartes,\nis the source of our ideals of reason and objectivity that are gendered\nmale. In other words, this story chronicles a turn in philosophy\ncoincident with the rise of modern science, which generated ideals of\nreason and objectivity that are deeply antagonistic to women and\nfeminism.[5]\n Cartesian rationalism and the norms of\nmodern science mark a decisive break with a philosophical and cultural\ntradition that was more accommodating of female characteristics and\npowers.\n\n\nIt is important to note that Lloyd and Bordo differ not only with\nregard to the historical story they tell concerning the maleness of\nreason, but also with regard to the way they understand that maleness.\nFor Lloyd, the maleness of reason is symbolic and metaphorical rather\nthan cultural or psychological. Lloyd does not intend the maleness of\nreason to refer to either a socially constituted gender category or a\npsychological orientation shared by males. “This book is not a direct\nstudy of gender identity. It seeks rather to contribute to the\nunderstanding of how the male-female distinction operates as a symbol\nin traditional philosophical texts, and of its interactions with\nexplicit philosophical views of reason”.[6]\n In understanding the\nmaleness of reason as symbolic rather than as psychological or social,\nLloyd avoids making a theoretical commitment to any particular\npsychology of sex differences or any particular account of the social\nformation of gender identity. What she gains in flexibility, however,\nshe loses in content, since it is difficult to specify exactly what\nmetaphorical maleness is, and how it is related to psychological or\nsocial maleness. Other feminists have attempted to develop an account\nof how male metaphors and symbols undermine philosophical arguments\n(Rooney 1991).\n\n\nFor Bordo, however, the maleness of Cartesian reason is given both a\nsocial meaning and a psychological content. First, the social meaning\nof maleness: “In the seventeenth century it [the feminine orientation\ntoward the world] was decisively purged from the dominant intellectual\nculture, through the Cartesian ‘rebirthing’ and\nrestructuring of knowledge and the world as masculine”(Bordo 1987:\n100). This social meaning is paired with a psychological consequence:\n“The ‘great Cartesian anxiety,’ although manifestly\nexpressed in epistemological terms, discloses itself as anxiety over\nseparation from the organic female universe”(Bordo 1987: 5). Cartesian\n‘anxiety’ is separation anxiety from mother nature; the\nrational norms of clarity and distinctness are read as symptoms of\nthis anxiety.[7]\n Bordo's social-psychological notion of\nmaleness while rich and explicit, provides a large target for critics\nbecause it is based on a controversial historical thesis (that the 17th\ncentury showed a marked increase in gynophobia) and a disputed\npsychological theory of the family (Object Relations Theory).\n\n\nLuce Irigaray takes a radical stance towards the history of\nphilosophy by trying to indicate what is suppressed and hidden in the\ntradition rather than cataloguing its evident “maleness”. Her work,\nlike Bordo's, makes use of psychoanalytic theory in interpreting texts\nand, like Lloyd's, it explores the symbolic associations of\nphilosophical images and concepts. However, unlike Bordo and Lloyd,\nIrigaray uses highly unconventional methods of interpreting canonical\nphilosophical texts in order to uncover the ways in which the feminine\nor sexual difference is repressed in them. For example, Irigaray uses\nhumor and parody rather than straightforward exegesis, and she points\nto instabilities (contradictions) in philosophical texts as symptoms of\npatriarchal thinking. According to Irigaray, patriarchal thinking\nattempts to achieve universality by repressing sexual difference. But,\nthe presence of contradictions or instabilities in a philosophical text\nis symptomatic of the failure of patriarchal thinking to contain sexual\ndifference. For example, Irigaray might look at the argument we\ndescribed above for considering gender associations with form and\nmatter in Aristotle to be extrinsic, rather than intrinsic, to those\nconcepts, and argue that the fact that Aristotle's hylomorphism as a\nuniversal theory is incompatible with gender associations is a symptom\nof patriarchal thinking rather than evidence that the proposed\ninterpretation is\n mistaken.[8]\n\n\nDespite their different historical stories, and the different ways\nthat they understand the maleness of reason, each of these panoramic\nvisions of the history of philosophy deliver the same moral, which is\nthat the central norms that inform our philosophical culture today are\ngendered male.[9]\n Hence, these synoptic narratives of the\nphilosophical tradition provide historical justifications for feminist\nphilosophers who are critical of our central philosophical norms of\nreason and objectivity. Does the feminist synoptic critical reading of\nthe history of philosophy justify either the conclusion that\ntraditional conceptions of reason ought to be flat-out rejected by\nfeminists or the conclusion that traditional conceptions of reason\nought to be subjected to critical scrutiny?\n\n\nEven if feminist historical arguments are successful in showing that\nphilosophical norms like reason and objectivity are gendered male, this\nconclusion does not justify a flat-out rejection of either traditional\nphilosophy or its norms of reason and objectivity (Witt 1993). Recall\nthe distinction introduced above between intrinsically and\nextrinsically gendered notions. An intrinsically gendered notion is one\nthat necessarily carries implications regarding gender, i.e., if one\nwere to cancel all implications concerning gender, one would be left\nwith a different notion than the original. In contrast, an\nextrinsically gendered notion typically does carry implications\nconcerning gender, but not necessarily so. If the maleness of reason is\nextrinsic to the traditional concept of reason, then the historical\nfact that it was a gendered notion does not justify or require its\nrejection by feminists. If on the other hand, it can be shown that the\nmaleness of reason is intrinsic to it, it still does not follow that\nreason ought to be rejected by feminists. For, the idea the reason is\nintrinsically male-biased would justify a rejection of it only if it\nought to be other than it is. So, what needs to be argued is that\nreason and objectivity would be different, and better, if they were not\ngendered male, but were gender-neutral, gender-inclusive or female.\nBut, if feminist philosophers develop this argument, which they need to\nbuttress the historical argument, then they are reconceptualizing\ntraditional notions of reason and objectivity rather than rejecting\nthem.\n\n\nEven though the work that feminist philosophers have done to show\nthe ways in which traditional conceptions of reason and objectivity are\nassociated with maleness falls short of justifying their rejection,\ntheir work has been valuable in two respects. First, it has established\nthat gender is associated with the central norms of philosophy, a\nconclusion that warrants attention from anyone attempting to understand\nour philosophical tradition. Second, the historical studies raise\nquestions about reason and objectivity that are valuable areas of\ninquiry for contemporary philosophers.\n",
    "section_title": "1.3 Synoptic Interpretations of the Philosophical Canon",
    "entry_title": "Feminist History of Philosophy",
    "hierarchy_title": "Feminist History of Philosophy || Feminist Criticisms of the Canon as Misogynist || Synoptic Interpretations of the Philosophical Canon",
    "tokenized_text": [
        "feminist",
        "criticism",
        "canon",
        "misogynist",
        "synoptic",
        "interpretation",
        "philosophical",
        "canon",
        "synoptic",
        "interpretation",
        "philosophical",
        "canon",
        "philosophical",
        "canon",
        "allow",
        "luster",
        "member",
        "tarnished",
        "feminist",
        "criticism",
        "weathered",
        "criticism",
        "analytic",
        "continental",
        "perspective",
        "radical",
        "feminist",
        "critic",
        "however",
        "urged",
        "canon",
        "s",
        "central",
        "philosophical",
        "norm",
        "value",
        "like",
        "reason",
        "objectivity",
        "gendered",
        "notion",
        "synoptic",
        "approach",
        "considers",
        "western",
        "philosophical",
        "tradition",
        "whole",
        "argues",
        "core",
        "concept",
        "gendered",
        "male",
        "western",
        "philosophical",
        "tradition",
        "whole",
        "central",
        "concept",
        "inherited",
        "requires",
        "critical",
        "scrutiny",
        "feminist",
        "moreover",
        "philosophy",
        "s",
        "selfimage",
        "universal",
        "objective",
        "rather",
        "particular",
        "biased",
        "mistaken",
        "feminist",
        "synoptic",
        "interpretation",
        "canon",
        "take",
        "several",
        "form",
        "first",
        "exemplified",
        "genevieve",
        "lloyd",
        "s",
        "man",
        "reason",
        "argues",
        "reason",
        "objectivity",
        "history",
        "philosophy",
        "gendered",
        "male",
        "way",
        "reason",
        "objectivity",
        "gendered",
        "male",
        "varies",
        "philosophical",
        "theory",
        "historical",
        "period",
        "varies",
        "fact",
        "gendered",
        "constant",
        "aristotle",
        "hume",
        "plato",
        "sartre",
        "reason",
        "associated",
        "maleness",
        "therefore",
        "notion",
        "reason",
        "inherited",
        "whether",
        "empiricist",
        "existentialist",
        "requires",
        "critical",
        "scrutiny",
        "second",
        "form",
        "synoptic",
        "interpretation",
        "exemplified",
        "susan",
        "bordo",
        "s",
        "flight",
        "objectivity",
        "argues",
        "modern",
        "period",
        "philosophy",
        "particular",
        "philosophy",
        "descartes",
        "source",
        "ideal",
        "reason",
        "objectivity",
        "gendered",
        "male",
        "word",
        "story",
        "chronicle",
        "turn",
        "philosophy",
        "coincident",
        "rise",
        "modern",
        "science",
        "generated",
        "ideal",
        "reason",
        "objectivity",
        "deeply",
        "antagonistic",
        "woman",
        "feminism",
        "cartesian",
        "rationalism",
        "norm",
        "modern",
        "science",
        "mark",
        "decisive",
        "break",
        "philosophical",
        "cultural",
        "tradition",
        "accommodating",
        "female",
        "characteristic",
        "power",
        "important",
        "note",
        "lloyd",
        "bordo",
        "differ",
        "regard",
        "historical",
        "story",
        "tell",
        "concerning",
        "maleness",
        "reason",
        "also",
        "regard",
        "way",
        "understand",
        "maleness",
        "lloyd",
        "maleness",
        "reason",
        "symbolic",
        "metaphorical",
        "rather",
        "cultural",
        "psychological",
        "lloyd",
        "intend",
        "maleness",
        "reason",
        "refer",
        "either",
        "socially",
        "constituted",
        "gender",
        "category",
        "psychological",
        "orientation",
        "shared",
        "male",
        "book",
        "direct",
        "study",
        "gender",
        "identity",
        "seek",
        "rather",
        "contribute",
        "understanding",
        "malefemale",
        "distinction",
        "operates",
        "symbol",
        "traditional",
        "philosophical",
        "text",
        "interaction",
        "explicit",
        "philosophical",
        "view",
        "reason",
        "understanding",
        "maleness",
        "reason",
        "symbolic",
        "rather",
        "psychological",
        "social",
        "lloyd",
        "avoids",
        "making",
        "theoretical",
        "commitment",
        "particular",
        "psychology",
        "sex",
        "difference",
        "particular",
        "account",
        "social",
        "formation",
        "gender",
        "identity",
        "gain",
        "flexibility",
        "however",
        "loses",
        "content",
        "since",
        "difficult",
        "specify",
        "exactly",
        "metaphorical",
        "maleness",
        "related",
        "psychological",
        "social",
        "maleness",
        "feminist",
        "attempted",
        "develop",
        "account",
        "male",
        "metaphor",
        "symbol",
        "undermine",
        "philosophical",
        "argument",
        "rooney",
        "bordo",
        "however",
        "maleness",
        "cartesian",
        "reason",
        "given",
        "social",
        "meaning",
        "psychological",
        "content",
        "first",
        "social",
        "meaning",
        "maleness",
        "seventeenth",
        "century",
        "feminine",
        "orientation",
        "toward",
        "world",
        "decisively",
        "purged",
        "dominant",
        "intellectual",
        "culture",
        "cartesian",
        "rebirthing",
        "restructuring",
        "knowledge",
        "world",
        "masculine",
        "bordo",
        "social",
        "meaning",
        "paired",
        "psychological",
        "consequence",
        "great",
        "cartesian",
        "anxiety",
        "although",
        "manifestly",
        "expressed",
        "epistemological",
        "term",
        "discloses",
        "anxiety",
        "separation",
        "organic",
        "female",
        "universe",
        "bordo",
        "cartesian",
        "anxiety",
        "separation",
        "anxiety",
        "mother",
        "nature",
        "rational",
        "norm",
        "clarity",
        "distinctness",
        "read",
        "symptom",
        "anxiety",
        "bordo",
        "s",
        "socialpsychological",
        "notion",
        "maleness",
        "rich",
        "explicit",
        "provides",
        "large",
        "target",
        "critic",
        "based",
        "controversial",
        "historical",
        "thesis",
        "th",
        "century",
        "showed",
        "marked",
        "increase",
        "gynophobia",
        "disputed",
        "psychological",
        "theory",
        "family",
        "object",
        "relation",
        "theory",
        "luce",
        "irigaray",
        "take",
        "radical",
        "stance",
        "towards",
        "history",
        "philosophy",
        "trying",
        "indicate",
        "suppressed",
        "hidden",
        "tradition",
        "rather",
        "cataloguing",
        "evident",
        "maleness",
        "work",
        "like",
        "bordo",
        "s",
        "make",
        "use",
        "psychoanalytic",
        "theory",
        "interpreting",
        "text",
        "like",
        "lloyd",
        "s",
        "explores",
        "symbolic",
        "association",
        "philosophical",
        "image",
        "concept",
        "however",
        "unlike",
        "bordo",
        "lloyd",
        "irigaray",
        "us",
        "highly",
        "unconventional",
        "method",
        "interpreting",
        "canonical",
        "philosophical",
        "text",
        "order",
        "uncover",
        "way",
        "feminine",
        "sexual",
        "difference",
        "repressed",
        "example",
        "irigaray",
        "us",
        "humor",
        "parody",
        "rather",
        "straightforward",
        "exegesis",
        "point",
        "instability",
        "contradiction",
        "philosophical",
        "text",
        "symptom",
        "patriarchal",
        "thinking",
        "according",
        "irigaray",
        "patriarchal",
        "thinking",
        "attempt",
        "achieve",
        "universality",
        "repressing",
        "sexual",
        "difference",
        "presence",
        "contradiction",
        "instability",
        "philosophical",
        "text",
        "symptomatic",
        "failure",
        "patriarchal",
        "thinking",
        "contain",
        "sexual",
        "difference",
        "example",
        "irigaray",
        "might",
        "look",
        "argument",
        "described",
        "considering",
        "gender",
        "association",
        "form",
        "matter",
        "aristotle",
        "extrinsic",
        "rather",
        "intrinsic",
        "concept",
        "argue",
        "fact",
        "aristotle",
        "s",
        "hylomorphism",
        "universal",
        "theory",
        "incompatible",
        "gender",
        "association",
        "symptom",
        "patriarchal",
        "thinking",
        "rather",
        "evidence",
        "proposed",
        "interpretation",
        "mistaken",
        "despite",
        "different",
        "historical",
        "story",
        "different",
        "way",
        "understand",
        "maleness",
        "reason",
        "panoramic",
        "vision",
        "history",
        "philosophy",
        "deliver",
        "moral",
        "central",
        "norm",
        "inform",
        "philosophical",
        "culture",
        "today",
        "gendered",
        "male",
        "hence",
        "synoptic",
        "narrative",
        "philosophical",
        "tradition",
        "provide",
        "historical",
        "justification",
        "feminist",
        "philosopher",
        "critical",
        "central",
        "philosophical",
        "norm",
        "reason",
        "objectivity",
        "feminist",
        "synoptic",
        "critical",
        "reading",
        "history",
        "philosophy",
        "justify",
        "either",
        "conclusion",
        "traditional",
        "conception",
        "reason",
        "ought",
        "flatout",
        "rejected",
        "feminist",
        "conclusion",
        "traditional",
        "conception",
        "reason",
        "ought",
        "subjected",
        "critical",
        "scrutiny",
        "even",
        "feminist",
        "historical",
        "argument",
        "successful",
        "showing",
        "philosophical",
        "norm",
        "like",
        "reason",
        "objectivity",
        "gendered",
        "male",
        "conclusion",
        "justify",
        "flatout",
        "rejection",
        "either",
        "traditional",
        "philosophy",
        "norm",
        "reason",
        "objectivity",
        "witt",
        "recall",
        "distinction",
        "introduced",
        "intrinsically",
        "extrinsically",
        "gendered",
        "notion",
        "intrinsically",
        "gendered",
        "notion",
        "one",
        "necessarily",
        "carry",
        "implication",
        "regarding",
        "gender",
        "ie",
        "one",
        "cancel",
        "implication",
        "concerning",
        "gender",
        "one",
        "would",
        "left",
        "different",
        "notion",
        "original",
        "contrast",
        "extrinsically",
        "gendered",
        "notion",
        "typically",
        "carry",
        "implication",
        "concerning",
        "gender",
        "necessarily",
        "maleness",
        "reason",
        "extrinsic",
        "traditional",
        "concept",
        "reason",
        "historical",
        "fact",
        "gendered",
        "notion",
        "justify",
        "require",
        "rejection",
        "feminist",
        "hand",
        "shown",
        "maleness",
        "reason",
        "intrinsic",
        "still",
        "follow",
        "reason",
        "ought",
        "rejected",
        "feminist",
        "idea",
        "reason",
        "intrinsically",
        "malebiased",
        "would",
        "justify",
        "rejection",
        "ought",
        "need",
        "argued",
        "reason",
        "objectivity",
        "would",
        "different",
        "better",
        "gendered",
        "male",
        "genderneutral",
        "genderinclusive",
        "female",
        "feminist",
        "philosopher",
        "develop",
        "argument",
        "need",
        "buttress",
        "historical",
        "argument",
        "reconceptualizing",
        "traditional",
        "notion",
        "reason",
        "objectivity",
        "rather",
        "rejecting",
        "even",
        "though",
        "work",
        "feminist",
        "philosopher",
        "done",
        "show",
        "way",
        "traditional",
        "conception",
        "reason",
        "objectivity",
        "associated",
        "maleness",
        "fall",
        "short",
        "justifying",
        "rejection",
        "work",
        "valuable",
        "two",
        "respect",
        "first",
        "established",
        "gender",
        "associated",
        "central",
        "norm",
        "philosophy",
        "conclusion",
        "warrant",
        "attention",
        "anyone",
        "attempting",
        "understand",
        "philosophical",
        "tradition",
        "second",
        "historical",
        "study",
        "raise",
        "question",
        "reason",
        "objectivity",
        "valuable",
        "area",
        "inquiry",
        "contemporary",
        "philosopher"
    ]
}