{
    "main_text": "The Metaphysics of Fictional Entities || Possibilism\n1.1 Possibilism\n\nOne way to account for the nonexistence datum is the possibilist\ntheory of fictional entities, which holds that fictional entities\ndo not exist in the actual world but only in some other\npossible worlds. In this respect, fictional entities are thought to be\nlike other merely possible entities such as talking donkeys. According\nto standard versions of the possible worlds framework, some things not\npresent at the actual world exist as talking donkeys at some merely\npossible worlds. Similarly, the possibilist theory holds that Sherlock\nHolmes does not exist in the actual world, although he does exist at\nsome merely possible worlds in which the Holmes stories are fact.\n\nSuch a possibilist theory is faced with a problem of ontological\nindeterminacy. For there is more than one possible world in which\nConan Doyle’s Holmes stories are fact, and in which there is a\nwitty, cocaine-addicted detective called “Holmes” who\nlives at 221B Baker St., has a friend called “Watson”, and\ndoes the things recorded of him in the Holmes stories. Not all of\nthese Holmes-candidates are the same; while they all match each other\nin terms of what the stories say about Holmes, they may be very\ndifferent in other crucial ways—they may have had very different\nchildhoods, including different parents, and so on. (Indeed, when\ncharacters are underdescribed in a story, a single possible world may\ncontain many individuals who fit exactly what the story says about the\ncharacter.) We can now ask: which of these different witty,\ncocaine-addicted detectives is Holmes? (cf. Kaplan 1973: 505–6;\nKripke 1972 [1980: 156–8]). There seems to be no principled way\nof deciding.\n\nKripke suggests that this indeterminacy shows that none of these\npossible entities is Holmes, “[f]or if so, which one?”\n(Kripke 1972 [1980: 157–8]). But suppose, for argument’s\nsake, that this indeterminacy could somehow be resolved, perhaps by\nthe story including details of certain properties that, arguably, only\nHolmes could have, such as his being the only person to have\noriginated from certain gametes. Even in that case, there would be\nstrong reason not to identify Holmes with a merely possible entity. To\nsee this, take a different case, that of the mythical sword Excalibur\nextracted from a rock by King Arthur. Because we know that the story\nof King Arthur is merely fictional, we know that this sword does not\nexist. Its nonexistence would not be threatened by someone’s\ndiscovering an object with the physical properties that the Breton\ncycle ascribes to Excalibur (unless, of course, that gave us reason to\nthink the Breton cycle was based on fact). No matter how similar, an\nactual object that resembles a fictional object would not be that\nfictional object (Kripke 1972 [1980: 157–8]). Now, moving from\nthe actual world to merely possible worlds does not change things: why\nshould Excalibur be identified even with a merely possible\nentity? Had a merely possible entity exactly matching Excalibur in its\nproperties been actual, it would not have been the fictional\nExcalibur, by the Kripkean argument rehearsed above. So how are things\ndifferent if this merely possible Excalibur-like sword remains merely\npossible? In a nutshell, if there is a gap between fiction and\nreality, there is also a gap between fiction and possibility.\n\nThese difficulties for possibilism do not equally affect all versions\nof the doctrine. Consider David Lewis’s version of the doctrine,\nwhich is embedded in his realist account of possible objects (Lewis\n1986). Roughly speaking, Lewis takes a possible individual to be a\nHolmes candidate if it has Holmes’s properties in a possible\nworld in which the Holmes stories are told as known fact (Lewis 1978).\nFor Lewis, each such individual is a part of one world and not part of\nany other world (possible individuals are in a sense\n‘world-bound’ on Lewis’s view); no Holmes candidate\nis therefore identical to any other Holmes candidate. But unlike more\ndoctrinaire possibilists, Lewis can use his counterpart theory (Lewis\n1986) to offer a principled way of counting each such Holmes candidate\nas being Holmes. Suppose you are a reader of the Holmes stories. Each\nHolmes candidate is a counterpart for you of every other Holmes\ncandidate. For even if they should differ substantially in terms of\noverall qualitative similarity, the various Holmes candidates are all\ncounterparts by acquaintance for you (or, as Lewis seems to\nhave thought, for your community of fellow readers)—they are\nall, in their respective worlds, the person called\n“Holmes” whom you or your community (or rather, your\ncounterparts) learn about by reading the Holmes stories, told as known\nfact (cf. Lewis 1983b; Currie 1990: 137–9; Kroon 1994). In\nshort, the fact that there are so many distinct Holmes candidates is\nless embarrassing for Lewis than it is for other possibilists. (See\nalso the suggestion in Sainsbury 2010 (pp. 82–3) that Lewis\ncould have accommodated a plurality of possible Holmes candidates by\nrefusing to identify Holmes with any of them, instead modeling the\nrelation between talk of Holmes and talk of these possible Holmes\ncandidates on the model of the notion of precisification used in\nLewis’s semantics of vagueness.)\n\nLewis’s counterpart theory is not widely accepted, however. In\ngeneral, Kripkean objections against possibilism about fictional\nentities have been more influential. Some have argued, however, that\nsuch objections only succeed if we use a ‘variable domain’\nconception of what there is to quantify over at any particular world,\na conception that allows the set of objects available at one world to\ndiffer from the set of objects available at another world\n(Kripke’s preferred semantics for modal logic is of this kind.)\nSuppose instead that one adopts a version of a ‘fixed\ndomain’ conception of quantification on which one has a\nfictional individual at one’s disposal as a nonexistent entity\nin the actual world and as an existent entity in other possible worlds\n(Priest 2005, Berto 2011). If so, the indeterminacy problem may not\narise. As Priest (2005: 119–20) puts it, we first of all have\nDoyle’s conception of Sherlock Holmes; this Sherlock\nHolmes—the Holmes that Doyle conceives of—is an individual\nin the actual world but it does not exist there; it exists\nonly in other worlds. For Priest, then, Doyle doesn’t\narbitrarily pick one Holmes candidate from among all possible Holmes\ncandidates, each located in its own possible world. Rather, Doyle\nintends a particular individual that does not exist in the\nactual world but instead fits, or realizes, the Holmes stories in some\nother possible worlds. Trivially, this individual is Holmes. (Doyle\nmanages this even though the actual world contains many other possible\nindividuals that don’t exist there but realize the Holmes\nstories in other possible worlds (Priest 2005: 93–4).)\n\nPriest and Berto call their version of possibilism Modal\nMeinongianism because it uses a modal framework to capture\ncentral features of Meinong’s famous account of nonexistent\nobjects (to be discussed below), but also because they see it as a\ndescendent of Richard Routley’s early attempts at defending\nMeinong’s views (cf. Routley 1980). But Modal Meinongianism has\nfaced considerable criticism, some of it directed at its account of\nthe way authors manage to pick out nonexistent objects. One might\nwonder how it is that Doyle is acquainted with a particular Holmes\ncandidate via the intentionality of his thought rather than with any\nof the other Holmes candidates. Is authorial intending a\ncreative act, perhaps, one that first brings it about that\nthere is an object of the right kind, as Thomasson (1999: 90)\nsuggests? All the indications are that Priest and Berto reject this\nview. For them, “an act of pure intention can intend an object\neven when there are other indiscriminable objects” (2005: 142).\nSuch a response has struck a number of critics as deeply problematic:\nwithout the ability to identify Holmes as the unique such-and-such,\nModal Meinongianism seems unable to guarantee that there is a\ndeterminate Holmes (this problem may, in fact, be the reason why\nRoutley himself did not go on to develop a modal version of\nMeinongianism; cf. Kroon 2019). Bueno & Zalta (2017) contrast\nModal Meinongianism’s apparent troubles on this score with the\nresources available for identification in Zalta’s version of\nMeinongianism (for a response, see Priest et al. 2020).\n\nSuch a possibilism also faces another problem. For Priest, as for\nother possibilists, fictional entities do not actually\npossess the properties in terms of which they are characterized in the\nrelevant stories; they only have these properties in (some of) the\nworlds in which they exist. Sherlock Holmes, for instance, is not\nactually a detective since he does not exist. Rather, Holmes is only\npossibly a detective; he is only a detective in possible\nworlds in which he exists. (Note that he is not a detective in\nall the worlds in which he exists, since it is presumably a\ntruth about Holmes that he might not have had the career that he ended\nup with; in some possible worlds, therefore, Holmes exists without\nbeing a detective.) Now, it is admittedly strange to say that a\nfictional object like Holmes is a detective in the very same sense in\nwhich, say, a certain actual member of the New York police force is a\ndetective. But retreating to the possibilist view that Holmes has such\nproperties only in merely possible worlds carries its own costs; for\none thing, it seems to underestimate the role of the actual world in\nvarious familiar relational claims we can make about fictional\nobjects. Consider cases in which we compare such objects with actual\nconcrete individuals. Suppose we say:\n\n(1) Holmes is\ncleverer than any actual detective.\n\n\nWe seem to be saying that Holmes actually has such\ncomparative features, that is, has them in the actual world, not\nmerely in some possible world or other. Suppose that we read (1)\ninstead as saying, à la Priest:\n\n(1P) Holmes\nis possibly cleverer than any actual detective.\n\n\n(More precisely, relative to worlds in which Holmes is as he is\ndescribed to be in the Holmes stories, Holmes has a greater degree of\ncleverness than that possessed by any detective in the actual world;\ncf. Priest 2005: 123.) But no such cross-world way of reading (1)\nmatches the way we would read any other sentence involving a\ncomparison between individuals. Take:\n\n(2) Stalin was\ncrueler than any other actual dictator.\n\n\nIt would clearly be incorrect to read (2) as:\n\n(2P) Stalin\nwas possibly crueler than any other actual\ndictator\n\n\n(say, in the sense that, relative to worlds in which Stalin fits the\northodox account of his activities, Stalin is crueler than any other\ndictator in the actual world). (2) is intended to be a substantive\nclaim about how Stalin actually was, not a claim about how he might\nhave been. In addition, a possibilist reading like (1P) makes it hard\nto make sense of the attitudes we hold towards fictional characters\n(Kroon 2008: 201, 2012). Our belief in Holmes’s great cleverness\nexplains our admiration for Holmes, just as our belief in Anna\nKarenina’s suffering explains our pity for Anna Karenina. It is\nhard to see how our belief in Holmes’s possible\ncleverness could do this. In reply, Priest has insisted that this is\nprecisely how we should understand such claims: Holmes is admired for\nthe things he does in the Holmes worlds, while a real individual such\nas Mandela is admired for what he actually did (2016: 217). But this\nseems to beg the question. Surely the mere fact that there are\npossible worlds in which Stalin dedicates his life to rescuing\nmigrants from death in the Mediterranean sea, say, does not make him\nworthy of admiration in the actual world, although it may make him an\nobject of admiration to people in these other worlds. Why should it be\nany different with Holmes?\n\nThe next approach to fictional entities to be discussed (the (neo-)\nMeinongian approach) is able to avoid such problems. But before we\ndescribe this approach, we should note that Modal Meinongians tend to\nsubscribe to a broader theory than possibilism. As many philosophers\nhave noted, fictional narratives are often inconsistent. The Holmes\nstories, for example, characterize Dr Watson as having a war wound on\na single shoulder, variously given as his left and his right shoulder.\nLewis (1983a: 277–8) suggests that, typically, impossible\nfictions can be dealt with by invoking only possible worlds (on\nLewis’s preferred view, both φ and not-φ can be true in\nsuch an impossible fiction, but not their conjunction). But there are\ndifficulties with this suggestion when extended to certain deeply\nentrenched contradictions. Thus consider certain time-travel stories.\nPriest himself concocts a story that wouldn’t make sense unless\na particular fictional box—Sylvan’s box—was an\nimpossible object (Priest 2005: 125ff.). Philosophers like Priest\ninvoke impossible worlds to deal with such stories, and argue that\nsome fictional objects are impossible objects to the extent that the\nonly worlds in which the stories that characterize them are true are\nimpossible worlds.\n",
    "section_title": "1.1 Possibilism",
    "entry_title": "Fictional Entities",
    "hierarchy_title": "Fictional Entities || The Metaphysics of Fictional Entities || Possibilism",
    "tokenized_text": [
        "metaphysics",
        "fictional",
        "entity",
        "possibilism",
        "possibilism",
        "one",
        "way",
        "account",
        "nonexistence",
        "datum",
        "possibilist",
        "theory",
        "fictional",
        "entity",
        "hold",
        "fictional",
        "entity",
        "exist",
        "actual",
        "world",
        "possible",
        "world",
        "respect",
        "fictional",
        "entity",
        "thought",
        "like",
        "merely",
        "possible",
        "entity",
        "talking",
        "donkey",
        "according",
        "standard",
        "version",
        "possible",
        "world",
        "framework",
        "thing",
        "present",
        "actual",
        "world",
        "exist",
        "talking",
        "donkey",
        "merely",
        "possible",
        "world",
        "similarly",
        "possibilist",
        "theory",
        "hold",
        "sherlock",
        "holmes",
        "exist",
        "actual",
        "world",
        "although",
        "exist",
        "merely",
        "possible",
        "world",
        "holmes",
        "story",
        "fact",
        "possibilist",
        "theory",
        "faced",
        "problem",
        "ontological",
        "indeterminacy",
        "one",
        "possible",
        "world",
        "conan",
        "doyle",
        "holmes",
        "story",
        "fact",
        "witty",
        "cocaineaddicted",
        "detective",
        "called",
        "holmes",
        "life",
        "b",
        "baker",
        "st",
        "friend",
        "called",
        "watson",
        "thing",
        "recorded",
        "holmes",
        "story",
        "holmescandidates",
        "match",
        "term",
        "story",
        "say",
        "holmes",
        "may",
        "different",
        "crucial",
        "waysthey",
        "may",
        "different",
        "childhood",
        "including",
        "different",
        "parent",
        "indeed",
        "character",
        "underdescribed",
        "story",
        "single",
        "possible",
        "world",
        "may",
        "contain",
        "many",
        "individual",
        "fit",
        "exactly",
        "story",
        "say",
        "character",
        "ask",
        "different",
        "witty",
        "cocaineaddicted",
        "detective",
        "holmes",
        "cf",
        "kaplan",
        "kripke",
        "seems",
        "principled",
        "way",
        "deciding",
        "kripke",
        "suggests",
        "indeterminacy",
        "show",
        "none",
        "possible",
        "entity",
        "holmes",
        "f",
        "one",
        "kripke",
        "suppose",
        "argument",
        "sake",
        "indeterminacy",
        "could",
        "somehow",
        "resolved",
        "perhaps",
        "story",
        "including",
        "detail",
        "certain",
        "property",
        "arguably",
        "holmes",
        "could",
        "person",
        "originated",
        "certain",
        "gamete",
        "even",
        "case",
        "would",
        "strong",
        "reason",
        "identify",
        "holmes",
        "merely",
        "possible",
        "entity",
        "see",
        "take",
        "different",
        "case",
        "mythical",
        "sword",
        "excalibur",
        "extracted",
        "rock",
        "king",
        "arthur",
        "know",
        "story",
        "king",
        "arthur",
        "merely",
        "fictional",
        "know",
        "sword",
        "exist",
        "nonexistence",
        "would",
        "threatened",
        "someone",
        "discovering",
        "object",
        "physical",
        "property",
        "breton",
        "cycle",
        "ascribes",
        "excalibur",
        "unless",
        "course",
        "gave",
        "u",
        "reason",
        "think",
        "breton",
        "cycle",
        "based",
        "fact",
        "matter",
        "similar",
        "actual",
        "object",
        "resembles",
        "fictional",
        "object",
        "would",
        "fictional",
        "object",
        "kripke",
        "moving",
        "actual",
        "world",
        "merely",
        "possible",
        "world",
        "change",
        "thing",
        "excalibur",
        "identified",
        "even",
        "merely",
        "possible",
        "entity",
        "merely",
        "possible",
        "entity",
        "exactly",
        "matching",
        "excalibur",
        "property",
        "actual",
        "would",
        "fictional",
        "excalibur",
        "kripkean",
        "argument",
        "rehearsed",
        "thing",
        "different",
        "merely",
        "possible",
        "excaliburlike",
        "sword",
        "remains",
        "merely",
        "possible",
        "nutshell",
        "gap",
        "fiction",
        "reality",
        "also",
        "gap",
        "fiction",
        "possibility",
        "difficulty",
        "possibilism",
        "equally",
        "affect",
        "version",
        "doctrine",
        "consider",
        "david",
        "lewis",
        "version",
        "doctrine",
        "embedded",
        "realist",
        "account",
        "possible",
        "object",
        "lewis",
        "roughly",
        "speaking",
        "lewis",
        "take",
        "possible",
        "individual",
        "holmes",
        "candidate",
        "holmes",
        "property",
        "possible",
        "world",
        "holmes",
        "story",
        "told",
        "known",
        "fact",
        "lewis",
        "lewis",
        "individual",
        "part",
        "one",
        "world",
        "part",
        "world",
        "possible",
        "individual",
        "sense",
        "worldbound",
        "lewis",
        "view",
        "holmes",
        "candidate",
        "therefore",
        "identical",
        "holmes",
        "candidate",
        "unlike",
        "doctrinaire",
        "possibilists",
        "lewis",
        "use",
        "counterpart",
        "theory",
        "lewis",
        "offer",
        "principled",
        "way",
        "counting",
        "holmes",
        "candidate",
        "holmes",
        "suppose",
        "reader",
        "holmes",
        "story",
        "holmes",
        "candidate",
        "counterpart",
        "every",
        "holmes",
        "candidate",
        "even",
        "differ",
        "substantially",
        "term",
        "overall",
        "qualitative",
        "similarity",
        "various",
        "holmes",
        "candidate",
        "counterpart",
        "acquaintance",
        "lewis",
        "seems",
        "thought",
        "community",
        "fellow",
        "reader",
        "they",
        "respective",
        "world",
        "person",
        "called",
        "holmes",
        "community",
        "rather",
        "counterpart",
        "learn",
        "reading",
        "holmes",
        "story",
        "told",
        "known",
        "fact",
        "cf",
        "lewis",
        "b",
        "currie",
        "kroon",
        "short",
        "fact",
        "many",
        "distinct",
        "holmes",
        "candidate",
        "le",
        "embarrassing",
        "lewis",
        "possibilists",
        "see",
        "also",
        "suggestion",
        "sainsbury",
        "pp",
        "lewis",
        "could",
        "accommodated",
        "plurality",
        "possible",
        "holmes",
        "candidate",
        "refusing",
        "identify",
        "holmes",
        "instead",
        "modeling",
        "relation",
        "talk",
        "holmes",
        "talk",
        "possible",
        "holmes",
        "candidate",
        "model",
        "notion",
        "precisification",
        "used",
        "lewis",
        "semantics",
        "vagueness",
        "lewis",
        "counterpart",
        "theory",
        "widely",
        "accepted",
        "however",
        "general",
        "kripkean",
        "objection",
        "possibilism",
        "fictional",
        "entity",
        "influential",
        "argued",
        "however",
        "objection",
        "succeed",
        "use",
        "variable",
        "domain",
        "conception",
        "quantify",
        "particular",
        "world",
        "conception",
        "allows",
        "set",
        "object",
        "available",
        "one",
        "world",
        "differ",
        "set",
        "object",
        "available",
        "another",
        "world",
        "kripke",
        "preferred",
        "semantics",
        "modal",
        "logic",
        "kind",
        "suppose",
        "instead",
        "one",
        "adopts",
        "version",
        "fixed",
        "domain",
        "conception",
        "quantification",
        "one",
        "fictional",
        "individual",
        "one",
        "disposal",
        "nonexistent",
        "entity",
        "actual",
        "world",
        "existent",
        "entity",
        "possible",
        "world",
        "priest",
        "berto",
        "indeterminacy",
        "problem",
        "may",
        "arise",
        "priest",
        "put",
        "first",
        "doyle",
        "conception",
        "sherlock",
        "holmes",
        "sherlock",
        "holmesthe",
        "holmes",
        "doyle",
        "conceives",
        "ofis",
        "individual",
        "actual",
        "world",
        "exist",
        "exists",
        "world",
        "priest",
        "doyle",
        "arbitrarily",
        "pick",
        "one",
        "holmes",
        "candidate",
        "among",
        "possible",
        "holmes",
        "candidate",
        "located",
        "possible",
        "world",
        "rather",
        "doyle",
        "intends",
        "particular",
        "individual",
        "exist",
        "actual",
        "world",
        "instead",
        "fit",
        "realizes",
        "holmes",
        "story",
        "possible",
        "world",
        "trivially",
        "individual",
        "holmes",
        "doyle",
        "manages",
        "even",
        "though",
        "actual",
        "world",
        "contains",
        "many",
        "possible",
        "individual",
        "exist",
        "realize",
        "holmes",
        "story",
        "possible",
        "world",
        "priest",
        "priest",
        "berto",
        "call",
        "version",
        "possibilism",
        "modal",
        "meinongianism",
        "us",
        "modal",
        "framework",
        "capture",
        "central",
        "feature",
        "meinong",
        "famous",
        "account",
        "nonexistent",
        "object",
        "discussed",
        "also",
        "see",
        "descendent",
        "richard",
        "routley",
        "early",
        "attempt",
        "defending",
        "meinong",
        "view",
        "cf",
        "routley",
        "modal",
        "meinongianism",
        "faced",
        "considerable",
        "criticism",
        "directed",
        "account",
        "way",
        "author",
        "manage",
        "pick",
        "nonexistent",
        "object",
        "one",
        "might",
        "wonder",
        "doyle",
        "acquainted",
        "particular",
        "holmes",
        "candidate",
        "via",
        "intentionality",
        "thought",
        "rather",
        "holmes",
        "candidate",
        "authorial",
        "intending",
        "creative",
        "act",
        "perhaps",
        "one",
        "first",
        "brings",
        "object",
        "right",
        "kind",
        "thomasson",
        "suggests",
        "indication",
        "priest",
        "berto",
        "reject",
        "view",
        "act",
        "pure",
        "intention",
        "intend",
        "object",
        "even",
        "indiscriminable",
        "object",
        "response",
        "struck",
        "number",
        "critic",
        "deeply",
        "problematic",
        "without",
        "ability",
        "identify",
        "holmes",
        "unique",
        "suchandsuch",
        "modal",
        "meinongianism",
        "seems",
        "unable",
        "guarantee",
        "determinate",
        "holmes",
        "problem",
        "may",
        "fact",
        "reason",
        "routley",
        "go",
        "develop",
        "modal",
        "version",
        "meinongianism",
        "cf",
        "kroon",
        "bueno",
        "zalta",
        "contrast",
        "modal",
        "meinongianism",
        "apparent",
        "trouble",
        "score",
        "resource",
        "available",
        "identification",
        "zalta",
        "version",
        "meinongianism",
        "response",
        "see",
        "priest",
        "et",
        "al",
        "possibilism",
        "also",
        "face",
        "another",
        "problem",
        "priest",
        "possibilists",
        "fictional",
        "entity",
        "actually",
        "posse",
        "property",
        "term",
        "characterized",
        "relevant",
        "story",
        "property",
        "world",
        "exist",
        "sherlock",
        "holmes",
        "instance",
        "actually",
        "detective",
        "since",
        "exist",
        "rather",
        "holmes",
        "possibly",
        "detective",
        "detective",
        "possible",
        "world",
        "exists",
        "note",
        "detective",
        "world",
        "exists",
        "since",
        "presumably",
        "truth",
        "holmes",
        "might",
        "career",
        "ended",
        "possible",
        "world",
        "therefore",
        "holmes",
        "exists",
        "without",
        "detective",
        "admittedly",
        "strange",
        "say",
        "fictional",
        "object",
        "like",
        "holmes",
        "detective",
        "sense",
        "say",
        "certain",
        "actual",
        "member",
        "new",
        "york",
        "police",
        "force",
        "detective",
        "retreating",
        "possibilist",
        "view",
        "holmes",
        "property",
        "merely",
        "possible",
        "world",
        "carry",
        "cost",
        "one",
        "thing",
        "seems",
        "underestimate",
        "role",
        "actual",
        "world",
        "various",
        "familiar",
        "relational",
        "claim",
        "make",
        "fictional",
        "object",
        "consider",
        "case",
        "compare",
        "object",
        "actual",
        "concrete",
        "individual",
        "suppose",
        "say",
        "holmes",
        "cleverer",
        "actual",
        "detective",
        "seem",
        "saying",
        "holmes",
        "actually",
        "comparative",
        "feature",
        "actual",
        "world",
        "merely",
        "possible",
        "world",
        "suppose",
        "read",
        "instead",
        "saying",
        "à",
        "la",
        "priest",
        "p",
        "holmes",
        "possibly",
        "cleverer",
        "actual",
        "detective",
        "precisely",
        "relative",
        "world",
        "holmes",
        "described",
        "holmes",
        "story",
        "holmes",
        "greater",
        "degree",
        "cleverness",
        "possessed",
        "detective",
        "actual",
        "world",
        "cf",
        "priest",
        "crossworld",
        "way",
        "reading",
        "match",
        "way",
        "would",
        "read",
        "sentence",
        "involving",
        "comparison",
        "individual",
        "take",
        "stalin",
        "crueler",
        "actual",
        "dictator",
        "would",
        "clearly",
        "incorrect",
        "read",
        "p",
        "stalin",
        "possibly",
        "crueler",
        "actual",
        "dictator",
        "say",
        "sense",
        "relative",
        "world",
        "stalin",
        "fit",
        "orthodox",
        "account",
        "activity",
        "stalin",
        "crueler",
        "dictator",
        "actual",
        "world",
        "intended",
        "substantive",
        "claim",
        "stalin",
        "actually",
        "claim",
        "might",
        "addition",
        "possibilist",
        "reading",
        "like",
        "p",
        "make",
        "hard",
        "make",
        "sense",
        "attitude",
        "hold",
        "towards",
        "fictional",
        "character",
        "kroon",
        "belief",
        "holmes",
        "great",
        "cleverness",
        "explains",
        "admiration",
        "holmes",
        "belief",
        "anna",
        "karenina",
        "suffering",
        "explains",
        "pity",
        "anna",
        "karenina",
        "hard",
        "see",
        "belief",
        "holmes",
        "possible",
        "cleverness",
        "could",
        "reply",
        "priest",
        "insisted",
        "precisely",
        "understand",
        "claim",
        "holmes",
        "admired",
        "thing",
        "holmes",
        "world",
        "real",
        "individual",
        "mandela",
        "admired",
        "actually",
        "seems",
        "beg",
        "question",
        "surely",
        "mere",
        "fact",
        "possible",
        "world",
        "stalin",
        "dedicates",
        "life",
        "rescuing",
        "migrant",
        "death",
        "mediterranean",
        "sea",
        "say",
        "make",
        "worthy",
        "admiration",
        "actual",
        "world",
        "although",
        "may",
        "make",
        "object",
        "admiration",
        "people",
        "world",
        "different",
        "holmes",
        "next",
        "approach",
        "fictional",
        "entity",
        "discussed",
        "neo",
        "meinongian",
        "approach",
        "able",
        "avoid",
        "problem",
        "describe",
        "approach",
        "note",
        "modal",
        "meinongians",
        "tend",
        "subscribe",
        "broader",
        "theory",
        "possibilism",
        "many",
        "philosopher",
        "noted",
        "fictional",
        "narrative",
        "often",
        "inconsistent",
        "holmes",
        "story",
        "example",
        "characterize",
        "dr",
        "watson",
        "war",
        "wound",
        "single",
        "shoulder",
        "variously",
        "given",
        "left",
        "right",
        "shoulder",
        "lewis",
        "a",
        "suggests",
        "typically",
        "impossible",
        "fiction",
        "dealt",
        "invoking",
        "possible",
        "world",
        "lewis",
        "preferred",
        "view",
        "φ",
        "notφ",
        "true",
        "impossible",
        "fiction",
        "conjunction",
        "difficulty",
        "suggestion",
        "extended",
        "certain",
        "deeply",
        "entrenched",
        "contradiction",
        "thus",
        "consider",
        "certain",
        "timetravel",
        "story",
        "priest",
        "concocts",
        "story",
        "make",
        "sense",
        "unless",
        "particular",
        "fictional",
        "boxsylvan",
        "boxwas",
        "impossible",
        "object",
        "priest",
        "ff",
        "philosopher",
        "like",
        "priest",
        "invoke",
        "impossible",
        "world",
        "deal",
        "story",
        "argue",
        "fictional",
        "object",
        "impossible",
        "object",
        "extent",
        "world",
        "story",
        "characterize",
        "true",
        "impossible",
        "world"
    ]
}