{
    "main_text": "Objections to Fictionalism and Responses || The Indispensability Argument\n2.1 The Indispensability Argument\n\nBy far the most important and widely discussed argument against\nfictionalism is what’s known as the Quine-Putnam\nindispensability argument (see, e.g., Quine (1948, 1951), Putnam\n(1971), Resnik (1997), and Colyvan (2001)). This argument has been\nformulated in a number of different ways. One very simple version of\nthe argument can be put like this: (i) mathematical sentences form an\nindispensable part of our empirical theories of the physical\nworld—i.e., our theories of physics, chemistry, and so on; (ii)\nwe have good reasons for thinking that these empirical theories are\ntrue, i.e., that they give us accurate pictures of the world;\ntherefore, (iii) we have good reasons to think that our mathematical\nsentences are true and, hence, that fictionalism is false.\n\nFictionalists have developed two different kinds of responses to this\nargument. The first one, due to Field (1980, 2016), can be called the\nnominalization response, and the version of fictionalism it\ngives us can be called hard-road fictionalism. The second\nresponse, developed by Balaguer (1996a, 1998a), Melia (2000), Rosen\n(2001), Yablo (2005), Bueno (2009), and Leng (2010), can be called the\nno-nominalization response, and the version of fictionalism\nit gives us can be called easy-road fictionalism, or\nweasel fictionalism. Moreover, (The names here are due to\nColyvan and Melia; the former speaks of ‘hard-road\nnominalism’ and ‘easy-road nominalism’, and the\nlatter speaks of ‘weasel nominalism’.)\n\nField’s hard-road response is based on the rejection of premise\n(i). He argues that mathematics is, in fact, not\nindispensable to empirical science. Field tries to establish this\nthesis by arguing that our empirical theories can be\nnominalized, i.e., reformulated in a way that avoids\nreference to, and existential quantification over, abstract objects.\nThis is an extremely controversial claim, and it is very difficult to\nestablish, for presumably, one would have to actually carry out the\nnominalization for every one of our empirical theories—thus, the\nname hard-road fictionalism. Field did not try to do this for\nall of our empirical theories. Rather, he tried to motivate his\nposition by explaining how the nominalization would go for one\nempirical theory, namely, Newtonian Gravitation Theory. Now, some\npeople have complained that even if Field’s strategy could work\nfor this one theory, it might not work for other theories, and in\nparticular, Malament (1982) has argued that his strategy would\nnot work in connection with Quantum Mechanics (but see\nBalaguer (1996b and 1998a) for an argument that Field’s strategy\ncan be extended to the case of quantum mechanics, and see\nBueno (2003) for a response). Moreover, there are several other\nobjections that have been raised against Field’s\nprogram—see, e.g., Malament (1982), Shapiro (1983), Resnik\n(1985), and Chihara (1990, chapter 8, section 5). On the other hand,\nthere are other works that develop, or provide motivation for,\nhard-road nominalist views; e.g., Arntzenius and Dorr (2012) develop a\nway to nominalize the theory of differentiable manifolds. At present,\nthe status of the Fieldian hard-road response to the Quine-Putnam\nargument remains controversial.\n\nBalaguer’s easy-road response begins by granting premise (i) of\nthe Quine-Putnam argument—i.e., by granting (for the sake of\nargument) that there do exist indispensable applications of\nmathematics to empirical science. Balaguer’s strategy is simply\nto account for these applications from a fictionalist point of view.\nHis argument can be summarized as follows: If there are any such\nthings as abstract objects, then they are causally inert. But given\nthis, it follows that the truth of empirical science depends upon two\nsets of facts that hold or don’t hold independently of one\nanother. One of these sets of facts is purely platonistic and\nmathematical, and the other is purely physical (or more precisely,\npurely anti-platonistic). Since these two sets of facts hold or\ndon’t hold independently of one another, fictionalists can\nmaintain that (a) there does obtain a set of purely physical facts of\nthe sort required here, i.e., the sort needed to make empirical\nscience true, but (b) there doesn’t obtain a set of purely\nplatonistic facts of the sort required for the truth of empirical\nscience (because there are no such things as abstract objects).\nTherefore, fictionalism is consistent with an essentially realistic\nview of empirical science, because fictionalists can maintain that\neven if there are no such things as mathematical objects and, hence,\nour empirical theories aren’t strictly true, these theories\nstill paint an essentially accurate picture of the physical world,\nbecause the physical world is just the way it needs to be for\nempirical science to be true. In other words, fictionalists can\nmaintain that the physical world “holds up its end of\nthe empirical-science bargain”. Finally, to provide a view of\nwhat mathematics is doing in empirical science, the claim is that it\nfunctions as a descriptive or representational aid. In other words, it\ngives us an easy way of making claims about the physical world. For\ninstance, by making reference to real numbers—or, better, by\nusing terms that purport to refer to real numbers—we\ngive ourselves an easy way of describing the temperature states of\nphysical systems. And Balaguer argues that mathematics can succeed in\nits role as a descriptive aid even if it isn’t true; indeed, he\nargues that truth is simply no help at all in this connection.\n\nOthers have developed similar views. For instance, Melia (2000) argues\nthat we can assert our empirical theories and then simply take\nback the platonistic/mathematical consequences of those\nassertions. And Rosen (2001) argues that fictionalism is epistemically\npermissible because another community of scientists could accept the\nvery same theories that we do while endorsing—or, more to the\npoint, rationally endorsing—a fictionalist attitude\ntoward the mathematical components of their theories. And Bueno (2009)\nargues that mathematics plays a descriptive role in empirical science,\nand because of this, it needn’t be true in order to be\napplicable. And Leng (2010) argues that the indispensability argument\ndoes not refute fictionalism because fictionalists can provide an\nadequate account of the success of science.\n\nYablo (2005, 2002a, 2002b) also develops a view like this (and\nit’s worth noting that his view here draws heavily on the work\nof Walton (1990)). Yablo claims that mathematics appears in science as\na representational aid and that it doesn’t need to be true in\norder to do this well. But his version of the view is a bit different\nbecause he thinks that the sentences of our platonistically formulated\nempirical theories—or at least typical utterances of these\nsentences—are actually true, because their real\ncontents are nominalistic. To use a trivial sort of example,\nconsider the sentence\n\n(M) The number of Martian moons is 2.\n\nAccording to Yablo, typical utterances of sentences like (M) are\nanalogous to ordinary instances of figurative speech, e.g., sentences\nlike\n\n(A) The average mum has 2.4 children.\n\nThe syntactic form of (A) seems to suggest that it’s about an\nactual object known as the average mum; but, of course, it\nisn’t—to read it in this way would be to misunderstand\nwhat people mean when they utter sentences like (A). Likewise,\naccording to Yablo, while it might seem that (M) is making a claim\npartially about an actual object known as 2, it really\nisn’t. Rather, the real content of (M)—i.e., what typical\nutterances of this sentence really say—is that there\nare two Martian moons. And, of course, this claim—i.e., the\nclaim that there are two Martian moons—is not a claim about the\nnumber 2 or any other abstract object; it is nominalistically kosher.\nIn sum, then, the idea here is that fictionalists about pure\nmathematics can endorse a paraphrase nominalist view of mixed\nmathematical sentences.\n\n(It is worth noting that Yablo also seems to think that, at least\nsometimes, pure mathematical sentences have real\ncontents—i.e., really say things—that are nominalistic and\ntrue. For instance, he thinks that, at least sometimes, sentences like\n‘3 + 2 = 5’ say things like if there are three Fs and\ntwo Gs, then (barring overlap) there are five F-or-Gs. Moreover,\nat times, Yablo seems to at least hint at the view that, at least\nsometimes, when we utter sentences like ‘3 is prime,’ what\nwe’re really saying is that ‘3 is prime’ is true or\nacceptable according to the theory (or the story, or the game) of\narithmetic. It’s not clear how seriously Yablo takes this idea,\nhowever; at any rate, it seems pretty clear that if he endorses it at\nall, he thinks it’s true in only some contexts, i.e., of only\nsome pure mathematical utterances. Whatever Yablo’s view is,\nthough, it’s important to note that views of this general\nkind—i.e., views that take pure mathematical sentences to have\nreal contents, or really say things, that are nominalistic and\ntrue—are not versions of fictionalism at all, as that\nview has been defined here. They are rather versions of paraphrase\nnominalism, and so they are subject to the argument against that view\ngiven in section 1.2. We will return (very briefly) to the issue of\nwhether Yablo’s view is really a version of fictionalism in\nsection 2.3.)\n\nFor more on views like Yablo’s, see Plebani (2018) and Berto and\nPlebani (2015). \n\nIt’s worth noting that proponents of easy-road nominalism do not\nprefer their view to Field’s simply because it’s\n“easier”, or because it doesn’t involve a commitment\nto the controversial claim that our empirical theories can be\nnominalized. Melia, Yablo, and Balaguer all argue that the view is\nindependently superior to Field’s view because it fits better\nwith actual scientific practice.\n\nIt’s also worth noting that easy-road responses to the\nQuine-Putnam argument have been developed by people who don’t\nendorse fictionalism—e.g., Sober (1993), Maddy (1995, 1997),\nMortensen (1998), and Azzouni (2004). \n\nA response to the easy-road view has been given by Colyvan (2002,\n2010) and Baker (2005, 2009). They argue that mathematics\ndoesn’t just play a descriptive role in science. It also plays\nan explanatory role. For instance, Baker considers a case\ninvolving various species of periodic cicadas in which the nymphal\nstage is either 13 or 17 years. Why are the nymphal stages 13 or 17\nyears? According to evolutionary biologists, the answer is that 13 and\n17 are prime numbers, and this minimizes intersections with other\nperiodic species. Colyvan and Baker argue that cases like\nthis—cases in which mathematical objects play an indispensable\nrole in the explanations of physical phenomena—provide us with a\nbetter and more powerful version of the indispensability argument.\nIndeed, they argue that if there really are cases involving genuinely\nmathematical explanations of physical phenomena, then easy-road\nversions of fictionalism cannot succeed. But this claim is open to\ndebate, and responses to these explanatory versions of the\nindispensability argument have been given by Melia (2002), Leng\n(2005b), Bangu (2008), Daly and Langford (2009), and Yablo (2012).\n",
    "section_title": "2.1 The Indispensability Argument",
    "entry_title": "Fictionalism in the Philosophy of Mathematics",
    "hierarchy_title": "Fictionalism in the Philosophy of Mathematics || Objections to Fictionalism and Responses || The Indispensability Argument",
    "tokenized_text": [
        "objection",
        "fictionalism",
        "response",
        "indispensability",
        "argument",
        "indispensability",
        "argument",
        "far",
        "important",
        "widely",
        "discussed",
        "argument",
        "fictionalism",
        "known",
        "quineputnam",
        "indispensability",
        "argument",
        "see",
        "eg",
        "quine",
        "putnam",
        "resnik",
        "colyvan",
        "argument",
        "formulated",
        "number",
        "different",
        "way",
        "one",
        "simple",
        "version",
        "argument",
        "put",
        "like",
        "mathematical",
        "sentence",
        "form",
        "indispensable",
        "part",
        "empirical",
        "theory",
        "physical",
        "worldie",
        "theory",
        "physic",
        "chemistry",
        "ii",
        "good",
        "reason",
        "thinking",
        "empirical",
        "theory",
        "true",
        "ie",
        "give",
        "u",
        "accurate",
        "picture",
        "world",
        "therefore",
        "iii",
        "good",
        "reason",
        "think",
        "mathematical",
        "sentence",
        "true",
        "hence",
        "fictionalism",
        "false",
        "fictionalists",
        "developed",
        "two",
        "different",
        "kind",
        "response",
        "argument",
        "first",
        "one",
        "due",
        "field",
        "called",
        "nominalization",
        "response",
        "version",
        "fictionalism",
        "give",
        "u",
        "called",
        "hardroad",
        "fictionalism",
        "second",
        "response",
        "developed",
        "balaguer",
        "a",
        "a",
        "melia",
        "rosen",
        "yablo",
        "bueno",
        "leng",
        "called",
        "nonominalization",
        "response",
        "version",
        "fictionalism",
        "give",
        "u",
        "called",
        "easyroad",
        "fictionalism",
        "weasel",
        "fictionalism",
        "moreover",
        "name",
        "due",
        "colyvan",
        "melia",
        "former",
        "speaks",
        "hardroad",
        "nominalism",
        "easyroad",
        "nominalism",
        "latter",
        "speaks",
        "weasel",
        "nominalism",
        "field",
        "hardroad",
        "response",
        "based",
        "rejection",
        "premise",
        "argues",
        "mathematics",
        "fact",
        "indispensable",
        "empirical",
        "science",
        "field",
        "try",
        "establish",
        "thesis",
        "arguing",
        "empirical",
        "theory",
        "nominalized",
        "ie",
        "reformulated",
        "way",
        "avoids",
        "reference",
        "existential",
        "quantification",
        "abstract",
        "object",
        "extremely",
        "controversial",
        "claim",
        "difficult",
        "establish",
        "presumably",
        "one",
        "would",
        "actually",
        "carry",
        "nominalization",
        "every",
        "one",
        "empirical",
        "theoriesthus",
        "name",
        "hardroad",
        "fictionalism",
        "field",
        "try",
        "empirical",
        "theory",
        "rather",
        "tried",
        "motivate",
        "position",
        "explaining",
        "nominalization",
        "would",
        "go",
        "one",
        "empirical",
        "theory",
        "namely",
        "newtonian",
        "gravitation",
        "theory",
        "people",
        "complained",
        "even",
        "field",
        "strategy",
        "could",
        "work",
        "one",
        "theory",
        "might",
        "work",
        "theory",
        "particular",
        "malament",
        "argued",
        "strategy",
        "would",
        "work",
        "connection",
        "quantum",
        "mechanic",
        "see",
        "balaguer",
        "b",
        "a",
        "argument",
        "field",
        "strategy",
        "extended",
        "case",
        "quantum",
        "mechanic",
        "see",
        "bueno",
        "response",
        "moreover",
        "several",
        "objection",
        "raised",
        "field",
        "programsee",
        "eg",
        "malament",
        "shapiro",
        "resnik",
        "chihara",
        "chapter",
        "section",
        "hand",
        "work",
        "develop",
        "provide",
        "motivation",
        "hardroad",
        "nominalist",
        "view",
        "eg",
        "arntzenius",
        "dorr",
        "develop",
        "way",
        "nominalize",
        "theory",
        "differentiable",
        "manifold",
        "present",
        "status",
        "fieldian",
        "hardroad",
        "response",
        "quineputnam",
        "argument",
        "remains",
        "controversial",
        "balaguer",
        "easyroad",
        "response",
        "begin",
        "granting",
        "premise",
        "quineputnam",
        "argumentie",
        "granting",
        "sake",
        "argument",
        "exist",
        "indispensable",
        "application",
        "mathematics",
        "empirical",
        "science",
        "balaguer",
        "strategy",
        "simply",
        "account",
        "application",
        "fictionalist",
        "point",
        "view",
        "argument",
        "summarized",
        "follows",
        "thing",
        "abstract",
        "object",
        "causally",
        "inert",
        "given",
        "follows",
        "truth",
        "empirical",
        "science",
        "depends",
        "upon",
        "two",
        "set",
        "fact",
        "hold",
        "hold",
        "independently",
        "one",
        "another",
        "one",
        "set",
        "fact",
        "purely",
        "platonistic",
        "mathematical",
        "purely",
        "physical",
        "precisely",
        "purely",
        "antiplatonistic",
        "since",
        "two",
        "set",
        "fact",
        "hold",
        "hold",
        "independently",
        "one",
        "another",
        "fictionalists",
        "maintain",
        "obtain",
        "set",
        "purely",
        "physical",
        "fact",
        "sort",
        "required",
        "ie",
        "sort",
        "needed",
        "make",
        "empirical",
        "science",
        "true",
        "b",
        "obtain",
        "set",
        "purely",
        "platonistic",
        "fact",
        "sort",
        "required",
        "truth",
        "empirical",
        "science",
        "thing",
        "abstract",
        "object",
        "therefore",
        "fictionalism",
        "consistent",
        "essentially",
        "realistic",
        "view",
        "empirical",
        "science",
        "fictionalists",
        "maintain",
        "even",
        "thing",
        "mathematical",
        "object",
        "hence",
        "empirical",
        "theory",
        "strictly",
        "true",
        "theory",
        "still",
        "paint",
        "essentially",
        "accurate",
        "picture",
        "physical",
        "world",
        "physical",
        "world",
        "way",
        "need",
        "empirical",
        "science",
        "true",
        "word",
        "fictionalists",
        "maintain",
        "physical",
        "world",
        "hold",
        "end",
        "empiricalscience",
        "bargain",
        "finally",
        "provide",
        "view",
        "mathematics",
        "empirical",
        "science",
        "claim",
        "function",
        "descriptive",
        "representational",
        "aid",
        "word",
        "give",
        "u",
        "easy",
        "way",
        "making",
        "claim",
        "physical",
        "world",
        "instance",
        "making",
        "reference",
        "real",
        "numbersor",
        "better",
        "using",
        "term",
        "purport",
        "refer",
        "real",
        "numberswe",
        "give",
        "easy",
        "way",
        "describing",
        "temperature",
        "state",
        "physical",
        "system",
        "balaguer",
        "argues",
        "mathematics",
        "succeed",
        "role",
        "descriptive",
        "aid",
        "even",
        "true",
        "indeed",
        "argues",
        "truth",
        "simply",
        "help",
        "connection",
        "others",
        "developed",
        "similar",
        "view",
        "instance",
        "melia",
        "argues",
        "assert",
        "empirical",
        "theory",
        "simply",
        "take",
        "back",
        "platonisticmathematical",
        "consequence",
        "assertion",
        "rosen",
        "argues",
        "fictionalism",
        "epistemically",
        "permissible",
        "another",
        "community",
        "scientist",
        "could",
        "accept",
        "theory",
        "endorsingor",
        "point",
        "rationally",
        "endorsinga",
        "fictionalist",
        "attitude",
        "toward",
        "mathematical",
        "component",
        "theory",
        "bueno",
        "argues",
        "mathematics",
        "play",
        "descriptive",
        "role",
        "empirical",
        "science",
        "true",
        "order",
        "applicable",
        "leng",
        "argues",
        "indispensability",
        "argument",
        "refute",
        "fictionalism",
        "fictionalists",
        "provide",
        "adequate",
        "account",
        "success",
        "science",
        "yablo",
        "a",
        "b",
        "also",
        "develops",
        "view",
        "like",
        "worth",
        "noting",
        "view",
        "draw",
        "heavily",
        "work",
        "walton",
        "yablo",
        "claim",
        "mathematics",
        "appears",
        "science",
        "representational",
        "aid",
        "need",
        "true",
        "order",
        "well",
        "version",
        "view",
        "bit",
        "different",
        "think",
        "sentence",
        "platonistically",
        "formulated",
        "empirical",
        "theoriesor",
        "least",
        "typical",
        "utterance",
        "sentencesare",
        "actually",
        "true",
        "real",
        "content",
        "nominalistic",
        "use",
        "trivial",
        "sort",
        "example",
        "consider",
        "sentence",
        "number",
        "martian",
        "moon",
        "according",
        "yablo",
        "typical",
        "utterance",
        "sentence",
        "like",
        "analogous",
        "ordinary",
        "instance",
        "figurative",
        "speech",
        "eg",
        "sentence",
        "like",
        "average",
        "mum",
        "child",
        "syntactic",
        "form",
        "seems",
        "suggest",
        "actual",
        "object",
        "known",
        "average",
        "mum",
        "course",
        "tto",
        "read",
        "way",
        "would",
        "misunderstand",
        "people",
        "mean",
        "utter",
        "sentence",
        "like",
        "likewise",
        "according",
        "yablo",
        "might",
        "seem",
        "making",
        "claim",
        "partially",
        "actual",
        "object",
        "known",
        "really",
        "rather",
        "real",
        "content",
        "ie",
        "typical",
        "utterance",
        "sentence",
        "really",
        "sayis",
        "two",
        "martian",
        "moon",
        "course",
        "claimie",
        "claim",
        "two",
        "martian",
        "moonsis",
        "claim",
        "number",
        "abstract",
        "object",
        "nominalistically",
        "kosher",
        "sum",
        "idea",
        "fictionalists",
        "pure",
        "mathematics",
        "endorse",
        "paraphrase",
        "nominalist",
        "view",
        "mixed",
        "mathematical",
        "sentence",
        "worth",
        "noting",
        "yablo",
        "also",
        "seems",
        "think",
        "least",
        "sometimes",
        "pure",
        "mathematical",
        "sentence",
        "real",
        "contentsie",
        "really",
        "say",
        "thingsthat",
        "nominalistic",
        "true",
        "instance",
        "think",
        "least",
        "sometimes",
        "sentence",
        "like",
        "say",
        "thing",
        "like",
        "three",
        "f",
        "two",
        "g",
        "barring",
        "overlap",
        "five",
        "forgs",
        "moreover",
        "time",
        "yablo",
        "seems",
        "least",
        "hint",
        "view",
        "least",
        "sometimes",
        "utter",
        "sentence",
        "like",
        "prime",
        "really",
        "saying",
        "prime",
        "true",
        "acceptable",
        "according",
        "theory",
        "story",
        "game",
        "arithmetic",
        "clear",
        "seriously",
        "yablo",
        "take",
        "idea",
        "however",
        "rate",
        "seems",
        "pretty",
        "clear",
        "endorses",
        "think",
        "true",
        "context",
        "ie",
        "pure",
        "mathematical",
        "utterance",
        "whatever",
        "yablo",
        "view",
        "though",
        "important",
        "note",
        "view",
        "general",
        "kindie",
        "view",
        "take",
        "pure",
        "mathematical",
        "sentence",
        "real",
        "content",
        "really",
        "say",
        "thing",
        "nominalistic",
        "trueare",
        "version",
        "fictionalism",
        "view",
        "defined",
        "rather",
        "version",
        "paraphrase",
        "nominalism",
        "subject",
        "argument",
        "view",
        "given",
        "section",
        "return",
        "briefly",
        "issue",
        "whether",
        "yablo",
        "view",
        "really",
        "version",
        "fictionalism",
        "section",
        "view",
        "like",
        "yablo",
        "see",
        "plebani",
        "berto",
        "plebani",
        "worth",
        "noting",
        "proponent",
        "easyroad",
        "nominalism",
        "prefer",
        "view",
        "field",
        "simply",
        "easier",
        "involve",
        "commitment",
        "controversial",
        "claim",
        "empirical",
        "theory",
        "nominalized",
        "melia",
        "yablo",
        "balaguer",
        "argue",
        "view",
        "independently",
        "superior",
        "field",
        "view",
        "fit",
        "better",
        "actual",
        "scientific",
        "practice",
        "also",
        "worth",
        "noting",
        "easyroad",
        "response",
        "quineputnam",
        "argument",
        "developed",
        "people",
        "endorse",
        "fictionalismeg",
        "sober",
        "maddy",
        "mortensen",
        "azzouni",
        "response",
        "easyroad",
        "view",
        "given",
        "colyvan",
        "baker",
        "argue",
        "mathematics",
        "play",
        "descriptive",
        "role",
        "science",
        "also",
        "play",
        "explanatory",
        "role",
        "instance",
        "baker",
        "considers",
        "case",
        "involving",
        "various",
        "specie",
        "periodic",
        "cicada",
        "nymphal",
        "stage",
        "either",
        "year",
        "nymphal",
        "stage",
        "year",
        "according",
        "evolutionary",
        "biologist",
        "answer",
        "prime",
        "number",
        "minimizes",
        "intersection",
        "periodic",
        "specie",
        "colyvan",
        "baker",
        "argue",
        "case",
        "like",
        "thiscases",
        "mathematical",
        "object",
        "play",
        "indispensable",
        "role",
        "explanation",
        "physical",
        "phenomenaprovide",
        "u",
        "better",
        "powerful",
        "version",
        "indispensability",
        "argument",
        "indeed",
        "argue",
        "really",
        "case",
        "involving",
        "genuinely",
        "mathematical",
        "explanation",
        "physical",
        "phenomenon",
        "easyroad",
        "version",
        "fictionalism",
        "succeed",
        "claim",
        "open",
        "debate",
        "response",
        "explanatory",
        "version",
        "indispensability",
        "argument",
        "given",
        "melia",
        "leng",
        "b",
        "bangu",
        "daly",
        "langford",
        "yablo"
    ]
}