{
    "main_text": "Truth in Fiction || Truth in Fiction as Truth in the Worlds of Fiction\n2.1 Truth in Fiction as Truth in the Worlds of Fiction\n\nDavid Lewis provided the classic discussion of this issue in his\n“Truth in Fiction” (first published in 1978, reprinted\nwith postscripts in 1983). His approach has two core ideas. The first\nis that we should adopt a pretense view of fiction. A fiction is a\nstory told by a particular person on a particular occasion, and to\ntell a story is typically to pretend that one is relating an account\nof things that really did happen. The second core idea is the one\nmentioned above: stories are related against a background of (known)\nfacts and beliefs, thereby ensuring that there is more to truth in\nfiction than is stated in stories. The novelty of Lewis’s\napproach is the way he understands this background and its impact in\nterms of the machinery of possible worlds and the semantics of\ncounterfactuals. To put the point in technical jargon, Lewis treats\nin-the-fiction operators as special intensional\noperators.\n\nLewis offers two main analyses. On Analysis 1, the background against\nwhich a story is told is just actuality, appropriately filtered to\nremove whatever is at odds with the story. Truth in a fiction is just\nwhat would have been true had the fiction been told as known\nfact. In terms of Lewis’s possible world analysis of\ncounterfactuals (Lewis 1973), this can be rendered as:\n\n Analysis 1 A sentence of the form\n“In fiction F, φ” is non-vacuously true\nif and only if some world where F is told as known fact and\nφ is true differs less from our actual world, on balance,\nthan does any world where F is told as known fact and\nφ is not true. (1978 [1983: 270])\n\n\nAnalysis 1 easily captures the fact that it is true in the Holmes\nstories that Holmes had a liver, for example (despite no mention being\nmade of this in the stories). It also captures the fact that the\nfictional truth of many claims is simply left indeterminate (while it\nis true in the stories that Holmes had a liver, for example, it is not\ntrue in the stories that he had an average-sized liver). But the\nanalysis also seems to catch too much (Lewis 1978 [1983]; Currie 1990;\nPhillips 1999; Walton 1990; Wolterstorff 1980). Given a story\nS, take any truth p that has no bearing on the events\ndescribed in S. On Lewis’s Analysis 1 it will then be\ntrue in S that p, whether or not anyone believes that\np. If, for example, Napoleon had exactly 100,001 hairs on his\nhead at the battle of Austerlitz, it will then be true in the Holmes\nstories that he did.\n\nIf the unknown proposition p has implications for the events in\nthe story, another problem arises. Take the example mentioned by\nLewis. Suppose, as many think, that the swamp adder in “The\nAdventure of the Speckled Band” (1892) was intended by Doyle to\nbe a Russell’s viper (Lewis 1978 [1983: 271]; but cf. Byrne\n1993: 25, note 5). In the story, Holmes concludes that the murder\nvictim in the story was killed by the snake’s climbing down a\nfake bell-rope. The Russell’s viper is a constrictor, however,\nso it cannot physically climb ropes, and hence\n Analysis 1\n suggests that it is true in “The Speckled Band” that\nHolmes bungled (Lewis 1978 [1983: 271]). But this would clearly be the\nwrong conclusion to draw: what is true in the story is that Holmes was\nright. The fact that Conan Doyle was ignorant of a little known\nbiological fact should not affect what is true in the Holmes\nstories.\n\nThis example suggests that it is (often) better to conceive the\nbackground in epistemic terms. (But maybe not always; as Lewis points\nout, there is a contested critical tradition that uses psychoanalytic\nviews to interpret literary texts, as in the claim that Hamlet had an\nOedipus Complex. Such a claim is probably best understood in terms of\n Analysis 1.)\n Lewis’s Analysis 2 provides such an epistemic orientation. It\ntreats “background” as beliefs that are overt in the\nauthor’s community, where \n\n\na belief [is] overt for a community at a time iff more or less\neveryone shares it, more or less everyone thinks that more or less\neveryone shares it, and so on. (1978 [1983: 272]) \n\n\nTake the collective belief worlds to be the worlds where all the overt\nbeliefs are true. Truth in fiction is what would have been true in the\ncollective belief worlds, had the fiction been told as known fact:\n\n Analysis 2 A sentence of the form\n“In fiction F, φ” is non-vacuously true\niff whenever w is one of the collective belief worlds of the\ncommunity of origin of F, then some world where F is\ntold as known fact and φ is true differs less from\nw, on balance, than does any world where F is told as\nknown fact and φ is not true. (1978 [1983: 273])\n\n\nAnalysis 2 rules out the case of the hairs on Napoleon’s head\nsince there is no number h such that people collectively\nbelieved that Napoleon had h hairs at the battle of Austerlitz\n(at best they accepted very rough upper and lower bounds that allowed\nfor 100,001 hairs but also considerably more or fewer). And the\nanalysis rules out the case of the Speckled Band since the reception\nof the story by its readers showed that the relevant collective belief worlds are all worlds in which there is nothing to prevent swamp adders from climbing\nropes. (In this case, the belief probably did not exist before people\nbegan reading the story, but was acquired as a result of trusting the\nauthor.) But the analysis also has some strikingly counterintuitive\nconsequences. Take a typical Victorian novel that nowhere takes a\nstance on whether God exists. On\n Analysis 2\n it will nonetheless be true in this novel that God exists, simply\nbecause Victorian England was overtly theistic so that the collective\nbelief worlds are all worlds in which God exists (Walton 1990).\nSimilarly, it will be true in many works that there are ghosts, and\nthat women are markedly inferior to men.\n\n\nIn the later postscripts to his paper, Lewis considers some needed\nrevisions to his two accounts. He conjectures, for example, that a\nstory’s explicit content and background may need supplementing\nby “carry-over” of truths from other fictions if we are to\ncapture what is true in a story (Lewis 1978 [1983]; Hanley 2004). But\nthe most widely discussed revision that Lewis mentions, and the one\nthat has generated most debate, concerns the case of impossible\nfictions—fictions that cannot be told as known fact in any\npossible world. We turn to this debate below (Sec 2.4) after reviewing\ntwo other influential accounts of truth in fiction.\n\n\nSome final remarks about the notion of worlds that features in\nLewis’s account and the many accounts inspired by his approach.\nLewis’s worlds are possible worlds.  He himself construes these\nas maximal connected spatio-temporal objects (Lewis 1986), although\nmany others take them to be abstract entities of some kind (see the\nentry on\n possible worlds.)  \n One can accept Lewis’s account of\ntruth in fiction while preferring one of these alternative\nmetaphysical conceptions of possible worlds.  The important point is\nthat the notion of a possible world, no matter how conceived, is a\npiece of modal machinery that has many other roles to play in\nmetaphysics.  It should not be confused with the notion of a fictional\nworld, appealed to by philosophers and non-philosophers alike.\nFictional worlds present themselves as realms, created by authors and\ngenerally incomplete and sometimes inconsistent, that are more or less\ndistant from the real world but despite the distance are at least\npartially accessible from the real world (thus, we can know about\nHolmes and admire him from a distance, even if we can’t help him\nsolve crimes).  But although we often talk about fiction in terms of\nfictional worlds, making literal sense of such talk is fraught with\ndifficulty (Pavel 1986 makes the attempt; Walton 1978 is a salutary\nreminder of what can go wrong), and philosophers have tended to take\nsuch talk with a grain of salt, construing fictional worlds instead as\nsets of fictional truths (Walton 1978; Walton 1990: 64–7) or as sets\nof worlds rather than single worlds (Lewis 1983: 270; Ross 1979:\n49–54). Some have used the notion of a fictional world construed in\nsome such way to provide a kind of linguistic counterpart to the\nmental reality and imaginary models discussed in 1.6, by appealing to\nthe idea of a context of utterance or interpretation.  (For more on\nthe relevant notion of context, see the entry on \n theories of meaning.)\n On such a view, saying that a sentence is aimed at correctly\nrepresenting a fictional world means that the sentence is to be\ninterpreted relative to a context that contains the fictional world\nrather than the actual world as its world parameter.  Consider a\nsentence like “Othello was jealous”.  As uttered in a\ncontext that contains the actual world as its world parameter, this\nsentence is not true since “Othello” refers to nothing\nthere.  But the very same sentence is true in a fictional context that\ncontains the fictional world of Othello as its world parameter, for at\nthat world “Othello” refers to the jealous Venetian\nsoldier of Shakespeare’s play.  This account arguably also\naccommodates the problem of how fiction can contain real truths, as in\nhistorical fiction. In such cases, one and the same sentence, say\n“Napoleon invaded Russia”, can be both actually and\nfictionally true, keeping the very same content in both the real and\nthe fictional context. \n\nThis kind of account yields an alternative construal of in-the-fiction\noperators.  Rather than being a special kind of intensional operator,\nas it is on Lewis’s account, an in-the-fiction operator turns\nout to be a context-shifting operator.  Take someone’s utterance\nof the sentence ‘In Shakespeare’s Othello, Othello was\njealous’.  The operator is context-shifting to the extent that\nthe context relative to which we are to interpret the embedded\nsentence ‘Othello is jealous’ is different from the\ncontext of utterance of the sentence as a whole, since the latter is\ncentered on the actual world, rather than the fictional world of\nOthello.  (See Recanati 2000, Predelli 2005, Bonomi 2008.  Predelli\n2008 offers a variation on such accounts.) \n",
    "section_title": "2.1 Truth in Fiction as Truth in the Worlds of Fiction",
    "entry_title": "Fiction",
    "hierarchy_title": "Fiction || Truth in Fiction || Truth in Fiction as Truth in the Worlds of Fiction",
    "tokenized_text": [
        "truth",
        "fiction",
        "truth",
        "fiction",
        "truth",
        "world",
        "fiction",
        "truth",
        "fiction",
        "truth",
        "world",
        "fiction",
        "david",
        "lewis",
        "provided",
        "classic",
        "discussion",
        "issue",
        "truth",
        "fiction",
        "first",
        "published",
        "reprinted",
        "postscript",
        "approach",
        "two",
        "core",
        "idea",
        "first",
        "adopt",
        "pretense",
        "view",
        "fiction",
        "fiction",
        "story",
        "told",
        "particular",
        "person",
        "particular",
        "occasion",
        "tell",
        "story",
        "typically",
        "pretend",
        "one",
        "relating",
        "account",
        "thing",
        "really",
        "happen",
        "second",
        "core",
        "idea",
        "one",
        "mentioned",
        "story",
        "related",
        "background",
        "known",
        "fact",
        "belief",
        "thereby",
        "ensuring",
        "truth",
        "fiction",
        "stated",
        "story",
        "novelty",
        "lewis",
        "approach",
        "way",
        "understands",
        "background",
        "impact",
        "term",
        "machinery",
        "possible",
        "world",
        "semantics",
        "counterfactuals",
        "put",
        "point",
        "technical",
        "jargon",
        "lewis",
        "treat",
        "inthefiction",
        "operator",
        "special",
        "intensional",
        "operator",
        "lewis",
        "offer",
        "two",
        "main",
        "analysis",
        "analysis",
        "background",
        "story",
        "told",
        "actuality",
        "appropriately",
        "filtered",
        "remove",
        "whatever",
        "odds",
        "story",
        "truth",
        "fiction",
        "would",
        "true",
        "fiction",
        "told",
        "known",
        "fact",
        "term",
        "lewis",
        "possible",
        "world",
        "analysis",
        "counterfactuals",
        "lewis",
        "rendered",
        "analysis",
        "sentence",
        "form",
        "fiction",
        "f",
        "φ",
        "nonvacuously",
        "true",
        "world",
        "f",
        "told",
        "known",
        "fact",
        "φ",
        "true",
        "differs",
        "le",
        "actual",
        "world",
        "balance",
        "world",
        "f",
        "told",
        "known",
        "fact",
        "φ",
        "true",
        "analysis",
        "easily",
        "capture",
        "fact",
        "true",
        "holmes",
        "story",
        "holmes",
        "liver",
        "example",
        "despite",
        "mention",
        "made",
        "story",
        "also",
        "capture",
        "fact",
        "fictional",
        "truth",
        "many",
        "claim",
        "simply",
        "left",
        "indeterminate",
        "true",
        "story",
        "holmes",
        "liver",
        "example",
        "true",
        "story",
        "averagesized",
        "liver",
        "analysis",
        "also",
        "seems",
        "catch",
        "much",
        "lewis",
        "currie",
        "phillips",
        "walton",
        "wolterstorff",
        "given",
        "story",
        "take",
        "truth",
        "p",
        "bearing",
        "event",
        "described",
        "s",
        "lewis",
        "analysis",
        "true",
        "p",
        "whether",
        "anyone",
        "belief",
        "p",
        "example",
        "napoleon",
        "exactly",
        "hair",
        "head",
        "battle",
        "austerlitz",
        "true",
        "holmes",
        "story",
        "unknown",
        "proposition",
        "p",
        "implication",
        "event",
        "story",
        "another",
        "problem",
        "arises",
        "take",
        "example",
        "mentioned",
        "lewis",
        "suppose",
        "many",
        "think",
        "swamp",
        "adder",
        "adventure",
        "speckled",
        "band",
        "intended",
        "doyle",
        "russell",
        "viper",
        "lewis",
        "cf",
        "byrne",
        "note",
        "story",
        "holmes",
        "concludes",
        "murder",
        "victim",
        "story",
        "killed",
        "snake",
        "climbing",
        "fake",
        "bellrope",
        "russell",
        "viper",
        "constrictor",
        "however",
        "physically",
        "climb",
        "rope",
        "hence",
        "analysis",
        "suggests",
        "true",
        "speckled",
        "band",
        "holmes",
        "bungled",
        "lewis",
        "would",
        "clearly",
        "wrong",
        "conclusion",
        "draw",
        "true",
        "story",
        "holmes",
        "right",
        "fact",
        "conan",
        "doyle",
        "ignorant",
        "little",
        "known",
        "biological",
        "fact",
        "affect",
        "true",
        "holmes",
        "story",
        "example",
        "suggests",
        "often",
        "better",
        "conceive",
        "background",
        "epistemic",
        "term",
        "maybe",
        "always",
        "lewis",
        "point",
        "contested",
        "critical",
        "tradition",
        "us",
        "psychoanalytic",
        "view",
        "interpret",
        "literary",
        "text",
        "claim",
        "hamlet",
        "oedipus",
        "complex",
        "claim",
        "probably",
        "best",
        "understood",
        "term",
        "analysis",
        "lewis",
        "analysis",
        "provides",
        "epistemic",
        "orientation",
        "treat",
        "background",
        "belief",
        "overt",
        "author",
        "community",
        "belief",
        "overt",
        "community",
        "time",
        "iff",
        "le",
        "everyone",
        "share",
        "le",
        "everyone",
        "think",
        "le",
        "everyone",
        "share",
        "take",
        "collective",
        "belief",
        "world",
        "world",
        "overt",
        "belief",
        "true",
        "truth",
        "fiction",
        "would",
        "true",
        "collective",
        "belief",
        "world",
        "fiction",
        "told",
        "known",
        "fact",
        "analysis",
        "sentence",
        "form",
        "fiction",
        "f",
        "φ",
        "nonvacuously",
        "true",
        "iff",
        "whenever",
        "w",
        "one",
        "collective",
        "belief",
        "world",
        "community",
        "origin",
        "f",
        "world",
        "f",
        "told",
        "known",
        "fact",
        "φ",
        "true",
        "differs",
        "le",
        "w",
        "balance",
        "world",
        "f",
        "told",
        "known",
        "fact",
        "φ",
        "true",
        "analysis",
        "rule",
        "case",
        "hair",
        "napoleon",
        "head",
        "since",
        "number",
        "h",
        "people",
        "collectively",
        "believed",
        "napoleon",
        "h",
        "hair",
        "battle",
        "austerlitz",
        "best",
        "accepted",
        "rough",
        "upper",
        "lower",
        "bound",
        "allowed",
        "hair",
        "also",
        "considerably",
        "fewer",
        "analysis",
        "rule",
        "case",
        "speckled",
        "band",
        "since",
        "reception",
        "story",
        "reader",
        "showed",
        "relevant",
        "collective",
        "belief",
        "world",
        "world",
        "nothing",
        "prevent",
        "swamp",
        "adder",
        "climbing",
        "rope",
        "case",
        "belief",
        "probably",
        "exist",
        "people",
        "began",
        "reading",
        "story",
        "acquired",
        "result",
        "trusting",
        "author",
        "analysis",
        "also",
        "strikingly",
        "counterintuitive",
        "consequence",
        "take",
        "typical",
        "victorian",
        "novel",
        "nowhere",
        "take",
        "stance",
        "whether",
        "god",
        "exists",
        "analysis",
        "nonetheless",
        "true",
        "novel",
        "god",
        "exists",
        "simply",
        "victorian",
        "england",
        "overtly",
        "theistic",
        "collective",
        "belief",
        "world",
        "world",
        "god",
        "exists",
        "walton",
        "similarly",
        "true",
        "many",
        "work",
        "ghost",
        "woman",
        "markedly",
        "inferior",
        "men",
        "later",
        "postscript",
        "paper",
        "lewis",
        "considers",
        "needed",
        "revision",
        "two",
        "account",
        "conjecture",
        "example",
        "story",
        "explicit",
        "content",
        "background",
        "may",
        "need",
        "supplementing",
        "carryover",
        "truth",
        "fiction",
        "capture",
        "true",
        "story",
        "lewis",
        "hanley",
        "widely",
        "discussed",
        "revision",
        "lewis",
        "mention",
        "one",
        "generated",
        "debate",
        "concern",
        "case",
        "impossible",
        "fictionsfictions",
        "told",
        "known",
        "fact",
        "possible",
        "world",
        "turn",
        "debate",
        "sec",
        "reviewing",
        "two",
        "influential",
        "account",
        "truth",
        "fiction",
        "final",
        "remark",
        "notion",
        "world",
        "feature",
        "lewis",
        "account",
        "many",
        "account",
        "inspired",
        "approach",
        "lewis",
        "world",
        "possible",
        "world",
        "construes",
        "maximal",
        "connected",
        "spatiotemporal",
        "object",
        "lewis",
        "although",
        "many",
        "others",
        "take",
        "abstract",
        "entity",
        "kind",
        "see",
        "entry",
        "possible",
        "world",
        "one",
        "accept",
        "lewis",
        "account",
        "truth",
        "fiction",
        "preferring",
        "one",
        "alternative",
        "metaphysical",
        "conception",
        "possible",
        "world",
        "important",
        "point",
        "notion",
        "possible",
        "world",
        "matter",
        "conceived",
        "piece",
        "modal",
        "machinery",
        "many",
        "role",
        "play",
        "metaphysics",
        "confused",
        "notion",
        "fictional",
        "world",
        "appealed",
        "philosopher",
        "nonphilosophers",
        "alike",
        "fictional",
        "world",
        "present",
        "realm",
        "created",
        "author",
        "generally",
        "incomplete",
        "sometimes",
        "inconsistent",
        "le",
        "distant",
        "real",
        "world",
        "despite",
        "distance",
        "least",
        "partially",
        "accessible",
        "real",
        "world",
        "thus",
        "know",
        "holmes",
        "admire",
        "distance",
        "even",
        "help",
        "solve",
        "crime",
        "although",
        "often",
        "talk",
        "fiction",
        "term",
        "fictional",
        "world",
        "making",
        "literal",
        "sense",
        "talk",
        "fraught",
        "difficulty",
        "pavel",
        "make",
        "attempt",
        "walton",
        "salutary",
        "reminder",
        "go",
        "wrong",
        "philosopher",
        "tended",
        "take",
        "talk",
        "grain",
        "salt",
        "construing",
        "fictional",
        "world",
        "instead",
        "set",
        "fictional",
        "truth",
        "walton",
        "walton",
        "set",
        "world",
        "rather",
        "single",
        "world",
        "lewis",
        "ross",
        "used",
        "notion",
        "fictional",
        "world",
        "construed",
        "way",
        "provide",
        "kind",
        "linguistic",
        "counterpart",
        "mental",
        "reality",
        "imaginary",
        "model",
        "discussed",
        "appealing",
        "idea",
        "context",
        "utterance",
        "interpretation",
        "relevant",
        "notion",
        "context",
        "see",
        "entry",
        "theory",
        "meaning",
        "view",
        "saying",
        "sentence",
        "aimed",
        "correctly",
        "representing",
        "fictional",
        "world",
        "mean",
        "sentence",
        "interpreted",
        "relative",
        "context",
        "contains",
        "fictional",
        "world",
        "rather",
        "actual",
        "world",
        "world",
        "parameter",
        "consider",
        "sentence",
        "like",
        "othello",
        "jealous",
        "uttered",
        "context",
        "contains",
        "actual",
        "world",
        "world",
        "parameter",
        "sentence",
        "true",
        "since",
        "othello",
        "refers",
        "nothing",
        "sentence",
        "true",
        "fictional",
        "context",
        "contains",
        "fictional",
        "world",
        "othello",
        "world",
        "parameter",
        "world",
        "othello",
        "refers",
        "jealous",
        "venetian",
        "soldier",
        "shakespeare",
        "play",
        "account",
        "arguably",
        "also",
        "accommodates",
        "problem",
        "fiction",
        "contain",
        "real",
        "truth",
        "historical",
        "fiction",
        "case",
        "one",
        "sentence",
        "say",
        "napoleon",
        "invaded",
        "russia",
        "actually",
        "fictionally",
        "true",
        "keeping",
        "content",
        "real",
        "fictional",
        "context",
        "kind",
        "account",
        "yield",
        "alternative",
        "construal",
        "inthefiction",
        "operator",
        "rather",
        "special",
        "kind",
        "intensional",
        "operator",
        "lewis",
        "account",
        "inthefiction",
        "operator",
        "turn",
        "contextshifting",
        "operator",
        "take",
        "someone",
        "utterance",
        "sentence",
        "shakespeare",
        "othello",
        "othello",
        "jealous",
        "operator",
        "contextshifting",
        "extent",
        "context",
        "relative",
        "interpret",
        "embedded",
        "sentence",
        "othello",
        "jealous",
        "different",
        "context",
        "utterance",
        "sentence",
        "whole",
        "since",
        "latter",
        "centered",
        "actual",
        "world",
        "rather",
        "fictional",
        "world",
        "othello",
        "see",
        "recanati",
        "predelli",
        "bonomi",
        "predelli",
        "offer",
        "variation",
        "account"
    ]
}