{
    "main_text": "The Nature of Fiction || New Challenges\n1.7 New Challenges\n\nThe various accounts of fiction discussed so far in this section\ndisagree on numerous points, and, although pretense or\nimagination-based accounts are probably the most widely supported,\neach one faces challenges and there is no consensus as to which\nversion is correct. But perhaps the most radical challenge to all of\nthese attempts to specify the nature of fiction has come from\ntheorists who think that the enterprise of finding necessary and\nsufficient conditions for what it takes to be a work of fiction should\nbe abandoned. Such theorists think that there are genuine borderline\ncases and cases that are, in some sense, admixtures of fiction and\nnon-fiction, and that such cases show that it is wrong to try to\ncapture the notion of fiction in terms of necessary and sufficient\nconditions. (Note that the main target for this challenge are\ntheorists who think that there are intuitive concepts of fiction and\nnon-fiction that are worth articulating in the first place. As we saw\nearlier, Walton’s approach is different: he urges replacement of\nthe traditional distinction.)\n\nWhile Walton proposes replacing the intuitive fiction/non-fiction\ndistinction, Derek Matravers urges another path (Matravers 2014): the\nphilosophy of fiction should simply stop caring about this distinction\nand shift its focus to the distinction between\n“confrontations” (situations that involve our immediate\nenvironment, and thereby afford the possibility of action) and\n“representations” (situations represented to us as\nhappening at other times or in other places, thereby denying us the\npossibility of action). On the surface, it is hard to see this way of\ncashing out representations as particularly illuminating, since it\nputs fictional representations in the same basket as some scientific\nrepresentations (2014: 53) and even historical representations. But\nMatravers discerns one significant difference among representations:\nwhere they lie on the “thin” to “thick”\ncontinuum. Thin representations (say, a physics text) merely aim to\npass on information and do not stimulate the imagination, while thick\nrepresentations, such as exciting histories and vivid novels, do. But\nMatravers insists that nothing in the way we engage with thick\nrepresentations separates fiction from non-fiction, and that this is\namply borne out by empirical studies of text-processing by\npsychologists (see, for example, Green & Brock 2000):\n\n\nThe experience of reading de Quincey’s “The Revolt of the\nTartars” is the same whether we believe it is non-fictional,\nbelieve it is fictional, or (as is most likely) we are ignorant of\nwhether it is non-fictional or fictional. (2014: 78)\n\n\nBecause of this, Matravers finds \n\n\n[t]he traditional distinction, between representations that are\nfiction and representations that are non-fiction, … entirely\nunhelpful. (2014: 47)\n\n\nA number of commentators, however, have denied that such empirical\nstudies really do have the implications that Matravers sees in them.\nFor Lamarque, for example, the modes of reading of literary critics\nand historians involve different normative practices that determine\nwhat questions are asked and where attention is directed (Lamarque\n2016). And Stacie Friend argues that even ordinary readers approach\nworks of fiction and non-fiction with different expectations (Friend\nforthcoming). \n\nFriend agrees, however, that our engagement with works of fiction and\nnon-fiction alike involves a combination of imagining and belief. Some\nworks of non-fiction contain striking invented and hypothetical\nelements (e.g., Tacitus’s Histories, which contains\nmade-up battle scenes; Dutch (1999), Edmund Morris’s\nauthorized biography of Ronald Reagan, in which Morris inserts himself\ninto the story as the fictional narrator; and works of history that\nactively countenance the implications of certain counterfactuals). At\nthe same time, facts about what actually happened are the dominant\nfocus of some works of fiction such as Vidal’s Narratives of\nEmpire series. Friend thinks that such cases undermine accounts\nof the fiction/non-fiction distinction by theorists like Currie,\nLamarque & Olsen, Davies, and Stock (see Friend 2008, 2011, 2012,\nforthcoming). \n\nTo deal with these and other hard cases, Friend recommends against\ntrying to find necessary and sufficient conditions for being a work of\nfiction, although not by relinquishing the emphasis on works\nin favor of more basic units like fictional statements and narratives.\nInstead, fiction and non-fiction should be regarded as very broad\ngenres in which particular works are embedded, where a genre is a way\nof classifying representations that guides appreciation. Borrowing\nfrom ideas in Walton’s “Categories of Art” (Walton\n1970), Friend argues that classifying a work as a work of fiction or\nnon-fiction depends on a range of features. A feature is standard for\na genre if possession of the feature tends to place the work in that\ngenre; contra-standard if possession tends to exclude the work from\nthe genre. (Features are variable if works can have or lack\nthem without this affecting membership in the genre, such as the\nnumber of chapters a work contains). Thus, containing made-up material\ncounts as standard for the genre of fiction but contra-standard for\nnon-fiction, while being faithful to the facts counts as standard for\nnon-fiction but contra-standard for fiction. (As Friend notes, such a\nclassification may itself change over time; the kind of inventive\nembellishment found in Tacitus’s Histories, for\nexample, was once regarded as standard for historical non-fiction, but\nis now regarded as contra-standard [Friend 2012: 192–3].)\n\n\nA crucial claim of the ensuing genre theory of fiction/non-fiction is\nthat having contra-standard features for a genre does not simply\nexclude a work from that genre. Capote’s In Cold Blood,\nfor example, is a striking piece of non-fiction precisely because it\npossesses certain features that were, at the time of its writing,\ncontra-standard for non-fiction. What explains the fact that we\nnonetheless class it as non-fiction has much to do with other features\nof the work, including the reliance we place on authorial intention:\nCapote took himself to be writing a kind of literary journalism\n(Friend 2012: 194), just as Tacitus took himself to be writing history\nafter the fashion of his time. (Friend is somewhat unclear about the\ncontent of such intentions, however. Presumably they can’t be\nunderstood as intentions to write a certain kind of fiction or\nnon-fiction, on pain of circularity, although it is hard to see how\nelse to construe them.)\n\nFor Friend, then, the classification of a work as fiction or\nnon-fiction may depend heavily on context: a weighing up of various\nstandard and contra-standard features that is strongly, but\ndefeasibly, influenced by authorial intentions. This opens the view to\nthe objection that the classification is too subjective for the\ndistinction to count as theoretically important (Voltolini 2016).\nFriend’s answer is that placement of a work in either the genre\nof fiction or non-fiction directs our attention to different aspects\nof the work, and even influences us to adopt a specific reading\nstrategy appropriate to works in the genre (Friend 2012: 202ff.;\nFriend forthcoming)—a very different view from that of\nMatravers, who discerned no interesting way in which our engagement\nwith fictional representation differs from our engagement with\nnon-fictional representations. \n\nThose who favor other accounts have not been quiet in their opposition\nto Friend’s proposal. Both Currie and Davies, for example, have\ndefended their versions of the fictive utterance theory by offering\nmore nuanced accounts of the way the fictional status of a work\ndepends on the fictional status of its parts (Currie 2014; Davies\n2015). Thus, Currie argues that a work’s fictional status\nsupervenes on its intentional profile, which specifies the\ncommunicative intentions behind the utterances that produce the work\n(Currie 2014). One consequence of this view is that if a work uses as\nmuch imaginative reconstruction and invention of events as a\nfictional work does (on our current understanding of this\nnotion), then all else being equal we should also count the first work\nas fiction. Currie takes this to imply that Tacitus’s\nAnnals and Histories, with their many made-up\nelements, count as fiction rather than non-fiction—despite the\nfact that Tacitus took himself to be writing non-fiction history (for\nobjections, see Friend 2012). By contrast, Davies again emphasizes\nthat the fictional status of a work depends on the fictional\nnarrative(s) found in a work, which he now construes as the fictive\ncontent readers are asked to make-believe of a real setting: if the\nnarrative serves to comment on something asserted in the work\nthen it is a work of non-fiction; if what is asserted serves to\ncomment on the narrative the work is fiction (Davies 2015, esp. 54).\nOn this criterion, he thinks, Tacitus wrote non-fiction. \n\nStock agrees. On her account, if a work contains utterances that are\nnot fictive in her sense (that is, if they express propositions that\nreaders are meant to believe but that they are not supposed to conjoin\nin thought with other propositions they are merely meant to\nmake-believe), the work counts as non-fiction. It follows, she thinks,\nthat we should count works like Tacitus’s Histories and\nAnnals and Morris’s Dutch as non-fictional\npatchworks of the fictive and non-fictive (Stock 2017: 160). Manuel\nGarcía-Carpintero (2013) offers another way of keeping a tight\nfiction/non-fiction distinction. He defends a version of\nCurrie’s view that fiction-making prescribes imagining, but\ninstead of appealing to the psychological attitudes of those engaged\nin fictive acts, as Currie does, he understands such prescriptions in\nterms of constitutive rules that specify the commitments someone\nincurs when engaging in fiction-making, as opposed to the constitutive\nrules that are involved in assertive acts. On this normative view,\nclaims that are asserted as true can be part of a work of fiction,\nsince, given the author’s purposes, one and the same fictive\nutterance may be subject to both the norm of fiction-making and the\nnorm of assertion, as a performance of a direct as well as of an\nindirect speech act as it were (2013: 356f.). But\nGarcía-Carpintero accepts that works of non-fiction can include\ninvitations to imagine as well, and he thinks that works like\nTacitus’s Histories and Annals\nstraightforwardly count as a patchwork of fact and fiction. (For\ndiscussion, see Stock 2017: 161–3.)\n",
    "section_title": "1.7 New Challenges",
    "entry_title": "Fiction",
    "hierarchy_title": "Fiction || The Nature of Fiction || New Challenges",
    "tokenized_text": [
        "nature",
        "fiction",
        "new",
        "challenge",
        "new",
        "challenge",
        "various",
        "account",
        "fiction",
        "discussed",
        "far",
        "section",
        "disagree",
        "numerous",
        "point",
        "although",
        "pretense",
        "imaginationbased",
        "account",
        "probably",
        "widely",
        "supported",
        "one",
        "face",
        "challenge",
        "consensus",
        "version",
        "correct",
        "perhaps",
        "radical",
        "challenge",
        "attempt",
        "specify",
        "nature",
        "fiction",
        "come",
        "theorist",
        "think",
        "enterprise",
        "finding",
        "necessary",
        "sufficient",
        "condition",
        "take",
        "work",
        "fiction",
        "abandoned",
        "theorist",
        "think",
        "genuine",
        "borderline",
        "case",
        "case",
        "sense",
        "admixture",
        "fiction",
        "nonfiction",
        "case",
        "show",
        "wrong",
        "try",
        "capture",
        "notion",
        "fiction",
        "term",
        "necessary",
        "sufficient",
        "condition",
        "note",
        "main",
        "target",
        "challenge",
        "theorist",
        "think",
        "intuitive",
        "concept",
        "fiction",
        "nonfiction",
        "worth",
        "articulating",
        "first",
        "place",
        "saw",
        "earlier",
        "walton",
        "approach",
        "different",
        "urge",
        "replacement",
        "traditional",
        "distinction",
        "walton",
        "proposes",
        "replacing",
        "intuitive",
        "fictionnonfiction",
        "distinction",
        "derek",
        "matravers",
        "urge",
        "another",
        "path",
        "matravers",
        "philosophy",
        "fiction",
        "simply",
        "stop",
        "caring",
        "distinction",
        "shift",
        "focus",
        "distinction",
        "confrontation",
        "situation",
        "involve",
        "immediate",
        "environment",
        "thereby",
        "afford",
        "possibility",
        "action",
        "representation",
        "situation",
        "represented",
        "u",
        "happening",
        "time",
        "place",
        "thereby",
        "denying",
        "u",
        "possibility",
        "action",
        "surface",
        "hard",
        "see",
        "way",
        "cashing",
        "representation",
        "particularly",
        "illuminating",
        "since",
        "put",
        "fictional",
        "representation",
        "basket",
        "scientific",
        "representation",
        "even",
        "historical",
        "representation",
        "matravers",
        "discerns",
        "one",
        "significant",
        "difference",
        "among",
        "representation",
        "lie",
        "thin",
        "thick",
        "continuum",
        "thin",
        "representation",
        "say",
        "physic",
        "text",
        "merely",
        "aim",
        "pas",
        "information",
        "stimulate",
        "imagination",
        "thick",
        "representation",
        "exciting",
        "history",
        "vivid",
        "novel",
        "matravers",
        "insists",
        "nothing",
        "way",
        "engage",
        "thick",
        "representation",
        "separate",
        "fiction",
        "nonfiction",
        "amply",
        "borne",
        "empirical",
        "study",
        "textprocessing",
        "psychologist",
        "see",
        "example",
        "green",
        "brock",
        "experience",
        "reading",
        "de",
        "quincey",
        "revolt",
        "tartar",
        "whether",
        "believe",
        "nonfictional",
        "believe",
        "fictional",
        "likely",
        "ignorant",
        "whether",
        "nonfictional",
        "fictional",
        "matravers",
        "find",
        "traditional",
        "distinction",
        "representation",
        "fiction",
        "representation",
        "nonfiction",
        "entirely",
        "unhelpful",
        "number",
        "commentator",
        "however",
        "denied",
        "empirical",
        "study",
        "really",
        "implication",
        "matravers",
        "see",
        "lamarque",
        "example",
        "mode",
        "reading",
        "literary",
        "critic",
        "historian",
        "involve",
        "different",
        "normative",
        "practice",
        "determine",
        "question",
        "asked",
        "attention",
        "directed",
        "lamarque",
        "stacie",
        "friend",
        "argues",
        "even",
        "ordinary",
        "reader",
        "approach",
        "work",
        "fiction",
        "nonfiction",
        "different",
        "expectation",
        "friend",
        "forthcoming",
        "friend",
        "agrees",
        "however",
        "engagement",
        "work",
        "fiction",
        "nonfiction",
        "alike",
        "involves",
        "combination",
        "imagining",
        "belief",
        "work",
        "nonfiction",
        "contain",
        "striking",
        "invented",
        "hypothetical",
        "element",
        "eg",
        "tacitus",
        "history",
        "contains",
        "madeup",
        "battle",
        "scene",
        "dutch",
        "edmund",
        "morris",
        "authorized",
        "biography",
        "ronald",
        "reagan",
        "morris",
        "insert",
        "story",
        "fictional",
        "narrator",
        "work",
        "history",
        "actively",
        "countenance",
        "implication",
        "certain",
        "counterfactuals",
        "time",
        "fact",
        "actually",
        "happened",
        "dominant",
        "focus",
        "work",
        "fiction",
        "vidal",
        "narrative",
        "empire",
        "series",
        "friend",
        "think",
        "case",
        "undermine",
        "account",
        "fictionnonfiction",
        "distinction",
        "theorist",
        "like",
        "currie",
        "lamarque",
        "olsen",
        "davy",
        "stock",
        "see",
        "friend",
        "forthcoming",
        "deal",
        "hard",
        "case",
        "friend",
        "recommends",
        "trying",
        "find",
        "necessary",
        "sufficient",
        "condition",
        "work",
        "fiction",
        "although",
        "relinquishing",
        "emphasis",
        "work",
        "favor",
        "basic",
        "unit",
        "like",
        "fictional",
        "statement",
        "narrative",
        "instead",
        "fiction",
        "nonfiction",
        "regarded",
        "broad",
        "genre",
        "particular",
        "work",
        "embedded",
        "genre",
        "way",
        "classifying",
        "representation",
        "guide",
        "appreciation",
        "borrowing",
        "idea",
        "walton",
        "category",
        "art",
        "walton",
        "friend",
        "argues",
        "classifying",
        "work",
        "work",
        "fiction",
        "nonfiction",
        "depends",
        "range",
        "feature",
        "feature",
        "standard",
        "genre",
        "possession",
        "feature",
        "tends",
        "place",
        "work",
        "genre",
        "contrastandard",
        "possession",
        "tends",
        "exclude",
        "work",
        "genre",
        "feature",
        "variable",
        "work",
        "lack",
        "without",
        "affecting",
        "membership",
        "genre",
        "number",
        "chapter",
        "work",
        "contains",
        "thus",
        "containing",
        "madeup",
        "material",
        "count",
        "standard",
        "genre",
        "fiction",
        "contrastandard",
        "nonfiction",
        "faithful",
        "fact",
        "count",
        "standard",
        "nonfiction",
        "contrastandard",
        "fiction",
        "friend",
        "note",
        "classification",
        "may",
        "change",
        "time",
        "kind",
        "inventive",
        "embellishment",
        "found",
        "tacitus",
        "history",
        "example",
        "regarded",
        "standard",
        "historical",
        "nonfiction",
        "regarded",
        "contrastandard",
        "friend",
        "crucial",
        "claim",
        "ensuing",
        "genre",
        "theory",
        "fictionnonfiction",
        "contrastandard",
        "feature",
        "genre",
        "simply",
        "exclude",
        "work",
        "genre",
        "capote",
        "cold",
        "blood",
        "example",
        "striking",
        "piece",
        "nonfiction",
        "precisely",
        "posse",
        "certain",
        "feature",
        "time",
        "writing",
        "contrastandard",
        "nonfiction",
        "explains",
        "fact",
        "nonetheless",
        "class",
        "nonfiction",
        "much",
        "feature",
        "work",
        "including",
        "reliance",
        "place",
        "authorial",
        "intention",
        "capote",
        "took",
        "writing",
        "kind",
        "literary",
        "journalism",
        "friend",
        "tacitus",
        "took",
        "writing",
        "history",
        "fashion",
        "time",
        "friend",
        "somewhat",
        "unclear",
        "content",
        "intention",
        "however",
        "presumably",
        "understood",
        "intention",
        "write",
        "certain",
        "kind",
        "fiction",
        "nonfiction",
        "pain",
        "circularity",
        "although",
        "hard",
        "see",
        "else",
        "construe",
        "friend",
        "classification",
        "work",
        "fiction",
        "nonfiction",
        "may",
        "depend",
        "heavily",
        "context",
        "weighing",
        "various",
        "standard",
        "contrastandard",
        "feature",
        "strongly",
        "defeasibly",
        "influenced",
        "authorial",
        "intention",
        "open",
        "view",
        "objection",
        "classification",
        "subjective",
        "distinction",
        "count",
        "theoretically",
        "important",
        "voltolini",
        "friend",
        "answer",
        "placement",
        "work",
        "either",
        "genre",
        "fiction",
        "nonfiction",
        "directs",
        "attention",
        "different",
        "aspect",
        "work",
        "even",
        "influence",
        "u",
        "adopt",
        "specific",
        "reading",
        "strategy",
        "appropriate",
        "work",
        "genre",
        "friend",
        "ff",
        "friend",
        "forthcoming",
        "a",
        "different",
        "view",
        "matravers",
        "discerned",
        "interesting",
        "way",
        "engagement",
        "fictional",
        "representation",
        "differs",
        "engagement",
        "nonfictional",
        "representation",
        "favor",
        "account",
        "quiet",
        "opposition",
        "friend",
        "proposal",
        "currie",
        "davy",
        "example",
        "defended",
        "version",
        "fictive",
        "utterance",
        "theory",
        "offering",
        "nuanced",
        "account",
        "way",
        "fictional",
        "status",
        "work",
        "depends",
        "fictional",
        "status",
        "part",
        "currie",
        "davy",
        "thus",
        "currie",
        "argues",
        "work",
        "fictional",
        "status",
        "supervenes",
        "intentional",
        "profile",
        "specifies",
        "communicative",
        "intention",
        "behind",
        "utterance",
        "produce",
        "work",
        "currie",
        "one",
        "consequence",
        "view",
        "work",
        "us",
        "much",
        "imaginative",
        "reconstruction",
        "invention",
        "event",
        "fictional",
        "work",
        "current",
        "understanding",
        "notion",
        "else",
        "equal",
        "also",
        "count",
        "first",
        "work",
        "fiction",
        "currie",
        "take",
        "imply",
        "tacitus",
        "annals",
        "history",
        "many",
        "madeup",
        "element",
        "count",
        "fiction",
        "rather",
        "nonfictiondespite",
        "fact",
        "tacitus",
        "took",
        "writing",
        "nonfiction",
        "history",
        "objection",
        "see",
        "friend",
        "contrast",
        "davy",
        "emphasizes",
        "fictional",
        "status",
        "work",
        "depends",
        "fictional",
        "narrative",
        "found",
        "work",
        "construes",
        "fictive",
        "content",
        "reader",
        "asked",
        "makebelieve",
        "real",
        "setting",
        "narrative",
        "serf",
        "comment",
        "something",
        "asserted",
        "work",
        "work",
        "nonfiction",
        "asserted",
        "serf",
        "comment",
        "narrative",
        "work",
        "fiction",
        "davy",
        "esp",
        "criterion",
        "think",
        "tacitus",
        "wrote",
        "nonfiction",
        "stock",
        "agrees",
        "account",
        "work",
        "contains",
        "utterance",
        "fictive",
        "sense",
        "express",
        "proposition",
        "reader",
        "meant",
        "believe",
        "supposed",
        "conjoin",
        "thought",
        "proposition",
        "merely",
        "meant",
        "makebelieve",
        "work",
        "count",
        "nonfiction",
        "follows",
        "think",
        "count",
        "work",
        "like",
        "tacitus",
        "history",
        "annals",
        "morris",
        "dutch",
        "nonfictional",
        "patchwork",
        "fictive",
        "nonfictive",
        "stock",
        "manuel",
        "garcíacarpintero",
        "offer",
        "another",
        "way",
        "keeping",
        "tight",
        "fictionnonfiction",
        "distinction",
        "defends",
        "version",
        "currie",
        "view",
        "fictionmaking",
        "prescribes",
        "imagining",
        "instead",
        "appealing",
        "psychological",
        "attitude",
        "engaged",
        "fictive",
        "act",
        "currie",
        "understands",
        "prescription",
        "term",
        "constitutive",
        "rule",
        "specify",
        "commitment",
        "someone",
        "incurs",
        "engaging",
        "fictionmaking",
        "opposed",
        "constitutive",
        "rule",
        "involved",
        "assertive",
        "act",
        "normative",
        "view",
        "claim",
        "asserted",
        "true",
        "part",
        "work",
        "fiction",
        "since",
        "given",
        "author",
        "purpose",
        "one",
        "fictive",
        "utterance",
        "may",
        "subject",
        "norm",
        "fictionmaking",
        "norm",
        "assertion",
        "performance",
        "direct",
        "well",
        "indirect",
        "speech",
        "act",
        "f",
        "garcíacarpintero",
        "accepts",
        "work",
        "nonfiction",
        "include",
        "invitation",
        "imagine",
        "well",
        "think",
        "work",
        "like",
        "tacitus",
        "history",
        "annals",
        "straightforwardly",
        "count",
        "patchwork",
        "fact",
        "fiction",
        "discussion",
        "see",
        "stock"
    ]
}