{
    "main_text": "A Rational Fideism?\n4. A Rational Fideism?\n\nIn recent years, a small number of philosophers of religion has\nembraced the term fideism (or variations thereof) and sought\nto (re-)claim its non-pejorative use. These thinkers are rare among\nphilosophers in their willingness to take up a gauntlet that is\nusually refused – even by those with views in many respects\nsimilar to their own.\n\nOne of the most carefully argued contemporary defenses of fideism is\nC. Stephen Evans’s book Faith Beyond Reason. Evans\nattempts to rehabilitate – or perhaps habilitate – the term by\ndistinguishing “responsible” forms of fideism from various\nirrationalistic alternatives. Whereas the latter pit faith directly\nagainst reason, the former contend that faith can\nappropriately take over where reason leaves matters of ultimate\nconcern unresolved. Drawing on Kierkegaard’s thought, Evans\ncontends that while there are limits to reason, they are limits which\nit is reasonable for reason to acknowledge.\n\nLike the Protestant Reformers, Evans suggests that the customary\nexercise of human reason is limited not merely by finitude but also by\npride and self-centeredness. For this reason, faith and reason can\nfind themselves in tension. For Evans, however, “faith is\nagainst reason only in the sense that it runs into conflict with a\nconcrete form of reason that is damaged” (153). Moreover, Evans\ninsists that the defects in reason – though substantial – are\nnevertheless not such as to render us completely oblivious to them.\nThus, he does not reject reason altogether. In his preferred\nterminology, faith is not so much against as beyond\nreason, since it is ultimately compatible, in his view, with a duly\nself-critical intellect.\n\nAnother recent defense of fideism can be found in John Bishop’s\nbook Believing by Faith: An Essay in the Epistemology and Ethics\nof Religious Belief. Where Evans draws on Kierkegaard, Bishop\nbuilds on James’s argument in “The Will to Believe”\nto develop what he terms a “modest, moral coherentist,\n‘supra-evidential’ fideism” (3).\n\nA crucial premise in Bishop’s argument is what he terms the\n“thesis of evidential ambiguity,” which holds that, under\n“rational empiricist evidential practice,” our overall\nexperience of the world is equally plausibly interpreted on either a\ntheistic or an atheistic reading, thereby leaving open the question of\nGod’s existence (70–1). He argues that under appropriate\nconditions – essentially those comprising what James called a\n“genuine option,” together with evidential indeterminacy,\non the one hand, and the satisfaction of certain moral constraints on\none’s passional motivations and the content of one’s\nfaith-commitment, on the other – it is morally permissible to make\na “doxastic faith-venture” – that is, to take belief\nin God to be true in one’s practical reasoning, while\nrecognizing that it is not certified by one’s total available\nevidence (147). The brand of fideism for which Bishop argues is thus\n‘supra-evidential’ in the sense that it defends the\npermissibility of reasoning on the basis of commitments that outrun\nwhat is warranted on purely evidential grounds. Like Evans, and in\nkeeping with James and Pascal, however, Bishop is careful to\ndistinguish supra-evidential fideism from counter-evidential fideism:\nunlike the latter, the former, he argues, cannot be shown to violate\nany epistemic obligations. Although, unlike some putative fideists,\nBishop does not regard evidentialism as incoherent or epistemically\nirresponsible, he argues that fideism of the kind he defends is\npreferable on broadly moral grounds, suggesting, for instance, that\nfideism’s tolerance for passional commitments conduces to a more\nbalanced acceptance of human nature as more than purely rational\n(216–220).\n\nOne difference between these two contemporary versions of fideism is\nthat Evans focuses primarily on what is permissible in an epistemic\nsense, whereas Bishop begins with the ethics of fideistic\nbelief, by considering the justifiability in moral terms of taking\nreligious beliefs to be true in one’s practical reasoning.\nUnlike holding beliefs to be true, taking them to be\ntrue in practical reasoning, Bishop argues, is subject to direct\nvoluntary control and an appropriate subject for moral evaluation.\nYet, insofar as such faith-ventures are not counter-evidential, he\nargues, they carry epistemic entitlement too.\n\nAnother difference is that Evans regards faith as justifiable in light\nof inherent limits to human rationality as such, whereas on\nBishop’s account, evidential ambiguity is a feature of the world\nviewed relative to what he calls “our rational empiricist\nevidential practice.” The latter qualification seems to leave\nroom for other practices to which ambiguity about God’s\nexistence might be foreign. Bishop raises this possibility in a\ndiscussion of “isolationist” epistemologies (such as\nWittgensteinian Fideism, if such a thing exists), which attempt to\nsegregate questions of evidential support for religious claims from\nthe standards of a “wider, generally prevailing, evidential\npractice” (79). From within what the isolationist regards as the\nappropriate practice, the “evidence” may seem to point\nincontrovertibly toward, e.g., theistic conclusions (or certain\npropositions about God may count as basic). However, Bishop contends\nthat insofar as questions may still arise for the reflective believer\nabout the justifiability of commitment to the framework\nprinciples of the theistic doxastic practice, isolationism cannot\navoid the need for doxastic ventures that outrun the available\nevidence. Some version of fideism thus seems unavoidable for the\nreflective believer. But granting, for the sake of the argument, that\nBishop is right about the options available to the contemporary\nreflective believer, it might nevertheless be argued that a very\ndifferent situation obtained prior to the development of rational\nempiricist evidential practice (and perhaps continues to obtain where\nthat practice has not taken root). Arguably for premodern thinkers\nthere was no question of “isolating” belief in God from\nany “wider, generally prevailing, evidential practice,”\nand thus no existential “choice” to be made about which\nstandards to employ. If this is right, it provides additional support\nfor the claim that it is anachronistic to describe someone like\nTertullian as a fideist. Put differently, starting from the thesis of\nevidential ambiguity allows for the historicizing of fideism, in a way\nthat encourages us to view the possibility to which the descriptive\nuse of the term refers as contingent on particular historical\ndevelopments, rather than as perennially available – i.e., as a\ndistinctively modern response to a distinctively modern problem. (To\nwhat extent the “Christian” account of fideism articulated\nin Section 3 can be generalized across other traditions is\nunclear.)\n\nWhere Bishop and Evans agree is that some version of fideism\nis justifiable – on moral and/or rational grounds – even if\nwhat is believed by faith itself requires no external\nevidential support. Their quarrel is thus not with reason tout\ncourt, but with certain philosophical assumptions about belief\nentitlement.\n\nA third constructive proposal draws on a reading of Wittgenstein.\nUnlike Bishop and Evans, Duncan Pritchard rejects the term\n“fideism,” which he regards as implying that religious\nbeliefs are unlike other beliefs in not being capable of rational\nassessment or requiring rational support. On his account, all\nbeliefs depend for their assessment on commitments that are not\nthemselves rationally grounded. To the extent that religious beliefs\ndepend on a-rational commitments, they are thus not unique. Pritchard\ncalls his own position “quasi-fideism,” to distinguish it\nfrom both rationalistic conceptions and anti-rational ones. “Put\nanother way, while the quasi-fideist grants that religious belief is,\nat root, a matter of faith rather than reason, she nonetheless holds\nthat this doesn’t disqualify religious belief from being\nrational since all belief is, at root, a matter of faith rather than\nreason” (104).\n\nIn developing this proposal, Pritchard draws on Wittgenstein’s\nfinal writings collected in On Certainty. There, in a\ndiscussion of the possibility of skepticism, Wittgenstein observes\nthat “the questions that we raise and our\ndoubts depend on the fact that some propositions are exempt\nfrom doubt, are as it were like hinges on which those turn”\n(1969, §341). On Pritchard’s reading, these\n“propositions” are not beliefs – which he\ntakes to be responsive to rational considerations – but\ncommitments of a more fundamental, practical kind.\nWittgenstein’s point was a general one, but just for that\nreason, Pritchard contends, it illuminates philosophical debates about\nthe justification of “religious” beliefs. “The\nreligious believer’s overall set of commitments … includes\nfundamental commitments which are more a matter of faith than of\nreason, but this fact alone doesn’t mark any epistemically\nsignificant difference between the life of faith and a life lived\nwithout it. With the relationship between faith and reason and its\nrole in the production of rational belief understood along\nquasi-fideistic lines, religious commitment can be at its most\nfundamental level a matter of faith and yet there nonetheless be\nrational religious beliefs” (118). If Pritchard is correct,\nsomething like faith is a feature of rationality, and\nso-called religious faith is epistemically on par with a-rational\ncommitments in other domains.\n\nOne question for this approach is whether the “hinge\ncommitments” operative in religious or other contexts are\ncognitive or not. Some interpreters of Wittgenstein, like Rupert Read\nand Alice Crary, hold that the forms of words to which Wittgenstein\nrefers in On Certainty lack any application and so are\nnonsense. A different reading, advanced by, inter alia, Danièle\nMoyal-Sharrock, holds that the hinges are not empty propositions\nbecause they are not propositions at all; rather, they are\nphenomenological descriptions of “the mindless, animal certainty\nwith which we move about in the world” (67). On neither account\nis Wittgenstein taken to be advancing a form of “ersatz\nfoundationalism” (Read, 312), according to which certain beliefs\nare properly basic. Nor does either reading entail that there is a set\nof substantive propositions available for being appropriately held\n“on faith” – i.e., that there is something to be\nfideistic about. One way of holding together\nPritchard’s quasi-fideism with Moyal Sharrock’s\ninterpretation of Wittgenstein might be to regard so-called religious\nfaith as an orientation, rather than as propositional – i.e., as\nexpressing a practical understanding of reality within which the\n“believer” lives and moves and has her being.\n",
    "section_title": "4. A Rational Fideism?",
    "entry_title": "Fideism",
    "hierarchy_title": "Fideism || A Rational Fideism?",
    "tokenized_text": [
        "rational",
        "fideism",
        "rational",
        "fideism",
        "recent",
        "year",
        "small",
        "number",
        "philosopher",
        "religion",
        "embraced",
        "term",
        "fideism",
        "variation",
        "thereof",
        "sought",
        "re",
        "claim",
        "nonpejorative",
        "use",
        "thinker",
        "rare",
        "among",
        "philosopher",
        "willingness",
        "take",
        "gauntlet",
        "usually",
        "refused",
        "even",
        "view",
        "many",
        "respect",
        "similar",
        "one",
        "carefully",
        "argued",
        "contemporary",
        "defense",
        "fideism",
        "c",
        "stephen",
        "evans",
        "book",
        "faith",
        "beyond",
        "reason",
        "evans",
        "attempt",
        "rehabilitate",
        "perhaps",
        "habilitate",
        "term",
        "distinguishing",
        "responsible",
        "form",
        "fideism",
        "various",
        "irrationalistic",
        "alternative",
        "whereas",
        "latter",
        "pit",
        "faith",
        "directly",
        "reason",
        "former",
        "contend",
        "faith",
        "appropriately",
        "take",
        "reason",
        "leaf",
        "matter",
        "ultimate",
        "concern",
        "unresolved",
        "drawing",
        "kierkegaard",
        "thought",
        "evans",
        "contends",
        "limit",
        "reason",
        "limit",
        "reasonable",
        "reason",
        "acknowledge",
        "like",
        "protestant",
        "reformer",
        "evans",
        "suggests",
        "customary",
        "exercise",
        "human",
        "reason",
        "limited",
        "merely",
        "finitude",
        "also",
        "pride",
        "selfcenteredness",
        "reason",
        "faith",
        "reason",
        "find",
        "tension",
        "evans",
        "however",
        "faith",
        "reason",
        "sense",
        "run",
        "conflict",
        "concrete",
        "form",
        "reason",
        "damaged",
        "moreover",
        "evans",
        "insists",
        "defect",
        "reason",
        "though",
        "substantial",
        "nevertheless",
        "render",
        "u",
        "completely",
        "oblivious",
        "thus",
        "reject",
        "reason",
        "altogether",
        "preferred",
        "terminology",
        "faith",
        "much",
        "beyond",
        "reason",
        "since",
        "ultimately",
        "compatible",
        "view",
        "duly",
        "selfcritical",
        "intellect",
        "another",
        "recent",
        "defense",
        "fideism",
        "found",
        "john",
        "bishop",
        "book",
        "believing",
        "faith",
        "essay",
        "epistemology",
        "ethic",
        "religious",
        "belief",
        "evans",
        "draw",
        "kierkegaard",
        "bishop",
        "build",
        "james",
        "argument",
        "believe",
        "develop",
        "term",
        "modest",
        "moral",
        "coherentist",
        "supraevidential",
        "fideism",
        "crucial",
        "premise",
        "bishop",
        "argument",
        "term",
        "thesis",
        "evidential",
        "ambiguity",
        "hold",
        "rational",
        "empiricist",
        "evidential",
        "practice",
        "overall",
        "experience",
        "world",
        "equally",
        "plausibly",
        "interpreted",
        "either",
        "theistic",
        "atheistic",
        "reading",
        "thereby",
        "leaving",
        "open",
        "question",
        "god",
        "existence",
        "argues",
        "appropriate",
        "condition",
        "essentially",
        "comprising",
        "james",
        "called",
        "genuine",
        "option",
        "together",
        "evidential",
        "indeterminacy",
        "one",
        "hand",
        "satisfaction",
        "certain",
        "moral",
        "constraint",
        "one",
        "passional",
        "motivation",
        "content",
        "one",
        "faithcommitment",
        "morally",
        "permissible",
        "make",
        "doxastic",
        "faithventure",
        "take",
        "belief",
        "god",
        "true",
        "one",
        "practical",
        "reasoning",
        "recognizing",
        "certified",
        "one",
        "total",
        "available",
        "evidence",
        "brand",
        "fideism",
        "bishop",
        "argues",
        "thus",
        "supraevidential",
        "sense",
        "defends",
        "permissibility",
        "reasoning",
        "basis",
        "commitment",
        "outrun",
        "warranted",
        "purely",
        "evidential",
        "ground",
        "like",
        "evans",
        "keeping",
        "james",
        "pascal",
        "however",
        "bishop",
        "careful",
        "distinguish",
        "supraevidential",
        "fideism",
        "counterevidential",
        "fideism",
        "unlike",
        "latter",
        "former",
        "argues",
        "shown",
        "violate",
        "epistemic",
        "obligation",
        "although",
        "unlike",
        "putative",
        "fideists",
        "bishop",
        "regard",
        "evidentialism",
        "incoherent",
        "epistemically",
        "irresponsible",
        "argues",
        "fideism",
        "kind",
        "defends",
        "preferable",
        "broadly",
        "moral",
        "ground",
        "suggesting",
        "instance",
        "fideism",
        "tolerance",
        "passional",
        "commitment",
        "conduces",
        "balanced",
        "acceptance",
        "human",
        "nature",
        "purely",
        "rational",
        "one",
        "difference",
        "two",
        "contemporary",
        "version",
        "fideism",
        "evans",
        "focus",
        "primarily",
        "permissible",
        "epistemic",
        "sense",
        "whereas",
        "bishop",
        "begin",
        "ethic",
        "fideistic",
        "belief",
        "considering",
        "justifiability",
        "moral",
        "term",
        "taking",
        "religious",
        "belief",
        "true",
        "one",
        "practical",
        "reasoning",
        "unlike",
        "holding",
        "belief",
        "true",
        "taking",
        "true",
        "practical",
        "reasoning",
        "bishop",
        "argues",
        "subject",
        "direct",
        "voluntary",
        "control",
        "appropriate",
        "subject",
        "moral",
        "evaluation",
        "yet",
        "insofar",
        "faithventures",
        "counterevidential",
        "argues",
        "carry",
        "epistemic",
        "entitlement",
        "another",
        "difference",
        "evans",
        "regard",
        "faith",
        "justifiable",
        "light",
        "inherent",
        "limit",
        "human",
        "rationality",
        "whereas",
        "bishop",
        "account",
        "evidential",
        "ambiguity",
        "feature",
        "world",
        "viewed",
        "relative",
        "call",
        "rational",
        "empiricist",
        "evidential",
        "practice",
        "latter",
        "qualification",
        "seems",
        "leave",
        "room",
        "practice",
        "ambiguity",
        "god",
        "existence",
        "might",
        "foreign",
        "bishop",
        "raise",
        "possibility",
        "discussion",
        "isolationist",
        "epistemology",
        "wittgensteinian",
        "fideism",
        "thing",
        "exists",
        "attempt",
        "segregate",
        "question",
        "evidential",
        "support",
        "religious",
        "claim",
        "standard",
        "wider",
        "generally",
        "prevailing",
        "evidential",
        "practice",
        "within",
        "isolationist",
        "regard",
        "appropriate",
        "practice",
        "evidence",
        "may",
        "seem",
        "point",
        "incontrovertibly",
        "toward",
        "eg",
        "theistic",
        "conclusion",
        "certain",
        "proposition",
        "god",
        "may",
        "count",
        "basic",
        "however",
        "bishop",
        "contends",
        "insofar",
        "question",
        "may",
        "still",
        "arise",
        "reflective",
        "believer",
        "justifiability",
        "commitment",
        "framework",
        "principle",
        "theistic",
        "doxastic",
        "practice",
        "isolationism",
        "avoid",
        "need",
        "doxastic",
        "venture",
        "outrun",
        "available",
        "evidence",
        "version",
        "fideism",
        "thus",
        "seems",
        "unavoidable",
        "reflective",
        "believer",
        "granting",
        "sake",
        "argument",
        "bishop",
        "right",
        "option",
        "available",
        "contemporary",
        "reflective",
        "believer",
        "might",
        "nevertheless",
        "argued",
        "different",
        "situation",
        "obtained",
        "prior",
        "development",
        "rational",
        "empiricist",
        "evidential",
        "practice",
        "perhaps",
        "continues",
        "obtain",
        "practice",
        "taken",
        "root",
        "arguably",
        "premodern",
        "thinker",
        "question",
        "isolating",
        "belief",
        "god",
        "wider",
        "generally",
        "prevailing",
        "evidential",
        "practice",
        "thus",
        "existential",
        "choice",
        "made",
        "standard",
        "employ",
        "right",
        "provides",
        "additional",
        "support",
        "claim",
        "anachronistic",
        "describe",
        "someone",
        "like",
        "tertullian",
        "fideist",
        "put",
        "differently",
        "starting",
        "thesis",
        "evidential",
        "ambiguity",
        "allows",
        "historicizing",
        "fideism",
        "way",
        "encourages",
        "u",
        "view",
        "possibility",
        "descriptive",
        "use",
        "term",
        "refers",
        "contingent",
        "particular",
        "historical",
        "development",
        "rather",
        "perennially",
        "available",
        "ie",
        "distinctively",
        "modern",
        "response",
        "distinctively",
        "modern",
        "problem",
        "extent",
        "christian",
        "account",
        "fideism",
        "articulated",
        "section",
        "generalized",
        "across",
        "tradition",
        "unclear",
        "bishop",
        "evans",
        "agree",
        "version",
        "fideism",
        "justifiable",
        "moral",
        "andor",
        "rational",
        "ground",
        "even",
        "believed",
        "faith",
        "requires",
        "external",
        "evidential",
        "support",
        "quarrel",
        "thus",
        "reason",
        "tout",
        "court",
        "certain",
        "philosophical",
        "assumption",
        "belief",
        "entitlement",
        "third",
        "constructive",
        "proposal",
        "draw",
        "reading",
        "wittgenstein",
        "unlike",
        "bishop",
        "evans",
        "duncan",
        "pritchard",
        "reject",
        "term",
        "fideism",
        "regard",
        "implying",
        "religious",
        "belief",
        "unlike",
        "belief",
        "capable",
        "rational",
        "assessment",
        "requiring",
        "rational",
        "support",
        "account",
        "belief",
        "depend",
        "assessment",
        "commitment",
        "rationally",
        "grounded",
        "extent",
        "religious",
        "belief",
        "depend",
        "arational",
        "commitment",
        "thus",
        "unique",
        "pritchard",
        "call",
        "position",
        "quasifideism",
        "distinguish",
        "rationalistic",
        "conception",
        "antirational",
        "one",
        "put",
        "another",
        "way",
        "quasifideist",
        "grant",
        "religious",
        "belief",
        "root",
        "matter",
        "faith",
        "rather",
        "reason",
        "nonetheless",
        "hold",
        "disqualify",
        "religious",
        "belief",
        "rational",
        "since",
        "belief",
        "root",
        "matter",
        "faith",
        "rather",
        "reason",
        "developing",
        "proposal",
        "pritchard",
        "draw",
        "wittgenstein",
        "final",
        "writing",
        "collected",
        "certainty",
        "discussion",
        "possibility",
        "skepticism",
        "wittgenstein",
        "observes",
        "question",
        "raise",
        "doubt",
        "depend",
        "fact",
        "proposition",
        "exempt",
        "doubt",
        "like",
        "hinge",
        "turn",
        "pritchard",
        "reading",
        "proposition",
        "belief",
        "take",
        "responsive",
        "rational",
        "consideration",
        "commitment",
        "fundamental",
        "practical",
        "kind",
        "wittgenstein",
        "point",
        "general",
        "one",
        "reason",
        "pritchard",
        "contends",
        "illuminates",
        "philosophical",
        "debate",
        "justification",
        "religious",
        "belief",
        "religious",
        "believer",
        "overall",
        "set",
        "commitment",
        "includes",
        "fundamental",
        "commitment",
        "matter",
        "faith",
        "reason",
        "fact",
        "alone",
        "mark",
        "epistemically",
        "significant",
        "difference",
        "life",
        "faith",
        "life",
        "lived",
        "without",
        "relationship",
        "faith",
        "reason",
        "role",
        "production",
        "rational",
        "belief",
        "understood",
        "along",
        "quasifideistic",
        "line",
        "religious",
        "commitment",
        "fundamental",
        "level",
        "matter",
        "faith",
        "yet",
        "nonetheless",
        "rational",
        "religious",
        "belief",
        "pritchard",
        "correct",
        "something",
        "like",
        "faith",
        "feature",
        "rationality",
        "socalled",
        "religious",
        "faith",
        "epistemically",
        "par",
        "arational",
        "commitment",
        "domain",
        "one",
        "question",
        "approach",
        "whether",
        "hinge",
        "commitment",
        "operative",
        "religious",
        "context",
        "cognitive",
        "interpreter",
        "wittgenstein",
        "like",
        "rupert",
        "read",
        "alice",
        "crary",
        "hold",
        "form",
        "word",
        "wittgenstein",
        "refers",
        "certainty",
        "lack",
        "application",
        "nonsense",
        "different",
        "reading",
        "advanced",
        "inter",
        "alia",
        "danièle",
        "moyalsharrock",
        "hold",
        "hinge",
        "empty",
        "proposition",
        "proposition",
        "rather",
        "phenomenological",
        "description",
        "mindless",
        "animal",
        "certainty",
        "move",
        "world",
        "neither",
        "account",
        "wittgenstein",
        "taken",
        "advancing",
        "form",
        "ersatz",
        "foundationalism",
        "read",
        "according",
        "certain",
        "belief",
        "properly",
        "basic",
        "either",
        "reading",
        "entail",
        "set",
        "substantive",
        "proposition",
        "available",
        "appropriately",
        "held",
        "faith",
        "ie",
        "something",
        "fideistic",
        "one",
        "way",
        "holding",
        "together",
        "pritchard",
        "quasifideism",
        "moyal",
        "sharrock",
        "interpretation",
        "wittgenstein",
        "might",
        "regard",
        "socalled",
        "religious",
        "faith",
        "orientation",
        "rather",
        "propositional",
        "ie",
        "expressing",
        "practical",
        "understanding",
        "reality",
        "within",
        "believer",
        "life",
        "move"
    ]
}