{
    "main_text": "Tendentious Terminology\n3. Tendentious Terminology\n\nOne lesson to be gleaned from the preceding cases is that\n“fideism” is a term that is seldom self-applied. This is\nno doubt largely because it has come to function primarily as a term\nof abuse as opposed to a genuinely descriptive term. In this respect,\nits de facto role is similar to that played by terms like\n“relativism” and, perhaps, “anti-realism.”\nSuch labels generally say at least as much about the philosophical\ncommitments of those who use them as they do about the positions to\nwhich they are applied.\n\nPopkin argues that the skepticism introduced into theology in the\nsixteenth century eventually led to the atheism and irreligious\n“free-thinking” of the Enlightenment. After all, Hume says\nessentially the same thing as the so-called fideists when he writes\nthat “[o]ur most holy religion is founded on faith, not\non reason” (140), except that by the eighteenth century this had\nbeen transformed into an implicit – if\nnot-so-subtle – reproach. Thus, Hume proceeds to add that\nsince “[m]ere reason is insufficient to convince us of its\nveracity…whoever is moved by faith to assent to\n[Christianity] is conscious of a continued miracle in his own person\nwhich subverts all the principles of his understanding and gives him a\ndetermination to believe what is most contrary to custom and\nexperience” (141). The sarcasm here is hard to miss.\n\nOne way of understanding the emergence of the category\n“fideism” is as a by-product of the development of secular\nconceptions of rationality that, while not overtly hostile to\nreligion, moved God from the premises of thought to its possible\nconclusions. On a classical theological account, the Christian\napproaches the world coram deo – in God’s\npresence. God, on this view, is not the product of inference\nfrom the world but rather its logos, the\nhermeneutical key to understanding the world, where the latter is\nimagined not as what Charles Taylor calls an “immanent\nframe” (542) – a lawlike space that can be understood\nfully on its own terms –but as creation. Creation,\nconceived coram deo, presupposes a creator, but it is not the\nstarting point from which one is inferred. This classical Christian\nview was gradually displaced by a secular imaginary, in which the\nworld, while not, as Descartes demonstrated, self-evident, was no\nlonger viewed as requiring reference to anything beyond itself.\nOstensibly theologically neutral, it thus came to provide a starting\npoint not simply for atheism, but for a new understanding of natural\ntheology, in which belief in God could be grounded in probabilistic\narguments from premises not themselves in dispute between believers\nand unbelievers.\n\nIt is true that the classical arguments for God’s existence\n– e.g., Thomas’s “Five Ways” – predate\nthe development of secular reason, but scholars have argued that their\nfunction changed over time, and that they were not originally intended\nas stand-alone proofs that would convince an unbeliever. They operated\nwithin a distinctive theological theater to elucidate it,\nrather than providing external foundations for it. John Clayton has\nargued that, within pre-modern Judaism and Christianity, theistic\nproofs were used within religious communities “to correct\nheresy, confirm true belief or simply express awe or wonder”\n(92). They were also used apologetically by Christians, but their\ntarget audience was typically other theists, including Muslims.\n“[S]ince the Muslims already believed in God, Thomas cannot have\nwanted by means of rational argument to convince them that God exists\n[…] It would seem more likely that he hoped through rehearsing\nsuch proofs (together with other proofs about God’s nature) to\nestablish with Muslims a positive basis upon which additionally, more\nspecifically Christian, arguments could be built” (92–93).\nBy the seventeenth century this had begun to change. In attempting to\nrescue God from the enthusiasm and perceived dogmatism of traditional\nreligion, deistic thinkers sought to establish a less theologically\nramified, more universal or “natural” religion. Whereas\nformerly the proofs had operated emically, within a horizon of shared\ntheological concerns, “[i]n the new dispensation,” Taylor\nargues, “the issues of God’s existence, our relation to\nhim, what we owe him, and the like, are put by Deism quite outside\nthis horizon” (294). This shift in the arguments’ role was\naccompanied, necessarily, by a corresponding shift in the meaning of\nkey terms. “The world” which the “disembedded”\nproofs take as their point of departure, is no longer the created\norder, but the immanent domain of the emerging natural sciences. God\nis no longer essential to a proper understanding of the world but a\nhypothetical explanation for its existence and order.\n\nThese reinterpreted arguments presented new opportunities for\napologetics (such as Paley’s design argument), but they also\nexposed belief in God to new forms of criticism (such as those raised\nin Hume’s Dialogues Concerning Natural Religion). What\nthe parties to these disputes had in common was a conception of what\nrationality in this realm requires – in particular, premises\nneutral with respect to God’s reality. By those lights, earlier\nways of thinking that began from God’s reality, as well\nas later ways of thinking that shared this earlier starting point,\nappeared irrational and question-begging. “Faith,” which\noriginally meant something like “trust,” came to refer to\nthe act of holding beliefs without evidence sufficient to warrant\nthem. Fideism was thus, paradoxically, the claim that it is\nrational to behave irrationally.\n\nHence, by the time the term “fideism” entered the\nphilosophical vocabulary, the position it denoted was already highly\nsuspect. In an Age of Reason, faith-ism is inevitably going\nto sound irrational. However, the conception of reason which\nthe putative fideist is accused of transgressing is almost invariably\none the latter would reject as insufficiently robust. Thus, the\nopposition to reason said to characterize fideism is perhaps better\nconceived as a rejection of a particular account of\nreason – one the so-called fideist regards as overly narrow and\nrestrictive – or of the applicability to religion of a particular\nway of reasoning. To be sure, the thinkers described as\n“fideists” have sometimes expressed their objections in\nways that contribute to the impression of irrationalism. Looked at\nfrom this point of view, however, it is the critic of fideism who\nfails to appreciate the irony with which the putative fideist uses the\nterm “reason.” In effect, the putative fideist can\ngenerally more charitably be interpreted as claiming that it can be\nrational to refuse to subject certain of one’s beliefs\nto what is popularly (though misleadingly, from the point of view of\nthe putative fideist) called “reason” – reason, so to\nspeak, in “scare quotes.”\n\nIndeed, from the standpoint of some of the thinkers labled fideistic,\nmodern natural theology, insofar as it adopts secular premises and\ntreats God hypothetically, constitutes a theological error. The\ntwentieth-century Protestant theologian Karl Barth suggested that\nChristian natural theology is plagued by an inner contradiction:\n“As a ‘Christian’ natural theology, it must really\nrepresent and affirm the standpoint of faith. Its true objective to\nwhich it really wants to lead unbelief is the knowability of the real\nGod…. But as a ‘natural’ theology, its initial aim is\nto disguise this and therefore to pretend to share in the\nlife-endeavour of natural man” (94). In other words, natural\ntheology is either insincere – pretending to start from a\nstandpoint of unbelief – or sinful, since, on Barth’s\nProtestant view, unbelief, even in the form of methodological\nagnosticism, is not theologically neutral but “active enmity\nagainst God” (94). Natural theology paradoxically requires\nabandoning the Christian perspective – at least methodologically\n– in a misguided effort to provide God with support God\ndoesn’t, on a Christian view, need. This Protestant view is, of\ncourse, at odds with the official Catholic view noted earlier.\n\nIn philosophical as opposed to theological terms, what the thinkers\nlabeled “fideists” have tended to find objectionable is\nnot reason per se, but evidentialism – i.e., the\ndoctrine (expressed forcefully by Clifford) that beliefs can be\nrational only if they are supported by evidence. Since evidentialism\nmight otherwise seem to give rise to a regress problem, it is\ngenerally conjoined with some version of foundationalism which\npurports to delineate a criterion of “proper\nbasicality” – i.e., a set of conditions under which beliefs\ncan rationally be held without further evidential support. Whereas\nsome putative fideists – like Pascal – argue that religious\nbeliefs can be given non-evidential support, others can be interpreted\nas suggesting that such beliefs are themselves properly basic, or (as\nPlantinga has argued more recently) that no criterion of proper\nbasicality that would exclude religious beliefs can itself be shown to\nbe justified. Their contention in either case is that the believer can\nbe rationally justified – or at least cannot be shown to be\nbehaving irrationally – in holding certain beliefs, even\nif these beliefs themselves are not supported by evidence. Conceived\nof in this way, the putative fideist’s position – though not\nuncontroversial – is hardly the brazenly paradoxical doctrine it\nmight at first appear to be.\n",
    "section_title": "3. Tendentious Terminology",
    "entry_title": "Fideism",
    "hierarchy_title": "Fideism || Tendentious Terminology",
    "tokenized_text": [
        "tendentious",
        "terminology",
        "tendentious",
        "terminology",
        "one",
        "lesson",
        "gleaned",
        "preceding",
        "case",
        "fideism",
        "term",
        "seldom",
        "selfapplied",
        "doubt",
        "largely",
        "come",
        "function",
        "primarily",
        "term",
        "abuse",
        "opposed",
        "genuinely",
        "descriptive",
        "term",
        "respect",
        "de",
        "facto",
        "role",
        "similar",
        "played",
        "term",
        "like",
        "relativism",
        "perhaps",
        "antirealism",
        "label",
        "generally",
        "say",
        "least",
        "much",
        "philosophical",
        "commitment",
        "use",
        "position",
        "applied",
        "popkin",
        "argues",
        "skepticism",
        "introduced",
        "theology",
        "sixteenth",
        "century",
        "eventually",
        "led",
        "atheism",
        "irreligious",
        "freethinking",
        "enlightenment",
        "hume",
        "say",
        "essentially",
        "thing",
        "socalled",
        "fideists",
        "writes",
        "ur",
        "holy",
        "religion",
        "founded",
        "faith",
        "reason",
        "except",
        "eighteenth",
        "century",
        "transformed",
        "implicit",
        "notsosubtle",
        "reproach",
        "thus",
        "hume",
        "proceeds",
        "add",
        "since",
        "ere",
        "reason",
        "insufficient",
        "convince",
        "u",
        "veracitywhoever",
        "moved",
        "faith",
        "assent",
        "christianity",
        "conscious",
        "continued",
        "miracle",
        "person",
        "subverts",
        "principle",
        "understanding",
        "give",
        "determination",
        "believe",
        "contrary",
        "custom",
        "experience",
        "sarcasm",
        "hard",
        "miss",
        "one",
        "way",
        "understanding",
        "emergence",
        "category",
        "fideism",
        "byproduct",
        "development",
        "secular",
        "conception",
        "rationality",
        "overtly",
        "hostile",
        "religion",
        "moved",
        "god",
        "premise",
        "thought",
        "possible",
        "conclusion",
        "classical",
        "theological",
        "account",
        "christian",
        "approach",
        "world",
        "coram",
        "deo",
        "god",
        "presence",
        "god",
        "view",
        "product",
        "inference",
        "world",
        "rather",
        "logo",
        "hermeneutical",
        "key",
        "understanding",
        "world",
        "latter",
        "imagined",
        "charles",
        "taylor",
        "call",
        "immanent",
        "frame",
        "lawlike",
        "space",
        "understood",
        "fully",
        "term",
        "but",
        "creation",
        "creation",
        "conceived",
        "coram",
        "deo",
        "presupposes",
        "creator",
        "starting",
        "point",
        "one",
        "inferred",
        "classical",
        "christian",
        "view",
        "gradually",
        "displaced",
        "secular",
        "imaginary",
        "world",
        "descartes",
        "demonstrated",
        "selfevident",
        "longer",
        "viewed",
        "requiring",
        "reference",
        "anything",
        "beyond",
        "ostensibly",
        "theologically",
        "neutral",
        "thus",
        "came",
        "provide",
        "starting",
        "point",
        "simply",
        "atheism",
        "new",
        "understanding",
        "natural",
        "theology",
        "belief",
        "god",
        "could",
        "grounded",
        "probabilistic",
        "argument",
        "premise",
        "dispute",
        "believer",
        "unbeliever",
        "true",
        "classical",
        "argument",
        "god",
        "existence",
        "eg",
        "thomas",
        "five",
        "way",
        "predate",
        "development",
        "secular",
        "reason",
        "scholar",
        "argued",
        "function",
        "changed",
        "time",
        "originally",
        "intended",
        "standalone",
        "proof",
        "would",
        "convince",
        "unbeliever",
        "operated",
        "within",
        "distinctive",
        "theological",
        "theater",
        "elucidate",
        "rather",
        "providing",
        "external",
        "foundation",
        "john",
        "clayton",
        "argued",
        "within",
        "premodern",
        "judaism",
        "christianity",
        "theistic",
        "proof",
        "used",
        "within",
        "religious",
        "community",
        "correct",
        "heresy",
        "confirm",
        "true",
        "belief",
        "simply",
        "express",
        "awe",
        "wonder",
        "also",
        "used",
        "apologetically",
        "christian",
        "target",
        "audience",
        "typically",
        "theist",
        "including",
        "muslim",
        "ince",
        "muslim",
        "already",
        "believed",
        "god",
        "thomas",
        "wanted",
        "mean",
        "rational",
        "argument",
        "convince",
        "god",
        "exists",
        "would",
        "seem",
        "likely",
        "hoped",
        "rehearsing",
        "proof",
        "together",
        "proof",
        "god",
        "nature",
        "establish",
        "muslim",
        "positive",
        "basis",
        "upon",
        "additionally",
        "specifically",
        "christian",
        "argument",
        "could",
        "built",
        "seventeenth",
        "century",
        "begun",
        "change",
        "attempting",
        "rescue",
        "god",
        "enthusiasm",
        "perceived",
        "dogmatism",
        "traditional",
        "religion",
        "deistic",
        "thinker",
        "sought",
        "establish",
        "le",
        "theologically",
        "ramified",
        "universal",
        "natural",
        "religion",
        "whereas",
        "formerly",
        "proof",
        "operated",
        "emically",
        "within",
        "horizon",
        "shared",
        "theological",
        "concern",
        "n",
        "new",
        "dispensation",
        "taylor",
        "argues",
        "issue",
        "god",
        "existence",
        "relation",
        "owe",
        "like",
        "put",
        "deism",
        "quite",
        "outside",
        "horizon",
        "shift",
        "argument",
        "role",
        "accompanied",
        "necessarily",
        "corresponding",
        "shift",
        "meaning",
        "key",
        "term",
        "world",
        "disembedded",
        "proof",
        "take",
        "point",
        "departure",
        "longer",
        "created",
        "order",
        "immanent",
        "domain",
        "emerging",
        "natural",
        "science",
        "god",
        "longer",
        "essential",
        "proper",
        "understanding",
        "world",
        "hypothetical",
        "explanation",
        "existence",
        "order",
        "reinterpreted",
        "argument",
        "presented",
        "new",
        "opportunity",
        "apologetics",
        "paley",
        "design",
        "argument",
        "also",
        "exposed",
        "belief",
        "god",
        "new",
        "form",
        "criticism",
        "raised",
        "hume",
        "dialogue",
        "concerning",
        "natural",
        "religion",
        "party",
        "dispute",
        "common",
        "conception",
        "rationality",
        "realm",
        "requires",
        "particular",
        "premise",
        "neutral",
        "respect",
        "god",
        "reality",
        "light",
        "earlier",
        "way",
        "thinking",
        "began",
        "god",
        "reality",
        "well",
        "later",
        "way",
        "thinking",
        "shared",
        "earlier",
        "starting",
        "point",
        "appeared",
        "irrational",
        "questionbegging",
        "faith",
        "originally",
        "meant",
        "something",
        "like",
        "trust",
        "came",
        "refer",
        "act",
        "holding",
        "belief",
        "without",
        "evidence",
        "sufficient",
        "warrant",
        "fideism",
        "thus",
        "paradoxically",
        "claim",
        "rational",
        "behave",
        "irrationally",
        "hence",
        "time",
        "term",
        "fideism",
        "entered",
        "philosophical",
        "vocabulary",
        "position",
        "denoted",
        "already",
        "highly",
        "suspect",
        "age",
        "reason",
        "faithism",
        "inevitably",
        "going",
        "sound",
        "irrational",
        "however",
        "conception",
        "reason",
        "putative",
        "fideist",
        "accused",
        "transgressing",
        "almost",
        "invariably",
        "one",
        "latter",
        "would",
        "reject",
        "insufficiently",
        "robust",
        "thus",
        "opposition",
        "reason",
        "said",
        "characterize",
        "fideism",
        "perhaps",
        "better",
        "conceived",
        "rejection",
        "particular",
        "account",
        "reason",
        "one",
        "socalled",
        "fideist",
        "regard",
        "overly",
        "narrow",
        "restrictive",
        "applicability",
        "religion",
        "particular",
        "way",
        "reasoning",
        "sure",
        "thinker",
        "described",
        "fideists",
        "sometimes",
        "expressed",
        "objection",
        "way",
        "contribute",
        "impression",
        "irrationalism",
        "looked",
        "point",
        "view",
        "however",
        "critic",
        "fideism",
        "fails",
        "appreciate",
        "irony",
        "putative",
        "fideist",
        "us",
        "term",
        "reason",
        "effect",
        "putative",
        "fideist",
        "generally",
        "charitably",
        "interpreted",
        "claiming",
        "rational",
        "refuse",
        "subject",
        "certain",
        "one",
        "belief",
        "popularly",
        "though",
        "misleadingly",
        "point",
        "view",
        "putative",
        "fideist",
        "called",
        "reason",
        "reason",
        "speak",
        "scare",
        "quotes",
        "indeed",
        "standpoint",
        "thinker",
        "labled",
        "fideistic",
        "modern",
        "natural",
        "theology",
        "insofar",
        "adopts",
        "secular",
        "premise",
        "treat",
        "god",
        "hypothetically",
        "constitutes",
        "theological",
        "error",
        "twentiethcentury",
        "protestant",
        "theologian",
        "karl",
        "barth",
        "suggested",
        "christian",
        "natural",
        "theology",
        "plagued",
        "inner",
        "contradiction",
        "christian",
        "natural",
        "theology",
        "must",
        "really",
        "represent",
        "affirm",
        "standpoint",
        "faith",
        "true",
        "objective",
        "really",
        "want",
        "lead",
        "unbelief",
        "knowability",
        "real",
        "god",
        "natural",
        "theology",
        "initial",
        "aim",
        "disguise",
        "therefore",
        "pretend",
        "share",
        "lifeendeavour",
        "natural",
        "man",
        "word",
        "natural",
        "theology",
        "either",
        "insincere",
        "pretending",
        "start",
        "standpoint",
        "unbelief",
        "sinful",
        "since",
        "barth",
        "protestant",
        "view",
        "unbelief",
        "even",
        "form",
        "methodological",
        "agnosticism",
        "theologically",
        "neutral",
        "active",
        "enmity",
        "god",
        "natural",
        "theology",
        "paradoxically",
        "requires",
        "abandoning",
        "christian",
        "perspective",
        "least",
        "methodologically",
        "misguided",
        "effort",
        "provide",
        "god",
        "support",
        "god",
        "christian",
        "view",
        "need",
        "protestant",
        "view",
        "course",
        "odds",
        "official",
        "catholic",
        "view",
        "noted",
        "earlier",
        "philosophical",
        "opposed",
        "theological",
        "term",
        "thinker",
        "labeled",
        "fideists",
        "tended",
        "find",
        "objectionable",
        "reason",
        "per",
        "se",
        "evidentialism",
        "ie",
        "doctrine",
        "expressed",
        "forcefully",
        "clifford",
        "belief",
        "rational",
        "supported",
        "evidence",
        "since",
        "evidentialism",
        "might",
        "otherwise",
        "seem",
        "give",
        "rise",
        "regress",
        "problem",
        "generally",
        "conjoined",
        "version",
        "foundationalism",
        "purport",
        "delineate",
        "criterion",
        "proper",
        "basicality",
        "ie",
        "set",
        "condition",
        "belief",
        "rationally",
        "held",
        "without",
        "evidential",
        "support",
        "whereas",
        "putative",
        "fideists",
        "like",
        "pascal",
        "argue",
        "religious",
        "belief",
        "given",
        "nonevidential",
        "support",
        "others",
        "interpreted",
        "suggesting",
        "belief",
        "properly",
        "basic",
        "plantinga",
        "argued",
        "recently",
        "criterion",
        "proper",
        "basicality",
        "would",
        "exclude",
        "religious",
        "belief",
        "shown",
        "justified",
        "contention",
        "either",
        "case",
        "believer",
        "rationally",
        "justified",
        "least",
        "shown",
        "behaving",
        "irrationally",
        "holding",
        "certain",
        "belief",
        "even",
        "belief",
        "supported",
        "evidence",
        "conceived",
        "way",
        "putative",
        "fideist",
        "position",
        "though",
        "uncontroversial",
        "hardly",
        "brazenly",
        "paradoxical",
        "doctrine",
        "might",
        "first",
        "appear"
    ]
}