{
    "main_text": "The Gifford Lectures\n6. The Gifford Lectures\n\nFindlay delivered the Gifford Lectures in two series at the University\nof St. Andrews, the first set, The Discipline of the Cave,\nfrom December 1964 to February 1965, the second set, The\nTranscendence of the Cave, from December 1965 to January 1966.\nThe Discipline of the Cave is dominated by the cave metaphor\npresented in Plato’s Republic; The Transcendence of\nthe Cave is dominated by the metaphor of the metaphysical\nhemisphere, derived from Plotinus, especially Ennead V, 8,\n“Of Intellectual Beauty”.\n\nThe strategy of the lectures is similar to F. H. Bradley’s in\nAppearance and Reality (1893). The ordinary natural world is\nfound to be absurd and self-contradictory, and the contradictions\npoint to a different world that is ultimately real. In Bradley’s\ncase the contradictions emerge from the idea that the ordinary natural\nworld is a world of substances that somehow “possess”\nproperties. In Findlay’s case, the contradictions emerge from\nabsurdities in the concepts of space, time, and material bodies, not\nonly in their ordinary manifestations but also in their scientific\ndoppelgangers.\n\nWhat do these alleged absurdities point to? In Bradley’s case,\nthe absurdities of distinct substances point to a realm of\nundifferentiated and undirected Feeling. In Findlay’s case, the\nabsurdities show merely that we are in a cave, and if we are inside,\nthere is necessarily an outside. The outside will prove to be a\nmarvelously complex web of perfected individuals. Though mystics have\nresponded positively to Findlay’s more Swedenborgian\npostulations, an argument is needed to give them minimal philosophical\ncredibility. Findlay gives two: first, the argument that everything\nthat is ideal in the actual world is actual in an ideal\n world;[9]\n second, that in an ideal world the distinctions between type and\ninstance, between fact and value, are progressively wiped out, so that\nthe distinction between the ideal and the actual is no longer\napplies.\n\nThe features of the Cave are given by phenomenology; the escape from\nthe Cave is provided by dialectic. It is not possible to follow\nFindlay in all the vivid phenomenological descriptions provided in DC.\nA small part of the discussion of space will serve as an example:\n\n\nOur idea of void space is one of most poignantly clear that we\npossess; it is the indispensable foil to body. We cannot move our\nmembers without being aware of it…True void is not seen or\ntouched, or if seen and touched, not quite in the same manner as the\nbodies in it: it is nonetheless in front of us, even if its vividness\nis marred by one or two wafts of air or by similar\nirrelevancies… The space of our own bodies as given in bodily\nfeeling in the dark watches of the night is often little different\nfrom void space: what is evident, indefeasible in it, is its three\ndimensionality, its extension and position, not the feeble sense\ncontents that irrelevantly flicker through it (DC: 99)…[I suggest that]\nwhat is now called a Euclidean structure, and what is now regarded as\na somewhat unadventurous type of spatiality among a thrilling variety\nof such, is in fact simply the notion of space as such, and all other\nnotions of space presuppose it, and represent progressive deviations\nfrom it, deviations which present no formal impossibility, but which\nrepresent no less the slow demise, the putting out of action, of the\nnobly interesting notion of space. (DC: 101)\n\n\nSimilar, and lengthy, phenomenological treatments are given of time\nand bodies. Where are the absurdities? Findlay argues that for bodies\nto be bodies, they must proceed unaffected through the media of space\nand time, but at the same time, space and time, to be what they are,\nmust interact with body. So space and time must be absolute, and must\nbe relative, a contradiction. As for bodies, there are insuperable\nproblems about the relation between bodies and their observable\nqualities, and between some bodies and their governing minds.\n\nThe list of such like antinomies is long, yet the underlying malady is\nclear: in one way or another, they all stem from the separation of\nindividuals from each other. What is the remedy for these separations?\nIn the first half of the Transcendence Findlay considers\nHegel’s proposal that these separations can be overcome by the\ndevelopment of common realm of logical concepts, meanings, ideals, and\nshared gods, at least where rational beings are found. But in\nTranscendence, Lecture 5, Findlay rejects the Hegelian\noption: \n\n\nOur aim is therefore bring to ruin the whole teleological fabric we\nhave been rearing, particularly its crowning religious\nmanifestations… The main uneasiness that affects the\nteleological picture can be quite readily stated: it lies in its\nimposed, arbitrary, willful character. (TC: 102) To view all phenomena in a\nspecial teleological relation to our rational selves remains a\ndifficult, unstable way of viewing things (TC: 103)…The stars may be, as\nHegel said, a mere light-rash upon the sky, infinitely insignificant\nbeside the simplest human thought or emotion. But is there not\nsomething very wanton in saying that the whole meaning of the former,\nin all their immensity of spatial and temporal extent, lies in their\nrole as mere background or supposition of the latter? It is\nparticularly when we consider such factors as the extent of space, now\nyawning more and more vacuously as planet after planet reveals itself\nbare of its imagined population, that a teleological absolutism\nà la Hegel seems more and more frivolous (TC: 104) … Plainly again\nit is only by a dialectical tour of force that this can be held to be\ninvolved in our wretched, confused, heartless, piecemeal\nliving (TC 105)… The objects of religion may be the supreme occupants\nof the human cave, but they are also the most blemished by antinomy\nand obscurity of any cave phenomenon (TC 106)… We conclude that the\nactual religions of the world, which all represent rational faith at\nits highest, are also all phenomena of the Cave, with inappropriate\nabsurd, sinister, and even monstrous elements, which most apologists\nhave sought to minimize. (TC: 117)\n\n\nMonotheism and Hegelianism cannot rescue us from the vast\narbitrariness of the physical universe: that these things exist and\nnot others, that these things are here and others are there; that\nthese things happened now, and not later, and that these things will\nhappen later but not now: all these are tossed in a sea of\ncontingency, all are de trop. But Plotinus does provide an\nanswer: it is not only our notions of things that can overcome\nseparation: is the things themselves, which contain a dimension of the\ndivine. This leads to the new metaphor of the “Plotinian\nhemisphere”. Consider the liberated inhabitants of the cave as\nscattered along the equator of a sphere. Each individual is\nintersected by a meridianal line, and these lines rise and converge on\nthe pole. These metaphorical lines of hemispheric “otherworldly\ngeography” include the points they intersect, so each thing at\nthe equator is also part of what exists at the pole, at which and in\nwhich their differences disappear. (Take a square inscribed within a\ncircle and shrink it to a point; the result will be a point-like round\nsquare.) The pole here is the Plotinian One, the\n“absolute” to which Findlay will devote an entire\nsubsequent book, Ascent to the Absolute. But in the Gifford\nlectures, it is the lives of the individuals as their meridians\napproach the pole that is the detailed object of description. Findlay\nleans here heavily on Plotinus’ portrait of the Realm of Mind,\nand the portrait of the spirit world of the Buddha, as given in the\nGandavyuha, in which individuals can exchange places without crossing\nthe space between, in which every mind is accessible to every other,\nand in which the shoes of the other become one’s own shoes:\n\n\nLife is easy yonder, and truth is their parent and nurse, and they see\nall things, not such as are in flux, but as have true being, as they\nsee themselves in others… For all things are transparent, and\nnothing is dark and resistant, light being made manifest to light.\n(Plotinus Enneads V, 8; Findlay’s own translation [TC:\n158])\n\n\nThe Gifford audience was very small, “the most exiguous of my\nexperience, but not inattentive”. One wonders what the reception\nof these lectures might have been had they been presented in 1893, the\nsame year as Bradley’s Appearance and Reality.\n",
    "section_title": "6. The Gifford Lectures",
    "entry_title": "John Niemeyer Findlay",
    "hierarchy_title": "John Niemeyer Findlay || The Gifford Lectures",
    "tokenized_text": [
        "gifford",
        "lecture",
        "gifford",
        "lecture",
        "findlay",
        "delivered",
        "gifford",
        "lecture",
        "two",
        "series",
        "university",
        "st",
        "andrew",
        "first",
        "set",
        "discipline",
        "cave",
        "december",
        "february",
        "second",
        "set",
        "transcendence",
        "cave",
        "december",
        "january",
        "discipline",
        "cave",
        "dominated",
        "cave",
        "metaphor",
        "presented",
        "plato",
        "republic",
        "transcendence",
        "cave",
        "dominated",
        "metaphor",
        "metaphysical",
        "hemisphere",
        "derived",
        "plotinus",
        "especially",
        "ennead",
        "v",
        "intellectual",
        "beauty",
        "strategy",
        "lecture",
        "similar",
        "f",
        "h",
        "bradley",
        "appearance",
        "reality",
        "ordinary",
        "natural",
        "world",
        "found",
        "absurd",
        "selfcontradictory",
        "contradiction",
        "point",
        "different",
        "world",
        "ultimately",
        "real",
        "bradley",
        "case",
        "contradiction",
        "emerge",
        "idea",
        "ordinary",
        "natural",
        "world",
        "world",
        "substance",
        "somehow",
        "posse",
        "property",
        "findlay",
        "case",
        "contradiction",
        "emerge",
        "absurdity",
        "concept",
        "space",
        "time",
        "material",
        "body",
        "ordinary",
        "manifestation",
        "also",
        "scientific",
        "doppelganger",
        "alleged",
        "absurdity",
        "point",
        "bradley",
        "case",
        "absurdity",
        "distinct",
        "substance",
        "point",
        "realm",
        "undifferentiated",
        "undirected",
        "feeling",
        "findlay",
        "case",
        "absurdity",
        "show",
        "merely",
        "cave",
        "inside",
        "necessarily",
        "outside",
        "outside",
        "prove",
        "marvelously",
        "complex",
        "web",
        "perfected",
        "individual",
        "though",
        "mystic",
        "responded",
        "positively",
        "findlay",
        "swedenborgian",
        "postulation",
        "argument",
        "needed",
        "give",
        "minimal",
        "philosophical",
        "credibility",
        "findlay",
        "give",
        "two",
        "first",
        "argument",
        "everything",
        "ideal",
        "actual",
        "world",
        "actual",
        "ideal",
        "world",
        "second",
        "ideal",
        "world",
        "distinction",
        "type",
        "instance",
        "fact",
        "value",
        "progressively",
        "wiped",
        "distinction",
        "ideal",
        "actual",
        "longer",
        "applies",
        "feature",
        "cave",
        "given",
        "phenomenology",
        "escape",
        "cave",
        "provided",
        "dialectic",
        "possible",
        "follow",
        "findlay",
        "vivid",
        "phenomenological",
        "description",
        "provided",
        "dc",
        "small",
        "part",
        "discussion",
        "space",
        "serve",
        "example",
        "idea",
        "void",
        "space",
        "one",
        "poignantly",
        "clear",
        "posse",
        "indispensable",
        "foil",
        "body",
        "move",
        "member",
        "without",
        "aware",
        "ittrue",
        "void",
        "seen",
        "touched",
        "seen",
        "touched",
        "quite",
        "manner",
        "body",
        "nonetheless",
        "front",
        "u",
        "even",
        "vividness",
        "marred",
        "one",
        "two",
        "waft",
        "air",
        "similar",
        "irrelevancies",
        "space",
        "body",
        "given",
        "bodily",
        "feeling",
        "dark",
        "watch",
        "night",
        "often",
        "little",
        "different",
        "void",
        "space",
        "evident",
        "indefeasible",
        "three",
        "dimensionality",
        "extension",
        "position",
        "feeble",
        "sense",
        "content",
        "irrelevantly",
        "flicker",
        "dc",
        "suggest",
        "called",
        "euclidean",
        "structure",
        "regarded",
        "somewhat",
        "unadventurous",
        "type",
        "spatiality",
        "among",
        "thrilling",
        "variety",
        "fact",
        "simply",
        "notion",
        "space",
        "notion",
        "space",
        "presuppose",
        "represent",
        "progressive",
        "deviation",
        "deviation",
        "present",
        "formal",
        "impossibility",
        "represent",
        "le",
        "slow",
        "demise",
        "putting",
        "action",
        "nobly",
        "interesting",
        "notion",
        "space",
        "dc",
        "similar",
        "lengthy",
        "phenomenological",
        "treatment",
        "given",
        "time",
        "body",
        "absurdity",
        "findlay",
        "argues",
        "body",
        "body",
        "must",
        "proceed",
        "unaffected",
        "medium",
        "space",
        "time",
        "time",
        "space",
        "time",
        "must",
        "interact",
        "body",
        "space",
        "time",
        "must",
        "absolute",
        "must",
        "relative",
        "contradiction",
        "body",
        "insuperable",
        "problem",
        "relation",
        "body",
        "observable",
        "quality",
        "body",
        "governing",
        "mind",
        "list",
        "like",
        "antinomy",
        "long",
        "yet",
        "underlying",
        "malady",
        "clear",
        "one",
        "way",
        "another",
        "stem",
        "separation",
        "individual",
        "remedy",
        "separation",
        "first",
        "half",
        "transcendence",
        "findlay",
        "considers",
        "hegel",
        "proposal",
        "separation",
        "overcome",
        "development",
        "common",
        "realm",
        "logical",
        "concept",
        "meaning",
        "ideal",
        "shared",
        "god",
        "least",
        "rational",
        "being",
        "found",
        "transcendence",
        "lecture",
        "findlay",
        "reject",
        "hegelian",
        "option",
        "aim",
        "therefore",
        "bring",
        "ruin",
        "whole",
        "teleological",
        "fabric",
        "rearing",
        "particularly",
        "crowning",
        "religious",
        "manifestations",
        "main",
        "uneasiness",
        "affect",
        "teleological",
        "picture",
        "quite",
        "readily",
        "stated",
        "lie",
        "imposed",
        "arbitrary",
        "willful",
        "character",
        "tc",
        "view",
        "phenomenon",
        "special",
        "teleological",
        "relation",
        "rational",
        "self",
        "remains",
        "difficult",
        "unstable",
        "way",
        "viewing",
        "thing",
        "tc",
        "the",
        "star",
        "may",
        "hegel",
        "said",
        "mere",
        "lightrash",
        "upon",
        "sky",
        "infinitely",
        "insignificant",
        "beside",
        "simplest",
        "human",
        "thought",
        "emotion",
        "something",
        "wanton",
        "saying",
        "whole",
        "meaning",
        "former",
        "immensity",
        "spatial",
        "temporal",
        "extent",
        "lie",
        "role",
        "mere",
        "background",
        "supposition",
        "latter",
        "particularly",
        "consider",
        "factor",
        "extent",
        "space",
        "yawning",
        "vacuously",
        "planet",
        "planet",
        "reveals",
        "bare",
        "imagined",
        "population",
        "teleological",
        "absolutism",
        "à",
        "la",
        "hegel",
        "seems",
        "frivolous",
        "tc",
        "plainly",
        "dialectical",
        "tour",
        "force",
        "held",
        "involved",
        "wretched",
        "confused",
        "heartless",
        "piecemeal",
        "living",
        "tc",
        "object",
        "religion",
        "may",
        "supreme",
        "occupant",
        "human",
        "cave",
        "also",
        "blemished",
        "antinomy",
        "obscurity",
        "cave",
        "phenomenon",
        "tc",
        "conclude",
        "actual",
        "religion",
        "world",
        "represent",
        "rational",
        "faith",
        "highest",
        "also",
        "phenomenon",
        "cave",
        "inappropriate",
        "absurd",
        "sinister",
        "even",
        "monstrous",
        "element",
        "apologist",
        "sought",
        "minimize",
        "tc",
        "monotheism",
        "hegelianism",
        "rescue",
        "u",
        "vast",
        "arbitrariness",
        "physical",
        "universe",
        "thing",
        "exist",
        "others",
        "thing",
        "others",
        "thing",
        "happened",
        "later",
        "thing",
        "happen",
        "later",
        "tossed",
        "sea",
        "contingency",
        "de",
        "trop",
        "plotinus",
        "provide",
        "answer",
        "notion",
        "thing",
        "overcome",
        "separation",
        "thing",
        "contain",
        "dimension",
        "divine",
        "lead",
        "new",
        "metaphor",
        "plotinian",
        "hemisphere",
        "consider",
        "liberated",
        "inhabitant",
        "cave",
        "scattered",
        "along",
        "equator",
        "sphere",
        "individual",
        "intersected",
        "meridianal",
        "line",
        "line",
        "rise",
        "converge",
        "pole",
        "metaphorical",
        "line",
        "hemispheric",
        "otherworldly",
        "geography",
        "include",
        "point",
        "intersect",
        "thing",
        "equator",
        "also",
        "part",
        "exists",
        "pole",
        "difference",
        "disappear",
        "take",
        "square",
        "inscribed",
        "within",
        "circle",
        "shrink",
        "point",
        "result",
        "pointlike",
        "round",
        "square",
        "pole",
        "plotinian",
        "one",
        "absolute",
        "findlay",
        "devote",
        "entire",
        "subsequent",
        "book",
        "ascent",
        "absolute",
        "gifford",
        "lecture",
        "life",
        "individual",
        "meridian",
        "approach",
        "pole",
        "detailed",
        "object",
        "description",
        "findlay",
        "lean",
        "heavily",
        "plotinus",
        "portrait",
        "realm",
        "mind",
        "portrait",
        "spirit",
        "world",
        "buddha",
        "given",
        "gandavyuha",
        "individual",
        "exchange",
        "place",
        "without",
        "crossing",
        "space",
        "every",
        "mind",
        "accessible",
        "every",
        "shoe",
        "become",
        "one",
        "shoe",
        "life",
        "easy",
        "yonder",
        "truth",
        "parent",
        "nurse",
        "see",
        "thing",
        "flux",
        "true",
        "see",
        "others",
        "thing",
        "transparent",
        "nothing",
        "dark",
        "resistant",
        "light",
        "made",
        "manifest",
        "light",
        "plotinus",
        "ennead",
        "v",
        "findlay",
        "translation",
        "tc",
        "gifford",
        "audience",
        "small",
        "exiguous",
        "experience",
        "inattentive",
        "one",
        "wonder",
        "reception",
        "lecture",
        "might",
        "presented",
        "year",
        "bradley",
        "appearance",
        "reality"
    ]
}