{
    "main_text": "Life (1903–1987)\n1. Life (1903–1987)\n\nJohn Niemeyer Findlay was born on 25 November 1903 in Pretoria, South\nAfrica, in what was then the Crown Colony of the\n Transvaal.[1]\n His father, born in South Africa, was by descent Scottish, Welsh, and\nEnglish; his mother, also born in South Africa, was by descent French,\nGerman and Dutch. The Findlays and the Niemeyers were distinguished\nSouth African families. Findlay’s great grandfather, on his\nfather’s side, was the Scottish captain of the ship\nAlacrity and an early European explorer of South Africa. His\ngreat uncle, on his mother’s side, was the poet Eugene Marais,\none of the founders of Afrikaans literature. Findlay’s father\nadvised the government on legal matters, and his cousins included a\nCape Prime Minister, the novelist, Olive Schreiner, and the Brazilian\narchitect Oscar Niemeyer. This birth and lineage has its effect.\nFindlay’s manner, though never cold, combined that mixture of\naristocratic courtesy and unwavering self-assurance sometimes\nassociated with the well-born. This heritage might explain\nFindlay’s confidence in swimming constantly against the\nphilosophical mainstream, and, in his metaphysical work, far out to\n sea.[2]\n\n\nFrom 1909, Findlay attended various grammar schools in Pretoria and\nthe High Veld. He learned Latin and Greek at school, Dutch from his\nnurses, Afrikaans from his friends and French entirely on his own. \nHe memorized poems and wrote many himself. Later in life, he joined a\ntheater company and acted in all the major plays of Chekhov. This love\nof language and theater generated his eloquent prose style, an apt\nvehicle for later virtuoso exercises in phenomenological description.\nIt also percolated into Findlay’s teaching manner, often highly\ntheatrical. He would, for example, in seminars, put a handkerchief\nover his face and then snatch it off, as an illustration of the\nHusserlian distinction between unfulfilled and fulfilled intentions.\nIn 1915, Findlay moved on to the High School for Boys in Pretoria,\nwhere he was (as he writes) “monotonously” the top student\nin his class every year.\n\nTwo items of philosophical note emerge from Findlay’s youth:\n\nFirst, at age seven Findlay became a firm vegetarian, not because meat\nanimals can suffer, but because (he writes) meat animals are\nconscious, which gives them moral status. (That Findlay was a\nvegetarian will come as a surprise to some of his former graduate\nstudents, who may have observed Findlay carving roast beef at his\nsupper parties, but never noticed he took no plate of his own.)\nPerhaps Findlay’s early attitude towards non-human animals\nprovoked his later separation of mentality from linguistic\n competence.[3]\n\n\nSecond, possibly in reaction to the Christian orthodoxy prevailing at\nthe High School for Boys, Findlay began reading the theosophists,\nincluding Madame Blavatsky, and, one after another, Max\nMüller’s “Sacred Books of the East”, adding\n“a little Sanskrit” to his linguistic repertoire.\nFindlay’s affection for Buddhism and Hinduism was lifelong, and\nhis disaffection with monotheism was also lifelong. It motivated his\nmost discussed article, “Can God’s Existence Be\nDisproved?” (1948a) the title of which was emended by Ryle from\nthe submitted original, “A Disproof of the Existence of\n God”.[4]\n But Findlay was more drawn to the metaphysics of the\ntheosophists, which he identified with Neoplatonism, than to their\nspiritual exercises, and his interest in Madame Blavatsky was guarded.\nNevertheless, Findlay later remarked that his Gifford lectures were\ntheosophy, with all the defective points left out.\n\nFindlay graduated from high school in 1922, and his brother gave him\nas gifts copies of Henri Bergson’s Creative Evolution\n(1907 [1911]) and William Wallace’s translation of\nHegel’s Logic (Hegel 1830 [1873]), his first books of\nWestern philosophy. Hegel’ Logic presented Findlay\nwith an immanent absolute that displaced the Upanishadic mysticism of\nhis teenage years.\n\nIn 1924, Findlay won a Rhodes scholarship to Oxford, and spent two\nyears at Balliol, reading greats. Despite his affection for Hegel, or\nperhaps because of it, Findlay had little interest in the British\nHegelianism of Bradley or Bosanquet. He veered away from modern\nphilosophy into studies of Plato, developing the hypothesis that\nAristotle’s disparaging remarks about Plato’s late\nphilosophy were important indicators of a deeper Platonic system than\nis found in the dialogues. This historical work, conceived decades\nbefore German scholars began writing in earnest about the\nungescriebende Lehre of late Plato, earned him a First. It\nalso planted the seeds of a book on Plato, which Findlay eventually\npublished, after a typically long gestation, in 1974.\n\nIn his third year at Oxford, Findlay discovered Russell, Wittgenstein,\nand the new realism, which put him at odds with the prevailing Oxford\nidealism. Findlay’s admiration for Russell, a thinker dismissed\nby a contemporaneous Oxford don as “not a philosopher, but a\ncriminal” foreclosed any possibility of a fellowship. \n\nSo, in 1927, Findlay returned to South Africa as a young philosophy\nlecturer at the University of Pretoria, his first appointment in an\nextended Wanderjahre that included positions at Dunedin\n(New Zealand, 1933–1944)\nGrahamstown (Eastern Cape, S.A.1944–6), Pietermartizberg\n(Natal, S.A, 1946–1948). It was at Dunedin that he met and\nmarried his wife Aileen Hawthorn, with whom he had three children in\nthe early 1940s.\n\nThe Wanderjahre for the Findlays continued in the Northern\nhemisphere after World War II at Newcastle on Tyne (1948–51),\nwith an appointment as chair at Kings College, University of London\n(1951–1965), and with professorships at Carleton College (1965),\nthe University of Texas (1966–67), Yale University\n(1967–73) and Boston University (1973–84). \n\nFindlay’s academic appointments do not track his intellectual\ndevelopment; the crucial turns in his mental life involved academic\nleaves. In 1929, Findlay went to Germany and spent part of 1930 in\nBerlin. There he learned German, and discovered the works of Brentano,\nMeinong, and Husserl. Brentano inspired Findlay’s book,\nValues and Intentions (VI begun in 1933, published in 1963);\nMeinong inspired the book Meinong’s Theory of Objects\n(M, begun in 1931, published in 1933,) and Husserl inspired Findlay to\nundertake the translation (begun in 1939, published in 1970). of\nHusserl’s intricate Logisiche Untersuchungen. The\nresearch on Meinong involved several stays at the University of Graz,\nwhere he received a doctorate in 1932 for his work on Meinong. The\ndepth of his commitment to the phenomenological tradition is indicated\nby the scale of these projects, involving decades of work on an almost\ndaily basis.\n\nThe second leave of consequence was in 1938 and 1939, where Findlay\nwent from New Zealand to England via North America. He met Carnap at\nBerkeley, Russell in Chicago, Quine in Boston, and Heidegger in\nFreiburg. The analytic philosophers made a good impression, Heidegger\na bad one: \n\n\nOne of those natural catastrophes that occur even in philosophy, a\nblanketing snowfall beneath which all the familiar landmarks in\nphilosophy are gradually obscured. \n\n\nHeidegger told Findlay that he would perhaps understand the mysteries\nof Angst and Nothingness if he had had front line experience during\nthe First World War. \n\n\nHis black leggings and peasant attire gave him the vague aspect of a\ncircus-master, cracking his whip while the ominous shapes evoked by\nhis discourse seemed to caper around. (ML: 31) \n\n\nWhile in Freiburg Findlay took a quiet sidelong glance at the workings\nof Nazism: “the youths and maidens with their bright\nfaces”, and “some poor Jews silently praying as they\npassed the ruins of their demolished synagogue” (Ibid.)\n\nReturning to England, Findlay abandoned Oxford for Cambridge, met with\nMoore and Wittgenstein, and attended their seminars in Fall 1939. The\nresult was a stream of papers in a hard-core analytic style, tightly\nreasoned and bristling with distinctions. These include “Time: a\nTreatment of Some Puzzles” (1941b), “Goedelian Sentences:\nA Non-Numerical Approach” (1942), “Morality by\nConvention” (1944),“Can God's Existence Be\nDisproved?”(1948), “The Notion of Infinity” (1953),\nand “The Justification of Attitudes” (1954), all anthologized in\nLanguage, Mind, and Value (LMV, 1963).\n\nWhen Findlay was appointed to King’s College at the University\nof London in 1951, he found himself in competition with A. J. Ayer,\nthe leading light at the University College branch of the same\nuniversity. Ayer, still professing logical positivism, was attracting\nthe best students and professors, so Findlay, by way of strategic\ncontrast, made Hegel the Special Author in the curriculum at Kings.\nThe choice proved surprisingly popular. Ayer generously responded\nwith an offer to publish a book by Findlay on Hegel. The book,\nHegel: A Re-examination (1958) written in a clear style, was\nfor decades a life raft for those graduate students who despaired of\never understanding Hegel in the raw. \n\nFindlay’s efforts in the Hegel book led to a change of method in\nhis work. The requirements of analytic philosophy—the demand for\nclarity, the insistence on deductive connection of ideas-- gave way to\na more flexible movement of thought, where many connections of ideas\nwere declared to be “logical” even if the connection was\nless than deductive. Contradictions and antinomies were embraced;\n“clarity is not enough” became a rallying cry. The new\ntechnique for philosophy is described in Findlay’s article\n“Essential Probabilities” (1967a). Essential probabilism\nencouraged Findlay to return to his long abandoned book on the mind,\npublished as Values and Intentions, in 1961. He returned to\nhis youthful interest in metaphysics, presenting his own speculative\nsystem in two series of Gifford lectures, The Discipline of the\nCave (DC, 1966) and The Transcendence of the Cave (TC,\n1967). In the Gifford lectures, Findlay reintroduced the absolute that\nhe had foresworn in his essay on God. He now conceded publicly that\nthe monotheists were right to have an absolute, but wrong in the\nabsolute they chose. “How odd/of God/to choose/the\nHindoos”, says the preface to The Transcendence of the\nCave. The later writings of the 1970s are footnotes and\nsupplements to what is given in these three books from the 1960s.\n\nFrom the standpoint of mainstream analytic philosophy, Findlay serves\nas the dedicated contrarian. He threw Husserl at Frege, Meinong at\nRussell, Brentano at the later Wittgenstein. He did not attack with\nthe contemporary method of generating counterexamples to mid-level\nphilosophical generalizations. He set up Husserl and Meinong and\nBrentano as substantial figures, as worthy of interest as their\nanalytic counterparts. When these three diverged from the analytic\ngods, they provided full-fledged philosophical alternatives, not\nisolated pot-shots.\n\nAs for his systematic metaphysics, which exudes an almost Leibnizian\noptimism regarding the failures of the everyday world, Findlay himself\nfelt doubts. What he once said about Hegel applies to his own\nworks:\n\n\nWhen I do hard theoretical work…I feel clear too that the world\nhas a sense, and that no other philosophy [than Hegel’s]\nexpresses this sense satisfactorily. But in my more frequent mood of\nmild depression, I am not a Hegelian: I regress to a materialism which\nis not, I fear, at all dialectical. I see the world as devoid of\nsense, I submit masochistically to its senselessness, even taking more\ncomfort in its cold credibility than in the rational desirability of\nHegelianism. (“The Contemporary Relevance of Hegel”, 1959a\n[LMV: 231]) \n\n\nDespite these depressions, Findlay remained loyal from first to last\nto his favorite texts: the Timaeus of Plato, the\nEnneads of Plotinus, and the Logic of Hegel:\n“Plato for inventing the forms, Plotinus for relating them to an\nabsolute, and Hegel for setting them all into dialectical\nmotion” (Lecture at Baruch College, New York City, April 1976.\nunpublished). The reward for loyalty was a singular philosophy of\nunusual scope.\n",
    "section_title": "1. Life (1903–1987)",
    "entry_title": "John Niemeyer Findlay",
    "hierarchy_title": "John Niemeyer Findlay || Life (1903–1987)",
    "tokenized_text": [
        "life",
        "life",
        "john",
        "niemeyer",
        "findlay",
        "born",
        "november",
        "pretoria",
        "south",
        "africa",
        "crown",
        "colony",
        "transvaal",
        "father",
        "born",
        "south",
        "africa",
        "descent",
        "scottish",
        "welsh",
        "english",
        "mother",
        "also",
        "born",
        "south",
        "africa",
        "descent",
        "french",
        "german",
        "dutch",
        "findlays",
        "niemeyers",
        "distinguished",
        "south",
        "african",
        "family",
        "findlay",
        "great",
        "grandfather",
        "father",
        "side",
        "scottish",
        "captain",
        "ship",
        "alacrity",
        "early",
        "european",
        "explorer",
        "south",
        "africa",
        "great",
        "uncle",
        "mother",
        "side",
        "poet",
        "eugene",
        "marais",
        "one",
        "founder",
        "afrikaans",
        "literature",
        "findlay",
        "father",
        "advised",
        "government",
        "legal",
        "matter",
        "cousin",
        "included",
        "cape",
        "prime",
        "minister",
        "novelist",
        "olive",
        "schreiner",
        "brazilian",
        "architect",
        "oscar",
        "niemeyer",
        "birth",
        "lineage",
        "effect",
        "findlay",
        "manner",
        "though",
        "never",
        "cold",
        "combined",
        "mixture",
        "aristocratic",
        "courtesy",
        "unwavering",
        "selfassurance",
        "sometimes",
        "associated",
        "wellborn",
        "heritage",
        "might",
        "explain",
        "findlay",
        "confidence",
        "swimming",
        "constantly",
        "philosophical",
        "mainstream",
        "metaphysical",
        "work",
        "far",
        "sea",
        "findlay",
        "attended",
        "various",
        "grammar",
        "school",
        "pretoria",
        "high",
        "veld",
        "learned",
        "latin",
        "greek",
        "school",
        "dutch",
        "nurse",
        "afrikaans",
        "friend",
        "french",
        "entirely",
        "memorized",
        "poem",
        "wrote",
        "many",
        "later",
        "life",
        "joined",
        "theater",
        "company",
        "acted",
        "major",
        "play",
        "chekhov",
        "love",
        "language",
        "theater",
        "generated",
        "eloquent",
        "prose",
        "style",
        "apt",
        "vehicle",
        "later",
        "virtuoso",
        "exercise",
        "phenomenological",
        "description",
        "also",
        "percolated",
        "findlay",
        "teaching",
        "manner",
        "often",
        "highly",
        "theatrical",
        "would",
        "example",
        "seminar",
        "put",
        "handkerchief",
        "face",
        "snatch",
        "illustration",
        "husserlian",
        "distinction",
        "unfulfilled",
        "fulfilled",
        "intention",
        "findlay",
        "moved",
        "high",
        "school",
        "boy",
        "pretoria",
        "writes",
        "monotonously",
        "top",
        "student",
        "class",
        "every",
        "year",
        "two",
        "item",
        "philosophical",
        "note",
        "emerge",
        "findlay",
        "youth",
        "first",
        "age",
        "seven",
        "findlay",
        "became",
        "firm",
        "vegetarian",
        "meat",
        "animal",
        "suffer",
        "writes",
        "meat",
        "animal",
        "conscious",
        "give",
        "moral",
        "status",
        "findlay",
        "vegetarian",
        "come",
        "surprise",
        "former",
        "graduate",
        "student",
        "may",
        "observed",
        "findlay",
        "carving",
        "roast",
        "beef",
        "supper",
        "party",
        "never",
        "noticed",
        "took",
        "plate",
        "perhaps",
        "findlay",
        "early",
        "attitude",
        "towards",
        "nonhuman",
        "animal",
        "provoked",
        "later",
        "separation",
        "mentality",
        "linguistic",
        "competence",
        "second",
        "possibly",
        "reaction",
        "christian",
        "orthodoxy",
        "prevailing",
        "high",
        "school",
        "boy",
        "findlay",
        "began",
        "reading",
        "theosophist",
        "including",
        "madame",
        "blavatsky",
        "one",
        "another",
        "max",
        "müller",
        "sacred",
        "book",
        "east",
        "adding",
        "little",
        "sanskrit",
        "linguistic",
        "repertoire",
        "findlay",
        "affection",
        "buddhism",
        "hinduism",
        "lifelong",
        "disaffection",
        "monotheism",
        "also",
        "lifelong",
        "motivated",
        "discussed",
        "article",
        "god",
        "existence",
        "disproved",
        "a",
        "title",
        "emended",
        "ryle",
        "submitted",
        "original",
        "disproof",
        "existence",
        "god",
        "findlay",
        "drawn",
        "metaphysics",
        "theosophist",
        "identified",
        "neoplatonism",
        "spiritual",
        "exercise",
        "interest",
        "madame",
        "blavatsky",
        "guarded",
        "nevertheless",
        "findlay",
        "later",
        "remarked",
        "gifford",
        "lecture",
        "theosophy",
        "defective",
        "point",
        "left",
        "findlay",
        "graduated",
        "high",
        "school",
        "brother",
        "gave",
        "gift",
        "copy",
        "henri",
        "bergson",
        "creative",
        "evolution",
        "william",
        "wallace",
        "translation",
        "hegel",
        "logic",
        "hegel",
        "first",
        "book",
        "western",
        "philosophy",
        "hegel",
        "logic",
        "presented",
        "findlay",
        "immanent",
        "absolute",
        "displaced",
        "upanishadic",
        "mysticism",
        "teenage",
        "year",
        "findlay",
        "rhodes",
        "scholarship",
        "oxford",
        "spent",
        "two",
        "year",
        "balliol",
        "reading",
        "great",
        "despite",
        "affection",
        "hegel",
        "perhaps",
        "findlay",
        "little",
        "interest",
        "british",
        "hegelianism",
        "bradley",
        "bosanquet",
        "veered",
        "away",
        "modern",
        "philosophy",
        "study",
        "plato",
        "developing",
        "hypothesis",
        "aristotle",
        "disparaging",
        "remark",
        "plato",
        "late",
        "philosophy",
        "important",
        "indicator",
        "deeper",
        "platonic",
        "system",
        "found",
        "dialogue",
        "historical",
        "work",
        "conceived",
        "decade",
        "german",
        "scholar",
        "began",
        "writing",
        "earnest",
        "ungescriebende",
        "lehre",
        "late",
        "plato",
        "earned",
        "first",
        "also",
        "planted",
        "seed",
        "book",
        "plato",
        "findlay",
        "eventually",
        "published",
        "typically",
        "long",
        "gestation",
        "third",
        "year",
        "oxford",
        "findlay",
        "discovered",
        "russell",
        "wittgenstein",
        "new",
        "realism",
        "put",
        "odds",
        "prevailing",
        "oxford",
        "idealism",
        "findlay",
        "admiration",
        "russell",
        "thinker",
        "dismissed",
        "contemporaneous",
        "oxford",
        "philosopher",
        "criminal",
        "foreclosed",
        "possibility",
        "fellowship",
        "findlay",
        "returned",
        "south",
        "africa",
        "young",
        "philosophy",
        "lecturer",
        "university",
        "pretoria",
        "first",
        "appointment",
        "extended",
        "wanderjahre",
        "included",
        "position",
        "dunedin",
        "new",
        "zealand",
        "grahamstown",
        "eastern",
        "cape",
        "sa",
        "pietermartizberg",
        "natal",
        "sa",
        "dunedin",
        "met",
        "married",
        "wife",
        "aileen",
        "hawthorn",
        "three",
        "child",
        "early",
        "s",
        "wanderjahre",
        "findlays",
        "continued",
        "northern",
        "hemisphere",
        "world",
        "war",
        "ii",
        "newcastle",
        "tyne",
        "appointment",
        "chair",
        "king",
        "college",
        "university",
        "london",
        "professorship",
        "carleton",
        "college",
        "university",
        "texas",
        "yale",
        "university",
        "boston",
        "university",
        "findlay",
        "academic",
        "appointment",
        "track",
        "intellectual",
        "development",
        "crucial",
        "turn",
        "mental",
        "life",
        "involved",
        "academic",
        "leaf",
        "findlay",
        "went",
        "germany",
        "spent",
        "part",
        "berlin",
        "learned",
        "german",
        "discovered",
        "work",
        "brentano",
        "meinong",
        "husserl",
        "brentano",
        "inspired",
        "findlay",
        "book",
        "value",
        "intention",
        "vi",
        "begun",
        "published",
        "meinong",
        "inspired",
        "book",
        "meinong",
        "theory",
        "object",
        "begun",
        "published",
        "husserl",
        "inspired",
        "findlay",
        "undertake",
        "translation",
        "begun",
        "published",
        "husserl",
        "intricate",
        "logisiche",
        "untersuchungen",
        "research",
        "meinong",
        "involved",
        "several",
        "stay",
        "university",
        "graz",
        "received",
        "doctorate",
        "work",
        "meinong",
        "depth",
        "commitment",
        "phenomenological",
        "tradition",
        "indicated",
        "scale",
        "project",
        "involving",
        "decade",
        "work",
        "almost",
        "daily",
        "basis",
        "second",
        "leave",
        "consequence",
        "findlay",
        "went",
        "new",
        "zealand",
        "england",
        "via",
        "north",
        "america",
        "met",
        "carnap",
        "berkeley",
        "russell",
        "chicago",
        "quine",
        "boston",
        "heidegger",
        "freiburg",
        "analytic",
        "philosopher",
        "made",
        "good",
        "impression",
        "heidegger",
        "bad",
        "one",
        "one",
        "natural",
        "catastrophe",
        "occur",
        "even",
        "philosophy",
        "blanketing",
        "snowfall",
        "beneath",
        "familiar",
        "landmark",
        "philosophy",
        "gradually",
        "obscured",
        "heidegger",
        "told",
        "findlay",
        "would",
        "perhaps",
        "understand",
        "mystery",
        "angst",
        "nothingness",
        "front",
        "line",
        "experience",
        "first",
        "world",
        "war",
        "black",
        "legging",
        "peasant",
        "attire",
        "gave",
        "vague",
        "aspect",
        "circusmaster",
        "cracking",
        "whip",
        "ominous",
        "shape",
        "evoked",
        "discourse",
        "seemed",
        "caper",
        "around",
        "ml",
        "freiburg",
        "findlay",
        "took",
        "quiet",
        "sidelong",
        "glance",
        "working",
        "nazism",
        "youth",
        "maiden",
        "bright",
        "face",
        "poor",
        "jew",
        "silently",
        "praying",
        "passed",
        "ruin",
        "demolished",
        "synagogue",
        "ibid",
        "returning",
        "england",
        "findlay",
        "abandoned",
        "oxford",
        "cambridge",
        "met",
        "moore",
        "wittgenstein",
        "attended",
        "seminar",
        "fall",
        "result",
        "stream",
        "paper",
        "hardcore",
        "analytic",
        "style",
        "tightly",
        "reasoned",
        "bristling",
        "distinction",
        "include",
        "time",
        "treatment",
        "puzzle",
        "b",
        "goedelian",
        "sentence",
        "nonnumerical",
        "approach",
        "morality",
        "convention",
        "god",
        "s",
        "existence",
        "disproved",
        "notion",
        "infinity",
        "justification",
        "attitude",
        "anthologized",
        "language",
        "mind",
        "value",
        "lmv",
        "findlay",
        "appointed",
        "king",
        "college",
        "university",
        "london",
        "found",
        "competition",
        "a",
        "j",
        "ayer",
        "leading",
        "light",
        "university",
        "college",
        "branch",
        "university",
        "ayer",
        "still",
        "professing",
        "logical",
        "positivism",
        "attracting",
        "best",
        "student",
        "professor",
        "findlay",
        "way",
        "strategic",
        "contrast",
        "made",
        "hegel",
        "special",
        "author",
        "curriculum",
        "king",
        "choice",
        "proved",
        "surprisingly",
        "popular",
        "ayer",
        "generously",
        "responded",
        "offer",
        "publish",
        "book",
        "findlay",
        "hegel",
        "book",
        "hegel",
        "reexamination",
        "written",
        "clear",
        "style",
        "decade",
        "life",
        "raft",
        "graduate",
        "student",
        "despaired",
        "ever",
        "understanding",
        "hegel",
        "raw",
        "findlay",
        "effort",
        "hegel",
        "book",
        "led",
        "change",
        "method",
        "work",
        "requirement",
        "analytic",
        "philosophythe",
        "demand",
        "clarity",
        "insistence",
        "deductive",
        "connection",
        "idea",
        "gave",
        "way",
        "flexible",
        "movement",
        "thought",
        "many",
        "connection",
        "idea",
        "declared",
        "logical",
        "even",
        "connection",
        "le",
        "deductive",
        "contradiction",
        "antinomy",
        "embraced",
        "clarity",
        "enough",
        "became",
        "rallying",
        "cry",
        "new",
        "technique",
        "philosophy",
        "described",
        "findlay",
        "article",
        "essential",
        "probability",
        "a",
        "essential",
        "probabilism",
        "encouraged",
        "findlay",
        "return",
        "long",
        "abandoned",
        "book",
        "mind",
        "published",
        "value",
        "intention",
        "returned",
        "youthful",
        "interest",
        "metaphysics",
        "presenting",
        "speculative",
        "system",
        "two",
        "series",
        "gifford",
        "lecture",
        "discipline",
        "cave",
        "dc",
        "transcendence",
        "cave",
        "tc",
        "gifford",
        "lecture",
        "findlay",
        "reintroduced",
        "absolute",
        "foresworn",
        "essay",
        "god",
        "conceded",
        "publicly",
        "monotheist",
        "right",
        "absolute",
        "wrong",
        "absolute",
        "chose",
        "oddof",
        "godto",
        "choosethe",
        "hindoo",
        "say",
        "preface",
        "transcendence",
        "cave",
        "later",
        "writing",
        "s",
        "footnote",
        "supplement",
        "given",
        "three",
        "book",
        "s",
        "standpoint",
        "mainstream",
        "analytic",
        "philosophy",
        "findlay",
        "serf",
        "dedicated",
        "contrarian",
        "threw",
        "husserl",
        "frege",
        "meinong",
        "russell",
        "brentano",
        "later",
        "wittgenstein",
        "attack",
        "contemporary",
        "method",
        "generating",
        "counterexample",
        "midlevel",
        "philosophical",
        "generalization",
        "set",
        "husserl",
        "meinong",
        "brentano",
        "substantial",
        "figure",
        "worthy",
        "interest",
        "analytic",
        "counterpart",
        "three",
        "diverged",
        "analytic",
        "god",
        "provided",
        "fullfledged",
        "philosophical",
        "alternative",
        "isolated",
        "potshots",
        "systematic",
        "metaphysics",
        "exudes",
        "almost",
        "leibnizian",
        "optimism",
        "regarding",
        "failure",
        "everyday",
        "world",
        "findlay",
        "felt",
        "doubt",
        "said",
        "hegel",
        "applies",
        "work",
        "hard",
        "theoretical",
        "worki",
        "feel",
        "clear",
        "world",
        "sense",
        "philosophy",
        "hegel",
        "express",
        "sense",
        "satisfactorily",
        "frequent",
        "mood",
        "mild",
        "depression",
        "hegelian",
        "regress",
        "materialism",
        "fear",
        "dialectical",
        "see",
        "world",
        "devoid",
        "sense",
        "submit",
        "masochistically",
        "senselessness",
        "even",
        "taking",
        "comfort",
        "cold",
        "credibility",
        "rational",
        "desirability",
        "hegelianism",
        "contemporary",
        "relevance",
        "hegel",
        "a",
        "lmv",
        "despite",
        "depression",
        "findlay",
        "remained",
        "loyal",
        "first",
        "last",
        "favorite",
        "text",
        "timaeus",
        "plato",
        "ennead",
        "plotinus",
        "logic",
        "hegel",
        "plato",
        "inventing",
        "form",
        "plotinus",
        "relating",
        "absolute",
        "hegel",
        "setting",
        "dialectical",
        "motion",
        "lecture",
        "baruch",
        "college",
        "new",
        "york",
        "city",
        "april",
        "unpublished",
        "reward",
        "loyalty",
        "singular",
        "philosophy",
        "unusual",
        "scope"
    ]
}