{
    "main_text": "Attractions || Normative-Evaluative Connections\n2.1 Normative-Evaluative Connections\n\nA central attraction of FA theories is that they promise to explain\ninteresting connections between certain normative and evaluative\nproperties (McHugh and Way 2016). For example, it seems difficult to\ndeny that being valuable and being fitting to value necessarily\nco-vary with each other such that something has value if and only if\nit’s fitting to value, or merits being valued (though see\nsection 3.2 for discussion). And, as discussed in the introduction to\nthis entry, similar equivalences also seem to hold between various\nspecific evaluative properties, such as being admirable or delightful,\nand the fittingness of correspondingly specific types of human\nresponses, e.g., admiring, or being delighted by. FA theories offer\nstraightforward explanations of these equivalences, viz., that facts\ninvolving the evaluative property on the left-hand side are always\ngrounded in facts involving the normative property of responses\nmentioned on the right-hand side, such that facts of the former kind\nobtain if and only if, and because, facts of the latter kind do.\n\nAs another example, consider that whenever something has value, it\nseems that there’s at least some reason to value it. More\nprecisely, it’s plausible that, whenever x is valuable\nin respect p, p is a reason to value x (Way\n2013). For example, if your friendship is valuable in respect of the\nhappiness it brings, the happiness it brings is also a reason to value\nyour friendship. An FA theory that explains facts about value in terms\nof facts about reasons for valuing is well-suited to explain this:\nwhenever p is a respect in which x is valuable,\nthat’s fully because p is a reason to value x.\nAnd parallel explanations can be given of similarly plausible claims\nconcerning the connections between various specific evaluative\nproperties and reasons: respects in which x is admirable,\nlovable, or contemptible, for instance, are also reasons to admire,\nlove, or contemn x, because facts involving the former\nproperties are always grounded in facts involving the latter.\n\nIn principle, FA theorists who appeal to fittingness rather than\nreasons to explain evaluative facts could also explain the necessary\nconnections between reasons and evaluative facts just mentioned. To do\nso, they’d need only to offer an account of the relationship\nbetween fittingness and reasons that, together with their FA theories,\nexplains the connections in question (McHugh and Way 2016; Howard\n2019). For example, consider a theory of reasons on which reasons for\na response consist in facts that contribute to the fittingness of the\nresponse. Paired with an FA theory of value that says that whenever\nx is valuable in respect p, that’s fully\nbecause p contributes to the fittingness of valuing\nx, this account entails that whenever x is valuable\nin respect p, p is a reason to value x.\nLikewise, FA theorists who formulate their theories in terms of\nreasons rather than fittingness could try similarly to explain the\nnecessary connections noted above between evaluative properties and\nvarious kinds of fitting response (Schroeder 2010). And more\ngenerally, regardless of which normative property an FA theorist\nappeals to in their explanations of evaluative facts, explanations of\nthe above connections are in principle available to them.\n\nIn this respect, FA theories have an advantage over so-called\n“no-priority views” which hold that evaluative facts and\nnormative facts of other kinds can’t be fully, non-circularly\nexplained by appeal to one another, such that neither kind of\nfact is more fundamental (Ross 1939; Wiggins 1987; McDowell 1998;\nTappolet 2011). Indeed, at least barring their ability to provide\nnaturalistic explanations of the normative and evaluative facts that\nfigure in the above connections, it seems that no-priority theorists\nwould need to take these connections as brute. In this way, FA\ntheories have more explanatory power than no-priority views (Rowland\n2019).\n\nThe potential to explain the above connections, however, isn’t\nunique to FA theory. For example, consider a version of value\nprimitivism, of the kind described in section 1.2, that would reverse\nthe order of explanation posited by FA theories, explaining normative\nfacts about human responses in terms of evaluative facts about the\nobjects of those responses. A proponent of this kind of\n“object-focused” primitivism might hold that whenever\nsomething is fitting to value that’s fully because that\nthing is valuable, and that this is what explains why something has\nvalue if and only if it’s fitting to value. And they might\npropose similarly to explain the parallel equivalences between the\nfittingness of various other types of response and other evaluative\nproperties. Likewise, an object-focused view that claims that facts\nabout reasons to value things are always grounded in the value of\nthose things might explain why there are always reasons to value\nvaluable things (Orsi 2013b). Object-focused views thus seem able to\nexplain the normative-evaluative connections noted above. Moreover, as\nwas mentioned in section 1.1, some find the order of explanation\nposited by this kind of primitivism more intuitively plausible than\nthat claimed by FA theory (for discussion, see Hooker and\nStratton-Lake 2006; Jacobson 2011). Still, FA theories do seem to have\nimportant advantages over object-focused views in explaining the\nconnections in question.\n\nFor one, FA theory is far more parsimonious. Suppose we explain\nnormative facts about human responses (whether they’re facts\nabout the fittingness of those responses or facts about reasons for\nthem) in terms of evaluative facts about the objects of those\nresponses, as object-focused views suggest. So, for example, we\nexplain facts about fitting admiration in terms of facts about the\nadmirability of admiration’s object, facts about fitting love in\nterms of facts about the lovability of love’s object, facts\nabout fitting shame in terms of facts about the shamefulness of\nshame’s object, and so on. Assuming these evaluative facts\ncouldn’t then be explained in terms of normative or evaluative\nfacts of some other kind, it seems we’d thus be left with a\n(massive) plurality of different kinds of evaluative fact, each of\nwhich would be fundamental at least relative to the rest of the\nnormative and evaluative domain.\n\nAlternatively, if, as the FA theorist proposes, we explain all such\nevaluative facts in terms of facts involving a normative relation\nof a single kind—e.g., the reason relation or the\nfittingness relation—then we could in principle take only facts\ninvolving that relation to be fundamental relative to the rest of the\nnormative and evaluative domain. Indeed, even if we didn’t take\nfacts involving the relevant relation to be fundamental and instead\nexplained them in terms of facts involving some other normative\nproperty of human responses, we’d still have to posit fewer\nkinds of fundamental facts as compared to object-focused primitivism.\nThus, FA theories are more parsimonious than object-focused\n views.[2]\n\nA second version of value primitivism, however, fares better along\nthis dimension. On this view—call it\n“response-focused” primitivism—normative facts about\nhuman responses are to be explained not in terms of evaluative facts\nabout the objects of those responses, but rather in terms of\nevaluative facts about the responses themselves (Moore 1903). In\nparticular, this view holds that normative facts about our responses\nare always grounded in facts to the effect that it’s somehow\nvaluable (simpliciter) to have those\n responses.[3]\n Similar to object-focused views, response-focused views also seem\nable to explain the normative-evaluative connections noted above. For\nexample, response-focused primitivists might claim that something is\nvaluable if and only if it’s fitting to value because whenever\nsomething is fitting to value, that’s because it’s\nintrinsically valuable to value it; and, as a substantive matter,\nsomething is intrinsically valuable to value if and only if it’s\nvaluable (Hurka 2000). And the response-focused theorist might\nsimilarly explain the parallel equivalences between various other\nevaluative properties and the fittingness of certain other responses,\narguing that it’s always intrinsically valuable, e.g., to admire\nthe admirable, love the lovable, despise the despicable, etc.\nLikewise, response-focused views might claim to explain why there are\nalways reasons to value valuable things: they might hold that\nwhenever there are reasons to value something,\nthat’s because valuing it is valuable and, as a substantive\nmatter, if something is valuable, then it’s valuable to\nvalue.\n\nIn contrast to object-focused views, response-focused views\nneedn’t be less parsimonious than FA theory. In principle, a\nresponse-focused primitivist could hold that all other normative and\nevaluative facts are to be explained ultimately in terms of facts\nabout the value simpliciter of various types of human\nresponse (or states of affairs, or whatever they take to be the\nfundamental bearers of value) (Moore 1903). However, response-focused\nviews do face potential counterexamples that bear on the plausibility\nof their possible explanations of the normative-evaluative connections\nunder discussion (Way 2013; Howard 2018). The main type of\ncounterexample targets the response-focused view’s claim that,\nwhenever a response is fitting, it’s valuable to have that\nresponse. Perhaps it’s somehow valuable to value what’s\nvaluable, but is it also valuable to be disgusted by the disgusting,\nto envy the enviable, and to be bored by the boring? If not, then\nresponse-focused views would seem unable to explain, e.g., why\nit’s fitting to be disgusted by something if and only if\nit’s disgusting. And, for similar reasons, they’d also be\nunable to explain, e.g., why there are reasons to be disgusted by the\ndisgusting, to be bored by the boring, etc.\n\nFA theories thus look to have some important prima facie\nadvantages over at least many of their competitors in explaining the\nnormative-evaluative connections noted \n above.[4]\n Of course, none of these\nadvantages is necessarily decisive with respect to overall theory\nchoice and there is, in any case, room for rivals of FA theory to\ndispute them. For example, an opponent of FA theory might suggest that\nthe outstanding issues for FA theory that we’ll discuss in\nsection 3 are at least as serious as the worries for primitivism\nraised above. Nevertheless, it remains an attraction of FA theory that\nit seems well placed to explain the normative-evaluative connections\nin question.\n",
    "section_title": "2.1 Normative-Evaluative Connections",
    "entry_title": "Fitting Attitude Theories of Value",
    "hierarchy_title": "Fitting Attitude Theories of Value || Attractions || Normative-Evaluative Connections",
    "tokenized_text": [
        "attraction",
        "normativeevaluative",
        "connection",
        "normativeevaluative",
        "connection",
        "central",
        "attraction",
        "fa",
        "theory",
        "promise",
        "explain",
        "interesting",
        "connection",
        "certain",
        "normative",
        "evaluative",
        "property",
        "mchugh",
        "way",
        "example",
        "seems",
        "difficult",
        "deny",
        "valuable",
        "fitting",
        "value",
        "necessarily",
        "covary",
        "something",
        "value",
        "fitting",
        "value",
        "merit",
        "valued",
        "though",
        "see",
        "section",
        "discussion",
        "discussed",
        "introduction",
        "entry",
        "similar",
        "equivalence",
        "also",
        "seem",
        "hold",
        "various",
        "specific",
        "evaluative",
        "property",
        "admirable",
        "delightful",
        "fittingness",
        "correspondingly",
        "specific",
        "type",
        "human",
        "response",
        "eg",
        "admiring",
        "delighted",
        "fa",
        "theory",
        "offer",
        "straightforward",
        "explanation",
        "equivalence",
        "viz",
        "fact",
        "involving",
        "evaluative",
        "property",
        "lefthand",
        "side",
        "always",
        "grounded",
        "fact",
        "involving",
        "normative",
        "property",
        "response",
        "mentioned",
        "righthand",
        "side",
        "fact",
        "former",
        "kind",
        "obtain",
        "fact",
        "latter",
        "kind",
        "another",
        "example",
        "consider",
        "whenever",
        "something",
        "value",
        "seems",
        "least",
        "reason",
        "value",
        "precisely",
        "plausible",
        "whenever",
        "x",
        "valuable",
        "respect",
        "p",
        "p",
        "reason",
        "value",
        "x",
        "way",
        "example",
        "friendship",
        "valuable",
        "respect",
        "happiness",
        "brings",
        "happiness",
        "brings",
        "also",
        "reason",
        "value",
        "friendship",
        "fa",
        "theory",
        "explains",
        "fact",
        "value",
        "term",
        "fact",
        "reason",
        "valuing",
        "wellsuited",
        "explain",
        "whenever",
        "p",
        "respect",
        "x",
        "valuable",
        "fully",
        "p",
        "reason",
        "value",
        "x",
        "parallel",
        "explanation",
        "given",
        "similarly",
        "plausible",
        "claim",
        "concerning",
        "connection",
        "various",
        "specific",
        "evaluative",
        "property",
        "reason",
        "respect",
        "x",
        "admirable",
        "lovable",
        "contemptible",
        "instance",
        "also",
        "reason",
        "admire",
        "love",
        "contemn",
        "x",
        "fact",
        "involving",
        "former",
        "property",
        "always",
        "grounded",
        "fact",
        "involving",
        "latter",
        "principle",
        "fa",
        "theorist",
        "appeal",
        "fittingness",
        "rather",
        "reason",
        "explain",
        "evaluative",
        "fact",
        "could",
        "also",
        "explain",
        "necessary",
        "connection",
        "reason",
        "evaluative",
        "fact",
        "mentioned",
        "need",
        "offer",
        "account",
        "relationship",
        "fittingness",
        "reason",
        "together",
        "fa",
        "theory",
        "explains",
        "connection",
        "question",
        "mchugh",
        "way",
        "howard",
        "example",
        "consider",
        "theory",
        "reason",
        "reason",
        "response",
        "consist",
        "fact",
        "contribute",
        "fittingness",
        "response",
        "paired",
        "fa",
        "theory",
        "value",
        "say",
        "whenever",
        "x",
        "valuable",
        "respect",
        "p",
        "fully",
        "p",
        "contributes",
        "fittingness",
        "valuing",
        "x",
        "account",
        "entail",
        "whenever",
        "x",
        "valuable",
        "respect",
        "p",
        "p",
        "reason",
        "value",
        "x",
        "likewise",
        "fa",
        "theorist",
        "formulate",
        "theory",
        "term",
        "reason",
        "rather",
        "fittingness",
        "could",
        "try",
        "similarly",
        "explain",
        "necessary",
        "connection",
        "noted",
        "evaluative",
        "property",
        "various",
        "kind",
        "fitting",
        "response",
        "schroeder",
        "generally",
        "regardless",
        "normative",
        "property",
        "fa",
        "theorist",
        "appeal",
        "explanation",
        "evaluative",
        "fact",
        "explanation",
        "connection",
        "principle",
        "available",
        "respect",
        "fa",
        "theory",
        "advantage",
        "socalled",
        "nopriority",
        "view",
        "hold",
        "evaluative",
        "fact",
        "normative",
        "fact",
        "kind",
        "fully",
        "noncircularly",
        "explained",
        "appeal",
        "one",
        "another",
        "neither",
        "kind",
        "fact",
        "fundamental",
        "ross",
        "wiggins",
        "mcdowell",
        "tappolet",
        "indeed",
        "least",
        "barring",
        "ability",
        "provide",
        "naturalistic",
        "explanation",
        "normative",
        "evaluative",
        "fact",
        "figure",
        "connection",
        "seems",
        "nopriority",
        "theorist",
        "would",
        "need",
        "take",
        "connection",
        "brute",
        "way",
        "fa",
        "theory",
        "explanatory",
        "power",
        "nopriority",
        "view",
        "rowland",
        "potential",
        "explain",
        "connection",
        "however",
        "unique",
        "fa",
        "theory",
        "example",
        "consider",
        "version",
        "value",
        "primitivism",
        "kind",
        "described",
        "section",
        "would",
        "reverse",
        "order",
        "explanation",
        "posited",
        "fa",
        "theory",
        "explaining",
        "normative",
        "fact",
        "human",
        "response",
        "term",
        "evaluative",
        "fact",
        "object",
        "response",
        "proponent",
        "kind",
        "objectfocused",
        "primitivism",
        "might",
        "hold",
        "whenever",
        "something",
        "fitting",
        "value",
        "fully",
        "thing",
        "valuable",
        "explains",
        "something",
        "value",
        "fitting",
        "value",
        "might",
        "propose",
        "similarly",
        "explain",
        "parallel",
        "equivalence",
        "fittingness",
        "various",
        "type",
        "response",
        "evaluative",
        "property",
        "likewise",
        "objectfocused",
        "view",
        "claim",
        "fact",
        "reason",
        "value",
        "thing",
        "always",
        "grounded",
        "value",
        "thing",
        "might",
        "explain",
        "always",
        "reason",
        "value",
        "valuable",
        "thing",
        "orsi",
        "b",
        "objectfocused",
        "view",
        "thus",
        "seem",
        "able",
        "explain",
        "normativeevaluative",
        "connection",
        "noted",
        "moreover",
        "mentioned",
        "section",
        "find",
        "order",
        "explanation",
        "posited",
        "kind",
        "primitivism",
        "intuitively",
        "plausible",
        "claimed",
        "fa",
        "theory",
        "discussion",
        "see",
        "hooker",
        "strattonlake",
        "jacobson",
        "still",
        "fa",
        "theory",
        "seem",
        "important",
        "advantage",
        "objectfocused",
        "view",
        "explaining",
        "connection",
        "question",
        "one",
        "fa",
        "theory",
        "far",
        "parsimonious",
        "suppose",
        "explain",
        "normative",
        "fact",
        "human",
        "response",
        "whether",
        "fact",
        "fittingness",
        "response",
        "fact",
        "reason",
        "term",
        "evaluative",
        "fact",
        "object",
        "response",
        "objectfocused",
        "view",
        "suggest",
        "example",
        "explain",
        "fact",
        "fitting",
        "admiration",
        "term",
        "fact",
        "admirability",
        "admiration",
        "object",
        "fact",
        "fitting",
        "love",
        "term",
        "fact",
        "lovability",
        "love",
        "object",
        "fact",
        "fitting",
        "shame",
        "term",
        "fact",
        "shamefulness",
        "shame",
        "object",
        "assuming",
        "evaluative",
        "fact",
        "explained",
        "term",
        "normative",
        "evaluative",
        "fact",
        "kind",
        "seems",
        "thus",
        "left",
        "massive",
        "plurality",
        "different",
        "kind",
        "evaluative",
        "fact",
        "would",
        "fundamental",
        "least",
        "relative",
        "rest",
        "normative",
        "evaluative",
        "domain",
        "alternatively",
        "fa",
        "theorist",
        "proposes",
        "explain",
        "evaluative",
        "fact",
        "term",
        "fact",
        "involving",
        "normative",
        "relation",
        "single",
        "kindeg",
        "reason",
        "relation",
        "fittingness",
        "relationthen",
        "could",
        "principle",
        "take",
        "fact",
        "involving",
        "relation",
        "fundamental",
        "relative",
        "rest",
        "normative",
        "evaluative",
        "domain",
        "indeed",
        "even",
        "take",
        "fact",
        "involving",
        "relevant",
        "relation",
        "fundamental",
        "instead",
        "explained",
        "term",
        "fact",
        "involving",
        "normative",
        "property",
        "human",
        "response",
        "still",
        "posit",
        "fewer",
        "kind",
        "fundamental",
        "fact",
        "compared",
        "objectfocused",
        "primitivism",
        "thus",
        "fa",
        "theory",
        "parsimonious",
        "objectfocused",
        "view",
        "second",
        "version",
        "value",
        "primitivism",
        "however",
        "fare",
        "better",
        "along",
        "dimension",
        "viewcall",
        "responsefocused",
        "primitivismnormative",
        "fact",
        "human",
        "response",
        "explained",
        "term",
        "evaluative",
        "fact",
        "object",
        "response",
        "rather",
        "term",
        "evaluative",
        "fact",
        "response",
        "moore",
        "particular",
        "view",
        "hold",
        "normative",
        "fact",
        "response",
        "always",
        "grounded",
        "fact",
        "effect",
        "somehow",
        "valuable",
        "simpliciter",
        "response",
        "similar",
        "objectfocused",
        "view",
        "responsefocused",
        "view",
        "also",
        "seem",
        "able",
        "explain",
        "normativeevaluative",
        "connection",
        "noted",
        "example",
        "responsefocused",
        "primitivists",
        "might",
        "claim",
        "something",
        "valuable",
        "fitting",
        "value",
        "whenever",
        "something",
        "fitting",
        "value",
        "intrinsically",
        "valuable",
        "value",
        "substantive",
        "matter",
        "something",
        "intrinsically",
        "valuable",
        "value",
        "valuable",
        "hurka",
        "responsefocused",
        "theorist",
        "might",
        "similarly",
        "explain",
        "parallel",
        "equivalence",
        "various",
        "evaluative",
        "property",
        "fittingness",
        "certain",
        "response",
        "arguing",
        "always",
        "intrinsically",
        "valuable",
        "eg",
        "admire",
        "admirable",
        "love",
        "lovable",
        "despise",
        "despicable",
        "etc",
        "likewise",
        "responsefocused",
        "view",
        "might",
        "claim",
        "explain",
        "always",
        "reason",
        "value",
        "valuable",
        "thing",
        "might",
        "hold",
        "whenever",
        "reason",
        "value",
        "something",
        "valuing",
        "valuable",
        "substantive",
        "matter",
        "something",
        "valuable",
        "valuable",
        "value",
        "contrast",
        "objectfocused",
        "view",
        "responsefocused",
        "view",
        "le",
        "parsimonious",
        "fa",
        "theory",
        "principle",
        "responsefocused",
        "primitivist",
        "could",
        "hold",
        "normative",
        "evaluative",
        "fact",
        "explained",
        "ultimately",
        "term",
        "fact",
        "value",
        "simpliciter",
        "various",
        "type",
        "human",
        "response",
        "state",
        "affair",
        "whatever",
        "take",
        "fundamental",
        "bearer",
        "value",
        "moore",
        "however",
        "responsefocused",
        "view",
        "face",
        "potential",
        "counterexample",
        "bear",
        "plausibility",
        "possible",
        "explanation",
        "normativeevaluative",
        "connection",
        "discussion",
        "way",
        "howard",
        "main",
        "type",
        "counterexample",
        "target",
        "responsefocused",
        "view",
        "claim",
        "whenever",
        "response",
        "fitting",
        "valuable",
        "response",
        "perhaps",
        "somehow",
        "valuable",
        "value",
        "valuable",
        "also",
        "valuable",
        "disgusted",
        "disgusting",
        "envy",
        "enviable",
        "bored",
        "boring",
        "responsefocused",
        "view",
        "would",
        "seem",
        "unable",
        "explain",
        "eg",
        "fitting",
        "disgusted",
        "something",
        "disgusting",
        "similar",
        "reason",
        "also",
        "unable",
        "explain",
        "eg",
        "reason",
        "disgusted",
        "disgusting",
        "bored",
        "boring",
        "etc",
        "fa",
        "theory",
        "thus",
        "look",
        "important",
        "prima",
        "facie",
        "advantage",
        "least",
        "many",
        "competitor",
        "explaining",
        "normativeevaluative",
        "connection",
        "noted",
        "course",
        "none",
        "advantage",
        "necessarily",
        "decisive",
        "respect",
        "overall",
        "theory",
        "choice",
        "case",
        "room",
        "rival",
        "fa",
        "theory",
        "dispute",
        "example",
        "opponent",
        "fa",
        "theory",
        "might",
        "suggest",
        "outstanding",
        "issue",
        "fa",
        "theory",
        "discus",
        "section",
        "least",
        "serious",
        "worry",
        "primitivism",
        "raised",
        "nevertheless",
        "remains",
        "attraction",
        "fa",
        "theory",
        "seems",
        "well",
        "placed",
        "explain",
        "normativeevaluative",
        "connection",
        "question"
    ]
}