{
    "main_text": "Two Types of Simulation Processes || High-Level Simulation Processes\n3.1 High-Level Simulation Processes\n\nHigh-level simulation processes are cognitive processes with the\nfollowing features: (a) they are typically conscious, under voluntary\ncontrol, and stimulus-independent; (b) they satisfy\n PROC,\n that is, they are implemented by the reuse of a certain\ncognitive mechanism, C, and their output states\nresemble the output states generated by the use of\n C.[4]\n Here are some cognitive processes that, according to Simulation\nTheorists, qualify as high-level simulation processes. Visualizing:\nthe cognitive process generating visual images (Currie 1995; Currie\n& Ravenscroft 2002; Goldman 2006); motor imagination: the\ncognitive process generating imagined bodily movements and actions\n(Currie & Ravenscroft 1997, 2002; Goldman 2006); imagining\ndeciding: the cognitive process generating decision-like imaginings\n(Currie & Ravenscroft 2002); imagining believing: the cognitive\nprocess generating belief-like imaginings (Currie & Ravenscroft\n2002); imagining desiring: the cognitive process generating\ndesire-like imaginings (Currie 2002). In what follows, we shall\nconsider a couple of them in some detail.\n\nVisualizing first. It is not particularly hard to see why visualizing\nsatisfies condition (a). Typically: one can decide to visualize (or\nstop visualizing) something; the process is not driven by perceptual\nstimuli; and at least some parts of the visualization process are\nconscious. There might be cases in which visualizing is not under\nvoluntary control, is stimulus-driven and, maybe, even entirely\nunconscious. This, however, is not a problem, since we know that there\nare clear cases satisfying (a).\n\nUnsurprisingly, the difficult task for Simulation Theorists is to\nestablish that visualizing has feature (b), that is: it is implemented\nby the reuse of the visual mechanism; and its outputs (that\nis, visual images) resemble genuine visual experiences.\nSimulation Theorists maintain that they have strong empirical evidence\nsupporting the claim that visualizing satisfies\n PROC.\n Here is a sample (this and further evidence is extensively discussed\nin Currie 1995, Currie & Ravenscroft 2002, and in Goldman\n2006):\n\n visualizing recruits some of the brain areas involved in vision\n(Kosslyn et al. 1999);\n left-neglect patients have the same deficit in both seeing and\nvisualizing—i.e., they do not have perceptual experience of the\nleft half of the visual space and they also fail to imagine the left\nhalf of the imagined space (Bisiach & Luzzatti 1978);\n ocular movements occurring during visualizing approximate those\nhappening during seeing (Spivey et al. 2000);\n some patients systematically mistake visual images for perceptual\nstates (Goldenberg et al. 1995);\n visual perception and visualizing exhibit similar patterns of\ninformation-processing (facilitations, constraints, illusions) (Decety\n& Michel 1989; Kosslyn et al. 1999)\n\n\nOn this basis, Simulation Theorists conclude that visualizing is\nindeed implemented by the reuse of the visual mechanism\n(evidence i and ii) and that its outputs, i.e., visual images, do\nresemble visual experiences (evidence iii, iv, and v). Thus,\nvisualizing is a process that qualifies as high-level simulation, and\nvisual images are simulated mental states.\n\nVisual images are mental simulations of perceptual states. Are there\nhigh-level simulation processes whose outputs instead are mental\nsimulations of propositional attitudes? (If you think that visual\nexperiences are propositional attitudes, you can rephrase the question\nas follows: are there high-level simulation processes whose outputs\nare mental simulations of non-sensory states?) Three candidate\nprocesses have received a fair amount of attention in the\nsimulationist literature: imagining desiring, imagining deciding, and\nimagining believing. The claims made by Simulation Theorists about\nthese cognitive processes and their output states have generated an\nintense debate (Doggett & Egan 2007; Funkhouser & Spaulding\n2009; Kieran & Lopes 2003; Nichols 2006a, 2006b; Nichols &\nStich 2003; Velleman 2000). We do not have space to review it here\n(two good entry points are the introduction to Nichols 2006a and the\nentry on\n imagination).\n Rather, we shall confine ourselves to briefly illustrating the\nsimulationist case in favour of the thesis that imagining believing is\na high-level simulation process.\n\nI don’t believe that Rome is in France, but I can imagine\nbelieving it. Imagining believing typically is a conscious,\nstimulus-independent process, under voluntary control. Thus, imagining\nbelieving satisfies condition (a). In order for it to count as an\ninstance of high-level simulation process, it also needs to\nhave feature (b), that is: (b.i) its outputs (i.e., belief-like\nimaginings) have to resemble genuine beliefs in some\nsignificant respects; (b.ii) it has to be implemented by the\nreuse of the cognitive mechanism (whose use implements the\ncognitive process) that generates genuine beliefs—let us call it\n“the belief-forming mechanism”. Does imagining believing\nsatisfy (b)? Currie and Ravenscroft (2002) argue in favour of (b.i).\nBeliefs are individuated in terms of their content and functional\nrole. Belief-like imaginings—Currie and Ravenscroft\nsay—have the same content and a similar functional role to their\ngenuine counterparts. For example, the belief that Rome is in France\nand the belief-like imagining that Rome is in France have exactly the\nsame propositional content: that Rome is in France. Moreover,\nbelief-like imaginings mirror the inferential role of genuine beliefs.\nIf one believes both that Rome is in France and that French is the\nlanguage spoken in France, one can infer the belief that French is the\nlanguage spoken in Rome. Analogously, from the belief-like imagining\nthat Rome is in France and the genuine belief that French is the\nlanguage spoken in France, one can infer the belief-like imagining\nthat French is the language spoken in Rome. So far, so good (but see\nNichols 2006b).\n\nWhat about (b.ii)? Direct evidence bearing on it is scarce. However,\nSimulation Theorists can give an argument along the following lines.\nFirst, one owes an explanation of why belief-like imaginings are,\nwell, belief-like—as we have said above, it seems that they have\nthe same type of content as, and a functional role similar to, genuine\nbeliefs. A possible explanation for this is that both types of mental\nstates are generated by (cognitive processes implemented by) the same\ncognitive mechanism. Second, it goes without saying that our mind\ncontains a mechanism for generating beliefs (the belief-forming\nmechanism), and that there must be some mechanism or another in charge\nof generating belief-like imaginings. It is also well known that\ncognitive mechanisms are evolutionary costly to build and maintain.\nThus, evolution might have adopted the parsimonious strategy of\nredeploying a pre-existing mechanism (the belief-forming mechanism)\nfor a non-primary function, i.e., generating belief-like\nimaginings—in general, this hypothesis is also supported by the\nidea that neural reuse is one of the fundamental organizational\nprinciple of the brain (Anderson 2008). If one puts these two strands\nof reasoning together, one gets a prima facie case for the\nclaim that imagining believing is implemented by the reuse of the\nbelief-forming mechanism—that is, a prima facie case\nfor the conclusion that imagining believing satisfies (b.ii). Since\nimagining believing appears also to satisfy (b.i) and (a), lacking\nevidence to the contrary, Simulation Theorists are justified in\nconsidering it to be a high-level simulation process.\n\nLet’s take stock. We have examined a few suggested instances of\nhigh-level simulation processes. If Simulation Theorists are correct,\nthey exhibit the following commonalities: they satisfy\n PROC\n (this is why they are simulation processes); they are\ntypically conscious, under voluntary control, and stimulus-independent\n(this is why they are high-level). Do they have some other\nimportant features in common? Yes, they do—Simulation Theorists\nsay. They all are under the control of a single cognitive\nmechanism: imagination (more precisely, Currie & Ravenscroft\n(2002) talk of Re-Creative Imagination, while Goldman (2006, 2009)\nuses the expression “Enactment Imagination”). The\nfollowing passage will give you the basic gist of the proposal:\n\n\nWhat is distinctive to high-level simulation is the psychological\nmechanism … that produces it, the mechanism of imagination.\nThis psychological system is capable of producing a wide variety of\nsimulational events: simulated seeings (i.e., visual imagery),\n… simulated motor actions (motor imagery), simulated beliefs,\n… and so forth. … In producing simulational outputs,\nimagination does not operate all by itself. … For example, it\nrecruits parts of the visual system to produce visual imagery\n…. Nonetheless, imagination “‘takes the\nlead”’ in directing or controlling the other systems it\nenlists for its project. (Goldman 2009: 484–85)\n\n\nHere is another way to make the point. We already know that, according\nto ST, visualizing is implemented by the reuse of the visual\nmechanism. In the above passage, Goldman adds that the reuse of the\nvisual mechanism is initiated, guided and controlled by imagination.\nThe same applies, mutatis mutandis, to all cases of\nhigh-level simulation processes. For example, in imagining hearing,\nimagination “gets in control” of the auditory mechanism,\ntakes it off-line, and (re)uses it to generate simulated auditory\nexperiences. Goldman (2012b, Goldman & Jordan 2013) supports this\nclaim by making reference to neuroscientific data indicating that the\nsame core brain network, the so-called “default network”,\nsubserves all the following self-projections: prospection (projecting\noneself into one’s future); episodic memory (projecting oneself\ninto one’s past); perspective taking (projecting oneself into\nother minds); and navigation (projecting oneself into other places)\n(see Buckner & Carroll 2007 for a review). These different\nself-projections presumably involve different high-level simulation\nprocesses. However, they all have something in common: they all\ninvolve imagination-based perspectival shifts. Therefore, the fact\nthat there is one brain network common to all these self-projections\nlends some support to the claim that there is one common cognitive\nmechanism, i.e., imagination, which initiates, guides, and controls\nall high-level simulation processes. \n\nIf Goldman is right, and all high-level simulation processes are\nguided by imagination, we can then explain why, in our common\nparlance, we tend to describe high-level simulation processes and\noutputs in terms of imaginings, images, imagery, etc. More\nimportantly, we can also explain why high-level simulation processes\nare conscious, under voluntary control, and stimulus-independent.\nThese are, after all, typical properties of imaginative processes.\nHowever, there are simulation processes that typically are neither\nconscious, nor under voluntary control, nor stimulus independent. This\nindicates that they are not imagination-based. It is to this other\ntype of simulation processes that we now turn.\n",
    "section_title": "3.1 High-Level Simulation Processes",
    "entry_title": "Folk Psychology as Mental Simulation",
    "hierarchy_title": "Folk Psychology as Mental Simulation || Two Types of Simulation Processes || High-Level Simulation Processes",
    "tokenized_text": [
        "two",
        "type",
        "simulation",
        "process",
        "highlevel",
        "simulation",
        "process",
        "highlevel",
        "simulation",
        "process",
        "highlevel",
        "simulation",
        "process",
        "cognitive",
        "process",
        "following",
        "feature",
        "typically",
        "conscious",
        "voluntary",
        "control",
        "stimulusindependent",
        "b",
        "satisfy",
        "proc",
        "implemented",
        "reuse",
        "certain",
        "cognitive",
        "mechanism",
        "c",
        "output",
        "state",
        "resemble",
        "output",
        "state",
        "generated",
        "use",
        "c",
        "cognitive",
        "process",
        "according",
        "simulation",
        "theorist",
        "qualify",
        "highlevel",
        "simulation",
        "process",
        "visualizing",
        "cognitive",
        "process",
        "generating",
        "visual",
        "image",
        "currie",
        "currie",
        "ravenscroft",
        "goldman",
        "motor",
        "imagination",
        "cognitive",
        "process",
        "generating",
        "imagined",
        "bodily",
        "movement",
        "action",
        "currie",
        "ravenscroft",
        "goldman",
        "imagining",
        "deciding",
        "cognitive",
        "process",
        "generating",
        "decisionlike",
        "imaginings",
        "currie",
        "ravenscroft",
        "imagining",
        "believing",
        "cognitive",
        "process",
        "generating",
        "belieflike",
        "imaginings",
        "currie",
        "ravenscroft",
        "imagining",
        "desiring",
        "cognitive",
        "process",
        "generating",
        "desirelike",
        "imaginings",
        "currie",
        "follows",
        "shall",
        "consider",
        "couple",
        "detail",
        "visualizing",
        "first",
        "particularly",
        "hard",
        "see",
        "visualizing",
        "satisfies",
        "condition",
        "typically",
        "one",
        "decide",
        "visualize",
        "stop",
        "visualizing",
        "something",
        "process",
        "driven",
        "perceptual",
        "stimulus",
        "least",
        "part",
        "visualization",
        "process",
        "conscious",
        "might",
        "case",
        "visualizing",
        "voluntary",
        "control",
        "stimulusdriven",
        "maybe",
        "even",
        "entirely",
        "unconscious",
        "however",
        "problem",
        "since",
        "know",
        "clear",
        "case",
        "satisfying",
        "unsurprisingly",
        "difficult",
        "task",
        "simulation",
        "theorist",
        "establish",
        "visualizing",
        "feature",
        "b",
        "implemented",
        "reuse",
        "visual",
        "mechanism",
        "output",
        "visual",
        "image",
        "resemble",
        "genuine",
        "visual",
        "experience",
        "simulation",
        "theorist",
        "maintain",
        "strong",
        "empirical",
        "evidence",
        "supporting",
        "claim",
        "visualizing",
        "satisfies",
        "proc",
        "sample",
        "evidence",
        "extensively",
        "discussed",
        "currie",
        "currie",
        "ravenscroft",
        "goldman",
        "visualizing",
        "recruit",
        "brain",
        "area",
        "involved",
        "vision",
        "kosslyn",
        "et",
        "al",
        "leftneglect",
        "patient",
        "deficit",
        "seeing",
        "visualizingie",
        "perceptual",
        "experience",
        "left",
        "half",
        "visual",
        "space",
        "also",
        "fail",
        "imagine",
        "left",
        "half",
        "imagined",
        "space",
        "bisiach",
        "luzzatti",
        "ocular",
        "movement",
        "occurring",
        "visualizing",
        "approximate",
        "happening",
        "seeing",
        "spivey",
        "et",
        "al",
        "patient",
        "systematically",
        "mistake",
        "visual",
        "image",
        "perceptual",
        "state",
        "goldenberg",
        "et",
        "al",
        "visual",
        "perception",
        "visualizing",
        "exhibit",
        "similar",
        "pattern",
        "informationprocessing",
        "facilitation",
        "constraint",
        "illusion",
        "decety",
        "michel",
        "kosslyn",
        "et",
        "al",
        "basis",
        "simulation",
        "theorist",
        "conclude",
        "visualizing",
        "indeed",
        "implemented",
        "reuse",
        "visual",
        "mechanism",
        "evidence",
        "ii",
        "output",
        "ie",
        "visual",
        "image",
        "resemble",
        "visual",
        "experience",
        "evidence",
        "iii",
        "iv",
        "v",
        "thus",
        "visualizing",
        "process",
        "qualifies",
        "highlevel",
        "simulation",
        "visual",
        "image",
        "simulated",
        "mental",
        "state",
        "visual",
        "image",
        "mental",
        "simulation",
        "perceptual",
        "state",
        "highlevel",
        "simulation",
        "process",
        "whose",
        "output",
        "instead",
        "mental",
        "simulation",
        "propositional",
        "attitude",
        "think",
        "visual",
        "experience",
        "propositional",
        "attitude",
        "rephrase",
        "question",
        "follows",
        "highlevel",
        "simulation",
        "process",
        "whose",
        "output",
        "mental",
        "simulation",
        "nonsensory",
        "state",
        "three",
        "candidate",
        "process",
        "received",
        "fair",
        "amount",
        "attention",
        "simulationist",
        "literature",
        "imagining",
        "desiring",
        "imagining",
        "deciding",
        "imagining",
        "believing",
        "claim",
        "made",
        "simulation",
        "theorist",
        "cognitive",
        "process",
        "output",
        "state",
        "generated",
        "intense",
        "debate",
        "doggett",
        "egan",
        "funkhouser",
        "spaulding",
        "kieran",
        "lope",
        "nichols",
        "a",
        "b",
        "nichols",
        "stich",
        "velleman",
        "space",
        "review",
        "two",
        "good",
        "entry",
        "point",
        "introduction",
        "nichols",
        "a",
        "entry",
        "imagination",
        "rather",
        "shall",
        "confine",
        "briefly",
        "illustrating",
        "simulationist",
        "case",
        "favour",
        "thesis",
        "imagining",
        "believing",
        "highlevel",
        "simulation",
        "process",
        "believe",
        "rome",
        "france",
        "imagine",
        "believing",
        "imagining",
        "believing",
        "typically",
        "conscious",
        "stimulusindependent",
        "process",
        "voluntary",
        "control",
        "thus",
        "imagining",
        "believing",
        "satisfies",
        "condition",
        "order",
        "count",
        "instance",
        "highlevel",
        "simulation",
        "process",
        "also",
        "need",
        "feature",
        "b",
        "bi",
        "output",
        "ie",
        "belieflike",
        "imaginings",
        "resemble",
        "genuine",
        "belief",
        "significant",
        "respect",
        "bii",
        "implemented",
        "reuse",
        "cognitive",
        "mechanism",
        "whose",
        "use",
        "implement",
        "cognitive",
        "process",
        "generates",
        "genuine",
        "beliefslet",
        "u",
        "call",
        "beliefforming",
        "mechanism",
        "imagining",
        "believing",
        "satisfy",
        "b",
        "currie",
        "ravenscroft",
        "argue",
        "favour",
        "bi",
        "belief",
        "individuated",
        "term",
        "content",
        "functional",
        "role",
        "belieflike",
        "imaginingscurrie",
        "ravenscroft",
        "sayhave",
        "content",
        "similar",
        "functional",
        "role",
        "genuine",
        "counterpart",
        "example",
        "belief",
        "rome",
        "france",
        "belieflike",
        "imagining",
        "rome",
        "france",
        "exactly",
        "propositional",
        "content",
        "rome",
        "france",
        "moreover",
        "belieflike",
        "imaginings",
        "mirror",
        "inferential",
        "role",
        "genuine",
        "belief",
        "one",
        "belief",
        "rome",
        "france",
        "french",
        "language",
        "spoken",
        "france",
        "one",
        "infer",
        "belief",
        "french",
        "language",
        "spoken",
        "rome",
        "analogously",
        "belieflike",
        "imagining",
        "rome",
        "france",
        "genuine",
        "belief",
        "french",
        "language",
        "spoken",
        "france",
        "one",
        "infer",
        "belieflike",
        "imagining",
        "french",
        "language",
        "spoken",
        "rome",
        "far",
        "good",
        "see",
        "nichols",
        "b",
        "bii",
        "direct",
        "evidence",
        "bearing",
        "scarce",
        "however",
        "simulation",
        "theorist",
        "give",
        "argument",
        "along",
        "following",
        "line",
        "first",
        "one",
        "owes",
        "explanation",
        "belieflike",
        "imaginings",
        "well",
        "belieflikeas",
        "said",
        "seems",
        "type",
        "content",
        "functional",
        "role",
        "similar",
        "genuine",
        "belief",
        "possible",
        "explanation",
        "type",
        "mental",
        "state",
        "generated",
        "cognitive",
        "process",
        "implemented",
        "cognitive",
        "mechanism",
        "second",
        "go",
        "without",
        "saying",
        "mind",
        "contains",
        "mechanism",
        "generating",
        "belief",
        "beliefforming",
        "mechanism",
        "must",
        "mechanism",
        "another",
        "charge",
        "generating",
        "belieflike",
        "imaginings",
        "also",
        "well",
        "known",
        "cognitive",
        "mechanism",
        "evolutionary",
        "costly",
        "build",
        "maintain",
        "thus",
        "evolution",
        "might",
        "adopted",
        "parsimonious",
        "strategy",
        "redeploying",
        "preexisting",
        "mechanism",
        "beliefforming",
        "mechanism",
        "nonprimary",
        "function",
        "ie",
        "generating",
        "belieflike",
        "imaginingsin",
        "general",
        "hypothesis",
        "also",
        "supported",
        "idea",
        "neural",
        "reuse",
        "one",
        "fundamental",
        "organizational",
        "principle",
        "brain",
        "anderson",
        "one",
        "put",
        "two",
        "strand",
        "reasoning",
        "together",
        "one",
        "get",
        "prima",
        "facie",
        "case",
        "claim",
        "imagining",
        "believing",
        "implemented",
        "reuse",
        "beliefforming",
        "mechanismthat",
        "prima",
        "facie",
        "case",
        "conclusion",
        "imagining",
        "believing",
        "satisfies",
        "bii",
        "since",
        "imagining",
        "believing",
        "appears",
        "also",
        "satisfy",
        "bi",
        "lacking",
        "evidence",
        "contrary",
        "simulation",
        "theorist",
        "justified",
        "considering",
        "highlevel",
        "simulation",
        "process",
        "let",
        "take",
        "stock",
        "examined",
        "suggested",
        "instance",
        "highlevel",
        "simulation",
        "process",
        "simulation",
        "theorist",
        "correct",
        "exhibit",
        "following",
        "commonality",
        "satisfy",
        "proc",
        "simulation",
        "process",
        "typically",
        "conscious",
        "voluntary",
        "control",
        "stimulusindependent",
        "highlevel",
        "important",
        "feature",
        "common",
        "yes",
        "dosimulation",
        "theorist",
        "say",
        "control",
        "single",
        "cognitive",
        "mechanism",
        "imagination",
        "precisely",
        "currie",
        "ravenscroft",
        "talk",
        "recreative",
        "imagination",
        "goldman",
        "us",
        "expression",
        "enactment",
        "imagination",
        "following",
        "passage",
        "give",
        "basic",
        "gist",
        "proposal",
        "distinctive",
        "highlevel",
        "simulation",
        "psychological",
        "mechanism",
        "produce",
        "mechanism",
        "imagination",
        "psychological",
        "system",
        "capable",
        "producing",
        "wide",
        "variety",
        "simulational",
        "event",
        "simulated",
        "seeing",
        "ie",
        "visual",
        "imagery",
        "simulated",
        "motor",
        "action",
        "motor",
        "imagery",
        "simulated",
        "belief",
        "forth",
        "producing",
        "simulational",
        "output",
        "imagination",
        "operate",
        "example",
        "recruit",
        "part",
        "visual",
        "system",
        "produce",
        "visual",
        "imagery",
        "nonetheless",
        "imagination",
        "take",
        "lead",
        "directing",
        "controlling",
        "system",
        "enlists",
        "project",
        "goldman",
        "another",
        "way",
        "make",
        "point",
        "already",
        "know",
        "according",
        "st",
        "visualizing",
        "implemented",
        "reuse",
        "visual",
        "mechanism",
        "passage",
        "goldman",
        "add",
        "reuse",
        "visual",
        "mechanism",
        "initiated",
        "guided",
        "controlled",
        "imagination",
        "applies",
        "mutatis",
        "mutandis",
        "case",
        "highlevel",
        "simulation",
        "process",
        "example",
        "imagining",
        "hearing",
        "imagination",
        "get",
        "control",
        "auditory",
        "mechanism",
        "take",
        "offline",
        "us",
        "generate",
        "simulated",
        "auditory",
        "experience",
        "goldman",
        "b",
        "goldman",
        "jordan",
        "support",
        "claim",
        "making",
        "reference",
        "neuroscientific",
        "data",
        "indicating",
        "core",
        "brain",
        "network",
        "socalled",
        "default",
        "network",
        "subserves",
        "following",
        "selfprojections",
        "prospection",
        "projecting",
        "oneself",
        "one",
        "future",
        "episodic",
        "memory",
        "projecting",
        "oneself",
        "one",
        "past",
        "perspective",
        "taking",
        "projecting",
        "oneself",
        "mind",
        "navigation",
        "projecting",
        "oneself",
        "place",
        "see",
        "buckner",
        "carroll",
        "review",
        "different",
        "selfprojections",
        "presumably",
        "involve",
        "different",
        "highlevel",
        "simulation",
        "process",
        "however",
        "something",
        "common",
        "involve",
        "imaginationbased",
        "perspectival",
        "shift",
        "therefore",
        "fact",
        "one",
        "brain",
        "network",
        "common",
        "selfprojections",
        "lends",
        "support",
        "claim",
        "one",
        "common",
        "cognitive",
        "mechanism",
        "ie",
        "imagination",
        "initiate",
        "guide",
        "control",
        "highlevel",
        "simulation",
        "process",
        "goldman",
        "right",
        "highlevel",
        "simulation",
        "process",
        "guided",
        "imagination",
        "explain",
        "common",
        "parlance",
        "tend",
        "describe",
        "highlevel",
        "simulation",
        "process",
        "output",
        "term",
        "imaginings",
        "image",
        "imagery",
        "etc",
        "importantly",
        "also",
        "explain",
        "highlevel",
        "simulation",
        "process",
        "conscious",
        "voluntary",
        "control",
        "stimulusindependent",
        "typical",
        "property",
        "imaginative",
        "process",
        "however",
        "simulation",
        "process",
        "typically",
        "neither",
        "conscious",
        "voluntary",
        "control",
        "stimulus",
        "independent",
        "indicates",
        "imaginationbased",
        "type",
        "simulation",
        "process",
        "turn"
    ]
}