{
    "main_text": "The Ethics of Forgiveness || Norms Governing Instances of Forgiveness\n9.2 Norms Governing Instances of Forgiveness\n\nWhat about the morality of individual acts of forgiveness? Let us use\n“positive moral status” as an umbrella term to capture the\nstatus of an instance of forgiveness insofar as it is morally\ngood, morally virtuous, morally permissible, morally praiseworthy,\nmorally right, morally obligatory, or morally supererogatory. It is\ncommonplace to think that in order for an act of forgiveness to have\npositive moral status, certain kinds of conditions must be met.\nConditionalism is the view that in order for an act of\nforgiveness to have positive moral status, certain conditions must be\nmet either by the victim or the wrongdoer (or both). For example, it\nmight be thought that in order for forgiveness to have positive moral\nstatus, the victim must forgive for certain kinds of good reasons. If\nthe victim does not forgive for those good kinds of reasons, then she\ndoes something morally impermissible (or bad, or blameworthy, etc.) by\nforgiving. We can call such conditions victim-dependent.\nAlternatively, it might be thought that in order for forgiveness to\nhave positive moral status, the wrongdoer must, say, apologize to the\nvictim. This is a kind of wrongdoer-dependent condition. If\nthe wrongdoer does not apologize to the victim, then the victim does\nsomething morally impermissible (or bad, or blameworthy, etc.) by\nforgiving.\n\nNotice, however, that this claim is to be distinguished from the view\naccording to which, absent a wrongdoer’s apology, the\nvictim’s “forgiveness” is not actually forgiveness\nat all, but instead condonation or exculpation. On this latter sort of\nview, the conditions for positive moral status for an act of\nforgiveness are built into the very constitutive conditions for\nforgiveness itself. We can call a view of forgiveness that builds the\nconditions for positive moral status into the conditions for\nforgiveness itself a “thick” conception of forgiveness. On\nthis view, forgiveness is, as such, always morally good, morally\npermissible, or otherwise possesses some other such positive moral\nstatus. (This is consistent with an act of forgiveness being all\nthings considered wrong if, say, forgiving in some case would cause\nthe death of innocent millions.) In contrast, a “thin”\nconception of forgiveness is one that allows that an instance of\nforgiveness can lack positive moral status. Of course, both thick and\nthin conceptions of forgiveness can require (or not require) that\neither (or both) victim-dependent and wrongdoer-dependent conditions\nwere first met. And so here, we will set aside this thick/thin\ncontroversy and focus on the conditions for morally positive\nforgiveness as such.\n\nIt is widely thought that in order for an act of forgiveness to have\npositive moral status, the victim must meet certain conditions. The\nmost commonly cited kind of victim-dependent condition has to do with\nthe victim’s motivating reasons for forgiving. Only some kinds\nof motivating reasons make forgiveness morally positive. For example,\nJoram Haber has argued that for an act of forgiveness to be\n“appropriate” (such that were we to forgive we would not\nrisk “moral reproval”), the victim must forgive for a\nreason that “preserves self-respect” and that the\n“only reason that would serve this function is that the\nwrongdoer has repented the wrong she has done” (1991: 90). For\nHaber, then, it seems that unless the wrongdoer repents and the victim\nforgives her (at least in part) for this reason, then that forgiveness\nis morally inappropriate. Haber therefore has two conditions, one\nwrongdoer-dependent (to repent for the wrong done), and one\nvictim-dependent (to forgive at least in part because the wrongdoer\nrepented). Jeffrie Murphy articulates a similar view, claiming that\n\n\n\nacceptable grounds for forgiveness must be compatible with\nself-respect, respect for others as moral agents, and respect for the\nrules of morality and the moral order. (Murphy & Hampton 1988: 24)\n\n\n\nExamples of the kinds of moral reasons that Murphy has in mind\ninclude: that the wrongdoer repented or had a change of heart, that\nshe has suffered enough, and that she has undergone humiliation, such\nas “the apology ritual” (24).\n\nThere may be other kinds of conditions that a victim must meet in\norder to effect morally positive forgiveness. Charles Griswold writes\nthat in the “paradigmatic scene”, where forgiveness is\n“at its best” as the manifestation of virtue (2007: 38),\nin addition to forswearing revenge, moderating resentment, and\ncommitting to give up any lingering resentment, the victim must also:\n(1) revise her view of the wrongdoer as someone who is reducible to\nthe person who did the wrong; (2) give up any presumption of decisive\nmoral superiority and recognize the shared humanity of both parties;\nand (3) address the wrongdoer and declare that forgiveness is granted\n(2007: 54–8).\n\nIt is more controversial whether morally positive forgiveness requires\nwrongdoer-dependent conditions. One of the foremost defenders of such\nconditions is Charles Griswold, who argues that in the\n“paradigmatic scene”, there are numerous\nwrongdoer-dependent conditions on forgiveness. Namely, the wrongdoer\nmust: (1) acknowledge that she was responsible for the wrong in\nquestion; (2) repudiate the deeds and disavow the thought that she\nwould do them again; (3) experience and express regret at having\ncaused the particular wrong; (4) commit, by deeds and words, to being\nthe sort of person who doesn’t do wrong; (5) show that she\nunderstands, from the victim’s perspective, the damage done by\nthe wrongdoing; and (6) offer some sort of narrative to explain why\nshe did wrong (2007: 47–51).\n\nAs noted above, Haber claims that repentance is necessary for morally\npositive forgiveness, as does Wilson (1988). Swinburne claims that,\nleast in the case of “serious hurt”, “it is both bad\nand ineffective” to forgive when no atonement has been made\n(where atonement includes some combination of reparation, repentance,\napology, and penance) (1989: 84, 86). Although he remains\nnon-committal about the necessity of wrongdoer-dependent conditions,\nJeffrie Murphy thinks that “it is not unreasonable to make\nforgiveness contingent on sincere repentance” (2003: 36).\n\nWhy think that a wrongdoer must apologize, repent, or have a change of\nheart in order for forgiveness to have positive moral status? Two\ngeneral reasons have been given. First, it is thought that in the\nabsence of apology and repentance, forgiving constitutes a failure to\ntake the wrongdoing seriously enough. If we give up our resentment or\ndiscontinue blame while the wrongdoer continues to “stand\nby” their mistreatment of us, we are in effect condoning the\nwrongdoing (see, e.g., Kolnai 1973: 95–6). A second kind of\nreason is that forgiving in the absence of apology and repentance\nreveals a lack of self-respect. Forgiving the unapologetic will\nusually, if not always, mean that the victim will “underestimate\ntheir own worth and fail to take their projects and entitlements\nseriously enough” (Novitz 1998: 299; cf. Murphy 1982: 505;\nGriswold 2007: 64–5). In reply, Pettigrove (2004b, 2012: ch. 6)\nand Garrard and McNaughton (2011) take on both the condonation and the\nself-respect arguments, concluding that neither shows that forgiving\nunrepentant or unapologetic wrongdoers necessarily puts one at moral\nrisk. For discussion of three other objections to the rejection of\nwrongdoer-dependent conditions—that it has bad consequences,\nthat it is arbitrary, and that absent repentance resentment is still\nwarranted—see Garrard and McNaughton (2011). \n\nEve Garrard and David McNaughton originally coined the term\n“unconditional forgiveness” to refer to morally positive\nforgiveness that doesn’t depend on the actions or attitudes of\nthe wrongdoer (2002). The term itself may be misleading for the kind\nof conditions on morally positive forgiveness they rejected are what\nwe are calling the wrongdoer-dependent conditions: they argued that an\nact of forgiveness need not be lacking in positive moral status just\nbecause the wrongdoer did not repent, apologize, or make restitution.\nThey did not mean to claim that all acts of forgiveness as\nsuch have positive moral status, and so have recently clarified their\nposition, defending what they call “conditional unconditional\nforgiveness” (2011; cf. Hoffman 2009). Their view is\nunconditional insofar as morally positive forgiveness does not require\nthat the wrongdoer repent, apologize, or make restitution. However, a\nvictim’s forgiveness may still be “defectively\nfacile” if she fails to grasp the moral significance of the\noffense and so overcomes her hostile feelings too “smoothly and\neasily” (Garrard & McNaughton 2011: 105). Her reasons for\nforgiving may be bad ones and she may display her forgiveness in an\nillegitimate manner. The illegitimacy of such forgiveness, however,\nhas nothing to do with the wrongdoer’s actions or state of mind.\n\n\nMargaret Holmgren articulates a similar view, arguing that once a\nvictim completes a certain kind of process, \n\n\nforgiveness is always appropriate and desirable from a moral point of\nview, regardless of whether the wrongdoer repents and regardless of\nwhat [the wrongdoer] has done or suffered. (1993: 341) \n\n\nAbsent this process, however, the victim forgives prematurely, and her\nforgiveness may therefore be incompatible with her own self-respect\nand therefore inappropriate (1993: 341, 342). Notice that for\nHolmgren, whether one’s forgiveness is self-respecting depends\nwholly on whether the victim herself goes through a certain kind of\nprocess. On her view, forgiveness that is compatible with self-respect\ndoes not depend on the actions or attitudes of the wrongdoer. What\nkind of process is required? Holmgren identifies six general elements\nof this process: the victim must (1) recover her self-esteem; (2)\ncome to fully appreciate the nature of the wrongdoing and why it was\nwrong; (3) acknowledge as basic and legitimate her feelings of anger\nand grief as a result of being wronged; (4) not withhold something she\nneeds to say or express to the wrongdoer about her beliefs and\nfeelings; (5) reassess the nature of her relationship with the\nwrongdoer; and (6) determine whether she wants to seek restitution\nfrom the wrongdoer (1993: 343–4).\n",
    "section_title": "9.2 Norms Governing Instances of Forgiveness",
    "entry_title": "Forgiveness",
    "hierarchy_title": "Forgiveness || The Ethics of Forgiveness || Norms Governing Instances of Forgiveness",
    "tokenized_text": [
        "ethic",
        "forgiveness",
        "norm",
        "governing",
        "instance",
        "forgiveness",
        "norm",
        "governing",
        "instance",
        "forgiveness",
        "morality",
        "individual",
        "act",
        "forgiveness",
        "let",
        "u",
        "use",
        "positive",
        "moral",
        "status",
        "umbrella",
        "term",
        "capture",
        "status",
        "instance",
        "forgiveness",
        "insofar",
        "morally",
        "good",
        "morally",
        "virtuous",
        "morally",
        "permissible",
        "morally",
        "praiseworthy",
        "morally",
        "right",
        "morally",
        "obligatory",
        "morally",
        "supererogatory",
        "commonplace",
        "think",
        "order",
        "act",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "certain",
        "kind",
        "condition",
        "must",
        "met",
        "conditionalism",
        "view",
        "order",
        "act",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "certain",
        "condition",
        "must",
        "met",
        "either",
        "victim",
        "wrongdoer",
        "example",
        "might",
        "thought",
        "order",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "victim",
        "must",
        "forgive",
        "certain",
        "kind",
        "good",
        "reason",
        "victim",
        "forgive",
        "good",
        "kind",
        "reason",
        "something",
        "morally",
        "impermissible",
        "bad",
        "blameworthy",
        "etc",
        "forgiving",
        "call",
        "condition",
        "victimdependent",
        "alternatively",
        "might",
        "thought",
        "order",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "wrongdoer",
        "must",
        "say",
        "apologize",
        "victim",
        "kind",
        "wrongdoerdependent",
        "condition",
        "wrongdoer",
        "apologize",
        "victim",
        "victim",
        "something",
        "morally",
        "impermissible",
        "bad",
        "blameworthy",
        "etc",
        "forgiving",
        "notice",
        "however",
        "claim",
        "distinguished",
        "view",
        "according",
        "absent",
        "wrongdoer",
        "apology",
        "victim",
        "forgiveness",
        "actually",
        "forgiveness",
        "instead",
        "condonation",
        "exculpation",
        "latter",
        "sort",
        "view",
        "condition",
        "positive",
        "moral",
        "status",
        "act",
        "forgiveness",
        "built",
        "constitutive",
        "condition",
        "forgiveness",
        "call",
        "view",
        "forgiveness",
        "build",
        "condition",
        "positive",
        "moral",
        "status",
        "condition",
        "forgiveness",
        "thick",
        "conception",
        "forgiveness",
        "view",
        "forgiveness",
        "always",
        "morally",
        "good",
        "morally",
        "permissible",
        "otherwise",
        "posse",
        "positive",
        "moral",
        "status",
        "consistent",
        "act",
        "forgiveness",
        "thing",
        "considered",
        "wrong",
        "say",
        "forgiving",
        "case",
        "would",
        "cause",
        "death",
        "innocent",
        "million",
        "contrast",
        "thin",
        "conception",
        "forgiveness",
        "one",
        "allows",
        "instance",
        "forgiveness",
        "lack",
        "positive",
        "moral",
        "status",
        "course",
        "thick",
        "thin",
        "conception",
        "forgiveness",
        "require",
        "require",
        "either",
        "victimdependent",
        "wrongdoerdependent",
        "condition",
        "first",
        "met",
        "set",
        "aside",
        "thickthin",
        "controversy",
        "focus",
        "condition",
        "morally",
        "positive",
        "forgiveness",
        "widely",
        "thought",
        "order",
        "act",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "victim",
        "must",
        "meet",
        "certain",
        "condition",
        "commonly",
        "cited",
        "kind",
        "victimdependent",
        "condition",
        "victim",
        "motivating",
        "reason",
        "forgiving",
        "kind",
        "motivating",
        "reason",
        "make",
        "forgiveness",
        "morally",
        "positive",
        "example",
        "joram",
        "haber",
        "argued",
        "act",
        "forgiveness",
        "appropriate",
        "forgive",
        "would",
        "risk",
        "moral",
        "reproval",
        "victim",
        "must",
        "forgive",
        "reason",
        "preserve",
        "selfrespect",
        "reason",
        "would",
        "serve",
        "function",
        "wrongdoer",
        "repented",
        "wrong",
        "done",
        "haber",
        "seems",
        "unless",
        "wrongdoer",
        "repents",
        "victim",
        "forgives",
        "least",
        "part",
        "reason",
        "forgiveness",
        "morally",
        "inappropriate",
        "haber",
        "therefore",
        "two",
        "condition",
        "one",
        "wrongdoerdependent",
        "repent",
        "wrong",
        "done",
        "one",
        "victimdependent",
        "forgive",
        "least",
        "part",
        "wrongdoer",
        "repented",
        "jeffrie",
        "murphy",
        "articulates",
        "similar",
        "view",
        "claiming",
        "acceptable",
        "ground",
        "forgiveness",
        "must",
        "compatible",
        "selfrespect",
        "respect",
        "others",
        "moral",
        "agent",
        "respect",
        "rule",
        "morality",
        "moral",
        "order",
        "murphy",
        "hampton",
        "example",
        "kind",
        "moral",
        "reason",
        "murphy",
        "mind",
        "include",
        "wrongdoer",
        "repented",
        "change",
        "heart",
        "suffered",
        "enough",
        "undergone",
        "humiliation",
        "apology",
        "ritual",
        "may",
        "kind",
        "condition",
        "victim",
        "must",
        "meet",
        "order",
        "effect",
        "morally",
        "positive",
        "forgiveness",
        "charles",
        "griswold",
        "writes",
        "paradigmatic",
        "scene",
        "forgiveness",
        "best",
        "manifestation",
        "virtue",
        "addition",
        "forswearing",
        "revenge",
        "moderating",
        "resentment",
        "committing",
        "give",
        "lingering",
        "resentment",
        "victim",
        "must",
        "also",
        "revise",
        "view",
        "wrongdoer",
        "someone",
        "reducible",
        "person",
        "wrong",
        "give",
        "presumption",
        "decisive",
        "moral",
        "superiority",
        "recognize",
        "shared",
        "humanity",
        "party",
        "address",
        "wrongdoer",
        "declare",
        "forgiveness",
        "granted",
        "controversial",
        "whether",
        "morally",
        "positive",
        "forgiveness",
        "requires",
        "wrongdoerdependent",
        "condition",
        "one",
        "foremost",
        "defender",
        "condition",
        "charles",
        "griswold",
        "argues",
        "paradigmatic",
        "scene",
        "numerous",
        "wrongdoerdependent",
        "condition",
        "forgiveness",
        "namely",
        "wrongdoer",
        "must",
        "acknowledge",
        "responsible",
        "wrong",
        "question",
        "repudiate",
        "deed",
        "disavow",
        "thought",
        "would",
        "experience",
        "express",
        "regret",
        "caused",
        "particular",
        "wrong",
        "commit",
        "deed",
        "word",
        "sort",
        "person",
        "wrong",
        "show",
        "understands",
        "victim",
        "perspective",
        "damage",
        "done",
        "wrongdoing",
        "offer",
        "sort",
        "narrative",
        "explain",
        "wrong",
        "noted",
        "haber",
        "claim",
        "repentance",
        "necessary",
        "morally",
        "positive",
        "forgiveness",
        "wilson",
        "swinburne",
        "claim",
        "least",
        "case",
        "serious",
        "hurt",
        "bad",
        "ineffective",
        "forgive",
        "atonement",
        "made",
        "atonement",
        "includes",
        "combination",
        "reparation",
        "repentance",
        "apology",
        "penance",
        "although",
        "remains",
        "noncommittal",
        "necessity",
        "wrongdoerdependent",
        "condition",
        "jeffrie",
        "murphy",
        "think",
        "unreasonable",
        "make",
        "forgiveness",
        "contingent",
        "sincere",
        "repentance",
        "think",
        "wrongdoer",
        "must",
        "apologize",
        "repent",
        "change",
        "heart",
        "order",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "two",
        "general",
        "reason",
        "given",
        "first",
        "thought",
        "absence",
        "apology",
        "repentance",
        "forgiving",
        "constitutes",
        "failure",
        "take",
        "wrongdoing",
        "seriously",
        "enough",
        "give",
        "resentment",
        "discontinue",
        "blame",
        "wrongdoer",
        "continues",
        "stand",
        "mistreatment",
        "u",
        "effect",
        "condoning",
        "wrongdoing",
        "see",
        "eg",
        "kolnai",
        "second",
        "kind",
        "reason",
        "forgiving",
        "absence",
        "apology",
        "repentance",
        "reveals",
        "lack",
        "selfrespect",
        "forgiving",
        "unapologetic",
        "usually",
        "always",
        "mean",
        "victim",
        "underestimate",
        "worth",
        "fail",
        "take",
        "project",
        "entitlement",
        "seriously",
        "enough",
        "novitz",
        "cf",
        "murphy",
        "griswold",
        "reply",
        "pettigrove",
        "b",
        "ch",
        "garrard",
        "mcnaughton",
        "take",
        "condonation",
        "selfrespect",
        "argument",
        "concluding",
        "neither",
        "show",
        "forgiving",
        "unrepentant",
        "unapologetic",
        "wrongdoer",
        "necessarily",
        "put",
        "one",
        "moral",
        "risk",
        "discussion",
        "three",
        "objection",
        "rejection",
        "wrongdoerdependent",
        "conditionsthat",
        "bad",
        "consequence",
        "arbitrary",
        "absent",
        "repentance",
        "resentment",
        "still",
        "warrantedsee",
        "garrard",
        "mcnaughton",
        "eve",
        "garrard",
        "david",
        "mcnaughton",
        "originally",
        "coined",
        "term",
        "unconditional",
        "forgiveness",
        "refer",
        "morally",
        "positive",
        "forgiveness",
        "depend",
        "action",
        "attitude",
        "wrongdoer",
        "term",
        "may",
        "misleading",
        "kind",
        "condition",
        "morally",
        "positive",
        "forgiveness",
        "rejected",
        "calling",
        "wrongdoerdependent",
        "condition",
        "argued",
        "act",
        "forgiveness",
        "need",
        "lacking",
        "positive",
        "moral",
        "status",
        "wrongdoer",
        "repent",
        "apologize",
        "make",
        "restitution",
        "mean",
        "claim",
        "act",
        "forgiveness",
        "positive",
        "moral",
        "status",
        "recently",
        "clarified",
        "position",
        "defending",
        "call",
        "conditional",
        "unconditional",
        "forgiveness",
        "cf",
        "hoffman",
        "view",
        "unconditional",
        "insofar",
        "morally",
        "positive",
        "forgiveness",
        "require",
        "wrongdoer",
        "repent",
        "apologize",
        "make",
        "restitution",
        "however",
        "victim",
        "forgiveness",
        "may",
        "still",
        "defectively",
        "facile",
        "fails",
        "grasp",
        "moral",
        "significance",
        "offense",
        "overcomes",
        "hostile",
        "feeling",
        "smoothly",
        "easily",
        "garrard",
        "mcnaughton",
        "reason",
        "forgiving",
        "may",
        "bad",
        "one",
        "may",
        "display",
        "forgiveness",
        "illegitimate",
        "manner",
        "illegitimacy",
        "forgiveness",
        "however",
        "nothing",
        "wrongdoer",
        "action",
        "state",
        "mind",
        "margaret",
        "holmgren",
        "articulates",
        "similar",
        "view",
        "arguing",
        "victim",
        "completes",
        "certain",
        "kind",
        "process",
        "forgiveness",
        "always",
        "appropriate",
        "desirable",
        "moral",
        "point",
        "view",
        "regardless",
        "whether",
        "wrongdoer",
        "repents",
        "regardless",
        "wrongdoer",
        "done",
        "suffered",
        "absent",
        "process",
        "however",
        "victim",
        "forgives",
        "prematurely",
        "forgiveness",
        "may",
        "therefore",
        "incompatible",
        "selfrespect",
        "therefore",
        "inappropriate",
        "notice",
        "holmgren",
        "whether",
        "one",
        "forgiveness",
        "selfrespecting",
        "depends",
        "wholly",
        "whether",
        "victim",
        "go",
        "certain",
        "kind",
        "process",
        "view",
        "forgiveness",
        "compatible",
        "selfrespect",
        "depend",
        "action",
        "attitude",
        "wrongdoer",
        "kind",
        "process",
        "required",
        "holmgren",
        "identifies",
        "six",
        "general",
        "element",
        "process",
        "victim",
        "must",
        "recover",
        "selfesteem",
        "come",
        "fully",
        "appreciate",
        "nature",
        "wrongdoing",
        "wrong",
        "acknowledge",
        "basic",
        "legitimate",
        "feeling",
        "anger",
        "grief",
        "result",
        "wronged",
        "withhold",
        "something",
        "need",
        "say",
        "express",
        "wrongdoer",
        "belief",
        "feeling",
        "reassess",
        "nature",
        "relationship",
        "wrongdoer",
        "determine",
        "whether",
        "want",
        "seek",
        "restitution",
        "wrongdoer"
    ]
}