{
    "main_text": "Prime matter\n2. Prime matter\n\nOne obvious question pertains to how low such underlying levels might\ngo. In fact there is considerable controversy concerning how to\nconceive the bottom rung of Aristotle’s hierarchy of matter.\nAristotle believes that everything is made of earth, air, fire and\nwater. These elements are defined by their possession of one of each\nof the two fundamental pairs of opposites, hot/cold and wet/dry.\nAristotle also thinks that these elements can change into one another\n(On the Heavens iii 6, 305a14–35). If his analysis of\nchange is correct, when some water changes into some air, there must\nbe something underlying, some substrate, which persists through the\nchange, initially having the essential properties of water (being wet\nand cold, on Aristotle’s view) and then later those of air\n(being wet and hot). The thing that underlies this kind of change\ncannot be any of the elements, since it must be capable of possessing\nthe properties characteristic of each of the elements successively,\ncapable of being first cold and then hot, for example. The traditional\ninterpretation of Aristotle, which goes back as far as Augustine\n(De Genesi contra Manichaeos i 5–7) and Simplicius\n(On Aristotle’s Physics i 7), and is accepted by\nAquinas (De Principiis Naturae §13), holds that\nAristotle believes in something called “prime matter”,\nwhich is the matter of the elements, where each element is, then, a\ncompound of this matter and a form. This prime matter is usually\ndescribed as pure potentiality, just as, on the form side, the unmoved\nmovers are said by Aristotle to be pure actuality, form without any\nmatter (Metaphysics xii 6). What it means to call prime\nmatter “pure potentiality” is that it is capable of taking\non any form whatsoever, and thus is completely without any essential\nproperties of its own. It exists eternally, since, if it were capable\nof being created or destroyed, there would have to be some even lower\nmatter to underlie those changes. Because it is the matter of the\nelements, which are themselves present in all more complex bodies, it\nis omnipresent, and underlies not only elemental generation and\ndestruction, but all physical changes. As a completely indeterminate\nsubstratum, prime matter bears some similarities to what modern\nphilosophy has called a “bare particular” (see Sider\n2006), although, not being a particular, it may have more in common\nwith so-called “gunk” (see Sider 1993).\n\nA similar idea is to be found in Plato’s Timaeus,\n49–52, where, in addition to his Forms and the particulars which\ninstantiate them, he argues for the existence of a third category of\nthing, “a receptacle of all coming to be” (49a5–6):\n\n\n\nit must always be called by the same term. For it does not depart from\nits own character at all. It both continually receives all things, and\nhas never taken on a form similar to any of the things that enter it\nin any way. For it is laid down by nature as a recipient of\nimpressions for everything, being changed and formed variously by the\nthings that enter it, and because of them it appears different at\ndifferent times. (50b6–c4) \n\n\nPlato also motivates his receptacle by appealing to the phenomenon of\nthe elements changing into one another, and, although he refers to it\nas “space” and not “matter”, the traditional\ninterpretation has it that, as he often does, Aristotle has adopted an\nidea first developed by his mentor.\n\nMore recently, opponents of attributing a doctrine of prime matter to\nAristotle have complained that there is insufficient evidence for his\nholding this kind of view, and that it is so philosophically\nunappealing that principles of charity militate against it as an\ninterpretation. Such scholars point out that Aristotle actually\ncriticizes Plato’s account from the Timaeus, in On\nGeneration and Corruption ii 1: \n\n\nwhat Plato has written in the Timaeus is not based on any\nprecisely-articulated conception. For he has not stated clearly\nwhether his “Omnirecipient” exists in separation from the\nelements; nor does he make any use of it. (329a13–15) \n\n\nAlthough Aristotle is clearly criticizing Plato here, it may be that\nhis point is simply that Plato was not sufficiently clear that prime\nmatter is never to be found existing apart from the elements, and that\nhe did not give good enough reasons for its introduction, not that he\nwas wrong to believe in it.\n\nIn this connection it is appropriate to note that Aristotle does in\nfact use the expressions “prime matter”\n(prôtê hulê) and “primary underlying\nthing” (prôton hupokeimenon) several times:\nPhysics i 9, 192a31, ii 1, 193a10 and 193a29;\nMetaphysics v 4, 1014b32 and 1015a7–10, v 6,\n1017a5–6, viii 4, 1044a23, ix 7, 1049a24–7; Generation\nof Animals i 20, 729a32. The mere fact that he uses the phrase is\ninconclusive, however, since, he makes it explicit that “prime\nmatter” can refer either to a thing’s proximate matter or\nto whatever ultimately makes it up: \n\n\nNature is prime matter (and this in two ways, either prime in relation\nto the thing or prime in general; for example, in the case of bronze\nworks the bronze is prime in relation to them, but prime in general\nwould be perhaps water, if everything that can be melted is water).\n(1015a7–10) \n\n\nHere Aristotle is referring to his predecessor Thales’ view that\neverything is ultimately made of water, which he in fact rejects.\n\nIn other passages too Aristotle seems to leave the question of whether\nor not there is prime matter deliberately open. In\nMetaphysics ix 7, he uses a conditional to talk about the\npossibility: \n\n\nit seems that what we call not this, but that-en—for example, we\ncall the box not wood, but wooden, nor do we call the wood earth, but\nearthen, and again earth, if it is this way, we do not call something\nelse, but that-en—that is always potentially without\nqualification the next thing…But if there is something\nprimary, which is no longer called that-en with respect to something\nelse, this is prime matter. For example, if earth is airy, and air is\nnot fire but firey, fire is prime matter, being a this.\n(1049a18–22…24–27) \n\n\nHere Aristotle uses the generic adjective “that-en”\n(ekeininon), a word that he coins, to mean made of\nthat material. If a material could not be so described, it\nwould be prime matter. Again, he shows himself aware of prime matter\nas a possibility, without wanting to commit to it here.\n\nAnother key passage where Aristotle has been thought to commit himself\nmore decisively to prime matter is Metaphysics vii 3. Here we\nare told: \n\n\nBy “matter” I mean that which in itself is not called a\nsubstance nor a quantity nor anything else by which being is\ncategorized. For it is something of which each of these things is\npredicated, whose being is different from each of its predicates (for\nthe others are predicated of substance, and substance is predicated of\nmatter). Therefore this last is in itself neither substance nor\nquantity nor anything else. Nor is it the denials of any of these; for\neven denials belong to things accidentally. (1029a20–26) \n\n\nAlthough the word “prime” does not occur here, Aristotle\nis evidently talking about prime matter. A natural way to read this\npassage is that he is saying there is a wholly indeterminate\nunderlying thing, which he calls “matter”, and it is not a\nsubstance. Those who wish to avoid attributing a doctrine of prime\nmatter to Aristotle must offer a different interpretation: that if we\nwere to make the mistake of regarding matter, as opposed to form, as\nsubstance, we would be committed (absurdly) to the existence of a\nwholly indeterminate underlying thing.\n\nIn addition to disputing the correct interpretation of these passages\nwhere Aristotle explicitly mentions prime matter, much of the debate\nhas centered around, on the one hand, whether what he says about\nchange really commits him to it, on the other, whether the idea is\nreally absurd. Some opponents of prime matter have argued that\nAristotle does not, after all, wish to insist that there is always\nsomething which persists through a change (see Charlton 1970,\nAppendix, and 1983). In particular, when one of the elements changes\ninto another, there is an underlying thing—the initial\nelement—but in this case it does not persist. They point out\nthat in the key passage of Physics i 7, where Aristotle gives\nhis account of change in general, he uses the expressions\n“underlying thing” and “thing that remains”.\nWhile readers have usually supposed that these terms are used\ninterchangeably to refer to the substance, in cases of accidental\nchange, and the matter in substantial changes, this assumption can be\nchallenged. In the elemental generation case, perhaps there is no\nthing that remains, just an initial elements that underlies. The worry\nabout this interpretation is whether it is consistent with\nAristotle’s belief that nothing can come to be out of nothing.\nIf there is no “thing that remains” in a case of elemental\ngeneration, how is an instance of water changing into air to be\ndistinguished from the supposedly impossible sort of change whereby\nsome water vanishes into nothing, and is instantly replaced by some\nair which has materialized out of nothing?\n\nThe main philosophical objections to prime matter are that it is, at\nbest, a mysterious entity that we cannot know anything about, since we\nnever perceive it directly, but only the things it underlies. Of\ncourse, there can be good theoretical reasons for believing in things\nthat we never actually see. No one has ever seen a quark, but we can\nstill know things about them, based on the kind of theoretical work\nthat they are required to perform. Still, Aristotle’s theory\nwill be more parsimonious, if he can manage without positing such\ntheoretical entities. At worst, prime matter is said to be outright\ncontradictory. It is supposed to be capable of taking on any form\nwhatsoever, and thus to have no essential properties of its own. The\nidea that it has no essential properties of its own seems to make it\ndifficult for us to characterize it positively in any way: how can it\nbe invisible, or eternal, or the ultimate bearer of properties, if\nthese are not properties that belong to it essentially? Moreover, if\nit is what ultimately underlies all properties, it seems that it must\nbe able to take on properties that are inconsistent with what we would\nlike to be able to think of as its own nature: when Socrates turns\nblue, there is also some prime matter that underlies him, which also\nturns blue. But how can prime matter be simultaneous invisible and\nblue? To get around these problems, it looks as though proponents of\nprime matter will have to distinguish between two different kinds of\nproperty that prime matter has, or perhaps two different ways in which\nit has properties. There are its essential properties, which define\nthe kind of entity that it is, and which it has permanently, and then\nthere are its accidental properties, which it gains and loses as it\nunderlies different sorts of thing. A worry about this solution is, if\none can distinguish between the prime matter and its essential\nproperties, this might suggest that there is a need for a further\nentity to act as the underlying thing for those properties, and then\nthis further entity would need to have its own nature, and something\nto underlie that nature, and so on. It seems best to try to avoid such\nan infinite regress by insisting that prime matter can underlie its\nown essential properties, without being a compound of those properties\nand some further matter.\n",
    "section_title": "2. Prime matter",
    "entry_title": "Form vs. Matter",
    "hierarchy_title": "Form vs. Matter || Prime matter",
    "tokenized_text": [
        "prime",
        "matter",
        "prime",
        "matter",
        "one",
        "obvious",
        "question",
        "pertains",
        "low",
        "underlying",
        "level",
        "might",
        "go",
        "fact",
        "considerable",
        "controversy",
        "concerning",
        "conceive",
        "bottom",
        "rung",
        "aristotle",
        "hierarchy",
        "matter",
        "aristotle",
        "belief",
        "everything",
        "made",
        "earth",
        "air",
        "fire",
        "water",
        "element",
        "defined",
        "possession",
        "one",
        "two",
        "fundamental",
        "pair",
        "opposite",
        "hotcold",
        "wetdry",
        "aristotle",
        "also",
        "think",
        "element",
        "change",
        "one",
        "another",
        "heaven",
        "iii",
        "a",
        "analysis",
        "change",
        "correct",
        "water",
        "change",
        "air",
        "must",
        "something",
        "underlying",
        "substrate",
        "persists",
        "change",
        "initially",
        "essential",
        "property",
        "water",
        "wet",
        "cold",
        "aristotle",
        "view",
        "later",
        "air",
        "wet",
        "hot",
        "thing",
        "underlies",
        "kind",
        "change",
        "element",
        "since",
        "must",
        "capable",
        "possessing",
        "property",
        "characteristic",
        "element",
        "successively",
        "capable",
        "first",
        "cold",
        "hot",
        "example",
        "traditional",
        "interpretation",
        "aristotle",
        "go",
        "back",
        "far",
        "augustine",
        "de",
        "genesi",
        "contra",
        "manichaeos",
        "simplicius",
        "aristotle",
        "physic",
        "accepted",
        "aquinas",
        "de",
        "principiis",
        "naturae",
        "hold",
        "aristotle",
        "belief",
        "something",
        "called",
        "prime",
        "matter",
        "matter",
        "element",
        "element",
        "compound",
        "matter",
        "form",
        "prime",
        "matter",
        "usually",
        "described",
        "pure",
        "potentiality",
        "form",
        "side",
        "unmoved",
        "mover",
        "said",
        "aristotle",
        "pure",
        "actuality",
        "form",
        "without",
        "matter",
        "metaphysics",
        "xii",
        "mean",
        "call",
        "prime",
        "matter",
        "pure",
        "potentiality",
        "capable",
        "taking",
        "form",
        "whatsoever",
        "thus",
        "completely",
        "without",
        "essential",
        "property",
        "exists",
        "eternally",
        "since",
        "capable",
        "created",
        "destroyed",
        "would",
        "even",
        "lower",
        "matter",
        "underlie",
        "change",
        "matter",
        "element",
        "present",
        "complex",
        "body",
        "omnipresent",
        "underlies",
        "elemental",
        "generation",
        "destruction",
        "physical",
        "change",
        "completely",
        "indeterminate",
        "substratum",
        "prime",
        "matter",
        "bear",
        "similarity",
        "modern",
        "philosophy",
        "called",
        "bare",
        "particular",
        "see",
        "sider",
        "although",
        "particular",
        "may",
        "common",
        "socalled",
        "gunk",
        "see",
        "sider",
        "similar",
        "idea",
        "found",
        "plato",
        "timaeus",
        "addition",
        "form",
        "particular",
        "instantiate",
        "argues",
        "existence",
        "third",
        "category",
        "thing",
        "receptacle",
        "coming",
        "a",
        "must",
        "always",
        "called",
        "term",
        "depart",
        "character",
        "continually",
        "receives",
        "thing",
        "never",
        "taken",
        "form",
        "similar",
        "thing",
        "enter",
        "way",
        "laid",
        "nature",
        "recipient",
        "impression",
        "everything",
        "changed",
        "formed",
        "variously",
        "thing",
        "enter",
        "appears",
        "different",
        "different",
        "time",
        "bc",
        "plato",
        "also",
        "motivates",
        "receptacle",
        "appealing",
        "phenomenon",
        "element",
        "changing",
        "one",
        "another",
        "although",
        "refers",
        "space",
        "matter",
        "traditional",
        "interpretation",
        "often",
        "aristotle",
        "adopted",
        "idea",
        "first",
        "developed",
        "mentor",
        "recently",
        "opponent",
        "attributing",
        "doctrine",
        "prime",
        "matter",
        "aristotle",
        "complained",
        "insufficient",
        "evidence",
        "holding",
        "kind",
        "view",
        "philosophically",
        "unappealing",
        "principle",
        "charity",
        "militate",
        "interpretation",
        "scholar",
        "point",
        "aristotle",
        "actually",
        "criticizes",
        "plato",
        "account",
        "timaeus",
        "generation",
        "corruption",
        "ii",
        "plato",
        "written",
        "timaeus",
        "based",
        "preciselyarticulated",
        "conception",
        "stated",
        "clearly",
        "whether",
        "omnirecipient",
        "exists",
        "separation",
        "element",
        "make",
        "use",
        "a",
        "although",
        "aristotle",
        "clearly",
        "criticizing",
        "plato",
        "may",
        "point",
        "simply",
        "plato",
        "sufficiently",
        "clear",
        "prime",
        "matter",
        "never",
        "found",
        "existing",
        "apart",
        "element",
        "give",
        "good",
        "enough",
        "reason",
        "introduction",
        "wrong",
        "believe",
        "connection",
        "appropriate",
        "note",
        "aristotle",
        "fact",
        "use",
        "expression",
        "prime",
        "matter",
        "prôtê",
        "hulê",
        "primary",
        "underlying",
        "thing",
        "prôton",
        "hupokeimenon",
        "several",
        "time",
        "physic",
        "a",
        "ii",
        "a",
        "a",
        "metaphysics",
        "v",
        "b",
        "a",
        "v",
        "a",
        "viii",
        "a",
        "ix",
        "a",
        "generation",
        "animal",
        "a",
        "mere",
        "fact",
        "us",
        "phrase",
        "inconclusive",
        "however",
        "since",
        "make",
        "explicit",
        "prime",
        "matter",
        "refer",
        "either",
        "thing",
        "proximate",
        "matter",
        "whatever",
        "ultimately",
        "make",
        "nature",
        "prime",
        "matter",
        "two",
        "way",
        "either",
        "prime",
        "relation",
        "thing",
        "prime",
        "general",
        "example",
        "case",
        "bronze",
        "work",
        "bronze",
        "prime",
        "relation",
        "prime",
        "general",
        "would",
        "perhaps",
        "water",
        "everything",
        "melted",
        "water",
        "a",
        "aristotle",
        "referring",
        "predecessor",
        "thales",
        "view",
        "everything",
        "ultimately",
        "made",
        "water",
        "fact",
        "reject",
        "passage",
        "aristotle",
        "seems",
        "leave",
        "question",
        "whether",
        "prime",
        "matter",
        "deliberately",
        "open",
        "metaphysics",
        "ix",
        "us",
        "conditional",
        "talk",
        "possibility",
        "seems",
        "call",
        "thatenfor",
        "example",
        "call",
        "box",
        "wood",
        "wooden",
        "call",
        "wood",
        "earth",
        "earthen",
        "earth",
        "way",
        "call",
        "something",
        "else",
        "thatenthat",
        "always",
        "potentially",
        "without",
        "qualification",
        "next",
        "thingbut",
        "something",
        "primary",
        "longer",
        "called",
        "thaten",
        "respect",
        "something",
        "else",
        "prime",
        "matter",
        "example",
        "earth",
        "airy",
        "air",
        "fire",
        "firey",
        "fire",
        "prime",
        "matter",
        "a",
        "aristotle",
        "us",
        "generic",
        "adjective",
        "thaten",
        "ekeininon",
        "word",
        "coin",
        "mean",
        "made",
        "material",
        "material",
        "could",
        "described",
        "would",
        "prime",
        "matter",
        "show",
        "aware",
        "prime",
        "matter",
        "possibility",
        "without",
        "wanting",
        "commit",
        "another",
        "key",
        "passage",
        "aristotle",
        "thought",
        "commit",
        "decisively",
        "prime",
        "matter",
        "metaphysics",
        "vii",
        "told",
        "matter",
        "mean",
        "called",
        "substance",
        "quantity",
        "anything",
        "else",
        "categorized",
        "something",
        "thing",
        "predicated",
        "whose",
        "different",
        "predicate",
        "others",
        "predicated",
        "substance",
        "substance",
        "predicated",
        "matter",
        "therefore",
        "last",
        "neither",
        "substance",
        "quantity",
        "anything",
        "else",
        "denial",
        "even",
        "denial",
        "belong",
        "thing",
        "accidentally",
        "a",
        "although",
        "word",
        "prime",
        "occur",
        "aristotle",
        "evidently",
        "talking",
        "prime",
        "matter",
        "natural",
        "way",
        "read",
        "passage",
        "saying",
        "wholly",
        "indeterminate",
        "underlying",
        "thing",
        "call",
        "matter",
        "substance",
        "wish",
        "avoid",
        "attributing",
        "doctrine",
        "prime",
        "matter",
        "aristotle",
        "must",
        "offer",
        "different",
        "interpretation",
        "make",
        "mistake",
        "regarding",
        "matter",
        "opposed",
        "form",
        "substance",
        "would",
        "committed",
        "absurdly",
        "existence",
        "wholly",
        "indeterminate",
        "underlying",
        "thing",
        "addition",
        "disputing",
        "correct",
        "interpretation",
        "passage",
        "aristotle",
        "explicitly",
        "mention",
        "prime",
        "matter",
        "much",
        "debate",
        "centered",
        "around",
        "one",
        "hand",
        "whether",
        "say",
        "change",
        "really",
        "commits",
        "whether",
        "idea",
        "really",
        "absurd",
        "opponent",
        "prime",
        "matter",
        "argued",
        "aristotle",
        "wish",
        "insist",
        "always",
        "something",
        "persists",
        "change",
        "see",
        "charlton",
        "appendix",
        "particular",
        "one",
        "element",
        "change",
        "another",
        "underlying",
        "thingthe",
        "initial",
        "elementbut",
        "case",
        "persist",
        "point",
        "key",
        "passage",
        "physic",
        "aristotle",
        "give",
        "account",
        "change",
        "general",
        "us",
        "expression",
        "underlying",
        "thing",
        "thing",
        "remains",
        "reader",
        "usually",
        "supposed",
        "term",
        "used",
        "interchangeably",
        "refer",
        "substance",
        "case",
        "accidental",
        "change",
        "matter",
        "substantial",
        "change",
        "assumption",
        "challenged",
        "elemental",
        "generation",
        "case",
        "perhaps",
        "thing",
        "remains",
        "initial",
        "element",
        "underlies",
        "worry",
        "interpretation",
        "whether",
        "consistent",
        "aristotle",
        "belief",
        "nothing",
        "come",
        "nothing",
        "thing",
        "remains",
        "case",
        "elemental",
        "generation",
        "instance",
        "water",
        "changing",
        "air",
        "distinguished",
        "supposedly",
        "impossible",
        "sort",
        "change",
        "whereby",
        "water",
        "vanishes",
        "nothing",
        "instantly",
        "replaced",
        "air",
        "materialized",
        "nothing",
        "main",
        "philosophical",
        "objection",
        "prime",
        "matter",
        "best",
        "mysterious",
        "entity",
        "know",
        "anything",
        "since",
        "never",
        "perceive",
        "directly",
        "thing",
        "underlies",
        "course",
        "good",
        "theoretical",
        "reason",
        "believing",
        "thing",
        "never",
        "actually",
        "see",
        "one",
        "ever",
        "seen",
        "quark",
        "still",
        "know",
        "thing",
        "based",
        "kind",
        "theoretical",
        "work",
        "required",
        "perform",
        "still",
        "aristotle",
        "theory",
        "parsimonious",
        "manage",
        "without",
        "positing",
        "theoretical",
        "entity",
        "worst",
        "prime",
        "matter",
        "said",
        "outright",
        "contradictory",
        "supposed",
        "capable",
        "taking",
        "form",
        "whatsoever",
        "thus",
        "essential",
        "property",
        "idea",
        "essential",
        "property",
        "seems",
        "make",
        "difficult",
        "u",
        "characterize",
        "positively",
        "way",
        "invisible",
        "eternal",
        "ultimate",
        "bearer",
        "property",
        "property",
        "belong",
        "essentially",
        "moreover",
        "ultimately",
        "underlies",
        "property",
        "seems",
        "must",
        "able",
        "take",
        "property",
        "inconsistent",
        "would",
        "like",
        "able",
        "think",
        "nature",
        "socrates",
        "turn",
        "blue",
        "also",
        "prime",
        "matter",
        "underlies",
        "also",
        "turn",
        "blue",
        "prime",
        "matter",
        "simultaneous",
        "invisible",
        "blue",
        "get",
        "around",
        "problem",
        "look",
        "though",
        "proponent",
        "prime",
        "matter",
        "distinguish",
        "two",
        "different",
        "kind",
        "property",
        "prime",
        "matter",
        "perhaps",
        "two",
        "different",
        "way",
        "property",
        "essential",
        "property",
        "define",
        "kind",
        "entity",
        "permanently",
        "accidental",
        "property",
        "gain",
        "loses",
        "underlies",
        "different",
        "sort",
        "thing",
        "worry",
        "solution",
        "one",
        "distinguish",
        "prime",
        "matter",
        "essential",
        "property",
        "might",
        "suggest",
        "need",
        "entity",
        "act",
        "underlying",
        "thing",
        "property",
        "entity",
        "would",
        "need",
        "nature",
        "something",
        "underlie",
        "nature",
        "seems",
        "best",
        "try",
        "avoid",
        "infinite",
        "regress",
        "insisting",
        "prime",
        "matter",
        "underlie",
        "essential",
        "property",
        "without",
        "compound",
        "property",
        "matter"
    ]
}