{
    "main_text": "Tractarian Formalism\n3. Tractarian Formalism\n\nWittgenstein was a keen student of Frege’s work, directed to\nfurther his studies under Bertrand Russell by Frege himself in the\ncourse of a visit he made to see Frege in Jena. One might, then, think\nhim inoculated against formalism. But definite formalistic elements\nsurface in Wittgenstein’s Tractatus.\n\nTrue, the Tractatus is a notoriously difficult work to\ninterpret. Even the question as to whether the main portion of the\nbook, essentially all of it other than the ‘frame’ of the\npreface and the end, is to be taken as a serious attempt to present a\nmetaphysics is controversial. If we leave that hermeneutic controversy\naside, and consider the metaphysics which is offered to us, the\nformalistic aspects one finds are twofold. Firstly, mathematical\nsentences are said to express ‘pseudo-propositions’, and\nso are devoid of truth value (only contingent propositions have a\ntruth value). Secondly, mathematics is described as a\n‘calculus’ which is not to be used to represent the world\nas it is in itself but whose value is entirely instrumental. To be\nsure, the most explicit statement of this is not in the\nTractatus but in comments Wittgenstein wrote on\nRamsey’s copy of it:\n\nThe fundamental idea of math. is the idea of calculus\nrepresented here by the idea of operation The beginning of\nlogic presupposes calculation and so number. Number is\nthe fundamental idea of calculus and must be introduced as\nsuch (Lewy, 1967: 421–2).\n\n\nIn the Tractatus proper we do get the idea that mathematical\npropositions are mere instruments (all of mathematics, not just an\n‘ideal’ fragment, as in Hilbert):\n\nIndeed in real life a mathematical proposition is never what we want.\nRather, we make use of mathematical propositions only in inferences\nfrom propositions that do not belong to mathematics to others that\nlikewise do not belong to mathematics. (In philosophy the question,\n“What do we actually use this word or this proposition\nfor?” repeatedly leads to valuable insights.) Tractatus\n¶6.211.)\n\n\nThis idea is prefaced by the statements:\n\nMathematics is a logical method. The propositions of mathematics are\nequations, and therefore pseudo-propositions. (ibid, ¶6.2)\n\n\nA proposition of mathematics does not express a thought. (ibid,\n¶6.21)\n\n\nCare must be taken, however. Wittgenstein distinguishes utterances\nwhich are sinnlos, which lack sense (including logical\ntautologies and contradictions here) from those which are\nunsinnig, nonsensical; it is not clear into which class\nmathematical utterances fall. One might well think that the game\nformalist should treat mathematical utterances, on that view just\nstrings of meaningless marks, as unsinnig, not just\nsinnlos. One clear difference from game formalism however is\nthis: for Wittgenstein mathematics should not be conceived of as a\ncalculus separate from other uses of language. Rather he attempts to\nshow that parts of arithmetic, at least, can be seen as grounded in\nnon-mathematical uses of language. Frege by contrast, whilst arguing\nthat a proper account of arithmetic (and analysis) should show how its\ngenerality enables one to give a uniform account of multifarious\ndifferent applications (cf. Dummett, 1991 Chapter 20) also argued\nstrongly for the view that mathematical utterances have a meaning\nindependent of, in conceptually prior to, their use in\napplications.\n\nWittgenstein attempts no theory of mathematics in the\nTractatus beyond arithmetic, a rather narrow fragment of\narithmetic at that. The theory clearly shares the anti-platonism of\nthe game formalist. There are no numbers, arithmetic is to be\nconstrued as a calculus in which one manipulates exponents or indices\nof operators. What is an operator? Wittgenstein distinguishes operator\nterms from function terms but commentators have struggled to explain\nwhat the distinction comes to. It is clear that Wittgenstein held that\ntwo occurrences of a function term \\(f\\) applied to different\nstrings \\(t\\) and \\(u\\) have different meanings, where by\n‘meaning’ Wittgenstein means referent, something like\nFrege’s Bedeutung. Thus ‘\\(f\\)’ in\n“\\(f(t)\\)” does not refer to the same entity\nas the outermost \\(f\\) in\n“\\(f(f(t)\\)”; this is supposed to\nbe the basis of the solution to Russell’s paradox (¶3.333).\nIn particular ‘the father of’ in “the father of\nJohn”, means something different there compared to its outermost\noccurrence in “the father of the father of John”. There\ncan be no genuine iterated application of functions in other words, a\ncure for Russell’s paradox that many will find about as bad as\nthe disease.\n\nOperators, however, are to be distinguished from functions in\nat least that aspect: genuine iteration of operators—the\nsentential operators of propositional logic are a prime\nexample—is possible without supposing a change of sense or\nreference from one token to the other. What is their meaning or\nreferent then? Wittgenstein denies they have any referents, this is a\ngeneralisation of his claim that the logical constants are not\nrepresentatives. Peter Hylton (1997: 96–98) argues that\nWittgenstein in the Tractatus has Russellian propositional\nfunctions in mind when he talks of ‘functions’ and is\nat pains to distinguish operators from these “substantial”\nentities. Russellian propositional functions are not the same as\nordinary mathematical functions, the model for Frege’s notion of\nfunction. Rather they are structured entities, structurally related to\nthe propositions which are their values— gappy states of affairs\nmight be one way to think of them. Operators, by contrast, do not\nstand for any such entity, they are not parts nor any sort of\ningredients of propositions, they “leave no trace” in\nthem. \n\nSentential operators are conceived as mapping not signs, nor\ninscriptions, to other signs and ascriptions but rather propositions,\n(in Wittgenstein’s rather course-grained sense of the term) to\npropositions. On Wittgenstein’s account of proposition, repeated\napplication of an operation such as negation \\(\\ldots p,\n{\\sim}p, {\\sim}{\\sim}p\\ldots\\) may take one back to an earlier\npoint. Nonetheless Wittgenstein attempts to explicate arithmetic in\nterms of sentential operators applied to non-mathematical language.\n(One can see intimations here of Church’s later rigorous working\nout of a similar idea in his treatment of numbers in the lambda\ncalculus as functions which repeatedly apply input functions.) In\nslogan form, numbers are exponents of operations (ibid.,\n¶6.021). Thus where \\(\\Omega\\) is schematic for an operator and\n\\(\\Omega p\\) (or \\(\\Omega(p))\\) for its application to a\nproposition, then we can view the series\n\n\\[\np, \\Omega p, \\Omega \\Omega p, \\Omega \\Omega \\Omega p, \\Omega \\Omega \\Omega \\Omega p, \\ldots\n\\]\n\n\nas the starting point for a ‘definition’ of numbers, to be\nhad by rewriting it as\n\n\\[\n\\Omega^0 p, \\Omega^{0+1}p,\n\\Omega^{0+1+1}p,\n\\Omega^{0+1+1+1}p,\n\\Omega^{0+1+1+1+1}p,\\ldots.\n\\]\n\n\nHere, then, we have infinitely many schematic rewrite rules. Indices\nsuch as ‘\\(^{0+1+1+1+1}\\)’ can be abbreviated by\nnumerals in the obvious fashion, with\n‘\\(^{0+1+1+1+1}\\)’ being abbreviated ‘4’\nand so on.\n\nWittgenstein’s examples show (though he did not explicitly state\nthis) that addition of two number/exponents\n\\(\\Omega^{n}p + \\Omega^{m}p\\) (likewise\n\\(\\Omega^{n+m}p)\\) is given by the\nrule:\n\n\\[\n\\Omega^{n}p + \\Omega^m p \\Rightarrow \\Omega^{n}(\\Omega^m p)\n\\]\n\n\ntelling us we may replace the expression on the left in a formula by\nthe one on the right.\n\nThis is what underlies the ‘correctness’ of identities\nsuch \\(n + m = r\\) except that for Wittgenstein\nno such identity expresses a truth. On his account, the identity sign\ndisappears in a full analysis of language, wherein sameness and\ndistinction are shown by sameness and distinctness of names, no two of\nwhich refer, in fully analysed language, to the same object (this view\ngives grounds for interpreting mathematical utterances in the\nTractatus as unsinnig). Wittgenstein himself did not\ntrouble to show that abandonment of an identity sign would not cripple\nthe expressive power of language but others such as Hintikka (1956)\nand Wehmeier (2004) have done so. What is left in the underlying\nlanguage, with identity excised, are substitution rules\n(Tractatus ¶ 6.23).\n\nThese have to be interpreted in a general, and schematic, fashion.\nThus when we plug in \\({\\sim}\\) for \\(\\Omega\\), we find that (Wittgenstein had no\nintuitionist scruples here) a double application \\({\\sim}{\\sim}p\\) takes us\nback to (has the same sense as) \\(p\\). But this does not ground\nthe truth of \\(2 = 0\\), since for many other operations\n\\(\\Omega \\Omega p\\) is not equivalent to \\(p\\). On the other\nhand\n\n\\[\n\\Omega \\Omega(\\Omega \\Omega \\Omega p) \n  \\text{ always has the same sense as }\n  \\Omega \\Omega \\Omega(\\Omega \\Omega p)\n\\]\n\n\nWittgenstein implicitly assumes suitable rules for the interaction of\nbrackets with operators, in particular, generalised associativity. (In\nfact, he uses a mix of brackets and the notation\n\\(\\Omega 'p\\) to express \\(\\Omega(p)\\).)\n\nSince an equation \\(\\Omega^{n}p=\\Omega^{m}p\\) is, in its underlying\nlogical form, not a universal generalisation \\(\\forall n,m(\\Omega^{n}p\n= \\Omega^{m}p)\\) but a purely schematic generalisation, there is no\nform \\(\\exists n,m(\\Omega^{n}p \\ne \\Omega^{m}p)\\) with which we can\nexpress inequality, even if we can make sense of\n‘\\(\\ne\\)’. Nor can we express the inequality \\(n \\ne m\\)\nschematically as the holding of the inequivalence of \\(\\Omega^n p\\)\nfrom \\(\\Omega^m p\\) for every choice for \\(\\Omega\\).  Otherwise \\(2\n\\ne 0\\) would fail since \\({\\sim}{\\sim}p\\) is equivalent to\n\\(p\\). The Tractarian theory cannot handle inequalities.\n\nSo much for addition and the limitations of its account of that\noperation. What of multiplication? Wittgenstein does define it, at\n¶6.241, by:\n\n\n\\[\n\\Omega^{n\\times m}p \\Rightarrow (\\Omega^n)^m p\n\\]\n\n\nbut to grasp this as a general principle we need to know how to\ninterpret the notation \\((\\Omega^n)^m\\). In more conventional\nmathematics, one might simply define \\((x^n)^m\\) as\n\\(x^{n\\times m}\\) but clearly this (or rather the equivalent\nfor the interaction of exponents of operators) would introduce a\ncircularity into Wittgenstein’s account. Alternatively one could\nappeal to a recursive theory of exponents – \\(a^{m\\times 0}= a,\na^{m\\times(n+1)} = a^m + a^{m\\times n}\\). Since the principle of\ninduction needed to show that the recursion is coherent features\nnowhere in Wittgenstein’s system, these rules would presumably\nhave to be taken as primitive. \n\nOverall, then, Wittgenstein in the Tractatus gives us no\naccount of mathematics in general other than for a fragment of\narithmetic, basically positive identities involving only addition. And\nthere he denies that the sentences express propositions with truth\nvalues. Of course the book was written under extraordinarily difficult\ncircumstances. Perhaps his account could have been developed further\nand more plausibly, despite the difficulties noticed above—but\nfor some scepticism on that front, see Landini, 2007. Certainly\nWittgenstein made no attempt to do so whilst engaged with F.P. Ramsey\nand the Vienna Circle in the 1920s. If Wittgenstein’s standpoint\nwas not capable of much further development, we have the choice of\neither abandoning all of mathematics except, at most, a fragment of\nthe arithmetic of addition; or else of rejecting the\nTractarian account. One does not need to be slavishly\nuncritical of contemporary mathematics to see what the reasonable\noption is here. Admittedly, rejecting the Tractatus account\nis also the option Wittgenstein himself seems to adopt at the end of\nthe book; here then we enter the issue of what the point is of taking\nus through such a bizarre and unconvincing theory in order to throw it\naway at the end. (For a more positive appraisal of\nWittgenstein’s Tractarian position, see Floyd (2002).\n\n\nWittgenstein’s later work on philosophy of mathematics, such as\nthe Remarks on the Foundations of Mathematics 1956/1978), for\na long time attracted even less approval than the Tractarian\naccount, though recently philosophers such as Juliet Floyd and Hilary\nPutnam have come to its defence as an interesting and informed account\nof mathematics (Floyd/Putnam, 2000). Its themes include the rejection\nof the actual infinite (indeed the tendency in his writings is\nstrongly finitist); the denial that undecidable sentences are\nmeaningful; a rejection of Cantor’s powerset proof; the idea\nthat proof discovery changes the very meaning of the terms involved;\nand other very radical ideas. Among them we find a continued adherence\nto formalist motifs:\n\nIn mathematics everything is algorithm and nothing\nis meaning; (Philosophical Grammar: 468).\n\n\nAnother persistent theme in Wittgenstein’s thought is that the\nmeaning of mathematics resides entirely in its utility in\nnon-mathematical applications. But there is no systematic theory of\nhow this applicability comes about, no proof of a conservative\nextension theorem, for example, showing how application of\nmathematical calculi to empirical premisses will never lead us to\nderive an empirical conclusion which does not follow from those\npremisses. And there is no resolution of the problem of the\nmetatheory. On the other hand, we should observe that these notes of\nWittgenstein on the philosophy of mathematics were not published by\nhim, but by others after his death. For an overall view of\nWittgenstein’s philosophy of mathematics as a whole see\n Wittgenstein’s philosophy of mathematics.\n",
    "section_title": "3. Tractarian Formalism",
    "entry_title": "Formalism in the Philosophy of Mathematics",
    "hierarchy_title": "Formalism in the Philosophy of Mathematics || Tractarian Formalism",
    "tokenized_text": [
        "tractarian",
        "formalism",
        "tractarian",
        "formalism",
        "wittgenstein",
        "keen",
        "student",
        "frege",
        "work",
        "directed",
        "study",
        "bertrand",
        "russell",
        "frege",
        "course",
        "visit",
        "made",
        "see",
        "frege",
        "jena",
        "one",
        "might",
        "think",
        "inoculated",
        "formalism",
        "definite",
        "formalistic",
        "element",
        "surface",
        "wittgenstein",
        "tractatus",
        "true",
        "tractatus",
        "notoriously",
        "difficult",
        "work",
        "interpret",
        "even",
        "question",
        "whether",
        "main",
        "portion",
        "book",
        "essentially",
        "frame",
        "preface",
        "end",
        "taken",
        "serious",
        "attempt",
        "present",
        "metaphysics",
        "controversial",
        "leave",
        "hermeneutic",
        "controversy",
        "aside",
        "consider",
        "metaphysics",
        "offered",
        "u",
        "formalistic",
        "aspect",
        "one",
        "find",
        "twofold",
        "firstly",
        "mathematical",
        "sentence",
        "said",
        "express",
        "pseudopropositions",
        "devoid",
        "truth",
        "value",
        "contingent",
        "proposition",
        "truth",
        "value",
        "secondly",
        "mathematics",
        "described",
        "calculus",
        "used",
        "represent",
        "world",
        "whose",
        "value",
        "entirely",
        "instrumental",
        "sure",
        "explicit",
        "statement",
        "tractatus",
        "comment",
        "wittgenstein",
        "wrote",
        "ramsey",
        "copy",
        "fundamental",
        "idea",
        "math",
        "idea",
        "calculus",
        "represented",
        "idea",
        "operation",
        "beginning",
        "logic",
        "presupposes",
        "calculation",
        "number",
        "number",
        "fundamental",
        "idea",
        "calculus",
        "must",
        "introduced",
        "lewy",
        "tractatus",
        "proper",
        "get",
        "idea",
        "mathematical",
        "proposition",
        "mere",
        "instrument",
        "mathematics",
        "ideal",
        "fragment",
        "hilbert",
        "indeed",
        "real",
        "life",
        "mathematical",
        "proposition",
        "never",
        "want",
        "rather",
        "make",
        "use",
        "mathematical",
        "proposition",
        "inference",
        "proposition",
        "belong",
        "mathematics",
        "others",
        "likewise",
        "belong",
        "mathematics",
        "philosophy",
        "question",
        "actually",
        "use",
        "word",
        "proposition",
        "repeatedly",
        "lead",
        "valuable",
        "insight",
        "tractatus",
        "idea",
        "prefaced",
        "statement",
        "mathematics",
        "logical",
        "method",
        "proposition",
        "mathematics",
        "equation",
        "therefore",
        "pseudopropositions",
        "ibid",
        "proposition",
        "mathematics",
        "express",
        "thought",
        "ibid",
        "care",
        "must",
        "taken",
        "however",
        "wittgenstein",
        "distinguishes",
        "utterance",
        "sinnlos",
        "lack",
        "sense",
        "including",
        "logical",
        "tautology",
        "contradiction",
        "unsinnig",
        "nonsensical",
        "clear",
        "class",
        "mathematical",
        "utterance",
        "fall",
        "one",
        "might",
        "well",
        "think",
        "game",
        "formalist",
        "treat",
        "mathematical",
        "utterance",
        "view",
        "string",
        "meaningless",
        "mark",
        "unsinnig",
        "sinnlos",
        "one",
        "clear",
        "difference",
        "game",
        "formalism",
        "however",
        "wittgenstein",
        "mathematics",
        "conceived",
        "calculus",
        "separate",
        "us",
        "language",
        "rather",
        "attempt",
        "show",
        "part",
        "arithmetic",
        "least",
        "seen",
        "grounded",
        "nonmathematical",
        "us",
        "language",
        "frege",
        "contrast",
        "whilst",
        "arguing",
        "proper",
        "account",
        "arithmetic",
        "analysis",
        "show",
        "generality",
        "enables",
        "one",
        "give",
        "uniform",
        "account",
        "multifarious",
        "different",
        "application",
        "cf",
        "dummett",
        "chapter",
        "also",
        "argued",
        "strongly",
        "view",
        "mathematical",
        "utterance",
        "meaning",
        "independent",
        "conceptually",
        "prior",
        "use",
        "application",
        "wittgenstein",
        "attempt",
        "theory",
        "mathematics",
        "tractatus",
        "beyond",
        "arithmetic",
        "rather",
        "narrow",
        "fragment",
        "arithmetic",
        "theory",
        "clearly",
        "share",
        "antiplatonism",
        "game",
        "formalist",
        "number",
        "arithmetic",
        "construed",
        "calculus",
        "one",
        "manipulates",
        "exponent",
        "index",
        "operator",
        "operator",
        "wittgenstein",
        "distinguishes",
        "operator",
        "term",
        "function",
        "term",
        "commentator",
        "struggled",
        "explain",
        "distinction",
        "come",
        "clear",
        "wittgenstein",
        "held",
        "two",
        "occurrence",
        "function",
        "term",
        "f",
        "applied",
        "different",
        "string",
        "t",
        "u",
        "different",
        "meaning",
        "meaning",
        "wittgenstein",
        "mean",
        "referent",
        "something",
        "like",
        "frege",
        "bedeutung",
        "thus",
        "f",
        "f",
        "refer",
        "entity",
        "outermost",
        "f",
        "f",
        "f",
        "supposed",
        "basis",
        "solution",
        "russell",
        "paradox",
        "particular",
        "father",
        "father",
        "john",
        "mean",
        "something",
        "different",
        "compared",
        "outermost",
        "occurrence",
        "father",
        "father",
        "john",
        "genuine",
        "iterated",
        "application",
        "function",
        "word",
        "cure",
        "russell",
        "paradox",
        "many",
        "find",
        "bad",
        "disease",
        "operator",
        "however",
        "distinguished",
        "function",
        "least",
        "aspect",
        "genuine",
        "iteration",
        "operatorsthe",
        "sentential",
        "operator",
        "propositional",
        "logic",
        "prime",
        "exampleis",
        "possible",
        "without",
        "supposing",
        "change",
        "sense",
        "reference",
        "one",
        "token",
        "meaning",
        "referent",
        "wittgenstein",
        "denies",
        "referent",
        "generalisation",
        "claim",
        "logical",
        "constant",
        "representative",
        "peter",
        "hylton",
        "argues",
        "wittgenstein",
        "tractatus",
        "russellian",
        "propositional",
        "function",
        "mind",
        "talk",
        "function",
        "pain",
        "distinguish",
        "operator",
        "substantial",
        "entity",
        "russellian",
        "propositional",
        "function",
        "ordinary",
        "mathematical",
        "function",
        "model",
        "frege",
        "notion",
        "function",
        "rather",
        "structured",
        "entity",
        "structurally",
        "related",
        "proposition",
        "values",
        "gappy",
        "state",
        "affair",
        "might",
        "one",
        "way",
        "think",
        "operator",
        "contrast",
        "stand",
        "entity",
        "part",
        "sort",
        "ingredient",
        "proposition",
        "leave",
        "trace",
        "sentential",
        "operator",
        "conceived",
        "mapping",
        "sign",
        "inscription",
        "sign",
        "ascription",
        "rather",
        "proposition",
        "wittgenstein",
        "rather",
        "coursegrained",
        "sense",
        "term",
        "proposition",
        "wittgenstein",
        "account",
        "proposition",
        "repeated",
        "application",
        "operation",
        "negation",
        "ldots",
        "p",
        "sim",
        "p",
        "sim",
        "sim",
        "pldots",
        "may",
        "take",
        "one",
        "back",
        "earlier",
        "point",
        "nonetheless",
        "wittgenstein",
        "attempt",
        "explicate",
        "arithmetic",
        "term",
        "sentential",
        "operator",
        "applied",
        "nonmathematical",
        "language",
        "one",
        "see",
        "intimation",
        "church",
        "later",
        "rigorous",
        "working",
        "similar",
        "idea",
        "treatment",
        "number",
        "lambda",
        "calculus",
        "function",
        "repeatedly",
        "apply",
        "input",
        "function",
        "slogan",
        "form",
        "number",
        "exponent",
        "operation",
        "ibid",
        "thus",
        "omega",
        "schematic",
        "operator",
        "omega",
        "p",
        "omega",
        "p",
        "application",
        "proposition",
        "view",
        "series",
        "p",
        "omega",
        "p",
        "omega",
        "omega",
        "p",
        "omega",
        "omega",
        "omega",
        "p",
        "omega",
        "omega",
        "omega",
        "omega",
        "p",
        "ldots",
        "starting",
        "point",
        "definition",
        "number",
        "rewriting",
        "omega",
        "p",
        "omega",
        "p",
        "omega",
        "p",
        "omega",
        "p",
        "omega",
        "p",
        "ldots",
        "infinitely",
        "many",
        "schematic",
        "rewrite",
        "rule",
        "index",
        "abbreviated",
        "numeral",
        "obvious",
        "fashion",
        "abbreviated",
        "wittgenstein",
        "example",
        "show",
        "though",
        "explicitly",
        "state",
        "addition",
        "two",
        "numberexponents",
        "omega",
        "n",
        "p",
        "omega",
        "p",
        "likewise",
        "omega",
        "nm",
        "p",
        "given",
        "rule",
        "omega",
        "n",
        "p",
        "omegam",
        "p",
        "rightarrow",
        "omega",
        "n",
        "omegam",
        "p",
        "telling",
        "u",
        "may",
        "replace",
        "expression",
        "left",
        "formula",
        "one",
        "right",
        "underlies",
        "correctness",
        "identity",
        "n",
        "r",
        "except",
        "wittgenstein",
        "identity",
        "express",
        "truth",
        "account",
        "identity",
        "sign",
        "disappears",
        "full",
        "analysis",
        "language",
        "wherein",
        "sameness",
        "distinction",
        "shown",
        "sameness",
        "distinctness",
        "name",
        "two",
        "refer",
        "fully",
        "analysed",
        "language",
        "object",
        "view",
        "give",
        "ground",
        "interpreting",
        "mathematical",
        "utterance",
        "tractatus",
        "unsinnig",
        "wittgenstein",
        "trouble",
        "show",
        "abandonment",
        "identity",
        "sign",
        "would",
        "cripple",
        "expressive",
        "power",
        "language",
        "others",
        "hintikka",
        "wehmeier",
        "done",
        "left",
        "underlying",
        "language",
        "identity",
        "excised",
        "substitution",
        "rule",
        "tractatus",
        "interpreted",
        "general",
        "schematic",
        "fashion",
        "thus",
        "plug",
        "sim",
        "omega",
        "find",
        "wittgenstein",
        "intuitionist",
        "scruple",
        "double",
        "application",
        "sim",
        "sim",
        "p",
        "take",
        "u",
        "back",
        "sense",
        "p",
        "ground",
        "truth",
        "since",
        "many",
        "operation",
        "omega",
        "omega",
        "p",
        "equivalent",
        "p",
        "hand",
        "omega",
        "omega",
        "omega",
        "omega",
        "omega",
        "p",
        "text",
        "always",
        "sense",
        "omega",
        "omega",
        "omega",
        "omega",
        "omega",
        "p",
        "wittgenstein",
        "implicitly",
        "assumes",
        "suitable",
        "rule",
        "interaction",
        "bracket",
        "operator",
        "particular",
        "generalised",
        "associativity",
        "fact",
        "us",
        "mix",
        "bracket",
        "notation",
        "omega",
        "p",
        "express",
        "omega",
        "p",
        "since",
        "equation",
        "omega",
        "n",
        "pomega",
        "p",
        "underlying",
        "logical",
        "form",
        "universal",
        "generalisation",
        "forall",
        "n",
        "omega",
        "n",
        "p",
        "omega",
        "p",
        "purely",
        "schematic",
        "generalisation",
        "form",
        "exists",
        "n",
        "omega",
        "n",
        "p",
        "ne",
        "omega",
        "p",
        "express",
        "inequality",
        "even",
        "make",
        "sense",
        "ne",
        "express",
        "inequality",
        "n",
        "ne",
        "m",
        "schematically",
        "holding",
        "inequivalence",
        "omegan",
        "p",
        "omegam",
        "p",
        "every",
        "choice",
        "omega",
        "otherwise",
        "ne",
        "would",
        "fail",
        "since",
        "sim",
        "sim",
        "p",
        "equivalent",
        "p",
        "tractarian",
        "theory",
        "handle",
        "inequality",
        "much",
        "addition",
        "limitation",
        "account",
        "operation",
        "multiplication",
        "wittgenstein",
        "define",
        "omega",
        "ntimes",
        "p",
        "rightarrow",
        "omegan",
        "m",
        "p",
        "grasp",
        "general",
        "principle",
        "need",
        "know",
        "interpret",
        "notation",
        "omegan",
        "m",
        "conventional",
        "mathematics",
        "one",
        "might",
        "simply",
        "define",
        "xn",
        "m",
        "x",
        "ntimes",
        "clearly",
        "rather",
        "equivalent",
        "interaction",
        "exponent",
        "operator",
        "would",
        "introduce",
        "circularity",
        "wittgenstein",
        "account",
        "alternatively",
        "one",
        "could",
        "appeal",
        "recursive",
        "theory",
        "exponent",
        "a",
        "mtimes",
        "a",
        "mtimes",
        "n",
        "am",
        "a",
        "mtimes",
        "n",
        "since",
        "principle",
        "induction",
        "needed",
        "show",
        "recursion",
        "coherent",
        "feature",
        "nowhere",
        "wittgenstein",
        "system",
        "rule",
        "would",
        "presumably",
        "taken",
        "primitive",
        "overall",
        "wittgenstein",
        "tractatus",
        "give",
        "u",
        "account",
        "mathematics",
        "general",
        "fragment",
        "arithmetic",
        "basically",
        "positive",
        "identity",
        "involving",
        "addition",
        "denies",
        "sentence",
        "express",
        "proposition",
        "truth",
        "value",
        "course",
        "book",
        "written",
        "extraordinarily",
        "difficult",
        "circumstance",
        "perhaps",
        "account",
        "could",
        "developed",
        "plausibly",
        "despite",
        "difficulty",
        "noticed",
        "abovebut",
        "scepticism",
        "front",
        "see",
        "landini",
        "certainly",
        "wittgenstein",
        "made",
        "attempt",
        "whilst",
        "engaged",
        "fp",
        "ramsey",
        "vienna",
        "circle",
        "s",
        "wittgenstein",
        "standpoint",
        "capable",
        "much",
        "development",
        "choice",
        "either",
        "abandoning",
        "mathematics",
        "except",
        "fragment",
        "arithmetic",
        "addition",
        "else",
        "rejecting",
        "tractarian",
        "account",
        "one",
        "need",
        "slavishly",
        "uncritical",
        "contemporary",
        "mathematics",
        "see",
        "reasonable",
        "option",
        "admittedly",
        "rejecting",
        "tractatus",
        "account",
        "also",
        "option",
        "wittgenstein",
        "seems",
        "adopt",
        "end",
        "book",
        "enter",
        "issue",
        "point",
        "taking",
        "u",
        "bizarre",
        "unconvincing",
        "theory",
        "order",
        "throw",
        "away",
        "end",
        "positive",
        "appraisal",
        "wittgenstein",
        "tractarian",
        "position",
        "see",
        "floyd",
        "wittgenstein",
        "later",
        "work",
        "philosophy",
        "mathematics",
        "remark",
        "foundation",
        "mathematics",
        "long",
        "time",
        "attracted",
        "even",
        "le",
        "approval",
        "tractarian",
        "account",
        "though",
        "recently",
        "philosopher",
        "juliet",
        "floyd",
        "hilary",
        "putnam",
        "come",
        "defence",
        "interesting",
        "informed",
        "account",
        "mathematics",
        "floydputnam",
        "theme",
        "include",
        "rejection",
        "actual",
        "infinite",
        "indeed",
        "tendency",
        "writing",
        "strongly",
        "finitist",
        "denial",
        "undecidable",
        "sentence",
        "meaningful",
        "rejection",
        "cantor",
        "powerset",
        "proof",
        "idea",
        "proof",
        "discovery",
        "change",
        "meaning",
        "term",
        "involved",
        "radical",
        "idea",
        "among",
        "find",
        "continued",
        "adherence",
        "formalist",
        "motif",
        "mathematics",
        "everything",
        "algorithm",
        "nothing",
        "meaning",
        "philosophical",
        "grammar",
        "another",
        "persistent",
        "theme",
        "wittgenstein",
        "thought",
        "meaning",
        "mathematics",
        "resides",
        "entirely",
        "utility",
        "nonmathematical",
        "application",
        "systematic",
        "theory",
        "applicability",
        "come",
        "proof",
        "conservative",
        "extension",
        "theorem",
        "example",
        "showing",
        "application",
        "mathematical",
        "calculus",
        "empirical",
        "premiss",
        "never",
        "lead",
        "u",
        "derive",
        "empirical",
        "conclusion",
        "follow",
        "premiss",
        "resolution",
        "problem",
        "metatheory",
        "hand",
        "observe",
        "note",
        "wittgenstein",
        "philosophy",
        "mathematics",
        "published",
        "others",
        "death",
        "overall",
        "view",
        "wittgenstein",
        "philosophy",
        "mathematics",
        "whole",
        "see",
        "wittgenstein",
        "philosophy",
        "mathematics"
    ]
}