{
    "main_text": "Second Case Study: The Problem of Induction || The Principle of Indifference\n2.1 The Principle of Indifference\n\nIf you had to bet on a horserace without knowing anything about any of\nthe horses, which one would you bet on? It probably wouldn’t\nmatter to you: each horse is as likely to win as the others, so\nyou’d be indifferent between the available wagers. If there are\n3 horses in the race, each has a 1/3 chance of winning; if there are\n5, each has a 1/5 chance; etc. This kind of reasoning is common and is\noften attributed to the Principle of\n Indifference:[5]\n\nThe Principle of Indifference (PoI)\n\nGiven \\(n\\) mutually exclusive and jointly exhaustive possibilities,\nnone of which is favored over the others by the available evidence,\nthe probability of each is \\(1/n\\).\n\nPoI looks quite plausible at first, and may even have the flavor of a\nconceptual truth. How could one possibility be more probable than\nanother if the evidence doesn’t favor it? And yet, the PoI faces\na classic and recalcitrant challenge.\n\nConsider the first horse listed in the race, Athena. There are two\npossibilities, that she will win and that she will lose. Our evidence\n(or lack thereof) favors neither possibility, so the PoI says the\nprobability that she’ll win is \\(1/2\\). But suppose there are\nthree horses in the race: Athena, Beatrice, and Cecil. Since our\nevidence favors none of them over any other, the PoI requires that we\nassign probability \\(1/3\\) to each, which contradicts our earlier\nconclusion that Athena’s probability of winning is \\(1/2\\).\n\nThe source of the trouble is that possibilities can be subdivided into\nfurther subpossibilities. The possibility of Athena losing can be\nsubdivided into two subpossibilities, one where Beatrice wins and\nanother where Cecil wins. Because we lack any relevant evidence, the\navailable evidence doesn’t seem to favor the coarser\npossibilities over the finer subpossibilities, leading to\ncontradictory probability assignments. What we need, it seems, is some\nway of choosing a single, privileged way of dividing up the space of\npossibilities so that we can apply the PoI consistently.\n\nIt’s natural to think we should use the more fine-grained\ndivision of possibilities, the three-way division in the case of\nAthena, Beatrice, and Cecil. But we can actually divide things\nfurther—infinitely further in fact. For example, Athena might\nwin by a full length, by half a length, by a quarter of a length, etc.\nSo the possibility that she wins is actually infinitely divisible. We\ncan extend the PoI to handle such infinite divisions of possibilities\nin a natural way by saying that, if Athena wins, the probability that\nshe’ll win by between 1 and 2 lengths is twice the probability\nthat she’ll win by between \\(1/2\\) and 1 length. But the same\nproblem we were trying to solve still persists, in the form of the\nnotorious Bertrand paradox (Bertrand 2007 [1888]).\n\nThe paradox is nicely illustrated by the following example from van\nFraassen (1989). Suppose a factory cuts iron cubes with edge-lengths\nranging from \\(0\\) cm to 2 cm. What is the probability that the next\ncube to come off the line will have edges between \\(0\\) cm and 1 cm in\nlength? Without further information about how the factory goes about\nproducing cubes, the PoI would seem to say the probability is \\(1/2\\).\nThe range from \\(0\\) to 1 covers \\(1/2\\) the full range of\npossibilities from \\(0\\) to 2. But now consider this question: what is\nthe probability that the next cube to come off the line will have\nvolume between \\(0\\) cubic cm and 1 cubic cm? Here the PoI seems to\nsay the probability is \\(1/8\\). For the range from \\(0\\) to 1 covers\nonly \\(1/8\\) the full range of possible volumes from \\(0\\) to \\(8\\)\ncubic cm. So we have two different probabilities for equivalent\npropositions: a cube has edge-length between \\(0\\) and 1 cm if and\nonly if it has a volume between \\(0\\) cubic cm and 1 cubic cm. Once\nagain, the probabilities given by the PoI seem to depend on how we\ndescribe the range of possible outcomes. Described in terms of length,\nwe get one answer; described in terms of volume, we get another.\n\nImportantly, Bertrand’s paradox applies quite generally. Whether\nwe’re interested in the size of a cube, the distance by which a\nhorse will win, or any other parameter measured in real numbers, we\ncan always redescribe the space of possible outcomes so that the\nprobabilities assigned by the PoI come out differently. Even an\ninfinitely fine division of the space of possibilities doesn’t\nfix the problem: the probabilities assigned by the PoI still depend on\nhow we describe the space of possibilities.\n\nWe face essentially this problem when we frame the problem of\ninduction in probabilistic terms. Earlier we saw two competing ways of\nassigning prior probabilities to sequences of coin tosses. One way\ndivides the possible outcomes according to the exact sequence in which\n\\(\\mathsf{H}\\) and \\(\\mathsf{T}\\) occur. The PoI assigns each possible\nsequence a probability of \\(1/1024\\), with the result that the first 9\ntosses tell us nothing about the 10th toss. The second,\nCarnapian way instead divides the possible outcomes according to the\nnumber of \\(\\mathsf{T}\\)s, regardless of where they occur in the\nsequence. The PoI then assigns each possible number of \\(\\mathsf{T}\\)s\nthe same probability, \\(1/11\\). The result then is that the first 9\ntosses tell us a lot about the 10th toss: if the first 9\ntosses are tails, the 10th toss has a \\(10/11\\) chance of\ncoming up tails too.\n\nSo one way of applying the PoI leads to inductive skepticism, the\nother yields the inductive optimism that seems so indispensable to\nscience and daily life. If we could clarify how the PoI should be\napplied, and justify its use, we would have our answer to Hume’s\nproblem (or at least the first half—we still have to address the\nissue of using conditional probabilities as a guide to new,\nunconditional probabilities). Can it be clarified and justified?\n\nHere again we run up against one of the deepest and oldest divides in\nformal epistemology, that between subjectivists and objectivists. The\nsubjectivists hold that any assignment of probabilities is a\nlegitimate, reasonable way to start one’s inquiry. One need only\nconform to the three probability axioms to be reasonable. They take\nthis view largely because they despair of clarifying the PoI. They see\nno reason, for example, that we should follow Carnap in first dividing\naccording to the number of \\(\\mathsf{T}\\)s, and only then subdividing\naccording to where in sequence those \\(\\mathsf{T}\\)s appear. Closely\nrelated to this skepticism is a skepticism about the prospects for\njustifying the PoI, even once clarified, in a way that would put it on\na par with the three axioms of probability. We haven’t yet\ntouched on how the three axioms are supposed to be justified. But the\nclassic story is this: a family of\n theorems—Dutch book theorems (see entry)\n and\n representation theorems (see entry)—are\n taken to show that any deviation from the three axioms of probability\nleads to irrational decision-making. For example, if you deviate from\nthe axioms, you will accept a set of bets that is bound to lose money,\neven though you can see that losing money is inevitable a\npriori. These theorems don’t extend to violations of the\nPoI though, however it’s clarified. So subjectivists conclude\nthat violating the PoI is not irrational.\n\nSubjectivists aren’t thereby entirely helpless in the face of\nthe problem of induction, though. According to them, any initial\nassignment of probabilities is reasonable, including Carnap’s.\nSo if you do happen to start out with a Carnap-esque assignment, you\nwill be an inductive optimist, and reasonably so. It’s just that\nyou don’t have to start out that way. You could instead start\nout treating each possible sequence of \\(\\mathsf{H}\\)s and\n\\(\\mathsf{T}\\)s as equally probable, in which case you’ll end up\nan inductive skeptic. That’s reasonable too. According to\nsubjectivism, induction is perfectly rational, it just isn’t the\nonly rational way to reason.\n\nObjectivists hold instead that there’s just one way to assign\ninitial probabilities (though some allow a bit of flexibility (Maher\n1996)). These initial probabilities are given by the PoI, according to\northodox objectivism. As for the PoI’s conflicting probability\nassignments depending on how possibilities are divided up, some\nobjectivists propose restricting it to avoid these inconsistencies\n(Castell 1998). Others argue that it’s actually appropriate for\nprobability assignments to depend on the way possibilities are divvied\nup, since this reflects the language in which we conceive the\nsituation, and our language reflects knowledge we bring to the matter\n(Williamson 2007). Still others argue that the PoI’s assignments\ndon’t actually depend on the way possibilities are divided\nup—it’s just hard to tell sometimes when the evidence\nfavors one possibility over another (White 2009).\n\nWhat about justifying the PoI though? Subjectivists have traditionally\njustified the three axioms of probability by appeal to one of the\naforementioned theorems: the Dutch book theorem or some form of\nrepresentation theorem. But as we noted earlier, these theorems\ndon’t extend to the PoI.\n\nRecently, a different sort of justification has been gaining favor,\none that may extend to the PoI. Arguments that rely on Dutch book or\nrepresentation theorems have long been suspect because of their\npragmatic character. They aim to show that deviating from the\nprobability axioms leads to irrational choices, which seems to show at\nbest that obeying the probability axioms is part of pragmatic\nrationality, as opposed to epistemic irrationality. (But see\nChristensen (1996, 2001) and Vineberg (1997, 2001) for replies.)\nPreferring a more properly epistemic approach, Joyce (1998, 2009)\nargues that deviating from the probability axioms takes one\nunnecessarily far from the truth, no matter what the truth turns out\nto be. Pettigrew (2016) adapts this approach to the PoI, showing that\nviolations of the PoI increase one’s risk of being further from\nthe truth. (But see Carr (2017) for a critical perspective on this\ngeneral approach.)\n",
    "section_title": "2.1 The Principle of Indifference",
    "entry_title": "Formal Epistemology",
    "hierarchy_title": "Formal Epistemology || Second Case Study: The Problem of Induction || The Principle of Indifference",
    "tokenized_text": [
        "second",
        "case",
        "study",
        "problem",
        "induction",
        "principle",
        "indifference",
        "principle",
        "indifference",
        "bet",
        "horserace",
        "without",
        "knowing",
        "anything",
        "horse",
        "one",
        "would",
        "bet",
        "probably",
        "matter",
        "horse",
        "likely",
        "win",
        "others",
        "indifferent",
        "available",
        "wager",
        "horse",
        "race",
        "chance",
        "winning",
        "chance",
        "etc",
        "kind",
        "reasoning",
        "common",
        "often",
        "attributed",
        "principle",
        "indifference",
        "principle",
        "indifference",
        "poi",
        "given",
        "n",
        "mutually",
        "exclusive",
        "jointly",
        "exhaustive",
        "possibility",
        "none",
        "favored",
        "others",
        "available",
        "evidence",
        "probability",
        "n",
        "poi",
        "look",
        "quite",
        "plausible",
        "first",
        "may",
        "even",
        "flavor",
        "conceptual",
        "truth",
        "could",
        "one",
        "possibility",
        "probable",
        "another",
        "evidence",
        "favor",
        "yet",
        "poi",
        "face",
        "classic",
        "recalcitrant",
        "challenge",
        "consider",
        "first",
        "horse",
        "listed",
        "race",
        "athena",
        "two",
        "possibility",
        "win",
        "lose",
        "evidence",
        "lack",
        "thereof",
        "favor",
        "neither",
        "possibility",
        "poi",
        "say",
        "probability",
        "win",
        "suppose",
        "three",
        "horse",
        "race",
        "athena",
        "beatrice",
        "cecil",
        "since",
        "evidence",
        "favor",
        "none",
        "poi",
        "requires",
        "assign",
        "probability",
        "contradicts",
        "earlier",
        "conclusion",
        "athena",
        "probability",
        "winning",
        "source",
        "trouble",
        "possibility",
        "subdivided",
        "subpossibilities",
        "possibility",
        "athena",
        "losing",
        "subdivided",
        "two",
        "subpossibilities",
        "one",
        "beatrice",
        "win",
        "another",
        "cecil",
        "win",
        "lack",
        "relevant",
        "evidence",
        "available",
        "evidence",
        "seem",
        "favor",
        "coarser",
        "possibility",
        "finer",
        "subpossibilities",
        "leading",
        "contradictory",
        "probability",
        "assignment",
        "need",
        "seems",
        "way",
        "choosing",
        "single",
        "privileged",
        "way",
        "dividing",
        "space",
        "possibility",
        "apply",
        "poi",
        "consistently",
        "natural",
        "think",
        "use",
        "finegrained",
        "division",
        "possibility",
        "threeway",
        "division",
        "case",
        "athena",
        "beatrice",
        "cecil",
        "actually",
        "divide",
        "thing",
        "furtherinfinitely",
        "fact",
        "example",
        "athena",
        "might",
        "win",
        "full",
        "length",
        "half",
        "length",
        "quarter",
        "length",
        "etc",
        "possibility",
        "win",
        "actually",
        "infinitely",
        "divisible",
        "extend",
        "poi",
        "handle",
        "infinite",
        "division",
        "possibility",
        "natural",
        "way",
        "saying",
        "athena",
        "win",
        "probability",
        "win",
        "length",
        "twice",
        "probability",
        "win",
        "length",
        "problem",
        "trying",
        "solve",
        "still",
        "persists",
        "form",
        "notorious",
        "bertrand",
        "paradox",
        "bertrand",
        "paradox",
        "nicely",
        "illustrated",
        "following",
        "example",
        "van",
        "fraassen",
        "suppose",
        "factory",
        "cut",
        "iron",
        "cube",
        "edgelengths",
        "ranging",
        "cm",
        "cm",
        "probability",
        "next",
        "cube",
        "come",
        "line",
        "edge",
        "cm",
        "cm",
        "length",
        "without",
        "information",
        "factory",
        "go",
        "producing",
        "cube",
        "poi",
        "would",
        "seem",
        "say",
        "probability",
        "range",
        "cover",
        "full",
        "range",
        "possibility",
        "consider",
        "question",
        "probability",
        "next",
        "cube",
        "come",
        "line",
        "volume",
        "cubic",
        "cm",
        "cubic",
        "cm",
        "poi",
        "seems",
        "say",
        "probability",
        "range",
        "cover",
        "full",
        "range",
        "possible",
        "volume",
        "cubic",
        "cm",
        "two",
        "different",
        "probability",
        "equivalent",
        "proposition",
        "cube",
        "edgelength",
        "cm",
        "volume",
        "cubic",
        "cm",
        "cubic",
        "cm",
        "probability",
        "given",
        "poi",
        "seem",
        "depend",
        "describe",
        "range",
        "possible",
        "outcome",
        "described",
        "term",
        "length",
        "get",
        "one",
        "answer",
        "described",
        "term",
        "volume",
        "get",
        "another",
        "importantly",
        "bertrand",
        "paradox",
        "applies",
        "quite",
        "generally",
        "whether",
        "interested",
        "size",
        "cube",
        "distance",
        "horse",
        "win",
        "parameter",
        "measured",
        "real",
        "number",
        "always",
        "redescribe",
        "space",
        "possible",
        "outcome",
        "probability",
        "assigned",
        "poi",
        "come",
        "differently",
        "even",
        "infinitely",
        "fine",
        "division",
        "space",
        "possibility",
        "fix",
        "problem",
        "probability",
        "assigned",
        "poi",
        "still",
        "depend",
        "describe",
        "space",
        "possibility",
        "face",
        "essentially",
        "problem",
        "frame",
        "problem",
        "induction",
        "probabilistic",
        "term",
        "earlier",
        "saw",
        "two",
        "competing",
        "way",
        "assigning",
        "prior",
        "probability",
        "sequence",
        "coin",
        "toss",
        "one",
        "way",
        "divide",
        "possible",
        "outcome",
        "according",
        "exact",
        "sequence",
        "mathsf",
        "h",
        "mathsf",
        "occur",
        "poi",
        "assigns",
        "possible",
        "sequence",
        "probability",
        "result",
        "first",
        "toss",
        "tell",
        "u",
        "nothing",
        "th",
        "toss",
        "second",
        "carnapian",
        "way",
        "instead",
        "divide",
        "possible",
        "outcome",
        "according",
        "number",
        "mathsf",
        "regardless",
        "occur",
        "sequence",
        "poi",
        "assigns",
        "possible",
        "number",
        "mathsf",
        "probability",
        "result",
        "first",
        "toss",
        "tell",
        "u",
        "lot",
        "th",
        "toss",
        "first",
        "toss",
        "tail",
        "th",
        "toss",
        "chance",
        "coming",
        "tail",
        "one",
        "way",
        "applying",
        "poi",
        "lead",
        "inductive",
        "skepticism",
        "yield",
        "inductive",
        "optimism",
        "seems",
        "indispensable",
        "science",
        "daily",
        "life",
        "could",
        "clarify",
        "poi",
        "applied",
        "justify",
        "use",
        "would",
        "answer",
        "hume",
        "problem",
        "least",
        "first",
        "halfwe",
        "still",
        "address",
        "issue",
        "using",
        "conditional",
        "probability",
        "guide",
        "new",
        "unconditional",
        "probability",
        "clarified",
        "justified",
        "run",
        "one",
        "deepest",
        "oldest",
        "divide",
        "formal",
        "epistemology",
        "subjectivist",
        "objectivists",
        "subjectivist",
        "hold",
        "assignment",
        "probability",
        "legitimate",
        "reasonable",
        "way",
        "start",
        "one",
        "inquiry",
        "one",
        "need",
        "conform",
        "three",
        "probability",
        "axiom",
        "reasonable",
        "take",
        "view",
        "largely",
        "despair",
        "clarifying",
        "poi",
        "see",
        "reason",
        "example",
        "follow",
        "carnap",
        "first",
        "dividing",
        "according",
        "number",
        "mathsf",
        "subdividing",
        "according",
        "sequence",
        "mathsf",
        "appear",
        "closely",
        "related",
        "skepticism",
        "skepticism",
        "prospect",
        "justifying",
        "poi",
        "even",
        "clarified",
        "way",
        "would",
        "put",
        "par",
        "three",
        "axiom",
        "probability",
        "yet",
        "touched",
        "three",
        "axiom",
        "supposed",
        "justified",
        "classic",
        "story",
        "family",
        "theoremsdutch",
        "book",
        "theorem",
        "see",
        "entry",
        "representation",
        "theorem",
        "see",
        "entry",
        "are",
        "taken",
        "show",
        "deviation",
        "three",
        "axiom",
        "probability",
        "lead",
        "irrational",
        "decisionmaking",
        "example",
        "deviate",
        "axiom",
        "accept",
        "set",
        "bet",
        "bound",
        "lose",
        "money",
        "even",
        "though",
        "see",
        "losing",
        "money",
        "inevitable",
        "priori",
        "theorem",
        "extend",
        "violation",
        "poi",
        "though",
        "however",
        "clarified",
        "subjectivist",
        "conclude",
        "violating",
        "poi",
        "irrational",
        "subjectivist",
        "thereby",
        "entirely",
        "helpless",
        "face",
        "problem",
        "induction",
        "though",
        "according",
        "initial",
        "assignment",
        "probability",
        "reasonable",
        "including",
        "carnap",
        "happen",
        "start",
        "carnapesque",
        "assignment",
        "inductive",
        "optimist",
        "reasonably",
        "start",
        "way",
        "could",
        "instead",
        "start",
        "treating",
        "possible",
        "sequence",
        "mathsf",
        "h",
        "mathsf",
        "equally",
        "probable",
        "case",
        "end",
        "inductive",
        "skeptic",
        "reasonable",
        "according",
        "subjectivism",
        "induction",
        "perfectly",
        "rational",
        "rational",
        "way",
        "reason",
        "objectivists",
        "hold",
        "instead",
        "one",
        "way",
        "assign",
        "initial",
        "probability",
        "though",
        "allow",
        "bit",
        "flexibility",
        "maher",
        "initial",
        "probability",
        "given",
        "poi",
        "according",
        "orthodox",
        "objectivism",
        "poi",
        "conflicting",
        "probability",
        "assignment",
        "depending",
        "possibility",
        "divided",
        "objectivists",
        "propose",
        "restricting",
        "avoid",
        "inconsistency",
        "castell",
        "others",
        "argue",
        "actually",
        "appropriate",
        "probability",
        "assignment",
        "depend",
        "way",
        "possibility",
        "divvied",
        "since",
        "reflects",
        "language",
        "conceive",
        "situation",
        "language",
        "reflects",
        "knowledge",
        "bring",
        "matter",
        "williamson",
        "still",
        "others",
        "argue",
        "poi",
        "assignment",
        "actually",
        "depend",
        "way",
        "possibility",
        "divided",
        "upit",
        "hard",
        "tell",
        "sometimes",
        "evidence",
        "favor",
        "one",
        "possibility",
        "another",
        "white",
        "justifying",
        "poi",
        "though",
        "subjectivist",
        "traditionally",
        "justified",
        "three",
        "axiom",
        "probability",
        "appeal",
        "one",
        "aforementioned",
        "theorem",
        "dutch",
        "book",
        "theorem",
        "form",
        "representation",
        "theorem",
        "noted",
        "earlier",
        "theorem",
        "extend",
        "poi",
        "recently",
        "different",
        "sort",
        "justification",
        "gaining",
        "favor",
        "one",
        "may",
        "extend",
        "poi",
        "argument",
        "rely",
        "dutch",
        "book",
        "representation",
        "theorem",
        "long",
        "suspect",
        "pragmatic",
        "character",
        "aim",
        "show",
        "deviating",
        "probability",
        "axiom",
        "lead",
        "irrational",
        "choice",
        "seems",
        "show",
        "best",
        "obeying",
        "probability",
        "axiom",
        "part",
        "pragmatic",
        "rationality",
        "opposed",
        "epistemic",
        "irrationality",
        "see",
        "christensen",
        "vineberg",
        "reply",
        "preferring",
        "properly",
        "epistemic",
        "approach",
        "joyce",
        "argues",
        "deviating",
        "probability",
        "axiom",
        "take",
        "one",
        "unnecessarily",
        "far",
        "truth",
        "matter",
        "truth",
        "turn",
        "pettigrew",
        "adapts",
        "approach",
        "poi",
        "showing",
        "violation",
        "poi",
        "increase",
        "one",
        "risk",
        "truth",
        "see",
        "carr",
        "critical",
        "perspective",
        "general",
        "approach"
    ]
}