{
    "main_text": "The Epistemological Frame Problem\n3. The Epistemological Frame Problem\n\n\nLet's move on now to the frame problem as it has been re-interpreted\nby various philosophers. The first significant mention of the frame\nproblem in the philosophical literature was made by Dennett (1978,\n125). The puzzle, according to Dennett, is how “a cognitive\ncreature … with many beliefs about the world” can update\nthose beliefs when it performs an act so that they remain\n“roughly faithful to the world”? In The Modularity of\nMind, Fodor steps into a roboticist's shoes and, with the frame\nproblem in mind, asks much the same question: “How … does\nthe machine's program determine which beliefs the robot ought to\nre-evaluate given that it has embarked upon some or other course of\naction?” (Fodor 1983, 114).\n\n\nAt first sight, this question is only impressionistically related to\nthe logical problem exercising the AI researchers. In contrast to the\nAI researcher's problem, the philosopher's question isn't\nexpressed in\nthe context of formal logic, and doesn't specifically concern the\nnon-effects of actions. In a later essay, Dennett acknowledges the\nappropriation of the AI researchers' term (1987). Yet he goes on to\nreaffirm his conviction that, in the frame problem, AI has discovered\n“a new, deep epistemological problem—accessible in\nprinciple but unnoticed by generations of philosophers”.\n\n\nThe best way to gain an understanding of the issue is to imagine\nbeing the designer of a robot that has to carry out an everyday task,\nsuch as making a cup of tea. Moreover, for the frame problem\nto be neatly highlighted, we must confine our thought experiment to a\ncertain class of robot designs, namely those using explicitly\nstored, sentence-like representations of the world, reflecting the\nmethodological tenets of classical AI. The AI researchers\nwho tackled the original frame problem in its narrow, technical guise\nwere working under this constraint, since logic-based AI is a variety of\nclassical AI. Philosophers sympathetic to the\n computational theory of mind—who \nsuppose that mental states comprise sets of\npropositional attitudes and mental processes are forms of inference\nover the propositions in question—also tend to feel at home\nwith this prescription.\n\n\nNow, suppose the robot has to take a tea-cup from the cupboard. The\npresent location of the cup is represented as a sentence in its\ndatabase of facts alongside those representing innumerable other\nfeatures of the ongoing situation, such as the ambient temperature, the\nconfiguration of its arms, the current date, the colour of the tea-pot,\nand so on. Having grasped the cup and withdrawn it from the cupboard,\nthe robot needs to update this database. The location of the cup has\nclearly changed, so that's one fact that demands revision. But which\nother sentences require modification? The ambient temperature is\nunaffected. The location of the tea-pot is unaffected. But if it so\nhappens that a spoon was resting in the cup, then the spoon's new\nlocation, inherited from its container, must also be updated.\n\n\nThe epistemological difficulty now discerned by philosophers is this.\nHow could the robot limit the scope of the propositions\nit must reconsider in the light of its actions? \nIn a sufficiently simple robot, this doesn't seem like much of a\nproblem. Surely the robot can simply examine its entire database of\npropositions one-by-one and work out which require modification. But\nif we imagine that our robot has near human-level intelligence, and is\ntherefore burdened with an enormous database of facts to examine every\ntime it so much as spins a motor, such a strategy starts to look\ncomputationally intractable.\n\n\n\nThus,\na related issue in AI has been dubbed the computational aspect of\nthe frame problem (McDermott 1987). This is the question of how to compute\nthe consequences of an action without the computation having to range\nover the action's non-effects. The solution to the computational aspect\nof the frame problem adopted in most symbolic AI programs is some\nvariant of what McDermott calls the “sleeping dog” strategy\n(McDermott 1987). The idea here is that not every part of the data\nstructure representing an ongoing situation needs to be examined when\nit is updated to reflect a change in the world. Rather, those parts\nthat represent facets of the world that have changed are modified, and\nthe rest is simply left as it is (following the dictum “let\nsleeping dogs lie”).\nIn our example of the robot and the tea-cup, we might apply the\nsleeping dog strategy by having the robot update its beliefs about the\nlocation of the cup and the contents of the cupboard. But the robot\nwould not worry about some possible spoon that may or may not be on or\nin the cup, since the robot's goal did not directly involve any spoon.\n\n\n\n\nHowever, the philosophical problem is not exhausted by this\ncomputational issue. The outstanding philosophical question is how the\nrobot could ever determine that it had successfully revised all its\nbeliefs to match the consequences of its actions.  Only then would it\nbe in a position safely to apply the “common sense law of\ninertia” and assume the rest of the world is untouched.  Fodor\nsuggestively likens this to “Hamlet's problem: when to stop\nthinking” (Fodor 1987, 140). The frame problem, he claims, is\n“Hamlet's problem viewed from an engineer's perspective”.\nSo construed, the obvious way to try to avoid the frame problem is by\nappealing to the notion of relevance. Only certain properties\nof a situation are relevant in the context of any given action, so the\ncounter-argument goes, and consideration of the action's consequences\ncan be conveniently confined to those.\n\n\nHowever, the appeal to relevance is unhelpful. For the difficulty now\nis to determine what is and what isn't relevant, and this is dependent\non context. Consider again the action of removing a tea-cup from the\ncupboard. If the robot's job is to make tea, it is relevant that this\nfacilitates filling the cup from a tea-pot. But if the robot's task\nis to clean the cupboard, a more relevant consequence is the\nexposure of the surface the cup was resting on.\nAn AI researcher in the classical mould could rise to this challenge\nby attempting to specify what propositions are relevant to what context.\nBut philosophers such as Wheeler (2005; 2008), taking their cue from\nDreyfus (1992), perceive the threat of infinite regress here. As Dreyfus\nputs it, “if each context can be recognized only in terms of features\nselected as relevant and interpreted in a broader context, the AI worker\nis faced with a regress of contexts” (Dreyfus 1992, 289).\n\n\nOne way to mitigate the threat of infinite regress is by appeal to the\nfact that, while humans are more clever than today's robots,\nthey still make mistakes (McDermott 1987). People often fail to foresee\nevery consequence of their actions even though they lack none\nof the information required to derive those consequences, as any novice\nchess player can testify. Fodor asserts that “the frame problem\ngoes very deep; it goes as deep as the analysis of rationality”\n(Fodor 1987). But the analysis of rationality can accommodate the\nboundedness of the computational resources available to derive relevant\nconclusions (Simon 1957; Russell & Wefald 1991; Sperber &\nWilson 1996). Because it sometimes jumps to premature conclusions,\nbounded rationality is logically flawed, but no more so than human\nthinking.\nHowever, as Fodor points out, appealing to human limitations\nto justify the imposition of a heuristic boundary on the kind of\ninformation available to an inferential process does not in itself solve\nthe epistemological frame problem (Fodor 2000, Ch.2; Fodor 2008, Ch.4; see also Chow 2013).\nThis is because it neglects the issue\nof how the heuristic boundary is to be drawn, which is to say it\nfails to address the original question of how to specify what is and\nisn't relevant to the inferential process.\n\n\nNevertheless, the classical AI researcher, convinced that the regress of\ncontexts will bottom out eventually, may still elect to pursue the research\nagenda of building systems based on rules for determining relevance,\ndrawing inspiration from the past successes of classical AI.\nWhereupon the dissenting philosopher might point out that AI's past\nsuccesses have always been confined to narrow domains, such as playing chess,\nor reasoning in limited microworlds where the set of potentially relevant\npropositions is fixed and known in advance. By contrast, human intelligence\ncan cope with an open-ended, ever-changing set of contexts (Dreyfus 1992;\nDreyfus 2008; Wheeler 2005; Wheeler 2008; Rietveld 2012).\nFurthermore, the classical AI researcher is vulnerable to\nan argument from holism. A key claim in Fodor's work is that when it\ncomes to circumscribing the consequences of an action, just as in the business\nof theory confirmation in science, anything could be relevant (Fodor\n1983, 105). There are no a priori limits to the properties\nof the ongoing situation that might come into play. Accordingly, in his\nmodularity thesis, Fodor uses the frame problem to bolster the view\nthat the mind's central processes—those that are involved in\nfixing belief—are “informationally unencapsulated”,\nmeaning that they can draw on information from any source (Fodor 1983;\nFodor 2000; Fodor 2008; Dreyfus 1991, 115–121; Dreyfus 1992, 258).\nFor Fodor, this is a fundamental barrier to the provision of a\ncomputational account of these processes.\n\n\nIt is tempting to see Fodor's concerns as resting on a fallacious\nargument to the effect that a process must be informationally encapsulated\nto be computationally tractable. We only need to consider the\neffectiveness of Internet search engines to see that, thanks to clever\nindexing techniques, this is not the case. Submit any pair of seemingly\nunrelated keywords (such as “banana” and\n“mandolin”) to a Web search engine, and in a fraction of a\nsecond it will identify every web page, in a database of several\nbillion, that mentions those two keywords (now including this page, no\ndoubt). But this is not the issue at hand. The real issue, to reiterate\nthe point, is one of relevance. A process might indeed be able to index\ninto everything the system knows about, say, bananas and mandolins, but\nthe purported mystery is how it could ever work out that, of all things,\nbananas and mandolins were relevant to its reasoning task in the first\nplace.\n\n\nTo summarize, it is possible to discern an epistemological frame\nproblem, and to distinguish it from a computational counterpart. The\nepistemological problem is this: How is it possible for holistic,\nopen-ended, context-sensitive relevance to be captured by a set of\npropositional, language-like representations of the sort used in\nclassical AI?  The computational counterpart to the\nepistemological problem is this. How could an inference process\ntractably be confined to just what is relevant, given that relevance\nis holistic, open-ended, and context-sensitive?\n",
    "section_title": "3. The Epistemological Frame Problem",
    "entry_title": "The Frame Problem",
    "hierarchy_title": "The Frame Problem || The Epistemological Frame Problem",
    "tokenized_text": [
        "epistemological",
        "frame",
        "problem",
        "epistemological",
        "frame",
        "problem",
        "let",
        "s",
        "move",
        "frame",
        "problem",
        "reinterpreted",
        "various",
        "philosopher",
        "first",
        "significant",
        "mention",
        "frame",
        "problem",
        "philosophical",
        "literature",
        "made",
        "dennett",
        "puzzle",
        "according",
        "dennett",
        "cognitive",
        "creature",
        "many",
        "belief",
        "world",
        "update",
        "belief",
        "performs",
        "act",
        "remain",
        "roughly",
        "faithful",
        "world",
        "modularity",
        "mind",
        "fodor",
        "step",
        "roboticist",
        "s",
        "shoe",
        "frame",
        "problem",
        "mind",
        "asks",
        "much",
        "question",
        "machine",
        "s",
        "program",
        "determine",
        "belief",
        "robot",
        "ought",
        "reevaluate",
        "given",
        "embarked",
        "upon",
        "course",
        "action",
        "fodor",
        "first",
        "sight",
        "question",
        "impressionistically",
        "related",
        "logical",
        "problem",
        "exercising",
        "ai",
        "researcher",
        "contrast",
        "ai",
        "researcher",
        "s",
        "problem",
        "philosopher",
        "s",
        "question",
        "nt",
        "expressed",
        "context",
        "formal",
        "logic",
        "nt",
        "specifically",
        "concern",
        "noneffects",
        "action",
        "later",
        "essay",
        "dennett",
        "acknowledges",
        "appropriation",
        "ai",
        "researcher",
        "term",
        "yet",
        "go",
        "reaffirm",
        "conviction",
        "frame",
        "problem",
        "ai",
        "discovered",
        "new",
        "deep",
        "epistemological",
        "problemaccessible",
        "principle",
        "unnoticed",
        "generation",
        "philosopher",
        "best",
        "way",
        "gain",
        "understanding",
        "issue",
        "imagine",
        "designer",
        "robot",
        "carry",
        "everyday",
        "task",
        "making",
        "cup",
        "tea",
        "moreover",
        "frame",
        "problem",
        "neatly",
        "highlighted",
        "must",
        "confine",
        "thought",
        "experiment",
        "certain",
        "class",
        "robot",
        "design",
        "namely",
        "using",
        "explicitly",
        "stored",
        "sentencelike",
        "representation",
        "world",
        "reflecting",
        "methodological",
        "tenet",
        "classical",
        "ai",
        "ai",
        "researcher",
        "tackled",
        "original",
        "frame",
        "problem",
        "narrow",
        "technical",
        "guise",
        "working",
        "constraint",
        "since",
        "logicbased",
        "ai",
        "variety",
        "classical",
        "ai",
        "philosopher",
        "sympathetic",
        "computational",
        "theory",
        "mindwho",
        "suppose",
        "mental",
        "state",
        "comprise",
        "set",
        "propositional",
        "attitude",
        "mental",
        "process",
        "form",
        "inference",
        "proposition",
        "questionalso",
        "tend",
        "feel",
        "home",
        "prescription",
        "suppose",
        "robot",
        "take",
        "teacup",
        "cupboard",
        "present",
        "location",
        "cup",
        "represented",
        "sentence",
        "database",
        "fact",
        "alongside",
        "representing",
        "innumerable",
        "feature",
        "ongoing",
        "situation",
        "ambient",
        "temperature",
        "configuration",
        "arm",
        "current",
        "date",
        "colour",
        "teapot",
        "grasped",
        "cup",
        "withdrawn",
        "cupboard",
        "robot",
        "need",
        "update",
        "database",
        "location",
        "cup",
        "clearly",
        "changed",
        "s",
        "one",
        "fact",
        "demand",
        "revision",
        "sentence",
        "require",
        "modification",
        "ambient",
        "temperature",
        "unaffected",
        "location",
        "teapot",
        "unaffected",
        "happens",
        "spoon",
        "resting",
        "cup",
        "spoon",
        "s",
        "new",
        "location",
        "inherited",
        "container",
        "must",
        "also",
        "updated",
        "epistemological",
        "difficulty",
        "discerned",
        "philosopher",
        "could",
        "robot",
        "limit",
        "scope",
        "proposition",
        "must",
        "reconsider",
        "light",
        "action",
        "sufficiently",
        "simple",
        "robot",
        "nt",
        "seem",
        "like",
        "much",
        "problem",
        "surely",
        "robot",
        "simply",
        "examine",
        "entire",
        "database",
        "proposition",
        "onebyone",
        "work",
        "require",
        "modification",
        "imagine",
        "robot",
        "near",
        "humanlevel",
        "intelligence",
        "therefore",
        "burdened",
        "enormous",
        "database",
        "fact",
        "examine",
        "every",
        "time",
        "much",
        "spin",
        "motor",
        "strategy",
        "start",
        "look",
        "computationally",
        "intractable",
        "thus",
        "related",
        "issue",
        "ai",
        "dubbed",
        "computational",
        "aspect",
        "frame",
        "problem",
        "mcdermott",
        "question",
        "compute",
        "consequence",
        "action",
        "without",
        "computation",
        "range",
        "action",
        "s",
        "noneffects",
        "solution",
        "computational",
        "aspect",
        "frame",
        "problem",
        "adopted",
        "symbolic",
        "ai",
        "program",
        "variant",
        "mcdermott",
        "call",
        "sleeping",
        "dog",
        "strategy",
        "mcdermott",
        "idea",
        "every",
        "part",
        "data",
        "structure",
        "representing",
        "ongoing",
        "situation",
        "need",
        "examined",
        "updated",
        "reflect",
        "change",
        "world",
        "rather",
        "part",
        "represent",
        "facet",
        "world",
        "changed",
        "modified",
        "rest",
        "simply",
        "left",
        "following",
        "dictum",
        "let",
        "sleeping",
        "dog",
        "lie",
        "example",
        "robot",
        "teacup",
        "might",
        "apply",
        "sleeping",
        "dog",
        "strategy",
        "robot",
        "update",
        "belief",
        "location",
        "cup",
        "content",
        "cupboard",
        "robot",
        "would",
        "worry",
        "possible",
        "spoon",
        "may",
        "may",
        "cup",
        "since",
        "robot",
        "s",
        "goal",
        "directly",
        "involve",
        "spoon",
        "however",
        "philosophical",
        "problem",
        "exhausted",
        "computational",
        "issue",
        "outstanding",
        "philosophical",
        "question",
        "robot",
        "could",
        "ever",
        "determine",
        "successfully",
        "revised",
        "belief",
        "match",
        "consequence",
        "action",
        "would",
        "position",
        "safely",
        "apply",
        "common",
        "sense",
        "law",
        "inertia",
        "assume",
        "rest",
        "world",
        "untouched",
        "fodor",
        "suggestively",
        "likens",
        "hamlet",
        "s",
        "problem",
        "stop",
        "thinking",
        "fodor",
        "frame",
        "problem",
        "claim",
        "hamlet",
        "s",
        "problem",
        "viewed",
        "engineer",
        "s",
        "perspective",
        "construed",
        "obvious",
        "way",
        "try",
        "avoid",
        "frame",
        "problem",
        "appealing",
        "notion",
        "relevance",
        "certain",
        "property",
        "situation",
        "relevant",
        "context",
        "given",
        "action",
        "counterargument",
        "go",
        "consideration",
        "action",
        "s",
        "consequence",
        "conveniently",
        "confined",
        "however",
        "appeal",
        "relevance",
        "unhelpful",
        "difficulty",
        "determine",
        "nt",
        "relevant",
        "dependent",
        "context",
        "consider",
        "action",
        "removing",
        "teacup",
        "cupboard",
        "robot",
        "s",
        "job",
        "make",
        "tea",
        "relevant",
        "facilitates",
        "filling",
        "cup",
        "teapot",
        "robot",
        "s",
        "task",
        "clean",
        "cupboard",
        "relevant",
        "consequence",
        "exposure",
        "surface",
        "cup",
        "resting",
        "ai",
        "researcher",
        "classical",
        "mould",
        "could",
        "rise",
        "challenge",
        "attempting",
        "specify",
        "proposition",
        "relevant",
        "context",
        "philosopher",
        "wheeler",
        "taking",
        "cue",
        "dreyfus",
        "perceive",
        "threat",
        "infinite",
        "regress",
        "dreyfus",
        "put",
        "context",
        "recognized",
        "term",
        "feature",
        "selected",
        "relevant",
        "interpreted",
        "broader",
        "context",
        "ai",
        "worker",
        "faced",
        "regress",
        "context",
        "dreyfus",
        "one",
        "way",
        "mitigate",
        "threat",
        "infinite",
        "regress",
        "appeal",
        "fact",
        "human",
        "clever",
        "today",
        "s",
        "robot",
        "still",
        "make",
        "mistake",
        "mcdermott",
        "people",
        "often",
        "fail",
        "foresee",
        "every",
        "consequence",
        "action",
        "even",
        "though",
        "lack",
        "none",
        "information",
        "required",
        "derive",
        "consequence",
        "novice",
        "chess",
        "player",
        "testify",
        "fodor",
        "asserts",
        "frame",
        "problem",
        "go",
        "deep",
        "go",
        "deep",
        "analysis",
        "rationality",
        "fodor",
        "analysis",
        "rationality",
        "accommodate",
        "boundedness",
        "computational",
        "resource",
        "available",
        "derive",
        "relevant",
        "conclusion",
        "simon",
        "russell",
        "wefald",
        "sperber",
        "wilson",
        "sometimes",
        "jump",
        "premature",
        "conclusion",
        "bounded",
        "rationality",
        "logically",
        "flawed",
        "human",
        "thinking",
        "however",
        "fodor",
        "point",
        "appealing",
        "human",
        "limitation",
        "justify",
        "imposition",
        "heuristic",
        "boundary",
        "kind",
        "information",
        "available",
        "inferential",
        "process",
        "solve",
        "epistemological",
        "frame",
        "problem",
        "fodor",
        "ch",
        "fodor",
        "ch",
        "see",
        "also",
        "chow",
        "neglect",
        "issue",
        "heuristic",
        "boundary",
        "drawn",
        "say",
        "fails",
        "address",
        "original",
        "question",
        "specify",
        "nt",
        "relevant",
        "inferential",
        "process",
        "nevertheless",
        "classical",
        "ai",
        "researcher",
        "convinced",
        "regress",
        "context",
        "bottom",
        "eventually",
        "may",
        "still",
        "elect",
        "pursue",
        "research",
        "agenda",
        "building",
        "system",
        "based",
        "rule",
        "determining",
        "relevance",
        "drawing",
        "inspiration",
        "past",
        "success",
        "classical",
        "ai",
        "whereupon",
        "dissenting",
        "philosopher",
        "might",
        "point",
        "ai",
        "s",
        "past",
        "success",
        "always",
        "confined",
        "narrow",
        "domain",
        "playing",
        "chess",
        "reasoning",
        "limited",
        "microworlds",
        "set",
        "potentially",
        "relevant",
        "proposition",
        "fixed",
        "known",
        "advance",
        "contrast",
        "human",
        "intelligence",
        "cope",
        "openended",
        "everchanging",
        "set",
        "context",
        "dreyfus",
        "dreyfus",
        "wheeler",
        "wheeler",
        "rietveld",
        "furthermore",
        "classical",
        "ai",
        "researcher",
        "vulnerable",
        "argument",
        "holism",
        "key",
        "claim",
        "fodor",
        "s",
        "work",
        "come",
        "circumscribing",
        "consequence",
        "action",
        "business",
        "theory",
        "confirmation",
        "science",
        "anything",
        "could",
        "relevant",
        "fodor",
        "priori",
        "limit",
        "property",
        "ongoing",
        "situation",
        "might",
        "come",
        "play",
        "accordingly",
        "modularity",
        "thesis",
        "fodor",
        "us",
        "frame",
        "problem",
        "bolster",
        "view",
        "mind",
        "s",
        "central",
        "processesthose",
        "involved",
        "fixing",
        "beliefare",
        "informationally",
        "unencapsulated",
        "meaning",
        "draw",
        "information",
        "source",
        "fodor",
        "fodor",
        "fodor",
        "dreyfus",
        "dreyfus",
        "fodor",
        "fundamental",
        "barrier",
        "provision",
        "computational",
        "account",
        "process",
        "tempting",
        "see",
        "fodor",
        "s",
        "concern",
        "resting",
        "fallacious",
        "argument",
        "effect",
        "process",
        "must",
        "informationally",
        "encapsulated",
        "computationally",
        "tractable",
        "need",
        "consider",
        "effectiveness",
        "internet",
        "search",
        "engine",
        "see",
        "thanks",
        "clever",
        "indexing",
        "technique",
        "case",
        "submit",
        "pair",
        "seemingly",
        "unrelated",
        "keywords",
        "banana",
        "mandolin",
        "web",
        "search",
        "engine",
        "fraction",
        "second",
        "identify",
        "every",
        "web",
        "page",
        "database",
        "several",
        "billion",
        "mention",
        "two",
        "keywords",
        "including",
        "page",
        "doubt",
        "issue",
        "hand",
        "real",
        "issue",
        "reiterate",
        "point",
        "one",
        "relevance",
        "process",
        "might",
        "indeed",
        "able",
        "index",
        "everything",
        "system",
        "know",
        "say",
        "banana",
        "mandolin",
        "purported",
        "mystery",
        "could",
        "ever",
        "work",
        "thing",
        "banana",
        "mandolin",
        "relevant",
        "reasoning",
        "task",
        "first",
        "place",
        "summarize",
        "possible",
        "discern",
        "epistemological",
        "frame",
        "problem",
        "distinguish",
        "computational",
        "counterpart",
        "epistemological",
        "problem",
        "possible",
        "holistic",
        "openended",
        "contextsensitive",
        "relevance",
        "captured",
        "set",
        "propositional",
        "languagelike",
        "representation",
        "sort",
        "used",
        "classical",
        "ai",
        "computational",
        "counterpart",
        "epistemological",
        "problem",
        "could",
        "inference",
        "process",
        "tractably",
        "confined",
        "relevant",
        "given",
        "relevance",
        "holistic",
        "openended",
        "contextsensitive"
    ]
}