{
    "main_text": "The Wretched of the Earth\n4. The Wretched of the Earth\n\nWithout question, the 1961 publication of The Wretched of the\nEarth (Les damnés de la terre) changed\nFanon’s global profile as a thinker of anti-colonial struggle,\nrevolutionary action, and post-colonial statecraft and\nimagination.\n\nIn many ways, Wretched is a fulfillment of the short,\nsuggestive promissory notes on anti-colonial struggle found in the\nmany essays, editorials, and letters written in the time following\nBlack Skin, White Masks. Those occasional writings and major\nessays shift focus away from anti-Blackness as a core theme and toward\na broader sense of the effects of colonialism on the psyche, cultural\nformation, and political organization. That shift in focus allows\nFanon to think more broadly about the meaning and purpose of\nrevolutionary struggle.\n\nThe opening chapter to Wretched is surely the most famous, in\npart because of the sheer power and provocation of its reflections, in\npart because it is the focus of Jean-Paul Sartre’s well-known\nForeword. Fanon’s concern with violence is critical for\nunderstanding the trajectory of Wretched, which ambitiously\nmoves from political agitation to cultural formation to postcolonial\nstatecraft to global philosophical re-orientation. It all begins with\nviolence.\n\nViolence is important for Fanon as a precondition to liberation,\nsomething George Ciccariello-Maher in Decolonizing Dialectics\n(2017) links to a broader concern in Fanon with decolonizing\nmethodology and revolutionary praxis. Violence as precondition\noperates in two directions: internal to the colony among the\ncolonizers and external in the formative conflict between the\ncolonized and the colonizer. Internal to the colony, Fanon breaks the\ncolonized into three groups. First, there is the worker whose\nrelationship to both the colonized and colonizer is organized around\nits capacity to work. This is a complicated relationship, one\nthat is both a relation of dependency (material needs are supplied by\nthe colonial system) and naturally revolutionary (exploited, yet also\nthat upon which the colonizer depends). Second, there is the\ncolonized intellectual, a compromised figure who plays a\ncrucial role across the body of Wretched, whether in relation\nto cultural renewal or to political resistance. The colonized\nintellectual mediates the relation of the colonized for the colonizer,\ntranslating the terms of colonial life into the language, concepts,\nand thinkable politics of the colonial power. There is\npotential in the colonized intellectual, insofar as it is a\nfigure whose epistemological roots cross with the life of the\ncolonized masses, but any potential is compromised, if not outright\nobliterated by the role the intellectual plays: to aid and abet the\ncolonizer. Third, there is the lumpen proletariat, a term\nborrowed from Karl Marx’s analysis of the dialectic’s\nremainder and translated into the conditions of colonialism. The\ncolonial lumpen are disposable populations that provide nothing to the\ncolonial system (displaced people, slum dwellers, subsistence\nfarmers), and therefore, from the outside, remain the greatest threat\nto the system. In a certain sense, this is a formalization of\nFanon’s earlier reflections on the role of the fellah\nin colonial Algeria—the group lying outside the system of urban\ncolonial and anti-colonial struggle, a figure of purity and pure\nrevolutionary power.\n\nViolence emerges as a critical concept in this moment. Part of the\ncolonizer’s fantasy of power and control lies in a perception of\nweakness, of inferiority, that is inherent in the colonized. The\ncolonized are weak and therefore, in some fundamental sense, deserve\ntheir abject condition. This is consistent with Fanon’s\nreflection on the inferiority complex in Black Skin, White\nMasks, but writ large and as a characteristic of a population and\npeople. If the inferiority of the colonized is an assumption\nand psychological reality of colonial life, then\nrevolutionary violence cannot but be a shock to the entire system. The\ncolonizer is shocked into awareness of the humanity of the\ncolonized in the moment in which they are willing to risk their lives\nfor another future. The colonized are shocked into awareness of their\nown potential and, in that potential, find themselves capable for\nforming a wide cultural, social, and political identity. Identity\nformation is critical in Fanon’s analysis; colonialism is a\ntotal project, so the colonized find themselves adrift in abjection.\nBut violence changes all of that. Violence is simultaneously a saying\nof no to colonialism and a saying of yes to the\npossibilities of post-colonial life. The system cannot survive this\nshock. And so it means everything to the three classes of colonized\nlife. The workers see the system on which they are dependent begin to\ncollapse. Exploitation becomes a site of resistance, rather than\nsomething to be endured for the sake of material needs. The colonized\nintellectual is exposed as counter-revolutionary and a key element in\nthe oppressive system. And the lumpen find an identity for the first\ntime, moving from disposable excess to anti-colonialism’s most\npotent revolutionary force.\n\nViolence is therefore tasked with the greatest of pair of intertwined\ntasks: elimination of the colonial system at the level of imagination\n(how colonizer-colonized relations are naturalized as superiority and\ninferiority) and of material reality (exploitative relations of\nsubordination and extraction), as well as formation of cultural,\nsocial, and political identities. The first chapter of\nWretched outlines and amplifies this enormous potential of\nrevolutionary, anti-colonial violence, and the chapters that follow\nelaborate the complexities of post-colonial formations of culture and\npolitics.\n\nThe next three chapters explore in great detail how revolutionary\nviolence is related to collective identity formation (Chapter Two),\nconsciousness of national identity (Chapter Three), and perhaps most\nimportantly the formation of national culture (Chapter Four). What we\nsee across these chapters is how potent and fecund Fanon’s\nconception of violence is, as well as how his various meditations on\nrevolution and identity in the essays between his first and his last\nbook pay real conceptual and strategic dividends. Conceptually, Fanon\ndraws the sharpest contrast between what he calls the colonized\nintellectual and the revolutionary masses. The colonized intellectual\nis exactly what the terms suggests: a go-between who translates the\ncolonized for the colonizer, in the colonizer’s language and for\nthe political, social, and cultural purposes of the colonizer. The\nmasses do not drive the colonized intellectual’s reflections,\nbut rather the colonial vision of the world structures everything.\nContrasted to that are the revolutionary masses who make a\nnew political, social, and cultural order through\nrevolutionary struggle itself. In this characterization, Fanon eschews\nvanguardism and all the sorts of elite revolutionary structures that\nfollow from it. Rather, for Fanon, struggle itself generates\npolitical, social, and cultural identities and concepts; there is no\nprefiguring this element of a postcolonial world. Revolution makes\neverything revolutionary, and the postcolonial state cannot be thought\nwithout it. And so Fanon’s elaboration of this movement also\ncriticizes atavistic notions of postcolonial state- and culture-craft,\nrejecting nostalgic turns to a precolonial African society as a vision\nfor post-revolutionary society.\n\nIf the colonized intellectual and the precolonial forms of life are\nnot just insufficient for, but actually damaging to, postcolonial\nworld-making, then the future is a break with the past. Grievances\ncomposed of memories of historical violence (e.g., the Arab slave\ntrade in black Africa) or ethno-religious and other cultural disputes\ngive way to revolutionary action that dispenses with, rather than\ndraws on, memory. The break with the past, at the level of\norganization and intellectual formation, is made through revolutionary\nviolence. So too is the future. There is no pre-existing national\nconsciousness or national culture, no genius or visionary who\nconceives it ahead of time, which means that revolutionary violence\nmust be purposeful, intentional, and oriented toward world-making. In\nthis way, Fanon’s work on violence is never nihilistic or\nrandom. Strategically, this means everything because conceptions of\npolitics, culture, and the postcolonial social order hinge on the\nproper sense of violence.\n\nThe Wretched of the Earth concludes with one of Fanon’s\nmost provocative and exciting pieces, evoking in much the same way as\nthe conclusion to Black Skin, White Masks the possibility of\na new future. In 1961, the future is for Fanon the question of the\nfate of humanism, a motif he shares with, most notably,\nCésaire’s 1955 text Discourse on Colonialism.\nWhat is humanism, Fanon asks, if it is held up to the measure of the\nworld? That is, what does humanism look like if disentangled from the\nEuropean concept, which is riddled with histories of violence and\nsubjugation, and instead reflects or is infused with the liberation\nstruggles of the global South? In terms of conceiving the\npost-colonial nation, Fanon returns to one of his earliest motifs:\nmeasure. Post-colonial nations, created through anti-colonial\nviolence, cannot be duplications or imitations of European states. In\npart, this is a resolutely anti-colonial ideological position: make\nfor yourself, do not make for the colonizer. But it is also, if not\nlargely, based in a critique of Europe that understands Europe to be\nin crisis itself, to be dependent upon (at every level) structures of\nexploitation and extraction. Europe is a “spirit built on\nstrange foundations” and characterized by “stasis”.\n(1961 [2005: 237]) Post-colonial states need different foundations,\nand so must work with new concepts and new imaginations of\ncollectivity. Central to this are conceptions and imaginations of the\nhuman itself. “[W]e must make a new start”, Fanon writes,\n“develop a new way of thinking, and endeavor to create a new\nman”. (1961 [2005: 239]) Fanon does not give this “new\nman” content. The new man belongs to the future. The new man is\nto come.\n",
    "section_title": "4. The Wretched of the Earth",
    "entry_title": "Frantz Fanon",
    "hierarchy_title": "Frantz Fanon || The Wretched of the Earth",
    "tokenized_text": [
        "wretched",
        "earth",
        "wretched",
        "earth",
        "without",
        "question",
        "publication",
        "wretched",
        "earth",
        "le",
        "damnés",
        "de",
        "la",
        "terre",
        "changed",
        "fanon",
        "global",
        "profile",
        "thinker",
        "anticolonial",
        "struggle",
        "revolutionary",
        "action",
        "postcolonial",
        "statecraft",
        "imagination",
        "many",
        "way",
        "wretched",
        "fulfillment",
        "short",
        "suggestive",
        "promissory",
        "note",
        "anticolonial",
        "struggle",
        "found",
        "many",
        "essay",
        "editorial",
        "letter",
        "written",
        "time",
        "following",
        "black",
        "skin",
        "white",
        "mask",
        "occasional",
        "writing",
        "major",
        "essay",
        "shift",
        "focus",
        "away",
        "antiblackness",
        "core",
        "theme",
        "toward",
        "broader",
        "sense",
        "effect",
        "colonialism",
        "psyche",
        "cultural",
        "formation",
        "political",
        "organization",
        "shift",
        "focus",
        "allows",
        "fanon",
        "think",
        "broadly",
        "meaning",
        "purpose",
        "revolutionary",
        "struggle",
        "opening",
        "chapter",
        "wretched",
        "surely",
        "famous",
        "part",
        "sheer",
        "power",
        "provocation",
        "reflection",
        "part",
        "focus",
        "jeanpaul",
        "sartre",
        "wellknown",
        "foreword",
        "fanon",
        "concern",
        "violence",
        "critical",
        "understanding",
        "trajectory",
        "wretched",
        "ambitiously",
        "move",
        "political",
        "agitation",
        "cultural",
        "formation",
        "postcolonial",
        "statecraft",
        "global",
        "philosophical",
        "reorientation",
        "begin",
        "violence",
        "violence",
        "important",
        "fanon",
        "precondition",
        "liberation",
        "something",
        "george",
        "ciccariellomaher",
        "decolonizing",
        "dialectic",
        "link",
        "broader",
        "concern",
        "fanon",
        "decolonizing",
        "methodology",
        "revolutionary",
        "praxis",
        "violence",
        "precondition",
        "operates",
        "two",
        "direction",
        "internal",
        "colony",
        "among",
        "colonizer",
        "external",
        "formative",
        "conflict",
        "colonized",
        "colonizer",
        "internal",
        "colony",
        "fanon",
        "break",
        "colonized",
        "three",
        "group",
        "first",
        "worker",
        "whose",
        "relationship",
        "colonized",
        "colonizer",
        "organized",
        "around",
        "capacity",
        "work",
        "complicated",
        "relationship",
        "one",
        "relation",
        "dependency",
        "material",
        "need",
        "supplied",
        "colonial",
        "system",
        "naturally",
        "revolutionary",
        "exploited",
        "yet",
        "also",
        "upon",
        "colonizer",
        "depends",
        "second",
        "colonized",
        "intellectual",
        "compromised",
        "figure",
        "play",
        "crucial",
        "role",
        "across",
        "body",
        "wretched",
        "whether",
        "relation",
        "cultural",
        "renewal",
        "political",
        "resistance",
        "colonized",
        "intellectual",
        "mediates",
        "relation",
        "colonized",
        "colonizer",
        "translating",
        "term",
        "colonial",
        "life",
        "language",
        "concept",
        "thinkable",
        "politics",
        "colonial",
        "power",
        "potential",
        "colonized",
        "intellectual",
        "insofar",
        "figure",
        "whose",
        "epistemological",
        "root",
        "cross",
        "life",
        "colonized",
        "mass",
        "potential",
        "compromised",
        "outright",
        "obliterated",
        "role",
        "intellectual",
        "play",
        "aid",
        "abet",
        "colonizer",
        "third",
        "lumpen",
        "proletariat",
        "term",
        "borrowed",
        "karl",
        "marx",
        "analysis",
        "dialectic",
        "remainder",
        "translated",
        "condition",
        "colonialism",
        "colonial",
        "lumpen",
        "disposable",
        "population",
        "provide",
        "nothing",
        "colonial",
        "system",
        "displaced",
        "people",
        "slum",
        "dweller",
        "subsistence",
        "farmer",
        "therefore",
        "outside",
        "remain",
        "greatest",
        "threat",
        "system",
        "certain",
        "sense",
        "formalization",
        "fanon",
        "earlier",
        "reflection",
        "role",
        "fellah",
        "colonial",
        "algeriathe",
        "group",
        "lying",
        "outside",
        "system",
        "urban",
        "colonial",
        "anticolonial",
        "struggle",
        "figure",
        "purity",
        "pure",
        "revolutionary",
        "power",
        "violence",
        "emerges",
        "critical",
        "concept",
        "moment",
        "part",
        "colonizer",
        "fantasy",
        "power",
        "control",
        "lie",
        "perception",
        "weakness",
        "inferiority",
        "inherent",
        "colonized",
        "colonized",
        "weak",
        "therefore",
        "fundamental",
        "sense",
        "deserve",
        "abject",
        "condition",
        "consistent",
        "fanon",
        "reflection",
        "inferiority",
        "complex",
        "black",
        "skin",
        "white",
        "mask",
        "writ",
        "large",
        "characteristic",
        "population",
        "people",
        "inferiority",
        "colonized",
        "assumption",
        "psychological",
        "reality",
        "colonial",
        "life",
        "revolutionary",
        "violence",
        "shock",
        "entire",
        "system",
        "colonizer",
        "shocked",
        "awareness",
        "humanity",
        "colonized",
        "moment",
        "willing",
        "risk",
        "life",
        "another",
        "future",
        "colonized",
        "shocked",
        "awareness",
        "potential",
        "potential",
        "find",
        "capable",
        "forming",
        "wide",
        "cultural",
        "social",
        "political",
        "identity",
        "identity",
        "formation",
        "critical",
        "fanon",
        "analysis",
        "colonialism",
        "total",
        "project",
        "colonized",
        "find",
        "adrift",
        "abjection",
        "violence",
        "change",
        "violence",
        "simultaneously",
        "saying",
        "colonialism",
        "saying",
        "yes",
        "possibility",
        "postcolonial",
        "life",
        "system",
        "survive",
        "shock",
        "mean",
        "everything",
        "three",
        "class",
        "colonized",
        "life",
        "worker",
        "see",
        "system",
        "dependent",
        "begin",
        "collapse",
        "exploitation",
        "becomes",
        "site",
        "resistance",
        "rather",
        "something",
        "endured",
        "sake",
        "material",
        "need",
        "colonized",
        "intellectual",
        "exposed",
        "counterrevolutionary",
        "key",
        "element",
        "oppressive",
        "system",
        "lumpen",
        "find",
        "identity",
        "first",
        "time",
        "moving",
        "disposable",
        "excess",
        "anticolonialism",
        "potent",
        "revolutionary",
        "force",
        "violence",
        "therefore",
        "tasked",
        "greatest",
        "pair",
        "intertwined",
        "task",
        "elimination",
        "colonial",
        "system",
        "level",
        "imagination",
        "colonizercolonized",
        "relation",
        "naturalized",
        "superiority",
        "inferiority",
        "material",
        "reality",
        "exploitative",
        "relation",
        "subordination",
        "extraction",
        "well",
        "formation",
        "cultural",
        "social",
        "political",
        "identity",
        "first",
        "chapter",
        "wretched",
        "outline",
        "amplifies",
        "enormous",
        "potential",
        "revolutionary",
        "anticolonial",
        "violence",
        "chapter",
        "follow",
        "elaborate",
        "complexity",
        "postcolonial",
        "formation",
        "culture",
        "politics",
        "next",
        "three",
        "chapter",
        "explore",
        "great",
        "detail",
        "revolutionary",
        "violence",
        "related",
        "collective",
        "identity",
        "formation",
        "chapter",
        "two",
        "consciousness",
        "national",
        "identity",
        "chapter",
        "three",
        "perhaps",
        "importantly",
        "formation",
        "national",
        "culture",
        "chapter",
        "four",
        "see",
        "across",
        "chapter",
        "potent",
        "fecund",
        "fanon",
        "conception",
        "violence",
        "well",
        "various",
        "meditation",
        "revolution",
        "identity",
        "essay",
        "first",
        "last",
        "book",
        "pay",
        "real",
        "conceptual",
        "strategic",
        "dividend",
        "conceptually",
        "fanon",
        "draw",
        "sharpest",
        "contrast",
        "call",
        "colonized",
        "intellectual",
        "revolutionary",
        "mass",
        "colonized",
        "intellectual",
        "exactly",
        "term",
        "suggests",
        "gobetween",
        "translates",
        "colonized",
        "colonizer",
        "colonizer",
        "language",
        "political",
        "social",
        "cultural",
        "purpose",
        "colonizer",
        "mass",
        "drive",
        "colonized",
        "intellectual",
        "reflection",
        "rather",
        "colonial",
        "vision",
        "world",
        "structure",
        "everything",
        "contrasted",
        "revolutionary",
        "mass",
        "make",
        "new",
        "political",
        "social",
        "cultural",
        "order",
        "revolutionary",
        "struggle",
        "characterization",
        "fanon",
        "eschews",
        "vanguardism",
        "sort",
        "elite",
        "revolutionary",
        "structure",
        "follow",
        "rather",
        "fanon",
        "struggle",
        "generates",
        "political",
        "social",
        "cultural",
        "identity",
        "concept",
        "prefiguring",
        "element",
        "postcolonial",
        "world",
        "revolution",
        "make",
        "everything",
        "revolutionary",
        "postcolonial",
        "state",
        "thought",
        "without",
        "fanon",
        "elaboration",
        "movement",
        "also",
        "criticizes",
        "atavistic",
        "notion",
        "postcolonial",
        "state",
        "culturecraft",
        "rejecting",
        "nostalgic",
        "turn",
        "precolonial",
        "african",
        "society",
        "vision",
        "postrevolutionary",
        "society",
        "colonized",
        "intellectual",
        "precolonial",
        "form",
        "life",
        "insufficient",
        "actually",
        "damaging",
        "postcolonial",
        "worldmaking",
        "future",
        "break",
        "past",
        "grievance",
        "composed",
        "memory",
        "historical",
        "violence",
        "eg",
        "arab",
        "slave",
        "trade",
        "black",
        "africa",
        "ethnoreligious",
        "cultural",
        "dispute",
        "give",
        "way",
        "revolutionary",
        "action",
        "dispenses",
        "rather",
        "draw",
        "memory",
        "break",
        "past",
        "level",
        "organization",
        "intellectual",
        "formation",
        "made",
        "revolutionary",
        "violence",
        "future",
        "preexisting",
        "national",
        "consciousness",
        "national",
        "culture",
        "genius",
        "visionary",
        "conceives",
        "ahead",
        "time",
        "mean",
        "revolutionary",
        "violence",
        "must",
        "purposeful",
        "intentional",
        "oriented",
        "toward",
        "worldmaking",
        "way",
        "fanon",
        "work",
        "violence",
        "never",
        "nihilistic",
        "random",
        "strategically",
        "mean",
        "everything",
        "conception",
        "politics",
        "culture",
        "postcolonial",
        "social",
        "order",
        "hinge",
        "proper",
        "sense",
        "violence",
        "wretched",
        "earth",
        "concludes",
        "one",
        "fanon",
        "provocative",
        "exciting",
        "piece",
        "evoking",
        "much",
        "way",
        "conclusion",
        "black",
        "skin",
        "white",
        "mask",
        "possibility",
        "new",
        "future",
        "future",
        "fanon",
        "question",
        "fate",
        "humanism",
        "motif",
        "share",
        "notably",
        "césaire",
        "text",
        "discourse",
        "colonialism",
        "humanism",
        "fanon",
        "asks",
        "held",
        "measure",
        "world",
        "humanism",
        "look",
        "like",
        "disentangled",
        "european",
        "concept",
        "riddled",
        "history",
        "violence",
        "subjugation",
        "instead",
        "reflects",
        "infused",
        "liberation",
        "struggle",
        "global",
        "south",
        "term",
        "conceiving",
        "postcolonial",
        "nation",
        "fanon",
        "return",
        "one",
        "earliest",
        "motif",
        "measure",
        "postcolonial",
        "nation",
        "created",
        "anticolonial",
        "violence",
        "duplication",
        "imitation",
        "european",
        "state",
        "part",
        "resolutely",
        "anticolonial",
        "ideological",
        "position",
        "make",
        "make",
        "colonizer",
        "also",
        "largely",
        "based",
        "critique",
        "europe",
        "understands",
        "europe",
        "crisis",
        "dependent",
        "upon",
        "every",
        "level",
        "structure",
        "exploitation",
        "extraction",
        "europe",
        "spirit",
        "built",
        "strange",
        "foundation",
        "characterized",
        "stasis",
        "postcolonial",
        "state",
        "need",
        "different",
        "foundation",
        "must",
        "work",
        "new",
        "concept",
        "new",
        "imagination",
        "collectivity",
        "central",
        "conception",
        "imagination",
        "human",
        "w",
        "e",
        "must",
        "make",
        "new",
        "start",
        "fanon",
        "writes",
        "develop",
        "new",
        "way",
        "thinking",
        "endeavor",
        "create",
        "new",
        "man",
        "fanon",
        "give",
        "new",
        "man",
        "content",
        "new",
        "man",
        "belongs",
        "future",
        "new",
        "man",
        "come"
    ]
}