{
    "main_text": "Philosophical Theology\n2. Philosophical Theology\n\n\nMarchia’s main and most popular writing, larger than all his other\nworks combined, is the Sentences commentary. Although this\ngenre of scholastic writing contains much material that we would call\npure science, especially in Marchia’s case (see\n Natural Philosophy\n below), it is primarily a vehicle for philosophical\ntheology. Here it must be stressed at the outset that Francis of\nMarchia was not a faithful Scotist, contrary to a\ncommon opinion based on misconceptions from early in the twentieth\ncentury. Most recent research has proven that Marchia generally\nrejected or severely modified John Duns Scotus’s doctrines, rather than\nfollowed them, even in the specific contexts like Trinitarian theology\nwhere he was claimed to have been a loyal Scotist (Friedman 1999). For\nexample, Marchia was uncomfortable with Scotus’s stress on and use of a\nstrong distinction between the divine intellect and will, and this led\nMarchia to oppose Scotus on issues such as the procession of the Holy\nSpirit and the mechanism of divine foreknowledge. Indeed, it seems that\nMarchia was perhaps less of a Scotist than any of the other continental\nFranciscans active between Peter Auriol and the Black Death.\nNevertheless, Scotus forms much of the backdrop for Marchia’s theology.\nThe other thinker against whose theories Marchia often developed his\nown doctrine was Auriol, whose Sentences commentary Marchia\nappears to have known in a Reportatio version. \n\n\nThe completed critical edition of just one redaction of Marchia’s Sentences\ncommentary will take up about a dozen volumes. It is\nroughly equal in size to that of his contemporary and confrère\nLandulph Caracciolo. Whereas Caracciolo’s commentary is frequently a\ndisjointed, point-by-point refutation of Peter Auriol and defense of\nScotus on many issues, however, Marchia was more selective in choosing\nhis topics, more independent in giving his determination, and generally\nmore eloquent. For example, Marchia asks only one brief question on the\nImmaculate Conception, a favorite Franciscan topic (book III, q. 8; Duba 2004), showing himself to\nsupport the immaculatist position, but he asks a great number of\nquestions in books I, II, and IV on the relationship between the will\nand intellect.\n\n\nThus, although Auriol’s controversial opinions on epistemology and\ndivine foreknowledge drew fire from Caracciolo and most other Paris\ntheologians up to Gregory of Rimini’s day, even from Oxford\nFranciscans, Marchia devoted much energy to foreknowledge but almost\nignored the great debate over intuitive and abstractive cognition.\nAside from an isolated mention of “intuitive cognition” in\nScriptum I, d. 3, q. 4, and of “intuitive vision” in the very\nlast question in book IV, Marchia merely discusses the problem in\npassing on two brief occasions: first, in book II, q. 25 (Marchia\n1997, p. 322), while treating angelic knowledge, and second, in book\nIII, q. 13, in the context of the beatific vision of the Word (Duba\n2003–04). In the latter case, the more substantial passage, he gives a\nsomewhat Scotistic definition: “Intuitive and abstractive cognition\nare not distinguished according to having a species or not, but only\naccording to the disposition of the object, because if the object is\npresent, the species represents it intuitively; if absent, it\nrepresents it abstractively.” Therefore, “the same species that is\nintuitive in the presence of the object is abstractive in the absence\nof the object.” Marchia adds in agreement with Auriol that God “can\ncause the act of seeing without the object,” and that a species of a\ncreated object “indifferently represents” a present or absent object.\nAlthough this might provoke some epistemological questions, Marchia\nturns to the vision of the Essence and leaves human cognition in\nvia aside.\n\n\nIn contrast, Marchia singled out divine foreknowledge for special\ntreatment, devoting three entire distinctions (Scriptum I, dd.\n35, 36, and 38) to the issue and concentrating most of his discussion\non the reconciliation of foreknowledge with human free will (Marchia\n1999, 2000; Schabel 2000). Here Marchia was opposed in some way to\njust about everyone else who had written on the issue, but mainly\nAuriol, who had claimed that any determination prior to the coming\nabout of a contingent event destroyed contingency, including the truth\nor falsity of future-contingent propositions. Marchia’s defense of the\napplication of the Principle of Bivalence to propositions about the\ncontingent future was the model for Gregory of Rimini. But having shown\nthat such propositions are either determinately true or false, Marchia\nwent on to articulate a type of prior determination that saved\nforeknowledge while preserving contingency. In fact, according to\nMarchia, there must be some determination in the causes of\nfuture contingent events prior to their actual occurrence; otherwise\nnothing would occur:\nAnd I ask about that determination in the cause, was it in\nthe cause before the placing of the effect [into reality] or not? If it\nwas, then I have my point. If not, I ask, how is the effect determined\nin its cause before it is put into being, necessarily or contingently?\nIf necessarily, then it comes about necessarily, according to this\nopinion. If contingently and a contingent is not determined to one side\nin its cause, then that determination is not determined except through\nsome prior contingent determination. And I would ask of this just as\nbefore, will it go on infinitely, or is it necessary to stop at some\ncontingent determination in the cause before the effect? (d. 35:\nMarchia 1999, p. 75)\n\n Marchia, however, was aware that Auriol had claimed that any such prior\ndetermination was fatal for contingency, so Marchia draws a distinction\nbetween different indeterminations and determinations, perhaps\nexpanding on isolated remarks made by Scotus. There is (1) an\nindetermination ‘about the possible’ (de\npossibili), with respect to being able to act and being able not\nto act. With this indetermination, we are not determined\nde possibili before an event, so we are free and act\ncontingently and not necessarily. There is also (2) a posterior\nindetermination ‘about inhering’ (de inesse), with\nrespect to what will be the case in reality. This indetermination\ntoward what will inhere in reality, however, would be an\nobstacle to foreknowledge and, for us, to acting. Thus it must\nbe replaced by (3) a determination in the contingent cause toward\nacting, both for the future to be known and for us to act. The (4)\ndetermination de possibili, toward being able to act or being\nable not to act, is absent from free causes until the event occurs, at\nwhich time our freedom and power with respect to that event are\nremoved. \n\n\nAn obvious objection is that, for Marchia, the effect is determinate\nin the cause before the action of the cause, and thus that\ndetermination is ‘presupposed’ in the subsequent action of\nthe cause. Since it is ‘presupposed’, that determination is\nnot in the cause’s power, and thus is not contingent. Marchia replies\nwith another distinction:\n‘Action’ can be taken in three ways: either it\ncan be taken actually, namely when an agent is actually acting; or it\ncan be taken virtually, when an agent can act although he is not\nacting; or it can be taken in a middle way, not purely actually nor\npurely virtually, but in a middle way as ‘dispositionally’\nor ‘aptitudinally’, namely when an agent is not acting but\nis determined toward acting, although in actuality he is not acting\n— and he not only can act, but is determined to be acting later.\nSimilarly there is a threefold ‘determination’ of the\nagent: one actual, by which an agent actually determinately puts one\npart of a contradiction into effect; a second is a potential\ndetermination by which an agent posits or can determine any part of a\ncontradiction dividedly; the other is, as it were, a\n‘dispositional’ or ‘aptitudinal’ determination,\nby which an agent is determined with respect to the future to putting\none part of a contradiction [into effect]. Each determination\npresupposes the action corresponding to it, because an actual\ndetermination follows the action in actuality; the dispositional\ndetermination follows the action dispositionally, although it precedes\nthe actual action; the potential determination follows the potential\naction, although it precedes that actual and dispositional action. (d.\n35: Marchia 1999, pp. 89–90)\n\n Thus when an agent is determined de inesse to doing\nsomething in the future, that determination is like a disposition, and\nneither actual, because the event has not yet occurred, nor potential,\nbecause the possibility to do otherwise is not removed. Such a\ndetermination is not ‘actually’ in the agent’s power,\nMarchia grants, but it is in his power ‘dispositionally’,\nfor although the agent cannot act before he acts, he can be disposed\nto act so that he will in fact act.\n\n\nThe foregoing example is representative of Marchia’s thought in many\nways. He frequently draws clever and original distinctions, and the\nde possibili/de inesse division is employed in other contexts\nsuch as predestination (book I, d. 40: Marchia 2001b; see also Duba 2012). He makes\nsimilar innovative distinctions when discussing the different types of\nhuman and divine willing, where his voluntarist opinions are quite\ninteresting (Reportatio I, dd. 45–48: see the\ncritical edition cited below; Alliney 2006b; Robiglio\n2006). Although one could argue about the cogency of Marchia’s\narguments, in the case of the de possibili/de inesse\ndistinction Marchia found a favorable response among the following,\nwho adopted the device: his Franciscan successors at Paris in the next\ndecade Aufredo Gonteri Brito, William Rubio, and William of Brienne;\nthe Augustinian Hermits Michael of Massa and Gregory of Rimini; the\narts master John the Canon; and, in the later fifteenth century,\nFernando of Cordoba and Francesco della Rovere, who was to become Pope\nSixtus IV. Thus in philosophical theology one could and often did look\nto Marchia for an alternative to Scotus and an innovative response to\nAuriol.\n",
    "section_title": "2. Philosophical Theology",
    "entry_title": "Francis of Marchia",
    "hierarchy_title": "Francis of Marchia || Philosophical Theology",
    "tokenized_text": [
        "philosophical",
        "theology",
        "philosophical",
        "theology",
        "marchia",
        "main",
        "popular",
        "writing",
        "larger",
        "work",
        "combined",
        "sentence",
        "commentary",
        "although",
        "genre",
        "scholastic",
        "writing",
        "contains",
        "much",
        "material",
        "would",
        "call",
        "pure",
        "science",
        "especially",
        "marchia",
        "case",
        "see",
        "natural",
        "philosophy",
        "primarily",
        "vehicle",
        "philosophical",
        "theology",
        "must",
        "stressed",
        "outset",
        "francis",
        "marchia",
        "faithful",
        "scotist",
        "contrary",
        "common",
        "opinion",
        "based",
        "misconception",
        "early",
        "twentieth",
        "century",
        "recent",
        "research",
        "proven",
        "marchia",
        "generally",
        "rejected",
        "severely",
        "modified",
        "john",
        "dun",
        "scotus",
        "doctrine",
        "rather",
        "followed",
        "even",
        "specific",
        "context",
        "like",
        "trinitarian",
        "theology",
        "claimed",
        "loyal",
        "scotist",
        "friedman",
        "example",
        "marchia",
        "uncomfortable",
        "scotus",
        "stress",
        "use",
        "strong",
        "distinction",
        "divine",
        "intellect",
        "led",
        "marchia",
        "oppose",
        "scotus",
        "issue",
        "procession",
        "holy",
        "spirit",
        "mechanism",
        "divine",
        "foreknowledge",
        "indeed",
        "seems",
        "marchia",
        "perhaps",
        "le",
        "scotist",
        "continental",
        "franciscan",
        "active",
        "peter",
        "auriol",
        "black",
        "death",
        "nevertheless",
        "scotus",
        "form",
        "much",
        "backdrop",
        "marchia",
        "theology",
        "thinker",
        "whose",
        "theory",
        "marchia",
        "often",
        "developed",
        "doctrine",
        "auriol",
        "whose",
        "sentence",
        "commentary",
        "marchia",
        "appears",
        "known",
        "reportatio",
        "version",
        "completed",
        "critical",
        "edition",
        "one",
        "redaction",
        "marchia",
        "sentence",
        "commentary",
        "take",
        "dozen",
        "volume",
        "roughly",
        "equal",
        "size",
        "contemporary",
        "confrère",
        "landulph",
        "caracciolo",
        "whereas",
        "caracciolo",
        "commentary",
        "frequently",
        "disjointed",
        "pointbypoint",
        "refutation",
        "peter",
        "auriol",
        "defense",
        "scotus",
        "many",
        "issue",
        "however",
        "marchia",
        "selective",
        "choosing",
        "topic",
        "independent",
        "giving",
        "determination",
        "generally",
        "eloquent",
        "example",
        "marchia",
        "asks",
        "one",
        "brief",
        "question",
        "immaculate",
        "conception",
        "favorite",
        "franciscan",
        "topic",
        "book",
        "iii",
        "q",
        "duba",
        "showing",
        "support",
        "immaculatist",
        "position",
        "asks",
        "great",
        "number",
        "question",
        "book",
        "ii",
        "iv",
        "relationship",
        "intellect",
        "thus",
        "although",
        "auriol",
        "controversial",
        "opinion",
        "epistemology",
        "divine",
        "foreknowledge",
        "drew",
        "fire",
        "caracciolo",
        "paris",
        "theologian",
        "gregory",
        "rimini",
        "day",
        "even",
        "oxford",
        "franciscan",
        "marchia",
        "devoted",
        "much",
        "energy",
        "foreknowledge",
        "almost",
        "ignored",
        "great",
        "debate",
        "intuitive",
        "abstractive",
        "cognition",
        "aside",
        "isolated",
        "mention",
        "intuitive",
        "cognition",
        "scriptum",
        "d",
        "q",
        "intuitive",
        "vision",
        "last",
        "question",
        "book",
        "iv",
        "marchia",
        "merely",
        "discus",
        "problem",
        "passing",
        "two",
        "brief",
        "occasion",
        "first",
        "book",
        "ii",
        "q",
        "marchia",
        "p",
        "treating",
        "angelic",
        "knowledge",
        "second",
        "book",
        "iii",
        "q",
        "context",
        "beatific",
        "vision",
        "word",
        "duba",
        "latter",
        "case",
        "substantial",
        "passage",
        "give",
        "somewhat",
        "scotistic",
        "definition",
        "intuitive",
        "abstractive",
        "cognition",
        "distinguished",
        "according",
        "specie",
        "according",
        "disposition",
        "object",
        "object",
        "present",
        "specie",
        "represents",
        "intuitively",
        "absent",
        "represents",
        "abstractively",
        "therefore",
        "specie",
        "intuitive",
        "presence",
        "object",
        "abstractive",
        "absence",
        "object",
        "marchia",
        "add",
        "agreement",
        "auriol",
        "god",
        "cause",
        "act",
        "seeing",
        "without",
        "object",
        "specie",
        "created",
        "object",
        "indifferently",
        "represents",
        "present",
        "absent",
        "object",
        "although",
        "might",
        "provoke",
        "epistemological",
        "question",
        "marchia",
        "turn",
        "vision",
        "essence",
        "leaf",
        "human",
        "cognition",
        "via",
        "aside",
        "contrast",
        "marchia",
        "singled",
        "divine",
        "foreknowledge",
        "special",
        "treatment",
        "devoting",
        "three",
        "entire",
        "distinction",
        "scriptum",
        "dd",
        "issue",
        "concentrating",
        "discussion",
        "reconciliation",
        "foreknowledge",
        "human",
        "free",
        "marchia",
        "schabel",
        "marchia",
        "opposed",
        "way",
        "everyone",
        "else",
        "written",
        "issue",
        "mainly",
        "auriol",
        "claimed",
        "determination",
        "prior",
        "coming",
        "contingent",
        "event",
        "destroyed",
        "contingency",
        "including",
        "truth",
        "falsity",
        "futurecontingent",
        "proposition",
        "marchia",
        "defense",
        "application",
        "principle",
        "bivalence",
        "proposition",
        "contingent",
        "future",
        "model",
        "gregory",
        "rimini",
        "shown",
        "proposition",
        "either",
        "determinately",
        "true",
        "false",
        "marchia",
        "went",
        "articulate",
        "type",
        "prior",
        "determination",
        "saved",
        "foreknowledge",
        "preserving",
        "contingency",
        "fact",
        "according",
        "marchia",
        "must",
        "determination",
        "cause",
        "future",
        "contingent",
        "event",
        "prior",
        "actual",
        "occurrence",
        "otherwise",
        "nothing",
        "would",
        "occur",
        "ask",
        "determination",
        "cause",
        "cause",
        "placing",
        "effect",
        "reality",
        "point",
        "ask",
        "effect",
        "determined",
        "cause",
        "put",
        "necessarily",
        "contingently",
        "necessarily",
        "come",
        "necessarily",
        "according",
        "opinion",
        "contingently",
        "contingent",
        "determined",
        "one",
        "side",
        "cause",
        "determination",
        "determined",
        "except",
        "prior",
        "contingent",
        "determination",
        "would",
        "ask",
        "go",
        "infinitely",
        "necessary",
        "stop",
        "contingent",
        "determination",
        "cause",
        "effect",
        "d",
        "marchia",
        "p",
        "marchia",
        "however",
        "aware",
        "auriol",
        "claimed",
        "prior",
        "determination",
        "fatal",
        "contingency",
        "marchia",
        "draw",
        "distinction",
        "different",
        "indetermination",
        "determination",
        "perhaps",
        "expanding",
        "isolated",
        "remark",
        "made",
        "scotus",
        "indetermination",
        "possible",
        "de",
        "possibili",
        "respect",
        "able",
        "act",
        "able",
        "act",
        "indetermination",
        "determined",
        "de",
        "possibili",
        "event",
        "free",
        "act",
        "contingently",
        "necessarily",
        "also",
        "posterior",
        "indetermination",
        "inhering",
        "de",
        "inesse",
        "respect",
        "case",
        "reality",
        "indetermination",
        "toward",
        "inhere",
        "reality",
        "however",
        "would",
        "obstacle",
        "foreknowledge",
        "u",
        "acting",
        "thus",
        "must",
        "replaced",
        "determination",
        "contingent",
        "cause",
        "toward",
        "acting",
        "future",
        "known",
        "u",
        "act",
        "determination",
        "de",
        "possibili",
        "toward",
        "able",
        "act",
        "able",
        "act",
        "absent",
        "free",
        "cause",
        "event",
        "occurs",
        "time",
        "freedom",
        "power",
        "respect",
        "event",
        "removed",
        "obvious",
        "objection",
        "marchia",
        "effect",
        "determinate",
        "cause",
        "action",
        "cause",
        "thus",
        "determination",
        "presupposed",
        "subsequent",
        "action",
        "cause",
        "since",
        "presupposed",
        "determination",
        "cause",
        "power",
        "thus",
        "contingent",
        "marchia",
        "reply",
        "another",
        "distinction",
        "action",
        "taken",
        "three",
        "way",
        "either",
        "taken",
        "actually",
        "namely",
        "agent",
        "actually",
        "acting",
        "taken",
        "virtually",
        "agent",
        "act",
        "although",
        "acting",
        "taken",
        "middle",
        "way",
        "purely",
        "actually",
        "purely",
        "virtually",
        "middle",
        "way",
        "dispositionally",
        "aptitudinally",
        "namely",
        "agent",
        "acting",
        "determined",
        "toward",
        "acting",
        "although",
        "actuality",
        "acting",
        "act",
        "determined",
        "acting",
        "later",
        "similarly",
        "threefold",
        "determination",
        "agent",
        "one",
        "actual",
        "agent",
        "actually",
        "determinately",
        "put",
        "one",
        "part",
        "contradiction",
        "effect",
        "second",
        "potential",
        "determination",
        "agent",
        "posit",
        "determine",
        "part",
        "contradiction",
        "dividedly",
        "dispositional",
        "aptitudinal",
        "determination",
        "agent",
        "determined",
        "respect",
        "future",
        "putting",
        "one",
        "part",
        "contradiction",
        "effect",
        "determination",
        "presupposes",
        "action",
        "corresponding",
        "actual",
        "determination",
        "follows",
        "action",
        "actuality",
        "dispositional",
        "determination",
        "follows",
        "action",
        "dispositionally",
        "although",
        "precedes",
        "actual",
        "action",
        "potential",
        "determination",
        "follows",
        "potential",
        "action",
        "although",
        "precedes",
        "actual",
        "dispositional",
        "action",
        "d",
        "marchia",
        "pp",
        "thus",
        "agent",
        "determined",
        "de",
        "inesse",
        "something",
        "future",
        "determination",
        "like",
        "disposition",
        "neither",
        "actual",
        "event",
        "yet",
        "occurred",
        "potential",
        "possibility",
        "otherwise",
        "removed",
        "determination",
        "actually",
        "agent",
        "power",
        "marchia",
        "grant",
        "power",
        "dispositionally",
        "although",
        "agent",
        "act",
        "act",
        "disposed",
        "act",
        "fact",
        "act",
        "foregoing",
        "example",
        "representative",
        "marchia",
        "thought",
        "many",
        "way",
        "frequently",
        "draw",
        "clever",
        "original",
        "distinction",
        "de",
        "possibilide",
        "inesse",
        "division",
        "employed",
        "context",
        "predestination",
        "book",
        "d",
        "marchia",
        "b",
        "see",
        "also",
        "duba",
        "make",
        "similar",
        "innovative",
        "distinction",
        "discussing",
        "different",
        "type",
        "human",
        "divine",
        "willing",
        "voluntarist",
        "opinion",
        "quite",
        "interesting",
        "reportatio",
        "dd",
        "see",
        "critical",
        "edition",
        "cited",
        "alliney",
        "b",
        "robiglio",
        "although",
        "one",
        "could",
        "argue",
        "cogency",
        "marchia",
        "argument",
        "case",
        "de",
        "possibilide",
        "inesse",
        "distinction",
        "marchia",
        "found",
        "favorable",
        "response",
        "among",
        "following",
        "adopted",
        "device",
        "franciscan",
        "successor",
        "paris",
        "next",
        "decade",
        "aufredo",
        "gonteri",
        "brito",
        "william",
        "rubio",
        "william",
        "brienne",
        "augustinian",
        "hermit",
        "michael",
        "massa",
        "gregory",
        "rimini",
        "art",
        "master",
        "john",
        "canon",
        "later",
        "fifteenth",
        "century",
        "fernando",
        "cordoba",
        "francesco",
        "della",
        "rovere",
        "become",
        "pope",
        "sixtus",
        "iv",
        "thus",
        "philosophical",
        "theology",
        "one",
        "could",
        "often",
        "look",
        "marchia",
        "alternative",
        "scotus",
        "innovative",
        "response",
        "auriol"
    ]
}