{
    "main_text": "The Harm Principle and Free Speech || Mill's Harm Principle and Hate Speech\n2.3 Mill's Harm Principle and Hate Speech\n\nAnother difficult case is hate speech. Most liberal democracies have\nlimitations on hate speech, but it is debatable whether these can be\njustified by the harm principle as formulated by Mill. One would have\nto show that such speech violated rights, directly and in the first\ninstance. I am interested here in hate speech that does not advocate\nviolence against a group or individual because such speech would be\ncaptured by Mill's harm principle. The Public Order Act 1986 in the\nU.K. does not require such a stringent barrier as the harm principle\nto prohibit speech. The Act states that “A person is guilty of\nan offence if he ...displays any writing, sign or other visible\nrepresentation which is threatening, abusive or insulting, within the\nhearing or sight of a person likely to be caused harassment, alarm or\ndistress.” \n\nThere have been several prosecutions in the U.K. that would not have\nhappened if the harm principle governed “absolutely the dealings\nof society with the individual”(Mill,1978, 68). In 2001\nevangelist Harry Hammond was prosecuted for the following statements:\n“Jesus Gives Peace, Jesus is Alive, Stop Immorality, Stop\nHomosexuality, Stop Lesbianism, Jesus is Lord”. For his sins he\nwas fined 300 pounds and made to pay 395 pounds in costs. In 2010,\nHarry Taylor left anti-religious cartoons in the prayer-room of\nLiverpool's John Lennon Airport. The airport chaplain was\n“insulted, offended, and alarmed” by the cartoons and\ncalled the police. Taylor was prosecuted and received a six-month\nsuspended sentence. Barry Thew wore a t-shirt hours after two women\npolice officers were murdered near Manchester in 2012. The front of\nthe shirt had the slogan “One less pig, perfect justice,”\nand on the back was written “Kill a cop for fun”. He\nadmitted a Section 4A Public Order Offence and was sentenced to 4\nmonths jail. Also in 2012, Liam Stacey took to twitter to mock a black\nprofessional football player who collapsed during a match. He then\nproceeded to racially abuse people who responded negatively to his\ntweet. He was sentenced to 56 days in jail. This case provoked\nsignificant commentary, most of it taking the form of slippery-slope\nclaims that the decision would inevitably lead to Britain becoming a\ntotalitarian state. The most recent (June 2016) case to receive public\nattention involves Paul Gascoigne, the former English football star,\nwho has been charged with racially aggravated abuse after commenting,\nwhilst on stage, that he could only make out a black man standing in a\ndark corner of the room when he smiled. It is doubtful that any of\nthese examples would be captured by Mill's harm principle.\n\nIn Australia, Section 18C of the Racial Discrimination Act 1975 states\nthat “It is unlawful for a person to do an act, otherwise than\nin private, If: (a) the act is reasonably likely in all the\ncircumstances to offend, insult, humiliate or intimidate another\nperson or group of people, and (b) the act is done because of race,\ncolour or national or ethnic origin”. The most prominent person\nprosecuted under the Act is Andrew Bolt, a conservative political\ncommentator, who was found guilty of racially vilifying nine\naboriginal persons in newspaper articles in 2011. He suggested that\nthe nine people had identified as aboriginal, despite having fair\nskin, for their own professional advantage. The case prompted the Tony\nAbbott led Liberal government into a failed attempt to change the\nlegislation.\n\nIt should be noted that Section 18C is qualified by Section 18D (often\nignored in the backlash against the Bolt decision). 18D says that \n\n…section 18C does not render unlawful anything said or done\nreasonably and in good faith: (a) in the performance, exhibition or\ndistribution of an artistic work; or (b) in the course of any\nstatement, publication, discussion or debate made or held for any\ngenuine academic, artistic or scientific purpose or any other genuine\npurpose in the public interest; or (c) in the making or publishing:\n(i) a fair and accurate report of any event or matter of public\ninterest; or (ii) a fair comment on any matter of public interest if\nthe comment is an expression of a genuine belief held by the person\nmaking the comment…\n\n\nIt is clear that these qualifications remove some of the teeth from\nSection 18C. As long as the statements are made artistically and/or in\ngood faith, for example, they are immune from prosecution. The\nconclusion of the judge in the Bolt case was that none of the Section\n18D exemptions applied in his case. Even with these qualifications in\nplace, however, it seems that the Racial Discrimination Act would\nstill be ruled out by Mill's harm principle which seems to allow\npeople to offend, insult, and humiliate (although perhaps not\nintimidate) regardless of the motivation of the speaker. \n\nThe United States, precisely because it fits most closely with Mill's\nprinciple, is an outlier amongst liberal democracies when it comes to\nhate speech. The most famous example of this is the Nazi march through\nSkokie, Illinois, something that would not be allowed in many other\nliberal democracies. The intention was not to engage in political\nspeech at all, but simply to march through a predominantly Jewish\ncommunity dressed in storm trooper uniforms and wearing swastikas\n(although the Illinois Supreme Court interpreted the wearing of\nswastikas as “symbolic political speech”). It is clear\nthat many people, especially those who lived in Skokie, were outraged\nand offended by the march, but were they harmed? There was no plan to\ncause physical injury and the marchers did not intend to damage\nproperty. \n\nThe main argument for prohibiting the Skokie march, based on\nconsiderations of harm, was that the march would incite a riot, thus\nputting the marchers in danger. The problem with this argument is that\nthe focal point is the potential harm to the speakers and not the harm\ndone to those who are the subject of the hate. To ban speech for this\nreason, i.e., for the good of the speaker, tends to undermine the\nbasic right to free speech in the first place. If we turn our\nattention to members of the local community, we might want to claim\nthat they were psychologically harmed by the march. This is much more\ndifficult to demonstrate than harm to a person's legal rights. It\nseems, therefore, that Mill's argument does not allow for state\nintervention in this case. If we base our defense of speech on Mill's\nprinciple we will have very few prohibitions. It is only when we can\nshow direct harm to rights, which will almost always mean when an\nattack is made against a specific individual or a small group of\npersons, that it is legitimate to impose a sanction. \n\nOne response is to suggest that the harm principle can be defined less\nstringently. Jeremy Waldron (2012) has made a recent attempt to do\nthis. He draws our attention to the visual impact of hate speech\nthrough posters and signs displayed in public. Waldron argues that the\nharm in hate speech (the title of his book) is that it compromises the\ndignity of those under attack. A society where such images proliferate\nmakes life exceedingly difficult for those targeted by hate speech.\nWaldron suggests that the people engaged in hate speech are saying\n“[t]he time for your degradation and your exclusion by the society\nthat presently shelters you is fast approaching” (2012, 96). He\nclaims that prohibiting such messages assures all people that they are\nwelcome members of the community.\n\nWaldron does not want to use hate speech legislation to punish those\nwho hold hateful thoughts and attitudes. The goal is not to engage in\nthought control but to prevent harm to the social standing of certain\ngroups in society. Liberal democratic societies are founded on ideas\nof equality and dignity and these are damaged by hate speech. Given\nthis, Waldron wonders why we even need to debate the usefulness of\nhate speech. Mill, for example, argued that we should allow speech of\nthis type so that our ideas do not fall into the “slumber of a\ndecided opinion” (1978, 41). Waldron doubts that we require hate\nspeech to prevent such an outcome. \n\nAs we have seen, Waldron is making a harm based argument but his\nthreshold for what counts as harm is lower than Mill’s. He needs to\nconvince us that an attack on a person's dignity constitutes a\nsignificant harm. My dignity might often be bruised by colleagues, for\nexample, but this does not necessarily show that I have been harmed.\nPerhaps it is only when an attack on dignity is equivalent to threats\nof physical abuse that it counts as a reason for limiting speech.\nWaldron does not offer a lot of evidence that a permissive attitude to\nhate speech, at least in liberal democracies, does cause significant\nharm. There is no specific hate speech regulation in the United\nStates, for example, but it is not clear that more harm occurs there\nthan in other liberal democracies.\n\nDavid Boonin (2011) is not convinced that there is a need for special\nhate speech legislation. He claims that hate speech does not fit\nwithin the regular categories of speech that can be prohibited. Even\nif he can be persuaded that it does fit, he still thinks special hate\nspeech laws are not required because existing legislation will capture\nthe offending speech. I will examine one example he uses to make his\npoint. Boonin argues that threatening speech already sits within the\ncategory of speech that is rightfully prohibited. He suggests,\nhowever, that hate speech does not fall within this category because a\nsignificant amount of hate speech is not directly threatening. A group\nof black men, for example, will not be threatened by a racially\nabusive elderly white woman. He argues that this example, and others\nlike it, show why a blanket ban on all hate speech on the grounds that\nit is threatening cannot be justified. \n\nNor is it likely, he suggests, that racist attacks by frail old ladies\nwill contribute to an atmosphere of danger. This argument might be\nless persuasive. Mill’s use of the corn dealer example demonstrates\nhow the use of language can incite violence regardless of who is\nspeaking. But Mill’s example also shows that a blanket ban would\nstill be unwarranted because it allows incendiary statements to be\nmade about corn dealers under controlled conditions. \n\nBoonin’s argument does not rest here. If it really does turn out to\nbe the case that all hate speech is threatening in the appropriate\nsense, this still does not justify special hate speech laws because\nthere is already legislation in place prohibiting threatening\nlanguage. Boonin is opposed to banning hate speech because it is\nhateful not because it is threatening. He claims that the argument for\nspecial hate speech laws is “impaled on the horns of a dilemma:\neither the appeal is unconvincing because not all forms of hate speech\nare threatening, or it is unnecessary precisely because all forms of\nhate speech are threatening and are therefore already prohibited”\n(2011, 213). Boonin uses the same strategy with regard to other\nreasons, such as “fighting words”, for banning hate speech; they all\nfind themselves impaled on the horns of the same dilemma.\n\nThe arguments of Waldron and Boonin seem to be a long way apart and\nthe latter suggests that anyone who argues for hate speech laws is\ntaking an extreme position. There is, however, a lot of overlap\nbetween the two, particularly as both focus on harm, and neither wants\nto censor hate speech simply because it is offensive. This becomes\nclearer if we take a suggestion offered by Waldron. At one point in\nhis book he ponders whether it might be advantageous to abandon the\nterm “hate speech” altogether. Such a move goes a long way to\nreconciling the arguments of Waldron and Boonin. Both authors agree\nthat prohibition is acceptable when speech is threatening; they\ndisagree on what counts as a harmful threat. Waldron thinks most forms\nof racial abuse qualify whereas Boonin is more circumspect. But the\ndisagreement between the two is about what causes harm rather than any\nmajor philosophical difference about the appropriate limits on speech.\nIf both agree that a threat constitutes a significant harm, then both\nwill support censorship. This still leaves lots of room for\ndisagreement, particularly as we are now more aware than was Mill of\npsychological as well as physical harm. I cannot delve into the topic\nhere except to say that if we expand the harm principle from the\nphysical to the mental realm, more options might become available for\nprohibiting hate speech and pornography.\n",
    "section_title": "2.3 Mill's Harm Principle and Hate Speech",
    "entry_title": "Freedom of Speech",
    "hierarchy_title": "Freedom of Speech || The Harm Principle and Free Speech || Mill's Harm Principle and Hate Speech",
    "tokenized_text": [
        "harm",
        "principle",
        "free",
        "speech",
        "mill",
        "s",
        "harm",
        "principle",
        "hate",
        "speech",
        "mill",
        "s",
        "harm",
        "principle",
        "hate",
        "speech",
        "another",
        "difficult",
        "case",
        "hate",
        "speech",
        "liberal",
        "democracy",
        "limitation",
        "hate",
        "speech",
        "debatable",
        "whether",
        "justified",
        "harm",
        "principle",
        "formulated",
        "mill",
        "one",
        "would",
        "show",
        "speech",
        "violated",
        "right",
        "directly",
        "first",
        "instance",
        "interested",
        "hate",
        "speech",
        "advocate",
        "violence",
        "group",
        "individual",
        "speech",
        "would",
        "captured",
        "mill",
        "s",
        "harm",
        "principle",
        "public",
        "order",
        "act",
        "uk",
        "require",
        "stringent",
        "barrier",
        "harm",
        "principle",
        "prohibit",
        "speech",
        "act",
        "state",
        "person",
        "guilty",
        "offence",
        "display",
        "writing",
        "sign",
        "visible",
        "representation",
        "threatening",
        "abusive",
        "insulting",
        "within",
        "hearing",
        "sight",
        "person",
        "likely",
        "caused",
        "harassment",
        "alarm",
        "distress",
        "several",
        "prosecution",
        "uk",
        "would",
        "happened",
        "harm",
        "principle",
        "governed",
        "absolutely",
        "dealing",
        "society",
        "individual",
        "mill",
        "evangelist",
        "harry",
        "hammond",
        "prosecuted",
        "following",
        "statement",
        "jesus",
        "give",
        "peace",
        "jesus",
        "alive",
        "stop",
        "immorality",
        "stop",
        "homosexuality",
        "stop",
        "lesbianism",
        "jesus",
        "lord",
        "sin",
        "fined",
        "pound",
        "made",
        "pay",
        "pound",
        "cost",
        "harry",
        "taylor",
        "left",
        "antireligious",
        "cartoon",
        "prayerroom",
        "liverpool",
        "s",
        "john",
        "lennon",
        "airport",
        "airport",
        "chaplain",
        "insulted",
        "offended",
        "alarmed",
        "cartoon",
        "called",
        "police",
        "taylor",
        "prosecuted",
        "received",
        "sixmonth",
        "suspended",
        "sentence",
        "barry",
        "thew",
        "wore",
        "tshirt",
        "hour",
        "two",
        "woman",
        "police",
        "officer",
        "murdered",
        "near",
        "manchester",
        "front",
        "shirt",
        "slogan",
        "one",
        "le",
        "pig",
        "perfect",
        "justice",
        "back",
        "written",
        "kill",
        "cop",
        "fun",
        "admitted",
        "section",
        "a",
        "public",
        "order",
        "offence",
        "sentenced",
        "month",
        "jail",
        "also",
        "liam",
        "stacey",
        "took",
        "twitter",
        "mock",
        "black",
        "professional",
        "football",
        "player",
        "collapsed",
        "match",
        "proceeded",
        "racially",
        "abuse",
        "people",
        "responded",
        "negatively",
        "tweet",
        "sentenced",
        "day",
        "jail",
        "case",
        "provoked",
        "significant",
        "commentary",
        "taking",
        "form",
        "slipperyslope",
        "claim",
        "decision",
        "would",
        "inevitably",
        "lead",
        "britain",
        "becoming",
        "totalitarian",
        "state",
        "recent",
        "june",
        "case",
        "receive",
        "public",
        "attention",
        "involves",
        "paul",
        "gascoigne",
        "former",
        "english",
        "football",
        "star",
        "charged",
        "racially",
        "aggravated",
        "abuse",
        "commenting",
        "whilst",
        "stage",
        "could",
        "make",
        "black",
        "man",
        "standing",
        "dark",
        "corner",
        "room",
        "smiled",
        "doubtful",
        "example",
        "would",
        "captured",
        "mill",
        "s",
        "harm",
        "principle",
        "australia",
        "section",
        "c",
        "racial",
        "discrimination",
        "act",
        "state",
        "unlawful",
        "person",
        "act",
        "otherwise",
        "private",
        "act",
        "reasonably",
        "likely",
        "circumstance",
        "offend",
        "insult",
        "humiliate",
        "intimidate",
        "another",
        "person",
        "group",
        "people",
        "b",
        "act",
        "done",
        "race",
        "colour",
        "national",
        "ethnic",
        "origin",
        "prominent",
        "person",
        "prosecuted",
        "act",
        "andrew",
        "bolt",
        "conservative",
        "political",
        "commentator",
        "found",
        "guilty",
        "racially",
        "vilifying",
        "nine",
        "aboriginal",
        "person",
        "newspaper",
        "article",
        "suggested",
        "nine",
        "people",
        "identified",
        "aboriginal",
        "despite",
        "fair",
        "skin",
        "professional",
        "advantage",
        "case",
        "prompted",
        "tony",
        "abbott",
        "led",
        "liberal",
        "government",
        "failed",
        "attempt",
        "change",
        "legislation",
        "noted",
        "section",
        "c",
        "qualified",
        "section",
        "d",
        "often",
        "ignored",
        "backlash",
        "bolt",
        "decision",
        "d",
        "say",
        "section",
        "c",
        "render",
        "unlawful",
        "anything",
        "said",
        "done",
        "reasonably",
        "good",
        "faith",
        "performance",
        "exhibition",
        "distribution",
        "artistic",
        "work",
        "b",
        "course",
        "statement",
        "publication",
        "discussion",
        "debate",
        "made",
        "held",
        "genuine",
        "academic",
        "artistic",
        "scientific",
        "purpose",
        "genuine",
        "purpose",
        "public",
        "interest",
        "c",
        "making",
        "publishing",
        "fair",
        "accurate",
        "report",
        "event",
        "matter",
        "public",
        "interest",
        "ii",
        "fair",
        "comment",
        "matter",
        "public",
        "interest",
        "comment",
        "expression",
        "genuine",
        "belief",
        "held",
        "person",
        "making",
        "comment",
        "clear",
        "qualification",
        "remove",
        "teeth",
        "section",
        "c",
        "long",
        "statement",
        "made",
        "artistically",
        "andor",
        "good",
        "faith",
        "example",
        "immune",
        "prosecution",
        "conclusion",
        "judge",
        "bolt",
        "case",
        "none",
        "section",
        "d",
        "exemption",
        "applied",
        "case",
        "even",
        "qualification",
        "place",
        "however",
        "seems",
        "racial",
        "discrimination",
        "act",
        "would",
        "still",
        "ruled",
        "mill",
        "s",
        "harm",
        "principle",
        "seems",
        "allow",
        "people",
        "offend",
        "insult",
        "humiliate",
        "although",
        "perhaps",
        "intimidate",
        "regardless",
        "motivation",
        "speaker",
        "united",
        "state",
        "precisely",
        "fit",
        "closely",
        "mill",
        "s",
        "principle",
        "outlier",
        "amongst",
        "liberal",
        "democracy",
        "come",
        "hate",
        "speech",
        "famous",
        "example",
        "nazi",
        "march",
        "skokie",
        "illinois",
        "something",
        "would",
        "allowed",
        "many",
        "liberal",
        "democracy",
        "intention",
        "engage",
        "political",
        "speech",
        "simply",
        "march",
        "predominantly",
        "jewish",
        "community",
        "dressed",
        "storm",
        "trooper",
        "uniform",
        "wearing",
        "swastika",
        "although",
        "illinois",
        "supreme",
        "court",
        "interpreted",
        "wearing",
        "swastika",
        "symbolic",
        "political",
        "speech",
        "clear",
        "many",
        "people",
        "especially",
        "lived",
        "skokie",
        "outraged",
        "offended",
        "march",
        "harmed",
        "plan",
        "cause",
        "physical",
        "injury",
        "marcher",
        "intend",
        "damage",
        "property",
        "main",
        "argument",
        "prohibiting",
        "skokie",
        "march",
        "based",
        "consideration",
        "harm",
        "march",
        "would",
        "incite",
        "riot",
        "thus",
        "putting",
        "marcher",
        "danger",
        "problem",
        "argument",
        "focal",
        "point",
        "potential",
        "harm",
        "speaker",
        "harm",
        "done",
        "subject",
        "hate",
        "ban",
        "speech",
        "reason",
        "ie",
        "good",
        "speaker",
        "tends",
        "undermine",
        "basic",
        "right",
        "free",
        "speech",
        "first",
        "place",
        "turn",
        "attention",
        "member",
        "local",
        "community",
        "might",
        "want",
        "claim",
        "psychologically",
        "harmed",
        "march",
        "much",
        "difficult",
        "demonstrate",
        "harm",
        "person",
        "s",
        "legal",
        "right",
        "seems",
        "therefore",
        "mill",
        "s",
        "argument",
        "allow",
        "state",
        "intervention",
        "case",
        "base",
        "defense",
        "speech",
        "mill",
        "s",
        "principle",
        "prohibition",
        "show",
        "direct",
        "harm",
        "right",
        "almost",
        "always",
        "mean",
        "attack",
        "made",
        "specific",
        "individual",
        "small",
        "group",
        "person",
        "legitimate",
        "impose",
        "sanction",
        "one",
        "response",
        "suggest",
        "harm",
        "principle",
        "defined",
        "le",
        "stringently",
        "jeremy",
        "waldron",
        "made",
        "recent",
        "attempt",
        "draw",
        "attention",
        "visual",
        "impact",
        "hate",
        "speech",
        "poster",
        "sign",
        "displayed",
        "public",
        "waldron",
        "argues",
        "harm",
        "hate",
        "speech",
        "title",
        "book",
        "compromise",
        "dignity",
        "attack",
        "society",
        "image",
        "proliferate",
        "make",
        "life",
        "exceedingly",
        "difficult",
        "targeted",
        "hate",
        "speech",
        "waldron",
        "suggests",
        "people",
        "engaged",
        "hate",
        "speech",
        "saying",
        "time",
        "degradation",
        "exclusion",
        "society",
        "presently",
        "shelter",
        "fast",
        "approaching",
        "claim",
        "prohibiting",
        "message",
        "assures",
        "people",
        "welcome",
        "member",
        "community",
        "waldron",
        "want",
        "use",
        "hate",
        "speech",
        "legislation",
        "punish",
        "hold",
        "hateful",
        "thought",
        "attitude",
        "goal",
        "engage",
        "thought",
        "control",
        "prevent",
        "harm",
        "social",
        "standing",
        "certain",
        "group",
        "society",
        "liberal",
        "democratic",
        "society",
        "founded",
        "idea",
        "equality",
        "dignity",
        "damaged",
        "hate",
        "speech",
        "given",
        "waldron",
        "wonder",
        "even",
        "need",
        "debate",
        "usefulness",
        "hate",
        "speech",
        "mill",
        "example",
        "argued",
        "allow",
        "speech",
        "type",
        "idea",
        "fall",
        "slumber",
        "decided",
        "opinion",
        "waldron",
        "doubt",
        "require",
        "hate",
        "speech",
        "prevent",
        "outcome",
        "seen",
        "waldron",
        "making",
        "harm",
        "based",
        "argument",
        "threshold",
        "count",
        "harm",
        "lower",
        "mill",
        "need",
        "convince",
        "u",
        "attack",
        "person",
        "s",
        "dignity",
        "constitutes",
        "significant",
        "harm",
        "dignity",
        "might",
        "often",
        "bruised",
        "colleague",
        "example",
        "necessarily",
        "show",
        "harmed",
        "perhaps",
        "attack",
        "dignity",
        "equivalent",
        "threat",
        "physical",
        "abuse",
        "count",
        "reason",
        "limiting",
        "speech",
        "waldron",
        "offer",
        "lot",
        "evidence",
        "permissive",
        "attitude",
        "hate",
        "speech",
        "least",
        "liberal",
        "democracy",
        "cause",
        "significant",
        "harm",
        "specific",
        "hate",
        "speech",
        "regulation",
        "united",
        "state",
        "example",
        "clear",
        "harm",
        "occurs",
        "liberal",
        "democracy",
        "david",
        "boonin",
        "convinced",
        "need",
        "special",
        "hate",
        "speech",
        "legislation",
        "claim",
        "hate",
        "speech",
        "fit",
        "within",
        "regular",
        "category",
        "speech",
        "prohibited",
        "even",
        "persuaded",
        "fit",
        "still",
        "think",
        "special",
        "hate",
        "speech",
        "law",
        "required",
        "existing",
        "legislation",
        "capture",
        "offending",
        "speech",
        "examine",
        "one",
        "example",
        "us",
        "make",
        "point",
        "boonin",
        "argues",
        "threatening",
        "speech",
        "already",
        "sits",
        "within",
        "category",
        "speech",
        "rightfully",
        "prohibited",
        "suggests",
        "however",
        "hate",
        "speech",
        "fall",
        "within",
        "category",
        "significant",
        "amount",
        "hate",
        "speech",
        "directly",
        "threatening",
        "group",
        "black",
        "men",
        "example",
        "threatened",
        "racially",
        "abusive",
        "elderly",
        "white",
        "woman",
        "argues",
        "example",
        "others",
        "like",
        "show",
        "blanket",
        "ban",
        "hate",
        "speech",
        "ground",
        "threatening",
        "justified",
        "likely",
        "suggests",
        "racist",
        "attack",
        "frail",
        "old",
        "lady",
        "contribute",
        "atmosphere",
        "danger",
        "argument",
        "might",
        "le",
        "persuasive",
        "mill",
        "use",
        "corn",
        "dealer",
        "example",
        "demonstrates",
        "use",
        "language",
        "incite",
        "violence",
        "regardless",
        "speaking",
        "mill",
        "example",
        "also",
        "show",
        "blanket",
        "ban",
        "would",
        "still",
        "unwarranted",
        "allows",
        "incendiary",
        "statement",
        "made",
        "corn",
        "dealer",
        "controlled",
        "condition",
        "boonin",
        "argument",
        "rest",
        "really",
        "turn",
        "case",
        "hate",
        "speech",
        "threatening",
        "appropriate",
        "sense",
        "still",
        "justify",
        "special",
        "hate",
        "speech",
        "law",
        "already",
        "legislation",
        "place",
        "prohibiting",
        "threatening",
        "language",
        "boonin",
        "opposed",
        "banning",
        "hate",
        "speech",
        "hateful",
        "threatening",
        "claim",
        "argument",
        "special",
        "hate",
        "speech",
        "law",
        "impaled",
        "horn",
        "dilemma",
        "either",
        "appeal",
        "unconvincing",
        "form",
        "hate",
        "speech",
        "threatening",
        "unnecessary",
        "precisely",
        "form",
        "hate",
        "speech",
        "threatening",
        "therefore",
        "already",
        "prohibited",
        "boonin",
        "us",
        "strategy",
        "regard",
        "reason",
        "fighting",
        "word",
        "banning",
        "hate",
        "speech",
        "find",
        "impaled",
        "horn",
        "dilemma",
        "argument",
        "waldron",
        "boonin",
        "seem",
        "long",
        "way",
        "apart",
        "latter",
        "suggests",
        "anyone",
        "argues",
        "hate",
        "speech",
        "law",
        "taking",
        "extreme",
        "position",
        "however",
        "lot",
        "overlap",
        "two",
        "particularly",
        "focus",
        "harm",
        "neither",
        "want",
        "censor",
        "hate",
        "speech",
        "simply",
        "offensive",
        "becomes",
        "clearer",
        "take",
        "suggestion",
        "offered",
        "waldron",
        "one",
        "point",
        "book",
        "ponders",
        "whether",
        "might",
        "advantageous",
        "abandon",
        "term",
        "hate",
        "speech",
        "altogether",
        "move",
        "go",
        "long",
        "way",
        "reconciling",
        "argument",
        "waldron",
        "boonin",
        "author",
        "agree",
        "prohibition",
        "acceptable",
        "speech",
        "threatening",
        "disagree",
        "count",
        "harmful",
        "threat",
        "waldron",
        "think",
        "form",
        "racial",
        "abuse",
        "qualify",
        "whereas",
        "boonin",
        "circumspect",
        "disagreement",
        "two",
        "cause",
        "harm",
        "rather",
        "major",
        "philosophical",
        "difference",
        "appropriate",
        "limit",
        "speech",
        "agree",
        "threat",
        "constitutes",
        "significant",
        "harm",
        "support",
        "censorship",
        "still",
        "leaf",
        "lot",
        "room",
        "disagreement",
        "particularly",
        "aware",
        "mill",
        "psychological",
        "well",
        "physical",
        "harm",
        "delve",
        "topic",
        "except",
        "say",
        "expand",
        "harm",
        "principle",
        "physical",
        "mental",
        "realm",
        "option",
        "might",
        "become",
        "available",
        "prohibiting",
        "hate",
        "speech",
        "pornography"
    ]
}