{
    "main_text": "Major Historical Contributions || Ancient and Medieval Period\n1.1 Ancient and Medieval Period\n\nOne finds scholarly debate on the ‘origin’ of the notion\nof free will in Western philosophy. (See, e.g., Dihle (1982) and, in\nresponse Frede (2011), with Dihle finding it in St. Augustine\n(354–430 CE) and Frede in the Stoic Epictetus (c. 55–c.\n135 CE).) But this debate presupposes a fairly particular and highly\nconceptualized concept of free will, with Dihle’s later\n‘origin’ reflecting his having a yet more particular\nconcept in view than Frede. If, instead, we look more generally for\nphilosophical reflection on choice-directed control over one’s\nown actions, then we find significant discussion in Plato and\nAristotle (cf. Irwin 1992). Indeed, on this matter, as with so many\nother major philosophical issues, Plato and Aristotle give importantly\ndifferent emphases that inform much subsequent thought.\n\nIn Book IV of The Republic, Plato posits rational, spirited,\nand appetitive aspects to the human soul. The wise person strives for\ninner ‘justice’, a condition in which each part of the\nsoul plays its proper role—reason as the guide, the spirited\nnature as the ally of reason, exhorting oneself to do what reason\ndeems proper, and the passions as subjugated to the determinations of\nreason. In the absence of justice, the individual is enslaved to the\npassions. Hence, freedom for Plato is a kind of self-mastery, attained\nby developing the virtues of wisdom, courage, and temperance,\nresulting in one’s liberation from the tyranny of base desires\nand acquisition of a more accurate understanding and resolute pursuit\nof the Good (Hecht 2014).\n\nWhile Aristotle shares with Plato a concern for cultivating virtues,\nhe gives greater theoretical attention to the role of choice in\ninitiating individual actions which, over time, result in habits, for\ngood or ill. In Book III of the Nicomachean Ethics, Aristotle\nsays that, unlike nonrational agents, we have the power to do or not\nto do, and much of what we do is voluntary, such that its origin is\n‘in us’ and we are ‘aware of the particular\ncircumstances of the action’. Furthermore, mature humans make\nchoices after deliberating about different available means to our\nends, drawing on rational principles of action. Choose consistently\nwell (poorly), and a virtuous (vicious) character will form over time,\nand it is in our power to be either virtuous or vicious.\n\nA question that Aristotle seems to recognize, while not satisfactorily\nanswering, is whether the choice an individual makes on any given\noccasion is wholly determined by his internal state—perception\nof his circumstances and his relevant beliefs, desires, and general\ncharacter dispositions (wherever on the continuum between virtue and\nvice he may be)—and external circumstances. He says that\n“the man is the father of his actions as of\nchildren”—that is, a person’s character shapes how\nshe acts. One might worry that this seems to entail that the person\ncould not have done otherwise—at the moment of choice, she has\nno control over what her present character is—and so she is not\nresponsible for choosing as she does. Aristotle responds by contending\nthat her present character is partly a result of previous\nchoices she made. While this claim is plausible enough, it seems to\n‘pass the buck’, since ‘the man is the father’\nof those earlier choices and actions, too.\n\nWe note just a few contributions of the subsequent centuries of the\nHellenistic era. (See Bobzien 1998.) This period was dominated by\ndebates between Epicureans, Stoics, and the Academic Skeptics, and as\nit concerned freedom of the will, the debate centered on the place of\ndeterminism or of fate in governing human actions and lives. The\nStoics and the Epicureans believed that all ordinary things, human\nsouls included, are corporeal and governed by natural laws or\nprinciples. Stoics believed that all human choice and behavior was\ncausally determined, but held that this was compatible with our\nactions being ‘up to us’. Chrysippus ably defended this\nposition by contending that your actions are ‘up to you’\nwhen they come about ‘through you’—when the\ndetermining factors of your action are not external circumstances\ncompelling you to act as you do but are instead your own choices\ngrounded in your perception of the options before you. Hence, for\nmoral responsibility, the issue is not whether one’s choices are\ndetermined (they are) but in what manner they are determined. Epicurus\nand his followers had a more mechanistic conception of bodily action\nthan the Stoics. They held that all things (human soul included) are\nconstituted by atoms, whose law-governed behavior fixes the behavior\nof everything made of such atoms. But they rejected determinism by\nsupposing that atoms, though law-governed, are susceptible to slight\n‘swerves’ or departures from the usual paths. Epicurus has\noften been understood as seeking to ground the freedom of human\nwillings in such indeterministic swerves, but this is a matter of\ncontroversy. If this understanding of his aim is correct, how he\nthought that this scheme might work in detail is not known. (What\nlittle we know about his views in this matter stem chiefly from the\naccount given in his follower Lucretius’s six-book poem, On\nthe Nature of Things. See Bobzien 2000 for discussion.)\n\nA final notable figure of this period was\n Alexander of Aphrodisias,\n the most important Peripatetic commentator on Aristotle. In his\nOn Fate, Alexander sharply criticizes the positions of the\nStoics. He goes on to resolve the ambiguity in Aristotle on the\nquestion of the determining nature of character on individual choices\nby maintaining that, given all such shaping factors, it remains open\nto the person when she acts freely to do or not to do what she in fact\ndoes. Many scholars see Alexander as the first unambiguously\n‘libertarian’ theorist of the will (for more information\nabout such theories see section 2 below).\n\nAugustine (354–430) is the central bridge between the ancient\nand medieval eras of philosophy. His mature thinking about the will\nwas influenced by his early encounter with late classical Neoplatonist\nthought, which is then transformed by the theological views he\nembraces in his adult Christian conversion, famously recounted in his\nConfessions. In that work and in the earlier On the Free\nChoice of the Will, Augustine struggles to draw together into a\ncoherent whole the doctrines that creaturely misuse of freedom, not\nGod, is the source of evil in the world and that the human will has\nbeen corrupted through the ‘fall’ from grace of the\nearliest human beings, necessitating a salvation that is attained\nentirely through the actions of God, even as it requires,\nconstitutively, an individual’s willed response of faith. The\ndetails of Augustine’s positive account remain a matter of\ncontroversy. He clearly affirms that the will is by its nature a\nself-determining power—no powers external to it determine its\nchoice—and that this feature is the basis of its freedom. But he\ndoes not explicitly rule out the will’s being internally\ndetermined by psychological factors, as Chrysippus held, and Augustine\nhad theological reasons that might favor (as well as others that would\noppose) the thesis that all things are determined in some manner by\nGod. Scholars divide on whether Augustine was a libertarian or instead\na kind of compatibilist with respect to metaphysical freedom.\n(Macdonald 1999 and Stump 2006 argue the former, Baker 2003 and\nCouenhoven 2007 the latter.) It is clear, however, that Augustine\nthought that we are powerfully shaped by wrongly-ordered desires that\ncan make it impossible for us to wholeheartedly will ends\ncontrary to those desires, for a sustained period of time. This\ncondition entails an absence of something more valuable, ‘true\nfreedom’, in which our wills are aligned with the Good, a\nfreedom that can be attained only by a transformative operation of\ndivine grace. This latter, psychological conception of freedom of will\nclearly echoes Plato’s notion of the soul’s (possible)\ninner justice.\n\nThomas Aquinas (1225–1274) attempted to synthesize major strands\nof Aristotle’s systematic philosophy with Christian theology,\nand so Aquinas begins his complex discussion of human action and\nchoice by agreeing with Aristotle that creatures such as ourselves who\nare endowed with both intellect and will are hardwired to will certain\ngeneral ends ordered to the most general goal of goodness. Will is\nrational desire: we cannot move towards that which does not\nappear to us at the time to be good. Freedom enters the picture when\nwe consider various means to these ends and move ourselves to activity\nin pursuit of certain of them. Our will is free in that it is not\nfixed by nature on any particular means, and they generally do not\nappear to us either as unqualifiedly good or as uniquely satisfying\nthe end we wish to fulfill. Furthermore, what appears to us to be good\ncan vary widely—even, over time, intra-personally. So much is\nconsistent with saying that in a given total circumstance (including\none’s present beliefs and desires), one is necessitated to will\nas one does. For this reason, some commentators have taken Aquinas to\nbe a kind of compatibilist concerning freedom and causal or\ntheological determinism. In his most extended defense of the thesis\nthat the will is not ‘compelled’ (DM 6), Aquinas\nnotes three ways that the will might reject an option it sees as\nattractive: (i) it finds another option more attractive, (ii) it comes\nto think of some circumstance rendering an alternative more favorable\n“by some chance circumstance, external or internal”, and\n(iii) the person is momentarily disposed to find an alternative\nattractive by virtue of a non-innate state that is subject to the will\n(e.g., being angry vs being at peace). The first consideration is\nclearly consistent with compatibilism. The second at best points to a\nkind of contingency that is not grounded in the activity of the will\nitself. And one wanting to read Aquinas as a libertarian might worry\nthat his third consideration just passes the buck: even if we do\nsometimes have an ability to directly modify perception-coloring\nstates such as moods, Aquinas’s account of will as rational\ndesire seems to indicate that we will do so only if it seems\nto us on balance to be good to do so. Those who read Aquinas as a\nlibertarian point to the following further remark in this text:\n“Will itself can interfere with the process [of some\ncause’s moving the will] either by refusing to consider what\nattracts it to will or by considering its opposite: namely, that there\nis a bad side to what is being proposed…” (Reply to 15;\nsee also DV 24.2). For discussion, see MacDonald (1998), Stump (2003,\nch. 9) and especially Hoffman & Michon (2017), which offers the\nmost comprehensive analysis of relevant texts to date.\n\nJohn Duns Scotus (1265/66–1308) was the stoutest defender in the\nmedieval era of a strongly libertarian conception of the will,\nmaintaining on introspective grounds that will by its very nature is\nsuch that “nothing other than the will is the total cause”\nof its activity (QAM). Indeed, he held the unusual view that\nnot only up to but at the very instant that one is willing\nX, it is possible for one to will Y or at least not to will\nX. (He articulates this view through the puzzling claim that a\nsingle instant of time comprises two ‘instants of nature’,\nat the first but not the second of which alternative possibilities are\npreserved.) In opposition to Aquinas and other medieval Aristotelians,\nScotus maintained that a precondition of our freedom is that there are\ntwo fundamentally distinct ways things can seem good to us: as\npractically advantageous to us or as according with justice. Contrary\nto some popular accounts, however, Scotus allowed that the scope of\navailable alternatives for a person will be more or less constricted.\nHe grants that we are not capable of willing something in which we see\nno good whatsoever, nor of positively repudiating something which\nappears to us as unqualifiedly good. However, in accordance with his\nuncompromising position that nothing can be the total cause of the\nwill other than itself, he held that where something does appear to us\nas unqualifiedly good (perfectly suited both to our advantage and\njustice)—viz., in the ‘beatific vision’ of God in\nthe afterlife—we still can refrain from willing it. For\ndiscussion, see\n John Duns Scotus, §5.2.\n",
    "section_title": "1.1 Ancient and Medieval Period",
    "entry_title": "Free Will",
    "hierarchy_title": "Free Will || Major Historical Contributions || Ancient and Medieval Period",
    "tokenized_text": [
        "major",
        "historical",
        "contribution",
        "ancient",
        "medieval",
        "period",
        "ancient",
        "medieval",
        "period",
        "one",
        "find",
        "scholarly",
        "debate",
        "origin",
        "notion",
        "free",
        "western",
        "philosophy",
        "see",
        "eg",
        "dihle",
        "response",
        "frede",
        "dihle",
        "finding",
        "st",
        "augustine",
        "ce",
        "frede",
        "stoic",
        "epictetus",
        "c",
        "c",
        "ce",
        "debate",
        "presupposes",
        "fairly",
        "particular",
        "highly",
        "conceptualized",
        "concept",
        "free",
        "dihle",
        "later",
        "origin",
        "reflecting",
        "yet",
        "particular",
        "concept",
        "view",
        "frede",
        "instead",
        "look",
        "generally",
        "philosophical",
        "reflection",
        "choicedirected",
        "control",
        "one",
        "action",
        "find",
        "significant",
        "discussion",
        "plato",
        "aristotle",
        "cf",
        "irwin",
        "indeed",
        "matter",
        "many",
        "major",
        "philosophical",
        "issue",
        "plato",
        "aristotle",
        "give",
        "importantly",
        "different",
        "emphasis",
        "inform",
        "much",
        "subsequent",
        "thought",
        "book",
        "iv",
        "republic",
        "plato",
        "posit",
        "rational",
        "spirited",
        "appetitive",
        "aspect",
        "human",
        "soul",
        "wise",
        "person",
        "strives",
        "inner",
        "justice",
        "condition",
        "part",
        "soul",
        "play",
        "proper",
        "rolereason",
        "guide",
        "spirited",
        "nature",
        "ally",
        "reason",
        "exhorting",
        "oneself",
        "reason",
        "deems",
        "proper",
        "passion",
        "subjugated",
        "determination",
        "reason",
        "absence",
        "justice",
        "individual",
        "enslaved",
        "passion",
        "hence",
        "freedom",
        "plato",
        "kind",
        "selfmastery",
        "attained",
        "developing",
        "virtue",
        "wisdom",
        "courage",
        "temperance",
        "resulting",
        "one",
        "liberation",
        "tyranny",
        "base",
        "desire",
        "acquisition",
        "accurate",
        "understanding",
        "resolute",
        "pursuit",
        "good",
        "hecht",
        "aristotle",
        "share",
        "plato",
        "concern",
        "cultivating",
        "virtue",
        "give",
        "greater",
        "theoretical",
        "attention",
        "role",
        "choice",
        "initiating",
        "individual",
        "action",
        "time",
        "result",
        "habit",
        "good",
        "ill",
        "book",
        "iii",
        "nicomachean",
        "ethic",
        "aristotle",
        "say",
        "unlike",
        "nonrational",
        "agent",
        "power",
        "much",
        "voluntary",
        "origin",
        "u",
        "aware",
        "particular",
        "circumstance",
        "action",
        "furthermore",
        "mature",
        "human",
        "make",
        "choice",
        "deliberating",
        "different",
        "available",
        "mean",
        "end",
        "drawing",
        "rational",
        "principle",
        "action",
        "choose",
        "consistently",
        "well",
        "poorly",
        "virtuous",
        "vicious",
        "character",
        "form",
        "time",
        "power",
        "either",
        "virtuous",
        "vicious",
        "question",
        "aristotle",
        "seems",
        "recognize",
        "satisfactorily",
        "answering",
        "whether",
        "choice",
        "individual",
        "make",
        "given",
        "occasion",
        "wholly",
        "determined",
        "internal",
        "stateperception",
        "circumstance",
        "relevant",
        "belief",
        "desire",
        "general",
        "character",
        "disposition",
        "wherever",
        "continuum",
        "virtue",
        "vice",
        "may",
        "and",
        "external",
        "circumstance",
        "say",
        "man",
        "father",
        "action",
        "child",
        "that",
        "person",
        "character",
        "shape",
        "act",
        "one",
        "might",
        "worry",
        "seems",
        "entail",
        "person",
        "could",
        "done",
        "otherwiseat",
        "moment",
        "choice",
        "control",
        "present",
        "character",
        "isand",
        "responsible",
        "choosing",
        "aristotle",
        "responds",
        "contending",
        "present",
        "character",
        "partly",
        "result",
        "previous",
        "choice",
        "made",
        "claim",
        "plausible",
        "enough",
        "seems",
        "pas",
        "buck",
        "since",
        "man",
        "father",
        "earlier",
        "choice",
        "action",
        "note",
        "contribution",
        "subsequent",
        "century",
        "hellenistic",
        "era",
        "see",
        "bobzien",
        "period",
        "dominated",
        "debate",
        "epicurean",
        "stoic",
        "academic",
        "skeptic",
        "concerned",
        "freedom",
        "debate",
        "centered",
        "place",
        "determinism",
        "fate",
        "governing",
        "human",
        "action",
        "life",
        "stoic",
        "epicurean",
        "believed",
        "ordinary",
        "thing",
        "human",
        "soul",
        "included",
        "corporeal",
        "governed",
        "natural",
        "law",
        "principle",
        "stoic",
        "believed",
        "human",
        "choice",
        "behavior",
        "causally",
        "determined",
        "held",
        "compatible",
        "action",
        "u",
        "chrysippus",
        "ably",
        "defended",
        "position",
        "contending",
        "action",
        "come",
        "when",
        "determining",
        "factor",
        "action",
        "external",
        "circumstance",
        "compelling",
        "act",
        "instead",
        "choice",
        "grounded",
        "perception",
        "option",
        "hence",
        "moral",
        "responsibility",
        "issue",
        "whether",
        "one",
        "choice",
        "determined",
        "manner",
        "determined",
        "epicurus",
        "follower",
        "mechanistic",
        "conception",
        "bodily",
        "action",
        "stoic",
        "held",
        "thing",
        "human",
        "soul",
        "included",
        "constituted",
        "atom",
        "whose",
        "lawgoverned",
        "behavior",
        "fix",
        "behavior",
        "everything",
        "made",
        "atom",
        "rejected",
        "determinism",
        "supposing",
        "atom",
        "though",
        "lawgoverned",
        "susceptible",
        "slight",
        "swerve",
        "departure",
        "usual",
        "path",
        "epicurus",
        "often",
        "understood",
        "seeking",
        "ground",
        "freedom",
        "human",
        "willing",
        "indeterministic",
        "swerve",
        "matter",
        "controversy",
        "understanding",
        "aim",
        "correct",
        "thought",
        "scheme",
        "might",
        "work",
        "detail",
        "known",
        "little",
        "know",
        "view",
        "matter",
        "stem",
        "chiefly",
        "account",
        "given",
        "follower",
        "lucretius",
        "sixbook",
        "poem",
        "nature",
        "thing",
        "see",
        "bobzien",
        "discussion",
        "final",
        "notable",
        "figure",
        "period",
        "alexander",
        "aphrodisia",
        "important",
        "peripatetic",
        "commentator",
        "aristotle",
        "fate",
        "alexander",
        "sharply",
        "criticizes",
        "position",
        "stoic",
        "go",
        "resolve",
        "ambiguity",
        "aristotle",
        "question",
        "determining",
        "nature",
        "character",
        "individual",
        "choice",
        "maintaining",
        "given",
        "shaping",
        "factor",
        "remains",
        "open",
        "person",
        "act",
        "freely",
        "fact",
        "many",
        "scholar",
        "see",
        "alexander",
        "first",
        "unambiguously",
        "libertarian",
        "theorist",
        "information",
        "theory",
        "see",
        "section",
        "augustine",
        "central",
        "bridge",
        "ancient",
        "medieval",
        "era",
        "philosophy",
        "mature",
        "thinking",
        "influenced",
        "early",
        "encounter",
        "late",
        "classical",
        "neoplatonist",
        "thought",
        "transformed",
        "theological",
        "view",
        "embrace",
        "adult",
        "christian",
        "conversion",
        "famously",
        "recounted",
        "confession",
        "work",
        "earlier",
        "free",
        "choice",
        "augustine",
        "struggle",
        "draw",
        "together",
        "coherent",
        "whole",
        "doctrine",
        "creaturely",
        "misuse",
        "freedom",
        "god",
        "source",
        "evil",
        "world",
        "human",
        "corrupted",
        "fall",
        "grace",
        "earliest",
        "human",
        "being",
        "necessitating",
        "salvation",
        "attained",
        "entirely",
        "action",
        "god",
        "even",
        "requires",
        "constitutively",
        "individual",
        "willed",
        "response",
        "faith",
        "detail",
        "augustine",
        "positive",
        "account",
        "remain",
        "matter",
        "controversy",
        "clearly",
        "affirms",
        "nature",
        "selfdetermining",
        "powerno",
        "power",
        "external",
        "determine",
        "choiceand",
        "feature",
        "basis",
        "freedom",
        "explicitly",
        "rule",
        "internally",
        "determined",
        "psychological",
        "factor",
        "chrysippus",
        "held",
        "augustine",
        "theological",
        "reason",
        "might",
        "favor",
        "well",
        "others",
        "would",
        "oppose",
        "thesis",
        "thing",
        "determined",
        "manner",
        "god",
        "scholar",
        "divide",
        "whether",
        "augustine",
        "libertarian",
        "instead",
        "kind",
        "compatibilist",
        "respect",
        "metaphysical",
        "freedom",
        "macdonald",
        "stump",
        "argue",
        "former",
        "baker",
        "couenhoven",
        "latter",
        "clear",
        "however",
        "augustine",
        "thought",
        "powerfully",
        "shaped",
        "wronglyordered",
        "desire",
        "make",
        "impossible",
        "u",
        "wholeheartedly",
        "end",
        "contrary",
        "desire",
        "sustained",
        "period",
        "time",
        "condition",
        "entail",
        "absence",
        "something",
        "valuable",
        "true",
        "freedom",
        "will",
        "aligned",
        "good",
        "freedom",
        "attained",
        "transformative",
        "operation",
        "divine",
        "grace",
        "latter",
        "psychological",
        "conception",
        "freedom",
        "clearly",
        "echo",
        "plato",
        "notion",
        "soul",
        "possible",
        "inner",
        "justice",
        "thomas",
        "aquinas",
        "attempted",
        "synthesize",
        "major",
        "strand",
        "aristotle",
        "systematic",
        "philosophy",
        "christian",
        "theology",
        "aquinas",
        "begin",
        "complex",
        "discussion",
        "human",
        "action",
        "choice",
        "agreeing",
        "aristotle",
        "creature",
        "endowed",
        "intellect",
        "hardwired",
        "certain",
        "general",
        "end",
        "ordered",
        "general",
        "goal",
        "goodness",
        "rational",
        "desire",
        "move",
        "towards",
        "appear",
        "u",
        "time",
        "good",
        "freedom",
        "enters",
        "picture",
        "consider",
        "various",
        "mean",
        "end",
        "move",
        "activity",
        "pursuit",
        "certain",
        "free",
        "fixed",
        "nature",
        "particular",
        "mean",
        "generally",
        "appear",
        "u",
        "either",
        "unqualifiedly",
        "good",
        "uniquely",
        "satisfying",
        "end",
        "wish",
        "fulfill",
        "furthermore",
        "appears",
        "u",
        "good",
        "vary",
        "widelyeven",
        "time",
        "intrapersonally",
        "much",
        "consistent",
        "saying",
        "given",
        "total",
        "circumstance",
        "including",
        "one",
        "present",
        "belief",
        "desire",
        "one",
        "necessitated",
        "one",
        "reason",
        "commentator",
        "taken",
        "aquinas",
        "kind",
        "compatibilist",
        "concerning",
        "freedom",
        "causal",
        "theological",
        "determinism",
        "extended",
        "defense",
        "thesis",
        "compelled",
        "dm",
        "aquinas",
        "note",
        "three",
        "way",
        "might",
        "reject",
        "option",
        "see",
        "attractive",
        "find",
        "another",
        "option",
        "attractive",
        "ii",
        "come",
        "think",
        "circumstance",
        "rendering",
        "alternative",
        "favorable",
        "chance",
        "circumstance",
        "external",
        "internal",
        "iii",
        "person",
        "momentarily",
        "disposed",
        "find",
        "alternative",
        "attractive",
        "virtue",
        "noninnate",
        "state",
        "subject",
        "eg",
        "angry",
        "v",
        "peace",
        "first",
        "consideration",
        "clearly",
        "consistent",
        "compatibilism",
        "second",
        "best",
        "point",
        "kind",
        "contingency",
        "grounded",
        "activity",
        "one",
        "wanting",
        "read",
        "aquinas",
        "libertarian",
        "might",
        "worry",
        "third",
        "consideration",
        "pass",
        "buck",
        "even",
        "sometimes",
        "ability",
        "directly",
        "modify",
        "perceptioncoloring",
        "state",
        "mood",
        "aquinas",
        "account",
        "rational",
        "desire",
        "seems",
        "indicate",
        "seems",
        "u",
        "balance",
        "good",
        "read",
        "aquinas",
        "libertarian",
        "point",
        "following",
        "remark",
        "text",
        "interfere",
        "process",
        "cause",
        "moving",
        "either",
        "refusing",
        "consider",
        "attracts",
        "considering",
        "opposite",
        "namely",
        "bad",
        "side",
        "proposed",
        "reply",
        "see",
        "also",
        "dv",
        "discussion",
        "see",
        "macdonald",
        "stump",
        "ch",
        "especially",
        "hoffman",
        "michon",
        "offer",
        "comprehensive",
        "analysis",
        "relevant",
        "text",
        "date",
        "john",
        "dun",
        "scotus",
        "stoutest",
        "defender",
        "medieval",
        "era",
        "strongly",
        "libertarian",
        "conception",
        "maintaining",
        "introspective",
        "ground",
        "nature",
        "nothing",
        "total",
        "cause",
        "activity",
        "qam",
        "indeed",
        "held",
        "unusual",
        "view",
        "instant",
        "one",
        "willing",
        "x",
        "possible",
        "one",
        "least",
        "x",
        "articulates",
        "view",
        "puzzling",
        "claim",
        "single",
        "instant",
        "time",
        "comprises",
        "two",
        "instant",
        "nature",
        "first",
        "second",
        "alternative",
        "possibility",
        "preserved",
        "opposition",
        "aquinas",
        "medieval",
        "aristotelian",
        "scotus",
        "maintained",
        "precondition",
        "freedom",
        "two",
        "fundamentally",
        "distinct",
        "way",
        "thing",
        "seem",
        "good",
        "u",
        "practically",
        "advantageous",
        "u",
        "according",
        "justice",
        "contrary",
        "popular",
        "account",
        "however",
        "scotus",
        "allowed",
        "scope",
        "available",
        "alternative",
        "person",
        "le",
        "constricted",
        "grant",
        "capable",
        "willing",
        "something",
        "see",
        "good",
        "whatsoever",
        "positively",
        "repudiating",
        "something",
        "appears",
        "u",
        "unqualifiedly",
        "good",
        "however",
        "accordance",
        "uncompromising",
        "position",
        "nothing",
        "total",
        "cause",
        "held",
        "something",
        "appear",
        "u",
        "unqualifiedly",
        "good",
        "perfectly",
        "suited",
        "advantage",
        "justice",
        "viz",
        "beatific",
        "vision",
        "god",
        "afterlifewe",
        "still",
        "refrain",
        "willing",
        "discussion",
        "see",
        "john",
        "dun",
        "scotus"
    ]
}