{
    "main_text": "The Right to Exit\n4. The Right to Exit\n\nNotwithstanding the threats posed by certain freely formed groups, the\nright to exclude is grounded in the belief that, for our associations\nto be valuable, they must be freely chosen in some measure (Kateb\n1998: 36). However, since not all associations operate according to\neither implicit or explicit declarations of consent, exactly what\ncounts as consent is a difficult thing to assess: How do we\nknow when association is free (Okin 2002)? This problem is exacerbated\nby the hierarchical form that many associations take. The paradigmatic\nexample of a hierarchical association is that between parents and\nchildren. But, hierarchy pervades other connections—between\nolder and younger siblings, employers and employees, states and\ncitizens, and spouses. For some, the fact of acquiescence is\nsufficient for consent: if a person remains in an association, then\nshe seems to provide evidence that she consents to continued\nmembership. Regardless of how high the cost of leaving an association\nmight be, the person who remains does not exercise her right to exit,\nwhich she meaningfully has so long as she is not being physically\nrestrained, and, thus, she is properly describable as free (Kukathas\n2003: 113). According to this line of thought, a wife who is\npsychologically tormented by her spouse, suffering from extreme\npoverty, and terrified by the outside world as an inhospitable place,\nremains free to leave her husband.\n\nFor those who doubt that this extreme view is persuasive, the question\nbecomes how to make rights of exit realistic. Galston identifies four\nconditions for a meaningful right to exit: knowledge, capacity,\npsychological independence, and fitness. The first condition refers to\nbrute awareness that alternatives exist; the second refers to an\nability to assess those alternatives; the third to freedom from\npernicious forms of brainwashing and freedom to act on the results of\nthat assessment; and the fourth to the ability to move into and\nparticipate in other forms of life (Galston 1995: 525). When these\nconditions are met, we can conclude that the person has a meaningful\nright to exit, and the association passes a threshold that should be\nacceptable to liberals. Such conditions show that in many fundamental\nassociations, such as young children’s family arrangement, it\nmakes no sense to talk of a right—a freedom—to exit.\nChildren are liable to the associative powers of their guardians, and\nusually this serves their best interests.\n\nIn the case of employer-employee associations, the right to exit\nmerits special attention since, for most of us, work is something we\nhave to do, though we have varying degrees of control over the kinds\nof work we do and, consequently, the people with whom we do it. When\nour choice is between doing truly awful work and starvation, our\noptions are severely limited. If we must—on pain of\nsevere privation—say “yes” to dirty, dangerous,\ndull, or degrading work, then we lack a meaningful option to exit. On\nthis view, genuine, or even minimal, freedom of association at work\nrequires that we have the ability to say “no” to all and\nany work (Widerquist 2013; Pateman 2007).\n\nIn the same way that we have limited exit-rights in our work lives, we\nhave limited exit-rights in our political lives as members of states\nand nations. As noted above, we cannot exit entirely from the realm of\nstate jurisdiction. We will always fall within the jurisdiction of\nsome state. And, to have a meaningful right to exit any one\nstate’s jurisdiction, we must meet, if not exceed,\nGalston’s tests of knowledge, capacity, independence, and\nfitness. In a nutshell, we must not only have the resources to leave,\nbut also be sufficiently appealing—or be in sufficient\nneed—that another state will accept us.\nLimits to the right of exit\n\nThe points above note some of the physical and psychological limits to\nour rights to exit. There are normative limits to these rights\ntoo.\nSupporting Dissent: The rights to remain: Over and above\nquestions of when exit is truly available, we can ask why excluders\nand people who push “exiters” out by imposing enormous\ncosts on them to stay, should have so resounding a say on cultural and\ngroup organization. For instance, instead of focusing on the\nimportance of women having the freedom to exit from their home,\ncommunity, or culture, we could focus instead on securing them a\nsignificant voice within their family’s or culture’s\nformations and practices (Okin 2002: 207). For example, we could focus\non why devout Catholic women who care deeply about their Church are\ndenied a significant role in the ecclesiastical affairs of that group,\nfor no reason other than their gender. For another example, we could\nask why empirically dubious claims about homosexuals’ inability\nto lead should prevent people like James Dale from becoming Scout\nmasters. By focusing on the right to exit as an adequate measure of an\nassociation’s members’ freedom, we ignore the goods that\ncould be captured, and the justice done, by instead strengthening\npeople’s rightswithin an association, which could force\nchange from within. Undeniably, this argument that people be supported\nto remain must be qualified, since it invites the state to dictate\nboth the membership and the internal rules of associations (an issue\nexplored below).\nResponsibilities to Dependents: In family life,\ncaregivers have responsibilities to dependents, both young and old,\nwhich can limit their rights to exit from those family connections.\nEven when caregivers do successfully pass the caregiving torch to\nothers, by outsourcing or formally transferring care duties, they\nusually cannot release themselves from all associative responsibility,\nbut must pay financially for the care of their (former) associates.\nAdditionally, if we adopt a strong view of the binding force of vows\nand promises, then caregivers lack the same kinds of exit rights that\nnon-caregivers have, or at the very least caregivers do serious moral\nwrong when they assert their exit rights.\nImportance of Education: As noted above, parents’\ndesires for their children can often conflict with the important forms\nof socialization that children usually experience at school. The\nUnited Kingdom and France offer two different approaches to how far\nparents’ control should impact on children’s educational\nexperiences. France, with an undergirding principle of\nlaïcité, offers an especially restrictive\nunderstanding of how far freedom of association may impact on the\ncurriculum, dress code and purposes of education (Laborde, 2006;\nGaleotti, 2002: 115–137). At the other end, the UK’s\nsupport of religious schools, although somewhat restricted with\nrespect to curriculum, permits broader scope for freedom of\nassociation. That said, both the UK and France, like most\njurisdictions, limit children’s own right to exit from school\nbefore they reach a certain age of maturity. Whichever of these two\neducational strategies contributes best to forms of association more\nconducive to democratic citizenship is preferable in that respect to\nalternatives. This is potentially not a question that can be answered\nwithout attending to the economic, historical, and social fabric of\nthe community in question.\nLifestyle Decisions and Social Good: Members of gated\ncommunities exercise both rights of exit and of exclusion: they leave\nbehind the communities to which they did belong, often with the\nexpress intention of withdrawing contributions to which they believe\ntheir former communities have no entitlement. They also, as a\ncommunity, then decide on who gets to live in their newly formed\ncommunities. Indeed, the two rights, exit and exclusion, often exist\neither in tandem or as a fall-back. When parents remove their child\nfrom a desegregated school, their lack of a right to exclude prompts\nthem to exercise their presumably less preferred option of\nexiting.\n\nWhen people are segregated from one another for whatever reason, there\ncan be important reasons to limit their freedom of association, to\nencourage social mixing across class and race lines among other\nthings. When people employ their rights of exclusion and exit too\nreadily, and for reasons that conflict with equal citizenship, a\nsociety may need to resort to socially engineering certain forms of\nassociation, such as mixing rent-controlled and private housing, and\nshaping social space to encourage interactions among people of\ndifferent races, ages and classes. If trust is a necessary feature of\ndemocratic life, then the citizenry’s habits and living patterns\nbecome an important resource. To generate this resource, a society\nmust attend to the concrete spaces of interaction wherein trust,\nrather than distrust, is more likely to emerge (Ryan 1998: 322). A\ncommunity divided into gated communities, racially-segregated suburbs\nand stigmatized ghettos is ill-equipped to provide space within the\nwider political association for trust to emerge (Anderson 2010: 34;\nAllen 2004: 165).\n",
    "section_title": "4. The Right to Exit",
    "entry_title": "Freedom of Association",
    "hierarchy_title": "Freedom of Association || The Right to Exit",
    "tokenized_text": [
        "right",
        "exit",
        "right",
        "exit",
        "notwithstanding",
        "threat",
        "posed",
        "certain",
        "freely",
        "formed",
        "group",
        "right",
        "exclude",
        "grounded",
        "belief",
        "association",
        "valuable",
        "must",
        "freely",
        "chosen",
        "measure",
        "kateb",
        "however",
        "since",
        "association",
        "operate",
        "according",
        "either",
        "implicit",
        "explicit",
        "declaration",
        "consent",
        "exactly",
        "count",
        "consent",
        "difficult",
        "thing",
        "ass",
        "know",
        "association",
        "free",
        "okin",
        "problem",
        "exacerbated",
        "hierarchical",
        "form",
        "many",
        "association",
        "take",
        "paradigmatic",
        "example",
        "hierarchical",
        "association",
        "parent",
        "child",
        "hierarchy",
        "pervades",
        "connectionsbetween",
        "older",
        "younger",
        "sibling",
        "employer",
        "employee",
        "state",
        "citizen",
        "spouse",
        "fact",
        "acquiescence",
        "sufficient",
        "consent",
        "person",
        "remains",
        "association",
        "seems",
        "provide",
        "evidence",
        "consent",
        "continued",
        "membership",
        "regardless",
        "high",
        "cost",
        "leaving",
        "association",
        "might",
        "person",
        "remains",
        "exercise",
        "right",
        "exit",
        "meaningfully",
        "long",
        "physically",
        "restrained",
        "thus",
        "properly",
        "describable",
        "free",
        "kukathas",
        "according",
        "line",
        "thought",
        "wife",
        "psychologically",
        "tormented",
        "spouse",
        "suffering",
        "extreme",
        "poverty",
        "terrified",
        "outside",
        "world",
        "inhospitable",
        "place",
        "remains",
        "free",
        "leave",
        "husband",
        "doubt",
        "extreme",
        "view",
        "persuasive",
        "question",
        "becomes",
        "make",
        "right",
        "exit",
        "realistic",
        "galston",
        "identifies",
        "four",
        "condition",
        "meaningful",
        "right",
        "exit",
        "knowledge",
        "capacity",
        "psychological",
        "independence",
        "fitness",
        "first",
        "condition",
        "refers",
        "brute",
        "awareness",
        "alternative",
        "exist",
        "second",
        "refers",
        "ability",
        "ass",
        "alternative",
        "third",
        "freedom",
        "pernicious",
        "form",
        "brainwashing",
        "freedom",
        "act",
        "result",
        "assessment",
        "fourth",
        "ability",
        "move",
        "participate",
        "form",
        "life",
        "galston",
        "condition",
        "met",
        "conclude",
        "person",
        "meaningful",
        "right",
        "exit",
        "association",
        "pass",
        "threshold",
        "acceptable",
        "liberal",
        "condition",
        "show",
        "many",
        "fundamental",
        "association",
        "young",
        "child",
        "family",
        "arrangement",
        "make",
        "sense",
        "talk",
        "righta",
        "freedomto",
        "exit",
        "child",
        "liable",
        "associative",
        "power",
        "guardian",
        "usually",
        "serf",
        "best",
        "interest",
        "case",
        "employeremployee",
        "association",
        "right",
        "exit",
        "merit",
        "special",
        "attention",
        "since",
        "u",
        "work",
        "something",
        "though",
        "varying",
        "degree",
        "control",
        "kind",
        "work",
        "consequently",
        "people",
        "choice",
        "truly",
        "awful",
        "work",
        "starvation",
        "option",
        "severely",
        "limited",
        "muston",
        "pain",
        "severe",
        "privationsay",
        "yes",
        "dirty",
        "dangerous",
        "dull",
        "degrading",
        "work",
        "lack",
        "meaningful",
        "option",
        "exit",
        "view",
        "genuine",
        "even",
        "minimal",
        "freedom",
        "association",
        "work",
        "requires",
        "ability",
        "say",
        "work",
        "widerquist",
        "pateman",
        "way",
        "limited",
        "exitrights",
        "work",
        "life",
        "limited",
        "exitrights",
        "political",
        "life",
        "member",
        "state",
        "nation",
        "noted",
        "exit",
        "entirely",
        "realm",
        "state",
        "jurisdiction",
        "always",
        "fall",
        "within",
        "jurisdiction",
        "state",
        "meaningful",
        "right",
        "exit",
        "one",
        "state",
        "jurisdiction",
        "must",
        "meet",
        "exceed",
        "galston",
        "test",
        "knowledge",
        "capacity",
        "independence",
        "fitness",
        "nutshell",
        "must",
        "resource",
        "leave",
        "also",
        "sufficiently",
        "appealingor",
        "sufficient",
        "needthat",
        "another",
        "state",
        "accept",
        "u",
        "limit",
        "right",
        "exit",
        "point",
        "note",
        "physical",
        "psychological",
        "limit",
        "right",
        "exit",
        "normative",
        "limit",
        "right",
        "supporting",
        "dissent",
        "right",
        "remain",
        "question",
        "exit",
        "truly",
        "available",
        "ask",
        "excluders",
        "people",
        "push",
        "exiters",
        "imposing",
        "enormous",
        "cost",
        "stay",
        "resounding",
        "say",
        "cultural",
        "group",
        "organization",
        "instance",
        "instead",
        "focusing",
        "importance",
        "woman",
        "freedom",
        "exit",
        "home",
        "community",
        "culture",
        "could",
        "focus",
        "instead",
        "securing",
        "significant",
        "voice",
        "within",
        "family",
        "culture",
        "formation",
        "practice",
        "okin",
        "example",
        "could",
        "focus",
        "devout",
        "catholic",
        "woman",
        "care",
        "deeply",
        "church",
        "denied",
        "significant",
        "role",
        "ecclesiastical",
        "affair",
        "group",
        "reason",
        "gender",
        "another",
        "example",
        "could",
        "ask",
        "empirically",
        "dubious",
        "claim",
        "homosexual",
        "inability",
        "lead",
        "prevent",
        "people",
        "like",
        "james",
        "dale",
        "becoming",
        "scout",
        "master",
        "focusing",
        "right",
        "exit",
        "adequate",
        "measure",
        "association",
        "member",
        "freedom",
        "ignore",
        "good",
        "could",
        "captured",
        "justice",
        "done",
        "instead",
        "strengthening",
        "people",
        "rightswithin",
        "association",
        "could",
        "force",
        "change",
        "within",
        "undeniably",
        "argument",
        "people",
        "supported",
        "remain",
        "must",
        "qualified",
        "since",
        "invite",
        "state",
        "dictate",
        "membership",
        "internal",
        "rule",
        "association",
        "issue",
        "explored",
        "responsibility",
        "dependent",
        "family",
        "life",
        "caregiver",
        "responsibility",
        "dependent",
        "young",
        "old",
        "limit",
        "right",
        "exit",
        "family",
        "connection",
        "even",
        "caregiver",
        "successfully",
        "pas",
        "caregiving",
        "torch",
        "others",
        "outsourcing",
        "formally",
        "transferring",
        "care",
        "duty",
        "usually",
        "release",
        "associative",
        "responsibility",
        "must",
        "pay",
        "financially",
        "care",
        "former",
        "associate",
        "additionally",
        "adopt",
        "strong",
        "view",
        "binding",
        "force",
        "vow",
        "promise",
        "caregiver",
        "lack",
        "kind",
        "exit",
        "right",
        "noncaregivers",
        "least",
        "caregiver",
        "serious",
        "moral",
        "wrong",
        "assert",
        "exit",
        "right",
        "importance",
        "education",
        "noted",
        "parent",
        "desire",
        "child",
        "often",
        "conflict",
        "important",
        "form",
        "socialization",
        "child",
        "usually",
        "experience",
        "school",
        "united",
        "kingdom",
        "france",
        "offer",
        "two",
        "different",
        "approach",
        "far",
        "parent",
        "control",
        "impact",
        "child",
        "educational",
        "experience",
        "france",
        "undergirding",
        "principle",
        "laïcité",
        "offer",
        "especially",
        "restrictive",
        "understanding",
        "far",
        "freedom",
        "association",
        "may",
        "impact",
        "curriculum",
        "dress",
        "code",
        "purpose",
        "education",
        "laborde",
        "galeotti",
        "end",
        "uk",
        "support",
        "religious",
        "school",
        "although",
        "somewhat",
        "restricted",
        "respect",
        "curriculum",
        "permit",
        "broader",
        "scope",
        "freedom",
        "association",
        "said",
        "uk",
        "france",
        "like",
        "jurisdiction",
        "limit",
        "child",
        "right",
        "exit",
        "school",
        "reach",
        "certain",
        "age",
        "maturity",
        "whichever",
        "two",
        "educational",
        "strategy",
        "contributes",
        "best",
        "form",
        "association",
        "conducive",
        "democratic",
        "citizenship",
        "preferable",
        "respect",
        "alternative",
        "potentially",
        "question",
        "answered",
        "without",
        "attending",
        "economic",
        "historical",
        "social",
        "fabric",
        "community",
        "question",
        "lifestyle",
        "decision",
        "social",
        "good",
        "member",
        "gated",
        "community",
        "exercise",
        "right",
        "exit",
        "exclusion",
        "leave",
        "behind",
        "community",
        "belong",
        "often",
        "express",
        "intention",
        "withdrawing",
        "contribution",
        "believe",
        "former",
        "community",
        "entitlement",
        "also",
        "community",
        "decide",
        "get",
        "live",
        "newly",
        "formed",
        "community",
        "indeed",
        "two",
        "right",
        "exit",
        "exclusion",
        "often",
        "exist",
        "either",
        "tandem",
        "fallback",
        "parent",
        "remove",
        "child",
        "desegregated",
        "school",
        "lack",
        "right",
        "exclude",
        "prompt",
        "exercise",
        "presumably",
        "le",
        "preferred",
        "option",
        "exiting",
        "people",
        "segregated",
        "one",
        "another",
        "whatever",
        "reason",
        "important",
        "reason",
        "limit",
        "freedom",
        "association",
        "encourage",
        "social",
        "mixing",
        "across",
        "class",
        "race",
        "line",
        "among",
        "thing",
        "people",
        "employ",
        "right",
        "exclusion",
        "exit",
        "readily",
        "reason",
        "conflict",
        "equal",
        "citizenship",
        "society",
        "may",
        "need",
        "resort",
        "socially",
        "engineering",
        "certain",
        "form",
        "association",
        "mixing",
        "rentcontrolled",
        "private",
        "housing",
        "shaping",
        "social",
        "space",
        "encourage",
        "interaction",
        "among",
        "people",
        "different",
        "race",
        "age",
        "class",
        "trust",
        "necessary",
        "feature",
        "democratic",
        "life",
        "citizenry",
        "habit",
        "living",
        "pattern",
        "become",
        "important",
        "resource",
        "generate",
        "resource",
        "society",
        "must",
        "attend",
        "concrete",
        "space",
        "interaction",
        "wherein",
        "trust",
        "rather",
        "distrust",
        "likely",
        "emerge",
        "ryan",
        "community",
        "divided",
        "gated",
        "community",
        "raciallysegregated",
        "suburb",
        "stigmatized",
        "ghetto",
        "illequipped",
        "provide",
        "space",
        "within",
        "wider",
        "political",
        "association",
        "trust",
        "emerge",
        "anderson",
        "allen"
    ]
}