{
    "main_text": "Do We Have Free Will? || Arguments Against the Reality of Free Will\n3.1 Arguments Against the Reality of Free Will\n\nThere are both a priori and empirical arguments against free will (See\nthe entry on\n skepticism about moral responsibility).\n Several of these start with an argument that free will is\nincompatible with causal determinism, which we will not rehearse here.\nInstead, we focus on arguments that human beings lack free will,\nagainst the background assumption that freedom and causal determinism\nare incompatible.\n\nThe most radical a priori argument is that free will is not merely\ncontingently absent but is impossible. Nietzsche 1886 [1966] argues to\nthis effect, and more recently it has been argued by Galen Strawson\n(1986, ch. 2; 1994, 2002). Strawson associates free will with being\n‘ultimately morally responsible’ for one’s actions.\nHe argues that, because how one acts is a result of, or explained by,\n“how one is, mentally speaking” (\\(M\\)), for one to be\nresponsible for that choice one must be responsible for \\(M\\). To be\nresponsible for \\(M\\), one must have chosen to be \\(M\\)\nitself—and that not blindly, but deliberately, in accordance\nwith some reasons \\(r_1\\). But for that choice to be a responsible\none, one must have chosen to be such as to be moved by \\(r_1\\),\nrequiring some further reasons \\(r_2\\) for such a choice. And so on,\nad infinitum. Free choice requires an impossible infinite\nregress of choices to be the way one is in making choices.\n\nThere have been numerous replies to Strawson’s argument. Mele\n(1995, 221ff.) argues that Strawson misconstrues the locus of freedom\nand responsibility. Freedom is principally a feature of our actions,\nand only derivatively of our characters from which such actions\nspring. The task of the theorist is to show how one is in rational,\nreflective control of the choices one makes, consistent with there\nbeing no freedom-negating conditions. While this seems right, when\nconsidering those theories that make one’s free control to\nreside directly in the causal efficacy of one’s reasons (such as\ncompatibilist reasons-responsive accounts or event-causal\nlibertarianism), it is not beside the point to reflect on how one came\nto be that way in the first place and to worry that such reflection\nshould lead one to conclude that true responsibility (and hence\nfreedom) is undermined, since a complete distal source of any action\nmay be found external to the agent. Clarke (2003, 170–76) argues\nthat an effective reply may be made by indeterminists, and, in\nparticular, by nondeterministic agent-causal theorists. Such theorists\ncontend that (i) aspects of ‘how one is, mentally\nspeaking’, fully explain an agent’s choice\nwithout causally determining it and (ii) the agent himself causes the\nchoice that is made (so that the agent’s antecedent state, while\ngrounding an explanation of the action, is not the complete causal\nsource of it). Since the agent’s exercise of this power is\ncausally undetermined, it is not true that there is a sufficient\n‘ultimate’ source of it external to the agent. Finally,\nMele (2006, 129–34, and 2017, 212–16) and O’Connor\n(2009b) suggest that freedom and moral responsibility come in\ndegrees and grow over time, reflecting the fact that ‘how one\nis, mentally speaking’ is increasingly shaped by one’s own\npast choices. Furthermore, some choices for a given individual may\nreflect more freedom and responsibility than others, which may be the\nkernel of truth behind Strawson’s sweeping argument. (For\ndiscussion of the ways that nature, nurture, and contingent\ncircumstances shape our behavior and raise deep issues concerning the\nextent of our freedom and responsibility, see Levy 2011 and\nRussell 2017, chs. 10–12.)\n\nA second family of arguments against free will contend that, in one\nway or another, nondeterministic theories of freedom entail either\nthat agents lack control over their choices or that the choices cannot\nbe adequately explained. These arguments are variously called the\n‘Mind’, ‘Rollback’, or ‘Luck’\nargument, with the latter admitting of several versions. (For\nstatements of such arguments, see van Inwagen 1983, ch. 4; 2000; Haji\n2001; Mele 2006; Shabo 2011, 2013, 2020; Coffman 2015). We note that\nsome philosophers advance such arguments not as parts of a general\ncase against free will, but merely as showing the inadequacy of\nspecific accounts of free will [see, e.g., Griffith 2010].) They each\ndescribe imagined cases—individual cases, or comparison of\nintra- or inter-world duplicate antecedent conditions followed by\ndiverging outcomes—designed to elicit the judgment that the\noccurrence of a choice that had remained unsettled given all\nprior causal factors can only be a ‘matter of chance’,\n‘random’, or ‘a matter of luck’. Such terms\nhave been imported from other contexts and have come to function as\nquasi-technical, unanalyzed concepts in these debates, and it is\nperhaps more helpful to avoid such proxies and to conduct the debates\ndirectly in terms of the metaphysical notion of control and epistemic\nnotion of explanation. Where the arguments question whether an\nundetermined agent can exercise appropriate control over the choice he\nmakes, proponents of nondeterministic theories often reply that\ncontrol is not exercised prior to, but at the time of the\nchoice—in the very act of bringing it about (see, e.g., Clarke\n2005 and O’Connor 2007). Where the arguments question whether\nundetermined choices can be adequately explained, the reply often\nconsists in identifying a form of explanation other than the form\ndemanded by the critic—a ‘noncontrastive’\nexplanation, perhaps, rather than a ‘contrastive’\nexplanation, or a species of contrastive explanation consistent with\nindeterminism (see, e.g., Kane 1999;\nClarke, 2003, ch. 8; and Franklin 2011a; 2018, ch. 5).\n\nWe now consider empirical arguments against human freedom. Some of\nthese stem from the physical sciences (while making assumptions\nconcerning the way physical phenomena fix psychological phenomena) and\nothers from neuroscience and psychology.\n\nIt used to be common for philosophers to argue that there is empirical\nreason to believe that the world in general is causally determined,\nand since human beings are parts of the world, they are too. Many took\nthis to be strongly confirmed by the spectacular success of Isaac\nNewton’s framework for understanding the universe as governed\neverywhere by fairly simple, exceptionless laws of motion. But the\nquantum revolution of the early twentieth century has made that\n‘clockwork universe’ image at least doubtful at the level\nof basic physics. While quantum mechanics has proven spectacularly\nsuccessful as a framework for making precise and accurate predictions\nof certain observable phenomena, its implications for the causal\nstructure of reality is still not well understood, and there are\ncompeting indeterministic and deterministic interpretations. See the\nentry on\n quantum mechanics\n for detailed discussion.) It is possible that indeterminacy on the\nsmall-scale, supposing it to be genuine, ‘cancels out’ at\nthe macroscopic scale of birds and buildings and people, so that\nbehavior at this scale is virtually deterministic. But this idea, once\ncommon, is now being challenged empirically, even at the level of\nbasic biology. Furthermore, the social, biological, and medical\nsciences, too, are rife with merely statistical generalizations.\nPlainly, the jury is out on all these inter-theoretic questions. But\nthat is just a way to say that current science does not\ndecisively support the idea that everything we do is pre-determined by\nthe past, and ultimately by the distant past, wholly out of our\ncontrol. For discussion, see Balaguer (2009), Koch (2009), Roskies\n(2014), Ellis (2016).\n\nMaybe, then, we are subject to myriad causal influences, but the sum\ntotal of these influences doesn’t determine what we do, they\nonly make it more or less likely that we’ll do this or that. Now\nsome of the a priori no-free-will arguments above center on\nnondeterministic theories according to which there are objective\nantecedent probabilities associated with each possible choice outcome.\nWhy objective probabilities of this kind might present special\nproblems beyond those posed by the absence of determinism has been\ninsufficiently explored to date. (For brief discussion, see Vicens\n2016 and O’Connor 2016.) But one philosopher who argues that\nthere is reason to hold that our actions, if undetermined, are\ngoverned by objective probabilities and that this fact calls into\nquestion whether we act freely is Derk Pereboom (2001, ch. 3; 2014,\nch. 3). Pereboom notes that our best physical theories indicate that\nstatistical laws govern isolated, small-scale physical events, and he\ninfers from the thesis that human beings are wholly physically\ncomposed that such statistical laws will also govern all the physical\ncomponents of human actions. Finally, Pereboom maintains that\nagent-causal libertarianism offers the correct analysis of free will.\nHe then invites us to imagine that the antecedent probability of some\nphysical component of an action occurring is \\(0.32\\). If the action\nis free while not violating the statistical law, then, in a scenario\nwith a large enough number of instances, this action would have to be\nfreely chosen close to \\(32\\) percent of the time. This leads to the\nproblem of “wild coincidences”:\n\n\nif the occurrence of these physical components were settled by the\nchoices of agent-causes, then their actually being chosen close to 32\npercent of the time would amount to a coincidence no less wild than\nthe coincidence of possible actions whose physical components have an\nantecedent probability of about 0.99 being chosen, over large enough\nnumber of instances, close to 99 percent of the time. The proposal\nthat agent-caused free choices do not diverge from what the\nstatistical laws predict for the physical components of our actions\nwould run so sharply counter to what we would expect as to make it\nincredible. (2014, 67)\n\n\nClarke (2010) questions the implicit assumption that free agent-causal\nchoices should be expected not to conform to physical\nstatistical laws, while O’Connor (2009a) challenges the more\ngeneral assumption that freedom requires that agent-causal choices not\nbe governed by statistical laws of any kind, as they plausibly would\nbe if the relevant psychological states/powers are strongly emergent\nfrom physical states of the human brain. Finally, Runyan 2018 argues\nthat Pereboom’s case rests on an implausible empirical assumption\nconcerning the evolution of objective probabilities concerning types\nof behavior over time. \n\nPereboom’s empirical basis for free will skepticism is very\ngeneral. Others see support for free will skepticism from specific\nfindings and theories in the human sciences. They point to evidence\nthat we can be unconsciously influenced in the choices we make by a\nrange of factors, including ones that are not motivationally relevant;\nthat we can come to believe that we chose to initiate a behavior that\nin fact was artificially induced; that people subject to certain\nneurological disorders will sometimes engage in purposive behavior\nwhile sincerely believing that they are not directing them. Finally, a\ngreat deal of attention has been given to the work of neuroscientist\nBenjamin Libet (2002). Libet conducted some simple experiments that\nseemed to reveal the existence of ‘preparatory’ brain\nactivity (the ‘readiness potential’) shortly before a subject engages\nin an ostensibly spontaneous action. (Libet interpreted this activity\nas the brain’s ‘deciding’ what to do before we are\nconsciously settled on a course of action.) Wegner (2002) surveys all\nof these findings (some of which are due to his own work as a social\npsychologist) and argues on their basis that the experience of\nconscious willing is ‘an illusion’. For criticism of such\narguments, see Mele (2009); Nahmias (2014);\nMudrik et al. (2022); and several contributions to Maoz and\nSinnott-Armstrong (2022). Libet’s interpretation of the readiness\npotential has come in for severe criticism. After extensive subsequent\nstudy, neuroscientists are uncertain what it signifies. For thorough\nreview of the evidence, see Schurger et al. (2021).\n\nWhile Pereboom and others point to these empirical considerations in\ndefense of free will skepticism, other philosophers see them as\nreasons to favor a more modest free will agnosticism (Kearns 2015) or\nto promote revisionism about the ‘folk idea of free will’\n(Vargas 2013; Nichols 2015).\n",
    "section_title": "3.1 Arguments Against the Reality of Free Will",
    "entry_title": "Free Will",
    "hierarchy_title": "Free Will || Do We Have Free Will? || Arguments Against the Reality of Free Will",
    "tokenized_text": [
        "free",
        "argument",
        "reality",
        "free",
        "argument",
        "reality",
        "free",
        "priori",
        "empirical",
        "argument",
        "free",
        "see",
        "entry",
        "skepticism",
        "moral",
        "responsibility",
        "several",
        "start",
        "argument",
        "free",
        "incompatible",
        "causal",
        "determinism",
        "rehearse",
        "instead",
        "focus",
        "argument",
        "human",
        "being",
        "lack",
        "free",
        "background",
        "assumption",
        "freedom",
        "causal",
        "determinism",
        "incompatible",
        "radical",
        "priori",
        "argument",
        "free",
        "merely",
        "contingently",
        "absent",
        "impossible",
        "nietzsche",
        "argues",
        "effect",
        "recently",
        "argued",
        "galen",
        "strawson",
        "ch",
        "strawson",
        "associate",
        "free",
        "ultimately",
        "morally",
        "responsible",
        "one",
        "action",
        "argues",
        "one",
        "act",
        "result",
        "explained",
        "one",
        "mentally",
        "speaking",
        "m",
        "one",
        "responsible",
        "choice",
        "one",
        "must",
        "responsible",
        "m",
        "responsible",
        "m",
        "one",
        "must",
        "chosen",
        "m",
        "itselfand",
        "blindly",
        "deliberately",
        "accordance",
        "reason",
        "r_",
        "choice",
        "responsible",
        "one",
        "one",
        "must",
        "chosen",
        "moved",
        "r_",
        "requiring",
        "reason",
        "r_",
        "choice",
        "ad",
        "infinitum",
        "free",
        "choice",
        "requires",
        "impossible",
        "infinite",
        "regress",
        "choice",
        "way",
        "one",
        "making",
        "choice",
        "numerous",
        "reply",
        "strawson",
        "argument",
        "mele",
        "ff",
        "argues",
        "strawson",
        "misconstrues",
        "locus",
        "freedom",
        "responsibility",
        "freedom",
        "principally",
        "feature",
        "action",
        "derivatively",
        "character",
        "action",
        "spring",
        "task",
        "theorist",
        "show",
        "one",
        "rational",
        "reflective",
        "control",
        "choice",
        "one",
        "make",
        "consistent",
        "freedomnegating",
        "condition",
        "seems",
        "right",
        "considering",
        "theory",
        "make",
        "one",
        "free",
        "control",
        "reside",
        "directly",
        "causal",
        "efficacy",
        "one",
        "reason",
        "compatibilist",
        "reasonsresponsive",
        "account",
        "eventcausal",
        "libertarianism",
        "beside",
        "point",
        "reflect",
        "one",
        "came",
        "way",
        "first",
        "place",
        "worry",
        "reflection",
        "lead",
        "one",
        "conclude",
        "true",
        "responsibility",
        "hence",
        "freedom",
        "undermined",
        "since",
        "complete",
        "distal",
        "source",
        "action",
        "may",
        "found",
        "external",
        "agent",
        "clarke",
        "argues",
        "effective",
        "reply",
        "may",
        "made",
        "indeterminists",
        "particular",
        "nondeterministic",
        "agentcausal",
        "theorist",
        "theorist",
        "contend",
        "aspect",
        "one",
        "mentally",
        "speaking",
        "fully",
        "explain",
        "agent",
        "choice",
        "without",
        "causally",
        "determining",
        "ii",
        "agent",
        "cause",
        "choice",
        "made",
        "agent",
        "antecedent",
        "state",
        "grounding",
        "explanation",
        "action",
        "complete",
        "causal",
        "source",
        "since",
        "agent",
        "exercise",
        "power",
        "causally",
        "undetermined",
        "true",
        "sufficient",
        "ultimate",
        "source",
        "external",
        "agent",
        "finally",
        "mele",
        "connor",
        "b",
        "suggest",
        "freedom",
        "moral",
        "responsibility",
        "come",
        "degree",
        "grow",
        "time",
        "reflecting",
        "fact",
        "one",
        "mentally",
        "speaking",
        "increasingly",
        "shaped",
        "one",
        "past",
        "choice",
        "furthermore",
        "choice",
        "given",
        "individual",
        "may",
        "reflect",
        "freedom",
        "responsibility",
        "others",
        "may",
        "kernel",
        "truth",
        "behind",
        "strawson",
        "sweeping",
        "argument",
        "discussion",
        "way",
        "nature",
        "nurture",
        "contingent",
        "circumstance",
        "shape",
        "behavior",
        "raise",
        "deep",
        "issue",
        "concerning",
        "extent",
        "freedom",
        "responsibility",
        "see",
        "levy",
        "russell",
        "chs",
        "second",
        "family",
        "argument",
        "free",
        "contend",
        "one",
        "way",
        "another",
        "nondeterministic",
        "theory",
        "freedom",
        "entail",
        "either",
        "agent",
        "lack",
        "control",
        "choice",
        "choice",
        "adequately",
        "explained",
        "argument",
        "variously",
        "called",
        "mind",
        "rollback",
        "luck",
        "argument",
        "latter",
        "admitting",
        "several",
        "version",
        "statement",
        "argument",
        "see",
        "van",
        "inwagen",
        "ch",
        "haji",
        "mele",
        "shabo",
        "coffman",
        "note",
        "philosopher",
        "advance",
        "argument",
        "part",
        "general",
        "case",
        "free",
        "merely",
        "showing",
        "inadequacy",
        "specific",
        "account",
        "free",
        "see",
        "eg",
        "griffith",
        "describe",
        "imagined",
        "casesindividual",
        "case",
        "comparison",
        "intra",
        "interworld",
        "duplicate",
        "antecedent",
        "condition",
        "followed",
        "diverging",
        "outcomesdesigned",
        "elicit",
        "judgment",
        "occurrence",
        "choice",
        "remained",
        "unsettled",
        "given",
        "prior",
        "causal",
        "factor",
        "matter",
        "chance",
        "random",
        "matter",
        "luck",
        "term",
        "imported",
        "context",
        "come",
        "function",
        "quasitechnical",
        "unanalyzed",
        "concept",
        "debate",
        "perhaps",
        "helpful",
        "avoid",
        "proxy",
        "conduct",
        "debate",
        "directly",
        "term",
        "metaphysical",
        "notion",
        "control",
        "epistemic",
        "notion",
        "explanation",
        "argument",
        "question",
        "whether",
        "undetermined",
        "agent",
        "exercise",
        "appropriate",
        "control",
        "choice",
        "make",
        "proponent",
        "nondeterministic",
        "theory",
        "often",
        "reply",
        "control",
        "exercised",
        "prior",
        "time",
        "choicein",
        "act",
        "bringing",
        "see",
        "eg",
        "clarke",
        "connor",
        "argument",
        "question",
        "whether",
        "undetermined",
        "choice",
        "adequately",
        "explained",
        "reply",
        "often",
        "consists",
        "identifying",
        "form",
        "explanation",
        "form",
        "demanded",
        "critica",
        "noncontrastive",
        "explanation",
        "perhaps",
        "rather",
        "contrastive",
        "explanation",
        "specie",
        "contrastive",
        "explanation",
        "consistent",
        "indeterminism",
        "see",
        "eg",
        "kane",
        "clarke",
        "ch",
        "franklin",
        "a",
        "ch",
        "consider",
        "empirical",
        "argument",
        "human",
        "freedom",
        "stem",
        "physical",
        "science",
        "making",
        "assumption",
        "concerning",
        "way",
        "physical",
        "phenomenon",
        "fix",
        "psychological",
        "phenomenon",
        "others",
        "neuroscience",
        "psychology",
        "used",
        "common",
        "philosopher",
        "argue",
        "empirical",
        "reason",
        "believe",
        "world",
        "general",
        "causally",
        "determined",
        "since",
        "human",
        "being",
        "part",
        "world",
        "many",
        "took",
        "strongly",
        "confirmed",
        "spectacular",
        "success",
        "isaac",
        "newton",
        "framework",
        "understanding",
        "universe",
        "governed",
        "everywhere",
        "fairly",
        "simple",
        "exceptionless",
        "law",
        "motion",
        "quantum",
        "revolution",
        "early",
        "twentieth",
        "century",
        "made",
        "clockwork",
        "universe",
        "image",
        "least",
        "doubtful",
        "level",
        "basic",
        "physic",
        "quantum",
        "mechanic",
        "proven",
        "spectacularly",
        "successful",
        "framework",
        "making",
        "precise",
        "accurate",
        "prediction",
        "certain",
        "observable",
        "phenomenon",
        "implication",
        "causal",
        "structure",
        "reality",
        "still",
        "well",
        "understood",
        "competing",
        "indeterministic",
        "deterministic",
        "interpretation",
        "see",
        "entry",
        "quantum",
        "mechanic",
        "detailed",
        "discussion",
        "possible",
        "indeterminacy",
        "smallscale",
        "supposing",
        "genuine",
        "cancel",
        "macroscopic",
        "scale",
        "bird",
        "building",
        "people",
        "behavior",
        "scale",
        "virtually",
        "deterministic",
        "idea",
        "common",
        "challenged",
        "empirically",
        "even",
        "level",
        "basic",
        "biology",
        "furthermore",
        "social",
        "biological",
        "medical",
        "science",
        "rife",
        "merely",
        "statistical",
        "generalization",
        "plainly",
        "jury",
        "intertheoretic",
        "question",
        "way",
        "say",
        "current",
        "science",
        "decisively",
        "support",
        "idea",
        "everything",
        "predetermined",
        "past",
        "ultimately",
        "distant",
        "past",
        "wholly",
        "control",
        "discussion",
        "see",
        "balaguer",
        "koch",
        "roskies",
        "elli",
        "maybe",
        "subject",
        "myriad",
        "causal",
        "influence",
        "sum",
        "total",
        "influence",
        "determine",
        "make",
        "le",
        "likely",
        "priori",
        "nofreewill",
        "argument",
        "center",
        "nondeterministic",
        "theory",
        "according",
        "objective",
        "antecedent",
        "probability",
        "associated",
        "possible",
        "choice",
        "outcome",
        "objective",
        "probability",
        "kind",
        "might",
        "present",
        "special",
        "problem",
        "beyond",
        "posed",
        "absence",
        "determinism",
        "insufficiently",
        "explored",
        "date",
        "brief",
        "discussion",
        "see",
        "vicens",
        "connor",
        "one",
        "philosopher",
        "argues",
        "reason",
        "hold",
        "action",
        "undetermined",
        "governed",
        "objective",
        "probability",
        "fact",
        "call",
        "question",
        "whether",
        "act",
        "freely",
        "derk",
        "pereboom",
        "ch",
        "ch",
        "pereboom",
        "note",
        "best",
        "physical",
        "theory",
        "indicate",
        "statistical",
        "law",
        "govern",
        "isolated",
        "smallscale",
        "physical",
        "event",
        "infers",
        "thesis",
        "human",
        "being",
        "wholly",
        "physically",
        "composed",
        "statistical",
        "law",
        "also",
        "govern",
        "physical",
        "component",
        "human",
        "action",
        "finally",
        "pereboom",
        "maintains",
        "agentcausal",
        "libertarianism",
        "offer",
        "correct",
        "analysis",
        "free",
        "invite",
        "u",
        "imagine",
        "antecedent",
        "probability",
        "physical",
        "component",
        "action",
        "occurring",
        "action",
        "free",
        "violating",
        "statistical",
        "law",
        "scenario",
        "large",
        "enough",
        "number",
        "instance",
        "action",
        "would",
        "freely",
        "chosen",
        "close",
        "percent",
        "time",
        "lead",
        "problem",
        "wild",
        "coincidence",
        "occurrence",
        "physical",
        "component",
        "settled",
        "choice",
        "agentcauses",
        "actually",
        "chosen",
        "close",
        "percent",
        "time",
        "would",
        "amount",
        "coincidence",
        "le",
        "wild",
        "coincidence",
        "possible",
        "action",
        "whose",
        "physical",
        "component",
        "antecedent",
        "probability",
        "chosen",
        "large",
        "enough",
        "number",
        "instance",
        "close",
        "percent",
        "time",
        "proposal",
        "agentcaused",
        "free",
        "choice",
        "diverge",
        "statistical",
        "law",
        "predict",
        "physical",
        "component",
        "action",
        "would",
        "run",
        "sharply",
        "counter",
        "would",
        "expect",
        "make",
        "incredible",
        "clarke",
        "question",
        "implicit",
        "assumption",
        "free",
        "agentcausal",
        "choice",
        "expected",
        "conform",
        "physical",
        "statistical",
        "law",
        "connor",
        "a",
        "challenge",
        "general",
        "assumption",
        "freedom",
        "requires",
        "agentcausal",
        "choice",
        "governed",
        "statistical",
        "law",
        "kind",
        "plausibly",
        "would",
        "relevant",
        "psychological",
        "statespowers",
        "strongly",
        "emergent",
        "physical",
        "state",
        "human",
        "brain",
        "finally",
        "runyan",
        "argues",
        "pereboom",
        "case",
        "rest",
        "implausible",
        "empirical",
        "assumption",
        "concerning",
        "evolution",
        "objective",
        "probability",
        "concerning",
        "type",
        "behavior",
        "time",
        "pereboom",
        "empirical",
        "basis",
        "free",
        "skepticism",
        "general",
        "others",
        "see",
        "support",
        "free",
        "skepticism",
        "specific",
        "finding",
        "theory",
        "human",
        "science",
        "point",
        "evidence",
        "unconsciously",
        "influenced",
        "choice",
        "make",
        "range",
        "factor",
        "including",
        "one",
        "motivationally",
        "relevant",
        "come",
        "believe",
        "chose",
        "initiate",
        "behavior",
        "fact",
        "artificially",
        "induced",
        "people",
        "subject",
        "certain",
        "neurological",
        "disorder",
        "sometimes",
        "engage",
        "purposive",
        "behavior",
        "sincerely",
        "believing",
        "directing",
        "finally",
        "great",
        "deal",
        "attention",
        "given",
        "work",
        "neuroscientist",
        "benjamin",
        "libet",
        "libet",
        "conducted",
        "simple",
        "experiment",
        "seemed",
        "reveal",
        "existence",
        "preparatory",
        "brain",
        "activity",
        "readiness",
        "potential",
        "shortly",
        "subject",
        "engages",
        "ostensibly",
        "spontaneous",
        "action",
        "libet",
        "interpreted",
        "activity",
        "brain",
        "deciding",
        "consciously",
        "settled",
        "course",
        "action",
        "wegner",
        "survey",
        "finding",
        "due",
        "work",
        "social",
        "psychologist",
        "argues",
        "basis",
        "experience",
        "conscious",
        "willing",
        "illusion",
        "criticism",
        "argument",
        "see",
        "mele",
        "nahmias",
        "mudrik",
        "et",
        "al",
        "several",
        "contribution",
        "maoz",
        "sinnottarmstrong",
        "libet",
        "interpretation",
        "readiness",
        "potential",
        "come",
        "severe",
        "criticism",
        "extensive",
        "subsequent",
        "study",
        "neuroscientist",
        "uncertain",
        "signifies",
        "thorough",
        "review",
        "evidence",
        "see",
        "schurger",
        "et",
        "al",
        "pereboom",
        "others",
        "point",
        "empirical",
        "consideration",
        "defense",
        "free",
        "skepticism",
        "philosopher",
        "see",
        "reason",
        "favor",
        "modest",
        "free",
        "agnosticism",
        "kearns",
        "promote",
        "revisionism",
        "folk",
        "idea",
        "free",
        "vargas",
        "nichols"
    ]
}