{
    "main_text": "The Harm Principle and Free Speech || Mill's Harm Principle and Pornography\n2.2 Mill's Harm Principle and Pornography\n\nThere are other instances when the harm principle has been invoked but\nwhere it is more difficult to demonstrate that rights have been\nviolated. Perhaps the most obvious example is the debate over\npornography. As Feinberg notes in Offense to Others: the Moral\nLimits of the Criminal Law, most attacks on pornography up to the\n1970s were from social conservatives who found such material to be\nimmoral and obscene. This type of argument has died away in recent\ntimes and the case against pornography has been taken up by some\nfeminists who often distinguish between erotica, which is acceptable,\nand pornography, which is not, because it is claimed it degrades,\nharms, and endangers the lives of women. The harm principle can be\ninvoked against pornography if it can be demonstrated that it violates\nthe rights of women. \nThis is an approach taken by Catherine MacKinnon (1987). She takes\nseriously the distinction between pornography and erotica. Erotica\nmight be explicit and create sexual arousal, but neither is grounds\nfor complaint. Pornography would not come under attack if it did the\nsame thing as erotica; the complaint is that it portrays women in a\nmanner that harms them.\n\nWhen pornography involves young children, most people accept that it\nshould be prohibited because it harms persons under the age of\nconsent (although the principle would not necessarily rule out people\nover the age of consent from portraying minors). It has proved more\ndifficult to make the same claim for consenting adults. It is\ndifficult to know if the people who appear in books, magazines, films,\nvideos and on the internet are being physically harmed. If they are we\nthen need to show why this is sufficiently different from other forms\nof harmful employment that is not prohibited, such as hard manual\nlabour, or very dangerous jobs. Much of the work in pornography seems\nto be demeaning and unpleasant but the same can be said for many forms\nof work and again it is unclear why the harm principle can be used to\nsingle out pornography. MacKinnon's (1987) claim that women who make a\nliving through pornography are sexual slaves seems to exaggerate the\ncase. If conditions in the pornography industry are particularly bad,\nstronger regulation rather than prohibition might be a better option,\nparticularly as the latter will not make the industry go away. \n\nIt is also difficult to demonstrate that pornography results in harm\nto women as a whole. Very few people would deny that violence against\nwomen is abhorrent and an all too common feature of our society, but\nhow much of this is caused by pornography? MacKinnon, Andrea Dworkin,\n(1981) and many others, have attempted to show a causal link but this\nhas proven challenging because one needs to show that a person who\nwould not rape, batter or otherwise violate the rights of women was\ncaused to do so through exposure to pornography. Caroline West\nprovides a useful overview of the literature and suggests that even\nthough pornography might not dispose most men to rape, it might make\nit more likely for those men who are already so inclined. She uses the\nanalogy of smoking. We have good grounds for saying that smoking makes\ncancer more likely even though smoking is neither a necessary nor\nsufficient condition for causing cancer. One possible problem with\nthis analogy is that we have very powerful evidence that smoking does\nsignificantly increase the possibility of cancer; the evidence\nsuggesting that viewing pornography leads men (already inclined) to\nrape women is not as robust. \n\nIf pornographers were exhorting their readers to commit violence and\nrape, the case for prohibition would be much stronger, but they tend\nnot to do this, just as films that depict murder do not actively\nincite the audience to mimic what they see on the screen. For the sake\nof argument let us grant that the consumption of pornography does lead\nsome men to commit acts of violence. Such a concession might not prove\nto be decisive. The harm principle might be a necessary, but it is not\na sufficient reason for censorship. If pornography causes a small\npercentage of men to act violently we still need an argument for why\nthe liberty of all consumers of pornography (men and women) has to be\ncurtailed because of the violent actions of a few. We have\noverwhelming evidence that consuming alcohol causes a lot of violence\n(against women and men) but this does not mean that alcohol should be\nprohibited. Very few people reach this conclusion despite the clarity\nof the evidence. Further questions need to be answered before a ban is\njustified. How many people are harmed? What is the frequency of the\nharm? How strong is the evidence that A is causing B? Would\nprohibition limit the harm and if so, by how much? Would censorship\ncause problems greater than the harm it is meant to negate? Can the\nharmful effects be prevented by measures other than prohibition?\n\nThere are other non-physical harms that also have to be taken into\nconsideration. MacKinnon argues that pornography causes harm because\nit exploits, oppresses, subordinates and undermines the civil rights\nof women, including their right to free speech. A permissive policy on\npornography has the effect of prioritizing the right to speech of\npornographers over the right to speech of women. MacKinnon's claim is\nthat pornography silences women because it presents them as inferior\nbeings and sex objects who are not to be taken seriously. Even if\npornography does not cause violence, it still leads to discrimination,\ndomination and rights violations. She also suggests that because\npornography offers a misleading and derogatory view of women, it is\nlibelous. Along with Andrea Dworkin, MacKinnon drafted a Minneapolis\nCouncil Ordinance in 1983 that allowed women to take civil action\nagainst pornographers. They defined pornography as:\n\n…the graphic sexually explicit subordination of women through\npictures or words that also includes women dehumanized as sexual\nobjects, things, or commodities; enjoying pain or humiliation or rape;\nbeing tied up, cut up, mutilated, bruised, or physically hurt; in\npostures of sexual submission or servility or display; reduced to body\nparts, penetrated by objects or animals, or presented in scenarios of\ndegradation, injury, torture; shown as filthy or inferior; bleeding,\nbruised or hurt in a context which makes these conditions\nsexual (1987, 176).\n\nSuch arguments have so far not led to the prohibition of pornography\n(which was not the intent of the Ordinance) and many liberals remain\nunconvinced. One reason that some doubt MacKinnon's claims is that the\nlast twenty years have seen an explosion of pornography on the\ninternet without a concurrent erosion of women's rights. If those\narguing that pornography causes harm are right, we should expect to\nsee a large increase in physical abuse against women and a hefty\ndecrease in their civil rights, employment in the professions, and\npositions in higher education. The evidence does not seem to show this\nand social conditions for women today are better than 30 years ago\nwhen pornography was less prevalent. What does seem to be reasonably\nclear, at least in the USA, is that the increased consumption of\npornography over the last 20 years has coincided with a reduction in\nviolent crime against women, including rape. If we return to West's\nsmoking analogy, we would have to rethink our view that smoking causes\ncancer if a large increase in smokers did not translate into a\ncomparable increase in lung cancer.\n\nThe matter remains unsettled, and the lives of women might be\nsignificantly better if pornography was not around, but so far it has\nproven difficult to justify limiting pornography by way of the harm\nprinciple. It is important to remember that we are currently examining\nthis issue from the perspective of Mill's formulation of the harm\nprinciple and only speech that directly violates rights\nshould be banned. Finding pornography offensive, obscene or outrageous\nis not sufficient grounds for censorship. Nor does Mill's principle\nallow prohibition because pornography harms the viewer. The harm\nprinciple is there to prevent other-regarding not self-regarding harm.\n\nOverall, no one has mounted a compelling case (at least as far as\nlegislators and judges are concerned) for banning pornography (except\nin the case of minors) based on the concept of harm formulated by\nMill.\n",
    "section_title": "2.2 Mill's Harm Principle and Pornography",
    "entry_title": "Freedom of Speech",
    "hierarchy_title": "Freedom of Speech || The Harm Principle and Free Speech || Mill's Harm Principle and Pornography",
    "tokenized_text": [
        "harm",
        "principle",
        "free",
        "speech",
        "mill",
        "s",
        "harm",
        "principle",
        "pornography",
        "mill",
        "s",
        "harm",
        "principle",
        "pornography",
        "instance",
        "harm",
        "principle",
        "invoked",
        "difficult",
        "demonstrate",
        "right",
        "violated",
        "perhaps",
        "obvious",
        "example",
        "debate",
        "pornography",
        "feinberg",
        "note",
        "offense",
        "others",
        "moral",
        "limit",
        "criminal",
        "law",
        "attack",
        "pornography",
        "s",
        "social",
        "conservative",
        "found",
        "material",
        "immoral",
        "obscene",
        "type",
        "argument",
        "died",
        "away",
        "recent",
        "time",
        "case",
        "pornography",
        "taken",
        "feminist",
        "often",
        "distinguish",
        "erotica",
        "acceptable",
        "pornography",
        "claimed",
        "degrades",
        "harm",
        "endangers",
        "life",
        "woman",
        "harm",
        "principle",
        "invoked",
        "pornography",
        "demonstrated",
        "violates",
        "right",
        "woman",
        "approach",
        "taken",
        "catherine",
        "mackinnon",
        "take",
        "seriously",
        "distinction",
        "pornography",
        "erotica",
        "erotica",
        "might",
        "explicit",
        "create",
        "sexual",
        "arousal",
        "neither",
        "ground",
        "complaint",
        "pornography",
        "would",
        "come",
        "attack",
        "thing",
        "erotica",
        "complaint",
        "portrays",
        "woman",
        "manner",
        "harm",
        "pornography",
        "involves",
        "young",
        "child",
        "people",
        "accept",
        "prohibited",
        "harm",
        "person",
        "age",
        "consent",
        "although",
        "principle",
        "would",
        "necessarily",
        "rule",
        "people",
        "age",
        "consent",
        "portraying",
        "minor",
        "proved",
        "difficult",
        "make",
        "claim",
        "consenting",
        "adult",
        "difficult",
        "know",
        "people",
        "appear",
        "book",
        "magazine",
        "film",
        "video",
        "internet",
        "physically",
        "harmed",
        "need",
        "show",
        "sufficiently",
        "different",
        "form",
        "harmful",
        "employment",
        "prohibited",
        "hard",
        "manual",
        "labour",
        "dangerous",
        "job",
        "much",
        "work",
        "pornography",
        "seems",
        "demeaning",
        "unpleasant",
        "said",
        "many",
        "form",
        "work",
        "unclear",
        "harm",
        "principle",
        "used",
        "single",
        "pornography",
        "mackinnon",
        "s",
        "claim",
        "woman",
        "make",
        "living",
        "pornography",
        "sexual",
        "slave",
        "seems",
        "exaggerate",
        "case",
        "condition",
        "pornography",
        "industry",
        "particularly",
        "bad",
        "stronger",
        "regulation",
        "rather",
        "prohibition",
        "might",
        "better",
        "option",
        "particularly",
        "latter",
        "make",
        "industry",
        "go",
        "away",
        "also",
        "difficult",
        "demonstrate",
        "pornography",
        "result",
        "harm",
        "woman",
        "whole",
        "people",
        "would",
        "deny",
        "violence",
        "woman",
        "abhorrent",
        "common",
        "feature",
        "society",
        "much",
        "caused",
        "pornography",
        "mackinnon",
        "andrea",
        "dworkin",
        "many",
        "others",
        "attempted",
        "show",
        "causal",
        "link",
        "proven",
        "challenging",
        "one",
        "need",
        "show",
        "person",
        "would",
        "rape",
        "batter",
        "otherwise",
        "violate",
        "right",
        "woman",
        "caused",
        "exposure",
        "pornography",
        "caroline",
        "west",
        "provides",
        "useful",
        "overview",
        "literature",
        "suggests",
        "even",
        "though",
        "pornography",
        "might",
        "dispose",
        "men",
        "rape",
        "might",
        "make",
        "likely",
        "men",
        "already",
        "inclined",
        "us",
        "analogy",
        "smoking",
        "good",
        "ground",
        "saying",
        "smoking",
        "make",
        "cancer",
        "likely",
        "even",
        "though",
        "smoking",
        "neither",
        "necessary",
        "sufficient",
        "condition",
        "causing",
        "cancer",
        "one",
        "possible",
        "problem",
        "analogy",
        "powerful",
        "evidence",
        "smoking",
        "significantly",
        "increase",
        "possibility",
        "cancer",
        "evidence",
        "suggesting",
        "viewing",
        "pornography",
        "lead",
        "men",
        "already",
        "inclined",
        "rape",
        "woman",
        "robust",
        "pornographer",
        "exhorting",
        "reader",
        "commit",
        "violence",
        "rape",
        "case",
        "prohibition",
        "would",
        "much",
        "stronger",
        "tend",
        "film",
        "depict",
        "murder",
        "actively",
        "incite",
        "audience",
        "mimic",
        "see",
        "screen",
        "sake",
        "argument",
        "let",
        "u",
        "grant",
        "consumption",
        "pornography",
        "lead",
        "men",
        "commit",
        "act",
        "violence",
        "concession",
        "might",
        "prove",
        "decisive",
        "harm",
        "principle",
        "might",
        "necessary",
        "sufficient",
        "reason",
        "censorship",
        "pornography",
        "cause",
        "small",
        "percentage",
        "men",
        "act",
        "violently",
        "still",
        "need",
        "argument",
        "liberty",
        "consumer",
        "pornography",
        "men",
        "woman",
        "curtailed",
        "violent",
        "action",
        "overwhelming",
        "evidence",
        "consuming",
        "alcohol",
        "cause",
        "lot",
        "violence",
        "woman",
        "men",
        "mean",
        "alcohol",
        "prohibited",
        "people",
        "reach",
        "conclusion",
        "despite",
        "clarity",
        "evidence",
        "question",
        "need",
        "answered",
        "ban",
        "justified",
        "many",
        "people",
        "harmed",
        "frequency",
        "harm",
        "strong",
        "evidence",
        "causing",
        "b",
        "would",
        "prohibition",
        "limit",
        "harm",
        "much",
        "would",
        "censorship",
        "cause",
        "problem",
        "greater",
        "harm",
        "meant",
        "negate",
        "harmful",
        "effect",
        "prevented",
        "measure",
        "prohibition",
        "nonphysical",
        "harm",
        "also",
        "taken",
        "consideration",
        "mackinnon",
        "argues",
        "pornography",
        "cause",
        "harm",
        "exploit",
        "oppresses",
        "subordinate",
        "undermines",
        "civil",
        "right",
        "woman",
        "including",
        "right",
        "free",
        "speech",
        "permissive",
        "policy",
        "pornography",
        "effect",
        "prioritizing",
        "right",
        "speech",
        "pornographer",
        "right",
        "speech",
        "woman",
        "mackinnon",
        "s",
        "claim",
        "pornography",
        "silence",
        "woman",
        "present",
        "inferior",
        "being",
        "sex",
        "object",
        "taken",
        "seriously",
        "even",
        "pornography",
        "cause",
        "violence",
        "still",
        "lead",
        "discrimination",
        "domination",
        "right",
        "violation",
        "also",
        "suggests",
        "pornography",
        "offer",
        "misleading",
        "derogatory",
        "view",
        "woman",
        "libelous",
        "along",
        "andrea",
        "dworkin",
        "mackinnon",
        "drafted",
        "minneapolis",
        "council",
        "ordinance",
        "allowed",
        "woman",
        "take",
        "civil",
        "action",
        "pornographer",
        "defined",
        "pornography",
        "the",
        "graphic",
        "sexually",
        "explicit",
        "subordination",
        "woman",
        "picture",
        "word",
        "also",
        "includes",
        "woman",
        "dehumanized",
        "sexual",
        "object",
        "thing",
        "commodity",
        "enjoying",
        "pain",
        "humiliation",
        "rape",
        "tied",
        "cut",
        "mutilated",
        "bruised",
        "physically",
        "hurt",
        "posture",
        "sexual",
        "submission",
        "servility",
        "display",
        "reduced",
        "body",
        "part",
        "penetrated",
        "object",
        "animal",
        "presented",
        "scenario",
        "degradation",
        "injury",
        "torture",
        "shown",
        "filthy",
        "inferior",
        "bleeding",
        "bruised",
        "hurt",
        "context",
        "make",
        "condition",
        "sexual",
        "argument",
        "far",
        "led",
        "prohibition",
        "pornography",
        "intent",
        "ordinance",
        "many",
        "liberal",
        "remain",
        "unconvinced",
        "one",
        "reason",
        "doubt",
        "mackinnon",
        "s",
        "claim",
        "last",
        "twenty",
        "year",
        "seen",
        "explosion",
        "pornography",
        "internet",
        "without",
        "concurrent",
        "erosion",
        "woman",
        "s",
        "right",
        "arguing",
        "pornography",
        "cause",
        "harm",
        "right",
        "expect",
        "see",
        "large",
        "increase",
        "physical",
        "abuse",
        "woman",
        "hefty",
        "decrease",
        "civil",
        "right",
        "employment",
        "profession",
        "position",
        "higher",
        "education",
        "evidence",
        "seem",
        "show",
        "social",
        "condition",
        "woman",
        "today",
        "better",
        "year",
        "ago",
        "pornography",
        "le",
        "prevalent",
        "seem",
        "reasonably",
        "clear",
        "least",
        "usa",
        "increased",
        "consumption",
        "pornography",
        "last",
        "year",
        "coincided",
        "reduction",
        "violent",
        "crime",
        "woman",
        "including",
        "rape",
        "return",
        "west",
        "s",
        "smoking",
        "analogy",
        "would",
        "rethink",
        "view",
        "smoking",
        "cause",
        "cancer",
        "large",
        "increase",
        "smoker",
        "translate",
        "comparable",
        "increase",
        "lung",
        "cancer",
        "matter",
        "remains",
        "unsettled",
        "life",
        "woman",
        "might",
        "significantly",
        "better",
        "pornography",
        "around",
        "far",
        "proven",
        "difficult",
        "justify",
        "limiting",
        "pornography",
        "way",
        "harm",
        "principle",
        "important",
        "remember",
        "currently",
        "examining",
        "issue",
        "perspective",
        "mill",
        "s",
        "formulation",
        "harm",
        "principle",
        "speech",
        "directly",
        "violates",
        "right",
        "banned",
        "finding",
        "pornography",
        "offensive",
        "obscene",
        "outrageous",
        "sufficient",
        "ground",
        "censorship",
        "mill",
        "s",
        "principle",
        "allow",
        "prohibition",
        "pornography",
        "harm",
        "viewer",
        "harm",
        "principle",
        "prevent",
        "otherregarding",
        "selfregarding",
        "harm",
        "overall",
        "one",
        "mounted",
        "compelling",
        "case",
        "least",
        "far",
        "legislator",
        "judge",
        "concerned",
        "banning",
        "pornography",
        "except",
        "case",
        "minor",
        "based",
        "concept",
        "harm",
        "formulated",
        "mill"
    ]
}