{
    "main_text": "Frege’s Life and Influences\n1. Frege’s Life and Influences\n\nAccording to the curriculum vitae that the 26-year old Frege\nfiled in 1874 with his Habilitationsschrift, he was born on\nNovember 8, 1848 in Wismar, a town then in Mecklenburg-Schwerin but\nnow in Mecklenburg-Vorpommern.  His father, Alexander, a headmaster of\na secondary school for girls, and his mother, Auguste (nee\nBialloblotzky), brought him up in the Lutheran faith. Frege attended\nthe local Gymnasium for 15 years, and after graduation in 1869,\nentered the University of Jena (see Frege 1874, translation in\nMcGuinness (ed.) 1984, 92).\nAt Jena, Frege attended lectures by Ernst Karl Abbe, who\nsubsequently became Frege’s mentor and who had a significant\nintellectual and personal influence on Frege’s life.  Frege\ntransferred to the University of Göttingen in 1871, and two years\nlater, in 1873, was awarded a Ph.D. in mathematics, having written a\ndissertation under Ernst Schering titled Über eine\ngeometrische Darstellung der imaginären Gebilde in der Ebene\n(“On a Geometrical Representation of Imaginary Forms in the\nPlane”). Frege explains the project in his thesis as follows:\n“By a geometrical representation of imaginary forms in the plane\nwe understand accordingly a kind of correlation in virtue of which\nevery real or imaginary element of the plane has a real, intuitive\nelement corresponding to it” (Frege 1873, translation in\nMcGuinness (ed.)  1984, 3).  Here, by ‘imaginary\nforms’, Frege is referring to imaginary points, imaginary curves\nand lines, etc.  Interestingly, one section of the thesis concerns the\nrepresentation of complex numbers by magnitudes of angles in the\nplane.\nIn 1874, Frege completed his Habilitationsschrift,\nentitled Rechnungsmethoden, die sich auf eine Erweiterung\ndes Grössenbegriffes gründen (“Methods of\nCalculation Based on an Extension of the Concept of Quantity”).\nImmediately after submitting this thesis, the good offices of\nAbbe led Frege to become a Privatdozent (Lecturer) at\nthe University of Jena.  Library records from the University of Jena\nestablish that, over the next 5 years, Frege checked out texts in\nmechanics, analysis, geometry, Abelian functions, and elliptical\nfunctions (Kreiser 1984, \n 21).[1] \n No doubt, many of these texts helped him to\nprepare the lectures he is listed as giving by the University of Jena\ncourse bulletin, for these lectures are on topics that often match the\ntexts, i.e., analytic geometry, elliptical and Abelian functions,\nalgebraic analysis, functions of complex variables, etc. (Kratzsch\n1979).[2]\nThis course of Frege’s reading and lectures during the period of\n1874–1879 dovetailed quite naturally with the interests he\ndisplayed in his Habilitationsschrift. The ‘extension\nof the concept of quantity’ referred to in the title concerns\nthe fact that our understanding of quantities (e.g., lengths,\nsurfaces, etc.)  has to be extended in the context of complex\nnumbers.[3] He\nsays, right at the beginning of this work:\n\n According to the old conception, length appears as something material\nwhich fills the straight line between its end points and at the same\ntime prevents another thing from penetrating into its space by its\nrigidity. In adding quantities, we are therefore forced to place one\nquantity against another.  Something similar holds for surfaces and\nsolid contents. The introduction of negative quantities made a dent in\nthis conception, and imaginary quantities made it completely\nimpossible. Now all that matters is the point of origin and the end\npoint – the idea of filling the space has been completely\nlost. All that has remained is certain general properties of addition,\nwhich now emerge as the essential characteristic marks of quantity.\nThe concept has thus gradually freed itself from intuition and made\nitself independent. This is quite unobjectionable, especially since\nits earlier intuitive character was at bottom mere appearance.\nBounded straight lines and planes enclosed by curves can certainly be\nintuited, but what is quantitative about them, what is common to\nlengths and surfaces, escapes our intuition. … There is\naccordingly a noteworthy difference between geometry and arithmetic in\nthe way in which their fundamental principles are grounded. The\nelements of all geometrical constructions are intuitions, and geometry\nrefers to intuition as the source of its axioms. Since the object of\narithmetic does not have an intuitive character, its fundamental\npropositions cannot stem from intuition… (Frege 1874,\ntranslation in McGuinness (ed.) 1984, 56)\n \nHere we can see the beginning of two lifelong interests of Frege,\nnamely, (1) in how concepts and definitions developed for one domain\nfare when applied in a wider domain, and (2) in the contrast between\nlegitimate appeals to intuition in geometry and illegitimate appeals\nto intuition in the development of pure number theory. Indeed, some\nrecent scholars have (a) shown how Frege’s work in logic was informed\nin part by his understanding of the analogies and disanalogies between\ngeometry and number theory (Wilson 1992), and (b) shown that Frege was\nintimately familiar with the division among late 19th century\nmathematicians doing complex analysis who split over whether it is\nbetter to use the analytic methods of Weierstrass or the intuitive\ngeometric methods of Riemann (Tappenden 2006). Weierstrass’s 1872\npaper, describing a real-valued function that is continuous\neverywhere but differentiable \n nowhere,[4]\n was well known and provided an example of an ungraphable functions\nthat places limits on intuition. Yet, at the same time, Frege clearly\naccepted Riemann’s practice and methods derived from taking functions\nas fundamental, as opposed to Weierstrass’s focus on functions that\ncan be represented or analyzed in terms of other mathematical objects\n(e.g., complex power series).\nIn 1879, Frege published his first book Begriffsschrift, eine\nder arithmetischen nachgebildete Formelsprache des reinen Denkens\n(Concept Notation: A formula language of pure thought, modelled\nupon that of arithmetic) and was promoted\nto außerordentlicher Professor (Extraordinarius Professor)\nat Jena.  Although the Begriffsschrift constituted a major\nadvance in logic, it was neither widely understood nor well-received.\nSome scholars have suggested that this was due to the facts that the\nnotation was 2-dimensional instead of linear and that he didn’t build\nupon the work of others but rather presented something radically new\n(e.g., Mendelsohn 2005, 2).  Though our discussion below is framed\nprimarily with an eye towards the system Frege developed in his\ntwo-volume work of 1893/1903 (Grundgesetze der Arithmetik),\nthe principal elements of this later system can be found already in\nthe Begriffsschrift of 1879.\nFrege’s next really significant work was his second book,\nDie Grundlagen der Arithmetik: eine logisch mathematische\nUntersuchung über den Begriff der Zahl, published in\n1884. Frege begins this work with criticisms of previous attempts to\ndefine the concept of number, and then offers his own\nanalysis. The Grundlagen contains a variety of insights still\ndiscussed today, such as: (a) the claim that a statement of number\n(e.g., ‘there are eight planets’) is a higher-order\nassertion about a concept (see Section 2.5 below); (b) his famous\nContext Principle (“never ask for the meaning of a word in\nisolation, but only in the context of a proposition”), and (c)\nthe formulation of a principle (now called ‘Hume’s\nPrinciple’ in the secondary literature) that asserts the\nequivalence of the claim “the number of Fs is equal to\nthe number of Gs” with the claim that “there is a\none-to-one correspondence between the objects falling under F\nand the objects falling under G” (see Section 2.5 below).\nMore generally, Frege provides in the Grundlagen a\nnon-technical philosophical justification and outline of the ideas\nthat he was to develop technically in his two-volume\nwork Grundgesetze der Arithmetik (1893/1903).\nIn the years 1891–1892, Frege gave more thought to the\nphilosophy of language that would help ground his philosophy of\nmathematics. He published three of his most well-known papers,\n‘Function and Concept’ (1891), ‘On Sense and\nReference’ (1892a), and ‘On Concept and Object’\n(1892b) in this period.  These works were eventually supplemented by\nthree other papers on the philosophy of language, from a later period,\n‘The Thought’ (1918a), ‘Negation’ (1918b), and\n‘Compound Thoughts’ (1923).  As we shall see in Section\n3.3 below, these works have to be considered in light of recent\nscholarship providing evidence that Frege heavily borrowed from Stoic\nphilosophy.  Though Frege always motivated and recast (often in\nrigorous terms) ideas that he absorbed from others, the documentation\nconcerning the origins of many of his ideas in the Stoic corpus has to\nbe taken seriously.\n\nIn 1893, he published the first volume of the technical work\npreviously mentioned, Grundgesetze der Arithmetik.  In 1896,\nhe was promoted to ordentlicher Honorarprofessor (regular\nhonorary professor).  Six years later (on June 16, 1902), as he was\npreparing the proofs of the second volume of\nthe Grundgesetze, he received a letter from Bertrand Russell,\ninforming him that one could derive a contradiction in the system he\nhad developed in the first volume.  Russell’s letter frames the\nparadox first in terms of the predicate P = ‘being a\npredicate which cannot be predicated of itself’, and then in\nterms of the class of all those classes that are not members of\nthemselves.  Frege, in the Appendix to the second volume, rephrased\nthe paradox in terms of his own system. \n\nFrege never fully recovered from the fatal flaw discovered in the\nfoundations of his Grundgesetze.  His attempts at salvaging\nthe work by restricting Basic Law V were not successful. However, he\ncontinued teaching at Jena, and from 1903–1917, he published six\npapers, including ‘What is a Function?’ (1904) and\n‘On the Foundations of Geometry’ (Frege 1903b and 1906).\nIn the latter, Frege criticized Hilbert’s understanding and use of the\naxiomatic method (see the entry on the\n  Frege-Hilbert controversy). From\nthis time period, we have the lecture notes that Rudolf Carnap took as\na student in two of his courses (see Reck and Awodey 2004). In 1917,\nhe retired from the University of Jena.\nIn the last phase of his life, from 1917–1925, Frege\npublished only the papers mentioned earlier (1918a, 1918b, 1923) and\ndeveloped some unpublished fragments of philosophical works.\nUnfortunately, his last years saw him become more than just\npolitically conservative – his diary for a brief period in 1924\nshow sympathies for fascism and anti-Semitism (see Frege 1924 [1996],\ntranslated by R. Mendelsohn).  He died on July 26, 1925, in Bad\nKleinen (now in Mecklenburg-Vorpommern).\n",
    "section_title": "1. Frege’s Life and Influences",
    "entry_title": "Gottlob Frege",
    "hierarchy_title": "Gottlob Frege || Frege’s Life and Influences",
    "tokenized_text": [
        "frege",
        "life",
        "influence",
        "frege",
        "life",
        "influence",
        "according",
        "curriculum",
        "vitae",
        "year",
        "old",
        "frege",
        "filed",
        "habilitationsschrift",
        "born",
        "november",
        "wismar",
        "town",
        "mecklenburgschwerin",
        "mecklenburgvorpommern",
        "father",
        "alexander",
        "headmaster",
        "secondary",
        "school",
        "girl",
        "mother",
        "auguste",
        "nee",
        "bialloblotzky",
        "brought",
        "lutheran",
        "faith",
        "frege",
        "attended",
        "local",
        "gymnasium",
        "year",
        "graduation",
        "entered",
        "university",
        "jena",
        "see",
        "frege",
        "translation",
        "mcguinness",
        "ed",
        "jena",
        "frege",
        "attended",
        "lecture",
        "ernst",
        "karl",
        "abbe",
        "subsequently",
        "became",
        "frege",
        "mentor",
        "significant",
        "intellectual",
        "personal",
        "influence",
        "frege",
        "life",
        "frege",
        "transferred",
        "university",
        "göttingen",
        "two",
        "year",
        "later",
        "awarded",
        "phd",
        "mathematics",
        "written",
        "dissertation",
        "ernst",
        "schering",
        "titled",
        "über",
        "eine",
        "geometrische",
        "darstellung",
        "der",
        "imaginären",
        "gebilde",
        "der",
        "ebene",
        "geometrical",
        "representation",
        "imaginary",
        "form",
        "plane",
        "frege",
        "explains",
        "project",
        "thesis",
        "follows",
        "geometrical",
        "representation",
        "imaginary",
        "form",
        "plane",
        "understand",
        "accordingly",
        "kind",
        "correlation",
        "virtue",
        "every",
        "real",
        "imaginary",
        "element",
        "plane",
        "real",
        "intuitive",
        "element",
        "corresponding",
        "frege",
        "translation",
        "mcguinness",
        "ed",
        "imaginary",
        "form",
        "frege",
        "referring",
        "imaginary",
        "point",
        "imaginary",
        "curve",
        "line",
        "etc",
        "interestingly",
        "one",
        "section",
        "thesis",
        "concern",
        "representation",
        "complex",
        "number",
        "magnitude",
        "angle",
        "plane",
        "frege",
        "completed",
        "habilitationsschrift",
        "entitled",
        "rechnungsmethoden",
        "die",
        "sich",
        "auf",
        "eine",
        "erweiterung",
        "de",
        "grössenbegriffes",
        "gründen",
        "method",
        "calculation",
        "based",
        "extension",
        "concept",
        "quantity",
        "immediately",
        "submitting",
        "thesis",
        "good",
        "office",
        "abbe",
        "led",
        "frege",
        "become",
        "privatdozent",
        "lecturer",
        "university",
        "jena",
        "library",
        "record",
        "university",
        "jena",
        "establish",
        "next",
        "year",
        "frege",
        "checked",
        "text",
        "mechanic",
        "analysis",
        "geometry",
        "abelian",
        "function",
        "elliptical",
        "function",
        "kreiser",
        "doubt",
        "many",
        "text",
        "helped",
        "prepare",
        "lecture",
        "listed",
        "giving",
        "university",
        "jena",
        "course",
        "bulletin",
        "lecture",
        "topic",
        "often",
        "match",
        "text",
        "ie",
        "analytic",
        "geometry",
        "elliptical",
        "abelian",
        "function",
        "algebraic",
        "analysis",
        "function",
        "complex",
        "variable",
        "etc",
        "kratzsch",
        "course",
        "frege",
        "reading",
        "lecture",
        "period",
        "dovetailed",
        "quite",
        "naturally",
        "interest",
        "displayed",
        "habilitationsschrift",
        "extension",
        "concept",
        "quantity",
        "referred",
        "title",
        "concern",
        "fact",
        "understanding",
        "quantity",
        "eg",
        "length",
        "surface",
        "etc",
        "extended",
        "context",
        "complex",
        "number",
        "say",
        "right",
        "beginning",
        "work",
        "according",
        "old",
        "conception",
        "length",
        "appears",
        "something",
        "material",
        "fill",
        "straight",
        "line",
        "end",
        "point",
        "time",
        "prevents",
        "another",
        "thing",
        "penetrating",
        "space",
        "rigidity",
        "adding",
        "quantity",
        "therefore",
        "forced",
        "place",
        "one",
        "quantity",
        "another",
        "something",
        "similar",
        "hold",
        "surface",
        "solid",
        "content",
        "introduction",
        "negative",
        "quantity",
        "made",
        "dent",
        "conception",
        "imaginary",
        "quantity",
        "made",
        "completely",
        "impossible",
        "matter",
        "point",
        "origin",
        "end",
        "point",
        "idea",
        "filling",
        "space",
        "completely",
        "lost",
        "remained",
        "certain",
        "general",
        "property",
        "addition",
        "emerge",
        "essential",
        "characteristic",
        "mark",
        "quantity",
        "concept",
        "thus",
        "gradually",
        "freed",
        "intuition",
        "made",
        "independent",
        "quite",
        "unobjectionable",
        "especially",
        "since",
        "earlier",
        "intuitive",
        "character",
        "bottom",
        "mere",
        "appearance",
        "bounded",
        "straight",
        "line",
        "plane",
        "enclosed",
        "curve",
        "certainly",
        "intuited",
        "quantitative",
        "common",
        "length",
        "surface",
        "escape",
        "intuition",
        "accordingly",
        "noteworthy",
        "difference",
        "geometry",
        "arithmetic",
        "way",
        "fundamental",
        "principle",
        "grounded",
        "element",
        "geometrical",
        "construction",
        "intuition",
        "geometry",
        "refers",
        "intuition",
        "source",
        "axiom",
        "since",
        "object",
        "arithmetic",
        "intuitive",
        "character",
        "fundamental",
        "proposition",
        "stem",
        "intuition",
        "frege",
        "translation",
        "mcguinness",
        "ed",
        "see",
        "beginning",
        "two",
        "lifelong",
        "interest",
        "frege",
        "namely",
        "concept",
        "definition",
        "developed",
        "one",
        "domain",
        "fare",
        "applied",
        "wider",
        "domain",
        "contrast",
        "legitimate",
        "appeal",
        "intuition",
        "geometry",
        "illegitimate",
        "appeal",
        "intuition",
        "development",
        "pure",
        "number",
        "theory",
        "indeed",
        "recent",
        "scholar",
        "shown",
        "frege",
        "work",
        "logic",
        "informed",
        "part",
        "understanding",
        "analogy",
        "disanalogies",
        "geometry",
        "number",
        "theory",
        "wilson",
        "b",
        "shown",
        "frege",
        "intimately",
        "familiar",
        "division",
        "among",
        "late",
        "th",
        "century",
        "mathematician",
        "complex",
        "analysis",
        "split",
        "whether",
        "better",
        "use",
        "analytic",
        "method",
        "weierstrass",
        "intuitive",
        "geometric",
        "method",
        "riemann",
        "tappenden",
        "weierstrass",
        "paper",
        "describing",
        "realvalued",
        "function",
        "continuous",
        "everywhere",
        "differentiable",
        "nowhere",
        "well",
        "known",
        "provided",
        "example",
        "ungraphable",
        "function",
        "place",
        "limit",
        "intuition",
        "yet",
        "time",
        "frege",
        "clearly",
        "accepted",
        "riemann",
        "practice",
        "method",
        "derived",
        "taking",
        "function",
        "fundamental",
        "opposed",
        "weierstrass",
        "focus",
        "function",
        "represented",
        "analyzed",
        "term",
        "mathematical",
        "object",
        "eg",
        "complex",
        "power",
        "series",
        "frege",
        "published",
        "first",
        "book",
        "begriffsschrift",
        "eine",
        "der",
        "arithmetischen",
        "nachgebildete",
        "formelsprache",
        "de",
        "reinen",
        "denkens",
        "concept",
        "notation",
        "formula",
        "language",
        "pure",
        "thought",
        "modelled",
        "upon",
        "arithmetic",
        "promoted",
        "außerordentlicher",
        "professor",
        "extraordinarius",
        "professor",
        "jena",
        "although",
        "begriffsschrift",
        "constituted",
        "major",
        "advance",
        "logic",
        "neither",
        "widely",
        "understood",
        "wellreceived",
        "scholar",
        "suggested",
        "due",
        "fact",
        "notation",
        "dimensional",
        "instead",
        "linear",
        "build",
        "upon",
        "work",
        "others",
        "rather",
        "presented",
        "something",
        "radically",
        "new",
        "eg",
        "mendelsohn",
        "though",
        "discussion",
        "framed",
        "primarily",
        "eye",
        "towards",
        "system",
        "frege",
        "developed",
        "twovolume",
        "work",
        "grundgesetze",
        "der",
        "arithmetik",
        "principal",
        "element",
        "later",
        "system",
        "found",
        "already",
        "begriffsschrift",
        "frege",
        "next",
        "really",
        "significant",
        "work",
        "second",
        "book",
        "die",
        "grundlagen",
        "der",
        "arithmetik",
        "eine",
        "logisch",
        "mathematische",
        "untersuchung",
        "über",
        "den",
        "begriff",
        "der",
        "zahl",
        "published",
        "frege",
        "begin",
        "work",
        "criticism",
        "previous",
        "attempt",
        "define",
        "concept",
        "number",
        "offer",
        "analysis",
        "grundlagen",
        "contains",
        "variety",
        "insight",
        "still",
        "discussed",
        "today",
        "claim",
        "statement",
        "number",
        "eg",
        "eight",
        "planet",
        "higherorder",
        "assertion",
        "concept",
        "see",
        "section",
        "b",
        "famous",
        "context",
        "principle",
        "never",
        "ask",
        "meaning",
        "word",
        "isolation",
        "context",
        "proposition",
        "c",
        "formulation",
        "principle",
        "called",
        "hume",
        "principle",
        "secondary",
        "literature",
        "asserts",
        "equivalence",
        "claim",
        "number",
        "f",
        "equal",
        "number",
        "g",
        "claim",
        "onetoone",
        "correspondence",
        "object",
        "falling",
        "f",
        "object",
        "falling",
        "g",
        "see",
        "section",
        "generally",
        "frege",
        "provides",
        "grundlagen",
        "nontechnical",
        "philosophical",
        "justification",
        "outline",
        "idea",
        "develop",
        "technically",
        "twovolume",
        "work",
        "grundgesetze",
        "der",
        "arithmetik",
        "year",
        "frege",
        "gave",
        "thought",
        "philosophy",
        "language",
        "would",
        "help",
        "ground",
        "philosophy",
        "mathematics",
        "published",
        "three",
        "wellknown",
        "paper",
        "function",
        "concept",
        "sense",
        "reference",
        "a",
        "concept",
        "object",
        "b",
        "period",
        "work",
        "eventually",
        "supplemented",
        "three",
        "paper",
        "philosophy",
        "language",
        "later",
        "period",
        "thought",
        "a",
        "negation",
        "b",
        "compound",
        "thought",
        "shall",
        "see",
        "section",
        "work",
        "considered",
        "light",
        "recent",
        "scholarship",
        "providing",
        "evidence",
        "frege",
        "heavily",
        "borrowed",
        "stoic",
        "philosophy",
        "though",
        "frege",
        "always",
        "motivated",
        "recast",
        "often",
        "rigorous",
        "term",
        "idea",
        "absorbed",
        "others",
        "documentation",
        "concerning",
        "origin",
        "many",
        "idea",
        "stoic",
        "corpus",
        "taken",
        "seriously",
        "published",
        "first",
        "volume",
        "technical",
        "work",
        "previously",
        "mentioned",
        "grundgesetze",
        "der",
        "arithmetik",
        "promoted",
        "ordentlicher",
        "honorarprofessor",
        "regular",
        "honorary",
        "professor",
        "six",
        "year",
        "later",
        "june",
        "preparing",
        "proof",
        "second",
        "volume",
        "grundgesetze",
        "received",
        "letter",
        "bertrand",
        "russell",
        "informing",
        "one",
        "could",
        "derive",
        "contradiction",
        "system",
        "developed",
        "first",
        "volume",
        "russell",
        "letter",
        "frame",
        "paradox",
        "first",
        "term",
        "predicate",
        "p",
        "predicate",
        "predicated",
        "term",
        "class",
        "class",
        "member",
        "frege",
        "appendix",
        "second",
        "volume",
        "rephrased",
        "paradox",
        "term",
        "system",
        "frege",
        "never",
        "fully",
        "recovered",
        "fatal",
        "flaw",
        "discovered",
        "foundation",
        "grundgesetze",
        "attempt",
        "salvaging",
        "work",
        "restricting",
        "basic",
        "law",
        "v",
        "successful",
        "however",
        "continued",
        "teaching",
        "jena",
        "published",
        "six",
        "paper",
        "including",
        "function",
        "foundation",
        "geometry",
        "frege",
        "b",
        "latter",
        "frege",
        "criticized",
        "hilbert",
        "understanding",
        "use",
        "axiomatic",
        "method",
        "see",
        "entry",
        "fregehilbert",
        "controversy",
        "time",
        "period",
        "lecture",
        "note",
        "rudolf",
        "carnap",
        "took",
        "student",
        "two",
        "course",
        "see",
        "reck",
        "awodey",
        "retired",
        "university",
        "jena",
        "last",
        "phase",
        "life",
        "frege",
        "published",
        "paper",
        "mentioned",
        "earlier",
        "a",
        "b",
        "developed",
        "unpublished",
        "fragment",
        "philosophical",
        "work",
        "unfortunately",
        "last",
        "year",
        "saw",
        "become",
        "politically",
        "conservative",
        "diary",
        "brief",
        "period",
        "show",
        "sympathy",
        "fascism",
        "antisemitism",
        "see",
        "frege",
        "translated",
        "r",
        "mendelsohn",
        "died",
        "july",
        "bad",
        "kleinen",
        "mecklenburgvorpommern"
    ]
}