{
    "main_text": "Neo-Kantianism || Ethics and the Critique of Religion and Metaphysics\n4.2 Ethics and the Critique of Religion and Metaphysics\n\nAccording to Beiser’s account (2014b), Lange’s work in\nThe History of Materialism “succeeded in throwing the\nmaterialists back on the defensive” (p. 95).\n“Lange’s book,” Beiser writes, “appealed to\neveryone who wanted the materialist critique of religion and its\nscientific program but who also could not approve of its naive\nmetaphysics and its failure to account for basic human values”\n(p. 95).\n\nFor Lange, the realization that metaphysics is a creation of the\nimagination, similar to art, opens up a way to respond to the damaging\nethical consequences of the materialistic world view (Widmer,\nforthcoming). Though he does seem to think that the materialistic\nworld views of many of his contemporaries influence their ethics, it\nis less clear whether Lange thinks that the kind of materialism\ndiscussed above actually entails any ethical positions. At times Lange\nclaims that both a normative principle of ethical egoism and a\nprinciple of sympathy for humanity can both be “derived”\n[abgeleitet] from theoretical materialism (Lange\n1873–75, 3:260, 303). It is perhaps most charitable to read\nLange as suggesting that there is nothing in materialism that requires\none principle or the other, but that one could find oneself attracted\nto either principle, even if one started from theoretical materialism.\nHis considered view appears to be that materialists have a plausible\nexplanatory account for certain kinds of human behaviour, but that\nthey slide from this plausible explanatory account to problematic\nnormative claims. His label “ethical materialism” seems to\nbe a label for the kind of ethical positions that materialists tend to\naccept as a matter of sociological or psychological fact rather than\nsome particular ethical position required by materialism.\n\nLange begins by granting that regarding humans as egoists concerned\nonly with satisfying their desires may well be an abstraction that\nallows for some degree of predictive success when it comes to\nexplaining human behaviour in the marketplace. The mistake the\nmaterialist makes is “in confounding this abstraction with\nreality” (Lange 1873–75, 3:233–237). The materialist\nassumes that the abstraction of the rational egoist is an accurate\npicture of all of human behaviour and, perhaps even more damagingly,\nan ethical ideal for how we should behave. Part of the problem is that\nethical materialism has a mistaken account of the human good. It\nclaims that “a man is all the happier the more wants he has, if\nhe has at the same time sufficient means for their satisfaction”\n(Lange 1873–75, 3:239). This is mistaken because what matters is\nthe nature of the want and, so Lange, the way the want comes about and\nis satisfied (Lange 1873–75, 3:241). Finally serious concerns\nabout issues of distributive justice are avoided by what Lange\nconsiders to be quite implausible appeals to “invisible\nhand” arguments (Lange 1873–75, 3:242–259). As in\nthe case of Marx, this does not mean that Lange denies the usefulness\nof markets in increasing productivity and encouraging technical\ninnovation. The problem with markets is that they generate inequality\nand hinder human flourishing.\n\nLange thinks that materialism, or rather science in general, will\nundermine religion, or at least traditional forms of it. He takes\nseriously the concern that this might also undermine moral commitment.\nHe points out that it is not obvious how effective religion really is\nin influencing moral behaviour. The New Testament’s claim that\nit is easier for a camel to pass through the eye of a needle than for\na rich man to enter the kingdom of heaven seems to have little impact\non the acquisitiveness of contemporary Christian capitalists,\n“while the servants of the Church sit at the tables of the rich\nand preach submissiveness to the poor” (Lange 1873–75,\n3:270–271). Such Christian ideas have encouraged universalistic\nconcern and have combatted egoism and this, other things equal, is\nmorally beneficial. What prevents these ideas from having more\ninfluence, and more of a purely positive influence, is the dogmatic\nform in which they appear, and the nature of the institution of the\nChurch itself. The power of the Church to force the acceptance of its\ndogmas not only results in unwarranted beliefs but also in a general\ndebasement of our mental abilities (Lange 1873–75, 3:275).\n\nReligion, like the other creations of our imagination, can have a\npowerful influence. The mistake is to confuse such creations with the\nknowledge that science provides (Lange 1873–75, 3:280). Lange\nthinks that “the classification of religion with art and\nmetaphysics will at no very distant time be generally conceded”.\nThe “great mass of believers of all religions” are\n“in a state of mind like that in which children listen to\nfairy-tales” (Lange 1873–75, 3:281). The coming\nrealization though that these are all fairy tales does not mean that\n“the sense for poesy” is not important even when we are,\nso to speak, adults (Lange 1873–75, 3:281). When it comes to\n“the direction of the impulses towards the general good”,\nthen “mere moral teaching will hardly be likely to produce a\nframe of mind to which trumpet-peals and hymns are appropriate”\n(Lange 1873–75, 3:299). We need to set up ideals, indeed\n“[o]ne thing is certain, that man needs to supplement reality by\nan ideal world of his own creation”. This ideal world, these\nmyths, are meant to inspire us to be moral and help us overcome\n“spiritual impoverishment” just as the myths, the ideals,\nof Christianity can, at their best, inspire us (cf. Kant 1787,\nA569/B597 and Kant 1793, §17). His model is Schiller’s\nphilosophical poetry (Lange 1873–75, 3:342–44; Lange\n1897).\n\nBut what are these myths supposed to inspire us to? Are there\nconstraints on which myths we should create? This is not always clear\nin Lange. As we have seen it does seem that at least we are supposed\nto be inspired to be moral. This suggests that at least morality\nitself is not a myth. But if it is not a myth, then does this mean\nthat we have some way of knowing moral truths—that morality\nsomehow escapes the problems raised for other areas of purported\nmetaphysical knowledge? Again, Lange’s writings on this point\nare not clear and there is some evidence that he was not quite sure\nwhat position to take. Given the general emphasis on Kant, it comes as\nno surprise that Lange would take seriously what Kant has to say about\nthis. What variation on Kant’s view he finally accepts though is\nharder to discern.\n\nThe version of Kant’s view that Lange considers is the one\npresented in the Critique of Practical Reason. Lange’s\nfocus on this version, like his interpretation of Kant’s views\non theoretical reason, set him apart from many later Kant scholars.\nThe Critique of Practical Reason shares with Kant’s\nother writings the claim that there is a fundamental law of practical\nreason which is also the moral law. It focusses though on one\nparticular formulation of this law: “So act that the maxim of\nyour will could always hold at the same time as a principle in a\ngiving of universal law”. What is distinctive about the\nCritique of Practical Reason is that Kant then\nproceeds to give a distinctive account of how we come to know this law\nor how this law is justified. He writes:\n\nConsciousness of this fundamental law may be called a fact of reason\nbecause one cannot reason it out from antecedent data of reason, for\nexample, from consciousness of freedom (since this is not antecedently\ngiven to us) and because it instead forces itself upon us of itself as\na synthetic a priori proposition that is not based on any intuition,\neither pure or empirical. (Kant 1788, 5:31)\n\n\nAccording to this “fact of reason” version, we seem to\nhave a particular moral law forced on us in our mental lives and we\nare unable to give any deeper justification of this moral law—it\nis just a fact that we have to accept. It is a fact that I am bound by\nthe moral law. However, I could not be bound by the moral law unless I\ncould follow it and I cannot follow this moral law unless I am free.\nKant thus argues that we can conclude for practical purposes that we\nare free.\n\nLange seems to accept the content of the law, and treats it as\nsupporting the kind of universalistic and impartial concern he sees as\nstanding in opposition to egoism. However, he is clearly worried about\nwhether Kant has really succeeded in providing a justification for the\nmoral law.\n\nIn the first edition of his History, he claims that any moral\nphilosophy could use this strategy and thus that “if Kant\nbelieves that he has absolutely proved his [moral philosophy], then he\nsimply commits the usual mistake of all metaphysicians”. In the\nfirst edition, this claim comes near the end of the section on Kant,\nand is immediately followed by a summary of what he takes to be\nKant’s “Copernican Revolution”: (i) “The world\nof appearances is a consequence of our concepts”. (ii)\n“The ideas”, in Kant’s sense presumably of concepts\nof reason whose objects are not such that they could be met in\nexperience (Kant 1787, A311/B368–A320/B377), “give us no\nknowledge, rather they lead us to an imagined world. It is precisely\nin this that their usefulness lies. We deceive ourselves when we try\nto increase our knowledge through them; we enrich ourselves when we\nmake them the foundation of our actions.” (iii) “The one\nabsolute that man has is the moral law and from this fixed point a\nsecure order can be brought to the unstable world of the ideas”.\nAfter this summary of what he takes to be Kant’s position, Lange\ndeclares his support for (i) and (ii) but seems to reject (iii) for\ngrounds similar to those we have already seen. Kant’s claim that\nhis moral law is a fixed point is somehow “subjective” and\nshows Kant as being a child of his times. According to Lange, the\nlasting achievement of (iii) is the more general claim that “the\nideal is no longer to be judged by supposed evidence but rather by its\nrelationship to the ethical ends of mankind” (Lange 1866b,\n277–78). This is where the discussion of the fundamental moral\nlaw in the first edition ends. It leaves open the question of what\nethical ends are supposed to be used to judge the ideals we create in\nour myths, and of how we are supposed to defend these ethical ends\nwithout becoming metaphysicians.\n\nIn the second edition of his History, the claims quoted in\nthe previous paragraph have been removed. After giving a brief summary\nof Kant’s appeal to a “fact of reason” and his\nargument for freedom, Lange does not go on to suggest that Kant may be\nmaking the mistake of all metaphysicians. Rather, he writes: “So\nfar Kant’s doctrine of freedom is perfectly clear\nand—apart from the question of the a priority of the\nmoral law—invulnerable” (Lange 1873–75, 2:229). What\nfollows is a new discussion of Kant’s conception of our freedom\nand worries about our freedom being apparently restricted only to the\nnoumenal realm. Lange does return to declarations in favour of\nconstructing ideals, but gives no further explanation of how we are\nsupposed to find ethical ends, or a moral law, that guides the\nconstruction of these ideals, nor, for that matter, what problem in\nspecific lies behind the above mentioned “question of the a\npriority of the moral law” (Lange 1873–75).\n\nOne possible reason for the changes to the material on Kant between\nLange’s first and second editions is the influence of Hermann\nCohen, Lange’s protege and the founder of the Marburg School of\nNeo-Kantianism. As Sieg (1994) details, Cohen published his major work\nKant’s Theory of Experience in 1871, in which he\ncriticized “Lange’s understanding of the Kantian a priori\nas a naturalist misinterpretation” (p. 104). By November 1871,\nLange and Cohen were in correspondence, and Lange indicated that he\nwas impressed by Cohen’s criticisms. According to Sieg (1994),\nLange’s second edition shows that he is interpreting the Kantian\nthing in itself as a “limiting concept [Grenzbegriff]” in\nCohen’s sense (p. 104). For an account of the development of\nLange’s thought on this score, and of the mutual influence of\nLange and Cohen, see Adelmann (2012), pp. 83–93.\n\nBeiser (2014b) suggests that some of the changes between the first and\nthe second editions of the History of Materialism were\nprompted by a sea change in the prevailing view in the natural\nsciences. The older theories of Czolbe, Büchner, and Vogt had\nbeen spectacularly superseded by Darwinism and its interpretations by\nhis German exponents, Ernst Häckel and Carl Gegenbauer (p. 96).\nBeiser notes that Darwinism’s triumph should not be read as\n“a vindication of materialism itself” (p. 96). As Hermann\nLotze observes, Darwin’s explanations of organisms and species\ndid not require that those organisms or species be viewed as reducible\nto solely material objects (see Beiser 2014b, p. 96). Nonetheless, the\nincreasing dominance of Darwinism in Germany meant that the\nmaterialist program dwindled in influence as a scientific project, and\nso its broader impact was checked as well. Lange’s death in 1875\ncoincided with the rise of Darwinism in Germany, and thus his\nresponses to this change in the intellectual context were limited.\n",
    "section_title": "4.2 Ethics and the Critique of Religion and Metaphysics",
    "entry_title": "Friedrich Albert Lange",
    "hierarchy_title": "Friedrich Albert Lange || Neo-Kantianism || Ethics and the Critique of Religion and Metaphysics",
    "tokenized_text": [
        "neokantianism",
        "ethic",
        "critique",
        "religion",
        "metaphysics",
        "ethic",
        "critique",
        "religion",
        "metaphysics",
        "according",
        "beiser",
        "account",
        "b",
        "lange",
        "work",
        "history",
        "materialism",
        "succeeded",
        "throwing",
        "materialist",
        "back",
        "defensive",
        "p",
        "lange",
        "book",
        "beiser",
        "writes",
        "appealed",
        "everyone",
        "wanted",
        "materialist",
        "critique",
        "religion",
        "scientific",
        "program",
        "also",
        "could",
        "approve",
        "naive",
        "metaphysics",
        "failure",
        "account",
        "basic",
        "human",
        "value",
        "p",
        "lange",
        "realization",
        "metaphysics",
        "creation",
        "imagination",
        "similar",
        "art",
        "open",
        "way",
        "respond",
        "damaging",
        "ethical",
        "consequence",
        "materialistic",
        "world",
        "view",
        "widmer",
        "forthcoming",
        "though",
        "seem",
        "think",
        "materialistic",
        "world",
        "view",
        "many",
        "contemporary",
        "influence",
        "ethic",
        "le",
        "clear",
        "whether",
        "lange",
        "think",
        "kind",
        "materialism",
        "discussed",
        "actually",
        "entail",
        "ethical",
        "position",
        "time",
        "lange",
        "claim",
        "normative",
        "principle",
        "ethical",
        "egoism",
        "principle",
        "sympathy",
        "humanity",
        "derived",
        "abgeleitet",
        "theoretical",
        "materialism",
        "lange",
        "perhaps",
        "charitable",
        "read",
        "lange",
        "suggesting",
        "nothing",
        "materialism",
        "requires",
        "one",
        "principle",
        "one",
        "could",
        "find",
        "oneself",
        "attracted",
        "either",
        "principle",
        "even",
        "one",
        "started",
        "theoretical",
        "materialism",
        "considered",
        "view",
        "appears",
        "materialist",
        "plausible",
        "explanatory",
        "account",
        "certain",
        "kind",
        "human",
        "behaviour",
        "slide",
        "plausible",
        "explanatory",
        "account",
        "problematic",
        "normative",
        "claim",
        "label",
        "ethical",
        "materialism",
        "seems",
        "label",
        "kind",
        "ethical",
        "position",
        "materialist",
        "tend",
        "accept",
        "matter",
        "sociological",
        "psychological",
        "fact",
        "rather",
        "particular",
        "ethical",
        "position",
        "required",
        "materialism",
        "lange",
        "begin",
        "granting",
        "regarding",
        "human",
        "egoist",
        "concerned",
        "satisfying",
        "desire",
        "may",
        "well",
        "abstraction",
        "allows",
        "degree",
        "predictive",
        "success",
        "come",
        "explaining",
        "human",
        "behaviour",
        "marketplace",
        "mistake",
        "materialist",
        "make",
        "confounding",
        "abstraction",
        "reality",
        "lange",
        "materialist",
        "assumes",
        "abstraction",
        "rational",
        "egoist",
        "accurate",
        "picture",
        "human",
        "behaviour",
        "perhaps",
        "even",
        "damagingly",
        "ethical",
        "ideal",
        "behave",
        "part",
        "problem",
        "ethical",
        "materialism",
        "mistaken",
        "account",
        "human",
        "good",
        "claim",
        "man",
        "happier",
        "want",
        "time",
        "sufficient",
        "mean",
        "satisfaction",
        "lange",
        "mistaken",
        "matter",
        "nature",
        "want",
        "lange",
        "way",
        "want",
        "come",
        "satisfied",
        "lange",
        "finally",
        "serious",
        "concern",
        "issue",
        "distributive",
        "justice",
        "avoided",
        "lange",
        "considers",
        "quite",
        "implausible",
        "appeal",
        "invisible",
        "hand",
        "argument",
        "lange",
        "case",
        "marx",
        "mean",
        "lange",
        "denies",
        "usefulness",
        "market",
        "increasing",
        "productivity",
        "encouraging",
        "technical",
        "innovation",
        "problem",
        "market",
        "generate",
        "inequality",
        "hinder",
        "human",
        "flourishing",
        "lange",
        "think",
        "materialism",
        "rather",
        "science",
        "general",
        "undermine",
        "religion",
        "least",
        "traditional",
        "form",
        "take",
        "seriously",
        "concern",
        "might",
        "also",
        "undermine",
        "moral",
        "commitment",
        "point",
        "obvious",
        "effective",
        "religion",
        "really",
        "influencing",
        "moral",
        "behaviour",
        "new",
        "testament",
        "claim",
        "easier",
        "camel",
        "pas",
        "eye",
        "needle",
        "rich",
        "man",
        "enter",
        "kingdom",
        "heaven",
        "seems",
        "little",
        "impact",
        "acquisitiveness",
        "contemporary",
        "christian",
        "capitalist",
        "servant",
        "church",
        "sit",
        "table",
        "rich",
        "preach",
        "submissiveness",
        "poor",
        "lange",
        "christian",
        "idea",
        "encouraged",
        "universalistic",
        "concern",
        "combatted",
        "egoism",
        "thing",
        "equal",
        "morally",
        "beneficial",
        "prevents",
        "idea",
        "influence",
        "purely",
        "positive",
        "influence",
        "dogmatic",
        "form",
        "appear",
        "nature",
        "institution",
        "church",
        "power",
        "church",
        "force",
        "acceptance",
        "dogma",
        "result",
        "unwarranted",
        "belief",
        "also",
        "general",
        "debasement",
        "mental",
        "ability",
        "lange",
        "religion",
        "like",
        "creation",
        "imagination",
        "powerful",
        "influence",
        "mistake",
        "confuse",
        "creation",
        "knowledge",
        "science",
        "provides",
        "lange",
        "lange",
        "think",
        "classification",
        "religion",
        "art",
        "metaphysics",
        "distant",
        "time",
        "generally",
        "conceded",
        "great",
        "mass",
        "believer",
        "religion",
        "state",
        "mind",
        "like",
        "child",
        "listen",
        "fairytales",
        "lange",
        "coming",
        "realization",
        "though",
        "fairy",
        "tale",
        "mean",
        "sense",
        "poesy",
        "important",
        "even",
        "speak",
        "adult",
        "lange",
        "come",
        "direction",
        "impulse",
        "towards",
        "general",
        "good",
        "mere",
        "moral",
        "teaching",
        "hardly",
        "likely",
        "produce",
        "frame",
        "mind",
        "trumpetpeals",
        "hymn",
        "appropriate",
        "lange",
        "need",
        "set",
        "ideal",
        "indeed",
        "ne",
        "thing",
        "certain",
        "man",
        "need",
        "supplement",
        "reality",
        "ideal",
        "world",
        "creation",
        "ideal",
        "world",
        "myth",
        "meant",
        "inspire",
        "u",
        "moral",
        "help",
        "u",
        "overcome",
        "spiritual",
        "impoverishment",
        "myth",
        "ideal",
        "christianity",
        "best",
        "inspire",
        "u",
        "cf",
        "kant",
        "ab",
        "kant",
        "model",
        "schiller",
        "philosophical",
        "poetry",
        "lange",
        "lange",
        "myth",
        "supposed",
        "inspire",
        "u",
        "constraint",
        "myth",
        "create",
        "always",
        "clear",
        "lange",
        "seen",
        "seem",
        "least",
        "supposed",
        "inspired",
        "moral",
        "suggests",
        "least",
        "morality",
        "myth",
        "myth",
        "mean",
        "way",
        "knowing",
        "moral",
        "truthsthat",
        "morality",
        "somehow",
        "escape",
        "problem",
        "raised",
        "area",
        "purported",
        "metaphysical",
        "knowledge",
        "lange",
        "writing",
        "point",
        "clear",
        "evidence",
        "quite",
        "sure",
        "position",
        "take",
        "given",
        "general",
        "emphasis",
        "kant",
        "come",
        "surprise",
        "lange",
        "would",
        "take",
        "seriously",
        "kant",
        "say",
        "variation",
        "kant",
        "view",
        "finally",
        "accepts",
        "though",
        "harder",
        "discern",
        "version",
        "kant",
        "view",
        "lange",
        "considers",
        "one",
        "presented",
        "critique",
        "practical",
        "reason",
        "lange",
        "focus",
        "version",
        "like",
        "interpretation",
        "kant",
        "view",
        "theoretical",
        "reason",
        "set",
        "apart",
        "many",
        "later",
        "kant",
        "scholar",
        "critique",
        "practical",
        "reason",
        "share",
        "kant",
        "writing",
        "claim",
        "fundamental",
        "law",
        "practical",
        "reason",
        "also",
        "moral",
        "law",
        "focus",
        "though",
        "one",
        "particular",
        "formulation",
        "law",
        "act",
        "maxim",
        "could",
        "always",
        "hold",
        "time",
        "principle",
        "giving",
        "universal",
        "law",
        "distinctive",
        "critique",
        "practical",
        "reason",
        "kant",
        "proceeds",
        "give",
        "distinctive",
        "account",
        "come",
        "know",
        "law",
        "law",
        "justified",
        "writes",
        "consciousness",
        "fundamental",
        "law",
        "may",
        "called",
        "fact",
        "reason",
        "one",
        "reason",
        "antecedent",
        "data",
        "reason",
        "example",
        "consciousness",
        "freedom",
        "since",
        "antecedently",
        "given",
        "u",
        "instead",
        "force",
        "upon",
        "u",
        "synthetic",
        "priori",
        "proposition",
        "based",
        "intuition",
        "either",
        "pure",
        "empirical",
        "kant",
        "according",
        "fact",
        "reason",
        "version",
        "seem",
        "particular",
        "moral",
        "law",
        "forced",
        "u",
        "mental",
        "life",
        "unable",
        "give",
        "deeper",
        "justification",
        "moral",
        "lawit",
        "fact",
        "accept",
        "fact",
        "bound",
        "moral",
        "law",
        "however",
        "could",
        "bound",
        "moral",
        "law",
        "unless",
        "could",
        "follow",
        "follow",
        "moral",
        "law",
        "unless",
        "free",
        "kant",
        "thus",
        "argues",
        "conclude",
        "practical",
        "purpose",
        "free",
        "lange",
        "seems",
        "accept",
        "content",
        "law",
        "treat",
        "supporting",
        "kind",
        "universalistic",
        "impartial",
        "concern",
        "see",
        "standing",
        "opposition",
        "egoism",
        "however",
        "clearly",
        "worried",
        "whether",
        "kant",
        "really",
        "succeeded",
        "providing",
        "justification",
        "moral",
        "law",
        "first",
        "edition",
        "history",
        "claim",
        "moral",
        "philosophy",
        "could",
        "use",
        "strategy",
        "thus",
        "kant",
        "belief",
        "absolutely",
        "proved",
        "moral",
        "philosophy",
        "simply",
        "commits",
        "usual",
        "mistake",
        "metaphysicians",
        "first",
        "edition",
        "claim",
        "come",
        "near",
        "end",
        "section",
        "kant",
        "immediately",
        "followed",
        "summary",
        "take",
        "kant",
        "copernican",
        "revolution",
        "world",
        "appearance",
        "consequence",
        "concept",
        "ii",
        "idea",
        "kant",
        "sense",
        "presumably",
        "concept",
        "reason",
        "whose",
        "object",
        "could",
        "met",
        "experience",
        "kant",
        "abab",
        "give",
        "u",
        "knowledge",
        "rather",
        "lead",
        "u",
        "imagined",
        "world",
        "precisely",
        "usefulness",
        "lie",
        "deceive",
        "try",
        "increase",
        "knowledge",
        "enrich",
        "make",
        "foundation",
        "actions",
        "iii",
        "one",
        "absolute",
        "man",
        "moral",
        "law",
        "fixed",
        "point",
        "secure",
        "order",
        "brought",
        "unstable",
        "world",
        "idea",
        "summary",
        "take",
        "kant",
        "position",
        "lange",
        "declares",
        "support",
        "ii",
        "seems",
        "reject",
        "iii",
        "ground",
        "similar",
        "already",
        "seen",
        "kant",
        "claim",
        "moral",
        "law",
        "fixed",
        "point",
        "somehow",
        "subjective",
        "show",
        "kant",
        "child",
        "time",
        "according",
        "lange",
        "lasting",
        "achievement",
        "iii",
        "general",
        "claim",
        "ideal",
        "longer",
        "judged",
        "supposed",
        "evidence",
        "rather",
        "relationship",
        "ethical",
        "end",
        "mankind",
        "lange",
        "b",
        "discussion",
        "fundamental",
        "moral",
        "law",
        "first",
        "edition",
        "end",
        "leaf",
        "open",
        "question",
        "ethical",
        "end",
        "supposed",
        "used",
        "judge",
        "ideal",
        "create",
        "myth",
        "supposed",
        "defend",
        "ethical",
        "end",
        "without",
        "becoming",
        "metaphysicians",
        "second",
        "edition",
        "history",
        "claim",
        "quoted",
        "previous",
        "paragraph",
        "removed",
        "giving",
        "brief",
        "summary",
        "kant",
        "appeal",
        "fact",
        "reason",
        "argument",
        "freedom",
        "lange",
        "go",
        "suggest",
        "kant",
        "may",
        "making",
        "mistake",
        "metaphysicians",
        "rather",
        "writes",
        "far",
        "kant",
        "doctrine",
        "freedom",
        "perfectly",
        "clear",
        "andapart",
        "question",
        "priority",
        "moral",
        "lawinvulnerable",
        "lange",
        "follows",
        "new",
        "discussion",
        "kant",
        "conception",
        "freedom",
        "worry",
        "freedom",
        "apparently",
        "restricted",
        "noumenal",
        "realm",
        "lange",
        "return",
        "declaration",
        "favour",
        "constructing",
        "ideal",
        "give",
        "explanation",
        "supposed",
        "find",
        "ethical",
        "end",
        "moral",
        "law",
        "guide",
        "construction",
        "ideal",
        "matter",
        "problem",
        "specific",
        "lie",
        "behind",
        "mentioned",
        "question",
        "priority",
        "moral",
        "law",
        "lange",
        "one",
        "possible",
        "reason",
        "change",
        "material",
        "kant",
        "lange",
        "first",
        "second",
        "edition",
        "influence",
        "hermann",
        "cohen",
        "lange",
        "protege",
        "founder",
        "marburg",
        "school",
        "neokantianism",
        "sieg",
        "detail",
        "cohen",
        "published",
        "major",
        "work",
        "kant",
        "theory",
        "experience",
        "criticized",
        "lange",
        "understanding",
        "kantian",
        "priori",
        "naturalist",
        "misinterpretation",
        "p",
        "november",
        "lange",
        "cohen",
        "correspondence",
        "lange",
        "indicated",
        "impressed",
        "cohen",
        "criticism",
        "according",
        "sieg",
        "lange",
        "second",
        "edition",
        "show",
        "interpreting",
        "kantian",
        "thing",
        "limiting",
        "concept",
        "grenzbegriff",
        "cohen",
        "sense",
        "p",
        "account",
        "development",
        "lange",
        "thought",
        "score",
        "mutual",
        "influence",
        "lange",
        "cohen",
        "see",
        "adelmann",
        "pp",
        "beiser",
        "b",
        "suggests",
        "change",
        "first",
        "second",
        "edition",
        "history",
        "materialism",
        "prompted",
        "sea",
        "change",
        "prevailing",
        "view",
        "natural",
        "science",
        "older",
        "theory",
        "czolbe",
        "büchner",
        "vogt",
        "spectacularly",
        "superseded",
        "darwinism",
        "interpretation",
        "german",
        "exponent",
        "ernst",
        "häckel",
        "carl",
        "gegenbauer",
        "p",
        "beiser",
        "note",
        "darwinism",
        "triumph",
        "read",
        "vindication",
        "materialism",
        "p",
        "hermann",
        "lotze",
        "observes",
        "darwin",
        "explanation",
        "organism",
        "specie",
        "require",
        "organism",
        "specie",
        "viewed",
        "reducible",
        "solely",
        "material",
        "object",
        "see",
        "beiser",
        "b",
        "p",
        "nonetheless",
        "increasing",
        "dominance",
        "darwinism",
        "germany",
        "meant",
        "materialist",
        "program",
        "dwindled",
        "influence",
        "scientific",
        "project",
        "broader",
        "impact",
        "checked",
        "well",
        "lange",
        "death",
        "coincided",
        "rise",
        "darwinism",
        "germany",
        "thus",
        "response",
        "change",
        "intellectual",
        "context",
        "limited"
    ]
}