{
    "main_text": "Objections to Functionalism || .3 Functionalism and the Knowledge Argument\n6. The Future of Functionalism\n\nIn the last part of the 20th century, functionalism stood as the\ndominant theory of mental states. Like behaviorism, functionalism\ntakes mental states out of the realm of the “private” or\nsubjective, and gives them status as entities open to scientific\ninvestigation. But, in contrast to behaviorism, functionalism’s\ncharacterization of mental states in terms of their roles in the\nproduction of behavior grants them the causal efficacy that common\nsense takes them to have. Moreover, functionalism, in contrast to the\npsychophysical identity thesis, seems to offer an account of mental\nstates that is friendly to materialism without limiting the class of\nthose with minds to creatures with brains like ours.\n\nMore recently, however, there has been a resurgence of interest in the\npsycho-physical (type-) identity thesis. This is fueled in part by the\nobservation that in the actual practice of neuroscience, neural states\nare type-individuated more coarsely than early identity theorists such\nas Place, Feigl, and Smart assumed, and the contention that, contrary\nto the claims of early defenders of functionalism (e.g. Putnam), there\nare relatively few extant creatures that are physically unlike humans\nbut share our functional organization. If this is so, then it may well\nbe that many of our genuine functional equivalents that differ from us\nin their fine-grained neurophysiological make-up can nonetheless share\nour neural, as well as mental, states, and thus that the\npsycho-physical identity thesis can claim some of the scope once\nthought to be exclusive to functionalism. (See Bechtel 2012, Bickle\n2012, McCauley 2012, Shapiro & Polger 2012, and Polger &\nShapiro 2016.)\n\nThe plausibility of this thesis, of course, depends on whether or not\nthese underlying similarities would in fact be (coarse grained)\nneural similarities, and not (fine-grained) psycho-functional\nsimilarities. In addition, functionalists can argue that there are\npossible creatures, both biological and (especially)\nnon-biological, that are functionally equivalent to us but do not\npossess even our coarse-grained neural properties. If so, and if these\ncreatures can plausibly be regarded as sharing our mental states\n– to be sure, a controversial thesis – then even if neural\nstates can be individuated more coarsely, some variety of\nfunctionalism will retain its claim to greater universality than the\nidentity thesis.\n\nAnother source of skepticism about the relative universality of\nfunctionalist (versus type-identity) theories derives from the\nsuggestion that – at least in humans – the properties that\ncould play the relevant roles in our functional architecture are not\nexclusively electrical impulses of our neurons, but a combination of\nthese impulses plus other features of the brain and body,\nincluding the endocrine system. (See Cao 2022 and Damasio 1999.) If\nthis is so, then there may be fewer extant examples of creatures that\nare functional, but not physical, duplicates of humans, and it may be\nless likely that such creatures are even nomologically possible. They\nmay, of course, be metaphysically possible, existing in fairly distant\npossible worlds, but there is debate about whether this is plausible,\nand if so, whether it would seriously undermine the psycho-physical\nidentity theory.\n\nOn the other hand, some critics of the psycho-physical identity theory\ncontend that only a theory that characterizes mental states as\nhigher-order properties, with causal powers not possessed by the\nstates or properties that realize them, can preserve the explanatory\nhierarchy modeled on the relations between biology and chemistry, and\nchemistry and physics. The identification of mental states with\nfunctional roles would do the trick, whether or not our mental states\nare in fact multiply realized. (See Gillett 2002, Aizawa and Gillett\n2007, 2009, and the essays in DeJoong and Shouten 2007 for further\ndiscussion; see also the entry on\n multiple realizability.)\n These questions remain the subject of active debate.\n\nYet another question is whether Role Functionalism, by itself, is as\nfriendly to materialism as its initial advocates had suggested –\neven if the functional roles to be identified with mental states are\nrealized exclusively by physical states. It is generally agreed that\nthe mere supervenience of the mental on the physical – that is,\nthe impossibility of there being a mental difference without some\nphysical difference – leaves open the possibility that mental\nproperties are emergent properties with additional causal powers,\nwhereas the realization of mental states by physical states eliminates\nthis possibility. However, some say, while others deny, that\nmaterialism requires something more, namely, an explanation of how (or\nwhy) those physical properties can occupy the relevant functional\nroles. This too is a contentious question. (See, for further\ndiscussion, Endicott 2016 and Shaffer 2021).\n\nThere remain other substantive questions about functionalism. One is\nwhether it can provide an adequate account of all mental states. Most\ndiscussions of the prospects for functionalism focus on its adequacy\nas an account of familiar experiential states such as sensational and\nperceptual experiences, and familiar intentional states such as\nbeliefs and desires. But what about emotions – and moods?\nAlthough there is some discussion of these states in the functionalism\nliterature, (e.g. Rey 1990, Nussbaum 2003, deHooge, et al. 2011)\nthere is increasing interest in these questions, and more work needs\nto be done. In addition, there is increasing interest in determining\nwhether there can be plausible functional characterizations of\nnon-standard perceptual experiences, such as synesthesia, and various\nsorts of altered states of consciousness that can arise from the\ningestion of drugs, natural hallucinogenic substances, or focused\nmeditation. (See Gray et al. 2002, 2004, and Deroy 2017, for\ndiscussions of synesthesia. For general discussions of altered states\nof consciousness, see Velmans and Schneider (eds.) 2007, and\nThompson 2015.)\n\nAnother question is whether functional theories can accommodate\nnon-standard views about the location of mental states, such as the\nhypothesis of extended cognition, which maintains that certain mental\nstates such as memories – and not just their representational\ncontents – can reside outside the head. This question has\nimplications not only for the viability of a functionalist\ncharacterization of memory, but also of beliefs, emotions,\nhallucinations, and moods. (See Clark and Chalmers 2002, Clark, 2008,\nAdams and Aizawa 2008, Rupert 2009, Sprevack 2009, Byrne and Manzotti\n2022, and the essays in Menary 2010, for further discussion.)\n\nYet another question of increasing interest to philosophers is whether\ngroups of individuals, or entire communities, can possess mental\nstates (e.g. beliefs, desires, intentions, moods, and emotions) that\ncannot be reduced to the mental states of the individuals in those\ncommunities. (See Gilbert 2013.) Is it merely metaphorical to say\nthat a community (and not just the individuals in it) is optimistic,\nor conservative, or believes that human activities cause climate\nchange, or remembers the 60s? Or can claims like this be literally\ntrue – and if so, how; does it matter how many members of the\ncommunity in question individually possess the belief, intention, or\nemotion in question? It is easy to see, moreover, that answers to\nthese questions would have implications not only for theories of the\nnature of mental states, but also for theories of self-knowledge and\nknowledge of other minds. They would also have implications for\ntheories of moral evaluation: Desires and intentions lead to actions,\nand if a community intends to help resettle new immigrants or block\naccess to a public beach, then whom (or what) can we legitimately\npraise and blame for these actions, and to whom (or what) do we have\nmoral obligations?\n\nIn general, the sophistication of functionalist theories has increased\nsince their introduction, but so has the sophistication of the\nobjections to functionalism, especially to functionalist accounts of\nmental causation \n (section 5.2), \n introspective knowledge \n (Section 5.3),\n and the qualitative character of experiential states \n (Section 5.5).\nFor those unconvinced of the plausibility of dualism, however, and\nunwilling to restrict mental states to creatures physically like\nourselves, the initial attractions of functionalism remain. The\nprimary challenge for future functionalists, therefore, will be to\nmeet these objections to the doctrine, either by articulating a\nfunctionalist theory in increasingly convincing detail, or by showing\nhow the intuitions that fuel these objections can be explained\naway.\n",
    "section_title": "6. The Future of Functionalism",
    "entry_title": "Functionalism",
    "hierarchy_title": "Functionalism || Objections to Functionalism || .3 Functionalism and the Knowledge Argument",
    "tokenized_text": [
        "objection",
        "functionalism",
        "functionalism",
        "knowledge",
        "argument",
        "future",
        "functionalism",
        "last",
        "part",
        "th",
        "century",
        "functionalism",
        "stood",
        "dominant",
        "theory",
        "mental",
        "state",
        "like",
        "behaviorism",
        "functionalism",
        "take",
        "mental",
        "state",
        "realm",
        "private",
        "subjective",
        "give",
        "status",
        "entity",
        "open",
        "scientific",
        "investigation",
        "contrast",
        "behaviorism",
        "functionalism",
        "characterization",
        "mental",
        "state",
        "term",
        "role",
        "production",
        "behavior",
        "grant",
        "causal",
        "efficacy",
        "common",
        "sense",
        "take",
        "moreover",
        "functionalism",
        "contrast",
        "psychophysical",
        "identity",
        "thesis",
        "seems",
        "offer",
        "account",
        "mental",
        "state",
        "friendly",
        "materialism",
        "without",
        "limiting",
        "class",
        "mind",
        "creature",
        "brain",
        "like",
        "recently",
        "however",
        "resurgence",
        "interest",
        "psychophysical",
        "type",
        "identity",
        "thesis",
        "fueled",
        "part",
        "observation",
        "actual",
        "practice",
        "neuroscience",
        "neural",
        "state",
        "typeindividuated",
        "coarsely",
        "early",
        "identity",
        "theorist",
        "place",
        "feigl",
        "smart",
        "assumed",
        "contention",
        "contrary",
        "claim",
        "early",
        "defender",
        "functionalism",
        "eg",
        "putnam",
        "relatively",
        "extant",
        "creature",
        "physically",
        "unlike",
        "human",
        "share",
        "functional",
        "organization",
        "may",
        "well",
        "many",
        "genuine",
        "functional",
        "equivalent",
        "differ",
        "u",
        "finegrained",
        "neurophysiological",
        "makeup",
        "nonetheless",
        "share",
        "neural",
        "well",
        "mental",
        "state",
        "thus",
        "psychophysical",
        "identity",
        "thesis",
        "claim",
        "scope",
        "thought",
        "exclusive",
        "functionalism",
        "see",
        "bechtel",
        "bickle",
        "mccauley",
        "shapiro",
        "polger",
        "polger",
        "shapiro",
        "plausibility",
        "thesis",
        "course",
        "depends",
        "whether",
        "underlying",
        "similarity",
        "would",
        "fact",
        "coarse",
        "grained",
        "neural",
        "similarity",
        "finegrained",
        "psychofunctional",
        "similarity",
        "addition",
        "functionalist",
        "argue",
        "possible",
        "creature",
        "biological",
        "especially",
        "nonbiological",
        "functionally",
        "equivalent",
        "u",
        "posse",
        "even",
        "coarsegrained",
        "neural",
        "property",
        "creature",
        "plausibly",
        "regarded",
        "sharing",
        "mental",
        "state",
        "sure",
        "controversial",
        "thesis",
        "even",
        "neural",
        "state",
        "individuated",
        "coarsely",
        "variety",
        "functionalism",
        "retain",
        "claim",
        "greater",
        "universality",
        "identity",
        "thesis",
        "another",
        "source",
        "skepticism",
        "relative",
        "universality",
        "functionalist",
        "versus",
        "typeidentity",
        "theory",
        "derives",
        "suggestion",
        "least",
        "human",
        "property",
        "could",
        "play",
        "relevant",
        "role",
        "functional",
        "architecture",
        "exclusively",
        "electrical",
        "impulse",
        "neuron",
        "combination",
        "impulse",
        "plus",
        "feature",
        "brain",
        "body",
        "including",
        "endocrine",
        "system",
        "see",
        "cao",
        "damasio",
        "may",
        "fewer",
        "extant",
        "example",
        "creature",
        "functional",
        "physical",
        "duplicate",
        "human",
        "may",
        "le",
        "likely",
        "creature",
        "even",
        "nomologically",
        "possible",
        "may",
        "course",
        "metaphysically",
        "possible",
        "existing",
        "fairly",
        "distant",
        "possible",
        "world",
        "debate",
        "whether",
        "plausible",
        "whether",
        "would",
        "seriously",
        "undermine",
        "psychophysical",
        "identity",
        "theory",
        "hand",
        "critic",
        "psychophysical",
        "identity",
        "theory",
        "contend",
        "theory",
        "characterizes",
        "mental",
        "state",
        "higherorder",
        "property",
        "causal",
        "power",
        "possessed",
        "state",
        "property",
        "realize",
        "preserve",
        "explanatory",
        "hierarchy",
        "modeled",
        "relation",
        "biology",
        "chemistry",
        "chemistry",
        "physic",
        "identification",
        "mental",
        "state",
        "functional",
        "role",
        "would",
        "trick",
        "whether",
        "mental",
        "state",
        "fact",
        "multiply",
        "realized",
        "see",
        "gillett",
        "aizawa",
        "gillett",
        "essay",
        "dejoong",
        "shouten",
        "discussion",
        "see",
        "also",
        "entry",
        "multiple",
        "realizability",
        "question",
        "remain",
        "subject",
        "active",
        "debate",
        "yet",
        "another",
        "question",
        "whether",
        "role",
        "functionalism",
        "friendly",
        "materialism",
        "initial",
        "advocate",
        "suggested",
        "even",
        "functional",
        "role",
        "identified",
        "mental",
        "state",
        "realized",
        "exclusively",
        "physical",
        "state",
        "generally",
        "agreed",
        "mere",
        "supervenience",
        "mental",
        "physical",
        "impossibility",
        "mental",
        "difference",
        "without",
        "physical",
        "difference",
        "leaf",
        "open",
        "possibility",
        "mental",
        "property",
        "emergent",
        "property",
        "additional",
        "causal",
        "power",
        "whereas",
        "realization",
        "mental",
        "state",
        "physical",
        "state",
        "eliminates",
        "possibility",
        "however",
        "say",
        "others",
        "deny",
        "materialism",
        "requires",
        "something",
        "namely",
        "explanation",
        "physical",
        "property",
        "occupy",
        "relevant",
        "functional",
        "role",
        "contentious",
        "question",
        "see",
        "discussion",
        "endicott",
        "shaffer",
        "remain",
        "substantive",
        "question",
        "functionalism",
        "one",
        "whether",
        "provide",
        "adequate",
        "account",
        "mental",
        "state",
        "discussion",
        "prospect",
        "functionalism",
        "focus",
        "adequacy",
        "account",
        "familiar",
        "experiential",
        "state",
        "sensational",
        "perceptual",
        "experience",
        "familiar",
        "intentional",
        "state",
        "belief",
        "desire",
        "emotion",
        "mood",
        "although",
        "discussion",
        "state",
        "functionalism",
        "literature",
        "eg",
        "rey",
        "nussbaum",
        "dehooge",
        "et",
        "al",
        "increasing",
        "interest",
        "question",
        "work",
        "need",
        "done",
        "addition",
        "increasing",
        "interest",
        "determining",
        "whether",
        "plausible",
        "functional",
        "characterization",
        "nonstandard",
        "perceptual",
        "experience",
        "synesthesia",
        "various",
        "sort",
        "altered",
        "state",
        "consciousness",
        "arise",
        "ingestion",
        "drug",
        "natural",
        "hallucinogenic",
        "substance",
        "focused",
        "meditation",
        "see",
        "gray",
        "et",
        "al",
        "deroy",
        "discussion",
        "synesthesia",
        "general",
        "discussion",
        "altered",
        "state",
        "consciousness",
        "see",
        "velmans",
        "schneider",
        "ed",
        "thompson",
        "another",
        "question",
        "whether",
        "functional",
        "theory",
        "accommodate",
        "nonstandard",
        "view",
        "location",
        "mental",
        "state",
        "hypothesis",
        "extended",
        "cognition",
        "maintains",
        "certain",
        "mental",
        "state",
        "memory",
        "representational",
        "content",
        "reside",
        "outside",
        "head",
        "question",
        "implication",
        "viability",
        "functionalist",
        "characterization",
        "memory",
        "also",
        "belief",
        "emotion",
        "hallucination",
        "mood",
        "see",
        "clark",
        "chalmers",
        "clark",
        "adam",
        "aizawa",
        "rupert",
        "sprevack",
        "byrne",
        "manzotti",
        "essay",
        "menary",
        "discussion",
        "yet",
        "another",
        "question",
        "increasing",
        "interest",
        "philosopher",
        "whether",
        "group",
        "individual",
        "entire",
        "community",
        "posse",
        "mental",
        "state",
        "eg",
        "belief",
        "desire",
        "intention",
        "mood",
        "emotion",
        "reduced",
        "mental",
        "state",
        "individual",
        "community",
        "see",
        "gilbert",
        "merely",
        "metaphorical",
        "say",
        "community",
        "individual",
        "optimistic",
        "conservative",
        "belief",
        "human",
        "activity",
        "cause",
        "climate",
        "change",
        "remembers",
        "claim",
        "like",
        "literally",
        "true",
        "matter",
        "many",
        "member",
        "community",
        "question",
        "individually",
        "posse",
        "belief",
        "intention",
        "emotion",
        "question",
        "easy",
        "see",
        "moreover",
        "answer",
        "question",
        "would",
        "implication",
        "theory",
        "nature",
        "mental",
        "state",
        "also",
        "theory",
        "selfknowledge",
        "knowledge",
        "mind",
        "would",
        "also",
        "implication",
        "theory",
        "moral",
        "evaluation",
        "desire",
        "intention",
        "lead",
        "action",
        "community",
        "intends",
        "help",
        "resettle",
        "new",
        "immigrant",
        "block",
        "access",
        "public",
        "beach",
        "legitimately",
        "praise",
        "blame",
        "action",
        "moral",
        "obligation",
        "general",
        "sophistication",
        "functionalist",
        "theory",
        "increased",
        "since",
        "introduction",
        "sophistication",
        "objection",
        "functionalism",
        "especially",
        "functionalist",
        "account",
        "mental",
        "causation",
        "section",
        "introspective",
        "knowledge",
        "section",
        "qualitative",
        "character",
        "experiential",
        "state",
        "section",
        "unconvinced",
        "plausibility",
        "dualism",
        "however",
        "unwilling",
        "restrict",
        "mental",
        "state",
        "creature",
        "physically",
        "like",
        "initial",
        "attraction",
        "functionalism",
        "remain",
        "primary",
        "challenge",
        "future",
        "functionalist",
        "therefore",
        "meet",
        "objection",
        "doctrine",
        "either",
        "articulating",
        "functionalist",
        "theory",
        "increasingly",
        "convincing",
        "detail",
        "showing",
        "intuition",
        "fuel",
        "objection",
        "explained",
        "away"
    ]
}