{
    "main_text": "Varieties of Fundamentality || Complete Minimal Basis\n1.3 Complete Minimal Basis\n\nThe conception of fundamentality to be considered in this section is\noften used to explicate the second key task for the notion of\nfundamentality, that of the fundamental entities acting as the basic\nbuilding blocks of reality. According to this approach, the\nfundamental entities determine everything else. By giving a complete\nlist of the fundamental entities, we can provide a minimal complete\ndescription of reality. So, we are now shifting our focus from that\nwhich everything else depends on to that which, as it were, supports\neverything else. This idea is often invoked to characterize\nfundamentality, but not necessarily to define it (Schaffer 2010a:\n39n14; Sider 2011: 16–18; Jenkins 2013: 212; A. Paul 2012: 221;\nTahko 2014: 263; Wilson 2014: 561; Raven 2016: 609; Bennett 2017:\n107ff.). The idea is that fundamentality can be understood in terms of\na complete minimal basis:\n\n(CMB) x is\nfundamental if and only if x belongs to a plurality of\nentities X and X forms a minimal complete basis that\ndetermines everything else. The complete basis is minimal if no proper\nsub-plurality of the entities belonging to X is\ncomplete.\n\n\nThe obvious notion to be clarified in (CMB) is\n“determines”. This should be understood as a placeholder,\nwhich is meant to encompass the various ways in which fundamentalia\nmay give rise to higher-level phenomena. So, “determines”\ncould be replaced, e.g., by “grounds”,\n“realizes”, “composes”, or\n “builds”.[13]\n Importantly, this type of determination is supposed to be more than\nmere necessitation or supervenience, although the idea is closely\nrelated to traditional discussions of a minimal supervenience base\n(see Schaffer 2003; compare also with Schaffer’s notion of\n“generation” in Schaffer 2016b:\n 54).[14]\n\nThere are some preliminary issues to be specified before we can move\non to a more general discussion about\n (CMB).\n\n(CMB) is compatible both with monism and the idea that reality may\nhave an irreducibly plural underpinning whereby if X\nforms a complete minimal basis, no proper sub-plurality of X\nwill be\n complete.[15]\nWe have included a minimality condition in the definition\nof (CMB). This is an important addition, because otherwise we could\ntake the plurality of all the entities in the world and call it\ncomplete, given that this plurality as well would include all the\nfundamental entities. So, according to (CMB), the complete minimal\nbasis must include all and only the fundamental entities.\nThere is an open question concerning uniqueness. Could\nthere be several distinct pluralities that are minimal and complete?\nIn other words, could there be distinct minimal pluralities that are\neach complete and hence capable of determining everything else?\nBennett (2017: 112ff.) leaves the possibility of distinct minimal\ncomplete pluralities open but makes some use of the notion of a\nunique minimally complete plurality, whereas Tahko (2018)\nspeculates about the possibility of several “ontologically\nminimal descriptions”, dropping the requirement of\n uniqueness.[16]\nIt is, in principle, possible to define relativized versions of\n(CMB), just as we did in\n section 1.2\n with\n (RI).\n So, one could distinguish between absolute completeness and\nrestricted completeness. It is easy to see how the restricted\nnotion of completeness is supposed to work. For instance, the\nmereologically minimal complete basis is the minimal complete\nplurality of mereological elements that determine everything\nmereological. This could leave out something determined, say, by a\npotential non-mereological notion of composition or parthood,\nsuch as Armstrong’s notion of states of affairs (see Armstrong\n1997: 118–127). However, taking this route does not only invite\nthe challenges observed with regard to (RI), but may also diminish the\npotential initial attractiveness of (CMB) (Bennett 2017: 110). So, we\nwill set aside the relativized sense of (CMB).\n\n\nWe can now move on to some further\n issues.[17]\n One of these issues concerns how, exactly, we should interpret\n (CMB).\n We can find a common line of interpretation gestured at by Schaffer\n(2003: 509), Jenkins (2013: 212), Raven (2016: 609), and Tahko (2018)\nwhereby the complete minimal basis should be understood as giving a\ncomplete minimal description of reality. This may be compared to\nSchaffer’s “fundamental supervenience base”,\nJenkins’s “by appeal to which all the rest can be\nexplained”, Raven’s “ineliminability”, and\nTahko’s “ontological minimality”; see also Lewis\n(1986: 60). On this reading, less emphasis is put on the active role\nof the fundamentalia, the focus being instead on making sure to\ninclude a basis for everything in reality.\n\nTo have the broadest possible appeal, a characterisation of\nfundamentality should ideally be applicable in different scenarios\nregarding what the world is like. One such scenario is a “flat\nworld”, a world where everything is independent, either in the\nsense of\n (AI)\n or (RI), and nothing is built, to use Bennett’s notion (Bennett\n2017: 123–124). In a flat world, nothing determines anything\nelse in the sense of (CMB), since nothing depends on anything else.\nInitially, it may seem that (CMB) is not plausible in this type of\nscenario, since everything is included in the unique minimally\ncomplete plurality. However, as noted in the previous paragraph, the\ndefinition of (CMB) does not require any “active”\ncontribution from the fundamentalia; it’s not crucial that the\nfundamentalia do any determining. So, the upshot is that, in flat\nworld, everything is fundamental both in the sense of (AI) or (RI) as\nwell as in the sense of (CMB).\n\nAccordingly, it would be an additional commitment to\n (CMB)\n to require that the fundamentalia must “actively”\ndetermine something in order to count among the fundamentalia, call it\n(CMB+). So, while (CMB) is vacuously true in a flat world, the\nproponent of this more “active” version, (CMB+), requires\nsomething more. Driven by the flat world example, one might then think\nthat\n (AI)\n and\n (RI)\n are prior to (CMB+). According to (CMB+), a flat world—rather\nthan being a world where everything is fundamental—would be a\nworld where nothing is fundamental (or derivative), since nothing is\n“actively” determining anything. A world which contains no\nsuch structure would then turn out to be a world which contains no\npriority, hence no fundamentality (cf. Wilson 2016: 199).\n\nAnother difference between\n (CMB)\n and\n (RI)\n concerns the possibility of metaphysical coherentism, where\nloops of dependence are possible (see Bliss 2014, 2018; Barnes 2018;\nMorganti 2018, 2019; Nolan 2018; Thompson 2018; Swiderski\nforthcoming). (CMB) can accommodate the possibility of metaphysical\ncoherentism, but (RI) would seem incompatible with it. The primary\nreason for this is that metaphysical coherentism, as it is usually\nunderstood, violates asymmetry and hence drops the idea that the\nstructure of reality is hierarchical. While this requires abandoning\none of the key tasks that the notion of fundamentality is often\nthought to have, it does help in accommodating the idea that we should\nadopt a more holistic approach whereby entities can be mutually\nrelated and form loops or cycles. Sometimes an analogy from\nepistemology is offered, as these loops of dependence could resemble a\nQuinean web of belief, so that each entity depends on one or\nmore other entities. Perhaps the most plausible example of the\npossibility of loops of dependence comes from\n ontic structural realism\n (OSR). (OSR) suggests that objects may be reduced to—or more\nmoderately, are ontologically on a par rather than prior\nto—relational structures. If (OSR) is true, we might have to\nrevise our views about what the fundamentalia could be, as they might\nbe relations rather than objects (for discussion on OSR and\nfundamentality, see Wolff 2012; McKenzie 2014; Morganti 2018, 2019;\nTahko 2018). What exactly happens to (CMB) on this type of view\ndepends on the details of the coherentist framework, but one\npossibility—on a moderate understanding of (OSR)—is that\nthe fundamentalia would include mutually dependent relations and\nobjects, which then determine everything else. Metaphysical\ncoherentism is beginning to receive increasing attention. For\ninstance, Calosi and Morganti (2021) have recently put forward a\ncoherentist account of quantum entanglement, and Swiderski\n(forthcoming) has made an important effort to systematize the\nliterature by defining four different conceptions of coherentism,\nnamely (we refer the reader to the original paper for illustrative\ndiagrams):\n\nHolism: For any x and any y, x\n(partially) grounds y and y (partially) grounds\nx (ibid., p. 5).\nInsularism: For any x, there is some y\nsuch that y grounds x (and x ≠\ny ) and some z such that x does not ground\nz (and x ≠ z ). In addition, all\ngrounding relations are regarded as symmetric (ibid., p. 10). This\nview suggests that there are more than one networks of symmetric or\ncoherent grounding, where no grounding between these different insular\nclasses of facts takes place, but we have maximal coherence within\neach class.\nHierarchism: For any x, there are some\ny’s such that each of the y’s grounds\nx and x grounds each of the y’s, and\neither (i) there are some z’s (distinct from the\ny’s) such that each of the z’s grounds\nall the other z’s, and the z’s ground\nthe y’s, or (ii) there are some w’s\n(distinct from the y’s) such that each of the\nw’s grounds all the other w’s, and the\ny’s ground the w’s (ibid., p. 17). This\nview suggests that there is a hierarchy of facts that mutually ground\neach other which form a level, and any level has got either\n(i) a level below it or (ii) a level above it. (Swiderski also\nspecifies two further varieties of hierachism depending on\nwhether one wishes to include or rule out infinite descent.)\nRebarism: For any x, the following\nexclusive disjunction is true: either (i) there are\nsome y’s such that each of the y’s\ngrounds x and x grounds each of the\ny’s, or (ii) there are some z’s such\nthat each of the z’s grounds all the other\nz’s, and the z’s ground x\n(ibid., p. 21). This view suggests that only the fundamental level\ninvolves symmetric or coherent grounding, while everything else (on\nhigher levels) stands in asymmetric grounding relations, generating\nthe familiar hierarchical picture of reality.\n\n\nWhile Swiderski does not explicitly defend any of these versions of\ncoherentism, his discussion does point out some crucial decision\npoints. Most importantly, Swiderski demonstrates that while holism and\ninsularism are not compatible with asymmetric grounding, hiearchism\nand rebarism do allow for (limited cases of) asymmetric grounding.\nHowever, all four views retain a commitment to what Swiderski (ibid.,\np. 4) calls the Coherentist Canon: “(i) For any\nx, there is some y such that y grounds\nx, and (ii) there is some z and some w such\nthat z (perhaps indirectly) grounds w and vice\nversa”. This also suggests a commitment to the idea of mutual\ngrounding (cf. Giannotti 2021a), which was briefly discussed in\n section 1.1.\n\nFinally, a specific form of metaphysical infinitism, where the same\nstructure repeats infinitely, to be discussed in more detail in\n section 4,\n could motivate\n (CMB)\n (Bliss 2013; Tahko 2014; Morganti 2014, 2018). On this type of view,\nit could turn out that nothing is independent in the sense of\n (RI),\n but a sense of completeness could nevertheless be retained.\n",
    "section_title": "1.3 Complete Minimal Basis",
    "entry_title": "Fundamentality",
    "hierarchy_title": "Fundamentality || Varieties of Fundamentality || Complete Minimal Basis",
    "tokenized_text": [
        "variety",
        "fundamentality",
        "complete",
        "minimal",
        "basis",
        "complete",
        "minimal",
        "basis",
        "conception",
        "fundamentality",
        "considered",
        "section",
        "often",
        "used",
        "explicate",
        "second",
        "key",
        "task",
        "notion",
        "fundamentality",
        "fundamental",
        "entity",
        "acting",
        "basic",
        "building",
        "block",
        "reality",
        "according",
        "approach",
        "fundamental",
        "entity",
        "determine",
        "everything",
        "else",
        "giving",
        "complete",
        "list",
        "fundamental",
        "entity",
        "provide",
        "minimal",
        "complete",
        "description",
        "reality",
        "shifting",
        "focus",
        "everything",
        "else",
        "depends",
        "support",
        "everything",
        "else",
        "idea",
        "often",
        "invoked",
        "characterize",
        "fundamentality",
        "necessarily",
        "define",
        "schaffer",
        "a",
        "n",
        "sider",
        "jenkins",
        "a",
        "paul",
        "tahko",
        "wilson",
        "raven",
        "bennett",
        "ff",
        "idea",
        "fundamentality",
        "understood",
        "term",
        "complete",
        "minimal",
        "basis",
        "cmb",
        "x",
        "fundamental",
        "x",
        "belongs",
        "plurality",
        "entity",
        "x",
        "x",
        "form",
        "minimal",
        "complete",
        "basis",
        "determines",
        "everything",
        "else",
        "complete",
        "basis",
        "minimal",
        "proper",
        "subplurality",
        "entity",
        "belonging",
        "x",
        "complete",
        "obvious",
        "notion",
        "clarified",
        "cmb",
        "determines",
        "understood",
        "placeholder",
        "meant",
        "encompass",
        "various",
        "way",
        "fundamentalia",
        "may",
        "give",
        "rise",
        "higherlevel",
        "phenomenon",
        "determines",
        "could",
        "replaced",
        "eg",
        "ground",
        "realizes",
        "composes",
        "build",
        "importantly",
        "type",
        "determination",
        "supposed",
        "mere",
        "necessitation",
        "supervenience",
        "although",
        "idea",
        "closely",
        "related",
        "traditional",
        "discussion",
        "minimal",
        "supervenience",
        "base",
        "see",
        "schaffer",
        "compare",
        "also",
        "schaffer",
        "notion",
        "generation",
        "schaffer",
        "b",
        "preliminary",
        "issue",
        "specified",
        "move",
        "general",
        "discussion",
        "cmb",
        "cmb",
        "compatible",
        "monism",
        "idea",
        "reality",
        "may",
        "irreducibly",
        "plural",
        "underpinning",
        "whereby",
        "x",
        "form",
        "complete",
        "minimal",
        "basis",
        "proper",
        "subplurality",
        "x",
        "complete",
        "included",
        "minimality",
        "condition",
        "definition",
        "cmb",
        "important",
        "addition",
        "otherwise",
        "could",
        "take",
        "plurality",
        "entity",
        "world",
        "call",
        "complete",
        "given",
        "plurality",
        "well",
        "would",
        "include",
        "fundamental",
        "entity",
        "according",
        "cmb",
        "complete",
        "minimal",
        "basis",
        "must",
        "include",
        "fundamental",
        "entity",
        "open",
        "question",
        "concerning",
        "uniqueness",
        "could",
        "several",
        "distinct",
        "plurality",
        "minimal",
        "complete",
        "word",
        "could",
        "distinct",
        "minimal",
        "plurality",
        "complete",
        "hence",
        "capable",
        "determining",
        "everything",
        "else",
        "bennett",
        "ff",
        "leaf",
        "possibility",
        "distinct",
        "minimal",
        "complete",
        "plurality",
        "open",
        "make",
        "use",
        "notion",
        "unique",
        "minimally",
        "complete",
        "plurality",
        "whereas",
        "tahko",
        "speculates",
        "possibility",
        "several",
        "ontologically",
        "minimal",
        "description",
        "dropping",
        "requirement",
        "uniqueness",
        "principle",
        "possible",
        "define",
        "relativized",
        "version",
        "cmb",
        "section",
        "ri",
        "one",
        "could",
        "distinguish",
        "absolute",
        "completeness",
        "restricted",
        "completeness",
        "easy",
        "see",
        "restricted",
        "notion",
        "completeness",
        "supposed",
        "work",
        "instance",
        "mereologically",
        "minimal",
        "complete",
        "basis",
        "minimal",
        "complete",
        "plurality",
        "mereological",
        "element",
        "determine",
        "everything",
        "mereological",
        "could",
        "leave",
        "something",
        "determined",
        "say",
        "potential",
        "nonmereological",
        "notion",
        "composition",
        "parthood",
        "armstrong",
        "notion",
        "state",
        "affair",
        "see",
        "armstrong",
        "however",
        "taking",
        "route",
        "invite",
        "challenge",
        "observed",
        "regard",
        "ri",
        "may",
        "also",
        "diminish",
        "potential",
        "initial",
        "attractiveness",
        "cmb",
        "bennett",
        "set",
        "aside",
        "relativized",
        "sense",
        "cmb",
        "move",
        "issue",
        "one",
        "issue",
        "concern",
        "exactly",
        "interpret",
        "cmb",
        "find",
        "common",
        "line",
        "interpretation",
        "gestured",
        "schaffer",
        "jenkins",
        "raven",
        "tahko",
        "whereby",
        "complete",
        "minimal",
        "basis",
        "understood",
        "giving",
        "complete",
        "minimal",
        "description",
        "reality",
        "may",
        "compared",
        "schaffer",
        "fundamental",
        "supervenience",
        "base",
        "jenkins",
        "appeal",
        "rest",
        "explained",
        "raven",
        "ineliminability",
        "tahko",
        "ontological",
        "minimality",
        "see",
        "also",
        "lewis",
        "reading",
        "le",
        "emphasis",
        "put",
        "active",
        "role",
        "fundamentalia",
        "focus",
        "instead",
        "making",
        "sure",
        "include",
        "basis",
        "everything",
        "reality",
        "broadest",
        "possible",
        "appeal",
        "characterisation",
        "fundamentality",
        "ideally",
        "applicable",
        "different",
        "scenario",
        "regarding",
        "world",
        "like",
        "one",
        "scenario",
        "flat",
        "world",
        "world",
        "everything",
        "independent",
        "either",
        "sense",
        "ai",
        "ri",
        "nothing",
        "built",
        "use",
        "bennett",
        "notion",
        "bennett",
        "flat",
        "world",
        "nothing",
        "determines",
        "anything",
        "else",
        "sense",
        "cmb",
        "since",
        "nothing",
        "depends",
        "anything",
        "else",
        "initially",
        "may",
        "seem",
        "cmb",
        "plausible",
        "type",
        "scenario",
        "since",
        "everything",
        "included",
        "unique",
        "minimally",
        "complete",
        "plurality",
        "however",
        "noted",
        "previous",
        "paragraph",
        "definition",
        "cmb",
        "require",
        "active",
        "contribution",
        "fundamentalia",
        "crucial",
        "fundamentalia",
        "determining",
        "upshot",
        "flat",
        "world",
        "everything",
        "fundamental",
        "sense",
        "ai",
        "ri",
        "well",
        "sense",
        "cmb",
        "accordingly",
        "would",
        "additional",
        "commitment",
        "cmb",
        "require",
        "fundamentalia",
        "must",
        "actively",
        "determine",
        "something",
        "order",
        "count",
        "among",
        "fundamentalia",
        "call",
        "cmb",
        "cmb",
        "vacuously",
        "true",
        "flat",
        "world",
        "proponent",
        "active",
        "version",
        "cmb",
        "requires",
        "something",
        "driven",
        "flat",
        "world",
        "example",
        "one",
        "might",
        "think",
        "ai",
        "ri",
        "prior",
        "cmb",
        "according",
        "cmb",
        "flat",
        "worldrather",
        "world",
        "everything",
        "fundamentalwould",
        "world",
        "nothing",
        "fundamental",
        "derivative",
        "since",
        "nothing",
        "actively",
        "determining",
        "anything",
        "world",
        "contains",
        "structure",
        "would",
        "turn",
        "world",
        "contains",
        "priority",
        "hence",
        "fundamentality",
        "cf",
        "wilson",
        "another",
        "difference",
        "cmb",
        "ri",
        "concern",
        "possibility",
        "metaphysical",
        "coherentism",
        "loop",
        "dependence",
        "possible",
        "see",
        "bliss",
        "barnes",
        "morganti",
        "nolan",
        "thompson",
        "swiderski",
        "forthcoming",
        "cmb",
        "accommodate",
        "possibility",
        "metaphysical",
        "coherentism",
        "ri",
        "would",
        "seem",
        "incompatible",
        "primary",
        "reason",
        "metaphysical",
        "coherentism",
        "usually",
        "understood",
        "violates",
        "asymmetry",
        "hence",
        "drop",
        "idea",
        "structure",
        "reality",
        "hierarchical",
        "requires",
        "abandoning",
        "one",
        "key",
        "task",
        "notion",
        "fundamentality",
        "often",
        "thought",
        "help",
        "accommodating",
        "idea",
        "adopt",
        "holistic",
        "approach",
        "whereby",
        "entity",
        "mutually",
        "related",
        "form",
        "loop",
        "cycle",
        "sometimes",
        "analogy",
        "epistemology",
        "offered",
        "loop",
        "dependence",
        "could",
        "resemble",
        "quinean",
        "web",
        "belief",
        "entity",
        "depends",
        "one",
        "entity",
        "perhaps",
        "plausible",
        "example",
        "possibility",
        "loop",
        "dependence",
        "come",
        "ontic",
        "structural",
        "realism",
        "osr",
        "osr",
        "suggests",
        "object",
        "may",
        "reduced",
        "toor",
        "moderately",
        "ontologically",
        "par",
        "rather",
        "prior",
        "torelational",
        "structure",
        "osr",
        "true",
        "might",
        "revise",
        "view",
        "fundamentalia",
        "could",
        "might",
        "relation",
        "rather",
        "object",
        "discussion",
        "osr",
        "fundamentality",
        "see",
        "wolff",
        "mckenzie",
        "morganti",
        "tahko",
        "exactly",
        "happens",
        "cmb",
        "type",
        "view",
        "depends",
        "detail",
        "coherentist",
        "framework",
        "one",
        "possibilityon",
        "moderate",
        "understanding",
        "osr",
        "is",
        "fundamentalia",
        "would",
        "include",
        "mutually",
        "dependent",
        "relation",
        "object",
        "determine",
        "everything",
        "else",
        "metaphysical",
        "coherentism",
        "beginning",
        "receive",
        "increasing",
        "attention",
        "instance",
        "calosi",
        "morganti",
        "recently",
        "put",
        "forward",
        "coherentist",
        "account",
        "quantum",
        "entanglement",
        "swiderski",
        "forthcoming",
        "made",
        "important",
        "effort",
        "systematize",
        "literature",
        "defining",
        "four",
        "different",
        "conception",
        "coherentism",
        "namely",
        "refer",
        "reader",
        "original",
        "paper",
        "illustrative",
        "diagram",
        "holism",
        "x",
        "x",
        "partially",
        "ground",
        "partially",
        "ground",
        "x",
        "ibid",
        "p",
        "insularism",
        "x",
        "ground",
        "x",
        "x",
        "z",
        "x",
        "ground",
        "z",
        "x",
        "z",
        "addition",
        "grounding",
        "relation",
        "regarded",
        "symmetric",
        "ibid",
        "p",
        "view",
        "suggests",
        "one",
        "network",
        "symmetric",
        "coherent",
        "grounding",
        "grounding",
        "different",
        "insular",
        "class",
        "fact",
        "take",
        "place",
        "maximal",
        "coherence",
        "within",
        "class",
        "hierarchism",
        "x",
        "ground",
        "x",
        "x",
        "ground",
        "either",
        "z",
        "distinct",
        "z",
        "ground",
        "z",
        "z",
        "ground",
        "ii",
        "w",
        "distinct",
        "w",
        "ground",
        "w",
        "ground",
        "w",
        "ibid",
        "p",
        "view",
        "suggests",
        "hierarchy",
        "fact",
        "mutually",
        "ground",
        "form",
        "level",
        "level",
        "got",
        "either",
        "level",
        "ii",
        "level",
        "swiderski",
        "also",
        "specifies",
        "two",
        "variety",
        "hierachism",
        "depending",
        "whether",
        "one",
        "wish",
        "include",
        "rule",
        "infinite",
        "descent",
        "rebarism",
        "x",
        "following",
        "exclusive",
        "disjunction",
        "true",
        "either",
        "ground",
        "x",
        "x",
        "ground",
        "ii",
        "z",
        "z",
        "ground",
        "z",
        "z",
        "ground",
        "x",
        "ibid",
        "p",
        "view",
        "suggests",
        "fundamental",
        "level",
        "involves",
        "symmetric",
        "coherent",
        "grounding",
        "everything",
        "else",
        "higher",
        "level",
        "stand",
        "asymmetric",
        "grounding",
        "relation",
        "generating",
        "familiar",
        "hierarchical",
        "picture",
        "reality",
        "swiderski",
        "explicitly",
        "defend",
        "version",
        "coherentism",
        "discussion",
        "point",
        "crucial",
        "decision",
        "point",
        "importantly",
        "swiderski",
        "demonstrates",
        "holism",
        "insularism",
        "compatible",
        "asymmetric",
        "grounding",
        "hiearchism",
        "rebarism",
        "allow",
        "limited",
        "case",
        "asymmetric",
        "grounding",
        "however",
        "four",
        "view",
        "retain",
        "commitment",
        "swiderski",
        "ibid",
        "p",
        "call",
        "coherentist",
        "canon",
        "x",
        "ground",
        "x",
        "ii",
        "z",
        "w",
        "z",
        "perhaps",
        "indirectly",
        "ground",
        "w",
        "vice",
        "versa",
        "also",
        "suggests",
        "commitment",
        "idea",
        "mutual",
        "grounding",
        "cf",
        "giannotti",
        "a",
        "briefly",
        "discussed",
        "section",
        "finally",
        "specific",
        "form",
        "metaphysical",
        "infinitism",
        "structure",
        "repeat",
        "infinitely",
        "discussed",
        "detail",
        "section",
        "could",
        "motivate",
        "cmb",
        "bliss",
        "tahko",
        "morganti",
        "type",
        "view",
        "could",
        "turn",
        "nothing",
        "independent",
        "sense",
        "ri",
        "sense",
        "completeness",
        "could",
        "nevertheless",
        "retained"
    ]
}