{
    "main_text": "Varieties of Fundamentality || Restricted Independence\n1.2 Restricted Independence\n\nThe second definition of fundamentality to be considered is much more\nversatile and weaker than\n (AI).\n We call it restricted independence. This produces a\nrelativized sense of fundamentality, where fundamentality is\nrelative to a certain variety or varieties of metaphysical dependence.\nOne should not confuse this with relative fundamentality,\nwhich concerns the priority ordering between two (non-fundamental)\nentities. So, restricted independence starts from the idea that for\neach metaphysical dependence relation there is a corresponding notion\nof fundamentality and we must relativize the notion of fundamentality\naccordingly:\n\n(RI) x is\nrestrictedly independent if and only if there is one or more\nmetaphysical dependence relation(s) \\(D_{1}\\), \\(D_{2}\\) …\n\\(D_{N}\\) such that there is no y such that \\(D_{1xy}\\) or\n\\(D_{2xy}\\) or … or \\(D_{Nxy}\\).\n\n\n(RI) is restricted to concern one or more specific kinds of\nmetaphysical dependence, because it is plausible that some\nmetaphysical dependence relations, such as modal dependence (as we saw\nin\n section 1.1),\n would immediately rule out fundamental entities. Notice that (RI)\nallows the possibility of including several dependence relations, but\nwe can easily define a more restricted sense of dependence for each of\n\\(D_{1}\\), \\(D_{2}\\) … \\(D_{N}\\).\n\nWe have already discussed some kinds of metaphysical dependence that\n (RI)\n could apply to, such as grounding and mereological dependence. (RI)\nconcerns the subset of those metaphysical dependence relations that\nare considered relevant to fundamentality, so here two philosophers\ncould disagree about which dependence relations to include in that\nsubset. Variations of this conception of fundamentality can be found\nthroughout the literature and it is probably as close to a standard\nconception as we are likely to find (a few examples: Schaffer 2009:\n373; Dixon 2016: 442; Bennett 2017: 105; see also Tahko 2015: Ch. 6;\nBliss & Priest 2018b). There are, of course, many differences\nbetween the various accounts. Variations of (RI) are standard enough\nto have been picked up by most of those critical towards this\nconception of fundamentality as well (Bliss 2013: 413; Morganti 2015:\n559; Raven 2016:\n 608).[7]\n\nBoth\n (AI)\n and\n (RI)\n could be understood as putting forward the idea that fundamental\nreality needs a relational underpinning (on the notion of a\nrelational underpinning, compare Fine 2001: 25). In other words,\nwhatever fundamentality amounts to, it must be the case that one (or\nseveral) of the various relations of metaphysical dependence may be\nused to define fundamentality. But since (RI) leaves completely open\nwhich of the metaphysical dependence relations are in fact relevant to\nfundamentality, we should mention some examples. At one point in the\nearly 2000s, it may have been the case that most philosophers using\nthe notion of fundamentality had in mind what we might call\nmereological fundamentality whereby the relevant kind of\ndependence is mereological dependence (see especially Schaffer 2003).\nA concise definition of mereological dependence is offered by Kim:\n\n\nthe properties of a whole, or the fact that a whole instantiates a\ncertain property, may depend on the properties and relations had by\nits parts. (2010: 183; see also Markosian 2005; Thalos 2010, 2013)\n\n\nHowever, even though mereological dependence is still sometimes\nconsidered to be relevant to fundamentality, it is becoming less\ncommon to view it as the only relevant kind of dependence\n(Wilsch 2016; Bennett 2017: 8–9). Be that as it may, there is\ncertainly an esteemed history for this type of idea, given that\n(mereological) atomism of the type defended already by ancient\nphilosophers such as Leucippus and Democritus would appear to be an\ninstance of the view (see the separate entry on\n ancient atomism\n for details, and compare with Schnieder 2020a, where Bolzano’s\nversion of atomism is discussed).\n\nIt is important to see that the thesis that some things are\nmereologically fundamental does not entail a commitment to atomism.\nHere it may be helpful to introduce the distinction between (priority)\npluralism and monism. We have already seen that a\nmonist might be attracted to a view about fundamentality where there\nis just one fundamental entity, such as the cosmos or universe as a\nwhole (Schaffer 2010a is a good exposition and defense of this\nSpinoza-inspired view; see also Newlands 2010). This view does not\ndirectly entail anything about the relative fundamentality relations\namong the non-fundamental, but it enables us to better understand that\nthe converse of mereological dependence, as Kim defines it, might\nhold: instead of wholes depending on their parts, the parts could\ndepend on the whole. This contrasts with the more familiar idea, often\nassociated with but not entailed by atomism, that mereological\ndependence must run from the larger to the smaller, mereological atoms\nbeing the fundamental entities. So, the choice concerning the\ndirection of the relevant dependence relation is often reflected by\nthe choice between priority pluralism and monism, although strictly\nspeaking these issues are independent (Miller 2009; Trogdon 2009;\nCotnoir 2013; Steinberg 2015; Tallant 2015). Two proponents of\n (RI),\n even if they agree on which proper subset of metaphysical dependence\nrelations is relevant to fundamentality, may disagree on the direction\nof the relevant dependence\n relation(s).[8]\n\nMoving on to a different subspecies of\n (RI),\n we see a clear link between grounding and fundamentality, where\ngrounding is understood as expressing a non-causal connection between\ntwo things. For example, a certain act might be considered evil\nbecause it causes harm. The “because” in this statement\ndoes not express a causal link; instead, it tells us what\ngrounds the evilness of the act. Similarly, one might think\nthat mental states hold in virtue of neurophysiological states or that\na substance is prior to its tropes. The notions of “in virtue\nof” and “prior to” in these cases may be understood\nin terms of grounding. What is likely to be the most common\ncontemporary understanding of (RI) is that the most important (if not\nthe only) relation of metaphysical dependence that is relevant to\nfundamentality is grounding. Note, however, that grounding as well\ncould be understood as a family of dependence relations (Trogdon\n2013), and there is an on-going discussion about the relationship\nbetween grounding and ontological dependence more generally (e.g.,\nSchnieder 2020b; Rydéhn 2021). Furthermore, since our\ndiscussion of fundamentality has focused on entities, it is\nworth noting that bridging fundamentality and grounding suggests a\ncommitment to entity grounding, whereby all sorts of entities\ncan stand in grounding relations. However, some prefer to restrict\ngrounding to facts only, and this would accordingly require a\nsomewhat different formulation of the relevant fundamentality claims\n(see the separate entry on\n metaphysical grounding\n and especially the section on\n regimentation\n for further details).\n\nOn the grounding-based characterization of fundamentality, the\nfundamentalia are ungrounded entities: everything is either\nungrounded or ultimately grounded in the fundamental, ungrounded\nentities (Schaffer 2009: 353; Audi 2012: 710; Dasgupta 2014a: 536;\nRaven 2016: 613). For instance, Audi (2012: 710) explicitly\ndistinguishes between the explanatorily fundamental and the\ncompositionally fundamental where the first is associated\nwith grounding and the second with mereological dependence. As Audi\ncorrectly notes, one would think that often these two notions of\nfundamentality would overlap. But recall that we’ve just\nobserved that the converse of mereological dependence, running from\nthe smaller to the larger, could hold. For the priority monist, this\ndependence relation running from the smaller to the larger is\ngrounding, so it would also produce a different understanding of\nfundamentality.\n\nIf explanatory fundamentality and compositional fundamentality are\ngenuinely two different notions corresponding to two independent\nnotions of fundamentality, then\n (RI)\n does allow the overlap of explanatory and compositional\nfundamentality. But there could certainly be other considerations that\ncount against this. For instance, if (RI) is understood to mean that\nto be fundamental is just to be at the termination point of some\ndependence relation, then the debate between monism and pluralism\ncould just be a debate about the direction of compositional\nfundamentality, where compositional fundamentality terminates in the\nmereological atoms and its converse terminates in the whole cosmos. In\nother words, this could be understood as a debate about whether\nexplanatory fundamentality aligns with compositional fundamentality or\nits converse. Whichever way we go here, we would seem to end up\naligning some notions of fundamentality and misaligning others.\n\nAn important question arises: should we indeed postulate several\nindependent notions of fundamentality, relativized to each of the\nmetaphysical dependence relations, or should we aim to define only one\nsense of fundamentality, either to be defined in terms of just one\nrelation of metaphysical dependence or in terms of some privileged\nproper subset of these relations?\n\nGiven that there are good reasons to exclude some notions of\ndependence, such as modal dependence and perhaps causal dependence, it\nwould appear that there is an additional question about why only some\nnotions of dependence are such that we want to define a corresponding\nnotion of fundamentality for them. There is an obvious challenge for\nthe view that we should postulate several relativized notions of\nfundamentality. The challenge is simply that the notion of\nfundamentality would seem to do little in addition to the various\nrelativized notions of (in)dependence. Indeed, this is likely to cause\nconfusion, because the notion of fundamentality is sometimes used in\nthe literature without any mention of which relativized sense of\nindependence is in question. Moreover, since different types of\nmetaphysical dependence have different formal properties (e.g., some\nare strict partial orders, but some might be symmetric, reflexive or\nnon-transitive) and they can perhaps even run in different directions,\nit is difficult to see what could unify the different notions\nof fundamentality, i.e., the proper subset of those dependence\nrelations that we consider to be relevant for\n fundamentality.[9]\n\nThose who think that grounding is strongly unified often appeal to its\nformal properties (but for a different approach, see Trogdon 2018a).\nThese properties may be debated, but if grounding is strongly unified,\nthen one could hold that for a relation to count as grounding, it\nshould at least fit these properties. Relevant formal properties\ninclude the following: grounding is a strict partial order,\nnon-monotonic in the sense that we cannot add arbitrary\ngrounds and expect that grounding still holds (i.e., if A is\ngrounded in B, then it does not follow that A is\ngrounded in B and C), and it is thought that grounds\nmetaphysically necessitate what they ground (although see Leuenberger\n2014; Skiles 2015 against necessitation). In contrast, Bennett’s\nbuilding relations \n(see note 10)\n do not share all their formal properties. She holds that\nthey’re all antisymmetric and irreflexive, but not necessarily\ntransitive (Bennett 2017: 46). Another example of this type of\n“multi-dimensional” approach to fundamentality can be\nfound in Koslicki’s (2012, 2015, 2016)\n work.[10]\n\nIt’s important to see that on a multi-dimensional view whereby\nthe various dependence relations relevant to fundamentality might even\nrun in different directions, one must be very careful indeed to\nspecify which relativized notion of fundamentality one has in mind. If\nit turns out that some entity is independent in all the relativized\nsenses of independence relevant to fundamentality, then it would seem\nthat we are back to absolute independence\n (AI)\n (or independence “full stop”, as Bennett 2017: 106 calls\nit).\n\nHere we would do well to systematically distinguish between those\nproponents of\n (RI)\n who hold that only one metaphysical dependence relation, e.g.,\nmereological dependence or a strongly unified notion of grounding, is\nrelevant to fundamentality and those who think that a proper subset of\nthese relations is relevant to fundamentality. Sometimes the labels\nmonism and pluralism are used to distinguish between\nthe singular fundamentality view and the multi-dimensional view, but\nin the interest of clarity we should introduce different terms, as we\nhave already used these labels for another\n purpose.[11]\n So, let us use the labels (RI-one) and (RI-many) to distinguish\nbetween those who think that there is only one notion of\nfundamentality and those who think that there are several. Typically,\nthere is an easy translation between these views. Let us say that a\nproponent of (RI-one) thinks that only mereological dependence is\nrelevant to fundamentality. Well, a proponent of (RI-many), provided\nthat mereological dependence is one of the relations they consider\nrelevant to fundamentality, can simply translate the (RI-one) notion\nof fundamentality into their (RI-many) notion of mereological\nfundamentality. Hence the disagreement is that from the (RI-one) point\nof view, there is a single notion of fundamentality, and they would\nthink that (RI-many) mistakenly holds other notions of fundamentality\nto be genuine, whereas from the (RI-many) point of view, there are\nmany relativized notions of fundamentality, and (RI-one) mistakenly\npicks just one, or indeed none depending on whether the relevant\n(RI-one) relation is\n included.[12]\n\nWe conclude this section by posing a further question to all\nproponents of\n (RI):\n is there a relativized notion of fundamentality for every\nmetaphysical dependence relation, or only some of them? Further, if\nonly a proper subset of metaphysical dependence relations are relevant\nto fundamentality, then what makes these dependence relations relevant\nin this way? A proponent of (RI) may refuse to answer this question,\nsince it would be an additional commitment to privilege some\nmetaphysical dependence relations in this way. However, given that one\nmajor task for the notion of fundamentality is often thought to be\nrelated to the idea of the hierarchical structure of reality, it seems\nthat we may have to accept only a proper subset of metaphysical\ndependence relations as being relevant for fundamentality if this task\nis to be preserved (of course, it could also be abandoned!). For\ninstance, perhaps only those metaphysical dependence relations that\nare asymmetric and transitive would qualify. Still, there may also be\ndependence relations that are relevant to fundamentality that fail to\nbe transitive. At this point, it could be helpful to move on to the\nthird potential definition of fundamentality, as something along the\nlines of this definition is often used to characterize fundamentality\ndefined in terms of (RI) as well.\n",
    "section_title": "1.2 Restricted Independence",
    "entry_title": "Fundamentality",
    "hierarchy_title": "Fundamentality || Varieties of Fundamentality || Restricted Independence",
    "tokenized_text": [
        "variety",
        "fundamentality",
        "restricted",
        "independence",
        "restricted",
        "independence",
        "second",
        "definition",
        "fundamentality",
        "considered",
        "much",
        "versatile",
        "weaker",
        "ai",
        "call",
        "restricted",
        "independence",
        "produce",
        "relativized",
        "sense",
        "fundamentality",
        "fundamentality",
        "relative",
        "certain",
        "variety",
        "variety",
        "metaphysical",
        "dependence",
        "one",
        "confuse",
        "relative",
        "fundamentality",
        "concern",
        "priority",
        "ordering",
        "two",
        "nonfundamental",
        "entity",
        "restricted",
        "independence",
        "start",
        "idea",
        "metaphysical",
        "dependence",
        "relation",
        "corresponding",
        "notion",
        "fundamentality",
        "must",
        "relativize",
        "notion",
        "fundamentality",
        "accordingly",
        "ri",
        "x",
        "restrictedly",
        "independent",
        "one",
        "metaphysical",
        "dependence",
        "relation",
        "d_",
        "d_",
        "d_",
        "n",
        "d_",
        "xy",
        "d_",
        "xy",
        "d_",
        "nxy",
        "ri",
        "restricted",
        "concern",
        "one",
        "specific",
        "kind",
        "metaphysical",
        "dependence",
        "plausible",
        "metaphysical",
        "dependence",
        "relation",
        "modal",
        "dependence",
        "saw",
        "section",
        "would",
        "immediately",
        "rule",
        "fundamental",
        "entity",
        "notice",
        "ri",
        "allows",
        "possibility",
        "including",
        "several",
        "dependence",
        "relation",
        "easily",
        "define",
        "restricted",
        "sense",
        "dependence",
        "d_",
        "d_",
        "d_",
        "n",
        "already",
        "discussed",
        "kind",
        "metaphysical",
        "dependence",
        "ri",
        "could",
        "apply",
        "grounding",
        "mereological",
        "dependence",
        "ri",
        "concern",
        "subset",
        "metaphysical",
        "dependence",
        "relation",
        "considered",
        "relevant",
        "fundamentality",
        "two",
        "philosopher",
        "could",
        "disagree",
        "dependence",
        "relation",
        "include",
        "subset",
        "variation",
        "conception",
        "fundamentality",
        "found",
        "throughout",
        "literature",
        "probably",
        "close",
        "standard",
        "conception",
        "likely",
        "find",
        "example",
        "schaffer",
        "dixon",
        "bennett",
        "see",
        "also",
        "tahko",
        "ch",
        "bliss",
        "priest",
        "b",
        "course",
        "many",
        "difference",
        "various",
        "account",
        "variation",
        "ri",
        "standard",
        "enough",
        "picked",
        "critical",
        "towards",
        "conception",
        "fundamentality",
        "well",
        "bliss",
        "morganti",
        "raven",
        "ai",
        "ri",
        "could",
        "understood",
        "putting",
        "forward",
        "idea",
        "fundamental",
        "reality",
        "need",
        "relational",
        "underpinning",
        "notion",
        "relational",
        "underpinning",
        "compare",
        "fine",
        "word",
        "whatever",
        "fundamentality",
        "amount",
        "must",
        "case",
        "one",
        "several",
        "various",
        "relation",
        "metaphysical",
        "dependence",
        "may",
        "used",
        "define",
        "fundamentality",
        "since",
        "ri",
        "leaf",
        "completely",
        "open",
        "metaphysical",
        "dependence",
        "relation",
        "fact",
        "relevant",
        "fundamentality",
        "mention",
        "example",
        "one",
        "point",
        "early",
        "s",
        "may",
        "case",
        "philosopher",
        "using",
        "notion",
        "fundamentality",
        "mind",
        "might",
        "call",
        "mereological",
        "fundamentality",
        "whereby",
        "relevant",
        "kind",
        "dependence",
        "mereological",
        "dependence",
        "see",
        "especially",
        "schaffer",
        "concise",
        "definition",
        "mereological",
        "dependence",
        "offered",
        "kim",
        "property",
        "whole",
        "fact",
        "whole",
        "instantiates",
        "certain",
        "property",
        "may",
        "depend",
        "property",
        "relation",
        "part",
        "see",
        "also",
        "markosian",
        "thalos",
        "however",
        "even",
        "though",
        "mereological",
        "dependence",
        "still",
        "sometimes",
        "considered",
        "relevant",
        "fundamentality",
        "becoming",
        "le",
        "common",
        "view",
        "relevant",
        "kind",
        "dependence",
        "wilsch",
        "bennett",
        "may",
        "certainly",
        "esteemed",
        "history",
        "type",
        "idea",
        "given",
        "mereological",
        "atomism",
        "type",
        "defended",
        "already",
        "ancient",
        "philosopher",
        "leucippus",
        "democritus",
        "would",
        "appear",
        "instance",
        "view",
        "see",
        "separate",
        "entry",
        "ancient",
        "atomism",
        "detail",
        "compare",
        "schnieder",
        "a",
        "bolzano",
        "version",
        "atomism",
        "discussed",
        "important",
        "see",
        "thesis",
        "thing",
        "mereologically",
        "fundamental",
        "entail",
        "commitment",
        "atomism",
        "may",
        "helpful",
        "introduce",
        "distinction",
        "priority",
        "pluralism",
        "monism",
        "already",
        "seen",
        "monist",
        "might",
        "attracted",
        "view",
        "fundamentality",
        "one",
        "fundamental",
        "entity",
        "cosmos",
        "universe",
        "whole",
        "schaffer",
        "a",
        "good",
        "exposition",
        "defense",
        "spinozainspired",
        "view",
        "see",
        "also",
        "newlands",
        "view",
        "directly",
        "entail",
        "anything",
        "relative",
        "fundamentality",
        "relation",
        "among",
        "nonfundamental",
        "enables",
        "u",
        "better",
        "understand",
        "converse",
        "mereological",
        "dependence",
        "kim",
        "defines",
        "might",
        "hold",
        "instead",
        "whole",
        "depending",
        "part",
        "part",
        "could",
        "depend",
        "whole",
        "contrast",
        "familiar",
        "idea",
        "often",
        "associated",
        "entailed",
        "atomism",
        "mereological",
        "dependence",
        "must",
        "run",
        "larger",
        "smaller",
        "mereological",
        "atom",
        "fundamental",
        "entity",
        "choice",
        "concerning",
        "direction",
        "relevant",
        "dependence",
        "relation",
        "often",
        "reflected",
        "choice",
        "priority",
        "pluralism",
        "monism",
        "although",
        "strictly",
        "speaking",
        "issue",
        "independent",
        "miller",
        "trogdon",
        "cotnoir",
        "steinberg",
        "tallant",
        "two",
        "proponent",
        "ri",
        "even",
        "agree",
        "proper",
        "subset",
        "metaphysical",
        "dependence",
        "relation",
        "relevant",
        "fundamentality",
        "may",
        "disagree",
        "direction",
        "relevant",
        "dependence",
        "relation",
        "moving",
        "different",
        "subspecies",
        "ri",
        "see",
        "clear",
        "link",
        "grounding",
        "fundamentality",
        "grounding",
        "understood",
        "expressing",
        "noncausal",
        "connection",
        "two",
        "thing",
        "example",
        "certain",
        "act",
        "might",
        "considered",
        "evil",
        "cause",
        "harm",
        "statement",
        "express",
        "causal",
        "link",
        "instead",
        "tell",
        "u",
        "ground",
        "evilness",
        "act",
        "similarly",
        "one",
        "might",
        "think",
        "mental",
        "state",
        "hold",
        "virtue",
        "neurophysiological",
        "state",
        "substance",
        "prior",
        "trope",
        "notion",
        "virtue",
        "prior",
        "case",
        "may",
        "understood",
        "term",
        "grounding",
        "likely",
        "common",
        "contemporary",
        "understanding",
        "ri",
        "important",
        "relation",
        "metaphysical",
        "dependence",
        "relevant",
        "fundamentality",
        "grounding",
        "note",
        "however",
        "grounding",
        "well",
        "could",
        "understood",
        "family",
        "dependence",
        "relation",
        "trogdon",
        "ongoing",
        "discussion",
        "relationship",
        "grounding",
        "ontological",
        "dependence",
        "generally",
        "eg",
        "schnieder",
        "b",
        "rydéhn",
        "furthermore",
        "since",
        "discussion",
        "fundamentality",
        "focused",
        "entity",
        "worth",
        "noting",
        "bridging",
        "fundamentality",
        "grounding",
        "suggests",
        "commitment",
        "entity",
        "grounding",
        "whereby",
        "sort",
        "entity",
        "stand",
        "grounding",
        "relation",
        "however",
        "prefer",
        "restrict",
        "grounding",
        "fact",
        "would",
        "accordingly",
        "require",
        "somewhat",
        "different",
        "formulation",
        "relevant",
        "fundamentality",
        "claim",
        "see",
        "separate",
        "entry",
        "metaphysical",
        "grounding",
        "especially",
        "section",
        "regimentation",
        "detail",
        "groundingbased",
        "characterization",
        "fundamentality",
        "fundamentalia",
        "ungrounded",
        "entity",
        "everything",
        "either",
        "ungrounded",
        "ultimately",
        "grounded",
        "fundamental",
        "ungrounded",
        "entity",
        "schaffer",
        "audi",
        "dasgupta",
        "a",
        "raven",
        "instance",
        "audi",
        "explicitly",
        "distinguishes",
        "explanatorily",
        "fundamental",
        "compositionally",
        "fundamental",
        "first",
        "associated",
        "grounding",
        "second",
        "mereological",
        "dependence",
        "audi",
        "correctly",
        "note",
        "one",
        "would",
        "think",
        "often",
        "two",
        "notion",
        "fundamentality",
        "would",
        "overlap",
        "recall",
        "observed",
        "converse",
        "mereological",
        "dependence",
        "running",
        "smaller",
        "larger",
        "could",
        "hold",
        "priority",
        "monist",
        "dependence",
        "relation",
        "running",
        "smaller",
        "larger",
        "grounding",
        "would",
        "also",
        "produce",
        "different",
        "understanding",
        "fundamentality",
        "explanatory",
        "fundamentality",
        "compositional",
        "fundamentality",
        "genuinely",
        "two",
        "different",
        "notion",
        "corresponding",
        "two",
        "independent",
        "notion",
        "fundamentality",
        "ri",
        "allow",
        "overlap",
        "explanatory",
        "compositional",
        "fundamentality",
        "could",
        "certainly",
        "consideration",
        "count",
        "instance",
        "ri",
        "understood",
        "mean",
        "fundamental",
        "termination",
        "point",
        "dependence",
        "relation",
        "debate",
        "monism",
        "pluralism",
        "could",
        "debate",
        "direction",
        "compositional",
        "fundamentality",
        "compositional",
        "fundamentality",
        "terminates",
        "mereological",
        "atom",
        "converse",
        "terminates",
        "whole",
        "cosmos",
        "word",
        "could",
        "understood",
        "debate",
        "whether",
        "explanatory",
        "fundamentality",
        "aligns",
        "compositional",
        "fundamentality",
        "converse",
        "whichever",
        "way",
        "go",
        "would",
        "seem",
        "end",
        "aligning",
        "notion",
        "fundamentality",
        "misaligning",
        "others",
        "important",
        "question",
        "arises",
        "indeed",
        "postulate",
        "several",
        "independent",
        "notion",
        "fundamentality",
        "relativized",
        "metaphysical",
        "dependence",
        "relation",
        "aim",
        "define",
        "one",
        "sense",
        "fundamentality",
        "either",
        "defined",
        "term",
        "one",
        "relation",
        "metaphysical",
        "dependence",
        "term",
        "privileged",
        "proper",
        "subset",
        "relation",
        "given",
        "good",
        "reason",
        "exclude",
        "notion",
        "dependence",
        "modal",
        "dependence",
        "perhaps",
        "causal",
        "dependence",
        "would",
        "appear",
        "additional",
        "question",
        "notion",
        "dependence",
        "want",
        "define",
        "corresponding",
        "notion",
        "fundamentality",
        "obvious",
        "challenge",
        "view",
        "postulate",
        "several",
        "relativized",
        "notion",
        "fundamentality",
        "challenge",
        "simply",
        "notion",
        "fundamentality",
        "would",
        "seem",
        "little",
        "addition",
        "various",
        "relativized",
        "notion",
        "dependence",
        "indeed",
        "likely",
        "cause",
        "confusion",
        "notion",
        "fundamentality",
        "sometimes",
        "used",
        "literature",
        "without",
        "mention",
        "relativized",
        "sense",
        "independence",
        "question",
        "moreover",
        "since",
        "different",
        "type",
        "metaphysical",
        "dependence",
        "different",
        "formal",
        "property",
        "eg",
        "strict",
        "partial",
        "order",
        "might",
        "symmetric",
        "reflexive",
        "nontransitive",
        "perhaps",
        "even",
        "run",
        "different",
        "direction",
        "difficult",
        "see",
        "could",
        "unify",
        "different",
        "notion",
        "fundamentality",
        "ie",
        "proper",
        "subset",
        "dependence",
        "relation",
        "consider",
        "relevant",
        "fundamentality",
        "think",
        "grounding",
        "strongly",
        "unified",
        "often",
        "appeal",
        "formal",
        "property",
        "different",
        "approach",
        "see",
        "trogdon",
        "a",
        "property",
        "may",
        "debated",
        "grounding",
        "strongly",
        "unified",
        "one",
        "could",
        "hold",
        "relation",
        "count",
        "grounding",
        "least",
        "fit",
        "property",
        "relevant",
        "formal",
        "property",
        "include",
        "following",
        "grounding",
        "strict",
        "partial",
        "order",
        "nonmonotonic",
        "sense",
        "add",
        "arbitrary",
        "ground",
        "expect",
        "grounding",
        "still",
        "hold",
        "ie",
        "grounded",
        "b",
        "follow",
        "grounded",
        "b",
        "c",
        "thought",
        "ground",
        "metaphysically",
        "necessitate",
        "ground",
        "although",
        "see",
        "leuenberger",
        "skiles",
        "necessitation",
        "contrast",
        "bennett",
        "building",
        "relation",
        "see",
        "note",
        "share",
        "formal",
        "property",
        "hold",
        "antisymmetric",
        "irreflexive",
        "necessarily",
        "transitive",
        "bennett",
        "another",
        "example",
        "type",
        "multidimensional",
        "approach",
        "fundamentality",
        "found",
        "koslicki",
        "work",
        "important",
        "see",
        "multidimensional",
        "view",
        "whereby",
        "various",
        "dependence",
        "relation",
        "relevant",
        "fundamentality",
        "might",
        "even",
        "run",
        "different",
        "direction",
        "one",
        "must",
        "careful",
        "indeed",
        "specify",
        "relativized",
        "notion",
        "fundamentality",
        "one",
        "mind",
        "turn",
        "entity",
        "independent",
        "relativized",
        "sens",
        "independence",
        "relevant",
        "fundamentality",
        "would",
        "seem",
        "back",
        "absolute",
        "independence",
        "ai",
        "independence",
        "full",
        "stop",
        "bennett",
        "call",
        "would",
        "well",
        "systematically",
        "distinguish",
        "proponent",
        "ri",
        "hold",
        "one",
        "metaphysical",
        "dependence",
        "relation",
        "eg",
        "mereological",
        "dependence",
        "strongly",
        "unified",
        "notion",
        "grounding",
        "relevant",
        "fundamentality",
        "think",
        "proper",
        "subset",
        "relation",
        "relevant",
        "fundamentality",
        "sometimes",
        "label",
        "monism",
        "pluralism",
        "used",
        "distinguish",
        "singular",
        "fundamentality",
        "view",
        "multidimensional",
        "view",
        "interest",
        "clarity",
        "introduce",
        "different",
        "term",
        "already",
        "used",
        "label",
        "another",
        "purpose",
        "let",
        "u",
        "use",
        "label",
        "rione",
        "rimany",
        "distinguish",
        "think",
        "one",
        "notion",
        "fundamentality",
        "think",
        "several",
        "typically",
        "easy",
        "translation",
        "view",
        "let",
        "u",
        "say",
        "proponent",
        "rione",
        "think",
        "mereological",
        "dependence",
        "relevant",
        "fundamentality",
        "well",
        "proponent",
        "rimany",
        "provided",
        "mereological",
        "dependence",
        "one",
        "relation",
        "consider",
        "relevant",
        "fundamentality",
        "simply",
        "translate",
        "rione",
        "notion",
        "fundamentality",
        "rimany",
        "notion",
        "mereological",
        "fundamentality",
        "hence",
        "disagreement",
        "rione",
        "point",
        "view",
        "single",
        "notion",
        "fundamentality",
        "would",
        "think",
        "rimany",
        "mistakenly",
        "hold",
        "notion",
        "fundamentality",
        "genuine",
        "whereas",
        "rimany",
        "point",
        "view",
        "many",
        "relativized",
        "notion",
        "fundamentality",
        "rione",
        "mistakenly",
        "pick",
        "one",
        "indeed",
        "none",
        "depending",
        "whether",
        "relevant",
        "rione",
        "relation",
        "included",
        "conclude",
        "section",
        "posing",
        "question",
        "proponent",
        "ri",
        "relativized",
        "notion",
        "fundamentality",
        "every",
        "metaphysical",
        "dependence",
        "relation",
        "proper",
        "subset",
        "metaphysical",
        "dependence",
        "relation",
        "relevant",
        "fundamentality",
        "make",
        "dependence",
        "relation",
        "relevant",
        "way",
        "proponent",
        "ri",
        "may",
        "refuse",
        "answer",
        "question",
        "since",
        "would",
        "additional",
        "commitment",
        "privilege",
        "metaphysical",
        "dependence",
        "relation",
        "way",
        "however",
        "given",
        "one",
        "major",
        "task",
        "notion",
        "fundamentality",
        "often",
        "thought",
        "related",
        "idea",
        "hierarchical",
        "structure",
        "reality",
        "seems",
        "may",
        "accept",
        "proper",
        "subset",
        "metaphysical",
        "dependence",
        "relation",
        "relevant",
        "fundamentality",
        "task",
        "preserved",
        "course",
        "could",
        "also",
        "abandoned",
        "instance",
        "perhaps",
        "metaphysical",
        "dependence",
        "relation",
        "asymmetric",
        "transitive",
        "would",
        "qualify",
        "still",
        "may",
        "also",
        "dependence",
        "relation",
        "relevant",
        "fundamentality",
        "fail",
        "transitive",
        "point",
        "could",
        "helpful",
        "move",
        "third",
        "potential",
        "definition",
        "fundamentality",
        "something",
        "along",
        "line",
        "definition",
        "often",
        "used",
        "characterize",
        "fundamentality",
        "defined",
        "term",
        "ri",
        "well"
    ]
}