{
    "main_text": "Varieties of Fundamentality\n1. Varieties of Fundamentality\n\nThere are many senses in which a thing may be said to be\nfundamental—some technical, some relatively intuitive. A very\ncommon way to think about fundamentality is in terms of independence,\nwhereby for any notion of dependence D, an entity is\nD-fundamental if and only if it does not\ndependD on anything else (or on anything else that\ndoes not depend on it). This independence-based characterization of\nfundamentality will be discussed in sections\n 1.1\n and\n 1.2.\n There are also other ways to understand fundamentality; these include\nfundamentality as a complete description of reality\n (section 1.3)\n and as primitive\n (section 1.4).\n So, there are many ways to understand fundamentality and whether\nthere is any single idea of fundamentality that these different ways\nare trying to capture is a substantial issue. But even if there is no\nunified sense of fundamentality, one interesting question is whether\nthere are any fundamental entities, where “fundamental” is\nunderstood in one of the different ways that will be specified below.\nWe might also ask whether we need such entities, whether given\ntheories are committed to their existence, and what the role of\nfundamentalia is in explanation. Before we get started, a few\npreliminary issues need to be mentioned.\n\nFor present purposes, we are interested in the notion of a fundamental\nthing, or type of thing. The candidates for fundamentality\nmay include objects, such as electrons, but they may also include\nproperties, or facts. The choice regarding the relevant type of entity\nmay depend on one’s preferred account of fundamentality.\nHowever, there is often an acceptable translation between different\n views.[1]\n For instance, let’s say that we take the fact <electrons\nhave unit negative charge> to be fundamental. Someone who does not\nwish to ascribe fundamentality to facts (e.g., because they do not\nhave facts in their ontology), could understand this to be saying that\nthe property unit negative charge is fundamental and\ninstantiated in electrons. The translation here is from electrons\nhave unit negative charge to the fundamental property unit\nnegative charge that is instantiated in electrons (and only\nthem). So, the disagreement between those who consider fundamentality\nto concern facts and those who regard objects and properties as\nfundamentalia may not be as serious as it looks.\n\nOne important distinction in the usage of the notion of fundamentality\nis worth highlighting: fundamentality as a general metaphysical notion\nand fundamentality in physics and physical theories (see Morganti\n2020a, 2020b; Allori 2022). These two ways to use the notion are of\ncourse related, but the focus of this entry is on the first, broader\nnotion of fundamentality. The remit of the latter notion includes\nquestions such as whether physics is a more fundamental science than\nthe other natural sciences, what makes a physical theory fundamental,\nand what particular physical theories to regard as fundamental\n(Morganti 2020b). The notions of fundamentality in metaphysics and\nfundamentality in physics can overlap, especially for naturalistically\ninclined philosophers who wish to turn to our best science as a guide\nto the structure of reality. However, there are at least two important\ndifferences in the usage of the notion of fundamentality in these two\ncontexts. First, when we consider fundamentality in physical\ntheories, there is a further question about how we link what\nthe theory describes or represents to reality. Second, some\ndiscussions of fundamentality in physics are framed in a more\nepistemic fashion. For instance, Crowther (2019) suggests that a\ntheory should be considered fundamental if and only if it possesses a\nparticular set of epistemic features, such as being predictive at all\nscales (see Morganti 2020b for discussion).\n\nWe should also distinguish between the fundamentality of entities\nbelonging to a certain ontological category and the fundamentality of\nthe ontological category itself (see Hakkarainen 2022). It is one\nthing to say that certain properties are fundamental; another to say\nthat the category property is a fundamental category. We are\nmostly concerned with the former issue, but the debate about which\nontological categories are fundamental and how many such categories\nthere are has been lively throughout the history of Western\nphilosophy. For instance, Aristotle may have thought that substances\nare the only category that is separate from and hence more\nfundamental than other categories, such as the category universals\n(Aristotle Physics 185a31–32; Metaphysics\n1029a27–28; on the status of the category of substance in\ncontemporary metaphysics, see O’Conaill\n 2022).[2]\n Another example is the category of natural kinds,\nwhich is one of the four fundamental categories in Lowe’s (2006)\nfour-category ontology, and definitive of the view that we\nmay call natural kind fundamentalism (Tahko 2021a: Ch. 4.3).\nSome philosophers (e.g., L. A. Paul 2017) have also defend a view\naccording to which there is just one fundamental category, by way of\ncollapsing the distinction between substance and property. On this\nview, substances would be mereological complexes of properties and\nhence not an ontological category in their own right (see\nKeinänen & Tahko 2019 for discussion).\n\nSince one key task for the notion of fundamentality is to help us\narticulate the view that there is a hierarchical structure to\nreality, it is usually assumed that the dependence relation we are\ndealing with must be asymmetric. Typically, the relation\nwould also be considered transitive and irreflexive,\nhence producing a strict partial ordering. However, each of\nthese formal characteristics can in fact be questioned, albeit whether\nthis undermines the layered conception is up for debate (see Rabin\n 2018).[3]\n\nWe have noted that relative fundamentality is a very important notion,\nsince the second key task for fundamentality identified above concerns\nthe hierarchy of fundamentality. Moreover, relative fundamentality\ncould arguably be used to define absolute fundamentality (some entity\nx is absolutely fundamental if and only if it is not\nrelatively fundamental to any entity y). In contrast,\nrelative fundamentality cannot be defined in terms of absolute\nfundamentality, so there are reasons to think that we should focus on\nrelative fundamentality, insofar as the notion makes sense. Given\nthis, it is perhaps surprising that there are relatively few explicit\naccounts of relative fundamentality in the literature so far, but we\nwill refer to it where relevant, and there are signs that the\nliterature is maturing in this regard (see Wilson 2012, 2016; Zylstra\n2014; Koslicki 2015; Bennett 2017: Ch. 6; deRosset 2017; Correia\n2021a, 2021b, 2021c; Werner 2021). One complication, as observed by\nCorreia (2021c), is that the notion of relative fundamentality comes\nin two varieties: being more fundamental than and being\nas fundamental as. The notion of metaphysical grounding\nhas been used to characterize both notions of relative fundamentality\n(Correia 2021b, 2021c; Werner 2021), but interestingly, Correia\n(2021a) has also explored the possibility of characterizing the notion\nof metaphysical grounding in terms of relative fundamentality. In what\nfollows, a variety of grounding-based characterizations of\nfundamentality will be discussed, but this is not the only way to\ncharacterize fundamentality. In any case, the systematization of\nrelative fundamentality is now proceeding at a fast pace, especially\ndue to the recent efforts by Correia and Werner, who are partly\nreacting to Bennett’s (2017) earlier attempts (see also Shumener\n2019 and Wilson 2019 on Bennett’s views).\n\nFinally, the notion of naturalness and the related notion of\nsparseness, familiar especially from Lewis’s work (see\nLewis 1986, 2009; Schaffer 2004; Dorr & Hawthorne 2013; McDaniel\n2013, 2017; Thompson 2016a; Sánchez forthcoming) is sometimes\nconnected with fundamentality. Sider’s (2011) influential notion\nof structure is closely related to the notion of naturalness\n(cf. Fine 2013, Mathers 2019, Tahko 2020). Perfectly natural\nproperties might seem to be good candidates for absolutely fundamental\nentities. Naturalness is no doubt a close cousin of fundamentality,\nbut there are some reasons to think that the two notions cannot do the\nsame jobs (see Bennett 2017: Ch. 5.7). Most strikingly, there may be\nperfectly natural entities that are dependent in ways that are clearly\nruled out by many of the definitions of fundamentality that we will\nshortly\n consider.[4]\n For further discussion, see the supplement on\n the natural/non-natural distinction\n in the entry on\n David Lewis’s metaphysics.\n\nWe should also briefly address another, related notion, familiar from\nSider’s work, which links the notions of structure and\nmetaphysical grounding: purity (Sider 2011: Ch. 7.2).\nAccording to the principle of purity, fundamental facts involve only\nfundamental notions. Sider gives the following example, where\nC* is a predicate giving a complete microstructural account\nof the city of Hamburg (cf. Sider 2011: 108):\n\n(C) The proposition\nthat there is a C* grounds the proposition that there is a\ncity.\n\n\nSince the notion of city is clearly not fundamental, purity\ndictates that (C) is not fundamental. Since C* is here taken\nto be a fundamental fact, the status of (C) becomes problematic if we\naccept purity – (C) must either be fundamental itself or\nsomething needs to ground it. If it is fundamental, it violates\npurity. But if it is not fundamental, then it needs to be grounded.\nWhat could possibly ground (C)? This is the problem of\nmeta-ground, as discussed, e.g., by Dasgupta (2014a), Litland\n(2017, 2018b), and Correia (forthcoming). Unless a satisfactory answer\ncan be given, one must either abandon purity or sever the link between\ngrounding and Sider’s conception of fundamentality via structure\n(see Tahko 2020 for discussion).\n",
    "section_title": "1. Varieties of Fundamentality",
    "entry_title": "Fundamentality",
    "hierarchy_title": "Fundamentality || Varieties of Fundamentality",
    "tokenized_text": [
        "variety",
        "fundamentality",
        "variety",
        "fundamentality",
        "many",
        "sens",
        "thing",
        "may",
        "said",
        "fundamentalsome",
        "technical",
        "relatively",
        "intuitive",
        "common",
        "way",
        "think",
        "fundamentality",
        "term",
        "independence",
        "whereby",
        "notion",
        "dependence",
        "entity",
        "dfundamental",
        "dependd",
        "anything",
        "else",
        "anything",
        "else",
        "depend",
        "independencebased",
        "characterization",
        "fundamentality",
        "discussed",
        "section",
        "also",
        "way",
        "understand",
        "fundamentality",
        "include",
        "fundamentality",
        "complete",
        "description",
        "reality",
        "section",
        "primitive",
        "section",
        "many",
        "way",
        "understand",
        "fundamentality",
        "whether",
        "single",
        "idea",
        "fundamentality",
        "different",
        "way",
        "trying",
        "capture",
        "substantial",
        "issue",
        "even",
        "unified",
        "sense",
        "fundamentality",
        "one",
        "interesting",
        "question",
        "whether",
        "fundamental",
        "entity",
        "fundamental",
        "understood",
        "one",
        "different",
        "way",
        "specified",
        "might",
        "also",
        "ask",
        "whether",
        "need",
        "entity",
        "whether",
        "given",
        "theory",
        "committed",
        "existence",
        "role",
        "fundamentalia",
        "explanation",
        "get",
        "started",
        "preliminary",
        "issue",
        "need",
        "mentioned",
        "present",
        "purpose",
        "interested",
        "notion",
        "fundamental",
        "thing",
        "type",
        "thing",
        "candidate",
        "fundamentality",
        "may",
        "include",
        "object",
        "electron",
        "may",
        "also",
        "include",
        "property",
        "fact",
        "choice",
        "regarding",
        "relevant",
        "type",
        "entity",
        "may",
        "depend",
        "one",
        "preferred",
        "account",
        "fundamentality",
        "however",
        "often",
        "acceptable",
        "translation",
        "different",
        "view",
        "instance",
        "let",
        "say",
        "take",
        "fact",
        "electron",
        "unit",
        "negative",
        "charge",
        "fundamental",
        "someone",
        "wish",
        "ascribe",
        "fundamentality",
        "fact",
        "eg",
        "fact",
        "ontology",
        "could",
        "understand",
        "saying",
        "property",
        "unit",
        "negative",
        "charge",
        "fundamental",
        "instantiated",
        "electron",
        "translation",
        "electron",
        "unit",
        "negative",
        "charge",
        "fundamental",
        "property",
        "unit",
        "negative",
        "charge",
        "instantiated",
        "electron",
        "disagreement",
        "consider",
        "fundamentality",
        "concern",
        "fact",
        "regard",
        "object",
        "property",
        "fundamentalia",
        "may",
        "serious",
        "look",
        "one",
        "important",
        "distinction",
        "usage",
        "notion",
        "fundamentality",
        "worth",
        "highlighting",
        "fundamentality",
        "general",
        "metaphysical",
        "notion",
        "fundamentality",
        "physic",
        "physical",
        "theory",
        "see",
        "morganti",
        "a",
        "b",
        "allori",
        "two",
        "way",
        "use",
        "notion",
        "course",
        "related",
        "focus",
        "entry",
        "first",
        "broader",
        "notion",
        "fundamentality",
        "remit",
        "latter",
        "notion",
        "includes",
        "question",
        "whether",
        "physic",
        "fundamental",
        "science",
        "natural",
        "science",
        "make",
        "physical",
        "theory",
        "fundamental",
        "particular",
        "physical",
        "theory",
        "regard",
        "fundamental",
        "morganti",
        "b",
        "notion",
        "fundamentality",
        "metaphysics",
        "fundamentality",
        "physic",
        "overlap",
        "especially",
        "naturalistically",
        "inclined",
        "philosopher",
        "wish",
        "turn",
        "best",
        "science",
        "guide",
        "structure",
        "reality",
        "however",
        "least",
        "two",
        "important",
        "difference",
        "usage",
        "notion",
        "fundamentality",
        "two",
        "context",
        "first",
        "consider",
        "fundamentality",
        "physical",
        "theory",
        "question",
        "link",
        "theory",
        "describes",
        "represents",
        "reality",
        "second",
        "discussion",
        "fundamentality",
        "physic",
        "framed",
        "epistemic",
        "fashion",
        "instance",
        "crowther",
        "suggests",
        "theory",
        "considered",
        "fundamental",
        "posse",
        "particular",
        "set",
        "epistemic",
        "feature",
        "predictive",
        "scale",
        "see",
        "morganti",
        "b",
        "discussion",
        "also",
        "distinguish",
        "fundamentality",
        "entity",
        "belonging",
        "certain",
        "ontological",
        "category",
        "fundamentality",
        "ontological",
        "category",
        "see",
        "hakkarainen",
        "one",
        "thing",
        "say",
        "certain",
        "property",
        "fundamental",
        "another",
        "say",
        "category",
        "property",
        "fundamental",
        "category",
        "mostly",
        "concerned",
        "former",
        "issue",
        "debate",
        "ontological",
        "category",
        "fundamental",
        "many",
        "category",
        "lively",
        "throughout",
        "history",
        "western",
        "philosophy",
        "instance",
        "aristotle",
        "may",
        "thought",
        "substance",
        "category",
        "separate",
        "hence",
        "fundamental",
        "category",
        "category",
        "universal",
        "aristotle",
        "physic",
        "a",
        "metaphysics",
        "a",
        "status",
        "category",
        "substance",
        "contemporary",
        "metaphysics",
        "see",
        "conaill",
        "another",
        "example",
        "category",
        "natural",
        "kind",
        "one",
        "four",
        "fundamental",
        "category",
        "lowe",
        "fourcategory",
        "ontology",
        "definitive",
        "view",
        "may",
        "call",
        "natural",
        "kind",
        "fundamentalism",
        "tahko",
        "a",
        "ch",
        "philosopher",
        "eg",
        "l",
        "a",
        "paul",
        "also",
        "defend",
        "view",
        "according",
        "one",
        "fundamental",
        "category",
        "way",
        "collapsing",
        "distinction",
        "substance",
        "property",
        "view",
        "substance",
        "would",
        "mereological",
        "complex",
        "property",
        "hence",
        "ontological",
        "category",
        "right",
        "see",
        "keinänen",
        "tahko",
        "discussion",
        "since",
        "one",
        "key",
        "task",
        "notion",
        "fundamentality",
        "help",
        "u",
        "articulate",
        "view",
        "hierarchical",
        "structure",
        "reality",
        "usually",
        "assumed",
        "dependence",
        "relation",
        "dealing",
        "must",
        "asymmetric",
        "typically",
        "relation",
        "would",
        "also",
        "considered",
        "transitive",
        "irreflexive",
        "hence",
        "producing",
        "strict",
        "partial",
        "ordering",
        "however",
        "formal",
        "characteristic",
        "fact",
        "questioned",
        "albeit",
        "whether",
        "undermines",
        "layered",
        "conception",
        "debate",
        "see",
        "rabin",
        "noted",
        "relative",
        "fundamentality",
        "important",
        "notion",
        "since",
        "second",
        "key",
        "task",
        "fundamentality",
        "identified",
        "concern",
        "hierarchy",
        "fundamentality",
        "moreover",
        "relative",
        "fundamentality",
        "could",
        "arguably",
        "used",
        "define",
        "absolute",
        "fundamentality",
        "entity",
        "x",
        "absolutely",
        "fundamental",
        "relatively",
        "fundamental",
        "entity",
        "contrast",
        "relative",
        "fundamentality",
        "defined",
        "term",
        "absolute",
        "fundamentality",
        "reason",
        "think",
        "focus",
        "relative",
        "fundamentality",
        "insofar",
        "notion",
        "make",
        "sense",
        "given",
        "perhaps",
        "surprising",
        "relatively",
        "explicit",
        "account",
        "relative",
        "fundamentality",
        "literature",
        "far",
        "refer",
        "relevant",
        "sign",
        "literature",
        "maturing",
        "regard",
        "see",
        "wilson",
        "zylstra",
        "koslicki",
        "bennett",
        "ch",
        "derosset",
        "correia",
        "a",
        "b",
        "c",
        "werner",
        "one",
        "complication",
        "observed",
        "correia",
        "c",
        "notion",
        "relative",
        "fundamentality",
        "come",
        "two",
        "variety",
        "fundamental",
        "fundamental",
        "notion",
        "metaphysical",
        "grounding",
        "used",
        "characterize",
        "notion",
        "relative",
        "fundamentality",
        "correia",
        "b",
        "c",
        "werner",
        "interestingly",
        "correia",
        "a",
        "also",
        "explored",
        "possibility",
        "characterizing",
        "notion",
        "metaphysical",
        "grounding",
        "term",
        "relative",
        "fundamentality",
        "follows",
        "variety",
        "groundingbased",
        "characterization",
        "fundamentality",
        "discussed",
        "way",
        "characterize",
        "fundamentality",
        "case",
        "systematization",
        "relative",
        "fundamentality",
        "proceeding",
        "fast",
        "pace",
        "especially",
        "due",
        "recent",
        "effort",
        "correia",
        "werner",
        "partly",
        "reacting",
        "bennett",
        "earlier",
        "attempt",
        "see",
        "also",
        "shumener",
        "wilson",
        "bennett",
        "view",
        "finally",
        "notion",
        "naturalness",
        "related",
        "notion",
        "sparseness",
        "familiar",
        "especially",
        "lewis",
        "work",
        "see",
        "lewis",
        "schaffer",
        "dorr",
        "hawthorne",
        "mcdaniel",
        "thompson",
        "a",
        "sánchez",
        "forthcoming",
        "sometimes",
        "connected",
        "fundamentality",
        "sider",
        "influential",
        "notion",
        "structure",
        "closely",
        "related",
        "notion",
        "naturalness",
        "cf",
        "fine",
        "mathers",
        "tahko",
        "perfectly",
        "natural",
        "property",
        "might",
        "seem",
        "good",
        "candidate",
        "absolutely",
        "fundamental",
        "entity",
        "naturalness",
        "doubt",
        "close",
        "cousin",
        "fundamentality",
        "reason",
        "think",
        "two",
        "notion",
        "job",
        "see",
        "bennett",
        "ch",
        "strikingly",
        "may",
        "perfectly",
        "natural",
        "entity",
        "dependent",
        "way",
        "clearly",
        "ruled",
        "many",
        "definition",
        "fundamentality",
        "shortly",
        "consider",
        "discussion",
        "see",
        "supplement",
        "naturalnonnatural",
        "distinction",
        "entry",
        "david",
        "lewis",
        "metaphysics",
        "also",
        "briefly",
        "address",
        "another",
        "related",
        "notion",
        "familiar",
        "sider",
        "work",
        "link",
        "notion",
        "structure",
        "metaphysical",
        "grounding",
        "purity",
        "sider",
        "ch",
        "according",
        "principle",
        "purity",
        "fundamental",
        "fact",
        "involve",
        "fundamental",
        "notion",
        "sider",
        "give",
        "following",
        "example",
        "c",
        "predicate",
        "giving",
        "complete",
        "microstructural",
        "account",
        "city",
        "hamburg",
        "cf",
        "sider",
        "c",
        "proposition",
        "c",
        "ground",
        "proposition",
        "city",
        "since",
        "notion",
        "city",
        "clearly",
        "fundamental",
        "purity",
        "dictate",
        "c",
        "fundamental",
        "since",
        "c",
        "taken",
        "fundamental",
        "fact",
        "status",
        "c",
        "becomes",
        "problematic",
        "accept",
        "purity",
        "c",
        "must",
        "either",
        "fundamental",
        "something",
        "need",
        "ground",
        "fundamental",
        "violates",
        "purity",
        "fundamental",
        "need",
        "grounded",
        "could",
        "possibly",
        "ground",
        "c",
        "problem",
        "metaground",
        "discussed",
        "eg",
        "dasgupta",
        "a",
        "litland",
        "b",
        "correia",
        "forthcoming",
        "unless",
        "satisfactory",
        "answer",
        "given",
        "one",
        "must",
        "either",
        "abandon",
        "purity",
        "sever",
        "link",
        "grounding",
        "sider",
        "conception",
        "fundamentality",
        "via",
        "structure",
        "see",
        "tahko",
        "discussion"
    ]
}