{
    "main_text": "Metaphysical Foundationalism\n4. Metaphysical Infinitism\n\nTo endorse metaphysical infinitism is to reject metaphysical\nfoundationalism\n (MF).\n But as we’ve seen, the sense of metaphysical foundationalism\ndefined at the end of\n section 2\n does not require accepting strong, set-theoretic well-foundedness,\nand hence it is compatible with at least some types of infinite\ndescent. Accordingly, metaphysical infinitism is a somewhat stronger\nview than it may first have seemed.\n\nUsing the technical notion of being bounded from below or having a\nlower bound introduced in\n section 2,\n we can start with the simple idea that, for a given notion of\ndependence, a chain has a lower bound only if there is an element that\nevery element in the chain depends on (Rabin & Rabern 2016: 366).\nAs we saw earlier, infinitely descending chains of dependence may have\na lower bound, that is, terminate in an independent element that may\nor may not be part of the chain itself, yet fail to be\nset-theoretically well-founded. But there is an even weaker condition\nthan having a lower bound that can satisfy\n (MF),\n namely, Rabin & Rabern’s (2016: 363) “having a\nfoundation” or Dixon’s (2016: 446) equivalent “full\nfoundations”. Both of these are based on the idea of having an\ninfinitely large foundation. An example of this type of foundation can\nbe constructed with the help of infinitary disjunctions, as both Rabin\n& Rabern and Dixon demonstrate (Litland 2016b discusses the\nproblems associated with this and constructs further examples). In\nsuch a case, (MF) is satisfied because every element depends on some\nindependent element, despite there being no lower bound. There is no\nlower bound because the chain does not terminate if the foundation is\ninfinitely large. In contrast, if the foundation is finite, then there\nis a lower bound and hence the weaker requirement of (MF) is also\nentailed. In decreasing order of strength, we have the requirement of\nset-theoretical well-foundedness, having a lower bound, and having a\nfoundation or full foundations. We defined (MF) in terms of the\nweakest of these three requirements in\n section 2,\n but a proponent of metaphysical foundationalism may of course make a\nstronger requirement as well, such as having a lower bound.\n\nIn this section, we are interested in the possibility of the type of\nstrong metaphysical infinitism that denies all of the three\nrequirements. The denial of\n (MF)\n entails that there are at least some entities that are\nnon-fundamental yet do not depend for their being on any fundamental\nentity or entities. There may be several ways in which this could\nhappen, but the most extreme possibility is a type of infinite\ncomplexity whereby there is an infinite descent of different\nkinds of entities, each depending on entities further down the chain\nbut never terminating and never being “fully accounted\nfor”. We might think of this in terms of a violation of the\nprinciple of sufficient reason (PSR), at least if (PSR) is thought to\nrequire that we must reach an ultimate reason rather than just a\nreason at each layer below the previous one. Accordingly, infinite\ncomplexity entails a lack of structure with the type of explanatory\nimport that (PSR) requires. This type of view would be more radical\nthan the various, potentially innocuous types of infinite descent\noutlined so far. The view might strike many as implausible, at least\nwhen it comes to the actual\n world.[24]\n\nInfinite complexity is a strong version of metaphysical infinitism,\nbut what if, instead of infinite complexity, we had some kind of\ninfinite repetition? This type of idea has been discussed under the\nlabel of boring infinite descent (Schaffer 2003: 505, 510;\nTahko 2014). A boring or repetitive structure entails that somewhere\ndown the chain of dependence we stop encountering novel types of\nentities or novel structure. The boring part of the structure that\nrepeats infinitely could be of any length as long as it starts anew\neventually. A description of the repetitive part only needs to be\nsupplemented with an instruction to continue as before. For\nexample:\n\n\nThe world stands on four elephants, the four elephants stand on a\nturtle, the turtle stands on two camels, the camels stand on four\nelephants, the four elephants stand on a turtle … and repeat ad\ninfinitum. (Tahko 2014: 261)\n\n\nThe idea is that the boring structure, whatever shape it may take, can\nbe fully described in terms of the mentioned entities (or types of\nentities, and perhaps the “standing” relations between\nthem): four elephants, a turtle, and two camels. It has been suggested\nthat this produces a “minimal” description of reality, but\nit is debatable whether it satisfies\n (MF)\n or is a case of strong metaphysical infinitism (Raven 2016; Tahko\n2018).\n\nIt seems that this type of infinite descent is less radical than\ninfinite complexity, but some open questions remain. For instance, is\nthe type of infinite regress at hand innocuous or vicious? Can we\ncapture the difference between metaphysical foundationalism and\nmetaphysical infinitism in terms of the non-viciousness or viciousness\nof the regress (Nolan 2001; Bliss 2013; R. Cameron 2022; Oberle\n2022b)? We will leave these issues open, but to improve on the toy\nexample, we might briefly discuss a more concrete case. Sometimes the\nNobel Prize winner Hans Dehmelt’s (1989) model is mentioned as a\npotential example (Schaffer 2003, Morganti 2014, Tahko 2014). Dehmelt\nspeculated that there could be a quark/lepton-like substructure beyond\nthe known level of quarks, based on the model of the triton, the\nnucleus of hydrogen’s radioactive isotope tritium:\n\n\nI propose to extend the triton substructure scheme to an infinite\nnumber of layers. Below the four layers listed above [up to\nsubquarks], they contain higher order \\(d_N\\) subquarks, with \\(N = 5\n\\rightarrow \\infty\\). In each layer the particles are not identical\nbut resemble each other in the same way as quarks and leptons do, with\nmasses varying as much as a factor 108. In an infinite regression to\nsimpler particles of ever increasing mass, they asymptotically\napproach Dirac point particles. (Dehmelt 1989: 8618)\n\n\nUp to \\(N = 3\\), the level of electrons, Dehmelt’s model is\nmotivated by current physics, but it is speculative from \\(N = 4\\)\nonwards, where electron substructure is postulated. However,\nit’s not entirely clear whether Dehmelt’s model is a\ngenuine case of boring infinite descent, given that the regress\nappears to terminate in Dirac point particles. What matters here is\nwhether these Dirac point particles are treated as genuine entities,\nbut there is no suggestion in Dehmelt’s model that this should\nbe the case. Rather, as the above quote suggests, the infinite\nregression of non-point particles asymptotically approaches the ideal\nlimit of Dirac point particles. This is a type of mathematical\nabstraction not unlike the one we find in the case of gunky space,\nwhere regions asymptotically approach “points” (see\nZimmerman 1996). Just like Dirac point particles in Dehmelt’s\nmodel, the points in the gunky space are not considered real entities;\nthey are merely a mathematical\n abstraction.[25]\n\nA final argument to be considered in this section challenges the\n“transmission model”, whereby derivative entities derive\ntheir “being” from the fundamental entities. Bohn (2018:\n170) makes a helpful observation, aimed against the transmission model\n(applied to grounding):\n\n\nGrounding is like a synchronic, static mathematical relation (like in\narithmetic), not like a diachronic, dynamic physical relation (like in\nthermodynamics, or action theory).\n\n\nThe thought here is that the transmission model illegitimately assumes\na dynamical “starting point” to any grounding chain. If we\nabandon the transmission model and the dynamical view, we arrive at\nthe idea of indefinitely descending ground whereby all facts\nhave a ground and hence there are no fundamental facts (Bohn 2018).\nThis violates even the weakest of the three requirements that a\nmetaphysical foundationalist might impose, so it is a strict denial of\n (MF).\n Note, however, that this concerns only the precisification of (MF) in\nterms of grounding. So, this type of metaphysical infinitism targets\nthe conception of fundamentality as ungroundedness (as specified in\nterms of\n (RI)\n in\n section 1.2).\n\nIf\n (MF)\n does not require the transmission model, the choice between\nfoundationalism and infinitism is difficult. There is, perhaps, one\ntest case: the possibility of gunk (everything has a proper\npart), junk (everything is a proper part), and hunk\n(everything both is and has a proper part). There is an on-going\ndebate about the modal status of these scenarios, and one might appeal\nto their possibility in defense of indefinitely descending ground (as\nBohn 2018\n does).[26]\n However, these scenarios of course concern only the relation of\nproper parthood (mereological dependence), and hence even if\nmereological infinitism were coherent, there may be other notions of\ndependence for which the corresponding notion of infinitism is\nincoherent.\n\nThis concludes our discussion of metaphysical infinitism and\nfundamentality. This survey has focused on a subset of the growing\nliterature on fundamentality with the aim of clarifying the various\nterminological issues surrounding the key notions and identifying some\ncommon themes. The ideas behind these notions are old as are the\nintuitions associated with the various arguments that we’ve seen\nfor and against metaphysical foundationalism and infinitism. Recent\nhelpful efforts to systematize some of the central ideas, especially\nthat of well-foundedness, have made it much easier to have\nconstructive discussions about the topic of fundamentality. It can be\nexpected that further attempts to formulate arguments for and against\ndifferent strengths of metaphysical foundationalism and infinitism\nwill emerge in the near future. The literature is also paying more\nattention toward the notions of relative fundamentality and\nmetaphysical coherentism. Finally, there is an increasing amount of\nliterature that applies more technical notions of fundamentality to\nvarious other debates in metaphysics: e.g., Morganti (2019) on ontic\nstructural realism, Calosi and Morganti (2021) on quantum\nentanglement, Giannotti (2021b) on powers, Scarpati (2021) on\nhaecceitism, Tahko (2021) on logical realism, Allori (2022) on quantum\ntheory, Hamri (2022) on causation, Rabin (2022) on the physicalism\ndebate, and Spencer (2022) on relativity.\n",
    "section_title": "4. Metaphysical Infinitism",
    "entry_title": "Fundamentality",
    "hierarchy_title": "Fundamentality || Metaphysical Foundationalism",
    "tokenized_text": [
        "metaphysical",
        "foundationalism",
        "metaphysical",
        "infinitism",
        "endorse",
        "metaphysical",
        "infinitism",
        "reject",
        "metaphysical",
        "foundationalism",
        "mf",
        "seen",
        "sense",
        "metaphysical",
        "foundationalism",
        "defined",
        "end",
        "section",
        "require",
        "accepting",
        "strong",
        "settheoretic",
        "wellfoundedness",
        "hence",
        "compatible",
        "least",
        "type",
        "infinite",
        "descent",
        "accordingly",
        "metaphysical",
        "infinitism",
        "somewhat",
        "stronger",
        "view",
        "may",
        "first",
        "seemed",
        "using",
        "technical",
        "notion",
        "bounded",
        "lower",
        "bound",
        "introduced",
        "section",
        "start",
        "simple",
        "idea",
        "given",
        "notion",
        "dependence",
        "chain",
        "lower",
        "bound",
        "element",
        "every",
        "element",
        "chain",
        "depends",
        "rabin",
        "rabern",
        "saw",
        "earlier",
        "infinitely",
        "descending",
        "chain",
        "dependence",
        "may",
        "lower",
        "bound",
        "terminate",
        "independent",
        "element",
        "may",
        "may",
        "part",
        "chain",
        "yet",
        "fail",
        "settheoretically",
        "wellfounded",
        "even",
        "weaker",
        "condition",
        "lower",
        "bound",
        "satisfy",
        "mf",
        "namely",
        "rabin",
        "rabern",
        "foundation",
        "dixon",
        "equivalent",
        "full",
        "foundation",
        "based",
        "idea",
        "infinitely",
        "large",
        "foundation",
        "example",
        "type",
        "foundation",
        "constructed",
        "help",
        "infinitary",
        "disjunction",
        "rabin",
        "rabern",
        "dixon",
        "demonstrate",
        "litland",
        "b",
        "discus",
        "problem",
        "associated",
        "construct",
        "example",
        "case",
        "mf",
        "satisfied",
        "every",
        "element",
        "depends",
        "independent",
        "element",
        "despite",
        "lower",
        "bound",
        "lower",
        "bound",
        "chain",
        "terminate",
        "foundation",
        "infinitely",
        "large",
        "contrast",
        "foundation",
        "finite",
        "lower",
        "bound",
        "hence",
        "weaker",
        "requirement",
        "mf",
        "also",
        "entailed",
        "decreasing",
        "order",
        "strength",
        "requirement",
        "settheoretical",
        "wellfoundedness",
        "lower",
        "bound",
        "foundation",
        "full",
        "foundation",
        "defined",
        "mf",
        "term",
        "weakest",
        "three",
        "requirement",
        "section",
        "proponent",
        "metaphysical",
        "foundationalism",
        "may",
        "course",
        "make",
        "stronger",
        "requirement",
        "well",
        "lower",
        "bound",
        "section",
        "interested",
        "possibility",
        "type",
        "strong",
        "metaphysical",
        "infinitism",
        "denies",
        "three",
        "requirement",
        "denial",
        "mf",
        "entail",
        "least",
        "entity",
        "nonfundamental",
        "yet",
        "depend",
        "fundamental",
        "entity",
        "entity",
        "may",
        "several",
        "way",
        "could",
        "happen",
        "extreme",
        "possibility",
        "type",
        "infinite",
        "complexity",
        "whereby",
        "infinite",
        "descent",
        "different",
        "kind",
        "entity",
        "depending",
        "entity",
        "chain",
        "never",
        "terminating",
        "never",
        "fully",
        "accounted",
        "might",
        "think",
        "term",
        "violation",
        "principle",
        "sufficient",
        "reason",
        "psr",
        "least",
        "psr",
        "thought",
        "require",
        "must",
        "reach",
        "ultimate",
        "reason",
        "rather",
        "reason",
        "layer",
        "previous",
        "one",
        "accordingly",
        "infinite",
        "complexity",
        "entail",
        "lack",
        "structure",
        "type",
        "explanatory",
        "import",
        "psr",
        "requires",
        "type",
        "view",
        "would",
        "radical",
        "various",
        "potentially",
        "innocuous",
        "type",
        "infinite",
        "descent",
        "outlined",
        "far",
        "view",
        "might",
        "strike",
        "many",
        "implausible",
        "least",
        "come",
        "actual",
        "world",
        "infinite",
        "complexity",
        "strong",
        "version",
        "metaphysical",
        "infinitism",
        "instead",
        "infinite",
        "complexity",
        "kind",
        "infinite",
        "repetition",
        "type",
        "idea",
        "discussed",
        "label",
        "boring",
        "infinite",
        "descent",
        "schaffer",
        "tahko",
        "boring",
        "repetitive",
        "structure",
        "entail",
        "somewhere",
        "chain",
        "dependence",
        "stop",
        "encountering",
        "novel",
        "type",
        "entity",
        "novel",
        "structure",
        "boring",
        "part",
        "structure",
        "repeat",
        "infinitely",
        "could",
        "length",
        "long",
        "start",
        "anew",
        "eventually",
        "description",
        "repetitive",
        "part",
        "need",
        "supplemented",
        "instruction",
        "continue",
        "example",
        "world",
        "stand",
        "four",
        "elephant",
        "four",
        "elephant",
        "stand",
        "turtle",
        "turtle",
        "stand",
        "two",
        "camel",
        "camel",
        "stand",
        "four",
        "elephant",
        "four",
        "elephant",
        "stand",
        "turtle",
        "repeat",
        "ad",
        "infinitum",
        "tahko",
        "idea",
        "boring",
        "structure",
        "whatever",
        "shape",
        "may",
        "take",
        "fully",
        "described",
        "term",
        "mentioned",
        "entity",
        "type",
        "entity",
        "perhaps",
        "standing",
        "relation",
        "four",
        "elephant",
        "turtle",
        "two",
        "camel",
        "suggested",
        "produce",
        "minimal",
        "description",
        "reality",
        "debatable",
        "whether",
        "satisfies",
        "mf",
        "case",
        "strong",
        "metaphysical",
        "infinitism",
        "raven",
        "tahko",
        "seems",
        "type",
        "infinite",
        "descent",
        "le",
        "radical",
        "infinite",
        "complexity",
        "open",
        "question",
        "remain",
        "instance",
        "type",
        "infinite",
        "regress",
        "hand",
        "innocuous",
        "vicious",
        "capture",
        "difference",
        "metaphysical",
        "foundationalism",
        "metaphysical",
        "infinitism",
        "term",
        "nonviciousness",
        "viciousness",
        "regress",
        "nolan",
        "bliss",
        "r",
        "cameron",
        "oberle",
        "b",
        "leave",
        "issue",
        "open",
        "improve",
        "toy",
        "example",
        "might",
        "briefly",
        "discus",
        "concrete",
        "case",
        "sometimes",
        "nobel",
        "prize",
        "winner",
        "han",
        "dehmelt",
        "model",
        "mentioned",
        "potential",
        "example",
        "schaffer",
        "morganti",
        "tahko",
        "dehmelt",
        "speculated",
        "could",
        "quarkleptonlike",
        "substructure",
        "beyond",
        "known",
        "level",
        "quark",
        "based",
        "model",
        "triton",
        "nucleus",
        "hydrogen",
        "radioactive",
        "isotope",
        "tritium",
        "propose",
        "extend",
        "triton",
        "substructure",
        "scheme",
        "infinite",
        "number",
        "layer",
        "four",
        "layer",
        "listed",
        "subquarks",
        "contain",
        "higher",
        "order",
        "d_n",
        "subquarks",
        "n",
        "rightarrow",
        "infty",
        "layer",
        "particle",
        "identical",
        "resemble",
        "way",
        "quark",
        "lepton",
        "mass",
        "varying",
        "much",
        "factor",
        "infinite",
        "regression",
        "simpler",
        "particle",
        "ever",
        "increasing",
        "mass",
        "asymptotically",
        "approach",
        "dirac",
        "point",
        "particle",
        "dehmelt",
        "n",
        "level",
        "electron",
        "dehmelt",
        "model",
        "motivated",
        "current",
        "physic",
        "speculative",
        "n",
        "onwards",
        "electron",
        "substructure",
        "postulated",
        "however",
        "entirely",
        "clear",
        "whether",
        "dehmelt",
        "model",
        "genuine",
        "case",
        "boring",
        "infinite",
        "descent",
        "given",
        "regress",
        "appears",
        "terminate",
        "dirac",
        "point",
        "particle",
        "matter",
        "whether",
        "dirac",
        "point",
        "particle",
        "treated",
        "genuine",
        "entity",
        "suggestion",
        "dehmelt",
        "model",
        "case",
        "rather",
        "quote",
        "suggests",
        "infinite",
        "regression",
        "nonpoint",
        "particle",
        "asymptotically",
        "approach",
        "ideal",
        "limit",
        "dirac",
        "point",
        "particle",
        "type",
        "mathematical",
        "abstraction",
        "unlike",
        "one",
        "find",
        "case",
        "gunky",
        "space",
        "region",
        "asymptotically",
        "approach",
        "point",
        "see",
        "zimmerman",
        "like",
        "dirac",
        "point",
        "particle",
        "dehmelt",
        "model",
        "point",
        "gunky",
        "space",
        "considered",
        "real",
        "entity",
        "merely",
        "mathematical",
        "abstraction",
        "final",
        "argument",
        "considered",
        "section",
        "challenge",
        "transmission",
        "model",
        "whereby",
        "derivative",
        "entity",
        "derive",
        "fundamental",
        "entity",
        "bohn",
        "make",
        "helpful",
        "observation",
        "aimed",
        "transmission",
        "model",
        "applied",
        "grounding",
        "grounding",
        "like",
        "synchronic",
        "static",
        "mathematical",
        "relation",
        "like",
        "arithmetic",
        "like",
        "diachronic",
        "dynamic",
        "physical",
        "relation",
        "like",
        "thermodynamics",
        "action",
        "theory",
        "thought",
        "transmission",
        "model",
        "illegitimately",
        "assumes",
        "dynamical",
        "starting",
        "point",
        "grounding",
        "chain",
        "abandon",
        "transmission",
        "model",
        "dynamical",
        "view",
        "arrive",
        "idea",
        "indefinitely",
        "descending",
        "ground",
        "whereby",
        "fact",
        "ground",
        "hence",
        "fundamental",
        "fact",
        "bohn",
        "violates",
        "even",
        "weakest",
        "three",
        "requirement",
        "metaphysical",
        "foundationalist",
        "might",
        "impose",
        "strict",
        "denial",
        "mf",
        "note",
        "however",
        "concern",
        "precisification",
        "mf",
        "term",
        "grounding",
        "type",
        "metaphysical",
        "infinitism",
        "target",
        "conception",
        "fundamentality",
        "ungroundedness",
        "specified",
        "term",
        "ri",
        "section",
        "mf",
        "require",
        "transmission",
        "model",
        "choice",
        "foundationalism",
        "infinitism",
        "difficult",
        "perhaps",
        "one",
        "test",
        "case",
        "possibility",
        "gunk",
        "everything",
        "proper",
        "part",
        "junk",
        "everything",
        "proper",
        "part",
        "hunk",
        "everything",
        "proper",
        "part",
        "ongoing",
        "debate",
        "modal",
        "status",
        "scenario",
        "one",
        "might",
        "appeal",
        "possibility",
        "defense",
        "indefinitely",
        "descending",
        "ground",
        "bohn",
        "however",
        "scenario",
        "course",
        "concern",
        "relation",
        "proper",
        "parthood",
        "mereological",
        "dependence",
        "hence",
        "even",
        "mereological",
        "infinitism",
        "coherent",
        "may",
        "notion",
        "dependence",
        "corresponding",
        "notion",
        "infinitism",
        "incoherent",
        "concludes",
        "discussion",
        "metaphysical",
        "infinitism",
        "fundamentality",
        "survey",
        "focused",
        "subset",
        "growing",
        "literature",
        "fundamentality",
        "aim",
        "clarifying",
        "various",
        "terminological",
        "issue",
        "surrounding",
        "key",
        "notion",
        "identifying",
        "common",
        "theme",
        "idea",
        "behind",
        "notion",
        "old",
        "intuition",
        "associated",
        "various",
        "argument",
        "seen",
        "metaphysical",
        "foundationalism",
        "infinitism",
        "recent",
        "helpful",
        "effort",
        "systematize",
        "central",
        "idea",
        "especially",
        "wellfoundedness",
        "made",
        "much",
        "easier",
        "constructive",
        "discussion",
        "topic",
        "fundamentality",
        "expected",
        "attempt",
        "formulate",
        "argument",
        "different",
        "strength",
        "metaphysical",
        "foundationalism",
        "infinitism",
        "emerge",
        "near",
        "future",
        "literature",
        "also",
        "paying",
        "attention",
        "toward",
        "notion",
        "relative",
        "fundamentality",
        "metaphysical",
        "coherentism",
        "finally",
        "increasing",
        "amount",
        "literature",
        "applies",
        "technical",
        "notion",
        "fundamentality",
        "various",
        "debate",
        "metaphysics",
        "eg",
        "morganti",
        "ontic",
        "structural",
        "realism",
        "calosi",
        "morganti",
        "quantum",
        "entanglement",
        "giannotti",
        "b",
        "power",
        "scarpati",
        "haecceitism",
        "tahko",
        "logical",
        "realism",
        "allori",
        "quantum",
        "theory",
        "hamri",
        "causation",
        "rabin",
        "physicalism",
        "debate",
        "spencer",
        "relativity"
    ]
}