{
    "main_text": "Galileo’s Scientific Story\n4. Galileo and the Church\n\nNo account of Galileo’s importance to philosophy can be complete\nif it does not discuss the Galileo Affair—the sequence of\ninteractions with the Church that resulted in Galileo’s\ncondemnation. The end of the affair is simply stated. In late 1632, in\nthe aftermath of the publication of the Dialogue Concerning the\nTwo Chief World Systems, Galileo was ordered to appear in Rome to\nbe examined by the Congregation of the Holy Office; i.e., the\nInquisition. In January 1633, a very ill Galileo made an arduous\njourney to Rome. From April, Galileo was called four times to\nhearings; the last was on June 21. The next day, June 22, 1633,\nGalileo was taken to the church of Santa Maria sopra Minerva, and\nordered to kneel while his condemnation was read. He was declared\nguilty of “vehement suspicion of heresy,” and made to\nrecite and sign a formal abjuration:\n\n\nI have been judged vehemently suspect of heresy, that is, of having\nheld and believed that the sun in the center of the universe and\nimmoveable, and that the Earth is not at the center of same, and that\nit does move. Wishing however, to remove from the minds of your\nEminences and all faithful Christians this vehement suspicion\nreasonably conceived against me, I abjure with a sincere heart and\nunfeigned faith, I curse and detest the said errors and heresies, and\ngenerally all and every error, heresy, and sect contrary to the Holy\nCatholic Church. (Quoted in Shea and Artigas 2003, 194)\n\n\nTradition, but not historical fact, holds that, after abjuring,\nGalileo mumbled, “Eppur si muove (and yet it\nmoves).” He was sentenced to “formal imprisonment at\nthe pleasure of the Inquisition,” but this was commuted to house\narrest, first in the residence of the Archbishop of Siena, and then,\nfrom December 1633, at his villa in Arcetri. When he later finished\nhis last book, the Two New Sciences (which does not mention\nCopernicanism at all), it had to be printed in Holland, and Galileo\nprofessed amazement at how it could have been published.\n\nThe details and interpretations of these proceedings have long been\ndebated, and it seems that each year we learn more about what actually\nhappened. One point of controversy is the legitimacy of the charges\nagainst Galileo, both in terms of their content and the judicial\nprocedure. Galileo was charged with teaching and defending the\nCopernican doctrine that holds the sun is at the center of the\nuniverse and the Earth moves. The status of this doctrine was cloudy.\nIn 1616, an internal commission of the Inquisition had determined that\nit was heretical, but this was not publicly proclaimed. Instead,\nCopernicus’s book had been placed on the Index of Prohibited\nBooks—the list of books Catholics were forbidden to read\nwithout special permission—with the status “suspended\nuntil corrected.” Even more confusingly, the\nrequisite corrections had appeared in 1620, but the book\nnevertheless remained on the Index until 1835. In fact, the\nChurch’s first public pronouncement that Copernicanism\nis a heresy appears in Galileo’s condemnation.\n\nGalileo’s own status was also problematic. In 1616, at the same\ntime that the Inquisition was evaluating Copernicanism, they were also\ninvestigating Galileo personally—a separate proceeding of which\nGalileo himself was not likely aware. The outcome was\nBellarmine’s admonition not to “defend or hold” the\nCopernican doctrine. This “charitable admonition” may (or\nmay not) have been followed by a “formal injunction”\n“not to hold, teach, or defend it in any way whatever, either\norally or in writing.” When the records of this disposition of\nthe 1616 case were discovered in 1633, it made Galileo appear guilty\nof recidivism, having violated the Inquisition’s injunction by\npublishing the Dialogue.\n\nTo confound issues further, the case against Galileo transpired in a\nfraught political context. Galileo was a creature of the powerful\nMedici and a personal friend of Pope Urban VIII, connections that\nsignificantly modulated developments (Biagioli 1993). There were also\npressures stemming from the Counter Reformation, the Thirty Years War,\nand resulting tensions within Urban’s papacy (McMullin 2005;\nMiller 2008). It has even been argued (Redondi 1983), that the charge\nof Copernicanism was the effect of a plea bargain meant to cover up\nGalileo’s genuinely heretical atomism, though this latter\nhypothesis has not found much support.\n\nThe legitimacy of the underlying condemnation of Copernicus on\ntheological and rational grounds is even more problematic. Galileo had\naddressed this problem in 1615, when he wrote his Letter to\nCastelli and then the Letter to the Grand Duchess\nChristina. In these texts, Galileo argues that there are two\ntruths: one derived from Scripture, the other from the created natural\nworld. Since both are expressions of the divine will, they cannot\ncontradict one another. However, Scripture and Creation both require\ninterpretation in order to glean the truths they\ncontain—Scripture because it is a historical document written\nfor common people, and thus accommodated to their understanding so as\nto lead them towards true religion; Creation because the divine act\nmust be distilled from sense experience through scientific enquiry.\nWhile the truths are necessarily compatible, biblical and natural\ninterpretations can go awry, and are subject to correction.\n\nMuch philosophical controversy, before and after Galileo’s time,\nrevolves around this doctrine of the two truths and their seeming\nincompatibility. Which of course, leads us immediately to such\nquestions as: “What is truth?” and “How is truth\nknown or shown?”\n\nCardinal Bellarmine was willing to countenance scientific truth if it\ncould be proven or demonstrated (McMullin 1998). But Bellarmine held\nthat the planetary theories of Ptolemy and Copernicus (and presumably\nTycho Brahe) are only mathematical hypotheses; since they are just\ncalculating devices, they are not susceptible to physical proof. This\nis a sort of instrumentalist, anti-realist position (Machamer 1976;\nDuhem 1985). There are any number of ways to argue for some sort of\ninstrumentalism. Duhem (1985) himself argued that science is not\nmetaphysics, and so only deals with useful conjectures that enable us\nto systematize phenomena. Subtler versions of this position, without\nan Aquinian metaphysical bias, have been argued subsequently and more\nfully by Van Fraassen (1980) and others. Less sweepingly, it can\nreasonably be argued that both Ptolemy and Copernicus’s theories\nwere primarily mathematical, and that Galileo was defending not\nCopernicus’s theory per se, but the physical\nrealization of it. In fact, it might be better to say the Copernican\ntheory that Galileo was constructing was a physical realization of a\nsimplified version of Copernicus’s theory, which dispensed with\nmany of the technical details (eccentrics, epicycles, Tusi couples and\nthe like). Galileo would be led to such a view by his concern with\nmatter theory, which minimized the kinds of motion ascribed uniformly\nto all bodies. Of course, when put this way, we are faced with the\nquestion of what constitutes identity conditions for a theory. Still,\nthere is clearly a way in which Galileo’s Copernicanism is not\nCopernicus’s.\n\nThe other aspect of all this that has been hotly debated is what\nconstitutes proof or demonstration of a scientific claim. Galileo\nbelieved he had a proof of terrestrial motion. This argument\nconcerning the cause of the tides is contained in On the Ebb and\nFlow of the Tides, a manuscript he composed in 1616 while\nCopernicanism was under the Inquisition’s scrutiny, and the main\nthrust of which appears in Day Four of the Dialogue Concerning the\nTwo Chief World Systems.\n\nIn the first place, Galileo restricts the possible class of causes of\nthe tides to mechanical interactions, and so rules out Kepler’s\nattribution of the cause to the moon. How could the moon cause the\ntides to ebb and flow without any connection to the seas? Such an\nexplanation would be an invocation of magic or occult powers. Thus,\nfor Galileo, the only conceivable (or maybe plausible) physical cause\nfor the regular reciprocation of the tides is the combination of the\ndiurnal and annual motions of the Earth. Briefly, as the Earth rotates\naround its axis, some parts of its surface are moving along with the\nannual revolution around the sun and some parts are moving in the\ncontrary direction. (In the same way that a point near the top of a\ncar’s wheel is rotating in the same direction as the car is\nmoving, while a point near the ground is rotating toward the rear.) In\nthe frame of the fixed stars, this creates accelerations and\nretardations of the Earth’s surface, and since the terrestrial\nwaters are not attached to the surface, they slosh back and forth as\ntheir basins speed up and slow down. Hence the tides. Moreover, since\nthe Earth’s diurnal and annual rotations are regular, so are the\ntidal periods. Local differences in tidal flows are due to the\ndifferences in the physical conformations of the basins in which they\noccur (for background and more detail, see Palmieri 1998). Albeit\nmistaken, Galileo’s commitment to mechanically intelligible\ncausation makes this is a plausible argument. One can see why Galileo\nthinks he has some sort of proof for the motion of the Earth, and\ntherefore for Copernicanism. \n\nYet one can also see why Bellarmine and the instrumentalists would not\nhave been impressed. First, they did not accept Galileo’s\nrestriction of possible causes to mechanically intelligible causes.\nSecond, Galileo’s explanation is not precise; it does not\naccount for many details of tidal motion. Most significantly, the\nmotion of the Earth’s surface varies over twelve hours, not the\nsix-hour cycle of the tides. Third, the argument does not touch upon\nthe central position of the sun or arrangement of the planets as\ncalculated by Copernicus. So at best, Galileo’s argument is an\ninference to the best partial explanation from a limited set of\nfeatures of Copernicus’s theory. Meanwhile, there were\ncompelling considerations about the size of celestial bodies that\nweighed against the Copernican cosmology, stemming from a lack of\nunderstanding of the telescope’s optics (Graney 2015).\n\nNevertheless, when the tidal argument is added to the earlier\ntelescopic observations that show the improbabilities of the older\ncelestial picture—the fact that Venus has phases like the moon\nand so must revolve around the sun; the principle of the relativity of\nperceived motion which neutralizes the physical arguments against a\nmoving Earth; and so on—it was enough for Galileo to believe\nthat he had the necessary proof to convince the doubters.\nUnfortunately, it was not until after Galileo’s death and the\nacceptance of a unified material cosmology, utilizing the\npresuppositions about matter and motion that were published in\nthe Two New Sciences, that people were ready for\nsuch proofs. But this could occur only after Galileo had changed the\nacceptable parameters for gaining knowledge and theorizing about the\nworld.\n\nTo read many of the documents of Galileo’s trial, see\nFinocchiaro 1989; Mayer 2012. To understand the long, tortuous, and\nfascinating aftermath of the Galileo affair see Finocchiaro\n2005; and for Pope John Paul II’s 1992 rehabilitation of\nGalileo, see Coyne 2005.\n",
    "section_title": "4. Galileo and the Church",
    "entry_title": "Galileo Galilei",
    "hierarchy_title": "Galileo Galilei || Galileo’s Scientific Story",
    "tokenized_text": [
        "galileo",
        "scientific",
        "story",
        "galileo",
        "church",
        "account",
        "galileo",
        "importance",
        "philosophy",
        "complete",
        "discus",
        "galileo",
        "affairthe",
        "sequence",
        "interaction",
        "church",
        "resulted",
        "galileo",
        "condemnation",
        "end",
        "affair",
        "simply",
        "stated",
        "late",
        "aftermath",
        "publication",
        "dialogue",
        "concerning",
        "two",
        "chief",
        "world",
        "system",
        "galileo",
        "ordered",
        "appear",
        "rome",
        "examined",
        "congregation",
        "holy",
        "office",
        "ie",
        "inquisition",
        "january",
        "ill",
        "galileo",
        "made",
        "arduous",
        "journey",
        "rome",
        "april",
        "galileo",
        "called",
        "four",
        "time",
        "hearing",
        "last",
        "june",
        "next",
        "day",
        "june",
        "galileo",
        "taken",
        "church",
        "santa",
        "maria",
        "sopra",
        "minerva",
        "ordered",
        "kneel",
        "condemnation",
        "read",
        "declared",
        "guilty",
        "vehement",
        "suspicion",
        "heresy",
        "made",
        "recite",
        "sign",
        "formal",
        "abjuration",
        "judged",
        "vehemently",
        "suspect",
        "heresy",
        "held",
        "believed",
        "sun",
        "center",
        "universe",
        "immoveable",
        "earth",
        "center",
        "move",
        "wishing",
        "however",
        "remove",
        "mind",
        "eminence",
        "faithful",
        "christian",
        "vehement",
        "suspicion",
        "reasonably",
        "conceived",
        "abjure",
        "sincere",
        "heart",
        "unfeigned",
        "faith",
        "curse",
        "detest",
        "said",
        "error",
        "heresy",
        "generally",
        "every",
        "error",
        "heresy",
        "sect",
        "contrary",
        "holy",
        "catholic",
        "church",
        "quoted",
        "shea",
        "artigas",
        "tradition",
        "historical",
        "fact",
        "hold",
        "abjuring",
        "galileo",
        "mumbled",
        "eppur",
        "si",
        "muove",
        "yet",
        "move",
        "sentenced",
        "formal",
        "imprisonment",
        "pleasure",
        "inquisition",
        "commuted",
        "house",
        "arrest",
        "first",
        "residence",
        "archbishop",
        "siena",
        "december",
        "villa",
        "arcetri",
        "later",
        "finished",
        "last",
        "book",
        "two",
        "new",
        "science",
        "mention",
        "copernicanism",
        "printed",
        "holland",
        "galileo",
        "professed",
        "amazement",
        "could",
        "published",
        "detail",
        "interpretation",
        "proceeding",
        "long",
        "debated",
        "seems",
        "year",
        "learn",
        "actually",
        "happened",
        "one",
        "point",
        "controversy",
        "legitimacy",
        "charge",
        "galileo",
        "term",
        "content",
        "judicial",
        "procedure",
        "galileo",
        "charged",
        "teaching",
        "defending",
        "copernican",
        "doctrine",
        "hold",
        "sun",
        "center",
        "universe",
        "earth",
        "move",
        "status",
        "doctrine",
        "cloudy",
        "internal",
        "commission",
        "inquisition",
        "determined",
        "heretical",
        "publicly",
        "proclaimed",
        "instead",
        "copernicus",
        "book",
        "placed",
        "index",
        "prohibited",
        "booksthe",
        "list",
        "book",
        "catholic",
        "forbidden",
        "read",
        "without",
        "special",
        "permissionwith",
        "status",
        "suspended",
        "corrected",
        "even",
        "confusingly",
        "requisite",
        "correction",
        "appeared",
        "book",
        "nevertheless",
        "remained",
        "index",
        "fact",
        "church",
        "first",
        "public",
        "pronouncement",
        "copernicanism",
        "heresy",
        "appears",
        "galileo",
        "condemnation",
        "galileo",
        "status",
        "also",
        "problematic",
        "time",
        "inquisition",
        "evaluating",
        "copernicanism",
        "also",
        "investigating",
        "galileo",
        "personallya",
        "separate",
        "proceeding",
        "galileo",
        "likely",
        "aware",
        "outcome",
        "bellarmine",
        "admonition",
        "defend",
        "hold",
        "copernican",
        "doctrine",
        "charitable",
        "admonition",
        "may",
        "may",
        "followed",
        "formal",
        "injunction",
        "hold",
        "teach",
        "defend",
        "way",
        "whatever",
        "either",
        "orally",
        "writing",
        "record",
        "disposition",
        "case",
        "discovered",
        "made",
        "galileo",
        "appear",
        "guilty",
        "recidivism",
        "violated",
        "inquisition",
        "injunction",
        "publishing",
        "dialogue",
        "confound",
        "issue",
        "case",
        "galileo",
        "transpired",
        "fraught",
        "political",
        "context",
        "galileo",
        "creature",
        "powerful",
        "medici",
        "personal",
        "friend",
        "pope",
        "urban",
        "viii",
        "connection",
        "significantly",
        "modulated",
        "development",
        "biagioli",
        "also",
        "pressure",
        "stemming",
        "counter",
        "reformation",
        "thirty",
        "year",
        "war",
        "resulting",
        "tension",
        "within",
        "urban",
        "papacy",
        "mcmullin",
        "miller",
        "even",
        "argued",
        "redondi",
        "charge",
        "copernicanism",
        "effect",
        "plea",
        "bargain",
        "meant",
        "cover",
        "galileo",
        "genuinely",
        "heretical",
        "atomism",
        "though",
        "latter",
        "hypothesis",
        "found",
        "much",
        "support",
        "legitimacy",
        "underlying",
        "condemnation",
        "copernicus",
        "theological",
        "rational",
        "ground",
        "even",
        "problematic",
        "galileo",
        "addressed",
        "problem",
        "wrote",
        "letter",
        "castelli",
        "letter",
        "grand",
        "duchess",
        "christina",
        "text",
        "galileo",
        "argues",
        "two",
        "truth",
        "one",
        "derived",
        "scripture",
        "created",
        "natural",
        "world",
        "since",
        "expression",
        "divine",
        "contradict",
        "one",
        "another",
        "however",
        "scripture",
        "creation",
        "require",
        "interpretation",
        "order",
        "glean",
        "truth",
        "containscripture",
        "historical",
        "document",
        "written",
        "common",
        "people",
        "thus",
        "accommodated",
        "understanding",
        "lead",
        "towards",
        "true",
        "religion",
        "creation",
        "divine",
        "act",
        "must",
        "distilled",
        "sense",
        "experience",
        "scientific",
        "enquiry",
        "truth",
        "necessarily",
        "compatible",
        "biblical",
        "natural",
        "interpretation",
        "go",
        "awry",
        "subject",
        "correction",
        "much",
        "philosophical",
        "controversy",
        "galileo",
        "time",
        "revolves",
        "around",
        "doctrine",
        "two",
        "truth",
        "seeming",
        "incompatibility",
        "course",
        "lead",
        "u",
        "immediately",
        "question",
        "truth",
        "truth",
        "known",
        "shown",
        "cardinal",
        "bellarmine",
        "willing",
        "countenance",
        "scientific",
        "truth",
        "could",
        "proven",
        "demonstrated",
        "mcmullin",
        "bellarmine",
        "held",
        "planetary",
        "theory",
        "ptolemy",
        "copernicus",
        "presumably",
        "tycho",
        "brahe",
        "mathematical",
        "hypothesis",
        "since",
        "calculating",
        "device",
        "susceptible",
        "physical",
        "proof",
        "sort",
        "instrumentalist",
        "antirealist",
        "position",
        "machamer",
        "duhem",
        "number",
        "way",
        "argue",
        "sort",
        "instrumentalism",
        "duhem",
        "argued",
        "science",
        "metaphysics",
        "deal",
        "useful",
        "conjecture",
        "enable",
        "u",
        "systematize",
        "phenomenon",
        "subtler",
        "version",
        "position",
        "without",
        "aquinian",
        "metaphysical",
        "bias",
        "argued",
        "subsequently",
        "fully",
        "van",
        "fraassen",
        "others",
        "le",
        "sweepingly",
        "reasonably",
        "argued",
        "ptolemy",
        "copernicus",
        "theory",
        "primarily",
        "mathematical",
        "galileo",
        "defending",
        "copernicus",
        "theory",
        "per",
        "se",
        "physical",
        "realization",
        "fact",
        "might",
        "better",
        "say",
        "copernican",
        "theory",
        "galileo",
        "constructing",
        "physical",
        "realization",
        "simplified",
        "version",
        "copernicus",
        "theory",
        "dispensed",
        "many",
        "technical",
        "detail",
        "eccentric",
        "epicycle",
        "tusi",
        "couple",
        "like",
        "galileo",
        "would",
        "led",
        "view",
        "concern",
        "matter",
        "theory",
        "minimized",
        "kind",
        "motion",
        "ascribed",
        "uniformly",
        "body",
        "course",
        "put",
        "way",
        "faced",
        "question",
        "constitutes",
        "identity",
        "condition",
        "theory",
        "still",
        "clearly",
        "way",
        "galileo",
        "copernicanism",
        "copernicus",
        "aspect",
        "hotly",
        "debated",
        "constitutes",
        "proof",
        "demonstration",
        "scientific",
        "claim",
        "galileo",
        "believed",
        "proof",
        "terrestrial",
        "motion",
        "argument",
        "concerning",
        "cause",
        "tide",
        "contained",
        "ebb",
        "flow",
        "tide",
        "manuscript",
        "composed",
        "copernicanism",
        "inquisition",
        "scrutiny",
        "main",
        "thrust",
        "appears",
        "day",
        "four",
        "dialogue",
        "concerning",
        "two",
        "chief",
        "world",
        "system",
        "first",
        "place",
        "galileo",
        "restricts",
        "possible",
        "class",
        "cause",
        "tide",
        "mechanical",
        "interaction",
        "rule",
        "kepler",
        "attribution",
        "cause",
        "moon",
        "could",
        "moon",
        "cause",
        "tide",
        "ebb",
        "flow",
        "without",
        "connection",
        "sea",
        "explanation",
        "would",
        "invocation",
        "magic",
        "occult",
        "power",
        "thus",
        "galileo",
        "conceivable",
        "maybe",
        "plausible",
        "physical",
        "cause",
        "regular",
        "reciprocation",
        "tide",
        "combination",
        "diurnal",
        "annual",
        "motion",
        "earth",
        "briefly",
        "earth",
        "rotates",
        "around",
        "axis",
        "part",
        "surface",
        "moving",
        "along",
        "annual",
        "revolution",
        "around",
        "sun",
        "part",
        "moving",
        "contrary",
        "direction",
        "way",
        "point",
        "near",
        "top",
        "car",
        "wheel",
        "rotating",
        "direction",
        "car",
        "moving",
        "point",
        "near",
        "ground",
        "rotating",
        "toward",
        "rear",
        "frame",
        "fixed",
        "star",
        "creates",
        "acceleration",
        "retardation",
        "earth",
        "surface",
        "since",
        "terrestrial",
        "water",
        "attached",
        "surface",
        "slosh",
        "back",
        "forth",
        "basin",
        "speed",
        "slow",
        "hence",
        "tide",
        "moreover",
        "since",
        "earth",
        "diurnal",
        "annual",
        "rotation",
        "regular",
        "tidal",
        "period",
        "local",
        "difference",
        "tidal",
        "flow",
        "due",
        "difference",
        "physical",
        "conformation",
        "basin",
        "occur",
        "background",
        "detail",
        "see",
        "palmieri",
        "albeit",
        "mistaken",
        "galileo",
        "commitment",
        "mechanically",
        "intelligible",
        "causation",
        "make",
        "plausible",
        "argument",
        "one",
        "see",
        "galileo",
        "think",
        "sort",
        "proof",
        "motion",
        "earth",
        "therefore",
        "copernicanism",
        "yet",
        "one",
        "also",
        "see",
        "bellarmine",
        "instrumentalist",
        "would",
        "impressed",
        "first",
        "accept",
        "galileo",
        "restriction",
        "possible",
        "cause",
        "mechanically",
        "intelligible",
        "cause",
        "second",
        "galileo",
        "explanation",
        "precise",
        "account",
        "many",
        "detail",
        "tidal",
        "motion",
        "significantly",
        "motion",
        "earth",
        "surface",
        "varies",
        "twelve",
        "hour",
        "sixhour",
        "cycle",
        "tide",
        "third",
        "argument",
        "touch",
        "upon",
        "central",
        "position",
        "sun",
        "arrangement",
        "planet",
        "calculated",
        "copernicus",
        "best",
        "galileo",
        "argument",
        "inference",
        "best",
        "partial",
        "explanation",
        "limited",
        "set",
        "feature",
        "copernicus",
        "theory",
        "meanwhile",
        "compelling",
        "consideration",
        "size",
        "celestial",
        "body",
        "weighed",
        "copernican",
        "cosmology",
        "stemming",
        "lack",
        "understanding",
        "telescope",
        "optic",
        "graney",
        "nevertheless",
        "tidal",
        "argument",
        "added",
        "earlier",
        "telescopic",
        "observation",
        "show",
        "improbability",
        "older",
        "celestial",
        "picturethe",
        "fact",
        "venus",
        "phase",
        "like",
        "moon",
        "must",
        "revolve",
        "around",
        "sun",
        "principle",
        "relativity",
        "perceived",
        "motion",
        "neutralizes",
        "physical",
        "argument",
        "moving",
        "earth",
        "onit",
        "enough",
        "galileo",
        "believe",
        "necessary",
        "proof",
        "convince",
        "doubter",
        "unfortunately",
        "galileo",
        "death",
        "acceptance",
        "unified",
        "material",
        "cosmology",
        "utilizing",
        "presupposition",
        "matter",
        "motion",
        "published",
        "two",
        "new",
        "science",
        "people",
        "ready",
        "proof",
        "could",
        "occur",
        "galileo",
        "changed",
        "acceptable",
        "parameter",
        "gaining",
        "knowledge",
        "theorizing",
        "world",
        "read",
        "many",
        "document",
        "galileo",
        "trial",
        "see",
        "finocchiaro",
        "mayer",
        "understand",
        "long",
        "tortuous",
        "fascinating",
        "aftermath",
        "galileo",
        "affair",
        "see",
        "finocchiaro",
        "pope",
        "john",
        "paul",
        "ii",
        "rehabilitation",
        "galileo",
        "see",
        "coyne"
    ]
}