{
    "main_text": "Basic Elements and Assumptions of Game Theory || The Prisoner’s Dilemma as an Example of Strategic-Form vs. Extensive-Form Representation\n2.4 The Prisoner’s Dilemma as an Example of Strategic-Form vs. Extensive-Form Representation\n\nThe distinctions described above are difficult to fully grasp if all\none has to go on are abstract descriptions. They’re best\nillustrated by means of an example. For this purpose, we’ll use\nthe most famous of all games: the Prisoner’s Dilemma. It in fact\ngives the logic of the problem faced by Cortez’s and Henry\nV’s soldiers (see\n Section 1 above),\n and by Hobbes’s agents before they empower the tyrant. However,\nfor reasons which will become clear a bit later, you should not take\nthe PD as a typical game; it isn’t. We use it as an\nextended example here only because it’s particularly helpful for\nillustrating the relationship between strategic-form and\nextensive-form games (and later, for illustrating the relationships\nbetween one-shot and repeated games; see\n Section 4\n below). \n\nThe name of the Prisoner’s Dilemma game is derived from the\nfollowing situation typically used to exemplify it. Suppose that the\npolice have arrested two people whom they know have committed an armed\nrobbery together. Unfortunately, they lack enough admissible evidence\nto get a jury to convict. They do, however, have enough\nevidence to send each prisoner away for two years for theft of the\ngetaway car. The chief inspector now makes the following offer to each\nprisoner: If you will confess to the robbery, implicating your\npartner, and she does not also confess, then you’ll go free and\nshe’ll get ten years. If you both confess, you’ll each get\n5 years. If neither of you confess, then you’ll each get two\nyears for the auto theft.\n\nOur first step in modeling the two prisoners’ situation as a\ngame is to represent it in terms of utility functions. Following the\nusual convention, let us name the prisoners ‘Player I’ and\n‘Player II’. Both Player I’s and Player II’s\nordinal utility functions are identical: \n\\[\\begin{align}\n\\text{Go free } &\\gg 4 \\\\\n2 \\text{ years } &\\gg 3 \\\\\n5 \\text{ years } &\\gg 2 \\\\\n10 \\text{ years } &\\gg 0\n\\end{align}\\]\n\n\nThe numbers in the function above are now used to express each\nplayer’s payoffs in the various outcomes possible in\nthe situation. We can represent the problem faced by both of them on a\nsingle matrix that captures the way in which their separate choices\ninteract; this is the strategic form of their game:\n\n\n\n\nPlayer II\n\nConfess\nRefuse\n\nPlayer I\nConfess\n2,2\n4,0\n\nRefuse\n0,4\n3,3 \n\n\nFigure 3\n\n\nEach cell of the matrix gives the payoffs to both players for each\ncombination of actions. Player I’s payoff appears as the first\nnumber of each pair, Player II’s as the second. So, if both\nplayers confess then they each get a payoff of 2 (5 years in prison\neach). This appears in the upper-left cell. If neither of them\nconfess, they each get a payoff of 3 (2 years in prison each). This\nappears as the lower-right cell. If Player I confesses and Player II\ndoesn’t then Player I gets a payoff of 4 (going free) and Player\nII gets a payoff of 0 (ten years in prison). This appears in the\nupper-right cell. The reverse situation, in which Player II confesses\nand Player I refuses, appears in the lower-left cell.\n\nEach player evaluates his or her two possible actions here by\ncomparing their personal payoffs in each column, since this shows you\nwhich of their actions is preferable, just to themselves, for each\npossible action by their partner. So, observe: If Player II confesses\nthen Player I gets a payoff of 2 by confessing and a payoff of 0 by\nrefusing. If Player II refuses, then Player I gets a payoff of 4 by\nconfessing and a payoff of 3 by refusing. Therefore, Player I is\nbetter off confessing regardless of what Player II does. Player II,\nmeanwhile, evaluates her actions by comparing her payoffs down each\nrow, and she comes to exactly the same conclusion that Player I does.\nWherever one action for a player is superior to her other actions for\neach possible action by the opponent, we say that the first action\nstrictly dominates the second one. In the PD, then,\nconfessing strictly dominates refusing for both players. Both players\nknow this about each other, thus entirely eliminating any temptation\nto depart from the strictly dominated path. Thus both players will\nconfess, and both will go to prison for 5 years.\n\nThe players, and analysts, can predict this outcome using a mechanical\nprocedure, known as iterated elimination of strictly dominated\nstrategies. Player 1 can see by examining the matrix that his payoffs\nin each cell of the top row are higher than his payoffs in each\ncorresponding cell of the bottom row. Therefore, it can never be\nutility-maximizing for him to play his bottom-row strategy, viz.,\nrefusing to confess, regardless of what Player II does. Since\nPlayer I’s bottom-row strategy will never be played, we can\nsimply delete the bottom row from the matrix. Now it is\nobvious that Player II will not refuse to confess, since her payoff\nfrom confessing in the two cells that remain is higher than her payoff\nfrom refusing. So, once again, we can delete the one-cell column on\nthe right from the game. We now have only one cell remaining, that\ncorresponding to the outcome brought about by mutual confession. Since\nthe reasoning that led us to delete all other possible outcomes\ndepended at each step only on the premise that both players are\neconomically rational—that is, will choose strategies that lead\nto higher payoffs over strategies that lead to lower ones—there\nare strong grounds for viewing joint confession as the\nsolution to the game, the outcome on which its play\nmust converge to the extent that economic rationality\ncorrectly models the behavior of the players. You should note that the\norder in which strictly dominated rows and columns are deleted\ndoesn’t matter. Had we begun by deleting the right-hand column\nand then deleted the bottom row, we would have arrived at the same\nsolution.\n\nIt’s been said a couple of times that the PD is not a typical\ngame in many respects. One of these respects is that all its rows and\ncolumns are either strictly dominated or strictly dominant. In any\nstrategic-form game where this is true, iterated elimination of\nstrictly dominated strategies is guaranteed to yield a unique\nsolution. Later, however, we will see that for many games this\ncondition does not apply, and then our analytic task is less\nstraightforward.\n\nThe reader will probably have noticed something disturbing about the\noutcome of the PD. Had both players refused to confess, they’d\nhave arrived at the lower-right outcome in which they each go to\nprison for only 2 years, thereby both earning higher utility\nthan either receives when both confess. This is the most important\nfact about the PD, and its significance for game theory is quite\ngeneral. We’ll therefore return to it below when we discuss\nequilibrium concepts in game theory. For now, however, let us stay\nwith our use of this particular game to illustrate the difference\nbetween strategic and extensive forms.\n\nWhen people introduce the PD into popular discussions, one will often\nhear them say that the police inspector must lock his prisoners into\nseparate rooms so that they can’t communicate with one another.\nThe reasoning behind this idea seems obvious: if the players could\ncommunicate, they’d surely see that they’re each better\noff if both refuse, and could make an agreement to do so, no? This,\none presumes, would remove each player’s conviction that he or\nshe must confess because they’ll otherwise be sold up the river\nby their partner. In fact, however, this intuition is misleading and\nits conclusion is false.\n\nWhen we represent the PD as a strategic-form game, we implicitly\nassume that the prisoners can’t attempt collusive agreement\nsince they choose their actions simultaneously. In this case,\nagreement before the fact can’t help. If Player I is convinced\nthat his partner will stick to the bargain then he can seize the\nopportunity to go scot-free by confessing. Of course, he realizes that\nthe same temptation will occur to Player II; but in that case he again\nwants to make sure he confesses, as this is his only means of avoiding\nhis worst outcome. The prisoners’ agreement comes to naught\nbecause they have no way of enforcing it; their promises to each other\nconstitute what game theorists call ‘cheap talk’.\n\nBut now suppose that the prisoners do not move\nsimultaneously. That is, suppose that Player II can choose\nafter observing Player I’s action. This is the sort of\nsituation that people who think non-communication important must have\nin mind. Now Player II will be able to see that Player I has remained\nsteadfast when it comes to her choice, and she need not be concerned\nabout being suckered. However, this doesn’t change anything, a\npoint that is best made by re-representing the game in extensive form.\nThis gives us our opportunity to introduce game-trees and the method\nof analysis appropriate to them.\n\nFirst, however, here are definitions of some concepts that will be\nhelpful in analyzing game-trees:\n\nNode: a point at which a player chooses an action.\n\n\nInitial node: the point at which the first action in the game\noccurs.\n\nTerminal node: any node which, if reached, ends the game.\nEach terminal node corresponds to an outcome.\n\nSubgame: any connected set of nodes and branches descending\nuniquely from one node.\n\nPayoff: an ordinal utility number assigned to a player at an\noutcome.\n\nOutcome: an assignment of a set of payoffs, one to each\nplayer in the game.\n\nStrategy: a program instructing a player which action to take\nat every node in the tree where she could possibly be called on to\nmake a choice.\n\n\nThese quick definitions may not mean very much to you until you follow\nthem being put to use in our analyses of trees below. It will probably\nbe best if you scroll back and forth between them and the examples as\nwe work through them. By the time you understand each example,\nyou’ll find the concepts and their definitions natural and\nintuitive. \n\nTo make this exercise maximally instructive, let’s suppose that\nPlayers I and II have studied the matrix above and, seeing that\nthey’re both better off in the outcome represented by the\nlower-right cell, have formed an agreement to cooperate. Player I is\nto commit to refusal first, after which Player II will reciprocate\nwhen the police ask for her choice. We will refer to a strategy of\nkeeping the agreement as ‘cooperation’, and will denote it\nin the tree below with ‘C’. We will refer to a strategy of\nbreaking the agreement as ‘defection’, and will denote it\non the tree below with ‘D’. Each node is numbered 1, 2, 3,\n… , from top to bottom, for ease of reference in discussion.\nHere, then, is the tree:\n\n\n\nFigure 4\n\n\nLook first at each of the terminal nodes (those along the bottom).\nThese represent possible outcomes. Each is identified with an\nassignment of payoffs, just as in the strategic-form game, with Player\nI’s payoff appearing first in each set and Player II’s\nappearing second. Each of the structures descending from the nodes 1,\n2 and 3 respectively is a subgame. We begin our backward-induction\nanalysis—using a technique called Zermelo’s\nalgorithm—with the sub-games that arise last in the\nsequence of play. If the subgame descending from node 3 is played,\nthen Player II will face a choice between a payoff of 4 and a payoff\nof 3. (Consult the second number, representing her payoff, in each set\nat a terminal node descending from node 3.) II earns her higher payoff\nby playing D. We may therefore replace the entire subgame with an\nassignment of the payoff (0,4) directly to node 3, since this is the\noutcome that will be realized if the game reaches that node. Now\nconsider the subgame descending from node 2. Here, II faces a choice\nbetween a payoff of 2 and one of 0. She obtains her higher payoff, 2,\nby playing D. We may therefore assign the payoff (2,2) directly to\nnode 2. Now we move to the subgame descending from node 1. (This\nsubgame is, of course, identical to the whole game; all games are\nsubgames of themselves.) Player I now faces a choice between outcomes\n(2,2) and (0,4). Consulting the first numbers in each of these sets,\nhe sees that he gets his higher payoff—2—by playing D. D\nis, of course, the option of confessing. So Player I confesses, and\nthen Player II also confesses, yielding the same outcome as in the\nstrategic-form representation.\n\nWhat has happened here intuitively is that Player I realizes that if\nhe plays C (refuse to confess) at node 1, then Player II will be able\nto maximize her utility by suckering him and playing D. (On the tree,\nthis happens at node 3.) This leaves Player I with a payoff of 0 (ten\nyears in prison), which he can avoid only by playing D to begin with.\nHe therefore defects from the agreement.\n\nWe have thus seen that in the case of the Prisoner’s Dilemma,\nthe simultaneous and sequential versions yield the same outcome. This\nwill often not be true of other games, however. Furthermore, only\nfinite extensive-form (sequential) games of perfect information can be\nsolved using Zermelo’s algorithm.\n\nAs noted earlier in this section, sometimes we must represent\nsimultaneous moves within games that are otherwise\nsequential. (In all such cases the game as a whole will be one of\nimperfect information, so we won’t be able to solve it using\nZermelo’s algorithm.) We represent such games using the device\nof information sets. Consider the following tree:\n\n\n\nFigure 5\n\n\nThe oval drawn around nodes \\(b\\) and \\(c\\) indicates that they lie\nwithin a common information set. This means that at these nodes\nplayers cannot infer back up the path from whence they came; Player II\ndoes not know, in choosing her strategy, whether she is at \\(b\\) or\n\\(c\\). (For this reason, what properly bear numbers in extensive-form\ngames are information sets, conceived as ‘action points’,\nrather than nodes themselves; this is why the nodes inside the oval\nare labelled with letters rather than numbers.) Put another way,\nPlayer II, when choosing, does not know what Player I has done at node\n\\(a\\). But you will recall from earlier in this section that this is\njust what defines two moves as simultaneous. We can thus see that the\nmethod of representing games as trees is entirely general. If no node\nafter the initial node is alone in an information set on its tree, so\nthat the game has only one subgame (itself), then the whole game is\none of simultaneous play. If at least one node shares its information\nset with another, while others are alone, the game involves both\nsimultaneous and sequential play, and so is still a game of imperfect\ninformation. Only if all information sets are inhabited by just one\nnode do we have a game of perfect information.\n",
    "section_title": "2.4 The Prisoner’s Dilemma as an Example of Strategic-Form vs. Extensive-Form Representation",
    "entry_title": "Game Theory",
    "hierarchy_title": "Game Theory || Basic Elements and Assumptions of Game Theory || The Prisoner’s Dilemma as an Example of Strategic-Form vs. Extensive-Form Representation",
    "tokenized_text": [
        "basic",
        "element",
        "assumption",
        "game",
        "theory",
        "prisoner",
        "dilemma",
        "example",
        "strategicform",
        "vs",
        "extensiveform",
        "representation",
        "prisoner",
        "dilemma",
        "example",
        "strategicform",
        "vs",
        "extensiveform",
        "representation",
        "distinction",
        "described",
        "difficult",
        "fully",
        "grasp",
        "one",
        "go",
        "abstract",
        "description",
        "best",
        "illustrated",
        "mean",
        "example",
        "purpose",
        "use",
        "famous",
        "game",
        "prisoner",
        "dilemma",
        "fact",
        "give",
        "logic",
        "problem",
        "faced",
        "cortez",
        "henry",
        "v",
        "soldier",
        "see",
        "section",
        "hobbes",
        "agent",
        "empower",
        "tyrant",
        "however",
        "reason",
        "become",
        "clear",
        "bit",
        "later",
        "take",
        "pd",
        "typical",
        "game",
        "use",
        "extended",
        "example",
        "particularly",
        "helpful",
        "illustrating",
        "relationship",
        "strategicform",
        "extensiveform",
        "game",
        "later",
        "illustrating",
        "relationship",
        "oneshot",
        "repeated",
        "game",
        "see",
        "section",
        "name",
        "prisoner",
        "dilemma",
        "game",
        "derived",
        "following",
        "situation",
        "typically",
        "used",
        "exemplify",
        "suppose",
        "police",
        "arrested",
        "two",
        "people",
        "know",
        "committed",
        "armed",
        "robbery",
        "together",
        "unfortunately",
        "lack",
        "enough",
        "admissible",
        "evidence",
        "get",
        "jury",
        "convict",
        "however",
        "enough",
        "evidence",
        "send",
        "prisoner",
        "away",
        "two",
        "year",
        "theft",
        "getaway",
        "car",
        "chief",
        "inspector",
        "make",
        "following",
        "offer",
        "prisoner",
        "confess",
        "robbery",
        "implicating",
        "partner",
        "also",
        "confess",
        "go",
        "free",
        "get",
        "ten",
        "year",
        "confess",
        "get",
        "year",
        "neither",
        "confess",
        "get",
        "two",
        "year",
        "auto",
        "theft",
        "first",
        "step",
        "modeling",
        "two",
        "prisoner",
        "situation",
        "game",
        "represent",
        "term",
        "utility",
        "function",
        "following",
        "usual",
        "convention",
        "let",
        "u",
        "name",
        "prisoner",
        "player",
        "player",
        "ii",
        "player",
        "player",
        "ii",
        "ordinal",
        "utility",
        "function",
        "identical",
        "begin",
        "align",
        "text",
        "go",
        "free",
        "gg",
        "text",
        "year",
        "gg",
        "text",
        "year",
        "gg",
        "text",
        "year",
        "gg",
        "end",
        "align",
        "number",
        "function",
        "used",
        "express",
        "player",
        "payoff",
        "various",
        "outcome",
        "possible",
        "situation",
        "represent",
        "problem",
        "faced",
        "single",
        "matrix",
        "capture",
        "way",
        "separate",
        "choice",
        "interact",
        "strategic",
        "form",
        "game",
        "player",
        "ii",
        "confess",
        "refuse",
        "player",
        "confess",
        "refuse",
        "figure",
        "cell",
        "matrix",
        "give",
        "payoff",
        "player",
        "combination",
        "action",
        "player",
        "payoff",
        "appears",
        "first",
        "number",
        "pair",
        "player",
        "ii",
        "second",
        "player",
        "confess",
        "get",
        "payoff",
        "year",
        "prison",
        "appears",
        "upperleft",
        "cell",
        "neither",
        "confess",
        "get",
        "payoff",
        "year",
        "prison",
        "appears",
        "lowerright",
        "cell",
        "player",
        "confesses",
        "player",
        "ii",
        "player",
        "get",
        "payoff",
        "going",
        "free",
        "player",
        "ii",
        "get",
        "payoff",
        "ten",
        "year",
        "prison",
        "appears",
        "upperright",
        "cell",
        "reverse",
        "situation",
        "player",
        "ii",
        "confesses",
        "player",
        "refuse",
        "appears",
        "lowerleft",
        "cell",
        "player",
        "evaluates",
        "two",
        "possible",
        "action",
        "comparing",
        "personal",
        "payoff",
        "column",
        "since",
        "show",
        "action",
        "preferable",
        "possible",
        "action",
        "partner",
        "observe",
        "player",
        "ii",
        "confesses",
        "player",
        "get",
        "payoff",
        "confessing",
        "payoff",
        "refusing",
        "player",
        "ii",
        "refuse",
        "player",
        "get",
        "payoff",
        "confessing",
        "payoff",
        "refusing",
        "therefore",
        "player",
        "better",
        "confessing",
        "regardless",
        "player",
        "ii",
        "player",
        "ii",
        "meanwhile",
        "evaluates",
        "action",
        "comparing",
        "payoff",
        "row",
        "come",
        "exactly",
        "conclusion",
        "player",
        "wherever",
        "one",
        "action",
        "player",
        "superior",
        "action",
        "possible",
        "action",
        "opponent",
        "say",
        "first",
        "action",
        "strictly",
        "dominates",
        "second",
        "one",
        "pd",
        "confessing",
        "strictly",
        "dominates",
        "refusing",
        "player",
        "player",
        "know",
        "thus",
        "entirely",
        "eliminating",
        "temptation",
        "depart",
        "strictly",
        "dominated",
        "path",
        "thus",
        "player",
        "confess",
        "go",
        "prison",
        "year",
        "player",
        "analyst",
        "predict",
        "outcome",
        "using",
        "mechanical",
        "procedure",
        "known",
        "iterated",
        "elimination",
        "strictly",
        "dominated",
        "strategy",
        "player",
        "see",
        "examining",
        "matrix",
        "payoff",
        "cell",
        "top",
        "row",
        "higher",
        "payoff",
        "corresponding",
        "cell",
        "bottom",
        "row",
        "therefore",
        "never",
        "utilitymaximizing",
        "play",
        "bottomrow",
        "strategy",
        "viz",
        "refusing",
        "confess",
        "regardless",
        "player",
        "ii",
        "since",
        "player",
        "bottomrow",
        "strategy",
        "never",
        "played",
        "simply",
        "delete",
        "bottom",
        "row",
        "matrix",
        "obvious",
        "player",
        "ii",
        "refuse",
        "confess",
        "since",
        "payoff",
        "confessing",
        "two",
        "cell",
        "remain",
        "higher",
        "payoff",
        "refusing",
        "delete",
        "onecell",
        "column",
        "right",
        "game",
        "one",
        "cell",
        "remaining",
        "corresponding",
        "outcome",
        "brought",
        "mutual",
        "confession",
        "since",
        "reasoning",
        "led",
        "u",
        "delete",
        "possible",
        "outcome",
        "depended",
        "step",
        "premise",
        "player",
        "economically",
        "rationalthat",
        "choose",
        "strategy",
        "lead",
        "higher",
        "payoff",
        "strategy",
        "lead",
        "lower",
        "onesthere",
        "strong",
        "ground",
        "viewing",
        "joint",
        "confession",
        "solution",
        "game",
        "outcome",
        "play",
        "must",
        "converge",
        "extent",
        "economic",
        "rationality",
        "correctly",
        "model",
        "behavior",
        "player",
        "note",
        "order",
        "strictly",
        "dominated",
        "row",
        "column",
        "deleted",
        "matter",
        "begun",
        "deleting",
        "righthand",
        "column",
        "deleted",
        "bottom",
        "row",
        "would",
        "arrived",
        "solution",
        "said",
        "couple",
        "time",
        "pd",
        "typical",
        "game",
        "many",
        "respect",
        "one",
        "respect",
        "row",
        "column",
        "either",
        "strictly",
        "dominated",
        "strictly",
        "dominant",
        "strategicform",
        "game",
        "true",
        "iterated",
        "elimination",
        "strictly",
        "dominated",
        "strategy",
        "guaranteed",
        "yield",
        "unique",
        "solution",
        "later",
        "however",
        "see",
        "many",
        "game",
        "condition",
        "apply",
        "analytic",
        "task",
        "le",
        "straightforward",
        "reader",
        "probably",
        "noticed",
        "something",
        "disturbing",
        "outcome",
        "pd",
        "player",
        "refused",
        "confess",
        "arrived",
        "lowerright",
        "outcome",
        "go",
        "prison",
        "year",
        "thereby",
        "earning",
        "higher",
        "utility",
        "either",
        "receives",
        "confess",
        "important",
        "fact",
        "pd",
        "significance",
        "game",
        "theory",
        "quite",
        "general",
        "therefore",
        "return",
        "discus",
        "equilibrium",
        "concept",
        "game",
        "theory",
        "however",
        "let",
        "u",
        "stay",
        "use",
        "particular",
        "game",
        "illustrate",
        "difference",
        "strategic",
        "extensive",
        "form",
        "people",
        "introduce",
        "pd",
        "popular",
        "discussion",
        "one",
        "often",
        "hear",
        "say",
        "police",
        "inspector",
        "must",
        "lock",
        "prisoner",
        "separate",
        "room",
        "communicate",
        "one",
        "another",
        "reasoning",
        "behind",
        "idea",
        "seems",
        "obvious",
        "player",
        "could",
        "communicate",
        "surely",
        "see",
        "better",
        "refuse",
        "could",
        "make",
        "agreement",
        "one",
        "presumes",
        "would",
        "remove",
        "player",
        "conviction",
        "must",
        "confess",
        "otherwise",
        "sold",
        "river",
        "partner",
        "fact",
        "however",
        "intuition",
        "misleading",
        "conclusion",
        "false",
        "represent",
        "pd",
        "strategicform",
        "game",
        "implicitly",
        "assume",
        "prisoner",
        "attempt",
        "collusive",
        "agreement",
        "since",
        "choose",
        "action",
        "simultaneously",
        "case",
        "agreement",
        "fact",
        "help",
        "player",
        "convinced",
        "partner",
        "stick",
        "bargain",
        "seize",
        "opportunity",
        "go",
        "scotfree",
        "confessing",
        "course",
        "realizes",
        "temptation",
        "occur",
        "player",
        "ii",
        "case",
        "want",
        "make",
        "sure",
        "confesses",
        "mean",
        "avoiding",
        "worst",
        "outcome",
        "prisoner",
        "agreement",
        "come",
        "naught",
        "way",
        "enforcing",
        "promise",
        "constitute",
        "game",
        "theorist",
        "call",
        "cheap",
        "talk",
        "suppose",
        "prisoner",
        "move",
        "simultaneously",
        "suppose",
        "player",
        "ii",
        "choose",
        "observing",
        "player",
        "action",
        "sort",
        "situation",
        "people",
        "think",
        "noncommunication",
        "important",
        "must",
        "mind",
        "player",
        "ii",
        "able",
        "see",
        "player",
        "remained",
        "steadfast",
        "come",
        "choice",
        "need",
        "concerned",
        "suckered",
        "however",
        "change",
        "anything",
        "point",
        "best",
        "made",
        "rerepresenting",
        "game",
        "extensive",
        "form",
        "give",
        "u",
        "opportunity",
        "introduce",
        "gametrees",
        "method",
        "analysis",
        "appropriate",
        "first",
        "however",
        "definition",
        "concept",
        "helpful",
        "analyzing",
        "gametrees",
        "node",
        "point",
        "player",
        "chooses",
        "action",
        "initial",
        "node",
        "point",
        "first",
        "action",
        "game",
        "occurs",
        "terminal",
        "node",
        "node",
        "reached",
        "end",
        "game",
        "terminal",
        "node",
        "corresponds",
        "outcome",
        "subgame",
        "connected",
        "set",
        "node",
        "branch",
        "descending",
        "uniquely",
        "one",
        "node",
        "payoff",
        "ordinal",
        "utility",
        "number",
        "assigned",
        "player",
        "outcome",
        "outcome",
        "assignment",
        "set",
        "payoff",
        "one",
        "player",
        "game",
        "strategy",
        "program",
        "instructing",
        "player",
        "action",
        "take",
        "every",
        "node",
        "tree",
        "could",
        "possibly",
        "called",
        "make",
        "choice",
        "quick",
        "definition",
        "may",
        "mean",
        "much",
        "follow",
        "put",
        "use",
        "analysis",
        "tree",
        "probably",
        "best",
        "scroll",
        "back",
        "forth",
        "example",
        "work",
        "time",
        "understand",
        "example",
        "find",
        "concept",
        "definition",
        "natural",
        "intuitive",
        "make",
        "exercise",
        "maximally",
        "instructive",
        "let",
        "suppose",
        "player",
        "ii",
        "studied",
        "matrix",
        "seeing",
        "better",
        "outcome",
        "represented",
        "lowerright",
        "cell",
        "formed",
        "agreement",
        "cooperate",
        "player",
        "commit",
        "refusal",
        "first",
        "player",
        "ii",
        "reciprocate",
        "police",
        "ask",
        "choice",
        "refer",
        "strategy",
        "keeping",
        "agreement",
        "cooperation",
        "denote",
        "tree",
        "c",
        "refer",
        "strategy",
        "breaking",
        "agreement",
        "defection",
        "denote",
        "tree",
        "node",
        "numbered",
        "top",
        "bottom",
        "ease",
        "reference",
        "discussion",
        "tree",
        "figure",
        "look",
        "first",
        "terminal",
        "node",
        "along",
        "bottom",
        "represent",
        "possible",
        "outcome",
        "identified",
        "assignment",
        "payoff",
        "strategicform",
        "game",
        "player",
        "payoff",
        "appearing",
        "first",
        "set",
        "player",
        "ii",
        "appearing",
        "second",
        "structure",
        "descending",
        "node",
        "respectively",
        "subgame",
        "begin",
        "backwardinduction",
        "analysisusing",
        "technique",
        "called",
        "zermelo",
        "algorithmwith",
        "subgames",
        "arise",
        "last",
        "sequence",
        "play",
        "subgame",
        "descending",
        "node",
        "played",
        "player",
        "ii",
        "face",
        "choice",
        "payoff",
        "payoff",
        "consult",
        "second",
        "number",
        "representing",
        "payoff",
        "set",
        "terminal",
        "node",
        "descending",
        "node",
        "ii",
        "earns",
        "higher",
        "payoff",
        "playing",
        "d",
        "may",
        "therefore",
        "replace",
        "entire",
        "subgame",
        "assignment",
        "payoff",
        "directly",
        "node",
        "since",
        "outcome",
        "realized",
        "game",
        "reach",
        "node",
        "consider",
        "subgame",
        "descending",
        "node",
        "ii",
        "face",
        "choice",
        "payoff",
        "one",
        "obtains",
        "higher",
        "payoff",
        "playing",
        "d",
        "may",
        "therefore",
        "assign",
        "payoff",
        "directly",
        "node",
        "move",
        "subgame",
        "descending",
        "node",
        "subgame",
        "course",
        "identical",
        "whole",
        "game",
        "game",
        "subgames",
        "player",
        "face",
        "choice",
        "outcome",
        "consulting",
        "first",
        "number",
        "set",
        "see",
        "get",
        "higher",
        "payoffby",
        "playing",
        "d",
        "course",
        "option",
        "confessing",
        "player",
        "confesses",
        "player",
        "ii",
        "also",
        "confesses",
        "yielding",
        "outcome",
        "strategicform",
        "representation",
        "happened",
        "intuitively",
        "player",
        "realizes",
        "play",
        "c",
        "refuse",
        "confess",
        "node",
        "player",
        "ii",
        "able",
        "maximize",
        "utility",
        "suckering",
        "playing",
        "d",
        "tree",
        "happens",
        "node",
        "leaf",
        "player",
        "payoff",
        "ten",
        "year",
        "prison",
        "avoid",
        "playing",
        "begin",
        "therefore",
        "defect",
        "agreement",
        "thus",
        "seen",
        "case",
        "prisoner",
        "dilemma",
        "simultaneous",
        "sequential",
        "version",
        "yield",
        "outcome",
        "often",
        "true",
        "game",
        "however",
        "furthermore",
        "finite",
        "extensiveform",
        "sequential",
        "game",
        "perfect",
        "information",
        "solved",
        "using",
        "zermelo",
        "algorithm",
        "noted",
        "earlier",
        "section",
        "sometimes",
        "must",
        "represent",
        "simultaneous",
        "move",
        "within",
        "game",
        "otherwise",
        "sequential",
        "case",
        "game",
        "whole",
        "one",
        "imperfect",
        "information",
        "able",
        "solve",
        "using",
        "zermelo",
        "algorithm",
        "represent",
        "game",
        "using",
        "device",
        "information",
        "set",
        "consider",
        "following",
        "tree",
        "figure",
        "oval",
        "drawn",
        "around",
        "node",
        "b",
        "c",
        "indicates",
        "lie",
        "within",
        "common",
        "information",
        "set",
        "mean",
        "node",
        "player",
        "infer",
        "back",
        "path",
        "whence",
        "came",
        "player",
        "ii",
        "know",
        "choosing",
        "strategy",
        "whether",
        "b",
        "c",
        "reason",
        "properly",
        "bear",
        "number",
        "extensiveform",
        "game",
        "information",
        "set",
        "conceived",
        "action",
        "point",
        "rather",
        "node",
        "node",
        "inside",
        "oval",
        "labelled",
        "letter",
        "rather",
        "number",
        "put",
        "another",
        "way",
        "player",
        "ii",
        "choosing",
        "know",
        "player",
        "done",
        "node",
        "a",
        "recall",
        "earlier",
        "section",
        "defines",
        "two",
        "move",
        "simultaneous",
        "thus",
        "see",
        "method",
        "representing",
        "game",
        "tree",
        "entirely",
        "general",
        "node",
        "initial",
        "node",
        "alone",
        "information",
        "set",
        "tree",
        "game",
        "one",
        "subgame",
        "whole",
        "game",
        "one",
        "simultaneous",
        "play",
        "least",
        "one",
        "node",
        "share",
        "information",
        "set",
        "another",
        "others",
        "alone",
        "game",
        "involves",
        "simultaneous",
        "sequential",
        "play",
        "still",
        "game",
        "imperfect",
        "information",
        "information",
        "set",
        "inhabited",
        "one",
        "node",
        "game",
        "perfect",
        "information"
    ]
}