{
    "main_text": "Inference || Three philosophic inferences\n5.4 Three philosophic inferences\n\nGańgeśa advances three contentious inferences in his\ninference chapter, two of them—a theistic inference and one\nabout the possibility of “liberation,”\nmukti—defended at considerable length (all three are\nreconstructed and examined in Phillips 2012: 65–71). As much as\nsupporting longstanding positions of Nyāya on (a)\n“self,” ātman, (b) “Lord,”\nīśvara, and (c) mukti, his treatments\nillustrate his inferential system including defeating and hypothetical\nreasoning. Indeed, illustration of the system sometimes seems to be\nthe main goal.\n\nAlthough Gaṅgeśa accepts the position of early\nNaiyāyika Uddyotakara (c. 600) that one knows oneself\nperceptually as expressed by the word ‘I’ in perceptual\njudgments such as “I am seeing a pot” (Taber 2012),\npresumably he sees proving a self by inference as useful because\nBuddhists, for one, deny it (famously). And at least in\nYogācāra Buddhism perception is accepted as a knowledge\nsource, with the insistence that no self is known by it or indeed by\nany other means.\n\nThe Nyāya-sūtra has two arguments: diachronic\nsynthesis and synchronic. The former is illustrated by the\nrecognition, “This is that Devadatta I saw yesterday,”\nwhich could not be an expression of knowledge (and of course it is) if\nthe self of the recognizer had not endured (the recognition is fed by\na memory of Devadata as seen the day before, and one person does not\nhave another’s memories). The latter is illustrated by, “I\nam touching what I see” (a self is needed to bring together the\ninformation across sensory modality). In the Jewel’s\nperception chapter, Gaṅgeśa at times refers to or echoes\nthese arguments, but the argument for a self in the inference chapter\nis different.\n\nGaṅgeśa follows Vātsyāyana under\nNyāya-sūtra 1.1.5 (the “inference\nsūtra”): “Every living body (the inferential subject)\nhas a self (the probandum), since every living body has\nbreath (the prover), unlike a pot (the example, a pot being\nqualified by both absence-of-self and absence-of-breath).” My\nsense is that here the main point is as much to illustrate\n“negative-only” inference as to endorse\nVātsyāyana’s reasoning, but it is endorsed. The\ninferential subject includes all living bodies, and so there is no\nsapakṣa, no examples of the probandum known outside the\nset of things that are living bodies. Thus the inference has to be\nnegative-only, based solely on correlations of absences,\n“unlike a pot,” a pot having neither breath nor self.\nFundamental truths of things (tattva), which are captured by\nphilosophical definitions, seem accessible only through fundamental\ndistinctions being known through negative-only inferences, for\nexample, this inference to self (ātman) as a fundamental\ncategory of substance.\n\nIn a slightly more more elaborate version, Gaṅgeśa puts\nforth two steps. First, desires and the like are proved to have a\nlocus, like all qualities. In step two, self is proved to be that\nlocus, a distinct substance, different from earth, water,\ntejas, and so on down the traditional list, by eliminative\nargument. Defeaters for the proposition that desire and the like\nbelong to earth or any of the rest of the items on the ontological\nlist consists of hypothetical reasoning such as the following. If\ndesire were a property of earth (or water and so on), then like the\ncolor that exists in earthen things, it, too, would be perceived.\nSurveying pots and the like, we find that nothing material has desire,\ncognition, etc., outside of living bodies. He writes (2020: 803):\n\n\nGiven that desire has been proved to have an inherent cause (by the\ninference previously stated, “Desire has origins in an inherent\ncause, since it is an effect,” we formulate a second\ninference), being-a-desire occurs in that (namely, desire) which has\nas emergent cause a connection, since being-a-desire is a\nuniversal directly pervaded by the\nqualityhood-that-occurs-in-specific-qualities-grasped-by-an-eternal-organ\n(i.e., manas or the organ of hearing), like\nbeing-a-sound (soundhood, the universal of sound). And this emergent\ncause, which is a connection, is specified by something, since it is a\nconnection. (That “something” is the living body.) If\nmerely connection with a self were the origins of desire (without\nrequiring something else delimiting it), then ramifications would\noverextend. Therefore, having-a-self, which is the specifier of the\nconnection that gives rise to desire, is proved with respect to the\nliving body. (That is, every living body is\n“enselved.”)\n\n\nThe inference for positing an īśvara, the\n“Lord,” is a little less system-bound than this one for an\nātman, but its history stretches through several earlier\nNyāya efforts, in particular by Vācaspati (c. 950). It is an\ninference to a creator based on both positive and negative\ncorrelations: “Earth and the like have a conscious agent as an\ninstrumental cause, since they are effects, like a pot and\nunlike an atom (whatever is an effect has a conscious agent as an\ninstrumental cause).” Buddhists point to counterexamples, such\nas growing grass. Growing grass has the prover property,\nbeing-an-effect, but not the probandum,\nhaving-an-agent-as-an-instrumental cause. The Nyāya reply is to\npoint out that growing grass and all such examples are in dispute,\nthat is to say, fall within the domain of the inferential subject\n(pakṣa), here “earth and the like,” to wit,\nanything that is an effect but whose agential cause is not apparent,\nunlike the comparison class, a pot, for instance, which is clearly\nboth an effect and has an agent as an instrumental cause. Nothing that\nfalls within the domain of the subject can be used either as an\nexample supporting the rule of vyāpti inclusion or as a\ncounterexample, since that would beg the question. The whole point of\ninference is to make something known that was not known previously,\nand here, as with the existence of atoms, the conclusion could not be\nknown perceptually. The theological inference has the purpose of\nshowing that things like the earth and growing grass have an\nagent within the causal complex that brings them about. This is not\nsomething that we know without making the inference.\n\nSo, by the rules governing proper inference, the putative\ncounterexample is rejected, and the proof looks pretty good. For,\ncleverly it divides all things into three categories, as\nVācaspati remarks (1996: 563). There are uncreated things, atoms,\nfor instance, created things that clearly have an agential cause, such\nas pots, and things such as the earth and growing grass that do not\nclearly have an agential cause. This last set becoming the inferential\nsubject is bracketed such that no examples can be pulled from it.\n\nHowever, another refutation refined by Buddhist philosophers over the\ncenturies is not dismissed so easily (Mokṣākāragupta\n1998: 98; Patil 2009). The Nyāya argument falls to an\nupādhi, in this case the property,\nhaving-a-perceptible-body. As we have seen, an upādhi is\ndefined as a property that pervades the probandum while failing to\npervade the prover, that is to say, that is entailed by the presence\nof the probandum while not being instanced in at least one case of the\nprover. Having-an-agent-as-an-instrumental-cause, which is the \\(S\\)\nor probandum property of the target inference, is pervaded by the\nagent’s-having-a-perceptible-body, which is the \\(U\\) or\nupādhi property: all agents have bodies. But there is\nsomething that is an \\(H\\) but not a \\(U\\); something that is an\neffect but does not have within its causal complex an agent with a\nperceptible body, e.g., growing grass. The two conditions being met,\nit would follow that there is something that is an \\(H\\) but not an\n\\(S\\), something that is an effect but does not have an agent as an\ninstrumental cause. Thus the upādhi defeats the apparent\ninference by showing that the required pervasion and entailment do not\nhold.\n\nGaṅgeśa’s response is to deny that the putative\nupādhi, an-agent’s-having-a-perceptible-body,\npervades the probandum of the target inference,\nhaving-an-agent-as-an-instrumental-cause, and several rounds of\nobjection and response centering on Nyāya’s conception of\nthe Lord as an agent without a body are aired. The Lord’s\ncreative activity requires, like that of any agent, familiarity with\nthe material to be shaped, like the potter’s knowledge of clay\nand of what to do to make a pot. The Lord’s knowledge is to be\nconceived as appropriate to the tasks to be undertaken, such as\noriginally combining atoms, and if the Lord, like us, had to have a\nbody to have knowledge, including the knowledge required to combine\natoms, then, since bodies are combinations of atoms, there would have\nto be some earlier Creator to make the necessary\ncombinations—ad infinitum. Simpler than this conception\nis that of a bodiless Creator whose knowledge is appropriate to the\nmaterial forming earth and the like but, unlike our knowledge, is not\ngenerated. This seems to be the core of Gaṅgeśa’s\nreasoning, which is complex tarka targeting simplicity and\nfollowing Vācaspati in particular.\n\nAn inference to the possibility of “liberation,”\nmukti, brings the Jewel’s inference chapter to\na close. It is particularly dense (2020: 1142) and cannot be unpacked\nin a short space, but its central analogy is noteworthy.\n\n\nThen the justification (the inference to the conclusion that suffering\ncan come to an end for an individual), well, it is that suffering in\ngeneral, or the suffering in general of Devadatta (i.e., of any\nindividual), is the counterpositive of a non-simultaneous destruction\nexisting in the same locus, since it is a property that\noccurs only as an effect, or since it is continuous until its\nend, like the light of a lamp. This continuity is its being a\nproperty that occurs only as an effect at distinct times. And in this\nway the probandum, the property to be proved (viz., being the\ncounterpositive of a non-simultaneous destruction existing in the same\nlocus), is also applicable to pleasure in general and the like:\nliberation is the breaking up of the causal chain along with its\nsource.\n\n\nTranslator’s comments (2020: 1142) bring out that the crucial\npoint seems to be that something destroyed has no causal power,\nexisting only as an effect, in connection with the destruction for\nwhich it is the counterpositive. The destruction that is\nmukti is not of current but of future suffering, thus a\n“non-simultaneous” destruction. The destruction exists in\nthe same locus as the suffering that would occur were it not blocked.\nThe suffering does not really occur—it never comes\nabout—and so its ontological status is problematic. Clearly, it\ndoes not cause anything. It comes about only as an effect in\nconnection with the bringing about of the destruction in relation to\nwhich it is the counterpositive. And any destruction is of something\n(the counterpositive) at a place or locus: \\(cDl\\). Note that the\nexample appears to work only with the second of the two provers\nmentioned: like a lamp’s stream of light that can cease\nabsolutely, the suffering of an individual goes on continuously\n(through life, death, and rebirth)—in the sense of regularly if\nnot without occasional spells of pleasure—until its absolute\nend. Pleasure is similar.\n",
    "section_title": "5.4 Three philosophic inferences",
    "entry_title": "Gaṅgeśa",
    "hierarchy_title": "Gaṅgeśa || Inference || Three philosophic inferences",
    "tokenized_text": [
        "inference",
        "three",
        "philosophic",
        "inference",
        "three",
        "philosophic",
        "inference",
        "gańgeśa",
        "advance",
        "three",
        "contentious",
        "inference",
        "inference",
        "chapter",
        "two",
        "thema",
        "theistic",
        "inference",
        "one",
        "possibility",
        "liberation",
        "muktidefended",
        "considerable",
        "length",
        "three",
        "reconstructed",
        "examined",
        "phillips",
        "much",
        "supporting",
        "longstanding",
        "position",
        "nyāya",
        "self",
        "ātman",
        "b",
        "lord",
        "īśvara",
        "c",
        "mukti",
        "treatment",
        "illustrate",
        "inferential",
        "system",
        "including",
        "defeating",
        "hypothetical",
        "reasoning",
        "indeed",
        "illustration",
        "system",
        "sometimes",
        "seems",
        "main",
        "goal",
        "although",
        "gaṅgeśa",
        "accepts",
        "position",
        "early",
        "naiyāyika",
        "uddyotakara",
        "c",
        "one",
        "know",
        "oneself",
        "perceptually",
        "expressed",
        "word",
        "perceptual",
        "judgment",
        "seeing",
        "pot",
        "taber",
        "presumably",
        "see",
        "proving",
        "self",
        "inference",
        "useful",
        "buddhist",
        "one",
        "deny",
        "famously",
        "least",
        "yogācāra",
        "buddhism",
        "perception",
        "accepted",
        "knowledge",
        "source",
        "insistence",
        "self",
        "known",
        "indeed",
        "mean",
        "nyāyasūtra",
        "two",
        "argument",
        "diachronic",
        "synthesis",
        "synchronic",
        "former",
        "illustrated",
        "recognition",
        "devadatta",
        "saw",
        "yesterday",
        "could",
        "expression",
        "knowledge",
        "course",
        "self",
        "recognizer",
        "endured",
        "recognition",
        "fed",
        "memory",
        "devadata",
        "seen",
        "day",
        "one",
        "person",
        "another",
        "memory",
        "latter",
        "illustrated",
        "touching",
        "see",
        "self",
        "needed",
        "bring",
        "together",
        "information",
        "across",
        "sensory",
        "modality",
        "jewel",
        "perception",
        "chapter",
        "gaṅgeśa",
        "time",
        "refers",
        "echo",
        "argument",
        "argument",
        "self",
        "inference",
        "chapter",
        "different",
        "gaṅgeśa",
        "follows",
        "vātsyāyana",
        "nyāyasūtra",
        "inference",
        "sūtra",
        "every",
        "living",
        "body",
        "inferential",
        "subject",
        "self",
        "probandum",
        "since",
        "every",
        "living",
        "body",
        "breath",
        "prover",
        "unlike",
        "pot",
        "example",
        "pot",
        "qualified",
        "absenceofself",
        "absenceofbreath",
        "sense",
        "main",
        "point",
        "much",
        "illustrate",
        "negativeonly",
        "inference",
        "endorse",
        "vātsyāyana",
        "reasoning",
        "endorsed",
        "inferential",
        "subject",
        "includes",
        "living",
        "body",
        "sapakṣa",
        "example",
        "probandum",
        "known",
        "outside",
        "set",
        "thing",
        "living",
        "body",
        "thus",
        "inference",
        "negativeonly",
        "based",
        "solely",
        "correlation",
        "absence",
        "unlike",
        "pot",
        "pot",
        "neither",
        "breath",
        "self",
        "fundamental",
        "truth",
        "thing",
        "tattva",
        "captured",
        "philosophical",
        "definition",
        "seem",
        "accessible",
        "fundamental",
        "distinction",
        "known",
        "negativeonly",
        "inference",
        "example",
        "inference",
        "self",
        "ātman",
        "fundamental",
        "category",
        "substance",
        "slightly",
        "elaborate",
        "version",
        "gaṅgeśa",
        "put",
        "forth",
        "two",
        "step",
        "first",
        "desire",
        "like",
        "proved",
        "locus",
        "like",
        "quality",
        "step",
        "two",
        "self",
        "proved",
        "locus",
        "distinct",
        "substance",
        "different",
        "earth",
        "water",
        "tejas",
        "traditional",
        "list",
        "eliminative",
        "argument",
        "defeaters",
        "proposition",
        "desire",
        "like",
        "belong",
        "earth",
        "rest",
        "item",
        "ontological",
        "list",
        "consists",
        "hypothetical",
        "reasoning",
        "following",
        "desire",
        "property",
        "earth",
        "water",
        "like",
        "color",
        "exists",
        "earthen",
        "thing",
        "would",
        "perceived",
        "surveying",
        "pot",
        "like",
        "find",
        "nothing",
        "material",
        "desire",
        "cognition",
        "etc",
        "outside",
        "living",
        "body",
        "writes",
        "given",
        "desire",
        "proved",
        "inherent",
        "cause",
        "inference",
        "previously",
        "stated",
        "desire",
        "origin",
        "inherent",
        "cause",
        "since",
        "effect",
        "formulate",
        "second",
        "inference",
        "beingadesire",
        "occurs",
        "namely",
        "desire",
        "emergent",
        "cause",
        "connection",
        "since",
        "beingadesire",
        "universal",
        "directly",
        "pervaded",
        "qualityhoodthatoccursinspecificqualitiesgraspedbyaneternalorgan",
        "ie",
        "manas",
        "organ",
        "hearing",
        "like",
        "beingasound",
        "soundhood",
        "universal",
        "sound",
        "emergent",
        "cause",
        "connection",
        "specified",
        "something",
        "since",
        "connection",
        "something",
        "living",
        "body",
        "merely",
        "connection",
        "self",
        "origin",
        "desire",
        "without",
        "requiring",
        "something",
        "else",
        "delimiting",
        "ramification",
        "would",
        "overextend",
        "therefore",
        "havingaself",
        "specifier",
        "connection",
        "give",
        "rise",
        "desire",
        "proved",
        "respect",
        "living",
        "body",
        "every",
        "living",
        "body",
        "enselved",
        "inference",
        "positing",
        "īśvara",
        "lord",
        "little",
        "le",
        "systembound",
        "one",
        "ātman",
        "history",
        "stretch",
        "several",
        "earlier",
        "nyāya",
        "effort",
        "particular",
        "vācaspati",
        "c",
        "inference",
        "creator",
        "based",
        "positive",
        "negative",
        "correlation",
        "earth",
        "like",
        "conscious",
        "agent",
        "instrumental",
        "cause",
        "since",
        "effect",
        "like",
        "pot",
        "unlike",
        "atom",
        "whatever",
        "effect",
        "conscious",
        "agent",
        "instrumental",
        "cause",
        "buddhist",
        "point",
        "counterexample",
        "growing",
        "grass",
        "growing",
        "grass",
        "prover",
        "property",
        "beinganeffect",
        "probandum",
        "havinganagentasaninstrumental",
        "cause",
        "nyāya",
        "reply",
        "point",
        "growing",
        "grass",
        "example",
        "dispute",
        "say",
        "fall",
        "within",
        "domain",
        "inferential",
        "subject",
        "pakṣa",
        "earth",
        "like",
        "wit",
        "anything",
        "effect",
        "whose",
        "agential",
        "cause",
        "apparent",
        "unlike",
        "comparison",
        "class",
        "pot",
        "instance",
        "clearly",
        "effect",
        "agent",
        "instrumental",
        "cause",
        "nothing",
        "fall",
        "within",
        "domain",
        "subject",
        "used",
        "either",
        "example",
        "supporting",
        "rule",
        "vyāpti",
        "inclusion",
        "counterexample",
        "since",
        "would",
        "beg",
        "question",
        "whole",
        "point",
        "inference",
        "make",
        "something",
        "known",
        "known",
        "previously",
        "existence",
        "atom",
        "conclusion",
        "could",
        "known",
        "perceptually",
        "theological",
        "inference",
        "purpose",
        "showing",
        "thing",
        "like",
        "earth",
        "growing",
        "grass",
        "agent",
        "within",
        "causal",
        "complex",
        "brings",
        "something",
        "know",
        "without",
        "making",
        "inference",
        "rule",
        "governing",
        "proper",
        "inference",
        "putative",
        "counterexample",
        "rejected",
        "proof",
        "look",
        "pretty",
        "good",
        "cleverly",
        "divide",
        "thing",
        "three",
        "category",
        "vācaspati",
        "remark",
        "uncreated",
        "thing",
        "atom",
        "instance",
        "created",
        "thing",
        "clearly",
        "agential",
        "cause",
        "pot",
        "thing",
        "earth",
        "growing",
        "grass",
        "clearly",
        "agential",
        "cause",
        "last",
        "set",
        "becoming",
        "inferential",
        "subject",
        "bracketed",
        "example",
        "pulled",
        "however",
        "another",
        "refutation",
        "refined",
        "buddhist",
        "philosopher",
        "century",
        "dismissed",
        "easily",
        "mokṣākāragupta",
        "patil",
        "nyāya",
        "argument",
        "fall",
        "upādhi",
        "case",
        "property",
        "havingaperceptiblebody",
        "seen",
        "upādhi",
        "defined",
        "property",
        "pervades",
        "probandum",
        "failing",
        "pervade",
        "prover",
        "say",
        "entailed",
        "presence",
        "probandum",
        "instanced",
        "least",
        "one",
        "case",
        "prover",
        "havinganagentasaninstrumentalcause",
        "s",
        "probandum",
        "property",
        "target",
        "inference",
        "pervaded",
        "agent",
        "shavingaperceptiblebody",
        "u",
        "upādhi",
        "property",
        "agent",
        "body",
        "something",
        "h",
        "u",
        "something",
        "effect",
        "within",
        "causal",
        "complex",
        "agent",
        "perceptible",
        "body",
        "eg",
        "growing",
        "grass",
        "two",
        "condition",
        "met",
        "would",
        "follow",
        "something",
        "h",
        "s",
        "something",
        "effect",
        "agent",
        "instrumental",
        "cause",
        "thus",
        "upādhi",
        "defeat",
        "apparent",
        "inference",
        "showing",
        "required",
        "pervasion",
        "entailment",
        "hold",
        "gaṅgeśa",
        "response",
        "deny",
        "putative",
        "upādhi",
        "anagent",
        "shavingaperceptiblebody",
        "pervades",
        "probandum",
        "target",
        "inference",
        "havinganagentasaninstrumentalcause",
        "several",
        "round",
        "objection",
        "response",
        "centering",
        "nyāya",
        "conception",
        "lord",
        "agent",
        "without",
        "body",
        "aired",
        "lord",
        "creative",
        "activity",
        "requires",
        "like",
        "agent",
        "familiarity",
        "material",
        "shaped",
        "like",
        "potter",
        "knowledge",
        "clay",
        "make",
        "pot",
        "lord",
        "knowledge",
        "conceived",
        "appropriate",
        "task",
        "undertaken",
        "originally",
        "combining",
        "atom",
        "lord",
        "like",
        "u",
        "body",
        "knowledge",
        "including",
        "knowledge",
        "required",
        "combine",
        "atom",
        "since",
        "body",
        "combination",
        "atom",
        "would",
        "earlier",
        "creator",
        "make",
        "necessary",
        "combinationsad",
        "infinitum",
        "simpler",
        "conception",
        "bodiless",
        "creator",
        "whose",
        "knowledge",
        "appropriate",
        "material",
        "forming",
        "earth",
        "like",
        "unlike",
        "knowledge",
        "generated",
        "seems",
        "core",
        "gaṅgeśa",
        "reasoning",
        "complex",
        "tarka",
        "targeting",
        "simplicity",
        "following",
        "vācaspati",
        "particular",
        "inference",
        "possibility",
        "liberation",
        "mukti",
        "brings",
        "jewel",
        "inference",
        "chapter",
        "close",
        "particularly",
        "dense",
        "unpacked",
        "short",
        "space",
        "central",
        "analogy",
        "noteworthy",
        "justification",
        "inference",
        "conclusion",
        "suffering",
        "come",
        "end",
        "individual",
        "well",
        "suffering",
        "general",
        "suffering",
        "general",
        "devadatta",
        "ie",
        "individual",
        "counterpositive",
        "nonsimultaneous",
        "destruction",
        "existing",
        "locus",
        "since",
        "property",
        "occurs",
        "effect",
        "since",
        "continuous",
        "end",
        "like",
        "light",
        "lamp",
        "continuity",
        "property",
        "occurs",
        "effect",
        "distinct",
        "time",
        "way",
        "probandum",
        "property",
        "proved",
        "viz",
        "counterpositive",
        "nonsimultaneous",
        "destruction",
        "existing",
        "locus",
        "also",
        "applicable",
        "pleasure",
        "general",
        "like",
        "liberation",
        "breaking",
        "causal",
        "chain",
        "along",
        "source",
        "translator",
        "comment",
        "bring",
        "crucial",
        "point",
        "seems",
        "something",
        "destroyed",
        "causal",
        "power",
        "existing",
        "effect",
        "connection",
        "destruction",
        "counterpositive",
        "destruction",
        "mukti",
        "current",
        "future",
        "suffering",
        "thus",
        "nonsimultaneous",
        "destruction",
        "destruction",
        "exists",
        "locus",
        "suffering",
        "would",
        "occur",
        "blocked",
        "suffering",
        "really",
        "occurit",
        "never",
        "come",
        "aboutand",
        "ontological",
        "status",
        "problematic",
        "clearly",
        "cause",
        "anything",
        "come",
        "effect",
        "connection",
        "bringing",
        "destruction",
        "relation",
        "counterpositive",
        "destruction",
        "something",
        "counterpositive",
        "place",
        "locus",
        "cdl",
        "note",
        "example",
        "appears",
        "work",
        "second",
        "two",
        "provers",
        "mentioned",
        "like",
        "lamp",
        "stream",
        "light",
        "cease",
        "absolutely",
        "suffering",
        "individual",
        "go",
        "continuously",
        "life",
        "death",
        "rebirth",
        "in",
        "sense",
        "regularly",
        "without",
        "occasional",
        "spell",
        "pleasureuntil",
        "absolute",
        "end",
        "pleasure",
        "similar"
    ]
}