{
    "main_text": "Intellectual Development || Phenomenology as a Method\n2.2 Phenomenology as a Method\n\nAfter 1911, evidence points to how both Ortega and Hartmann pursued\nparticular interests of phenomenology. Hartmann, who succeeded Natorp\nas Chair at Marburg in 1924, eventually became important in the\nphilosophical developments of Martin Heidegger and Hans-Georg Gadamer.\nIn 1912, Ortega began to study phenomenology “seriously”\nand in 1913, he recollected years later, the Jahrbuch für\nPhilosophie und Phänomenologische Forschung, Edmund\nHusserl’s Ideen (Ideas Pertaining to a Pure\nPhenomenology, [1913, 1982]), and Formalism in Ethics and\nNon-Formal Ethics of Values of Max Scheler were published. Later\nthat year, in a series of articles which were published in the\nRevista de Libros, Ortega wrote a long review of Heinrich\nHoffman’s dissertation, Studies on the Concept of Sensation,\nwhich had been presented to the University of Göttingen during\nthe same year. In the essay, which discussed the descriptive\npsychology of one of the lesser known students of the Göttingen\nCircle, Ortega remarked that\n\n\nthe influence—each time greater—of\n“phenomenology” on psychology tends to separate in the\nlatter, in the most fundamental and salubrious manner, description\nfrom explanation. (Obras, VIII: 43, 47; I: 244–45)\n\n\nThree of the five sections of the review elaborated on certain aspects\nof Husserl’s phenomenology, in a general sense, as the pure\ndescription of essences. In view of this characterization of\nphenomenology as “descriptive psychology,” Ortega\nemphasized the importance of distinguishing the essential individual\nintuition of Husserl’s “pure description” of essence in\nthe Ideas from what he termed the mistaken definition of\nphenomenology as a descriptive psychology that some philosophers tend\nto interpret in Husserl’s Logische Untersuchungen\n(Obras, I: 249, 251). Psychological statements, for Ortega,\nhave to be distinguished from the purely descriptive statements of\nphenomenology on the grounds that psychology concerns itself with\nfacts and statements and are therefore empirical; on the other hand,\nphenomenology, as formulated in a clearer formula in Husserl’s\nIdeas, concerns itself with “consciousness”,\nhuman consciousness. Through this formulation, Ortega contended,\nit\n\n\nis very clear that the new science [phenomenology] is not psychology,\nif by psychology we mean a descriptive empirical science or a\nmetaphysical science. (Obras, I: 253)\n\n\nOrtega’s dissatisfaction with this psychological understanding of\ntheIdeas anticipated, in part, statements made by Husserl in\n1935. In his Crisis for European Sciences and Transcendental\nPhenomenology (1936), Husserl remarked in passing that several of\nthe paragraphs and locutions of transcendental phenomenology may have\nmisled several readers to understand his thesis in a psychological\nsense. This becomes as much the case of consciousness as what remains\nafter all transcendence has been bracketed, as of the thesis of\nnoesis-noema correlation. The transcendental nature of the\nconcept of noema easily could have been misperceived in favor\nof a psychological understanding, particularly in view of the fact\nthat the radical feature of both the epoché and the\n“constitution” thesis was not developed fully to his\nsatisfaction. The exposition of the epoché in the\nIdeas, Husserl recalled in the Crisis, appeared too\nCartesian, implying that one may shift suddenly from the natural to\nthe transcendental viewpoint (1936 [1970: 154–5]). According to\nOrtega, Husserl presented phenomenology as a descriptive manner in\nwhich one philosophizes without presuppositions and without empirical\nstatements. The phenomenological reduction, in the Ideas,\nprovided the principal theme of this “new science” as it\naccounted for the reflexive process of “consciousness”, a\nconsciousness that comprises consciousness of perceptions of the\nnatural world. Thus, for Ortega, Husserl’s position reduces phenomena\nas entities in the natural posture of our world:\n\n\nThere is a “natural manner” of carrying out acts of\nconsciousness, whatever they may be. That natural manner is\ncharacterized by the executive value which those acts have. Thus the\n“natural posture” in the act of perception consists in\naccepting as existing in truth before us a thing that belongs to a\ngroup of things which we consider in fact to be real and which we call\n“world”….\n\nThus, all the acts of consciousness and all the objects of those acts\ncan be placed in parentheses. The whole “natural” world or\nscience insofar as it is a system of judgments carried out in a\n“natural manner”, is reduced to phenomenon. And here, a\nphenomenon does not mean what it does in Kant, for example, something\nthat suggests another substantial something beyond it. Phenomenon here\nis simply the virtual character that every thing acquires when from\nits natural executive value one passes to contemplate it in a\nspectacular and descriptive posture, without giving it a definite\ncharacter.\n\nThat pure description is phenomenology. (Obras, I:\n252–53)\n\n\nThis sympathetic discussion of Husserl’s Ideas inspired\nOrtega to pursue the new science of phenomenology as a method of\ninquiry. This method of inquiry became crucial especially in view of\nhis expressed objective to make a distinction between descriptive and\nexplanatory psychology and, thereby, to clarify the concept of the\nmental status of consciousness. After the 1912 paper and a paper\ndelivered at the Fourth Congress of the Spanish Association for the\nAdvancement of Science in 1913 on “Sensation, Construction and\nIntuition”, he presented a series of lectures for the course,\n“Systematic Psychology”, in 1915. Ortega expanded these\nlectures into a manuscript entitled Psychological\nInvestigations, which has been published posthumously. These\npsychological investigations constituted for him a philosophical basis\nupon which to define mental phenomena, very much in the manner Husserl\nhad set out to perform in his Logical Investigations.\nInspired by Franz Brentano’s reformist vision of philosophy as an\nexact science, Husserl adopted the viewpoint of his mentor to posit\nphilosophy as a “rigorous science”. Husserl’s early work\non presupposition-less descriptive psychology was also concerned with\nBrentano’s concept of presentation and the intentional inexistence of\nan object. Following Brentano and Carl Stumpf, he regarded the\nessential nature of psychic acts as having content and, normally, an\nobject. In the First Edition of the Logical Investigations,\n1900–1901, Husserl understood Phenomenology to mean\n“descriptive psychology”, which had its origins in\nBrentano’s earlier efforts. At the turn of the twentieth century, the\nemergence of psychology as an independent discipline, liberated from\nthe traditional tutelage of philosophy, led to intense investigations\nof human behavior which soon revealed the need for subtler methods of\nanalysis than those provided by the physical sciences. Gradually, a\nnew conception of the individual emerged, different from the\ntraditional conceptions as new mathematical physics was different from\nits mechanistic predecessor.\n\nFor certain authorities, knowledge attains legitimacy when it has been\ninvested with the power of tradition. The need to make an appeal to\ntradition represents one of the characteristics that grants authority\nto classical authors. In his quest for a scientific methodology with\nthe objective of tackling new problems, Ortega asked whether\nphilosophical legitimacy was attainable without appealing to\ntraditional authority. The formal principles for discursive\njustification provide the procedural basis for distinguishing new\nscience from the classical. For, he writes,\n\n\nanyone who seriously wants to establish a new science will have to\npractice the self-denial required in prolonging a long time this\nperiods of schooling, of apprenticeship, of studying the classics.\n(Obras, XII: 340)\n\n\nTo be sure, he contended,\n\n\nScientific research, as a way of expanding knowledge, obliges us to\novercome classicism. The very process of apprenticeship carries within\nitself the requirement that it come to an end and yield to independent\ncreation. To study or to learn from a classic ultimately impels us to\nemulate what its author did: to surpass the previous classical stance,\nto transform, to extend, and to renew science itself. (Obras,\nXII: 340–41)\n\n\nFrom this stance, Ortega maintained that classical or traditional\nscience possessed an aura of privilege, distance and permanence about\nit, but the new science, in challenging this privilege and claims of\npermanence with an alternative perception of reality, disintegrated\nthat aura and allowed the inquirer to encounter reality in terms of\nhis or her own time and place. In view of this characterization,\nOrtega formulated his philosophical objective within the context of\nthe early twentieth century.\n\n\nMy purpose is to study the fundamental problems of psychology with the\npurpose of making systematic psychology possible. These problems\n… do not allow for vague treatment; in fact, they demand a most\ndetailed and, if possible, exhaustive inquiry. (Obras, XII:\n42)\n\n\nOrtega maintains that once the problem concerning the distinction\nbetween mental and physical phenomena have been established, other\nquestions will also be resolved: those pertaining to the object and\nmethod of psychology and logic; the nature of inner perception and of\nintrospection; the possibility or impossibility of a straightforward\ndescriptive psychology of thinking; the meaning of intuition; and\n“consequently, whether or not nonnutritive thought is\npossible” (Obras, XII: 342–43).\n\nSubsequent to the 1912 essay and the 1915 lectures, the influence of\nthe language of phenomenology becomes discernible in the works of\nOrtega through the usage of such terms as “apodictic\nappearance”, philosophy as “a science”, and\nphilosophy “as a science without supposition”\n(Obras, I: 318–19; VII: 335). Since 1914, Ortega\nremarked in his work The Idea of Principle in Leibnitz and the\nEvolution of Deductive Theory (1947), which was published\nposthumously in 1958, a\n\n\nreflection on the phenomenon “human life” is the basis of\nall my thought. At that time I formulated it—in order to expound\nHusserl’s phenomenology during various courses—correcting, in an\nessential manner, the description of the phenomenon\n“consciousness of…”. which, as is known,\nconstituted, at that time, the basis of his doctrine. (Obras,\nVIII: 273, n.2)\n\n\nIn 1925, he wrote a short section in his essay, The Dehumanization\nof Art entitled “A Few Drops of Phenomenology”, in\nwhich he discussed the “perspectivism” motif of variegated\nexperiences (Obras, III: 360–64). The discrepancy\nbetween science and experience, though extreme for some of his\ncontemporaries, became one of his central concerns during this period.\nHe maintained that the different perspectival perceptions of an\nidentical event illuminated for us the fact that “one and the\nsame reality may split into many diverse realities when it is beheld\nfrom different points of view”. Modern physics, while leaving\nmechanistic explanations of certain natural phenomena intact,\nshattered the overall mechanistic conception of nature. It demolished\nthe notion of an objective reality with all that it implied: the unity\nof nature, both human and physical, the universality of natural laws,\nthe determination of physical processes, and the ability of science to\nsolve all problems of the natural world. The findings of modern\nphysics, therefore, were bound to have had an enormous impact on\ngeneral culture, even greater than that, according to Ortega, of\nbiology in the mid-nineteenth century. Albert Einstein, he argued,\nstruck the first telling blow against the concept of an objective\nreality—a concept that assumes the existence of universal time\nand space into which nature fits, independently of the observer.\nEinstein demonstrated that there is no single spatial and\nchronological frame of reference. Every observer is confined to a\nspecific and relative time-space system. Ortega perceived, in this\nsystem, the “human point of view” as that reality in which\nwe live: situations, persons and things. To establish distance between\nourselves and reality as a manner of understanding these lived\nexperiences—which are by no means absolute—we have to\nproject ourselves into the place of another person and situation. In\ndoing so, we may come to distinguish among persons, things and\nsituations and thereby come to observe reality more closely\n(Obras, III: 361, 363, 362).\n",
    "section_title": "2.2 Phenomenology as a Method",
    "entry_title": "José Ortega y Gasset",
    "hierarchy_title": "José Ortega y Gasset || Intellectual Development || Phenomenology as a Method",
    "tokenized_text": [
        "intellectual",
        "development",
        "phenomenology",
        "method",
        "phenomenology",
        "method",
        "evidence",
        "point",
        "ortega",
        "hartmann",
        "pursued",
        "particular",
        "interest",
        "phenomenology",
        "hartmann",
        "succeeded",
        "natorp",
        "chair",
        "marburg",
        "eventually",
        "became",
        "important",
        "philosophical",
        "development",
        "martin",
        "heidegger",
        "hansgeorg",
        "gadamer",
        "ortega",
        "began",
        "study",
        "phenomenology",
        "seriously",
        "recollected",
        "year",
        "later",
        "jahrbuch",
        "für",
        "philosophie",
        "und",
        "phänomenologische",
        "forschung",
        "edmund",
        "husserl",
        "ideen",
        "idea",
        "pertaining",
        "pure",
        "phenomenology",
        "formalism",
        "ethic",
        "nonformal",
        "ethic",
        "value",
        "max",
        "scheler",
        "published",
        "later",
        "year",
        "series",
        "article",
        "published",
        "revista",
        "de",
        "libros",
        "ortega",
        "wrote",
        "long",
        "review",
        "heinrich",
        "hoffman",
        "dissertation",
        "study",
        "concept",
        "sensation",
        "presented",
        "university",
        "göttingen",
        "year",
        "essay",
        "discussed",
        "descriptive",
        "psychology",
        "one",
        "lesser",
        "known",
        "student",
        "göttingen",
        "circle",
        "ortega",
        "remarked",
        "influenceeach",
        "time",
        "greaterof",
        "phenomenology",
        "psychology",
        "tends",
        "separate",
        "latter",
        "fundamental",
        "salubrious",
        "manner",
        "description",
        "explanation",
        "obras",
        "viii",
        "three",
        "five",
        "section",
        "review",
        "elaborated",
        "certain",
        "aspect",
        "husserl",
        "phenomenology",
        "general",
        "sense",
        "pure",
        "description",
        "essence",
        "view",
        "characterization",
        "phenomenology",
        "descriptive",
        "psychology",
        "ortega",
        "emphasized",
        "importance",
        "distinguishing",
        "essential",
        "individual",
        "intuition",
        "husserl",
        "pure",
        "description",
        "essence",
        "idea",
        "termed",
        "mistaken",
        "definition",
        "phenomenology",
        "descriptive",
        "psychology",
        "philosopher",
        "tend",
        "interpret",
        "husserl",
        "logische",
        "untersuchungen",
        "obras",
        "psychological",
        "statement",
        "ortega",
        "distinguished",
        "purely",
        "descriptive",
        "statement",
        "phenomenology",
        "ground",
        "psychology",
        "concern",
        "fact",
        "statement",
        "therefore",
        "empirical",
        "hand",
        "phenomenology",
        "formulated",
        "clearer",
        "formula",
        "husserl",
        "idea",
        "concern",
        "consciousness",
        "human",
        "consciousness",
        "formulation",
        "ortega",
        "contended",
        "clear",
        "new",
        "science",
        "phenomenology",
        "psychology",
        "psychology",
        "mean",
        "descriptive",
        "empirical",
        "science",
        "metaphysical",
        "science",
        "obras",
        "ortega",
        "dissatisfaction",
        "psychological",
        "understanding",
        "theideas",
        "anticipated",
        "part",
        "statement",
        "made",
        "husserl",
        "crisis",
        "european",
        "science",
        "transcendental",
        "phenomenology",
        "husserl",
        "remarked",
        "passing",
        "several",
        "paragraph",
        "locution",
        "transcendental",
        "phenomenology",
        "may",
        "misled",
        "several",
        "reader",
        "understand",
        "thesis",
        "psychological",
        "sense",
        "becomes",
        "much",
        "case",
        "consciousness",
        "remains",
        "transcendence",
        "bracketed",
        "thesis",
        "noesisnoema",
        "correlation",
        "transcendental",
        "nature",
        "concept",
        "noema",
        "easily",
        "could",
        "misperceived",
        "favor",
        "psychological",
        "understanding",
        "particularly",
        "view",
        "fact",
        "radical",
        "feature",
        "epoché",
        "constitution",
        "thesis",
        "developed",
        "fully",
        "satisfaction",
        "exposition",
        "epoché",
        "idea",
        "husserl",
        "recalled",
        "crisis",
        "appeared",
        "cartesian",
        "implying",
        "one",
        "may",
        "shift",
        "suddenly",
        "natural",
        "transcendental",
        "viewpoint",
        "according",
        "ortega",
        "husserl",
        "presented",
        "phenomenology",
        "descriptive",
        "manner",
        "one",
        "philosophizes",
        "without",
        "presupposition",
        "without",
        "empirical",
        "statement",
        "phenomenological",
        "reduction",
        "idea",
        "provided",
        "principal",
        "theme",
        "new",
        "science",
        "accounted",
        "reflexive",
        "process",
        "consciousness",
        "consciousness",
        "comprises",
        "consciousness",
        "perception",
        "natural",
        "world",
        "thus",
        "ortega",
        "husserl",
        "position",
        "reduces",
        "phenomenon",
        "entity",
        "natural",
        "posture",
        "world",
        "natural",
        "manner",
        "carrying",
        "act",
        "consciousness",
        "whatever",
        "may",
        "natural",
        "manner",
        "characterized",
        "executive",
        "value",
        "act",
        "thus",
        "natural",
        "posture",
        "act",
        "perception",
        "consists",
        "accepting",
        "existing",
        "truth",
        "u",
        "thing",
        "belongs",
        "group",
        "thing",
        "consider",
        "fact",
        "real",
        "call",
        "world",
        "thus",
        "act",
        "consciousness",
        "object",
        "act",
        "placed",
        "parenthesis",
        "whole",
        "natural",
        "world",
        "science",
        "insofar",
        "system",
        "judgment",
        "carried",
        "natural",
        "manner",
        "reduced",
        "phenomenon",
        "phenomenon",
        "mean",
        "kant",
        "example",
        "something",
        "suggests",
        "another",
        "substantial",
        "something",
        "beyond",
        "phenomenon",
        "simply",
        "virtual",
        "character",
        "every",
        "thing",
        "acquires",
        "natural",
        "executive",
        "value",
        "one",
        "pass",
        "contemplate",
        "spectacular",
        "descriptive",
        "posture",
        "without",
        "giving",
        "definite",
        "character",
        "pure",
        "description",
        "phenomenology",
        "obras",
        "sympathetic",
        "discussion",
        "husserl",
        "idea",
        "inspired",
        "ortega",
        "pursue",
        "new",
        "science",
        "phenomenology",
        "method",
        "inquiry",
        "method",
        "inquiry",
        "became",
        "crucial",
        "especially",
        "view",
        "expressed",
        "objective",
        "make",
        "distinction",
        "descriptive",
        "explanatory",
        "psychology",
        "thereby",
        "clarify",
        "concept",
        "mental",
        "status",
        "consciousness",
        "paper",
        "paper",
        "delivered",
        "fourth",
        "congress",
        "spanish",
        "association",
        "advancement",
        "science",
        "sensation",
        "construction",
        "intuition",
        "presented",
        "series",
        "lecture",
        "course",
        "systematic",
        "psychology",
        "ortega",
        "expanded",
        "lecture",
        "manuscript",
        "entitled",
        "psychological",
        "investigation",
        "published",
        "posthumously",
        "psychological",
        "investigation",
        "constituted",
        "philosophical",
        "basis",
        "upon",
        "define",
        "mental",
        "phenomenon",
        "much",
        "manner",
        "husserl",
        "set",
        "perform",
        "logical",
        "investigation",
        "inspired",
        "franz",
        "brentano",
        "reformist",
        "vision",
        "philosophy",
        "exact",
        "science",
        "husserl",
        "adopted",
        "viewpoint",
        "mentor",
        "posit",
        "philosophy",
        "rigorous",
        "science",
        "husserl",
        "early",
        "work",
        "presuppositionless",
        "descriptive",
        "psychology",
        "also",
        "concerned",
        "brentano",
        "concept",
        "presentation",
        "intentional",
        "inexistence",
        "object",
        "following",
        "brentano",
        "carl",
        "stumpf",
        "regarded",
        "essential",
        "nature",
        "psychic",
        "act",
        "content",
        "normally",
        "object",
        "first",
        "edition",
        "logical",
        "investigation",
        "husserl",
        "understood",
        "phenomenology",
        "mean",
        "descriptive",
        "psychology",
        "origin",
        "brentano",
        "earlier",
        "effort",
        "turn",
        "twentieth",
        "century",
        "emergence",
        "psychology",
        "independent",
        "discipline",
        "liberated",
        "traditional",
        "tutelage",
        "philosophy",
        "led",
        "intense",
        "investigation",
        "human",
        "behavior",
        "soon",
        "revealed",
        "need",
        "subtler",
        "method",
        "analysis",
        "provided",
        "physical",
        "science",
        "gradually",
        "new",
        "conception",
        "individual",
        "emerged",
        "different",
        "traditional",
        "conception",
        "new",
        "mathematical",
        "physic",
        "different",
        "mechanistic",
        "predecessor",
        "certain",
        "authority",
        "knowledge",
        "attains",
        "legitimacy",
        "invested",
        "power",
        "tradition",
        "need",
        "make",
        "appeal",
        "tradition",
        "represents",
        "one",
        "characteristic",
        "grant",
        "authority",
        "classical",
        "author",
        "quest",
        "scientific",
        "methodology",
        "objective",
        "tackling",
        "new",
        "problem",
        "ortega",
        "asked",
        "whether",
        "philosophical",
        "legitimacy",
        "attainable",
        "without",
        "appealing",
        "traditional",
        "authority",
        "formal",
        "principle",
        "discursive",
        "justification",
        "provide",
        "procedural",
        "basis",
        "distinguishing",
        "new",
        "science",
        "classical",
        "writes",
        "anyone",
        "seriously",
        "want",
        "establish",
        "new",
        "science",
        "practice",
        "selfdenial",
        "required",
        "prolonging",
        "long",
        "time",
        "period",
        "schooling",
        "apprenticeship",
        "studying",
        "classic",
        "obras",
        "xii",
        "sure",
        "contended",
        "scientific",
        "research",
        "way",
        "expanding",
        "knowledge",
        "obliges",
        "u",
        "overcome",
        "classicism",
        "process",
        "apprenticeship",
        "carry",
        "within",
        "requirement",
        "come",
        "end",
        "yield",
        "independent",
        "creation",
        "study",
        "learn",
        "classic",
        "ultimately",
        "impels",
        "u",
        "emulate",
        "author",
        "surpass",
        "previous",
        "classical",
        "stance",
        "transform",
        "extend",
        "renew",
        "science",
        "obras",
        "xii",
        "stance",
        "ortega",
        "maintained",
        "classical",
        "traditional",
        "science",
        "possessed",
        "aura",
        "privilege",
        "distance",
        "permanence",
        "new",
        "science",
        "challenging",
        "privilege",
        "claim",
        "permanence",
        "alternative",
        "perception",
        "reality",
        "disintegrated",
        "aura",
        "allowed",
        "inquirer",
        "encounter",
        "reality",
        "term",
        "time",
        "place",
        "view",
        "characterization",
        "ortega",
        "formulated",
        "philosophical",
        "objective",
        "within",
        "context",
        "early",
        "twentieth",
        "century",
        "purpose",
        "study",
        "fundamental",
        "problem",
        "psychology",
        "purpose",
        "making",
        "systematic",
        "psychology",
        "possible",
        "problem",
        "allow",
        "vague",
        "treatment",
        "fact",
        "demand",
        "detailed",
        "possible",
        "exhaustive",
        "inquiry",
        "obras",
        "xii",
        "ortega",
        "maintains",
        "problem",
        "concerning",
        "distinction",
        "mental",
        "physical",
        "phenomenon",
        "established",
        "question",
        "also",
        "resolved",
        "pertaining",
        "object",
        "method",
        "psychology",
        "logic",
        "nature",
        "inner",
        "perception",
        "introspection",
        "possibility",
        "impossibility",
        "straightforward",
        "descriptive",
        "psychology",
        "thinking",
        "meaning",
        "intuition",
        "consequently",
        "whether",
        "nonnutritive",
        "thought",
        "possible",
        "obras",
        "xii",
        "subsequent",
        "essay",
        "lecture",
        "influence",
        "language",
        "phenomenology",
        "becomes",
        "discernible",
        "work",
        "ortega",
        "usage",
        "term",
        "apodictic",
        "appearance",
        "philosophy",
        "science",
        "philosophy",
        "science",
        "without",
        "supposition",
        "obras",
        "vii",
        "since",
        "ortega",
        "remarked",
        "work",
        "idea",
        "principle",
        "leibnitz",
        "evolution",
        "deductive",
        "theory",
        "published",
        "posthumously",
        "reflection",
        "phenomenon",
        "human",
        "life",
        "basis",
        "thought",
        "time",
        "formulated",
        "itin",
        "order",
        "expound",
        "husserl",
        "phenomenology",
        "various",
        "coursescorrecting",
        "essential",
        "manner",
        "description",
        "phenomenon",
        "consciousness",
        "of",
        "known",
        "constituted",
        "time",
        "basis",
        "doctrine",
        "obras",
        "viii",
        "n",
        "wrote",
        "short",
        "section",
        "essay",
        "dehumanization",
        "art",
        "entitled",
        "drop",
        "phenomenology",
        "discussed",
        "perspectivism",
        "motif",
        "variegated",
        "experience",
        "obras",
        "iii",
        "discrepancy",
        "science",
        "experience",
        "though",
        "extreme",
        "contemporary",
        "became",
        "one",
        "central",
        "concern",
        "period",
        "maintained",
        "different",
        "perspectival",
        "perception",
        "identical",
        "event",
        "illuminated",
        "u",
        "fact",
        "one",
        "reality",
        "may",
        "split",
        "many",
        "diverse",
        "reality",
        "beheld",
        "different",
        "point",
        "view",
        "modern",
        "physic",
        "leaving",
        "mechanistic",
        "explanation",
        "certain",
        "natural",
        "phenomenon",
        "intact",
        "shattered",
        "overall",
        "mechanistic",
        "conception",
        "nature",
        "demolished",
        "notion",
        "objective",
        "reality",
        "implied",
        "unity",
        "nature",
        "human",
        "physical",
        "universality",
        "natural",
        "law",
        "determination",
        "physical",
        "process",
        "ability",
        "science",
        "solve",
        "problem",
        "natural",
        "world",
        "finding",
        "modern",
        "physic",
        "therefore",
        "bound",
        "enormous",
        "impact",
        "general",
        "culture",
        "even",
        "greater",
        "according",
        "ortega",
        "biology",
        "midnineteenth",
        "century",
        "albert",
        "einstein",
        "argued",
        "struck",
        "first",
        "telling",
        "blow",
        "concept",
        "objective",
        "realitya",
        "concept",
        "assumes",
        "existence",
        "universal",
        "time",
        "space",
        "nature",
        "fit",
        "independently",
        "observer",
        "einstein",
        "demonstrated",
        "single",
        "spatial",
        "chronological",
        "frame",
        "reference",
        "every",
        "observer",
        "confined",
        "specific",
        "relative",
        "timespace",
        "system",
        "ortega",
        "perceived",
        "system",
        "human",
        "point",
        "view",
        "reality",
        "live",
        "situation",
        "person",
        "thing",
        "establish",
        "distance",
        "reality",
        "manner",
        "understanding",
        "lived",
        "experienceswhich",
        "mean",
        "absolutewe",
        "project",
        "place",
        "another",
        "person",
        "situation",
        "may",
        "come",
        "distinguish",
        "among",
        "person",
        "thing",
        "situation",
        "thereby",
        "come",
        "observe",
        "reality",
        "closely",
        "obras",
        "iii"
    ]
}