{
    "main_text": "Perspectivism: Human Life, Vital Reason and Historicism\n5. Perspectivism: Human Life, Vital Reason and Historicism\n\nThe doctrine of perspectivism expounds the proposition that all\nhistorical epochs participate in contributing an element of truth to\nreality. That is, each individual and each collection of individuals\napprehend reality from the point of view of their respective\nperceptions of reality. The varying perceptions of reality are all\nlegitimate and account for the postulate that different individuals\ninterpret the same “horizon” differently so that\n“every life is a point of view directed upon the\nuniverse” (Obras, III: 200). Ortega’s\n“perspectivist” postulate thus promised to perform the\nfunction of unifying reality. From the assumption that\n“perspective” comprises both “one of the component\nparts of reality and its organizing element”, Ortega arrived at\nthe position that “all knowledge is knowledge from a definite\npoint of view” (Obras, III: 199). Hence every truth\nconnects to a place in space and time. In locating truth in space and\ntime, he derived both the mode of perception and the essence of\nreality.\n\nOrtega perceived in his perspectivist mode of apprehending reality a\nphilosophical analogue to Einstein’s physics and, subsequently,\ninvited a comparison of his philosophy of perspectivism to Einstein’s\nSpecial Theory of Relativity. Ortega’s essay on “The Historical\nSignificance of Einstein’s Theory” pointed to parallel\ntendencies in new modes of twentieth century thinking and in\nEinstein’s theory of relativity, which he characterized as “the\nmost important intellectual fact that the present can show”\n(Obras, III: 231). In dissolving the entire edifice of\nclassical mechanics, Einstein’s theory ushered in the twentieth\ncentury (the “present time”) very much in the manner that\nDescartes’ philosophy prepared thought for the modern era\n(Obras, III: 231–34). Ortega’s ideas on the historical\nsignificance of relativity were derived primarily from Einstein’s\ndiscussion of the Special Theory. He was drawn to comparing the theory\nof relativity to his philosophy of “perspectivism” because\nrelativity appeared to furnish scientific “proof” of his\nown “perspectivist truths”, which were formulated in El\nEspectador in 1916 (Obras, III: 235; see also II:\n15–21).\n\nOrtega’s perspectivist doctrine, as a synthetic principle, also\nimplied for him a doctrine by which one may “attempt to order\nthe world from the point of view of life” (Obras, III:\n179). The principle of human life, which constituted the reality of\nhuman experience, became the philosophical category through which\nOrtega synthesized the universe. Correspondingly, the “sign of\nthe times” also pointed to the important role played by\nNietzsche, Croce, Dilthey and Heidegger, as well as Freud and Husserl,\nin the formation of twentieth-century thought. The emphasis placed\nupon the vital world of life took Ortega a step beyond the Neo-Kantian\ntranscendental logic of Cohen. Ortega combined his idea of human life\nwith an emphasis on history as constituting the vital dynamics of its\nexpression, and this viewpoint carried him closer to the humanistic\nside of the Naturwissenschaften-Geisteswissenschaften\ndistinction made by the Southwest German or Baden School and Dilthey\nthan to Cohen’s Neo-Kantianism.\n\nThe striking similarities in the historicist focus of Windelband,\nRickert and Dilthey, the early historical thought of Croce, and the\nhistorical thought of Ortega suggest that Ortega was influenced by\ntheir ideas both directly and indirectly. The historical ideas of\nWindelband and Rickert reflected the European intellectual currents\nthat paralleled Ortega’s intellectual development, Dilthey had been\nacknowledged by Ortega as having influenced his intellectual focus\ndirectly, and Croce’s early historical ideas appeared to have exerted\ninfluence on the historical thought of Ortega.\n\nIn his essay, “Wilhelm Dilthey and the Idea of Life”,\ntwenty–seven years after his studies in Berlin, Ortega wrote of\nDilthey’s importance in his intellectual development and his\nmisfortune of not having been exposed to the ideas of Dilthey earlier\nas a student:\n\n\nI became acquainted with Dilthey’s work as late as 1929, and it took\nme four more years before I knew it sufficiently well. This ignorance,\nI do not hesitate to maintain, has caused me to lose about ten years\nof my life—ten years, in the first place of intellectual\ndevelopment, but that of course, means an equal loss in all other\ndimensions of life…. When I studied in Berlin in\n1906…Dilthey happened to have given up lecturing in\nthe university building a few years before and admitted to courses he\nheld in home for only a few specially prepared students. Thus\nchance had it that I did not come in touch with him.\n(Obras, VI: 171–72)\n\n\nBy the late 1920s and the early 1930s, however, Ortega did incorporate\nthe idea of human life into his philosophic viewpoint. During these\nyears, he labeled his own philosophy as “the metaphysics of\nvital reason” to signify his continuous search for a structure\nof life that would be transcendent in its relation to every existing\nreality, and yet itself located within the framework of temporal and\nspatial reality. Like Dilthey, whom he considered “the most\nimportant thinker of the second half of the nineteenth century”,\nhe denied truth to any constant principle that establishes itself as\nsuperior to the flux of life, including that of the physical and\nbiological sciences. Dilthey’s Lebensphilosophie, which\nemphasizes openness to experience, not only denies the notion of an\nabstract transcendental reality, but also considers life to be more\nthan mere biological organism. His concept of life is not biological,\nand in this sense, Ortega’s notion of human life\nresembles Dilthey’s. For Ortega, “my life”—in\nthe “biographical” not in the “biological”\nsense—is the question of what to do with it and that of what\nhappens to me as I find myself “shipwrecked” in the\nprecarious sea of “circumstances”. The individual, from\nthis point of view, saves himself by sinking into the inner depths of\nhis being as he makes an effort to hold on to consciousness and to the\nvery essence of his life. “To live”, he maintained,\n“is to deal with the world, aim at it, act in it, be occupied\nwith it” (Obras, V: 26, 33–34, 35, 44–45,\nVII: 103–04). For Dilthey, life is realized empirically within\nthe experiential process of consciousness, as lived experience, which\ngives the experience of the individual life and reality. Dilthey’s\nposition, like Bergson’s, contains the vitalist viewpoint that our\nexperience of the life of our own minds is a direct experience of that\nlife, as it exists, and therefore cannot be perceived as some\nmechanistic physiological explanation of human organism or as some\nsubjective neo-idealistic logical principle. The emphasis on the\nactive, dynamic, and historical dimensions of human and social\nphenomena, as realized within the lived experiences of life, reveal\nthe vitalization of philosophy and the historicization of life\nperspective that are reflective of historicism and the attitude that\nhistorical knowledge is unique to the realm of human affairs.\n\nThis historicism comprises the perspective perceived in Ortega’s\nnotion of the “dynamic dialogue” in the\n“drama” of the life-world of the individual. Historicism\nis not used here in the polemical extreme characterized by Karl\nPopper’s charge that historicism is incompatible with any form of\n“genuine science”. In his The Poverty of\nHistoricism (1957), which describes and criticizes both\n“anti-naturalist” and “pro-naturalist”\ndoctrines of historicism, Popper charges the former doctrine with\n“theology” and “holism” and charges the latter\ndoctrine of advancing the notion that “historical\nprediction” is their principal objective, something that\nbecomes attainable in discovering the “rhythms”,\n“patterns”, “laws” or “trends”\nthat underlie the evolution of history. (1957 [1964: 2–4, 39,\n128–30])\n\nPopper’s title alludes to Marx’s The Poverty of Philosophy\n(1847), which, in turn, responded to Proudhon’s The Philosophy of\nPoverty (1847). Popper thereby signaled his intention to\nformulate a philosophico-methodological criticism of Marxist and, by\nextension, Hegelian philosophy of history. The term\n“historicism”signifies here both “historism”\n(in the German sense of Historismus in connection with\nWindelband, Rickert, Dilthey, Meinecke—by way of Herder and\nGoethe—Mannheim and Troeltsch), and “historicism”\n(in the Italian sense of Storicismo as formulated by\nBenedetto Croce). In tracing the term to both Herder and Goethe,\nMeinecke perceived their emphasis on the “concrete”, the\n“unique” and the “individual” as constituting\nthe core of historicism. Through this emphasis, historicism,\nunderstood as an outlook on the world (Weltanschauung),\nemphasizes the historical quality of human existence; as an\ninterpretation of history and life, it concerns itself with concepts\nof individuality and with individual development. Historicism seeks to\ndescribe and interpret the unsystematic variety of the reality of\nsociety and history, for the concept of individuality not only\nembraces individual persons but also includes the variety of\nhistorical forms, such as different peoples, customs, cultures,\ninstitutions, nation-states and the like; and the concept of\ndevelopment includes the historical process—at a particular time\nand place—within which individuality manifests itself not by\nabstract, general laws or principles but by the living expressions of\nthe multiplicity of these unique historical forms. Individuality, the\n“fact of change”, and the historical process, the\nWeltanschauung of historicism, combine to formulate a sort of\nhistorical relativism. This signification of historical phenomena\nentails the sense in which historical knowledge and reality are\nexplained by Dilthey:\n\n\nThe historical consciousness of the finitude of every historical\nphenomenon, every human or social state, of the relativity of every\nsort of belief, is the last step toward the liberation of man. With\nit, man attains the sovereign power to wring from every experience its\ncontent, to surrender wholly to it without prepossession….\nEvery beauty, every sanctity, every sacrifice, re-lived and expounded,\nopens up perspectives which disclose a reality…. And, in\ncontrast with the relativity, the continuity of the creative force\nmakes itself feel as the central historical fact. (quoted in Hodges\n1944: 33–34).\n\n\nThe historicist orientation of Croce contributed to Ortega’s shift\nfrom the historicization of life to the historicization of philosophy.\nOrtega’s aspirations concerning the interpenetration of history and\nphilosophy were conveyed in his 1929 lectures:\n\n\nI hope, for very concrete reasons, that in our age the curiosity for\nthe eternal and invariable which is philosophy and the curiosity for\nthe inconstant and changeable which is history, for the first time\njoin each other and embrace. (Obras, VII: 285)\n\n\nOrtega’s view that “historical thinking proceeds with respect to\nhuman phenomena”, which combined with his notion of the vital\ndimensions of “historical reason”, reveals some of the\naffinities in their historical thought. Croce and Ortega both viewed\nhuman life as embodying an essentially historical process within which\nthe realm of human reality is perceived and understood. Historical\nknowledge is found in the flow of the historical process, and\nknowledge of this very process provides an essential understanding of\nhuman reality. Where history, for Croce, consists in the\n“inseparable synthesis of individual and universal”,\nhistory, for Ortega, embodies the “inexorable chain” of\nhuman experiences and is constituted by the synthetic function of\n“historical reason”. In this connection, both historicist\nand rationalist elements of coherence, for Ortega, were\nemphasized in his formulation of historicism. Traversing\nfrom philosophy to history and then back again to philosophy, Croce\npresented his systematic “Philosophy of the Spirit” as\nabsolute historicism. He formulated his systematic treatment of the\n“Philosophy of the Spirit” in four volumes and devoted one\nvolume of this general position to historical thought (Croce 1917\n[1920: 60–61]). History, in this connection, provides the\nimportant function of synthesizing the theoretical and practical\nlevels of human activity, the universal and the particular, as well as\nthought and action. From the point of view of these levels of human\nactivity, historical knowledge provides information about what\nactually happened on particular occasions at a particular place and\nunder a clearly specified period of time. History encompasses not only\nconcrete individual developments and concepts of individuality, but\nalso encompasses the “universal”. For Croce, individuality\nconstitutes the historical process within which an advance towards the\nuniversal occurs and, in this context, the general is identified with\nwhat the individual experiences directly. The historical process\nbecomes the expression of the “inseparable synthesis of\nindividual and universal” and, as such, establishes for Croce\nthe “identity of philosophy with history”. Croce viewed\nany philosophical problem identical to historical synthetic judgments\nwhen restored to the historical context that gave rise to the question\nwe attempt to answer. As the synthesis of the individual and the\nuniversal, history possesses the most complete form of knowledge.\nIndeed, for Croce, as well as for Collingwood-- the philosopher\nwith whom Croce’s name often has been\nassociated-- “history is thought” (Collingwood 1948\n[1956: 215,245, 247–48]). From the theoretical perspective, thought\nestablishes connections between sensory-perception, intuition, and\nconcepts, whereas history synthesizes the aesthetic, logical and\npractical levels of human activity. Theoretic activity consists of\nknowledge while practical activity is characterized by volition, and\nthereby within this perspective knowledge is the precondition of\naction (Croce 1917 [1920: 60–61; 94–107]; 1909 [1913:\n33]).\n",
    "section_title": "5. Perspectivism: Human Life, Vital Reason and Historicism",
    "entry_title": "José Ortega y Gasset",
    "hierarchy_title": "José Ortega y Gasset || Perspectivism: Human Life, Vital Reason and Historicism",
    "tokenized_text": [
        "perspectivism",
        "human",
        "life",
        "vital",
        "reason",
        "historicism",
        "perspectivism",
        "human",
        "life",
        "vital",
        "reason",
        "historicism",
        "doctrine",
        "perspectivism",
        "expounds",
        "proposition",
        "historical",
        "epoch",
        "participate",
        "contributing",
        "element",
        "truth",
        "reality",
        "individual",
        "collection",
        "individual",
        "apprehend",
        "reality",
        "point",
        "view",
        "respective",
        "perception",
        "reality",
        "varying",
        "perception",
        "reality",
        "legitimate",
        "account",
        "postulate",
        "different",
        "individual",
        "interpret",
        "horizon",
        "differently",
        "every",
        "life",
        "point",
        "view",
        "directed",
        "upon",
        "universe",
        "obras",
        "iii",
        "ortega",
        "perspectivist",
        "postulate",
        "thus",
        "promised",
        "perform",
        "function",
        "unifying",
        "reality",
        "assumption",
        "perspective",
        "comprises",
        "one",
        "component",
        "part",
        "reality",
        "organizing",
        "element",
        "ortega",
        "arrived",
        "position",
        "knowledge",
        "knowledge",
        "definite",
        "point",
        "view",
        "obras",
        "iii",
        "hence",
        "every",
        "truth",
        "connects",
        "place",
        "space",
        "time",
        "locating",
        "truth",
        "space",
        "time",
        "derived",
        "mode",
        "perception",
        "essence",
        "reality",
        "ortega",
        "perceived",
        "perspectivist",
        "mode",
        "apprehending",
        "reality",
        "philosophical",
        "analogue",
        "einstein",
        "physic",
        "subsequently",
        "invited",
        "comparison",
        "philosophy",
        "perspectivism",
        "einstein",
        "special",
        "theory",
        "relativity",
        "ortega",
        "essay",
        "historical",
        "significance",
        "einstein",
        "theory",
        "pointed",
        "parallel",
        "tendency",
        "new",
        "mode",
        "twentieth",
        "century",
        "thinking",
        "einstein",
        "theory",
        "relativity",
        "characterized",
        "important",
        "intellectual",
        "fact",
        "present",
        "show",
        "obras",
        "iii",
        "dissolving",
        "entire",
        "edifice",
        "classical",
        "mechanic",
        "einstein",
        "theory",
        "ushered",
        "twentieth",
        "century",
        "present",
        "time",
        "much",
        "manner",
        "descartes",
        "philosophy",
        "prepared",
        "thought",
        "modern",
        "era",
        "obras",
        "iii",
        "ortega",
        "idea",
        "historical",
        "significance",
        "relativity",
        "derived",
        "primarily",
        "einstein",
        "discussion",
        "special",
        "theory",
        "drawn",
        "comparing",
        "theory",
        "relativity",
        "philosophy",
        "perspectivism",
        "relativity",
        "appeared",
        "furnish",
        "scientific",
        "proof",
        "perspectivist",
        "truth",
        "formulated",
        "el",
        "espectador",
        "obras",
        "iii",
        "see",
        "also",
        "ii",
        "ortega",
        "perspectivist",
        "doctrine",
        "synthetic",
        "principle",
        "also",
        "implied",
        "doctrine",
        "one",
        "may",
        "attempt",
        "order",
        "world",
        "point",
        "view",
        "life",
        "obras",
        "iii",
        "principle",
        "human",
        "life",
        "constituted",
        "reality",
        "human",
        "experience",
        "became",
        "philosophical",
        "category",
        "ortega",
        "synthesized",
        "universe",
        "correspondingly",
        "sign",
        "time",
        "also",
        "pointed",
        "important",
        "role",
        "played",
        "nietzsche",
        "croce",
        "dilthey",
        "heidegger",
        "well",
        "freud",
        "husserl",
        "formation",
        "twentiethcentury",
        "thought",
        "emphasis",
        "placed",
        "upon",
        "vital",
        "world",
        "life",
        "took",
        "ortega",
        "step",
        "beyond",
        "neokantian",
        "transcendental",
        "logic",
        "cohen",
        "ortega",
        "combined",
        "idea",
        "human",
        "life",
        "emphasis",
        "history",
        "constituting",
        "vital",
        "dynamic",
        "expression",
        "viewpoint",
        "carried",
        "closer",
        "humanistic",
        "side",
        "naturwissenschaftengeisteswissenschaften",
        "distinction",
        "made",
        "southwest",
        "german",
        "baden",
        "school",
        "dilthey",
        "cohen",
        "neokantianism",
        "striking",
        "similarity",
        "historicist",
        "focus",
        "windelband",
        "rickert",
        "dilthey",
        "early",
        "historical",
        "thought",
        "croce",
        "historical",
        "thought",
        "ortega",
        "suggest",
        "ortega",
        "influenced",
        "idea",
        "directly",
        "indirectly",
        "historical",
        "idea",
        "windelband",
        "rickert",
        "reflected",
        "european",
        "intellectual",
        "current",
        "paralleled",
        "ortega",
        "intellectual",
        "development",
        "dilthey",
        "acknowledged",
        "ortega",
        "influenced",
        "intellectual",
        "focus",
        "directly",
        "croce",
        "early",
        "historical",
        "idea",
        "appeared",
        "exerted",
        "influence",
        "historical",
        "thought",
        "ortega",
        "essay",
        "wilhelm",
        "dilthey",
        "idea",
        "life",
        "twentyseven",
        "year",
        "study",
        "berlin",
        "ortega",
        "wrote",
        "dilthey",
        "importance",
        "intellectual",
        "development",
        "misfortune",
        "exposed",
        "idea",
        "dilthey",
        "earlier",
        "student",
        "became",
        "acquainted",
        "dilthey",
        "work",
        "late",
        "took",
        "four",
        "year",
        "knew",
        "sufficiently",
        "well",
        "ignorance",
        "hesitate",
        "maintain",
        "caused",
        "lose",
        "ten",
        "year",
        "lifeten",
        "year",
        "first",
        "place",
        "intellectual",
        "development",
        "course",
        "mean",
        "equal",
        "loss",
        "dimension",
        "life",
        "studied",
        "berlin",
        "dilthey",
        "happened",
        "given",
        "lecturing",
        "university",
        "building",
        "year",
        "admitted",
        "course",
        "held",
        "home",
        "specially",
        "prepared",
        "student",
        "thus",
        "chance",
        "come",
        "touch",
        "obras",
        "vi",
        "late",
        "s",
        "early",
        "s",
        "however",
        "ortega",
        "incorporate",
        "idea",
        "human",
        "life",
        "philosophic",
        "viewpoint",
        "year",
        "labeled",
        "philosophy",
        "metaphysics",
        "vital",
        "reason",
        "signify",
        "continuous",
        "search",
        "structure",
        "life",
        "would",
        "transcendent",
        "relation",
        "every",
        "existing",
        "reality",
        "yet",
        "located",
        "within",
        "framework",
        "temporal",
        "spatial",
        "reality",
        "like",
        "dilthey",
        "considered",
        "important",
        "thinker",
        "second",
        "half",
        "nineteenth",
        "century",
        "denied",
        "truth",
        "constant",
        "principle",
        "establishes",
        "superior",
        "flux",
        "life",
        "including",
        "physical",
        "biological",
        "science",
        "dilthey",
        "lebensphilosophie",
        "emphasizes",
        "openness",
        "experience",
        "denies",
        "notion",
        "abstract",
        "transcendental",
        "reality",
        "also",
        "considers",
        "life",
        "mere",
        "biological",
        "organism",
        "concept",
        "life",
        "biological",
        "sense",
        "ortega",
        "notion",
        "human",
        "life",
        "resembles",
        "dilthey",
        "ortega",
        "life",
        "in",
        "biographical",
        "biological",
        "senseis",
        "question",
        "happens",
        "find",
        "shipwrecked",
        "precarious",
        "sea",
        "circumstance",
        "individual",
        "point",
        "view",
        "save",
        "sinking",
        "inner",
        "depth",
        "make",
        "effort",
        "hold",
        "consciousness",
        "essence",
        "life",
        "live",
        "maintained",
        "deal",
        "world",
        "aim",
        "act",
        "occupied",
        "obras",
        "v",
        "vii",
        "dilthey",
        "life",
        "realized",
        "empirically",
        "within",
        "experiential",
        "process",
        "consciousness",
        "lived",
        "experience",
        "give",
        "experience",
        "individual",
        "life",
        "reality",
        "dilthey",
        "position",
        "like",
        "bergson",
        "contains",
        "vitalist",
        "viewpoint",
        "experience",
        "life",
        "mind",
        "direct",
        "experience",
        "life",
        "exists",
        "therefore",
        "perceived",
        "mechanistic",
        "physiological",
        "explanation",
        "human",
        "organism",
        "subjective",
        "neoidealistic",
        "logical",
        "principle",
        "emphasis",
        "active",
        "dynamic",
        "historical",
        "dimension",
        "human",
        "social",
        "phenomenon",
        "realized",
        "within",
        "lived",
        "experience",
        "life",
        "reveal",
        "vitalization",
        "philosophy",
        "historicization",
        "life",
        "perspective",
        "reflective",
        "historicism",
        "attitude",
        "historical",
        "knowledge",
        "unique",
        "realm",
        "human",
        "affair",
        "historicism",
        "comprises",
        "perspective",
        "perceived",
        "ortega",
        "notion",
        "dynamic",
        "dialogue",
        "drama",
        "lifeworld",
        "individual",
        "historicism",
        "used",
        "polemical",
        "extreme",
        "characterized",
        "karl",
        "popper",
        "charge",
        "historicism",
        "incompatible",
        "form",
        "genuine",
        "science",
        "poverty",
        "historicism",
        "describes",
        "criticizes",
        "antinaturalist",
        "pronaturalist",
        "doctrine",
        "historicism",
        "popper",
        "charge",
        "former",
        "doctrine",
        "theology",
        "holism",
        "charge",
        "latter",
        "doctrine",
        "advancing",
        "notion",
        "historical",
        "prediction",
        "principal",
        "objective",
        "something",
        "becomes",
        "attainable",
        "discovering",
        "rhythm",
        "pattern",
        "law",
        "trend",
        "underlie",
        "evolution",
        "history",
        "popper",
        "title",
        "alludes",
        "marx",
        "poverty",
        "philosophy",
        "turn",
        "responded",
        "proudhon",
        "philosophy",
        "poverty",
        "popper",
        "thereby",
        "signaled",
        "intention",
        "formulate",
        "philosophicomethodological",
        "criticism",
        "marxist",
        "extension",
        "hegelian",
        "philosophy",
        "history",
        "term",
        "historicism",
        "signifies",
        "historism",
        "german",
        "sense",
        "historismus",
        "connection",
        "windelband",
        "rickert",
        "dilthey",
        "meineckeby",
        "way",
        "herder",
        "goethemannheim",
        "troeltsch",
        "historicism",
        "italian",
        "sense",
        "storicismo",
        "formulated",
        "benedetto",
        "croce",
        "tracing",
        "term",
        "herder",
        "goethe",
        "meinecke",
        "perceived",
        "emphasis",
        "concrete",
        "unique",
        "individual",
        "constituting",
        "core",
        "historicism",
        "emphasis",
        "historicism",
        "understood",
        "outlook",
        "world",
        "weltanschauung",
        "emphasizes",
        "historical",
        "quality",
        "human",
        "existence",
        "interpretation",
        "history",
        "life",
        "concern",
        "concept",
        "individuality",
        "individual",
        "development",
        "historicism",
        "seek",
        "describe",
        "interpret",
        "unsystematic",
        "variety",
        "reality",
        "society",
        "history",
        "concept",
        "individuality",
        "embrace",
        "individual",
        "person",
        "also",
        "includes",
        "variety",
        "historical",
        "form",
        "different",
        "people",
        "custom",
        "culture",
        "institution",
        "nationstates",
        "like",
        "concept",
        "development",
        "includes",
        "historical",
        "processat",
        "particular",
        "time",
        "placewithin",
        "individuality",
        "manifest",
        "abstract",
        "general",
        "law",
        "principle",
        "living",
        "expression",
        "multiplicity",
        "unique",
        "historical",
        "form",
        "individuality",
        "fact",
        "change",
        "historical",
        "process",
        "weltanschauung",
        "historicism",
        "combine",
        "formulate",
        "sort",
        "historical",
        "relativism",
        "signification",
        "historical",
        "phenomenon",
        "entail",
        "sense",
        "historical",
        "knowledge",
        "reality",
        "explained",
        "dilthey",
        "historical",
        "consciousness",
        "finitude",
        "every",
        "historical",
        "phenomenon",
        "every",
        "human",
        "social",
        "state",
        "relativity",
        "every",
        "sort",
        "belief",
        "last",
        "step",
        "toward",
        "liberation",
        "man",
        "man",
        "attains",
        "sovereign",
        "power",
        "wring",
        "every",
        "experience",
        "content",
        "surrender",
        "wholly",
        "without",
        "prepossession",
        "every",
        "beauty",
        "every",
        "sanctity",
        "every",
        "sacrifice",
        "relived",
        "expounded",
        "open",
        "perspective",
        "disclose",
        "reality",
        "contrast",
        "relativity",
        "continuity",
        "creative",
        "force",
        "make",
        "feel",
        "central",
        "historical",
        "fact",
        "quoted",
        "hodges",
        "historicist",
        "orientation",
        "croce",
        "contributed",
        "ortega",
        "shift",
        "historicization",
        "life",
        "historicization",
        "philosophy",
        "ortega",
        "aspiration",
        "concerning",
        "interpenetration",
        "history",
        "philosophy",
        "conveyed",
        "lecture",
        "hope",
        "concrete",
        "reason",
        "age",
        "curiosity",
        "eternal",
        "invariable",
        "philosophy",
        "curiosity",
        "inconstant",
        "changeable",
        "history",
        "first",
        "time",
        "join",
        "embrace",
        "obras",
        "vii",
        "ortega",
        "view",
        "historical",
        "thinking",
        "proceeds",
        "respect",
        "human",
        "phenomenon",
        "combined",
        "notion",
        "vital",
        "dimension",
        "historical",
        "reason",
        "reveals",
        "affinity",
        "historical",
        "thought",
        "croce",
        "ortega",
        "viewed",
        "human",
        "life",
        "embodying",
        "essentially",
        "historical",
        "process",
        "within",
        "realm",
        "human",
        "reality",
        "perceived",
        "understood",
        "historical",
        "knowledge",
        "found",
        "flow",
        "historical",
        "process",
        "knowledge",
        "process",
        "provides",
        "essential",
        "understanding",
        "human",
        "reality",
        "history",
        "croce",
        "consists",
        "inseparable",
        "synthesis",
        "individual",
        "universal",
        "history",
        "ortega",
        "embodies",
        "inexorable",
        "chain",
        "human",
        "experience",
        "constituted",
        "synthetic",
        "function",
        "historical",
        "reason",
        "connection",
        "historicist",
        "rationalist",
        "element",
        "coherence",
        "ortega",
        "emphasized",
        "formulation",
        "historicism",
        "traversing",
        "philosophy",
        "history",
        "back",
        "philosophy",
        "croce",
        "presented",
        "systematic",
        "philosophy",
        "spirit",
        "absolute",
        "historicism",
        "formulated",
        "systematic",
        "treatment",
        "philosophy",
        "spirit",
        "four",
        "volume",
        "devoted",
        "one",
        "volume",
        "general",
        "position",
        "historical",
        "thought",
        "croce",
        "history",
        "connection",
        "provides",
        "important",
        "function",
        "synthesizing",
        "theoretical",
        "practical",
        "level",
        "human",
        "activity",
        "universal",
        "particular",
        "well",
        "thought",
        "action",
        "point",
        "view",
        "level",
        "human",
        "activity",
        "historical",
        "knowledge",
        "provides",
        "information",
        "actually",
        "happened",
        "particular",
        "occasion",
        "particular",
        "place",
        "clearly",
        "specified",
        "period",
        "time",
        "history",
        "encompasses",
        "concrete",
        "individual",
        "development",
        "concept",
        "individuality",
        "also",
        "encompasses",
        "universal",
        "croce",
        "individuality",
        "constitutes",
        "historical",
        "process",
        "within",
        "advance",
        "towards",
        "universal",
        "occurs",
        "context",
        "general",
        "identified",
        "individual",
        "experience",
        "directly",
        "historical",
        "process",
        "becomes",
        "expression",
        "inseparable",
        "synthesis",
        "individual",
        "universal",
        "establishes",
        "croce",
        "identity",
        "philosophy",
        "history",
        "croce",
        "viewed",
        "philosophical",
        "problem",
        "identical",
        "historical",
        "synthetic",
        "judgment",
        "restored",
        "historical",
        "context",
        "gave",
        "rise",
        "question",
        "attempt",
        "answer",
        "synthesis",
        "individual",
        "universal",
        "history",
        "posse",
        "complete",
        "form",
        "knowledge",
        "indeed",
        "croce",
        "well",
        "collingwood",
        "philosopher",
        "croce",
        "name",
        "often",
        "associated",
        "history",
        "thought",
        "collingwood",
        "theoretical",
        "perspective",
        "thought",
        "establishes",
        "connection",
        "sensoryperception",
        "intuition",
        "concept",
        "whereas",
        "history",
        "synthesizes",
        "aesthetic",
        "logical",
        "practical",
        "level",
        "human",
        "activity",
        "theoretic",
        "activity",
        "consists",
        "knowledge",
        "practical",
        "activity",
        "characterized",
        "volition",
        "thereby",
        "within",
        "perspective",
        "knowledge",
        "precondition",
        "action",
        "croce"
    ]
}