{
    "main_text": "Globalization in the History of Ideas\n1. Globalization in the History of Ideas\n\nThe term globalization has only become commonplace in the last three\ndecades, and academic commentators who employed the term as late as\nthe 1970s accurately recognized the novelty of doing so (Modelski\n1972). At least since the advent of industrial capitalism, however,\nintellectual discourse has been replete with allusions to phenomena\nstrikingly akin to those that have garnered the attention of recent\ntheorists of globalization. Nineteenth and twentieth-century\nphilosophy, literature, and social commentary include numerous\nreferences to an inchoate yet widely shared awareness that experiences\nof distance and space are inevitably transformed by the emergence of\nhigh-speed forms of transportation (for example, rail and air travel)\nand communication (the telegraph or telephone) that dramatically\nheighten possibilities for human interaction across existing\ngeographical and political divides (Harvey 1989; Kern 1983). Long\nbefore the introduction of the term globalization into recent popular\nand scholarly debate, the appearance of novel high-speed forms of\nsocial activity generated extensive commentary about the compression\nof space.\n\nWriting in 1839, an English journalist commented on the implications\nof rail travel by anxiously postulating that as distance was\n“annihilated, the surface of our country would, as it were,\nshrivel in size until it became not much bigger than one immense\ncity” (Harvey 1996, 242). A few years later, Heinrich Heine, the\némigré German-Jewish poet, captured this same experience\nwhen he noted: “space is killed by the railways. I feel as if\nthe mountains and forests of all countries were advancing on Paris.\nEven now, I can smell the German linden trees; the North Sea’s\nbreakers are rolling against my door” (Schivelbusch 1978, 34).\nAnother young German émigré, the socialist theorist Karl\nMarx, in 1848 formulated the first theoretical explanation of the\nsense of territorial compression that so fascinated his\ncontemporaries. In Marx’s account, the imperatives of capitalist\nproduction inevitably drove the bourgeoisie to “nestle\neverywhere, settle everywhere, and establish connections\neverywhere.” The juggernaut of industrial capitalism constituted\nthe most basic source of technologies resulting in the annihilation of\nspace, helping to pave the way for “intercourse in every\ndirection, universal interdependence of nations,” in contrast to\na narrow-minded provincialism that had plagued humanity for untold\neons (Marx 1848, 476). Despite their ills as instruments of capitalist\nexploitation, Marx argued, new technologies that increased\npossibilities for human interaction across borders ultimately\nrepresented a progressive force in history. They provided the\nnecessary infrastructure for a cosmopolitan future socialist\ncivilization, while simultaneously functioning in the present as\nindispensable organizational tools for a working class destined to\nundertake a revolution no less oblivious to traditional territorial\ndivisions than the system of capitalist exploitation it hoped to\ndismantle.\n\nEuropean intellectuals have hardly been alone in their fascination\nwith the experience of territorial compression, as evinced by the key\nrole played by the same theme in early twentieth-century American\nthought. In 1904, the literary figure Henry Adams diagnosed the\nexistence of a “law of acceleration,” fundamental to the\nworkings of social development, in order to make sense of the rapidly\nchanging spatial and temporal contours of human activity. Modern\nsociety could only be properly understood if the seemingly\nirrepressible acceleration of basic technological and social processes\nwas given a central place in social and historical analysis (Adams\n1931 [1904]). John Dewey argued in 1927 that recent economic and\ntechnological trends implied the emergence of a “new\nworld” no less noteworthy than the opening up of America to\nEuropean exploration and conquest in 1492. For Dewey, the invention of\nsteam, electricity, and the telephone offered formidable challenges to\nrelatively static and homogeneous forms of local community life that\nhad long represented the main theatre for most human activity.\nEconomic activity increasingly exploded the confines of local\ncommunities to a degree that would have stunned our historical\npredecessors, for example, while the steamship, railroad, automobile,\nand air travel considerably intensified rates of geographical\nmobility. Dewey went beyond previous discussions of the changing\ntemporal and spatial contours of human activity, however, by\nsuggesting that the compression of space posed fundamental questions\nfor democracy. Dewey observed that small-scale political communities\n(for example, the New England township), a crucial site for the\nexercise of effective democratic participation, seemed ever more\nperipheral to the great issues of an interconnected world.\nIncreasingly dense networks of social ties across borders rendered\nlocal forms of self-government ineffective. Dewey wondered, “How\ncan a public be organized, we may ask, when literally it does not stay\nin place?” (Dewey 1927, 140). To the extent that democratic\ncitizenship minimally presupposes the possibility of action in concert\nwith others, how might citizenship be sustained in a social world\nsubject to ever more astonishing possibilities for movement and\nmobility? New high-speed technologies attributed a shifting and\nunstable character to social life, as demonstrated by increased rates\nof change and turnover in many arenas of activity (most important\nperhaps, the economy) directly affected by them, and the relative\nfluidity and inconstancy of social relations there. If citizenship\nrequires some modicum of constancy and stability in social life,\nhowever, did not recent changes in the temporal and spatial conditions\nof human activity bode poorly for political participation? How might\ncitizens come together and act in concert when contemporary\nsociety’s “mania for motion and speed” made it\ndifficult for them even to get acquainted with one another, let alone\nidentify objects of common concern? (Dewey 1927, 140).\n\nThe unabated proliferation of high-speed technologies is probably the\nmain source of the numerous references in intellectual life since 1950\nto the annihilation of distance. The Canadian cultural critic Marshall\nMcLuhan made the theme of a technologically based “global\nvillage,” generated by social “acceleration at all levels\nof human organization,” the centerpiece of an anxiety-ridden\nanalysis of new media technologies in the 1960s (McLuhan 1964, 103).\nArguing in the 1970s and 1980s that recent shifts in the spatial and\ntemporal contours of social life exacerbated authoritarian political\ntrends, the French social critic Paul Virilio seemed to confirm many\nof Dewey’s darkest worries about the decay of democracy.\nAccording to his analysis, the high-speed imperatives of modern\nwarfare and weapons systems strengthened the executive and debilitated\nrepresentative legislatures. The compression of territory thereby\npaved the way for executive-centered emergency government (Virilio\n1977). But it was probably the German philosopher Martin Heidegger who\nmost clearly anticipated contemporary debates about globalization.\nHeidegger not only described the “abolition of distance”\nas a constitutive feature of our contemporary condition, but he linked\nrecent shifts in spatial experience to no less fundamental alterations\nin the temporality of human activity: “All distances in time and\nspace are shrinking. Man now reaches overnight, by places, places\nwhich formerly took weeks and months of travel” (Heidegger 1950,\n165). Heidegger also accurately prophesied that new communication and\ninformation technologies would soon spawn novel possibilities for\ndramatically extending the scope of virtual reality:\n“Distant sites of the most ancient cultures are shown on film as\nif they stood this very moment amidst today’s street\ntraffic…The peak of this abolition of every possibility of\nremoteness is reached by television, which will soon pervade and\ndominate the whole machinery of communication” (Heidegger 1950,\n165). Heidegger’s description of growing possibilities for\nsimultaneity and instantaneousness in human experience ultimately\nproved no less apprehensive than the views of many of his\npredecessors. In his analysis, the compression of space increasingly\nmeant that from the perspective of human experience “everything\nis equally far and equally near.” Instead of opening up new\npossibilities for rich and multi-faceted interaction with events once\ndistant from the purview of most individuals, the abolition of\ndistance tended to generate a “uniform distanceless” in\nwhich fundamentally distinct objects became part of a bland\nhomogeneous experiential mass (Heidegger 1950, 166). The loss of any\nmeaningful distinction between “nearness” and\n“distance” contributed to a leveling down of human\nexperience, which in turn spawned an indifference that rendered human\nexperience monotonous and one-dimensional.\n",
    "section_title": "1. Globalization in the History of Ideas",
    "entry_title": "Globalization",
    "hierarchy_title": "Globalization || Globalization in the History of Ideas",
    "tokenized_text": [
        "globalization",
        "history",
        "idea",
        "globalization",
        "history",
        "idea",
        "term",
        "globalization",
        "become",
        "commonplace",
        "last",
        "three",
        "decade",
        "academic",
        "commentator",
        "employed",
        "term",
        "late",
        "s",
        "accurately",
        "recognized",
        "novelty",
        "modelski",
        "least",
        "since",
        "advent",
        "industrial",
        "capitalism",
        "however",
        "intellectual",
        "discourse",
        "replete",
        "allusion",
        "phenomenon",
        "strikingly",
        "akin",
        "garnered",
        "attention",
        "recent",
        "theorist",
        "globalization",
        "nineteenth",
        "twentiethcentury",
        "philosophy",
        "literature",
        "social",
        "commentary",
        "include",
        "numerous",
        "reference",
        "inchoate",
        "yet",
        "widely",
        "shared",
        "awareness",
        "experience",
        "distance",
        "space",
        "inevitably",
        "transformed",
        "emergence",
        "highspeed",
        "form",
        "transportation",
        "example",
        "rail",
        "air",
        "travel",
        "communication",
        "telegraph",
        "telephone",
        "dramatically",
        "heighten",
        "possibility",
        "human",
        "interaction",
        "across",
        "existing",
        "geographical",
        "political",
        "divide",
        "harvey",
        "kern",
        "long",
        "introduction",
        "term",
        "globalization",
        "recent",
        "popular",
        "scholarly",
        "debate",
        "appearance",
        "novel",
        "highspeed",
        "form",
        "social",
        "activity",
        "generated",
        "extensive",
        "commentary",
        "compression",
        "space",
        "writing",
        "english",
        "journalist",
        "commented",
        "implication",
        "rail",
        "travel",
        "anxiously",
        "postulating",
        "distance",
        "annihilated",
        "surface",
        "country",
        "would",
        "shrivel",
        "size",
        "became",
        "much",
        "bigger",
        "one",
        "immense",
        "city",
        "harvey",
        "year",
        "later",
        "heinrich",
        "heine",
        "émigré",
        "germanjewish",
        "poet",
        "captured",
        "experience",
        "noted",
        "space",
        "killed",
        "railway",
        "feel",
        "mountain",
        "forest",
        "country",
        "advancing",
        "paris",
        "even",
        "smell",
        "german",
        "linden",
        "tree",
        "north",
        "sea",
        "breaker",
        "rolling",
        "door",
        "schivelbusch",
        "another",
        "young",
        "german",
        "émigré",
        "socialist",
        "theorist",
        "karl",
        "marx",
        "formulated",
        "first",
        "theoretical",
        "explanation",
        "sense",
        "territorial",
        "compression",
        "fascinated",
        "contemporary",
        "marx",
        "account",
        "imperative",
        "capitalist",
        "production",
        "inevitably",
        "drove",
        "bourgeoisie",
        "nestle",
        "everywhere",
        "settle",
        "everywhere",
        "establish",
        "connection",
        "everywhere",
        "juggernaut",
        "industrial",
        "capitalism",
        "constituted",
        "basic",
        "source",
        "technology",
        "resulting",
        "annihilation",
        "space",
        "helping",
        "pave",
        "way",
        "intercourse",
        "every",
        "direction",
        "universal",
        "interdependence",
        "nation",
        "contrast",
        "narrowminded",
        "provincialism",
        "plagued",
        "humanity",
        "untold",
        "eon",
        "marx",
        "despite",
        "ill",
        "instrument",
        "capitalist",
        "exploitation",
        "marx",
        "argued",
        "new",
        "technology",
        "increased",
        "possibility",
        "human",
        "interaction",
        "across",
        "border",
        "ultimately",
        "represented",
        "progressive",
        "force",
        "history",
        "provided",
        "necessary",
        "infrastructure",
        "cosmopolitan",
        "future",
        "socialist",
        "civilization",
        "simultaneously",
        "functioning",
        "present",
        "indispensable",
        "organizational",
        "tool",
        "working",
        "class",
        "destined",
        "undertake",
        "revolution",
        "le",
        "oblivious",
        "traditional",
        "territorial",
        "division",
        "system",
        "capitalist",
        "exploitation",
        "hoped",
        "dismantle",
        "european",
        "intellectual",
        "hardly",
        "alone",
        "fascination",
        "experience",
        "territorial",
        "compression",
        "evinced",
        "key",
        "role",
        "played",
        "theme",
        "early",
        "twentiethcentury",
        "american",
        "thought",
        "literary",
        "figure",
        "henry",
        "adam",
        "diagnosed",
        "existence",
        "law",
        "acceleration",
        "fundamental",
        "working",
        "social",
        "development",
        "order",
        "make",
        "sense",
        "rapidly",
        "changing",
        "spatial",
        "temporal",
        "contour",
        "human",
        "activity",
        "modern",
        "society",
        "could",
        "properly",
        "understood",
        "seemingly",
        "irrepressible",
        "acceleration",
        "basic",
        "technological",
        "social",
        "process",
        "given",
        "central",
        "place",
        "social",
        "historical",
        "analysis",
        "adam",
        "john",
        "dewey",
        "argued",
        "recent",
        "economic",
        "technological",
        "trend",
        "implied",
        "emergence",
        "new",
        "world",
        "le",
        "noteworthy",
        "opening",
        "america",
        "european",
        "exploration",
        "conquest",
        "dewey",
        "invention",
        "steam",
        "electricity",
        "telephone",
        "offered",
        "formidable",
        "challenge",
        "relatively",
        "static",
        "homogeneous",
        "form",
        "local",
        "community",
        "life",
        "long",
        "represented",
        "main",
        "theatre",
        "human",
        "activity",
        "economic",
        "activity",
        "increasingly",
        "exploded",
        "confines",
        "local",
        "community",
        "degree",
        "would",
        "stunned",
        "historical",
        "predecessor",
        "example",
        "steamship",
        "railroad",
        "automobile",
        "air",
        "travel",
        "considerably",
        "intensified",
        "rate",
        "geographical",
        "mobility",
        "dewey",
        "went",
        "beyond",
        "previous",
        "discussion",
        "changing",
        "temporal",
        "spatial",
        "contour",
        "human",
        "activity",
        "however",
        "suggesting",
        "compression",
        "space",
        "posed",
        "fundamental",
        "question",
        "democracy",
        "dewey",
        "observed",
        "smallscale",
        "political",
        "community",
        "example",
        "new",
        "england",
        "township",
        "crucial",
        "site",
        "exercise",
        "effective",
        "democratic",
        "participation",
        "seemed",
        "ever",
        "peripheral",
        "great",
        "issue",
        "interconnected",
        "world",
        "increasingly",
        "dense",
        "network",
        "social",
        "tie",
        "across",
        "border",
        "rendered",
        "local",
        "form",
        "selfgovernment",
        "ineffective",
        "dewey",
        "wondered",
        "public",
        "organized",
        "may",
        "ask",
        "literally",
        "stay",
        "place",
        "dewey",
        "extent",
        "democratic",
        "citizenship",
        "minimally",
        "presupposes",
        "possibility",
        "action",
        "concert",
        "others",
        "might",
        "citizenship",
        "sustained",
        "social",
        "world",
        "subject",
        "ever",
        "astonishing",
        "possibility",
        "movement",
        "mobility",
        "new",
        "highspeed",
        "technology",
        "attributed",
        "shifting",
        "unstable",
        "character",
        "social",
        "life",
        "demonstrated",
        "increased",
        "rate",
        "change",
        "turnover",
        "many",
        "arena",
        "activity",
        "important",
        "perhaps",
        "economy",
        "directly",
        "affected",
        "relative",
        "fluidity",
        "inconstancy",
        "social",
        "relation",
        "citizenship",
        "requires",
        "modicum",
        "constancy",
        "stability",
        "social",
        "life",
        "however",
        "recent",
        "change",
        "temporal",
        "spatial",
        "condition",
        "human",
        "activity",
        "bode",
        "poorly",
        "political",
        "participation",
        "might",
        "citizen",
        "come",
        "together",
        "act",
        "concert",
        "contemporary",
        "society",
        "mania",
        "motion",
        "speed",
        "made",
        "difficult",
        "even",
        "get",
        "acquainted",
        "one",
        "another",
        "let",
        "alone",
        "identify",
        "object",
        "common",
        "concern",
        "dewey",
        "unabated",
        "proliferation",
        "highspeed",
        "technology",
        "probably",
        "main",
        "source",
        "numerous",
        "reference",
        "intellectual",
        "life",
        "since",
        "annihilation",
        "distance",
        "canadian",
        "cultural",
        "critic",
        "marshall",
        "mcluhan",
        "made",
        "theme",
        "technologically",
        "based",
        "global",
        "village",
        "generated",
        "social",
        "acceleration",
        "level",
        "human",
        "organization",
        "centerpiece",
        "anxietyridden",
        "analysis",
        "new",
        "medium",
        "technology",
        "s",
        "mcluhan",
        "arguing",
        "s",
        "s",
        "recent",
        "shift",
        "spatial",
        "temporal",
        "contour",
        "social",
        "life",
        "exacerbated",
        "authoritarian",
        "political",
        "trend",
        "french",
        "social",
        "critic",
        "paul",
        "virilio",
        "seemed",
        "confirm",
        "many",
        "dewey",
        "darkest",
        "worry",
        "decay",
        "democracy",
        "according",
        "analysis",
        "highspeed",
        "imperative",
        "modern",
        "warfare",
        "weapon",
        "system",
        "strengthened",
        "executive",
        "debilitated",
        "representative",
        "legislature",
        "compression",
        "territory",
        "thereby",
        "paved",
        "way",
        "executivecentered",
        "emergency",
        "government",
        "virilio",
        "probably",
        "german",
        "philosopher",
        "martin",
        "heidegger",
        "clearly",
        "anticipated",
        "contemporary",
        "debate",
        "globalization",
        "heidegger",
        "described",
        "abolition",
        "distance",
        "constitutive",
        "feature",
        "contemporary",
        "condition",
        "linked",
        "recent",
        "shift",
        "spatial",
        "experience",
        "le",
        "fundamental",
        "alteration",
        "temporality",
        "human",
        "activity",
        "distance",
        "time",
        "space",
        "shrinking",
        "man",
        "reach",
        "overnight",
        "place",
        "place",
        "formerly",
        "took",
        "week",
        "month",
        "travel",
        "heidegger",
        "heidegger",
        "also",
        "accurately",
        "prophesied",
        "new",
        "communication",
        "information",
        "technology",
        "would",
        "soon",
        "spawn",
        "novel",
        "possibility",
        "dramatically",
        "extending",
        "scope",
        "virtual",
        "reality",
        "distant",
        "site",
        "ancient",
        "culture",
        "shown",
        "film",
        "stood",
        "moment",
        "amidst",
        "today",
        "street",
        "trafficthe",
        "peak",
        "abolition",
        "every",
        "possibility",
        "remoteness",
        "reached",
        "television",
        "soon",
        "pervade",
        "dominate",
        "whole",
        "machinery",
        "communication",
        "heidegger",
        "heidegger",
        "description",
        "growing",
        "possibility",
        "simultaneity",
        "instantaneousness",
        "human",
        "experience",
        "ultimately",
        "proved",
        "le",
        "apprehensive",
        "view",
        "many",
        "predecessor",
        "analysis",
        "compression",
        "space",
        "increasingly",
        "meant",
        "perspective",
        "human",
        "experience",
        "everything",
        "equally",
        "far",
        "equally",
        "near",
        "instead",
        "opening",
        "new",
        "possibility",
        "rich",
        "multifaceted",
        "interaction",
        "event",
        "distant",
        "purview",
        "individual",
        "abolition",
        "distance",
        "tended",
        "generate",
        "uniform",
        "distanceless",
        "fundamentally",
        "distinct",
        "object",
        "became",
        "part",
        "bland",
        "homogeneous",
        "experiential",
        "mass",
        "heidegger",
        "loss",
        "meaningful",
        "distinction",
        "nearness",
        "distance",
        "contributed",
        "leveling",
        "human",
        "experience",
        "turn",
        "spawned",
        "indifference",
        "rendered",
        "human",
        "experience",
        "monotonous",
        "onedimensional"
    ]
}