{
    "main_text": "Moral Philosophy\n4. Moral Philosophy\n\nOne of the most powerful attacks on Godwin was that made in Dr. Samuel\nParr’s “Spital Sermon” of 1800. It was\nGodwin’s advocacy of universal benevolence against which Parr\ndirected his energies, centring his attack on Godwin’s early\ndismissal of family feeling, gratitude and various natural sentiments.\nFor Godwin, these are passions unconstrained by judgment, and so\nshould not play a role in determining how we should act. He\nexemplifies his case in what has come to be known as the “Famous\nFire Cause”, in which the reader is asked to imagine being able\nto save only one of two people in a fire, one of whom is the\nArchbishop Fénelon, a benefactor to the whole human race, the\nother of whom is the reader’s parent (mother in the first\nedition, father thereafter!). Godwin’s view is that justice\ndemands that we act impartially for the greater good, which means\nsaving Fénelon. He never abandoned this case, nor the view that\nit is our duty to act to bring about the greatest good. Just as a\njudge should not be influenced by familial or private concerns in his\njudgment, so too is the moral agent bound to judge impartially. In\nreplying to Parr, Godwin expresses regret that he had not appealed to\nthe still more persuasive case of Brutus executing his two\nsons—a striking example, and a republican commonplace about\njustice trumping paternal duties. As Godwin says, saving someone just\nbecause they are a relation seems bizarre without some additional\njudgment about their moral worth: a parent who is foolish or evil\ncannot have an over-riding claim on us against the moral deserts of\nall other members of the human race. That position, Godwin retains.\nMoreover, in his Reply to Parr, he insists that these\nextraordinary cases are unlikely to shake the domestic affections in\nthe ordinary intercourse of life. However, from the later editions and\nother works, it becomes clear that he will admit, in the more normal\ncourse of events, a much more substantial role to be played by our\nnatural affections and attachments. They provide us both with\ninformation about how best we might benefit others, and a basic moral\nmotivation which can be relied on in normal cases and which can be\ngeneralised beyond the narrow domestic sphere (a position much\nindebted to Adam Smith’s Theory of Moral Sentiments).\nThese changes are significant: it leaves us a less rationalist, more\nphilosophically robust, account of moral motivation and its\nrelationship to the principle of utility, and it does much to moderate\nthe utopianism of the first edition.\n\nThe impact of these changes on Godwin’s over-all position is\nmore difficult to assess. What we see in the changes is a consistent\nshift away from the rationalist account of moral motivation which\nmarked the first edition to a position which is much more sceptical\nabout the power of reason. This scepticism inevitably moderates\nGodwin’s belief in perfectibility, since it becomes more\ndifficult to argue for convergence on principles of morality and the\nprogressive development of knowledge. It also inevitably undermines\nGodwin’s faith in the triumph of mind over physiological\nprocesses. That said, neither the doctrine of private judgment nor the\nprinciple of utility depend on his earlier rationalism. The former is\ndefended by Godwin on the grounds that only free action has moral\nvalue, and that the fullest possible exercise of private judgment is\nrequired for one’s actions to be free—further evidence of\nGodwin’s attempt to provide an agent-centred account of virtue\nalongside his consequentialism. With this commitment private judgment\nremains defensible even if there is a low probability that its\nexercise will produce true beliefs, so long as no other better method\nof tracking truth is available (which also becomes proportionately\nless likely as one’s scepticism increases). The defence might\nrequire that cognitive status be attributed to moral judgments, but it\nmight also be possible to sustain the argument for private judgment\nindependent of the issue of ethical objectivity. The utility principle\nmight seem to call for an ability to make sound ethical judgments in\ncomplex situations but, again, if we are sceptical about\npeople’s ability to judge well, this does not entail (and seems\nto deny) that there is a better way of judging. On both counts then,\nGodwin’s central principles remain intact despite the changes he\nmakes to the account of moral motivation and judgment. Moreover,\nGodwin’s view of man’s progressive character might be\ndefended by placing greater weight on eliminating the baleful effects\nof the social and political institutions of the European aristocracies\nthan on the epistemological dimensions of the account.\n\nHowever, Godwin’s endorsement of both the principle of utility\nas the sole guide to moral duty and the principle of private judgment\nas a block on the interference of others, is not without tensions. His\nconsistent doctrine is a combination of these two principles: that it\nis each individual’s duty to produce as much happiness in the\nworld as he is able, and that each person must be guided in acting by\nthe exercise of his private judgment, albeit informed by public\ndiscussion. If the resulting doctrine is utilitarian it is a highly\ndistinctive form: it is act-utilitarian in that it discounts reliance\non rules (although see Barry’s suggestion that his act-\nutilitarianism gives way to motive utilitarianism, Justice as\nImpartiality 224; and see Godwin’s invocation of sincerity\nas a partial rule constraint in the first edition, PPW III,\n135–42); it is ideal, in that it acknowledges major qualitative\ndifferences in the pleasures; and it is indirect, in that we can only\npromote over-all utility by improving the understanding of our fellow\nhuman beings. More troubling to the view that this none the less\namounts to utilitarianism is Godwin’s insistence on private\njudgment as a basic constraint, and his associated characterisation of\nthe fully moral agent in terms of the fullest possible development of\nthe individual’s intellectual powers and potential. Indeed,\nGodwin’s account of pleasure, in terms of the development of\nintellect and the exercise of its powers, means that the position\nlooks more like perfectionism than it does a form of hedonistic\nutilitarianism (what is valued is the ideal as much as the pleasures\nwhich are integral to it). Furthermore, it suggests that no\ndistinction can be drawn between the means that we adopt to promote\nthe general good and the character of the general good itself. That\nis, what promotes the general good is the development of human\nintellect, but the general good just is the development of the human\nintellect. If that is true, Godwin’s account cannot be\nutilitarian because it cannot be consequentialist (because it cannot\nseparate the means to the end from the end which is sought).\n\nSuch issues of interpretation remain very much in dispute in studies\nof Godwin (compare Clarke 1977 with Philp 1986 and Lamb 2009a), being\ncomplicated by issues concerning the weight to be given to the\ndifferent editions of\nPolitical Justice and Godwin’s later writings. However,\neven if a utilitarian reading of Godwin is accepted, it remains the\ncase that the doctrine is strictly a precept of individual moral\njudgment. Because of his broader views as to the corrupting influence\nof government, there can be no extension of the principle to politics.\nEach of us must judge as best we can how to advance the good of all,\nbut every person is owed a respect for their private judgment which\nprecludes us from exercising authority over them. By invoking this\nconstraint, Godwin delivers utilitarianism from the more statist\napproaches of Bentham and later utilitarians. It also ensures that the\ndoctrine retains a fundamentally egalitarian form. The constraint also\nsupports the view that Godwin reached his philosophical position less\nthrough the philosophes, than by secularising Dissenting\narguments for the sanctity of private judgment and generalising their\napplication to every mode of human activity. This commitment also\nprovides support for a reading of Godwin’s position which sees\nit as concerned with individual moral perfectibility, couched in the\nlanguage of utility, rather than as strictly utilitarian.\n",
    "section_title": "4. Moral Philosophy",
    "entry_title": "William Godwin",
    "hierarchy_title": "William Godwin || Moral Philosophy",
    "tokenized_text": [
        "moral",
        "philosophy",
        "moral",
        "philosophy",
        "one",
        "powerful",
        "attack",
        "godwin",
        "made",
        "dr",
        "samuel",
        "parr",
        "spital",
        "sermon",
        "godwin",
        "advocacy",
        "universal",
        "benevolence",
        "parr",
        "directed",
        "energy",
        "centring",
        "attack",
        "godwin",
        "early",
        "dismissal",
        "family",
        "feeling",
        "gratitude",
        "various",
        "natural",
        "sentiment",
        "godwin",
        "passion",
        "unconstrained",
        "judgment",
        "play",
        "role",
        "determining",
        "act",
        "exemplifies",
        "case",
        "come",
        "known",
        "famous",
        "fire",
        "cause",
        "reader",
        "asked",
        "imagine",
        "able",
        "save",
        "one",
        "two",
        "people",
        "fire",
        "one",
        "archbishop",
        "fénelon",
        "benefactor",
        "whole",
        "human",
        "race",
        "reader",
        "parent",
        "mother",
        "first",
        "edition",
        "father",
        "thereafter",
        "godwin",
        "view",
        "justice",
        "demand",
        "act",
        "impartially",
        "greater",
        "good",
        "mean",
        "saving",
        "fénelon",
        "never",
        "abandoned",
        "case",
        "view",
        "duty",
        "act",
        "bring",
        "greatest",
        "good",
        "judge",
        "influenced",
        "familial",
        "private",
        "concern",
        "judgment",
        "moral",
        "agent",
        "bound",
        "judge",
        "impartially",
        "replying",
        "parr",
        "godwin",
        "express",
        "regret",
        "appealed",
        "still",
        "persuasive",
        "case",
        "brutus",
        "executing",
        "two",
        "sonsa",
        "striking",
        "example",
        "republican",
        "commonplace",
        "justice",
        "trumping",
        "paternal",
        "duty",
        "godwin",
        "say",
        "saving",
        "someone",
        "relation",
        "seems",
        "bizarre",
        "without",
        "additional",
        "judgment",
        "moral",
        "worth",
        "parent",
        "foolish",
        "evil",
        "overriding",
        "claim",
        "u",
        "moral",
        "desert",
        "member",
        "human",
        "race",
        "position",
        "godwin",
        "retains",
        "moreover",
        "reply",
        "parr",
        "insists",
        "extraordinary",
        "case",
        "unlikely",
        "shake",
        "domestic",
        "affection",
        "ordinary",
        "intercourse",
        "life",
        "however",
        "later",
        "edition",
        "work",
        "becomes",
        "clear",
        "admit",
        "normal",
        "course",
        "event",
        "much",
        "substantial",
        "role",
        "played",
        "natural",
        "affection",
        "attachment",
        "provide",
        "u",
        "information",
        "best",
        "might",
        "benefit",
        "others",
        "basic",
        "moral",
        "motivation",
        "relied",
        "normal",
        "case",
        "generalised",
        "beyond",
        "narrow",
        "domestic",
        "sphere",
        "position",
        "much",
        "indebted",
        "adam",
        "smith",
        "theory",
        "moral",
        "sentiment",
        "change",
        "significant",
        "leaf",
        "u",
        "le",
        "rationalist",
        "philosophically",
        "robust",
        "account",
        "moral",
        "motivation",
        "relationship",
        "principle",
        "utility",
        "much",
        "moderate",
        "utopianism",
        "first",
        "edition",
        "impact",
        "change",
        "godwin",
        "overall",
        "position",
        "difficult",
        "ass",
        "see",
        "change",
        "consistent",
        "shift",
        "away",
        "rationalist",
        "account",
        "moral",
        "motivation",
        "marked",
        "first",
        "edition",
        "position",
        "much",
        "sceptical",
        "power",
        "reason",
        "scepticism",
        "inevitably",
        "moderate",
        "godwin",
        "belief",
        "perfectibility",
        "since",
        "becomes",
        "difficult",
        "argue",
        "convergence",
        "principle",
        "morality",
        "progressive",
        "development",
        "knowledge",
        "also",
        "inevitably",
        "undermines",
        "godwin",
        "faith",
        "triumph",
        "mind",
        "physiological",
        "process",
        "said",
        "neither",
        "doctrine",
        "private",
        "judgment",
        "principle",
        "utility",
        "depend",
        "earlier",
        "rationalism",
        "former",
        "defended",
        "godwin",
        "ground",
        "free",
        "action",
        "moral",
        "value",
        "fullest",
        "possible",
        "exercise",
        "private",
        "judgment",
        "required",
        "one",
        "action",
        "freefurther",
        "evidence",
        "godwin",
        "attempt",
        "provide",
        "agentcentred",
        "account",
        "virtue",
        "alongside",
        "consequentialism",
        "commitment",
        "private",
        "judgment",
        "remains",
        "defensible",
        "even",
        "low",
        "probability",
        "exercise",
        "produce",
        "true",
        "belief",
        "long",
        "better",
        "method",
        "tracking",
        "truth",
        "available",
        "also",
        "becomes",
        "proportionately",
        "le",
        "likely",
        "one",
        "scepticism",
        "increase",
        "defence",
        "might",
        "require",
        "cognitive",
        "status",
        "attributed",
        "moral",
        "judgment",
        "might",
        "also",
        "possible",
        "sustain",
        "argument",
        "private",
        "judgment",
        "independent",
        "issue",
        "ethical",
        "objectivity",
        "utility",
        "principle",
        "might",
        "seem",
        "call",
        "ability",
        "make",
        "sound",
        "ethical",
        "judgment",
        "complex",
        "situation",
        "sceptical",
        "people",
        "ability",
        "judge",
        "well",
        "entail",
        "seems",
        "deny",
        "better",
        "way",
        "judging",
        "count",
        "godwin",
        "central",
        "principle",
        "remain",
        "intact",
        "despite",
        "change",
        "make",
        "account",
        "moral",
        "motivation",
        "judgment",
        "moreover",
        "godwin",
        "view",
        "man",
        "progressive",
        "character",
        "might",
        "defended",
        "placing",
        "greater",
        "weight",
        "eliminating",
        "baleful",
        "effect",
        "social",
        "political",
        "institution",
        "european",
        "aristocracy",
        "epistemological",
        "dimension",
        "account",
        "however",
        "godwin",
        "endorsement",
        "principle",
        "utility",
        "sole",
        "guide",
        "moral",
        "duty",
        "principle",
        "private",
        "judgment",
        "block",
        "interference",
        "others",
        "without",
        "tension",
        "consistent",
        "doctrine",
        "combination",
        "two",
        "principle",
        "individual",
        "duty",
        "produce",
        "much",
        "happiness",
        "world",
        "able",
        "person",
        "must",
        "guided",
        "acting",
        "exercise",
        "private",
        "judgment",
        "albeit",
        "informed",
        "public",
        "discussion",
        "resulting",
        "doctrine",
        "utilitarian",
        "highly",
        "distinctive",
        "form",
        "actutilitarian",
        "discount",
        "reliance",
        "rule",
        "although",
        "see",
        "barry",
        "suggestion",
        "act",
        "utilitarianism",
        "give",
        "way",
        "motive",
        "utilitarianism",
        "justice",
        "impartiality",
        "see",
        "godwin",
        "invocation",
        "sincerity",
        "partial",
        "rule",
        "constraint",
        "first",
        "edition",
        "ppw",
        "iii",
        "ideal",
        "acknowledges",
        "major",
        "qualitative",
        "difference",
        "pleasure",
        "indirect",
        "promote",
        "overall",
        "utility",
        "improving",
        "understanding",
        "fellow",
        "human",
        "being",
        "troubling",
        "view",
        "none",
        "le",
        "amount",
        "utilitarianism",
        "godwin",
        "insistence",
        "private",
        "judgment",
        "basic",
        "constraint",
        "associated",
        "characterisation",
        "fully",
        "moral",
        "agent",
        "term",
        "fullest",
        "possible",
        "development",
        "individual",
        "intellectual",
        "power",
        "potential",
        "indeed",
        "godwin",
        "account",
        "pleasure",
        "term",
        "development",
        "intellect",
        "exercise",
        "power",
        "mean",
        "position",
        "look",
        "like",
        "perfectionism",
        "form",
        "hedonistic",
        "utilitarianism",
        "valued",
        "ideal",
        "much",
        "pleasure",
        "integral",
        "furthermore",
        "suggests",
        "distinction",
        "drawn",
        "mean",
        "adopt",
        "promote",
        "general",
        "good",
        "character",
        "general",
        "good",
        "promotes",
        "general",
        "good",
        "development",
        "human",
        "intellect",
        "general",
        "good",
        "development",
        "human",
        "intellect",
        "true",
        "godwin",
        "account",
        "utilitarian",
        "consequentialist",
        "separate",
        "mean",
        "end",
        "end",
        "sought",
        "issue",
        "interpretation",
        "remain",
        "much",
        "dispute",
        "study",
        "godwin",
        "compare",
        "clarke",
        "philp",
        "lamb",
        "a",
        "complicated",
        "issue",
        "concerning",
        "weight",
        "given",
        "different",
        "edition",
        "political",
        "justice",
        "godwin",
        "later",
        "writing",
        "however",
        "even",
        "utilitarian",
        "reading",
        "godwin",
        "accepted",
        "remains",
        "case",
        "doctrine",
        "strictly",
        "precept",
        "individual",
        "moral",
        "judgment",
        "broader",
        "view",
        "corrupting",
        "influence",
        "government",
        "extension",
        "principle",
        "politics",
        "u",
        "must",
        "judge",
        "best",
        "advance",
        "good",
        "every",
        "person",
        "owed",
        "respect",
        "private",
        "judgment",
        "precludes",
        "u",
        "exercising",
        "authority",
        "invoking",
        "constraint",
        "godwin",
        "delivers",
        "utilitarianism",
        "statist",
        "approach",
        "bentham",
        "later",
        "utilitarian",
        "also",
        "ensures",
        "doctrine",
        "retains",
        "fundamentally",
        "egalitarian",
        "form",
        "constraint",
        "also",
        "support",
        "view",
        "godwin",
        "reached",
        "philosophical",
        "position",
        "le",
        "philosophes",
        "secularising",
        "dissenting",
        "argument",
        "sanctity",
        "private",
        "judgment",
        "generalising",
        "application",
        "every",
        "mode",
        "human",
        "activity",
        "commitment",
        "also",
        "provides",
        "support",
        "reading",
        "godwin",
        "position",
        "see",
        "concerned",
        "individual",
        "moral",
        "perfectibility",
        "couched",
        "language",
        "utility",
        "rather",
        "strictly",
        "utilitarian"
    ]
}