{
    "main_text": "Political Philosophy\n3. Political Philosophy\n\nGodwin’s major philosophical treatise is his Enquiry\nConcerning Political Justice. The work went through three\neditions within 5 years, each with substantial changes. No further\nedition was published in Godwin’s lifetime, although a fourth\nedition was certainly mooted and Godwin may have undertaken work\ntowards it. Although Godwin’s other works shed light on changes\nin Godwin’s position after 1798, Political Justice is\nthe most coherent expression of his political philosophy.\n\nThe work began as an attempt to review recent developments in\npolitical and moral philosophy, but it quickly became more ambitious\nin scope:\n\nIn the first fervour of enthusiasm I entertained the vain imagination\nof “hewing a stone from rock” which by its inherent energy\nand weight should overbear and annihilate all opposition, and place\nthe principles of politics on an unmoveable basis. (CNM I,\n49)\n\n\nThe discarded first draft centres on the work of Montesquieu and\nRaynal, while the published work abandons the expository mode and\ndevelops its own independent line of argument. Godwin begins by\ndefending the importance of political inquiry and refuting claims that\nmoral and political phenomena are a function of climate, national\ncharacter or luxury. He argues that character is a function of\nexperience and that the type of government under which people live has\nan overwhelming impact upon their experience—bad government\nproduces wretched men and women. Although he is initially prepared to\nendorse the philosophe and republican view that government\ncan have a positive impact on the development of virtue, this view is\nsoon set aside in favour of the argument that moral and political\nimprovement flows from progress in our understanding of moral and\npolitical truth—a process to which there is no limit.\n\nBook Two examines the basic principles of human society, equality,\nrights, justice, and private judgment. Godwin follows Paine’s\nview in Common Sense, that “society is in every state a\nblessing…government even in its best state is but a necessary\nevil” (PPW III, 48), by seeing society as antecedent to\ngovernment with its principles setting the bounds of its legitimacy.\nThe basic moral principle is that of justice:\n\nIf justice have any meaning, it is just that I should contribute\neverything in my power to the benefit of the whole. (PPW III,\n49)\n\n\nThis principle is filled out by two further principles. The first,\nequality, is used to establish that we are beings of the same nature,\nsusceptible of the same pleasures and pains, and equally endowed with\nthe capacity for reason. This is to endorse the philosophe\nprinciple that birth and rank must not affect the way people are\ntreated—\n\nthe thing really to be desired is the removing as much as possible\narbitrary distinctions, and leaving to talents and virtue the field of\nexertion unimpaired (PPW III, 65).\n\n\nBut he also believes (as in the Fénelon case) that some have a\nhigher moral value than others. This judgment seems rigorously\nconsequentialist, in that we value them more if and only if they\ncontribute more to the general good (a position in line with\nGodwin’s rejection in Book Seven of all desert-based accounts of\npunishment). Tensions are introduced into his account, however, by the\nemphasis he places on intention in assessing a person’s\naction—\n\nIt is in the disposition and view of the mind, and not in the good\nwhich may accidentally and inintentionally result, that virtue\nconsists. (PPW III, 193)\n\n\nand by his characterisation of the ideal agent as someone devoted to a\nlife of benevolence and virtue. In both instances he appeals to an\nagent-centred account of virtue, more than to a consequentialist\naccount, and in doing so acknowledges a form of moral worth that is\nnot wholly reducible to consequentialist considerations.\n\nThe second principle to which he appeals, the doctrine of private\njudgment, is advanced as the logical complement to the principle of\njustice:\n\nto a rational being there is but one rule of conduct, justice, and one\nmode of ascertaining that rule, the exercise of his understanding.\n(PPW, III, 72).\n\n\nHere again, although Godwin appeals in part to consequentialist\nconsiderations to ground a duty to private judgment, it also plays an\nintegral part on his conception of what it is to be a fully rational\nagent. When combined with the principle of equality, the principle of\nprivate judgment issues in a basic constraint on certain types of\nconsequentialist intervention—each person acts morally only in\nso far as each acts wholly on the dictates of his or her private\njudgment. To effect real improvement we must work by appealing to the\nrational capacities of each of our fellow citizens.\n\nBook Three and the first part of Book Four develop Godwin’s case\nagainst existing theories of government, in each case making his case\nby drawing on his opening argument that there is no intrinsic limit on\nthe development of human understanding and enlightenment. The\nphilosophical underpinning for this argument is given in the second\nhalf of Book Four where Godwin examines the character of truth and its\nrelationship to virtue and goes on to discuss arguments relating to\nfreedom of the will, the doctrine of philosophical necessity, and the\ncharacter of moral motivation. He shows that men are capable of\nrecognising truth, and that, because mind acts as a real cause, they\nwill act on it when they perceive it clearly. Nothing beyond the\nperception of truth is required to motivate our compliance with moral\nprinciples. It is this which justifies the description of\nGodwin’s position as “rationalist”, and it is on\nthis point—the motivating power of reason—that later\neditions show a degree of retraction. One possible source for the\nposition is Richard Price’s Review of the Principal\nQuestions of Morals (1756), but it is noteworthy that Godwin\nhimself later identified this “error” as a function of his\nSandemanianism. In Political Justice, however, Godwin builds\nhis argument on necessarian foundations laid by David Hartley and\nJoseph Priestley, albeit he develops their position by insisting that\nmind is the medium within which sensations, desires, passions and\nbeliefs contend—so that we should understand the conflict\nbetween passion and reason as one of contending opinions. Such\ncontention can be assessed impartially by the mind which will assess\nthe true value of each claim and act on the judgment.\n\nBooks Five to Eight apply the principles of justice, equality and\nprivate judgment in a critical examination of the institutions of\ngovernment, issues of toleration and freedom of speech, theories of\nlaw and punishment, and, finally, the institution of property. In each\ncase, government and its institutions are shown to constrain the\ndevelopment of our capacity to live wholly in accordance with the full\nand free exercise of private judgment. In the final book Godwin\nsketches his positive vision of the egalitarian society of the future,\none which, having dispensed with all forms of organised co-operation,\nincluding orchestras and marriage, so as to ensure the fullest\nindependence to each persons’ judgment, will gradually witness\nthe development of the powers of mind to the point that they gain\nascendancy over physiological process allowing life to be prolonged\nindefinitely.\n\nIn 1800 Godwin wrote:\n\nThe Enquiry concerning Political Justice I apprehend to be blemished\nprincipally by three errors. 1. Stoicism, or an inattention to the\nprinciple, that pleasure and pain are the only bases upon which\nmorality can exist. 2. Sandemanianism, or an inattention to the\nprinciple that feeling, and not judgment, is the source of human\nactions. 3. The unqualified condemnation of the private affections. It\nwill easily be seen how strongly these errors are connected with the\nCalvinist system, which had been so deeply wrought into my mind in\nearly life, as to enable these errors long to survive the general\nsystem of religious opinions of which they formed a part…The\nfirst of these errors…has been corrected with some care in the\nsubsequent edition of Political Justice. The second and third owe\ntheir destruction to a perusal of Hume’s Treatise of Human\nNature in the following edition. (CNM, I, 54)\n\n\nThis account is a fair characterisation of the changes which Godwin\nmade in the second and third editions. Sentiment and feeling are given\na much more powerful role, no longer to be expunged by the power of\ntruth; the private affections are allowed to play a part in moral\nreasoning; and a more consistently utilitarian language is deployed\nthroughout the work. As a consequence, the rationalism which marked\nthe first edition becomes muted and, while the belief in progress is\nmaintained, the more utopian flights of the first edition are\nomitted.\n",
    "section_title": "3. Political Philosophy",
    "entry_title": "William Godwin",
    "hierarchy_title": "William Godwin || Political Philosophy",
    "tokenized_text": [
        "political",
        "philosophy",
        "political",
        "philosophy",
        "godwin",
        "major",
        "philosophical",
        "treatise",
        "enquiry",
        "concerning",
        "political",
        "justice",
        "work",
        "went",
        "three",
        "edition",
        "within",
        "year",
        "substantial",
        "change",
        "edition",
        "published",
        "godwin",
        "lifetime",
        "although",
        "fourth",
        "edition",
        "certainly",
        "mooted",
        "godwin",
        "may",
        "undertaken",
        "work",
        "towards",
        "although",
        "godwin",
        "work",
        "shed",
        "light",
        "change",
        "godwin",
        "position",
        "political",
        "justice",
        "coherent",
        "expression",
        "political",
        "philosophy",
        "work",
        "began",
        "attempt",
        "review",
        "recent",
        "development",
        "political",
        "moral",
        "philosophy",
        "quickly",
        "became",
        "ambitious",
        "scope",
        "first",
        "fervour",
        "enthusiasm",
        "entertained",
        "vain",
        "imagination",
        "hewing",
        "stone",
        "rock",
        "inherent",
        "energy",
        "weight",
        "overbear",
        "annihilate",
        "opposition",
        "place",
        "principle",
        "politics",
        "unmoveable",
        "basis",
        "cnm",
        "discarded",
        "first",
        "draft",
        "centre",
        "work",
        "montesquieu",
        "raynal",
        "published",
        "work",
        "abandon",
        "expository",
        "mode",
        "develops",
        "independent",
        "line",
        "argument",
        "godwin",
        "begin",
        "defending",
        "importance",
        "political",
        "inquiry",
        "refuting",
        "claim",
        "moral",
        "political",
        "phenomenon",
        "function",
        "climate",
        "national",
        "character",
        "luxury",
        "argues",
        "character",
        "function",
        "experience",
        "type",
        "government",
        "people",
        "live",
        "overwhelming",
        "impact",
        "upon",
        "experiencebad",
        "government",
        "produce",
        "wretched",
        "men",
        "woman",
        "although",
        "initially",
        "prepared",
        "endorse",
        "philosophe",
        "republican",
        "view",
        "government",
        "positive",
        "impact",
        "development",
        "virtue",
        "view",
        "soon",
        "set",
        "aside",
        "favour",
        "argument",
        "moral",
        "political",
        "improvement",
        "flow",
        "progress",
        "understanding",
        "moral",
        "political",
        "trutha",
        "process",
        "limit",
        "book",
        "two",
        "examines",
        "basic",
        "principle",
        "human",
        "society",
        "equality",
        "right",
        "justice",
        "private",
        "judgment",
        "godwin",
        "follows",
        "paine",
        "view",
        "common",
        "sense",
        "society",
        "every",
        "state",
        "blessinggovernment",
        "even",
        "best",
        "state",
        "necessary",
        "evil",
        "ppw",
        "iii",
        "seeing",
        "society",
        "antecedent",
        "government",
        "principle",
        "setting",
        "bound",
        "legitimacy",
        "basic",
        "moral",
        "principle",
        "justice",
        "justice",
        "meaning",
        "contribute",
        "everything",
        "power",
        "benefit",
        "whole",
        "ppw",
        "iii",
        "principle",
        "filled",
        "two",
        "principle",
        "first",
        "equality",
        "used",
        "establish",
        "being",
        "nature",
        "susceptible",
        "pleasure",
        "pain",
        "equally",
        "endowed",
        "capacity",
        "reason",
        "endorse",
        "philosophe",
        "principle",
        "birth",
        "rank",
        "must",
        "affect",
        "way",
        "people",
        "treated",
        "thing",
        "really",
        "desired",
        "removing",
        "much",
        "possible",
        "arbitrary",
        "distinction",
        "leaving",
        "talent",
        "virtue",
        "field",
        "exertion",
        "unimpaired",
        "ppw",
        "iii",
        "also",
        "belief",
        "fénelon",
        "case",
        "higher",
        "moral",
        "value",
        "others",
        "judgment",
        "seems",
        "rigorously",
        "consequentialist",
        "value",
        "contribute",
        "general",
        "good",
        "position",
        "line",
        "godwin",
        "rejection",
        "book",
        "seven",
        "desertbased",
        "account",
        "punishment",
        "tension",
        "introduced",
        "account",
        "however",
        "emphasis",
        "place",
        "intention",
        "assessing",
        "person",
        "action",
        "disposition",
        "view",
        "mind",
        "good",
        "may",
        "accidentally",
        "inintentionally",
        "result",
        "virtue",
        "consists",
        "ppw",
        "iii",
        "characterisation",
        "ideal",
        "agent",
        "someone",
        "devoted",
        "life",
        "benevolence",
        "virtue",
        "instance",
        "appeal",
        "agentcentred",
        "account",
        "virtue",
        "consequentialist",
        "account",
        "acknowledges",
        "form",
        "moral",
        "worth",
        "wholly",
        "reducible",
        "consequentialist",
        "consideration",
        "second",
        "principle",
        "appeal",
        "doctrine",
        "private",
        "judgment",
        "advanced",
        "logical",
        "complement",
        "principle",
        "justice",
        "rational",
        "one",
        "rule",
        "conduct",
        "justice",
        "one",
        "mode",
        "ascertaining",
        "rule",
        "exercise",
        "understanding",
        "ppw",
        "iii",
        "although",
        "godwin",
        "appeal",
        "part",
        "consequentialist",
        "consideration",
        "ground",
        "duty",
        "private",
        "judgment",
        "also",
        "play",
        "integral",
        "part",
        "conception",
        "fully",
        "rational",
        "agent",
        "combined",
        "principle",
        "equality",
        "principle",
        "private",
        "judgment",
        "issue",
        "basic",
        "constraint",
        "certain",
        "type",
        "consequentialist",
        "interventioneach",
        "person",
        "act",
        "morally",
        "far",
        "act",
        "wholly",
        "dictate",
        "private",
        "judgment",
        "effect",
        "real",
        "improvement",
        "must",
        "work",
        "appealing",
        "rational",
        "capacity",
        "fellow",
        "citizen",
        "book",
        "three",
        "first",
        "part",
        "book",
        "four",
        "develop",
        "godwin",
        "case",
        "existing",
        "theory",
        "government",
        "case",
        "making",
        "case",
        "drawing",
        "opening",
        "argument",
        "intrinsic",
        "limit",
        "development",
        "human",
        "understanding",
        "enlightenment",
        "philosophical",
        "underpinning",
        "argument",
        "given",
        "second",
        "half",
        "book",
        "four",
        "godwin",
        "examines",
        "character",
        "truth",
        "relationship",
        "virtue",
        "go",
        "discus",
        "argument",
        "relating",
        "freedom",
        "doctrine",
        "philosophical",
        "necessity",
        "character",
        "moral",
        "motivation",
        "show",
        "men",
        "capable",
        "recognising",
        "truth",
        "mind",
        "act",
        "real",
        "cause",
        "act",
        "perceive",
        "clearly",
        "nothing",
        "beyond",
        "perception",
        "truth",
        "required",
        "motivate",
        "compliance",
        "moral",
        "principle",
        "justifies",
        "description",
        "godwin",
        "position",
        "rationalist",
        "pointthe",
        "motivating",
        "power",
        "reasonthat",
        "later",
        "edition",
        "show",
        "degree",
        "retraction",
        "one",
        "possible",
        "source",
        "position",
        "richard",
        "price",
        "review",
        "principal",
        "question",
        "moral",
        "noteworthy",
        "godwin",
        "later",
        "identified",
        "error",
        "function",
        "sandemanianism",
        "political",
        "justice",
        "however",
        "godwin",
        "build",
        "argument",
        "necessarian",
        "foundation",
        "laid",
        "david",
        "hartley",
        "joseph",
        "priestley",
        "albeit",
        "develops",
        "position",
        "insisting",
        "mind",
        "medium",
        "within",
        "sensation",
        "desire",
        "passion",
        "belief",
        "contendso",
        "understand",
        "conflict",
        "passion",
        "reason",
        "one",
        "contending",
        "opinion",
        "contention",
        "assessed",
        "impartially",
        "mind",
        "ass",
        "true",
        "value",
        "claim",
        "act",
        "judgment",
        "book",
        "five",
        "eight",
        "apply",
        "principle",
        "justice",
        "equality",
        "private",
        "judgment",
        "critical",
        "examination",
        "institution",
        "government",
        "issue",
        "toleration",
        "freedom",
        "speech",
        "theory",
        "law",
        "punishment",
        "finally",
        "institution",
        "property",
        "case",
        "government",
        "institution",
        "shown",
        "constrain",
        "development",
        "capacity",
        "live",
        "wholly",
        "accordance",
        "full",
        "free",
        "exercise",
        "private",
        "judgment",
        "final",
        "book",
        "godwin",
        "sketch",
        "positive",
        "vision",
        "egalitarian",
        "society",
        "future",
        "one",
        "dispensed",
        "form",
        "organised",
        "cooperation",
        "including",
        "orchestra",
        "marriage",
        "ensure",
        "fullest",
        "independence",
        "person",
        "judgment",
        "gradually",
        "witness",
        "development",
        "power",
        "mind",
        "point",
        "gain",
        "ascendancy",
        "physiological",
        "process",
        "allowing",
        "life",
        "prolonged",
        "indefinitely",
        "godwin",
        "wrote",
        "enquiry",
        "concerning",
        "political",
        "justice",
        "apprehend",
        "blemished",
        "principally",
        "three",
        "error",
        "stoicism",
        "inattention",
        "principle",
        "pleasure",
        "pain",
        "base",
        "upon",
        "morality",
        "exist",
        "sandemanianism",
        "inattention",
        "principle",
        "feeling",
        "judgment",
        "source",
        "human",
        "action",
        "unqualified",
        "condemnation",
        "private",
        "affection",
        "easily",
        "seen",
        "strongly",
        "error",
        "connected",
        "calvinist",
        "system",
        "deeply",
        "wrought",
        "mind",
        "early",
        "life",
        "enable",
        "error",
        "long",
        "survive",
        "general",
        "system",
        "religious",
        "opinion",
        "formed",
        "partthe",
        "first",
        "errorshas",
        "corrected",
        "care",
        "subsequent",
        "edition",
        "political",
        "justice",
        "second",
        "third",
        "owe",
        "destruction",
        "perusal",
        "hume",
        "treatise",
        "human",
        "nature",
        "following",
        "edition",
        "cnm",
        "account",
        "fair",
        "characterisation",
        "change",
        "godwin",
        "made",
        "second",
        "third",
        "edition",
        "sentiment",
        "feeling",
        "given",
        "much",
        "powerful",
        "role",
        "longer",
        "expunged",
        "power",
        "truth",
        "private",
        "affection",
        "allowed",
        "play",
        "part",
        "moral",
        "reasoning",
        "consistently",
        "utilitarian",
        "language",
        "deployed",
        "throughout",
        "work",
        "consequence",
        "rationalism",
        "marked",
        "first",
        "edition",
        "becomes",
        "muted",
        "belief",
        "progress",
        "maintained",
        "utopian",
        "flight",
        "first",
        "edition",
        "omitted"
    ]
}