{
    "main_text": "Animal Mechanism\n4. Animal Mechanism\n\nThe beginning of the Antoniana is an extensive discussion\naimed at demonstrating that animals do not have the faculty of sensory\nperception. His argument is easy to sum up: if animals had the ability\nto perceive objects and were able to behave in one way or another\ndepending on this perception, then we should have to grant them not\nonly sensory perception, but also the faculty of reasoning. What is\nmore, it would be necessary to conclude that they have an indivisible\nand immortal soul, as humans do. Pereira himself recognized that such\na thesis could seem surprising, since it was generally accepted that\nbeasts had been endowed with the faculty of sensory perception (AM:\nI.191). The author was right to believe that to his contemporary\nreader a thesis that denies the existence of sensory perception in\nbeasts might seem not only a striking novelty, but also something\nwhich contradicted common experience and the principles of\nAristotelian philosophy. Without going into the controversial question\nof whether Aristotle accepted or not the existence of certain traces\nof intelligence in animal behavior (see Newmyer 2011: 6–10),\nthere is no doubt that he attributed the sensitive faculty, in\ndifferent degrees of complexity, to animals. In the De Anima,\nwithout going any further, Aristotle clearly said: \n\n\nnow all animals have one sense at least, viz. touch, and whatever has\na sense has the capacity for pleasure and pain and therefore has\npleasant and painful objects present to it, and wherever these are\npresent, there is desire, for desire is just appetition of what is\npleasant. (De Anima, II, 3, 414b3–5)\n\n\nBut, if the boundary between humans and animals is located at the\nlimit between sensory perception and the intellect, precisely because\nthis limit is far from being well-defined, it is difficult to\ndetermine with precision the ontological difference between men and\nanimals, to the extent that one can find some cases of true bestiality\namong humans: these cases are certainly rare, but not as rare as those\nmen who are capable of living according to virtue and science (see\nBianchi 2003b: 63–100). This is the context that explains much\nof the content of the Antoniana. In the opinion of its\nauthor, those who recognize that any animal perceives what seems to it\ndesirable or harmful, and then acts accordingly initiating a movement\nin pursuit of it or escaping from it, are not only obliged to grant\nthem a sensory faculty with a discriminating power, but even\nrationality and thought (AM: I.199). Moreover, given that Aristotle\nalso distinguished an intellectual faculty devoted to apprehending\nsimple objects and another one which can deduce the complex from the\nsimple (so that one can built a true or false proposition from the\nconnection of terms), then if we concede the first power to animals,\nwe must also concede the second, since \n\n\nthose who maintain that brute beasts recognize the presence or absence\nof an enemy or a friend are forced to acknowledge that they are\nforming mental propositions. If this is not so, let them explain how\none recognises the existence of an enemy, and they will find no answer\nother than the formation of the foresaid mental propositions. (AM:\nI.203) \n\n\nFurthermore, if the animals are capable of knowing the world through\nsensory perception, nature would have been very cruel for making them\nsuffer all they suffer, for example, at the hands of men. And, given\nthat certain species of animals can pre-empt the arrival of cold\nwinter and shelter or run away from it, we must grant them also some\nfaculty of prediction; but, if they can predict the winter, they will\nalso be able to have knowledge of death and, just like human beings,\nthey will worry about the future of their souls (AM: 1.215).\n\nWe might also grant them the knowledge of universal concepts. As\nAristotle says, once the premises are established and known, it is\nnecessary to deduce from them a conclusion: for example, if beasts\nknow that this fire burns, and that this other also\nburns, and they run away from whatever fire they can perceive, they\nmust have formulated the proposition “all fire burns.” In\nthis case, they have an indivisible soul, since only with an\nindivisible soul can one achieve the knowledge of any object as a\nwhole. For, if we accept that the animals have a divisible soul\n(quanta), they will never reach such global knowledge: an\nanimal would know through a part of it a part of its object, and\nthrough another, another part, and so it would be unable to reach a\nperfect identification of whatever could be in front of it (AM:\nI.227).\n\nTo avoid such undesirable consequences, which de facto put\nanimals in the same category as human beings, Pereira tried out an\nalternative explanation of animal behavior. This behavior and the\ndiversity of movements observed in animals is due to what he called\nsome occultae qualitates by which visual images\n(species) coming from outside, or certain affections that\noccur in the phantasmata that stay in the front of the brain\n(occiput) set the animal in motion by activating its nervous\nsystem (AM: I.253). In the case of human beings, who, like animals,\nare also exposed to these species and have inside their\nbrains the same phantasmata, there is a real mental activity\nwhich is able to generate their own movements through the knowledge of\nthe object.\n\nFor Pereira, there are three main types of movement in nature. The\nsimplest is movement of inorganic objects. It is ruled by the\nprinciples of perpetual and invariable motion. This movement is merely\na local one: for example, the attraction of metal to a magnet. The\nmost complex category is voluntary movement (i.e., the complete\nfreedom of movement of humans). At the medium level of complexity,\nPereira located what he called “vital movement”, which\ndescribes animal movements. Vital movement includes movement caused by\nmuscular and nervous organs in direct response to interior and\nexterior stimuli; this movement does not involve will nor any kind of\nspontaneous decision. Notwithstanding this, Pereira said that vital\nmovement does not consist of invariable movement. Instead, the\ncomplexity of movements that can be observed in animals is the result\nof the complexity of the stimuli or forces that can act on them. To\nclarify this, Pereira classified four different types of animal\nmovement: i) movements produced as a reaction to objects that are\npresent; ii) movements produced by objects that were present in the\npast time; iii) movements produced as consequence of some previous\ninstruction; iv) movements resulting from the so-called natural\ninstinct (AM: I.241). The central core of Pereira’s theory\non animal behavior is found precisely in the explanation of these four\ntypes of movement (see Sánchez Vega 1954: 383–387;\nBandrés & Llavona 1992: 161; Rodríguez Pardo 2008:\n191).\n\n(i) The first type of movement is based on the reaction to objects\nthat are present. In this case, Pereira formulated an explanation that\nembraced a pioneering theory of reflex reaction which involved both\nperipherical stimuli and a central organ. The process as it was\ndescribed by him consisted of four phases. It starts with the object\nthat stimulates the sensory organs. This stimulation leads to\nreactions in the sensory organs which cause certain mechanical\nalteration called by Pereira species. The sense of touch\noccupies a special category into this explanation model, since in this\nsense the process is not activated by means of mechanical alterations\ncaused by distant object, but by direct physical contact between the\nobject and the organism, without the intervention of those\nspecies. The second phase consists of the transmission of the\nalteration in the sensory organ to the brain. This transmission of the\nspecies to the brain takes place without any resistance, so\nthat it spreads along the nerves at an enormous speed. The third phase\nis located in the brain and consists of the activation of the areas\nwhere the motor nerves originate (Pereira considered the connections\ncorresponding to each sensorial modality to have a specific location\nin the brain). And finally, the fourth and last phase consists of the\nactivation of the nerves which gives way to contraction and distention\nof the muscles that generates the movement of the different parts of\nthe animal (AM: I.243–245).\n\nBut for Pereira it was evident that, before the same object, the\nbehavior of an animal could vary and even be contradictory. He\nexplained such a variety by resorting to a complex interaction of\nfactors that occur simultaneously. To illustrate this question the\nauthor described the case of an animal that on some occasions drinks\nas a reaction to the presence of water and on other occasions does\nnot, depending on the interaction between the species\nproduced by the water and the current internal state of thirst of the\nanimal (AM: II.877).\n\n(ii) Another type of movement is that produced by previously present\nobjects. To explain this type Pereira turned to internal senses, which\nhe defined as inner cognitive organic faculties. He said that, while\nthere are two internal senses in man, imagination and memory, in\nanimals only memory is present. Pereira then developed a mechanical\nway of processing information in animal memory which excluded mental\nactivity. According to him, when an object disappears it leaves a\nphantasma. These phantasmata or traces are stored in\na cell located in the posterior zone of the brain, remaining there in\na passive state. In the absence of the object, those\nphantasmata can be activated and move from the cell to the\nsynciput which is located in the anterior zone of the brain.\nThere they produce the same reactions provoked by the species\ncoming from present objects. The author said that the only difference\nbetween humans and animals with respect to the function of memory is\nthat man can voluntarily cause the movement of the memory traces to\nevoke a recall, whereas in animals this movement is due to purely\nmechanical stimuli which can come from internal or external origin\n(AM: I.251, I.253–255, I.263–265).\n\n(iii) Pereira’s third type of movement is produced by training,\nwhich certain animals are capable of assimilating. His doctrine is\ndeveloped through the exposition of specific cases of animal training.\nFor example, Pereira considered the imitation of human language by\nbirds as a special type of reflex mechanism in which hearing organs of\nbirds receive voice waves which are transmitted to a soft area of the\nbrain where they are recorded. When the brain is activated after\nreceiving some stimuli, it causes a series of muscular movements in\nthe speech organs that finally reproduce the previously recorded\nsounds. In this case, hearing and speech are two sides of a single\nprocess. Another case that Pereira studied was that of birds which can\nemit words that have been spoken in the past. According to him, this\nis due to the animal memory wherein a voice is retrieved from the\ncorresponding trace or phantasma that is stored in the\nposterior area of the brain. When these traces are somehow activated,\nthey pass to the anterior zone and provoke the production of the same\nsounds that created them. But why should an animal emit some words and\nnot others? The explanation is found in the frequency with which a\ndetermined voice is presented to the animal: the trace of a frequently\nrepeated voice is more mobile than that of an infrequent one, and then\nmuch more susceptible to flowing in the direction of the anterior zone\n(AM: I.263). Another example of training in animals is found in\nmovements in answer to a master’s voice. These movements consist\nof approach or escape reactions and the diversity of responses can be\nexplained by certain voices in the past which have been followed by\nthe offer of food whereas others have been produced by punishment. In\nthis case, Pereira explained how the activation of a master’s\nvoice phantasma on the posterior area of an animal’s\nbrain generates the mobilization of the phastasmata of past\nevents that were accompanied by such a voice. Here it is important to\nnote that reward and punishment have a primary role in Pereira’s\nconcept of behavior modification, because they are effective not only\nin establishing new behaviors but also in favoring learning by\nimitation (AM: I.263–265).\n\n(iv) The fourth and last type of movement in Pereira’s theory is\ninstinctive movements. Pereira attributed these movements to what he\ncalled natural instinct. Among the examples he used is the\npersecution of the mouse by the cat. Pereira recognized that the\nperfection and complexity of these movements are such that, if they\nare not carefully examined, they could lead us to the conclusion that\nnot only do animals have sensations, but that they also possess\nthought and reason. However, mere appearances are not evidence or\nproof. For example, he described the astonishing action of semen\ndeposited by the male inside the vulva, and yet, semen does not have\nsensory perception. The same can be said of nutritional processes,\nwherein the relationships between different organs cause a selection\nof some materials and the rejection of others, and neither these\noperations are the result of a sensory process (AM:\nI.343–345).\n\nIn sum, Pereira thought that all these movements might be explained by\nturning to two types of causes: specific causes and\ngeneric causes. The first ones consist of various actions of\nthe species on the receptive organs; that is to say,\nenvironmental stimulation. Generic causes are the functional interest.\nPereira placed these causes under the general term\n“nature”, which plays a role as a universal regulator (AM:\nI.349). This broad generic cause is responsible for animals having\norgans adequate to enable them to interact with their habitat. This\nalso explains the different bodies and types of animals and their\nvarying capacity to be trained. Nature is also responsible for the\nfact that some of an animal’s external movements serve as signs.\nFor instance, a dog’s bark or a lion’s roar frightens us\nand warns us of possible attack. Pereira considered instinctive\nmovements to include those basic processes related to environmental\nadaption, especially the search for food, avoiding danger, etc. These\nmovements are the result of the interaction between natural tendencies\nin the animal and concrete environmental circumstances. In this way,\nPereira explained the perfect harmony between the beast and its\nphysical, animal, and human surroundings (see Bandré &\nLlavona 1992: 163–164).\n",
    "section_title": "4. Animal Mechanism",
    "entry_title": "Gómez Pereira",
    "hierarchy_title": "Gómez Pereira || Animal Mechanism",
    "tokenized_text": [
        "animal",
        "mechanism",
        "animal",
        "mechanism",
        "beginning",
        "antoniana",
        "extensive",
        "discussion",
        "aimed",
        "demonstrating",
        "animal",
        "faculty",
        "sensory",
        "perception",
        "argument",
        "easy",
        "sum",
        "animal",
        "ability",
        "perceive",
        "object",
        "able",
        "behave",
        "one",
        "way",
        "another",
        "depending",
        "perception",
        "grant",
        "sensory",
        "perception",
        "also",
        "faculty",
        "reasoning",
        "would",
        "necessary",
        "conclude",
        "indivisible",
        "immortal",
        "soul",
        "human",
        "pereira",
        "recognized",
        "thesis",
        "could",
        "seem",
        "surprising",
        "since",
        "generally",
        "accepted",
        "beast",
        "endowed",
        "faculty",
        "sensory",
        "perception",
        "i",
        "author",
        "right",
        "believe",
        "contemporary",
        "reader",
        "thesis",
        "denies",
        "existence",
        "sensory",
        "perception",
        "beast",
        "might",
        "seem",
        "striking",
        "novelty",
        "also",
        "something",
        "contradicted",
        "common",
        "experience",
        "principle",
        "aristotelian",
        "philosophy",
        "without",
        "going",
        "controversial",
        "question",
        "whether",
        "aristotle",
        "accepted",
        "existence",
        "certain",
        "trace",
        "intelligence",
        "animal",
        "behavior",
        "see",
        "newmyer",
        "doubt",
        "attributed",
        "sensitive",
        "faculty",
        "different",
        "degree",
        "complexity",
        "animal",
        "de",
        "anima",
        "without",
        "going",
        "aristotle",
        "clearly",
        "said",
        "animal",
        "one",
        "sense",
        "least",
        "viz",
        "touch",
        "whatever",
        "sense",
        "capacity",
        "pleasure",
        "pain",
        "therefore",
        "pleasant",
        "painful",
        "object",
        "present",
        "wherever",
        "present",
        "desire",
        "desire",
        "appetition",
        "pleasant",
        "de",
        "anima",
        "ii",
        "b",
        "boundary",
        "human",
        "animal",
        "located",
        "limit",
        "sensory",
        "perception",
        "intellect",
        "precisely",
        "limit",
        "far",
        "welldefined",
        "difficult",
        "determine",
        "precision",
        "ontological",
        "difference",
        "men",
        "animal",
        "extent",
        "one",
        "find",
        "case",
        "true",
        "bestiality",
        "among",
        "human",
        "case",
        "certainly",
        "rare",
        "rare",
        "men",
        "capable",
        "living",
        "according",
        "virtue",
        "science",
        "see",
        "bianchi",
        "b",
        "context",
        "explains",
        "much",
        "content",
        "antoniana",
        "opinion",
        "author",
        "recognize",
        "animal",
        "perceives",
        "seems",
        "desirable",
        "harmful",
        "act",
        "accordingly",
        "initiating",
        "movement",
        "pursuit",
        "escaping",
        "obliged",
        "grant",
        "sensory",
        "faculty",
        "discriminating",
        "power",
        "even",
        "rationality",
        "thought",
        "i",
        "moreover",
        "given",
        "aristotle",
        "also",
        "distinguished",
        "intellectual",
        "faculty",
        "devoted",
        "apprehending",
        "simple",
        "object",
        "another",
        "one",
        "deduce",
        "complex",
        "simple",
        "one",
        "built",
        "true",
        "false",
        "proposition",
        "connection",
        "term",
        "concede",
        "first",
        "power",
        "animal",
        "must",
        "also",
        "concede",
        "second",
        "since",
        "maintain",
        "brute",
        "beast",
        "recognize",
        "presence",
        "absence",
        "enemy",
        "friend",
        "forced",
        "acknowledge",
        "forming",
        "mental",
        "proposition",
        "let",
        "explain",
        "one",
        "recognises",
        "existence",
        "enemy",
        "find",
        "answer",
        "formation",
        "foresaid",
        "mental",
        "proposition",
        "i",
        "furthermore",
        "animal",
        "capable",
        "knowing",
        "world",
        "sensory",
        "perception",
        "nature",
        "would",
        "cruel",
        "making",
        "suffer",
        "suffer",
        "example",
        "hand",
        "men",
        "given",
        "certain",
        "specie",
        "animal",
        "preempt",
        "arrival",
        "cold",
        "winter",
        "shelter",
        "run",
        "away",
        "must",
        "grant",
        "also",
        "faculty",
        "prediction",
        "predict",
        "winter",
        "also",
        "able",
        "knowledge",
        "death",
        "like",
        "human",
        "being",
        "worry",
        "future",
        "soul",
        "might",
        "also",
        "grant",
        "knowledge",
        "universal",
        "concept",
        "aristotle",
        "say",
        "premise",
        "established",
        "known",
        "necessary",
        "deduce",
        "conclusion",
        "example",
        "beast",
        "know",
        "fire",
        "burn",
        "also",
        "burn",
        "run",
        "away",
        "whatever",
        "fire",
        "perceive",
        "must",
        "formulated",
        "proposition",
        "fire",
        "burns",
        "case",
        "indivisible",
        "soul",
        "since",
        "indivisible",
        "soul",
        "one",
        "achieve",
        "knowledge",
        "object",
        "whole",
        "accept",
        "animal",
        "divisible",
        "soul",
        "quantum",
        "never",
        "reach",
        "global",
        "knowledge",
        "animal",
        "would",
        "know",
        "part",
        "part",
        "object",
        "another",
        "another",
        "part",
        "would",
        "unable",
        "reach",
        "perfect",
        "identification",
        "whatever",
        "could",
        "front",
        "i",
        "avoid",
        "undesirable",
        "consequence",
        "de",
        "facto",
        "put",
        "animal",
        "category",
        "human",
        "being",
        "pereira",
        "tried",
        "alternative",
        "explanation",
        "animal",
        "behavior",
        "behavior",
        "diversity",
        "movement",
        "observed",
        "animal",
        "due",
        "called",
        "occultae",
        "qualitates",
        "visual",
        "image",
        "specie",
        "coming",
        "outside",
        "certain",
        "affection",
        "occur",
        "phantasmata",
        "stay",
        "front",
        "brain",
        "occiput",
        "set",
        "animal",
        "motion",
        "activating",
        "nervous",
        "system",
        "i",
        "case",
        "human",
        "being",
        "like",
        "animal",
        "also",
        "exposed",
        "specie",
        "inside",
        "brain",
        "phantasmata",
        "real",
        "mental",
        "activity",
        "able",
        "generate",
        "movement",
        "knowledge",
        "object",
        "pereira",
        "three",
        "main",
        "type",
        "movement",
        "nature",
        "simplest",
        "movement",
        "inorganic",
        "object",
        "ruled",
        "principle",
        "perpetual",
        "invariable",
        "motion",
        "movement",
        "merely",
        "local",
        "one",
        "example",
        "attraction",
        "metal",
        "magnet",
        "complex",
        "category",
        "voluntary",
        "movement",
        "ie",
        "complete",
        "freedom",
        "movement",
        "human",
        "medium",
        "level",
        "complexity",
        "pereira",
        "located",
        "called",
        "vital",
        "movement",
        "describes",
        "animal",
        "movement",
        "vital",
        "movement",
        "includes",
        "movement",
        "caused",
        "muscular",
        "nervous",
        "organ",
        "direct",
        "response",
        "interior",
        "exterior",
        "stimulus",
        "movement",
        "involve",
        "kind",
        "spontaneous",
        "decision",
        "notwithstanding",
        "pereira",
        "said",
        "vital",
        "movement",
        "consist",
        "invariable",
        "movement",
        "instead",
        "complexity",
        "movement",
        "observed",
        "animal",
        "result",
        "complexity",
        "stimulus",
        "force",
        "act",
        "clarify",
        "pereira",
        "classified",
        "four",
        "different",
        "type",
        "animal",
        "movement",
        "movement",
        "produced",
        "reaction",
        "object",
        "present",
        "ii",
        "movement",
        "produced",
        "object",
        "present",
        "past",
        "time",
        "iii",
        "movement",
        "produced",
        "consequence",
        "previous",
        "instruction",
        "iv",
        "movement",
        "resulting",
        "socalled",
        "natural",
        "instinct",
        "i",
        "central",
        "core",
        "pereira",
        "theory",
        "animal",
        "behavior",
        "found",
        "precisely",
        "explanation",
        "four",
        "type",
        "movement",
        "see",
        "sánchez",
        "vega",
        "bandrés",
        "llavona",
        "rodríguez",
        "pardo",
        "first",
        "type",
        "movement",
        "based",
        "reaction",
        "object",
        "present",
        "case",
        "pereira",
        "formulated",
        "explanation",
        "embraced",
        "pioneering",
        "theory",
        "reflex",
        "reaction",
        "involved",
        "peripherical",
        "stimulus",
        "central",
        "organ",
        "process",
        "described",
        "consisted",
        "four",
        "phase",
        "start",
        "object",
        "stimulates",
        "sensory",
        "organ",
        "stimulation",
        "lead",
        "reaction",
        "sensory",
        "organ",
        "cause",
        "certain",
        "mechanical",
        "alteration",
        "called",
        "pereira",
        "specie",
        "sense",
        "touch",
        "occupies",
        "special",
        "category",
        "explanation",
        "model",
        "since",
        "sense",
        "process",
        "activated",
        "mean",
        "mechanical",
        "alteration",
        "caused",
        "distant",
        "object",
        "direct",
        "physical",
        "contact",
        "object",
        "organism",
        "without",
        "intervention",
        "specie",
        "second",
        "phase",
        "consists",
        "transmission",
        "alteration",
        "sensory",
        "organ",
        "brain",
        "transmission",
        "specie",
        "brain",
        "take",
        "place",
        "without",
        "resistance",
        "spread",
        "along",
        "nerve",
        "enormous",
        "speed",
        "third",
        "phase",
        "located",
        "brain",
        "consists",
        "activation",
        "area",
        "motor",
        "nerve",
        "originate",
        "pereira",
        "considered",
        "connection",
        "corresponding",
        "sensorial",
        "modality",
        "specific",
        "location",
        "brain",
        "finally",
        "fourth",
        "last",
        "phase",
        "consists",
        "activation",
        "nerve",
        "give",
        "way",
        "contraction",
        "distention",
        "muscle",
        "generates",
        "movement",
        "different",
        "part",
        "animal",
        "i",
        "pereira",
        "evident",
        "object",
        "behavior",
        "animal",
        "could",
        "vary",
        "even",
        "contradictory",
        "explained",
        "variety",
        "resorting",
        "complex",
        "interaction",
        "factor",
        "occur",
        "simultaneously",
        "illustrate",
        "question",
        "author",
        "described",
        "case",
        "animal",
        "occasion",
        "drink",
        "reaction",
        "presence",
        "water",
        "occasion",
        "depending",
        "interaction",
        "specie",
        "produced",
        "water",
        "current",
        "internal",
        "state",
        "thirst",
        "animal",
        "ii",
        "ii",
        "another",
        "type",
        "movement",
        "produced",
        "previously",
        "present",
        "object",
        "explain",
        "type",
        "pereira",
        "turned",
        "internal",
        "sens",
        "defined",
        "inner",
        "cognitive",
        "organic",
        "faculty",
        "said",
        "two",
        "internal",
        "sens",
        "man",
        "imagination",
        "memory",
        "animal",
        "memory",
        "present",
        "pereira",
        "developed",
        "mechanical",
        "way",
        "processing",
        "information",
        "animal",
        "memory",
        "excluded",
        "mental",
        "activity",
        "according",
        "object",
        "disappears",
        "leaf",
        "phantasma",
        "phantasmata",
        "trace",
        "stored",
        "cell",
        "located",
        "posterior",
        "zone",
        "brain",
        "remaining",
        "passive",
        "state",
        "absence",
        "object",
        "phantasmata",
        "activated",
        "move",
        "cell",
        "synciput",
        "located",
        "anterior",
        "zone",
        "brain",
        "produce",
        "reaction",
        "provoked",
        "specie",
        "coming",
        "present",
        "object",
        "author",
        "said",
        "difference",
        "human",
        "animal",
        "respect",
        "function",
        "memory",
        "man",
        "voluntarily",
        "cause",
        "movement",
        "memory",
        "trace",
        "evoke",
        "recall",
        "whereas",
        "animal",
        "movement",
        "due",
        "purely",
        "mechanical",
        "stimulus",
        "come",
        "internal",
        "external",
        "origin",
        "i",
        "i",
        "i",
        "iii",
        "pereira",
        "third",
        "type",
        "movement",
        "produced",
        "training",
        "certain",
        "animal",
        "capable",
        "assimilating",
        "doctrine",
        "developed",
        "exposition",
        "specific",
        "case",
        "animal",
        "training",
        "example",
        "pereira",
        "considered",
        "imitation",
        "human",
        "language",
        "bird",
        "special",
        "type",
        "reflex",
        "mechanism",
        "hearing",
        "organ",
        "bird",
        "receive",
        "voice",
        "wave",
        "transmitted",
        "soft",
        "area",
        "brain",
        "recorded",
        "brain",
        "activated",
        "receiving",
        "stimulus",
        "cause",
        "series",
        "muscular",
        "movement",
        "speech",
        "organ",
        "finally",
        "reproduce",
        "previously",
        "recorded",
        "sound",
        "case",
        "hearing",
        "speech",
        "two",
        "side",
        "single",
        "process",
        "another",
        "case",
        "pereira",
        "studied",
        "bird",
        "emit",
        "word",
        "spoken",
        "past",
        "according",
        "due",
        "animal",
        "memory",
        "wherein",
        "voice",
        "retrieved",
        "corresponding",
        "trace",
        "phantasma",
        "stored",
        "posterior",
        "area",
        "brain",
        "trace",
        "somehow",
        "activated",
        "pas",
        "anterior",
        "zone",
        "provoke",
        "production",
        "sound",
        "created",
        "animal",
        "emit",
        "word",
        "others",
        "explanation",
        "found",
        "frequency",
        "determined",
        "voice",
        "presented",
        "animal",
        "trace",
        "frequently",
        "repeated",
        "voice",
        "mobile",
        "infrequent",
        "one",
        "much",
        "susceptible",
        "flowing",
        "direction",
        "anterior",
        "zone",
        "i",
        "another",
        "example",
        "training",
        "animal",
        "found",
        "movement",
        "answer",
        "master",
        "voice",
        "movement",
        "consist",
        "approach",
        "escape",
        "reaction",
        "diversity",
        "response",
        "explained",
        "certain",
        "voice",
        "past",
        "followed",
        "offer",
        "food",
        "whereas",
        "others",
        "produced",
        "punishment",
        "case",
        "pereira",
        "explained",
        "activation",
        "master",
        "voice",
        "phantasma",
        "posterior",
        "area",
        "animal",
        "brain",
        "generates",
        "mobilization",
        "phastasmata",
        "past",
        "event",
        "accompanied",
        "voice",
        "important",
        "note",
        "reward",
        "punishment",
        "primary",
        "role",
        "pereira",
        "concept",
        "behavior",
        "modification",
        "effective",
        "establishing",
        "new",
        "behavior",
        "also",
        "favoring",
        "learning",
        "imitation",
        "i",
        "iv",
        "fourth",
        "last",
        "type",
        "movement",
        "pereira",
        "theory",
        "instinctive",
        "movement",
        "pereira",
        "attributed",
        "movement",
        "called",
        "natural",
        "instinct",
        "among",
        "example",
        "used",
        "persecution",
        "mouse",
        "cat",
        "pereira",
        "recognized",
        "perfection",
        "complexity",
        "movement",
        "carefully",
        "examined",
        "could",
        "lead",
        "u",
        "conclusion",
        "animal",
        "sensation",
        "also",
        "posse",
        "thought",
        "reason",
        "however",
        "mere",
        "appearance",
        "evidence",
        "proof",
        "example",
        "described",
        "astonishing",
        "action",
        "semen",
        "deposited",
        "male",
        "inside",
        "vulva",
        "yet",
        "semen",
        "sensory",
        "perception",
        "said",
        "nutritional",
        "process",
        "wherein",
        "relationship",
        "different",
        "organ",
        "cause",
        "selection",
        "material",
        "rejection",
        "others",
        "neither",
        "operation",
        "result",
        "sensory",
        "process",
        "i",
        "sum",
        "pereira",
        "thought",
        "movement",
        "might",
        "explained",
        "turning",
        "two",
        "type",
        "cause",
        "specific",
        "cause",
        "generic",
        "cause",
        "first",
        "one",
        "consist",
        "various",
        "action",
        "specie",
        "receptive",
        "organ",
        "say",
        "environmental",
        "stimulation",
        "generic",
        "cause",
        "functional",
        "interest",
        "pereira",
        "placed",
        "cause",
        "general",
        "term",
        "nature",
        "play",
        "role",
        "universal",
        "regulator",
        "i",
        "broad",
        "generic",
        "cause",
        "responsible",
        "animal",
        "organ",
        "adequate",
        "enable",
        "interact",
        "habitat",
        "also",
        "explains",
        "different",
        "body",
        "type",
        "animal",
        "varying",
        "capacity",
        "trained",
        "nature",
        "also",
        "responsible",
        "fact",
        "animal",
        "external",
        "movement",
        "serve",
        "sign",
        "instance",
        "dog",
        "bark",
        "lion",
        "roar",
        "frightens",
        "u",
        "warns",
        "u",
        "possible",
        "attack",
        "pereira",
        "considered",
        "instinctive",
        "movement",
        "include",
        "basic",
        "process",
        "related",
        "environmental",
        "adaption",
        "especially",
        "search",
        "food",
        "avoiding",
        "danger",
        "etc",
        "movement",
        "result",
        "interaction",
        "natural",
        "tendency",
        "animal",
        "concrete",
        "environmental",
        "circumstance",
        "way",
        "pereira",
        "explained",
        "perfect",
        "harmony",
        "beast",
        "physical",
        "animal",
        "human",
        "surroundings",
        "see",
        "bandré",
        "llavona"
    ]
}