{
    "main_text": "Psychology || Nature of the soul\n3.1 Nature of the soul\n\nPereira’s epistemology follows from a theory of the\nsoul whose basic premises are simplicity and indivisibility\n(González Vila 1975: 22). His own vision of the rational soul\nled him to object to the philosophy of Aristotle, as well as to give a\nresponse to the question of whether the human intellect can perform\nits own activity without the support of the body. Pereira’s\nreply was a categorical yes: in fact, given his own epistemological\npremises, knowledge is possible only if it is identical with the\nsubstance of the soul itself. To demonstrate this assertion, the\nauthor addressed some issues that had been present in the debate about\nthe nature and destiny of the soul from the Middle Ages (see Nardi\n1958: 365–442; Kristeller 1979: 181–196; Valverde 2019:\n35–55).\n\nIn the first place, the problem of the soul’s indivisibility had\naroused an important debate within Aristotelianism. Aristotle himself\nhad already denounced at the end of Book I of his De Anima\nthe absurd consequences of considering that the soul has parts\nunderstood as substantially different: if the soul is the principle\nthat unifies the body, it can in no way be divisible itself; if not,\nwe should have to find another superior principle and so on to\ninfinity. Notwithstanding this assess, there is no doubt that\nAristotle also spoke of the different functions exercised by the soul\nthrough its different faculties: thus, it was inevitable that the\nunity of the soul reappeared once again. This issue had been widely\ndiscussed since the Middle Ages but remained still debated among many\nRenaissance Aristotelians. The subtleties (distinctiones) in\nthe interpretation of the thought of Aristotle became increasingly\ncomplex, giving rise to an intricate tangle of arguments and\ncounter-arguments difficult to follow even for the experts (see Di\nNapoli 1963: 339 ff.; Schmitt 1983: 13–42; Bianchi 2003a:\n133–172).\n\nLinked to this question was another topic also discussed among the\nAristotelians: are there several substantial forms in a single\ncompound? The different responses to this question had a particular\nimpact on the debate over the connection of the intellectual soul with\nthe body. Two main positions can be easily distinguished here: there\nwas a unitary position based on the thought of St. Thomas, for whom\nthe intellective soul is the only substantial form present in human\nbeings, having in itself the derived potentialities of the vegetative\nand sensitive souls; the position contrary to this had as a pattern\nthe philosophy of Averroes: in this case many – professed\nAverroists or not – admitted the existence of more than one\nsubstantial form in the same compound in order to explain the link\nbetween the human soul and the body, as can be seen in great figures\nof medieval and Renaissance Aristotelianism such as John of Jandun,\nNicole Oresme, Paul of Venice, Agostino Nifo and later Giacomo\nZabarella. Zabarella summarized this position by pointing out that the\nintellectual soul may in no way be attached directly to prime matter:\nits own complexity requires a high level of organization in the\nsubject matter so that it can serve as an appropriate instrument for\nthe powers that the human soul is capable of exercising. For this\nreason, our soul needs a preliminary compound with its own substantial\nform (Zabarella 1590 [2016: vol. II, pp. 897]; Park 1988:\n464–484).\n\nIn this debate Pereira wanted to intervene formulating a discourse\nwhose principal aim was to resolve those difficulties which were\ninherent in the relation between the soul and the body. This discourse\nwas clearly linked to the theoretical assumptions of his time, but it\nhad in addition traits of certain originality which has gone alas\nlargely unnoticed. The author of the Antoniana Margarita put\nhis finger on the deficiencies of the Scholastic-Thomist philosophy\nwhen it was applied to demonstrate the immortal nature of the human\nsoul. In this sense, he clearly assumed that the criticism of the\nAlexandrist Aristotelians, and in particular of Pietro Pomponazzi, was\nessentially correct (Pine 1986: 124 ff.; Perrone 1999:\nxlvi–lxvii). Pereira concluded that assuming that the rational\nsoul is potentially capable of exercising the activities related to\nvital functions implies recognizing that it is linked to the body.\nThus, given the premises established by Aristotle himself in his\nDe generatione animalium (II, 3), the origin of that soul\nmust be found in the same process of natural generation that gives\nrise to the living body, but this process is essentially material. For\nPereira, then, if we really want to save the immortality of the soul,\nwe must radically separate it from all activity that is related in one\nway or another to the body. He accepted the consequences of the\ndilemma that Pomponazzi had established in his De immortalitate\nanimae (1516): if the soul has the body as its own substratum\n(ut subiecto) or cannot operate without the support of the\nbody (ut obiecto), it is inseparable from it, being then\nperishable (see Pine 1986: 55–123; Kessler 1988:\n500–504). It can be said that, to a great extent,\nthe Antoniana Margarita was conceived to give a satisfactory\nanswer to this unavoidable syllogism (see Valverde 2017:\n541–553). Pereira tried to show that the rational soul has\nnothing to do with the body because it is a simple and independent\nsubstance dissociated from all those vital functions that have the\nbody as their object or as their substrate: these functions belong\nthen to a psychic principles different from the intellect: \n\n\nIn their workings, external as well as internal, all forms except the\nrational soul make use of the ways their whole is arranged, as\ninstruments, and without these they could do nothing. (AM: I.739) \n\n\nThe forms of brute beasts use heat, cold, wetness, and dryness, to\nfeed and preserve the whole, of which they are intrinsic parts, but it\nlacks unity precisely because of its intimate connection with the\nparts of the body that perform the vital functions. Therefore, this\nsoul is drawn from the very power of properly organized matter.\n\nFor Pereira, the rational soul is completely different. Its\nindivisible nature is alien to the generative process that gives rise\nto a living body. Thus, in Pereira life and spirit are sharply\ndisconnected. This is the only way to demonstrate the immortality of\nthe soul. To achieve such a demonstration, he believed that, as\nprinciple of apprehension and knowledge, the soul has to comprehend in\nitself all the episodes included in this activity. What is more, the\nsubstance of the soul is always its own activity. Now, if this is so,\nthe question is why the soul is not continually thinking. Gómez\nPereira’s answer was that attention is what determines\nboth the perception of objects which can be perceived sensorily and\nthe self-perception of the soul itself; the latter as well as the\nformer depend on the will of the soul: consequently, they are not\ncontinuous (AM: II.1071). If it were so, we could not perceive\nanything else. Moreover, the necessary condition for self-perception\nis some kind of “awakening” that the soul experiences from\nexternal objects: only after this excitement does the soul become\naware of itself, that is, of its own existence. The final conclusion\nof Pereira is then: \n\n\nIf this notion is going to precede, it will be able to serve no useful\npurpose other than recognition that there is a particular antecedent\nfrom which the soul may later elicit a consequence: namely, that it is\nself-aware. The reasoning will go as follows. I know that I know\nsomething: whatever knows, exists: therefore I exist (nosco\nme aliquid noscere, et quicquid noscit est, ergo ego sum). (AM:\nII.1075) \n\n\nOnce the soul has known its own affection, it is able to reflect on\nitself and discover itself as existing. This is a single process in\nwhich two moments must be distinguished: in the first act the soul\nknows the fact of being affected by something, whereas only in the\nsecond does it know itself as an independent entity, with autonomous\nexistence. Now, the immediacy with which the soul reaches the\nconsciousness of this existence shows that for Gómez Pereira\nthis is not a deductive development, but a pure intuitive act that has\na previous formal factor: the awareness of the affection is, in\neffect, “quodam antecedens cognitum” necessary to\nverify that the soul “seipsam noscit”.\n\nThe above expression “nosco me aliquid noscere, et quicquid\nnoscit est, ergo ego sum” is not the final sentence of\nthe Antoniana Margarita, since Gómez Pereira will\nformulate new arguments pro immortalitate, but it can be\nconsidered as the true culmination of all the discourse that the\nauthor has directed to prove the immortality of the soul. This\ndiscourse represents the central nerve of the work to which the other\ncontents, and especially the doctrine of animal insensitivity, are\nsecondary derivations. Many scholars have argued that animal\nautomatism represents the genuine motif of the Antoniana,\nprobably because of its originality, but we should not confuse\noriginality with logical priority.  Underneath the amalgam of contents\nand the diffuse and often disordered prose of the author of\nthe Antoniana, a well-structured reasoning was present, in\nwhich three stages can be distinguished (González Vila 1975:\n22.): \n\nThe nature of the act of knowledge requires an indivisible\nprinciple, so that only the soul, the unique indivisible principle in\nman, knows; the body does not participate in sensory knowledge, not\neven as a tool; therefore, the soul, in its main functions (which are\ncognitive) enjoys complete independence and full operational\nself-sufficiency regardless of the body.\nThis operational independence logically founds the ontological\nindependence that allows the survival of the separated soul. Although\nPereira does not deny the “corporeal” conditioning factors\nto which knowledge is subject, as evidenced by experience, he\nrecognizes that the soul is weighed down by the body in its cognitive\noperations, so the body restricts the original and absolute cognitive\nspontaneity of the soul. \nOnce the operating-ontological independence of the soul is\nasserted, and consequently its separate subsistence, the perpetuity of\nthis subsistence does not involve any difficulty, since in the soul,\nwhich is indivisible, there is no intrinsic principle of\ncorruption.\n\n",
    "section_title": "3.1 Nature of the soul",
    "entry_title": "Gómez Pereira",
    "hierarchy_title": "Gómez Pereira || Psychology || Nature of the soul",
    "tokenized_text": [
        "psychology",
        "nature",
        "soul",
        "nature",
        "soul",
        "pereira",
        "epistemology",
        "follows",
        "theory",
        "soul",
        "whose",
        "basic",
        "premise",
        "simplicity",
        "indivisibility",
        "gonzález",
        "vila",
        "vision",
        "rational",
        "soul",
        "led",
        "object",
        "philosophy",
        "aristotle",
        "well",
        "give",
        "response",
        "question",
        "whether",
        "human",
        "intellect",
        "perform",
        "activity",
        "without",
        "support",
        "body",
        "pereira",
        "reply",
        "categorical",
        "yes",
        "fact",
        "given",
        "epistemological",
        "premise",
        "knowledge",
        "possible",
        "identical",
        "substance",
        "soul",
        "demonstrate",
        "assertion",
        "author",
        "addressed",
        "issue",
        "present",
        "debate",
        "nature",
        "destiny",
        "soul",
        "middle",
        "age",
        "see",
        "nardi",
        "kristeller",
        "valverde",
        "first",
        "place",
        "problem",
        "soul",
        "indivisibility",
        "aroused",
        "important",
        "debate",
        "within",
        "aristotelianism",
        "aristotle",
        "already",
        "denounced",
        "end",
        "book",
        "de",
        "anima",
        "absurd",
        "consequence",
        "considering",
        "soul",
        "part",
        "understood",
        "substantially",
        "different",
        "soul",
        "principle",
        "unifies",
        "body",
        "way",
        "divisible",
        "find",
        "another",
        "superior",
        "principle",
        "infinity",
        "notwithstanding",
        "ass",
        "doubt",
        "aristotle",
        "also",
        "spoke",
        "different",
        "function",
        "exercised",
        "soul",
        "different",
        "faculty",
        "thus",
        "inevitable",
        "unity",
        "soul",
        "reappeared",
        "issue",
        "widely",
        "discussed",
        "since",
        "middle",
        "age",
        "remained",
        "still",
        "debated",
        "among",
        "many",
        "renaissance",
        "aristotelian",
        "subtlety",
        "distinctiones",
        "interpretation",
        "thought",
        "aristotle",
        "became",
        "increasingly",
        "complex",
        "giving",
        "rise",
        "intricate",
        "tangle",
        "argument",
        "counterarguments",
        "difficult",
        "follow",
        "even",
        "expert",
        "see",
        "di",
        "napoli",
        "ff",
        "schmitt",
        "bianchi",
        "a",
        "linked",
        "question",
        "another",
        "topic",
        "also",
        "discussed",
        "among",
        "aristotelian",
        "several",
        "substantial",
        "form",
        "single",
        "compound",
        "different",
        "response",
        "question",
        "particular",
        "impact",
        "debate",
        "connection",
        "intellectual",
        "soul",
        "body",
        "two",
        "main",
        "position",
        "easily",
        "distinguished",
        "unitary",
        "position",
        "based",
        "thought",
        "st",
        "thomas",
        "intellective",
        "soul",
        "substantial",
        "form",
        "present",
        "human",
        "being",
        "derived",
        "potentiality",
        "vegetative",
        "sensitive",
        "soul",
        "position",
        "contrary",
        "pattern",
        "philosophy",
        "averroes",
        "case",
        "many",
        "professed",
        "averroists",
        "admitted",
        "existence",
        "one",
        "substantial",
        "form",
        "compound",
        "order",
        "explain",
        "link",
        "human",
        "soul",
        "body",
        "seen",
        "great",
        "figure",
        "medieval",
        "renaissance",
        "aristotelianism",
        "john",
        "jandun",
        "nicole",
        "oresme",
        "paul",
        "venice",
        "agostino",
        "nifo",
        "later",
        "giacomo",
        "zabarella",
        "zabarella",
        "summarized",
        "position",
        "pointing",
        "intellectual",
        "soul",
        "may",
        "way",
        "attached",
        "directly",
        "prime",
        "matter",
        "complexity",
        "requires",
        "high",
        "level",
        "organization",
        "subject",
        "matter",
        "serve",
        "appropriate",
        "instrument",
        "power",
        "human",
        "soul",
        "capable",
        "exercising",
        "reason",
        "soul",
        "need",
        "preliminary",
        "compound",
        "substantial",
        "form",
        "zabarella",
        "vol",
        "ii",
        "pp",
        "park",
        "debate",
        "pereira",
        "wanted",
        "intervene",
        "formulating",
        "discourse",
        "whose",
        "principal",
        "aim",
        "resolve",
        "difficulty",
        "inherent",
        "relation",
        "soul",
        "body",
        "discourse",
        "clearly",
        "linked",
        "theoretical",
        "assumption",
        "time",
        "addition",
        "trait",
        "certain",
        "originality",
        "gone",
        "ala",
        "largely",
        "unnoticed",
        "author",
        "antoniana",
        "margarita",
        "put",
        "finger",
        "deficiency",
        "scholasticthomist",
        "philosophy",
        "applied",
        "demonstrate",
        "immortal",
        "nature",
        "human",
        "soul",
        "sense",
        "clearly",
        "assumed",
        "criticism",
        "alexandrist",
        "aristotelian",
        "particular",
        "pietro",
        "pomponazzi",
        "essentially",
        "correct",
        "pine",
        "ff",
        "perrone",
        "xlvilxvii",
        "pereira",
        "concluded",
        "assuming",
        "rational",
        "soul",
        "potentially",
        "capable",
        "exercising",
        "activity",
        "related",
        "vital",
        "function",
        "implies",
        "recognizing",
        "linked",
        "body",
        "thus",
        "given",
        "premise",
        "established",
        "aristotle",
        "de",
        "generatione",
        "animalium",
        "ii",
        "origin",
        "soul",
        "must",
        "found",
        "process",
        "natural",
        "generation",
        "give",
        "rise",
        "living",
        "body",
        "process",
        "essentially",
        "material",
        "pereira",
        "really",
        "want",
        "save",
        "immortality",
        "soul",
        "must",
        "radically",
        "separate",
        "activity",
        "related",
        "one",
        "way",
        "another",
        "body",
        "accepted",
        "consequence",
        "dilemma",
        "pomponazzi",
        "established",
        "de",
        "immortalitate",
        "animae",
        "soul",
        "body",
        "substratum",
        "ut",
        "subiecto",
        "operate",
        "without",
        "support",
        "body",
        "ut",
        "obiecto",
        "inseparable",
        "perishable",
        "see",
        "pine",
        "kessler",
        "said",
        "great",
        "extent",
        "antoniana",
        "margarita",
        "conceived",
        "give",
        "satisfactory",
        "answer",
        "unavoidable",
        "syllogism",
        "see",
        "valverde",
        "pereira",
        "tried",
        "show",
        "rational",
        "soul",
        "nothing",
        "body",
        "simple",
        "independent",
        "substance",
        "dissociated",
        "vital",
        "function",
        "body",
        "object",
        "substrate",
        "function",
        "belong",
        "psychic",
        "principle",
        "different",
        "intellect",
        "working",
        "external",
        "well",
        "internal",
        "form",
        "except",
        "rational",
        "soul",
        "make",
        "use",
        "way",
        "whole",
        "arranged",
        "instrument",
        "without",
        "could",
        "nothing",
        "i",
        "form",
        "brute",
        "beast",
        "use",
        "heat",
        "cold",
        "wetness",
        "dryness",
        "feed",
        "preserve",
        "whole",
        "intrinsic",
        "part",
        "lack",
        "unity",
        "precisely",
        "intimate",
        "connection",
        "part",
        "body",
        "perform",
        "vital",
        "function",
        "therefore",
        "soul",
        "drawn",
        "power",
        "properly",
        "organized",
        "matter",
        "pereira",
        "rational",
        "soul",
        "completely",
        "different",
        "indivisible",
        "nature",
        "alien",
        "generative",
        "process",
        "give",
        "rise",
        "living",
        "body",
        "thus",
        "pereira",
        "life",
        "spirit",
        "sharply",
        "disconnected",
        "way",
        "demonstrate",
        "immortality",
        "soul",
        "achieve",
        "demonstration",
        "believed",
        "principle",
        "apprehension",
        "knowledge",
        "soul",
        "comprehend",
        "episode",
        "included",
        "activity",
        "substance",
        "soul",
        "always",
        "activity",
        "question",
        "soul",
        "continually",
        "thinking",
        "gómez",
        "pereira",
        "answer",
        "attention",
        "determines",
        "perception",
        "object",
        "perceived",
        "sensorily",
        "selfperception",
        "soul",
        "latter",
        "well",
        "former",
        "depend",
        "soul",
        "consequently",
        "continuous",
        "ii",
        "could",
        "perceive",
        "anything",
        "else",
        "moreover",
        "necessary",
        "condition",
        "selfperception",
        "kind",
        "awakening",
        "soul",
        "experience",
        "external",
        "object",
        "excitement",
        "soul",
        "become",
        "aware",
        "existence",
        "final",
        "conclusion",
        "pereira",
        "notion",
        "going",
        "precede",
        "able",
        "serve",
        "useful",
        "purpose",
        "recognition",
        "particular",
        "antecedent",
        "soul",
        "may",
        "later",
        "elicit",
        "consequence",
        "namely",
        "selfaware",
        "reasoning",
        "go",
        "follows",
        "know",
        "know",
        "something",
        "whatever",
        "know",
        "exists",
        "therefore",
        "exist",
        "nosco",
        "aliquid",
        "noscere",
        "et",
        "quicquid",
        "noscit",
        "est",
        "ergo",
        "ego",
        "sum",
        "ii",
        "soul",
        "known",
        "affection",
        "able",
        "reflect",
        "discover",
        "existing",
        "single",
        "process",
        "two",
        "moment",
        "must",
        "distinguished",
        "first",
        "act",
        "soul",
        "know",
        "fact",
        "affected",
        "something",
        "whereas",
        "second",
        "know",
        "independent",
        "entity",
        "autonomous",
        "existence",
        "immediacy",
        "soul",
        "reach",
        "consciousness",
        "existence",
        "show",
        "gómez",
        "pereira",
        "deductive",
        "development",
        "pure",
        "intuitive",
        "act",
        "previous",
        "formal",
        "factor",
        "awareness",
        "affection",
        "effect",
        "quodam",
        "antecedens",
        "cognitum",
        "necessary",
        "verify",
        "soul",
        "seipsam",
        "noscit",
        "expression",
        "nosco",
        "aliquid",
        "noscere",
        "et",
        "quicquid",
        "noscit",
        "est",
        "ergo",
        "ego",
        "sum",
        "final",
        "sentence",
        "antoniana",
        "margarita",
        "since",
        "gómez",
        "pereira",
        "formulate",
        "new",
        "argument",
        "pro",
        "immortalitate",
        "considered",
        "true",
        "culmination",
        "discourse",
        "author",
        "directed",
        "prove",
        "immortality",
        "soul",
        "discourse",
        "represents",
        "central",
        "nerve",
        "work",
        "content",
        "especially",
        "doctrine",
        "animal",
        "insensitivity",
        "secondary",
        "derivation",
        "many",
        "scholar",
        "argued",
        "animal",
        "automatism",
        "represents",
        "genuine",
        "motif",
        "antoniana",
        "probably",
        "originality",
        "confuse",
        "originality",
        "logical",
        "priority",
        "underneath",
        "amalgam",
        "content",
        "diffuse",
        "often",
        "disordered",
        "prose",
        "author",
        "antoniana",
        "wellstructured",
        "reasoning",
        "present",
        "three",
        "stage",
        "distinguished",
        "gonzález",
        "vila",
        "nature",
        "act",
        "knowledge",
        "requires",
        "indivisible",
        "principle",
        "soul",
        "unique",
        "indivisible",
        "principle",
        "man",
        "know",
        "body",
        "participate",
        "sensory",
        "knowledge",
        "even",
        "tool",
        "therefore",
        "soul",
        "main",
        "function",
        "cognitive",
        "enjoys",
        "complete",
        "independence",
        "full",
        "operational",
        "selfsufficiency",
        "regardless",
        "body",
        "operational",
        "independence",
        "logically",
        "found",
        "ontological",
        "independence",
        "allows",
        "survival",
        "separated",
        "soul",
        "although",
        "pereira",
        "deny",
        "corporeal",
        "conditioning",
        "factor",
        "knowledge",
        "subject",
        "evidenced",
        "experience",
        "recognizes",
        "soul",
        "weighed",
        "body",
        "cognitive",
        "operation",
        "body",
        "restricts",
        "original",
        "absolute",
        "cognitive",
        "spontaneity",
        "soul",
        "operatingontological",
        "independence",
        "soul",
        "asserted",
        "consequently",
        "separate",
        "subsistence",
        "perpetuity",
        "subsistence",
        "involve",
        "difficulty",
        "since",
        "soul",
        "indivisible",
        "intrinsic",
        "principle",
        "corruption"
    ]
}