{
    "main_text": "Nominalism and Mereology || Nominalisms\n3.1 Nominalisms\n“Nominalism” can refer to a variety of different,\nalbeit related, positions. In most cases, it either refers to the\nrejection of universals or of abstract objects. What nominalism means\nfor Goodman undergoes two radical changes. In his Ph.D. thesis, A\nStudy of Qualities, he uses the label “nominalist” to\ndescribe constructional systems whose constructional basis does not\ninclude abstracta, such as Carnap’s system in the Aufbau\n(Carnap 1928). Whether classes are used in the construction, as\nCarnap’s Aufbau indeed does, is irrelevant for the\ncharacterization of these systems as\n“nominalist”. Nominalism is not an issue of discussion\nhere; “nominalist” merely occurs as a classification (for\nmore details on constructional systems see\n section 4\nbelow.)\nGoodman first endorses a nominalist position in his famous joint article\nwith W.V. Quine, “Steps Toward a Constructive Nominalism”\n(1947). Goodman and Quine set the agenda in the very first sentence\nof the article: “We do not believe in abstract\nobjects”. And they conclude the first paragraph: “Any\nsystem that countenances abstract entities we deem unsatisfactory as\na final philosophy” (Goodman and Quine 1947, 105).\nGoodman and Quine first discuss nominalistically acceptable\nreductions of platonist statements. “Platonist” here\nrefers to the use of terms for classes, numbers, properties, and\nrelations—in short, anything that is not a concrete particular. \nThe first examples are straightforward and their resolutions are\nwell-known today.  “Class \\(A\\) is included in\nclass \\(B\\)” can be rendered as “Everything that is\nan \\(A\\) is a \\(B\\)” (where “\\(A\\)”\nand “\\(B\\)” now stand for the appropriate predicates,\nrather than for classes). “Class \\(C\\) has two\nmembers”, or “The number of \\(C\\)s is 2”, is\nrendered as “There are two \\(C\\)s”, and spelt out\nformally (based on Russell’s theory of definite \n descriptions—see\n the discussion in the entry on Russell)\n as:\n\n\\[\n\n\\exists x \\exists y(x \\ne y \\land \\forall z(Cz \\equiv (z = x \\lor z = y)))\n\n\\]\n\nNo recourse to classes or other abstract entities (e.g., numbers)\nis necessary. However, this strategy does not deliver a general recipe\nto account for statements that are typically expressed in a\nstraightforward set-theoretic way. For instance, it seems to Goodman\nand Quine that there is no general recipe for expressing statements\nlike “There are more cats than dogs” in a nominalistically\nacceptable fashion. If the total number of dogs were known, then, in\nprinciple, the quantifier strategy above could be used—albeit\nthat, with hundreds of millions of dogs alive today, it would\ncertainly not be practical. Quine and Goodman suggest a translation\ninto the language of mereology with an additional auxiliary predicate\n“bigger than”; while this provides a surprisingly\nversatile solution for many cases, it is still not completely general\n(Goodman and Quine 1947, 110–11). Further, a general\ndefinition of the ancestral of a relation \n(as first given by Gottlob Frege 1879, §26) seemed to Quine and\nGoodman at the time to be out of reach for the nominalist.  Leon\nHenkin (1962, 188–89) finds an elegant solution, quantifying\nover lists of successive inscriptions. Goodman later (PP, 153)\nsuggests that his technique to formulate the ancestral of matching\n(SA, §§IX–X) could also solve the problem. We note\nthat if second-order logic can be made palatable to the\nnominalist—perhaps by adopting a plural interpretation of\nsecond-order logic \n (Boolos 1984, 1985), or a proof-theoretic semantics, \nor in any other way—Frege’s original definition (which is not\nformulated in set theory, but in his version of second-order logic)\ncan be employed (Rossberg and Cohnitz 2009).\nEven though these two particularly pressing gaps appear to be\ncapable of being closed, a general recipe for recasting platonist\nstatements appears out of reach, in particular, when we consider\nstatements of pure mathematics itself. Without such a nominalist\nrecasting, Goodman and Quine hold, platonist mathematical\nstatements cannot be deemed intelligible from a strictly nominalist\nperspective. The question becomes, according to Goodman and Quine,\n\n\nhow, if we regard the sentences of mathematics merely as strings of\nmarks without meaning, we can account for the fact that mathematicians\ncan proceed with such remarkable agreement as to methods and\nresults. Our answer is that such intelligibility as mathematics\npossesses derives from the syntactical or metamathematical rules\ngoverning those marks. (Goodman and Quine 1947, 111)\n\n\n\n\nGoodman and Quine construct a theory of syntax for the\nset-theoretic language and a proof theory based on the Calculus of\n Individuals (see\n section 3.2 below) \n supplemented with a token-concatenation theory. The tokens in question\nare concrete, particular inscriptions of the logical symbols,\nvariable-letters, parentheses, and the “\\(\\in\\)” (for\nset-membership) that are use to formulate the language of set\ntheory. Primitive predicates are introduced to categorize the\ndifferent primitive symbols: all concrete, particular\n“\\(\\in\\)”-inscriptions, for instance, fall under the\npredicate “Ep”. Concrete complex formulae, e.g., \n“\\(x \\in y\\)”, are concatenations of concrete primitive\nsymbols—in our case the concatenation of\n“\\(x\\)” and “\\(\\in\\)” and\n“\\(y\\)”. Bit by bit, Goodman and Quine define their\nway up to which concrete inscriptions count as correctly formed\nsentences of the language of set theory, and finally which concrete\ninscriptions count as proofs and theorems. Goodman and Quine argue\nthat in this way the nominalist can explain the “remarkable\nagreement” of mathematicians mentioned above.\nSince Quine and Goodman not only impose nominalistic strictures,\nbut also finitism in their joint article (Quine and Goodman 1947,\n§2), the syntactic and proof-theoretic notions defined still fall\nshort of the usual platonist counterparts. Even if any given sentence\nor proof is finite in length, the platonist would hold that there are\nsentences and proofs of any finite length, and thus sentences and\nproofs that are too long to have a concrete inscription in a given\nfinite universe.  Moreover, there are infinitely many (and indeed\nuncountably many) truths of mathematics, but—in particular, in a\nfinite universe—there will only ever be finitely many\ninscriptions of theorems. Even if the universe is in fact infinite,\nperhaps a theory of syntax and proof should not make itself hostage to\nthis circumstance.\nPlatonists and nominalists will likely disagree whether Goodman and\nQuine successfully argue their case in their joint paper. Goodman and\nQuine will be able to account for any actual mathematical proof and\nany theorem actually proven, since there are at any stage only\nfinitely many of them, each of which is small enough to fit in our\nuniverse comfortably. Thus, arguably, they reach their goal of\nexplaining the agreement in mathematical practice without presupposing\nmathematical platonism. Due to its finitistic nature, however, the\naccount radically falls short of giving explications that are\nextensionally equivalent to the platonists’ conceptions (see Rossberg\nand Cohnitz 2009 for discussion and a landscape of possible\nsolutions). Goodman later (1956) explains that nominalism is not\nincompatible with the rejection of finitism; it is\n at most incongruous […]. The nominalist is\nunlikely to be a non-finitist only in much the way a bricklayer is\nunlikely to be a ballet dancer. (PP, 166; on the question of finitism\nsee also MM, 53; Field 1980; Hellman 2001; Mancosu\n2005)\nGiven the ardent pronouncements in the 1947 article with Quine, the\ncommon misunderstanding that Goodman’s mature nominalism encompasses,\nor is motivated by, the rejection of abstract objects is\nunderstandable. Nonetheless, it is incorrect. Goodman does not reject\nall abstract objects: in The Structure of Appearance, he\nembraces qualia as abstract objects (see\n section 4 below), \nsome of which (in fact all but moments) are universals (SA,\n§VII.8). Goodman’s mature nominalism, from The Structure of\nAppearance onwards, is a rejection of the use of sets\n(and objects constructed from them) in constructional systems, and no\nblanket rejection of all universals or abstract particulars. To be\nsure, Goodman also refuses to acknowledge properties and other\nnon-extensional objects, but the reason for his rejection of such entities is\nindependent, and in fact more fundamental, than his nominalism: it is\nhis strict requirement of extensionality (WW, 95n3; see also\n section 6 below). \nGoodman does occasionally include extensionalism in his nominalism\n(see LA, xiii, 74; under the entry “nominalism” the index\nof LA references some passage which discusses properties ; see also\nMM, 51; WW, 10n14). Strictly speaking, however, nominalism for Goodman\nis the refusal to use class terms in a constructional system—no\nmore, and no less.\nGoodman presents two positive considerations for the rejection of a\nset-theoretic language (not counting the remarks in Goodman and Quine\n1947, 105). Methodologically, nominalistic constructions have the\nadvantage that they do not use any resources that the platonist could\nnot accept (Goodman 1958; PP, 171). The advantage of a nominalistic\nconstruction is thus one of parsimony:\n\nAs originally presented in A Study of Qualities […]\nthe system was not nominalistic. I feel that the recasting to meet\nnominalistic demands has resulted not only in a sparser ontology but\nalso in a considerable gain in simplicity and clarity. Moreover,\nanyone who dislikes the change may be assured that the process of\nreplatonizing the system—unlike the converse process—is\nobvious and automatic; and this in itself is an advantage of a\nnominalistic formulation. (SA, Original Introduction, page L of the\n3rd. ed.; regarding the simplicity remark see SA, §III.7)\n\nAll resources employed by the nominalist are (or should be)\nacceptable to the platonist, while the converse may not be the case\n(see also Goodman 1956, 31 (PP, 171); MM, 50).\nBy the time he writes The Structure of Appearance, Goodman\nhas come around to a different criterion for whether or not a system\nobeys nominalistic structures: the predicates present in the whole\nsystem (SA, §II.3). This is as opposed to merely considering the\nbasis of the system in answer to this question as he does in A\nStudy of Qualities (as mentioned above). In Goodman 1958 (see\nalso SA, §III.7), he suggests a different, perhaps more precise,\nway to characterize nominalistic systems in terms of the\nsystem’s generating relation:\n\nSystem S is nominalistic iff S does not\ngenerate more than one entity from exactly the same atoms\nof S.\n\nGoodman describes the criterion as demanding that “sameness\nof content” entails identity. Systems that have only\nmereological means of “generating” composite objects (see\nsection\n ",
    "section_title": "3.1 Nominalisms",
    "entry_title": "Nelson Goodman",
    "hierarchy_title": "Nelson Goodman || Nominalism and Mereology || Nominalisms",
    "tokenized_text": [
        "nominalism",
        "mereology",
        "nominalism",
        "nominalism",
        "nominalism",
        "refer",
        "variety",
        "different",
        "albeit",
        "related",
        "position",
        "case",
        "either",
        "refers",
        "rejection",
        "universal",
        "abstract",
        "object",
        "nominalism",
        "mean",
        "goodman",
        "undergoes",
        "two",
        "radical",
        "change",
        "phd",
        "thesis",
        "study",
        "quality",
        "us",
        "label",
        "nominalist",
        "describe",
        "constructional",
        "system",
        "whose",
        "constructional",
        "basis",
        "include",
        "abstracta",
        "carnap",
        "system",
        "aufbau",
        "carnap",
        "whether",
        "class",
        "used",
        "construction",
        "carnap",
        "aufbau",
        "indeed",
        "irrelevant",
        "characterization",
        "system",
        "nominalist",
        "nominalism",
        "issue",
        "discussion",
        "nominalist",
        "merely",
        "occurs",
        "classification",
        "detail",
        "constructional",
        "system",
        "see",
        "section",
        "goodman",
        "first",
        "endorses",
        "nominalist",
        "position",
        "famous",
        "joint",
        "article",
        "wv",
        "quine",
        "step",
        "toward",
        "constructive",
        "nominalism",
        "goodman",
        "quine",
        "set",
        "agenda",
        "first",
        "sentence",
        "article",
        "believe",
        "abstract",
        "object",
        "conclude",
        "first",
        "paragraph",
        "system",
        "countenance",
        "abstract",
        "entity",
        "deem",
        "unsatisfactory",
        "final",
        "philosophy",
        "goodman",
        "quine",
        "goodman",
        "quine",
        "first",
        "discus",
        "nominalistically",
        "acceptable",
        "reduction",
        "platonist",
        "statement",
        "platonist",
        "refers",
        "use",
        "term",
        "class",
        "number",
        "property",
        "relationsin",
        "short",
        "anything",
        "concrete",
        "particular",
        "first",
        "example",
        "straightforward",
        "resolution",
        "wellknown",
        "today",
        "class",
        "a",
        "included",
        "class",
        "b",
        "rendered",
        "everything",
        "a",
        "b",
        "a",
        "b",
        "stand",
        "appropriate",
        "predicate",
        "rather",
        "class",
        "class",
        "c",
        "two",
        "member",
        "number",
        "c",
        "rendered",
        "two",
        "c",
        "spelt",
        "formally",
        "based",
        "russell",
        "theory",
        "definite",
        "descriptionssee",
        "discussion",
        "entry",
        "russell",
        "exists",
        "x",
        "exists",
        "x",
        "ne",
        "land",
        "forall",
        "z",
        "cz",
        "equiv",
        "z",
        "x",
        "lor",
        "z",
        "recourse",
        "class",
        "abstract",
        "entity",
        "eg",
        "number",
        "necessary",
        "however",
        "strategy",
        "deliver",
        "general",
        "recipe",
        "account",
        "statement",
        "typically",
        "expressed",
        "straightforward",
        "settheoretic",
        "way",
        "instance",
        "seems",
        "goodman",
        "quine",
        "general",
        "recipe",
        "expressing",
        "statement",
        "like",
        "cat",
        "dog",
        "nominalistically",
        "acceptable",
        "fashion",
        "total",
        "number",
        "dog",
        "known",
        "principle",
        "quantifier",
        "strategy",
        "could",
        "usedalbeit",
        "hundred",
        "million",
        "dog",
        "alive",
        "today",
        "would",
        "certainly",
        "practical",
        "quine",
        "goodman",
        "suggest",
        "translation",
        "language",
        "mereology",
        "additional",
        "auxiliary",
        "predicate",
        "bigger",
        "provides",
        "surprisingly",
        "versatile",
        "solution",
        "many",
        "case",
        "still",
        "completely",
        "general",
        "goodman",
        "quine",
        "general",
        "definition",
        "ancestral",
        "relation",
        "first",
        "given",
        "gottlob",
        "frege",
        "seemed",
        "quine",
        "goodman",
        "time",
        "reach",
        "nominalist",
        "leon",
        "henkin",
        "find",
        "elegant",
        "solution",
        "quantifying",
        "list",
        "successive",
        "inscription",
        "goodman",
        "later",
        "pp",
        "suggests",
        "technique",
        "formulate",
        "ancestral",
        "matching",
        "sa",
        "ixx",
        "could",
        "also",
        "solve",
        "problem",
        "note",
        "secondorder",
        "logic",
        "made",
        "palatable",
        "nominalistperhaps",
        "adopting",
        "plural",
        "interpretation",
        "secondorder",
        "logic",
        "boolos",
        "prooftheoretic",
        "semantics",
        "wayfrege",
        "original",
        "definition",
        "formulated",
        "set",
        "theory",
        "version",
        "secondorder",
        "logic",
        "employed",
        "rossberg",
        "cohnitz",
        "even",
        "though",
        "two",
        "particularly",
        "pressing",
        "gap",
        "appear",
        "capable",
        "closed",
        "general",
        "recipe",
        "recasting",
        "platonist",
        "statement",
        "appears",
        "reach",
        "particular",
        "consider",
        "statement",
        "pure",
        "mathematics",
        "without",
        "nominalist",
        "recasting",
        "goodman",
        "quine",
        "hold",
        "platonist",
        "mathematical",
        "statement",
        "deemed",
        "intelligible",
        "strictly",
        "nominalist",
        "perspective",
        "question",
        "becomes",
        "according",
        "goodman",
        "quine",
        "regard",
        "sentence",
        "mathematics",
        "merely",
        "string",
        "mark",
        "without",
        "meaning",
        "account",
        "fact",
        "mathematician",
        "proceed",
        "remarkable",
        "agreement",
        "method",
        "result",
        "answer",
        "intelligibility",
        "mathematics",
        "posse",
        "derives",
        "syntactical",
        "metamathematical",
        "rule",
        "governing",
        "mark",
        "goodman",
        "quine",
        "goodman",
        "quine",
        "construct",
        "theory",
        "syntax",
        "settheoretic",
        "language",
        "proof",
        "theory",
        "based",
        "calculus",
        "individual",
        "see",
        "section",
        "supplemented",
        "tokenconcatenation",
        "theory",
        "token",
        "question",
        "concrete",
        "particular",
        "inscription",
        "logical",
        "symbol",
        "variableletters",
        "parenthesis",
        "in",
        "setmembership",
        "use",
        "formulate",
        "language",
        "set",
        "theory",
        "primitive",
        "predicate",
        "introduced",
        "categorize",
        "different",
        "primitive",
        "symbol",
        "concrete",
        "particular",
        "in",
        "inscriptions",
        "instance",
        "fall",
        "predicate",
        "ep",
        "concrete",
        "complex",
        "formula",
        "eg",
        "x",
        "in",
        "y",
        "concatenation",
        "concrete",
        "primitive",
        "symbolsin",
        "case",
        "concatenation",
        "x",
        "in",
        "y",
        "bit",
        "bit",
        "goodman",
        "quine",
        "define",
        "way",
        "concrete",
        "inscription",
        "count",
        "correctly",
        "formed",
        "sentence",
        "language",
        "set",
        "theory",
        "finally",
        "concrete",
        "inscription",
        "count",
        "proof",
        "theorem",
        "goodman",
        "quine",
        "argue",
        "way",
        "nominalist",
        "explain",
        "remarkable",
        "agreement",
        "mathematician",
        "mentioned",
        "since",
        "quine",
        "goodman",
        "impose",
        "nominalistic",
        "stricture",
        "also",
        "finitism",
        "joint",
        "article",
        "quine",
        "goodman",
        "syntactic",
        "prooftheoretic",
        "notion",
        "defined",
        "still",
        "fall",
        "short",
        "usual",
        "platonist",
        "counterpart",
        "even",
        "given",
        "sentence",
        "proof",
        "finite",
        "length",
        "platonist",
        "would",
        "hold",
        "sentence",
        "proof",
        "finite",
        "length",
        "thus",
        "sentence",
        "proof",
        "long",
        "concrete",
        "inscription",
        "given",
        "finite",
        "universe",
        "moreover",
        "infinitely",
        "many",
        "indeed",
        "uncountably",
        "many",
        "truth",
        "mathematics",
        "butin",
        "particular",
        "finite",
        "universethere",
        "ever",
        "finitely",
        "many",
        "inscription",
        "theorem",
        "even",
        "universe",
        "fact",
        "infinite",
        "perhaps",
        "theory",
        "syntax",
        "proof",
        "make",
        "hostage",
        "circumstance",
        "platonist",
        "nominalist",
        "likely",
        "disagree",
        "whether",
        "goodman",
        "quine",
        "successfully",
        "argue",
        "case",
        "joint",
        "paper",
        "goodman",
        "quine",
        "able",
        "account",
        "actual",
        "mathematical",
        "proof",
        "theorem",
        "actually",
        "proven",
        "since",
        "stage",
        "finitely",
        "many",
        "small",
        "enough",
        "fit",
        "universe",
        "comfortably",
        "thus",
        "arguably",
        "reach",
        "goal",
        "explaining",
        "agreement",
        "mathematical",
        "practice",
        "without",
        "presupposing",
        "mathematical",
        "platonism",
        "due",
        "finitistic",
        "nature",
        "however",
        "account",
        "radically",
        "fall",
        "short",
        "giving",
        "explication",
        "extensionally",
        "equivalent",
        "platonist",
        "conception",
        "see",
        "rossberg",
        "cohnitz",
        "discussion",
        "landscape",
        "possible",
        "solution",
        "goodman",
        "later",
        "explains",
        "nominalism",
        "incompatible",
        "rejection",
        "finitism",
        "incongruous",
        "nominalist",
        "unlikely",
        "nonfinitist",
        "much",
        "way",
        "bricklayer",
        "unlikely",
        "ballet",
        "dancer",
        "pp",
        "question",
        "finitism",
        "see",
        "also",
        "mm",
        "field",
        "hellman",
        "mancosu",
        "given",
        "ardent",
        "pronouncement",
        "article",
        "quine",
        "common",
        "misunderstanding",
        "goodman",
        "mature",
        "nominalism",
        "encompasses",
        "motivated",
        "rejection",
        "abstract",
        "object",
        "understandable",
        "nonetheless",
        "incorrect",
        "goodman",
        "reject",
        "abstract",
        "object",
        "structure",
        "appearance",
        "embrace",
        "qualia",
        "abstract",
        "object",
        "see",
        "section",
        "fact",
        "moment",
        "universal",
        "sa",
        "vii",
        "goodman",
        "mature",
        "nominalism",
        "structure",
        "appearance",
        "onwards",
        "rejection",
        "use",
        "set",
        "object",
        "constructed",
        "constructional",
        "system",
        "blanket",
        "rejection",
        "universal",
        "abstract",
        "particular",
        "sure",
        "goodman",
        "also",
        "refuse",
        "acknowledge",
        "property",
        "nonextensional",
        "object",
        "reason",
        "rejection",
        "entity",
        "independent",
        "fact",
        "fundamental",
        "nominalism",
        "strict",
        "requirement",
        "extensionality",
        "ww",
        "n",
        "see",
        "also",
        "section",
        "goodman",
        "occasionally",
        "include",
        "extensionalism",
        "nominalism",
        "see",
        "la",
        "xiii",
        "entry",
        "nominalism",
        "index",
        "la",
        "reference",
        "passage",
        "discus",
        "property",
        "see",
        "also",
        "mm",
        "ww",
        "n",
        "strictly",
        "speaking",
        "however",
        "nominalism",
        "goodman",
        "refusal",
        "use",
        "class",
        "term",
        "constructional",
        "systemno",
        "le",
        "goodman",
        "present",
        "two",
        "positive",
        "consideration",
        "rejection",
        "settheoretic",
        "language",
        "counting",
        "remark",
        "goodman",
        "quine",
        "methodologically",
        "nominalistic",
        "construction",
        "advantage",
        "use",
        "resource",
        "platonist",
        "could",
        "accept",
        "goodman",
        "pp",
        "advantage",
        "nominalistic",
        "construction",
        "thus",
        "one",
        "parsimony",
        "originally",
        "presented",
        "study",
        "quality",
        "system",
        "nominalistic",
        "feel",
        "recasting",
        "meet",
        "nominalistic",
        "demand",
        "resulted",
        "sparser",
        "ontology",
        "also",
        "considerable",
        "gain",
        "simplicity",
        "clarity",
        "moreover",
        "anyone",
        "dislike",
        "change",
        "may",
        "assured",
        "process",
        "replatonizing",
        "systemunlike",
        "converse",
        "processis",
        "obvious",
        "automatic",
        "advantage",
        "nominalistic",
        "formulation",
        "sa",
        "original",
        "introduction",
        "page",
        "l",
        "rd",
        "ed",
        "regarding",
        "simplicity",
        "remark",
        "see",
        "sa",
        "iii",
        "resource",
        "employed",
        "nominalist",
        "acceptable",
        "platonist",
        "converse",
        "may",
        "case",
        "see",
        "also",
        "goodman",
        "pp",
        "mm",
        "time",
        "writes",
        "structure",
        "appearance",
        "goodman",
        "come",
        "around",
        "different",
        "criterion",
        "whether",
        "system",
        "obeys",
        "nominalistic",
        "structure",
        "predicate",
        "present",
        "whole",
        "system",
        "sa",
        "ii",
        "opposed",
        "merely",
        "considering",
        "basis",
        "system",
        "answer",
        "question",
        "study",
        "quality",
        "mentioned",
        "goodman",
        "see",
        "also",
        "sa",
        "iii",
        "suggests",
        "different",
        "perhaps",
        "precise",
        "way",
        "characterize",
        "nominalistic",
        "system",
        "term",
        "system",
        "generating",
        "relation",
        "system",
        "nominalistic",
        "iff",
        "generate",
        "one",
        "entity",
        "exactly",
        "atom",
        "s",
        "goodman",
        "describes",
        "criterion",
        "demanding",
        "sameness",
        "content",
        "entail",
        "identity",
        "system",
        "mereological",
        "mean",
        "generating",
        "composite",
        "object",
        "see",
        "section"
    ]
}