{
    "main_text": "Gorampa’s Madhyamaka || Negation\n2.2 Negation\n\nIn order to cultivate an awakened mind that realizes the ultimate\ntruth, the Madhyamaka school of philosophy advocates a fourfold\nprocess of analyzing the conventional truth that is commonly referred\nto as a tetralemma (catuṣkoṭi, mtha’\nbzhi). While this fourfold analysis is not unique to Buddhism, its\nuse as a tool in Buddhist philosophical traditions can be traced to\nNāgārjuna’s Mūlamadhyamakakārika, in\nwhich he famously remarks, “Neither from itself, nor from\nanother, nor from both, nor without a cause, does anything, anywhere,\never, arise” (MMK I:1). This fourfold rejection of one extreme,\nits opposite, both, and neither, is adopted and expanded upon by later\nMādhyamikas, and is frequently used as a tool in order to\ndemonstrate the Madhyamaka view.\n\nNāgārjuna’s commentator Āryadeva applies this\nfourfold negation to an analysis of existence in his\nJñānasārasamuccaya, writing, “There is\nno existence, there is no nonexistence, there is no existence and\nnonexistence, nor is there the absence of both.” Gorampa\nfrequently cites this passage in order to illustrate the Madhyamaka\nview as that which is free from conceptual constructs. He contends\nthat a proper understanding and application of this passage allows a\npractitioner to successfully transition from the state of an ordinary\nperson who sees conventional truth, to an awakened buddha who directly\nand nonconceptually realizes the ultimate.\n\nMost Tibetan Buddhist philosophers agree that the tetralemma is a tool\nthat can help one to realize the ultimate, but they differ in their\nexplanations of the ways in which this tool functions. Gorampa argues\nthat one must negate each of the four extremes in succession by using\nlogic and reasoning, and then one must subsequently realize the\nnegation of all four extremes simultaneously through meditative\npractices.\n2.2.1 The Process of Refuting the Four Extremes\n\nAs Gorampa formulates the tetralemma, the process begins by analyzing\nand refuting existence. This is done by using the “Five\nMadhyamaka Reasonings” (dbu ma gtan tshigs lnga). These\nfive types of reasoning are:\n\nNeither one nor many (gcig du dral), which analyzes the\nessence (ngo bo) of things.\nDiamond splinters (rdo rje'i gzegs ma), which analyzes\ncauses.\nRefuting the arising of something existent or nonexistent (yod\nmed skye ‘gog), which analyzes effects.\nRefuting the four possibilities of arising (mu bzhi skye\n‘gog), which analyzes causes and effects together.\nDependent arising (rten ‘brel), which shows that\nphenomena cannot exist independently.\n\n\nThese points are generally agreed upon by all Mādhyamikas, and\nentire essays can be devoted to each of these five types of reasoning,\nso they will not be discussed in detail here. The basic thrust of\nthese five types of reasoning is that when we analyze the things that\nappear in the conventional truth, and try to find some kind of\nessential qualities that underpin those conventionally appearing\nthings, nothing whatsoever can be found. In other words, if one\nsearches for an ultimate truth that exists beyond conventional\nappearances, nothing whatsoever can be found.\n\nAfter one has refuted the concept that things truly exist, Gorampa\nconcedes that a person’s natural inclination might be to assume\nthat things are therefore nonexistent. He argues, however, that if one\nwere to affirm the nonexistence of things, this would amount to a view\nof nihilism, which is antithetical to the Madhyamaka position. In\norder to show that the acceptance of nonexistence is untenable,\nGorampa argues that existence and nonexistence are concepts that\ndepend upon each other, just like left and right, or big and small;\none makes no sense without the other. So, once the concept of\nexistence is eliminated completely, it makes no sense to conceive of\nnonexistence independently of that. Things cannot be nonexistent\nunless they stand in contrast to things that are existent.\n\nOnce he has shown that existence and nonexistence are each untenable,\nGorampa refutes the third possibility of the tetralemma, that things\ncan somehow simultaneously both exist and not exist. He dismisses this\npossibility quite succinctly, stating that if existence and\nnonexistence have each been refuted individually, then it makes no\nsense that they could somehow exist together.\n\nThe refutation of the fourth lemma, neither existence nor\nnonexistence, yet again depends upon the successful refutation of the\nprevious three. Gorampa argues that to conceive of something as\n“neither existent nor nonexistent” is to conceive of\nsomething that is somewhere between the two extremes of existence and\nnonexistence. He contends, however, that if one has any concept of\nanything at all – even if it is some sort of concept of\nquasi-existence – this is still a wrong view. Once the extremes\nof existence, nonexistence, and both have been completely refuted,\nthere is no viable position left. To somehow claim that things are\nneither existent nor nonexistent after having refuted the first three\npossibilities is illogical.\n\nWith the refutation of these four positions in succession, Gorampa\nshows that any possible way of conceiving of the ultimate\nreality of a thing is impossible. Gorampa stresses the importance of\nunderstanding the refutation of each of these four lemmas in\nsuccession; the logic that refutes the concept of nonexistence depends\nupon the successful refutation of the existence, the refutation of the\nthird concept (both existence and nonexistence) depends on the\nrefutation of the first two, and the refutation of the fourth (neither\nexistence nor nonexistence) depends upon the refutation of the first\nthree concepts. Existence, nonexistence, both, and neither are the\nonly possible ways of conceiving of the ultimate status of a thing, so\nonce each of these possible ways is eliminated, there is no way to\nconceive of things that remains.\n\nThe refutation of each of the four extremes of the tetralemma is a\nlogic-oriented process that helps a follower of Madhyamaka to\ncultivate a conceptual understanding of the ultimate truth that is\ntaught. But Gorampa argues that logic alone will not bring about a\nrealization of the actual ultimate truth. For this, one must also\nincorporate meditative practices. Gorampa argues that through repeated\nmeditation on the refutation of each of the four lemmas in succession,\none will eventually come to realize all four refutations\nsimultaneously. We might describe this style of meditative practice as\na kind of “turning off” of concepts. After one\nconceptually understands the negation of existence, for example, one\nmeditates on this negation and eventually stops having concepts of\nthings existing altogether. This process continues through all four\npossibilities in the tetralemma, until one no longer conceives of\nthings at all. Again, it is important to note that this is distinct\nfrom simply arresting the process of thought.\n2.2.2 The Role of Negation and the Function of the Tetralemma\n\nAccording to Gorampa, the tetralemma is a tool that is used to\ninvestigate the ultimate status of appearances. Through the logic of\nthis fourfold negation, one cultivates a conceptual understanding of\nthe ultimate that is taught, and then, through subsequent meditative\npractices, one eventually cultivates a direct, nonconceptual\nrealization of the actual ultimate truth. In short, the logical\nreasoning involved in the fourfold negation is implemented by ordinary\npersons in order to understand what the ultimate truth is like,\nbut logic alone is not sufficient to arrive at a direct realization of\nthe ultimate.\n\nAlthough tetralemmic analysis is employed by all Mādhyamika\nphilosophers, Gorampa’s interpretation of this fourfold negation\nis unique in that it amounts to a complete eradication of conceptual\nthought. Other Mādhyamikas, such as Tsongkhapa, qualify each of\nthe negations in the tetralemma in ways that eliminate only certain\nkinds of concepts. For someone like Tsongkhapa, the tetralemma is a\ntool that can be used to eliminate wrong concepts; for Gorampa,\nhowever, it is a tool that eliminates all concepts.\n\nGorampa’s particular interpretation of the tetralemma is based\non the ways that he understands negation to function within this\nfourfold analysis. For him, the negations of existence, nonexistence,\nboth, and neither are each complete and total non-affirming negations\n(med dgag); that is, each limb of the tetralemma is negated in\nits entirely, without the existence of anything else being affirmed in\nits place. The result of this process is, again, the complete\neradication of any concepts of existence, nonexistence, both, or\nneither.\n\nSome of Gorampa’s opponents – again, including Tsongkhapa\n– understand negation differently. Tsongkhapa and his supporters\nadhere to the law of double negation, and understand the negations\nwithin the tetralemma to be qualified in certain ways. As such, while\nthe negation of existence is interpreted to mean that nothing exists\nultimately, the negation of nonexistence is interpreted to mean that\nsomething does, nevertheless, exist. For Tsongkhapa, this\n“something” is the conventional truth. Because of this,\nTsongkhapa’s understanding of the tetralemma involves a complex\nsystem of logical statements, each qualified according to one of the\ntwo truths. If one accepts double negation elimination, then it makes\nno sense for both existence and nonexistence to be negated, unless\nthese negations are qualified in certain ways.\n\nGorampa, on the other hand, does not adhere to double negation in the\ncontext of the tetralemma. Instead, he understands the tetralemma as a\nsuccession of four negations that are applied to the four possible\nways of conceiving of the status of the ultimate truth. Because the\nultimate truth is nonconceptualizable, Gorampa contends that\nTsongkhapa’s understanding of the tetralemma is incomplete,\nbecause it doesn’t negate enough – literally, it\nunderpervades (khyab chung ba). While Tsongkhapa’s model\nsuccessfully refutes the extreme view of existence at the ultimate\nlevel, Gorampa argues that it does not eliminate all extreme views\nultimately and in their entirety.\n\nTsongkhapa argues that a negation of all four extremes at the ultimate\nlevel defies logic, but Gorampa contends that a transcendence of logic\nis specifically the tetralemma’s purpose. By negating all\npossibilities for logical, conceptual thought, the only recourse is to\nabandon concepts completely. True freedom from conceptual\nproliferations lies outside of the scope of conceptual thought, and is\ntherefore inexpressible. Gorampa maintains, however, that because\nordinary persons utilize conceptual thought, they necessarily construe\nthe ultimate truth as an object of conceptual constructs (that is,\nthey construe it as the ultimate that is taught). As such, one must\nfirst use conceptual reasoning to refute each of the four extremes,\nbut these concepts must eventually be abandoned.\n\nIn other words, because all four extremes are negated under the\nanalysis of the tetralemma, Gorampa concludes that a correct\nrealization of the ultimate truth must be something that is other than\nthese conceptualizations of and dichotomizations into existence and\nnonexistence. As such, the ultimate truth cannot be described using\nthese terms. And, since these are the only possible ways of speaking\nof or conceptualizing the status of the existence of things, once they\nare all negated, one is forced to conclude that the ultimate truth\ncannot be described linguistically or conceptually. The ultimate truth\nthat is realized transcends the boundaries of language and conceptual\nthought. However, Gorampa still maintains that logic and analysis are\nessential in arriving at a state of nonconceptuality.\n",
    "section_title": "2.2 Negation",
    "entry_title": "Gorampa [go rams pa]",
    "hierarchy_title": "Gorampa [go rams pa] || Gorampa’s Madhyamaka || Negation",
    "tokenized_text": [
        "gorampa",
        "madhyamaka",
        "negation",
        "negation",
        "order",
        "cultivate",
        "awakened",
        "mind",
        "realizes",
        "ultimate",
        "truth",
        "madhyamaka",
        "school",
        "philosophy",
        "advocate",
        "fourfold",
        "process",
        "analyzing",
        "conventional",
        "truth",
        "commonly",
        "referred",
        "tetralemma",
        "catuṣkoṭi",
        "mtha",
        "bzhi",
        "fourfold",
        "analysis",
        "unique",
        "buddhism",
        "use",
        "tool",
        "buddhist",
        "philosophical",
        "tradition",
        "traced",
        "nāgārjuna",
        "mūlamadhyamakakārika",
        "famously",
        "remark",
        "neither",
        "another",
        "without",
        "cause",
        "anything",
        "anywhere",
        "ever",
        "arise",
        "mmk",
        "i",
        "fourfold",
        "rejection",
        "one",
        "extreme",
        "opposite",
        "neither",
        "adopted",
        "expanded",
        "upon",
        "later",
        "mādhyamikas",
        "frequently",
        "used",
        "tool",
        "order",
        "demonstrate",
        "madhyamaka",
        "view",
        "nāgārjuna",
        "commentator",
        "āryadeva",
        "applies",
        "fourfold",
        "negation",
        "analysis",
        "existence",
        "jñānasārasamuccaya",
        "writing",
        "existence",
        "nonexistence",
        "existence",
        "nonexistence",
        "absence",
        "both",
        "gorampa",
        "frequently",
        "cite",
        "passage",
        "order",
        "illustrate",
        "madhyamaka",
        "view",
        "free",
        "conceptual",
        "construct",
        "contends",
        "proper",
        "understanding",
        "application",
        "passage",
        "allows",
        "practitioner",
        "successfully",
        "transition",
        "state",
        "ordinary",
        "person",
        "see",
        "conventional",
        "truth",
        "awakened",
        "buddha",
        "directly",
        "nonconceptually",
        "realizes",
        "ultimate",
        "tibetan",
        "buddhist",
        "philosopher",
        "agree",
        "tetralemma",
        "tool",
        "help",
        "one",
        "realize",
        "ultimate",
        "differ",
        "explanation",
        "way",
        "tool",
        "function",
        "gorampa",
        "argues",
        "one",
        "must",
        "negate",
        "four",
        "extreme",
        "succession",
        "using",
        "logic",
        "reasoning",
        "one",
        "must",
        "subsequently",
        "realize",
        "negation",
        "four",
        "extreme",
        "simultaneously",
        "meditative",
        "practice",
        "process",
        "refuting",
        "four",
        "extreme",
        "gorampa",
        "formulates",
        "tetralemma",
        "process",
        "begin",
        "analyzing",
        "refuting",
        "existence",
        "done",
        "using",
        "five",
        "madhyamaka",
        "reasoning",
        "dbu",
        "gtan",
        "tshigs",
        "lnga",
        "five",
        "type",
        "reasoning",
        "neither",
        "one",
        "many",
        "gcig",
        "du",
        "dral",
        "analyzes",
        "essence",
        "ngo",
        "bo",
        "thing",
        "diamond",
        "splinter",
        "rdo",
        "rje",
        "gzegs",
        "analyzes",
        "cause",
        "refuting",
        "arising",
        "something",
        "existent",
        "nonexistent",
        "yod",
        "med",
        "skye",
        "gog",
        "analyzes",
        "effect",
        "refuting",
        "four",
        "possibility",
        "arising",
        "mu",
        "bzhi",
        "skye",
        "gog",
        "analyzes",
        "cause",
        "effect",
        "together",
        "dependent",
        "arising",
        "rten",
        "brel",
        "show",
        "phenomenon",
        "exist",
        "independently",
        "point",
        "generally",
        "agreed",
        "upon",
        "mādhyamikas",
        "entire",
        "essay",
        "devoted",
        "five",
        "type",
        "reasoning",
        "discussed",
        "detail",
        "basic",
        "thrust",
        "five",
        "type",
        "reasoning",
        "analyze",
        "thing",
        "appear",
        "conventional",
        "truth",
        "try",
        "find",
        "kind",
        "essential",
        "quality",
        "underpin",
        "conventionally",
        "appearing",
        "thing",
        "nothing",
        "whatsoever",
        "found",
        "word",
        "one",
        "search",
        "ultimate",
        "truth",
        "exists",
        "beyond",
        "conventional",
        "appearance",
        "nothing",
        "whatsoever",
        "found",
        "one",
        "refuted",
        "concept",
        "thing",
        "truly",
        "exist",
        "gorampa",
        "concedes",
        "person",
        "natural",
        "inclination",
        "might",
        "assume",
        "thing",
        "therefore",
        "nonexistent",
        "argues",
        "however",
        "one",
        "affirm",
        "nonexistence",
        "thing",
        "would",
        "amount",
        "view",
        "nihilism",
        "antithetical",
        "madhyamaka",
        "position",
        "order",
        "show",
        "acceptance",
        "nonexistence",
        "untenable",
        "gorampa",
        "argues",
        "existence",
        "nonexistence",
        "concept",
        "depend",
        "upon",
        "like",
        "left",
        "right",
        "big",
        "small",
        "one",
        "make",
        "sense",
        "without",
        "concept",
        "existence",
        "eliminated",
        "completely",
        "make",
        "sense",
        "conceive",
        "nonexistence",
        "independently",
        "thing",
        "nonexistent",
        "unless",
        "stand",
        "contrast",
        "thing",
        "existent",
        "shown",
        "existence",
        "nonexistence",
        "untenable",
        "gorampa",
        "refutes",
        "third",
        "possibility",
        "tetralemma",
        "thing",
        "somehow",
        "simultaneously",
        "exist",
        "exist",
        "dismisses",
        "possibility",
        "quite",
        "succinctly",
        "stating",
        "existence",
        "nonexistence",
        "refuted",
        "individually",
        "make",
        "sense",
        "could",
        "somehow",
        "exist",
        "together",
        "refutation",
        "fourth",
        "lemma",
        "neither",
        "existence",
        "nonexistence",
        "yet",
        "depends",
        "upon",
        "successful",
        "refutation",
        "previous",
        "three",
        "gorampa",
        "argues",
        "conceive",
        "something",
        "neither",
        "existent",
        "nonexistent",
        "conceive",
        "something",
        "somewhere",
        "two",
        "extreme",
        "existence",
        "nonexistence",
        "contends",
        "however",
        "one",
        "concept",
        "anything",
        "even",
        "sort",
        "concept",
        "quasiexistence",
        "still",
        "wrong",
        "view",
        "extreme",
        "existence",
        "nonexistence",
        "completely",
        "refuted",
        "viable",
        "position",
        "left",
        "somehow",
        "claim",
        "thing",
        "neither",
        "existent",
        "nonexistent",
        "refuted",
        "first",
        "three",
        "possibility",
        "illogical",
        "refutation",
        "four",
        "position",
        "succession",
        "gorampa",
        "show",
        "possible",
        "way",
        "conceiving",
        "ultimate",
        "reality",
        "thing",
        "impossible",
        "gorampa",
        "stress",
        "importance",
        "understanding",
        "refutation",
        "four",
        "lemma",
        "succession",
        "logic",
        "refutes",
        "concept",
        "nonexistence",
        "depends",
        "upon",
        "successful",
        "refutation",
        "existence",
        "refutation",
        "third",
        "concept",
        "existence",
        "nonexistence",
        "depends",
        "refutation",
        "first",
        "two",
        "refutation",
        "fourth",
        "neither",
        "existence",
        "nonexistence",
        "depends",
        "upon",
        "refutation",
        "first",
        "three",
        "concept",
        "existence",
        "nonexistence",
        "neither",
        "possible",
        "way",
        "conceiving",
        "ultimate",
        "status",
        "thing",
        "possible",
        "way",
        "eliminated",
        "way",
        "conceive",
        "thing",
        "remains",
        "refutation",
        "four",
        "extreme",
        "tetralemma",
        "logicoriented",
        "process",
        "help",
        "follower",
        "madhyamaka",
        "cultivate",
        "conceptual",
        "understanding",
        "ultimate",
        "truth",
        "taught",
        "gorampa",
        "argues",
        "logic",
        "alone",
        "bring",
        "realization",
        "actual",
        "ultimate",
        "truth",
        "one",
        "must",
        "also",
        "incorporate",
        "meditative",
        "practice",
        "gorampa",
        "argues",
        "repeated",
        "meditation",
        "refutation",
        "four",
        "lemma",
        "succession",
        "one",
        "eventually",
        "come",
        "realize",
        "four",
        "refutation",
        "simultaneously",
        "might",
        "describe",
        "style",
        "meditative",
        "practice",
        "kind",
        "turning",
        "concept",
        "one",
        "conceptually",
        "understands",
        "negation",
        "existence",
        "example",
        "one",
        "meditates",
        "negation",
        "eventually",
        "stop",
        "concept",
        "thing",
        "existing",
        "altogether",
        "process",
        "continues",
        "four",
        "possibility",
        "tetralemma",
        "one",
        "longer",
        "conceives",
        "thing",
        "important",
        "note",
        "distinct",
        "simply",
        "arresting",
        "process",
        "thought",
        "role",
        "negation",
        "function",
        "tetralemma",
        "according",
        "gorampa",
        "tetralemma",
        "tool",
        "used",
        "investigate",
        "ultimate",
        "status",
        "appearance",
        "logic",
        "fourfold",
        "negation",
        "one",
        "cultivates",
        "conceptual",
        "understanding",
        "ultimate",
        "taught",
        "subsequent",
        "meditative",
        "practice",
        "one",
        "eventually",
        "cultivates",
        "direct",
        "nonconceptual",
        "realization",
        "actual",
        "ultimate",
        "truth",
        "short",
        "logical",
        "reasoning",
        "involved",
        "fourfold",
        "negation",
        "implemented",
        "ordinary",
        "person",
        "order",
        "understand",
        "ultimate",
        "truth",
        "like",
        "logic",
        "alone",
        "sufficient",
        "arrive",
        "direct",
        "realization",
        "ultimate",
        "although",
        "tetralemmic",
        "analysis",
        "employed",
        "mādhyamika",
        "philosopher",
        "gorampa",
        "interpretation",
        "fourfold",
        "negation",
        "unique",
        "amount",
        "complete",
        "eradication",
        "conceptual",
        "thought",
        "mādhyamikas",
        "tsongkhapa",
        "qualify",
        "negation",
        "tetralemma",
        "way",
        "eliminate",
        "certain",
        "kind",
        "concept",
        "someone",
        "like",
        "tsongkhapa",
        "tetralemma",
        "tool",
        "used",
        "eliminate",
        "wrong",
        "concept",
        "gorampa",
        "however",
        "tool",
        "eliminates",
        "concept",
        "gorampa",
        "particular",
        "interpretation",
        "tetralemma",
        "based",
        "way",
        "understands",
        "negation",
        "function",
        "within",
        "fourfold",
        "analysis",
        "negation",
        "existence",
        "nonexistence",
        "neither",
        "complete",
        "total",
        "nonaffirming",
        "negation",
        "med",
        "dgag",
        "limb",
        "tetralemma",
        "negated",
        "entirely",
        "without",
        "existence",
        "anything",
        "else",
        "affirmed",
        "place",
        "result",
        "process",
        "complete",
        "eradication",
        "concept",
        "existence",
        "nonexistence",
        "neither",
        "gorampa",
        "opponent",
        "including",
        "tsongkhapa",
        "understand",
        "negation",
        "differently",
        "tsongkhapa",
        "supporter",
        "adhere",
        "law",
        "double",
        "negation",
        "understand",
        "negation",
        "within",
        "tetralemma",
        "qualified",
        "certain",
        "way",
        "negation",
        "existence",
        "interpreted",
        "mean",
        "nothing",
        "exists",
        "ultimately",
        "negation",
        "nonexistence",
        "interpreted",
        "mean",
        "something",
        "nevertheless",
        "exist",
        "tsongkhapa",
        "something",
        "conventional",
        "truth",
        "tsongkhapa",
        "understanding",
        "tetralemma",
        "involves",
        "complex",
        "system",
        "logical",
        "statement",
        "qualified",
        "according",
        "one",
        "two",
        "truth",
        "one",
        "accepts",
        "double",
        "negation",
        "elimination",
        "make",
        "sense",
        "existence",
        "nonexistence",
        "negated",
        "unless",
        "negation",
        "qualified",
        "certain",
        "way",
        "gorampa",
        "hand",
        "adhere",
        "double",
        "negation",
        "context",
        "tetralemma",
        "instead",
        "understands",
        "tetralemma",
        "succession",
        "four",
        "negation",
        "applied",
        "four",
        "possible",
        "way",
        "conceiving",
        "status",
        "ultimate",
        "truth",
        "ultimate",
        "truth",
        "nonconceptualizable",
        "gorampa",
        "contends",
        "tsongkhapa",
        "understanding",
        "tetralemma",
        "incomplete",
        "negate",
        "enough",
        "literally",
        "underpervades",
        "khyab",
        "chung",
        "ba",
        "tsongkhapa",
        "model",
        "successfully",
        "refutes",
        "extreme",
        "view",
        "existence",
        "ultimate",
        "level",
        "gorampa",
        "argues",
        "eliminate",
        "extreme",
        "view",
        "ultimately",
        "entirety",
        "tsongkhapa",
        "argues",
        "negation",
        "four",
        "extreme",
        "ultimate",
        "level",
        "defies",
        "logic",
        "gorampa",
        "contends",
        "transcendence",
        "logic",
        "specifically",
        "tetralemma",
        "purpose",
        "negating",
        "possibility",
        "logical",
        "conceptual",
        "thought",
        "recourse",
        "abandon",
        "concept",
        "completely",
        "true",
        "freedom",
        "conceptual",
        "proliferation",
        "lie",
        "outside",
        "scope",
        "conceptual",
        "thought",
        "therefore",
        "inexpressible",
        "gorampa",
        "maintains",
        "however",
        "ordinary",
        "person",
        "utilize",
        "conceptual",
        "thought",
        "necessarily",
        "construe",
        "ultimate",
        "truth",
        "object",
        "conceptual",
        "construct",
        "construe",
        "ultimate",
        "taught",
        "one",
        "must",
        "first",
        "use",
        "conceptual",
        "reasoning",
        "refute",
        "four",
        "extreme",
        "concept",
        "must",
        "eventually",
        "abandoned",
        "word",
        "four",
        "extreme",
        "negated",
        "analysis",
        "tetralemma",
        "gorampa",
        "concludes",
        "correct",
        "realization",
        "ultimate",
        "truth",
        "must",
        "something",
        "conceptualization",
        "dichotomization",
        "existence",
        "nonexistence",
        "ultimate",
        "truth",
        "described",
        "using",
        "term",
        "since",
        "possible",
        "way",
        "speaking",
        "conceptualizing",
        "status",
        "existence",
        "thing",
        "negated",
        "one",
        "forced",
        "conclude",
        "ultimate",
        "truth",
        "described",
        "linguistically",
        "conceptually",
        "ultimate",
        "truth",
        "realized",
        "transcends",
        "boundary",
        "language",
        "conceptual",
        "thought",
        "however",
        "gorampa",
        "still",
        "maintains",
        "logic",
        "analysis",
        "essential",
        "arriving",
        "state",
        "nonconceptuality"
    ]
}