{
    "main_text": "Reasoning\n5. Reasoning\n\nIn Aspects of Reason, Grice begins by considering the\nsuggestion that reasoning consists in “the entertainment (and\noften acceptance) in thought or in speech of a set of initial ideas\n(propositions), together with a sequence of ideas each of which is\nderivable by an acceptable principle of inference from its\npredecessors in the set” (2001, 5). He shows that it is scarcely\nplausible to suppose that reasoning always involves the entertainment\nor acceptance of a sequence of ideas—the steps in the\nreasoning—each of which is derivable (or taken by the reasoner\nto be derivable) from its predecessors.\n\nHe points out that reasoning is often, indeed typically, enthymematic\nin the following way. Jill reasons: “Jack broke his crown, but\nhe is an Englishman; therefore, he will be brave.” She does not\nemploy any suppressed premise. She merely thinks: ‘but\nhe is an Englishman; therefore, he will be brave’. The thought\noccurs to her in a way that carries conviction with it, and she thinks\nit intending the inference signaled by\n‘therefore’ to be valid. Grice suggests that it is a\nnecessary condition of reasoning from \\(A\\) to \\(B\\) that one\nintend that there be a formally valid (and non-trivial)\nargument from \\(A\\) to \\(B\\). Grice devotes a good deal of attention\nto the question of what to add to this necessary condition in order to\nobtain a sufficient condition. He emphasizes that we typically reason\nwith the intention of producing reasons relevant to some end, and he\nsees this intentional activity as involving the exercise of the\nability to make reason-preserving transitions between sets of thoughts\nor beliefs (or intentions or whatever). A transition is\nreason-preserving if and only if necessarily, if one has reasons for\nthe initial set, then one also does for the subsequent set. Like any\nability, the ability to make reason-preserving transitions may be\nimpaired. Good reasoning consists in an unimpaired exercise of the\nability to make reason-preserving transitions; reasoning--good or\nbad--is an exercise that is not too impaired. As Grice says,\n“[T]o explain what reasoning is (and maybe what the term\n‘reasoning’ means), it is necessary in the first instance\nto specify what good reasoning is, and then to stipulate that\n‘reasoning’ applies to good reasoning and also to\nsequences which approximate, to a given degree, to good reasoning; the\nidea of good reasoning is, in a certain sense, prior to the idea of\nreasoning.” \n\nThere is an important corollary: when we articulate our reasoning\nexplicitly, we are typically not making previously suppressed premises\nexplicit; rather, we are constructing the steps as we supply them.\nSuppose, for example, we were to ask Jill, “Why do you think\nthat follows?” She could answer by saying she thinks that all\nthe English are brave; or that the English are brave when they break\ntheir crowns; or that people of Jack’s age and description are\nbrave provided that they are also English; and so on. In proposing one\nof these alternatives, Jill is not reporting her suppressed\npremise; she is advancing a premise she is willing to put forward now\nas what she would—or, perhaps, should—have thought or said\nthen if the question of formal validity had been raised.\n\nReturning to meaning, why not view utterers and their audiences as\nsimilar to Jill? You say “Jack brandished his clarinet like a\ntomahawk,” and in response I straightaway believe that he did\nbrandish his clarinet in that way. Like Jill, I do not\nentertain—even in a suppressed way—any intervening\npremises. My comprehension is immediate and automatic—unmediated\nby any reasoning at all. But this does not mean that we cannot see me\nas intending there to be a formally valid inference from your words to\nmy belief. Moreover, like Jill, I could construct the missing steps.\nThus: “The utterer has the resultant procedure of uttering\n”He brandished his clarinet like a tomahawk“ intending (1)\nthat the audience believe that the utter believes he brandished his\nclarinet like a tomahawk; (2) that the audience recognize that\nintention (1); and (3) that this recognition be part of the\naudience’s reason for believing that the utterer believes that\nhe brandished his clarinet like a tomahawk. The utterer is following\nthat procedure in a non-deceptive way; hence I should believe, not\nonly that the utterer believes that he brandished his clarinet like a\ntomahawk; but also, to the extent that I have confidence in the\nutterer, I should believe that myself.”\n\nSimilar remarks hold for you as the utterer of “Jack brandished\nhis clarinet like a tomahawk.” You reason: “I recognize\nhim as an English speaker; hence he knows I have the procedure of\nuttering ”Jack brandished his clarinet like a tomahawk“\nintending: (1) that my audience believe he brandished his clarinet\nlike a tomahawk; (2) that the audience recognize that intention (1);\nand (3) that this recognition be part of the audience’s reason\nfor believing that I believe that he brandished his clarinet like a\ntomahawk. He will believe that I am following that procedure here in a\nnon-deceptive way; hence he will believe that I believe that he\nbrandished his clarinet like a tomahawk; and, to the extent that he\nhas confidence in me, he will believe that too.”\n\nThere is no denying that we can describe utterers and audiences in\nthis way. But should we really embrace this description as an\nexplanation of meaning? To see the worry, imagine we are demigods. For\nour amusement, we create a race of creatures. We program language use\ninto their brains. We ensure, for example, that, when an utterer\nproduces the sounds “She brandished her clarinet like a\ntomahawk,” audiences believe that she did. To handle deceptive\ncontexts, figurative language use, language instruction situations,\ntelling jokes, and so on, we also build in heuristics that more or\nless reliably produce a different appropriate belief in such\nsituations. When a creature utters a sentence and the audience forms\nthe appropriate belief, the explanation is our programming,\nprogramming that operates entirely at a physiological level that is\nentirely inaccessible to consciousness. So, even if an audience\nreasons to a belief based on a recognition of relevant utterer’s\nintentions, surely that reasoning is an epiphenomenon of limited\nexplanatory interest. The worry is that we may be like the creatures\nwe have imagined. There is extensive physiological and psychological\nevidence that our use of natural language is to be explained along the\nlines similar to the explanation in the case of our creatures.\n\nGrice’s ‘Meaning Revisited’ contains an answer to\nthis worry. The key idea is that the account of utterers meaning\nspecifies an optimal state that actual utterers rarely if\never realize. We explain this idea then return to our worry. Grice\nsays that,\n\nThe general idea that I want to explore, and which seems to me to have\nsome plausibility, is that something has been left out, by me and\nperhaps by others too, in the analyses, definitions, expansions and so\non, of semantic notions, and particularly various notions of meaning.\nWhat has been left out … [is] the notion of value.\n\n\nThough I think that in general we want to keep value notions out of\nour philosophical and scientific enquiries—and some would say\nout of everything else—we might consider what would happen if we\nrelaxed this prohibition to some extent. If we did, there is a whole\nrange of different kinds of value predicates or expressions which\nmight be admitted in different types of case. To avoid having to\nchoose between them, I am just going to use as a predicate the word\n‘optimal’ the meaning of which could of course be more\nprecisely characterized later (1982, 237).\n\n\nThe analysis of utterers’ meaning illustrates what Grice has in\nmind. He suggests that, “[a]s a first approximation, what we\nmean by saying that a speaker, by something he says, on a particular\noccasion, means that \\(p\\), is that he is in the optimal state with\nrespect to communicating, or if you like, to communicating that\n\\(p\\)” (1982, 242). The optimal state is what the analysis of\nutterers’ meaning specifies.\n\nThe point is that there is no need to insist that real utterers\ntypically have all the intentions the analysis requires. We\nnonetheless, for purposes of psychological explanation, often regard\nthem to have the requisite intentions. For Grice, audiences do so when\nthey need to justify the actions and beliefs that result from\nutterances in their presence. For example, as a result of reading the\nlast sentence, you believe that we believe that audiences regard\nutterers as having the intentions specified in the account of\nutterers’ meaning when audiences are called upon to justify the\nbeliefs and actions they form in response to utterances. Why are you\njustified in believing this? Because you recognized that we uttered\nthe sentence intending, by means of recognition of that very\nintention, to produce that belief. Similar remarks hold for us as\nutterers. Why are we justified in thinking that you will form a\njustified belief in response to our utterance? Because we\nknow that you can supply the justification in terms of your knowledge\nof our intentions.\n\nThis pattern of justifications also yields an explanation. The\njustifications explain by showing that meaning and response are\ninstances of people’s capacity to act rationally. Such instances\ninclude actions one engaged in without prior reasoning, and which one\nwould have also engaged in if one had reasoned about whether to do so\nprior to acting. The appeal to such counterfactuals is explanatory to\nthe extent that speakers and audiences meet this condition: for a wide\nrange of cases of speaker meaning, speakers reliably make utterances\nand audiences reliably respond without reasoning in (more or less)\nways they would have if they had reasoned with sufficient time,\ninsight, and attention. Thus, the Gricean theory of meaning does\nexplain meaning as a rational activity. Grice’s treatment of\nconversational implicature also illustrates the breadth and power of\nthis approach. Our demi-god example ignored this connection between\nexplanation and justification.\n\nA further objection to Grice’s account of meaning is that young\nchildren understand the meaning of utterances but are not capable of\nprocessing the complexities apparently required by Gricean theory.\nThompson (2007, 2008) provides one approach to defend a (neo)Gricean\naccount against these arguments.\n\nGrice’s treatment of conversational implicature illustrates the\nbreadth and power of this approach. Indeed, one of the motivations\nGrice had in giving an account of meaning was to distinguish between\nwhat is meant—M-intended—and what is not\nM-intended but implied. Grice’s conversational maxims\nare principles of rational communication that audiences use to\nconstruct an inferential bridge from what is meant to what is\nimplied.\n\nThe continuing lively debates (e.g., Petrus 2010) about conversational\nimplicatures and meaning, which are present in linguistics and\nartificial intelligence as well as philosophy, are testimony to the\ncontinuing importance of Grice’s seminal ideas.\n",
    "section_title": "5. Reasoning",
    "entry_title": "Paul Grice",
    "hierarchy_title": "Paul Grice || Reasoning",
    "tokenized_text": [
        "reasoning",
        "reasoning",
        "aspect",
        "reason",
        "grice",
        "begin",
        "considering",
        "suggestion",
        "reasoning",
        "consists",
        "entertainment",
        "often",
        "acceptance",
        "thought",
        "speech",
        "set",
        "initial",
        "idea",
        "proposition",
        "together",
        "sequence",
        "idea",
        "derivable",
        "acceptable",
        "principle",
        "inference",
        "predecessor",
        "set",
        "show",
        "scarcely",
        "plausible",
        "suppose",
        "reasoning",
        "always",
        "involves",
        "entertainment",
        "acceptance",
        "sequence",
        "ideasthe",
        "step",
        "reasoningeach",
        "derivable",
        "taken",
        "reasoner",
        "derivable",
        "predecessor",
        "point",
        "reasoning",
        "often",
        "indeed",
        "typically",
        "enthymematic",
        "following",
        "way",
        "jill",
        "reason",
        "jack",
        "broke",
        "crown",
        "englishman",
        "therefore",
        "brave",
        "employ",
        "suppressed",
        "premise",
        "merely",
        "think",
        "englishman",
        "therefore",
        "brave",
        "thought",
        "occurs",
        "way",
        "carry",
        "conviction",
        "think",
        "intending",
        "inference",
        "signaled",
        "therefore",
        "valid",
        "grice",
        "suggests",
        "necessary",
        "condition",
        "reasoning",
        "a",
        "b",
        "one",
        "intend",
        "formally",
        "valid",
        "nontrivial",
        "argument",
        "a",
        "b",
        "grice",
        "devotes",
        "good",
        "deal",
        "attention",
        "question",
        "add",
        "necessary",
        "condition",
        "order",
        "obtain",
        "sufficient",
        "condition",
        "emphasizes",
        "typically",
        "reason",
        "intention",
        "producing",
        "reason",
        "relevant",
        "end",
        "see",
        "intentional",
        "activity",
        "involving",
        "exercise",
        "ability",
        "make",
        "reasonpreserving",
        "transition",
        "set",
        "thought",
        "belief",
        "intention",
        "whatever",
        "transition",
        "reasonpreserving",
        "necessarily",
        "one",
        "reason",
        "initial",
        "set",
        "one",
        "also",
        "subsequent",
        "set",
        "like",
        "ability",
        "ability",
        "make",
        "reasonpreserving",
        "transition",
        "may",
        "impaired",
        "good",
        "reasoning",
        "consists",
        "unimpaired",
        "exercise",
        "ability",
        "make",
        "reasonpreserving",
        "transition",
        "reasoning",
        "good",
        "bad",
        "exercise",
        "impaired",
        "grice",
        "say",
        "explain",
        "reasoning",
        "maybe",
        "term",
        "reasoning",
        "mean",
        "necessary",
        "first",
        "instance",
        "specify",
        "good",
        "reasoning",
        "stipulate",
        "reasoning",
        "applies",
        "good",
        "reasoning",
        "also",
        "sequence",
        "approximate",
        "given",
        "degree",
        "good",
        "reasoning",
        "idea",
        "good",
        "reasoning",
        "certain",
        "sense",
        "prior",
        "idea",
        "reasoning",
        "important",
        "corollary",
        "articulate",
        "reasoning",
        "explicitly",
        "typically",
        "making",
        "previously",
        "suppressed",
        "premise",
        "explicit",
        "rather",
        "constructing",
        "step",
        "supply",
        "suppose",
        "example",
        "ask",
        "jill",
        "think",
        "follows",
        "could",
        "answer",
        "saying",
        "think",
        "english",
        "brave",
        "english",
        "brave",
        "break",
        "crown",
        "people",
        "jack",
        "age",
        "description",
        "brave",
        "provided",
        "also",
        "english",
        "proposing",
        "one",
        "alternative",
        "jill",
        "reporting",
        "suppressed",
        "premise",
        "advancing",
        "premise",
        "willing",
        "put",
        "forward",
        "wouldor",
        "perhaps",
        "shouldhave",
        "thought",
        "said",
        "question",
        "formal",
        "validity",
        "raised",
        "returning",
        "meaning",
        "view",
        "utterer",
        "audience",
        "similar",
        "jill",
        "say",
        "jack",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "response",
        "straightaway",
        "believe",
        "brandish",
        "clarinet",
        "way",
        "like",
        "jill",
        "entertaineven",
        "suppressed",
        "wayany",
        "intervening",
        "premise",
        "comprehension",
        "immediate",
        "automaticunmediated",
        "reasoning",
        "mean",
        "see",
        "intending",
        "formally",
        "valid",
        "inference",
        "word",
        "belief",
        "moreover",
        "like",
        "jill",
        "could",
        "construct",
        "missing",
        "step",
        "thus",
        "utterer",
        "resultant",
        "procedure",
        "uttering",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "intending",
        "audience",
        "believe",
        "utter",
        "belief",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "audience",
        "recognize",
        "intention",
        "recognition",
        "part",
        "audience",
        "reason",
        "believing",
        "utterer",
        "belief",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "utterer",
        "following",
        "procedure",
        "nondeceptive",
        "way",
        "hence",
        "believe",
        "utterer",
        "belief",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "also",
        "extent",
        "confidence",
        "utterer",
        "believe",
        "myself",
        "similar",
        "remark",
        "hold",
        "utterer",
        "jack",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "reason",
        "recognize",
        "english",
        "speaker",
        "hence",
        "know",
        "procedure",
        "uttering",
        "jack",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "intending",
        "audience",
        "believe",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "audience",
        "recognize",
        "intention",
        "recognition",
        "part",
        "audience",
        "reason",
        "believing",
        "believe",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "believe",
        "following",
        "procedure",
        "nondeceptive",
        "way",
        "hence",
        "believe",
        "believe",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "extent",
        "confidence",
        "believe",
        "too",
        "denying",
        "describe",
        "utterer",
        "audience",
        "way",
        "really",
        "embrace",
        "description",
        "explanation",
        "meaning",
        "see",
        "worry",
        "imagine",
        "demigod",
        "amusement",
        "create",
        "race",
        "creature",
        "program",
        "language",
        "use",
        "brain",
        "ensure",
        "example",
        "utterer",
        "produce",
        "sound",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "audience",
        "believe",
        "handle",
        "deceptive",
        "context",
        "figurative",
        "language",
        "use",
        "language",
        "instruction",
        "situation",
        "telling",
        "joke",
        "also",
        "build",
        "heuristic",
        "le",
        "reliably",
        "produce",
        "different",
        "appropriate",
        "belief",
        "situation",
        "creature",
        "utters",
        "sentence",
        "audience",
        "form",
        "appropriate",
        "belief",
        "explanation",
        "programming",
        "programming",
        "operates",
        "entirely",
        "physiological",
        "level",
        "entirely",
        "inaccessible",
        "consciousness",
        "even",
        "audience",
        "reason",
        "belief",
        "based",
        "recognition",
        "relevant",
        "utterer",
        "intention",
        "surely",
        "reasoning",
        "epiphenomenon",
        "limited",
        "explanatory",
        "interest",
        "worry",
        "may",
        "like",
        "creature",
        "imagined",
        "extensive",
        "physiological",
        "psychological",
        "evidence",
        "use",
        "natural",
        "language",
        "explained",
        "along",
        "line",
        "similar",
        "explanation",
        "case",
        "creature",
        "grice",
        "meaning",
        "revisited",
        "contains",
        "answer",
        "worry",
        "key",
        "idea",
        "account",
        "utterer",
        "meaning",
        "specifies",
        "optimal",
        "state",
        "actual",
        "utterer",
        "rarely",
        "ever",
        "realize",
        "explain",
        "idea",
        "return",
        "worry",
        "grice",
        "say",
        "general",
        "idea",
        "want",
        "explore",
        "seems",
        "plausibility",
        "something",
        "left",
        "perhaps",
        "others",
        "analysis",
        "definition",
        "expansion",
        "semantic",
        "notion",
        "particularly",
        "various",
        "notion",
        "meaning",
        "left",
        "notion",
        "value",
        "though",
        "think",
        "general",
        "want",
        "keep",
        "value",
        "notion",
        "philosophical",
        "scientific",
        "enquiriesand",
        "would",
        "say",
        "everything",
        "elsewe",
        "might",
        "consider",
        "would",
        "happen",
        "relaxed",
        "prohibition",
        "extent",
        "whole",
        "range",
        "different",
        "kind",
        "value",
        "predicate",
        "expression",
        "might",
        "admitted",
        "different",
        "type",
        "case",
        "avoid",
        "choose",
        "going",
        "use",
        "predicate",
        "word",
        "optimal",
        "meaning",
        "could",
        "course",
        "precisely",
        "characterized",
        "later",
        "analysis",
        "utterer",
        "meaning",
        "illustrates",
        "grice",
        "mind",
        "suggests",
        "first",
        "approximation",
        "mean",
        "saying",
        "speaker",
        "something",
        "say",
        "particular",
        "occasion",
        "mean",
        "p",
        "optimal",
        "state",
        "respect",
        "communicating",
        "like",
        "communicating",
        "p",
        "optimal",
        "state",
        "analysis",
        "utterer",
        "meaning",
        "specifies",
        "point",
        "need",
        "insist",
        "real",
        "utterer",
        "typically",
        "intention",
        "analysis",
        "requires",
        "nonetheless",
        "purpose",
        "psychological",
        "explanation",
        "often",
        "regard",
        "requisite",
        "intention",
        "grice",
        "audience",
        "need",
        "justify",
        "action",
        "belief",
        "result",
        "utterance",
        "presence",
        "example",
        "result",
        "reading",
        "last",
        "sentence",
        "believe",
        "believe",
        "audience",
        "regard",
        "utterer",
        "intention",
        "specified",
        "account",
        "utterer",
        "meaning",
        "audience",
        "called",
        "upon",
        "justify",
        "belief",
        "action",
        "form",
        "response",
        "utterance",
        "justified",
        "believing",
        "recognized",
        "uttered",
        "sentence",
        "intending",
        "mean",
        "recognition",
        "intention",
        "produce",
        "belief",
        "similar",
        "remark",
        "hold",
        "u",
        "utterer",
        "justified",
        "thinking",
        "form",
        "justified",
        "belief",
        "response",
        "utterance",
        "know",
        "supply",
        "justification",
        "term",
        "knowledge",
        "intention",
        "pattern",
        "justification",
        "also",
        "yield",
        "explanation",
        "justification",
        "explain",
        "showing",
        "meaning",
        "response",
        "instance",
        "people",
        "capacity",
        "act",
        "rationally",
        "instance",
        "include",
        "action",
        "one",
        "engaged",
        "without",
        "prior",
        "reasoning",
        "one",
        "would",
        "also",
        "engaged",
        "one",
        "reasoned",
        "whether",
        "prior",
        "acting",
        "appeal",
        "counterfactuals",
        "explanatory",
        "extent",
        "speaker",
        "audience",
        "meet",
        "condition",
        "wide",
        "range",
        "case",
        "speaker",
        "meaning",
        "speaker",
        "reliably",
        "make",
        "utterance",
        "audience",
        "reliably",
        "respond",
        "without",
        "reasoning",
        "le",
        "way",
        "would",
        "reasoned",
        "sufficient",
        "time",
        "insight",
        "attention",
        "thus",
        "gricean",
        "theory",
        "meaning",
        "explain",
        "meaning",
        "rational",
        "activity",
        "grice",
        "treatment",
        "conversational",
        "implicature",
        "also",
        "illustrates",
        "breadth",
        "power",
        "approach",
        "demigod",
        "example",
        "ignored",
        "connection",
        "explanation",
        "justification",
        "objection",
        "grice",
        "account",
        "meaning",
        "young",
        "child",
        "understand",
        "meaning",
        "utterance",
        "capable",
        "processing",
        "complexity",
        "apparently",
        "required",
        "gricean",
        "theory",
        "thompson",
        "provides",
        "one",
        "approach",
        "defend",
        "neo",
        "gricean",
        "account",
        "argument",
        "grice",
        "treatment",
        "conversational",
        "implicature",
        "illustrates",
        "breadth",
        "power",
        "approach",
        "indeed",
        "one",
        "motivation",
        "grice",
        "giving",
        "account",
        "meaning",
        "distinguish",
        "meantmintendedand",
        "mintended",
        "implied",
        "grice",
        "conversational",
        "maxim",
        "principle",
        "rational",
        "communication",
        "audience",
        "use",
        "construct",
        "inferential",
        "bridge",
        "meant",
        "implied",
        "continuing",
        "lively",
        "debate",
        "eg",
        "petrus",
        "conversational",
        "implicatures",
        "meaning",
        "present",
        "linguistics",
        "artificial",
        "intelligence",
        "well",
        "philosophy",
        "testimony",
        "continuing",
        "importance",
        "grice",
        "seminal",
        "idea"
    ]
}