{
    "main_text": "Meaning\n4. Meaning\n\nGrice contends sentence and word meaning can be analyzed in terms of\nwhat speakers (utterers, for Grice) mean. Utterers’ meaning, in\nturn, can be analyzed without semantic remainder in terms of utterers\nhaving certain intentions. To see the idea as initially outlined in\nGrice’s 1957 article, “Meaning,” imagine you are\nstopped at night at an intersection, when the driver in an oncoming\ncar flashes her lights. You reason as follows: “Why is she doing\nthat? Oh, she must intend me to believe that my lights are not on. If\nshe has that intention, it must be that my lights are not on. So, they\nare not.” To summarize:\n\nThe driver flashes her lights intending\n\n\nthat you believe that your lights are not on;\nthat you recognize her intention (1);\nthat this recognition be part of your reason for believing that\nyour lights are not on.\n\n\n\nCall such an intention an M-intention. Grice’s idea is that an\nutterer \\(U\\) means that \\(p\\) by uttering \\(x\\) if and only if \\(U\\)\nM-intends that \\(p\\) by uttering \\(x\\). We will use\n‘M-intends’ in this way in what follows. Utterances may\ninclude, not just sounds and marks but also gesture, grunts, and\ngroans—anything that can signal an M-intention. The example\nillustrates an indicative M-intention; such intentions may also be\nimperative. In such a case, the utterer intends to get the audience to\nperform an action.\n\nIn the case of sentence meaning, Grice’s idea is to explicate it\nin terms of M-intentions. He suggests that the claim that a sentence\n\\(x\\) means that \\(p\\) “might as a first shot be equated with\nsome statement or disjunction of statements about what\n‘people’ (vague) intend (with qualifications about\n‘recognition’) to effect by \\(x\\)” (1957, 66). The\nunderlying idea is the same as in the flashing lights example. When\nyou utter, “She brandished her clarinet like a tomahawk,”\nI—as a Gricean audience—reason as follows. “The\nstandard use of that sentence is to utter it intending (1) that the\naudience believe she brandished her clarinet like a tomahawk; (2) that\nthe audience recognize the intention (1); and (3) that this\nrecognition be part of the audience’s reason for believing that\nshe brandished her clarinet like a tomahawk. This is a standard,\nnon-deceptive use; hence I should believe that she brandished her\nclarinet like a tomahawk.”\n\nGrice’s post-1957 work on meaning divides along two lines.\nFirst, he refines the analyses of utterer’s meaning and sentence\nmeaning, primarily in the 1968 article, “Utterer’s\nMeaning, Sentence Meaning, and Word Meaning,” and the 1969\narticle, “Utterer’s Meaning and Intentions.” Second,\nhe addresses the fact that utterers and audiences rarely, if ever,\nreason in the way suggested. As you read these words, for example, you\nare not reasoning in that way. You read and you understand\nstraightaway without any intervening reasoning. So how can\nGrice’s suggested explanation be anything but illusory? These\npoints will be considered in turn.\n\nIn “Utterer’s Meaning, Sentence Meaning, and Word\nMeaning,” Grice offers a revised version of his 1957 account of\nutterers meaning. Grice remarks that in\n\nthe earlier (1957) account I took the view that the M-intended effect\nis, in the case of indicatives-type utterance, that the hearer should\nbelieve something, and, in the case of imperative-type\nutterances, that the hearer should do something. I wish for\npresent purposes to make two changes here.\n\n\nI wish to represent the M-intended effect of imperative-type\nutterances as being that the hearer should intend to do\nsomething (with, of course, the ulterior intention on the part of the\nutter that the hearer go on to do the act in question).\nI wish to regard the M-intended effect common to indicative-type\nutterances as being, not that the hearer should believe something\n(though there will frequently be an ulterior intention to that\neffect), but the hearer should think that the utterer\nbelieves something.\n\n\n(1968, 230).\n\n\nBy way of illustration, suppose \\(U\\), who wants the audience \\(A\\) to\nclose the door, utters ‘Close the door.’ \\(U\\) M-intends\nthat \\(A\\) should intend to close the door, and note: we specify what\n\\(U\\) means using the subjunctive mood. \\(U\\) means that \\(A\\)\nshould close the door. For the indicative case, suppose \\(U\\)\nutters ‘The door is closed,’ M-intending that \\(A\\)\nbelieve \\(U\\) believes the door is closed. We specify what \\(U\\) means\nusing the indicative mood—thus: \\(U\\) means that the door is\nclosed.\n\nGrice captures the role of moods in specifying meaning by introducing\na special notation. He represents the indicative case this way: \\(U\\)\nmeans that \\(\\vdash\\)(the door is closed); the imperative: \\(U\\) means\nthat !(the door is closed). Here ‘the door is closed’\nrepresents a moodless, underlying syntactical element Grice calls a\nsentence radical; it designates the moodless proposition that the door\nis closed. Grice calls ‘\\(\\vdash\\)’ and ‘!’\nmood operators, and he explains them contextually as\nfollows:\n\n\\(U\\) means that \\(\\vdash(p)\\) by uttering \\(x\\) if and only if,\nfor some \\(A\\), \\(U\\) utters \\(x\\) M-intending \\(A\\) to think \\(U\\)\nthinks that \\(p\\);\n\\(U\\) means that \\(!(p)\\) by uttering x if and only, for some\n\\(A\\), if \\(U\\) utters \\(x\\) M-intending (a) \\(A\\) to think \\(U\\)\nintends (to bring it about) that \\(p\\); and (b) \\(A\\) to\nintend that \\(p\\)—having, as part of his reason\n\\(U\\)’s intention (a).\n\n\nMore than two operators are required to handle the full range of\nthings utterers mean, but a complete list is not necessary to\nformulate the revised account of meaning. The account can be stated as\nfollows. Given a function from psychological states onto mood\noperators, if \\(\\psi\\) is a psychological state and \\(*_{\\psi}\\) the\nassociated mood operator,\n\n\n\\(U\\) means that \\(*_{\\psi}(p)\\) by uttering \\(x\\) if and only if, for\nsome \\(A\\), \\(U\\) utters \\(x\\) M-intending\n\nthat \\(A\\) should think \\(U\\) to \\(\\psi\\) that \\(p\\); and (in some\ncases only), depending on \\(*_{\\psi}\\),\nthat \\(A\\) should via fulfillment of (i), himself \\(\\psi\\) that\n\\(p\\).\n\n\n\nGrice uses his revised treatment of utterer’s meaning to refine\nthe very rough and preliminary account of sentence meaning (structured\nutterance type meaning, in his terminology) he gave in\n“Meaning.” His account thereof uses the notion of\nhaving a procedure in one’s repertoire. He says,\n\nThis idea seems to me to be intuitively fairly intelligible and to\nhave application outside the realm of linguistic, or otherwise\ncommunicative, performances, though it could hardly be denied that it\nrequires further explication. A faintly eccentric lecturer might have\nin his repertoire the following procedure: if he sees an attractive\ngirl in his audience to pause for half a minute and then take a\nsedative. His having in his repertoire this procedure would not be\nincompatible with his also having two further procedures: (a) if he\nsees an attractive girl, to put on a pair of dark spectacles (instead\nof pausing to take a sedative); (b) to pause to take a sedative when\nhe sees in his audience not an attractive girl, but a particularly\ndistinguished colleague (1969, 233).\n\n\nTurning to sentence meaning, the idea is that users of a natural\nlanguage like English have standard procedures for using sentences,\nand that—very roughly—a sentence means \\(p\\) among a group\nof utterers when and only when that group has the procedure of using\nit to M-intend that \\(p\\).\n\nThis is a promising start. It is undeniable that English speakers have\nthe procedure of using ‘The door is closed’ to mean that\nthe door is closed. That is (one of the many) things we do with that\nsentence. So, assuming we accept the explication of utterer’s\nmeaning in terms of M-intentions, it undeniable that English speakers\nhave the procedure of using that sentence to M-intend with regard to\nthe proposition that the door is closed. This yields the explanatory\npayoff described earlier. We can see communication as a rational\nactivity in which an utterer intends to produce certain results and\naudiences reason their way to those results via their recognition of\nthe utterer’s intention to produce that very result.\n\nThis preliminary account must be complicated, however, as it is\nunacceptable on three grounds. First, there are infinitely many\nsentences. How does an utterer associate a procedure with each\nsentence of his language? If they must be acquired one by one, it will\ntake an infinite amount of time. Second, sentences are structured\nutterance-types, where meaning of the whole is consequent (in ways\ndetermined by syntactic structure) on the meaning of the parts. The\naccount does not capture this aspect of sentence meaning at all.\nThird, the account fails to represent the complexity introduced into\nthe account of utterer’s meaning; there is no mention of\nmoods.\n\nThese considerations lead Grice to posit that the procedures\nassociated with sentences are resultant procedures arising recursively\nout of basic procedures associated with words. Grice explains that\n\nAs a first approximation, one might say that a procedure for an\nutterance-type \\(X\\) will be a resultant procedure if it is determined\nby (its existence is inferable from) a knowledge of procedures (a) for\nparticular utterance-types which are elements in \\(X\\), and (b) for\nany sequence of utterance-types which exemplifies a particular\nordering of syntactic categories (a particular syntactic form) (SWW,\np. 136–7).\n\n\nGrice introduces a canonical form for specifying resultant procedures.\nHe does so by generalizing the special notation he has already used in\nspecifying meaning. Recall that he represented the indicative case by:\n\\(U\\) means that \\(\\vdash\\)(the door is closed);the imperative: \\(U\\)\nmeans that !(the door is closed). The indicative sentence\n‘\\(\\vdash\\)(the door is closed)’ is associated with the\npsychological state of belief: speakers can and do utter that sentence\nwith the intention that audiences respond by believing the door is\nclosed. The imperative ‘! (the door is closed)’ is\nsimilarly associated with an audience response of action: speakers can\nand do utter that sentence with intention that that audiences respond\nby closing the door. ‘\\(\\vdash\\)’ and ‘!’ are\nexamples of a type of syntactic item Grice calls a mood operator. He\nassumes that the syntactic structure of sentences divides into a mood\noperator and the rest of the structure. Grice uses\n‘\\(*+\\mathrm{R}\\)’ to represent this division. Now let\n\\(\\mathrm{P}_{*+R}\\) be the set of propositions associated with\n\\(*+\\mathrm{R}\\), and \\(\\psi\\) the psychological state or action\nassociated with \\(*\\). Then a resultant procedure for \\(*+\\mathrm{R}\\)\ntakes one of two forms. \\(U\\) has the resultant procedure of:\n\nuttering \\(*+\\mathrm{R}\\) if, for some \\(A\\), \\(U\\) wants \\(A\\) to\n\\(\\psi\\) that \\(p\\); or\nuttering \\(*+\\mathrm{R}\\) if, for some \\(A\\), \\(U\\) wants \\(A\\) to\nthink \\(U\\) to \\(\\psi\\) that \\(p\\).\n\n\nCall these type 1 and type 2 resultant procedures. As a definition of\nsentence meaning we can say that, where \\(p \\in\n\\mathrm{P}_{*+\\mathrm{R}}\\), \\(*+\\mathrm{R}\\) means \\(p\\) in a group\n\\(G\\) if and only if members of \\(G\\) have, with respect to\n\\(*+\\mathrm{R}\\), a type 1 or type 2 resultant procedure, the type\nbeing determined by the type of the mood operator \\(*_{\\psi}\\).\n(Qualifications will, of course, be necessary to handle\n‘audienceless’ cases.)\n\nSo far, perhaps, so good. There are pleasant quibbles over details,\nbut in broad outline, the account is a very plausible description of\nmeaning. In fact, at least three authors, Bennett, Loar and Schiffer,\nhave developed their own more detailed accounts along Gricean lines.\nHowever, when we turn from description to explanation, plausibility\nappears to decline. The explanatory idea is to see communication as a\nrational activity where audiences reason their way to beliefs or\nintentions via their recognition of the utterer’s intention to\nproduce such results. What about the problem that utterers and\naudiences rarely if ever engage in such reasoning? Grice’s work\non reasoning contains the answer.\n\nDoes this approach define sentence meaning in terms of speaker’s\nintentions without any semantic remainder? That depends on how one\ninterprets\n\nA procedure for an utterance-type \\(X\\) will be a resultant procedure\nif it is determined by (its existence is inferable from) a knowledge\nof the procedures (a) for particular utterance-types which are\nelements in \\(X\\), and (b) for any sequence of utterance-types which\nexemplifies a particular ordering of syntactic categories (a\nparticular syntactic form). (1968, 235)\n\n\nOne possibility is to explain at least some basic procedures in terms\nof the concept of reference, where reference is analyzed in terms of\nspeakers’ intentions. The basic procedure for\n‘tiger’ for example would be to utter ‘tiger’\nto refer to tigers. But there is another possibility: the knowledge in\n(a) and (b) includes the knowledge of the semantic properties of\nwords, and the semantic properties of combinations of word, where\nthose properties cannot be fully analyzed in terms of speakers’\nintentions. Noting that the notion of a procedure is quite unclear,\nGrice observes that \n\nWe can, if we are lucky, identify “linguistic rules,” so\ncalled, which are such that our linguistic practice is as if we\naccepted these rules and consciously followed them. But we want to say\nthat this is not just an interesting fact about our linguistic\npractice but also an explanation of it; and this leads us on to\nsuppose that “in some sense,” “implicitly,” we\ndo accept these rules.Now the proper interpretation of the idea that\nwe do accept these rules becomes something of a mystery, if the\n“acceptance” of the rules is to be distinguished from the\nexistence of the related practices]but it seems like a mystery which,\nfor the time being at least, we have to swallow, while recognizing\nthat it involves us in an as yet unsolved problem.\n\n\nThe appeal to implicitly followed linguistic rules casts a revealing\nlight on Grice as a champion of the view that communication is an\nexercise in rational coordination through acts of speaker meaning.\nSince Grice, a central question has been “[h]ow much of this\ncoordination derives from interlocutors’ specific knowledge of\none another as people? How much exploits their knowledge of language\nitself?” (Lepore and Stone 2015, 1). With the appeal to\nimplicitly followed rules, Grice has one foot squarely on\n“knowledge of language itself” side of that divide.\n",
    "section_title": "4. Meaning",
    "entry_title": "Paul Grice",
    "hierarchy_title": "Paul Grice || Meaning",
    "tokenized_text": [
        "meaning",
        "meaning",
        "grice",
        "contends",
        "sentence",
        "word",
        "meaning",
        "analyzed",
        "term",
        "speaker",
        "utterer",
        "grice",
        "mean",
        "utterer",
        "meaning",
        "turn",
        "analyzed",
        "without",
        "semantic",
        "remainder",
        "term",
        "utterer",
        "certain",
        "intention",
        "see",
        "idea",
        "initially",
        "outlined",
        "grice",
        "article",
        "meaning",
        "imagine",
        "stopped",
        "night",
        "intersection",
        "driver",
        "oncoming",
        "car",
        "flash",
        "light",
        "reason",
        "follows",
        "oh",
        "must",
        "intend",
        "believe",
        "light",
        "intention",
        "must",
        "light",
        "not",
        "summarize",
        "driver",
        "flash",
        "light",
        "intending",
        "believe",
        "light",
        "recognize",
        "intention",
        "recognition",
        "part",
        "reason",
        "believing",
        "light",
        "call",
        "intention",
        "mintention",
        "grice",
        "idea",
        "utterer",
        "u",
        "mean",
        "p",
        "uttering",
        "x",
        "u",
        "mintends",
        "p",
        "uttering",
        "x",
        "use",
        "mintends",
        "way",
        "follows",
        "utterance",
        "may",
        "include",
        "sound",
        "mark",
        "also",
        "gesture",
        "grunt",
        "groansanything",
        "signal",
        "mintention",
        "example",
        "illustrates",
        "indicative",
        "mintention",
        "intention",
        "may",
        "also",
        "imperative",
        "case",
        "utterer",
        "intends",
        "get",
        "audience",
        "perform",
        "action",
        "case",
        "sentence",
        "meaning",
        "grice",
        "idea",
        "explicate",
        "term",
        "mintentions",
        "suggests",
        "claim",
        "sentence",
        "x",
        "mean",
        "p",
        "might",
        "first",
        "shot",
        "equated",
        "statement",
        "disjunction",
        "statement",
        "people",
        "vague",
        "intend",
        "qualification",
        "recognition",
        "effect",
        "x",
        "underlying",
        "idea",
        "flashing",
        "light",
        "example",
        "utter",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "ias",
        "gricean",
        "audiencereason",
        "follows",
        "standard",
        "use",
        "sentence",
        "utter",
        "intending",
        "audience",
        "believe",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "audience",
        "recognize",
        "intention",
        "recognition",
        "part",
        "audience",
        "reason",
        "believing",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "standard",
        "nondeceptive",
        "use",
        "hence",
        "believe",
        "brandished",
        "clarinet",
        "like",
        "tomahawk",
        "grice",
        "post",
        "work",
        "meaning",
        "divide",
        "along",
        "two",
        "line",
        "first",
        "refines",
        "analysis",
        "utterer",
        "meaning",
        "sentence",
        "meaning",
        "primarily",
        "article",
        "utterer",
        "meaning",
        "sentence",
        "meaning",
        "word",
        "meaning",
        "article",
        "utterer",
        "meaning",
        "intentions",
        "second",
        "address",
        "fact",
        "utterer",
        "audience",
        "rarely",
        "ever",
        "reason",
        "way",
        "suggested",
        "read",
        "word",
        "example",
        "reasoning",
        "way",
        "read",
        "understand",
        "straightaway",
        "without",
        "intervening",
        "reasoning",
        "grice",
        "suggested",
        "explanation",
        "anything",
        "illusory",
        "point",
        "considered",
        "turn",
        "utterer",
        "meaning",
        "sentence",
        "meaning",
        "word",
        "meaning",
        "grice",
        "offer",
        "revised",
        "version",
        "account",
        "utterer",
        "meaning",
        "grice",
        "remark",
        "earlier",
        "account",
        "took",
        "view",
        "mintended",
        "effect",
        "case",
        "indicativestype",
        "utterance",
        "hearer",
        "believe",
        "something",
        "case",
        "imperativetype",
        "utterance",
        "hearer",
        "something",
        "wish",
        "present",
        "purpose",
        "make",
        "two",
        "change",
        "wish",
        "represent",
        "mintended",
        "effect",
        "imperativetype",
        "utterance",
        "hearer",
        "intend",
        "something",
        "course",
        "ulterior",
        "intention",
        "part",
        "utter",
        "hearer",
        "go",
        "act",
        "question",
        "wish",
        "regard",
        "mintended",
        "effect",
        "common",
        "indicativetype",
        "utterance",
        "hearer",
        "believe",
        "something",
        "though",
        "frequently",
        "ulterior",
        "intention",
        "effect",
        "hearer",
        "think",
        "utterer",
        "belief",
        "something",
        "way",
        "illustration",
        "suppose",
        "u",
        "want",
        "audience",
        "a",
        "close",
        "door",
        "utters",
        "close",
        "door",
        "u",
        "mintends",
        "a",
        "intend",
        "close",
        "door",
        "note",
        "specify",
        "u",
        "mean",
        "using",
        "subjunctive",
        "mood",
        "u",
        "mean",
        "a",
        "close",
        "door",
        "indicative",
        "case",
        "suppose",
        "u",
        "utters",
        "door",
        "closed",
        "mintending",
        "a",
        "believe",
        "u",
        "belief",
        "door",
        "closed",
        "specify",
        "u",
        "mean",
        "using",
        "indicative",
        "moodthus",
        "u",
        "mean",
        "door",
        "closed",
        "grice",
        "capture",
        "role",
        "mood",
        "specifying",
        "meaning",
        "introducing",
        "special",
        "notation",
        "represents",
        "indicative",
        "case",
        "way",
        "u",
        "mean",
        "vdash",
        "door",
        "closed",
        "imperative",
        "u",
        "mean",
        "door",
        "closed",
        "door",
        "closed",
        "represents",
        "moodless",
        "underlying",
        "syntactical",
        "element",
        "grice",
        "call",
        "sentence",
        "radical",
        "designates",
        "moodless",
        "proposition",
        "door",
        "closed",
        "grice",
        "call",
        "vdash",
        "mood",
        "operator",
        "explains",
        "contextually",
        "follows",
        "u",
        "mean",
        "vdash",
        "p",
        "uttering",
        "x",
        "a",
        "u",
        "utters",
        "x",
        "mintending",
        "a",
        "think",
        "u",
        "think",
        "p",
        "u",
        "mean",
        "p",
        "uttering",
        "x",
        "a",
        "u",
        "utters",
        "x",
        "mintending",
        "a",
        "think",
        "u",
        "intends",
        "bring",
        "p",
        "b",
        "a",
        "intend",
        "p",
        "having",
        "part",
        "reason",
        "u",
        "intention",
        "two",
        "operator",
        "required",
        "handle",
        "full",
        "range",
        "thing",
        "utterer",
        "mean",
        "complete",
        "list",
        "necessary",
        "formulate",
        "revised",
        "account",
        "meaning",
        "account",
        "stated",
        "follows",
        "given",
        "function",
        "psychological",
        "state",
        "onto",
        "mood",
        "operator",
        "psi",
        "psychological",
        "state",
        "_",
        "psi",
        "associated",
        "mood",
        "operator",
        "u",
        "mean",
        "_",
        "psi",
        "p",
        "uttering",
        "x",
        "a",
        "u",
        "utters",
        "x",
        "mintending",
        "a",
        "think",
        "u",
        "psi",
        "p",
        "case",
        "depending",
        "_",
        "psi",
        "a",
        "via",
        "fulfillment",
        "psi",
        "p",
        "grice",
        "us",
        "revised",
        "treatment",
        "utterer",
        "meaning",
        "refine",
        "rough",
        "preliminary",
        "account",
        "sentence",
        "meaning",
        "structured",
        "utterance",
        "type",
        "meaning",
        "terminology",
        "gave",
        "meaning",
        "account",
        "thereof",
        "us",
        "notion",
        "procedure",
        "one",
        "repertoire",
        "say",
        "idea",
        "seems",
        "intuitively",
        "fairly",
        "intelligible",
        "application",
        "outside",
        "realm",
        "linguistic",
        "otherwise",
        "communicative",
        "performance",
        "though",
        "could",
        "hardly",
        "denied",
        "requires",
        "explication",
        "faintly",
        "eccentric",
        "lecturer",
        "might",
        "repertoire",
        "following",
        "procedure",
        "see",
        "attractive",
        "girl",
        "audience",
        "pause",
        "half",
        "minute",
        "take",
        "sedative",
        "repertoire",
        "procedure",
        "would",
        "incompatible",
        "also",
        "two",
        "procedure",
        "see",
        "attractive",
        "girl",
        "put",
        "pair",
        "dark",
        "spectacle",
        "instead",
        "pausing",
        "take",
        "sedative",
        "b",
        "pause",
        "take",
        "sedative",
        "see",
        "audience",
        "attractive",
        "girl",
        "particularly",
        "distinguished",
        "colleague",
        "turning",
        "sentence",
        "meaning",
        "idea",
        "user",
        "natural",
        "language",
        "like",
        "english",
        "standard",
        "procedure",
        "using",
        "sentence",
        "thatvery",
        "roughlya",
        "sentence",
        "mean",
        "p",
        "among",
        "group",
        "utterer",
        "group",
        "procedure",
        "using",
        "mintend",
        "p",
        "promising",
        "start",
        "undeniable",
        "english",
        "speaker",
        "procedure",
        "using",
        "door",
        "closed",
        "mean",
        "door",
        "closed",
        "one",
        "many",
        "thing",
        "sentence",
        "assuming",
        "accept",
        "explication",
        "utterer",
        "meaning",
        "term",
        "mintentions",
        "undeniable",
        "english",
        "speaker",
        "procedure",
        "using",
        "sentence",
        "mintend",
        "regard",
        "proposition",
        "door",
        "closed",
        "yield",
        "explanatory",
        "payoff",
        "described",
        "earlier",
        "see",
        "communication",
        "rational",
        "activity",
        "utterer",
        "intends",
        "produce",
        "certain",
        "result",
        "audience",
        "reason",
        "way",
        "result",
        "via",
        "recognition",
        "utterer",
        "intention",
        "produce",
        "result",
        "preliminary",
        "account",
        "must",
        "complicated",
        "however",
        "unacceptable",
        "three",
        "ground",
        "first",
        "infinitely",
        "many",
        "sentence",
        "utterer",
        "associate",
        "procedure",
        "sentence",
        "language",
        "must",
        "acquired",
        "one",
        "one",
        "take",
        "infinite",
        "amount",
        "time",
        "second",
        "sentence",
        "structured",
        "utterancetypes",
        "meaning",
        "whole",
        "consequent",
        "way",
        "determined",
        "syntactic",
        "structure",
        "meaning",
        "part",
        "account",
        "capture",
        "aspect",
        "sentence",
        "meaning",
        "third",
        "account",
        "fails",
        "represent",
        "complexity",
        "introduced",
        "account",
        "utterer",
        "meaning",
        "mention",
        "mood",
        "consideration",
        "lead",
        "grice",
        "posit",
        "procedure",
        "associated",
        "sentence",
        "resultant",
        "procedure",
        "arising",
        "recursively",
        "basic",
        "procedure",
        "associated",
        "word",
        "grice",
        "explains",
        "first",
        "approximation",
        "one",
        "might",
        "say",
        "procedure",
        "utterancetype",
        "x",
        "resultant",
        "procedure",
        "determined",
        "existence",
        "inferable",
        "knowledge",
        "procedure",
        "particular",
        "utterancetypes",
        "element",
        "x",
        "b",
        "sequence",
        "utterancetypes",
        "exemplifies",
        "particular",
        "ordering",
        "syntactic",
        "category",
        "particular",
        "syntactic",
        "form",
        "sww",
        "p",
        "grice",
        "introduces",
        "canonical",
        "form",
        "specifying",
        "resultant",
        "procedure",
        "generalizing",
        "special",
        "notation",
        "already",
        "used",
        "specifying",
        "meaning",
        "recall",
        "represented",
        "indicative",
        "case",
        "u",
        "mean",
        "vdash",
        "door",
        "closed",
        "imperative",
        "u",
        "mean",
        "door",
        "closed",
        "indicative",
        "sentence",
        "vdash",
        "door",
        "closed",
        "associated",
        "psychological",
        "state",
        "belief",
        "speaker",
        "utter",
        "sentence",
        "intention",
        "audience",
        "respond",
        "believing",
        "door",
        "closed",
        "imperative",
        "door",
        "closed",
        "similarly",
        "associated",
        "audience",
        "response",
        "action",
        "speaker",
        "utter",
        "sentence",
        "intention",
        "audience",
        "respond",
        "closing",
        "door",
        "vdash",
        "example",
        "type",
        "syntactic",
        "item",
        "grice",
        "call",
        "mood",
        "operator",
        "assumes",
        "syntactic",
        "structure",
        "sentence",
        "divide",
        "mood",
        "operator",
        "rest",
        "structure",
        "grice",
        "us",
        "mathrm",
        "r",
        "represent",
        "division",
        "let",
        "mathrm",
        "p",
        "_",
        "r",
        "set",
        "proposition",
        "associated",
        "mathrm",
        "r",
        "psi",
        "psychological",
        "state",
        "action",
        "associated",
        "resultant",
        "procedure",
        "mathrm",
        "r",
        "take",
        "one",
        "two",
        "form",
        "u",
        "resultant",
        "procedure",
        "uttering",
        "mathrm",
        "r",
        "a",
        "u",
        "want",
        "a",
        "psi",
        "p",
        "uttering",
        "mathrm",
        "r",
        "a",
        "u",
        "want",
        "a",
        "think",
        "u",
        "psi",
        "p",
        "call",
        "type",
        "type",
        "resultant",
        "procedure",
        "definition",
        "sentence",
        "meaning",
        "say",
        "p",
        "in",
        "mathrm",
        "p",
        "_",
        "mathrm",
        "r",
        "mathrm",
        "r",
        "mean",
        "p",
        "group",
        "g",
        "member",
        "g",
        "respect",
        "mathrm",
        "r",
        "type",
        "type",
        "resultant",
        "procedure",
        "type",
        "determined",
        "type",
        "mood",
        "operator",
        "_",
        "psi",
        "qualification",
        "course",
        "necessary",
        "handle",
        "audienceless",
        "case",
        "far",
        "perhaps",
        "good",
        "pleasant",
        "quibble",
        "detail",
        "broad",
        "outline",
        "account",
        "plausible",
        "description",
        "meaning",
        "fact",
        "least",
        "three",
        "author",
        "bennett",
        "loar",
        "schiffer",
        "developed",
        "detailed",
        "account",
        "along",
        "gricean",
        "line",
        "however",
        "turn",
        "description",
        "explanation",
        "plausibility",
        "appears",
        "decline",
        "explanatory",
        "idea",
        "see",
        "communication",
        "rational",
        "activity",
        "audience",
        "reason",
        "way",
        "belief",
        "intention",
        "via",
        "recognition",
        "utterer",
        "intention",
        "produce",
        "result",
        "problem",
        "utterer",
        "audience",
        "rarely",
        "ever",
        "engage",
        "reasoning",
        "grice",
        "work",
        "reasoning",
        "contains",
        "answer",
        "approach",
        "define",
        "sentence",
        "meaning",
        "term",
        "speaker",
        "intention",
        "without",
        "semantic",
        "remainder",
        "depends",
        "one",
        "interprets",
        "procedure",
        "utterancetype",
        "x",
        "resultant",
        "procedure",
        "determined",
        "existence",
        "inferable",
        "knowledge",
        "procedure",
        "particular",
        "utterancetypes",
        "element",
        "x",
        "b",
        "sequence",
        "utterancetypes",
        "exemplifies",
        "particular",
        "ordering",
        "syntactic",
        "category",
        "particular",
        "syntactic",
        "form",
        "one",
        "possibility",
        "explain",
        "least",
        "basic",
        "procedure",
        "term",
        "concept",
        "reference",
        "reference",
        "analyzed",
        "term",
        "speaker",
        "intention",
        "basic",
        "procedure",
        "tiger",
        "example",
        "would",
        "utter",
        "tiger",
        "refer",
        "tiger",
        "another",
        "possibility",
        "knowledge",
        "b",
        "includes",
        "knowledge",
        "semantic",
        "property",
        "word",
        "semantic",
        "property",
        "combination",
        "word",
        "property",
        "fully",
        "analyzed",
        "term",
        "speaker",
        "intention",
        "noting",
        "notion",
        "procedure",
        "quite",
        "unclear",
        "grice",
        "observes",
        "lucky",
        "identify",
        "linguistic",
        "rule",
        "called",
        "linguistic",
        "practice",
        "accepted",
        "rule",
        "consciously",
        "followed",
        "want",
        "say",
        "interesting",
        "fact",
        "linguistic",
        "practice",
        "also",
        "explanation",
        "lead",
        "u",
        "suppose",
        "sense",
        "implicitly",
        "accept",
        "rulesnow",
        "proper",
        "interpretation",
        "idea",
        "accept",
        "rule",
        "becomes",
        "something",
        "mystery",
        "acceptance",
        "rule",
        "distinguished",
        "existence",
        "related",
        "practice",
        "seems",
        "like",
        "mystery",
        "time",
        "least",
        "swallow",
        "recognizing",
        "involves",
        "u",
        "yet",
        "unsolved",
        "problem",
        "appeal",
        "implicitly",
        "followed",
        "linguistic",
        "rule",
        "cast",
        "revealing",
        "light",
        "grice",
        "champion",
        "view",
        "communication",
        "exercise",
        "rational",
        "coordination",
        "act",
        "speaker",
        "meaning",
        "since",
        "grice",
        "central",
        "question",
        "h",
        "ow",
        "much",
        "coordination",
        "derives",
        "interlocutor",
        "specific",
        "knowledge",
        "one",
        "another",
        "people",
        "much",
        "exploit",
        "knowledge",
        "language",
        "lepore",
        "stone",
        "appeal",
        "implicitly",
        "followed",
        "rule",
        "grice",
        "one",
        "foot",
        "squarely",
        "knowledge",
        "language",
        "side",
        "divide"
    ]
}