{
    "main_text": "Free Decision and Freedom of the Will\n9. Free Decision and Freedom of the Will\nEarly thirteenth-century accounts of human action and the freedom\nit involves focus on the notion of free decision (liberum\narbitrium).  This term, a legacy of Roman law and patristic\nthinkers, has no present-day counterpart, and even to thinkers in\nGrosseteste’s day its sense was unclear and stood in need of\ndetermination.  But if the notion of free decision itself is now of\nmerely antiquarian interest, accounts of free decision are nonetheless\nimportant for the insight they provide into their authors’\nunderstanding of human action and freedom, issues of perennial\nphilosophical concern. (On Grosseteste’s theory of free decision see Lewis 2013, 2017, and Pickavé 2017.)\nThe expression “free decision” was understood to refer\nnot only, as its grammar as a concrete term suggests, to a certain\nkind of act, but also to the capacity or capacities whose exercise\nsuch an act involves. The word “decision” was standardly\ntaken to involve a reference to reason and “free” a\nreference to the will. Thus, it was often asked whether “free\ndecision” refers to an act of reason or of the will, and whether\nthe capacities that such an act involves are reason or will, either\nalone or in combination, or possibly other capacities besides\nthese.\n According to Grosseteste in On Free Decision, “free\ndecision” in its concrete usage refers to a decision, a certain\nkind of act of reason. This act, like any other act of reason, is not\nitself free, but is said to be free in a derivative sense because it\nis an act providing direction to the will, whose acts are free. (Talk\nof will and reason or their acts as free or not is common in medieval\nthinkers, but is perhaps a mere manner of speaking, when what is\nintended is that the agent’s exercise of reason or will is done freely\nor not.) Reason has the task of distinguishing between good and bad,\nbetter and worse, and of proposing to the will what it should choose\nor reject.  The will by nature chooses or rejects after receiving such\na directive from reason, but is free not to implement reason’s\ndecision and choose or reject otherwise than reason has\npronounced. This freedom is why the decision is, in a derivative\nsense, said to be a free decision.  In proposing this view,\nGrosseteste indicates that he takes the choices made by the will not\nto be psychologically determined by reason: reason provides the will\nwith advice, not necessity. \n Grosseteste takes the capacities underlying free decision to be\nreason and will, which he identifies with aspectus and\naffectus respectively. He holds, perhaps under the influence of the Pseudo-Augustinian De spiritu et anima’s teaching of the simplicity of the soul, that these\ncapacities are at root one, but this one capacity can be exercised in\none way through a decision, and in another through a choice.\n Since Grosseteste holds that a decision is said to be free because\nit provides direction to the free will, as we might expect he takes\nthe freedom of decision (libertas arbitrii) to be the freedom\nof the will itself.  But what, exactly, is the nature of this freedom?\nIt is common to think that the freedom of the will is the will’s\ncapacity to will alternatives, or considered post factum, to\nhave willed otherwise than it did. Grosseteste and his contemporaries\nspeak in this connection of a flexibilitas or \nvertibilitas of the will. The importance of Grosseteste’s account\nof the freedom of the will lies in the fact he is one of the few\nthinkers in his day to hold that the freedom of the will is indeed to\nbe defined as a capacity to will alternatives. Many of his most\nimportant contemporaries, in contrast, explicitly reject such a\nconception. They understand the pertinent alternatives to be moral\ngood and evil, and point out the standard teaching that some agents\nwith freedom of the will (God and the angels confirmed in good) simply\ncannot will moral evil, whereas others (Satan and his cohorts) cannot\nwill moral good. Thus, they conclude that the freedom of the will\ncannot be defined as a capacity to turn between alternatives, and\ninstead present alternative definitions of freedom—some, for\nexample, define the will’s freedom as its inability to be compelled.\nGrosseteste saw that their rejection of a definition of freedom in\nterms of a capacity to will alternatives rested on the assumption that\nthe alternatives in question must be moral good and evil.  He rejected\nthis assumption and instead held that the freedom of the will is the\nwill’s capacity to turn between what he calls “bare opposites\nconsidered in themselves.”  Though Grosseteste provides little detail\nabout the notion of a “bare opposite”, it is clearly to be understood\nby reference to his view, as propounded in On Free Decision,\nthat the moral goodness or evil of an act is a matter of its relation\nto God’s will.  Considered in themselves in independence of their\nrelation to God’s will, as “bare” acts, acts are morally\nindifferent. \n Thus, the freedom of the will is the will’s capacity to will, or\nmore particularly, choose alternatives in the sense of morally\nindifferent alternatives. This is not to say that the objects of\nchoice are considered as neither good nor bad; Grosseteste believes\nthat one can only choose what one takes to be good. Rather, the notion\nof goodness involved in the choice of bare opposites is not the notion\nof moral goodness. Grosseteste describes it as natural goodness, but\nsays very little about it.  Given his views about the\nnon-determination of the will by reason, he would seem to think that\nan agent who is choosing among natural goods can choose contrary to\nreason’s dictate as to which of these is the best option or the one\nthat should be chosen, or can at least refrain from making a choice in line with reason’s dictate.\n According to Grosseteste, this capacity to choose morally\nindifferent alternatives underlies our capacity for moral choice when\nit is present, though he provides little explanation of how it does\nso. He holds that human beings cannot choose moral good without the\nassistance of God’s grace, but he does not discuss just how that\nassistance, combined with the aforementioned freedom, helps to make\nmoral choice possible. Possibly he thinks that God’s grace makes it\npossible for the fact that something is willed by God, and thus is\nmorally good, to serve as a reason one has for choosing it.  In any\nevent, he makes it clear that the capacity to choose moral good is not\nintrinsic to possession of reason and will; otherwise the aid of grace\nwould not be needed.  Likewise, the capacity to choose moral evil is\nmade possible by a feature that is not intrinsic to possession of\nreason and will, since God, who has reason and will, cannot choose\nmoral evil. Rather, in ways not explained, the creature’s capacity to\nchoose moral evil is due to the fact, as Augustine too had held, that\nthe creature is created from nothing, an inherent and unavoidable\ndefect in any creature. In those confirmed in good, however, God has\nso made it that this capacity cannot be exercised, and so they are\nincapable of making an evil moral choice.\nIt is now common to distinguish accounts of free will that take some sort of ability to do otherwise as key to freedom from those that emphasize self-determination (see the entry, Free will). Grosseteste’s theory as described above would seem to belong to the former class, and this conclusion is also indicated by arguments he gives for the existence of free decision, which point to a wide range of phenomena regarding which we believe that the agent could have done otherwise. Even so, there is some indication of a deeper self-determination account. For Grosseteste holds that the will’s capacity for opposites itself is contained in its power to will and move itself (Lewis, 2017, 255). Thus Grosseteste sees the will as a self-mover. Unfortunately, he leaves this issue unexplored, including it at the end of his treatise among a list of topics to be considered on another occasion.\n",
    "section_title": "9. Free Decision and Freedom of the Will",
    "entry_title": "Robert Grosseteste",
    "hierarchy_title": "Robert Grosseteste || Free Decision and Freedom of the Will",
    "tokenized_text": [
        "free",
        "decision",
        "freedom",
        "free",
        "decision",
        "freedom",
        "early",
        "thirteenthcentury",
        "account",
        "human",
        "action",
        "freedom",
        "involves",
        "focus",
        "notion",
        "free",
        "decision",
        "liberum",
        "arbitrium",
        "term",
        "legacy",
        "roman",
        "law",
        "patristic",
        "thinker",
        "presentday",
        "counterpart",
        "even",
        "thinker",
        "grosseteste",
        "day",
        "sense",
        "unclear",
        "stood",
        "need",
        "determination",
        "notion",
        "free",
        "decision",
        "merely",
        "antiquarian",
        "interest",
        "account",
        "free",
        "decision",
        "nonetheless",
        "important",
        "insight",
        "provide",
        "author",
        "understanding",
        "human",
        "action",
        "freedom",
        "issue",
        "perennial",
        "philosophical",
        "concern",
        "grosseteste",
        "theory",
        "free",
        "decision",
        "see",
        "lewis",
        "pickavé",
        "expression",
        "free",
        "decision",
        "understood",
        "refer",
        "grammar",
        "concrete",
        "term",
        "suggests",
        "certain",
        "kind",
        "act",
        "also",
        "capacity",
        "capacity",
        "whose",
        "exercise",
        "act",
        "involves",
        "word",
        "decision",
        "standardly",
        "taken",
        "involve",
        "reference",
        "reason",
        "free",
        "reference",
        "thus",
        "often",
        "asked",
        "whether",
        "free",
        "decision",
        "refers",
        "act",
        "reason",
        "whether",
        "capacity",
        "act",
        "involves",
        "reason",
        "either",
        "alone",
        "combination",
        "possibly",
        "capacity",
        "besides",
        "according",
        "grosseteste",
        "free",
        "decision",
        "free",
        "decision",
        "concrete",
        "usage",
        "refers",
        "decision",
        "certain",
        "kind",
        "act",
        "reason",
        "act",
        "like",
        "act",
        "reason",
        "free",
        "said",
        "free",
        "derivative",
        "sense",
        "act",
        "providing",
        "direction",
        "whose",
        "act",
        "free",
        "talk",
        "reason",
        "act",
        "free",
        "common",
        "medieval",
        "thinker",
        "perhaps",
        "mere",
        "manner",
        "speaking",
        "intended",
        "agent",
        "exercise",
        "reason",
        "done",
        "freely",
        "reason",
        "task",
        "distinguishing",
        "good",
        "bad",
        "better",
        "worse",
        "proposing",
        "choose",
        "reject",
        "nature",
        "chooses",
        "reject",
        "receiving",
        "directive",
        "reason",
        "free",
        "implement",
        "reason",
        "decision",
        "choose",
        "reject",
        "otherwise",
        "reason",
        "pronounced",
        "freedom",
        "decision",
        "derivative",
        "sense",
        "said",
        "free",
        "decision",
        "proposing",
        "view",
        "grosseteste",
        "indicates",
        "take",
        "choice",
        "made",
        "psychologically",
        "determined",
        "reason",
        "reason",
        "provides",
        "advice",
        "necessity",
        "grosseteste",
        "take",
        "capacity",
        "underlying",
        "free",
        "decision",
        "reason",
        "identifies",
        "aspectus",
        "affectus",
        "respectively",
        "hold",
        "perhaps",
        "influence",
        "pseudoaugustinian",
        "de",
        "spiritu",
        "et",
        "anima",
        "teaching",
        "simplicity",
        "soul",
        "capacity",
        "root",
        "one",
        "one",
        "capacity",
        "exercised",
        "one",
        "way",
        "decision",
        "another",
        "choice",
        "since",
        "grosseteste",
        "hold",
        "decision",
        "said",
        "free",
        "provides",
        "direction",
        "free",
        "might",
        "expect",
        "take",
        "freedom",
        "decision",
        "libertas",
        "arbitrii",
        "freedom",
        "exactly",
        "nature",
        "freedom",
        "common",
        "think",
        "freedom",
        "capacity",
        "alternative",
        "considered",
        "post",
        "factum",
        "willed",
        "otherwise",
        "grosseteste",
        "contemporary",
        "speak",
        "connection",
        "flexibilitas",
        "vertibilitas",
        "importance",
        "grosseteste",
        "account",
        "freedom",
        "lie",
        "fact",
        "one",
        "thinker",
        "day",
        "hold",
        "freedom",
        "indeed",
        "defined",
        "capacity",
        "alternative",
        "many",
        "important",
        "contemporary",
        "contrast",
        "explicitly",
        "reject",
        "conception",
        "understand",
        "pertinent",
        "alternative",
        "moral",
        "good",
        "evil",
        "point",
        "standard",
        "teaching",
        "agent",
        "freedom",
        "god",
        "angel",
        "confirmed",
        "good",
        "simply",
        "moral",
        "evil",
        "whereas",
        "others",
        "satan",
        "cohort",
        "moral",
        "good",
        "thus",
        "conclude",
        "freedom",
        "defined",
        "capacity",
        "turn",
        "alternative",
        "instead",
        "present",
        "alternative",
        "definition",
        "freedomsome",
        "example",
        "define",
        "freedom",
        "inability",
        "compelled",
        "grosseteste",
        "saw",
        "rejection",
        "definition",
        "freedom",
        "term",
        "capacity",
        "alternative",
        "rested",
        "assumption",
        "alternative",
        "question",
        "must",
        "moral",
        "good",
        "evil",
        "rejected",
        "assumption",
        "instead",
        "held",
        "freedom",
        "capacity",
        "turn",
        "call",
        "bare",
        "opposite",
        "considered",
        "themselves",
        "though",
        "grosseteste",
        "provides",
        "little",
        "detail",
        "notion",
        "bare",
        "opposite",
        "clearly",
        "understood",
        "reference",
        "view",
        "propounded",
        "free",
        "decision",
        "moral",
        "goodness",
        "evil",
        "act",
        "matter",
        "relation",
        "god",
        "considered",
        "independence",
        "relation",
        "god",
        "bare",
        "act",
        "act",
        "morally",
        "indifferent",
        "thus",
        "freedom",
        "capacity",
        "particularly",
        "choose",
        "alternative",
        "sense",
        "morally",
        "indifferent",
        "alternative",
        "say",
        "object",
        "choice",
        "considered",
        "neither",
        "good",
        "bad",
        "grosseteste",
        "belief",
        "one",
        "choose",
        "one",
        "take",
        "good",
        "rather",
        "notion",
        "goodness",
        "involved",
        "choice",
        "bare",
        "opposite",
        "notion",
        "moral",
        "goodness",
        "grosseteste",
        "describes",
        "natural",
        "goodness",
        "say",
        "little",
        "given",
        "view",
        "nondetermination",
        "reason",
        "would",
        "seem",
        "think",
        "agent",
        "choosing",
        "among",
        "natural",
        "good",
        "choose",
        "contrary",
        "reason",
        "dictate",
        "best",
        "option",
        "one",
        "chosen",
        "least",
        "refrain",
        "making",
        "choice",
        "line",
        "reason",
        "dictate",
        "according",
        "grosseteste",
        "capacity",
        "choose",
        "morally",
        "indifferent",
        "alternative",
        "underlies",
        "capacity",
        "moral",
        "choice",
        "present",
        "though",
        "provides",
        "little",
        "explanation",
        "hold",
        "human",
        "being",
        "choose",
        "moral",
        "good",
        "without",
        "assistance",
        "god",
        "grace",
        "discus",
        "assistance",
        "combined",
        "aforementioned",
        "freedom",
        "help",
        "make",
        "moral",
        "choice",
        "possible",
        "possibly",
        "think",
        "god",
        "grace",
        "make",
        "possible",
        "fact",
        "something",
        "willed",
        "god",
        "thus",
        "morally",
        "good",
        "serve",
        "reason",
        "one",
        "choosing",
        "event",
        "make",
        "clear",
        "capacity",
        "choose",
        "moral",
        "good",
        "intrinsic",
        "possession",
        "reason",
        "otherwise",
        "aid",
        "grace",
        "would",
        "needed",
        "likewise",
        "capacity",
        "choose",
        "moral",
        "evil",
        "made",
        "possible",
        "feature",
        "intrinsic",
        "possession",
        "reason",
        "since",
        "god",
        "reason",
        "choose",
        "moral",
        "evil",
        "rather",
        "way",
        "explained",
        "creature",
        "capacity",
        "choose",
        "moral",
        "evil",
        "due",
        "fact",
        "augustine",
        "held",
        "creature",
        "created",
        "nothing",
        "inherent",
        "unavoidable",
        "defect",
        "creature",
        "confirmed",
        "good",
        "however",
        "god",
        "made",
        "capacity",
        "exercised",
        "incapable",
        "making",
        "evil",
        "moral",
        "choice",
        "common",
        "distinguish",
        "account",
        "free",
        "take",
        "sort",
        "ability",
        "otherwise",
        "key",
        "freedom",
        "emphasize",
        "selfdetermination",
        "see",
        "entry",
        "free",
        "grosseteste",
        "theory",
        "described",
        "would",
        "seem",
        "belong",
        "former",
        "class",
        "conclusion",
        "also",
        "indicated",
        "argument",
        "give",
        "existence",
        "free",
        "decision",
        "point",
        "wide",
        "range",
        "phenomenon",
        "regarding",
        "believe",
        "agent",
        "could",
        "done",
        "otherwise",
        "even",
        "indication",
        "deeper",
        "selfdetermination",
        "account",
        "grosseteste",
        "hold",
        "capacity",
        "opposite",
        "contained",
        "power",
        "move",
        "lewis",
        "thus",
        "grosseteste",
        "see",
        "selfmover",
        "unfortunately",
        "leaf",
        "issue",
        "unexplored",
        "including",
        "end",
        "treatise",
        "among",
        "list",
        "topic",
        "considered",
        "another",
        "occasion"
    ]
}