{
    "main_text": "The Metaphysics of Light\n4. The Metaphysics of Light\n If a single leitmotif runs through Grosseteste’s works, it is that\nof light.  The notion of light occupies a prominent place in\nGrosseteste’s commentaries on the Bible, in his account of sense\nperception and the relation of body and soul, in his illuminationist\ntheory of knowledge, in his account of the origin and nature of the\nphysical world, and, of course, in his writings on optics.  Just how\ntightly associated Grosseteste took the notions of light employed in\nsuch different contexts to be is unclear. From a philosophical point\nof view, which will be the focus here, undoubtedly his use of the\nnotion of light in his account of the basic structure and origin of\nthe physical universe is of fundamental importance and the greatest\noriginality.\n Grosseteste’s so-called metaphysics of light rests on a\nhylomorphic (matter-form) account of the metaphysical makeup of\nbodies. On this basis Grosseteste explains the generation and nature\nof the cosmos. Grosseteste also interprets aspects of Aristotle’s\nnatural philosophy in terms of this theory.  He sets out this theory\nmost fully in On Light, but elements of it are present also in\nhis commentaries on the Posterior Analytics and \nPhysics, in On Bodily Movement and Light, and in his\ncommentary on Ecclesiasticus 43: 1–5, also known as On the\nOperations of the Sun. \nGrosseteste treats bodies as composites of a first or prime matter\nand a corresponding first form. This form, termed\n“corporeity,” is the form in virtue of which something is\na body.  Grosseteste takes bodies to be more or less metaphysically\nsimple depending on whether, in addition to corporeity, they include\nother substantial forms. Thus, in On Light he holds the\nfirmament or outermost heavenly sphere to be the most simple body, as\nit is composed simply of first matter and first form, but in his\ncommentary on the Physics he speaks of the element fire as\nhaving in addition to first form the substantial form of fire.\n Grosseteste’s originality lay not in presenting a doctrine of\nfirst form and first matter.  Aristotle was standardly understood to\npropound a notion of first or prime matter, and the notion of a first\nform may be found in texts of Neoplatonic inspiration, such as the\nFons vitae of Avicebron (see McEvoy 1982, 158–162).  What\nappears to be original, however, is Grosseteste’s identification of\nfirst form with light (lux). On Light opens with an\nargument for this identification. Grosseteste asserts that first form\nand first matter are in themselves simple substances. Yet first form,\ncorporeity, necessarily results in the extension of matter into three\ndimensions, thereby yielding a quantified body. A simple form without\ndimension could only have this effect, however, if it instantaneously\nmultiplied and diffused itself in all directions, thereby extending\nmatter along with its diffusion of itself. But these are\ncharacteristic features of light, for light is essentially\nself-multiplicative and self-diffusive, a sphere of light being\ninstantaneously generated from a point of light. Thus, Grosseteste\nconcludes that light is in fact the first form.\n On the basis of this theory Grosseteste developed a cosmogony and\ncosmology. He saw in the metaphysics of light insight\ninto God’s creation of the physical universe and an explanation of why\nit took the form it did. At the beginning of time, Grosseteste\nasserts, God created first form or light in first matter.  First form\nand first matter are in themselves indivisible and simple, and\naccording to Grosseteste the finite multiplication of a simple cannot\ngenerate an item with size (quantum). But, he thinks, the\ninfinite multiplication of a simple will generate a finite\nquantum.  Thus, through the infinite multiplication of first\nform in first matter extended bodies, and thus the physical universe,\nwere produced.  To account for bodies of different sizes, Grosseteste\nposits that there are infinities of different sizes (see below) that\nstand in different ratios, numerical and non-numerical, to each\nother. Thus, “light by the infinite multiplication of itself extends\nmatter into larger and smaller finite dimensions that stand to one\nanother in all ratios, numerical and non-numerical” (Lewis 2013,\n241–242).\nGrosseteste employs the notion of light to explain the genesis of\nthe Aristotelian cosmos as a system of nested celestial spheres\nsurrounding the four sublunary or elemental spheres. According to\nGrosseteste, the infinite self-multiplication of the initial point of\nlight extended the first matter it informed into a spherical form,\nsince light diffuses itself spherically. The outermost parts of the\nmatter of the sphere thereby generated, unlike the parts of the matter\nbelow them, were maximally extended and rarefied and formed the\noutermost (or first) sphere, the firmament. Yet because light is\nessentially self-multiplicative, the light in this outermost sphere\ncontinued to multiply itself, only now it did so back inwards toward\nthe center from all parts of the outermost sphere, since it had\nalready diffused itself outward as far as it possibly could. And since\nlight, being a substantial form, cannot exist apart from matter, this\ninwardly directed light drew with itself what Grosseteste calls the\nspirituality of the matter of the outermost sphere, and thus\nlumen, a body comprised of light and the\nspirituality of this matter, proceeded inwards. Moving inwards,\nlumen concentrated the matter existing below the outermost\nsphere, leaving in its wake below the outermost sphere a second sphere\ncomprised of matter whose parts were rarefied as much as they could\nbe. This sphere in turn generated lumen, which moving inwards\nfurther concentrated the matter below it and rarefied the outermost\nparts of this matter so as to produce the third sphere. The repetition\nof this process gave rise to the nine celestial spheres, each sphere\nbeing comprised of matter whose parts were incapable of further\nrarefaction.\nThe lowest celestial sphere, the lunar sphere, also generated\nlumen, which moved inwards and further concentrated the matter\nbelow this sphere. But since this lumen lacked enough power to\nfully disperse the outermost parts of this matter below the lunar\nsphere, it produced a sphere comprised of incompletely dispersed\nmatter, the sphere of fire. Likewise, fire generated lumen,\nproducing below it yet another sphere of incompletely dispersed\nmatter, the sphere of air. This process continued, giving rise in turn\nto the spheres of water and earth, the latter being comprised of the\nmost concentrated and dense matter. Because the matter of these four\nelemental spheres was not fully dispersed, it remained capable of\nbeing concentrated and dispersed, and for this reason the elements,\nunlike the celestial spheres, are capable of alteration, growth,\ngeneration and corruption.\nGrosseteste also employs this theory of light as part of his\nexplanation of the nature of the heavenly movements. He explains that\nthe heavenly bodies can only move with a circular movement because the\nlumen in them is incapable of rarefaction or condensation, and as\na result cannot incline the parts of their matter upward (to rarefy\nthem) or downward (so as to condense them). Indeed, the heavenly\nspheres can only receive movement “from an intellective motive\npower,” that is, an intelligence or angel, “that in\nincorporeally casting its mental gaze back over itself rotates the\nspheres with a corporeal revolution” (Lewis 2013, 246).  Because\nthe elements, on the other hand, can be rarefied and condensed, they\ncan incline the lumen in themselves away from the center of the\nuniverse, so as to rarefy it, or toward the center so as to condense\nit, and this accounts for their natural capacity to move up and\ndown.\nAlthough the metaphysics of light is fundamentally non-Aristotelian\nin nature, Grosseteste clearly was concerned to use it to explain many\nof the features of the Aristotelian cosmos—the system of\nnested spheres, the distinction between the movement of celestial and\nsublunary bodies, and so forth. In like manner, in his commentary on\nthe Physics he interprets fundamental ideas in Aristotle’s\nnatural philosophy in terms of the light metaphysics, explaining\nAristotle’s theory of potentiality in terms of the replicability of\nform and holding that every bodily species comes to be by “the\ngreater or lesser replication of the simple first bodily form,”\nlight (Dales 1963a, 17).  Likewise, Aristotle’s three principles:\nform, privation and the underlying subject, are interpreted as the\nfirst form light, the impurity of light in things, and first matter\nrespectively. In On Bodily Movement and Light, Grosseteste\nidentifies nature, conceived by Aristotle as an internal source of\nmovement and rest, with the first form, light, and claims that all kinds\nof bodily change are the “multiplicative force” of the first\nbodily form, light (Baur 1912, 92).\n",
    "section_title": "4. The Metaphysics of Light",
    "entry_title": "Robert Grosseteste",
    "hierarchy_title": "Robert Grosseteste || The Metaphysics of Light",
    "tokenized_text": [
        "metaphysics",
        "light",
        "metaphysics",
        "light",
        "single",
        "leitmotif",
        "run",
        "grosseteste",
        "work",
        "light",
        "notion",
        "light",
        "occupies",
        "prominent",
        "place",
        "grosseteste",
        "commentary",
        "bible",
        "account",
        "sense",
        "perception",
        "relation",
        "body",
        "soul",
        "illuminationist",
        "theory",
        "knowledge",
        "account",
        "origin",
        "nature",
        "physical",
        "world",
        "course",
        "writing",
        "optic",
        "tightly",
        "associated",
        "grosseteste",
        "took",
        "notion",
        "light",
        "employed",
        "different",
        "context",
        "unclear",
        "philosophical",
        "point",
        "view",
        "focus",
        "undoubtedly",
        "use",
        "notion",
        "light",
        "account",
        "basic",
        "structure",
        "origin",
        "physical",
        "universe",
        "fundamental",
        "importance",
        "greatest",
        "originality",
        "grosseteste",
        "socalled",
        "metaphysics",
        "light",
        "rest",
        "hylomorphic",
        "matterform",
        "account",
        "metaphysical",
        "makeup",
        "body",
        "basis",
        "grosseteste",
        "explains",
        "generation",
        "nature",
        "cosmos",
        "grosseteste",
        "also",
        "interprets",
        "aspect",
        "aristotle",
        "natural",
        "philosophy",
        "term",
        "theory",
        "set",
        "theory",
        "fully",
        "light",
        "element",
        "present",
        "also",
        "commentary",
        "posterior",
        "analytics",
        "physic",
        "bodily",
        "movement",
        "light",
        "commentary",
        "ecclesiasticus",
        "also",
        "known",
        "operation",
        "sun",
        "grosseteste",
        "treat",
        "body",
        "composite",
        "first",
        "prime",
        "matter",
        "corresponding",
        "first",
        "form",
        "form",
        "termed",
        "corporeity",
        "form",
        "virtue",
        "something",
        "body",
        "grosseteste",
        "take",
        "body",
        "le",
        "metaphysically",
        "simple",
        "depending",
        "whether",
        "addition",
        "corporeity",
        "include",
        "substantial",
        "form",
        "thus",
        "light",
        "hold",
        "firmament",
        "outermost",
        "heavenly",
        "sphere",
        "simple",
        "body",
        "composed",
        "simply",
        "first",
        "matter",
        "first",
        "form",
        "commentary",
        "physic",
        "speaks",
        "element",
        "fire",
        "addition",
        "first",
        "form",
        "substantial",
        "form",
        "fire",
        "grosseteste",
        "originality",
        "lay",
        "presenting",
        "doctrine",
        "first",
        "form",
        "first",
        "matter",
        "aristotle",
        "standardly",
        "understood",
        "propound",
        "notion",
        "first",
        "prime",
        "matter",
        "notion",
        "first",
        "form",
        "may",
        "found",
        "text",
        "neoplatonic",
        "inspiration",
        "fons",
        "vitae",
        "avicebron",
        "see",
        "mcevoy",
        "appears",
        "original",
        "however",
        "grosseteste",
        "identification",
        "first",
        "form",
        "light",
        "lux",
        "light",
        "open",
        "argument",
        "identification",
        "grosseteste",
        "asserts",
        "first",
        "form",
        "first",
        "matter",
        "simple",
        "substance",
        "yet",
        "first",
        "form",
        "corporeity",
        "necessarily",
        "result",
        "extension",
        "matter",
        "three",
        "dimension",
        "thereby",
        "yielding",
        "quantified",
        "body",
        "simple",
        "form",
        "without",
        "dimension",
        "could",
        "effect",
        "however",
        "instantaneously",
        "multiplied",
        "diffused",
        "direction",
        "thereby",
        "extending",
        "matter",
        "along",
        "diffusion",
        "characteristic",
        "feature",
        "light",
        "light",
        "essentially",
        "selfmultiplicative",
        "selfdiffusive",
        "sphere",
        "light",
        "instantaneously",
        "generated",
        "point",
        "light",
        "thus",
        "grosseteste",
        "concludes",
        "light",
        "fact",
        "first",
        "form",
        "basis",
        "theory",
        "grosseteste",
        "developed",
        "cosmogony",
        "cosmology",
        "saw",
        "metaphysics",
        "light",
        "insight",
        "god",
        "creation",
        "physical",
        "universe",
        "explanation",
        "took",
        "form",
        "beginning",
        "time",
        "grosseteste",
        "asserts",
        "god",
        "created",
        "first",
        "form",
        "light",
        "first",
        "matter",
        "first",
        "form",
        "first",
        "matter",
        "indivisible",
        "simple",
        "according",
        "grosseteste",
        "finite",
        "multiplication",
        "simple",
        "generate",
        "item",
        "size",
        "quantum",
        "think",
        "infinite",
        "multiplication",
        "simple",
        "generate",
        "finite",
        "quantum",
        "thus",
        "infinite",
        "multiplication",
        "first",
        "form",
        "first",
        "matter",
        "extended",
        "body",
        "thus",
        "physical",
        "universe",
        "produced",
        "account",
        "body",
        "different",
        "size",
        "grosseteste",
        "posit",
        "infinity",
        "different",
        "size",
        "see",
        "stand",
        "different",
        "ratio",
        "numerical",
        "nonnumerical",
        "thus",
        "light",
        "infinite",
        "multiplication",
        "extends",
        "matter",
        "larger",
        "smaller",
        "finite",
        "dimension",
        "stand",
        "one",
        "another",
        "ratio",
        "numerical",
        "nonnumerical",
        "lewis",
        "grosseteste",
        "employ",
        "notion",
        "light",
        "explain",
        "genesis",
        "aristotelian",
        "cosmos",
        "system",
        "nested",
        "celestial",
        "sphere",
        "surrounding",
        "four",
        "sublunary",
        "elemental",
        "sphere",
        "according",
        "grosseteste",
        "infinite",
        "selfmultiplication",
        "initial",
        "point",
        "light",
        "extended",
        "first",
        "matter",
        "informed",
        "spherical",
        "form",
        "since",
        "light",
        "diffuses",
        "spherically",
        "outermost",
        "part",
        "matter",
        "sphere",
        "thereby",
        "generated",
        "unlike",
        "part",
        "matter",
        "maximally",
        "extended",
        "rarefied",
        "formed",
        "outermost",
        "first",
        "sphere",
        "firmament",
        "yet",
        "light",
        "essentially",
        "selfmultiplicative",
        "light",
        "outermost",
        "sphere",
        "continued",
        "multiply",
        "back",
        "inwards",
        "toward",
        "center",
        "part",
        "outermost",
        "sphere",
        "since",
        "already",
        "diffused",
        "outward",
        "far",
        "possibly",
        "could",
        "since",
        "light",
        "substantial",
        "form",
        "exist",
        "apart",
        "matter",
        "inwardly",
        "directed",
        "light",
        "drew",
        "grosseteste",
        "call",
        "spirituality",
        "matter",
        "outermost",
        "sphere",
        "thus",
        "lumen",
        "body",
        "comprised",
        "light",
        "spirituality",
        "matter",
        "proceeded",
        "inwards",
        "moving",
        "inwards",
        "lumen",
        "concentrated",
        "matter",
        "existing",
        "outermost",
        "sphere",
        "leaving",
        "wake",
        "outermost",
        "sphere",
        "second",
        "sphere",
        "comprised",
        "matter",
        "whose",
        "part",
        "rarefied",
        "much",
        "could",
        "sphere",
        "turn",
        "generated",
        "lumen",
        "moving",
        "inwards",
        "concentrated",
        "matter",
        "rarefied",
        "outermost",
        "part",
        "matter",
        "produce",
        "third",
        "sphere",
        "repetition",
        "process",
        "gave",
        "rise",
        "nine",
        "celestial",
        "sphere",
        "sphere",
        "comprised",
        "matter",
        "whose",
        "part",
        "incapable",
        "rarefaction",
        "lowest",
        "celestial",
        "sphere",
        "lunar",
        "sphere",
        "also",
        "generated",
        "lumen",
        "moved",
        "inwards",
        "concentrated",
        "matter",
        "sphere",
        "since",
        "lumen",
        "lacked",
        "enough",
        "power",
        "fully",
        "disperse",
        "outermost",
        "part",
        "matter",
        "lunar",
        "sphere",
        "produced",
        "sphere",
        "comprised",
        "incompletely",
        "dispersed",
        "matter",
        "sphere",
        "fire",
        "likewise",
        "fire",
        "generated",
        "lumen",
        "producing",
        "yet",
        "another",
        "sphere",
        "incompletely",
        "dispersed",
        "matter",
        "sphere",
        "air",
        "process",
        "continued",
        "giving",
        "rise",
        "turn",
        "sphere",
        "water",
        "earth",
        "latter",
        "comprised",
        "concentrated",
        "dense",
        "matter",
        "matter",
        "four",
        "elemental",
        "sphere",
        "fully",
        "dispersed",
        "remained",
        "capable",
        "concentrated",
        "dispersed",
        "reason",
        "element",
        "unlike",
        "celestial",
        "sphere",
        "capable",
        "alteration",
        "growth",
        "generation",
        "corruption",
        "grosseteste",
        "also",
        "employ",
        "theory",
        "light",
        "part",
        "explanation",
        "nature",
        "heavenly",
        "movement",
        "explains",
        "heavenly",
        "body",
        "move",
        "circular",
        "movement",
        "lumen",
        "incapable",
        "rarefaction",
        "condensation",
        "result",
        "incline",
        "part",
        "matter",
        "upward",
        "rarefy",
        "downward",
        "condense",
        "indeed",
        "heavenly",
        "sphere",
        "receive",
        "movement",
        "intellective",
        "motive",
        "power",
        "intelligence",
        "angel",
        "incorporeally",
        "casting",
        "mental",
        "gaze",
        "back",
        "rotates",
        "sphere",
        "corporeal",
        "revolution",
        "lewis",
        "element",
        "hand",
        "rarefied",
        "condensed",
        "incline",
        "lumen",
        "away",
        "center",
        "universe",
        "rarefy",
        "toward",
        "center",
        "condense",
        "account",
        "natural",
        "capacity",
        "move",
        "although",
        "metaphysics",
        "light",
        "fundamentally",
        "nonaristotelian",
        "nature",
        "grosseteste",
        "clearly",
        "concerned",
        "use",
        "explain",
        "many",
        "feature",
        "aristotelian",
        "cosmosthe",
        "system",
        "nested",
        "sphere",
        "distinction",
        "movement",
        "celestial",
        "sublunary",
        "body",
        "forth",
        "like",
        "manner",
        "commentary",
        "physic",
        "interprets",
        "fundamental",
        "idea",
        "aristotle",
        "natural",
        "philosophy",
        "term",
        "light",
        "metaphysics",
        "explaining",
        "aristotle",
        "theory",
        "potentiality",
        "term",
        "replicability",
        "form",
        "holding",
        "every",
        "bodily",
        "specie",
        "come",
        "greater",
        "lesser",
        "replication",
        "simple",
        "first",
        "bodily",
        "form",
        "light",
        "dale",
        "a",
        "likewise",
        "aristotle",
        "three",
        "principle",
        "form",
        "privation",
        "underlying",
        "subject",
        "interpreted",
        "first",
        "form",
        "light",
        "impurity",
        "light",
        "thing",
        "first",
        "matter",
        "respectively",
        "bodily",
        "movement",
        "light",
        "grosseteste",
        "identifies",
        "nature",
        "conceived",
        "aristotle",
        "internal",
        "source",
        "movement",
        "rest",
        "first",
        "form",
        "light",
        "claim",
        "kind",
        "bodily",
        "change",
        "multiplicative",
        "force",
        "first",
        "bodily",
        "form",
        "light",
        "baur"
    ]
}