{
    "main_text": "Habermas’s Mature Social Theory: The Theory of Communicative Action || Habermas’s Pragmatic Theory of Meaning\n2.1 Habermas’s Pragmatic Theory of Meaning\n\nWhile the theory of communicative action is designed to answer\nquestions in social theory, Habermas also considers it as a\ncontribution to the theory of meaning (1984b: 604). There are three\npillars to this theory:\n\nThe first comes from Karl Bühler’s Organon Model of\nlanguage according to which language is triadic, with three functions\ncorresponding respectively to the objective world, the hearer, and the\nspeaker (or the third, second and first person): a cognitive function,\nan appeal function, and an expressive function.\nThe second pillar is speech-act theory, and in particular the idea\nof illocutionary force or meaning, which was developed by J. L. Austin\nand John Searle.\nThe third pillar is “formal semantics”, the\ntruth-conditional theory of meaning, and in particular Michael\nDummett’s “verificationist” critique of it.\n\n\nThese three pillars form the basis of what Habermas calls\n“formal pragmatics” or the pragmatic theory of meaning,\nthe basic idea of which is that “We understand a speech-act when\nwe know what makes it acceptable” (1984a: 297 hereafter TCAI):\nto understand what a speaker means the hearer has to have access to\nthe reasons for the speaker’s utterance.\n\nThe first pillar, Bühler’s functional schema of language,\nis important as a guiding assumption of Habermas’s theory.\nHabermas sets so much store by Bühler’s model because it\nencompasses the entire field of linguistic meaning, and gives equal\nweight and priority to its three dimensions: what is intended by the\nspeaker, what is said in the content of the utterance, and what is\ndone with that utterance. All three dimensions are present in what\nHabermas considers as the original mode of communication whereby a\nspeaker, S, reaches understanding with another person,\nH, about something (1988b [1998b chapter 6: 279] [1992a:\n58]). The triadic architectonic radiates into all aspects of\nHabermas’s theory: the thesis that there are three validity\nclaims: to truth, rightness and sincerity (TCAI: 307); that speakers\ncan adopt three attitudes: an objectivating, a norm-conformative, and\nan expressive attitude (TCAI: 309); that speakers through their\nutterances take up relations to three “worlds”: the\nobjective world of states of affairs, the social or intersubjective\nworld of legitimate social orders, and the subjective internal world\n(TCAI: 49–52, 60, 236, 308); and finally that there are three\nbasic modes of speech which forms the basis of the classification of\nspeech-acts: constatives or assertoric speech-acts, regulative\nspeech-acts (such as imperatives or requests), and expressive\nspeech-acts (TCAI: 309). Each of these triadic distinctions nests in\neach other.\n\nTo the extent that there is an argument in Theory of Communicative\nAction for the triadic structure itself, it rests on the basic\nclaim that there are three equiprimordial, meaning-critical validity\nclaims. Every speech-act simultaneously makes a claim to truth, to\nrightness, and to truthfulness. That means a speech-act can be taken\nup by the hearer, and assessed in the light of its propositional\ntruth, normative rightness, or the sincerity with which it is\nexpressed. If accepted, this means that agreement\n(Einverständnis) is reached “simultaneously on\nthree levels” (1981 [1984a: 307]). In defence of this view\nHabermas argues that a speech-act can always be rejected from three\nperspectives: in the light of its assertibility conditions, its\nnormative justification, or the sincerity of the speaker (1981 [1984a:\n306]; 1988b essay 4 [1998b: 231]; 1988b essay 6 [1998b: 296]; 1999a\n[1998b: 317]). However, the claim that needs to be defended, not\nassumed, is that the validity claim for every speech-act can be\nrejected from three and only three perspectives. And as Dorschel\nclaims, an assertion or utterance might be rejected in virtue of the\nvolume or style with which it is uttered (Dorschel 1988: 8–9).\nIn the final analysis, the “argument” that any utterance\ncan be rejected from three and only three perspectives is\nquestion-begging. So the triadic structure, stemming from\nBühler’s schema remains best thought of as a hinge\nassumption.\n\nThe second pillar is speech-act theory. Because speech-act theory\nconstrues speech as action, or, to use Austin’s phrase, as\n“doing things” with words, it is well suited to provide\nthe basis for a unified theory of meaning and action. According to the\ntheory, a speech has both propositional content, p, and\nillocutionary force M. So the meaning of an utterance\nMp—“the ice is thin”—can be both a\nstatement about the way the world is, and, say, depending on the\ncontext, a warning.\n\nThat said, Habermas’s main focus is on illocutionary acts, the\naims of which, in contrast to perlocutionary acts, he contends, can\nalways be made manifest (1986b [1998b chapter 3: 202]). When a speaker\nmakes a declaration or a promise they thereby signal to the hearer\nwhat they are doing. The key to Habermas’s use of the term\n“illocutionary” is that he identifies and specifies a\nputatively universal internal mechanism by which speakers realize\ntheir various illocutionary aims: they make validity claims for their\nutterance in order to reach understanding (Verständigung\nor Einverständnis). Speakers do this by making an\nimplicit guarantee that they can, if necessary, adduce good reasons\nfor their utterance. Hearers, for their part, are always free to\nrespond with a “yes” or “no” (1981 [1984a:\n302]) to this validity claim. When they respond with a\n“yes”, speaker and hearer reach understanding or\nagreement. “Reaching understanding is the inherent telos of\nhuman speech” (1981 [1984a: 280]).\n\nThe third pillar is formal semantics. To explain the notion of a\nmeaning-critical validity claim, Habermas enrols Dummett’s\nverificationist critique of truth-conditional semantics, and the\nepistemic turn in formal semantics (1981 [1984a: 316–8]; 1981\n[1998b chapter 2: 153]). Dummett argues that justification is an\nepistemic idea, but truth is not, and that the truth-conditions of\nmany sentences are unknowable, even where their justification\nconditions are not. He proposes the view that we understand the\nmeaning of a sentence when we know the conditions under which it is\nassertible, rather than the conditions under which it is true (Dummett\n1993: 45; Heath 2001: 120–121; Fultner 2011a: 60–62).\n\nHabermas takes Dummett’s thought and extends it to natural\nlanguages, and to the pragmatics of meaning and understanding. This is\nwhy he calls his approach “formal pragmatics”, rather than\n“formal semantics”.\n\n\n[I]t is possible to generalize Dummett’s explanation. We\nunderstand a speech-act when we know the kinds of reasons that a\nspeaker could provide … claim validity for his\nutterance—in short when we know what makes it acceptable. (1986b\n[1998b chapter 3: 232])\n\n\nBut as Heath points out this is problematic. For there is a semantic\ndimension to, and motivation for, Dummett’s idea that to know\nthe meaning of a sentence is to know the conditions under which it is\nassertible. It offers a unified explanation of the compositional\nstructure of language, namely of how one can construct an infinite\nnumber of meaningful sentences out of a finite number of semantic\nunits and the rules for their composition. In turn that explains how\nwe can understand the meaning of a sentence we have never encountered\nbefore. This may work for assertions, but it is inapplicable to the\npragmatic dimension of meaning, to the illocutionary force of\nutterances, which lacks a compositional structure. So it is also\nunclear how it would work for the other kinds of speech-acts such as\nregulatives and expressives.\n\nThis strongly suggests, as Heath argues, that there may after all be\nonly one validity claim that is “meaning-critical”, or\n“internal” in the sense that it is constitutive of the\nmeaning of utterances, namely the validity claim to the truth of\nassertions or of the propositional components of other kinds of\nspeech-act (Heath 2001: 115–6). It is potentially damaging for\nHabermas also for another reason. It shows that to understand an\nutterance that makes a rightness claim one need not know how the\nutterance or claim is justified. Understanding an utterance need not\ninvolve accepting reasons for action. Recall that Habermas insists\nthat the illocutionary aim of the speaker is not only to be\nunderstood, in the sense that addressees recognize\nthe sense of her utterance, but agreed with,\nin the sense that they also accept the relevant\nreasons that the speaker could adduce in support of their utterance.\nIn the case of utterances that make rightness claims these are reasons\nto act or behave in certain ways. Habermas must establish the latter,\nbecause his whole theory depends on the claim that the normative\ncommitments unavoidably generated in speech reach over into the\nsubsequent action sequence (1981 [1984a: 302–3]).\n\nHabermas later makes a move that appears to address this problem\nwithout solving it: he claims truth to be paradigmatic of validity,\nand rightness to be merely analogous with truth (1999a [2003a: 229]).\nHowever, he does not say what the analogues are, nor does he explain\nwhat the basis for the analogy is (Finlayson 2005). To claim that that\nvalidity claims to rightness are analogous to validity claims to\ntruth, in that they determine the meaning of the utterances that make\nthem, and can play the role as a core component of a theory of\nmeaning, is to beg the important questions.\n",
    "section_title": "2.1 Habermas’s Pragmatic Theory of Meaning",
    "entry_title": "Jürgen Habermas",
    "hierarchy_title": "Jürgen Habermas || Habermas’s Mature Social Theory: The Theory of Communicative Action || Habermas’s Pragmatic Theory of Meaning",
    "tokenized_text": [
        "habermas",
        "mature",
        "social",
        "theory",
        "theory",
        "communicative",
        "action",
        "habermas",
        "pragmatic",
        "theory",
        "meaning",
        "habermas",
        "pragmatic",
        "theory",
        "meaning",
        "theory",
        "communicative",
        "action",
        "designed",
        "answer",
        "question",
        "social",
        "theory",
        "habermas",
        "also",
        "considers",
        "contribution",
        "theory",
        "meaning",
        "b",
        "three",
        "pillar",
        "theory",
        "first",
        "come",
        "karl",
        "bühler",
        "organon",
        "model",
        "language",
        "according",
        "language",
        "triadic",
        "three",
        "function",
        "corresponding",
        "respectively",
        "objective",
        "world",
        "hearer",
        "speaker",
        "third",
        "second",
        "first",
        "person",
        "cognitive",
        "function",
        "appeal",
        "function",
        "expressive",
        "function",
        "second",
        "pillar",
        "speechact",
        "theory",
        "particular",
        "idea",
        "illocutionary",
        "force",
        "meaning",
        "developed",
        "j",
        "l",
        "austin",
        "john",
        "searle",
        "third",
        "pillar",
        "formal",
        "semantics",
        "truthconditional",
        "theory",
        "meaning",
        "particular",
        "michael",
        "dummett",
        "verificationist",
        "critique",
        "three",
        "pillar",
        "form",
        "basis",
        "habermas",
        "call",
        "formal",
        "pragmatic",
        "pragmatic",
        "theory",
        "meaning",
        "basic",
        "idea",
        "understand",
        "speechact",
        "know",
        "make",
        "acceptable",
        "a",
        "hereafter",
        "tcai",
        "understand",
        "speaker",
        "mean",
        "hearer",
        "access",
        "reason",
        "speaker",
        "utterance",
        "first",
        "pillar",
        "bühler",
        "functional",
        "schema",
        "language",
        "important",
        "guiding",
        "assumption",
        "habermas",
        "theory",
        "habermas",
        "set",
        "much",
        "store",
        "bühler",
        "model",
        "encompasses",
        "entire",
        "field",
        "linguistic",
        "meaning",
        "give",
        "equal",
        "weight",
        "priority",
        "three",
        "dimension",
        "intended",
        "speaker",
        "said",
        "content",
        "utterance",
        "done",
        "utterance",
        "three",
        "dimension",
        "present",
        "habermas",
        "considers",
        "original",
        "mode",
        "communication",
        "whereby",
        "speaker",
        "reach",
        "understanding",
        "another",
        "person",
        "h",
        "something",
        "b",
        "b",
        "chapter",
        "a",
        "triadic",
        "architectonic",
        "radiates",
        "aspect",
        "habermas",
        "theory",
        "thesis",
        "three",
        "validity",
        "claim",
        "truth",
        "rightness",
        "sincerity",
        "tcai",
        "speaker",
        "adopt",
        "three",
        "attitude",
        "objectivating",
        "normconformative",
        "expressive",
        "attitude",
        "tcai",
        "speaker",
        "utterance",
        "take",
        "relation",
        "three",
        "world",
        "objective",
        "world",
        "state",
        "affair",
        "social",
        "intersubjective",
        "world",
        "legitimate",
        "social",
        "order",
        "subjective",
        "internal",
        "world",
        "tcai",
        "finally",
        "three",
        "basic",
        "mode",
        "speech",
        "form",
        "basis",
        "classification",
        "speechacts",
        "constatives",
        "assertoric",
        "speechacts",
        "regulative",
        "speechacts",
        "imperative",
        "request",
        "expressive",
        "speechacts",
        "tcai",
        "triadic",
        "distinction",
        "nest",
        "extent",
        "argument",
        "theory",
        "communicative",
        "action",
        "triadic",
        "structure",
        "rest",
        "basic",
        "claim",
        "three",
        "equiprimordial",
        "meaningcritical",
        "validity",
        "claim",
        "every",
        "speechact",
        "simultaneously",
        "make",
        "claim",
        "truth",
        "rightness",
        "truthfulness",
        "mean",
        "speechact",
        "taken",
        "hearer",
        "assessed",
        "light",
        "propositional",
        "truth",
        "normative",
        "rightness",
        "sincerity",
        "expressed",
        "accepted",
        "mean",
        "agreement",
        "einverständnis",
        "reached",
        "simultaneously",
        "three",
        "level",
        "a",
        "defence",
        "view",
        "habermas",
        "argues",
        "speechact",
        "always",
        "rejected",
        "three",
        "perspective",
        "light",
        "assertibility",
        "condition",
        "normative",
        "justification",
        "sincerity",
        "speaker",
        "a",
        "b",
        "essay",
        "b",
        "b",
        "essay",
        "b",
        "a",
        "b",
        "however",
        "claim",
        "need",
        "defended",
        "assumed",
        "validity",
        "claim",
        "every",
        "speechact",
        "rejected",
        "three",
        "three",
        "perspective",
        "dorschel",
        "claim",
        "assertion",
        "utterance",
        "might",
        "rejected",
        "virtue",
        "volume",
        "style",
        "uttered",
        "dorschel",
        "final",
        "analysis",
        "argument",
        "utterance",
        "rejected",
        "three",
        "three",
        "perspective",
        "questionbegging",
        "triadic",
        "structure",
        "stemming",
        "bühler",
        "schema",
        "remains",
        "best",
        "thought",
        "hinge",
        "assumption",
        "second",
        "pillar",
        "speechact",
        "theory",
        "speechact",
        "theory",
        "construes",
        "speech",
        "action",
        "use",
        "austin",
        "phrase",
        "thing",
        "word",
        "well",
        "suited",
        "provide",
        "basis",
        "unified",
        "theory",
        "meaning",
        "action",
        "according",
        "theory",
        "speech",
        "propositional",
        "content",
        "p",
        "illocutionary",
        "force",
        "m",
        "meaning",
        "utterance",
        "mp",
        "ice",
        "thin",
        "can",
        "statement",
        "way",
        "world",
        "say",
        "depending",
        "context",
        "warning",
        "said",
        "habermas",
        "main",
        "focus",
        "illocutionary",
        "act",
        "aim",
        "contrast",
        "perlocutionary",
        "act",
        "contends",
        "always",
        "made",
        "manifest",
        "b",
        "b",
        "chapter",
        "speaker",
        "make",
        "declaration",
        "promise",
        "thereby",
        "signal",
        "hearer",
        "key",
        "habermas",
        "use",
        "term",
        "illocutionary",
        "identifies",
        "specifies",
        "putatively",
        "universal",
        "internal",
        "mechanism",
        "speaker",
        "realize",
        "various",
        "illocutionary",
        "aim",
        "make",
        "validity",
        "claim",
        "utterance",
        "order",
        "reach",
        "understanding",
        "verständigung",
        "einverständnis",
        "speaker",
        "making",
        "implicit",
        "guarantee",
        "necessary",
        "adduce",
        "good",
        "reason",
        "utterance",
        "hearer",
        "part",
        "always",
        "free",
        "respond",
        "yes",
        "a",
        "validity",
        "claim",
        "respond",
        "yes",
        "speaker",
        "hearer",
        "reach",
        "understanding",
        "agreement",
        "reaching",
        "understanding",
        "inherent",
        "telos",
        "human",
        "speech",
        "a",
        "third",
        "pillar",
        "formal",
        "semantics",
        "explain",
        "notion",
        "meaningcritical",
        "validity",
        "claim",
        "habermas",
        "enrols",
        "dummett",
        "verificationist",
        "critique",
        "truthconditional",
        "semantics",
        "epistemic",
        "turn",
        "formal",
        "semantics",
        "a",
        "b",
        "chapter",
        "dummett",
        "argues",
        "justification",
        "epistemic",
        "idea",
        "truth",
        "truthconditions",
        "many",
        "sentence",
        "unknowable",
        "even",
        "justification",
        "condition",
        "proposes",
        "view",
        "understand",
        "meaning",
        "sentence",
        "know",
        "condition",
        "assertible",
        "rather",
        "condition",
        "true",
        "dummett",
        "heath",
        "fultner",
        "a",
        "habermas",
        "take",
        "dummett",
        "thought",
        "extends",
        "natural",
        "language",
        "pragmatic",
        "meaning",
        "understanding",
        "call",
        "approach",
        "formal",
        "pragmatic",
        "rather",
        "formal",
        "semantics",
        "possible",
        "generalize",
        "dummett",
        "explanation",
        "understand",
        "speechact",
        "know",
        "kind",
        "reason",
        "speaker",
        "could",
        "provide",
        "claim",
        "validity",
        "utterancein",
        "short",
        "know",
        "make",
        "acceptable",
        "b",
        "b",
        "chapter",
        "heath",
        "point",
        "problematic",
        "semantic",
        "dimension",
        "motivation",
        "dummett",
        "idea",
        "know",
        "meaning",
        "sentence",
        "know",
        "condition",
        "assertible",
        "offer",
        "unified",
        "explanation",
        "compositional",
        "structure",
        "language",
        "namely",
        "one",
        "construct",
        "infinite",
        "number",
        "meaningful",
        "sentence",
        "finite",
        "number",
        "semantic",
        "unit",
        "rule",
        "composition",
        "turn",
        "explains",
        "understand",
        "meaning",
        "sentence",
        "never",
        "encountered",
        "may",
        "work",
        "assertion",
        "inapplicable",
        "pragmatic",
        "dimension",
        "meaning",
        "illocutionary",
        "force",
        "utterance",
        "lack",
        "compositional",
        "structure",
        "also",
        "unclear",
        "would",
        "work",
        "kind",
        "speechacts",
        "regulatives",
        "expressives",
        "strongly",
        "suggests",
        "heath",
        "argues",
        "may",
        "one",
        "validity",
        "claim",
        "meaningcritical",
        "internal",
        "sense",
        "constitutive",
        "meaning",
        "utterance",
        "namely",
        "validity",
        "claim",
        "truth",
        "assertion",
        "propositional",
        "component",
        "kind",
        "speechact",
        "heath",
        "potentially",
        "damaging",
        "habermas",
        "also",
        "another",
        "reason",
        "show",
        "understand",
        "utterance",
        "make",
        "rightness",
        "claim",
        "one",
        "need",
        "know",
        "utterance",
        "claim",
        "justified",
        "understanding",
        "utterance",
        "need",
        "involve",
        "accepting",
        "reason",
        "action",
        "recall",
        "habermas",
        "insists",
        "illocutionary",
        "aim",
        "speaker",
        "understood",
        "sense",
        "addressee",
        "recognize",
        "sense",
        "utterance",
        "agreed",
        "sense",
        "also",
        "accept",
        "relevant",
        "reason",
        "speaker",
        "could",
        "adduce",
        "support",
        "utterance",
        "case",
        "utterance",
        "make",
        "rightness",
        "claim",
        "reason",
        "act",
        "behave",
        "certain",
        "way",
        "habermas",
        "must",
        "establish",
        "latter",
        "whole",
        "theory",
        "depends",
        "claim",
        "normative",
        "commitment",
        "unavoidably",
        "generated",
        "speech",
        "reach",
        "subsequent",
        "action",
        "sequence",
        "a",
        "habermas",
        "later",
        "make",
        "move",
        "appears",
        "address",
        "problem",
        "without",
        "solving",
        "claim",
        "truth",
        "paradigmatic",
        "validity",
        "rightness",
        "merely",
        "analogous",
        "truth",
        "a",
        "a",
        "however",
        "say",
        "analogue",
        "explain",
        "basis",
        "analogy",
        "finlayson",
        "claim",
        "validity",
        "claim",
        "rightness",
        "analogous",
        "validity",
        "claim",
        "truth",
        "determine",
        "meaning",
        "utterance",
        "make",
        "play",
        "role",
        "core",
        "component",
        "theory",
        "meaning",
        "beg",
        "important",
        "question"
    ]
}