{
    "main_text": "The Life and the Man\n1. The Life and the Man\n\n\nRichard Mervyn Hare was born at Backwell Down, outside Bristol, on 21\nMarch 1919. He was to be known professionally as R.M.  Hare, and\npersonally as Dick Hare. His father, Charles Francis Aubone Hare, was\ndirector of a firm, John Hare & Co., making paint and floor-cloth;\nhis mother was Louise Kathleen Simonds, of a brewing and banking\nfamily. His parents died while he was still young. He was then cared\nfor chiefly by guardians and relatives on his mother’s side, being\nsent to school first at Copthorne in Sussex, and then, from 1932 to\n1937, as a classical scholar at Rugby. He was awarded a scholarship to\nBalliol College in 1937, where he read two years of Greats before the\noutbreak of war.\n\n\nDespite a largely classical education, Hare’s mind was already turning\ntowards moral philosophy. He ascribed this to two things, the need to\ndefine an attitude towards fighting, and a feeling of guilt at living\nin moderate comfort. He spent much time while still at Rugby working\nwith the unemployed, and finally decided not to be a pacifist, but to\njoin the OTC. When war broke out, he volunteered for service in the\nRoyal Artillery, and circumvented the results of a medical test in\norder to be permitted active service overseas. He was eventually put\non a ship for India in autumn 1940. He had a year training Punjabi\nsoldiers, and enjoying some adventures (twice finding his own way back\nthrough the jungle, once after losing his guns to the Japanese). He\nwas finally taken prisoner when Singapore fell in February 1942. He\nthen suffered a long march up the River Kwai to near the Three Pagodas\nPass, with a group of officers whose task was to work as coolies\nbuilding the railway from Siam into Burma. So he knew too well the\n“violent untiring labours” that Aristotle associates with\nvirtue in an ode to a dead friend that was dear to Hare’s heart. He\nwrites in his autobiography, “I prefer to pass over our\nsufferings during the eight months we were there” (2002: 283);\nhe rarely mentioned them (except when more fortunate critics of his\nviews rashly imputed to him the exemption from a wider experience of\nlife that can be the privilege of an Oxford fellowship). He was\neventually imprisoned with fellow officers in Singapore, whence he was\nreleased after exactly three and a half years when the War ended.\n\n\nAfter the war, Hare returned to Balliol to complete the four years of\nGreats. Even before he sat Finals, he was offered a lectureship at\nBalliol, which almost immediately became a fellowship. Hare always\nclaimed to have learnt a lot from his pupils, and his early years at\nBalliol granted him outstanding ones—four of whom, Bernard\nWilliams, David Pears, Richard Wollheim, and John Lucas, were to join\nhim both as professional philosophers, and as Fellows of the British\nAcademy. Lucas narrates how he and his contemporaries would plan a\nday’s campaigning, with a succession of tutees concerting, through the\nday, objections to some settled opinion of Hare’s, and replies to his\nreplies—with Williams sent in last to deliver the coup de\ngrâce that was never, in the event, fatal. No one who never\nexperienced Hare’s impromptu fielding of objections can really\nunderstand the resilience of even his less plausible convictions. And\nyet, despite some impressions, he was quite capable of admitting the\nforce of fair counter-arguments. He had a faith that apparent\ndisagreements can usually be resolved once confusions are removed\n(whence the over-sanguine title of his last book, Sorting Out\nEthics, 1997a). This went with a presumption that objections to\nhis views rested on confusion, one that could lead to a degree of\nasperity. He recognized that the brusquely economical format of his\n“Comments” within Hare and Critics (which he\nseriously wanted to be titled, after a pub-name familiar in England,\n“Hare and Hounds”) might be taken amiss (1988a: 201):\nIn case anybody thinks that I have been discourteous to\nmy critics in writing notes instead of essays, I must point out that\nthis is what we commonly do to Plato and Aristotle (as in the\nClarendon series of commentaries), taking their arguments one by one\nand treating them briskly but seriously.\n\n\nThere could be a complaint that Hare was most interested in his own\nideas. John Lucas had from Tom Braun a Balliol rhyme (of which he\ncites a variant version in Lucas 2002: 31) dating from soon after the\npublication of The Language of Morals (1952):\n\n\nMy pupils I have always taught You cannot get an “is”\nfrom “ought”.  This is the burden of my song:\n“It’s in my book, or else it’s wrong.”\n\n\n\n\nIt is true that Hare was most appreciative of points helpful to his\nown reconsiderations; he could then be depended upon to be\nover-generous. He always disparaged his own scholarship, though from a\ndemanding point of view. (Few writers of long books on Plato can have\nfirst re-read the whole of Plato in Greek, as Hare did before writing\nhis very short one, 1982.) Yet his interests were wider in range than\nhis publications, and extended through Frege, Chomsky, Davidson, and a\nfair range of contemporary philosophy of mind and language. Though he\nwas keen to claim ancestry (in a late encyclopedia article he counts\nSocrates and Aristotle as, in part, the first prescriptivists; 1998:\n20), his love of philosophy did not reduce at all to a love of his own\nphilosophy.\n\n\nHis most amiable aspects were apparent to the undergraduates (by\npreference) whom, from early on, he invited to one of his\nreading-parties, first at Plas Rhoscolyn in Anglesey, and later also\nat Saffron House in Ewelme, beneath the Chilterns. It was there above\nall that he vividly communicated a sense of how worthwhile and\nenjoyable it is not just to read but to do philosophy. He was\nthus, however exacting his standards, a most positive figure as a\nmentor, giving of himself in discussion in a manner that could be\nopinionated but was also self-forgetful. He was a Puritan of the\ntraditional kind who shared Dr Johnson’s approval of “harmless\npleasures”. He was concerned about the case against eating meat;\nbut his eventual virtual vegetarianism was rather caused, he said, by\ngardening than by argument. Some of his dislikes were distinctive: the\nmusic of Beethoven (which he came to find superficial), wearing socks\n(which he ascribed to commercialism), drinking coffee (which he said\naffected his temper), travelling by train (which caused him anxiety),\ngiving and receiving presents (when the recipient best knows what he\nwants). Ved Mehta (1962) recalls his working, for freedom from\ninterruption, in a caravan on the front lawn of his house in\nOxford. He had the courage, though not the extravagance, to be an\neccentric.\n\n\nIt was initially at reading parties that his pupils encountered a part\nof his life equally important to him as philosophy, his wife and\nchildren. What he describes as “a night of mostly bad\ndreams”, starting with his mother’s death in 1935, ended with\nhis marriage in 1947 to Catherine Verney, which he calls “the\nbest thing I ever did, and a source of lasting happiness” (2002:\n272 & 292). They shared a love of traditional Anglicanism (though\nher beliefs were more orthodox than his), and of music (especially\nchoral and a cappella). A Hare reading party at Ewelme was\nalways in part a music camp, with (for all those able to join in) a\npiano to play and madrigals to sing.  Everything equally involved\ntheir four children, John (who has published about his father, 2007:\n184–248), and three daughters.  Without them, he would have felt\nincomplete even as a moral philosopher; for Aristotle’s question\n“What sort of person should I be?” gave way, for him, to\nthe question “What sort of person should I bring up my children\nto be?”\n\n\nHare remained a tutor at Balliol for twenty years, and always felt\nattached to that institution above all others (whence the bequest of\nhis Nachlass). It was still during his time there, in 1964,\nthat he was elected a Fellow of the British Academy. However,\nineluctable promotion eventually removed him, in 1966, to the White’s\nChair of Moral Philosophy at Corpus Christi. There he took on a\nresponsibility for the supervision of research students.  (Balliol and\nCorpus Greats pupils still had the benefit of his reading parties,\nwhich for a time, while John was at Balliol, became biennial.)  He\nalso took his turn as chairman of the Philosophy Panel, which admits\nand oversees graduates, and chairman of the Faculty Board.\nAdministration, it may be said, was a task with which he coped\nadmirably, but, also admirably, refused to identify.\n\n\nHe recalls that most of his cousins on his mother’s side were\nAmericans; and two of his children emigrated to America and married\nAmericans. Like all distinguished Oxford philosophers, he received\nmany invitations there (of which the most welcome was to the Center\nfor Advanced Study in the Behavioral Sciences at Stanford, where he\nwrote both Moral Thinking, 1981, and his little\nbook Plato, 1982). All this made less improbable his early\nretirement from Oxford in 1983, and his appointment as Graduate\nResearch Professor of Philosophy at the University of Florida at\nGainesville. One desire was to escape from faculty politics at\nOxford. A contributing factor was the publication of Moral\nThinking, which left him immediately, he confessed, nothing new\nto say in his staple lectures.  Yet his main motive was the prospect\nof helping to set up a Center for Applied Philosophy.\n\n\nThe very phrase “applied ethics”, now so familiar (and\nyet, one may think, tendentious), presupposes a tradition of ethical\ntheories, such as his, that invite practical applications. In fact, he\npublished his first paper in practical ethics, titled “Ethics\nand Politics”, in the Listener (1955). (Part of it is\ncollected, under the title “Can I be Blamed for Obeying\nOrders?”, in Hare 1972a; there it is followed by three papers\noriginally published in the 1950s, and more from the 1960s.) Better\nknown is the last chapter of Freedom and Reason (1963), which\naddressed the issue, then (it seemed) wholly recalcitrant, of\napartheid. And much else followed, with a stream of papers, and\nmemberships of various advisory bodies (Hare 2002: 294–5). He\nwas engaged especially by urban planning, where he favored radial over\nring roads, and biomedical ethics, in which he labored to be logical\nand not just bien pensant. When a Society for Applied\nPhilosophy was formed, he became its first President. So he looked\nforward to a profitable refocusing of his energies; and this, to an\nextent, occurred, even when the Center partly disappointed. As he\nnotes, three out of four volumes of essays published between 1989 and\n1993 fall within practical ethics (Hare 1989b, 1992a, 1993a).\n\n\nHis time in Gainesville was disturbed by the first, and slightest, of\nhis strokes. When he fully returned with Catherine to Ewelme in 1994,\nfurther attacks cheated him of his hopes of continuing to combat\n“the usual misunderstandings” (2002: 304–5). He gave\nhis last paper, appropriately, to an undergraduate audience at King’s\nCollege London. He was still able to put together Sorting Out\nEthics (1997a), deriving from the Axel Hägerström Lectures that\nhe had given at Uppsala University in 1991 (when he also received an\nhonorary doctorate—his first doctorate—from the University\nof Lund). His eightieth birthday was marked by the publication of a\nfinal collection of papers, Objective Prescriptions and other\nessays (1999). He died suddenly but peacefully on 29 January\n2002.\n",
    "section_title": "1. The Life and the Man",
    "entry_title": "Richard Mervyn Hare",
    "hierarchy_title": "Richard Mervyn Hare || The Life and the Man",
    "tokenized_text": [
        "life",
        "man",
        "life",
        "man",
        "richard",
        "mervyn",
        "hare",
        "born",
        "backwell",
        "outside",
        "bristol",
        "march",
        "known",
        "professionally",
        "rm",
        "hare",
        "personally",
        "dick",
        "hare",
        "father",
        "charles",
        "francis",
        "aubone",
        "hare",
        "director",
        "firm",
        "john",
        "hare",
        "co",
        "making",
        "paint",
        "floorcloth",
        "mother",
        "louise",
        "kathleen",
        "simonds",
        "brewing",
        "banking",
        "family",
        "parent",
        "died",
        "still",
        "young",
        "cared",
        "chiefly",
        "guardian",
        "relative",
        "mother",
        "side",
        "sent",
        "school",
        "first",
        "copthorne",
        "sussex",
        "classical",
        "scholar",
        "rugby",
        "awarded",
        "scholarship",
        "balliol",
        "college",
        "read",
        "two",
        "year",
        "great",
        "outbreak",
        "war",
        "despite",
        "largely",
        "classical",
        "education",
        "hare",
        "mind",
        "already",
        "turning",
        "towards",
        "moral",
        "philosophy",
        "ascribed",
        "two",
        "thing",
        "need",
        "define",
        "attitude",
        "towards",
        "fighting",
        "feeling",
        "guilt",
        "living",
        "moderate",
        "comfort",
        "spent",
        "much",
        "time",
        "still",
        "rugby",
        "working",
        "unemployed",
        "finally",
        "decided",
        "pacifist",
        "join",
        "otc",
        "war",
        "broke",
        "volunteered",
        "service",
        "royal",
        "artillery",
        "circumvented",
        "result",
        "medical",
        "test",
        "order",
        "permitted",
        "active",
        "service",
        "overseas",
        "eventually",
        "put",
        "ship",
        "india",
        "autumn",
        "year",
        "training",
        "punjabi",
        "soldier",
        "enjoying",
        "adventure",
        "twice",
        "finding",
        "way",
        "back",
        "jungle",
        "losing",
        "gun",
        "japanese",
        "finally",
        "taken",
        "prisoner",
        "singapore",
        "fell",
        "february",
        "suffered",
        "long",
        "march",
        "river",
        "kwai",
        "near",
        "three",
        "pagoda",
        "pas",
        "group",
        "officer",
        "whose",
        "task",
        "work",
        "cooly",
        "building",
        "railway",
        "siam",
        "burma",
        "knew",
        "well",
        "violent",
        "untiring",
        "labour",
        "aristotle",
        "associate",
        "virtue",
        "ode",
        "dead",
        "friend",
        "dear",
        "hare",
        "heart",
        "writes",
        "autobiography",
        "prefer",
        "pas",
        "suffering",
        "eight",
        "month",
        "rarely",
        "mentioned",
        "except",
        "fortunate",
        "critic",
        "view",
        "rashly",
        "imputed",
        "exemption",
        "wider",
        "experience",
        "life",
        "privilege",
        "oxford",
        "fellowship",
        "eventually",
        "imprisoned",
        "fellow",
        "officer",
        "singapore",
        "whence",
        "released",
        "exactly",
        "three",
        "half",
        "year",
        "war",
        "ended",
        "war",
        "hare",
        "returned",
        "balliol",
        "complete",
        "four",
        "year",
        "great",
        "even",
        "sat",
        "final",
        "offered",
        "lectureship",
        "balliol",
        "almost",
        "immediately",
        "became",
        "fellowship",
        "hare",
        "always",
        "claimed",
        "learnt",
        "lot",
        "pupil",
        "early",
        "year",
        "balliol",
        "granted",
        "outstanding",
        "onesfour",
        "bernard",
        "williams",
        "david",
        "pear",
        "richard",
        "wollheim",
        "john",
        "lucas",
        "join",
        "professional",
        "philosopher",
        "fellow",
        "british",
        "academy",
        "lucas",
        "narrates",
        "contemporary",
        "would",
        "plan",
        "day",
        "campaigning",
        "succession",
        "tutee",
        "concerting",
        "day",
        "objection",
        "settled",
        "opinion",
        "hare",
        "reply",
        "replieswith",
        "williams",
        "sent",
        "last",
        "deliver",
        "coup",
        "de",
        "grâce",
        "never",
        "event",
        "fatal",
        "one",
        "never",
        "experienced",
        "hare",
        "impromptu",
        "fielding",
        "objection",
        "really",
        "understand",
        "resilience",
        "even",
        "le",
        "plausible",
        "conviction",
        "yet",
        "despite",
        "impression",
        "quite",
        "capable",
        "admitting",
        "force",
        "fair",
        "counterarguments",
        "faith",
        "apparent",
        "disagreement",
        "usually",
        "resolved",
        "confusion",
        "removed",
        "whence",
        "oversanguine",
        "title",
        "last",
        "book",
        "sorting",
        "ethic",
        "a",
        "went",
        "presumption",
        "objection",
        "view",
        "rested",
        "confusion",
        "one",
        "could",
        "lead",
        "degree",
        "asperity",
        "recognized",
        "brusquely",
        "economical",
        "format",
        "comment",
        "within",
        "hare",
        "critic",
        "seriously",
        "wanted",
        "titled",
        "pubname",
        "familiar",
        "england",
        "hare",
        "hound",
        "might",
        "taken",
        "amiss",
        "a",
        "case",
        "anybody",
        "think",
        "discourteous",
        "critic",
        "writing",
        "note",
        "instead",
        "essay",
        "must",
        "point",
        "commonly",
        "plato",
        "aristotle",
        "clarendon",
        "series",
        "commentary",
        "taking",
        "argument",
        "one",
        "one",
        "treating",
        "briskly",
        "seriously",
        "could",
        "complaint",
        "hare",
        "interested",
        "idea",
        "john",
        "lucas",
        "tom",
        "braun",
        "balliol",
        "rhyme",
        "cite",
        "variant",
        "version",
        "lucas",
        "dating",
        "soon",
        "publication",
        "language",
        "moral",
        "pupil",
        "always",
        "taught",
        "get",
        "ought",
        "burden",
        "song",
        "book",
        "else",
        "wrong",
        "true",
        "hare",
        "appreciative",
        "point",
        "helpful",
        "reconsideration",
        "could",
        "depended",
        "upon",
        "overgenerous",
        "always",
        "disparaged",
        "scholarship",
        "though",
        "demanding",
        "point",
        "view",
        "writer",
        "long",
        "book",
        "plato",
        "first",
        "reread",
        "whole",
        "plato",
        "greek",
        "hare",
        "writing",
        "short",
        "one",
        "yet",
        "interest",
        "wider",
        "range",
        "publication",
        "extended",
        "frege",
        "chomsky",
        "davidson",
        "fair",
        "range",
        "contemporary",
        "philosophy",
        "mind",
        "language",
        "though",
        "keen",
        "claim",
        "ancestry",
        "late",
        "encyclopedia",
        "article",
        "count",
        "socrates",
        "aristotle",
        "part",
        "first",
        "prescriptivists",
        "love",
        "philosophy",
        "reduce",
        "love",
        "philosophy",
        "amiable",
        "aspect",
        "apparent",
        "undergraduate",
        "preference",
        "early",
        "invited",
        "one",
        "readingparties",
        "first",
        "plas",
        "rhoscolyn",
        "anglesey",
        "later",
        "also",
        "saffron",
        "house",
        "ewelme",
        "beneath",
        "chilterns",
        "vividly",
        "communicated",
        "sense",
        "worthwhile",
        "enjoyable",
        "read",
        "philosophy",
        "thus",
        "however",
        "exacting",
        "standard",
        "positive",
        "figure",
        "mentor",
        "giving",
        "discussion",
        "manner",
        "could",
        "opinionated",
        "also",
        "selfforgetful",
        "puritan",
        "traditional",
        "kind",
        "shared",
        "dr",
        "johnson",
        "approval",
        "harmless",
        "pleasure",
        "concerned",
        "case",
        "eating",
        "meat",
        "eventual",
        "virtual",
        "vegetarianism",
        "rather",
        "caused",
        "said",
        "gardening",
        "argument",
        "dislike",
        "distinctive",
        "music",
        "beethoven",
        "came",
        "find",
        "superficial",
        "wearing",
        "sock",
        "ascribed",
        "commercialism",
        "drinking",
        "coffee",
        "said",
        "affected",
        "temper",
        "travelling",
        "train",
        "caused",
        "anxiety",
        "giving",
        "receiving",
        "present",
        "recipient",
        "best",
        "know",
        "want",
        "ved",
        "mehta",
        "recall",
        "working",
        "freedom",
        "interruption",
        "caravan",
        "front",
        "lawn",
        "house",
        "oxford",
        "courage",
        "though",
        "extravagance",
        "eccentric",
        "initially",
        "reading",
        "party",
        "pupil",
        "encountered",
        "part",
        "life",
        "equally",
        "important",
        "philosophy",
        "wife",
        "child",
        "describes",
        "night",
        "mostly",
        "bad",
        "dream",
        "starting",
        "mother",
        "death",
        "ended",
        "marriage",
        "catherine",
        "verney",
        "call",
        "best",
        "thing",
        "ever",
        "source",
        "lasting",
        "happiness",
        "shared",
        "love",
        "traditional",
        "anglicanism",
        "though",
        "belief",
        "orthodox",
        "music",
        "especially",
        "choral",
        "cappella",
        "hare",
        "reading",
        "party",
        "ewelme",
        "always",
        "part",
        "music",
        "camp",
        "able",
        "join",
        "piano",
        "play",
        "madrigal",
        "sing",
        "everything",
        "equally",
        "involved",
        "four",
        "child",
        "john",
        "published",
        "father",
        "three",
        "daughter",
        "without",
        "would",
        "felt",
        "incomplete",
        "even",
        "moral",
        "philosopher",
        "aristotle",
        "question",
        "sort",
        "person",
        "gave",
        "way",
        "question",
        "sort",
        "person",
        "bring",
        "child",
        "hare",
        "remained",
        "tutor",
        "balliol",
        "twenty",
        "year",
        "always",
        "felt",
        "attached",
        "institution",
        "others",
        "whence",
        "bequest",
        "nachlass",
        "still",
        "time",
        "elected",
        "fellow",
        "british",
        "academy",
        "however",
        "ineluctable",
        "promotion",
        "eventually",
        "removed",
        "white",
        "chair",
        "moral",
        "philosophy",
        "corpus",
        "christi",
        "took",
        "responsibility",
        "supervision",
        "research",
        "student",
        "balliol",
        "corpus",
        "great",
        "pupil",
        "still",
        "benefit",
        "reading",
        "party",
        "time",
        "john",
        "balliol",
        "became",
        "biennial",
        "also",
        "took",
        "turn",
        "chairman",
        "philosophy",
        "panel",
        "admits",
        "oversees",
        "graduate",
        "chairman",
        "faculty",
        "board",
        "administration",
        "may",
        "said",
        "task",
        "coped",
        "admirably",
        "also",
        "admirably",
        "refused",
        "identify",
        "recall",
        "cousin",
        "mother",
        "side",
        "american",
        "two",
        "child",
        "emigrated",
        "america",
        "married",
        "american",
        "like",
        "distinguished",
        "oxford",
        "philosopher",
        "received",
        "many",
        "invitation",
        "welcome",
        "center",
        "advanced",
        "study",
        "behavioral",
        "science",
        "stanford",
        "wrote",
        "moral",
        "thinking",
        "little",
        "book",
        "plato",
        "made",
        "le",
        "improbable",
        "early",
        "retirement",
        "oxford",
        "appointment",
        "graduate",
        "research",
        "professor",
        "philosophy",
        "university",
        "florida",
        "gainesville",
        "one",
        "desire",
        "escape",
        "faculty",
        "politics",
        "oxford",
        "contributing",
        "factor",
        "publication",
        "moral",
        "thinking",
        "left",
        "immediately",
        "confessed",
        "nothing",
        "new",
        "say",
        "staple",
        "lecture",
        "yet",
        "main",
        "motive",
        "prospect",
        "helping",
        "set",
        "center",
        "applied",
        "philosophy",
        "phrase",
        "applied",
        "ethic",
        "familiar",
        "yet",
        "one",
        "may",
        "think",
        "tendentious",
        "presupposes",
        "tradition",
        "ethical",
        "theory",
        "invite",
        "practical",
        "application",
        "fact",
        "published",
        "first",
        "paper",
        "practical",
        "ethic",
        "titled",
        "ethic",
        "politics",
        "listener",
        "part",
        "collected",
        "title",
        "blamed",
        "obeying",
        "order",
        "hare",
        "a",
        "followed",
        "three",
        "paper",
        "originally",
        "published",
        "s",
        "s",
        "better",
        "known",
        "last",
        "chapter",
        "freedom",
        "reason",
        "addressed",
        "issue",
        "seemed",
        "wholly",
        "recalcitrant",
        "apartheid",
        "much",
        "else",
        "followed",
        "stream",
        "paper",
        "membership",
        "various",
        "advisory",
        "body",
        "hare",
        "engaged",
        "especially",
        "urban",
        "planning",
        "favored",
        "radial",
        "ring",
        "road",
        "biomedical",
        "ethic",
        "labored",
        "logical",
        "bien",
        "pensant",
        "society",
        "applied",
        "philosophy",
        "formed",
        "became",
        "first",
        "president",
        "looked",
        "forward",
        "profitable",
        "refocusing",
        "energy",
        "extent",
        "occurred",
        "even",
        "center",
        "partly",
        "disappointed",
        "note",
        "three",
        "four",
        "volume",
        "essay",
        "published",
        "fall",
        "within",
        "practical",
        "ethic",
        "hare",
        "b",
        "a",
        "a",
        "time",
        "gainesville",
        "disturbed",
        "first",
        "slightest",
        "stroke",
        "fully",
        "returned",
        "catherine",
        "ewelme",
        "attack",
        "cheated",
        "hope",
        "continuing",
        "combat",
        "usual",
        "misunderstanding",
        "gave",
        "last",
        "paper",
        "appropriately",
        "undergraduate",
        "audience",
        "king",
        "college",
        "london",
        "still",
        "able",
        "put",
        "together",
        "sorting",
        "ethic",
        "a",
        "deriving",
        "axel",
        "hägerström",
        "lecture",
        "given",
        "uppsala",
        "university",
        "also",
        "received",
        "honorary",
        "doctoratehis",
        "first",
        "doctoratefrom",
        "university",
        "lund",
        "eightieth",
        "birthday",
        "marked",
        "publication",
        "final",
        "collection",
        "paper",
        "objective",
        "prescription",
        "essay",
        "died",
        "suddenly",
        "peacefully",
        "january"
    ]
}