{
    "main_text": "Decisions of Principle\n4. Decisions of Principle\n\n\nThe two features of prescriptivity and universalizability remained the\ntwin pillars of Hare’s theory ever afterwards. The term\n“universalisability” was to become the title of a slightly\nlater paper (1954/5) which also sorted out a confusion that causes\nreal trouble in Aristotle and\nKant. “General” terms (such as “man”\nor “Greek”) contrast with “singular” ones\n(such as “Socrates”). However, in the case\nof maxims, one needs to keep two distinctions apart: a maxim\nmay be “universal”, rather than “singular” or\n(ambiguously) “particular”, in referring to no individuals\n(unless within the scope of a preposition such as “like”\nwhich converts the name of an individual into the vague specification\nof a kind); a maxim may also be “general”, rather than\n“specific”, in identifying a wide class of agent\nor act—a difference that is one of degree (so that the universal\nrule “Always give true evidence” is more specific than\n“Always tell the truth”, and more general than\n“Always give true evidence on oath”). Any discussion of\nthe practicality and acceptability of “general principles”\nneeds to keep these distinctions apart. Hare’s clarity on the matter\nis his most important non-disputable contribution to philosophy.\n\n\nIn his essay “Practical Reason” (1950), he had already\nargued that many decisions are decisions of principle not in deriving\nfrom a principle, but in establishing one. As he remarked there, \nIt is not easier, but more difficult, to decide to\naccept a very general command like “Never tell lies” than\nit is to decide not to tell this particular lie … If we cannot\ndecide even whether to tell this lie, we cannot, a fortiori,\ndecide whether to tell lies in innumerable circumstances whose details\nare totally unknown to us.\n What, then, is to guide decision? In the second part of his essay,\nhe attempted to find a secure basis for moral reasoning in such\nconcepts as “friend”; but he discarded that approach\nbefore trying it out in print. His paper\n“Universalisability” (1954/5) stressed one’s personal\nresponsibility in making decisions that are also decisions of\nprinciple. The next important development came in a second\nbook, Freedom and Reason (1963), in which the formal features\nof prescriptivity and universalizability generate a “Golden\nRule” form of argument (as stated in Luke 6:31 (KJV), this ran,\n“And as ye would that men should do to you, do ye also to them\nlikewise”). Hare offers a simple scenario (1963: 90–1):\nsuppose that A owes money to B, who owes money\nto C, and that the law allows creditors to exact their debts by\nputting their debtors into prison. If B simply decides “I\nwill put A into prison”, there may be nothing to say to\nhim. But can he say “I ought to put A into prison”?\nIf he does, he commits himself to a principle such as “If this\nis the only way to exact the debt, the creditor should imprison the\ndebtor”. B is unlikely to be willing to prescribe a\nlikely implication of this, “Let C put me into\nprison”, since that would frustrate his own interests. Hare\nargues that the form of argument retains its force even if, in\nfact, B is not himself a debtor; for the judgment “I\nought to put A into prison”, and the principle that it\ninvokes, will still entail conditionals, such as “Let me be put\ninto prison if I am ever in A’s situation”, to\nwhich B is unlikely to be able honestly to subscribe.\n\n\nIn Freedom and Reason, Hare allows the argument to be evaded\nby the “fanatic” who is so committed to some impersonal\nideal (say that debtors deserve a hard time) that he is willing to\ndisregard his own personal interests (including the interests that he\nhas himself as a debtor, or would have if he were a debtor). A later\ntightening of the argument (first set out fully in 1972c), hoped to\nclose off this possibility. In their practical force, ideals are\nequivalent to universal preferences that differ from personal\npreferences in their content, but owe their moral weight to the\nprevalence and intensity of whatever preferences their realization\nwould satisfy. That B would really rather go to prison himself\nthan have debtors be treated leniently is possible, but improbable. A\nmore likely fanatic is guilty of a kind of imprudence in failing to\ngive due weight to his own interests, actual or counter-factual. The\nemergent ethical theory is a distinctive variety of utilitarianism,\none that identifies the moral good with the maximization not of some\nsubjective state such as happiness, but of the satisfaction of\npreferences.\n\n\nThe argument excited almost as much skepticism as attention. It seemed\nimplausible that the very activity of prescribing universally should\ncommit a speaker to a substantive ethical position, let alone one so\ndistinctive. However, the logic of Hare’s position became perspicuous\nin his third book, Moral Thinking: Its Levels, Method, and\nPoint (1981). It is there set out as follows. In wondering\nwhether he should assent to the statement “A ought\nto φ”, the speaker has to reflect whether he can\nprescribe that everyone should act in the same way, whatever his own\nsituation.  “I” connotes no essence (e.g., human): each of\nus might be anything, and so has, when prescribing for all\nsituations, actual or possible, to be concerned on behalf\nof everybody. There is further a prescriptive aspect to the\nmeaning of “I”: to take a role to be possibly one’s\nown, and to prescribe for that possible situation, is to give\nweight to the preferences of the occupant of that role as if they were\nactually one’s own. Hence, the speaker can rationally assent to a\nparticular “ought”-statement only if it is derivable from\nsome universal principle that he will accept if he gives impartial and\npositive weight to all preferences whose satisfaction would be\naffected by its observance. Thus moral reflection generates a\nuniversalized prudence. Moral ideals register within this framework\nsimply as universal preferences; to allow one’s own ideals to override\nmore intense or prevalent desires or ideals of others is a kind of\negoism, and so excluded. Human decision remains free, however rational\nand informed, because anyone can avoid the constraints of morality by\ndeclining to moralize; for this reason, it remains true that no\n“is” entails an “ought”.\n\n\nThis is an extraordinary, and extraordinarily bold, intellectual\nconstruction, which invites debate at many points. Zeno Vendler (1988:\n181) urged that we keep apart the semantic thesis (which may be true\nor nearly true) that “I” is a pure indexical, from any\nmetaphysical claim (which may baffle us) that it denotes a pure\nsubject which can take on any state or role. In his reply,\nHare clearly shies away from adopting a metaphysical position stranger\nthan Vendler’s own (which rejects Cartesian egos but does admit a\ntranscendental ego). Yet he still supposes it to be true that “I\nmight be Napoleon”, and that “the world in which I was\nNapoleon would be a different world than this, though not in its\nuniversal properties” (1988a: 285). He even supposes that I can\nconsider situations in which I am a stove, a mountain, or a\ntree—although, since I cannot care what happens to me if I\nbecome such a thing, the consideration is\nidle (1988a:\n283). Hare seems here to have entered rather unexpected territory. It\nwould have suited his usual common sense to permit me to imagine\nnot that I am Napoleon, but being Napoleon, i.e.,\nwhat it was like to be Napoleon; and that can suffice to incline one\nto ambivalence about the outcome of Waterloo. But he requires there to\nbe a possible situation in which I am, at any rate,\nrelevantly just like Napoleon if he is to maintain that\nprescribing, say, “All men like Napoleon should receive their\ncome-uppance” applies even to oneself, and so may be\nimprudent.\n\n\nA danger remained of deriving a kind of imperative from an\nindicative. No doubt Napoleon very much wanted to win the battle. Does\nawareness of that fact commit me to prescribing, on the\ncounter-factual supposition that I am Napoleon, that Napoleon be\nvictorious? Here Hare makes further use of his thesis that the meaning\nof “I” is partly prescriptive: to hypothesize “if I\nwere Napoleon” is already to “identify with his\nprescriptions”, in the sense of prescribing that, other things\nbeing equal, they be satisfied within the scope of the hypothesis\n(1981: 96–9). \n\n\nThe solution is equally elegant and audacious. It may confirm doubts\nwhether the situation of my being Napoleon is a situation at\nall. (For if it were a possible situation, of the\nsame kind as an actual situation, how could I\nbe logically—as opposed to humanly—constrained in\nwhat attitude I adopted towards it?) It also throws open questions\nabout what identifying with Napoleon’s prescriptions comes to. One\nmight think that, if “I” is fully prescriptive, I\ncannot prescribe that Napoleon be defeated in the situation in which I\nam Napoleon, since that is certainly not what he wanted or would ever\nhave wanted; if so, I cannot honestly prescribe that all men like\nNapoleon be defeated, since, for one case (that in which I am\nNapoleon), I do not want that. What Hare requires is a weaker\nidentification: given that I am moralizing, and hence prescribing for\nall situations of a given general kind, I must give some\nweight to the preferences that are mine in the situation in which I am\nNapoleon, but not more weight than that which I give to the preferences\nthat are mine in any of the other situations; hence, in deciding what\nto prescribe universally, I must weigh all relevant preferences\nequally (relative to their prevalence and intensity). This is exactly\nwhere Hare intends to lead us; but he invites the question how he can\nprove that one is taken that way by the logic of\n“ought” and “I”.\n",
    "section_title": "4. Decisions of Principle",
    "entry_title": "Richard Mervyn Hare",
    "hierarchy_title": "Richard Mervyn Hare || Decisions of Principle",
    "tokenized_text": [
        "decision",
        "principle",
        "decision",
        "principle",
        "two",
        "feature",
        "prescriptivity",
        "universalizability",
        "remained",
        "twin",
        "pillar",
        "hare",
        "theory",
        "ever",
        "afterwards",
        "term",
        "universalisability",
        "become",
        "title",
        "slightly",
        "later",
        "paper",
        "also",
        "sorted",
        "confusion",
        "cause",
        "real",
        "trouble",
        "aristotle",
        "kant",
        "general",
        "term",
        "man",
        "greek",
        "contrast",
        "singular",
        "one",
        "socrates",
        "however",
        "case",
        "maxim",
        "one",
        "need",
        "keep",
        "two",
        "distinction",
        "apart",
        "maxim",
        "may",
        "universal",
        "rather",
        "singular",
        "ambiguously",
        "particular",
        "referring",
        "individual",
        "unless",
        "within",
        "scope",
        "preposition",
        "like",
        "convert",
        "name",
        "individual",
        "vague",
        "specification",
        "kind",
        "maxim",
        "may",
        "also",
        "general",
        "rather",
        "specific",
        "identifying",
        "wide",
        "class",
        "agent",
        "acta",
        "difference",
        "one",
        "degree",
        "universal",
        "rule",
        "always",
        "give",
        "true",
        "evidence",
        "specific",
        "always",
        "tell",
        "truth",
        "general",
        "always",
        "give",
        "true",
        "evidence",
        "oath",
        "discussion",
        "practicality",
        "acceptability",
        "general",
        "principle",
        "need",
        "keep",
        "distinction",
        "apart",
        "hare",
        "clarity",
        "matter",
        "important",
        "nondisputable",
        "contribution",
        "philosophy",
        "essay",
        "practical",
        "reason",
        "already",
        "argued",
        "many",
        "decision",
        "decision",
        "principle",
        "deriving",
        "principle",
        "establishing",
        "one",
        "remarked",
        "easier",
        "difficult",
        "decide",
        "accept",
        "general",
        "command",
        "like",
        "never",
        "tell",
        "lie",
        "decide",
        "tell",
        "particular",
        "lie",
        "decide",
        "even",
        "whether",
        "tell",
        "lie",
        "fortiori",
        "decide",
        "whether",
        "tell",
        "lie",
        "innumerable",
        "circumstance",
        "whose",
        "detail",
        "totally",
        "unknown",
        "u",
        "guide",
        "decision",
        "second",
        "part",
        "essay",
        "attempted",
        "find",
        "secure",
        "basis",
        "moral",
        "reasoning",
        "concept",
        "friend",
        "discarded",
        "approach",
        "trying",
        "print",
        "paper",
        "universalisability",
        "stressed",
        "one",
        "personal",
        "responsibility",
        "making",
        "decision",
        "also",
        "decision",
        "principle",
        "next",
        "important",
        "development",
        "came",
        "second",
        "book",
        "freedom",
        "reason",
        "formal",
        "feature",
        "prescriptivity",
        "universalizability",
        "generate",
        "golden",
        "rule",
        "form",
        "argument",
        "stated",
        "luke",
        "kjv",
        "ran",
        "ye",
        "would",
        "men",
        "ye",
        "also",
        "likewise",
        "hare",
        "offer",
        "simple",
        "scenario",
        "suppose",
        "owes",
        "money",
        "b",
        "owes",
        "money",
        "c",
        "law",
        "allows",
        "creditor",
        "exact",
        "debt",
        "putting",
        "debtor",
        "prison",
        "b",
        "simply",
        "decides",
        "put",
        "prison",
        "may",
        "nothing",
        "say",
        "say",
        "ought",
        "put",
        "prison",
        "commits",
        "principle",
        "way",
        "exact",
        "debt",
        "creditor",
        "imprison",
        "debtor",
        "b",
        "unlikely",
        "willing",
        "prescribe",
        "likely",
        "implication",
        "let",
        "c",
        "put",
        "prison",
        "since",
        "would",
        "frustrate",
        "interest",
        "hare",
        "argues",
        "form",
        "argument",
        "retains",
        "force",
        "even",
        "fact",
        "b",
        "debtor",
        "judgment",
        "ought",
        "put",
        "prison",
        "principle",
        "invokes",
        "still",
        "entail",
        "conditionals",
        "let",
        "put",
        "prison",
        "ever",
        "situation",
        "b",
        "unlikely",
        "able",
        "honestly",
        "subscribe",
        "freedom",
        "reason",
        "hare",
        "allows",
        "argument",
        "evaded",
        "fanatic",
        "committed",
        "impersonal",
        "ideal",
        "say",
        "debtor",
        "deserve",
        "hard",
        "time",
        "willing",
        "disregard",
        "personal",
        "interest",
        "including",
        "interest",
        "debtor",
        "would",
        "debtor",
        "later",
        "tightening",
        "argument",
        "first",
        "set",
        "fully",
        "c",
        "hoped",
        "close",
        "possibility",
        "practical",
        "force",
        "ideal",
        "equivalent",
        "universal",
        "preference",
        "differ",
        "personal",
        "preference",
        "content",
        "owe",
        "moral",
        "weight",
        "prevalence",
        "intensity",
        "whatever",
        "preference",
        "realization",
        "would",
        "satisfy",
        "b",
        "would",
        "really",
        "rather",
        "go",
        "prison",
        "debtor",
        "treated",
        "leniently",
        "possible",
        "improbable",
        "likely",
        "fanatic",
        "guilty",
        "kind",
        "imprudence",
        "failing",
        "give",
        "due",
        "weight",
        "interest",
        "actual",
        "counterfactual",
        "emergent",
        "ethical",
        "theory",
        "distinctive",
        "variety",
        "utilitarianism",
        "one",
        "identifies",
        "moral",
        "good",
        "maximization",
        "subjective",
        "state",
        "happiness",
        "satisfaction",
        "preference",
        "argument",
        "excited",
        "almost",
        "much",
        "skepticism",
        "attention",
        "seemed",
        "implausible",
        "activity",
        "prescribing",
        "universally",
        "commit",
        "speaker",
        "substantive",
        "ethical",
        "position",
        "let",
        "alone",
        "one",
        "distinctive",
        "however",
        "logic",
        "hare",
        "position",
        "became",
        "perspicuous",
        "third",
        "book",
        "moral",
        "thinking",
        "level",
        "method",
        "point",
        "set",
        "follows",
        "wondering",
        "whether",
        "assent",
        "statement",
        "ought",
        "φ",
        "speaker",
        "reflect",
        "whether",
        "prescribe",
        "everyone",
        "act",
        "way",
        "whatever",
        "situation",
        "connotes",
        "essence",
        "eg",
        "human",
        "u",
        "might",
        "anything",
        "prescribing",
        "situation",
        "actual",
        "possible",
        "concerned",
        "behalf",
        "everybody",
        "prescriptive",
        "aspect",
        "meaning",
        "take",
        "role",
        "possibly",
        "one",
        "prescribe",
        "possible",
        "situation",
        "give",
        "weight",
        "preference",
        "occupant",
        "role",
        "actually",
        "one",
        "hence",
        "speaker",
        "rationally",
        "assent",
        "particular",
        "ought",
        "statement",
        "derivable",
        "universal",
        "principle",
        "accept",
        "give",
        "impartial",
        "positive",
        "weight",
        "preference",
        "whose",
        "satisfaction",
        "would",
        "affected",
        "observance",
        "thus",
        "moral",
        "reflection",
        "generates",
        "universalized",
        "prudence",
        "moral",
        "ideal",
        "register",
        "within",
        "framework",
        "simply",
        "universal",
        "preference",
        "allow",
        "one",
        "ideal",
        "override",
        "intense",
        "prevalent",
        "desire",
        "ideal",
        "others",
        "kind",
        "egoism",
        "excluded",
        "human",
        "decision",
        "remains",
        "free",
        "however",
        "rational",
        "informed",
        "anyone",
        "avoid",
        "constraint",
        "morality",
        "declining",
        "moralize",
        "reason",
        "remains",
        "true",
        "entail",
        "ought",
        "extraordinary",
        "extraordinarily",
        "bold",
        "intellectual",
        "construction",
        "invite",
        "debate",
        "many",
        "point",
        "zeno",
        "vendler",
        "urged",
        "keep",
        "apart",
        "semantic",
        "thesis",
        "may",
        "true",
        "nearly",
        "true",
        "pure",
        "indexical",
        "metaphysical",
        "claim",
        "may",
        "baffle",
        "u",
        "denotes",
        "pure",
        "subject",
        "take",
        "state",
        "role",
        "reply",
        "hare",
        "clearly",
        "shy",
        "away",
        "adopting",
        "metaphysical",
        "position",
        "stranger",
        "vendler",
        "reject",
        "cartesian",
        "ego",
        "admit",
        "transcendental",
        "ego",
        "yet",
        "still",
        "supposes",
        "true",
        "might",
        "napoleon",
        "world",
        "napoleon",
        "would",
        "different",
        "world",
        "though",
        "universal",
        "property",
        "a",
        "even",
        "supposes",
        "consider",
        "situation",
        "stove",
        "mountain",
        "treealthough",
        "since",
        "care",
        "happens",
        "become",
        "thing",
        "consideration",
        "idle",
        "a",
        "hare",
        "seems",
        "entered",
        "rather",
        "unexpected",
        "territory",
        "would",
        "suited",
        "usual",
        "common",
        "sense",
        "permit",
        "imagine",
        "napoleon",
        "napoleon",
        "ie",
        "like",
        "napoleon",
        "suffice",
        "incline",
        "one",
        "ambivalence",
        "outcome",
        "waterloo",
        "requires",
        "possible",
        "situation",
        "rate",
        "relevantly",
        "like",
        "napoleon",
        "maintain",
        "prescribing",
        "say",
        "men",
        "like",
        "napoleon",
        "receive",
        "comeuppance",
        "applies",
        "even",
        "oneself",
        "may",
        "imprudent",
        "danger",
        "remained",
        "deriving",
        "kind",
        "imperative",
        "indicative",
        "doubt",
        "napoleon",
        "much",
        "wanted",
        "win",
        "battle",
        "awareness",
        "fact",
        "commit",
        "prescribing",
        "counterfactual",
        "supposition",
        "napoleon",
        "napoleon",
        "victorious",
        "hare",
        "make",
        "use",
        "thesis",
        "meaning",
        "partly",
        "prescriptive",
        "hypothesize",
        "napoleon",
        "already",
        "identify",
        "prescription",
        "sense",
        "prescribing",
        "thing",
        "equal",
        "satisfied",
        "within",
        "scope",
        "hypothesis",
        "solution",
        "equally",
        "elegant",
        "audacious",
        "may",
        "confirm",
        "doubt",
        "whether",
        "situation",
        "napoleon",
        "situation",
        "possible",
        "situation",
        "kind",
        "actual",
        "situation",
        "could",
        "logicallyas",
        "opposed",
        "humanlyconstrained",
        "attitude",
        "adopted",
        "towards",
        "also",
        "throw",
        "open",
        "question",
        "identifying",
        "napoleon",
        "prescription",
        "come",
        "one",
        "might",
        "think",
        "fully",
        "prescriptive",
        "prescribe",
        "napoleon",
        "defeated",
        "situation",
        "napoleon",
        "since",
        "certainly",
        "wanted",
        "would",
        "ever",
        "wanted",
        "honestly",
        "prescribe",
        "men",
        "like",
        "napoleon",
        "defeated",
        "since",
        "one",
        "case",
        "napoleon",
        "want",
        "hare",
        "requires",
        "weaker",
        "identification",
        "given",
        "moralizing",
        "hence",
        "prescribing",
        "situation",
        "given",
        "general",
        "kind",
        "must",
        "give",
        "weight",
        "preference",
        "mine",
        "situation",
        "napoleon",
        "weight",
        "give",
        "preference",
        "mine",
        "situation",
        "hence",
        "deciding",
        "prescribe",
        "universally",
        "must",
        "weigh",
        "relevant",
        "preference",
        "equally",
        "relative",
        "prevalence",
        "intensity",
        "exactly",
        "hare",
        "intends",
        "lead",
        "u",
        "invite",
        "question",
        "prove",
        "one",
        "taken",
        "way",
        "logic",
        "ought"
    ]
}