{
    "main_text": "The Existence and Actuality of God\n3. The Existence and Actuality of God\n\nPhilosophers commonly use a metaphor that suggests that the chain of\nan argument, say for the existence of God, is only as strong as its\nweakest link. Hartshorne rejects this metaphor on Peircian grounds. He\nreplaces it by suggesting that various arguments for the existence of\nGod—ontological, cosmological, design, etc.—are like\nmutually reinforcing strands in a cable, as detailed by the Hartshorne\nscholar Donald Viney.\n\nHe argues that Hume’s and Kant’s criticisms of the\nontological argument of St. Anselm are not directed at the strongest\nversion of his argument found in Proslogion, chapter 3. Here,\nhe thinks, there is a modal distinction implied between existing\nnecessarily and existing contingently. Hartshorne’s view is that\nexistence alone might not be a real predicate, but existing\nnecessarily certainly is. To say that something exists without the\npossibility of not existing is to say something significant about the\nbeing in question. That is, contra Kant and others, Hartshorne\nbelieves that there are necessary truths concerning existence. To say\nthat absolute nonexistence in some fashion exists is to contradict\noneself; hence he thinks that absolute nonexistence is unintelligible.\nIt is necessarily the case that something exists, he thinks,\nand, relying on the ontological argument, he also thinks it true that\nGod necessarily exists.\n\nOn Hartshorne’s view, metaphysics does not deal with realities\nbeyond the physical, but rather with those features of reality that\nare ubiquitous or that would exist in any possible world. And he does\nnot think that it is possible to think of a preeminent being that\nexisted only contingently since if it did exist contingently rather\nthan necessarily, it would not be preeminent. That is, God’s\nexistence is either impossible (positivism) or possible, and, if\npossible, then necessary (theism). He is assuming here that there are\nthree alternatives for us to consider: (1) God is impossible; (2) God\nis possible, but may or may not exist; (3) God exists necessarily. The\nontological argument shows that the second alternative makes no sense.\nHence, he thinks that the prime task for the philosophical theist is\nto show that God is not impossible. A Hartshornian version of the\nontological argument can be put as follows: (1) Even if Kant was\ncorrect that existence is not a predicate, modality of existence is a\npredicate in the sense that saying that X exists necessarily or\ncontingently or impossibly, rather than merely saying that X exists,\nis to say something or to predicate something significant about X. (2)\nThere are three (and only three) modes of existence: (a) impossible\n(cannot exist); (b) contingent (may or may not exist--i.e., being such\nthat it exists but might not or being such that it does not exist but\nmight); and (c) necessary (must exist). (3) To say that God exists\ncontingently (as in 2b) is to contradict the logic of perfection\n(which is Anselm’s great discovery) because a being that existed\nonly contingently would not be the greatest conceivable. (4)\nTherefore, the existence of God--the greatest conceivable being or a\nperfect being--is either impossible or necessary (preliminary\nconclusion). (5) The existence of God is not impossible (which is the\nconclusion from other theistic arguments and from the history of\nreligious experience). (6) Therefore, the existence of God is\nnecessary; or, at the very least, the nonexistence of God is\ninconceivable (ultimate conclusion). Hartshorne also offered a version\nof the argument in formal logic (perhaps the very first to do so).\n\n\nIn addition, Hartshorne’s detailed treatment of the argument\nfrom design is connected to his view of biology. It is hard to\nreconcile the idea of an omnipotent, classical theistic God with the\nfact of the monstrosities and chance mutations produced in nature, but\nthe general orderliness of the natural world is just as difficult to\nreconcile with there being no Orderer or Persuader at all. Belief in\nGod as omnipotent, he thinks, has three problems: (1) it is at odds\nwith the disorderliness in nature; (2) it yields the acutest form of\nthe theodicy problem; and (3) it conflicts with the notion from\nPlato’s Sophist, defended by Hartshorne, that being\nis dynamic power (dynamis). An omnipotent\nbeing would ultimately have all power over others, who would\nultimately be powerless. But any being-in-becoming, according to\nHartshorne, has some power to be affected by others and to\naffect others; this power, however slight, provides counterevidence to\na belief in divine omnipotence. In contrast, God is ideally powerful,\non the Hartshornian view. That is, God is as powerful as it is\npossible to be, given the partial freedom and power of creatures.\n\nHartshorne’s dispute with traditional or classical philosophical\ntheism concerns not so much the existence of God, but rather\nits assumption that the actuality of God (i.e., how\nGod exists) could be described in the same terms as the existence of\nGod. A God who exists necessarily is not necessary or unchanging in\nevery other respect (e.g., in terms of divine responsiveness to\ncreaturely changes), he thinks. Although Hartshorne believes that the\nmedieval thinkers were correct in trying to think through the logic of\nperfection, he also thinks that this logic has traditionally been\nmisapplied in the effort to articulate the attributes of a being\ncalled “God,” roughly defined as the greatest conceivable\nbeing. The traditional or classical theistic logic of perfection sees\nGod as monopolar in that regarding various contrasts\n(permanence-change, one-many, activity-passivity, etc.) the\ntraditional or classical philosophical theist has chosen one element\nin each pair as a divine attribute (the former element of each pair)\nand denigrated the other.\n\nBy way of contrast, Hartshorne’s logic of perfection is dipolar.\nWithin each element of these pairs there are good features that should\nbe attributed in the preeminent sense to God (e.g., excellent\npermanence in the sense of steadfastness, excellent change in the\nsense of preeminent ability to respond to the sufferings of\ncreatures). In each element in these pairs there are also invidious\nfeatures (e.g., pigheaded stubbornness, fickleness). The task for the\nphilosophical theist, he thinks, is to attribute the excellences of\nboth elements of these pairs to God and to eschew the invidious\naspects of both elements. However, it should be noted that\nsome contrasts are not fit for dipolar analysis (e.g.,\ngood-evil) in that “good good” is a redundancy and\n“evil good” is a contradiction. The greatest conceivable\nbeing, he thinks, cannot be evil in any sense whatsoever.\n\nHartshorne does not claim to believe in two gods, nor does he wish to\ndefend a cosmological dualism. In fact, we can see that the opposite\nis the case when we consider that, in addition to calling his theism\ndipolar, he refers to it as a type of panentheism,\nwhich literally means that all is in the one God. This\ninclusion of the world in God occurs by means of omniscience (as\nHartshorne defines the term) and omnibenevolence. All creaturely\nfeelings, especially feelings of suffering, are included in the divine\nlife. God is seen by Hartshorne as the mind or soul for the whole body\nof the natural world (see above regarding Plato’s World Soul),\nalthough he thinks of God as distinguishable from the creatures.\nAnother way to categorize Hartshorne’s theism is to see it as\nneoclassical in the sense that he relies on the classical or\ntraditional theistic arguments for the existence of God and on the\nclassical theistic metaphysics of being as first steps in the\neffort to think through properly the logic of perfection. However,\nthese efforts need to be supplemented, he thinks, by the efforts of\nthose who see becoming as more inclusive than being. God is not\noutside of time, as in the Boethian view that is influential among\ntraditional philosophical theists, but rather exists through all of\ntime, on Hartshorne’s view. On the neoclassical view,\nGod’s permanent “being” consists in steadfast\nbenevolence exhibited through everlasting becoming.\n\nGod is omniscient, on Hartshorne’s view, but\n“omniscience” here refers to the divine ability to know\neverything that is knowable: past actualities as already actualized;\npresent realities to the extent that they are knowable according to\nthe laws of physics (e.g., what is present epistemically may very well\nbe the most recent past, given the speed of light); and future\npossibilities or probabilities as possibilities or\nprobabilities. On the traditional or classical conception of\nomniscience, however, God has knowledge of future possibilities or\nprobabilities as already actualized. According to Hartshorne, this is\nnot an example of supreme knowledge, but is rather an example of\nignorance of the (at least partially) indeterminate character of the\nfuture.\n\nThe asymmetrical view of time, common to process thinkers in general\n(e.g., Bergson, Whitehead, Hartshorne), in which the relationship\nbetween the present and the past is radically different from the\nrelationship between the present and the future, also has implications\nfor Hartshorne’s theodicy. A plurality of partially free agents,\nincluding nonhuman ones, facing a future that is neither completely\ndetermined nor foreknown in detail, makes it not only possible, but\nlikely, that these agents will get in each other’s way, clash,\nand cause each other to suffer. On this view, God is the fellow\nsufferer who understands.\n",
    "section_title": "3. The Existence and Actuality of God",
    "entry_title": "Charles Hartshorne",
    "hierarchy_title": "Charles Hartshorne || The Existence and Actuality of God",
    "tokenized_text": [
        "existence",
        "actuality",
        "god",
        "existence",
        "actuality",
        "god",
        "philosopher",
        "commonly",
        "use",
        "metaphor",
        "suggests",
        "chain",
        "argument",
        "say",
        "existence",
        "god",
        "strong",
        "weakest",
        "link",
        "hartshorne",
        "reject",
        "metaphor",
        "peircian",
        "ground",
        "replaces",
        "suggesting",
        "various",
        "argument",
        "existence",
        "godontological",
        "cosmological",
        "design",
        "etcare",
        "like",
        "mutually",
        "reinforcing",
        "strand",
        "cable",
        "detailed",
        "hartshorne",
        "scholar",
        "donald",
        "viney",
        "argues",
        "hume",
        "kant",
        "criticism",
        "ontological",
        "argument",
        "st",
        "anselm",
        "directed",
        "strongest",
        "version",
        "argument",
        "found",
        "proslogion",
        "chapter",
        "think",
        "modal",
        "distinction",
        "implied",
        "existing",
        "necessarily",
        "existing",
        "contingently",
        "hartshorne",
        "view",
        "existence",
        "alone",
        "might",
        "real",
        "predicate",
        "existing",
        "necessarily",
        "certainly",
        "say",
        "something",
        "exists",
        "without",
        "possibility",
        "existing",
        "say",
        "something",
        "significant",
        "question",
        "contra",
        "kant",
        "others",
        "hartshorne",
        "belief",
        "necessary",
        "truth",
        "concerning",
        "existence",
        "say",
        "absolute",
        "nonexistence",
        "fashion",
        "exists",
        "contradict",
        "oneself",
        "hence",
        "think",
        "absolute",
        "nonexistence",
        "unintelligible",
        "necessarily",
        "case",
        "something",
        "exists",
        "think",
        "relying",
        "ontological",
        "argument",
        "also",
        "think",
        "true",
        "god",
        "necessarily",
        "exists",
        "hartshorne",
        "view",
        "metaphysics",
        "deal",
        "reality",
        "beyond",
        "physical",
        "rather",
        "feature",
        "reality",
        "ubiquitous",
        "would",
        "exist",
        "possible",
        "world",
        "think",
        "possible",
        "think",
        "preeminent",
        "existed",
        "contingently",
        "since",
        "exist",
        "contingently",
        "rather",
        "necessarily",
        "would",
        "preeminent",
        "god",
        "existence",
        "either",
        "impossible",
        "positivism",
        "possible",
        "possible",
        "necessary",
        "theism",
        "assuming",
        "three",
        "alternative",
        "u",
        "consider",
        "god",
        "impossible",
        "god",
        "possible",
        "may",
        "may",
        "exist",
        "god",
        "exists",
        "necessarily",
        "ontological",
        "argument",
        "show",
        "second",
        "alternative",
        "make",
        "sense",
        "hence",
        "think",
        "prime",
        "task",
        "philosophical",
        "theist",
        "show",
        "god",
        "impossible",
        "hartshornian",
        "version",
        "ontological",
        "argument",
        "put",
        "follows",
        "even",
        "kant",
        "correct",
        "existence",
        "predicate",
        "modality",
        "existence",
        "predicate",
        "sense",
        "saying",
        "x",
        "exists",
        "necessarily",
        "contingently",
        "impossibly",
        "rather",
        "merely",
        "saying",
        "x",
        "exists",
        "say",
        "something",
        "predicate",
        "something",
        "significant",
        "x",
        "three",
        "three",
        "mode",
        "existence",
        "impossible",
        "exist",
        "b",
        "contingent",
        "may",
        "may",
        "exist",
        "ie",
        "exists",
        "might",
        "exist",
        "might",
        "c",
        "necessary",
        "must",
        "exist",
        "say",
        "god",
        "exists",
        "contingently",
        "b",
        "contradict",
        "logic",
        "perfection",
        "anselm",
        "great",
        "discovery",
        "existed",
        "contingently",
        "would",
        "greatest",
        "conceivable",
        "therefore",
        "existence",
        "god",
        "greatest",
        "conceivable",
        "perfect",
        "either",
        "impossible",
        "necessary",
        "preliminary",
        "conclusion",
        "existence",
        "god",
        "impossible",
        "conclusion",
        "theistic",
        "argument",
        "history",
        "religious",
        "experience",
        "therefore",
        "existence",
        "god",
        "necessary",
        "least",
        "nonexistence",
        "god",
        "inconceivable",
        "ultimate",
        "conclusion",
        "hartshorne",
        "also",
        "offered",
        "version",
        "argument",
        "formal",
        "logic",
        "perhaps",
        "first",
        "addition",
        "hartshorne",
        "detailed",
        "treatment",
        "argument",
        "design",
        "connected",
        "view",
        "biology",
        "hard",
        "reconcile",
        "idea",
        "omnipotent",
        "classical",
        "theistic",
        "god",
        "fact",
        "monstrosity",
        "chance",
        "mutation",
        "produced",
        "nature",
        "general",
        "orderliness",
        "natural",
        "world",
        "difficult",
        "reconcile",
        "orderer",
        "persuader",
        "belief",
        "god",
        "omnipotent",
        "think",
        "three",
        "problem",
        "odds",
        "disorderliness",
        "nature",
        "yield",
        "acutest",
        "form",
        "theodicy",
        "problem",
        "conflict",
        "notion",
        "plato",
        "sophist",
        "defended",
        "hartshorne",
        "dynamic",
        "power",
        "dynamis",
        "omnipotent",
        "would",
        "ultimately",
        "power",
        "others",
        "would",
        "ultimately",
        "powerless",
        "beinginbecoming",
        "according",
        "hartshorne",
        "power",
        "affected",
        "others",
        "affect",
        "others",
        "power",
        "however",
        "slight",
        "provides",
        "counterevidence",
        "belief",
        "divine",
        "omnipotence",
        "contrast",
        "god",
        "ideally",
        "powerful",
        "hartshornian",
        "view",
        "god",
        "powerful",
        "possible",
        "given",
        "partial",
        "freedom",
        "power",
        "creature",
        "hartshorne",
        "dispute",
        "traditional",
        "classical",
        "philosophical",
        "theism",
        "concern",
        "much",
        "existence",
        "god",
        "rather",
        "assumption",
        "actuality",
        "god",
        "ie",
        "god",
        "exists",
        "could",
        "described",
        "term",
        "existence",
        "god",
        "god",
        "exists",
        "necessarily",
        "necessary",
        "unchanging",
        "every",
        "respect",
        "eg",
        "term",
        "divine",
        "responsiveness",
        "creaturely",
        "change",
        "think",
        "although",
        "hartshorne",
        "belief",
        "medieval",
        "thinker",
        "correct",
        "trying",
        "think",
        "logic",
        "perfection",
        "also",
        "think",
        "logic",
        "traditionally",
        "misapplied",
        "effort",
        "articulate",
        "attribute",
        "called",
        "god",
        "roughly",
        "defined",
        "greatest",
        "conceivable",
        "traditional",
        "classical",
        "theistic",
        "logic",
        "perfection",
        "see",
        "god",
        "monopolar",
        "regarding",
        "various",
        "contrast",
        "permanencechange",
        "onemany",
        "activitypassivity",
        "etc",
        "traditional",
        "classical",
        "philosophical",
        "theist",
        "chosen",
        "one",
        "element",
        "pair",
        "divine",
        "attribute",
        "former",
        "element",
        "pair",
        "denigrated",
        "way",
        "contrast",
        "hartshorne",
        "logic",
        "perfection",
        "dipolar",
        "within",
        "element",
        "pair",
        "good",
        "feature",
        "attributed",
        "preeminent",
        "sense",
        "god",
        "eg",
        "excellent",
        "permanence",
        "sense",
        "steadfastness",
        "excellent",
        "change",
        "sense",
        "preeminent",
        "ability",
        "respond",
        "suffering",
        "creature",
        "element",
        "pair",
        "also",
        "invidious",
        "feature",
        "eg",
        "pigheaded",
        "stubbornness",
        "fickleness",
        "task",
        "philosophical",
        "theist",
        "think",
        "attribute",
        "excellence",
        "element",
        "pair",
        "god",
        "eschew",
        "invidious",
        "aspect",
        "element",
        "however",
        "noted",
        "contrast",
        "fit",
        "dipolar",
        "analysis",
        "eg",
        "goodevil",
        "good",
        "good",
        "redundancy",
        "evil",
        "good",
        "contradiction",
        "greatest",
        "conceivable",
        "think",
        "evil",
        "sense",
        "whatsoever",
        "hartshorne",
        "claim",
        "believe",
        "two",
        "god",
        "wish",
        "defend",
        "cosmological",
        "dualism",
        "fact",
        "see",
        "opposite",
        "case",
        "consider",
        "addition",
        "calling",
        "theism",
        "dipolar",
        "refers",
        "type",
        "panentheism",
        "literally",
        "mean",
        "one",
        "god",
        "inclusion",
        "world",
        "god",
        "occurs",
        "mean",
        "omniscience",
        "hartshorne",
        "defines",
        "term",
        "omnibenevolence",
        "creaturely",
        "feeling",
        "especially",
        "feeling",
        "suffering",
        "included",
        "divine",
        "life",
        "god",
        "seen",
        "hartshorne",
        "mind",
        "soul",
        "whole",
        "body",
        "natural",
        "world",
        "see",
        "regarding",
        "plato",
        "world",
        "soul",
        "although",
        "think",
        "god",
        "distinguishable",
        "creature",
        "another",
        "way",
        "categorize",
        "hartshorne",
        "theism",
        "see",
        "neoclassical",
        "sense",
        "relies",
        "classical",
        "traditional",
        "theistic",
        "argument",
        "existence",
        "god",
        "classical",
        "theistic",
        "metaphysics",
        "first",
        "step",
        "effort",
        "think",
        "properly",
        "logic",
        "perfection",
        "however",
        "effort",
        "need",
        "supplemented",
        "think",
        "effort",
        "see",
        "becoming",
        "inclusive",
        "god",
        "outside",
        "time",
        "boethian",
        "view",
        "influential",
        "among",
        "traditional",
        "philosophical",
        "theist",
        "rather",
        "exists",
        "time",
        "hartshorne",
        "view",
        "neoclassical",
        "view",
        "god",
        "permanent",
        "consists",
        "steadfast",
        "benevolence",
        "exhibited",
        "everlasting",
        "becoming",
        "god",
        "omniscient",
        "hartshorne",
        "view",
        "omniscience",
        "refers",
        "divine",
        "ability",
        "know",
        "everything",
        "knowable",
        "past",
        "actuality",
        "already",
        "actualized",
        "present",
        "reality",
        "extent",
        "knowable",
        "according",
        "law",
        "physic",
        "eg",
        "present",
        "epistemically",
        "may",
        "well",
        "recent",
        "past",
        "given",
        "speed",
        "light",
        "future",
        "possibility",
        "probability",
        "possibility",
        "probability",
        "traditional",
        "classical",
        "conception",
        "omniscience",
        "however",
        "god",
        "knowledge",
        "future",
        "possibility",
        "probability",
        "already",
        "actualized",
        "according",
        "hartshorne",
        "example",
        "supreme",
        "knowledge",
        "rather",
        "example",
        "ignorance",
        "least",
        "partially",
        "indeterminate",
        "character",
        "future",
        "asymmetrical",
        "view",
        "time",
        "common",
        "process",
        "thinker",
        "general",
        "eg",
        "bergson",
        "whitehead",
        "hartshorne",
        "relationship",
        "present",
        "past",
        "radically",
        "different",
        "relationship",
        "present",
        "future",
        "also",
        "implication",
        "hartshorne",
        "theodicy",
        "plurality",
        "partially",
        "free",
        "agent",
        "including",
        "nonhuman",
        "one",
        "facing",
        "future",
        "neither",
        "completely",
        "determined",
        "foreknown",
        "detail",
        "make",
        "possible",
        "likely",
        "agent",
        "get",
        "way",
        "clash",
        "cause",
        "suffer",
        "view",
        "god",
        "fellow",
        "sufferer",
        "understands"
    ]
}