{
    "main_text": "What is Hate Speech?\n1. What is Hate Speech?\n\nThe term ‘hate speech’ is more than a descriptive concept\nused to identify a specific class of expressions. It also functions as\nan evaluative term judging its referent negatively and as a candidate\nfor censure. Thus, defining this category carries serious\nimplications. What is it that designates hate speech as a distinctive\nclass of speech? Some claim the term ‘hate speech’ itself\nis misleading because it wrongly suggests “virulent dislike of a\nperson for any reason” as a defining feature (Gelber 2017, 619).\nThat is not, however, the way in which the term is understood among\nmost legal theorists and philosophers. Perhaps it would be useful to\nstart with some examples.\n\nBhikhu Parekh (2012) lists the following instances as examples\ndifferent countries have either punished or sought to punish as hate\nspeech:\n\nShouting “[N-words] go home,” making monkey noises,\nand chanting racist slogans at soccer matches.\n“Islam out of Britain. Protect the British\npeople.”\n“Arabs out of France.”\n“Serve your country, burn down a mosque.”\n“Blacks are inherently inferior, lecherous, predisposed to\ncriminal activities, and should not be allowed to move into\nrespectable areas.”\n“Jews are conspiratorial, devious, treacherous, sadistic,\nchild killers, and subversive; want to take over the country; and\nshould be carefully watched.”\nDistribution by a political party of leaflets addressed to\n“white fellow citizens” saying that, if it came to power,\nit would remove all Surinamese, Turks, and other “undesired\naliens” from the Netherlands.\nA poster of a woman in a burka with text that reads:\n“Who knows what they have under their sinister and ugly looking\nclothes: stolen goods, guns, bombs even?”\nSpeech that either denies or trivializes the holocaust or other\ncrimes against humanity.\n\n\nRobert Post’s four bases for defining hate speech might help us\norganize the features of Parekh’s list:\n\nIn law, we have to define hate speech carefully to designate the forms\nof the speech that will receive distinctive legal treatment. This is\nno easy task. Roughly speaking, we can define hate speech in terms of\nthe harms it will cause—physical contingent harms like violence\nor discrimination; or we can define hate speech in terms of its\nintrinsic properties—the kinds of words it uses; or we can\ndefine hate speech in terms of its connection to principles of\ndignity; or we can define hate speech in terms of the ideas it\nconveys. Each of these definitions has advantages and disadvantages.\nEach intersects with the first amendment theory in a different way. In\nthe end, any definition that we adopt must be justified on the ground\nthat it will achieve the results we wish to achieve. (Herz and Molnar\n2012, 31)\n\n\nThe four definitional bases are in terms of: (1) harm, (2) content,\n(3) intrinsic properties, i.e., the type of words used, and (4)\ndignity. One could also attempt a hybrid definition by combining the\nways mentioned. But, as is made clear in Post’s remarks,\ndefinitions of this sort are relative to the interests of the definer;\n“We must evaluate the status of ‘hate speech’ so\ndefined in order to determine whether it achieves what we wish to\naccomplish and whether the harms of the definition will outweigh its\nadvantages” (Herz and Molnar 2012, 31). The upshot is a\nrejection of a univocal definition that captures “the\nessence” of hate speech as a phenomenon.\n\nIt is important to note that many definitions of hate speech will not\nfall squarely within the categories Post outlines. For instance, the\nUN’s International Convention on the Elimination of All\nForms of Racial Discrimination identifies hate speech both in\nterms of its content and its harmful consequences. Most definitions\ntend to characterize hate speech in multiple ways.\n\nHarm-based definitions conceive of hate speech in terms of the harms\nto which targets are subjected. Things like discrimination or\nlinguistic violence are candidates, though some (Gelber, 2017) argue\nthat hate speech can harm one’s ability to participate in\ndemocratic deliberation. Susan Brison (1998a) offers a disjunctive\ndefinition that centers on a kind of abuse to targets. She defines\nhate speech as “speech that vilifies individuals or groups on\nthe basis of such characteristics as race, sex, ethnicity, religion,\nand sexual orientation, which (1) constitutes face-to-face\nvilification, (2) creates a hostile or intimidating environment, or\n(3) is a kind of group libel” (313). ‘Harm’ as used\nby Brison refers to what Joel Feinberg describes “as a wrongful\nsetback to (or invasion of) someone’s interests” (Brison,\n1998b, 42).\n\nPerhaps an immediate reaction to disjunctive definitions of the sort\nBrison offers is skepticism about the definitiveness of the purported\nlist. When we go to test the definition’s application, we\ninvariably find contestable inclusions and exclusions. Recall the\nexamples from Parekh at the start of this section. Something like\n“Arabs out of France” might be included as an instance of\nhate speech on Brison’s account on the grounds that it creates a\nhostile or intimidating environment. Should statements that\ncommunicate a similar message in a less abrasive manner also be\nincluded? Suppose “Only French Nationals should occupy\nFrance” is roughly equivalent content-wise to “Arabs out\nof France.” If the former is indeed a less abrasive presentation\nthough communicating the same content as the latter, what are we to\nmake of its status? Many will find the statement odious; many will\nnot. And since it is certainly not a face-to-face vilification or form\nof group libel, classifying it as hate speech will depend on how\nlikely it is to create an intimidating or hostile environment.\n\nThe previous objection might entice one to opt for a content-based\nview. Content-based views define hate speech as that which\n“expresses, encourages, stirs up, or incites hatred\nagainst a group of individuals distinguished by a particular feature\nor set of features such as race, ethnicity, gender, religion,\nnationality, and sexual orientation” (Parekh, 2012, 40). This\nversion makes it easier to conceive of semantically equivalent\nstatements that differ in manner of presentation as instances of hate\nspeech.\n\nContent-based accounts face the challenge of determining which\ncontents meet this standard. If the content that distinguishes hate\nspeech from other types of speech must express, encourage, or incite\nhatred towards groups or individuals based on certain features, then\nthe proponent of this view will need an account of expression. Is the\nspeech in view that which signals the presence of a particular mental\nstate in the speaker (i.e., hate) or that which is likely to prime\nfeelings of animosity in a specific audience?\n\nAnother issue facing content-based approaches concerns distinguishing\nbetween speech that “respects ‘the decencies of\ncontroversy’” and that “which is outrageous and\ntherefore hate inducing” (Post, 2009, 128). The ability to\nexpress a wide range of views, even contentious ones, is a cherished\naspect of democratic societies. Failure to observe this distinction\nwould broaden the scope of what counts as hate speech perhaps too\nmuch. In order to make this distinction, one could follow Post in\ntying it to “ambient social norms” that distinguish\noutrageous and respectful behavior. One challenge though is in\ndetermining the content of those social norms. For instance, a\nminority group whose opinions have little impact on the makeup of\nnorms are unjustifiably excluded from influencing the shape of their\nsociety’s civility norms.\n\nDefinitions of hate speech based on intrinsic properties generally\nrefer to those that emphasize the type of the speech uttered. What is\nat issue is the use of speech widely known to instigate offense or\ninsult among a majority of society. Explicitly derogatory expressions\nlike slurs are paradigmatic examples of this type of view. In general,\nthe type of speech identified on this account is inherently\nderogatory, discriminatory, or vilifying.\n\nThough attractive at first glance, classifying hate speech along these\nlines might prove to fall short in two ways. First, defining hate\nspeech in this way might be too constricting. Some of the examples in\nour initial list would seem not to count as hate speech since they\narguably lack the intrinsic features. “Arabs out of\nFrance,” for example, does not contain explicitly slurring\nterms. And second, this definition might prove too expansive. In cases\nwhere slurs are reappropriated by members of the target group or where\nartists incorporate them into a creative work, it would appear odd to\ncount these as instances of hate speech. The concern is tied\nspecifically to locating the issue in the terms themselves, as opposed\nto the use to which the terms are put.\n\nPerhaps a final challenge to intrinsic property views can be derived\nfrom the work of Judith Butler (1997). On Butler’s account, hate\nspeech is a kind of performative that is “always delivered\ntwice-removed, that is, through a theory of the speech act\nthat has its own performative power” (96). More specifically,\n“[w]hat hate speech does … is to constitute the subject\nin a subordinate position” (19). Butler locates the trouble with\nhate speech in its perlocutionary effects, a concept\nintroduced by J.L. Austin that refers to the effects a speech act can\nhave on its audience. An example of a perlocutionary effect is feeling\namused at a joke or frightened from the telling of a ghost story.\nUnlike with intrinsic property definitions, Butler shifts focus to the\nnature of the acts performed rather than the terms in use. (For a\ncritical look at Butler’s account, see Schwartzman (2002).)\n\nLastly, dignity-based conceptions focus primarily on the role of harms\nto the dignity of targets of hate speech. For instance, both Steven\nHeyman (2008) and Jeremy Waldron (2014) appeal to dignity in their\naccounts. Broadly speaking, hate speech on this kind of conception\namounts to speech that undermines its target’s “basic\nsocial standing, the basis of [their] recognition as social equals and\nas bearers of human rights and constitutional entitlements”\n(Waldron, 2014, 59). This conception of hate speech will also include\ncharacterizations in terms of group defamation or group libel. Section\n130 of Germany’s penal code is an example of legislation that\nincorporates a dignity-based conception of hate speech, prohibiting\n“attacks on human dignity by insulting, maliciously maligning,\nor defaming part of the population” (see Waldron, 2014,\n8).\n\nWorries about application follow dignity-based conceptions as well.\nFirstly, there may be questions about how we, in particular instances,\nare to distinguish between false statements about a group as a whole\nand those about a particular member of a group (Brown, 2017a).\nPresumably, only the former is consistent with an understanding of\nhate speech as a group-based phenomenon. Secondly, an implication of\nthe view appears to be that it expands the range of things that would\ncount as hate speech. Any speech that calls into question the basic\nstanding of certain groups falls under this notion, which may make it\nmore difficult to distinguish between contentious political speech and\nhate speech.\n\nPerhaps a lesson to draw from the profusion of disjunctive definitions\nis a general skepticism about a definitive description of hate speech.\nWe might concur with Alexander Brown that ‘hate speech’ is\nan equivocal term denoting a family of meanings (Brown 2017b, 562).\nAccording to Brown, ‘hate speech’ isn’t just a term\nwith contested meanings, but rather, it is “systematically\nambiguous; which is to say, it carries a multiplicity of different\nmeanings” (2017b, 564). Because the expression is what is\ntypically referred to as an essentially contested term, the hunt for a\nunivocal or universal definition is futile.\n",
    "section_title": "1. What is Hate Speech?",
    "entry_title": "Hate Speech",
    "hierarchy_title": "Hate Speech || What is Hate Speech?",
    "tokenized_text": [
        "hate",
        "speech",
        "hate",
        "speech",
        "term",
        "hate",
        "speech",
        "descriptive",
        "concept",
        "used",
        "identify",
        "specific",
        "class",
        "expression",
        "also",
        "function",
        "evaluative",
        "term",
        "judging",
        "referent",
        "negatively",
        "candidate",
        "censure",
        "thus",
        "defining",
        "category",
        "carry",
        "serious",
        "implication",
        "designates",
        "hate",
        "speech",
        "distinctive",
        "class",
        "speech",
        "claim",
        "term",
        "hate",
        "speech",
        "misleading",
        "wrongly",
        "suggests",
        "virulent",
        "dislike",
        "person",
        "reason",
        "defining",
        "feature",
        "gelber",
        "however",
        "way",
        "term",
        "understood",
        "among",
        "legal",
        "theorist",
        "philosopher",
        "perhaps",
        "would",
        "useful",
        "start",
        "example",
        "bhikhu",
        "parekh",
        "list",
        "following",
        "instance",
        "example",
        "different",
        "country",
        "either",
        "punished",
        "sought",
        "punish",
        "hate",
        "speech",
        "shouting",
        "nwords",
        "go",
        "home",
        "making",
        "monkey",
        "noise",
        "chanting",
        "racist",
        "slogan",
        "soccer",
        "match",
        "islam",
        "britain",
        "protect",
        "british",
        "people",
        "arab",
        "france",
        "serve",
        "country",
        "burn",
        "mosque",
        "black",
        "inherently",
        "inferior",
        "lecherous",
        "predisposed",
        "criminal",
        "activity",
        "allowed",
        "move",
        "respectable",
        "areas",
        "jew",
        "conspiratorial",
        "devious",
        "treacherous",
        "sadistic",
        "child",
        "killer",
        "subversive",
        "want",
        "take",
        "country",
        "carefully",
        "watched",
        "distribution",
        "political",
        "party",
        "leaflet",
        "addressed",
        "white",
        "fellow",
        "citizen",
        "saying",
        "came",
        "power",
        "would",
        "remove",
        "surinamese",
        "turk",
        "undesired",
        "alien",
        "netherlands",
        "poster",
        "woman",
        "burka",
        "text",
        "read",
        "know",
        "sinister",
        "ugly",
        "looking",
        "clothes",
        "stolen",
        "good",
        "gun",
        "bomb",
        "even",
        "speech",
        "either",
        "denies",
        "trivializes",
        "holocaust",
        "crime",
        "humanity",
        "robert",
        "post",
        "four",
        "base",
        "defining",
        "hate",
        "speech",
        "might",
        "help",
        "u",
        "organize",
        "feature",
        "parekh",
        "list",
        "law",
        "define",
        "hate",
        "speech",
        "carefully",
        "designate",
        "form",
        "speech",
        "receive",
        "distinctive",
        "legal",
        "treatment",
        "easy",
        "task",
        "roughly",
        "speaking",
        "define",
        "hate",
        "speech",
        "term",
        "harm",
        "causephysical",
        "contingent",
        "harm",
        "like",
        "violence",
        "discrimination",
        "define",
        "hate",
        "speech",
        "term",
        "intrinsic",
        "propertiesthe",
        "kind",
        "word",
        "us",
        "define",
        "hate",
        "speech",
        "term",
        "connection",
        "principle",
        "dignity",
        "define",
        "hate",
        "speech",
        "term",
        "idea",
        "conveys",
        "definition",
        "advantage",
        "disadvantage",
        "intersects",
        "first",
        "amendment",
        "theory",
        "different",
        "way",
        "end",
        "definition",
        "adopt",
        "must",
        "justified",
        "ground",
        "achieve",
        "result",
        "wish",
        "achieve",
        "herz",
        "molnar",
        "four",
        "definitional",
        "base",
        "term",
        "harm",
        "content",
        "intrinsic",
        "property",
        "ie",
        "type",
        "word",
        "used",
        "dignity",
        "one",
        "could",
        "also",
        "attempt",
        "hybrid",
        "definition",
        "combining",
        "way",
        "mentioned",
        "made",
        "clear",
        "post",
        "remark",
        "definition",
        "sort",
        "relative",
        "interest",
        "definer",
        "must",
        "evaluate",
        "status",
        "hate",
        "speech",
        "defined",
        "order",
        "determine",
        "whether",
        "achieves",
        "wish",
        "accomplish",
        "whether",
        "harm",
        "definition",
        "outweigh",
        "advantage",
        "herz",
        "molnar",
        "upshot",
        "rejection",
        "univocal",
        "definition",
        "capture",
        "essence",
        "hate",
        "speech",
        "phenomenon",
        "important",
        "note",
        "many",
        "definition",
        "hate",
        "speech",
        "fall",
        "squarely",
        "within",
        "category",
        "post",
        "outline",
        "instance",
        "un",
        "international",
        "convention",
        "elimination",
        "form",
        "racial",
        "discrimination",
        "identifies",
        "hate",
        "speech",
        "term",
        "content",
        "harmful",
        "consequence",
        "definition",
        "tend",
        "characterize",
        "hate",
        "speech",
        "multiple",
        "way",
        "harmbased",
        "definition",
        "conceive",
        "hate",
        "speech",
        "term",
        "harm",
        "target",
        "subjected",
        "thing",
        "like",
        "discrimination",
        "linguistic",
        "violence",
        "candidate",
        "though",
        "gelber",
        "argue",
        "hate",
        "speech",
        "harm",
        "one",
        "ability",
        "participate",
        "democratic",
        "deliberation",
        "susan",
        "brison",
        "a",
        "offer",
        "disjunctive",
        "definition",
        "center",
        "kind",
        "abuse",
        "target",
        "defines",
        "hate",
        "speech",
        "speech",
        "vilifies",
        "individual",
        "group",
        "basis",
        "characteristic",
        "race",
        "sex",
        "ethnicity",
        "religion",
        "sexual",
        "orientation",
        "constitutes",
        "facetoface",
        "vilification",
        "creates",
        "hostile",
        "intimidating",
        "environment",
        "kind",
        "group",
        "libel",
        "harm",
        "used",
        "brison",
        "refers",
        "joel",
        "feinberg",
        "describes",
        "wrongful",
        "setback",
        "invasion",
        "someone",
        "interest",
        "brison",
        "b",
        "perhaps",
        "immediate",
        "reaction",
        "disjunctive",
        "definition",
        "sort",
        "brison",
        "offer",
        "skepticism",
        "definitiveness",
        "purported",
        "list",
        "go",
        "test",
        "definition",
        "application",
        "invariably",
        "find",
        "contestable",
        "inclusion",
        "exclusion",
        "recall",
        "example",
        "parekh",
        "start",
        "section",
        "something",
        "like",
        "arab",
        "france",
        "might",
        "included",
        "instance",
        "hate",
        "speech",
        "brison",
        "account",
        "ground",
        "creates",
        "hostile",
        "intimidating",
        "environment",
        "statement",
        "communicate",
        "similar",
        "message",
        "le",
        "abrasive",
        "manner",
        "also",
        "included",
        "suppose",
        "french",
        "national",
        "occupy",
        "france",
        "roughly",
        "equivalent",
        "contentwise",
        "arab",
        "france",
        "former",
        "indeed",
        "le",
        "abrasive",
        "presentation",
        "though",
        "communicating",
        "content",
        "latter",
        "make",
        "status",
        "many",
        "find",
        "statement",
        "odious",
        "many",
        "since",
        "certainly",
        "facetoface",
        "vilification",
        "form",
        "group",
        "libel",
        "classifying",
        "hate",
        "speech",
        "depend",
        "likely",
        "create",
        "intimidating",
        "hostile",
        "environment",
        "previous",
        "objection",
        "might",
        "entice",
        "one",
        "opt",
        "contentbased",
        "view",
        "contentbased",
        "view",
        "define",
        "hate",
        "speech",
        "express",
        "encourages",
        "stir",
        "incites",
        "hatred",
        "group",
        "individual",
        "distinguished",
        "particular",
        "feature",
        "set",
        "feature",
        "race",
        "ethnicity",
        "gender",
        "religion",
        "nationality",
        "sexual",
        "orientation",
        "parekh",
        "version",
        "make",
        "easier",
        "conceive",
        "semantically",
        "equivalent",
        "statement",
        "differ",
        "manner",
        "presentation",
        "instance",
        "hate",
        "speech",
        "contentbased",
        "account",
        "face",
        "challenge",
        "determining",
        "content",
        "meet",
        "standard",
        "content",
        "distinguishes",
        "hate",
        "speech",
        "type",
        "speech",
        "must",
        "express",
        "encourage",
        "incite",
        "hatred",
        "towards",
        "group",
        "individual",
        "based",
        "certain",
        "feature",
        "proponent",
        "view",
        "need",
        "account",
        "expression",
        "speech",
        "view",
        "signal",
        "presence",
        "particular",
        "mental",
        "state",
        "speaker",
        "ie",
        "hate",
        "likely",
        "prime",
        "feeling",
        "animosity",
        "specific",
        "audience",
        "another",
        "issue",
        "facing",
        "contentbased",
        "approach",
        "concern",
        "distinguishing",
        "speech",
        "respect",
        "decency",
        "controversy",
        "outrageous",
        "therefore",
        "hate",
        "inducing",
        "post",
        "ability",
        "express",
        "wide",
        "range",
        "view",
        "even",
        "contentious",
        "one",
        "cherished",
        "aspect",
        "democratic",
        "society",
        "failure",
        "observe",
        "distinction",
        "would",
        "broaden",
        "scope",
        "count",
        "hate",
        "speech",
        "perhaps",
        "much",
        "order",
        "make",
        "distinction",
        "one",
        "could",
        "follow",
        "post",
        "tying",
        "ambient",
        "social",
        "norm",
        "distinguish",
        "outrageous",
        "respectful",
        "behavior",
        "one",
        "challenge",
        "though",
        "determining",
        "content",
        "social",
        "norm",
        "instance",
        "minority",
        "group",
        "whose",
        "opinion",
        "little",
        "impact",
        "makeup",
        "norm",
        "unjustifiably",
        "excluded",
        "influencing",
        "shape",
        "society",
        "civility",
        "norm",
        "definition",
        "hate",
        "speech",
        "based",
        "intrinsic",
        "property",
        "generally",
        "refer",
        "emphasize",
        "type",
        "speech",
        "uttered",
        "issue",
        "use",
        "speech",
        "widely",
        "known",
        "instigate",
        "offense",
        "insult",
        "among",
        "majority",
        "society",
        "explicitly",
        "derogatory",
        "expression",
        "like",
        "slur",
        "paradigmatic",
        "example",
        "type",
        "view",
        "general",
        "type",
        "speech",
        "identified",
        "account",
        "inherently",
        "derogatory",
        "discriminatory",
        "vilifying",
        "though",
        "attractive",
        "first",
        "glance",
        "classifying",
        "hate",
        "speech",
        "along",
        "line",
        "might",
        "prove",
        "fall",
        "short",
        "two",
        "way",
        "first",
        "defining",
        "hate",
        "speech",
        "way",
        "might",
        "constricting",
        "example",
        "initial",
        "list",
        "would",
        "seem",
        "count",
        "hate",
        "speech",
        "since",
        "arguably",
        "lack",
        "intrinsic",
        "feature",
        "arab",
        "france",
        "example",
        "contain",
        "explicitly",
        "slurring",
        "term",
        "second",
        "definition",
        "might",
        "prove",
        "expansive",
        "case",
        "slur",
        "reappropriated",
        "member",
        "target",
        "group",
        "artist",
        "incorporate",
        "creative",
        "work",
        "would",
        "appear",
        "odd",
        "count",
        "instance",
        "hate",
        "speech",
        "concern",
        "tied",
        "specifically",
        "locating",
        "issue",
        "term",
        "opposed",
        "use",
        "term",
        "put",
        "perhaps",
        "final",
        "challenge",
        "intrinsic",
        "property",
        "view",
        "derived",
        "work",
        "judith",
        "butler",
        "butler",
        "account",
        "hate",
        "speech",
        "kind",
        "performative",
        "always",
        "delivered",
        "twiceremoved",
        "theory",
        "speech",
        "act",
        "performative",
        "power",
        "specifically",
        "w",
        "hat",
        "hate",
        "speech",
        "constitute",
        "subject",
        "subordinate",
        "position",
        "butler",
        "locates",
        "trouble",
        "hate",
        "speech",
        "perlocutionary",
        "effect",
        "concept",
        "introduced",
        "jl",
        "austin",
        "refers",
        "effect",
        "speech",
        "act",
        "audience",
        "example",
        "perlocutionary",
        "effect",
        "feeling",
        "amused",
        "joke",
        "frightened",
        "telling",
        "ghost",
        "story",
        "unlike",
        "intrinsic",
        "property",
        "definition",
        "butler",
        "shift",
        "focus",
        "nature",
        "act",
        "performed",
        "rather",
        "term",
        "use",
        "critical",
        "look",
        "butler",
        "account",
        "see",
        "schwartzman",
        "lastly",
        "dignitybased",
        "conception",
        "focus",
        "primarily",
        "role",
        "harm",
        "dignity",
        "target",
        "hate",
        "speech",
        "instance",
        "steven",
        "heyman",
        "jeremy",
        "waldron",
        "appeal",
        "dignity",
        "account",
        "broadly",
        "speaking",
        "hate",
        "speech",
        "kind",
        "conception",
        "amount",
        "speech",
        "undermines",
        "target",
        "basic",
        "social",
        "standing",
        "basis",
        "recognition",
        "social",
        "equal",
        "bearer",
        "human",
        "right",
        "constitutional",
        "entitlement",
        "waldron",
        "conception",
        "hate",
        "speech",
        "also",
        "include",
        "characterization",
        "term",
        "group",
        "defamation",
        "group",
        "libel",
        "section",
        "germany",
        "penal",
        "code",
        "example",
        "legislation",
        "incorporates",
        "dignitybased",
        "conception",
        "hate",
        "speech",
        "prohibiting",
        "attack",
        "human",
        "dignity",
        "insulting",
        "maliciously",
        "maligning",
        "defaming",
        "part",
        "population",
        "see",
        "waldron",
        "worry",
        "application",
        "follow",
        "dignitybased",
        "conception",
        "well",
        "firstly",
        "may",
        "question",
        "particular",
        "instance",
        "distinguish",
        "false",
        "statement",
        "group",
        "whole",
        "particular",
        "member",
        "group",
        "brown",
        "a",
        "presumably",
        "former",
        "consistent",
        "understanding",
        "hate",
        "speech",
        "groupbased",
        "phenomenon",
        "secondly",
        "implication",
        "view",
        "appears",
        "expands",
        "range",
        "thing",
        "would",
        "count",
        "hate",
        "speech",
        "speech",
        "call",
        "question",
        "basic",
        "standing",
        "certain",
        "group",
        "fall",
        "notion",
        "may",
        "make",
        "difficult",
        "distinguish",
        "contentious",
        "political",
        "speech",
        "hate",
        "speech",
        "perhaps",
        "lesson",
        "draw",
        "profusion",
        "disjunctive",
        "definition",
        "general",
        "skepticism",
        "definitive",
        "description",
        "hate",
        "speech",
        "might",
        "concur",
        "alexander",
        "brown",
        "hate",
        "speech",
        "equivocal",
        "term",
        "denoting",
        "family",
        "meaning",
        "brown",
        "b",
        "according",
        "brown",
        "hate",
        "speech",
        "term",
        "contested",
        "meaning",
        "rather",
        "systematically",
        "ambiguous",
        "say",
        "carry",
        "multiplicity",
        "different",
        "meaning",
        "b",
        "expression",
        "typically",
        "referred",
        "essentially",
        "contested",
        "term",
        "hunt",
        "univocal",
        "universal",
        "definition",
        "futile"
    ]
}