{
    "main_text": "What is Hate Speech? || The Harms of Hate Speech\n1.1 The Harms of Hate Speech\n\nThe harms that have been attributed to hate speech comprise a long and\nvaried list, ranging from the immediate psychological harms\nexperienced in the moment by the person(s) targeted by an instance of\nhate speech, to much more long-term impacts that affect not only those\ntargeted but whole communities, and even the strength of an entire\nnation.\n\nA distinction between “assaultive hate speech” and\n“propagandistic hate speech” is helpful when discussing\nthese harms (Langton 2012; 2018a; see also Gelber and McNamara (2016)\nwho discuss “face-to-face encounters” and\n“incidences of general circulation”). Hate speech yelled\nat an individual on the street, or from a passing car, is a\nface-to-face encounter, and an assaultive speech act. This is,\nmoreover, most often inter-group hate speech, where the speaker(s)\nare, for example, white, and the targets are non-white. On the other\nhand, propagandistic hate speech is often intra-group speech,\nspoken by members of one group to fellow ingroup members (e.g., a\nwhite person to other white people). The newsletter of the KKK,\ntherefore, would fit into this category.\n\nWhile this distinction is helpful to keep in mind, it should also not\nbe overstated. Summarizing the results of their study which surveyed\nthe experiences of the victims of hate speech, Katharine Gelber and\nLuke McNamara conclude that “the distinction between\nface-to-face encounters and general circulation hate speech is not\nalways clear in the everyday experiences of racism endured by\ntargets” (2016, 326). Any one instance of hate speech might fall\ninto both categories. For example, it may occur in its first instance\nas an assaultive speech act, and then reports of the event may then\ntake on a propagandistic aspect, as it is spread among the community.\nSimilarly, even if an instance of hate speech is intended as a piece\nof propaganda, it may, when encountered by a member of the community\nit disparages, be akin to assaultive speech.\n\nStill, this distinction helps reveal the wide range of the types\nof speech acts that are plausibly harmful, and also offers\ninsight into how they harm. For example, Waldron (2014)\nfocuses mainly on hate speech in its propagandistic mode, which he\nargues undermines the public assurance of equal social standing that\nmembers of non-dominant communities are entitled to—in his\nterms, their assurance of dignity. On this view, public hate\nspeech—e.g., flyers that read ‘Muslims\nOut!’—is “an environmental threat to social peace, a\nsort of slow-acting poison, accumulating here and there, word by\nword” (2014, 4). Its harm is therefore one that attacks the\nbroader society, and not just individuals targeted by hate speech.\n\nOn the other hand, the essays in the classic Words that Wound\ntend to focus more on what its authors term “assaultive\nspeech,” that is, “words that are used as weapons to\nambush, terrorize, wound, humiliate, and degrade” (Matsuda et\nal. 1993, 1). This leads them to focus more on hate speech’s\nability to produce “direct, immediate, and substantial\ninjury” (Lawrence, 1993, 57), such as “immediate mental or\nemotional distress” (Delgado, 1993, 93–94). On this\napproach, the most evident harms of hate speech are psychological.\nThese psychological injuries scale up, however, when hate speech is\nendemic, and so result in the types of community or social harms\nhighlighted by authors like Waldron. For this reason, the distinction\nbetween these approaches may be thought of as more a matter of\nemphasis.\n\nThis relationship between individual harms and broader social harms is\nalso evident once we acknowledge the long-term effects of hate speech\non victims, in addition to its more immediate impacts (Delgado and\nStefancic, 2004, 14). Victims of hate speech may first experience\n“psychological symptoms and emotional distress” like\nheightened stress and fear in the immediate aftermath of assaultive\nhate speech, but they may also experience far-ranging consequences if\nthey “modify their behavior and demeanor” to avoid\nreceiving further hate messages, limiting their ability to participate\nfully in society (Matsuda, 1993, 24). Gelber and McNamara’s\ninterview subjects confirm this complex web of effects that hate\nspeech may cause, highlighting how “harms are often enduring and\nnot ephemeral” (2016, 336). In this way, hate speech is both an\nimmediate attack on one’s health and dignity, along with a\nthreat to their community’s position in society. The cumulative\neffect of hate speech events, therefore, is a collection of harms\nlocated both in individuals and communities, which blurs the\ndistinction between assaultive and propagandistic hate speech\nevents.\nConstitutive and Consequential Harms\n\nAnother distinction which is similarly helpful, but also fraught, is\nthe distinction between constitutive and\nconsequential harms—that is, harms that occur\nin the saying of some utterance of hate speech, and those\nthat are its downstream results (see Maitra and McGowan, 2012, 6).\nThis distinction draws on the speech act theory of J.L. Austin (1962)\nand has served an important role in the examination of hate speech\nfrom feminist philosophers of language (see, e.g., Langton, 1993;\n2012; Maitra and McGowan, 2012; Maitra, 2012; McGowan, 2004; 2009;\n2012; 2019; and others). Constitutive harms are those that correspond\nto what Austin called the illocutionary act, the act\nperformed in saying X, while consequential harms correspond\nto perlocutionary effects, the results brought about by\nsaying X. Most (though not all) of the harms surveyed above\ncomprise consequential harms, as items such as psychological injury,\nfeelings of fear, and societal withdrawal all most naturally fall into\nthe perlocutionary effects category.\n\nHowever, philosophers have also drawn attention to how hate speech can\ninjure in a different way by indirectly affecting the positions of the\nsocial groups targeted by hate in a social hierarchy. That is,\n“by fixing facts about the distribution of social power,\nincluding facts about who has this power, and who lacks it” hate\nspeech harms in a way not captured in the above account of individual\ninjuries and their cumulative effects (Maitra and McGowan, 2012, 7).\nThis is an immediate harm that occurs in the saying of the\nspeech act, which (given appropriate circumstances and uptake)\nproduces a shift in the normative landscape. It is in this way that an\ninstance of hate speech may not only cause the injuries surveyed above\nbut may also, for example, rank Indigenous Peoples as\ninferior, legitimate discriminatory behavior towards them\n(perhaps via incitement), or potentially silence them. (We\nreturn to the notion of silencing as an illocutionary harm of hate\nspeech in Section 4 below.)\n\nOne reason to direct our attention towards the constitutive harms of\nhate speech is its potential to productively advance the debate over\nthe legitimacy of potential restrictions. Mary Kate McGowan (2009) has\nmade this case most explicitly. “Rather than focus on what a\ncertain category of speech causes,” she writes, we ought to be\n“interested in what such speech actually does, in and of\nitself” (2009, 389–90). The idea here is that by focusing\nonly on the harms caused by hate speech, we are inevitably\ndrawn into a debate about balancing the costs and benefits of\npermitting or regulating speech, which often leads to an impasse.\nAlternatively, turning our attention to the acts hate speech\nconstitutes can reveal features that help us avoid question of\nbalancing harms, and opens the door to regulation. On this approach,\nsome instances of hate speech can be seen to constitute acts of\n(verbal) discrimination, and should be considered analogous to other\nacts of discrimination—like posting a ‘Whites Only’\nsign up at a hotel—that US law recognizes as illegal. As a\nspeech act, hate speech can enact discriminatory rules in much the\nsame way the physical sign does, and so ought to similarly be\nrestricted (McGowan, 2012). This argument proceeds by a development of\nAustin’s notion of “exercitives,” which are speech\nacts that enact rules in a given domain, and is one example of the\nfruitful use of speech act theory to the philosophy of hate\nspeech.\n\nAt the same time, however, it’s worth acknowledging that the\ndistinction that this analysis relies on—between illocutionary\nacts and perlocutionary effects—is one that some argue is\nuntenable (for one example, see Kukla, 2014). As illocutionary acts\nare indeterminate or incomplete without some form of audience uptake,\nit is difficult to articulate precisely how we ought to distinguish a\nspeech act’s effects from its inherent qualities. Furthermore,\nthe testimonials of victims of hate speech “suggests that there\nis a close and complex relationship between constitutive and\nconsequential harms, and the harms are experienced cumulatively”\n(Gelber and McNamara 2016, 336–37). As such, any attempt to draw\ntoo neat of a distinction between these two types of harm risks\nmisrepresenting victims’ experiences, and might tie the attempt\nto restrict hate speech unhelpfully to a philosophically contested\ndistinction.\n\nAs a result, some caution must be applied when marking too stark of a\ncontrast between these harms. Much like the distinction between\nassaultive and propagandistic hate speech, then, we can consider the\ndistinction between consequential and constitutive harms to be\nanalytically helpful in exploring the variety of harms attributable to\nhate speech, while recognizing that it is at the same time an\nabstraction from the on-the-ground realities of hate speech.\n",
    "section_title": "1.1 The Harms of Hate Speech",
    "entry_title": "Hate Speech",
    "hierarchy_title": "Hate Speech || What is Hate Speech? || The Harms of Hate Speech",
    "tokenized_text": [
        "hate",
        "speech",
        "harm",
        "hate",
        "speech",
        "harm",
        "hate",
        "speech",
        "harm",
        "attributed",
        "hate",
        "speech",
        "comprise",
        "long",
        "varied",
        "list",
        "ranging",
        "immediate",
        "psychological",
        "harm",
        "experienced",
        "moment",
        "person",
        "targeted",
        "instance",
        "hate",
        "speech",
        "much",
        "longterm",
        "impact",
        "affect",
        "targeted",
        "whole",
        "community",
        "even",
        "strength",
        "entire",
        "nation",
        "distinction",
        "assaultive",
        "hate",
        "speech",
        "propagandistic",
        "hate",
        "speech",
        "helpful",
        "discussing",
        "harm",
        "langton",
        "a",
        "see",
        "also",
        "gelber",
        "mcnamara",
        "discus",
        "facetoface",
        "encounter",
        "incidence",
        "general",
        "circulation",
        "hate",
        "speech",
        "yelled",
        "individual",
        "street",
        "passing",
        "car",
        "facetoface",
        "encounter",
        "assaultive",
        "speech",
        "act",
        "moreover",
        "often",
        "intergroup",
        "hate",
        "speech",
        "speaker",
        "example",
        "white",
        "target",
        "nonwhite",
        "hand",
        "propagandistic",
        "hate",
        "speech",
        "often",
        "intragroup",
        "speech",
        "spoken",
        "member",
        "one",
        "group",
        "fellow",
        "ingroup",
        "member",
        "eg",
        "white",
        "person",
        "white",
        "people",
        "newsletter",
        "kkk",
        "therefore",
        "would",
        "fit",
        "category",
        "distinction",
        "helpful",
        "keep",
        "mind",
        "also",
        "overstated",
        "summarizing",
        "result",
        "study",
        "surveyed",
        "experience",
        "victim",
        "hate",
        "speech",
        "katharine",
        "gelber",
        "luke",
        "mcnamara",
        "conclude",
        "distinction",
        "facetoface",
        "encounter",
        "general",
        "circulation",
        "hate",
        "speech",
        "always",
        "clear",
        "everyday",
        "experience",
        "racism",
        "endured",
        "target",
        "one",
        "instance",
        "hate",
        "speech",
        "might",
        "fall",
        "category",
        "example",
        "may",
        "occur",
        "first",
        "instance",
        "assaultive",
        "speech",
        "act",
        "report",
        "event",
        "may",
        "take",
        "propagandistic",
        "aspect",
        "spread",
        "among",
        "community",
        "similarly",
        "even",
        "instance",
        "hate",
        "speech",
        "intended",
        "piece",
        "propaganda",
        "may",
        "encountered",
        "member",
        "community",
        "disparages",
        "akin",
        "assaultive",
        "speech",
        "still",
        "distinction",
        "help",
        "reveal",
        "wide",
        "range",
        "type",
        "speech",
        "act",
        "plausibly",
        "harmful",
        "also",
        "offer",
        "insight",
        "harm",
        "example",
        "waldron",
        "focus",
        "mainly",
        "hate",
        "speech",
        "propagandistic",
        "mode",
        "argues",
        "undermines",
        "public",
        "assurance",
        "equal",
        "social",
        "standing",
        "member",
        "nondominant",
        "community",
        "entitled",
        "toin",
        "term",
        "assurance",
        "dignity",
        "view",
        "public",
        "hate",
        "speecheg",
        "flyer",
        "read",
        "muslim",
        "is",
        "environmental",
        "threat",
        "social",
        "peace",
        "sort",
        "slowacting",
        "poison",
        "accumulating",
        "word",
        "word",
        "harm",
        "therefore",
        "one",
        "attack",
        "broader",
        "society",
        "individual",
        "targeted",
        "hate",
        "speech",
        "hand",
        "essay",
        "classic",
        "word",
        "wound",
        "tend",
        "focus",
        "author",
        "term",
        "assaultive",
        "speech",
        "word",
        "used",
        "weapon",
        "ambush",
        "terrorize",
        "wound",
        "humiliate",
        "degrade",
        "matsuda",
        "et",
        "al",
        "lead",
        "focus",
        "hate",
        "speech",
        "ability",
        "produce",
        "direct",
        "immediate",
        "substantial",
        "injury",
        "lawrence",
        "immediate",
        "mental",
        "emotional",
        "distress",
        "delgado",
        "approach",
        "evident",
        "harm",
        "hate",
        "speech",
        "psychological",
        "psychological",
        "injury",
        "scale",
        "however",
        "hate",
        "speech",
        "endemic",
        "result",
        "type",
        "community",
        "social",
        "harm",
        "highlighted",
        "author",
        "like",
        "waldron",
        "reason",
        "distinction",
        "approach",
        "may",
        "thought",
        "matter",
        "emphasis",
        "relationship",
        "individual",
        "harm",
        "broader",
        "social",
        "harm",
        "also",
        "evident",
        "acknowledge",
        "longterm",
        "effect",
        "hate",
        "speech",
        "victim",
        "addition",
        "immediate",
        "impact",
        "delgado",
        "stefancic",
        "victim",
        "hate",
        "speech",
        "may",
        "first",
        "experience",
        "psychological",
        "symptom",
        "emotional",
        "distress",
        "like",
        "heightened",
        "stress",
        "fear",
        "immediate",
        "aftermath",
        "assaultive",
        "hate",
        "speech",
        "may",
        "also",
        "experience",
        "farranging",
        "consequence",
        "modify",
        "behavior",
        "demeanor",
        "avoid",
        "receiving",
        "hate",
        "message",
        "limiting",
        "ability",
        "participate",
        "fully",
        "society",
        "matsuda",
        "gelber",
        "mcnamara",
        "interview",
        "subject",
        "confirm",
        "complex",
        "web",
        "effect",
        "hate",
        "speech",
        "may",
        "cause",
        "highlighting",
        "harm",
        "often",
        "enduring",
        "ephemeral",
        "way",
        "hate",
        "speech",
        "immediate",
        "attack",
        "one",
        "health",
        "dignity",
        "along",
        "threat",
        "community",
        "position",
        "society",
        "cumulative",
        "effect",
        "hate",
        "speech",
        "event",
        "therefore",
        "collection",
        "harm",
        "located",
        "individual",
        "community",
        "blur",
        "distinction",
        "assaultive",
        "propagandistic",
        "hate",
        "speech",
        "event",
        "constitutive",
        "consequential",
        "harm",
        "another",
        "distinction",
        "similarly",
        "helpful",
        "also",
        "fraught",
        "distinction",
        "constitutive",
        "consequential",
        "harmsthat",
        "harm",
        "occur",
        "saying",
        "utterance",
        "hate",
        "speech",
        "downstream",
        "result",
        "see",
        "maitra",
        "mcgowan",
        "distinction",
        "draw",
        "speech",
        "act",
        "theory",
        "jl",
        "austin",
        "served",
        "important",
        "role",
        "examination",
        "hate",
        "speech",
        "feminist",
        "philosopher",
        "language",
        "see",
        "eg",
        "langton",
        "maitra",
        "mcgowan",
        "maitra",
        "mcgowan",
        "others",
        "constitutive",
        "harm",
        "correspond",
        "austin",
        "called",
        "illocutionary",
        "act",
        "act",
        "performed",
        "saying",
        "x",
        "consequential",
        "harm",
        "correspond",
        "perlocutionary",
        "effect",
        "result",
        "brought",
        "saying",
        "x",
        "though",
        "harm",
        "surveyed",
        "comprise",
        "consequential",
        "harm",
        "item",
        "psychological",
        "injury",
        "feeling",
        "fear",
        "societal",
        "withdrawal",
        "naturally",
        "fall",
        "perlocutionary",
        "effect",
        "category",
        "however",
        "philosopher",
        "also",
        "drawn",
        "attention",
        "hate",
        "speech",
        "injure",
        "different",
        "way",
        "indirectly",
        "affecting",
        "position",
        "social",
        "group",
        "targeted",
        "hate",
        "social",
        "hierarchy",
        "fixing",
        "fact",
        "distribution",
        "social",
        "power",
        "including",
        "fact",
        "power",
        "lack",
        "hate",
        "speech",
        "harm",
        "way",
        "captured",
        "account",
        "individual",
        "injury",
        "cumulative",
        "effect",
        "maitra",
        "mcgowan",
        "immediate",
        "harm",
        "occurs",
        "saying",
        "speech",
        "act",
        "given",
        "appropriate",
        "circumstance",
        "uptake",
        "produce",
        "shift",
        "normative",
        "landscape",
        "way",
        "instance",
        "hate",
        "speech",
        "may",
        "cause",
        "injury",
        "surveyed",
        "may",
        "also",
        "example",
        "rank",
        "indigenous",
        "people",
        "inferior",
        "legitimate",
        "discriminatory",
        "behavior",
        "towards",
        "perhaps",
        "via",
        "incitement",
        "potentially",
        "silence",
        "return",
        "notion",
        "silencing",
        "illocutionary",
        "harm",
        "hate",
        "speech",
        "section",
        "one",
        "reason",
        "direct",
        "attention",
        "towards",
        "constitutive",
        "harm",
        "hate",
        "speech",
        "potential",
        "productively",
        "advance",
        "debate",
        "legitimacy",
        "potential",
        "restriction",
        "mary",
        "kate",
        "mcgowan",
        "made",
        "case",
        "explicitly",
        "rather",
        "focus",
        "certain",
        "category",
        "speech",
        "cause",
        "writes",
        "ought",
        "interested",
        "speech",
        "actually",
        "idea",
        "focusing",
        "harm",
        "caused",
        "hate",
        "speech",
        "inevitably",
        "drawn",
        "debate",
        "balancing",
        "cost",
        "benefit",
        "permitting",
        "regulating",
        "speech",
        "often",
        "lead",
        "impasse",
        "alternatively",
        "turning",
        "attention",
        "act",
        "hate",
        "speech",
        "constitutes",
        "reveal",
        "feature",
        "help",
        "u",
        "avoid",
        "question",
        "balancing",
        "harm",
        "open",
        "door",
        "regulation",
        "approach",
        "instance",
        "hate",
        "speech",
        "seen",
        "constitute",
        "act",
        "verbal",
        "discrimination",
        "considered",
        "analogous",
        "act",
        "discriminationlike",
        "posting",
        "white",
        "sign",
        "hotelthat",
        "u",
        "law",
        "recognizes",
        "illegal",
        "speech",
        "act",
        "hate",
        "speech",
        "enact",
        "discriminatory",
        "rule",
        "much",
        "way",
        "physical",
        "sign",
        "ought",
        "similarly",
        "restricted",
        "mcgowan",
        "argument",
        "proceeds",
        "development",
        "austin",
        "notion",
        "exercitives",
        "speech",
        "act",
        "enact",
        "rule",
        "given",
        "domain",
        "one",
        "example",
        "fruitful",
        "use",
        "speech",
        "act",
        "theory",
        "philosophy",
        "hate",
        "speech",
        "time",
        "however",
        "worth",
        "acknowledging",
        "distinction",
        "analysis",
        "relies",
        "onbetween",
        "illocutionary",
        "act",
        "perlocutionary",
        "effectsis",
        "one",
        "argue",
        "untenable",
        "one",
        "example",
        "see",
        "kukla",
        "illocutionary",
        "act",
        "indeterminate",
        "incomplete",
        "without",
        "form",
        "audience",
        "uptake",
        "difficult",
        "articulate",
        "precisely",
        "ought",
        "distinguish",
        "speech",
        "act",
        "effect",
        "inherent",
        "quality",
        "furthermore",
        "testimonial",
        "victim",
        "hate",
        "speech",
        "suggests",
        "close",
        "complex",
        "relationship",
        "constitutive",
        "consequential",
        "harm",
        "harm",
        "experienced",
        "cumulatively",
        "gelber",
        "mcnamara",
        "attempt",
        "draw",
        "neat",
        "distinction",
        "two",
        "type",
        "harm",
        "risk",
        "misrepresenting",
        "victim",
        "experience",
        "might",
        "tie",
        "attempt",
        "restrict",
        "hate",
        "speech",
        "unhelpfully",
        "philosophically",
        "contested",
        "distinction",
        "result",
        "caution",
        "must",
        "applied",
        "marking",
        "stark",
        "contrast",
        "harm",
        "much",
        "like",
        "distinction",
        "assaultive",
        "propagandistic",
        "hate",
        "speech",
        "consider",
        "distinction",
        "consequential",
        "constitutive",
        "harm",
        "analytically",
        "helpful",
        "exploring",
        "variety",
        "harm",
        "attributable",
        "hate",
        "speech",
        "recognizing",
        "time",
        "abstraction",
        "ontheground",
        "reality",
        "hate",
        "speech"
    ]
}