{
    "main_text": "Counteracting Hate Speech || Objections to Bans, and Some Responses\n5.2 Objections to Bans, and Some Responses\n\nThough many would agree that hate speech can have destructive effects,\nand that there is a moral imperative on the state to cultivate\nsomething like respectful relations between its members, objections to\nhate speech bans abound. In a wide-ranging response to these concerns,\nParekh (2012) considers (and rejects) six common objections to the\nprohibition of hate speech. These six objections are: (1) that the\nharm of hate speech, while real, is relatively minor and a small price\nto pay given the interest of democratic nations; (2) that bans are not\nthe answer, but rather “better ideas” and “more\nspeech” are; (3) that a prohibition would have a dangerous\n“chilling effect” and that hate speech bans are a slippery\nslope to all sorts of unwanted restrictions; (4) that bans give the\nstate too much power to judge the content of speech and decide what\ncan or cannot be said, threatening state-neutrality, skewing political\ndebate, and infringing on individual liberty; (5) that bans are an\nobjectionable form of paternalism or moral authoritarianism, and is\nincompatible with the assumption that humans are responsible and\nautonomous individuals and that society is made up of free and equal\ncitizens; and finally, (6) that bans are ineffective at changing\nattitudes and removing the hate from the hate speaker’s heart,\nwith the result that bans have the effect of moving extremists\nunderground, alienating them from wider society, and in doing so\nrendering us ignorant of their violent potential and impotent to\nengage in effective de-radicalization.\n\nEach of these concerns merits more space than can be given to them\nhere. Still, considering these objections to bans and the responses\navailable, even briefly, is illustrative of the theoretical concerns\nbans on hate speech bring forth (see the list of references for fuller\ndevelopment of the relevant theoretical and empirical issues). Again\nfollowing Parekh (2012, 47–54), we can approach these objections\nas follows.\n\nIn response to (1), the objection that the interests of a vibrant\ndemocracy outweigh the harms imposed by hate speech, it may be argued\nthat hate speech does not embody the values of free speech but, in\nfact, undermines them by promoting irrational fears and hatred over\nreasoned arguments and public scrutiny. How powerful one takes this\nresponse to be depends directly on what one takes the value and\njustification of a right to free expression to be, which is of course\na matter of dispute.\n\nOne response to (2), the common ‘more speech’ objection,\nis to note that the “marketplace of ideas” is not neutral,\nand likely requires some regulation (just like a marketplace of other\ngoods). This is what a ban does, and so may be considered to be\nhelping ensure ‘fair competition’ by countering prevailing\nprejudices, and encouraging greater participation from the members of\ncommunities targeted by hate speech. In other words, bans on hate\nspeech may promote greater freedom of expression, by preventing the\ntype of silencing considered above.\n\nWhile acknowledging the worries of (3), namely that of a\n‘chilling effect’ or a ‘slippery slope,’\nrepresent an important objection, we may respond by noting that the\nproblems these signal rest on the vague wording and inconsistent or\nbiased application of hate speech bans. They are not, therefore,\ndirect objections to hate speech bans as such. The remedy, therefore,\nlies in correcting these aspects of a ban, rather than abandoning it\naltogether. Moreover, the appeal to a ‘slippery slope’ may\nbe inapt, as it implies that once one type of speech is prohibited,\nsociety cannot help but prohibit even more types. But we have no clear\nreason to suppose that this is the case, as existing bans on\ndefamation have not led to bans on fair critical comment, for\nexample.\n\nThe worries at the core of objection (4) represents a well-founded\nfear of the state, and so must be taken seriously. But, to defenders\nof hate speech bans, its understanding of the threat that hate speech\nbans pose to state-neutrality is nonetheless flawed. It fails to\nrecognize that the state often already judges the content of\nspeech (e.g., in banning commercial fraud, criminal solicitation,\npublic displays of obscenity) and often elides neutrality when it\nspeaks in favor of certain positions (e.g., the value of human\ndignity, equality, liberty). While any defense of hate speech bans\nmust reckon with the possibility of further empowering the state,\nopponents ought not misrepresent the status quo, exaggerating the\nreality of state-neutrality.\n\nObjections grounded on the threat of paternalism or moral\nauthoritarianism, like (5), are similarly serious. However, one\nresponse on behalf of bans would be to point out how autonomy is\nalways exercised under certain conditions and requires various\nexternal circumstances for its development and use. When appealing to\npersonal autonomy, therefore, we should not idealize too greatly so\nthat its real-world exercise is ignored. Rather, the threats that\nracism and bigotry pose for autonomy must also be acknowledged,\nalongside praise for our rational faculties.\n\nOne response to (6), that bans are ineffective at changing attitudes,\nis to admit the law cannot change attitudes (like hatred) directly and\nmaintain that this is no knock against the law, and indeed is no\nproblem for hate speech bans. The aim of these bans, in most cases, is\nnot to prevent hatred but to prevent the harm that the public\nexpression of hate can cause. The indirect effects of such a law,\nhowever, are an empirical matter, and it is unlikely they admit of a\nsingle, general answer, but are highly context-dependent. The subject\nof the practicability of hate speech bans deserves special attention,\nhowever. Opponents to bans may worry that the suppression of hate\nspeech is likely to backfire, not only by failing to reduce hatred,\nbut by increasing the sense of oppression and victimization\nthat many bigots thrive on, leading to an escalation of racist\nviolence (Baker, 2012, 77). Again, as an empirical hypothesis, it\ncannot be settled simply from the armchair. Still, a further response\navailable on behalf of hate speech bans would be to question the\nlegitimacy of this objection. If, by hypothesis, bans generated an\nincrease in violence, it would still be the responsibility of the\nstate to manage this violence effectively. The role of the state is\nnot exhausted by implementing a ban, but must be seen alongside its\nenforcement.\n\nThis, however, leads to a slightly different objection. The opponent\nof bans may worry that the enforcement of laws against hate speech\nwould divert the state’s energies away from more effective\nmeasures against hated, such as “those directed at changing\nmaterial conditions in which racism festers, material conditions of\nboth the purveyors and targets of hate” (Baker, 2012, 77). That\nis, the energies and resources that would be directed towards\nestablishing and enforcing hate speech bans may be better spent on\nalternative policies. The guiding thought rests on two important\npoints. First, that the intended ends of hate speech bans (e.g.,\nreduction in the harms of hate speech that fall on those targeted by\nit, mitigation of the expansion of racist attitudes, lessening\noccurrences of violent hate crimes) may be more effectively achieved\nvia different means, such as reducing inequality, improving social\nsafety nets, political empowerment, and more. Second, though the state\ncan do more than one thing at once, it is nonetheless working with\nlimited resources, and efficiency is a value. That these alternative\npolicy options may indeed be more effective is an unresolved empirical\nmatter. And it remains an open question whether indirect approaches\nlike this would fail to achieve the expressive ends of hate speech\nbans, which more directly communicate to those targeted by hate speech\nthat they are valued members society.\n\nMany of the claims made above, both on behalf of bans and in\nopposition, raise theoretical and empirical issues whose proper\nexamination spans many articles and books. Suffice to say that the\ndebate over bans is a highly contested one, and each position rests on\nan understanding of such issues as the value of free expression, the\nharm of hate speech, the likely effects a ban might have in a\nparticular context, and so on. For instance, one who believes that\nfree expression is valuable in part because of its role in democratic\ndecision-making may maintain that specifically political\nspeech deserves increased protections, and that some of what others\nregard as hate speech might fall into this category, escaping\nregulation. Alternatively, one may view the immunity for political\nspeech as perhaps a red herring. On the speech act theoretic framework\noutlined above, some forms of racist hate speech are functionally\nidentical to a ‘Whites Only’ sign hanging in a public\nrestaurant (McGowan 2012; McGowan and Maitra 2009). The latter\nexpresses a political opinion in the same way as the former expression\ndoes, but it is also regarded as unlawful racially discriminatory. The\nsame considerations—legal sanction—might therefore apply\nto the verbal utterance as the written sign, and the appeal to the\npolitical content of the message is irrelevant.\n",
    "section_title": "5.2 Objections to Bans, and Some Responses",
    "entry_title": "Hate Speech",
    "hierarchy_title": "Hate Speech || Counteracting Hate Speech || Objections to Bans, and Some Responses",
    "tokenized_text": [
        "counteracting",
        "hate",
        "speech",
        "objection",
        "ban",
        "response",
        "objection",
        "ban",
        "response",
        "though",
        "many",
        "would",
        "agree",
        "hate",
        "speech",
        "destructive",
        "effect",
        "moral",
        "imperative",
        "state",
        "cultivate",
        "something",
        "like",
        "respectful",
        "relation",
        "member",
        "objection",
        "hate",
        "speech",
        "ban",
        "abound",
        "wideranging",
        "response",
        "concern",
        "parekh",
        "considers",
        "reject",
        "six",
        "common",
        "objection",
        "prohibition",
        "hate",
        "speech",
        "six",
        "objection",
        "harm",
        "hate",
        "speech",
        "real",
        "relatively",
        "minor",
        "small",
        "price",
        "pay",
        "given",
        "interest",
        "democratic",
        "nation",
        "ban",
        "answer",
        "rather",
        "better",
        "idea",
        "speech",
        "prohibition",
        "would",
        "dangerous",
        "chilling",
        "effect",
        "hate",
        "speech",
        "ban",
        "slippery",
        "slope",
        "sort",
        "unwanted",
        "restriction",
        "ban",
        "give",
        "state",
        "much",
        "power",
        "judge",
        "content",
        "speech",
        "decide",
        "said",
        "threatening",
        "stateneutrality",
        "skewing",
        "political",
        "debate",
        "infringing",
        "individual",
        "liberty",
        "ban",
        "objectionable",
        "form",
        "paternalism",
        "moral",
        "authoritarianism",
        "incompatible",
        "assumption",
        "human",
        "responsible",
        "autonomous",
        "individual",
        "society",
        "made",
        "free",
        "equal",
        "citizen",
        "finally",
        "ban",
        "ineffective",
        "changing",
        "attitude",
        "removing",
        "hate",
        "hate",
        "speaker",
        "heart",
        "result",
        "ban",
        "effect",
        "moving",
        "extremist",
        "underground",
        "alienating",
        "wider",
        "society",
        "rendering",
        "u",
        "ignorant",
        "violent",
        "potential",
        "impotent",
        "engage",
        "effective",
        "deradicalization",
        "concern",
        "merit",
        "space",
        "given",
        "still",
        "considering",
        "objection",
        "ban",
        "response",
        "available",
        "even",
        "briefly",
        "illustrative",
        "theoretical",
        "concern",
        "ban",
        "hate",
        "speech",
        "bring",
        "forth",
        "see",
        "list",
        "reference",
        "fuller",
        "development",
        "relevant",
        "theoretical",
        "empirical",
        "issue",
        "following",
        "parekh",
        "approach",
        "objection",
        "follows",
        "response",
        "objection",
        "interest",
        "vibrant",
        "democracy",
        "outweigh",
        "harm",
        "imposed",
        "hate",
        "speech",
        "may",
        "argued",
        "hate",
        "speech",
        "embody",
        "value",
        "free",
        "speech",
        "fact",
        "undermines",
        "promoting",
        "irrational",
        "fear",
        "hatred",
        "reasoned",
        "argument",
        "public",
        "scrutiny",
        "powerful",
        "one",
        "take",
        "response",
        "depends",
        "directly",
        "one",
        "take",
        "value",
        "justification",
        "right",
        "free",
        "expression",
        "course",
        "matter",
        "dispute",
        "one",
        "response",
        "common",
        "speech",
        "objection",
        "note",
        "marketplace",
        "idea",
        "neutral",
        "likely",
        "requires",
        "regulation",
        "like",
        "marketplace",
        "good",
        "ban",
        "may",
        "considered",
        "helping",
        "ensure",
        "fair",
        "competition",
        "countering",
        "prevailing",
        "prejudice",
        "encouraging",
        "greater",
        "participation",
        "member",
        "community",
        "targeted",
        "hate",
        "speech",
        "word",
        "ban",
        "hate",
        "speech",
        "may",
        "promote",
        "greater",
        "freedom",
        "expression",
        "preventing",
        "type",
        "silencing",
        "considered",
        "acknowledging",
        "worry",
        "namely",
        "chilling",
        "effect",
        "slippery",
        "slope",
        "represent",
        "important",
        "objection",
        "may",
        "respond",
        "noting",
        "problem",
        "signal",
        "rest",
        "vague",
        "wording",
        "inconsistent",
        "biased",
        "application",
        "hate",
        "speech",
        "ban",
        "therefore",
        "direct",
        "objection",
        "hate",
        "speech",
        "ban",
        "remedy",
        "therefore",
        "lie",
        "correcting",
        "aspect",
        "ban",
        "rather",
        "abandoning",
        "altogether",
        "moreover",
        "appeal",
        "slippery",
        "slope",
        "may",
        "inapt",
        "implies",
        "one",
        "type",
        "speech",
        "prohibited",
        "society",
        "help",
        "prohibit",
        "even",
        "type",
        "clear",
        "reason",
        "suppose",
        "case",
        "existing",
        "ban",
        "defamation",
        "led",
        "ban",
        "fair",
        "critical",
        "comment",
        "example",
        "worry",
        "core",
        "objection",
        "represents",
        "wellfounded",
        "fear",
        "state",
        "must",
        "taken",
        "seriously",
        "defender",
        "hate",
        "speech",
        "ban",
        "understanding",
        "threat",
        "hate",
        "speech",
        "ban",
        "pose",
        "stateneutrality",
        "nonetheless",
        "flawed",
        "fails",
        "recognize",
        "state",
        "often",
        "already",
        "judge",
        "content",
        "speech",
        "eg",
        "banning",
        "commercial",
        "fraud",
        "criminal",
        "solicitation",
        "public",
        "display",
        "obscenity",
        "often",
        "elides",
        "neutrality",
        "speaks",
        "favor",
        "certain",
        "position",
        "eg",
        "value",
        "human",
        "dignity",
        "equality",
        "liberty",
        "defense",
        "hate",
        "speech",
        "ban",
        "must",
        "reckon",
        "possibility",
        "empowering",
        "state",
        "opponent",
        "ought",
        "misrepresent",
        "status",
        "quo",
        "exaggerating",
        "reality",
        "stateneutrality",
        "objection",
        "grounded",
        "threat",
        "paternalism",
        "moral",
        "authoritarianism",
        "like",
        "similarly",
        "serious",
        "however",
        "one",
        "response",
        "behalf",
        "ban",
        "would",
        "point",
        "autonomy",
        "always",
        "exercised",
        "certain",
        "condition",
        "requires",
        "various",
        "external",
        "circumstance",
        "development",
        "use",
        "appealing",
        "personal",
        "autonomy",
        "therefore",
        "idealize",
        "greatly",
        "realworld",
        "exercise",
        "ignored",
        "rather",
        "threat",
        "racism",
        "bigotry",
        "pose",
        "autonomy",
        "must",
        "also",
        "acknowledged",
        "alongside",
        "praise",
        "rational",
        "faculty",
        "one",
        "response",
        "ban",
        "ineffective",
        "changing",
        "attitude",
        "admit",
        "law",
        "change",
        "attitude",
        "like",
        "hatred",
        "directly",
        "maintain",
        "knock",
        "law",
        "indeed",
        "problem",
        "hate",
        "speech",
        "ban",
        "aim",
        "ban",
        "case",
        "prevent",
        "hatred",
        "prevent",
        "harm",
        "public",
        "expression",
        "hate",
        "cause",
        "indirect",
        "effect",
        "law",
        "however",
        "empirical",
        "matter",
        "unlikely",
        "admit",
        "single",
        "general",
        "answer",
        "highly",
        "contextdependent",
        "subject",
        "practicability",
        "hate",
        "speech",
        "ban",
        "deserves",
        "special",
        "attention",
        "however",
        "opponent",
        "ban",
        "may",
        "worry",
        "suppression",
        "hate",
        "speech",
        "likely",
        "backfire",
        "failing",
        "reduce",
        "hatred",
        "increasing",
        "sense",
        "oppression",
        "victimization",
        "many",
        "bigot",
        "thrive",
        "leading",
        "escalation",
        "racist",
        "violence",
        "baker",
        "empirical",
        "hypothesis",
        "settled",
        "simply",
        "armchair",
        "still",
        "response",
        "available",
        "behalf",
        "hate",
        "speech",
        "ban",
        "would",
        "question",
        "legitimacy",
        "objection",
        "hypothesis",
        "ban",
        "generated",
        "increase",
        "violence",
        "would",
        "still",
        "responsibility",
        "state",
        "manage",
        "violence",
        "effectively",
        "role",
        "state",
        "exhausted",
        "implementing",
        "ban",
        "must",
        "seen",
        "alongside",
        "enforcement",
        "however",
        "lead",
        "slightly",
        "different",
        "objection",
        "opponent",
        "ban",
        "may",
        "worry",
        "enforcement",
        "law",
        "hate",
        "speech",
        "would",
        "divert",
        "state",
        "energy",
        "away",
        "effective",
        "measure",
        "hated",
        "directed",
        "changing",
        "material",
        "condition",
        "racism",
        "fester",
        "material",
        "condition",
        "purveyor",
        "target",
        "hate",
        "baker",
        "energy",
        "resource",
        "would",
        "directed",
        "towards",
        "establishing",
        "enforcing",
        "hate",
        "speech",
        "ban",
        "may",
        "better",
        "spent",
        "alternative",
        "policy",
        "guiding",
        "thought",
        "rest",
        "two",
        "important",
        "point",
        "first",
        "intended",
        "end",
        "hate",
        "speech",
        "ban",
        "eg",
        "reduction",
        "harm",
        "hate",
        "speech",
        "fall",
        "targeted",
        "mitigation",
        "expansion",
        "racist",
        "attitude",
        "lessening",
        "occurrence",
        "violent",
        "hate",
        "crime",
        "may",
        "effectively",
        "achieved",
        "via",
        "different",
        "mean",
        "reducing",
        "inequality",
        "improving",
        "social",
        "safety",
        "net",
        "political",
        "empowerment",
        "second",
        "though",
        "state",
        "one",
        "thing",
        "nonetheless",
        "working",
        "limited",
        "resource",
        "efficiency",
        "value",
        "alternative",
        "policy",
        "option",
        "may",
        "indeed",
        "effective",
        "unresolved",
        "empirical",
        "matter",
        "remains",
        "open",
        "question",
        "whether",
        "indirect",
        "approach",
        "like",
        "would",
        "fail",
        "achieve",
        "expressive",
        "end",
        "hate",
        "speech",
        "ban",
        "directly",
        "communicate",
        "targeted",
        "hate",
        "speech",
        "valued",
        "member",
        "society",
        "many",
        "claim",
        "made",
        "behalf",
        "ban",
        "opposition",
        "raise",
        "theoretical",
        "empirical",
        "issue",
        "whose",
        "proper",
        "examination",
        "span",
        "many",
        "article",
        "book",
        "suffice",
        "say",
        "debate",
        "ban",
        "highly",
        "contested",
        "one",
        "position",
        "rest",
        "understanding",
        "issue",
        "value",
        "free",
        "expression",
        "harm",
        "hate",
        "speech",
        "likely",
        "effect",
        "ban",
        "might",
        "particular",
        "context",
        "instance",
        "one",
        "belief",
        "free",
        "expression",
        "valuable",
        "part",
        "role",
        "democratic",
        "decisionmaking",
        "may",
        "maintain",
        "specifically",
        "political",
        "speech",
        "deserves",
        "increased",
        "protection",
        "others",
        "regard",
        "hate",
        "speech",
        "might",
        "fall",
        "category",
        "escaping",
        "regulation",
        "alternatively",
        "one",
        "may",
        "view",
        "immunity",
        "political",
        "speech",
        "perhaps",
        "red",
        "herring",
        "speech",
        "act",
        "theoretic",
        "framework",
        "outlined",
        "form",
        "racist",
        "hate",
        "speech",
        "functionally",
        "identical",
        "white",
        "sign",
        "hanging",
        "public",
        "restaurant",
        "mcgowan",
        "mcgowan",
        "maitra",
        "latter",
        "express",
        "political",
        "opinion",
        "way",
        "former",
        "expression",
        "also",
        "regarded",
        "unlawful",
        "racially",
        "discriminatory",
        "considerationslegal",
        "sanctionmight",
        "therefore",
        "apply",
        "verbal",
        "utterance",
        "written",
        "sign",
        "appeal",
        "political",
        "content",
        "message",
        "irrelevant"
    ]
}