{
    "main_text": "Slurs, Code Words, and Dogwhistles || Dogwhistles and Coded Language\n3.2 Dogwhistles and Coded Language\n\nIn addition to slurs, which are explicitly derogatory, researchers\nhave also focused on more implicit forms of derogatory communication.\nTali Mendelberg (2001), Ian Haney Lopez (2015), Jennifer Saul (2018)\nand Justin Khoo (2017) detail the use of racially coded\nlanguage—dogwhistles—to access existing racial\nresentment while making surreptitious racial appeals. Saul provides a\nuseful set of distinctions for thinking about dogwhistles: they can be\nexplicit or implicit, and further,\nintentional or unintentional. Saul uses the work of\nlinguist Kimberly Witten to define an overt intentional\ndogwhistle as,\n\na speech act designed, with intent, to allow two plausible\ninterpretations, with one interpretation being a private, coded\nmessage targeted for a subset of the general audience, and concealed\nin such a way that this general audience is unaware of the existence\nof the second, coded interpretation. (2018, 362)\n\n\nSaul illustrates this kind of dogwhistle with an example from George\nW. Bush’s 2003 State of the Union speech:\n\n(3.4)\nYes there’s power, wonder-working power, in the goodness and\nidealism and faith of the American people.\n\n\nThe phrase ‘wonder-working power’ is meant as an overt\nintentional dogwhistle for Evangelical Christians. According to Saul,\nthere are two possible messages Evangelicals can take away from\nBush’s utterance. The first message is simply a translation:\n\nYes there’s power, the power of Christ, in the goodness and\nidealism and faith of the American people. (362)\n\n\nThe second message is that Bush identifies with them, that he speaks\ntheir language. Saul thinks both are instances of overt intentional\ndogwhistles.\n\nA covert dogwhistle, according to Saul, is “a\ndogwhistle that people fail to consciously recognize” (2018,\n365). She is particularly interested in how covert intentional\ndogwhistles work in tandem with what psychologists have referred to as\nracial resentment, a belief system that is measured by the\ndegree to which participants agree to the following four claims:\n\nBlacks no longer face much discrimination;\nTheir disadvantage mainly reflects their poor work ethic;\nThey are demanding too much too fast;\nThey have gotten more than they deserve. (2018, 364 quoting Tesler\n& Sears 2010, 18)\n\n\nAccording to Mendelberg, racial resentment remains widespread among\nwhite Americans even though explicitly racist appeals have come to be\nviewed as outside the bounds of acceptable political speech. (At\nleast, that seemed to be the case up until the 2016 presidential\nelection cycle.) White voters, on this model, tend to shy away from\naccepting explicitly racist proposals because they do not want to\nthink of themselves as racist. The existence of racial resentment\nallows for the skilled intentional use of utterances that are\nunrelated to race on the surface yet access negative racial attitudes\nin a targeted audience, nudging them towards a particular course of\naction--e.g., voting for a preferred candidate.\n\nAn example of a covert intentional dogwhistle is the infamous Willie\nHorton ad used by the George H. W. Bush campaign in 1988. The ad\ntargeted a prison furlough program in place during Michael\nDukakis’s term as governor of Massachusetts. It presented a\npicture of Horton, an African American man, who while out on furlough\nraped a white woman and stabbed her husband. Though there was no\nexplicit mention of race, it was clear to many that the ad drew on\nracial tropes about Blackness and criminality to stoke fear in white\nvoters. In support of the interpretation that this was a\ncovert dogwhistle, Saul notes that once the specter of race\nwas raised about the ad, its effectiveness started to wane (2018,\n366). The implication is that while the explicit appeal to racial\nresentment was a losing strategy, implicit appeal in the form of\ncovert dogwhistles could be put to powerful use.\n\nThe unintentional dogwhistle is defined as an “unwitting use of\nwords and/or images that, used intentionally, constitute an\nintentional dogwhistle, where this use has the same effect as an\nintentional dogwhistle” (2018, 368). Dogwhistles of this sort\nare passed on by unwitting others while achieving similar effects of\nthe original intentional one. A special case of unintentional\ndogwhistles, what Saul calls amplifier dogwhistles, occurred\nwhen reporters and TV producers played the Willie Horton ad\nrepeatedly. Presumably, the repeated presentations continued to make\nthe associations between Blackness and criminality and, thus,\ncontinued to stoke fear and racial anxiety in significant portions of\nthe white viewing public. For Saul, dogwhistles are therefore best\nunderstood functionally, and the difference in speaker-intentions\nbetween intentional and unintentional dogwhistles matters only insofar\nas we define them—their effects, in other words, are often\nidentical.\n\nThe use of implicit means like dogwhistling—in both its covert\nand overt forms—can make the conceptualization and detection of\nhate speech more difficult. Undoubtedly, this poses a challenge for\ndefining hate speech since dogwhistles are often designed to be\ninnocuous. But what is it that explains the effects often attributed\nto dogwhistles? That is, how is it possible for language to work in\nthis way?\n\nPerhaps there is good reason to think something about\ndogwhistles’ meaning explains their effects. Consider, first, an\nambiguity thesis that states code words have at least two meanings, a\nracial and a non-racial meaning. The expression ‘inner\ncity’ in\n\n(3.5)\nFood stamp programs help many inner-city families,\n\n\npurportedly expresses two meanings: (i) densely populated, high crime,\nurban areas, or (ii) poor African American (Khoo, 2017, 40). An\nambiguous expression can be used in an utterance to produce a\nstatement that leaves undetermined which interpretation is intended by\nthe speaker.\n\nOne worry, however, is that terms like ‘inner city’ are\nnot actually ambiguous. Khoo argues these terms do not behave like\ngenuinely ambiguous expressions. Compare the following two\nsentences,\n\n(3.6)\nSmith is a funny man who is not humorous.\n(3.7)\nSmith is an inner-city pastor who is from, works, and lives in the\nsuburbs.\n\n\nA reading of (3.6) is supposed to sound coherent given that\n‘funny’ can mean ‘humorous’ or\n‘strange’ whereas (3.7) is supposed to sound odd, even\ncontradictory. If ‘inner-city’ were genuinely ambiguous in\nthe way described above, we should be able to use it to mean\n‘African American’ and get a coherent reading of\n(3.7).\n\nA second view posits two dimensions of meaning for code words,\nat-issue and not-at-issue content. At-issue content\nis the main point of a speaker’s utterance, the directly\nasserted content that is foregrounded whereas not-at-issue content is\nprojective, meaning it is able to survive embedding under\noperators like negation and modals (Tonhauser, 2012). Consider,\n\n(3.8)\nJohn stopped smoking.\n\n\nThe at-issue content of (3.8) is represented by (a) and the\nnot-at-issue by (b):\n\nJohn does not smoke.\nJohn used to smoke.\n\n\nNote the difficulty in directly denying the not-at-issue content. If\none were to follow an utterance of (3.8) with,\n\n(3.8′)\nHe did not used to smoke.\n\n\nyou would presumably find this odd and incoherent. A much more\nelaborate statement is needed to deny the not-at-issue content.\n\nApplying this to view to ‘inner-city’ in (3.5), we end up\nwith:\n\nAt-issue: A poor, densely populated, high-crime,\nurban area.\nNot-at-issue: Those living in such areas are\nmostly African American.\n\n\nBecause the racial component of (3.5) is not-at-issue, we have a\nreasonable explanation for why the following pair of sentences\nclash,\n\n(3.9)\nFood stamp programs help many inner-city families.\n(3.10)\nNo, poor, high-crime, urban areas are mostly white.\n\n\nAn objection to this view is that code words do not display\nnon-cancelability the way not-at-issue content typically\ndoes; “someone cannot disavow commitment to the\nnot-at-issue content of a sentence S that she utters merely\nby following up her utterance by asserting the negation of that\ncontent” (Khoo, 45). Consider,\n\n(3.11)\nJohn stopped smoking. He never smoked at all.\n(3.12)\nFood stamp programs help many inner-city families, most of whom\nare white.\n\n\nThe juxtaposition of sentences in (3.11) is supposed to strike the\nreader as contradictory while those in (3.12) should not.\n\nAccording to a third view, code words are neither ambiguous nor\nmultidimensional, but possess only nonracial meaning. What explains\nthe phenomenon associated with terms like ‘inner city’ is\nthe presence of an antecedent belief in the audience member that then\nallows them to infer the racial component. For example, an audience\nmember may already believe\n\nPre-existing Belief (PB):\n\nThe inner city is mostly populated by poor African Americans,\n\n\nso that when hearing a politician proclaim (3.5), the audience member\ncomes to infer\n\nRacial Inference (RI):\n\nThe food stamp program will primarily benefit poor African Americans.\n\n\nA contrasting view that draws on the same simple semantics is what\nKhoo calls the association-driven theory of code words. On\nthis view, there is “an association between ‘inner\ncity’ (or the concept INNER CITY) and the concept AFRICAN\nAMERICAN (or maybe just RACE) which then primes racist beliefs and\nprejudices” (2017, 50).\n\nKhoo’s account is simple and compelling, but we may still wonder\nwhether it is too liberal. For instance, expressions like\n‘thug,’ ‘illegal alien,’ ‘welfare\nqueen,’ and ‘terrorist’ seem to behave like the\nterms Khoo identifies as code words, yet they are generally understood\nto be explicitly racial in nature. Patrick O’Donnell (2017)\nargues that the aforementioned expressions are not code words but\nracialized terms. O’Donnell characterizes the\ndifference between racialized terms and code words in the following\nway:\n\nRacialized terms involve direct or predicative\nrelations between a term and a racialized group whereas code words\ninvolve indirect inferential or associational relations, and\nRacialized terms elicit racial resentment by making salient\nrace-specific interpretive options, whereas code words function by\nmaking salient race-neutral interpretive options (2017, 28).\n\n\nO’Donnell agrees with Khoo that code words are picked out\naccording to their contextual cognitive-pragmatic role, while claiming\nthat this role differs between code words and racialized terms.\n\nDetermining whether dogwhistles or coded language count as merely\ncontentious claims that must be tolerated or as hate speech subject to\nregulation has implications for broader discussions. The subtlety of\ncoded language, for instance, calls its status as hate speech into\nquestion. The impact coded language has on an audience lacks the kind\nof immediacy often attributed to hate speech. Lawrence (1993), for\nexample, notes that hate speech is often experienced by targets as a\nslap in the face. On the other hand, Mendelberg’s account\nsuggests coded speech can incite racial resentment, and so it may be\nmore aptly considered similar to propagandistic hate speech, discussed\nabove. (For more on this point, see Jason Stanley (2015).) This would\nappear to get us closer to how hate speech is purported to function,\nnamely, by inciting racial hatred. Whether it is close enough is of\ncourse open for debate.\n",
    "section_title": "3.2 Dogwhistles and Coded Language",
    "entry_title": "Hate Speech",
    "hierarchy_title": "Hate Speech || Slurs, Code Words, and Dogwhistles || Dogwhistles and Coded Language",
    "tokenized_text": [
        "slur",
        "code",
        "word",
        "dogwhistles",
        "dogwhistles",
        "coded",
        "language",
        "dogwhistles",
        "coded",
        "language",
        "addition",
        "slur",
        "explicitly",
        "derogatory",
        "researcher",
        "also",
        "focused",
        "implicit",
        "form",
        "derogatory",
        "communication",
        "talus",
        "mendelberg",
        "ian",
        "haney",
        "lopez",
        "jennifer",
        "saul",
        "justin",
        "khoo",
        "detail",
        "use",
        "racially",
        "coded",
        "languagedogwhistlesto",
        "access",
        "existing",
        "racial",
        "resentment",
        "making",
        "surreptitious",
        "racial",
        "appeal",
        "saul",
        "provides",
        "useful",
        "set",
        "distinction",
        "thinking",
        "dogwhistles",
        "explicit",
        "implicit",
        "intentional",
        "unintentional",
        "saul",
        "us",
        "work",
        "linguist",
        "kimberly",
        "witten",
        "define",
        "overt",
        "intentional",
        "dogwhistle",
        "speech",
        "act",
        "designed",
        "intent",
        "allow",
        "two",
        "plausible",
        "interpretation",
        "one",
        "interpretation",
        "private",
        "coded",
        "message",
        "targeted",
        "subset",
        "general",
        "audience",
        "concealed",
        "way",
        "general",
        "audience",
        "unaware",
        "existence",
        "second",
        "coded",
        "interpretation",
        "saul",
        "illustrates",
        "kind",
        "dogwhistle",
        "example",
        "george",
        "w",
        "bush",
        "state",
        "union",
        "speech",
        "yes",
        "power",
        "wonderworking",
        "power",
        "goodness",
        "idealism",
        "faith",
        "american",
        "people",
        "phrase",
        "wonderworking",
        "power",
        "meant",
        "overt",
        "intentional",
        "dogwhistle",
        "evangelical",
        "christian",
        "according",
        "saul",
        "two",
        "possible",
        "message",
        "evangelicals",
        "take",
        "away",
        "bush",
        "utterance",
        "first",
        "message",
        "simply",
        "translation",
        "yes",
        "power",
        "power",
        "christ",
        "goodness",
        "idealism",
        "faith",
        "american",
        "people",
        "second",
        "message",
        "bush",
        "identifies",
        "speaks",
        "language",
        "saul",
        "think",
        "instance",
        "overt",
        "intentional",
        "dogwhistles",
        "covert",
        "dogwhistle",
        "according",
        "saul",
        "dogwhistle",
        "people",
        "fail",
        "consciously",
        "recognize",
        "particularly",
        "interested",
        "covert",
        "intentional",
        "dogwhistles",
        "work",
        "tandem",
        "psychologist",
        "referred",
        "racial",
        "resentment",
        "belief",
        "system",
        "measured",
        "degree",
        "participant",
        "agree",
        "following",
        "four",
        "claim",
        "black",
        "longer",
        "face",
        "much",
        "discrimination",
        "disadvantage",
        "mainly",
        "reflects",
        "poor",
        "work",
        "ethic",
        "demanding",
        "much",
        "fast",
        "gotten",
        "deserve",
        "quoting",
        "tesler",
        "sears",
        "according",
        "mendelberg",
        "racial",
        "resentment",
        "remains",
        "widespread",
        "among",
        "white",
        "american",
        "even",
        "though",
        "explicitly",
        "racist",
        "appeal",
        "come",
        "viewed",
        "outside",
        "bound",
        "acceptable",
        "political",
        "speech",
        "least",
        "seemed",
        "case",
        "presidential",
        "election",
        "cycle",
        "white",
        "voter",
        "model",
        "tend",
        "shy",
        "away",
        "accepting",
        "explicitly",
        "racist",
        "proposal",
        "want",
        "think",
        "racist",
        "existence",
        "racial",
        "resentment",
        "allows",
        "skilled",
        "intentional",
        "use",
        "utterance",
        "unrelated",
        "race",
        "surface",
        "yet",
        "access",
        "negative",
        "racial",
        "attitude",
        "targeted",
        "audience",
        "nudging",
        "towards",
        "particular",
        "course",
        "action",
        "eg",
        "voting",
        "preferred",
        "candidate",
        "example",
        "covert",
        "intentional",
        "dogwhistle",
        "infamous",
        "willie",
        "horton",
        "ad",
        "used",
        "george",
        "h",
        "w",
        "bush",
        "campaign",
        "ad",
        "targeted",
        "prison",
        "furlough",
        "program",
        "place",
        "michael",
        "dukakis",
        "term",
        "governor",
        "massachusetts",
        "presented",
        "picture",
        "horton",
        "african",
        "american",
        "man",
        "furlough",
        "raped",
        "white",
        "woman",
        "stabbed",
        "husband",
        "though",
        "explicit",
        "mention",
        "race",
        "clear",
        "many",
        "ad",
        "drew",
        "racial",
        "trope",
        "blackness",
        "criminality",
        "stoke",
        "fear",
        "white",
        "voter",
        "support",
        "interpretation",
        "covert",
        "dogwhistle",
        "saul",
        "note",
        "specter",
        "race",
        "raised",
        "ad",
        "effectiveness",
        "started",
        "wane",
        "implication",
        "explicit",
        "appeal",
        "racial",
        "resentment",
        "losing",
        "strategy",
        "implicit",
        "appeal",
        "form",
        "covert",
        "dogwhistles",
        "could",
        "put",
        "powerful",
        "use",
        "unintentional",
        "dogwhistle",
        "defined",
        "unwitting",
        "use",
        "word",
        "andor",
        "image",
        "used",
        "intentionally",
        "constitute",
        "intentional",
        "dogwhistle",
        "use",
        "effect",
        "intentional",
        "dogwhistle",
        "dogwhistles",
        "sort",
        "passed",
        "unwitting",
        "others",
        "achieving",
        "similar",
        "effect",
        "original",
        "intentional",
        "one",
        "special",
        "case",
        "unintentional",
        "dogwhistles",
        "saul",
        "call",
        "amplifier",
        "dogwhistles",
        "occurred",
        "reporter",
        "tv",
        "producer",
        "played",
        "willie",
        "horton",
        "ad",
        "repeatedly",
        "presumably",
        "repeated",
        "presentation",
        "continued",
        "make",
        "association",
        "blackness",
        "criminality",
        "thus",
        "continued",
        "stoke",
        "fear",
        "racial",
        "anxiety",
        "significant",
        "portion",
        "white",
        "viewing",
        "public",
        "saul",
        "dogwhistles",
        "therefore",
        "best",
        "understood",
        "functionally",
        "difference",
        "speakerintentions",
        "intentional",
        "unintentional",
        "dogwhistles",
        "matter",
        "insofar",
        "define",
        "themtheir",
        "effect",
        "word",
        "often",
        "identical",
        "use",
        "implicit",
        "mean",
        "like",
        "dogwhistlingin",
        "covert",
        "overt",
        "formscan",
        "make",
        "conceptualization",
        "detection",
        "hate",
        "speech",
        "difficult",
        "undoubtedly",
        "pose",
        "challenge",
        "defining",
        "hate",
        "speech",
        "since",
        "dogwhistles",
        "often",
        "designed",
        "innocuous",
        "explains",
        "effect",
        "often",
        "attributed",
        "dogwhistles",
        "possible",
        "language",
        "work",
        "way",
        "perhaps",
        "good",
        "reason",
        "think",
        "something",
        "dogwhistles",
        "meaning",
        "explains",
        "effect",
        "consider",
        "first",
        "ambiguity",
        "thesis",
        "state",
        "code",
        "word",
        "least",
        "two",
        "meaning",
        "racial",
        "nonracial",
        "meaning",
        "expression",
        "inner",
        "city",
        "food",
        "stamp",
        "program",
        "help",
        "many",
        "innercity",
        "family",
        "purportedly",
        "express",
        "two",
        "meaning",
        "densely",
        "populated",
        "high",
        "crime",
        "urban",
        "area",
        "ii",
        "poor",
        "african",
        "american",
        "khoo",
        "ambiguous",
        "expression",
        "used",
        "utterance",
        "produce",
        "statement",
        "leaf",
        "undetermined",
        "interpretation",
        "intended",
        "speaker",
        "one",
        "worry",
        "however",
        "term",
        "like",
        "inner",
        "city",
        "actually",
        "ambiguous",
        "khoo",
        "argues",
        "term",
        "behave",
        "like",
        "genuinely",
        "ambiguous",
        "expression",
        "compare",
        "following",
        "two",
        "sentence",
        "smith",
        "funny",
        "man",
        "humorous",
        "smith",
        "innercity",
        "pastor",
        "work",
        "life",
        "suburb",
        "reading",
        "supposed",
        "sound",
        "coherent",
        "given",
        "funny",
        "mean",
        "humorous",
        "strange",
        "whereas",
        "supposed",
        "sound",
        "odd",
        "even",
        "contradictory",
        "innercity",
        "genuinely",
        "ambiguous",
        "way",
        "described",
        "able",
        "use",
        "mean",
        "african",
        "american",
        "get",
        "coherent",
        "reading",
        "second",
        "view",
        "posit",
        "two",
        "dimension",
        "meaning",
        "code",
        "word",
        "atissue",
        "notatissue",
        "content",
        "atissue",
        "content",
        "main",
        "point",
        "speaker",
        "utterance",
        "directly",
        "asserted",
        "content",
        "foregrounded",
        "whereas",
        "notatissue",
        "content",
        "projective",
        "meaning",
        "able",
        "survive",
        "embedding",
        "operator",
        "like",
        "negation",
        "modal",
        "tonhauser",
        "consider",
        "john",
        "stopped",
        "smoking",
        "atissue",
        "content",
        "represented",
        "notatissue",
        "b",
        "john",
        "smoke",
        "john",
        "used",
        "smoke",
        "note",
        "difficulty",
        "directly",
        "denying",
        "notatissue",
        "content",
        "one",
        "follow",
        "utterance",
        "used",
        "smoke",
        "would",
        "presumably",
        "find",
        "odd",
        "incoherent",
        "much",
        "elaborate",
        "statement",
        "needed",
        "deny",
        "notatissue",
        "content",
        "applying",
        "view",
        "innercity",
        "end",
        "atissue",
        "poor",
        "densely",
        "populated",
        "highcrime",
        "urban",
        "area",
        "notatissue",
        "living",
        "area",
        "mostly",
        "african",
        "american",
        "racial",
        "component",
        "notatissue",
        "reasonable",
        "explanation",
        "following",
        "pair",
        "sentence",
        "clash",
        "food",
        "stamp",
        "program",
        "help",
        "many",
        "innercity",
        "family",
        "poor",
        "highcrime",
        "urban",
        "area",
        "mostly",
        "white",
        "objection",
        "view",
        "code",
        "word",
        "display",
        "noncancelability",
        "way",
        "notatissue",
        "content",
        "typically",
        "someone",
        "disavow",
        "commitment",
        "notatissue",
        "content",
        "sentence",
        "utters",
        "merely",
        "following",
        "utterance",
        "asserting",
        "negation",
        "content",
        "khoo",
        "consider",
        "john",
        "stopped",
        "smoking",
        "never",
        "smoked",
        "food",
        "stamp",
        "program",
        "help",
        "many",
        "innercity",
        "family",
        "white",
        "juxtaposition",
        "sentence",
        "supposed",
        "strike",
        "reader",
        "contradictory",
        "according",
        "third",
        "view",
        "code",
        "word",
        "neither",
        "ambiguous",
        "multidimensional",
        "posse",
        "nonracial",
        "meaning",
        "explains",
        "phenomenon",
        "associated",
        "term",
        "like",
        "inner",
        "city",
        "presence",
        "antecedent",
        "belief",
        "audience",
        "member",
        "allows",
        "infer",
        "racial",
        "component",
        "example",
        "audience",
        "member",
        "may",
        "already",
        "believe",
        "preexisting",
        "belief",
        "pb",
        "inner",
        "city",
        "mostly",
        "populated",
        "poor",
        "african",
        "american",
        "hearing",
        "politician",
        "proclaim",
        "audience",
        "member",
        "come",
        "infer",
        "racial",
        "inference",
        "ri",
        "food",
        "stamp",
        "program",
        "primarily",
        "benefit",
        "poor",
        "african",
        "american",
        "contrasting",
        "view",
        "draw",
        "simple",
        "semantics",
        "khoo",
        "call",
        "associationdriven",
        "theory",
        "code",
        "word",
        "view",
        "association",
        "inner",
        "city",
        "concept",
        "inner",
        "city",
        "concept",
        "african",
        "american",
        "maybe",
        "race",
        "prime",
        "racist",
        "belief",
        "prejudice",
        "khoo",
        "account",
        "simple",
        "compelling",
        "may",
        "still",
        "wonder",
        "whether",
        "liberal",
        "instance",
        "expression",
        "like",
        "thug",
        "illegal",
        "alien",
        "welfare",
        "queen",
        "terrorist",
        "seem",
        "behave",
        "like",
        "term",
        "khoo",
        "identifies",
        "code",
        "word",
        "yet",
        "generally",
        "understood",
        "explicitly",
        "racial",
        "nature",
        "patrick",
        "donnell",
        "argues",
        "aforementioned",
        "expression",
        "code",
        "word",
        "racialized",
        "term",
        "donnell",
        "characterizes",
        "difference",
        "racialized",
        "term",
        "code",
        "word",
        "following",
        "way",
        "racialized",
        "term",
        "involve",
        "direct",
        "predicative",
        "relation",
        "term",
        "racialized",
        "group",
        "whereas",
        "code",
        "word",
        "involve",
        "indirect",
        "inferential",
        "associational",
        "relation",
        "racialized",
        "term",
        "elicit",
        "racial",
        "resentment",
        "making",
        "salient",
        "racespecific",
        "interpretive",
        "option",
        "whereas",
        "code",
        "word",
        "function",
        "making",
        "salient",
        "raceneutral",
        "interpretive",
        "option",
        "donnell",
        "agrees",
        "khoo",
        "code",
        "word",
        "picked",
        "according",
        "contextual",
        "cognitivepragmatic",
        "role",
        "claiming",
        "role",
        "differs",
        "code",
        "word",
        "racialized",
        "term",
        "determining",
        "whether",
        "dogwhistles",
        "coded",
        "language",
        "count",
        "merely",
        "contentious",
        "claim",
        "must",
        "tolerated",
        "hate",
        "speech",
        "subject",
        "regulation",
        "implication",
        "broader",
        "discussion",
        "subtlety",
        "coded",
        "language",
        "instance",
        "call",
        "status",
        "hate",
        "speech",
        "question",
        "impact",
        "coded",
        "language",
        "audience",
        "lack",
        "kind",
        "immediacy",
        "often",
        "attributed",
        "hate",
        "speech",
        "lawrence",
        "example",
        "note",
        "hate",
        "speech",
        "often",
        "experienced",
        "target",
        "slap",
        "face",
        "hand",
        "mendelberg",
        "account",
        "suggests",
        "coded",
        "speech",
        "incite",
        "racial",
        "resentment",
        "may",
        "aptly",
        "considered",
        "similar",
        "propagandistic",
        "hate",
        "speech",
        "discussed",
        "point",
        "see",
        "jason",
        "stanley",
        "would",
        "appear",
        "get",
        "u",
        "closer",
        "hate",
        "speech",
        "purported",
        "function",
        "namely",
        "inciting",
        "racial",
        "hatred",
        "whether",
        "close",
        "enough",
        "course",
        "open",
        "debate"
    ]
}