{
    "main_text": "Psychological Hedonism || Arguments Against Psychological Hedonism\n1.2 Arguments Against Psychological Hedonism\n\n\nSome challenges to motivational hedonism are demands for its thesis\nto be made more determinate. First, is it about every motivation; or is\nit only about the motives of ours that predominate, with exceptions\nwhen little pleasure or displeasure is at stake and/or when much else\nis at stake (c.f. Kavka: 64–80 on ‘predominant egoism’)?\nThe present entry takes motivational hedonism to be the first of these\nviews. Second, is it about all motivational entities, including all\ndesires, wants, preferences, inclinations, intentions, decisions, and\nchoices; or is it instead a claim about only an incomplete subset of\nthese? The present entry treats it as a claim just about desires (see\nthe entries on\n desire\n and\n intention).\n Third and relatedly, is it a pair of\nclaims, one about desires for pleasure and the other about aversions to\ndispleasure; or is it instead a single claim about overall or net\ndesires for a sufficient or maximal net pleasure-displeasure balance?\nThe present entry generally treats it as the latter. Fourth, is it a\nclaim about every desire whatever, or just a claim about every human\ndesire? The present entry treats it as the latter, though it is a good\nquestion why human desirers might be thought to be specially\npleasure-oriented. Fifth, is it the egoistic claim that one desires\nonly one's own pleasure, or the egocentric claim that one desires\nonly the pleasure of oneself and one's near-and-dear, or is it\ninstead a non-egoistic claim? When it makes a difference, the present\nentry takes motivational hedonism to be the first of these claims.\nSixth, is it the production-based claim that we are motivated to cause\npleasure, or does it allow, for example, that being moved to laugh\nmight be being motivated to express rather than to produce pleasure?\nThe present entry considers production-based claims, plus the distinct\nidea that our desire only ever has pleasure as its object.\n\n\nFrom critical demands for more determinacy, turn now to the\nfollowing articulated ‘incredulous stare’ (after Lewis: 86)\nchallenge to motivational hedonism. We direct our richly various mental\nlives – our beliefs, musings, intentions, enthusiasms, hopes,\naspirations, and so on and on – at massively plural and diverse\nitems in ourselves, in others, in myriad aspects of the non-human\nworld, and in the infinities of contingent future possibility. In\nkeeping with this overall psychological picture, our motivations too\nhave objects that are massively plural and diverse. In the light of\nsuch facts, motivational hedonism merits an incredulous stare: why\nwould anyone believe even for a minute that all human motivation takes\nas its object just one sort of item? On this point, some go beyond\nincredulity to contempt. Thus Nietzsche: “Man does not strive for\npleasure; only the Englishman does” (Nietzsche: ‘Maxims and\nArrows’ #12). Perhaps the most promising motivational hedonist\nresponse, about all humans including Englishmen, is to say that all our\nbasic motives are directed at pleasure and all our non-basic motives\nare pleasure-centred too, but less directly so. This move is examined\nfurther below in discussion of Butler and Hume.\n\n\nSome other criticisms of motivational hedonism can be quickly\nrebutted. One such criticism is that we are often motivated by things\nthat in fact give us neither pleasure nor the best available\npleasure-displeasure balance, such as when we step under a shower that\nwe take to be suitably warm but find instead to be scalding hot.\nAnother is that the idea of maximal pleasure, or of the best feasible\npleasure-displeasure balance, assumes a common measure that cannot be\nhad. A third criticism is that not every pleasure in prospect motivates\nus. Hedonists can reply: first, that one is always and only motivated\nby what one thinks to be one's maximal or sufficient pleasure or\npleasure-displeasure balance; second, that this is possible even if the\nidea of pleasure maximization in such settings does not ultimately make\nsense; and third, that hedonism does not imply that one is motivated by\nevery pleasure prospect.\n\n\nMotivational hedonism would be seriously undermined by any case of\nan individual who is motivated otherwise than by pleasure or\ndispleasure. Here are some standard candidates that seem true to\nexperience: the parent who seeks to give his child good early years and\na good start in life for that child's sake, the walker who kicks\na small stone ‘just for the hell of it’, the soldier who\nopts for a painful death for himself to save his comrades, and the\ndying person who fights to keep a grip on life despite fully grasping\nthat much pain and little or no pleasure now remains to her.\n\n\nThe standard style of hedonist response to attempted counterexamples\nis to offer rival motivational stories: the soldier was really\nmotivated only by an underlying belief that her dying would secure her\na joyful afterlife or at least a half-second's sweet pleasure of\nhero's self-sacrifice; the parent was actually motivated only by\nhis own pleasurable intention to give the child a good start or by his\nexpectation that his now having this intention will somehow cause him\nto have pleasure later; the dying non-believer in any afterlife in fact\nhangs on only because she really believes that in her life there is\nstill pleasure for her; and so on.\n\n\nThe capability of hedonists to tell hedonic stories as to our\nmotives does not in itself generate any reason to think such narratives\ntrue. To escape refutation by counterexample, motivational hedonists\nneed to tell the tale of every relevant motive in hedonic terms that\nare not merely imaginative but are also in every case more plausible\nthan the anti-hedonist lessons that our experience seems repeatedly to\nteach some of us about many of our motives.\n\n\nAs noted above, some statements of motivational hedonism are\nindeterminate. Consider now the more precise thesis that each of\none's desires or passions or appetites has one's own\npleasure and only this as its object, as that at which alone it is\naimed or is directed or is about. This thesis was a target of Bishop\nJoseph Butler in his 1729 work Fifteen Sermons Preached at the\nRolls Chapel. Butler noted in his Preface that there are:\n“such passions in mankind as desire of esteem, or of being\nbeloved, or of knowledge”. All of these have objects other than\npleasure. Drawing on Butler's critique, David Hume added further\nexamples: that people have bodily appetites such as hunger and thirst;\nthat mental passions drive them to attain such things as fame, power,\nand vengeance; and that many of us also: “feel a desire of\nanother's happiness and good” (Hume: Appendix 2, 12–13).\nAll these appetites have objects other than just one's own\npleasure or displeasure. By appeal to such cases Butler and Hume\narguably refuted the strong motivational hedonist thesis that\none's every desire has one's own pleasure and that alone as\nits object.\n\n\nIn pulling things together downstream from the Butler-Hume critique,\nhedonist responses might first distinguish basic from non-basic\ndesires. A desire is basic if one has it independently of any thought\none has about what else this will or might cause or bring about. A\ndesire is non-basic if one's having it does depend on one's\nhaving such further thought. Equipped with this distinction,\nmotivational hedonists can claim that one's every basic desire\nhas one's own pleasure as its object, and one's every\nnon-basic desire depends on one's thinking this will or might\nbring one pleasure. Thus propelled, hedonists can swim back against the\nbroader Butler-Hume stream by claiming, of everyone in every case, that\nhas only non-basic desire for esteem or knowledge or to be beloved, and\nthis only because one thinks it will or might give one pleasure; and\nlikewise with one's appetite for food or drink, one's\nmental passion for fame or power or vengeance, and one's desire\nfor the happiness or good of any other.\n\n\nDespite the implicature of the cliché, it is possible to sink\neven as one swims. Still, the foregoing does supply hedonists with some\npotential buoyancy aids. They can claim that one's every basic\ndesire is directed at one's own pleasure, and one's every\nnon-basic desire, directed at something other than pleasure, is had\nonly because one thinks this will or might bring one pleasure. The wide\nrange of ways in which one's desire for non-pleasure could bring\none pleasure include: by this desire's itself being an instance\nof pleasure (e.g., by appeal to a desire-pleasure identity thesis; see\nHeathwood), by the desire's having the property of\npleasurableness (e.g., deploying the thought that pleasure is a\nhigher-order property of every desire), by the desire's causing\none pleasure independently of whether its object obtains (e.g., a\nfan's desire to be a vampire or a hobbit might cause him pleasure\neven though this desire of his is never fulfilled); or by the\ndesire's causing its object to obtain, where this object is an\ninstance of one's pleasure, or has pleasure as one of its\nproperties, or causes one pleasure. Well and good. But again, it is one\nthing to tell such motivational hedonist stories and it is another\nthing to identify any reason to think the stories true.\n\n\nA wider issue about motivational hedonism is this: is it a\ncontingent claim about an aspect of our psychology that could have been\notherwise; or does it posit a law of our psychological nature; or is it\na necessary truth about all metaphysically or conceptually or logically\npossible motivations? The answers to such questions also bear on the\nsorts of evidence and argument we need if we are fully to appraise\nmotivational hedonism. If it is an empirical psychological thesis, as\nit seems to be, then it is reasonable to expect application of the\nmethods and evidence of empirical psychology, social inquiry, and\nperhaps also biological science, to do the main work of appraising it.\nIt is also reasonable to expect that most of this work is to be done by\nspecialist scientists and social scientists through their systematic\nconduct of meta-analyses of large numbers of empirical studies.\nPhilosophical work will continue to be needed too, to weed out\nincoherent ideas, to separate out the numerous distinct motivational\nhedonist theses; and to scrutinize whether, and if so with what\nsignificance, various empirical findings actually do bear on these\nvarious hedonist theses. For instance, even the feasibility of a\nresearch design that is capable of empirically separating out our basic\nfrom our non-basic motives would be a serious challenge. Philosophical\nwork can also identify the various features that it is desirable for\ntheories of motivation to have and to be appraised against.\nUnification, determinacy, and confirmation by cases are treated above\nas desirable. Other desirable features might include consistency and\nmaximal scope. Philosophers and others can systematically appraise\ntheories of motivation in such terms, including through pairwise\ncomparative assessments of rival theories in terms of those desirable\nfeatures.\n\n\nThis section has critically reviewed motivational hedonism and has\nfound weaknesses in some central arguments for the view, together with\nsome significant problems of determinacy and disconfirmation. It has\nalso found that there are arguments against motivational hedonism that\nhave some force. Ongoing inquiry is continuing to assess whether such\ntroubles for motivational hedonism can be overcome, and whether any of\nits rivals fare any better overall than it does.\n",
    "section_title": "1.2 Arguments Against Psychological Hedonism",
    "entry_title": "Hedonism",
    "hierarchy_title": "Hedonism || Psychological Hedonism || Arguments Against Psychological Hedonism",
    "tokenized_text": [
        "psychological",
        "hedonism",
        "argument",
        "psychological",
        "hedonism",
        "argument",
        "psychological",
        "hedonism",
        "challenge",
        "motivational",
        "hedonism",
        "demand",
        "thesis",
        "made",
        "determinate",
        "first",
        "every",
        "motivation",
        "motif",
        "predominate",
        "exception",
        "little",
        "pleasure",
        "displeasure",
        "stake",
        "andor",
        "much",
        "else",
        "stake",
        "cf",
        "kavka",
        "predominant",
        "egoism",
        "present",
        "entry",
        "take",
        "motivational",
        "hedonism",
        "first",
        "view",
        "second",
        "motivational",
        "entity",
        "including",
        "desire",
        "want",
        "preference",
        "inclination",
        "intention",
        "decision",
        "choice",
        "instead",
        "claim",
        "incomplete",
        "subset",
        "present",
        "entry",
        "treat",
        "claim",
        "desire",
        "see",
        "entry",
        "desire",
        "intention",
        "third",
        "relatedly",
        "pair",
        "claim",
        "one",
        "desire",
        "pleasure",
        "aversion",
        "displeasure",
        "instead",
        "single",
        "claim",
        "overall",
        "net",
        "desire",
        "sufficient",
        "maximal",
        "net",
        "pleasuredispleasure",
        "balance",
        "present",
        "entry",
        "generally",
        "treat",
        "latter",
        "fourth",
        "claim",
        "every",
        "desire",
        "whatever",
        "claim",
        "every",
        "human",
        "desire",
        "present",
        "entry",
        "treat",
        "latter",
        "though",
        "good",
        "question",
        "human",
        "desirers",
        "might",
        "thought",
        "specially",
        "pleasureoriented",
        "fifth",
        "egoistic",
        "claim",
        "one",
        "desire",
        "one",
        "s",
        "pleasure",
        "egocentric",
        "claim",
        "one",
        "desire",
        "pleasure",
        "oneself",
        "one",
        "s",
        "nearanddear",
        "instead",
        "nonegoistic",
        "claim",
        "make",
        "difference",
        "present",
        "entry",
        "take",
        "motivational",
        "hedonism",
        "first",
        "claim",
        "sixth",
        "productionbased",
        "claim",
        "motivated",
        "cause",
        "pleasure",
        "allow",
        "example",
        "moved",
        "laugh",
        "might",
        "motivated",
        "express",
        "rather",
        "produce",
        "pleasure",
        "present",
        "entry",
        "considers",
        "productionbased",
        "claim",
        "plus",
        "distinct",
        "idea",
        "desire",
        "ever",
        "pleasure",
        "object",
        "critical",
        "demand",
        "determinacy",
        "turn",
        "following",
        "articulated",
        "incredulous",
        "stare",
        "lewis",
        "challenge",
        "motivational",
        "hedonism",
        "direct",
        "richly",
        "various",
        "mental",
        "life",
        "belief",
        "musing",
        "intention",
        "enthusiasm",
        "hope",
        "aspiration",
        "massively",
        "plural",
        "diverse",
        "item",
        "others",
        "myriad",
        "aspect",
        "nonhuman",
        "world",
        "infinity",
        "contingent",
        "future",
        "possibility",
        "keeping",
        "overall",
        "psychological",
        "picture",
        "motivation",
        "object",
        "massively",
        "plural",
        "diverse",
        "light",
        "fact",
        "motivational",
        "hedonism",
        "merit",
        "incredulous",
        "stare",
        "would",
        "anyone",
        "believe",
        "even",
        "minute",
        "human",
        "motivation",
        "take",
        "object",
        "one",
        "sort",
        "item",
        "point",
        "go",
        "beyond",
        "incredulity",
        "contempt",
        "thus",
        "nietzsche",
        "man",
        "strive",
        "pleasure",
        "englishman",
        "nietzsche",
        "maxim",
        "arrow",
        "perhaps",
        "promising",
        "motivational",
        "hedonist",
        "response",
        "human",
        "including",
        "englishman",
        "say",
        "basic",
        "motif",
        "directed",
        "pleasure",
        "nonbasic",
        "motif",
        "pleasurecentred",
        "le",
        "directly",
        "move",
        "examined",
        "discussion",
        "butler",
        "hume",
        "criticism",
        "motivational",
        "hedonism",
        "quickly",
        "rebutted",
        "one",
        "criticism",
        "often",
        "motivated",
        "thing",
        "fact",
        "give",
        "u",
        "neither",
        "pleasure",
        "best",
        "available",
        "pleasuredispleasure",
        "balance",
        "step",
        "shower",
        "take",
        "suitably",
        "warm",
        "find",
        "instead",
        "scalding",
        "hot",
        "another",
        "idea",
        "maximal",
        "pleasure",
        "best",
        "feasible",
        "pleasuredispleasure",
        "balance",
        "assumes",
        "common",
        "measure",
        "third",
        "criticism",
        "every",
        "pleasure",
        "prospect",
        "motivates",
        "u",
        "hedonist",
        "reply",
        "first",
        "one",
        "always",
        "motivated",
        "one",
        "think",
        "one",
        "s",
        "maximal",
        "sufficient",
        "pleasure",
        "pleasuredispleasure",
        "balance",
        "second",
        "possible",
        "even",
        "idea",
        "pleasure",
        "maximization",
        "setting",
        "ultimately",
        "make",
        "sense",
        "third",
        "hedonism",
        "imply",
        "one",
        "motivated",
        "every",
        "pleasure",
        "prospect",
        "motivational",
        "hedonism",
        "would",
        "seriously",
        "undermined",
        "case",
        "individual",
        "motivated",
        "otherwise",
        "pleasure",
        "displeasure",
        "standard",
        "candidate",
        "seem",
        "true",
        "experience",
        "parent",
        "seek",
        "give",
        "child",
        "good",
        "early",
        "year",
        "good",
        "start",
        "life",
        "child",
        "s",
        "sake",
        "walker",
        "kick",
        "small",
        "stone",
        "hell",
        "soldier",
        "opts",
        "painful",
        "death",
        "save",
        "comrade",
        "dying",
        "person",
        "fight",
        "keep",
        "grip",
        "life",
        "despite",
        "fully",
        "grasping",
        "much",
        "pain",
        "little",
        "pleasure",
        "remains",
        "standard",
        "style",
        "hedonist",
        "response",
        "attempted",
        "counterexample",
        "offer",
        "rival",
        "motivational",
        "story",
        "soldier",
        "really",
        "motivated",
        "underlying",
        "belief",
        "dying",
        "would",
        "secure",
        "joyful",
        "afterlife",
        "least",
        "halfsecond",
        "s",
        "sweet",
        "pleasure",
        "hero",
        "s",
        "selfsacrifice",
        "parent",
        "actually",
        "motivated",
        "pleasurable",
        "intention",
        "give",
        "child",
        "good",
        "start",
        "expectation",
        "intention",
        "somehow",
        "cause",
        "pleasure",
        "later",
        "dying",
        "nonbeliever",
        "afterlife",
        "fact",
        "hang",
        "really",
        "belief",
        "life",
        "still",
        "pleasure",
        "capability",
        "hedonist",
        "tell",
        "hedonic",
        "story",
        "motif",
        "generate",
        "reason",
        "think",
        "narrative",
        "true",
        "escape",
        "refutation",
        "counterexample",
        "motivational",
        "hedonist",
        "need",
        "tell",
        "tale",
        "every",
        "relevant",
        "motive",
        "hedonic",
        "term",
        "merely",
        "imaginative",
        "also",
        "every",
        "case",
        "plausible",
        "antihedonist",
        "lesson",
        "experience",
        "seems",
        "repeatedly",
        "teach",
        "u",
        "many",
        "motif",
        "noted",
        "statement",
        "motivational",
        "hedonism",
        "indeterminate",
        "consider",
        "precise",
        "thesis",
        "one",
        "s",
        "desire",
        "passion",
        "appetite",
        "one",
        "s",
        "pleasure",
        "object",
        "alone",
        "aimed",
        "directed",
        "thesis",
        "target",
        "bishop",
        "joseph",
        "butler",
        "work",
        "fifteen",
        "sermon",
        "preached",
        "roll",
        "chapel",
        "butler",
        "noted",
        "preface",
        "passion",
        "mankind",
        "desire",
        "esteem",
        "beloved",
        "knowledge",
        "object",
        "pleasure",
        "drawing",
        "butler",
        "s",
        "critique",
        "david",
        "hume",
        "added",
        "example",
        "people",
        "bodily",
        "appetite",
        "hunger",
        "thirst",
        "mental",
        "passion",
        "drive",
        "attain",
        "thing",
        "fame",
        "power",
        "vengeance",
        "many",
        "u",
        "also",
        "feel",
        "desire",
        "another",
        "s",
        "happiness",
        "good",
        "hume",
        "appendix",
        "appetite",
        "object",
        "one",
        "s",
        "pleasure",
        "displeasure",
        "appeal",
        "case",
        "butler",
        "hume",
        "arguably",
        "refuted",
        "strong",
        "motivational",
        "hedonist",
        "thesis",
        "one",
        "s",
        "every",
        "desire",
        "one",
        "s",
        "pleasure",
        "alone",
        "object",
        "pulling",
        "thing",
        "together",
        "downstream",
        "butlerhume",
        "critique",
        "hedonist",
        "response",
        "might",
        "first",
        "distinguish",
        "basic",
        "nonbasic",
        "desire",
        "desire",
        "basic",
        "one",
        "independently",
        "thought",
        "one",
        "else",
        "might",
        "cause",
        "bring",
        "desire",
        "nonbasic",
        "one",
        "s",
        "depend",
        "one",
        "s",
        "thought",
        "equipped",
        "distinction",
        "motivational",
        "hedonist",
        "claim",
        "one",
        "s",
        "every",
        "basic",
        "desire",
        "one",
        "s",
        "pleasure",
        "object",
        "one",
        "s",
        "every",
        "nonbasic",
        "desire",
        "depends",
        "one",
        "s",
        "thinking",
        "might",
        "bring",
        "one",
        "pleasure",
        "thus",
        "propelled",
        "hedonist",
        "swim",
        "back",
        "broader",
        "butlerhume",
        "stream",
        "claiming",
        "everyone",
        "every",
        "case",
        "nonbasic",
        "desire",
        "esteem",
        "knowledge",
        "beloved",
        "one",
        "think",
        "might",
        "give",
        "one",
        "pleasure",
        "likewise",
        "one",
        "s",
        "appetite",
        "food",
        "drink",
        "one",
        "s",
        "mental",
        "passion",
        "fame",
        "power",
        "vengeance",
        "one",
        "s",
        "desire",
        "happiness",
        "good",
        "despite",
        "implicature",
        "cliché",
        "possible",
        "sink",
        "even",
        "one",
        "swim",
        "still",
        "foregoing",
        "supply",
        "hedonist",
        "potential",
        "buoyancy",
        "aid",
        "claim",
        "one",
        "s",
        "every",
        "basic",
        "desire",
        "directed",
        "one",
        "s",
        "pleasure",
        "one",
        "s",
        "every",
        "nonbasic",
        "desire",
        "directed",
        "something",
        "pleasure",
        "one",
        "think",
        "might",
        "bring",
        "one",
        "pleasure",
        "wide",
        "range",
        "way",
        "one",
        "s",
        "desire",
        "nonpleasure",
        "could",
        "bring",
        "one",
        "pleasure",
        "include",
        "desire",
        "s",
        "instance",
        "pleasure",
        "eg",
        "appeal",
        "desirepleasure",
        "identity",
        "thesis",
        "see",
        "heathwood",
        "desire",
        "s",
        "property",
        "pleasurableness",
        "eg",
        "deploying",
        "thought",
        "pleasure",
        "higherorder",
        "property",
        "every",
        "desire",
        "desire",
        "s",
        "causing",
        "one",
        "pleasure",
        "independently",
        "whether",
        "object",
        "obtains",
        "eg",
        "fan",
        "s",
        "desire",
        "vampire",
        "hobbit",
        "might",
        "cause",
        "pleasure",
        "even",
        "though",
        "desire",
        "never",
        "fulfilled",
        "desire",
        "s",
        "causing",
        "object",
        "obtain",
        "object",
        "instance",
        "one",
        "s",
        "pleasure",
        "pleasure",
        "one",
        "property",
        "cause",
        "one",
        "pleasure",
        "well",
        "good",
        "one",
        "thing",
        "tell",
        "motivational",
        "hedonist",
        "story",
        "another",
        "thing",
        "identify",
        "reason",
        "think",
        "story",
        "true",
        "wider",
        "issue",
        "motivational",
        "hedonism",
        "contingent",
        "claim",
        "aspect",
        "psychology",
        "could",
        "otherwise",
        "posit",
        "law",
        "psychological",
        "nature",
        "necessary",
        "truth",
        "metaphysically",
        "conceptually",
        "logically",
        "possible",
        "motivation",
        "answer",
        "question",
        "also",
        "bear",
        "sort",
        "evidence",
        "argument",
        "need",
        "fully",
        "appraise",
        "motivational",
        "hedonism",
        "empirical",
        "psychological",
        "thesis",
        "seems",
        "reasonable",
        "expect",
        "application",
        "method",
        "evidence",
        "empirical",
        "psychology",
        "social",
        "inquiry",
        "perhaps",
        "also",
        "biological",
        "science",
        "main",
        "work",
        "appraising",
        "also",
        "reasonable",
        "expect",
        "work",
        "done",
        "specialist",
        "scientist",
        "social",
        "scientist",
        "systematic",
        "conduct",
        "metaanalyses",
        "large",
        "number",
        "empirical",
        "study",
        "philosophical",
        "work",
        "continue",
        "needed",
        "weed",
        "incoherent",
        "idea",
        "separate",
        "numerous",
        "distinct",
        "motivational",
        "hedonist",
        "thesis",
        "scrutinize",
        "whether",
        "significance",
        "various",
        "empirical",
        "finding",
        "actually",
        "bear",
        "various",
        "hedonist",
        "thesis",
        "instance",
        "even",
        "feasibility",
        "research",
        "design",
        "capable",
        "empirically",
        "separating",
        "basic",
        "nonbasic",
        "motif",
        "would",
        "serious",
        "challenge",
        "philosophical",
        "work",
        "also",
        "identify",
        "various",
        "feature",
        "desirable",
        "theory",
        "motivation",
        "appraised",
        "unification",
        "determinacy",
        "confirmation",
        "case",
        "treated",
        "desirable",
        "desirable",
        "feature",
        "might",
        "include",
        "consistency",
        "maximal",
        "scope",
        "philosopher",
        "others",
        "systematically",
        "appraise",
        "theory",
        "motivation",
        "term",
        "including",
        "pairwise",
        "comparative",
        "assessment",
        "rival",
        "theory",
        "term",
        "desirable",
        "feature",
        "section",
        "critically",
        "reviewed",
        "motivational",
        "hedonism",
        "found",
        "weakness",
        "central",
        "argument",
        "view",
        "together",
        "significant",
        "problem",
        "determinacy",
        "disconfirmation",
        "also",
        "found",
        "argument",
        "motivational",
        "hedonism",
        "force",
        "ongoing",
        "inquiry",
        "continuing",
        "ass",
        "whether",
        "trouble",
        "motivational",
        "hedonism",
        "overcome",
        "whether",
        "rival",
        "fare",
        "better",
        "overall"
    ]
}