{
    "main_text": "Hegel’s description of his dialectical method\n1. Hegel’s description of his dialectical method\n\nHegel provides the most extensive, general account of his dialectical\nmethod in Part I of his Encyclopaedia of Philosophical\nSciences, which is often called the Encyclopaedia Logic\n[EL]. The form or presentation of logic, he says, has three sides or\nmoments (EL §79). These sides are not parts of logic, but,\nrather, moments of “every concept”, as well as “of\neverything true in general” (EL Remark to §79; we will see\nwhy Hegel thought dialectics is in everything in\n section 3).\n The first moment—the moment of the understanding—is the\nmoment of fixity, in which concepts or forms have a seemingly stable\ndefinition or determination (EL §80).\n\nThe second moment—the “dialectical” (EL\n§§79, 81) or “negatively rational” (EL\n§79) moment—is the moment of instability. In this moment, a\none-sidedness or restrictedness (EL Remark to §81) in the\ndetermination from the moment of understanding comes to the fore, and\nthe determination that was fixed in the first moment passes into its\nopposite (EL §81). Hegel describes this process as a process of\n“self-sublation” (EL §81). The English verb “to\nsublate” translates Hegel’s technical use of the German\nverb aufheben, which is a crucial concept in his dialectical\nmethod. Hegel says that aufheben has a doubled meaning: it\nmeans both to cancel (or negate) and to preserve at the same time (PhG\n§113; SL-M 107; SL-dG 81–2; cf. EL the Addition to\n§95). The moment of understanding sublates itself\nbecause its own character or nature—its one-sidedness or\nrestrictedness—destabilizes its definition and leads it to pass\ninto its opposite. The dialectical moment thus involves a process of\nself-sublation, or a process in which the determination from\nthe moment of understanding sublates itself, or both cancels\nand preserves itself, as it pushes on to or passes into its\nopposite.\n\nThe third moment—the “speculative” or\n“positively rational” (EL §§79, 82)\nmoment—grasps the unity of the opposition between the first two\ndeterminations, or is the positive result of the dissolution or\ntransition of those determinations (EL §82 and Remark to\n§82). Here, Hegel rejects the traditional, reductio ad\nabsurdum argument, which says that when the premises of an\nargument lead to a contradiction, then the premises must be discarded\naltogether, leaving nothing. As Hegel suggests in the\nPhenomenology, such an argument \n\n\nis just the skepticism which only ever sees pure nothingness in its\nresult and abstracts from the fact that this nothingness is\nspecifically the nothingness of that from which it results.\n(PhG-M §79) \n\n\nAlthough the speculative moment negates the contradiction, it is a\ndeterminate or defined nothingness because it is the result of a\nspecific process. There is something particular about the\ndetermination in the moment of understanding—a specific\nweakness, or some specific aspect that was ignored in its\none-sidedness or restrictedness—that leads it to fall apart in\nthe dialectical moment. The speculative moment has a definition,\ndetermination or content because it grows out of and unifies the\nparticular character of those earlier determinations, or is “a\nunity of distinct determinations” (EL Remark to\n§82). The speculative moment is thus “truly not empty,\nabstract nothing, but the negation of certain\ndeterminations” (EL-GSH §82). When the result\n“is taken as the result of that from which it emerges”,\nHegel says, then it is “in fact, the true result; in that case\nit is itself a determinate nothingness, one which has a\ncontent” (PhG-M §79). As he also puts it, “the result\nis conceived as it is in truth, namely, as a determinate\nnegation [bestimmte Negation]; a new form has thereby\nimmediately arisen” (PhG-M §79). Or, as he says,\n“[b]ecause the result, the negation, is a determinate\nnegation [bestimmte Negation], it has a\ncontent” (SL-dG 33; cf. SL-M 54). Hegel’s claim\nin both the Phenomenology and the Science of Logic\nthat his philosophy relies on a process of “determinate\nnegation [bestimmte Negation]” has sometimes led\nscholars to describe his dialectics as a method or doctrine of\n“determinate negation” (see entry on\n Hegel, section on Science of Logic;\n cf. Rosen 1982: 30; Stewart 1996, 2000: 41–3; Winfield 1990:\n56).\n\nThere are several features of this account that Hegel thinks raise his\ndialectical method above the arbitrariness of Plato’s dialectics\nto the level of a genuine science. First, because the determinations\nin the moment of understanding sublate themselves,\nHegel’s dialectics does not require some new idea to show up\narbitrarily. Instead, the movement to new determinations is driven by\nthe nature of the earlier determinations and so “comes about on\nits own accord” (PhG-P §79). Indeed, for Hegel, the\nmovement is driven by necessity (see, e.g., EL Remarks to\n§§12, 42, 81, 87, 88; PhG §79). The natures of the\ndeterminations themselves drive or force them to pass into\ntheir opposites. This sense of necessity—the idea that\nthe method involves being forced from earlier moments to later\nones—leads Hegel to regard his dialectics as a kind of\nlogic. As he says in the Phenomenology, the\nmethod’s “proper exposition belongs to logic” (PhG-M\n§48). Necessity—the sense of being driven or forced to\nconclusions—is the hallmark of “logic” in Western\nphilosophy.\n\nSecond, because the form or determination that arises is the\nresult of the self-sublation of the determination from the\nmoment of understanding, there is no need for some new idea to show up\nfrom the outside. Instead, the transition to the new determination or\nform is necessitated by earlier moments and hence grows out of the\nprocess itself. Unlike in Plato’s arbitrary dialectics,\nthen—which must wait around until some other idea comes in from\nthe outside—in Hegel’s dialectics “nothing\nextraneous is introduced”, as he says (SL-M 54; cf. SL-dG 33).\nHis dialectics is driven by the nature, immanence or\n“inwardness” of its own content (SL-M 54; cf. SL-dG 33;\ncf. PR §31). As he puts it, dialectics is “the principle\nthrough which alone immanent coherence and necessity enter\ninto the content of science” (EL-GSH Remark to §81).\n\nThird, because later determinations “sublate” earlier\ndeterminations, the earlier determinations are not completely\ncancelled or negated. On the contrary, the earlier determinations are\npreserved in the sense that they remain in effect within the\nlater determinations. When Being-for-itself, for instance, is\nintroduced in the logic as the first concept of ideality or\nuniversality and is defined by embracing a set of\n“something-others”, Being-for-itself replaces the\nsomething-others as the new concept, but those something-others remain\nactive within the definition of the concept of Being-for-itself. The\nsomething-others must continue to do the work of picking out\nindividual somethings before the concept of Being-for-itself can have\nits own definition as the concept that gathers them up.\nBeing-for-itself replaces the something-others, but it also preserves\nthem, because its definition still requires them to do their work of\npicking out individual somethings (EL §§95–6).\n\nThe concept of “apple”, for example, as a\nBeing-for-itself, would be defined by gathering up individual\n“somethings” that are the same as one another (as apples).\nEach individual apple can be what it is (as an apple) only in relation\nto an “other” that is the same “something”\nthat it is (i.e., an apple). That is the one-sidedness or\nrestrictedness that leads each “something” to pass into\nits “other” or opposite. The “somethings” are\nthus both “something-others”. Moreover, their defining\nprocesses lead to an endless process of passing back and forth into\none another: one “something” can be what it is (as an\napple) only in relation to another “something” that is the\nsame as it is, which, in turn, can be what it is (an apple) only in\nrelation to the other “something” that is the same as it\nis, and so on, back and forth, endlessly (cf. EL §95). The\nconcept of “apple”, as a Being-for-itself, stops that\nendless, passing-over process by embracing or including the individual\nsomething-others (the apples) in its content. It grasps or captures\ntheir character or quality as apples. But the\n“something-others” must do their work of picking out and\nseparating those individual items (the apples) before the\nconcept of “apple”—as the Being-for-itself—can\ngather them up for its own definition. We can picture the concept of\nBeing-for-itself like this:\n\n\n\nFigure 1\n\n\nLater concepts thus replace, but also preserve, earlier concepts.\n\nFourth, later concepts both determine and also surpass the limits or\nfinitude of earlier concepts. Earlier determinations sublate\nthemselves—they pass into their others because of some\nweakness, one-sidedness or restrictedness in their own definitions.\nThere are thus limitations in each of the determinations that lead\nthem to pass into their opposites. As Hegel says, “that is what\neverything finite is: its own sublation” (EL-GSH Remark to\n§81). Later determinations define the finiteness of the earlier\ndeterminations. From the point of view of the concept of\nBeing-for-itself, for instance, the concept of a\n“something-other” is limited or finite: although the\nsomething-others are supposed to be the same as one another, the\ncharacter of their sameness (e.g., as apples) is captured only from\nabove, by the higher-level, more universal concept of\nBeing-for-itself. Being-for-itself reveals the limitations of the\nconcept of a “something-other”. It also rises above those\nlimitations, since it can do something that the concept of a\nsomething-other cannot do. Dialectics thus allows us to get beyond the\nfinite to the universal. As Hegel puts it, “all genuine,\nnonexternal elevation above the finite is to be found in this\nprinciple [of dialectics]” (EL-GSH Remark to §81).\n\nFifth, because the determination in the speculative moment grasps the\nunity of the first two moments, Hegel’s dialectical\nmethod leads to concepts or forms that are increasingly comprehensive\nand universal. As Hegel puts it, the result of the dialectical process\n\n\n\nis a new concept but one higher and richer than the\npreceding—richer because it negates or opposes the preceding and\ntherefore contains it, and it contains even more than that, for it is\nthe unity of itself and its opposite. (SL-dG 33; cf. SL-M 54) \n\n\nLike Being-for-itself, later concepts are more universal because they\nunify or are built out of earlier determinations, and include\nthose earlier determinations as part of their definitions. Indeed,\nmany other concepts or determinations can also be depicted as\nliterally surrounding earlier ones (cf. Maybee 2009: 73, 100, 112,\n156, 193, 214, 221, 235, 458).\n\nFinally, because the dialectical process leads to increasing\ncomprehensiveness and universality, it ultimately produces a complete\nseries, or drives “to completion” (SL-dG 33; cf. SL-M 54;\nPhG §79). Dialectics drives to the “Absolute”, to use\nHegel’s term, which is the last, final, and completely\nall-encompassing or unconditioned concept or form in the relevant\nsubject matter under discussion (logic, phenomenology, ethics/politics\nand so on). The “Absolute” concept or form is\nunconditioned because its definition or determination contains all the\nother concepts or forms that were developed earlier in the dialectical\nprocess for that subject matter. Moreover, because the process\ndevelops necessarily and comprehensively through each concept, form or\ndetermination, there are no determinations that are left out of the\nprocess. There are therefore no left-over concepts or\nforms—concepts or forms outside of the\n“Absolute”—that might “condition” or\ndefine it. The “Absolute” is thus unconditioned because it\ncontains all of the conditions in its content, and is not conditioned\nby anything else outside of it. This Absolute is the highest concept\nor form of universality for that subject matter. It is the thought or\nconcept of the whole conceptual system for the relevant subject\nmatter. We can picture the Absolute Idea (EL §236), for\ninstance—which is the “Absolute” for logic—as\nan oval that is filled up with and surrounds numerous, embedded rings\nof smaller ovals and circles, which represent all of the earlier and\nless universal determinations from the logical development (cf. Maybee\n2009: 30, 600):\n\n\n\nFigure 2\n\n\nSince the “Absolute” concepts for each subject matter lead\ninto one another, when they are taken together, they constitute\nHegel’s entire philosophical system, which, as Hegel says,\n“presents itself therefore as a circle of circles” (EL-GSH\n§15). We can picture the entire system like this (cf. Maybee\n2009: 29):\n\n\n\nFigure 3\n\n\nTogether, Hegel believes, these characteristics make his dialectical\nmethod genuinely scientific. As he says, “the dialectical\nconstitutes the moving soul of scientific progression” (EL-GSH\nRemark to §81). He acknowledges that a description of the method\ncan be more or less complete and detailed, but because the method or\nprogression is driven only by the subject matter itself, this\ndialectical method is the “only true method” (SL-M 54;\nSL-dG 33).\n",
    "section_title": "1. Hegel’s description of his dialectical method",
    "entry_title": "Hegel’s Dialectics",
    "hierarchy_title": "Hegel’s Dialectics || Hegel’s description of his dialectical method",
    "tokenized_text": [
        "hegel",
        "description",
        "dialectical",
        "method",
        "hegel",
        "description",
        "dialectical",
        "method",
        "hegel",
        "provides",
        "extensive",
        "general",
        "account",
        "dialectical",
        "method",
        "part",
        "encyclopaedia",
        "philosophical",
        "science",
        "often",
        "called",
        "encyclopaedia",
        "logic",
        "el",
        "form",
        "presentation",
        "logic",
        "say",
        "three",
        "side",
        "moment",
        "el",
        "side",
        "part",
        "logic",
        "rather",
        "moment",
        "every",
        "concept",
        "well",
        "everything",
        "true",
        "general",
        "el",
        "remark",
        "see",
        "hegel",
        "thought",
        "dialectic",
        "everything",
        "section",
        "first",
        "momentthe",
        "moment",
        "understandingis",
        "moment",
        "fixity",
        "concept",
        "form",
        "seemingly",
        "stable",
        "definition",
        "determination",
        "el",
        "second",
        "momentthe",
        "dialectical",
        "el",
        "negatively",
        "rational",
        "el",
        "momentis",
        "moment",
        "instability",
        "moment",
        "onesidedness",
        "restrictedness",
        "el",
        "remark",
        "determination",
        "moment",
        "understanding",
        "come",
        "fore",
        "determination",
        "fixed",
        "first",
        "moment",
        "pass",
        "opposite",
        "el",
        "hegel",
        "describes",
        "process",
        "process",
        "selfsublation",
        "el",
        "english",
        "verb",
        "sublate",
        "translates",
        "hegel",
        "technical",
        "use",
        "german",
        "verb",
        "aufheben",
        "crucial",
        "concept",
        "dialectical",
        "method",
        "hegel",
        "say",
        "aufheben",
        "doubled",
        "meaning",
        "mean",
        "cancel",
        "negate",
        "preserve",
        "time",
        "phg",
        "slm",
        "sldg",
        "cf",
        "el",
        "addition",
        "moment",
        "understanding",
        "sublates",
        "character",
        "natureits",
        "onesidedness",
        "restrictednessdestabilizes",
        "definition",
        "lead",
        "pas",
        "opposite",
        "dialectical",
        "moment",
        "thus",
        "involves",
        "process",
        "selfsublation",
        "process",
        "determination",
        "moment",
        "understanding",
        "sublates",
        "cancel",
        "preserve",
        "push",
        "pass",
        "opposite",
        "third",
        "momentthe",
        "speculative",
        "positively",
        "rational",
        "el",
        "momentgrasps",
        "unity",
        "opposition",
        "first",
        "two",
        "determination",
        "positive",
        "result",
        "dissolution",
        "transition",
        "determination",
        "el",
        "remark",
        "hegel",
        "reject",
        "traditional",
        "reductio",
        "ad",
        "absurdum",
        "argument",
        "say",
        "premise",
        "argument",
        "lead",
        "contradiction",
        "premise",
        "must",
        "discarded",
        "altogether",
        "leaving",
        "nothing",
        "hegel",
        "suggests",
        "phenomenology",
        "argument",
        "skepticism",
        "ever",
        "see",
        "pure",
        "nothingness",
        "result",
        "abstract",
        "fact",
        "nothingness",
        "specifically",
        "nothingness",
        "result",
        "phgm",
        "although",
        "speculative",
        "moment",
        "negates",
        "contradiction",
        "determinate",
        "defined",
        "nothingness",
        "result",
        "specific",
        "process",
        "something",
        "particular",
        "determination",
        "moment",
        "understandinga",
        "specific",
        "weakness",
        "specific",
        "aspect",
        "ignored",
        "onesidedness",
        "restrictednessthat",
        "lead",
        "fall",
        "apart",
        "dialectical",
        "moment",
        "speculative",
        "moment",
        "definition",
        "determination",
        "content",
        "grows",
        "unifies",
        "particular",
        "character",
        "earlier",
        "determination",
        "unity",
        "distinct",
        "determination",
        "el",
        "remark",
        "speculative",
        "moment",
        "thus",
        "truly",
        "empty",
        "abstract",
        "nothing",
        "negation",
        "certain",
        "determination",
        "elgsh",
        "result",
        "taken",
        "result",
        "emerges",
        "hegel",
        "say",
        "fact",
        "true",
        "result",
        "case",
        "determinate",
        "nothingness",
        "one",
        "content",
        "phgm",
        "also",
        "put",
        "result",
        "conceived",
        "truth",
        "namely",
        "determinate",
        "negation",
        "bestimmte",
        "negation",
        "new",
        "form",
        "thereby",
        "immediately",
        "arisen",
        "phgm",
        "say",
        "b",
        "ecause",
        "result",
        "negation",
        "determinate",
        "negation",
        "bestimmte",
        "negation",
        "content",
        "sldg",
        "cf",
        "slm",
        "hegel",
        "claim",
        "phenomenology",
        "science",
        "logic",
        "philosophy",
        "relies",
        "process",
        "determinate",
        "negation",
        "bestimmte",
        "negation",
        "sometimes",
        "led",
        "scholar",
        "describe",
        "dialectic",
        "method",
        "doctrine",
        "determinate",
        "negation",
        "see",
        "entry",
        "hegel",
        "section",
        "science",
        "logic",
        "cf",
        "rosen",
        "stewart",
        "winfield",
        "several",
        "feature",
        "account",
        "hegel",
        "think",
        "raise",
        "dialectical",
        "method",
        "arbitrariness",
        "plato",
        "dialectic",
        "level",
        "genuine",
        "science",
        "first",
        "determination",
        "moment",
        "understanding",
        "sublate",
        "hegel",
        "dialectic",
        "require",
        "new",
        "idea",
        "show",
        "arbitrarily",
        "instead",
        "movement",
        "new",
        "determination",
        "driven",
        "nature",
        "earlier",
        "determination",
        "come",
        "accord",
        "phgp",
        "indeed",
        "hegel",
        "movement",
        "driven",
        "necessity",
        "see",
        "eg",
        "el",
        "remark",
        "phg",
        "nature",
        "determination",
        "drive",
        "force",
        "pas",
        "opposite",
        "sense",
        "necessitythe",
        "idea",
        "method",
        "involves",
        "forced",
        "earlier",
        "moment",
        "later",
        "onesleads",
        "hegel",
        "regard",
        "dialectic",
        "kind",
        "logic",
        "say",
        "phenomenology",
        "method",
        "proper",
        "exposition",
        "belongs",
        "logic",
        "phgm",
        "necessitythe",
        "sense",
        "driven",
        "forced",
        "conclusionsis",
        "hallmark",
        "logic",
        "western",
        "philosophy",
        "second",
        "form",
        "determination",
        "arises",
        "result",
        "selfsublation",
        "determination",
        "moment",
        "understanding",
        "need",
        "new",
        "idea",
        "show",
        "outside",
        "instead",
        "transition",
        "new",
        "determination",
        "form",
        "necessitated",
        "earlier",
        "moment",
        "hence",
        "grows",
        "process",
        "unlike",
        "plato",
        "arbitrary",
        "dialectic",
        "thenwhich",
        "must",
        "wait",
        "around",
        "idea",
        "come",
        "outsidein",
        "hegel",
        "dialectic",
        "nothing",
        "extraneous",
        "introduced",
        "say",
        "slm",
        "cf",
        "sldg",
        "dialectic",
        "driven",
        "nature",
        "immanence",
        "inwardness",
        "content",
        "slm",
        "cf",
        "sldg",
        "cf",
        "pr",
        "put",
        "dialectic",
        "principle",
        "alone",
        "immanent",
        "coherence",
        "necessity",
        "enter",
        "content",
        "science",
        "elgsh",
        "remark",
        "third",
        "later",
        "determination",
        "sublate",
        "earlier",
        "determination",
        "earlier",
        "determination",
        "completely",
        "cancelled",
        "negated",
        "contrary",
        "earlier",
        "determination",
        "preserved",
        "sense",
        "remain",
        "effect",
        "within",
        "later",
        "determination",
        "beingforitself",
        "instance",
        "introduced",
        "logic",
        "first",
        "concept",
        "ideality",
        "universality",
        "defined",
        "embracing",
        "set",
        "somethingothers",
        "beingforitself",
        "replaces",
        "somethingothers",
        "new",
        "concept",
        "somethingothers",
        "remain",
        "active",
        "within",
        "definition",
        "concept",
        "beingforitself",
        "somethingothers",
        "must",
        "continue",
        "work",
        "picking",
        "individual",
        "somethings",
        "concept",
        "beingforitself",
        "definition",
        "concept",
        "gather",
        "beingforitself",
        "replaces",
        "somethingothers",
        "also",
        "preserve",
        "definition",
        "still",
        "requires",
        "work",
        "picking",
        "individual",
        "somethings",
        "el",
        "concept",
        "apple",
        "example",
        "beingforitself",
        "would",
        "defined",
        "gathering",
        "individual",
        "somethings",
        "one",
        "another",
        "apple",
        "individual",
        "apple",
        "apple",
        "relation",
        "something",
        "ie",
        "apple",
        "onesidedness",
        "restrictedness",
        "lead",
        "something",
        "pas",
        "opposite",
        "somethings",
        "thus",
        "somethingothers",
        "moreover",
        "defining",
        "process",
        "lead",
        "endless",
        "process",
        "passing",
        "back",
        "forth",
        "one",
        "another",
        "one",
        "something",
        "apple",
        "relation",
        "another",
        "something",
        "turn",
        "apple",
        "relation",
        "something",
        "back",
        "forth",
        "endlessly",
        "cf",
        "el",
        "concept",
        "apple",
        "beingforitself",
        "stop",
        "endless",
        "passingover",
        "process",
        "embracing",
        "including",
        "individual",
        "somethingothers",
        "apple",
        "content",
        "grasp",
        "capture",
        "character",
        "quality",
        "apple",
        "somethingothers",
        "must",
        "work",
        "picking",
        "separating",
        "individual",
        "item",
        "apple",
        "concept",
        "apple",
        "as",
        "beingforitselfcan",
        "gather",
        "definition",
        "picture",
        "concept",
        "beingforitself",
        "like",
        "figure",
        "later",
        "concept",
        "thus",
        "replace",
        "also",
        "preserve",
        "earlier",
        "concept",
        "fourth",
        "later",
        "concept",
        "determine",
        "also",
        "surpass",
        "limit",
        "finitude",
        "earlier",
        "concept",
        "earlier",
        "determination",
        "sublate",
        "themselvesthey",
        "pas",
        "others",
        "weakness",
        "onesidedness",
        "restrictedness",
        "definition",
        "thus",
        "limitation",
        "determination",
        "lead",
        "pas",
        "opposite",
        "hegel",
        "say",
        "everything",
        "finite",
        "sublation",
        "elgsh",
        "remark",
        "later",
        "determination",
        "define",
        "finiteness",
        "earlier",
        "determination",
        "point",
        "view",
        "concept",
        "beingforitself",
        "instance",
        "concept",
        "somethingother",
        "limited",
        "finite",
        "although",
        "somethingothers",
        "supposed",
        "one",
        "another",
        "character",
        "sameness",
        "eg",
        "apple",
        "captured",
        "higherlevel",
        "universal",
        "concept",
        "beingforitself",
        "beingforitself",
        "reveals",
        "limitation",
        "concept",
        "somethingother",
        "also",
        "rise",
        "limitation",
        "since",
        "something",
        "concept",
        "somethingother",
        "dialectic",
        "thus",
        "allows",
        "u",
        "get",
        "beyond",
        "finite",
        "universal",
        "hegel",
        "put",
        "genuine",
        "nonexternal",
        "elevation",
        "finite",
        "found",
        "principle",
        "dialectic",
        "elgsh",
        "remark",
        "fifth",
        "determination",
        "speculative",
        "moment",
        "grasp",
        "unity",
        "first",
        "two",
        "moment",
        "hegel",
        "dialectical",
        "method",
        "lead",
        "concept",
        "form",
        "increasingly",
        "comprehensive",
        "universal",
        "hegel",
        "put",
        "result",
        "dialectical",
        "process",
        "new",
        "concept",
        "one",
        "higher",
        "richer",
        "precedingricher",
        "negates",
        "opposes",
        "preceding",
        "therefore",
        "contains",
        "contains",
        "even",
        "unity",
        "opposite",
        "sldg",
        "cf",
        "slm",
        "like",
        "beingforitself",
        "later",
        "concept",
        "universal",
        "unify",
        "built",
        "earlier",
        "determination",
        "include",
        "earlier",
        "determination",
        "part",
        "definition",
        "indeed",
        "many",
        "concept",
        "determination",
        "also",
        "depicted",
        "literally",
        "surrounding",
        "earlier",
        "one",
        "cf",
        "maybee",
        "finally",
        "dialectical",
        "process",
        "lead",
        "increasing",
        "comprehensiveness",
        "universality",
        "ultimately",
        "produce",
        "complete",
        "series",
        "drive",
        "completion",
        "sldg",
        "cf",
        "slm",
        "phg",
        "dialectic",
        "drive",
        "absolute",
        "use",
        "hegel",
        "term",
        "last",
        "final",
        "completely",
        "allencompassing",
        "unconditioned",
        "concept",
        "form",
        "relevant",
        "subject",
        "matter",
        "discussion",
        "logic",
        "phenomenology",
        "ethicspolitics",
        "absolute",
        "concept",
        "form",
        "unconditioned",
        "definition",
        "determination",
        "contains",
        "concept",
        "form",
        "developed",
        "earlier",
        "dialectical",
        "process",
        "subject",
        "matter",
        "moreover",
        "process",
        "develops",
        "necessarily",
        "comprehensively",
        "concept",
        "form",
        "determination",
        "determination",
        "left",
        "process",
        "therefore",
        "leftover",
        "concept",
        "formsconcepts",
        "form",
        "outside",
        "absolute",
        "that",
        "might",
        "condition",
        "define",
        "absolute",
        "thus",
        "unconditioned",
        "contains",
        "condition",
        "content",
        "conditioned",
        "anything",
        "else",
        "outside",
        "absolute",
        "highest",
        "concept",
        "form",
        "universality",
        "subject",
        "matter",
        "thought",
        "concept",
        "whole",
        "conceptual",
        "system",
        "relevant",
        "subject",
        "matter",
        "picture",
        "absolute",
        "idea",
        "el",
        "instancewhich",
        "absolute",
        "logicas",
        "oval",
        "filled",
        "surround",
        "numerous",
        "embedded",
        "ring",
        "smaller",
        "oval",
        "circle",
        "represent",
        "earlier",
        "le",
        "universal",
        "determination",
        "logical",
        "development",
        "cf",
        "maybee",
        "figure",
        "since",
        "absolute",
        "concept",
        "subject",
        "matter",
        "lead",
        "one",
        "another",
        "taken",
        "together",
        "constitute",
        "hegel",
        "entire",
        "philosophical",
        "system",
        "hegel",
        "say",
        "present",
        "therefore",
        "circle",
        "circle",
        "elgsh",
        "picture",
        "entire",
        "system",
        "like",
        "cf",
        "maybee",
        "figure",
        "together",
        "hegel",
        "belief",
        "characteristic",
        "make",
        "dialectical",
        "method",
        "genuinely",
        "scientific",
        "say",
        "dialectical",
        "constitutes",
        "moving",
        "soul",
        "scientific",
        "progression",
        "elgsh",
        "remark",
        "acknowledges",
        "description",
        "method",
        "le",
        "complete",
        "detailed",
        "method",
        "progression",
        "driven",
        "subject",
        "matter",
        "dialectical",
        "method",
        "true",
        "method",
        "slm",
        "sldg"
    ]
}