{
    "main_text": "Life, Work, and Influence\n1. Life, Work, and Influence\nBorn in 1770 in Stuttgart, Hegel spent the years 1788–1793 as\na student in nearby Tübingen, studying first philosophy, and then\ntheology, and forming friendships with fellow students, the future\ngreat romantic poet Friedrich Hölderlin (1770–1843) and\nFriedrich von Schelling (1775–1854), who, like Hegel, would\nbecome one of the major figures of the German philosophical scene in\nthe first half of the nineteenth century. These friendships clearly\nhad a major influence on Hegel’s philosophical development, and\nfor a while the intellectual lives of the three were closely\nintertwined.\nAfter graduation Hegel worked as a tutor for families in Bern and\nthen Frankfurt, where he was reunited with Hölderlin. Until\naround 1800, Hegel devoted himself to developing his ideas on\nreligious and social themes, and seemed to have envisaged a future for\nhimself as a type of modernising and reforming educator, in the image\nof figures of the German Enlightenment such as Lessing and\nSchiller. Around the turn of the century, however, under the influence\nof Hölderlin and Schelling, his interests turned more to issues\narising from the critical philosophy initiated by\nImmanuel Kant (1724–1804) and developed by J.G. Fichte\n(1762–1814). In the 1790s the University of Jena had become a\ncenter for the development of critical philosophy due to the presence\nof K.L.  Reinhold (1757–1823) and then Fichte, who taught there\nfrom 1794 until his dismissal on the grounds of atheism at the end of\nthe decade.  By that time, Schelling, who had first been attracted to\nJena by the presence of Fichte, had become an established figure at\nthe university.  In 1801 Hegel moved to Jena to join Schelling, and in\nsame year published his first philosophical work, The Difference\nbetween Fichte’s and Schelling’s System of\nPhilosophy, in which he argued that Schelling had succeeded where\nFichte had failed in the project of systematizing and thereby\ncompleting Kant’s transcendental idealism. In 1802 and 1803\nHegel and Schelling worked closely together, editing the Critical\nJournal of Philosophy, and on the basis of this association Hegel\ncame to be dogged for many years by the reputation of being a\n“mere” follower of Schelling (who was five years his\njunior).\nBy late 1806 Hegel had completed his first major work,\nthe Phenomenology of Spirit (published 1807), which showed a\ndivergence from his earlier, seemingly more Schellingian, approach.\nSchelling, who had left Jena in 1803, interpreted a barbed criticism\nin the Phenomenology’s preface as aimed at him, and\ntheir friendship abruptly ended. The occupation of Jena by\nNapoleon’s troops as Hegel was completing the manuscript restricted the activities of\nthe university and Hegel departed. Now without a university\nappointment he worked for a short time, apparently very successfully,\nas an editor of a newspaper in Bamberg, and then from 1808–1815\nas the headmaster and philosophy teacher at a gymnasium (high school)\nin Nuremberg. During his time at Nuremberg he married and started a\nfamily, and wrote and published his Science of Logic. In 1816\nhe managed to return to his university career by being appointed to a\nchair in philosophy at the University of Heidelberg, but shortly\nafter, in 1818, he was offered and took up the chair of philosophy at\nthe University of Berlin, the most prestigious position in the German\nphilosophical world. In 1817, while in Heidelberg he published\nthe Encyclopaedia of the Philosophical Sciences, a systematic\nwork in which an abbreviated version of the earlier Science of\nLogic (the Encyclopaedia Logic or Lesser\nLogic) was followed by the application of its principles to the\nphilosophy of nature and the philosophy of spirit. In 1821 in Berlin\nHegel published his major work in political philosophy, Elements\nof the Philosophy of Right, based on lectures given at Heidelberg\nbut ultimately grounded in the section of the Encyclopaedia\nPhilosophy of Spirit dealing with objective\nspirit. During the following ten years up to his death in 1831\nHegel enjoyed celebrity at Berlin, and published subsequent versions\nof the Encyclopaedia. After his death versions of his\nlectures on philosophy of history, philosophy of religion, aesthetics,\nand the history of philosophy were published.\nAfter Hegel’s death, Schelling, whose reputation had long\nsince been eclipsed by that of Hegel, was invited to take up the chair\nat Berlin, reputedly because the government of the day had wanted to\ncounter the influence that Hegelian philosophy had exerted on a\ngeneration of students. Since the early period of his collaboration\nwith Hegel, Schelling had become more religious in his philosophising\nand criticised the rationalism of Hegel’s\nphilosophy. During this time of Schelling’s tenure at Berlin,\nimportant forms of later critical reaction to Hegelian philosophy\ndeveloped. Hegel himself had been a supporter of progressive but\nnon-revolutionary politics, but his followers divided into factions\nbroadly groupable as those of the left,\nright and centre (Toews\n1985); from\nthe left, Karl Marx was to develop his own purported\nscientific approach to society and history which\nappropriated many Hegelian ideas into a materialistic\noutlook.  (Later, especially in reaction to orthodox Soviet versions\nof Marxism, many so-called Western Marxists re-incorporated\nfurther Hegelian elements back into their forms of Marxist\nphilosophy.) Many of Schelling’s own criticisms of Hegel’s\nrationalism found their way into subsequent\nexistentialist thought, especially via the\nwritings of Kierkegaard, who had attended Schelling’s\nlectures. Furthermore, the interpretation Schelling offered of Hegel\nduring these years itself helped to shape subsequent\ngenerations’ understanding of Hegel, contributing to the\northodox or traditional understanding of Hegel as a metaphysical thinker in the pre-Kantian\ndogmatic sense.\nIn academic philosophy, Hegelian idealism had seemed to collapse\ndramatically after 1848 and the failure of the revolutionary movements\nof that year, but underwent a revival in both Great Britain and the\nUnited States in the last decades of the nineteenth century. In\nBritain, where philosophers such as T.H. Green and F.H. Bradley had\ndeveloped metaphysical ideas which they related back to Hegel’s\nthought, Hegel came to be one of the main targets of attack by the\nfounders of the emerging “analytic” movement, Bertrand\nRussell and G.E. Moore. For Russell, the revolutionary innovations in\nlogic starting in the last decades of the nineteenth century with the\nwork of Frege and Peano had destroyed Hegel’s metaphysics by\noverturning the Aristotelian logic on which, so Russell claimed, it\nwas based, and in line with this dismissal, Hegel came to be seen\nwithin the analytic movement as an historical figure of little genuine\nphilosophical interest. To some degree, analogous things could be said\nof Hegel’s reception from within the twentieth-century\nphenomenological tradition that developed in continental Europe, but\nalthough marginalized within such core areas of mainstream academic\nphilosophy, Hegel nevertheless continued to be a figure of interest\nwithin other philosophical movements such as existentialism and\nMarxism. In France, a version of Hegelianism came to influence a\ngeneration of thinkers, including Jean Hyppolite, Jean-Paul Sartre and\nthe psychoanalyst, Jacques Lacan, largely through the lectures of\nAlexandre Kojève. However, a later generation of French\nphilosophers coming to prominence in the 1960s tended to react against\nHegel in ways analogous to those in which early analytic philosophers\nhad reacted against the Hegel who had influenced their\npredecessors. In Germany, having lapsed in the second half of the\nnineteenth century, interest in Hegel was revived at the turn of the\ntwentieth with the historical work of Wilhelm Dilthey, and important\nHegelian elements were incorporated within the approaches of thinkers\nof the Frankfurt School, such as Theodor Adorno, and later,\nJürgen Habermas, as well as within the Heidegger-influenced\nhermeneutic approach of H.-G. Gadamer. In Hungary,\nsimilar Hegelian themes were developed by Georg Lukács and\nlater thinkers of the Budapest School. In the 1960s the\nGerman philosopher Klaus Hartmann developed what was termed a\nnon-metaphysical interpretation of Hegel which, together\nwith the work of Dieter Henrich and others, played an important role\nin the revival of interest in Hegel in academic philosophy in the\nsecond half of the century. Within English-speaking philosophy, the\nfinal quarter of the twentieth century saw something of a revival of\nserious interest in Hegel’s philosophy with important works\nappearing such as those by H.S. Harris, Charles Taylor, Robert Pippin\nand Terry Pinkard in North America, and Stephen Houlgate and Robert\nStern in Great Britain. By the close of the twentieth century, even\nwithin core logico-metaphysical areas of analytic philosophy, a number\nof individuals such as Robert Brandom and John McDowell had started to\ntake Hegel seriously as a significant modern philosopher, although\ngenerally within analytic circles a favorable reassessment of Hegel\nhas still a long way to go.\n",
    "section_title": "1. Life, Work, and Influence",
    "entry_title": "Georg Wilhelm Friedrich Hegel",
    "hierarchy_title": "Georg Wilhelm Friedrich Hegel || Life, Work, and Influence",
    "tokenized_text": [
        "life",
        "work",
        "influence",
        "life",
        "work",
        "influence",
        "born",
        "stuttgart",
        "hegel",
        "spent",
        "year",
        "student",
        "nearby",
        "tübingen",
        "studying",
        "first",
        "philosophy",
        "theology",
        "forming",
        "friendship",
        "fellow",
        "student",
        "future",
        "great",
        "romantic",
        "poet",
        "friedrich",
        "hölderlin",
        "friedrich",
        "von",
        "schelling",
        "like",
        "hegel",
        "would",
        "become",
        "one",
        "major",
        "figure",
        "german",
        "philosophical",
        "scene",
        "first",
        "half",
        "nineteenth",
        "century",
        "friendship",
        "clearly",
        "major",
        "influence",
        "hegel",
        "philosophical",
        "development",
        "intellectual",
        "life",
        "three",
        "closely",
        "intertwined",
        "graduation",
        "hegel",
        "worked",
        "tutor",
        "family",
        "bern",
        "frankfurt",
        "reunited",
        "hölderlin",
        "around",
        "hegel",
        "devoted",
        "developing",
        "idea",
        "religious",
        "social",
        "theme",
        "seemed",
        "envisaged",
        "future",
        "type",
        "modernising",
        "reforming",
        "educator",
        "image",
        "figure",
        "german",
        "enlightenment",
        "lessing",
        "schiller",
        "around",
        "turn",
        "century",
        "however",
        "influence",
        "hölderlin",
        "schelling",
        "interest",
        "turned",
        "issue",
        "arising",
        "critical",
        "philosophy",
        "initiated",
        "immanuel",
        "kant",
        "developed",
        "jg",
        "fichte",
        "s",
        "university",
        "jena",
        "become",
        "center",
        "development",
        "critical",
        "philosophy",
        "due",
        "presence",
        "kl",
        "reinhold",
        "fichte",
        "taught",
        "dismissal",
        "ground",
        "atheism",
        "end",
        "decade",
        "time",
        "schelling",
        "first",
        "attracted",
        "jena",
        "presence",
        "fichte",
        "become",
        "established",
        "figure",
        "university",
        "hegel",
        "moved",
        "jena",
        "join",
        "schelling",
        "year",
        "published",
        "first",
        "philosophical",
        "work",
        "difference",
        "fichte",
        "schelling",
        "system",
        "philosophy",
        "argued",
        "schelling",
        "succeeded",
        "fichte",
        "failed",
        "project",
        "systematizing",
        "thereby",
        "completing",
        "kant",
        "transcendental",
        "idealism",
        "hegel",
        "schelling",
        "worked",
        "closely",
        "together",
        "editing",
        "critical",
        "journal",
        "philosophy",
        "basis",
        "association",
        "hegel",
        "came",
        "dogged",
        "many",
        "year",
        "reputation",
        "mere",
        "follower",
        "schelling",
        "five",
        "year",
        "junior",
        "late",
        "hegel",
        "completed",
        "first",
        "major",
        "work",
        "phenomenology",
        "spirit",
        "published",
        "showed",
        "divergence",
        "earlier",
        "seemingly",
        "schellingian",
        "approach",
        "schelling",
        "left",
        "jena",
        "interpreted",
        "barbed",
        "criticism",
        "phenomenology",
        "preface",
        "aimed",
        "friendship",
        "abruptly",
        "ended",
        "occupation",
        "jena",
        "napoleon",
        "troop",
        "hegel",
        "completing",
        "manuscript",
        "restricted",
        "activity",
        "university",
        "hegel",
        "departed",
        "without",
        "university",
        "appointment",
        "worked",
        "short",
        "time",
        "apparently",
        "successfully",
        "editor",
        "newspaper",
        "bamberg",
        "headmaster",
        "philosophy",
        "teacher",
        "gymnasium",
        "high",
        "school",
        "nuremberg",
        "time",
        "nuremberg",
        "married",
        "started",
        "family",
        "wrote",
        "published",
        "science",
        "logic",
        "managed",
        "return",
        "university",
        "career",
        "appointed",
        "chair",
        "philosophy",
        "university",
        "heidelberg",
        "shortly",
        "offered",
        "took",
        "chair",
        "philosophy",
        "university",
        "berlin",
        "prestigious",
        "position",
        "german",
        "philosophical",
        "world",
        "heidelberg",
        "published",
        "encyclopaedia",
        "philosophical",
        "science",
        "systematic",
        "work",
        "abbreviated",
        "version",
        "earlier",
        "science",
        "logic",
        "encyclopaedia",
        "logic",
        "lesser",
        "logic",
        "followed",
        "application",
        "principle",
        "philosophy",
        "nature",
        "philosophy",
        "spirit",
        "berlin",
        "hegel",
        "published",
        "major",
        "work",
        "political",
        "philosophy",
        "element",
        "philosophy",
        "right",
        "based",
        "lecture",
        "given",
        "heidelberg",
        "ultimately",
        "grounded",
        "section",
        "encyclopaedia",
        "philosophy",
        "spirit",
        "dealing",
        "objective",
        "spirit",
        "following",
        "ten",
        "year",
        "death",
        "hegel",
        "enjoyed",
        "celebrity",
        "berlin",
        "published",
        "subsequent",
        "version",
        "encyclopaedia",
        "death",
        "version",
        "lecture",
        "philosophy",
        "history",
        "philosophy",
        "religion",
        "aesthetic",
        "history",
        "philosophy",
        "published",
        "hegel",
        "death",
        "schelling",
        "whose",
        "reputation",
        "long",
        "since",
        "eclipsed",
        "hegel",
        "invited",
        "take",
        "chair",
        "berlin",
        "reputedly",
        "government",
        "day",
        "wanted",
        "counter",
        "influence",
        "hegelian",
        "philosophy",
        "exerted",
        "generation",
        "student",
        "since",
        "early",
        "period",
        "collaboration",
        "hegel",
        "schelling",
        "become",
        "religious",
        "philosophising",
        "criticised",
        "rationalism",
        "hegel",
        "philosophy",
        "time",
        "schelling",
        "tenure",
        "berlin",
        "important",
        "form",
        "later",
        "critical",
        "reaction",
        "hegelian",
        "philosophy",
        "developed",
        "hegel",
        "supporter",
        "progressive",
        "nonrevolutionary",
        "politics",
        "follower",
        "divided",
        "faction",
        "broadly",
        "groupable",
        "left",
        "right",
        "centre",
        "toews",
        "left",
        "karl",
        "marx",
        "develop",
        "purported",
        "scientific",
        "approach",
        "society",
        "history",
        "appropriated",
        "many",
        "hegelian",
        "idea",
        "materialistic",
        "outlook",
        "later",
        "especially",
        "reaction",
        "orthodox",
        "soviet",
        "version",
        "marxism",
        "many",
        "socalled",
        "western",
        "marxist",
        "reincorporated",
        "hegelian",
        "element",
        "back",
        "form",
        "marxist",
        "philosophy",
        "many",
        "schelling",
        "criticism",
        "hegel",
        "rationalism",
        "found",
        "way",
        "subsequent",
        "existentialist",
        "thought",
        "especially",
        "via",
        "writing",
        "kierkegaard",
        "attended",
        "schelling",
        "lecture",
        "furthermore",
        "interpretation",
        "schelling",
        "offered",
        "hegel",
        "year",
        "helped",
        "shape",
        "subsequent",
        "generation",
        "understanding",
        "hegel",
        "contributing",
        "orthodox",
        "traditional",
        "understanding",
        "hegel",
        "metaphysical",
        "thinker",
        "prekantian",
        "dogmatic",
        "sense",
        "academic",
        "philosophy",
        "hegelian",
        "idealism",
        "seemed",
        "collapse",
        "dramatically",
        "failure",
        "revolutionary",
        "movement",
        "year",
        "underwent",
        "revival",
        "great",
        "britain",
        "united",
        "state",
        "last",
        "decade",
        "nineteenth",
        "century",
        "britain",
        "philosopher",
        "th",
        "green",
        "fh",
        "bradley",
        "developed",
        "metaphysical",
        "idea",
        "related",
        "back",
        "hegel",
        "thought",
        "hegel",
        "came",
        "one",
        "main",
        "target",
        "attack",
        "founder",
        "emerging",
        "analytic",
        "movement",
        "bertrand",
        "russell",
        "ge",
        "moore",
        "russell",
        "revolutionary",
        "innovation",
        "logic",
        "starting",
        "last",
        "decade",
        "nineteenth",
        "century",
        "work",
        "frege",
        "peano",
        "destroyed",
        "hegel",
        "metaphysics",
        "overturning",
        "aristotelian",
        "logic",
        "russell",
        "claimed",
        "based",
        "line",
        "dismissal",
        "hegel",
        "came",
        "seen",
        "within",
        "analytic",
        "movement",
        "historical",
        "figure",
        "little",
        "genuine",
        "philosophical",
        "interest",
        "degree",
        "analogous",
        "thing",
        "could",
        "said",
        "hegel",
        "reception",
        "within",
        "twentiethcentury",
        "phenomenological",
        "tradition",
        "developed",
        "continental",
        "europe",
        "although",
        "marginalized",
        "within",
        "core",
        "area",
        "mainstream",
        "academic",
        "philosophy",
        "hegel",
        "nevertheless",
        "continued",
        "figure",
        "interest",
        "within",
        "philosophical",
        "movement",
        "existentialism",
        "marxism",
        "france",
        "version",
        "hegelianism",
        "came",
        "influence",
        "generation",
        "thinker",
        "including",
        "jean",
        "hyppolite",
        "jeanpaul",
        "sartre",
        "psychoanalyst",
        "jacques",
        "lacan",
        "largely",
        "lecture",
        "alexandre",
        "kojève",
        "however",
        "later",
        "generation",
        "french",
        "philosopher",
        "coming",
        "prominence",
        "s",
        "tended",
        "react",
        "hegel",
        "way",
        "analogous",
        "early",
        "analytic",
        "philosopher",
        "reacted",
        "hegel",
        "influenced",
        "predecessor",
        "germany",
        "lapsed",
        "second",
        "half",
        "nineteenth",
        "century",
        "interest",
        "hegel",
        "revived",
        "turn",
        "twentieth",
        "historical",
        "work",
        "wilhelm",
        "dilthey",
        "important",
        "hegelian",
        "element",
        "incorporated",
        "within",
        "approach",
        "thinker",
        "frankfurt",
        "school",
        "theodor",
        "adorno",
        "later",
        "jürgen",
        "habermas",
        "well",
        "within",
        "heideggerinfluenced",
        "hermeneutic",
        "approach",
        "hg",
        "gadamer",
        "hungary",
        "similar",
        "hegelian",
        "theme",
        "developed",
        "georg",
        "lukács",
        "later",
        "thinker",
        "budapest",
        "school",
        "s",
        "german",
        "philosopher",
        "klaus",
        "hartmann",
        "developed",
        "termed",
        "nonmetaphysical",
        "interpretation",
        "hegel",
        "together",
        "work",
        "dieter",
        "henrich",
        "others",
        "played",
        "important",
        "role",
        "revival",
        "interest",
        "hegel",
        "academic",
        "philosophy",
        "second",
        "half",
        "century",
        "within",
        "englishspeaking",
        "philosophy",
        "final",
        "quarter",
        "twentieth",
        "century",
        "saw",
        "something",
        "revival",
        "serious",
        "interest",
        "hegel",
        "philosophy",
        "important",
        "work",
        "appearing",
        "hs",
        "harris",
        "charles",
        "taylor",
        "robert",
        "pippin",
        "terry",
        "pinkard",
        "north",
        "america",
        "stephen",
        "houlgate",
        "robert",
        "stern",
        "great",
        "britain",
        "close",
        "twentieth",
        "century",
        "even",
        "within",
        "core",
        "logicometaphysical",
        "area",
        "analytic",
        "philosophy",
        "number",
        "individual",
        "robert",
        "brandom",
        "john",
        "mcdowell",
        "started",
        "take",
        "hegel",
        "seriously",
        "significant",
        "modern",
        "philosopher",
        "although",
        "generally",
        "within",
        "analytic",
        "circle",
        "favorable",
        "reassessment",
        "hegel",
        "still",
        "long",
        "way",
        "go"
    ]
}