{
    "main_text": "Heidegger for Art, Introduction:  The Three Pillars of Heidegger’s Understanding of Art\n3. Heidegger for Art, Introduction:  The Three Pillars of Heidegger’s Understanding of Art \n\n\n“The Origin of the Work of Art”—an essay Heidegger\ndelivered repeatedly between 1935 and 1936, rewriting and expanding it\ninto three lectures (which became the three main sections of the\npublished essay, to which Heidegger then added a brief\n“Afterword” near the end of the 1930s and a slightly longer\n“Addendum” in 1957)—is far and away the most\nimportant source for understanding his attempt to articulate an\nalternative to the aesthetic understanding of art, although several\nother works (contemporaneous as well as later) also provide important\nclues to his\n view.[30]\nIn the final version of this famous\nessay, Heidegger meditates on three different works of art in\nsuccession: A painting of “A Pair of Shoes” by\nVincent van Gogh; a poem entitled “The Roman Fountain” by\nC. F. Meyer, and an unspecified Greek temple at Paestum (most likely\nthe temple to Hera). Leading Heidegger scholars such as Hubert\nDreyfus and Julian Young rely almost entirely on Heidegger’s\ninterpretation of the ancient Greek temple in order to explicate his\n“promethean” view of art’s historically revolutionary\npotential, its ability to focus and transform our sense of what is and\nwhat matters (as we saw in section 1.1). Young (2001, p. 22) and\nDreyfus (2005, p. 409) suggest that Heidegger’s interpretation of\nVan Gogh is “anomalous” and “largely\nirrelevant” to this view, despite the fame generated by the\nlongstanding controversy surrounding it (a controversy to which we will\nreturn at the\n end).[31]\nLike almost all other scholars,\nmoreover, Dreyfus and Young simply overlook Heidegger’s\nintroduction of Meyer’s poem—even as they recognize that\nfor Heidegger, like Plato, “poetry” names the very essence\nof art (namely, poiêsis or “bringing into\nbeing”), hence Heidegger’s claim that: “All\nart [that is, all bringing-into-being] … is essentially\npoetry” (PLT 73/GA5 59). We thus have to wonder:\nIs the only complete poem Heidegger included in the essay that advances\nthis view of poetry as the essence of art really of no\n significance?[32]\n\n\nIn my view, Heidegger’s analysis of each of these three works\ncontributes something important to his overarching attempt to guide\nreaders into a phenomenological encounter with art that is capable of\nhelping us transcend modern aesthetics from within. To put it\nsimply, the temple motivates and helps develop the details of\nHeidegger’s larger project; the poem implicitly contextualizes\nand explains it; and the painting (and only the painting) directly\nexemplifies it. In order to see how, let us take these points in\norder. Heidegger’s imaginative reconstruction of the lost\ntemple helps motivate his quest for a non-aesthetic encounter with art,\nbut not (as is often said) because he seeks some nostalgic return to\nthe Greek world. Heidegger dismisses such a revival as an\nimpossibility because the ancient temple—just like the medieval\ncathedral—no longer gathers its historical world around it and\nthus no longer works as great art, and such “world-withdrawal and\nworld-decay can never be reversed” (PLT 41/GA5 26).\nInstead, the Greek temple shows that art was once encountered in a way\nother than as a subject’s intense aesthetic experience of an\nobject, and thus suggests that, while those ancient and medieval worlds\nhave been lost irretrievably, other works of art might yet be\nencountered non-aesthetically in our late-modern world. Heidegger\nthus elaborates his philosophical vision of how the temple worked for a\ntime to unify a coherent and meaningful historical world around itself\n(by inconspicuously focusing and illuminating its people’s sense\nof what is and what matters) in order to suggest that a non-aesthetic\nencounter with art might yet do the same thing once again: A work\nof art might yet help to gather a new historical world around itself by\nfocusing and illuminating an understanding of being that does not\nreduce entities either to modern objects to be controlled or to\nlate-modern resources to be optimized.\n\n\nWhile Heidegger’s project is thus undeniably inspired by the\npast, this inspiration serves his goal of helping us move historically\ninto the future. His guiding hope, we have seen, is that a\nnon-aesthetic encounter with a contemporary artwork will help us learn\nto understand the being of entities not as modern objects\n(“subjectivism”) or as late-modern resources\n(“enframing”) but in a genuinely post-modern way, thereby\nmaking another historical beginning. So, which work of art does\nHeidegger think can help us late moderns learn to transcend modern\naesthetics from within and thereby discover a path leading beyond\nmodernity? There are only two viable candidates to fill this\ncrucial role in “The Origin of the Work of Art”:\nMeyer’s poem and Van Gogh’s\n painting.[33]\n\n\nSo, why does Heidegger give such pride of place to Meyer’s\npoem? The answer to this puzzle (which too few readers even\nnotice) is that the poem introduces the broader philosophical context\nof Heidegger’s project by conveying his emerging understanding of\nhistoricity, the doctrine according to which our fundamental\nsense of reality changes over\n time.[34]\nThe ontological “truth”\nthat Meyer’s poem embodies—and “sets to work,”\nin Heidegger’s creative appropriation of the poem—is that\ntruth itself is essentially historical and, moreover, that this\nessential history of truth forms three successive “epochs,”\nin the same way that the “jet” of water fills the three\nconsecutive “basins” in Meyer’s eponymous\n fountain.[35]\nFor\nHeidegger, to put it more precisely, the relations Meyer’s poem\ndescribes between the fountain’s original “jet” and\nits three successive water basins illuminate the relations between\n“being” itself (that is, as we will see, the inexhaustible\nontological source of historical intelligibility) and the three main\nhistorical “epochs” or ages in Western humanity’s\nunderstanding of being (as Heidegger conceived of this “history\nof being” in 1936), namely, ancient “Greece,”\n“the middle ages,” and “the modern age” (PLT\n76–7/GA5\n 64–5).[36]\n\n\nThus, for example, just as the original “jet” of water\n“falls” into the fountain’s successive basins, so the\n“overflowing” ontological riches concealed in the ancient\nworld were first diminished in the medieval world. “The\nOrigin of the Work of Art” make the contentious case that this\nontological diminution “begins” when concepts central to\nthe ancient Greek understanding of being get translated into Latin\nwithout a full experience of what those concepts originally revealed\n(PLT 23/GA5 8). Hence the obvious appeal for Heidegger of\nMeyer’s suggestive line: “Veiling itself, this [first\nbasin] overflows / Into a second basin’s ground” (PLT\n37/GA5 23). What remained of these ontological\n“riches” in the medieval world was then transposed into and\nreduced further in the modern epoch which, like the fountain’s\nthird basin, stands at the furthest remove from its original source.\nIt thus seems clear that Heidegger included Meyer’s poem\nbecause he believed it suggestively illuminated the way the history of\nbeing unfolds as an epochal history of decline, a “fall” which\nresults from this history’s increasing forgetting of the source\nfrom which it ultimately springs—the Ur-sprung or\n“origin” of Heidegger’s essay’s title—in\na word: “Being” (Sein), Heidegger’s\nfamous name for the source from which all historical intelligibility\noriginates (by way of the disclosive “naming-into-being” which\nHeidegger understands as the “poetic” essence of art, as we\nwill see in the next section). In other words, Heidegger uses\nMeyer’s poem to allude to the broader philosophical context that\nhelps explain and motivate the new historical beginning he hopes art\nwill help us inaugurate. Heidegger’s use of this particular\npoem suggests, moreover, that in order to accomplish this “other\nbeginning,” Western humanity needs to learn to tap back into that\noriginal, ontological source (the overflowing “jet” of\nbeing), and that such a reconnection with the source of historical\nintelligibility is something art can still teach us. (Although\ninterpreters also overlook this, the quiet presence of a homophonous\n“third reich” in Meyer’s poem reminds us of the\ndeeply-troubling dimension of Heidegger’s thinking in the\nmid-1930s, the fact that his philosophical hopes for the future were\nfor a brief time deeply entwined with his idiosyncratic understanding\nof the direction that the burgeoning National Socialist\n“revolution” might yet\n take.)[37]\n\n\nWhile both the temple and the poem thus remain quite important, only\nVan Gogh’s painting directly exemplifies what Heidegger thinks it\nmeans to encounter art in a way that allows us to transcend modern\naesthetics from within. This means that Heidegger’s\ninterpretation of Van Gogh’s painting, far from being irrelevant,\nis actually the most important part of his essay. For, it is only\nfrom Heidegger’s phenomenological interpretation of Van\nGogh’s artwork that we late moderns can learn how to transcend\nmodern aesthetics from within, and thereby learn from art what it means\nto encounter being in a post-modern way. Since we have already\nsummarized Heidegger’s “promethean” view of the\nhistorically-revolutionary work accomplished by the ancient Greek\ntemple (in section 1.1), we will expand on the point of his return to\nGreece only briefly (in section 3.1), saying more about how this return\nto the past is supposed to help lead us into the future. The rest\nof what follows will be dedicated primarily to explaining\nHeidegger’s pivotal understanding of Van Gogh’s\n painting.[38]\nOur\nultimate objective will be to show how Heidegger’s interpretation\nof Van Gogh allows him to move phenomenologically from the analysis of\na particular, individual (“ontic”) work of art to the\nontological structure of artwork in general. Along the way, we will\npresent the main details of the postmodern understanding of being that\nHeidegger thinks we can learn from a non-aesthetic encounter with the\nwork of art (section 3.7). Once we understand the ordered\nsequence of steps in the phenomenological interpretation whereby\nHeidegger thinks we can transcend modern aesthetics from within,\nmoreover, we will finally be able to resolve the long-standing\ncontroversy surrounding Heidegger’s interpretation of Van Gogh\n(as we will see in section 4).\n",
    "section_title": "3. Heidegger for Art, Introduction:  The Three Pillars of Heidegger’s Understanding of Art ",
    "entry_title": "Heidegger’s Aesthetics",
    "hierarchy_title": "Heidegger’s Aesthetics || Heidegger for Art, Introduction:  The Three Pillars of Heidegger’s Understanding of Art",
    "tokenized_text": [
        "heidegger",
        "art",
        "introduction",
        "three",
        "pillar",
        "heidegger",
        "understanding",
        "art",
        "heidegger",
        "art",
        "introduction",
        "three",
        "pillar",
        "heidegger",
        "understanding",
        "art",
        "origin",
        "work",
        "art",
        "an",
        "essay",
        "heidegger",
        "delivered",
        "repeatedly",
        "rewriting",
        "expanding",
        "three",
        "lecture",
        "became",
        "three",
        "main",
        "section",
        "published",
        "essay",
        "heidegger",
        "added",
        "brief",
        "afterword",
        "near",
        "end",
        "s",
        "slightly",
        "longer",
        "addendum",
        "is",
        "far",
        "away",
        "important",
        "source",
        "understanding",
        "attempt",
        "articulate",
        "alternative",
        "aesthetic",
        "understanding",
        "art",
        "although",
        "several",
        "work",
        "contemporaneous",
        "well",
        "later",
        "also",
        "provide",
        "important",
        "clue",
        "view",
        "final",
        "version",
        "famous",
        "essay",
        "heidegger",
        "meditates",
        "three",
        "different",
        "work",
        "art",
        "succession",
        "painting",
        "pair",
        "shoe",
        "vincent",
        "van",
        "gogh",
        "poem",
        "entitled",
        "roman",
        "fountain",
        "c",
        "f",
        "meyer",
        "unspecified",
        "greek",
        "temple",
        "paestum",
        "likely",
        "temple",
        "hera",
        "leading",
        "heidegger",
        "scholar",
        "hubert",
        "dreyfus",
        "julian",
        "young",
        "rely",
        "almost",
        "entirely",
        "heidegger",
        "interpretation",
        "ancient",
        "greek",
        "temple",
        "order",
        "explicate",
        "promethean",
        "view",
        "art",
        "historically",
        "revolutionary",
        "potential",
        "ability",
        "focus",
        "transform",
        "sense",
        "matter",
        "saw",
        "section",
        "young",
        "p",
        "dreyfus",
        "p",
        "suggest",
        "heidegger",
        "interpretation",
        "van",
        "gogh",
        "anomalous",
        "largely",
        "irrelevant",
        "view",
        "despite",
        "fame",
        "generated",
        "longstanding",
        "controversy",
        "surrounding",
        "controversy",
        "return",
        "end",
        "like",
        "almost",
        "scholar",
        "moreover",
        "dreyfus",
        "young",
        "simply",
        "overlook",
        "heidegger",
        "introduction",
        "meyer",
        "poemeven",
        "recognize",
        "heidegger",
        "like",
        "plato",
        "poetry",
        "name",
        "essence",
        "art",
        "namely",
        "poiêsis",
        "bringing",
        "hence",
        "heidegger",
        "claim",
        "art",
        "bringingintobeing",
        "essentially",
        "poetry",
        "plt",
        "ga",
        "thus",
        "wonder",
        "complete",
        "poem",
        "heidegger",
        "included",
        "essay",
        "advance",
        "view",
        "poetry",
        "essence",
        "art",
        "really",
        "significance",
        "view",
        "heidegger",
        "analysis",
        "three",
        "work",
        "contributes",
        "something",
        "important",
        "overarching",
        "attempt",
        "guide",
        "reader",
        "phenomenological",
        "encounter",
        "art",
        "capable",
        "helping",
        "u",
        "transcend",
        "modern",
        "aesthetic",
        "within",
        "put",
        "simply",
        "temple",
        "motivates",
        "help",
        "develop",
        "detail",
        "heidegger",
        "larger",
        "project",
        "poem",
        "implicitly",
        "contextualizes",
        "explains",
        "painting",
        "painting",
        "directly",
        "exemplifies",
        "order",
        "see",
        "let",
        "u",
        "take",
        "point",
        "order",
        "heidegger",
        "imaginative",
        "reconstruction",
        "lost",
        "temple",
        "help",
        "motivate",
        "quest",
        "nonaesthetic",
        "encounter",
        "art",
        "often",
        "said",
        "seek",
        "nostalgic",
        "return",
        "greek",
        "world",
        "heidegger",
        "dismisses",
        "revival",
        "impossibility",
        "ancient",
        "templejust",
        "like",
        "medieval",
        "cathedralno",
        "longer",
        "gather",
        "historical",
        "world",
        "around",
        "thus",
        "longer",
        "work",
        "great",
        "art",
        "worldwithdrawal",
        "worlddecay",
        "never",
        "reversed",
        "plt",
        "ga",
        "instead",
        "greek",
        "temple",
        "show",
        "art",
        "encountered",
        "way",
        "subject",
        "intense",
        "aesthetic",
        "experience",
        "object",
        "thus",
        "suggests",
        "ancient",
        "medieval",
        "world",
        "lost",
        "irretrievably",
        "work",
        "art",
        "might",
        "yet",
        "encountered",
        "nonaesthetically",
        "latemodern",
        "world",
        "heidegger",
        "thus",
        "elaborates",
        "philosophical",
        "vision",
        "temple",
        "worked",
        "time",
        "unify",
        "coherent",
        "meaningful",
        "historical",
        "world",
        "around",
        "inconspicuously",
        "focusing",
        "illuminating",
        "people",
        "sense",
        "matter",
        "order",
        "suggest",
        "nonaesthetic",
        "encounter",
        "art",
        "might",
        "yet",
        "thing",
        "work",
        "art",
        "might",
        "yet",
        "help",
        "gather",
        "new",
        "historical",
        "world",
        "around",
        "focusing",
        "illuminating",
        "understanding",
        "reduce",
        "entity",
        "either",
        "modern",
        "object",
        "controlled",
        "latemodern",
        "resource",
        "optimized",
        "heidegger",
        "project",
        "thus",
        "undeniably",
        "inspired",
        "past",
        "inspiration",
        "serf",
        "goal",
        "helping",
        "u",
        "move",
        "historically",
        "future",
        "guiding",
        "hope",
        "seen",
        "nonaesthetic",
        "encounter",
        "contemporary",
        "artwork",
        "help",
        "u",
        "learn",
        "understand",
        "entity",
        "modern",
        "object",
        "subjectivism",
        "latemodern",
        "resource",
        "enframing",
        "genuinely",
        "postmodern",
        "way",
        "thereby",
        "making",
        "another",
        "historical",
        "beginning",
        "work",
        "art",
        "heidegger",
        "think",
        "help",
        "u",
        "late",
        "modern",
        "learn",
        "transcend",
        "modern",
        "aesthetic",
        "within",
        "thereby",
        "discover",
        "path",
        "leading",
        "beyond",
        "modernity",
        "two",
        "viable",
        "candidate",
        "fill",
        "crucial",
        "role",
        "origin",
        "work",
        "art",
        "meyer",
        "poem",
        "van",
        "gogh",
        "painting",
        "heidegger",
        "give",
        "pride",
        "place",
        "meyer",
        "poem",
        "answer",
        "puzzle",
        "reader",
        "even",
        "notice",
        "poem",
        "introduces",
        "broader",
        "philosophical",
        "context",
        "heidegger",
        "project",
        "conveying",
        "emerging",
        "understanding",
        "historicity",
        "doctrine",
        "according",
        "fundamental",
        "sense",
        "reality",
        "change",
        "time",
        "ontological",
        "truth",
        "meyer",
        "poem",
        "embodiesand",
        "set",
        "work",
        "heidegger",
        "creative",
        "appropriation",
        "poemis",
        "truth",
        "essentially",
        "historical",
        "moreover",
        "essential",
        "history",
        "truth",
        "form",
        "three",
        "successive",
        "epoch",
        "way",
        "jet",
        "water",
        "fill",
        "three",
        "consecutive",
        "basin",
        "meyer",
        "eponymous",
        "fountain",
        "heidegger",
        "put",
        "precisely",
        "relation",
        "meyer",
        "poem",
        "describes",
        "fountain",
        "original",
        "jet",
        "three",
        "successive",
        "water",
        "basin",
        "illuminate",
        "relation",
        "see",
        "inexhaustible",
        "ontological",
        "source",
        "historical",
        "intelligibility",
        "three",
        "main",
        "historical",
        "epoch",
        "age",
        "western",
        "humanity",
        "understanding",
        "heidegger",
        "conceived",
        "history",
        "namely",
        "ancient",
        "greece",
        "middle",
        "age",
        "modern",
        "age",
        "plt",
        "ga",
        "thus",
        "example",
        "original",
        "jet",
        "water",
        "fall",
        "fountain",
        "successive",
        "basin",
        "overflowing",
        "ontological",
        "rich",
        "concealed",
        "ancient",
        "world",
        "first",
        "diminished",
        "medieval",
        "world",
        "origin",
        "work",
        "art",
        "make",
        "contentious",
        "case",
        "ontological",
        "diminution",
        "begin",
        "concept",
        "central",
        "ancient",
        "greek",
        "understanding",
        "get",
        "translated",
        "latin",
        "without",
        "full",
        "experience",
        "concept",
        "originally",
        "revealed",
        "plt",
        "ga",
        "hence",
        "obvious",
        "appeal",
        "heidegger",
        "meyer",
        "suggestive",
        "line",
        "veiling",
        "first",
        "basin",
        "overflow",
        "second",
        "basin",
        "ground",
        "plt",
        "ga",
        "remained",
        "ontological",
        "rich",
        "medieval",
        "world",
        "transposed",
        "reduced",
        "modern",
        "epoch",
        "like",
        "fountain",
        "third",
        "basin",
        "stand",
        "furthest",
        "remove",
        "original",
        "source",
        "thus",
        "seems",
        "clear",
        "heidegger",
        "included",
        "meyer",
        "poem",
        "believed",
        "suggestively",
        "illuminated",
        "way",
        "history",
        "unfolds",
        "epochal",
        "history",
        "decline",
        "fall",
        "result",
        "history",
        "increasing",
        "forgetting",
        "source",
        "ultimately",
        "springsthe",
        "ursprung",
        "origin",
        "heidegger",
        "essay",
        "titlein",
        "word",
        "sein",
        "heidegger",
        "famous",
        "name",
        "source",
        "historical",
        "intelligibility",
        "originates",
        "way",
        "disclosive",
        "namingintobeing",
        "heidegger",
        "understands",
        "poetic",
        "essence",
        "art",
        "see",
        "next",
        "section",
        "word",
        "heidegger",
        "us",
        "meyer",
        "poem",
        "allude",
        "broader",
        "philosophical",
        "context",
        "help",
        "explain",
        "motivate",
        "new",
        "historical",
        "beginning",
        "hope",
        "art",
        "help",
        "u",
        "inaugurate",
        "heidegger",
        "use",
        "particular",
        "poem",
        "suggests",
        "moreover",
        "order",
        "accomplish",
        "beginning",
        "western",
        "humanity",
        "need",
        "learn",
        "tap",
        "back",
        "original",
        "ontological",
        "source",
        "overflowing",
        "jet",
        "reconnection",
        "source",
        "historical",
        "intelligibility",
        "something",
        "art",
        "still",
        "teach",
        "u",
        "although",
        "interpreter",
        "also",
        "overlook",
        "quiet",
        "presence",
        "homophonous",
        "third",
        "reich",
        "meyer",
        "poem",
        "reminds",
        "u",
        "deeplytroubling",
        "dimension",
        "heidegger",
        "thinking",
        "mids",
        "fact",
        "philosophical",
        "hope",
        "future",
        "brief",
        "time",
        "deeply",
        "entwined",
        "idiosyncratic",
        "understanding",
        "direction",
        "burgeoning",
        "national",
        "socialist",
        "revolution",
        "might",
        "yet",
        "take",
        "temple",
        "poem",
        "thus",
        "remain",
        "quite",
        "important",
        "van",
        "gogh",
        "painting",
        "directly",
        "exemplifies",
        "heidegger",
        "think",
        "mean",
        "encounter",
        "art",
        "way",
        "allows",
        "u",
        "transcend",
        "modern",
        "aesthetic",
        "within",
        "mean",
        "heidegger",
        "interpretation",
        "van",
        "gogh",
        "painting",
        "far",
        "irrelevant",
        "actually",
        "important",
        "part",
        "essay",
        "heidegger",
        "phenomenological",
        "interpretation",
        "van",
        "gogh",
        "artwork",
        "late",
        "modern",
        "learn",
        "transcend",
        "modern",
        "aesthetic",
        "within",
        "thereby",
        "learn",
        "art",
        "mean",
        "encounter",
        "postmodern",
        "way",
        "since",
        "already",
        "summarized",
        "heidegger",
        "promethean",
        "view",
        "historicallyrevolutionary",
        "work",
        "accomplished",
        "ancient",
        "greek",
        "temple",
        "section",
        "expand",
        "point",
        "return",
        "greece",
        "briefly",
        "section",
        "saying",
        "return",
        "past",
        "supposed",
        "help",
        "lead",
        "u",
        "future",
        "rest",
        "follows",
        "dedicated",
        "primarily",
        "explaining",
        "heidegger",
        "pivotal",
        "understanding",
        "van",
        "gogh",
        "painting",
        "ultimate",
        "objective",
        "show",
        "heidegger",
        "interpretation",
        "van",
        "gogh",
        "allows",
        "move",
        "phenomenologically",
        "analysis",
        "particular",
        "individual",
        "ontic",
        "work",
        "art",
        "ontological",
        "structure",
        "artwork",
        "general",
        "along",
        "way",
        "present",
        "main",
        "detail",
        "postmodern",
        "understanding",
        "heidegger",
        "think",
        "learn",
        "nonaesthetic",
        "encounter",
        "work",
        "art",
        "section",
        "understand",
        "ordered",
        "sequence",
        "step",
        "phenomenological",
        "interpretation",
        "whereby",
        "heidegger",
        "think",
        "transcend",
        "modern",
        "aesthetic",
        "within",
        "moreover",
        "finally",
        "able",
        "resolve",
        "longstanding",
        "controversy",
        "surrounding",
        "heidegger",
        "interpretation",
        "van",
        "gogh",
        "see",
        "section"
    ]
}