{
    "main_text": "Philosophy of Religion\n11. Philosophy of Religion\n\nA final area in which Herder has noteworthy achievements is the\nphilosophy of religion. It seems appropriate to begin discussion of\nthis with a couple of qualifications, though. In Herder’s day\nGerman philosophy was still deeply committed to a sort of game of\ntrying to reconcile the insights of the Enlightenment, especially\nthose of modern natural science, with religion, and indeed more\nspecifically with Christianity. Leibniz, Kant, Hegel, Schleiermacher,\nand many others played this game—each proposing some new\nreconciliation or other. Herder was part of this game as well. This\nwas not a good game for philosophers to be playing. But it was not\nuntil the nineteenth century that German philosophy found the courage\nto cut the Gordian knot and turn from apologetics for religion and\nChristianity to thoroughgoing criticism of them (the prime examples\nbeing Marx and Nietzsche). This situation imposes certain limits on\nthe value of Herder’s philosophy of religion (as on that of the\nother reconciling philosophers just mentioned).\n\nAlso, it should be noted that while Herder’s philosophy of\nreligion was generally very enlightened and progressive in both his\nearly and his late periods, there was a spell in the middle, the years\n1771–6 in Bückeburg, during which he fell into the sort of\nreligious irrationalism (a position that essentially rejects reason\nand instead bases religious views on belief alone) that is more\ncharacteristic of his friend Hamann. This happened as the result of\nwhat would today be classified as a mild nervous breakdown\n(documentable from his correspondence at the time), and should\nbasically be discounted.\n\nNotwithstanding these qualifications, Herder did make important\ncontributions to the philosophy of religion—that is, important\nin terms of their intrinsic value, their influence, or both.\n\nOne of these contributions (arguably important mainly for its\ninfluence) lies in his neo-Spinozism. Herder’s sympathetic\nengagement with Spinoza’s work goes back at least as far as\n1769. But its main expression occurs in God: Some\nConversations from 1787 (a second, substantially revised edition\nappeared in 1800). Herder published this work in the wake of\nJacobi’s Letters on the Doctrine of Spinoza (1785), in\nwhich Jacobi had revealed that the highly respected philosopher,\ncritic, and dramatist Lessing—who was much admired by Herder in\nparticular—had confessed to him shortly before his death that he\nhad abandoned orthodox religious conceptions in favor of Spinozism.\nJacobi had himself argued, sharply to the contrary, that Spinozism,\nand indeed all fundamental reliance on reason, implies atheism and\nfatalism, and should therefore be rejected in favor of a leap of faith\nto a conventional Christian theism. Jacobi’s work, along with a\nreply by Moses Mendelssohn that disputed the attribution of Spinozism\nto Lessing though not the perniciousness of such a position, caused a\npublic furor. In God: Some Conversations Herder intervened.\nIn this work he supports Lessing as Jacobi had characterized him by\ndeveloping a version of “Spinozism” that modifies the\noriginal in some significant respects, largely with a view to defusing\nJacobi’s objections.\n\nHerder shares with Spinoza the basic thesis of monism, and\nlike Spinoza equates the single, all-encompassing principle in\nquestion with God (which of course already challenges Jacobi’s\ncharge of atheism). But whereas Spinoza had characterized this single,\nall-encompassing principle as substance, Herder instead\ncharacterizes it as force, or primal force. This\nfundamental modification involves several further ones that Herder\nalso finds attractive, including the following: (1) Whereas Spinoza\nhad tended to conceive the principle in question as an inactive\nthing, Herder’s revision rather turns it into an\nactivity. (2) Spinoza’s theory had attributed\nthought to the principle in question, but had rejected\nconceptions that it had intentions or was a mind. By\ncontrast, Herder claims that it does have intentions. And\nsince his general philosophy of mind identifies the mind with force,\nhis identification of the principle in question with force also\ncarries an implication that it is a mind (he does not yet\nquite say this in God: Some Conversations, but a few years\nlater in On the Spirit of Christianity of 1798 he explicitly\ndescribes God as a Geist, a mind). In these ways, Herder in\neffect re-mentalizes Spinoza’s God (thereby further undermining\nJacobi’s charge of atheism). (3) Whereas Spinoza had conceived\nnature mechanistically, in keeping with his Cartesian intellectual\nheritage (and had thereby invited Jacobi’s charge of fatalism),\nHerder (though officially still agnostic about what force is) rather\ntends to conceive the forces at work in nature as living, or\norganic (a conception of them that he mainly owes to Leibniz). (4)\nHerder believes that Spinoza’s original theory contained an\nobjectionable residue of dualism (again inherited from Descartes) in\nits conception of the relation between God’s two known\nattributes, thought and extension (and similarly, in its conception of\nthe relation between finite minds and bodies). By contrast,\nHerder’s own conception of God as a force (and of finite minds\nas likewise forces) is designed to overcome this alleged residual\ndualism. For forces are of their very nature expressed in the behavior\nof extended bodies. (5) Herder also sketches a more detailed account\nof nature as a system of living forces based in the primal force,\nGod—an account that in particular ascribes an important role in\nthis system to the sort of opposition between forces that is\nexemplified by the magnet with its two opposite poles, and that\ncharacterizes the system as a self-development toward higher and\nhigher forms of articulation.\n\nDuring the last quarter or so of the eighteenth century and then well\ninto the nineteenth century a wave of neo-Spinozism swept through\nGerman philosophy and literature: in addition to Lessing and Herder,\nfurther neo-Spinozists included Goethe, Schelling, Hegel,\nSchleiermacher, Hölderlin, Novalis, and Friedrich Schlegel. This\nwave was largely a result of Herder’s embrace of neo-Spinozism\nin God: Some Conversations (and in Goethe’s case\nHerder’s sympathy with Spinozism even before that work).\nAccordingly, it for the most part took over Herder’s\nmodifications of Spinoza’s position.\n\nHowever, it is arguable that Herder’s most\nintrinsically valuable contribution to the philosophy of\nreligion concerns the interpretation of the Bible. In this connection,\nas has already been mentioned, he champions a strict\nsecularism. This was already his position in the 1760s. At\nthat period he argued firmly, in the spirit of Galileo, for\ndisallowing revelation any jurisdiction over natural\nscience—though he did so not in an anti-religious spirit but in\nthe hope and expectation that an autonomous natural science would\nconfirm religion. And he made a parallel case for the autonomy of\ninterpretation: Religious assumptions and means have no\nbusiness interfering in the interpretation of texts either, even when\nthe texts are sacred ones. Instead, even the Bible must be interpreted\nas the work of human beings, and by means of the same sorts of\nrigorous hermeneutic methods that are employed for interpreting other\nancient texts—any religious enlightenment coming as a\nresult of such interpretation, not entering into the process\nitself. This whole position remained Herder’s considered\nposition in his later period as well.\n\nThe principle that the Bible should be interpreted in the same way as\nother texts was not the commonplace in Herder’s day that it has\nbecome since, but nor was it entirely new with him. In adopting it he\nwas self-consciously following the lead of several recent Bible\nscholars—in particular, Ernesti, Michaelis, and Semler. However,\nhis secularism is more consistent and radical than theirs, in\nparticular because it foreswears not only any reliance on a divine\ninspiration of the interpreter but also any assumption that the Bible,\nas the word of God, must be true and consistent throughout. (For\nfurther details, see Section 6 of the\n Supplementary Discussion.)\n\nAnother important interpretive principle of Herder’s, closely\nrelated to his strict secularism, is an insistence that interpreters\nof the Bible must resist the temptation to read the Bible as\nallegory (except in those relatively few cases—such as\nthe parables of the New Testament—where there is clear textual\nevidence that a biblical author intended to convey an allegorical\nmeaning). The locus classicus for this issue is the Songs of\nLove (1778), where Herder argues against then-common allegorical\ninterpretations of the Old Testament’s Song of Solomon\nin favor of an interpretation of it as simple erotic love poetry (an\ninterpretation that is now generally accepted as correct). In On\nGod’s Son, the World’s Savior (1797) Herder gives a\nperceptive general diagnosis of how the temptation to allegorical\ninterpretation arises: over the course of history people’s\nbeliefs and values change, leading to discrepancies between the claims\nmade by their traditional texts and their own beliefs and values; but\nthey expect and want to find their traditional texts to be correct;\nand so they try to effect a reconciliation of them with their own\nbeliefs and values by means of allegorical readings.\n\nHerder’s theoretical commitment to strict secularism and to\nnon-allegorical readings in biblical interpretation led him to\ninterpretive discoveries concerning the Bible that were themselves of\ngreat importance. For example, concerning the Old Testament, his\ncommitment to applying normal interpretive methods enabled him to\ndistinguish and define the different genres of poetry in the Old\nTestament in a way that was superior to anything that had been\nachieved before. The same commitment, and his consequent readiness to\nfind falsehood and even inconsistency in the Bible, also allowed him\nto make such important interpretive observations as that the ancient\nHebrews’ conceptions about death, the afterlife, the mind, and\nthe body had changed dramatically over time. (For both of these\nachievements, see especially On the Spirit of Hebrew Poetry.)\nAgain, as was just mentioned, his rejection of unwarranted allegorical\ninterpretations allowed him to substitute for the traditional\ninterpretation of the Song of Solomon as religious allegory\nan interpretation of it as simple erotic love poetry that is now\ngenerally accepted.\n\nSimilarly concerning the New Testament, Herder’s commitment to\napplying normal interpretive methods, including his readiness to\ndiscover falsehood and inconsistency, enabled him to treat the authors\nof the four gospels as individual human authors rather than mere\nmouthpieces of the deity, to perceive inconsistencies between their\naccounts, to establish the relative dates of the gospels correctly for\nthe first time (Mark first, Matthew and Luke in the middle, John last\nand late), and to give a broadly correct account of their genesis in\noral sermon and of their likely relations to each other (achievements\nthat he attained above all in two late works from 1796–7, On\nthe Savior of Mankind and On God’s Son, the\nWorld’s Savior).\n\nHerder’s strict secularism and resistance to allegory in\ninterpretation would shortly afterwards be taken over by\nSchleiermacher, who similarly embraced the principle that the\ninterpretation of sacred texts must treat them as the works of human\nauthors and apply exactly the same interpretive methods to them as are\napplied to profane texts, and who similarly followed through on this\ncommitment, in particular finding not only falsehoods but also\ninconsistencies in the Bible.\n\nHerder’s great achievements in this whole area also have\nsomething of the character of the early acts of an inexorable personal\ntragedy, however. As was mentioned, Herder by no means intended his\nchampioning of the cause of intellectual conscience in insisting on\nthe autonomy of natural science and interpretation to undermine\nreligion in general or Christianity in particular; on the contrary,\nhis hope and expectation was that both sorts of autonomy would in the\nend support religion and Christianity. However, this hope has been\nsorely disappointed. Autonomous natural science has increasingly made\nreligion generally and Christianity in particular look untenable. And\nHerder’s policy of reading the Bible with the aid of normal\ninterpretive means as a collection of human texts, with all of the\nfoibles of human texts, has increasingly led to an undermining of the\nBible’s claims to intellectual authority (a landmark here was\nthe publication of David Friedrich Strauss’s The Life of\nJesus [1835–6]). Much of what Herder has ultimately\nachieved in this area would therefore have been deeply unwelcome to\nhim.\n",
    "section_title": "11. Philosophy of Religion",
    "entry_title": "Johann Gottfried von Herder",
    "hierarchy_title": "Johann Gottfried von Herder || Philosophy of Religion",
    "tokenized_text": [
        "philosophy",
        "religion",
        "philosophy",
        "religion",
        "final",
        "area",
        "herder",
        "noteworthy",
        "achievement",
        "philosophy",
        "religion",
        "seems",
        "appropriate",
        "begin",
        "discussion",
        "couple",
        "qualification",
        "though",
        "herder",
        "day",
        "german",
        "philosophy",
        "still",
        "deeply",
        "committed",
        "sort",
        "game",
        "trying",
        "reconcile",
        "insight",
        "enlightenment",
        "especially",
        "modern",
        "natural",
        "science",
        "religion",
        "indeed",
        "specifically",
        "christianity",
        "leibniz",
        "kant",
        "hegel",
        "schleiermacher",
        "many",
        "others",
        "played",
        "gameeach",
        "proposing",
        "new",
        "reconciliation",
        "herder",
        "part",
        "game",
        "well",
        "good",
        "game",
        "philosopher",
        "playing",
        "nineteenth",
        "century",
        "german",
        "philosophy",
        "found",
        "courage",
        "cut",
        "gordian",
        "knot",
        "turn",
        "apologetics",
        "religion",
        "christianity",
        "thoroughgoing",
        "criticism",
        "prime",
        "example",
        "marx",
        "nietzsche",
        "situation",
        "imposes",
        "certain",
        "limit",
        "value",
        "herder",
        "philosophy",
        "religion",
        "reconciling",
        "philosopher",
        "mentioned",
        "also",
        "noted",
        "herder",
        "philosophy",
        "religion",
        "generally",
        "enlightened",
        "progressive",
        "early",
        "late",
        "period",
        "spell",
        "middle",
        "year",
        "bückeburg",
        "fell",
        "sort",
        "religious",
        "irrationalism",
        "position",
        "essentially",
        "reject",
        "reason",
        "instead",
        "base",
        "religious",
        "view",
        "belief",
        "alone",
        "characteristic",
        "friend",
        "hamann",
        "happened",
        "result",
        "would",
        "today",
        "classified",
        "mild",
        "nervous",
        "breakdown",
        "documentable",
        "correspondence",
        "time",
        "basically",
        "discounted",
        "notwithstanding",
        "qualification",
        "herder",
        "make",
        "important",
        "contribution",
        "philosophy",
        "religionthat",
        "important",
        "term",
        "intrinsic",
        "value",
        "influence",
        "one",
        "contribution",
        "arguably",
        "important",
        "mainly",
        "influence",
        "lie",
        "neospinozism",
        "herder",
        "sympathetic",
        "engagement",
        "spinoza",
        "work",
        "go",
        "back",
        "least",
        "far",
        "main",
        "expression",
        "occurs",
        "god",
        "conversation",
        "second",
        "substantially",
        "revised",
        "edition",
        "appeared",
        "herder",
        "published",
        "work",
        "wake",
        "jacobi",
        "letter",
        "doctrine",
        "spinoza",
        "jacobi",
        "revealed",
        "highly",
        "respected",
        "philosopher",
        "critic",
        "dramatist",
        "lessingwho",
        "much",
        "admired",
        "herder",
        "particularhad",
        "confessed",
        "shortly",
        "death",
        "abandoned",
        "orthodox",
        "religious",
        "conception",
        "favor",
        "spinozism",
        "jacobi",
        "argued",
        "sharply",
        "contrary",
        "spinozism",
        "indeed",
        "fundamental",
        "reliance",
        "reason",
        "implies",
        "atheism",
        "fatalism",
        "therefore",
        "rejected",
        "favor",
        "leap",
        "faith",
        "conventional",
        "christian",
        "theism",
        "jacobi",
        "work",
        "along",
        "reply",
        "moses",
        "mendelssohn",
        "disputed",
        "attribution",
        "spinozism",
        "lessing",
        "though",
        "perniciousness",
        "position",
        "caused",
        "public",
        "furor",
        "god",
        "conversation",
        "herder",
        "intervened",
        "work",
        "support",
        "lessing",
        "jacobi",
        "characterized",
        "developing",
        "version",
        "spinozism",
        "modifies",
        "original",
        "significant",
        "respect",
        "largely",
        "view",
        "defusing",
        "jacobi",
        "objection",
        "herder",
        "share",
        "spinoza",
        "basic",
        "thesis",
        "monism",
        "like",
        "spinoza",
        "equates",
        "single",
        "allencompassing",
        "principle",
        "question",
        "god",
        "course",
        "already",
        "challenge",
        "jacobi",
        "charge",
        "atheism",
        "whereas",
        "spinoza",
        "characterized",
        "single",
        "allencompassing",
        "principle",
        "substance",
        "herder",
        "instead",
        "characterizes",
        "force",
        "primal",
        "force",
        "fundamental",
        "modification",
        "involves",
        "several",
        "one",
        "herder",
        "also",
        "find",
        "attractive",
        "including",
        "following",
        "whereas",
        "spinoza",
        "tended",
        "conceive",
        "principle",
        "question",
        "inactive",
        "thing",
        "herder",
        "revision",
        "rather",
        "turn",
        "activity",
        "spinoza",
        "theory",
        "attributed",
        "thought",
        "principle",
        "question",
        "rejected",
        "conception",
        "intention",
        "mind",
        "contrast",
        "herder",
        "claim",
        "intention",
        "since",
        "general",
        "philosophy",
        "mind",
        "identifies",
        "mind",
        "force",
        "identification",
        "principle",
        "question",
        "force",
        "also",
        "carry",
        "implication",
        "mind",
        "yet",
        "quite",
        "say",
        "god",
        "conversation",
        "year",
        "later",
        "spirit",
        "christianity",
        "explicitly",
        "describes",
        "god",
        "geist",
        "mind",
        "way",
        "herder",
        "effect",
        "rementalizes",
        "spinoza",
        "god",
        "thereby",
        "undermining",
        "jacobi",
        "charge",
        "atheism",
        "whereas",
        "spinoza",
        "conceived",
        "nature",
        "mechanistically",
        "keeping",
        "cartesian",
        "intellectual",
        "heritage",
        "thereby",
        "invited",
        "jacobi",
        "charge",
        "fatalism",
        "herder",
        "though",
        "officially",
        "still",
        "agnostic",
        "force",
        "rather",
        "tends",
        "conceive",
        "force",
        "work",
        "nature",
        "living",
        "organic",
        "conception",
        "mainly",
        "owes",
        "leibniz",
        "herder",
        "belief",
        "spinoza",
        "original",
        "theory",
        "contained",
        "objectionable",
        "residue",
        "dualism",
        "inherited",
        "descartes",
        "conception",
        "relation",
        "god",
        "two",
        "known",
        "attribute",
        "thought",
        "extension",
        "similarly",
        "conception",
        "relation",
        "finite",
        "mind",
        "body",
        "contrast",
        "herder",
        "conception",
        "god",
        "force",
        "finite",
        "mind",
        "likewise",
        "force",
        "designed",
        "overcome",
        "alleged",
        "residual",
        "dualism",
        "force",
        "nature",
        "expressed",
        "behavior",
        "extended",
        "body",
        "herder",
        "also",
        "sketch",
        "detailed",
        "account",
        "nature",
        "system",
        "living",
        "force",
        "based",
        "primal",
        "force",
        "godan",
        "account",
        "particular",
        "ascribes",
        "important",
        "role",
        "system",
        "sort",
        "opposition",
        "force",
        "exemplified",
        "magnet",
        "two",
        "opposite",
        "pole",
        "characterizes",
        "system",
        "selfdevelopment",
        "toward",
        "higher",
        "higher",
        "form",
        "articulation",
        "last",
        "quarter",
        "eighteenth",
        "century",
        "well",
        "nineteenth",
        "century",
        "wave",
        "neospinozism",
        "swept",
        "german",
        "philosophy",
        "literature",
        "addition",
        "lessing",
        "herder",
        "neospinozists",
        "included",
        "goethe",
        "schelling",
        "hegel",
        "schleiermacher",
        "hölderlin",
        "novalis",
        "friedrich",
        "schlegel",
        "wave",
        "largely",
        "result",
        "herder",
        "embrace",
        "neospinozism",
        "god",
        "conversation",
        "goethe",
        "case",
        "herder",
        "sympathy",
        "spinozism",
        "even",
        "work",
        "accordingly",
        "part",
        "took",
        "herder",
        "modification",
        "spinoza",
        "position",
        "however",
        "arguable",
        "herder",
        "intrinsically",
        "valuable",
        "contribution",
        "philosophy",
        "religion",
        "concern",
        "interpretation",
        "bible",
        "connection",
        "already",
        "mentioned",
        "champion",
        "strict",
        "secularism",
        "already",
        "position",
        "s",
        "period",
        "argued",
        "firmly",
        "spirit",
        "galileo",
        "disallowing",
        "revelation",
        "jurisdiction",
        "natural",
        "sciencethough",
        "antireligious",
        "spirit",
        "hope",
        "expectation",
        "autonomous",
        "natural",
        "science",
        "would",
        "confirm",
        "religion",
        "made",
        "parallel",
        "case",
        "autonomy",
        "interpretation",
        "religious",
        "assumption",
        "mean",
        "business",
        "interfering",
        "interpretation",
        "text",
        "either",
        "even",
        "text",
        "sacred",
        "one",
        "instead",
        "even",
        "bible",
        "must",
        "interpreted",
        "work",
        "human",
        "being",
        "mean",
        "sort",
        "rigorous",
        "hermeneutic",
        "method",
        "employed",
        "interpreting",
        "ancient",
        "textsany",
        "religious",
        "enlightenment",
        "coming",
        "result",
        "interpretation",
        "entering",
        "process",
        "whole",
        "position",
        "remained",
        "herder",
        "considered",
        "position",
        "later",
        "period",
        "well",
        "principle",
        "bible",
        "interpreted",
        "way",
        "text",
        "commonplace",
        "herder",
        "day",
        "become",
        "since",
        "entirely",
        "new",
        "adopting",
        "selfconsciously",
        "following",
        "lead",
        "several",
        "recent",
        "bible",
        "scholarsin",
        "particular",
        "ernesti",
        "michaelis",
        "semler",
        "however",
        "secularism",
        "consistent",
        "radical",
        "particular",
        "foreswears",
        "reliance",
        "divine",
        "inspiration",
        "interpreter",
        "also",
        "assumption",
        "bible",
        "word",
        "god",
        "must",
        "true",
        "consistent",
        "throughout",
        "detail",
        "see",
        "section",
        "supplementary",
        "discussion",
        "another",
        "important",
        "interpretive",
        "principle",
        "herder",
        "closely",
        "related",
        "strict",
        "secularism",
        "insistence",
        "interpreter",
        "bible",
        "must",
        "resist",
        "temptation",
        "read",
        "bible",
        "allegory",
        "except",
        "relatively",
        "casessuch",
        "parable",
        "new",
        "testamentwhere",
        "clear",
        "textual",
        "evidence",
        "biblical",
        "author",
        "intended",
        "convey",
        "allegorical",
        "meaning",
        "locus",
        "classicus",
        "issue",
        "song",
        "love",
        "herder",
        "argues",
        "thencommon",
        "allegorical",
        "interpretation",
        "old",
        "testament",
        "song",
        "solomon",
        "favor",
        "interpretation",
        "simple",
        "erotic",
        "love",
        "poetry",
        "interpretation",
        "generally",
        "accepted",
        "correct",
        "god",
        "son",
        "world",
        "savior",
        "herder",
        "give",
        "perceptive",
        "general",
        "diagnosis",
        "temptation",
        "allegorical",
        "interpretation",
        "arises",
        "course",
        "history",
        "people",
        "belief",
        "value",
        "change",
        "leading",
        "discrepancy",
        "claim",
        "made",
        "traditional",
        "text",
        "belief",
        "value",
        "expect",
        "want",
        "find",
        "traditional",
        "text",
        "correct",
        "try",
        "effect",
        "reconciliation",
        "belief",
        "value",
        "mean",
        "allegorical",
        "reading",
        "herder",
        "theoretical",
        "commitment",
        "strict",
        "secularism",
        "nonallegorical",
        "reading",
        "biblical",
        "interpretation",
        "led",
        "interpretive",
        "discovery",
        "concerning",
        "bible",
        "great",
        "importance",
        "example",
        "concerning",
        "old",
        "testament",
        "commitment",
        "applying",
        "normal",
        "interpretive",
        "method",
        "enabled",
        "distinguish",
        "define",
        "different",
        "genre",
        "poetry",
        "old",
        "testament",
        "way",
        "superior",
        "anything",
        "achieved",
        "commitment",
        "consequent",
        "readiness",
        "find",
        "falsehood",
        "even",
        "inconsistency",
        "bible",
        "also",
        "allowed",
        "make",
        "important",
        "interpretive",
        "observation",
        "ancient",
        "hebrew",
        "conception",
        "death",
        "afterlife",
        "mind",
        "body",
        "changed",
        "dramatically",
        "time",
        "achievement",
        "see",
        "especially",
        "spirit",
        "hebrew",
        "poetry",
        "mentioned",
        "rejection",
        "unwarranted",
        "allegorical",
        "interpretation",
        "allowed",
        "substitute",
        "traditional",
        "interpretation",
        "song",
        "solomon",
        "religious",
        "allegory",
        "interpretation",
        "simple",
        "erotic",
        "love",
        "poetry",
        "generally",
        "accepted",
        "similarly",
        "concerning",
        "new",
        "testament",
        "herder",
        "commitment",
        "applying",
        "normal",
        "interpretive",
        "method",
        "including",
        "readiness",
        "discover",
        "falsehood",
        "inconsistency",
        "enabled",
        "treat",
        "author",
        "four",
        "gospel",
        "individual",
        "human",
        "author",
        "rather",
        "mere",
        "mouthpiece",
        "deity",
        "perceive",
        "inconsistency",
        "account",
        "establish",
        "relative",
        "date",
        "gospel",
        "correctly",
        "first",
        "time",
        "mark",
        "first",
        "matthew",
        "luke",
        "middle",
        "john",
        "last",
        "late",
        "give",
        "broadly",
        "correct",
        "account",
        "genesis",
        "oral",
        "sermon",
        "likely",
        "relation",
        "achievement",
        "attained",
        "two",
        "late",
        "work",
        "savior",
        "mankind",
        "god",
        "son",
        "world",
        "savior",
        "herder",
        "strict",
        "secularism",
        "resistance",
        "allegory",
        "interpretation",
        "would",
        "shortly",
        "afterwards",
        "taken",
        "schleiermacher",
        "similarly",
        "embraced",
        "principle",
        "interpretation",
        "sacred",
        "text",
        "must",
        "treat",
        "work",
        "human",
        "author",
        "apply",
        "exactly",
        "interpretive",
        "method",
        "applied",
        "profane",
        "text",
        "similarly",
        "followed",
        "commitment",
        "particular",
        "finding",
        "falsehood",
        "also",
        "inconsistency",
        "bible",
        "herder",
        "great",
        "achievement",
        "whole",
        "area",
        "also",
        "something",
        "character",
        "early",
        "act",
        "inexorable",
        "personal",
        "tragedy",
        "however",
        "mentioned",
        "herder",
        "mean",
        "intended",
        "championing",
        "cause",
        "intellectual",
        "conscience",
        "insisting",
        "autonomy",
        "natural",
        "science",
        "interpretation",
        "undermine",
        "religion",
        "general",
        "christianity",
        "particular",
        "contrary",
        "hope",
        "expectation",
        "sort",
        "autonomy",
        "would",
        "end",
        "support",
        "religion",
        "christianity",
        "however",
        "hope",
        "sorely",
        "disappointed",
        "autonomous",
        "natural",
        "science",
        "increasingly",
        "made",
        "religion",
        "generally",
        "christianity",
        "particular",
        "look",
        "untenable",
        "herder",
        "policy",
        "reading",
        "bible",
        "aid",
        "normal",
        "interpretive",
        "mean",
        "collection",
        "human",
        "text",
        "foible",
        "human",
        "text",
        "increasingly",
        "led",
        "undermining",
        "bible",
        "claim",
        "intellectual",
        "authority",
        "landmark",
        "publication",
        "david",
        "friedrich",
        "strauss",
        "life",
        "jesus",
        "much",
        "herder",
        "ultimately",
        "achieved",
        "area",
        "would",
        "therefore",
        "deeply",
        "unwelcome"
    ]
}