{
    "main_text": "Philosophy of Mind\n6. Philosophy of Mind\n\nIn On the Cognition and Sensation from 1778 and elsewhere\nHerder develops an important and influential position in the\nphilosophy of mind. The following are some of its central\nfeatures.\n\nConcerning the fundamental mind-body problem, Herder tried out various\nsolutions over the course of his career, but the considered solution\nat which he eventually arrived was uncompromisingly\nnaturalistic and anti-dualistic.\n\nIn On the Cognition and Sensation he undertakes to erase the\ntraditional sharp division between the mental and the physical in two\nspecific ways: First, he advances a theory that minds and mental\nconditions consist in forces [Kräfte] that\nmanifest themselves in people’s bodily behavior—just as\nphysical nature involves forces that manifest themselves in the\nbehavior of bodies. Officially, he remains agnostic on the question of\nwhat force is, except for conceiving it as something apt to produce a\ntype of bodily behavior, and as a real source thereof (not merely\nsomething reducible thereto). This, strictly speaking, absolves his\ntheory of certain common accusations (for example, H.B. Nisbet and\nFrederick Beiser’s characterization of it as\n“vitalist”). But it also leaves it with enough content to\nhave great virtues over rival theories: (1) The theory ties types of\nmental states conceptually to corresponding types of bodily\nbehavior—which seems correct (e.g., the desire to eat an apple\nseems not just contingently but conceptually tied to behavior that\ntends toward apple-eating), and which therefore marks a point of\nsuperiority over both dualistic theories and mind-brain identity\ntheories. (2) On the other hand, the theory avoids reducing\nmental states to bodily behavior—which again seems correct,\ngiven such obvious facts as that we can be, and indeed often are, in\ntoken mental states that happen to receive no behavioral manifestation\nat all, and which hence constitutes a point of superiority over\nbehaviorist theories. (3) Moreover, Herder’s official\nagnosticism about what (mental) force is can be seen, not as the\ntheoretical weakness it might seem to be, but as showing his\nrecognition of the important conceptual fact (recently exploited by\nfunctionalists in their “multiple realizability argument”)\nthat although the concepts of mind and mental conditions imply a real\nsource of a type of behavior, they do not imply anything about the\nnature of that source’s constitution.\n\nSecond, Herder also tries to explain the mind in terms of the\nphenomenon of irritation [Reiz], a phenomenon that\nhad recently been identified by the physiologist Albrecht von Haller,\nand which is paradigmatically exemplified by muscle fibers contracting\nin response to direct physical stimuli and relaxing upon their\nremoval—in other words, a phenomenon which, while basically\nphysiological, also seems to exhibit a transition to mental\ncharacteristics. There is an ambiguity in Herder’s position\nhere: Usually, he wants to resist physicalist reductionism, and so\nwould be reluctant to say that irritation is purely physiological and\nfully constitutes mental states. However, in the 1775 draft of On\nthe Cognition and Sensation, and even in parts of the published\nversion, that is his position. And from a modern standpoint,\nthis is arguably a further virtue of his account (albeit that we would\nof course today want to recast it in terms of different, and much more\ncomplex, physiological processes than irritation).\n\nThis second line of thought might seem at odds with the first one\n(forces). But it need not be. For, given Herder’s official\nagnosticism about what forces are, this second line of thought could,\nso to speak, fill in the “black box” of the hypothesized\nreal forces, namely in physicalist terms. In other words, it turns out\n(not indeed as a conceptual matter, but as a contingent one) that the\nreal forces in question consist in physiological processes.\n\nHerder’s philosophy of mind also advances another important\nthesis: that the mind is a unity, that there is no sharp\ndivision between its faculties. This thesis contradicted theorists\nsuch as Sulzer and Kant. However, it was not in itself new with\nHerder, having already been espoused in a strong form by the\nRationalists, especially Wolff (Herder’s introduction to his\n1775 draft shows that he is fully aware of this debt). Where Herder is\nmore original is in rejecting the Rationalists’ reduction of\nsensation and volition to cognition; establishing the unity thesis in\nan empirical rather than an apriorist way; and adding a normative\ndimension to it—this is not only how the mind is but\nalso how it ought to be. This last feature might sound\nincoherent at first hearing, for if the mind is this way by its very\nnature, what sense can there be in prescribing to people that it\nshould be so rather than otherwise? However, Herder’s idea here\nis rather the perfectly coherent one that, while the mind is indeed\nthis way by its very nature, people nonetheless sometimes behave as\nthough one faculty could be abstracted from another, and try to effect\nsuch an abstraction, but this then leads to various malfunctions, and\nshould therefore be avoided.\n\nHerder’s overall thesis of the mind’s unity rests on four\nmore specific doctrines concerning intimate mutual involvements\nbetween mental faculties, and malfunctions that arise from resisting\nthem, doctrines that are in large part empirically grounded and hence\nlend the overall thesis a sort of empirical basis as well:\n\nA first doctrine concerns the relation between thought and language:\nNot only does language of its very nature express thought (an\nuncontroversial point), but also (as we noted earlier) for Herder\nthought is essentially dependent on and bounded by language. Herder\nlargely bases this further claim on empirical grounds (for example,\nconcerning how children’s thought develops in step with language\nacquisition). The normative aspect of his position here is that\nattempts (in the manner of some forms of metaphysics, for example) to\ncut thought free from the constraints of language lead to\nnonsense.\n\nA second area of intimate mutual involvement concerns cognition and\nvolition, or affects. The claim that volition is and should be based\non cognition is not particularly controversial. But Herder also argues\nthe converse, that all cognition is and should be based on volition,\non affects—and indeed, not only on such relatively anemic\naffects as the impulse to know the truth, but also on much less anemic\nones. In this connection, he is especially concerned to combat the\nidea that theoretical work in philosophy or the sciences is or should\nbe detached from volition, from affects. In his view, it never really\nis even when it purports to be, and attempts to make it so merely\nimpoverish and weaken it. His grounds for this whole position are\nagain mainly empirical in nature.\n\nA third area of intimate mutual involvement concerns thought and\nsensation. Conceptualization and belief, on the one hand, and\nsensation, on the other, are intimately connected according to Herder.\nThus, he advances the quasi-empiricist theory of concepts that was\nmentioned earlier, which entails that all of our concepts (and hence\nalso all of our beliefs) ultimately depend in one way or another on\nsensation. But conversely, he also argues (anticipating much important\ntwentieth-century work in philosophy) that there is a dependence in\nthe other direction: that the character of an adult human\nbeing’s sensations depends on his concepts and beliefs.\nNormatively, he sees attempts to violate this interdependence as\ninevitably leading to intellectual malfunction—for example, as\nhas already been mentioned, he thinks that metaphysicians’\nattempts to cut entirely free from the empirical basis of our concepts\nlead to meaninglessness. His grounds for this whole position are again\nlargely empirical in character.\n\nA fourth area of intimate mutual involvement concerns unity among the\nfaculties of sensation themselves. For one thing, Herder implies that\nour underlying animal nature involves a sort of primordial fusion of\nperceptual with affective sensations (albeit that, unlike other\nanimals, we also have a distinctive ability to suspend this fusion, an\nability that he calls Besonnenheit). For another thing, he\nargues that the several faculties of perceptual sensation themselves\nform a sort of unity. His grounds for these two positions are again\nmainly empirical in character. In particular, he says that the unity\nof the several faculties of perceptual sensation is shown by clues\nthat emerge in unusual situations and in pathological cases. For\nexample, he argues that the dependence of the mature sense of sight on\nthe sense of touch is shown both by the way in which the sense of\nsight develops in young children and by the way in which it develops\nafter medical operations on previously blind people such as\nCheselden’s blind man.\n\nIn a further seminal move in the philosophy of mind Herder argues that\nlinguistic meaning is fundamentally social—so that thought and\nother aspects of human mental life (since they are essentially\narticulated in terms of linguistic meanings), and therefore even the\nvery self (since the self is essentially dependent on thought and\nother aspects of human mental life, and moreover defined in its\nspecific identity by theirs), are so too. Herder’s version of\nthis position seems intended only as an empirically based causal\nclaim. It has since fathered a long tradition of attempts to generate\nmore ambitious cases for stronger versions of the claim that\nmeaning—and hence also thought, human mental life more\ngenerally, and the very self—is at bottom socially constituted\n(for example, in Hegel, Wittgenstein, Kripke, Burge, and Brandom).\nHowever, it may well be that these more ambitious cases and stronger\nversions do not work, and that Herder’s original version is\nexactly what should be accepted.\n\nAs we have seen, Herder also, in tension but not contradiction with\nthis principle of sociality, holds that (even within a single period\nand culture) human minds are as a rule deeply individual,\ndeeply different from each other—so that in addition to a\ngeneralizing psychology there is also a need for a psychology oriented\nto individuality. This is an important idea that has strongly\ninfluenced many subsequent continental thinkers (for example,\nSchleiermacher, Nietzsche, Proust, Sartre, and Manfred Frank). Herder\nhimself advances it only as an empirically based rule of thumb. By\ncontrast, a prominent strand in Schleiermacher and Frank purports to\nestablish it as an a priori universal truth. However, here again\nHerder’s original version is arguably the more plausible\none.\n\nFinally, like predecessors in the Rationalist tradition and Kant,\nHerder sharply rejects the Cartesian idea of the mind’s\nself-transparency—instead insisting that much of what occurs in\nthe mind is unconscious, so that self-knowledge is often deeply\nproblematic. In addition, he identifies literature (e.g., Shakespeare)\nas an especially rich source of insights into the unconscious. This is\nanother compelling position that has had a strong influence on\nsubsequent thinkers (both in the philosophy of mind and in\nhermeneutics).\n\nThis whole Herderian philosophy of mind owes much to predecessors,\nespecially ones in the Rationalist tradition. But it is also in many\nways original. The theory is not only important in its own right, but\nalso exercised an enormous influence on Herder’s successors,\nincluding Schleiermacher, Hegel, and Nietzsche.\n",
    "section_title": "6. Philosophy of Mind",
    "entry_title": "Johann Gottfried von Herder",
    "hierarchy_title": "Johann Gottfried von Herder || Philosophy of Mind",
    "tokenized_text": [
        "philosophy",
        "mind",
        "philosophy",
        "mind",
        "cognition",
        "sensation",
        "elsewhere",
        "herder",
        "develops",
        "important",
        "influential",
        "position",
        "philosophy",
        "mind",
        "following",
        "central",
        "feature",
        "concerning",
        "fundamental",
        "mindbody",
        "problem",
        "herder",
        "tried",
        "various",
        "solution",
        "course",
        "career",
        "considered",
        "solution",
        "eventually",
        "arrived",
        "uncompromisingly",
        "naturalistic",
        "antidualistic",
        "cognition",
        "sensation",
        "undertakes",
        "erase",
        "traditional",
        "sharp",
        "division",
        "mental",
        "physical",
        "two",
        "specific",
        "way",
        "first",
        "advance",
        "theory",
        "mind",
        "mental",
        "condition",
        "consist",
        "force",
        "kräfte",
        "manifest",
        "people",
        "bodily",
        "behaviorjust",
        "physical",
        "nature",
        "involves",
        "force",
        "manifest",
        "behavior",
        "body",
        "officially",
        "remains",
        "agnostic",
        "question",
        "force",
        "except",
        "conceiving",
        "something",
        "apt",
        "produce",
        "type",
        "bodily",
        "behavior",
        "real",
        "source",
        "thereof",
        "merely",
        "something",
        "reducible",
        "thereto",
        "strictly",
        "speaking",
        "absolves",
        "theory",
        "certain",
        "common",
        "accusation",
        "example",
        "hb",
        "nisbet",
        "frederick",
        "beiser",
        "characterization",
        "vitalist",
        "also",
        "leaf",
        "enough",
        "content",
        "great",
        "virtue",
        "rival",
        "theory",
        "theory",
        "tie",
        "type",
        "mental",
        "state",
        "conceptually",
        "corresponding",
        "type",
        "bodily",
        "behaviorwhich",
        "seems",
        "correct",
        "eg",
        "desire",
        "eat",
        "apple",
        "seems",
        "contingently",
        "conceptually",
        "tied",
        "behavior",
        "tends",
        "toward",
        "appleeating",
        "therefore",
        "mark",
        "point",
        "superiority",
        "dualistic",
        "theory",
        "mindbrain",
        "identity",
        "theory",
        "hand",
        "theory",
        "avoids",
        "reducing",
        "mental",
        "state",
        "bodily",
        "behaviorwhich",
        "seems",
        "correct",
        "given",
        "obvious",
        "fact",
        "indeed",
        "often",
        "token",
        "mental",
        "state",
        "happen",
        "receive",
        "behavioral",
        "manifestation",
        "hence",
        "constitutes",
        "point",
        "superiority",
        "behaviorist",
        "theory",
        "moreover",
        "herder",
        "official",
        "agnosticism",
        "mental",
        "force",
        "seen",
        "theoretical",
        "weakness",
        "might",
        "seem",
        "showing",
        "recognition",
        "important",
        "conceptual",
        "fact",
        "recently",
        "exploited",
        "functionalist",
        "multiple",
        "realizability",
        "argument",
        "although",
        "concept",
        "mind",
        "mental",
        "condition",
        "imply",
        "real",
        "source",
        "type",
        "behavior",
        "imply",
        "anything",
        "nature",
        "source",
        "constitution",
        "second",
        "herder",
        "also",
        "try",
        "explain",
        "mind",
        "term",
        "phenomenon",
        "irritation",
        "reiz",
        "phenomenon",
        "recently",
        "identified",
        "physiologist",
        "albrecht",
        "von",
        "haller",
        "paradigmatically",
        "exemplified",
        "muscle",
        "fiber",
        "contracting",
        "response",
        "direct",
        "physical",
        "stimulus",
        "relaxing",
        "upon",
        "removalin",
        "word",
        "phenomenon",
        "basically",
        "physiological",
        "also",
        "seems",
        "exhibit",
        "transition",
        "mental",
        "characteristic",
        "ambiguity",
        "herder",
        "position",
        "usually",
        "want",
        "resist",
        "physicalist",
        "reductionism",
        "would",
        "reluctant",
        "say",
        "irritation",
        "purely",
        "physiological",
        "fully",
        "constitutes",
        "mental",
        "state",
        "however",
        "draft",
        "cognition",
        "sensation",
        "even",
        "part",
        "published",
        "version",
        "position",
        "modern",
        "standpoint",
        "arguably",
        "virtue",
        "account",
        "albeit",
        "would",
        "course",
        "today",
        "want",
        "recast",
        "term",
        "different",
        "much",
        "complex",
        "physiological",
        "process",
        "irritation",
        "second",
        "line",
        "thought",
        "might",
        "seem",
        "odds",
        "first",
        "one",
        "force",
        "need",
        "given",
        "herder",
        "official",
        "agnosticism",
        "force",
        "second",
        "line",
        "thought",
        "could",
        "speak",
        "fill",
        "black",
        "box",
        "hypothesized",
        "real",
        "force",
        "namely",
        "physicalist",
        "term",
        "word",
        "turn",
        "indeed",
        "conceptual",
        "matter",
        "contingent",
        "one",
        "real",
        "force",
        "question",
        "consist",
        "physiological",
        "process",
        "herder",
        "philosophy",
        "mind",
        "also",
        "advance",
        "another",
        "important",
        "thesis",
        "mind",
        "unity",
        "sharp",
        "division",
        "faculty",
        "thesis",
        "contradicted",
        "theorist",
        "sulzer",
        "kant",
        "however",
        "new",
        "herder",
        "already",
        "espoused",
        "strong",
        "form",
        "rationalist",
        "especially",
        "wolff",
        "herder",
        "introduction",
        "draft",
        "show",
        "fully",
        "aware",
        "debt",
        "herder",
        "original",
        "rejecting",
        "rationalist",
        "reduction",
        "sensation",
        "volition",
        "cognition",
        "establishing",
        "unity",
        "thesis",
        "empirical",
        "rather",
        "apriorist",
        "way",
        "adding",
        "normative",
        "dimension",
        "itthis",
        "mind",
        "also",
        "ought",
        "last",
        "feature",
        "might",
        "sound",
        "incoherent",
        "first",
        "hearing",
        "mind",
        "way",
        "nature",
        "sense",
        "prescribing",
        "people",
        "rather",
        "otherwise",
        "however",
        "herder",
        "idea",
        "rather",
        "perfectly",
        "coherent",
        "one",
        "mind",
        "indeed",
        "way",
        "nature",
        "people",
        "nonetheless",
        "sometimes",
        "behave",
        "though",
        "one",
        "faculty",
        "could",
        "abstracted",
        "another",
        "try",
        "effect",
        "abstraction",
        "lead",
        "various",
        "malfunction",
        "therefore",
        "avoided",
        "herder",
        "overall",
        "thesis",
        "mind",
        "unity",
        "rest",
        "four",
        "specific",
        "doctrine",
        "concerning",
        "intimate",
        "mutual",
        "involvement",
        "mental",
        "faculty",
        "malfunction",
        "arise",
        "resisting",
        "doctrine",
        "large",
        "part",
        "empirically",
        "grounded",
        "hence",
        "lend",
        "overall",
        "thesis",
        "sort",
        "empirical",
        "basis",
        "well",
        "first",
        "doctrine",
        "concern",
        "relation",
        "thought",
        "language",
        "language",
        "nature",
        "express",
        "thought",
        "uncontroversial",
        "point",
        "also",
        "noted",
        "earlier",
        "herder",
        "thought",
        "essentially",
        "dependent",
        "bounded",
        "language",
        "herder",
        "largely",
        "base",
        "claim",
        "empirical",
        "ground",
        "example",
        "concerning",
        "child",
        "thought",
        "develops",
        "step",
        "language",
        "acquisition",
        "normative",
        "aspect",
        "position",
        "attempt",
        "manner",
        "form",
        "metaphysics",
        "example",
        "cut",
        "thought",
        "free",
        "constraint",
        "language",
        "lead",
        "nonsense",
        "second",
        "area",
        "intimate",
        "mutual",
        "involvement",
        "concern",
        "cognition",
        "volition",
        "affect",
        "claim",
        "volition",
        "based",
        "cognition",
        "particularly",
        "controversial",
        "herder",
        "also",
        "argues",
        "converse",
        "cognition",
        "based",
        "volition",
        "affectsand",
        "indeed",
        "relatively",
        "anemic",
        "affect",
        "impulse",
        "know",
        "truth",
        "also",
        "much",
        "le",
        "anemic",
        "one",
        "connection",
        "especially",
        "concerned",
        "combat",
        "idea",
        "theoretical",
        "work",
        "philosophy",
        "science",
        "detached",
        "volition",
        "affect",
        "view",
        "never",
        "really",
        "even",
        "purport",
        "attempt",
        "make",
        "merely",
        "impoverish",
        "weaken",
        "ground",
        "whole",
        "position",
        "mainly",
        "empirical",
        "nature",
        "third",
        "area",
        "intimate",
        "mutual",
        "involvement",
        "concern",
        "thought",
        "sensation",
        "conceptualization",
        "belief",
        "one",
        "hand",
        "sensation",
        "intimately",
        "connected",
        "according",
        "herder",
        "thus",
        "advance",
        "quasiempiricist",
        "theory",
        "concept",
        "mentioned",
        "earlier",
        "entail",
        "concept",
        "hence",
        "also",
        "belief",
        "ultimately",
        "depend",
        "one",
        "way",
        "another",
        "sensation",
        "conversely",
        "also",
        "argues",
        "anticipating",
        "much",
        "important",
        "twentiethcentury",
        "work",
        "philosophy",
        "dependence",
        "direction",
        "character",
        "adult",
        "human",
        "sensation",
        "depends",
        "concept",
        "belief",
        "normatively",
        "see",
        "attempt",
        "violate",
        "interdependence",
        "inevitably",
        "leading",
        "intellectual",
        "malfunctionfor",
        "example",
        "already",
        "mentioned",
        "think",
        "metaphysicians",
        "attempt",
        "cut",
        "entirely",
        "free",
        "empirical",
        "basis",
        "concept",
        "lead",
        "meaninglessness",
        "ground",
        "whole",
        "position",
        "largely",
        "empirical",
        "character",
        "fourth",
        "area",
        "intimate",
        "mutual",
        "involvement",
        "concern",
        "unity",
        "among",
        "faculty",
        "sensation",
        "one",
        "thing",
        "herder",
        "implies",
        "underlying",
        "animal",
        "nature",
        "involves",
        "sort",
        "primordial",
        "fusion",
        "perceptual",
        "affective",
        "sensation",
        "albeit",
        "unlike",
        "animal",
        "also",
        "distinctive",
        "ability",
        "suspend",
        "fusion",
        "ability",
        "call",
        "besonnenheit",
        "another",
        "thing",
        "argues",
        "several",
        "faculty",
        "perceptual",
        "sensation",
        "form",
        "sort",
        "unity",
        "ground",
        "two",
        "position",
        "mainly",
        "empirical",
        "character",
        "particular",
        "say",
        "unity",
        "several",
        "faculty",
        "perceptual",
        "sensation",
        "shown",
        "clue",
        "emerge",
        "unusual",
        "situation",
        "pathological",
        "case",
        "example",
        "argues",
        "dependence",
        "mature",
        "sense",
        "sight",
        "sense",
        "touch",
        "shown",
        "way",
        "sense",
        "sight",
        "develops",
        "young",
        "child",
        "way",
        "develops",
        "medical",
        "operation",
        "previously",
        "blind",
        "people",
        "cheselden",
        "blind",
        "man",
        "seminal",
        "move",
        "philosophy",
        "mind",
        "herder",
        "argues",
        "linguistic",
        "meaning",
        "fundamentally",
        "socialso",
        "thought",
        "aspect",
        "human",
        "mental",
        "life",
        "since",
        "essentially",
        "articulated",
        "term",
        "linguistic",
        "meaning",
        "therefore",
        "even",
        "self",
        "since",
        "self",
        "essentially",
        "dependent",
        "thought",
        "aspect",
        "human",
        "mental",
        "life",
        "moreover",
        "defined",
        "specific",
        "identity",
        "herder",
        "version",
        "position",
        "seems",
        "intended",
        "empirically",
        "based",
        "causal",
        "claim",
        "since",
        "fathered",
        "long",
        "tradition",
        "attempt",
        "generate",
        "ambitious",
        "case",
        "stronger",
        "version",
        "claim",
        "meaningand",
        "hence",
        "also",
        "thought",
        "human",
        "mental",
        "life",
        "generally",
        "selfis",
        "bottom",
        "socially",
        "constituted",
        "example",
        "hegel",
        "wittgenstein",
        "kripke",
        "burge",
        "brandom",
        "however",
        "may",
        "well",
        "ambitious",
        "case",
        "stronger",
        "version",
        "work",
        "herder",
        "original",
        "version",
        "exactly",
        "accepted",
        "seen",
        "herder",
        "also",
        "tension",
        "contradiction",
        "principle",
        "sociality",
        "hold",
        "even",
        "within",
        "single",
        "period",
        "culture",
        "human",
        "mind",
        "rule",
        "deeply",
        "individual",
        "deeply",
        "different",
        "otherso",
        "addition",
        "generalizing",
        "psychology",
        "also",
        "need",
        "psychology",
        "oriented",
        "individuality",
        "important",
        "idea",
        "strongly",
        "influenced",
        "many",
        "subsequent",
        "continental",
        "thinker",
        "example",
        "schleiermacher",
        "nietzsche",
        "proust",
        "sartre",
        "manfred",
        "frank",
        "herder",
        "advance",
        "empirically",
        "based",
        "rule",
        "thumb",
        "contrast",
        "prominent",
        "strand",
        "schleiermacher",
        "frank",
        "purport",
        "establish",
        "priori",
        "universal",
        "truth",
        "however",
        "herder",
        "original",
        "version",
        "arguably",
        "plausible",
        "one",
        "finally",
        "like",
        "predecessor",
        "rationalist",
        "tradition",
        "kant",
        "herder",
        "sharply",
        "reject",
        "cartesian",
        "idea",
        "mind",
        "selftransparencyinstead",
        "insisting",
        "much",
        "occurs",
        "mind",
        "unconscious",
        "selfknowledge",
        "often",
        "deeply",
        "problematic",
        "addition",
        "identifies",
        "literature",
        "eg",
        "shakespeare",
        "especially",
        "rich",
        "source",
        "insight",
        "unconscious",
        "another",
        "compelling",
        "position",
        "strong",
        "influence",
        "subsequent",
        "thinker",
        "philosophy",
        "mind",
        "hermeneutics",
        "whole",
        "herderian",
        "philosophy",
        "mind",
        "owes",
        "much",
        "predecessor",
        "especially",
        "one",
        "rationalist",
        "tradition",
        "also",
        "many",
        "way",
        "original",
        "theory",
        "important",
        "right",
        "also",
        "exercised",
        "enormous",
        "influence",
        "herder",
        "successor",
        "including",
        "schleiermacher",
        "hegel",
        "nietzsche"
    ]
}