{
    "main_text": "Three Controversies || Panpsychism\n3.2 Panpsychism\n\nPanpsychism is widely taken to provide a possible answer to the\nmind-body problem and the by now (merely repetitive) reiteration of\nLotze’s commitment to panpsychism is easy to document. The fact that\nLotze said praiseworthy things about his former teacher, Fechner,\nafter the latter’s mental breakdown, is usually highlighted and we\nare informed that “Lotze’s main criticism of Fechner is that\nhe is not bold enough … there were deeper metaphysical reasons\nfor thinking that all reality is alive” (Beiser, 2013, p. 235).\nBut this approach forces us to take Lotze’s equivocal statements at\nface value when there are numerous clear indications that we should\nnot.\n\nFirst of all, almost all of the quotations typically drawn from the\nMikrokosmus in support of panpsychism are actually phrased in\nthe form of questions (and not assertions), viz.\n\nIf we cannot account for the appearance of a mental state\n[geistigen Zustandes] by those properties in virtue of which\nwe call matter matter, what hinders us from supposing that besides\nthose properties there is a store of inner life which usually escapes\nour attention, and finds no other opportunity of manifestation than in\nwhat we call mental life [geistiges Lebens]? (Micro,\nI, p. 150)\n\n\nWhy, in opposition to matter as an ever dead substance, should all\nmental activity [geistiges Regsamkeit] be condensed into the\nspecial nature of a soul [Seele], destitute on its side of\nthe properties by means of which the physical elements make themselves\nof account in Nature? (ibid.)\n\n\nMight not the visible substance have directly a double life, appearing\noutwardly as matter, and as such manifesting no property other than\nthose mechanical ones with which we are familiar, – internally\non the other hand moved mentally [geistig bewegt], aware of\nthe changes in its states, and accompanying with efforts the activity,\nwhose general subjection to law it is certainly not in its power\narbitrarily to alter? (ibid.)\n\n\nHave things by their motions, while themselves destitute of enjoyment,\nonly to minister to souls [Seelen] as mere stimuli to this\nmental life [innerlichen Leben]? (Micro, I, p. 353)\n\n\nHas the one half of creation, that which we comprise under the name of\nthe material world, no function whatever save that of serving the\nother half, the realm of mind [des Reiches des Geister], and\nare we justified in longing to find the lustre of sense\n[Sinnlichkeit] in that also whence we seem always to derive\nit? (ibid.)\n\n\nIn the Mikrokosmus, Lotze emphasizes that panpsychism is\nstrongly motivated from the impetus to counter, in some fashion, the\nexcesses of materialism. But this very “justification,” he\ncomments, is simultaneously “the source of the barrenness of\nthis view” (Micro, I, p. 151): we don’t like\nmaterialism, so we appeal to panpsychism, adopting the\ncounter-hypothesis that simply “ascribes to matter a secret\nmental life” (ibid.). But why in the world ought we do that?\n\nAt best, panpsychism, under this pretext, is merely an empty and vain\nidea, “a conception … that, [may be counted] among the\ndreams of our imagination”; it names a belief about which the\nmost we may say is that it “may be one of those which do not\ncontradict actual facts” (Micro, I, p. 360). In a word, it\nis possible, but scarcely probable and in no wise to be considered\nactual. After all, were it quite literally to be true, then we would\nhave to adjust ourselves to the following curious state of affairs:\n“Who could endure the thought that in the dust trodden by our\nfeet, in the prosaic texture of the cloth that forms our clothing, in\nthe materials shaped into all sorts of utensils … there is\neverywhere present the fulness of animated life …?”\n(Micro, I, p. 361). Who could truly inhabit such a ghastly\nand ghostly realm?\n\nConsequently, neither science nor philosophy has any need of such an\nhypothesis, one that indeed bears an uncanny relation to mythological\nthinking (remnants of which are still preserved in our culture,\nthrough the influence of Greek art and thought). Nonetheless, whatever\nits storied pedigree, “we … must not introduce it into\nscience.” From the sole requirements of knowledge alone,\n“nothing remains for us but to gather from experience the laws\nfound valid in the ultimate ramifications of reality”\n(Micro, I, p. 363). Among our philosophical inheritance from\nGerman Romanticism, thus, cannot be counted “Schiller’s\nGötter Griechenlands” (Micro, I, p. xiv) and\nthe like.\n\nNor can we, in any fashion, seek to derive this view from purely\nself-interested metaphysical motives, viz.\n\nThe dislike to look on one part of the cosmos as but a blind and\nlifeless instrument for the ends of another, the desire to diffuse\nover all the joy of animation, and to vindicate a universe enjoying at\nevery point throughout its own existence a more perfect than one in\nwhich a divided structure shows mentality [des Geistigen]\nabove an unconscious basis – in this we have but one series of\nmotives inviting us beneath the unruffled surface of matter behind the\nrigid and regular repetitions of its workings, to seek the warmth of\nmental activity [geistigen Regsamkeit] (Micro, I, p.\n362).\n\n\nIn a word, fear of nihilism is also no justification. Indeed, at long\nlast, the only rationale that can be offered for the panpsychist\n“wager” is purely aesthetic in nature: “nothing but\nthe beauty of the living form is made to us more intelligible by this\nhypothesis” (Micro, I, p. 366). Indeed, in the end, we\nmay only admit that our scientific work “neither wants nor needs\npanpsychism – rather, it is needed to satisfy the human spirit,\nto make the nature of soul comprehensible” (Skrbina, 2007, p.\n128).\n\nAt first glance, however, this explanation superficially suggests that\nLotze may be nothing more than a beautiful soul. Panpsychism must, at\nbottom, be shown to possess some truly special significance, far\noutstripping the utterly false assistance it would pretend to offer to\nthe natural sciences. For assisting the science of psychology, even\nthe very possibility of panpsychism is “wholly immaterial”\n(Micro, I, p. 365). Rather, Lotze asserts, to be painfully\nrepetitive, that “nothing but the beauty of the living form\n[die Schönheit der lebendigen Gestalt] is made to us more\nintelligible by this hypothesis” (Micro, I, p. 366).\nBut what, precisely, could this gnomic utterance be taken to mean?\n\nIt appears that Lotze’s terminology cashes out directly as follows:\n“The image which we now have to form of the living form [die\nlebendige Gestalt] and its mental life is that of an association\nof many beings” (Micro, I, p. 367). Lotze then extends\nthe figure by analogizing each human individual to our species\nbeing:\n\nAll that we prize in life, and that is the source of nobler\nenjoyments, rests on this mode of combination in a manifold; the human\nrace, embodies in countless individuals, leads the life of constant\nreciprocal action, of mutual fellow-feeling in love and hatred, of\nuninterrupted progress, that make all share in the gain of one part\n(Micro, I, p. 368).\n\n\nBut this does not entail any submerging of the many into some one:\n“The unity in which we long to be knit with another is always\ncompleteness of intercourse, reciprocal enjoyment of what is without,\nnever the confused mingling in which all joy of union perishes”\n(ibid.).\n\nConsequently, as applied to each unique individual, we must admit that\nontogeny really does recapitulate phylogeny, by admitting that\n“… its inner life never becomes ours and when the union\nof different beings on which our living form [unsere lebendige\nGestalt] depends falls to pieces, while we shall all have gone\nthrough something together, it will be as beings originally different\nthat after a passing contact again separate” (ibid.).\n\nPanpsychism emerges hence as an aesthetic hypothesis that can be\ncalled on to account for one thing and one thing only: the realization\nforced earlier in the century by the French physiologists that life,\nwhatever it was, was a union of separate and quite heterogeneous\nprocesses, held together in the most fragile of unions:\n\nBichat’s physiological conclusions grew primarily out of his\nstudy of death, in which we identified death as a fragmented process,\nconsisting of the extinction of different organs and processes: the\ndeath of locomotion, of respiration, of sense perceptions, of the\nbrain. If death was thus a multiple, dispersed event, then so was\norganic life. According to Georges Canguilhem, “The genius of\nBichat was to decentralize the notion of life, to incarnate it in the\nparts of organisms.” With Bichat begins the progressive\nparcelization and division of the body into separate and specific\nsystems and functions that would occur in the first half of the\nnineteenth century (Crary, 1992, pp. 78–79).\n\n\nEach of us is then, quite literally, composed of others, who, while\ncoming together for a time, to work upon a common purpose, ultimately\ndisperse, returning to a more basic (and decomposed) form of\nexistence. That is the ultimate and, indeed, the only point of the\npanpsychist perspective: we may view our individual being on analogy\nwith the cooperative workings of multiple entities, as in a larger\nsociety. Society is simultaneously an image of the self, and vice\nversa.\n\nNow Lotze did his best to sugar coat this physiological revelation but\nnot, it seems, in order to make it more palatable; instead he wanted\nto show, simultaneously, how little we have gained and how little we\nhave lost in its acknowledgement. In reality, the best gloss of\nLotze’s overarching strategy – as wrested from its original\npoint of reference – is that “… Lotze takes his\nreader to the abyss only to pull him back and teach him a lesson. The\nexercise in metaphysical brinkmanship is designed to show the reader\nthat the only salvation from nihilism, the only way forward in\nmetaphysics, lies in ethics …” (Beiser, 2013, p.\n155).\n\nScience has given and science has taken away. But, in reality, nothing\nhas changed. What matters is how we look at it. The nihilistic\nconclusions of the natural sciences can’t change (or undermine\nthe truth of) human experience, no matter how deep our investigation\ndescends. Our situation is thus akin to that given admirable (if\nsomewhat dated meteorological) literary expression as follows:\n\nA barometric low hung over the Atlantic. It moved eastward toward a\nhigh-pressure area over Russia without as yet showing any inclination\nto bypass this high in a northerly direction. The isotherms and\nisotheres were functioning as they should. The air temperature was\nappropriate relative to the annual mean temperature and to the\naperiodic monthly fluctuations of the temperature. The rising and\nsetting of the sun, the moon, the phases of the moon, of Venus, of the\nrings of Saturn, and many other significant phenomena were all in\naccordance with the forecasts in the astronomical yearbooks. The water\nvapor in the air was at its maximal state of tension, while the\nhumidity was minimal. In a word that characterizes the facts fairly\naccurately, even if it is a bit old-fashioned: It was a fine day in\nAugust 1913 (Musil 1930–1945 [1965], p. 3).\n\n\nThe poetic and the evaluative may appear resolutely old-fashioned in a\ncold, utilitarian universe. But it names precisely an impulse of human\nknowers that can never be replaced, supplanted or repressed.\nPractically speaking, we are value-finding beings. We will continue to\nutter such strange and human constructions as “the sun is coming\nup” or “it was a very fine day,” for our world is both poetry\nand prose. And it can never be simply one or the other for human\nexistence.\n",
    "section_title": "3.2 Panpsychism",
    "entry_title": "Hermann Lotze",
    "hierarchy_title": "Hermann Lotze || Three Controversies || Panpsychism",
    "tokenized_text": [
        "three",
        "controversy",
        "panpsychism",
        "panpsychism",
        "panpsychism",
        "widely",
        "taken",
        "provide",
        "possible",
        "answer",
        "mindbody",
        "problem",
        "merely",
        "repetitive",
        "reiteration",
        "lotze",
        "commitment",
        "panpsychism",
        "easy",
        "document",
        "fact",
        "lotze",
        "said",
        "praiseworthy",
        "thing",
        "former",
        "teacher",
        "fechner",
        "latter",
        "mental",
        "breakdown",
        "usually",
        "highlighted",
        "informed",
        "lotze",
        "main",
        "criticism",
        "fechner",
        "bold",
        "enough",
        "deeper",
        "metaphysical",
        "reason",
        "thinking",
        "reality",
        "alive",
        "beiser",
        "p",
        "approach",
        "force",
        "u",
        "take",
        "lotze",
        "equivocal",
        "statement",
        "face",
        "value",
        "numerous",
        "clear",
        "indication",
        "first",
        "almost",
        "quotation",
        "typically",
        "drawn",
        "mikrokosmus",
        "support",
        "panpsychism",
        "actually",
        "phrased",
        "form",
        "question",
        "assertion",
        "viz",
        "account",
        "appearance",
        "mental",
        "state",
        "geistigen",
        "zustandes",
        "property",
        "virtue",
        "call",
        "matter",
        "matter",
        "hinders",
        "u",
        "supposing",
        "besides",
        "property",
        "store",
        "inner",
        "life",
        "usually",
        "escape",
        "attention",
        "find",
        "opportunity",
        "manifestation",
        "call",
        "mental",
        "life",
        "geistiges",
        "lebens",
        "micro",
        "p",
        "opposition",
        "matter",
        "ever",
        "dead",
        "substance",
        "mental",
        "activity",
        "geistiges",
        "regsamkeit",
        "condensed",
        "special",
        "nature",
        "soul",
        "seele",
        "destitute",
        "side",
        "property",
        "mean",
        "physical",
        "element",
        "make",
        "account",
        "nature",
        "ibid",
        "might",
        "visible",
        "substance",
        "directly",
        "double",
        "life",
        "appearing",
        "outwardly",
        "matter",
        "manifesting",
        "property",
        "mechanical",
        "one",
        "familiar",
        "internally",
        "hand",
        "moved",
        "mentally",
        "geistig",
        "bewegt",
        "aware",
        "change",
        "state",
        "accompanying",
        "effort",
        "activity",
        "whose",
        "general",
        "subjection",
        "law",
        "certainly",
        "power",
        "arbitrarily",
        "alter",
        "ibid",
        "thing",
        "motion",
        "destitute",
        "enjoyment",
        "minister",
        "soul",
        "seelen",
        "mere",
        "stimulus",
        "mental",
        "life",
        "innerlichen",
        "leben",
        "micro",
        "p",
        "one",
        "half",
        "creation",
        "comprise",
        "name",
        "material",
        "world",
        "function",
        "whatever",
        "save",
        "serving",
        "half",
        "realm",
        "mind",
        "de",
        "reich",
        "de",
        "geister",
        "justified",
        "longing",
        "find",
        "lustre",
        "sense",
        "sinnlichkeit",
        "also",
        "whence",
        "seem",
        "always",
        "derive",
        "ibid",
        "mikrokosmus",
        "lotze",
        "emphasizes",
        "panpsychism",
        "strongly",
        "motivated",
        "impetus",
        "counter",
        "fashion",
        "excess",
        "materialism",
        "justification",
        "comment",
        "simultaneously",
        "source",
        "barrenness",
        "view",
        "micro",
        "p",
        "like",
        "materialism",
        "appeal",
        "panpsychism",
        "adopting",
        "counterhypothesis",
        "simply",
        "ascribes",
        "matter",
        "secret",
        "mental",
        "life",
        "ibid",
        "world",
        "ought",
        "best",
        "panpsychism",
        "pretext",
        "merely",
        "empty",
        "vain",
        "idea",
        "conception",
        "may",
        "counted",
        "among",
        "dream",
        "imagination",
        "name",
        "belief",
        "may",
        "say",
        "may",
        "one",
        "contradict",
        "actual",
        "fact",
        "micro",
        "p",
        "word",
        "possible",
        "scarcely",
        "probable",
        "wise",
        "considered",
        "actual",
        "quite",
        "literally",
        "true",
        "would",
        "adjust",
        "following",
        "curious",
        "state",
        "affair",
        "could",
        "endure",
        "thought",
        "dust",
        "trodden",
        "foot",
        "prosaic",
        "texture",
        "cloth",
        "form",
        "clothing",
        "material",
        "shaped",
        "sort",
        "utensil",
        "everywhere",
        "present",
        "fulness",
        "animated",
        "life",
        "micro",
        "p",
        "could",
        "truly",
        "inhabit",
        "ghastly",
        "ghostly",
        "realm",
        "consequently",
        "neither",
        "science",
        "philosophy",
        "need",
        "hypothesis",
        "one",
        "indeed",
        "bear",
        "uncanny",
        "relation",
        "mythological",
        "thinking",
        "remnant",
        "still",
        "preserved",
        "culture",
        "influence",
        "greek",
        "art",
        "thought",
        "nonetheless",
        "whatever",
        "storied",
        "pedigree",
        "must",
        "introduce",
        "science",
        "sole",
        "requirement",
        "knowledge",
        "alone",
        "nothing",
        "remains",
        "u",
        "gather",
        "experience",
        "law",
        "found",
        "valid",
        "ultimate",
        "ramification",
        "reality",
        "micro",
        "p",
        "among",
        "philosophical",
        "inheritance",
        "german",
        "romanticism",
        "thus",
        "counted",
        "schiller",
        "götter",
        "griechenlands",
        "micro",
        "p",
        "xiv",
        "like",
        "fashion",
        "seek",
        "derive",
        "view",
        "purely",
        "selfinterested",
        "metaphysical",
        "motif",
        "viz",
        "dislike",
        "look",
        "one",
        "part",
        "cosmos",
        "blind",
        "lifeless",
        "instrument",
        "end",
        "another",
        "desire",
        "diffuse",
        "joy",
        "animation",
        "vindicate",
        "universe",
        "enjoying",
        "every",
        "point",
        "throughout",
        "existence",
        "perfect",
        "one",
        "divided",
        "structure",
        "show",
        "mentality",
        "de",
        "geistigen",
        "unconscious",
        "basis",
        "one",
        "series",
        "motif",
        "inviting",
        "u",
        "beneath",
        "unruffled",
        "surface",
        "matter",
        "behind",
        "rigid",
        "regular",
        "repetition",
        "working",
        "seek",
        "warmth",
        "mental",
        "activity",
        "geistigen",
        "regsamkeit",
        "micro",
        "p",
        "word",
        "fear",
        "nihilism",
        "also",
        "justification",
        "indeed",
        "long",
        "last",
        "rationale",
        "offered",
        "panpsychist",
        "wager",
        "purely",
        "aesthetic",
        "nature",
        "nothing",
        "beauty",
        "living",
        "form",
        "made",
        "u",
        "intelligible",
        "hypothesis",
        "micro",
        "p",
        "indeed",
        "end",
        "may",
        "admit",
        "scientific",
        "work",
        "neither",
        "want",
        "need",
        "panpsychism",
        "rather",
        "needed",
        "satisfy",
        "human",
        "spirit",
        "make",
        "nature",
        "soul",
        "comprehensible",
        "skrbina",
        "p",
        "first",
        "glance",
        "however",
        "explanation",
        "superficially",
        "suggests",
        "lotze",
        "may",
        "nothing",
        "beautiful",
        "soul",
        "panpsychism",
        "must",
        "bottom",
        "shown",
        "posse",
        "truly",
        "special",
        "significance",
        "far",
        "outstripping",
        "utterly",
        "false",
        "assistance",
        "would",
        "pretend",
        "offer",
        "natural",
        "science",
        "assisting",
        "science",
        "psychology",
        "even",
        "possibility",
        "panpsychism",
        "wholly",
        "immaterial",
        "micro",
        "p",
        "rather",
        "lotze",
        "asserts",
        "painfully",
        "repetitive",
        "nothing",
        "beauty",
        "living",
        "form",
        "die",
        "schönheit",
        "der",
        "lebendigen",
        "gestalt",
        "made",
        "u",
        "intelligible",
        "hypothesis",
        "micro",
        "p",
        "precisely",
        "could",
        "gnomic",
        "utterance",
        "taken",
        "mean",
        "appears",
        "lotze",
        "terminology",
        "cash",
        "directly",
        "follows",
        "image",
        "form",
        "living",
        "form",
        "die",
        "lebendige",
        "gestalt",
        "mental",
        "life",
        "association",
        "many",
        "being",
        "micro",
        "p",
        "lotze",
        "extends",
        "figure",
        "analogizing",
        "human",
        "individual",
        "specie",
        "prize",
        "life",
        "source",
        "nobler",
        "enjoyment",
        "rest",
        "mode",
        "combination",
        "manifold",
        "human",
        "race",
        "embodies",
        "countless",
        "individual",
        "lead",
        "life",
        "constant",
        "reciprocal",
        "action",
        "mutual",
        "fellowfeeling",
        "love",
        "hatred",
        "uninterrupted",
        "progress",
        "make",
        "share",
        "gain",
        "one",
        "part",
        "micro",
        "p",
        "entail",
        "submerging",
        "many",
        "one",
        "unity",
        "long",
        "knit",
        "another",
        "always",
        "completeness",
        "intercourse",
        "reciprocal",
        "enjoyment",
        "without",
        "never",
        "confused",
        "mingling",
        "joy",
        "union",
        "perishes",
        "ibid",
        "consequently",
        "applied",
        "unique",
        "individual",
        "must",
        "admit",
        "ontogeny",
        "really",
        "recapitulate",
        "phylogeny",
        "admitting",
        "inner",
        "life",
        "never",
        "becomes",
        "union",
        "different",
        "being",
        "living",
        "form",
        "unsere",
        "lebendige",
        "gestalt",
        "depends",
        "fall",
        "piece",
        "shall",
        "gone",
        "something",
        "together",
        "being",
        "originally",
        "different",
        "passing",
        "contact",
        "separate",
        "ibid",
        "panpsychism",
        "emerges",
        "hence",
        "aesthetic",
        "hypothesis",
        "called",
        "account",
        "one",
        "thing",
        "one",
        "thing",
        "realization",
        "forced",
        "earlier",
        "century",
        "french",
        "physiologist",
        "life",
        "whatever",
        "union",
        "separate",
        "quite",
        "heterogeneous",
        "process",
        "held",
        "together",
        "fragile",
        "union",
        "bichat",
        "physiological",
        "conclusion",
        "grew",
        "primarily",
        "study",
        "death",
        "identified",
        "death",
        "fragmented",
        "process",
        "consisting",
        "extinction",
        "different",
        "organ",
        "process",
        "death",
        "locomotion",
        "respiration",
        "sense",
        "perception",
        "brain",
        "death",
        "thus",
        "multiple",
        "dispersed",
        "event",
        "organic",
        "life",
        "according",
        "george",
        "canguilhem",
        "genius",
        "bichat",
        "decentralize",
        "notion",
        "life",
        "incarnate",
        "part",
        "organisms",
        "bichat",
        "begin",
        "progressive",
        "parcelization",
        "division",
        "body",
        "separate",
        "specific",
        "system",
        "function",
        "would",
        "occur",
        "first",
        "half",
        "nineteenth",
        "century",
        "crary",
        "pp",
        "u",
        "quite",
        "literally",
        "composed",
        "others",
        "coming",
        "together",
        "time",
        "work",
        "upon",
        "common",
        "purpose",
        "ultimately",
        "disperse",
        "returning",
        "basic",
        "decomposed",
        "form",
        "existence",
        "ultimate",
        "indeed",
        "point",
        "panpsychist",
        "perspective",
        "may",
        "view",
        "individual",
        "analogy",
        "cooperative",
        "working",
        "multiple",
        "entity",
        "larger",
        "society",
        "society",
        "simultaneously",
        "image",
        "self",
        "vice",
        "versa",
        "lotze",
        "best",
        "sugar",
        "coat",
        "physiological",
        "revelation",
        "seems",
        "order",
        "make",
        "palatable",
        "instead",
        "wanted",
        "show",
        "simultaneously",
        "little",
        "gained",
        "little",
        "lost",
        "acknowledgement",
        "reality",
        "best",
        "gloss",
        "lotze",
        "overarching",
        "strategy",
        "wrested",
        "original",
        "point",
        "reference",
        "lotze",
        "take",
        "reader",
        "abyss",
        "pull",
        "back",
        "teach",
        "lesson",
        "exercise",
        "metaphysical",
        "brinkmanship",
        "designed",
        "show",
        "reader",
        "salvation",
        "nihilism",
        "way",
        "forward",
        "metaphysics",
        "lie",
        "ethic",
        "beiser",
        "p",
        "science",
        "given",
        "science",
        "taken",
        "away",
        "reality",
        "nothing",
        "changed",
        "matter",
        "look",
        "nihilistic",
        "conclusion",
        "natural",
        "science",
        "change",
        "undermine",
        "truth",
        "human",
        "experience",
        "matter",
        "deep",
        "investigation",
        "descends",
        "situation",
        "thus",
        "akin",
        "given",
        "admirable",
        "somewhat",
        "dated",
        "meteorological",
        "literary",
        "expression",
        "follows",
        "barometric",
        "low",
        "hung",
        "atlantic",
        "moved",
        "eastward",
        "toward",
        "highpressure",
        "area",
        "russia",
        "without",
        "yet",
        "showing",
        "inclination",
        "bypass",
        "high",
        "northerly",
        "direction",
        "isotherm",
        "isotheres",
        "functioning",
        "air",
        "temperature",
        "appropriate",
        "relative",
        "annual",
        "mean",
        "temperature",
        "aperiodic",
        "monthly",
        "fluctuation",
        "temperature",
        "rising",
        "setting",
        "sun",
        "moon",
        "phase",
        "moon",
        "venus",
        "ring",
        "saturn",
        "many",
        "significant",
        "phenomenon",
        "accordance",
        "forecast",
        "astronomical",
        "yearbook",
        "water",
        "vapor",
        "air",
        "maximal",
        "state",
        "tension",
        "humidity",
        "minimal",
        "word",
        "characterizes",
        "fact",
        "fairly",
        "accurately",
        "even",
        "bit",
        "oldfashioned",
        "fine",
        "day",
        "august",
        "musil",
        "p",
        "poetic",
        "evaluative",
        "may",
        "appear",
        "resolutely",
        "oldfashioned",
        "cold",
        "utilitarian",
        "universe",
        "name",
        "precisely",
        "impulse",
        "human",
        "knower",
        "never",
        "replaced",
        "supplanted",
        "repressed",
        "practically",
        "speaking",
        "valuefinding",
        "being",
        "continue",
        "utter",
        "strange",
        "human",
        "construction",
        "sun",
        "coming",
        "fine",
        "day",
        "world",
        "poetry",
        "prose",
        "never",
        "simply",
        "one",
        "human",
        "existence"
    ]
}