{
    "main_text": "Conservation laws, electrodynamics, and acoustics || Conservation of energy: 1842–1854\n4.1 Conservation of energy: 1842–1854\n\nFrom 1841 to 1842, Helmholtz finished his studies with Johannes\nMüller in Berlin. As seen above in the section on physiology,\nMüller’s endorsement of experimental science was in\npragmatic conflict with his commitment to Naturphilosophie,\nand in particular, to vitalism. According to vitalist theories, in\naddition to the mechanical and physical forces present in a living\nbody, there is a “vital force” that makes the parts of the\nbody work together as an organism. The term for momentum, vis viva,\nillustrates the belief. In the early part of the 19th\ncentury, Ernst Heinrich Weber argued that the so-called “vital\nforces” are in fact physical forces, and he argued that the most\npressing problem for 19th century physiology was to explain\nthe so-called vital forces in physical terms, and thus to banish\nvitalism. According to at least one account, Müller took his cue\nfrom Weber in setting problems for the students working in his lab,\nincluding Helmholtz, Emil du Bois-Reymond, Rudolf Virchow, and Ernst\nBrücke, although Müller knew that Weber’s view was\ninconsistent with his own commitments (Königsberger 1906, 25). It\nis evidence in favor of this view that in 1843, Müller published\nHelmholtz’s first essay, “On the Nature of Fermentation\nand Putrefaction,” written in support of Justus von\nLiebig’s anti-vitalist arguments against spontaneous generation,\nin his own journal, Müller’s Archiv.\n\nAfter receiving his medical degree in 1842, Helmholtz worked as a\nmilitary surgeon in Potsdam from 1843 to 1848. However, he took\nfrequent trips to Berlin to work in Gustav Magnus’s lab, and to\ntalk with Müller’s other former students and with Carl\nLudwig. As mentioned above, in 1845 Helmholtz joined the Berlin\nPhysical Society, which du Bois-Reymond and Brücke founded with\nthe express intention of banishing vitalism. Also in 1845, Helmholtz\ntook a five month leave from his work as a surgeon to take his\nqualifying exams. He used the time to work in the lab in Berlin, and\ncontinued to focus on the consequences of Weber’s and\nLiebig’s attacks on vitalism.\n\nLiebig had focused attention on the question of whether an\norganism’s metabolism produces all its heat and mechanical\nenergy. If so, then appealing to a vital force to explain these\nphenomena would be superfluous. Through experiments on frogs’\nmuscles using electrical currents, Helmholtz showed that the heat the\nfrogs’ muscles produced was accounted for by metabolism and\nmuscular action. He published his results in 1845, again in\nMüller’s journal, in “On Metabolism during Muscular\nActivity” (see Bevilacqua 1993, 297ff). Helmholtz realized,\nagain in 1845, that the question of whether forces could be accounted\nfor by mechanical means had a much more general application. The\npresupposition of vitalism, that there is an inexhaustible\n“vital force” that powers living bodies, had led some\ninvestigators to posit that there is an inexhaustible force, whether\nmechanical or not, that can power a machine indefinitely: a perpetual\nmotion machine, perpetuum mobile. The realization was\nprompted by Helmholtz’s study of the 18th century classics of\nmathematical analysis: Euler, Bernoulli, D’Alembert, and\nLagrange. As Helmholtz remarked years later, by the end of the 18th\ncentury these mathematicians had established the impossibility of a\nperpetual motion machine powered by mechanical forces:\n\nfor all purely mechanical, that is to say, for moving\nforces,…all our machinery and apparatus generate no force, but\nsimply yield up the power communicated to them by natural forces,\nfalling water, moving wind, or by the muscles of men and animals.\nAfter this law had been established by the great mathematicians of the\nlast century, a perpetual motion, which should make use only of pure\nmechanical forces…could only be sought after by bewildered and\nill-instructed people (Helmholtz 1995 [1854], 24).\n\n\nBut what about the non-mechanical forces: heat, light, electricity and\nmagnetism? When Helmholtz started to look into the question of the\ncharacter of non-mechanical forces, instead of looking for perpetual\nmotion, he asked “if perpetual motion is impossible, what is the\nrelationship between natural forces that must hold?”\n\nOn the 23rd of July in 1847, Helmholtz gave an address, “The\nConservation of Force,” at the Physical Society.\n“Force” [Kraft], as Helmholtz uses it, is equivalent to\nthe modern term “energy.” Helmholtz’s address was\nvery well received by the Society, but Helmholtz was forced to publish\nit as a pamphlet after Poggendorff rejected it for his\nAnnalen as too speculative.\n\nHelmholtz summarizes his conclusions in the essay as follows:\n\nThe deduction of the propositions contained in the memoir may be based\non either of two maxims; either on the maxim that it is not possible\nby any combination whatever of natural bodies to derive an unlimited\namount of mechanical force, or on the assumption that all actions in\nnature can be ultimately referred to attractive or repulsive forces,\nthe intensity of which depends solely on the distances between the\npoints at which the forces are exerted. That both these propositions\nare identical is shown at the commencement of the memoir itself\n(Helmholtz 1853 [1847], 114–115; cited in Königsberger\n1906, 39).\n\n\nHelmholtz argues that a proof that all natural actions can be\naccounted for by universal action at a distance is equivalent to a\nrefutation of perpetual motion.\n\nIn 1842–1843, Robert Mayer and James Joule had formulated\nprinciples of the conservation of energy. Their work asserted the\nconservation of mv2, the mass of a particle times the\nsquare of its velocity. Further, Joule and Mayer argued that heat and\nmechanical work are interchangeable (see Kuhn 1969, Mach 1911).\nHelmholtz called on Joule’s work (though he claimed to be\nunaware of Meyer’s) to achieve three results. As Bevilaqua\n(1993) sums it up, Helmholtz concluded that:\n\nThe principle of conservation of force implies that the maximum\nquantity of work available from a system is a determined, finite\nquantity if the acting forces do not depend on time and velocity; if\nthey do so depend, or if the forces act in directions other than that\njoining the active material points, the “force” can be\ngained or lost ad infinitum; and under non-central forces, a system of\nbodies at rest could be set in motion by the effect of its own\ninternal forces (Bevilaqua 1993, 315).\n\n\nKenneth Caneva (2019) argues that Helmholtz’s principle is a\n“creative refashioning” of the tradition of rational\nmechanics, especially the principles of vis viva and its\nconservation.  Bevilacqua argues that the main innovation of\nHelmholtz’s work was to unite two fields, and to anticipate the\nintegration of potential energy into mechanics:\n\nIn the tradition of analytical mechanics, the stress had been on the\nconservation of vis viva; in the tradition of mechanical\nengineering on the conservation of work. Helmholtz, by contrast,\nstressed the equivalence of the two. It was the introduction of the\nterm Spannkraft that brought the real shift in meaning: with\ntension forces we are very far from the concept of work and very close\nto that of potential energy (Bevilaqua 1993, 315).\n\n\nWhile Helmholtz’s work was published in pamphlet form in\nGermany, it was picked up quickly by English scientists and published\nin English translation almost immediately. Helmholtz’s work\nbecame known quickly in English scientific and philosophical circles,\nwhich contributed to his lasting influence in both fields (see Cahan\n2012).\n\nHelmholtz acknowledged in his essay that earlier scientists, including\nJoule, Newton, Bernoulli, and Rumford, had arrived at various forms of\nthe principle of energy conservation. In his history of mechanics,\nErnst Mach argues that some form of Helmholtz’s principle was\nknown to “almost all eminent investigators” in history\n(Mach 1911, 20). In his landmark study of energy conservation, Thomas\nKuhn presents the work of Joule, Mayer, and others from the 1830s,\nwhich argues that heat and work can be substituted for each other\nquantitatively, which is a significant component of Helmholtz’s\nprinciple (Kuhn 1969, 321). Kuhn argues that the discovery of the\nprinciple of energy conservation is a case in which several scientists\nlay the experimental and conceptual framework for a principle\ntogether.\n\nKuhn does insist that Helmholtz formulated the principle. Robert\nPurrington observes, following Kuhn, that “There was a widely\nheld, intuitive view that the total quantity of force (or motion)\nmight be somehow constant, but it did not necessarily imply an ability\nto distinguish the vector nature of force or momentum from the scalar\nenergy” (Purrington 1997, 105). In his “Philosophical\nIntroduction” to the essay, Helmholtz himself argues that his\ntask in the essay is not to find new experimental evidence or a\ncompletely new principle, but rather to explain the “unknown\ncauses” of the phenomena from their “visible\nactions” according to the “laws of causality”:\n\nThe problem of the sciences…is, in the first place, to seek the\nlaws by which the particular processes of nature may be referred to,\nand deduced from, general rules. These rules—for example, the\nlaw of the reflection and refraction of light, the law of Mariotte and\nGay-Lussac regarding the volumes of gases—are evidently nothing\nmore than general ideas by which the various phenomena which belong to\nthem are connected together. The finding out of these is the office of\nthe experimental portion of our science. The theoretic portion seeks,\non the contrary, to evolve the unknown causes of the processes from\nthe visible actions which they present; it seeks to comprehend these\nprocesses according to the laws of causality (Helmholtz 1853 [1847],\n114–115; cited in Königsberger 1906, 39).\n\n\nFor the philosophical implications of Helmholtz’s work on the\nconservation of energy, see Bevilacqua (1993) and Hyder (2006 and\n2009). Bevilacqua investigates two matters: Hemholtz’s synthesis\nof earlier work into a single principle, and his methodological\ndistinction, evident in the above citation, between theoretical and\nexperimental physics. Hyder investigates Helmholtz’s argument in\nthe essay that “force functions must be definable with regard\nonly to the relative positions of the mass-points comprising a\nphysical system” (Hyder 2006, 1). Marshalling the Kantian\nantecedents of the argument, Hyder maintains that Helmholtz’s\nresponse to criticisms of “On the Conservation of Force”\nby Clausius in 1854 influenced Helmholtz’s later work on\ngeometry. Hyder 2009 is an analysis of Helmholtz’s\n“radical critique” of Kantian geometry in the context of\nHelmholtz’s retention of a “transcendental element”\nin physics, especially with respect to the relationship between\ngeometry and empirical determinacy (2009, 19). In contrast, Edward\nJurkowitz (2010) argues that “already in his 1847\n‘Über die Erhaltung der Kraft’ one may find important\naspects of [Helmholtz’s] later empiricism” (p. 39).\n",
    "section_title": "4.1 Conservation of energy: 1842–1854",
    "entry_title": "Hermann von Helmholtz",
    "hierarchy_title": "Hermann von Helmholtz || Conservation laws, electrodynamics, and acoustics || Conservation of energy: 1842–1854",
    "tokenized_text": [
        "conservation",
        "law",
        "electrodynamics",
        "acoustic",
        "conservation",
        "energy",
        "conservation",
        "energy",
        "helmholtz",
        "finished",
        "study",
        "johannes",
        "müller",
        "berlin",
        "seen",
        "section",
        "physiology",
        "müller",
        "endorsement",
        "experimental",
        "science",
        "pragmatic",
        "conflict",
        "commitment",
        "naturphilosophie",
        "particular",
        "vitalism",
        "according",
        "vitalist",
        "theory",
        "addition",
        "mechanical",
        "physical",
        "force",
        "present",
        "living",
        "body",
        "vital",
        "force",
        "make",
        "part",
        "body",
        "work",
        "together",
        "organism",
        "term",
        "momentum",
        "vi",
        "viva",
        "illustrates",
        "belief",
        "early",
        "part",
        "th",
        "century",
        "ernst",
        "heinrich",
        "weber",
        "argued",
        "socalled",
        "vital",
        "force",
        "fact",
        "physical",
        "force",
        "argued",
        "pressing",
        "problem",
        "th",
        "century",
        "physiology",
        "explain",
        "socalled",
        "vital",
        "force",
        "physical",
        "term",
        "thus",
        "banish",
        "vitalism",
        "according",
        "least",
        "one",
        "account",
        "müller",
        "took",
        "cue",
        "weber",
        "setting",
        "problem",
        "student",
        "working",
        "lab",
        "including",
        "helmholtz",
        "emil",
        "du",
        "boisreymond",
        "rudolf",
        "virchow",
        "ernst",
        "brücke",
        "although",
        "müller",
        "knew",
        "weber",
        "view",
        "inconsistent",
        "commitment",
        "königsberger",
        "evidence",
        "favor",
        "view",
        "müller",
        "published",
        "helmholtz",
        "first",
        "essay",
        "nature",
        "fermentation",
        "putrefaction",
        "written",
        "support",
        "justus",
        "von",
        "liebig",
        "antivitalist",
        "argument",
        "spontaneous",
        "generation",
        "journal",
        "müller",
        "archiv",
        "receiving",
        "medical",
        "degree",
        "helmholtz",
        "worked",
        "military",
        "surgeon",
        "potsdam",
        "however",
        "took",
        "frequent",
        "trip",
        "berlin",
        "work",
        "gustav",
        "magnus",
        "lab",
        "talk",
        "müller",
        "former",
        "student",
        "carl",
        "ludwig",
        "mentioned",
        "helmholtz",
        "joined",
        "berlin",
        "physical",
        "society",
        "du",
        "boisreymond",
        "brücke",
        "founded",
        "express",
        "intention",
        "banishing",
        "vitalism",
        "also",
        "helmholtz",
        "took",
        "five",
        "month",
        "leave",
        "work",
        "surgeon",
        "take",
        "qualifying",
        "exam",
        "used",
        "time",
        "work",
        "lab",
        "berlin",
        "continued",
        "focus",
        "consequence",
        "weber",
        "liebig",
        "attack",
        "vitalism",
        "liebig",
        "focused",
        "attention",
        "question",
        "whether",
        "organism",
        "metabolism",
        "produce",
        "heat",
        "mechanical",
        "energy",
        "appealing",
        "vital",
        "force",
        "explain",
        "phenomenon",
        "would",
        "superfluous",
        "experiment",
        "frog",
        "muscle",
        "using",
        "electrical",
        "current",
        "helmholtz",
        "showed",
        "heat",
        "frog",
        "muscle",
        "produced",
        "accounted",
        "metabolism",
        "muscular",
        "action",
        "published",
        "result",
        "müller",
        "journal",
        "metabolism",
        "muscular",
        "activity",
        "see",
        "bevilacqua",
        "ff",
        "helmholtz",
        "realized",
        "question",
        "whether",
        "force",
        "could",
        "accounted",
        "mechanical",
        "mean",
        "much",
        "general",
        "application",
        "presupposition",
        "vitalism",
        "inexhaustible",
        "vital",
        "force",
        "power",
        "living",
        "body",
        "led",
        "investigator",
        "posit",
        "inexhaustible",
        "force",
        "whether",
        "mechanical",
        "power",
        "machine",
        "indefinitely",
        "perpetual",
        "motion",
        "machine",
        "perpetuum",
        "mobile",
        "realization",
        "prompted",
        "helmholtz",
        "study",
        "th",
        "century",
        "classic",
        "mathematical",
        "analysis",
        "euler",
        "bernoulli",
        "alembert",
        "lagrange",
        "helmholtz",
        "remarked",
        "year",
        "later",
        "end",
        "th",
        "century",
        "mathematician",
        "established",
        "impossibility",
        "perpetual",
        "motion",
        "machine",
        "powered",
        "mechanical",
        "force",
        "purely",
        "mechanical",
        "say",
        "moving",
        "force",
        "all",
        "machinery",
        "apparatus",
        "generate",
        "force",
        "simply",
        "yield",
        "power",
        "communicated",
        "natural",
        "force",
        "falling",
        "water",
        "moving",
        "wind",
        "muscle",
        "men",
        "animal",
        "law",
        "established",
        "great",
        "mathematician",
        "last",
        "century",
        "perpetual",
        "motion",
        "make",
        "use",
        "pure",
        "mechanical",
        "forcescould",
        "sought",
        "bewildered",
        "illinstructed",
        "people",
        "helmholtz",
        "nonmechanical",
        "force",
        "heat",
        "light",
        "electricity",
        "magnetism",
        "helmholtz",
        "started",
        "look",
        "question",
        "character",
        "nonmechanical",
        "force",
        "instead",
        "looking",
        "perpetual",
        "motion",
        "asked",
        "perpetual",
        "motion",
        "impossible",
        "relationship",
        "natural",
        "force",
        "must",
        "hold",
        "rd",
        "july",
        "helmholtz",
        "gave",
        "address",
        "conservation",
        "force",
        "physical",
        "society",
        "force",
        "kraft",
        "helmholtz",
        "us",
        "equivalent",
        "modern",
        "term",
        "energy",
        "helmholtz",
        "address",
        "well",
        "received",
        "society",
        "helmholtz",
        "forced",
        "publish",
        "pamphlet",
        "poggendorff",
        "rejected",
        "annalen",
        "speculative",
        "helmholtz",
        "summarizes",
        "conclusion",
        "essay",
        "follows",
        "deduction",
        "proposition",
        "contained",
        "memoir",
        "may",
        "based",
        "either",
        "two",
        "maxim",
        "either",
        "maxim",
        "possible",
        "combination",
        "whatever",
        "natural",
        "body",
        "derive",
        "unlimited",
        "amount",
        "mechanical",
        "force",
        "assumption",
        "action",
        "nature",
        "ultimately",
        "referred",
        "attractive",
        "repulsive",
        "force",
        "intensity",
        "depends",
        "solely",
        "distance",
        "point",
        "force",
        "exerted",
        "proposition",
        "identical",
        "shown",
        "commencement",
        "memoir",
        "helmholtz",
        "cited",
        "königsberger",
        "helmholtz",
        "argues",
        "proof",
        "natural",
        "action",
        "accounted",
        "universal",
        "action",
        "distance",
        "equivalent",
        "refutation",
        "perpetual",
        "motion",
        "robert",
        "mayer",
        "james",
        "joule",
        "formulated",
        "principle",
        "conservation",
        "energy",
        "work",
        "asserted",
        "conservation",
        "mv",
        "mass",
        "particle",
        "time",
        "square",
        "velocity",
        "joule",
        "mayer",
        "argued",
        "heat",
        "mechanical",
        "work",
        "interchangeable",
        "see",
        "kuhn",
        "mach",
        "helmholtz",
        "called",
        "joule",
        "work",
        "though",
        "claimed",
        "unaware",
        "meyer",
        "achieve",
        "three",
        "result",
        "bevilaqua",
        "sum",
        "helmholtz",
        "concluded",
        "principle",
        "conservation",
        "force",
        "implies",
        "maximum",
        "quantity",
        "work",
        "available",
        "system",
        "determined",
        "finite",
        "quantity",
        "acting",
        "force",
        "depend",
        "time",
        "velocity",
        "depend",
        "force",
        "act",
        "direction",
        "joining",
        "active",
        "material",
        "point",
        "force",
        "gained",
        "lost",
        "ad",
        "infinitum",
        "noncentral",
        "force",
        "system",
        "body",
        "rest",
        "could",
        "set",
        "motion",
        "effect",
        "internal",
        "force",
        "bevilaqua",
        "kenneth",
        "caneva",
        "argues",
        "helmholtz",
        "principle",
        "creative",
        "refashioning",
        "tradition",
        "rational",
        "mechanic",
        "especially",
        "principle",
        "vi",
        "viva",
        "conservation",
        "bevilacqua",
        "argues",
        "main",
        "innovation",
        "helmholtz",
        "work",
        "unite",
        "two",
        "field",
        "anticipate",
        "integration",
        "potential",
        "energy",
        "mechanic",
        "tradition",
        "analytical",
        "mechanic",
        "stress",
        "conservation",
        "vi",
        "viva",
        "tradition",
        "mechanical",
        "engineering",
        "conservation",
        "work",
        "helmholtz",
        "contrast",
        "stressed",
        "equivalence",
        "two",
        "introduction",
        "term",
        "spannkraft",
        "brought",
        "real",
        "shift",
        "meaning",
        "tension",
        "force",
        "far",
        "concept",
        "work",
        "close",
        "potential",
        "energy",
        "bevilaqua",
        "helmholtz",
        "work",
        "published",
        "pamphlet",
        "form",
        "germany",
        "picked",
        "quickly",
        "english",
        "scientist",
        "published",
        "english",
        "translation",
        "almost",
        "immediately",
        "helmholtz",
        "work",
        "became",
        "known",
        "quickly",
        "english",
        "scientific",
        "philosophical",
        "circle",
        "contributed",
        "lasting",
        "influence",
        "field",
        "see",
        "cahan",
        "helmholtz",
        "acknowledged",
        "essay",
        "earlier",
        "scientist",
        "including",
        "joule",
        "newton",
        "bernoulli",
        "rumford",
        "arrived",
        "various",
        "form",
        "principle",
        "energy",
        "conservation",
        "history",
        "mechanic",
        "ernst",
        "mach",
        "argues",
        "form",
        "helmholtz",
        "principle",
        "known",
        "almost",
        "eminent",
        "investigator",
        "history",
        "mach",
        "landmark",
        "study",
        "energy",
        "conservation",
        "thomas",
        "kuhn",
        "present",
        "work",
        "joule",
        "mayer",
        "others",
        "s",
        "argues",
        "heat",
        "work",
        "substituted",
        "quantitatively",
        "significant",
        "component",
        "helmholtz",
        "principle",
        "kuhn",
        "kuhn",
        "argues",
        "discovery",
        "principle",
        "energy",
        "conservation",
        "case",
        "several",
        "scientist",
        "lay",
        "experimental",
        "conceptual",
        "framework",
        "principle",
        "together",
        "kuhn",
        "insist",
        "helmholtz",
        "formulated",
        "principle",
        "robert",
        "purrington",
        "observes",
        "following",
        "kuhn",
        "widely",
        "held",
        "intuitive",
        "view",
        "total",
        "quantity",
        "force",
        "motion",
        "might",
        "somehow",
        "constant",
        "necessarily",
        "imply",
        "ability",
        "distinguish",
        "vector",
        "nature",
        "force",
        "momentum",
        "scalar",
        "energy",
        "purrington",
        "philosophical",
        "introduction",
        "essay",
        "helmholtz",
        "argues",
        "task",
        "essay",
        "find",
        "new",
        "experimental",
        "evidence",
        "completely",
        "new",
        "principle",
        "rather",
        "explain",
        "unknown",
        "cause",
        "phenomenon",
        "visible",
        "action",
        "according",
        "law",
        "causality",
        "problem",
        "sciencesis",
        "first",
        "place",
        "seek",
        "law",
        "particular",
        "process",
        "nature",
        "may",
        "referred",
        "deduced",
        "general",
        "rule",
        "rulesfor",
        "example",
        "law",
        "reflection",
        "refraction",
        "light",
        "law",
        "mariotte",
        "gaylussac",
        "regarding",
        "volume",
        "gasesare",
        "evidently",
        "nothing",
        "general",
        "idea",
        "various",
        "phenomenon",
        "belong",
        "connected",
        "together",
        "finding",
        "office",
        "experimental",
        "portion",
        "science",
        "theoretic",
        "portion",
        "seek",
        "contrary",
        "evolve",
        "unknown",
        "cause",
        "process",
        "visible",
        "action",
        "present",
        "seek",
        "comprehend",
        "process",
        "according",
        "law",
        "causality",
        "helmholtz",
        "cited",
        "königsberger",
        "philosophical",
        "implication",
        "helmholtz",
        "work",
        "conservation",
        "energy",
        "see",
        "bevilacqua",
        "hyder",
        "bevilacqua",
        "investigates",
        "two",
        "matter",
        "hemholtz",
        "synthesis",
        "earlier",
        "work",
        "single",
        "principle",
        "methodological",
        "distinction",
        "evident",
        "citation",
        "theoretical",
        "experimental",
        "physic",
        "hyder",
        "investigates",
        "helmholtz",
        "argument",
        "essay",
        "force",
        "function",
        "must",
        "definable",
        "regard",
        "relative",
        "position",
        "masspoints",
        "comprising",
        "physical",
        "system",
        "hyder",
        "marshalling",
        "kantian",
        "antecedent",
        "argument",
        "hyder",
        "maintains",
        "helmholtz",
        "response",
        "criticism",
        "conservation",
        "force",
        "clausius",
        "influenced",
        "helmholtz",
        "later",
        "work",
        "geometry",
        "hyder",
        "analysis",
        "helmholtz",
        "radical",
        "critique",
        "kantian",
        "geometry",
        "context",
        "helmholtz",
        "retention",
        "transcendental",
        "element",
        "physic",
        "especially",
        "respect",
        "relationship",
        "geometry",
        "empirical",
        "determinacy",
        "contrast",
        "edward",
        "jurkowitz",
        "argues",
        "already",
        "über",
        "die",
        "erhaltung",
        "der",
        "kraft",
        "one",
        "may",
        "find",
        "important",
        "aspect",
        "helmholtz",
        "later",
        "empiricism",
        "p"
    ]
}