{
    "main_text": "Historiography and the philosophy of history\n4. Historiography and the philosophy of history\n\nWhen historians discuss methodological issues in their research they\nmore commonly refer to “historiography” than to\n“philosophy of history.” What is the relation between\nthese bodies of thought about the writing of history? We should begin\nby asking the basic question: what is historiography? In its most\ngeneral sense, the term refers to the study of historians’\nmethods and practices. Any intellectual or creative practice is guided\nby a set of standards and heuristics about how to proceed, and\n“experts” evaluate the performances of practitioners based\non their judgments of how well the practitioner meets the standards.\nSo one task we always have in considering an expert activity is to\nattempt to identify these standards and criteria of good performance.\nThis is true for theatre and literature, and it is true for writing\nhistory. Historiography is at least in part the effort to do this work\nfor a particular body of historical writing. (Several handbooks\ncontain a wealth of recent writings on various aspects of\nhistoriography; Tucker 2009, Bentley 1997, Breisach 2007. Important\nand innovative contributions to understanding the intellectual tasks\nof the historian include Bloch 1953 and Paul 2015.)\n\nHistorians normally make truth claims, and they ask us to accept those\nclaims based on the reasoning they present. So a major aspect of the\nstudy of historiography has to do with defining the ideas of\nevidence, rigor, and standards of reasoning for historical\ninquiry. We presume that historians want to discover empirically\nsupported truths about the past, and we presume that they want to\noffer inferences and interpretations that are somehow regulated by\nstandards of scientific rationality. (Simon Schama challenges some of\nthese ideas in Dead Certainties (Schama 1991).) So the\napprentice practitioner seeks to gain knowledge of the practices of\nhis/her elders in the profession: what counts as a compelling\nargument, how to assess a body of archival evidence, how to offer or\ncriticize an interpretation of complex events that necessarily exceeds\nthe available evidence. The historiographer has a related task: he/she\nwould like to be able to codify the main methods and standards of one\nhistorical school or another.\n\nThere are other desiderata governing a good historical work, and these\ncriteria may change from culture to culture and epoch to epoch.\nDiscerning the historian’s goals is crucial to deciding how well\nhe or she succeeds. So discovering these stylistic and aesthetic\nstandards that guide the historian’s work is itself an important\ntask for historiography. This means that the student of historiography\nwill naturally be interested in the conventions of historical\nwriting and rhetoric that are characteristic of a given period or\nschool.\n\nA full historiographic assessment of a given historian might include\nquestions like these: What methods of discovery does he/she use? What\nrhetorical and persuasive goals does he/she pursue? What models of\nexplanation? What paradigm of presentation? What standards of style\nand rhetoric? What interpretive assumptions?\n\nA historical school might be defined as a group of interrelated\nhistorians who share a significant number of specific assumptions\nabout evidence, explanation, and narrative. The Annales\nschool, established by Marc Bloch and Lucien Febvre in the 1920s,\nrepresented a distinctive and fertile approach to social history\n(Burguière 2009), united by shared assumptions about both\ntopics and intellectual approaches to the past. Historiography becomes\nitself historical when we recognize that frameworks of assumptions\nabout historical knowledge and reasoning change over time. On this\nassumption, the history of historical thinking and writing is itself\nan important subject. How did historians of various periods in human\nhistory conduct their study and presentation of history? Under this\nrubric we find books on the historiography of the ancient Greeks;\nRenaissance historiography; or the historiography of German\nromanticism. Arnaldo Momigliano’s writings on the ancient\nhistorians fall in this category (Momigliano 1990). In a nutshell,\nMomigliano is looking at the several traditions of ancient\nhistory-writing as a set of normative practices that can be dissected\nand understood in their specificity and their cultural contexts.\n\nA second primary use of the concept of historiography is more\npresent-oriented and methodological. It involves the study and\nanalysis of historical methods of research, inquiry, inference, and\npresentation used by more-or-less contemporary historians. How do\ncontemporary historians go about their tasks of understanding the\npast? Here we can reflect upon the historiographical challenges that\nconfronted Philip Huang as he investigated the Chinese peasant economy\nin the 1920s and 1930s (Huang 1990), or the historiographical issues\nraised in Robert Darnton’s telling of a peculiar and trivial\nevent, the Great Cat Massacre by printers’ apprentices in\nParis in the 1730s (Darnton 1984). Sometimes these issues have to do\nwith the scarcity or bias in the available bodies of historical\nrecords (for example, the fact that much of what Huang refers to about\nthe village economy of North China was gathered by the research teams\nof the occupying Japanese army). Sometimes they have to do with the\ndifficulty of interpreting historical sources (for example, the\nunavoidable necessity Darnton faced of providing meaningful\ninterpretation of a range of documented actions that appear\nfundamentally irrational).\n\nAn important question that arises in recent historiography is that of\nthe status of the notion of “global history.” One\nimportant reason for thinking globally as an historian is the fact\nthat the history discipline—since the Greeks—has tended to\nbe Eurocentric in its choice of topics, framing assumptions, and\nmethods. Economic and political history, for example, often privileges\nthe industrial revolution in England and the creation of the modern\nbureaucratic state in France, Britain, and Germany, as being exemplars\nof “modern” development in economics and politics. This\nhas led to a tendency to look at other countries’ development as\nnon-standard or stunted. So global history is, in part, a framework\nwithin which the historian avoids privileging one regional center as\nprimary and others as secondary or peripheral. Bin Wong makes this\npoint in China Transformed (Wong 1997).\n\nSecond is the related fact that when Western historical\nthinkers—for example, Hegel, Malthus, Montesquieu—have\nturned their attention to Asia, they have often engaged in a high\ndegree of stereotyping without much factual historical knowledge. The\nideas of Oriental despotism, Asian overpopulation, and Chinese\nstagnation have encouraged a cartoonish replacement of the intricate\nand diverse processes of development of different parts of Asia by a\nsingle-dimensional and reductive set of simplifying frameworks of\nthought. This is one of the points of Edward Said’s critique of\norientalism (Said 1978). So doing “global” history means\npaying rigorous attention to the specificities of social, political,\nand cultural arrangements in other parts of the world besides\nEurope.\n\nSo a historiography that takes global diversity seriously should be\nexpected to be more agnostic about patterns of development, and more\nopen to discovery of surprising patterns, twists, and variations in\nthe experiences of India, China, Indochina, the Arab world, the\nOttoman Empire, and Sub-Saharan Africa. Variation and complexity are\nwhat we should expect, not stereotyped simplicity. Clifford\nGeertz’s historical reconstruction of the “theatre\nstate” of Bali is a case in point—he uncovers a complex\nsystem of governance, symbol, value, and hierarchy that represents a\nsubstantially different structure of politics than the models derived\nfrom the emergence of bureaucratic states in early modern Europe\n(Geertz 1980). A global history needs to free itself from\nEurocentrism.\n\nThis step away from Eurocentrism in outlook should also be accompanied\nby a broadening of the geographical range of what is historically\ninteresting. So a global history ought to be global and trans-national\nin its selection of topics—even while recognizing the fact that\nall historical research is selective. A globally oriented historian\nwill recognize that the political systems of classical India are as\ninteresting and complex as the organization of the Roman Republic.\n\nAn important current underlying much work in global history is the\nreality of colonialism through the nineteenth and twentieth centuries,\nand the equally important reality of anti-colonial struggles and\nnation building in the 1960s and 1970s. “The world” was\nimportant in the early-modern capitals of Great Britain, France,\nGermany, and Belgium because those nations exerted colonial rule in\nvarious parts of Africa, Asia, and South America. So there was a\nspecific interest in gaining certain kinds of knowledge about those\nsocieties—in order to better govern them and exploit them. And\npost-colonial states had a symmetrical interest in supporting global\nhistoriography in their own universities and knowledge systems, in\norder to better understand and better critique the forming relations\nof the past.\n\nA final way in which history needs to become global is to incorporate\nthe perspectives and historical traditions of historians in\nnon-western countries into the mainstream of discussion of major world\ndevelopments. Indian and Chinese historians have their own\nintellectual traditions in conducting historical research and\nexplanation; a global history is one that pays attention to the\ninsights and arguments of these traditions. So global historiography\nhas to do with a broadened definition of the arena of historical\nchange to include Europe, Asia, Africa, the Middle East, and the\nAmericas; a recognition of the complexity and sophistication of\ninstitutions and systems in many parts of the world; a recognition of\nthe trans-national interrelatedness that has existed among continents\nfor at least four centuries; and a recognition of the complexity and\ndistinctiveness of different national traditions of historiography\n\nDominic Sachsenmaier provides a significant recent discussion of some\nof these issues (Sachsenmaier 2011). Sachsenmaier devotes much of his\nattention to the last point mentioned here, the “multiple global\nperspectives” point. He wants to take this idea seriously and\ntry to discover some of the implications of different national\ntraditions of academic historiography. He writes, “It will\nbecome quite clear that in European societies the question of\nhistoriographical traditions tended to be answered in ways that were\nprofoundly different from most academic communities in other parts of\nthe world” (17).\n\nAs should be clear from these remarks, there is a degree of overlap\nbetween historiography and the philosophy of history in the fact that\nboth are concerned with identifying and evaluating the standards of\nreasoning that are used in various historical traditions. That said,\nhistoriography is generally more descriptive and less evaluative than\nthe philosophy of history. And it is more concerned with the specifics\nof research and writing than is the philosophy of history.\n",
    "section_title": "4. Historiography and the philosophy of history",
    "entry_title": "Philosophy of History",
    "hierarchy_title": "Philosophy of History || Historiography and the philosophy of history",
    "tokenized_text": [
        "historiography",
        "philosophy",
        "history",
        "historiography",
        "philosophy",
        "history",
        "historian",
        "discus",
        "methodological",
        "issue",
        "research",
        "commonly",
        "refer",
        "historiography",
        "philosophy",
        "history",
        "relation",
        "body",
        "thought",
        "writing",
        "history",
        "begin",
        "asking",
        "basic",
        "question",
        "historiography",
        "general",
        "sense",
        "term",
        "refers",
        "study",
        "historian",
        "method",
        "practice",
        "intellectual",
        "creative",
        "practice",
        "guided",
        "set",
        "standard",
        "heuristic",
        "proceed",
        "expert",
        "evaluate",
        "performance",
        "practitioner",
        "based",
        "judgment",
        "well",
        "practitioner",
        "meet",
        "standard",
        "one",
        "task",
        "always",
        "considering",
        "expert",
        "activity",
        "attempt",
        "identify",
        "standard",
        "criterion",
        "good",
        "performance",
        "true",
        "theatre",
        "literature",
        "true",
        "writing",
        "history",
        "historiography",
        "least",
        "part",
        "effort",
        "work",
        "particular",
        "body",
        "historical",
        "writing",
        "several",
        "handbook",
        "contain",
        "wealth",
        "recent",
        "writing",
        "various",
        "aspect",
        "historiography",
        "tucker",
        "bentley",
        "breisach",
        "important",
        "innovative",
        "contribution",
        "understanding",
        "intellectual",
        "task",
        "historian",
        "include",
        "bloch",
        "paul",
        "historian",
        "normally",
        "make",
        "truth",
        "claim",
        "ask",
        "u",
        "accept",
        "claim",
        "based",
        "reasoning",
        "present",
        "major",
        "aspect",
        "study",
        "historiography",
        "defining",
        "idea",
        "evidence",
        "rigor",
        "standard",
        "reasoning",
        "historical",
        "inquiry",
        "presume",
        "historian",
        "want",
        "discover",
        "empirically",
        "supported",
        "truth",
        "past",
        "presume",
        "want",
        "offer",
        "inference",
        "interpretation",
        "somehow",
        "regulated",
        "standard",
        "scientific",
        "rationality",
        "simon",
        "schama",
        "challenge",
        "idea",
        "dead",
        "certainty",
        "schama",
        "apprentice",
        "practitioner",
        "seek",
        "gain",
        "knowledge",
        "practice",
        "hisher",
        "elder",
        "profession",
        "count",
        "compelling",
        "argument",
        "ass",
        "body",
        "archival",
        "evidence",
        "offer",
        "criticize",
        "interpretation",
        "complex",
        "event",
        "necessarily",
        "exceeds",
        "available",
        "evidence",
        "historiographer",
        "related",
        "task",
        "heshe",
        "would",
        "like",
        "able",
        "codify",
        "main",
        "method",
        "standard",
        "one",
        "historical",
        "school",
        "another",
        "desideratum",
        "governing",
        "good",
        "historical",
        "work",
        "criterion",
        "may",
        "change",
        "culture",
        "culture",
        "epoch",
        "epoch",
        "discerning",
        "historian",
        "goal",
        "crucial",
        "deciding",
        "well",
        "succeeds",
        "discovering",
        "stylistic",
        "aesthetic",
        "standard",
        "guide",
        "historian",
        "work",
        "important",
        "task",
        "historiography",
        "mean",
        "student",
        "historiography",
        "naturally",
        "interested",
        "convention",
        "historical",
        "writing",
        "rhetoric",
        "characteristic",
        "given",
        "period",
        "school",
        "full",
        "historiographic",
        "assessment",
        "given",
        "historian",
        "might",
        "include",
        "question",
        "like",
        "method",
        "discovery",
        "heshe",
        "use",
        "rhetorical",
        "persuasive",
        "goal",
        "heshe",
        "pursue",
        "model",
        "explanation",
        "paradigm",
        "presentation",
        "standard",
        "style",
        "rhetoric",
        "interpretive",
        "assumption",
        "historical",
        "school",
        "might",
        "defined",
        "group",
        "interrelated",
        "historian",
        "share",
        "significant",
        "number",
        "specific",
        "assumption",
        "evidence",
        "explanation",
        "narrative",
        "annales",
        "school",
        "established",
        "marc",
        "bloch",
        "lucien",
        "febvre",
        "s",
        "represented",
        "distinctive",
        "fertile",
        "approach",
        "social",
        "history",
        "burguière",
        "united",
        "shared",
        "assumption",
        "topic",
        "intellectual",
        "approach",
        "past",
        "historiography",
        "becomes",
        "historical",
        "recognize",
        "framework",
        "assumption",
        "historical",
        "knowledge",
        "reasoning",
        "change",
        "time",
        "assumption",
        "history",
        "historical",
        "thinking",
        "writing",
        "important",
        "subject",
        "historian",
        "various",
        "period",
        "human",
        "history",
        "conduct",
        "study",
        "presentation",
        "history",
        "rubric",
        "find",
        "book",
        "historiography",
        "ancient",
        "greek",
        "renaissance",
        "historiography",
        "historiography",
        "german",
        "romanticism",
        "arnaldo",
        "momigliano",
        "writing",
        "ancient",
        "historian",
        "fall",
        "category",
        "momigliano",
        "nutshell",
        "momigliano",
        "looking",
        "several",
        "tradition",
        "ancient",
        "historywriting",
        "set",
        "normative",
        "practice",
        "dissected",
        "understood",
        "specificity",
        "cultural",
        "context",
        "second",
        "primary",
        "use",
        "concept",
        "historiography",
        "presentoriented",
        "methodological",
        "involves",
        "study",
        "analysis",
        "historical",
        "method",
        "research",
        "inquiry",
        "inference",
        "presentation",
        "used",
        "moreorless",
        "contemporary",
        "historian",
        "contemporary",
        "historian",
        "go",
        "task",
        "understanding",
        "past",
        "reflect",
        "upon",
        "historiographical",
        "challenge",
        "confronted",
        "philip",
        "huang",
        "investigated",
        "chinese",
        "peasant",
        "economy",
        "s",
        "s",
        "huang",
        "historiographical",
        "issue",
        "raised",
        "robert",
        "darnton",
        "telling",
        "peculiar",
        "trivial",
        "event",
        "great",
        "cat",
        "massacre",
        "printer",
        "apprentice",
        "paris",
        "s",
        "darnton",
        "sometimes",
        "issue",
        "scarcity",
        "bias",
        "available",
        "body",
        "historical",
        "record",
        "example",
        "fact",
        "much",
        "huang",
        "refers",
        "village",
        "economy",
        "north",
        "china",
        "gathered",
        "research",
        "team",
        "occupying",
        "japanese",
        "army",
        "sometimes",
        "difficulty",
        "interpreting",
        "historical",
        "source",
        "example",
        "unavoidable",
        "necessity",
        "darnton",
        "faced",
        "providing",
        "meaningful",
        "interpretation",
        "range",
        "documented",
        "action",
        "appear",
        "fundamentally",
        "irrational",
        "important",
        "question",
        "arises",
        "recent",
        "historiography",
        "status",
        "notion",
        "global",
        "history",
        "one",
        "important",
        "reason",
        "thinking",
        "globally",
        "historian",
        "fact",
        "history",
        "disciplinesince",
        "greekshas",
        "tended",
        "eurocentric",
        "choice",
        "topic",
        "framing",
        "assumption",
        "method",
        "economic",
        "political",
        "history",
        "example",
        "often",
        "privilege",
        "industrial",
        "revolution",
        "england",
        "creation",
        "modern",
        "bureaucratic",
        "state",
        "france",
        "britain",
        "germany",
        "exemplar",
        "modern",
        "development",
        "economics",
        "politics",
        "led",
        "tendency",
        "look",
        "country",
        "development",
        "nonstandard",
        "stunted",
        "global",
        "history",
        "part",
        "framework",
        "within",
        "historian",
        "avoids",
        "privileging",
        "one",
        "regional",
        "center",
        "primary",
        "others",
        "secondary",
        "peripheral",
        "bin",
        "wong",
        "make",
        "point",
        "china",
        "transformed",
        "wong",
        "second",
        "related",
        "fact",
        "western",
        "historical",
        "thinkersfor",
        "example",
        "hegel",
        "malthus",
        "montesquieuhave",
        "turned",
        "attention",
        "asia",
        "often",
        "engaged",
        "high",
        "degree",
        "stereotyping",
        "without",
        "much",
        "factual",
        "historical",
        "knowledge",
        "idea",
        "oriental",
        "despotism",
        "asian",
        "overpopulation",
        "chinese",
        "stagnation",
        "encouraged",
        "cartoonish",
        "replacement",
        "intricate",
        "diverse",
        "process",
        "development",
        "different",
        "part",
        "asia",
        "singledimensional",
        "reductive",
        "set",
        "simplifying",
        "framework",
        "thought",
        "one",
        "point",
        "edward",
        "said",
        "critique",
        "orientalism",
        "said",
        "global",
        "history",
        "mean",
        "paying",
        "rigorous",
        "attention",
        "specificity",
        "social",
        "political",
        "cultural",
        "arrangement",
        "part",
        "world",
        "besides",
        "europe",
        "historiography",
        "take",
        "global",
        "diversity",
        "seriously",
        "expected",
        "agnostic",
        "pattern",
        "development",
        "open",
        "discovery",
        "surprising",
        "pattern",
        "twist",
        "variation",
        "experience",
        "india",
        "china",
        "indochina",
        "arab",
        "world",
        "ottoman",
        "empire",
        "subsaharan",
        "africa",
        "variation",
        "complexity",
        "expect",
        "stereotyped",
        "simplicity",
        "clifford",
        "geertz",
        "historical",
        "reconstruction",
        "theatre",
        "state",
        "bali",
        "case",
        "pointhe",
        "uncovers",
        "complex",
        "system",
        "governance",
        "symbol",
        "value",
        "hierarchy",
        "represents",
        "substantially",
        "different",
        "structure",
        "politics",
        "model",
        "derived",
        "emergence",
        "bureaucratic",
        "state",
        "early",
        "modern",
        "europe",
        "geertz",
        "global",
        "history",
        "need",
        "free",
        "eurocentrism",
        "step",
        "away",
        "eurocentrism",
        "outlook",
        "also",
        "accompanied",
        "broadening",
        "geographical",
        "range",
        "historically",
        "interesting",
        "global",
        "history",
        "ought",
        "global",
        "transnational",
        "selection",
        "topicseven",
        "recognizing",
        "fact",
        "historical",
        "research",
        "selective",
        "globally",
        "oriented",
        "historian",
        "recognize",
        "political",
        "system",
        "classical",
        "india",
        "interesting",
        "complex",
        "organization",
        "roman",
        "republic",
        "important",
        "current",
        "underlying",
        "much",
        "work",
        "global",
        "history",
        "reality",
        "colonialism",
        "nineteenth",
        "twentieth",
        "century",
        "equally",
        "important",
        "reality",
        "anticolonial",
        "struggle",
        "nation",
        "building",
        "s",
        "s",
        "world",
        "important",
        "earlymodern",
        "capital",
        "great",
        "britain",
        "france",
        "germany",
        "belgium",
        "nation",
        "exerted",
        "colonial",
        "rule",
        "various",
        "part",
        "africa",
        "asia",
        "south",
        "america",
        "specific",
        "interest",
        "gaining",
        "certain",
        "kind",
        "knowledge",
        "societiesin",
        "order",
        "better",
        "govern",
        "exploit",
        "postcolonial",
        "state",
        "symmetrical",
        "interest",
        "supporting",
        "global",
        "historiography",
        "university",
        "knowledge",
        "system",
        "order",
        "better",
        "understand",
        "better",
        "critique",
        "forming",
        "relation",
        "past",
        "final",
        "way",
        "history",
        "need",
        "become",
        "global",
        "incorporate",
        "perspective",
        "historical",
        "tradition",
        "historian",
        "nonwestern",
        "country",
        "mainstream",
        "discussion",
        "major",
        "world",
        "development",
        "indian",
        "chinese",
        "historian",
        "intellectual",
        "tradition",
        "conducting",
        "historical",
        "research",
        "explanation",
        "global",
        "history",
        "one",
        "pay",
        "attention",
        "insight",
        "argument",
        "tradition",
        "global",
        "historiography",
        "broadened",
        "definition",
        "arena",
        "historical",
        "change",
        "include",
        "europe",
        "asia",
        "africa",
        "middle",
        "east",
        "america",
        "recognition",
        "complexity",
        "sophistication",
        "institution",
        "system",
        "many",
        "part",
        "world",
        "recognition",
        "transnational",
        "interrelatedness",
        "existed",
        "among",
        "continent",
        "least",
        "four",
        "century",
        "recognition",
        "complexity",
        "distinctiveness",
        "different",
        "national",
        "tradition",
        "historiography",
        "dominic",
        "sachsenmaier",
        "provides",
        "significant",
        "recent",
        "discussion",
        "issue",
        "sachsenmaier",
        "sachsenmaier",
        "devotes",
        "much",
        "attention",
        "last",
        "point",
        "mentioned",
        "multiple",
        "global",
        "perspective",
        "point",
        "want",
        "take",
        "idea",
        "seriously",
        "try",
        "discover",
        "implication",
        "different",
        "national",
        "tradition",
        "academic",
        "historiography",
        "writes",
        "become",
        "quite",
        "clear",
        "european",
        "society",
        "question",
        "historiographical",
        "tradition",
        "tended",
        "answered",
        "way",
        "profoundly",
        "different",
        "academic",
        "community",
        "part",
        "world",
        "clear",
        "remark",
        "degree",
        "overlap",
        "historiography",
        "philosophy",
        "history",
        "fact",
        "concerned",
        "identifying",
        "evaluating",
        "standard",
        "reasoning",
        "used",
        "various",
        "historical",
        "tradition",
        "said",
        "historiography",
        "generally",
        "descriptive",
        "le",
        "evaluative",
        "philosophy",
        "history",
        "concerned",
        "specific",
        "research",
        "writing",
        "philosophy",
        "history"
    ]
}