{
    "main_text": "The Rights of Women || Women’s Rights within Republican Constitutions\n4.1 Women’s Rights within Republican Constitutions\n\nThe Second Letter of Lettres d’un bourgeois de Newhaven à\nun citoyen de Virginie [Letters from a Freeman of New Haven to a\nCitizen of Virginia on the Futility of Dividing the Legislative Power\namong Several Bodies] (1787) defends the justice of a single\nlegislative body, against the American preference for a bicameral\nlegislature (McLean and Hewitt 1994,\n 292–334).[17]\n Here Condorcet addresses the scope and limits of a “peaceful,\nfree and lasting constitution”, in light of the principle of\nnatural rights, which he proceeds to define:\n\n\nThese rights are called natural because they derive from the\nnature of man; because it is a clear and necessary consequence of the\nvery fact that a sentient being capable of reason and moral ideas\nexists that he must enjoy these rights and could not justly be\ndeprived of them. (McLean and Hewitt 1994, 297)\n\n\nFrom natural rights, inherent in each person as a morally conscious\nbeing, Condorcet derives civil rights, including “the right to\nvote on matters of common interest, either in person or through freely\nelected representatives”, as well as the true meaning of a\nrepublican form of government, in which the interests of its citizens\ncorrespond with the general interest. Therefore, he argues, a\n\n\nstate in which some of the inhabitants, or at least some of the\nlandowners, are deprived of these rights ceases to be free … It\nis no longer a true republic [and] having said this, it is also true\nto say that no true republic has ever existed.\n\n\nHowever, having defined the conditions of republican constitution,\nCondorcet goes further to discuss sexual discrimination, observing\nthat if government is to be consistent with the principles of reason\nand justice, then there are no grounds for denying equal rights for\nwomen:\n\n\nIf we agree that men have rights simply by virtue of being capable of\nreason and moral ideas, then women should have precisely the same\nrights. Yet never in any so-called free constitution have women had\nthe right of citizenship. (McLean and Hewitt 1994, 297)\n\n\nFurthermore, he states, if\n\n\nthe right of citizenship requires that a person can act according to\nhis own free will [then, in his opinion] any civil law which\nestablishes sufficient inequality between men and women for the latter\nto be supposed incapable of free will would simply increase the\ninjustice. (McLean and Hewitt 1994, 297–98)\n\n\nOn the basis of natural rights, Condorcet moves immediately to tackle\nthe question of political representation, as it concerns all women as\nwell as the particular circumstances of married women. Alluding to the\nEnglish principle of no taxation without representation, as\npopularized in France in Jean-Louis Delolme’s 1771 Constitution\nd’Angleterre [Constitution of England], Condorcet insists that\n“all women have the right to refuse to pay taxes levied by\nparliaments”; adding that he has found no “substantial\narguments against these points, at least as far as widows and\nunmarried women are concerned” (McLean and Hewitt 1994, 297).\nHowever, while unmarried women and widows might be admitted to\npolitical rights, the much thornier problem of married women’s rights\nremains to be tackled. Condorcet confronts the question head-on,\nknowing that even English law, to which he has just appealed, is\nstrongly prejudiced against married women. Under English common law,\nan unmarried adult was considered to have the legal status of a\nfeme sole (in law book French), while a married woman had the\nstatus of a feme covert. Colloquially speaking, husband and\nwife were one person as far as the law was concerned, and that person\nwas the husband. Women were restricted from owning property, signing\nlegal documents, entering into contracts, obtaining an education, or\nkeeping her own salary, without her husband’s permission. In\npre-revolutionary France, as the historian Dominique Godineau (1998,\nxix) points out, women were likewise conceptualized according to their\nroles as mothers and spouses, thereby “placed outside of the\npublic and hence outside of the city”. The same was true of\ntheir position in the Encyclopédie, she observes,\nwhere Diderot considers that the (masculine) word\ncitoyen— that is, one who possesses political\nrights—is only attributable “to women, young children, or\nto servants as one would [refer] to the members of a family of a\ncitizen in the strict sense of the word; they aren’t really\ncitizens”. Thus, in pre-revolutionary France political\nindividuals represented families (including family servants, where\napplicable), not merely themselves. In short, if rights inhered in\nindependent persons, then according to tradition and legal reasoning,\na woman was not strictly speaking a legal personality. A woman’s legal\nrights were merged with those of her husband (and prior to marriage,\nwith her father). A married woman counted for nothing before the law;\nand therefore could not count as a citizen whose natural rights had to\nbe respected by the state.\n\nWith respect to the issue of who is authorized to represent the\nfamily, and the practice whereby only men are granted this\nprerogative, Condorcet makes a simple observation: If marriage is\n“a society of two people”, it admits of only one condition\nunder which a necessary inequality be allowed, that is, “the\nneed for someone to have a casting vote on the rare occasions when the\ndifferent opinions cannot be allowed to act simultaneously, while at\nthe same time the need to act quickly means that we cannot wait for\nthe parties to come to an agreement” (McLean and Hewitt 1994,\n298). However, even in these circumstances, Condorcet insists that\nthere need be no permanent inequality introduced between the spouses.\nHe would instead divide and rotate the prerogative, giving\n“either men or women the casting vote for matters in which one\nor the other is more likely to express a will which conforms to\nreason”. He also reminds his readers that greater equality\nbetween spouses is “not as new as we might imagine”, for\nRoman women were granted by Emperor Julian the right to initiate\ndivorce proceedings against their spouses. On this point, Condorcet\ncannot resist a witticism: “Perhaps the least gallant of the\nCaesars was the most just toward women”, he proposes (McLean and\nHewitt 1994, 298).\n\nThe principle of justice requires that “we stop debarring women\nfrom the right of citizenship”. What then of women’s eligibility\nfor public functions? In this section of the Second Letter, Condorcet\nconsiders the grounds for excluding women as voters and as public\nfunctionaries, and prepares the argument that will reappear in his\n1790 essay. He refers first to the principle of utility: “Legal\nexclusions should therefore be made only when reason clearly proves\ntheir utility” (McLean and Hewitt 1994, 298). A “good\nelection method” would allow, he maintains, for the elimination\nof persons tried and found guilty of certain crimes, as well as two\ncategories of dependent persons, those in domestic service and those\nbelow the mandated age of civil majority. Except in one important\nrespect, his criteria for the exclusion of these categories of person\nare consistent with eighteenth-century republican assumptions, which\nultimately guided the drafters of the 1791 Constitution, who divided\nthe population into active and passive citizenship. Only the\nformer—approximately 15% of the French population and 61% of men\n(approximately 4, 298,360)—possessed the full rights of\ncitizenship. They had to be males 25 years or older, who had occupied\nthe same residence for at least one year, and had paid the equivalent\nof 3 days of salary. By the terms of France’s first post-1789\nConstitution, all women were assigned the status of passive citizens;\nand French women did not achieve full citizenship until 1944. In\ncontrast, even before the French Revolution Condorcet had opposed the\npassage of laws expressly excluding women, even from posts in the\nmilitary or magistracy. Instead of legal prohibitions he looks to\ncivil law and education to support women’s participation. He\nunderscores the role to be played by education in countering the\nlimitations attributed to woman’s physical and intellectual\nlimitations, maintaining:\n\n\nthe female constitution means that they would make unsuitable soldiers\nand, for some of their lives, debars them from posts which require\nhard work on a daily basis. Pregnancy, childbirth and breast-feeding\nwould prevent them from fulfilling these functions. But I believe all\nother differences between men and women are simply the result of\neducation. (McLean and Hewitt 1994, 299)\n\n\nEducation not nature is deemed to be the cause of women’s inferiority\nand her presumed unsuitability for given social roles and tasks. Only\nin certain limited circumstances, or at certain periods of time, are\nphysical limitations a factor. Condorcet believes that women are not\nintellectually inferior to men; rather, they are victims of an\ninferior education. “Even if we agree that women might still not\nhave the same mental or physical power as men, this would mean simply\nthat the best women were equal to the second-best men, better than the\nthird best, and so on” (McLean and Hewitt 1994, 299).\nComplementing Voltaire for what he takes to be the\nphilosophe’s generally enlightened views toward women,\nCondorcet nonetheless disputes the latter’s reservations about women’s\ngenius and inventiveness. For one thing, he insists, “if posts\ncould be filled only by men capable of invention, many would remain\nvacant, even in academies. On the contrary, for a great many posts, it\nis not even in the interests of the public that the time of a man of\ngenius be sacrificed”. Appealing further to the genius of two\nwomen of letters, Mme de Sévigné and Mme de la Fayette,\nhe only concedes that women might not equal men in the very highest\ndomains of science and philosophy—an odd admission since\nCondorcet might well have raised in this regard the example of\nVoltaire’s own lover, the brilliant Newtonian Mme de Chatelet.\n\nThere are two other references to women in the Second Letter. In a\ndiscussion of what could be termed military and foreign affairs,\nCondorcet compares the unjust treatment of women to the position of\nsubject populations within republics: in such circumstances,\n“they cannot speak of freedom as a right” (McLean and\nHewitt 1994, 312). In another passage, Condorcet sums up and defends\nhimself against the charge of triviality concerning the arguments he\nhas made on behalf of women’s rights: “This examination may seem\nvery long”, he writes, “but we are discussing the rights\nof half of the human race which have been neglected by all\nlegislators. Besides, it cannot harm men’s freedom to show how to\novercome the only possible objection against republics, and to mark\nout a real difference between them and States which are not\nfree”. But tellingly, men are not the only audience Condorcet\nfears may deride his arguments: he worries about women’s reactions,\nsince they have been led astray by none other than Jean-Jacques\nRousseau’s enticements to remain in the domestic sphere (McLean and\nHewitt 1994, 299).\n\nEven a philosopher finds it hard not to get a little carried away when\ndiscussing women. However, I fear that I shall fall foul of them if\never they read this article. I have discussed their right to equality\nand not their influence, and so might be suspected of secretly wishing\nto decrease this influence. And since Rousseau gained their support by\nsaying that they were made simply to look after us and were fit only\nto torment us, I should not expect their support. But truth is a good\nthing, even if I lay myself open to ridicule by speaking it. (McLean\nand Hewitt 1994, 299)\n\n",
    "section_title": "4.1 Women’s Rights within Republican Constitutions",
    "entry_title": "The History of Feminism: Marie-Jean-Antoine-Nicolas de Caritat, Marquis de Condorcet",
    "hierarchy_title": "The History of Feminism: Marie-Jean-Antoine-Nicolas de Caritat, Marquis de Condorcet || The Rights of Women || Women’s Rights within Republican Constitutions",
    "tokenized_text": [
        "right",
        "woman",
        "woman",
        "right",
        "within",
        "republican",
        "constitution",
        "woman",
        "right",
        "within",
        "republican",
        "constitution",
        "second",
        "letter",
        "lettres",
        "un",
        "bourgeois",
        "de",
        "newhaven",
        "à",
        "un",
        "citoyen",
        "de",
        "virginie",
        "letter",
        "freeman",
        "new",
        "citizen",
        "virginia",
        "futility",
        "dividing",
        "legislative",
        "power",
        "among",
        "several",
        "body",
        "defends",
        "justice",
        "single",
        "legislative",
        "body",
        "american",
        "preference",
        "bicameral",
        "legislature",
        "mclean",
        "hewitt",
        "condorcet",
        "address",
        "scope",
        "limit",
        "peaceful",
        "free",
        "lasting",
        "constitution",
        "light",
        "principle",
        "natural",
        "right",
        "proceeds",
        "define",
        "right",
        "called",
        "natural",
        "derive",
        "nature",
        "man",
        "clear",
        "necessary",
        "consequence",
        "fact",
        "sentient",
        "capable",
        "reason",
        "moral",
        "idea",
        "exists",
        "must",
        "enjoy",
        "right",
        "could",
        "justly",
        "deprived",
        "mclean",
        "hewitt",
        "natural",
        "right",
        "inherent",
        "person",
        "morally",
        "conscious",
        "condorcet",
        "derives",
        "civil",
        "right",
        "including",
        "right",
        "vote",
        "matter",
        "common",
        "interest",
        "either",
        "person",
        "freely",
        "elected",
        "representative",
        "well",
        "true",
        "meaning",
        "republican",
        "form",
        "government",
        "interest",
        "citizen",
        "correspond",
        "general",
        "interest",
        "therefore",
        "argues",
        "state",
        "inhabitant",
        "least",
        "landowner",
        "deprived",
        "right",
        "cease",
        "free",
        "longer",
        "true",
        "republic",
        "said",
        "also",
        "true",
        "say",
        "true",
        "republic",
        "ever",
        "existed",
        "however",
        "defined",
        "condition",
        "republican",
        "constitution",
        "condorcet",
        "go",
        "discus",
        "sexual",
        "discrimination",
        "observing",
        "government",
        "consistent",
        "principle",
        "reason",
        "justice",
        "ground",
        "denying",
        "equal",
        "right",
        "woman",
        "agree",
        "men",
        "right",
        "simply",
        "virtue",
        "capable",
        "reason",
        "moral",
        "idea",
        "woman",
        "precisely",
        "right",
        "yet",
        "never",
        "socalled",
        "free",
        "constitution",
        "woman",
        "right",
        "citizenship",
        "mclean",
        "hewitt",
        "furthermore",
        "state",
        "right",
        "citizenship",
        "requires",
        "person",
        "act",
        "according",
        "free",
        "opinion",
        "civil",
        "law",
        "establishes",
        "sufficient",
        "inequality",
        "men",
        "woman",
        "latter",
        "supposed",
        "incapable",
        "free",
        "would",
        "simply",
        "increase",
        "injustice",
        "mclean",
        "hewitt",
        "basis",
        "natural",
        "right",
        "condorcet",
        "move",
        "immediately",
        "tackle",
        "question",
        "political",
        "representation",
        "concern",
        "woman",
        "well",
        "particular",
        "circumstance",
        "married",
        "woman",
        "alluding",
        "english",
        "principle",
        "taxation",
        "without",
        "representation",
        "popularized",
        "france",
        "jeanlouis",
        "delolme",
        "constitution",
        "angleterre",
        "constitution",
        "england",
        "condorcet",
        "insists",
        "woman",
        "right",
        "refuse",
        "pay",
        "tax",
        "levied",
        "parliament",
        "adding",
        "found",
        "substantial",
        "argument",
        "point",
        "least",
        "far",
        "widow",
        "unmarried",
        "woman",
        "concerned",
        "mclean",
        "hewitt",
        "however",
        "unmarried",
        "woman",
        "widow",
        "might",
        "admitted",
        "political",
        "right",
        "much",
        "thornier",
        "problem",
        "married",
        "woman",
        "right",
        "remains",
        "tackled",
        "condorcet",
        "confronts",
        "question",
        "headon",
        "knowing",
        "even",
        "english",
        "law",
        "appealed",
        "strongly",
        "prejudiced",
        "married",
        "woman",
        "english",
        "common",
        "law",
        "unmarried",
        "adult",
        "considered",
        "legal",
        "status",
        "feme",
        "sole",
        "law",
        "book",
        "french",
        "married",
        "woman",
        "status",
        "feme",
        "covert",
        "colloquially",
        "speaking",
        "husband",
        "wife",
        "one",
        "person",
        "far",
        "law",
        "concerned",
        "person",
        "husband",
        "woman",
        "restricted",
        "owning",
        "property",
        "signing",
        "legal",
        "document",
        "entering",
        "contract",
        "obtaining",
        "education",
        "keeping",
        "salary",
        "without",
        "husband",
        "permission",
        "prerevolutionary",
        "france",
        "historian",
        "dominique",
        "godineau",
        "xix",
        "point",
        "woman",
        "likewise",
        "conceptualized",
        "according",
        "role",
        "mother",
        "spouse",
        "thereby",
        "placed",
        "outside",
        "public",
        "hence",
        "outside",
        "city",
        "true",
        "position",
        "encyclopédie",
        "observes",
        "diderot",
        "considers",
        "masculine",
        "word",
        "citoyen",
        "one",
        "posse",
        "political",
        "rightsis",
        "attributable",
        "woman",
        "young",
        "child",
        "servant",
        "one",
        "would",
        "refer",
        "member",
        "family",
        "citizen",
        "strict",
        "sense",
        "word",
        "really",
        "citizen",
        "thus",
        "prerevolutionary",
        "france",
        "political",
        "individual",
        "represented",
        "family",
        "including",
        "family",
        "servant",
        "applicable",
        "merely",
        "short",
        "right",
        "inhered",
        "independent",
        "person",
        "according",
        "tradition",
        "legal",
        "reasoning",
        "woman",
        "strictly",
        "speaking",
        "legal",
        "personality",
        "woman",
        "legal",
        "right",
        "merged",
        "husband",
        "prior",
        "marriage",
        "father",
        "married",
        "woman",
        "counted",
        "nothing",
        "law",
        "therefore",
        "could",
        "count",
        "citizen",
        "whose",
        "natural",
        "right",
        "respected",
        "state",
        "respect",
        "issue",
        "authorized",
        "represent",
        "family",
        "practice",
        "whereby",
        "men",
        "granted",
        "prerogative",
        "condorcet",
        "make",
        "simple",
        "observation",
        "marriage",
        "society",
        "two",
        "people",
        "admits",
        "one",
        "condition",
        "necessary",
        "inequality",
        "allowed",
        "need",
        "someone",
        "casting",
        "vote",
        "rare",
        "occasion",
        "different",
        "opinion",
        "allowed",
        "act",
        "simultaneously",
        "time",
        "need",
        "act",
        "quickly",
        "mean",
        "wait",
        "party",
        "come",
        "agreement",
        "mclean",
        "hewitt",
        "however",
        "even",
        "circumstance",
        "condorcet",
        "insists",
        "need",
        "permanent",
        "inequality",
        "introduced",
        "spouse",
        "would",
        "instead",
        "divide",
        "rotate",
        "prerogative",
        "giving",
        "either",
        "men",
        "woman",
        "casting",
        "vote",
        "matter",
        "one",
        "likely",
        "express",
        "conforms",
        "reason",
        "also",
        "reminds",
        "reader",
        "greater",
        "equality",
        "spouse",
        "new",
        "might",
        "imagine",
        "roman",
        "woman",
        "granted",
        "emperor",
        "julian",
        "right",
        "initiate",
        "divorce",
        "proceeding",
        "spouse",
        "point",
        "condorcet",
        "resist",
        "witticism",
        "perhaps",
        "least",
        "gallant",
        "caesar",
        "toward",
        "woman",
        "proposes",
        "mclean",
        "hewitt",
        "principle",
        "justice",
        "requires",
        "stop",
        "debarring",
        "woman",
        "right",
        "citizenship",
        "woman",
        "eligibility",
        "public",
        "function",
        "section",
        "second",
        "letter",
        "condorcet",
        "considers",
        "ground",
        "excluding",
        "woman",
        "voter",
        "public",
        "functionary",
        "prepares",
        "argument",
        "reappear",
        "essay",
        "refers",
        "first",
        "principle",
        "utility",
        "legal",
        "exclusion",
        "therefore",
        "made",
        "reason",
        "clearly",
        "prof",
        "utility",
        "mclean",
        "hewitt",
        "good",
        "election",
        "method",
        "would",
        "allow",
        "maintains",
        "elimination",
        "person",
        "tried",
        "found",
        "guilty",
        "certain",
        "crime",
        "well",
        "two",
        "category",
        "dependent",
        "person",
        "domestic",
        "service",
        "mandated",
        "age",
        "civil",
        "majority",
        "except",
        "one",
        "important",
        "respect",
        "criterion",
        "exclusion",
        "category",
        "person",
        "consistent",
        "eighteenthcentury",
        "republican",
        "assumption",
        "ultimately",
        "guided",
        "drafter",
        "constitution",
        "divided",
        "population",
        "active",
        "passive",
        "citizenship",
        "formerapproximately",
        "french",
        "population",
        "men",
        "approximately",
        "possessed",
        "full",
        "right",
        "citizenship",
        "male",
        "year",
        "older",
        "occupied",
        "residence",
        "least",
        "one",
        "year",
        "paid",
        "equivalent",
        "day",
        "salary",
        "term",
        "france",
        "first",
        "post",
        "constitution",
        "woman",
        "assigned",
        "status",
        "passive",
        "citizen",
        "french",
        "woman",
        "achieve",
        "full",
        "citizenship",
        "contrast",
        "even",
        "french",
        "revolution",
        "condorcet",
        "opposed",
        "passage",
        "law",
        "expressly",
        "excluding",
        "woman",
        "even",
        "post",
        "military",
        "magistracy",
        "instead",
        "legal",
        "prohibition",
        "look",
        "civil",
        "law",
        "education",
        "support",
        "woman",
        "participation",
        "underscore",
        "role",
        "played",
        "education",
        "countering",
        "limitation",
        "attributed",
        "woman",
        "physical",
        "intellectual",
        "limitation",
        "maintaining",
        "female",
        "constitution",
        "mean",
        "would",
        "make",
        "unsuitable",
        "soldier",
        "life",
        "debars",
        "post",
        "require",
        "hard",
        "work",
        "daily",
        "basis",
        "pregnancy",
        "childbirth",
        "breastfeeding",
        "would",
        "prevent",
        "fulfilling",
        "function",
        "believe",
        "difference",
        "men",
        "woman",
        "simply",
        "result",
        "education",
        "mclean",
        "hewitt",
        "education",
        "nature",
        "deemed",
        "cause",
        "woman",
        "inferiority",
        "presumed",
        "unsuitability",
        "given",
        "social",
        "role",
        "task",
        "certain",
        "limited",
        "circumstance",
        "certain",
        "period",
        "time",
        "physical",
        "limitation",
        "factor",
        "condorcet",
        "belief",
        "woman",
        "intellectually",
        "inferior",
        "men",
        "rather",
        "victim",
        "inferior",
        "education",
        "even",
        "agree",
        "woman",
        "might",
        "still",
        "mental",
        "physical",
        "power",
        "men",
        "would",
        "mean",
        "simply",
        "best",
        "woman",
        "equal",
        "secondbest",
        "men",
        "better",
        "third",
        "best",
        "mclean",
        "hewitt",
        "complementing",
        "voltaire",
        "take",
        "philosophe",
        "generally",
        "enlightened",
        "view",
        "toward",
        "woman",
        "condorcet",
        "nonetheless",
        "dispute",
        "latter",
        "reservation",
        "woman",
        "genius",
        "inventiveness",
        "one",
        "thing",
        "insists",
        "post",
        "could",
        "filled",
        "men",
        "capable",
        "invention",
        "many",
        "would",
        "remain",
        "vacant",
        "even",
        "academy",
        "contrary",
        "great",
        "many",
        "post",
        "even",
        "interest",
        "public",
        "time",
        "man",
        "genius",
        "sacrificed",
        "appealing",
        "genius",
        "two",
        "woman",
        "letter",
        "mme",
        "de",
        "sévigné",
        "mme",
        "de",
        "la",
        "fayette",
        "concedes",
        "woman",
        "might",
        "equal",
        "men",
        "highest",
        "domain",
        "science",
        "philosophyan",
        "odd",
        "admission",
        "since",
        "condorcet",
        "might",
        "well",
        "raised",
        "regard",
        "example",
        "voltaire",
        "lover",
        "brilliant",
        "newtonian",
        "mme",
        "de",
        "chatelet",
        "two",
        "reference",
        "woman",
        "second",
        "letter",
        "discussion",
        "could",
        "termed",
        "military",
        "foreign",
        "affair",
        "condorcet",
        "compare",
        "unjust",
        "treatment",
        "woman",
        "position",
        "subject",
        "population",
        "within",
        "republic",
        "circumstance",
        "speak",
        "freedom",
        "right",
        "mclean",
        "hewitt",
        "another",
        "passage",
        "condorcet",
        "sum",
        "defends",
        "charge",
        "triviality",
        "concerning",
        "argument",
        "made",
        "behalf",
        "woman",
        "right",
        "examination",
        "may",
        "seem",
        "long",
        "writes",
        "discussing",
        "right",
        "half",
        "human",
        "race",
        "neglected",
        "legislator",
        "besides",
        "harm",
        "men",
        "freedom",
        "show",
        "overcome",
        "possible",
        "objection",
        "republic",
        "mark",
        "real",
        "difference",
        "state",
        "free",
        "tellingly",
        "men",
        "audience",
        "condorcet",
        "fear",
        "may",
        "deride",
        "argument",
        "worry",
        "woman",
        "reaction",
        "since",
        "led",
        "astray",
        "none",
        "jeanjacques",
        "rousseau",
        "enticement",
        "remain",
        "domestic",
        "sphere",
        "mclean",
        "hewitt",
        "even",
        "philosopher",
        "find",
        "hard",
        "get",
        "little",
        "carried",
        "away",
        "discussing",
        "woman",
        "however",
        "fear",
        "shall",
        "fall",
        "foul",
        "ever",
        "read",
        "article",
        "discussed",
        "right",
        "equality",
        "influence",
        "might",
        "suspected",
        "secretly",
        "wishing",
        "decrease",
        "influence",
        "since",
        "rousseau",
        "gained",
        "support",
        "saying",
        "made",
        "simply",
        "look",
        "u",
        "fit",
        "torment",
        "u",
        "expect",
        "support",
        "truth",
        "good",
        "thing",
        "even",
        "lay",
        "open",
        "ridicule",
        "speaking",
        "mclean",
        "hewitt"
    ]
}