{
    "main_text": "Antiquity || Music, Emotions, and Society: Plato and Aristotle\n1.3 Music, Emotions, and Society: Plato and Aristotle\n\nA central concern in ancient Greek philosophy of music is the\nconnection between music’s capacity to imitate emotions and its\nsocial value. Plato (427/28–347 BCE) and Aristotle\n(384–322 BCE) both develop an account of this relation, and are\nparticularly interested in the pedagogical consequences of their\ntheories.\n\nWhen they talk about ‘music’ (mousikē),\nPlato and his contemporaries often have in mind a broader set of art\nforms than the ones we associate with music today. In this broad\nsense, mousikē denoted “a seamless complex of\ninstrumental music, poetic word, and co-ordinated physical\nmovement” (Murray & Wilson 2004: 7). Plato sometimes also\nuses the term in a narrower sense to indicate melodic and rhythmic\nelements that we would consider today as properly musical (for a brief\ndiscussion of the broad and narrow sense of mousikē in\nPlato, see Schofield 2010: 230–231).\n\nPlato believes that music may contribute to the education of the\nyouth, and more generally to the correct functioning of society, but\nalso holds that it may pose dangers. Underlying Plato’s concerns\nabout the musical education of citizens is the wider assumption that\nchanges in musical taste must be avoided or at least closely\nscrutinized, as they will produce changes in society\n(Republic, 4.424b–d, Laws 2.660a-b). In the\nLaws, Plato goes so far as to describe the changes in musical\ntaste that followed the Persian wars as the trigger for subsequent\nrejection of authority and societal unrest (Laws,\n700a-701b).\n\nAccording to Plato, the sensible world is an imperfect copy of perfect\nand immutable ideas. Plato’s general view of the arts, including\nmusic, is that they are an imitation (mimesis) of objects\nfound in the sensible world. This leads to his famous condemnation of\nart in Book X of his Republic. For, if our world is already a\ncopy, then the arts provide us with copies of a copy. Thus,\nPlato’s metaphysics motivates his dismissive view of art’s\nepistemic value.\n\nHowever, Plato also holds that the musical imitation of some human\nemotions may be ethically beneficial, especially at the stage when\nchildren are too young to be responsive to ethical education that\nrelies on a discursive and rational basis. Plato first describes the\nemotions in question indirectly, one as the emotion of a person who is\nsteadfast and resolute in misfortune or while fighting, the other as\nthe state of “someone engaged in a peaceful, unforced, voluntary\naction” (Republic, 3.399b). Plato holds that these\nemotions, which he then refers to explicitly as courage and\nmoderation, are best imitated through the Dorian and Phrygian modes,\nwhich\n\n\nimitate the violent or voluntary tones of voice of those who are\nmoderate and courageous, whether in good fortune or in bad.\n(Republic, 3.399c)\n\n\nThus, Plato construes musical imitation of emotions as grounded on the\nresemblance of music to human expressive behavior, particularly vocal.\nAt least on one occasion, he also seems to hold that music imitates\nthe bodily movements associated with emotions (Laws,\n2.654e-655a). This could be considered the first defense of the idea\nthat musical expressiveness is due to the music’s resemblance to\nhuman expressive behavior, a position that remains popular to this day\n(see the entry on \nhref=\"../hist-westphilmusicsince-1800/#AnalPhilMusi\" history of\nwestern philosophy of music: since 1800, section 2.6).\n\nHow does the musical imitation of courage and moderation achieve its\neducational purpose? At least some passages suggest that Plato thought\nmusic to be capable of influencing human character in virtue of the\ncommon harmonic nature shared by the soul, music, and the universe.\nFor instance, in the Republic, Socrates tells Glaucon\nthat\n\n\nrhythm and harmony permeate the inner part of the soul more than\nanything else, affecting it most strongly and bringing it grace, so\nthat if someone is properly educated in music and poetry, it makes him\ngraceful, but if not, then the opposite. (Republic, 3.401d;\nsee also Republic, 3.412a, Timaeus, 47d-e, and\nLaches, 188d)\n\n\nYoung (forthcoming) observes that Plato seems elsewhere to reject the\nPythagorean view of the soul as harmony (Phaedo,\n89–95). On this basis, Young holds that Plato’s view of\nthe ethical benefits of music is best interpreted as simply relying on\nthe music’s imitative capacity. Regardless of what one makes of\nPlato’s view of the soul as harmony, it is clear that he was\ninfluenced by the Pythagorean view of the universe as governed by\nharmony, especially in the Timaeus.\n\nOn the surface, Aristotle’s view may appear close to\nPlato’s. Both philosophers hold music’s value to reside in\nits imitation of emotions. However, Aristotle’s view is\nconsiderably more nuanced.\n\nIn the Poetics (1447a), Aristotle makes clear that all the\narts are imitative, although they differ in the means, object, and\nmanner of imitation. Aristotle has a more positive view of imitation\nthan Plato, observing that humans are prone to it since childhood, and\ngranting that we may learn through imitation. This cognitive value of\nimitations also explains why we feel pleasure when engaging with them,\neven when they imitate things we would find ugly or repulsive in real\nlife (Poetics, 1448b 5–20).\n\nDiscussing the object of musical imitations, Aristotle introduces an\ninteresting distinction between mere indications or signs\n(sēmeia) of emotional states and the states themselves.\nSigns of emotional states are the observable behavior that accompanies\nthe occurrence of such states. Aristotle holds that the visual arts\nmerely imitate signs of emotions. For instance, a painter may\nrepresent a man weeping or smiling. However, music is able to imitate\nthe emotional states themselves. A plausible reading of\nAristotle’s view is that he regarded music as capable of\narousing the emotions it imitates, and that this capacity ultimately\nexplains how music may imitate emotional states themselves, as opposed\nto their manifestations. On this analysis, the object of musical\nimitation cannot be specified separately from the emotional response\nthe music arouses in the listener (Halliwell (2002: 248) stresses this\npoint; Sörbom 1994 offers an alternative interpretation).\n\nTo understand the relation between Aristotle’s view of musical\nimitation and its educational role, it is useful to examine this\npassage:\n\n\nBesides, when men hear imitations, even apart from the rhythms and\ntunes themselves, their feelings move in sympathy. Since then music is\na pleasure, and excellence consists in rejoicing and loving and hating\nrightly, there is clearly nothing which we are so much concerned to\nacquire and to cultivate as the power of forming right judgments, and\nof taking delight in good dispositions and noble actions.\n(Politics, 1340a)\n\n\nHere Aristotle seems to be arguing the following: music imitates\ncharacter, that is, various dispositions and emotional states; the\nmusical imitation of such states generates pleasure in the listener;\nso, if we restrict musical imitations to those of morally praiseworthy\nstates, listeners will be pleased at such states in real life.\nAristotle is relying on the assumption that the pleasure accompanying\nour engagement with an imitation will extend to the experience of the\nimitated object in real life. As he expresses it:\n\n\nThe habit of feeling pleasure or pain at mere representations is not\nfar removed from the same feeling about realities. (Politics,\n1340a)\n\n\nTherefore, the moral value of musical education depends on the\ncapacity of mimetic representations to induce pleasure in those who\nappreciate them. While this capacity may be shared by both music and\nthe visual arts, it is only music, according to Aristotle, that is\nable represent states of character, as opposed to merely representing\ntheir manifestations.\n\nAn additional function of music, according to Aristotle, is catharsis.\nMusic may help individuals who are in states of extreme enthusiasm,\npity, or fear return to a more balanced state (Politics,\n1342a). The details of this process are hard to reconstruct, because\nthey are tied to the debated concept of catharsis, introduced by\nAristotle in his definition of tragedy (Poetics, 1449b). It\nseems clear that Aristotle thought of the cathartic process as\nrequiring music expressive of emotions akin to the ones to be purged.\nFor example, a state of uncontrolled religious frenzy could be subdued\nby means of frenzied music.\n\nPlato and Aristotle come apart also with regard to the role of the\npleasure we take in listening to music. Plato’s approach is a\npragmatic one. The aspects of music he values are all and only those\nthat contribute to its ethical role. Such a principle governs\nPlato’s observations on musical pleasure. He does not deny that\nmusic may be able to induce pleasure. However, this pleasure is only\nvaluable insofar as it attracts listeners to music that is good for\ntheir moral education (Laws, 2.668a-b).\n\nPlato also notes that pleasurable responses may become associated with\nmusic of the morally questionable sort, as such responses depend also\non habituation (Laws, 7.802c-d). From this he concludes that\nit is of great importance to control children’s musical\nenvironment.\n\nAristotle’s view of musical pleasure is far more positive. It is\nclear from the above that pleasure plays a role in Aristotle’s\naccount of music’s educational value. But Aristotle also thinks\nthat pleasure generated by music is valuable for two other reasons.\nFirst, music may provide relaxation to those that are tired from work.\nIn this sense, the pleasure it produces is similar to that produced by\neating or sleeping (Politics, 1339a-b). Second, and perhaps\nmore interestingly, Aristotle holds that the pleasure of music should\nbe part of a cultivated life (Politics, 1339b; for a\ndiscussion of the functions of music in Aristotle, see Lippman 1964:\n130–131.)\n\nBoth Plato and Aristotle comment on the value of instrumental music.\nPlato’s pragmatic attitude grounds his injunction against\ncomplexity and subtlety in music (Republic, 3.399c-e). He\nholds that music should have a vocal part, and argues that the musical\nelements should conform to the emotional state described by the\npiece’s lyrical content (Republic, 3.400d). This\nconcern with clear and unequivocal musical imitation also motivates\nPlato’s stance on the value of instrumental music. While it is\nclear that Plato holds the purely musical elements of melody and\nrhythm to have an imitative potential, he attributes little value to\ninstrumental music, presumably because he believes that it is unable\nto provide an unequivocal imitation of courage and moderation\n(Laws 2.669 d-e).\n\nAristotle is again more nuanced. According to him, both vocal and\ninstrumental music produce pleasure (Politics, 1339b). In\ngeneral, despite his reservations concerning the aulos (an\ninstrument comprising two, linked, reed pipes) (Politics,\n1341a), Aristotle’s attitude toward instrumental music is far\nless critical than Plato’s. For example, Aristotle is clear in\nconceding that even purely instrumental music can arouse distinct\nemotions, due to both its melodic and rhythmic elements\n(Politics, 1340a-b).\n",
    "section_title": "1.3 Music, Emotions, and Society: Plato and Aristotle",
    "entry_title": "History of Western Philosophy of Music: Antiquity to 1800",
    "hierarchy_title": "History of Western Philosophy of Music: Antiquity to 1800 || Antiquity || Music, Emotions, and Society: Plato and Aristotle",
    "tokenized_text": [
        "antiquity",
        "music",
        "emotion",
        "society",
        "plato",
        "aristotle",
        "music",
        "emotion",
        "society",
        "plato",
        "aristotle",
        "central",
        "concern",
        "ancient",
        "greek",
        "philosophy",
        "music",
        "connection",
        "music",
        "capacity",
        "imitate",
        "emotion",
        "social",
        "value",
        "plato",
        "bce",
        "aristotle",
        "bce",
        "develop",
        "account",
        "relation",
        "particularly",
        "interested",
        "pedagogical",
        "consequence",
        "theory",
        "talk",
        "music",
        "mousikē",
        "plato",
        "contemporary",
        "often",
        "mind",
        "broader",
        "set",
        "art",
        "form",
        "one",
        "associate",
        "music",
        "today",
        "broad",
        "sense",
        "mousikē",
        "denoted",
        "seamless",
        "complex",
        "instrumental",
        "music",
        "poetic",
        "word",
        "coordinated",
        "physical",
        "movement",
        "murray",
        "wilson",
        "plato",
        "sometimes",
        "also",
        "us",
        "term",
        "narrower",
        "sense",
        "indicate",
        "melodic",
        "rhythmic",
        "element",
        "would",
        "consider",
        "today",
        "properly",
        "musical",
        "brief",
        "discussion",
        "broad",
        "narrow",
        "sense",
        "mousikē",
        "plato",
        "see",
        "schofield",
        "plato",
        "belief",
        "music",
        "may",
        "contribute",
        "education",
        "youth",
        "generally",
        "correct",
        "functioning",
        "society",
        "also",
        "hold",
        "may",
        "pose",
        "danger",
        "underlying",
        "plato",
        "concern",
        "musical",
        "education",
        "citizen",
        "wider",
        "assumption",
        "change",
        "musical",
        "taste",
        "must",
        "avoided",
        "least",
        "closely",
        "scrutinized",
        "produce",
        "change",
        "society",
        "republic",
        "bd",
        "law",
        "ab",
        "law",
        "plato",
        "go",
        "far",
        "describe",
        "change",
        "musical",
        "taste",
        "followed",
        "persian",
        "war",
        "trigger",
        "subsequent",
        "rejection",
        "authority",
        "societal",
        "unrest",
        "law",
        "ab",
        "according",
        "plato",
        "sensible",
        "world",
        "imperfect",
        "copy",
        "perfect",
        "immutable",
        "idea",
        "plato",
        "general",
        "view",
        "art",
        "including",
        "music",
        "imitation",
        "mimesis",
        "object",
        "found",
        "sensible",
        "world",
        "lead",
        "famous",
        "condemnation",
        "art",
        "book",
        "x",
        "republic",
        "world",
        "already",
        "copy",
        "art",
        "provide",
        "u",
        "copy",
        "copy",
        "thus",
        "plato",
        "metaphysics",
        "motivates",
        "dismissive",
        "view",
        "art",
        "epistemic",
        "value",
        "however",
        "plato",
        "also",
        "hold",
        "musical",
        "imitation",
        "human",
        "emotion",
        "may",
        "ethically",
        "beneficial",
        "especially",
        "stage",
        "child",
        "young",
        "responsive",
        "ethical",
        "education",
        "relies",
        "discursive",
        "rational",
        "basis",
        "plato",
        "first",
        "describes",
        "emotion",
        "question",
        "indirectly",
        "one",
        "emotion",
        "person",
        "steadfast",
        "resolute",
        "misfortune",
        "fighting",
        "state",
        "someone",
        "engaged",
        "peaceful",
        "unforced",
        "voluntary",
        "action",
        "republic",
        "b",
        "plato",
        "hold",
        "emotion",
        "refers",
        "explicitly",
        "courage",
        "moderation",
        "best",
        "imitated",
        "dorian",
        "phrygian",
        "mode",
        "imitate",
        "violent",
        "voluntary",
        "tone",
        "voice",
        "moderate",
        "courageous",
        "whether",
        "good",
        "fortune",
        "bad",
        "republic",
        "c",
        "thus",
        "plato",
        "construes",
        "musical",
        "imitation",
        "emotion",
        "grounded",
        "resemblance",
        "music",
        "human",
        "expressive",
        "behavior",
        "particularly",
        "vocal",
        "least",
        "one",
        "occasion",
        "also",
        "seems",
        "hold",
        "music",
        "imitates",
        "bodily",
        "movement",
        "associated",
        "emotion",
        "law",
        "ea",
        "could",
        "considered",
        "first",
        "defense",
        "idea",
        "musical",
        "expressiveness",
        "due",
        "music",
        "resemblance",
        "human",
        "expressive",
        "behavior",
        "position",
        "remains",
        "popular",
        "day",
        "see",
        "entry",
        "href",
        "histwestphilmusicsince",
        "analphilmusi",
        "history",
        "western",
        "philosophy",
        "music",
        "since",
        "section",
        "musical",
        "imitation",
        "courage",
        "moderation",
        "achieve",
        "educational",
        "purpose",
        "least",
        "passage",
        "suggest",
        "plato",
        "thought",
        "music",
        "capable",
        "influencing",
        "human",
        "character",
        "virtue",
        "common",
        "harmonic",
        "nature",
        "shared",
        "soul",
        "music",
        "universe",
        "instance",
        "republic",
        "socrates",
        "tell",
        "glaucon",
        "rhythm",
        "harmony",
        "permeate",
        "inner",
        "part",
        "soul",
        "anything",
        "else",
        "affecting",
        "strongly",
        "bringing",
        "grace",
        "someone",
        "properly",
        "educated",
        "music",
        "poetry",
        "make",
        "graceful",
        "opposite",
        "republic",
        "d",
        "see",
        "also",
        "republic",
        "a",
        "timaeus",
        "de",
        "laches",
        "d",
        "young",
        "forthcoming",
        "observes",
        "plato",
        "seems",
        "elsewhere",
        "reject",
        "pythagorean",
        "view",
        "soul",
        "harmony",
        "phaedo",
        "basis",
        "young",
        "hold",
        "plato",
        "view",
        "ethical",
        "benefit",
        "music",
        "best",
        "interpreted",
        "simply",
        "relying",
        "music",
        "imitative",
        "capacity",
        "regardless",
        "one",
        "make",
        "plato",
        "view",
        "soul",
        "harmony",
        "clear",
        "influenced",
        "pythagorean",
        "view",
        "universe",
        "governed",
        "harmony",
        "especially",
        "timaeus",
        "surface",
        "aristotle",
        "view",
        "may",
        "appear",
        "close",
        "plato",
        "philosopher",
        "hold",
        "music",
        "value",
        "reside",
        "imitation",
        "emotion",
        "however",
        "aristotle",
        "view",
        "considerably",
        "nuanced",
        "poetics",
        "a",
        "aristotle",
        "make",
        "clear",
        "art",
        "imitative",
        "although",
        "differ",
        "mean",
        "object",
        "manner",
        "imitation",
        "aristotle",
        "positive",
        "view",
        "imitation",
        "plato",
        "observing",
        "human",
        "prone",
        "since",
        "childhood",
        "granting",
        "may",
        "learn",
        "imitation",
        "cognitive",
        "value",
        "imitation",
        "also",
        "explains",
        "feel",
        "pleasure",
        "engaging",
        "even",
        "imitate",
        "thing",
        "would",
        "find",
        "ugly",
        "repulsive",
        "real",
        "life",
        "poetics",
        "b",
        "discussing",
        "object",
        "musical",
        "imitation",
        "aristotle",
        "introduces",
        "interesting",
        "distinction",
        "mere",
        "indication",
        "sign",
        "sēmeia",
        "emotional",
        "state",
        "state",
        "sign",
        "emotional",
        "state",
        "observable",
        "behavior",
        "accompanies",
        "occurrence",
        "state",
        "aristotle",
        "hold",
        "visual",
        "art",
        "merely",
        "imitate",
        "sign",
        "emotion",
        "instance",
        "painter",
        "may",
        "represent",
        "man",
        "weeping",
        "smiling",
        "however",
        "music",
        "able",
        "imitate",
        "emotional",
        "state",
        "plausible",
        "reading",
        "aristotle",
        "view",
        "regarded",
        "music",
        "capable",
        "arousing",
        "emotion",
        "imitates",
        "capacity",
        "ultimately",
        "explains",
        "music",
        "may",
        "imitate",
        "emotional",
        "state",
        "opposed",
        "manifestation",
        "analysis",
        "object",
        "musical",
        "imitation",
        "specified",
        "separately",
        "emotional",
        "response",
        "music",
        "arouses",
        "listener",
        "halliwell",
        "stress",
        "point",
        "sörbom",
        "offer",
        "alternative",
        "interpretation",
        "understand",
        "relation",
        "aristotle",
        "view",
        "musical",
        "imitation",
        "educational",
        "role",
        "useful",
        "examine",
        "passage",
        "besides",
        "men",
        "hear",
        "imitation",
        "even",
        "apart",
        "rhythm",
        "tune",
        "feeling",
        "move",
        "sympathy",
        "since",
        "music",
        "pleasure",
        "excellence",
        "consists",
        "rejoicing",
        "loving",
        "hating",
        "rightly",
        "clearly",
        "nothing",
        "much",
        "concerned",
        "acquire",
        "cultivate",
        "power",
        "forming",
        "right",
        "judgment",
        "taking",
        "delight",
        "good",
        "disposition",
        "noble",
        "action",
        "politics",
        "a",
        "aristotle",
        "seems",
        "arguing",
        "following",
        "music",
        "imitates",
        "character",
        "various",
        "disposition",
        "emotional",
        "state",
        "musical",
        "imitation",
        "state",
        "generates",
        "pleasure",
        "listener",
        "restrict",
        "musical",
        "imitation",
        "morally",
        "praiseworthy",
        "state",
        "listener",
        "pleased",
        "state",
        "real",
        "life",
        "aristotle",
        "relying",
        "assumption",
        "pleasure",
        "accompanying",
        "engagement",
        "imitation",
        "extend",
        "experience",
        "imitated",
        "object",
        "real",
        "life",
        "express",
        "habit",
        "feeling",
        "pleasure",
        "pain",
        "mere",
        "representation",
        "far",
        "removed",
        "feeling",
        "reality",
        "politics",
        "a",
        "therefore",
        "moral",
        "value",
        "musical",
        "education",
        "depends",
        "capacity",
        "mimetic",
        "representation",
        "induce",
        "pleasure",
        "appreciate",
        "capacity",
        "may",
        "shared",
        "music",
        "visual",
        "art",
        "music",
        "according",
        "aristotle",
        "able",
        "represent",
        "state",
        "character",
        "opposed",
        "merely",
        "representing",
        "manifestation",
        "additional",
        "function",
        "music",
        "according",
        "aristotle",
        "catharsis",
        "music",
        "may",
        "help",
        "individual",
        "state",
        "extreme",
        "enthusiasm",
        "pity",
        "fear",
        "return",
        "balanced",
        "state",
        "politics",
        "a",
        "detail",
        "process",
        "hard",
        "reconstruct",
        "tied",
        "debated",
        "concept",
        "catharsis",
        "introduced",
        "aristotle",
        "definition",
        "tragedy",
        "poetics",
        "b",
        "seems",
        "clear",
        "aristotle",
        "thought",
        "cathartic",
        "process",
        "requiring",
        "music",
        "expressive",
        "emotion",
        "akin",
        "one",
        "purged",
        "example",
        "state",
        "uncontrolled",
        "religious",
        "frenzy",
        "could",
        "subdued",
        "mean",
        "frenzied",
        "music",
        "plato",
        "aristotle",
        "come",
        "apart",
        "also",
        "regard",
        "role",
        "pleasure",
        "take",
        "listening",
        "music",
        "plato",
        "approach",
        "pragmatic",
        "one",
        "aspect",
        "music",
        "value",
        "contribute",
        "ethical",
        "role",
        "principle",
        "governs",
        "plato",
        "observation",
        "musical",
        "pleasure",
        "deny",
        "music",
        "may",
        "able",
        "induce",
        "pleasure",
        "however",
        "pleasure",
        "valuable",
        "insofar",
        "attracts",
        "listener",
        "music",
        "good",
        "moral",
        "education",
        "law",
        "ab",
        "plato",
        "also",
        "note",
        "pleasurable",
        "response",
        "may",
        "become",
        "associated",
        "music",
        "morally",
        "questionable",
        "sort",
        "response",
        "depend",
        "also",
        "habituation",
        "law",
        "cd",
        "concludes",
        "great",
        "importance",
        "control",
        "child",
        "musical",
        "environment",
        "aristotle",
        "view",
        "musical",
        "pleasure",
        "far",
        "positive",
        "clear",
        "pleasure",
        "play",
        "role",
        "aristotle",
        "account",
        "music",
        "educational",
        "value",
        "aristotle",
        "also",
        "think",
        "pleasure",
        "generated",
        "music",
        "valuable",
        "two",
        "reason",
        "first",
        "music",
        "may",
        "provide",
        "relaxation",
        "tired",
        "work",
        "sense",
        "pleasure",
        "produce",
        "similar",
        "produced",
        "eating",
        "sleeping",
        "politics",
        "ab",
        "second",
        "perhaps",
        "interestingly",
        "aristotle",
        "hold",
        "pleasure",
        "music",
        "part",
        "cultivated",
        "life",
        "politics",
        "b",
        "discussion",
        "function",
        "music",
        "aristotle",
        "see",
        "lippman",
        "plato",
        "aristotle",
        "comment",
        "value",
        "instrumental",
        "music",
        "plato",
        "pragmatic",
        "attitude",
        "ground",
        "injunction",
        "complexity",
        "subtlety",
        "music",
        "republic",
        "ce",
        "hold",
        "music",
        "vocal",
        "part",
        "argues",
        "musical",
        "element",
        "conform",
        "emotional",
        "state",
        "described",
        "piece",
        "lyrical",
        "content",
        "republic",
        "d",
        "concern",
        "clear",
        "unequivocal",
        "musical",
        "imitation",
        "also",
        "motivates",
        "plato",
        "stance",
        "value",
        "instrumental",
        "music",
        "clear",
        "plato",
        "hold",
        "purely",
        "musical",
        "element",
        "melody",
        "rhythm",
        "imitative",
        "potential",
        "attribute",
        "little",
        "value",
        "instrumental",
        "music",
        "presumably",
        "belief",
        "unable",
        "provide",
        "unequivocal",
        "imitation",
        "courage",
        "moderation",
        "law",
        "de",
        "aristotle",
        "nuanced",
        "according",
        "vocal",
        "instrumental",
        "music",
        "produce",
        "pleasure",
        "politics",
        "b",
        "general",
        "despite",
        "reservation",
        "concerning",
        "aulos",
        "instrument",
        "comprising",
        "two",
        "linked",
        "reed",
        "pipe",
        "politics",
        "a",
        "aristotle",
        "attitude",
        "toward",
        "instrumental",
        "music",
        "far",
        "le",
        "critical",
        "plato",
        "example",
        "aristotle",
        "clear",
        "conceding",
        "even",
        "purely",
        "instrumental",
        "music",
        "arouse",
        "distinct",
        "emotion",
        "due",
        "melodic",
        "rhythmic",
        "element",
        "politics",
        "ab"
    ]
}