{
    "main_text": "The Use of Mathematics and Hypotheses in Scientific Explanations\n2. The Use of Mathematics and Hypotheses in Scientific Explanations\n\nThere has been debate among scholars of Hobbes’ thought about\nthe relationship of the different parts of his philosophy to one\nanother. Much of the focus has been upon the methodological statements\nin Part I of De Corpore, and scholars have traditionally\ndivided over whether Hobbes understood philosophy as unified or\ndisunified. However, more recent scholarship has drawn attention to\nHobbes’ practice of explanation, such as the explanations found\nin De Corpore Part IV, and has argued that aspects of both\nthe unified and disunified views track Hobbes’ discussions and\npractice while those views on their own miss that Hobbes explicitly\nborrowed principles from mathematics to use in natural philosophy (and\nprovided citations to show this activity). This section will discuss\nthese three approaches to understanding how the parts of Hobbes’\nsystem fit with one another and then provide an example of an\nexplanation in Hobbes’ natural philosophy from De\nCorpore XXV.\n\nFirst, the unified view. A significant number of scholars have argued\nthat Hobbes understood his philosophy as unified by deductive\nconnections between the different parts (for example, Martinich 2005;\nPeters 1967; Shapin & Schaffer 1985; Watkins 1965). A stronger\nversion of this unified view understands Hobbes to be a type of\nreductionist, wherein descriptions of macroscopic bodies, such as\nhumans and rocks, ultimately reduce to microscopic bodies responsible\nfor all phenomena (for example, Hampton 1986; Ryan 1970). For example,\nAlan Ryan articulates the reductionist view as follows:\n\n\nHobbes believed as firmly as one could that all behaviour, whether of\nanimate or inanimate matter, was ultimately to be explained in terms\nof particulate motion: the laws governing the motions of discrete\nmaterial particles were the ultimate laws of the universe, and in this\nsense psychology must be rooted in physiology and physiology in\nphysics, while the social sciences, especially the technology of\nstatecraft, must be rooted in psychology. (1970: 102–103)\n\n\nThere is some textual support for understanding the parts of\nHobbes’ system as either deductively or reductively linked\ntogether since he did at times talk of the parts of philosophy as\nbeginning in first philosophy and leading from one to another. For\nexample, he asserted in De Corpore VI.6 that by beginning at\nfirst principles, one will move from first philosophy to geometry, and\nfrom geometry to physics. He continued by claiming that “after\nphysics we come to morals” and, indeed, Hobbes claims that moral\nphilosophy must be studied after physics because the passions have\n“their causes in sense-experience and imagination” (CSL\n299; OL I.64).\n\nHowever, immediately following these statements that seem to indicate\nthat Hobbes took his philosophy to be tightly knit together, he argued\nthat “civil and moral philosophy do not so adhere to one\nanother, but that they may be severed” (EW I.73). This\nseparation is permissible, Hobbes claimed, because in addition to\nlearning moral philosophy from first principles each individual could\nsimply study the motions of their own mind and gain knowledge of the\nsame principles. That such separation could occur is difficult to\nexplain for a strong version of the unified view because it makes it\nappear that Hobbes thought that one could develop civil philosophy\nsimply by introspecting, entirely independently of any work in moral\nphilosophy, natural philosophy, and first philosophy.\n\nA further difficulty for the unified view is that even if Hobbes did\nsee the connection between, say, physics and moral philosophy as\ndeductive, it is not obvious how that deduction would work because\nmoral philosophy must add content about human passions (endeavors)\nthat is not contained within—and thus not deducible\nfrom—physics. For example, although the concept\n‘endeavor’ is introduced in physics, for it to be used in\nmoral philosophy the concepts of ‘appetite’ and\n‘aversion’, which are properties of human bodies, must be\nadded to it for use (Malcolm 2002: 147). One way to avoid this\ndifficulty for the unified view would be to provide evidence that\nHobbes made explicit the reduction relationship between concepts like\n‘appetite’ and ‘aversion’ and the concept of\n‘endeavour’, showing how one can reduce claims about human\nbodies to claims about microscopic bodies. Hobbes does not appear to\ndo this anywhere in the corpus. However, even if a strong version of\nthe unified view faces this difficulty, the presence of\n‘endeavor’ throughout Hobbes’ philosophy shows that\nit was a foundational concept (see Jesseph 2016).\n\nThe second major view of the relationship of the parts of\nHobbes’ philosophy to one another is what we can call the\ndisunified view (for example, see Robertson 1886; Taylor 1938;\nWarrender 1957). Some of the motivation behind the disunified account\nseems to be a desire to free Hobbes from what is prima facie a case of\nderiving normative claims relating to the commonwealth in civil\nphilosophy from descriptive claims related to human psychology and,\nultimately, more general claims in natural philosophy (especially\nTaylor 1938). However, in its attempts to rescue Hobbes from a version\nof the so-called naturalistic fallacy, the disunified account fails to\ntake seriously Hobbes’ claims about the unity of his philosophy.\nFurthermore, it neglects that many of Hobbes’ contemporaries\n(for example, Bramhall) saw Hobbes’ views in natural philosophy\nas having far-reaching consequences for other areas of philosophy.\n\nA third view has more recently been offered that seeks to carve a\nmiddle path between the unified and disunified interpretations. We can\ncall this view the mixed-mathematics view (for example, Adams 2016,\n2017; Biener 2016). This understanding of Hobbes’ system agrees\nwith the worry raised above for the unified account that\n‘higher’ levels, such as geometry, do not contain the\nconcepts used in ‘lower’ level explanations. For example,\nalthough geometrical principles are used in Hobbes’ optical\nexplanations those geometrical principles do not contain concepts such\nas ‘light’ or ‘color’. Some evidence for this\nlack of containment claim can be found on the well-known “Table\nof the Several Subjects of Science” in Leviathan IX.\nThe “sciences” on this table are listed on the right-most\nsection and their subjects are to the immediate left. The subject of\nthe science of optics, for example, is all of the “consequences\nfrom vision”, and these stem from “Physics or consequences\nfrom qualities”. The science of geometry, however, has as its\nsubject the “consequences from quantity, and motion\ndetermined… by figure” and these stem not from physics\nbut from “consequences from the accidents common to all bodies\nnatural; which are quantity and motion”.\n\nInstead of seeing this “adding to” as evidence for the\ndisunified view, the mixed-mathematics view understands Hobbes having\nseen certain disciplines as providing causal principles (what he\ncalled the ‘why’) while other disciplines provided the\nfacts relevant to a given domain (what he called the\n‘that’). Textual support for this understanding of\nHobbes’ system can be found in Hobbes’ methodological\nstatements about natural philosophy as well as in his practice of\nexplanation.\n\nAs mentioned already, Hobbes identified scientific knowledge\n(scientia) with knowing causes, and in his discussions he\nused language germane to Aristotle’s distinction between the\n‘why’ and the ‘that’. We have seen already\nHobbes’ commitment to knowing through the causes, but the\ncomplete passage from De Corpore VI.1 provides further detail\nabout Hobbes’ views on the two types of knowledge, as\nfollows:\n\n\nWe are said to know [scire] some effect when we know what its\ncauses are, in what subject they are, in what subject they introduce\nthe effect and how they do it. Therefore, this is the knowledge\n[scientia] τοῦ\nδιότι or of causes. All other knowledge\n[cognitio], which is called τοῦ\nὅτι, is either sense experience or imagination\nremaining in sense experience or memory (De Corpore VI.1; CSL\n287–289).\n\n\nTwo types of knowledge thus emerge. There is knowledge from sense\nexperience, retained as imagination and eventually as memory (more\nbelow on how this can develop into prudence), and there is scientific\nknowledge. When reflecting in De Homine on the status of\nclaims in physics, Hobbes claims that what he calls “true\nphysics” must be a mixture of both of these types of\nknowledge:\n\n\n[…] since one cannot proceed in reasoning about natural things\nthat are brought about by motion from the effects to the causes\nwithout a knowledge of those things that follow from that kind of\nmotion; and since one cannot proceed to the consequences of motions\nwithout a knowledge of quantity, which is geometry; nothing can be\ndemonstrated by physics without something also being demonstrated\na priori. Therefore physics (I mean true physics) [vera\nphysica], that depends on geometry, is usually numbered among the\nmixed mathematics [mathematicas mixtas]. [.] Therefore those\nmathematics are pure which (like geometry and arithmetic) revolve\naround quantities in the abstract so that work [in them] requires no\nknowledge of the subject; those mathematics are mixed, in truth, which\nin their reasoning some quality of the subject is also considered, as\nis the case with astronomy, music, physics, and the parts of physics\nthat can vary on account of the variety of species and the parts of\nthe universe. (MC 42; OL II.93)\n\n\nThese two statements concerning the status of different types of\nknowledge and the requirement to mix “quantities in the\nabstract” with “some quality of the subject” in\nphysics can aid in making sense of Hobbes’ actual explanatory\npractice. What does it mean for physics to be “mixed\nmathematics”? For Hobbes it means that for many explanations one\nwill first establish that some fact is the case by appealing to sense\nexperience, but to give the reason why one must borrow a principle\nfrom geometry.\n\nAt several places in De Corpore, Hobbes appears to carry out\nthe mixed-mathematics ideal by showing, with a citation, that he used\na causal principle from geometry within an explanation that included\ndetails about the “quality of the subject.” For example,\nin De Corpore XXV, the chapter with which Hobbes began Part\nIV, Hobbes appears to have done just this when he explained sensation.\nIn that explanation, he appealed both to “qualities of the\nsubject”, such as the claim based upon experience that “we\nmay observe… that our phantasms or ideas are not always the\nsame” (EW I.389), and by citing and using causal principles from\nearlier in the work (see discussion of this explanation in Adams\n 2016).[4]\n\nSuch behavior—borrowing and citing a principle within an\nexplanation—would be difficult to explain on the picture offered\nby the unified view since Hobbes offers no justification for this\npractice other than phrases such as “I have shown\nbesides…”. There is no deduction anywhere offered within\nHobbes’ actual explanatory practice that would give reason to\nthink that Hobbes understood the use of these principles from\nelsewhere in the work in that way. Likewise, it is difficult to make\nsense of this activity within Hobbes’ actual practice if we\nadopt the disunified view of Hobbes’ philosophy, since by using\nprinciples from elsewhere in the system, and especially by explicitly\nciting them, Hobbes is signaling that the parts of his system did fit\ntogether, even if not in the strong reductive sense of the unified\nview. The next section will describe Hobbes’ view that work in\nfirst philosophy and geometry must be done prior to experiments.\n",
    "section_title": "2. The Use of Mathematics and Hypotheses in Scientific Explanations",
    "entry_title": "Hobbes’ Philosophy of Science",
    "hierarchy_title": "Hobbes’ Philosophy of Science || The Use of Mathematics and Hypotheses in Scientific Explanations",
    "tokenized_text": [
        "use",
        "mathematics",
        "hypothesis",
        "scientific",
        "explanation",
        "use",
        "mathematics",
        "hypothesis",
        "scientific",
        "explanation",
        "debate",
        "among",
        "scholar",
        "hobbes",
        "thought",
        "relationship",
        "different",
        "part",
        "philosophy",
        "one",
        "another",
        "much",
        "focus",
        "upon",
        "methodological",
        "statement",
        "part",
        "de",
        "corpore",
        "scholar",
        "traditionally",
        "divided",
        "whether",
        "hobbes",
        "understood",
        "philosophy",
        "unified",
        "disunified",
        "however",
        "recent",
        "scholarship",
        "drawn",
        "attention",
        "hobbes",
        "practice",
        "explanation",
        "explanation",
        "found",
        "de",
        "corpore",
        "part",
        "iv",
        "argued",
        "aspect",
        "unified",
        "disunified",
        "view",
        "track",
        "hobbes",
        "discussion",
        "practice",
        "view",
        "miss",
        "hobbes",
        "explicitly",
        "borrowed",
        "principle",
        "mathematics",
        "use",
        "natural",
        "philosophy",
        "provided",
        "citation",
        "show",
        "activity",
        "section",
        "discus",
        "three",
        "approach",
        "understanding",
        "part",
        "hobbes",
        "system",
        "fit",
        "one",
        "another",
        "provide",
        "example",
        "explanation",
        "hobbes",
        "natural",
        "philosophy",
        "de",
        "corpore",
        "xxv",
        "first",
        "unified",
        "view",
        "significant",
        "number",
        "scholar",
        "argued",
        "hobbes",
        "understood",
        "philosophy",
        "unified",
        "deductive",
        "connection",
        "different",
        "part",
        "example",
        "martinich",
        "peter",
        "shapin",
        "schaffer",
        "watkins",
        "stronger",
        "version",
        "unified",
        "view",
        "understands",
        "hobbes",
        "type",
        "reductionist",
        "wherein",
        "description",
        "macroscopic",
        "body",
        "human",
        "rock",
        "ultimately",
        "reduce",
        "microscopic",
        "body",
        "responsible",
        "phenomenon",
        "example",
        "hampton",
        "ryan",
        "example",
        "alan",
        "ryan",
        "articulates",
        "reductionist",
        "view",
        "follows",
        "hobbes",
        "believed",
        "firmly",
        "one",
        "could",
        "behaviour",
        "whether",
        "animate",
        "inanimate",
        "matter",
        "ultimately",
        "explained",
        "term",
        "particulate",
        "motion",
        "law",
        "governing",
        "motion",
        "discrete",
        "material",
        "particle",
        "ultimate",
        "law",
        "universe",
        "sense",
        "psychology",
        "must",
        "rooted",
        "physiology",
        "physiology",
        "physic",
        "social",
        "science",
        "especially",
        "technology",
        "statecraft",
        "must",
        "rooted",
        "psychology",
        "textual",
        "support",
        "understanding",
        "part",
        "hobbes",
        "system",
        "either",
        "deductively",
        "reductively",
        "linked",
        "together",
        "since",
        "time",
        "talk",
        "part",
        "philosophy",
        "beginning",
        "first",
        "philosophy",
        "leading",
        "one",
        "another",
        "example",
        "asserted",
        "de",
        "corpore",
        "vi",
        "beginning",
        "first",
        "principle",
        "one",
        "move",
        "first",
        "philosophy",
        "geometry",
        "geometry",
        "physic",
        "continued",
        "claiming",
        "physic",
        "come",
        "moral",
        "indeed",
        "hobbes",
        "claim",
        "moral",
        "philosophy",
        "must",
        "studied",
        "physic",
        "passion",
        "cause",
        "senseexperience",
        "imagination",
        "csl",
        "ol",
        "i",
        "however",
        "immediately",
        "following",
        "statement",
        "seem",
        "indicate",
        "hobbes",
        "took",
        "philosophy",
        "tightly",
        "knit",
        "together",
        "argued",
        "civil",
        "moral",
        "philosophy",
        "adhere",
        "one",
        "another",
        "may",
        "severed",
        "ew",
        "i",
        "separation",
        "permissible",
        "hobbes",
        "claimed",
        "addition",
        "learning",
        "moral",
        "philosophy",
        "first",
        "principle",
        "individual",
        "could",
        "simply",
        "study",
        "motion",
        "mind",
        "gain",
        "knowledge",
        "principle",
        "separation",
        "could",
        "occur",
        "difficult",
        "explain",
        "strong",
        "version",
        "unified",
        "view",
        "make",
        "appear",
        "hobbes",
        "thought",
        "one",
        "could",
        "develop",
        "civil",
        "philosophy",
        "simply",
        "introspecting",
        "entirely",
        "independently",
        "work",
        "moral",
        "philosophy",
        "natural",
        "philosophy",
        "first",
        "philosophy",
        "difficulty",
        "unified",
        "view",
        "even",
        "hobbes",
        "see",
        "connection",
        "say",
        "physic",
        "moral",
        "philosophy",
        "deductive",
        "obvious",
        "deduction",
        "would",
        "work",
        "moral",
        "philosophy",
        "must",
        "add",
        "content",
        "human",
        "passion",
        "endeavor",
        "contained",
        "withinand",
        "thus",
        "deducible",
        "fromphysics",
        "example",
        "although",
        "concept",
        "endeavor",
        "introduced",
        "physic",
        "used",
        "moral",
        "philosophy",
        "concept",
        "appetite",
        "aversion",
        "property",
        "human",
        "body",
        "must",
        "added",
        "use",
        "malcolm",
        "one",
        "way",
        "avoid",
        "difficulty",
        "unified",
        "view",
        "would",
        "provide",
        "evidence",
        "hobbes",
        "made",
        "explicit",
        "reduction",
        "relationship",
        "concept",
        "like",
        "appetite",
        "aversion",
        "concept",
        "endeavour",
        "showing",
        "one",
        "reduce",
        "claim",
        "human",
        "body",
        "claim",
        "microscopic",
        "body",
        "hobbes",
        "appear",
        "anywhere",
        "corpus",
        "however",
        "even",
        "strong",
        "version",
        "unified",
        "view",
        "face",
        "difficulty",
        "presence",
        "endeavor",
        "throughout",
        "hobbes",
        "philosophy",
        "show",
        "foundational",
        "concept",
        "see",
        "jesseph",
        "second",
        "major",
        "view",
        "relationship",
        "part",
        "hobbes",
        "philosophy",
        "one",
        "another",
        "call",
        "disunified",
        "view",
        "example",
        "see",
        "robertson",
        "taylor",
        "warrender",
        "motivation",
        "behind",
        "disunified",
        "account",
        "seems",
        "desire",
        "free",
        "hobbes",
        "prima",
        "facie",
        "case",
        "deriving",
        "normative",
        "claim",
        "relating",
        "commonwealth",
        "civil",
        "philosophy",
        "descriptive",
        "claim",
        "related",
        "human",
        "psychology",
        "ultimately",
        "general",
        "claim",
        "natural",
        "philosophy",
        "especially",
        "taylor",
        "however",
        "attempt",
        "rescue",
        "hobbes",
        "version",
        "socalled",
        "naturalistic",
        "fallacy",
        "disunified",
        "account",
        "fails",
        "take",
        "seriously",
        "hobbes",
        "claim",
        "unity",
        "philosophy",
        "furthermore",
        "neglect",
        "many",
        "hobbes",
        "contemporary",
        "example",
        "bramhall",
        "saw",
        "hobbes",
        "view",
        "natural",
        "philosophy",
        "farreaching",
        "consequence",
        "area",
        "philosophy",
        "third",
        "view",
        "recently",
        "offered",
        "seek",
        "carve",
        "middle",
        "path",
        "unified",
        "disunified",
        "interpretation",
        "call",
        "view",
        "mixedmathematics",
        "view",
        "example",
        "adam",
        "biener",
        "understanding",
        "hobbes",
        "system",
        "agrees",
        "worry",
        "raised",
        "unified",
        "account",
        "higher",
        "level",
        "geometry",
        "contain",
        "concept",
        "used",
        "lower",
        "level",
        "explanation",
        "example",
        "although",
        "geometrical",
        "principle",
        "used",
        "hobbes",
        "optical",
        "explanation",
        "geometrical",
        "principle",
        "contain",
        "concept",
        "light",
        "color",
        "evidence",
        "lack",
        "containment",
        "claim",
        "found",
        "wellknown",
        "table",
        "several",
        "subject",
        "science",
        "leviathan",
        "ix",
        "science",
        "table",
        "listed",
        "rightmost",
        "section",
        "subject",
        "immediate",
        "left",
        "subject",
        "science",
        "optic",
        "example",
        "consequence",
        "vision",
        "stem",
        "physic",
        "consequence",
        "quality",
        "science",
        "geometry",
        "however",
        "subject",
        "consequence",
        "quantity",
        "motion",
        "determined",
        "figure",
        "stem",
        "physic",
        "consequence",
        "accident",
        "common",
        "body",
        "natural",
        "quantity",
        "motion",
        "instead",
        "seeing",
        "adding",
        "evidence",
        "disunified",
        "view",
        "mixedmathematics",
        "view",
        "understands",
        "hobbes",
        "seen",
        "certain",
        "discipline",
        "providing",
        "causal",
        "principle",
        "called",
        "discipline",
        "provided",
        "fact",
        "relevant",
        "given",
        "domain",
        "called",
        "textual",
        "support",
        "understanding",
        "hobbes",
        "system",
        "found",
        "hobbes",
        "methodological",
        "statement",
        "natural",
        "philosophy",
        "well",
        "practice",
        "explanation",
        "mentioned",
        "already",
        "hobbes",
        "identified",
        "scientific",
        "knowledge",
        "scientia",
        "knowing",
        "cause",
        "discussion",
        "used",
        "language",
        "germane",
        "aristotle",
        "distinction",
        "seen",
        "already",
        "hobbes",
        "commitment",
        "knowing",
        "cause",
        "complete",
        "passage",
        "de",
        "corpore",
        "vi",
        "provides",
        "detail",
        "hobbes",
        "view",
        "two",
        "type",
        "knowledge",
        "follows",
        "said",
        "know",
        "scire",
        "effect",
        "know",
        "cause",
        "subject",
        "subject",
        "introduce",
        "effect",
        "therefore",
        "knowledge",
        "scientia",
        "τοῦ",
        "διότι",
        "cause",
        "knowledge",
        "cognitio",
        "called",
        "τοῦ",
        "ὅτι",
        "either",
        "sense",
        "experience",
        "imagination",
        "remaining",
        "sense",
        "experience",
        "memory",
        "de",
        "corpore",
        "vi",
        "csl",
        "two",
        "type",
        "knowledge",
        "thus",
        "emerge",
        "knowledge",
        "sense",
        "experience",
        "retained",
        "imagination",
        "eventually",
        "memory",
        "develop",
        "prudence",
        "scientific",
        "knowledge",
        "reflecting",
        "de",
        "homine",
        "status",
        "claim",
        "physic",
        "hobbes",
        "claim",
        "call",
        "true",
        "physic",
        "must",
        "mixture",
        "type",
        "knowledge",
        "since",
        "one",
        "proceed",
        "reasoning",
        "natural",
        "thing",
        "brought",
        "motion",
        "effect",
        "cause",
        "without",
        "knowledge",
        "thing",
        "follow",
        "kind",
        "motion",
        "since",
        "one",
        "proceed",
        "consequence",
        "motion",
        "without",
        "knowledge",
        "quantity",
        "geometry",
        "nothing",
        "demonstrated",
        "physic",
        "without",
        "something",
        "also",
        "demonstrated",
        "priori",
        "therefore",
        "physic",
        "mean",
        "true",
        "physic",
        "vera",
        "physica",
        "depends",
        "geometry",
        "usually",
        "numbered",
        "among",
        "mixed",
        "mathematics",
        "mathematicas",
        "mixtas",
        "therefore",
        "mathematics",
        "pure",
        "like",
        "geometry",
        "arithmetic",
        "revolve",
        "around",
        "quantity",
        "abstract",
        "work",
        "requires",
        "knowledge",
        "subject",
        "mathematics",
        "mixed",
        "truth",
        "reasoning",
        "quality",
        "subject",
        "also",
        "considered",
        "case",
        "astronomy",
        "music",
        "physic",
        "part",
        "physic",
        "vary",
        "account",
        "variety",
        "specie",
        "part",
        "universe",
        "mc",
        "ol",
        "ii",
        "two",
        "statement",
        "concerning",
        "status",
        "different",
        "type",
        "knowledge",
        "requirement",
        "mix",
        "quantity",
        "abstract",
        "quality",
        "subject",
        "physic",
        "aid",
        "making",
        "sense",
        "hobbes",
        "actual",
        "explanatory",
        "practice",
        "mean",
        "physic",
        "mixed",
        "mathematics",
        "hobbes",
        "mean",
        "many",
        "explanation",
        "one",
        "first",
        "establish",
        "fact",
        "case",
        "appealing",
        "sense",
        "experience",
        "give",
        "reason",
        "one",
        "must",
        "borrow",
        "principle",
        "geometry",
        "several",
        "place",
        "de",
        "corpore",
        "hobbes",
        "appears",
        "carry",
        "mixedmathematics",
        "ideal",
        "showing",
        "citation",
        "used",
        "causal",
        "principle",
        "geometry",
        "within",
        "explanation",
        "included",
        "detail",
        "quality",
        "subject",
        "example",
        "de",
        "corpore",
        "xxv",
        "chapter",
        "hobbes",
        "began",
        "part",
        "iv",
        "hobbes",
        "appears",
        "done",
        "explained",
        "sensation",
        "explanation",
        "appealed",
        "quality",
        "subject",
        "claim",
        "based",
        "upon",
        "experience",
        "may",
        "observe",
        "phantasm",
        "idea",
        "always",
        "ew",
        "i",
        "citing",
        "using",
        "causal",
        "principle",
        "earlier",
        "work",
        "see",
        "discussion",
        "explanation",
        "adam",
        "behaviorborrowing",
        "citing",
        "principle",
        "within",
        "explanationwould",
        "difficult",
        "explain",
        "picture",
        "offered",
        "unified",
        "view",
        "since",
        "hobbes",
        "offer",
        "justification",
        "practice",
        "phrase",
        "shown",
        "besides",
        "deduction",
        "anywhere",
        "offered",
        "within",
        "hobbes",
        "actual",
        "explanatory",
        "practice",
        "would",
        "give",
        "reason",
        "think",
        "hobbes",
        "understood",
        "use",
        "principle",
        "elsewhere",
        "work",
        "way",
        "likewise",
        "difficult",
        "make",
        "sense",
        "activity",
        "within",
        "hobbes",
        "actual",
        "practice",
        "adopt",
        "disunified",
        "view",
        "hobbes",
        "philosophy",
        "since",
        "using",
        "principle",
        "elsewhere",
        "system",
        "especially",
        "explicitly",
        "citing",
        "hobbes",
        "signaling",
        "part",
        "system",
        "fit",
        "together",
        "even",
        "strong",
        "reductive",
        "sense",
        "unified",
        "view",
        "next",
        "section",
        "describe",
        "hobbes",
        "view",
        "work",
        "first",
        "philosophy",
        "geometry",
        "must",
        "done",
        "prior",
        "experiment"
    ]
}